{"offset":0,"number":50,"available":6805,"news":[{"id":251843860,"title":"Recap: Exciting Start to the Republican National Convention","text":"The first night of the Republican National Convention begins in Milwaukee, Wisconsin, with an emphasis on “unity” in the aftermath of Saturday’s assassination attempt against former President Donald Trump. This afternoon, Trump announced Ohio Sen. J.D. Vance as his running mate. The 39-year-old senator from the Rust Belt—whose bestselling memoir Hillbilly Elegy was viewed by many as a chronicle of the forgotten men and women that Trump’s 2016 campaign and MAGA movement championed—is tied as the youngest Republican nominee for vice president in history with Richard Nixon, who was also a 39-year-old first term U.S. senator when President Dwight Eisenhower picked him as his running mate in 1952. Vance has been a rising star in the populist conservative movement and has shown himself to be a passionate advocate in the Senate for the working-class Americans who have been ignored by both parties. In 2021, – Editor-in-Chief Alex Marlow interviewed Vance at his home in Cincinnati: This is my 75-minute interview with @JDVance1 from 2021 from his historic home in Cincinnati.If you would like to get to know him, how he thinks, and what matters to him, I think you’ll appreciate this ==— Alex Marlow (@AlexMarlow) July 15, 2024 In the roll call vote today, Republican delegates gave Trump the GOP’s nomination for an historic third time, making him one of only six Americans to receive a major party’s nomination more than twice. The five others are Thomas Jefferson, Grover Cleveland, William Jennings Bryan, Franklin Roosevelt, and Richard Nixon. Among tonight’s scheduled speakers are reportedly: Sen. Ron Johnson (R-WI)Rep. Marjorie Taylor Greene (R-GA)Gov. Mark Robinson (R-NC)Rep. Wesley Hunt (R-TX)Rep. John James (R-MI)Sen. Katie Britt (R-AL)Sen. Tim Scott (R-SC)Gov. Glenn Youngkin (R-VA)Gov. Kristi Noem (R-SD)Rep. Byron Donalds (R-FL)Charlie Kirk, the executive director of Turning Point USASen. Marsha Blackburn (R-TN)Sean O’Brien, the president of the International Brotherhood of Teamsters Saturday’s assassination attempt has shaken an already unprecedented campaign pitting a sitting and former president against each other in a repeat of the last election. It also follows weeks of drama within the Democratic Party about replacing President Joe Biden as the nominee after his disastrous debate performance last month. And it comes after months—and years—of what Trump and Republicans have characterized as lawfare tactics waged against Trump by his political opponents, including Special Counsel Jack Smith’s classified documents case which was dismissed by a federal judge just this morning. In what looks unfortunately like an effort to big-foot the RNC coverage, Biden is scheduled to do a prime-time sit-down interview with NBC News’ Lester Holt at 9 p.m. Eastern this evening. If it proceeds like his interview with ABC News’ George Stephanopoulos, his declining poll numbers are unlikely to improve. NBC News posted a preview clip of it: In an exclusive interview with Lester Holt, President Biden said it was a mistake to use the word “bullseye” while discussing former President Trump, but said to “focus on what [Trump is] doing”. pic.twitter.com/TufdyiZq8v— NBC Nightly News with Lester Holt (@NBCNightlyNews) July 15, 2024 Since Saturday, Biden has attempted to re-orient his campaign messaging after an assassin’s bullet left Trump one inch away and one head turn away from death. The assassination attempt has left Democrats and their establishment media allies with no message to convey to a country exhausted by years of divisive rhetoric smearing Trump and the Americans who voted for him as deplorables, extremists, insurrectionists, racists, religious fanatics, traitors, and even terrorists. This demonizing rhetoric was ratcheted up exponentially by Biden, who centered his re-election bid on the message that Donald Trump is a Hitlerian existential threat to democracy and to the whole world—a characterization that by implication makes Trump a target for any would-be assassin incited to take out a dictator. After defiantly raising his fist in the face of death, Trump now has the ability to be something no one expected him to be—a uniter. Trump told the Washington Examiner that he re-wrote his convention speech to focus on unity after the assassination attempt. “It is a chance to bring the country together,” Trump said. “I was given that chance.” One thing seems certain: Trump has unified the Republican Party. -’s Joel Pollak, reporting from Milwaukee, notes that the mood inside the convention center is “jubilant,” but it’s “somewhat subdued among the anti-Trump protesters outside.” Follow – News for live updates below, all times Pacific. *** 4:56 p.m. PT Next up, North Carolina Lt. Gov. Mark Robinson takes the stage who says, “I am the first black lt. governor of North Carolina, and I intend to be the first black governor of North Carolina in November.” He gives his background, explaining how he lost two manufacturing jobs in North Carolina due to NAFTA, which he reminds people that Joe Biden voted for. “As governor, I will not forget where I came from.” He hails Trump’s record of protecting manufacturing jobs and fighting for American workers. This is a strong speech from a conservative star we will no doubt be seeing a lot of in the future. 4:47 p.m. PT MAGA favorite Rep. Marjorie “MTG” Taylor-Greene takes the stage and heralds Corey Comperatore, the firefighter and Trump supporter who died at the rally on Saturday while protecting his wife and children. She says “we will honor Corey’s memory” by building the country he wanted. She then throws down some red meat for the base, calling out the Democrats for celebrating Transgender Awareness Day on Easter Sunday and for having an economy calls out Democrats’ economy as “of, by, and for illegal aliens.” 4:27 p.m. PT Wisconsin Sen. Ron Johnson reminds the delegates that the Republican Party was started in the Badger State. Then he takes apart the Democratic Party’s policies: “Those forgotten Americans are forgotten no more. Republicans are the party of opportunity, liberty, and prosperity for all… We’ve repaired the damage caused by Democrats before. We’ll do it again.” 4:10 p.m. PT The Catholic Archbishop of Milwaukee Jerome Listecki opened the prime time coverage with a benediction. The first speaker will be Republican National Committee Chairman Michael Whatley, followed by Wisconsin Sen. Ron Johnson and George Rep. Marjorie Taylor-Greene.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe first night of the Republican National Convention begins in Milwaukee, Wisconsin,&#8230;\n\n\nThis Post: Recap: Exciting Start to the Republican National Convention first appeared on Internewscast Journal","url":"https://internewscast.com/news/recap-exciting-start-to-the-republican-national-convention/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Livewire-Night-One-of-the-Republican-National.png","video":null,"publish_date":"2024-07-16 00:06:21","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.3},{"id":251844008,"title":"President Biden says it was a ‘mistake’ to say he wanted to put a ‘bull’s-eye’ on Trump","text":"WASHINGTON (AP) — President Joe Biden told NBC News in an interview Monday that it was a “mistake” to say he wanted to put a “bull’s-eye” on Republican nominee Donald Trump, but argued that the rhetoric from his opponent was more incendiary while warning that Trump remained a threat to democratic institutions. Those remarks from Biden came during a private call with donors last week as the Democrat had been scrambling to shore up his imperiled candidacy with key party constituencies. During that conversation, Biden declared that he was “done” talking about his poor debate performance and that it was “time to put Trump in the bull’s-eye,” saying Trump has gotten far too little scrutiny on his stances, rhetoric and lack of campaigning. The NBC interview came as Biden and his reelection team prepared to resume full-throttle campaigning after a brief pause following the weekend assassination attempt on Trump. The president and his campaign let loose a flurry of criticism after the GOP nominee announced freshman Sen. JD Vance of Ohio as his running mate. “He’s a clone of Trump on the issues,” Biden told reporters as he headed to Nevada for a series of speeches and campaign events. “I don’t see any difference.” Once Vance was tapped as Trump’s vice-presidential pick, the Biden campaign hit send on a fundraising solicitation signed by the president, and his team issued a blistering statement, saying he picked the freshman senator because he would “bend over backwards to enable Trump and his extreme MAGA agenda.” For her part, Vice President Kamala Harris phoned Vance to congratulate him and left him a voicemail message, according to a person familiar with the matter. And to NBC anchor Lester Holt, Biden made it clear that he would keep up his focus on Trump. While he acknowledged his “mistake,” Biden nonetheless said he is “not the guy who said I wanted to be a dictator on day one” and that he wanted the focus to be on what Trump was saying. It’s Trump, not Biden, who engages in that kind of rhetoric, Biden said, referring to Trump’s past comments about a “bloodbath” if the Republican loses to Biden in November. “Look, how do you talk about the threat to democracy, which is real, when a president says things like he says?” Biden said. “Do you just not say anything because it may incite somebody?” The NBC interview, scheduled before the attempt on Trump’s life at a rally in Pennsylvania, had been part of Biden’s broader strategy to prove his fitness for office after angst grew among Democrats because of his disastrous June 27 debate performance. The Biden campaign recalibrated some of its political plans in the immediate aftermath of the assassination attempt on Saturday, pulling advertising off the air and hitting pause on messaging. The White House also scrapped Biden’s planned Monday visit to the Lyndon B. Johnson library, where he had been slated to deliver remarks on civil rights. Biden also spoke privately to Trump after the assassination attempt, a call that the president described in the NBC interview as “very cordial.” “I told him how concerned I was and wanted to make sure I knew how he was actually doing,” Biden said. “He sounded good. He said he was fine and he thanked me for calling. I told him it was literally in the prayers of Jill and me, and I hoped his whole family was weathering this.” It’s still not finalized when Biden’s campaign ads will resume airing. But Biden is pressing on with the Nevada portion of his previously scheduled western swing, which will include remarks to the NAACP and UnidosUS, a Latino civil rights and advocacy group. He’ll also headline what’s been billed as a “campaign community event” on Wednesday in Las Vegas. Biden has acknowledged that his candidacy and agenda will be under attack at the Republican National Convention this week, and aides had felt no need to halt their campaign completely, particularly while Biden comes under scrutiny in Milwaukee. Asked whether Biden would adjust his messaging this week in light of the assassination attempt, O’Malley Dillon pointed to his Oval Office address as a “roadmap for the whole country,” which she said was no different than Biden’s broader message from the start of his candidacy. “You’re going to hear the president continue to make his affirmative agenda clear,” she said. “Not just in abstract terms, but very specifically on how it continues to help the American people versus this very negative point of view and extreme agenda that the American people have already said that they don’t want.” Biden’s renewed campaigning this week comes as Democrats have been at an impasse over whether the incumbent president should continue in the race even as he was defiant that he would stay in. Biden has made it clear in no uncertain terms that he remains in the race, and aides have been operating as such. It was unclear if the attempt on Trump’s life would blunt Democratic efforts to urge Biden to step aside, but it appears to have stalled some of the momentum, for now. No Democrats have called for him to exit the race since the shooting Saturday night. In the hours before the shooting, Biden was still being confronted by frustration and skepticism from Democratic lawmakers. Rep. Jared Huffman of California said he asked the president during his meeting with the Congressional Progressive Caucus about objectively assessing the trajectory of the race, and if the Lord almighty doesn’t intervene would Biden consider “the best earthly alternative”: meeting with former Presidents Obama and Clinton, Democratic leadership including Rep. Hakeem Jeffries and Sen. Chuck Schumer, and former Speaker Nancy Pelosi “to seek their advice.” Huffman said on a social media post that Biden “disagreed with the notion that we are on a losing trajectory.” And while Biden expressed a “willingness to listen” to other voices, Huffman said he doubted any would be persuasive. “I continue to believe a major course correction is needed, and that the President and his team have yet to fully acknowledge the problem, much less correct it,” he said. But now, several Democrats who requested anonymity were skeptical that there would be enough drive among lawmakers to successfully try to pressure Biden not to run, especially because they are scattered and away from Washington until next week and because Biden has said he won’t step aside and seized the opportunity to quickly respond to the shooting over the weekend. The people requested anonymity to characterize private conversations. Asked by Holt if he has weathered the worst of it from his own party, Biden responded that 14 million Democratic voters selected him through the primaries and added, “I listen to them.” His mental acuity is “pretty damn good,” Biden added, but he said the question of his age was “legitimate” to ask. Many in the Democratic Party had been looking to congressional leaders Jeffries and Schumer to voice concerns directly to the president. Jeffries met with Biden at the White House on Thursday night, while Schumer went to Rehoboth Beach, Delaware, on Saturday for his visit with Biden, which occurred just before the assassination attempt on Trump. There were still deep concerns that Biden is not up to the job and a sense that pressure to try and find another candidate could ramp up again when lawmakers return to Washington. Congressional Democrats were watching the Republican National Convention and Biden’s appearances this week with awareness that the dynamics could change — again. ___ By Seung Min Kim, Aamer Madhani and Mary Clare Jalonick Associated Press AP Congressional Correspondent Lisa Mascaro and AP White House correspondent Zeke Miller contributed to this report.","summary":"President Joe Biden told NBC News in an interview airing Monday that it was a “mistake” to say he wanted to put a “bull’s-eye” on Republican nominee Donald Trump, but argued that the rhetoric coming from his opponent was more incendiary.","url":"https://www.cleveland.com/nation/2024/07/president-biden-says-it-was-a-mistake-to-say-he-wanted-to-put-a-bulls-eye-on-trump.html","image":"https://www.cleveland.com/resizer/v2/5UAFDP3HVVDANFAMTDIJCRIEVY.jpg?auth=9f21550fd54956cadab87383c6860a00a2a4caac10d847370649a819718fd815&width=1280&quality=90","video":null,"publish_date":"2024-07-16 00:05:04","author":"The Associated Press","authors":["The Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.593},{"id":251843702,"title":"Gunman acted alone: FBI","text":"MILWAUKEE, July 15: The gunman who shot at former President Donald Trump during an election rally in Pennsylvania on Saturday appears to have acted alone, according to the FBI, which is investigating it as a potential “domestic terrorism” act. Follow the Daily Excelsior channel on WhatsApp The gunman has been identified as Thomas Matthew Crooks (20). “At this point in the investigation, it appears that he was a lone actor, but we still have more investigation to go,” said Robert Wells, the executive assistant director of the FBI’s National Security Branch. The FBI, he said, is investigating this as an assassination attempt,” and also as a “potential domestic terrorism act.” The counterterrorism division and criminal divisions are working jointly together to determine the motive, he added. The FBI is leading the investigation into the assassination attempt of Trump at an election rally in Pennsylvania. Trump was hit with a bullet that pierced the upper part of his right ear. He is now safe and is continuing with his schedule that includes travelling to Milwaukee to attend the Republican National Convention, which would formally nominate him as the party’s Presidential nominee against incumbent Joe Biden. “The shooter may be deceased, but the investigation is very much ongoing. And, because of that, we are limited in what we say at this point,” FBI Director Christopher Wray said. “What we witnessed yesterday was nothing short of an attack on democracy and our democratic process,” he told reporters at a news conference in Washington DC. According to an FBI official, the investigation into the gunman at Donald Trump’s rally Saturday has not yet turned up any mental health issues, threatening posts or other motives, but cautioned it was still early. The shooter, as per FBI, used an AR-style rifle chambered in 5.56mm, a common calibre for such weapons. The New York Times said authorities were scouring the gunman’s social media and other property as they sought to determine a motive for the attack. Biden is likely to address the nation at 8 pm from the Oval Office. He will give “a forceful and needed address to update the nation on the horrifying attack on Donald Trump and the need for every American to come together to not just condemn, but put to an end political violence in this country once and for all,” a campaign official told the daily. Crooks graduated from the Community College of Allegheny County two months ago, earning an associate degree in engineering science, school officials said in a statement, adding that they were “shocked and saddened by the horrific turn of events.” Kimberly Cheatle, director of the Secret Service, in a memo to her agents said “the attempted assassination of former President Trump in Butler, Pennsylvania, is a moment that will forever be remembered in history.” (PTI)","summary":"MILWAUKEE, July 15: The gunman who shot at former President Donald Trump during an election rally in Pennsylvania on Saturday appears to have acted alone, according to the FBI, which is investigating it as a potential &#8220;domestic terrorism&#8221; act. Follow the Daily Excelsior channel on WhatsApp  The gunman has been identified as Thomas Matthew Crooks (20). &#8220;At this point in the investigation, it appears that he was a lone actor, but we still have more investigation to go,&#8221; said Robert [&#8230;]\n\n\nThe post Gunman acted alone: FBI appeared first on Daily Excelsior.","url":"https://www.dailyexcelsior.com/gunman-acted-alone-fbi/","image":"https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2024/07/gunam.jpg","video":null,"publish_date":"2024-07-16 00:01:15","author":"Daily Excelsior","authors":["Daily Excelsior"],"language":"en","source_country":"in","sentiment":-0.332},{"id":251844070,"title":"Unsinkable: Trump Riding Wave Of Wins","text":"After dodging a bullet at a rally and seeing the US Supreme Court bolster his presidential immunity claims this month, Donald Trump was handed another gift Monday: the dismissal of his classified documents case. As the only president ever to be twice impeached -- and twice acquitted -- and the country's only ex-president convicted of criminal charges, the septuagenarian has often struggled to stay afloat. His blunders, multitude of scandals and vitriolic statements have shocked millions of Americans. Many heads of state see him as a danger to global stability and the fight against global warming, and he has stood accused of indulging far-right groups and disparaging immigrants. But each time he is said to be sunk, he roars back to the surface, and this week he is heading into Milwaukee riding very high. On Thursday the Republican National Convention will overlook Trump's vows of vengeance against his political enemies and swat aside his various legal woes to formally nominate him as the party's flagbearer going into the November election against President Joe Biden. Trump, the brash billionaire who burst onto the political landscape a decade ago as a super disruptor and champion of conservatives, appears unstoppable. \"It sure seems he's on a roll,\" Texas alternate delegate Orlando Dona, wearing Trump pins and a straw-colored cowboy hat, told AFP. The 64-year-old Dona, like many conservatives, believes the various cases against Trump have been politically motivated, \"and he is coming out of all this justified.\" As for the shooting, some are chalking it up to divine intervention. \"I personally think it was the hand of God,\" Wisconsin former governor Scott Walker told AFP at the convention. Walker, who ran for president against Trump briefly in 2016, said Trump the man has earned a reputation for taking on anything. \"He's never going to stop being a fighter,\" he said. \"And I think people here realize he's fighting for them, and these wins are not just about wins for him, they're wins for the American people.\" - 'A lot of obstacles' - Trump earned the nickname \"Teflon Don\" for weathering a multitude of storms. The #MeToo movement precipitated the downfall of dozens of powerful Americans. Not Trump, despite multiple accusations of sexual abuse, a 2023 civil trial finding of liability for the sexual assault of writer E. Jean Carroll, and an alleged affair with pornographic actress Stormy Daniels. After an explosive \"Access Hollywood\" tape emerged in 2016 in which Trump makes degrading remarks about women and boasted about groping their genitals, some Republican heavyweights withdrew their support, and he was predicted to lose the female vote. That collapse didn't happen, and he won the White House a month later. Now, it appears he will pull off another miracle, avoiding three of the four lawsuits he had been facing before the election. \"If the story of even the last 18 months teaches us anything, there were a lot of obstacles that were put up to president Trump, and the fact that he's gotten through them shows, I think, part of what gives me faith in this country,\" businessman and former 2024 Vivek Ramaswamy told reporters at the convention. \"As Martin Luther King said, the arc of history is long but it bends towards justice,\" Ramaswamy said. \"I believe that's exactly what it is doing in recent months, days, and over the last year of president Trump's journey as well.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"After dodging a bullet at a rally and seeing the US Supreme Court bolster his presidential immunity claims this month, Donald Trump was handed another gift Monday: the dismissal of his classified documents case.","url":"https://nation.lk/online/unsinkable-trump-riding-wave-of-wins-270891.html","image":"https://c.ndtvimg.com/2024-06/trbnmngo_donald-trump_625x300_02_June_24.jpeg","video":null,"publish_date":"2024-07-16 00:00:10","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.191},{"id":251844402,"title":"Jim Cramer names stocks that could rally, or fall, during a second Trump presidency","text":"CNBC's Jim Cramer on Monday named stocks that could stand to see gains if Donald Trump returns to the White House, as well as ones that may notch losses — even as he conceded that the former president's moves can be difficult to predict. \"After this weekend, it sure seems like the Trump stocks are back,\" he said. \"Just keep in mind that plenty of companies are great enough to transcend politics, and sometimes what counts as a Trump stock can change on a dime.\" Cramer said he is not trying to predict the results of the election, but asserted that Saturday's assassination attempt has made many believe that Trump is more likely to win against President Joe Biden in the fall. Monday's buyers seemed to agree with this assessment, with many betting on stocks poised to do well under a Republican administration. Trump will likely be more lenient when it comes to mergers and acquisitions than Biden, according to Cramer. Big investment banks can be levered to the success of mergers, Cramer said, so investors should pay attention to outfits like JPMorgan, Goldman Sachs, Morgan Stanley and Bank of America, all of which saw gains Monday. He also suggested that the Trump administration would let Kroger acquire Albertsons and Tapestry snap up Capri, deals the Biden administration has tried to block. According to Cramer, investors may want to avoid stocks related to saving the environment. During the first Trump administration, the government rolled back more than 100 environmental policies, according to The New York Times. If government subsidies get taken away, Cramer said companies like Enphase, SolarEdge, Sunrun and Sunnova — all of which were down by Monday's close — could see earnings take a hit. \"Eight years ago, in a moment gripped by political fever, I put a button on my sound board that said 'Trump stock, Trump stock,' he said. \"After this weekend's events, it looks like I have to bring it back.\"","summary":"CNBC's Jim Cramer told investors which stocks could stand to see gains if Donald Trump returns to the White House, as well as ones that may notch losses.","url":"https://www.cnbc.com/2024/07/15/cramer-names-stocks-that-could-rally-or-fall-if-trump-wins-in-2024.html","image":"https://image.cnbcfm.com/api/v1/image/107083445-1656625558127-IMG_1723b.jpg?v=1695682524","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2024/M07D15/7000345762/MM-A-071524-short_L.mp4","publish_date":"2024-07-15 23:55:06","author":"Julie Coleman","authors":["Julie Coleman"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.374},{"id":251843558,"title":"Wife of dead rally-goer says she hasn’t heard from Trump — but won’t take Biden’s call","text":"Since Corey Comperatore was shot and killed by a now deceased gunman during Donald Trump's Butler, Pennsylvania rally Saturday, July 13, the former fire chief's family has yet to hear from the ex-president, according to his wife, Helen Comperatore. Per TODAY, Corey \"Comperatore was an avid Trump supporter who was at the event with his wife and two daughters when shots rang out. He dove on his loved ones to protect them,\" Helen Comperatore told Pennsylvania Democratic Governor Josh Shapiro. Helen Comperatore shared more in an interview with New York Post Monday, according to CNN. READ MORE: Far-right 'extremists seizing on' Trump rally shooting: 'Really dangerous rhetoric' CNN reports: Helen told the Post that President Joe Biden tried to call her, but she declined to speak to him since her husband 'was a devout Republican, and he would not have wanted me to talk to him.' But she added that she does not hold the current president responsible for what happened to her family. 'I don’t have any ill will towards Joe Biden,' she said. 'I’m not one of those people that gets involved in politics. I support Trump, that’s who I’m voting for, but I don’t have ill-will towards Biden.' 'He didn’t do anything to my husband. A 20-year-old despicable kid did,' she continued. She told the Post, \"Me and the kids were all there as a family,\" adding that her husband \"was just excited.\" \"It was going to be a nice day with the family,\" she continued. \"It was a bad day.\" The Washington Post reported, \"Trump has not made any public remarks since the Secret Service rushed him offstage shortly after shots were fired at his rally in Butler, Pa., around 6:12 p.m. on Saturday.\" READ MORE: 'Nothing else is appropriate': Nancy Pelosi praised for 'class act response' to Trump rally shooting Far-right social media influencer Michael Solakiewicz posted to TikTok on Sunday a video, writing, \"President Donald Trump playing golf today at Trump National Golf Club Bedminster! TRUMP 2024!\"","summary":"Since Corey Comperatore was shot and killed by a now deceased gunman during Donald Trump's Butler, Pennsylvania rally Saturday, July 13, the former fire chief's family has yet to hear from the ex-president, according to his wife, Helen Comperatore.\n\nPer TODAY, Corey \"Comperatore was an avid Trump supporter who was at the event with his wife and two daughters when shots rang out. He dove on his loved ones to protect them,\" Helen Comperatore told Pennsylvania Democratic Governor Josh Shapiro.\n\nHelen Comperatore shared more in an interview with New York Post Monday, according to CNN.\n\nREAD MORE: Far-right 'extremists seizing on' Trump rally shooting: 'Really dangerous rhetoric'\n\nCNN reports:\n\n\nHelen told the Post that President Joe Biden tried to call her, but she declined to speak to him since her husband 'was a devout Republican, and he would not have wanted me to talk to him.'\n\nBut she added that she does not hold the current president responsible for what happened to her family.\n\n'I don’t have any ill will t","url":"https://www.alternet.org/wife-rally-goer-biden/","image":"https://www.alternet.org/media-library/image.jpg?id=52690938&width=1200&height=600&coordinates=0%2C0%2C0%2C83","video":null,"publish_date":"2024-07-15 23:52:27","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","source_country":"US","sentiment":-0.397},{"id":251843982,"title":"Border arrests plunge 29% in June to the lowest of Biden’s presidency as asylum halt takes hold","text":"SAN DIEGO (AP) — Arrests for illegally crossing the border from Mexico plunged 29% in June, the lowest month of Joe Biden’s presidency, according to figures released Monday that provide another window on the impact of a new rule to temporarily suspend asylum. Arrests totaled 83,536 in June, down from 117,901 in May to mark the lowest tally since January 2021, U.S. Customs and Border Protection said. A seven-day average of daily arrests fell more than half by the end of June from Biden’s announcement on June 4 that asylum processing would be halted when daily arrests reach 2,500, which they did immediately, said Troy Miller, acting Customs and Border Protection commissioner. “Recent border security measures have made a meaningful impact on our ability to impose consequences for those crossing unlawfully,” Miller said. Arrests had already fallen by more than half from a record high of 250,000 in December, largely a result of increased enforcement by Mexican authorities, according to U.S. officials. Sharp declines registered across nationalities, including Mexicans, who have been most affected by the suspension of asylum, and Chinese people, who generally fly to Ecuador and travel to the U.S. border over land. San Diego was the busiest of the Border Patrol’s nine sectors bordering Mexico by number of arrests, followed by Tucson, Arizona. More than 41,000 people entered legally through an online appointment app called CBP One in June. The agency said 680,500 people have successfully scheduled appointments since the app was introduced in January 2023. Nearly 500,000 people from four countries entered on a policy to allow two-year stays on condition they have financial sponsors and arrive at an airport. They include 104,130 Cubans, 194,027 Haitians, 86,101 Nicaraguans and 110,541 Venezuelans, according to CBP. The Associated Press","summary":"SAN DIEGO (AP) — Arrests for illegally crossing the border from Mexico plunged 29% in June, the lowest month of Joe Biden&#8217;s presidency, according to figures released Monday that provide another window on the impact of a new rule to temporarily suspend asylum. Arrests totaled 83,536 in June, down from 117,901 in May to mark [&#8230;]","url":"https://toronto.citynews.ca/2024/07/15/border-arrests-plunge-29-in-june-to-the-lowest-of-bidens-presidency-as-asylum-halt-takes-hold/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/03/25/TitleCards_CityNews_1920x1080.jpg","video":null,"publish_date":"2024-07-15 23:51:49","author":"News Staff,The Associated Press","authors":["News Staff","The Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.28},{"id":251843766,"title":"Border arrests plunge 29% in June to the lowest of Biden’s presidency as asylum halt takes hold","text":"SAN DIEGO (AP) — Arrests for illegally crossing the border from Mexico plunged 29% in June, the lowest month of Joe Biden’s presidency, according to figures released Monday that provide another window on the impact of a new rule to temporarily suspend asylum. Arrests totaled 83,536 in June, down from 117,901 in May to mark the lowest tally since January 2021, U.S. Customs and Border Protection said. A seven-day average of daily arrests fell more than half by the end of June from Biden’s announcement on June 4 that asylum processing would be halted when daily arrests reach 2,500, which they did immediately, said Troy Miller, acting Customs and Border Protection commissioner. “Recent border security measures have made a meaningful impact on our ability to impose consequences for those crossing unlawfully,” Miller said. Arrests had already fallen by more than half from a record high of 250,000 in December, largely a result of increased enforcement by Mexican authorities, according to U.S. officials. Sharp declines registered across nationalities, including Mexicans, who have been most affected by the suspension of asylum, and Chinese people, who generally fly to Ecuador and travel to the U.S. border over land. San Diego was the busiest of the Border Patrol’s nine sectors bordering Mexico by number of arrests, followed by Tucson, Arizona. More than 41,000 people entered legally through an online appointment app called CBP One in June. The agency said 680,500 people have successfully scheduled appointments since the app was introduced in January 2023. Nearly 500,000 people from four countries entered on a policy to allow two-year stays on condition they have financial sponsors and arrive at an airport. They include 104,130 Cubans, 194,027 Haitians, 86,101 Nicaraguans and 110,541 Venezuelans, according to CBP.","summary":"SAN DIEGO (AP) &#8212; Arrests for illegally crossing the border from Mexico plunged 29% in June, the lowest month of Joe Biden&#8217;s presidency, according to figures released Monday that provide another window on the impact of a new rule to temporarily suspend asylum. Arrests totaled 83,536 in June, down from 117,901 in May to mark [&#8230;]","url":"https://www.twincities.com/2024/07/15/border-arrests-plunge-29-in-june-to-the-lowest-of-bidens-presidency-as-asylum-halt-takes-hold-2/","image":"https://www.twincities.com/wp-content/uploads/2020/08/TCFallback.jpg","video":null,"publish_date":"2024-07-15 23:50:24","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.222},{"id":251843770,"title":"Border arrests plunge 29% in June to the lowest of Biden’s presidency as asylum halt takes hold","text":"SAN DIEGO (AP) — Arrests for illegally crossing the border from Mexico plunged 29% in June, the lowest month of Joe Biden’s presidency, according to figures released Monday that provide another window on the impact of a new rule to temporarily suspend asylum. Arrests totaled 83,536 in June, down from 117,901 in May to mark the lowest tally since January 2021, U.S. Customs and Border Protection said. A seven-day average of daily arrests fell more than half by the end of June from Biden’s announcement on June 4 that asylum processing would be halted when daily arrests reach 2,500, which they did immediately, said Troy Miller, acting Customs and Border Protection commissioner. “Recent border security measures have made a meaningful impact on our ability to impose consequences for those crossing unlawfully,” Miller said. Arrests had already fallen by more than half from a record high of 250,000 in December, largely a result of increased enforcement by Mexican authorities, according to U.S. officials. Sharp declines registered across nationalities, including Mexicans, who have been most affected by the suspension of asylum, and Chinese people, who generally fly to Ecuador and travel to the U.S. border over land. San Diego was the busiest of the Border Patrol’s nine sectors bordering Mexico by number of arrests, followed by Tucson, Arizona. More than 41,000 people entered legally through an online appointment app called CBP One in June. The agency said 680,500 people have successfully scheduled appointments since the app was introduced in January 2023. Nearly 500,000 people from four countries entered on a policy to allow two-year stays on condition they have financial sponsors and arrive at an airport. They include 104,130 Cubans, 194,027 Haitians, 86,101 Nicaraguans and 110,541 Venezuelans, according to CBP.","summary":"SAN DIEGO (AP) &#8212; Arrests for illegally crossing the border from Mexico plunged 29% in June, the lowest month of Joe Biden&#8217;s presidency, according to figures released Monday that provide another window on the impact of a new rule to temporarily suspend asylum. Arrests totaled 83,536 in June, down from 117,901 in May to mark [&#8230;]","url":"https://www.bostonherald.com/2024/07/15/border-arrests-plunge-29-in-june-to-the-lowest-of-bidens-presidency-as-asylum-halt-takes-hold-2/","image":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","video":null,"publish_date":"2024-07-15 23:50:24","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.222},{"id":251843356,"title":"MassGOP reports mood of ‘perseverance’ at convention","text":"The first day of the Republican National Convention was Monday, and the attendees in the room were jubilant and celebratory as the party looked forward to reanointing former President Donald Trump and getting behind the newly nominated 2024 ticket. That’s a sharp break from Sunday, when the party and the nation were reeling from the assassination attempt made against the 45th President and Republican nominee. MassGOP Executive Director John Milligan told the Herald that delegates were “very excited” to be at the convention, despite the weekend’s events. MassGOP Chairwoman Amy Carnevale said the “mood in Milwaukee is one of perseverance.” “The fact that there was an assassination attempt of our nominee just ahead of the nominating convention is certainly unnerving to all Americans,” the Carnevale told the Herald through a spokesperson. “However, President Trump has signaled to Republicans that we must push forward stronger than ever.” Monday’s session was taken up with the business of nominating Trump along with his newly named running mate, Ohio’s U.S. Sen. J.D. Vance. The convention runs for four days, and Trump is scheduled to speak Thursday. Trump has apparently re-written his address following Saturday’s shooting to soften the tone, but according to Carnevale the party’s message is unchanged. “Republicans are united and resolute in our determination to defeat Joe Biden in November,” she said. Trump Campaign Senior Advisors Susie Wiles and Chris LaCivita said in a joint statement that Monday’s nomination of Trump and Vance represents the “most unifying and competitive ticket in political history.” “After President Trump secured the Republican nomination in record time, enthusiasm continues to grow for his movement to Make America Great Again, and we will deliver a sweeping victory for the Trump-Vance ticket on November 5,” they said.","summary":"\"Republicans are united and resolute in our determination to defeat Joe Biden in November,\" MassGOP Chair Amy Carnevale said.","url":"https://www.bostonherald.com/2024/07/15/massgop-reports-mood-of-perseverance-at-convention/","image":"https://www.bostonherald.com/wp-content/uploads/2024/07/GettyImages-2162158932.jpg?w=1024","video":null,"publish_date":"2024-07-15 23:48:35","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","source_country":"US","sentiment":0.121},{"id":251843352,"title":"Social media posts after Trump's attempted assassination lead to firings, resignations locally","text":"The aftermath of the attempted assassination of Donald Trump in western Pennsylvania on Saturday was a reminder of how ugly social media can be and that thoughts posted online for the world to see can have real-life consequences — like costing people their jobs. Three people in public positions in Delaware County, Pennsylvania, and leader of a nonpartisan voting-rights organization in Atlantic County, New Jersey, are among those out of work, either by firing or resigning, since the shootings at Trump's rally in Butler Township. The former president was struck in the ear by a bullet that 20-year-old Thomas Matthew Crooks fired from a nearby rooftop. Another man in the crowd, Corey Comperatore, was shot and killed and two others, David Dutch and James Copenhaver, were injured by gunfire. A Secret Service sniper stationed on another roof shot and killed Crooks before Trump was led off the stage and the shocking news began to spread around the world. MORE: Mike Jerrick says recent absence from 'Good Day Philadelphia' was to recover from prostate cancer surgery About an hour after the shooting, Upper Darby council member Jess Branas, posted on her personal Facebook page, \"A for effort.\" Branas' post was picked up by Libs of TikTok on X, formerly Twitter, an influential conservative account whose posts are \"designed to generate outrage\" on the right. Branas, a Democrat who also worked as an aide for state Rep. Heather Boyd, lost her Harrisburg job in the fallout of her Facebook post, she told the Delaware County Daily Times. She claimed the post was not in reference to the assassination attempt but about burning steaks she had been grilling with friends. \"It was taken out of context,\" said Branas, who said she received hundreds of comments harassing her after her post went viral. Boyd didn't mention Branas by name, but wrote on X that the matter had been \"dealt with swiftly.\" In Prospect Park, Jim Simmonds, the borough's fire chief and fire marshal resigned Sunday night amid backlash to his Facebook post that read, \"A little to the right next time please.\" The post has since been deleted. The fire company accepted Simmonds resignation and shared a link to a GoFundMe page to support the family of Comperatore, who was a former volunteer fire chief in Buffalo Township, Butler County. \"The Prospect Park Fire Company does not condone this type of behavior by our members or our leadership\" chairman Joe Magee said. \"We are deeply saddened by Chief Simmonds comments and agreed that it would be best if he stepped down in his role as Chief.\" In Radnor, Sierra Clark, secretary of the board of the Wayne Business Association, resigned after commenting, \"I hope he dies,\" on a post about the shooting. \"We were made aware last night that one of our board members expressed troubling thoughts through her social media posts,\" WBA leaders said. \"We sincerely apologize for any harm or offense caused by these posts. We have no tolerance for this type of messaging, and it in no way represents what the Wayne Business Association stands for, nor the views of our board and membership.\" And in New Jersey, the Globe reported Sunday that Victoria Druding from the Atlantic County chapter of the League of Women Voters resigned after writing to social media: \"Trump was shot!!! Unfortunately, he was only grazed.\" Druding initially said she would resign, but then tried to walk it back. She deleted the post on Sunday and called it a \"stupid error in judgment,\" but by then a number of local leaders had seen and shared what she wrote. \"This lady is the head of Atlantic County League of Women Voters! And people question why no one wants to get involved with them. She should be ashamed of her comments,\" said Don Purdy, the Atlantic County chair of the Republican Party and he shared a screen shot of Druding's deleted post In a statement, the executive director of the League of Women Voters of New Jersey condemned Druding's post calling it \"inexcusable\" and not representative of the values of the voting organization. Political leaders have spent the last two days urging Americans to tone down their partisan language. \"There is no place in America for this kind of violence or for any violence ever. Period. No exceptions. We can't allow this violence to be normalized,\" President Joe Biden said during a televised address from the Oval Office on Sunday night. \"You know, the political rhetoric in this country has gotten very heated. It's time to cool it down. And we all have a responsibility to do that.\"","summary":"The attempted assassination of former Donald Trump in Pennsylvania prompted reactions and conspiracy theories on social media in the hours after the shooting on Saturday. Some of those remarks have cost people their jobs. Three Delaware County officials and a leader in Atlantic County, New Jersey have been fired or resigned as a results of comments they posted online.","url":"https://www.phillyvoice.com/social-media-trump-assassination-attempt-delco-fired-resigned-atlantic-county/","image":"https://media.phillyvoice.com/media/images/71524_Trump_Shooting_Butler.2e16d0ba.fill-1200x630-c0.jpg","video":null,"publish_date":"2024-07-15 23:48:03","author":"Michael Tanenbaum","authors":["Michael Tanenbaum"],"language":"en","source_country":"us","sentiment":-0.029},{"id":251843894,"title":"Widow of firefighter killed at Trump rally shooting refuses to take Biden call: 'He would not have wanted me to talk to him'","text":"The widow of the firefighter who was shot and killed during the assassination attempt against former President Donald Trump said she rejected a phone call from President Joe Biden because that's what her husband would have wanted. 'He didn’t do anything bad to my husband. A 20-year-old despicable kid did.' Helen Comperatore told the New York Post that Biden tried to call her after the death of her husband, Corey Comperatore, at the Trump rally in Butler, Pennsylvania, on Saturday. “I didn’t talk to Biden,” she said on Monday. “I didn’t want to talk to him. My husband was a devout Republican, and he would not have wanted me to talk to him.” Her husband was killed, and two others were seriously injured when Thomas Matthew Crooks allegedly tried to assassinate former President Donald Trump while he spoke at the rally. She went on to say that she didn't blame Biden for the death of her husband. “I don’t have any ill will towards Joe Biden. I’m not one of those people that gets involved in politics,\" she said. “I support Trump. That’s who I’m voting for, but I don’t have ill will towards Biden,” she added. “He didn’t do anything bad to my husband. A 20-year-old despicable kid did.” Corey Comperatore was praised as a hero after his daughter said that he died trying to protect her and the rest of his family at the rally. \"He shielded my body from the bullet that came at us. He loved his family. He truly loved us enough to take a real bullet for us,\" wrote Allyson Comperatore, the victim's daughter. Like Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"The widow of the firefighter who was shot and killed during the assassination attempt against former President Donald Trump said she rejected a phone call from President Joe Biden because that's what her husband would have wanted.\n\n'He didn’t do anything bad to my husband. A 20-year-old despicable kid did.' \n\nHelen Comperatore told the New York Post that Biden tried to call her after the death of her husband, Corey Comperatore, at the Trump rally in Butler, Pennsylvania, on Saturday. \n\n“I didn’t talk to Biden,” she said on Monday. “I didn’t want to talk to him. My husband was a devout Republican, and he would not have wanted me to talk to him.” \n\nHer husband was killed, and two others were seriously injured when Thomas Matthew Crooks allegedly tried to assassinate former President Donald Trump while he spoke at the rally. \n\nShe went on to say that she didn't blame Biden for the death of her husband. \n\n“I don’t have any ill will towards Joe Biden. I’m not one of those people that gets involved in politics,\" sh","url":"https://www.theblaze.com/news/comperatore-widow-refuses-biden-call","image":"https://www.theblaze.com/media-library/image.jpg?id=52685642&width=1200&height=600&coordinates=0%2C333%2C0%2C0","video":null,"publish_date":"2024-07-15 23:45:00","author":"Blaze News","authors":["Blaze News"],"language":"en","source_country":"US","sentiment":-0.357},{"id":251843246,"title":"Joe Biden says 'mental acuity has been pretty damn good' during NBC interview","text":"July 15 (UPI) -- Joe Biden remains insistent he's staying in the race for another four years as the nation's oldest president, saying his \"mental acuity has been pretty damn good,\" during an interview with NBC News anchor Lester Holt on Monday. Holt interviewed the president at the White House on Monday afternoon. The network aired excerpts on NBC and MSNBC with the full interview to be broadcast at 9 p.m. Biden isn't backing down despite some Democrats, including members of Congress, governors, donors and media commentators, saying he should step down in the race against former President Don Trump. \"I listen to them,\" he said about the voters who selected him to be their nominee during the primaries and caucuses. Pressed on whether he has the stamina and cognition to be president for another four years, he said: \"I'm old. But I'm only three years older than Trump, number one. And number two, my mental acuity has been pretty damn good. I've gotten more done than any president has in a long time in three-and-a-half years. I'm willing to be judged on that. \"I understand why people say, 'God, he's 81 years old. Whoa. What's he gonna be when he's 83 years old, 84 years?' It's a legitimate question to ask.\" When asked whom he consults when deciding to stay in the race or dropping out, he responded: \"Me. I've been doing this a long time.\" Biden was interviewed by ABC anchor George Stephanopoulos on July 5 in Madison, Wis., hours after a campaign stop there and one week after his poor debate performance with Trump. Biden also has appeared at a rally in Michigan. The interview was Biden's first since his rival, former President Donald Trump, was wounded Saturday night during a campaign rally in Butler, Pa. Biden was asked about telling donors: \"We're done talking about the debate, it's time to put Trump in a bullseye.\" \"Look, the truth of the matter was, what I guess I was talking about at the time was there was very little focus on Trump's agenda.\" Holt said: \"Yeah, the term was 'bulls-eye'.\" \"It was a mistake to use the word -- I didn't say crosshairs, I meant bulls-eye, I meant focus on him, focus on what he's doing,\" Biden said. The president then mentioned Trump's comments and actions. \"I'm not the guy that said, 'I want to be a dictator on day one.' I'm not the guy that refused to accept the outcome of the election. ... You can't only love your country when you win. And so the focus was on what he's saying,\" he said. And he said: \"I am not engaged in that rhetoric. Now my opponent is engaged in that rhetoric: He talks about it'll be a bloodbath if he loses, talking about how he's going to forgive all the actions, I guess suspend the sentences of all those who were arrested and sentenced to go to jail because of what happened in the Capitol. I'm not out there making fun of like when, remember the picture of Donald Trump when Nancy Pelosi's husband was hit with a hammer going -- talking -- joking about it?\" On Sunday from the Oval Office, he called on Americans to \"lower the temperature\" of the campaign. Monday's interview was conducted after Trump named Ohio Sen. J.D. Vance as his running mate. \"It's not unusual, he's going to surround himself with people who agree completely with him,\" Biden said. The interview was scheduled to be conducted in Austin, Texas, but was moved after the assassination attempt of Trump.","summary":"Joe Biden remains insistent he's staying in the race for another four years as the nation's oldest president, saying his \"mental acuity has been pretty damn good, during an interview with NBC News anchor Lester Holt.","url":"https://www.upi.com/Top_News/US/2024/07/15/Biden-interview-NBC/9131721083782/","image":"https://cdnph.upi.com/ph/st/th/9131721083782/2024/upi/d90cfa1536e6c9e19fc20c32bdb6a129/v1.2/Joe-Biden-says-mental-acuity-has-been-pretty-damn-good-during-NBC-interview.jpg","video":null,"publish_date":"2024-07-15 23:43:48","author":"Allen Cone","authors":["Allen Cone"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.232},{"id":251843044,"title":"“What is the schedule for Trump’s speech at the RNC?”","text":"WASHINGTON — The Republican National Convention kicks off Monday, where Donald Trump will formally accept his party’s nomination as the GOP candidate for the presidential election. The event comes just days after Trump narrowly escaped an assassination attempt during a campaign rally in Pennsylvania. Even before Saturday’s deadly shooting, the RNC was set to be a major event in the campaign. Trump will unveil his pick for running mate, the person who will be his vice president if he wins the election in November. And party members will likely be trying to put their best foot forward through speeches and presentations as possible future leaders of the GOP conference. If Trump wins in November, he will be term-limited out from running again, meaning a new Republican candidate will have to emerge for 2028. But before that, Trump is expected to take the stage and address the Republican party. The RNC will livestream proceedings across a number of online platforms, including YouTube and X. A number of networks have announced special programming for the prime-time portions of the convention, where Trump and others will give speeches from the hall where delegates are convening. Other media outlets, both local and national, will stream whatever is happening on the floor. The actual space itself is closed to the public, behind several layers of security accessible only to delegates, officials, volunteers and credential media. Trump is the headliner for the event, and is expected to address delegates on Thursday evening, the last day of the convention. His remarks will come as those delegates cast their votes for him as the party’s nominee. In a joint statement released Saturday evening, the Trump campaign and RNC said Trump “looks forward to joining you all in Milwaukee as we proceed with our convention to nominate him to serve as the 47th President of the United States.” After the assassination attempt on Trump, anger and anxiety are coursing through the party, even as many top Republicans call for calm and a lowering of tensions. As elected officials, politicians and a few regular Americans address the conference, the question is which tone will prevail in the aftermath of the attack: Will it make speeches even more fiery or will calls for calm prevail? Trump, for his part, has reportedly been changing his speech in response to the shooting. Much of the speech was originally focused on the Biden administration’s policies, and likely wouldn’t have sounded much different from his usual campaign rally stump speeches — tangential, off the cuff and undeniably Trumpian. But in the wake of the shooting, the former president has reportedly sought a softer message. He has been calling for national unity, as members of his party and Democrats, including President Joe Biden, call for cooler heads to prevail and for political violence to be avoided. Trump has said he will carry that message into the convention. He told The Washington Examiner that he has rewritten his speech after being the target of an attempted assassination. “The speech I was going to give on Thursday was going to be a humdinger,” he told the news outlet in an article posted Sunday evening. In the interview, the presumptive Republican presidential nominee says he will now call for a new effort at national unity, noting that people from different political views have called him after the attack. Republicans are convening at the Fiserv Forum in downtown Milwaukee, home to the NBA’s Milwaukee Bucks. Other facilities such as University of Wisconsin-Milwaukee Panther Arena and the Baird Center are hosting event spaces, including a filing center for the hundreds of reporters from around the world who are in town to cover the convention. Wisconsin is among the handful of states expected to be battlegrounds in this year’s general election, with an anticipated close finish between Biden and Trump. Biden won the state by the slimmest of margins over Trump in 2020; last week, it was among the three “blue wall states” that Biden’s campaign said in a memo present his “clearest pathway” to victory in November. Trump is expected to give his nomination acceptance speech Thursday, although there’s another speaker who might be just as highly anticipated. Trump waited until Monday to announce Ohio Sen. JD Vance as his running mate in a post on his Truth Social platform, building anticipation as convention plans came together and delegates arrived in town without knowing who would be atop the ticket with their nominee. As is tradition for vice presidential picks, Vance is expected to take the stage on Wednesday night. There are themes for each night’s speeches, from economics to immigration to crime to national security. The campaign hasn’t released a full slate of speakers, and it’s possible we won’t know who is taking the stage each night until hours before. Democrats are set to gather next month in Chicago for their own convention. And in September, there’s another debate scheduled between Biden and Trump. The Associated Press contributed to this story.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump&#8217;s speech at the Republican National Convention will be highly anticipated&#8230;\n\n\nThis Post: &#8220;What is the schedule for Trump&#8217;s speech at the RNC?&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/what-is-the-schedule-for-trumps-speech-at-the-rnc/","image":"https://media.tegna-media.com/assets/CCT/images/d7c19095-922e-422b-91b1-8b0e8c8af1ab/20240604T002108/d7c19095-922e-422b-91b1-8b0e8c8af1ab_750x422.jpg","video":null,"publish_date":"2024-07-15 23:37:15","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.234},{"id":251843492,"title":"Biden Questions Why Hip-Hop Artists Support Trump: ‘He Thinks He’s Going to Sell Golden Shoes’ | Video","text":"As President Joe Biden ramps up his media appearances, he spoke about a wide range of issues with Complex’s Speedy Morman, including addressing former President Donald Trump’s support in the hip-hop community. The “360 With Speedy” interview was taped prior to the attempted assassination of Trump, but was released Monday. Early in the interview, Speedy noted that they didn’t have a lot of time, though the edited clip ran nearly 20 minutes. One of his first questions for Biden was about his age and his decision to stay in the race. Biden reiterated that he had “to finish the job.” Speedy asked Biden about Trump’s appeal to hip-hop artists, citing Lil Wayne and Kodak Black showing him their support. The president responded, “Well, I’m not sure he has that allegiance, number one. Number two, if you look at his record in terms of African Americans and minorities, it’s abysmal the way he handles everything.” Biden added that he got started in politics because of the Black community, citing his state being segregated when he was growing up. Biden also talked about Trump’s comments about “Black jobs,” noting, “He means menial labor. That’s what he thinks. You know, he thinks he’s going to sell golden shoes or sneakers.” The president took the attack to Trump throughout the pre-shooting interview, telling Speedy, “Donald Trump, I think — as I said from the beginning when I ran in 2020 — that he’s a real danger to the country, to a democracy.” Biden said that he hadn’t planned to run in 2020, but made the decision after seeing what happened with the infamous Charlottesville protests and Trump responding to the death of a young woman by saying there were “good people on both sides.” As is often the case when Biden speaks recently, his voice was hoarse and he regularly cleared his throat as he sipped what he said was tea. He also misspoke at times, including talking about becoming vice president in “2020.” When asked what one thing he thought Trump would do well is, Biden responded, “I’m not being facetious — I can’t think of a single thing.” He added, “Look what his objective is. It is totally anti-democratic. He says that he wants to be a dictator on day one. He means it. He says he will not recognize the outcome of the next election.” Biden continued, noting that when the election didn’t go his way last time, Jan. 6 happened. “He encouraged people to go up and riot. Police were killed. People were wounded. People were hurt. The place was smashed up. They were hanging… anyway, what did he do? He sat there in the dining room off of the Oval Office, watched it for three hours, didn’t say a damn thing. And now he says if he loses there’ll be a bloodbath?” The president drew contrast with Trump on immigration and said, “We’re the only nation in the world that isn’t xenophobic.” He said there is xenophobia here, but that it isn’t our policy, and pointed to Trump trying to stop a border deal from going through under Biden because it would make him look bad. Biden on the War in Gaza Biden also defended his support for Israel during the ongoing controversy over the war in Gaza. “If there weren’t an Israel, every Jew in the world would be at risk,” Biden said. “So there’s a need for it to be strong and a need for Israel to be able to have, after World War II, the ability for Jews to have a place that was their own. You don’t have to be a Jew to be a Zionist. A Zionist is about whether or not Israel is a safe haven for Jews because of their history of how they’ve been persecuted.” Knowing how his words could come off given the sensitivity around the issue, Biden added, “Now, you’ll be able to make a lot out of that, because people don’t know what a Zionist is.” But he also pointed to his support for the Palestinian people. “I’m the guy that did more for the Palestinian community than anybody,” Biden said, also pointing to opening up the border to food and medicine coming into Gaza. “I mean, I’ve been very supportive of the Palestinians, but Hamas, they’re a bunch of thugs,” Biden said. “I was over there about eight days after the massacre, saw photographs of mothers and daughters being tied in a rope together, kerosene pouring on their heads and leaving them to burn to death. Nothing’s happened like that since the Holocaust.” Asked about why Muslims and Arab Americans would vote for Biden given his stances, he noted the work he’d done with numerous Middle Eastern nations and said, “I don’t have a prejudiced bone in my body. The Arabs are good people. They need help now.” When asked whether Vice President Kamala Harris was up to being president, Biden said, “I think she is. She’s first-rate. I wouldn’t have picked her otherwise. She was a hell of a prosecutor. She was a great senator. She’s first-rate, and I think she’s qualified.” Appealing to Young People He also teased doing more to help people with rent and said, “I think you’re going to see the idea that we’re going to be able to deal with rent. We’re going to be able to deal with housing costs.” Biden is reportedly set to call for a cap of 5% on annual rent increases, according to the Associated Press. The president used the interview to point to efforts he’s made to help young people, including forgiving college debt, and calling out Trump for not doing more to deal with racism or to improve the way minority groups are treated. “I mean, what has he done?” Biden asked incredulously. The interview opened with Speedy playfully offering the president what he said was vodka, before playing it off. “I may be Irish, but I’m the only Irish you’ve ever met that’s never had a drink,” Biden quipped. Biden ended the interview by stating that he’ll be on the ballot this November, “Unless I get hit by a train.” During the interview, Biden also defended himself against concern about inflation under his presidency, talked corporate greed and addressed other issues. You can listen to the full interview with Complex’s Speedy in the video above.","summary":"The president also calls himself a \"Zionist\" and speaks about a wide range of other issues in an interview with Complex's Speedy Morman\n\n\nThe post Biden Questions Why Hip-Hop Artists Support Trump: &#8216;He Thinks He&#8217;s Going to Sell Golden Shoes&#8217; | Video appeared first on TheWrap.","url":"https://www.thewrap.com/biden-hip-hop-complex-speedy-interview/","image":"https://www.thewrap.com/wp-content/uploads/2024/07/CleanShot-2024-07-15-at-16.01.52@2x.jpg","video":null,"publish_date":"2024-07-15 23:35:41","author":"Mike Roe","authors":["Mike Roe"],"language":"en","source_country":"US","sentiment":-0.364},{"id":251843230,"title":"Widow of firefighter fatally shot at Trump rally shuns Biden’s call: Report","text":"“I didn’t talk to Biden,” Helen Comperatore said from her home in Pennsylvania on Monday, per the New York Post, after the president tried calling in the wake of the tragedy. “I didn’t want to talk to him. My husband was a devout Republican and he would not have wanted me to talk to him.” Corey Comperatore was a popular volunteer firefighter and married father of two. He was at Trump’s rally in Butler, Pa., on Saturday with his family when sniper Thomas Matthew Crooks, 20, opened fire. A bullet hit the former president in the ear, while two other rally attendees were wounded. Helen Comperatore said it was supposed to be an “exciting day” for the family to support Trump. She said when the shots rang out, her husband instinctively shouted, “Get down,” and used his body to shield his family from the sniper’s bullets. She said Trump had not reached out, but Biden’s call wasn’t welcome. “I don’t have any ill will towards Joe Biden,” she said. “I’m not one of those people that gets involved in politics. “I support Trump. That’s who I’m voting for, but I don’t have ill will towards Biden. He didn’t do anything bad to my husband. A 20-year-old despicable kid did.” RECOMMENDED VIDEO","summary":"The widow of Corey Comperatore, the firefighter who was shot dead by a sniper at a Trump rally, has zero interest in hearing from U.S. President Joe Biden. “I didn’t talk to Biden,” Helen Comperatore said from her home in Pennsylvania on Monday, per the New York Post, after the president tried calling in the [&#8230;]","url":"https://torontosun.com/news/world/widow-of-firefighter-fatally-shot-at-trump-rally-shuns-bidens-call-report","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/07/Election-2024-Trump-Shooter-Victim-scaled-e1721086276624.jpg?quality=100&strip=all","video":"http://cdn.jwplayer.com/manifests/rdXDGvBa.m3u8","publish_date":"2024-07-15 23:31:54","author":"Postmedia News","authors":["Postmedia News"],"language":"en","catgory":"politics","source_country":"CA","sentiment":-0.131},{"id":251843560,"title":"Biden Says His Mental Acuity Is \"Pretty Damn Good\" Amid Health Concerns","text":"Joe Biden defended his decision to stay in the US presidential race despite concerns about his age, saying Monday in an interview with NBC that his mental sharpness was \"pretty damn good.\" \"I'm old,\" Biden told the US broadcaster, according to a transcript. \"But I'm only three years older than Trump, number one. And number two, my mental acuity has been pretty damn good.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Joe Biden defended his decision to stay in the US presidential race despite concerns about his age, saying Monday in an interview with NBC that his mental sharpness was \"pretty damn good.\"","url":"https://www.ndtv.com/world-news/joe-biden-says-his-mental-acuity-is-pretty-damn-good-amid-health-concerns-6114472","image":"https://c.ndtvimg.com/2024-07/dkviueqo_joe-biden-afp-_625x300_15_July_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240615.100","video":null,"publish_date":"2024-07-15 23:31:22","author":null,"language":"en","source_country":"in","sentiment":0.15},{"id":251843066,"title":"Letters: Moderators’ job | Voters’ job | Kinzinger answer","text":"Moderators failed their job in the debate In the recent debate, President Biden was the victim of a Gish gallop attack by Donald Trump. Wikipedia defines a Gish gallop as “a rhetorical technique in which a person in a debate attempts to overwhelm an opponent by abandoning formal debating principles, providing an excessive number of arguments with no regard for the accuracy or strength of (the) arguments and that are impossible to address adequately in the time allotted to the opponent.” Wikipedia adds, “The technique wastes an opponent’s time and may cast doubt on the opponent’s debating ability.” Given that this is a known technique, the debate moderators should have stopped it. Biden’s debate performance needs to be viewed in this context. Diane Peterson Martinez Voters must show Biden the door Re: “President scrambles to save reelection” (Page A1, July 6). The two people running for president should not be, and the collective voters are not excited about either candidate. One has been convicted of 34 felony counts, staged a coup to overturn the 2020 election, and openly states he will be a dictator on Day One when elected. The other is a public servant who has honorably served America for decades, secured our democracy in 2020, and whose health appears to be failing. The Republicans did not do right by the American public to find another nominee for president. The Democrats in power need to do the right thing for the American public to secure our democracy with an immediate transition plan for a new Democratic nominee. Democracy is on the ballot and we can’t let Joe Biden “dictate” that he will remain in the race unless the “Lord Almighty” tells him so. We must rise up together to preserve America. Andrea Bloom Pleasanton Kinzinger is creative answer for Democrats Then my brother suggested a running mate for Kamala Harris (should Biden quit the race) that made perfect sense: Adam Kinzinger. We would get the solid Democrats voting for Kamala and the swing voters who do not like Trump would vote for Adam. He is young, a veteran, a hero and has a backbone as demonstrated when he parted ways with the MAGA Republicans to disavow the Jan. 6 coup. Let’s ask Adam. It’s the best of both worlds, We have to be creative, folks. Kim Clark Danville","summary":"East Bay Times Letters to the Editor for July 16, 2024","url":"https://www.mercurynews.com/2024/07/15/letters-1794/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/BRN-L-ELIAS-COL-0712-2A.jpg?w=1024","video":null,"publish_date":"2024-07-15 23:30:39","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.079},{"id":251843920,"title":"Biden campaign, leftist media characterize JD Vance as 'extreme' just 2 days after assassination attempt on Trump","text":"Just two days after a deadly shooting that nearly took the life of former President Donald Trump, the Biden campaign and media leftists have employed hyperbolic language to describe his VP pick, Sen. J. D. Vance (R-Ohio). In the hours following the shooting at Trump's rally in Pennsylvania on Saturday, Democrats and their media allies called for toning down the political rhetoric. In an address from the Oval Office on Sunday night, Joe Biden encouraged everyone to \"lower the temperature in our politics.\" 'If the GOP under Trump has indeed evolved into an authoritarian party, then Vance hails from its authoritarian wing.' \"While we may disagree, we are not enemies,\" Biden said, according to a White House transcript. \"We’re neighbors. We’re friends, coworkers, citizens. And, most importantly, we are fellow Americans. And we must stand together.\" \"We all have a responsibility to do that.\" The Biden campaign even suspended all its public communications — including attack ads that present Trump as \"an existential threat to our democracy.\" 'Divisive, MAGA-aligned': Leftist outlets weigh in on Vance Those calls for unity seem to have been short-lived. After Trump announced Vance as his vice presidential candidate, leftist outlets Vox, Mother Jones, and MeidasTouch and even the \"Biden-Harris\" campaign resorted to the same incendiary language Biden had seemingly put on hiatus. Vox editor in chief Swati Sharma wrung her hands that Vance had dared challenge the 2020 presidential election, advocated on behalf of J6 defendants, expressed support for Hungarian Prime Minister Viktor Orbán, and crossed the aisle to try and advance policies that benefit the working class. \"If the GOP under Trump has indeed evolved into an authoritarian party, then Vance hails from its authoritarian wing,\" Sharma wrote. \"His worldview is fundamentally incompatible with the basic principles of American democracy.\" Sharma tiptoed up to the line of calling Vance a threat to democracy without ever crossing it, though she came close, insisting that Vance has occasionally evinced deeper \"anti-democratic fervor\" than Trump. Inae Oh, a senior news and engagement editor at Mother Jones, was similarly careful. Oh described Vance as having \"a deeply MAGA persona\" and as using \"divisive, MAGA-aligned rhetoric.\" With Trump and Vance together, Oh claimed the top of the Republican ticket is \"steeped in election lies.\" By contrast, MeidasTouch author Aaron Parnas seemingly made no attempt at subtlety or circumspection and openly called Vance \"one of the most extreme VP picks in recent memory.\" Biden does about-face on lowering the temperature While Parnas' words may seem inflammatory, he seems to be echoing the sentiments of the Biden-Harris campaign, which claimed Vance would help advance Trump's \"extreme MAGA agenda,\" according to a statement shared by MeidasTouch. \"Over the next three and a half months, we will spend every single day making the case between the two starkly contrasting visions Americans will choose between at the ballot box this November: the Biden-Harris ticket who's focused on uniting the country, creating opportunity for everyone, and lowering costs; or Trump-Vance — whose harmful agenda will take away Americans' rights, hurt the middle class, and make life more expensive — all while benefiting the ultra-rich and greedy corporations,\" the statement apparently concluded (emphasis added). In an interview on Monday with Lester Holt of NBC News, Biden expressed few regrets about his language regarding Trump. \"How do you talk about the threat to democracy — which is real — when a president says things like he says? Do you just not say anything — because it may incite somebody?\" Biden asked. Though Biden did admit that calling to put Trump \"in a bullseye\" — as Biden did last week — was \"a mistake,\" he indicated his overall point was obvious. \"I meant focus on him. Focus on what he’s doing. Focus on his policies, focus on the number of lies he told at the debate,\" he explained. \"I’m not the guy that said, 'I want to be a dictator on day one.' I'm not the guy that refused to accept the outcome of the election. I'm not the guy who said he won't accept the outcome of this election automatically,\" Biden continued. Biden insisted that while Trump has continued to unleash vitriol about a possible \"bloodbath\" if he loses, he has remained above the fray. \"I am not engaged in that rhetoric,\" he said. Like Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"Just two days after a deadly shooting that nearly took the life of former President Donald Trump, the Biden campaign and media leftists have employed hyperbolic language to describe his VP pick, Sen. J. D. Vance (R-Ohio).\n\nIn the hours following the shooting at Trump's rally in Pennsylvania on Saturday, Democrats and their media allies called for toning down the political rhetoric. In an address from the Oval Office on Sunday night, Joe Biden encouraged everyone to \"lower the temperature in our politics.\"\n\n'If the GOP under Trump has indeed evolved into an authoritarian party, then Vance hails from its authoritarian wing.'\n\n\"While we may disagree, we are not enemies,\" Biden said, according to a White House transcript. \"We’re neighbors. We’re friends, coworkers, citizens. And, most importantly, we are fellow Americans. And we must stand together.\"\n\n\"We all have a responsibility to do that.\"\n\nThe Biden campaign even suspended all its public communications — including attack ads that present Trump as \"an existen","url":"https://www.theblaze.com/news/biden-campaign-leftist-media-characterize-jd-vance-as-extreme-just-2-days-after-assassination-attempt-on-trump","image":"https://www.theblaze.com/media-library/image.jpg?id=52684869&width=1200&height=600&coordinates=0%2C0%2C0%2C153","video":null,"publish_date":"2024-07-15 23:30:00","author":"Cortney Weil","authors":["Cortney Weil"],"language":"en","source_country":"US","sentiment":-0.06},{"id":251843282,"title":"Kamala Harris challenges Vance to debate in congratulatory voicemail message","text":"MILWAUKEE — Vice President Kamala Harris has already accepted a debate against Sen. J.D. Vance (R-OH) just hours after the Ohio senator was tapped as former President Donald Trump’s running mate and nominated as the party’s vice presidential nominee during the Republican National Convention in Milwaukee. Harris called Vance shortly after Trump tapped him as his running mate, but the two did not speak, according to a source familiar. Rather, Harris left a message to “congratulate him on his selection, welcome him to the race, and express her hope that the two can meet” in the debate. Harris and the Biden campaign previously accepted a vice presidential debate hosted by CBS News earlier this year, which is expected to take place later this summer. Several Democratic lawmakers close to the Biden campaign expressed confidence in Harris’s ability to face Vance onstage, lauding the vice president’s experience in the Senate and White House as she prepares to debate policy. “The VP will take it to J.D. Vance,” Sen. Elizabeth Warren (D-MA) told reporters on a campaign call shortly after Vance’s nomination was announced. “I’m looking forward to this debate.” Vance has not yet publicly accepted an invite to debate Harris, but the Ohio Republican indicated to the Washington Examiner in May he would not hesitate to meet with her. “You know, I’ll do whatever I need to to serve, but I’m very nervous about debating the vice president,” Vance quipped in a sarcastic tone. “She’s very eloquent.” Republicans were quick to praise Trump’s decision to tap Vance as his No. 2, lauding the junior senator from Ohio as a step into the party’s future. Several RNC delegates at the convention celebrated Vance as the mark of a “new generation of leadership for the Republican Party,” with one Republican consultant noting that Vance, as the “heir apparent,” will strengthen the GOP presidential ticket in 2028. Meanwhile, Harris must grapple with questions about her own ticket as Democratic lawmakers have considered whether President Joe Biden should be removed from the ticket. Harris sits with an average approval rating of 38.5%, which could also hurt her if she goes head to head against Vance.","summary":"MILWAUKEE — Vice President Kamala Harris has already accepted a debate against Sen. J.D. Vance (R-OH) just hours after the Ohio senator was tapped as former President Donald Trump&#8217;s running mate and nominated as the party&#8217;s vice presidential nominee during the Republican National Convention in Milwaukee. Harris called Vance shortly after Trump tapped him as [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3084036/kamala-harris-vance-debate-vice-president-rnc/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/vance-harris-debate.webp","video":null,"publish_date":"2024-07-15 23:29:02","author":"Cami Mondeaux","authors":["Cami Mondeaux"],"language":"en","source_country":"US","sentiment":-0.207},{"id":251842812,"title":"Widow of husband shot and killed at Trump rally shares his heart-shattering final two words","text":"The widow of the man shot and killed during the Donald Trump campaign rally has revealed his heart-shattering final words before his tragic death. The victim that was killed during the assassination attempt on the former President's life was volunteer firefighter and father-of-two Corey Comperatore. As shots rang out into the crowd during the rally, the 50-year-old attendee heroically shielded his family in the crowd from gunfire which costed him his life. As his wife Helen continues to grieve the loss of her husband, she has vulnerably shared her Corey's last words as he sacrificed his own life to save his loved ones. During an interview held from her home in Sarver, Pennsylvania on Monday, she The New York Post: \"He's my hero. He just said, 'Get down!' That was the last thing he said.\" READ MORE: Donald Trump shooter, 20, used dad's rifle to try to kill former president at rally READ MORE: Donald Trump's immediate reaction to shooting reveals huge detail about ex-President Helen went to add that as was given a personal phone call from President Joe Biden as he wanted to share his condolescenes for the tragedy, but she rejected the call. She revealed to the news outlet: \"I didn't talk to Biden. I didn't want to talk to him. My husband was a devout Republican and he would not have wanted me to talk to him.\" Helen confirmed that her family has not yet heard from Donald Trump. During the interview, Helen shared her and Corey's sweet love story revealing that they've been together ever since they were kids and were about to celebrate their 29th wedding anniversary together. As Trump supporters themselves, the long-time couple took a family trip to the Pennsylvania rally to hear his message ahead of the upcoming election. Helen explained: \"Me and the kids were all there as a family. He was just excited. It was going to be a nice day with the family.\" She went on to add: \"It was a bad day. He was a very loving husband. He was a simple man but he put his wife and kids first all the time. I did nothing here. I didn't lift a finger. He did everything.\" For all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US. During the rally, 20-year-old gunman Thomas Matthew Crooks opened fire on the crowd murdering Corey and injuring two others. After Corey was struck by one of the bullets, a doctor in the crowd rushed to perform CPR on him in an attempt to save his life. Speaking on the harrowing moment as he spoke a blood-soaked shirt, doctor Jake Rosen explained: \"I heard the shots. I thought it was firecrackers to begin with. Somebody over there was screaming, 'he's been shot, he's been shot.' So, I made my way over. I said I'm an emergency department physician. Let me help you,\" and added: \"There's lots of blood and he had brain matter.\" After the horrific tragedy, Helen has been overwhelmed by the love and support she's received in memory of her husband. Since their loss, Corey's family has stated a GoFundMe in his honor that has already raised a whopping $990,000. Speaking on the nation's generosity, Helen said: \"The donations that are coming in across the community and across the country, it's more than I can even imagine. It's more than I can fathom, but he deserves it all. He deserves everything.\"","summary":"Volunteer firefighter and father-of-two Corey Comperatore, aged 50, was killed after getting caught in the crossfire of an assassination attempt on GOP presidential nominee Donald Trump","url":"https://www.mirror.co.uk/news/us-news/widow-husband-shot-killed-trump-33251963","image":"https://i2-prod.mirror.co.uk/news/us-news/article33251962.ece/ALTERNATES/s1200/1_trump-victim-main.jpg","video":null,"publish_date":"2024-07-15 23:27:29","author":"Abigail O'Leary,Abigail-Oleary,Caroline Gaspich","authors":["Abigail O'Leary","Abigail-Oleary","Caroline Gaspich"],"language":"en","source_country":"gb","sentiment":-0.336},{"id":251842596,"title":"Fed judge tosses Trump documents case","text":"WASHINGTON — A federal judge in Florida dismissed the classified documents case against former President Donald Trump on Monday, siding with defense lawyers who said the special counsel who filed the charges was illegally appointed by the Justice Department. Hours later, special counsel Jack Smith’s office said it would appeal the order, which could result in it eventually being overturned by a higher court. But for now at least, the dismissal by U.S. District Judge Aileen Cannon brings a stunning and abrupt halt to a criminal case that at the time it was filed was widely regarded as the most perilous of all the legal threats the Republican former president confronted. Though the case had long been stalled, and the prospect of a trial before the November election already nonexistent, the judge’s order is a significant legal and political victory for Trump as he recovers from a weekend assassination attempt and prepares to accept the Republican nomination in Milwaukee this week. It’s the latest stroke of good fortune in the four criminal cases Trump has faced. He was convicted in May in his New York hush money trial, but the sentencing has been postponed after a Supreme Court opinion that conferred broad immunity on former presidents. That opinion will cause major delays in a separate case charging Trump with plotting to overturn his 2020 election loss to Democrat Joe Biden. Another election subversion case filed in Atlanta has been delayed by revelations of a romantic relationship between the district attorney and a special prosecutor she hired for the case. In a statement on his social media platform, Trump said the dismissal “should be just the first step” and the three other cases, which he called “Witch Hunts,” should also be thrown out. The classified documents case had been seen as the most legally clear-cut of the four given the breadth of evidence that prosecutors say they had accumulated, including the testimony of close aides and former lawyers, and because the conduct at issue occurred after Trump left the White House in 2021 and lost the powers of the presidency. The indictment included dozens of felony counts accusing him of illegally hoarding classified records from his presidency at his Mar-a-Lago estate in Palm Beach, Florida, and obstructing FBI efforts to get them back. He had pleaded not guilty and denied wrongdoing. Defense lawyers filed multiple challenges to the case, including legally technical ones that asserted that special counsel Jack Smith’s appointment by Attorney General Merrick Garland violated the Constitution’s Appointments Clause because it did not go through Congress and that Smith’s office was improperly funded by the Justice Department. She said Garland had exceeded his bounds by appointing a prosecutor without Senate approval and confirmation and had undermined the authority of Congress. “The Special Counsel’s position effectively usurps that important legislative authority, transferring it to a Head of Department, and in the process threatening the structural liberty inherent in the separation of powers,” Cannon wrote in a 93-page order that granted the defense team’s request to dismiss the case but did not dissect the substance of the allegations against Trump. “If the political branches wish to grant the Attorney General power to appoint Special Counsel Smith to investigate and prosecute this action with the full powers of a United States Attorney, there is a valid means by which to do so,” she added. That mechanism is through congressional approval, she said. A spokesman for Smith, Peter Carr, said the Justice Department had authorized an appeal. “The dismissal of the case deviates from the uniform conclusion of all previous courts to have considered the issue that the Attorney General is statutorily authorized to appoint a special counsel,” Carr said in a statement. The order is the latest example of the Trump-appointed judge handling the case in ways that have benefited the ex-president. She generated intense scrutiny during the FBI’s investigation when she appointed an independent arbiter to inspect the classified documents recovered during the August 2022 search of Mar-a-Lago, a decision that was overturned months later by a unanimous federal appeals panel. Since the charges were filed, she has been slow to issue rulings — favoring Trump’s strategy of securing delays in all his criminal cases — and has entertained defense motions and arguments that experts said other judges would have dispensed with without hearings. In May, she indefinitely canceled the trial date amid a series of unresolved legal issues.","summary":"WASHINGTON — A federal judge in Florida dismissed the classified documents case against former President Donald Trump on Monday, siding with defense lawyers who said the special counsel who filed the charges was illegally appointed by the Justice Department. Hours later, special counsel Jack Smith&#8217;s office said it would appeal the order, which could result [&#8230;]","url":"https://www.bostonherald.com/2024/07/15/fed-judge-tosses-trump-documents-case/","image":"https://www.bostonherald.com/wp-content/uploads/2024/07/AP24196754682608.jpg?w=1024","video":null,"publish_date":"2024-07-15 23:23:07","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.301},{"id":251843838,"title":"Widow of ex-chief killed in Trump rally shooting reveals his final words – and passed on phone call with Biden","text":"The bystander who died to an assassin's bullet at a Trump rally on Saturday used his last breaths to tell his family to take cover, his widow has said. Corey Comperatore, a 50-year-old former volunteer fire chief from Sarver, Pennsylvania, was in the stands near Donald Trump's podium when a gunman opened fire from a rooftop, meaning to kill the former president. Comperatore reportedly threw his body over those of his wife and two children to shield them from the gunfire, and was shot in the head. His last words, his widow said, were simply \"get down!\" \"He’s my hero,\" Helen Comperatore told The New York Post at the couple's home on Monday. \"He just said, ‘get down!’ That was the last thing he said.” She also revealed that she had turned down the offer of a condolatory phone call from Joe Biden, saying: \"I didn’t want to talk to him. My husband was a devout Republican and he would not have wanted me to talk to him.\" Nevertheless, she appeared to reject some Republicans' claims to bin blame for the shooting on Biden himself. \"I’m not one of those people that gets involved in politics,\" she said. \"I support Trump, that’s who I’m voting for, but I don’t have ill-will towards Biden. He didn’t do anything to my husband. A 20-year-old despicable kid did.\" She added she had not yet heard from Trump. The FBI has identified Thomas Matthew Crooks, 20, as the man who attempted to assassinate Trump before being shot dead by counter-snipers. Not much is known about Crooks's politics, and almost nothing about why he might have wanted to kill a presidential candidate. He had donated to a Democrat group in 2021, but was registered to vote as a Republican, and former classmates described him as right-leaning or apolitical. Nevertheless, multiple Republican politicians have accused Biden of stoking hate against his opponent by repeatedly describing him as a threat to democracy. \"Today is not just some isolated incident,\" said Ohio senator JD Vance, who has since been confirmed as Trump's 2024 running mate. \"The central premise of the Biden campaign is that President Donald Trump is an authoritarian fascist who must be stopped at all costs. That rhetoric led directly to President Trump's attempted assassination.\" Describing the moment of her husband's death, Helen Comperatore said that they had hoped for simply \"a nice day with the family\" supporting the candidate that they both planned to vote for. The couple had been high school sweethearts, she said, and were soon to celebrate their 29th wedding anniversary. \"He was a simple man, but he put his wife and kids first all the time,\" she said. \"I did nothing here. I didn’t lift a finger. He did everything.\"","summary":"Helen Comperatore said she passed on a phone call with President Joe Biden because their family is Trump supporters","url":"https://www.independent.co.uk/news/world/americas/us-politics/corey-comperatore-trump-rally-widow-speaks-b2580299.html","image":"https://static.independent.co.uk/2024/07/15/23/newFile.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/qp7QGVes-4VHSaSK0.mp4","publish_date":"2024-07-15 23:19:33","author":"Io Dodds","authors":["Io Dodds"],"language":"en","source_country":"gb","sentiment":-0.376},{"id":251842758,"title":"Biden Admits ‘Bullseye’ Quote Was a Mistake, but Blames Trump for Being ‘Engaged in That Rhetoric’ of Violence","text":"President Joe Biden admitted in an interview Monday that proclaiming it’s “time to put Donald Trump in the bullseye” last week was a “mistake” — but quickly pushed the attention to former president’s regular use of such violent rhetoric. Speaking with NBC News Lester Holt for a sit-down interview due to air in full on Monday, the president, reflecting on his “bullseye” quote in the aftermath of Saturday’s attempted assassination of Trump at a Pennsylvania rally, maintained that he “didn’t say crosshairs” and that he meant it’s time to start “putting focus on” his political adversary. “Let’s talk about the conversation this has started, and it’s really about language — what we say out loud and the consequences of those,” Holt pressed Biden at the top of the preview clip. “You called your opponent an existential threat on a call a week ago. You said it’s ‘time to put Trump in the bullseye.’ There’s some dispute about the context, but I think you appreciate that words matter.” “I didn’t say crosshairs, I was talking about putting focus on,” Biden maintained, shrugging off the notion that his comment had anything to do with the effort to take Trump’s life. “Look, the truth of the matter was, and I guess I was talking about at the time was, there’s very little focus on Trump’s agenda.” “Yeah, the term was ‘bullseye,’” Holt continued. “It was a mistake to use the word. I didn’t say ‘crosshairs’ — when I said ‘bullseye,’ I meant focus on him,” Biden said. “Focus on what he’s doing. Focus on his policies, focus on the number of lies that he told in the debate.” Biden then drew a direct comparison between himself and Trump, arguing that he’s not actually the one inciting violence. “Look, I’m not the guy that said, ‘I want to be a dictator on Day 1.’ I’m not the guy that refused to accept the outcome of the election. I’m not the guy that said he won’t accept the outcome of this election automatically,” Biden said. Holt then asked the president if he’d “taken a step back and done a little soul searching on things you may have said that could incite people who are not balanced?” Biden was not convinced that his words incited the violence of Saturday, but he also posed whether or not the possibility of someone being incited to violence should cause him to not speak the truth. “How do you talk about the threat to democracy, which is real, when a president says things like he says? Do you just not say anything because it may incite somebody?” he said. “Look, I am not engaged in that rhetoric. Now, my opponent is engaged in that rhetoric. He talks about there’ll be a bloodbath if he loses, talking about how he’s going to suspend the sentences of all those who were arrested and sentenced to go to jail because of what happened in the Capitol.” Watch the full segment below. Biden’s interview with Holt is the latest high-profile primetime interview he’s granted to media amid the fallout of support following his dismal debate performance against Trump last month. While he’s completed engagements with ABC and NBC and has a BET special dedicated to the Black vote on Wednesday, his first post-debate outing with George Stephanopoulos did little to move the needle of support. Days after the July 5 interview aired, the ABC journalist was recorded on the street saying that the president is unfit to serve another four years.","summary":"The president sits down with Lester Holt for a primetime NBC News interview two days after Saturday's assassination attempt\n\n\nThe post Biden Admits &#8216;Bullseye&#8217; Quote Was a Mistake, but Blames Trump for Being &#8216;Engaged in That Rhetoric&#8217; of Violence appeared first on TheWrap.","url":"https://www.thewrap.com/biden-nbc-interview-bullseye-quote-trump-shooting/","image":"https://www.thewrap.com/wp-content/uploads/2024/07/Biden-NBC-News-Lester-HOlt.jpeg","video":null,"publish_date":"2024-07-15 23:19:25","author":"Benjamin Lindsay","authors":["Benjamin Lindsay"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.166},{"id":251842118,"title":"Biden says it was a ‘mistake’ to say he wanted to put a ‘bull’s-eye’ on Trump","text":"US President Joe Biden told NBC News in an interview broadcast on Monday that it was a “mistake” to say he wanted to put a “bull’s-eye” on Republican nominee Donald Trump, but argued that the rhetoric coming from his opponent was more incendiary even as he warned that Trump remained a threat to democratic institutions. Those remarks from Biden came during a private call with donors last week as the Democrat had been scrambling to shore up his imperilled candidacy with key party constituencies. During that conversation, Biden declared that he was “done” talking about his poor debate performance and that it was “time to put Trump in the bull’s-eye”, saying Trump has received far too little scrutiny on his stances, rhetoric and lack of campaigning. Insisting “there was very little focus on Trump’s agenda”, Biden told NBC anchor Lester Holt that while he acknowledged his “mistake”, he nonetheless is “not the guy who said I wanted to be a dictator on day one” and that he wanted the focus to be on what Trump was saying. It is Trump, not Biden, who engages in that kind of rhetoric, Biden said, referring to Trump’s past comments about a “bloodbath” if the Republican loses to Biden in November. “Look, how do you talk about the threat to democracy, which is real, when a president says things like he says?” Biden said. “Do you just not say anything because it may incite somebody?” Biden said he was not sure whether the shooting changes the trajectory of the November presidential election or not. “I don’t know and you don’t know either,” he said. The interview was taking place the same day that his re-election team was preparing to resume full-throttle campaigning after the assassination attempt on Trump, particularly after the Republican nominee announced Ohio Senator JD Vance as his running mate – which unleashed a flurry of criticism from the Biden campaign and other Democrats about the young senator’s policy positions. “He’s a clone of Trump on the issues,” Biden told reporters at Andrews Air Force Base before departing for Nevada for a series of speeches and campaign events. “I don’t see any difference.” The NBC interview, scheduled before the attempt on Trump’s life at a rally in Pennsylvania, had been part of Biden’s broader strategy to prove his fitness for office after angst grew among Democrats because of his disastrous June 27 debate performance. The Biden campaign recalibrated some of its political plans in the immediate aftermath of the assassination attempt on Saturday, pulling advertising off the air and hitting pause on messaging. The White House also scrapped Biden’s planned Monday visit to the Lyndon B Johnson library, where he had been expected to deliver remarks on civil rights. It is still not finalised when Biden’s campaign advertisements will resume. Hours ahead of the NBC interview, his campaign issued a blistering statement on Trump’s selection of Ohio Senator JD Vance as his running mate, saying he picked the senator because he would “bend over backwards to enable Trump and his extreme MAGA agenda”. “Over the next three and a half months, we will spend every single day making the case between the two starkly contrasting visions Americans will choose between at the ballot box this November,” said Biden campaign chairwoman Jen O’Malley Dillon. Biden has acknowledged that his candidacy and agenda will be under attack at the Republican National Convention this week, and aides feel no need to put their campaign on complete pause while Biden comes under scrutiny in Milwaukee. But they will tread carefully in the aftermath of the shooting at a Trump rally in Butler, Pennsylvania. Biden’s renewed campaigning this week comes as Democrats have been at an impasse over whether the incumbent president should continue in the race even as he was defiant that he would stay in. Biden has made it clear in no uncertain terms that he remains in the race, and aides have been operating as such. It was unclear if the attempt on Trump’s life would blunt Democratic efforts to urge Biden to step aside, but it appears to have stalled some of the momentum, for now. No Democrats have called for him to exit the race since the shooting on Saturday. In the hours before the shooting, Biden was still being confronted by frustration and scepticism from Democratic lawmakers. Congressman Jared Huffman of California said he asked the president during his meeting with the Congressional Progressive Caucus about objectively assessing the trajectory of the race. Huffman said on a social media post that Biden “disagreed with the notion that we are on a losing trajectory”. And while Biden expressed a “willingness to listen” to other voices, Huffman said he doubted any would be persuasive. Several Democrats who requested anonymity were sceptical that there would be enough drive among lawmakers to successfully try to pressure Biden not to run. Many in the Democratic Party had been looking to congressional leaders to voice concerns directly to the president. There were still deep concerns that Biden is not up to the job and a sense that pressure to try to find another candidate could ramp up again when lawmakers return to Washington. Congressional Democrats were watching the Republican National Convention and Biden’s appearances this week with awareness that the dynamics could change – again.","summary":"Speaking to NBC, Biden said that while he acknowledged his ‘mistake’ he nonetheless is ‘not the guy who said I wanted to be a dictator’.","url":"https://www.scmp.com/news/world/united-states-canada/article/3270573/biden-says-it-was-mistake-say-he-wanted-put-bulls-eye-trump","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/07/16/b908cd0c-51a8-469c-9547-35d005744682_f614c3d2.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/15/Web%20Video.mp4","publish_date":"2024-07-15 23:15:20","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.512},{"id":251842084,"title":"Donald Trump Gets Good News During RNC","text":"Former President Donald Trump received good swing state polling news on Monday, which is also the first day of the Republican National Convention (RNC) in Milwaukee.Republicans officially nominated Trump as their presidential candidate at the RNC on Monday, setting off a likely rematch of the 2020 presidential race against President Joe Biden who eked out narrow victories in key battleground states four years earlier. Both candidates are working to win over independent voters as well as build enthusiasm among their base in key battleground states that will determine the outcome of the 2024 election.Political experts view the most competitive states as Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin. In 2020, Biden won each of those states except for North Carolina, meaning Trump must flip several of them in November to reach 270 Electoral College votes.A new YouGov poll released on Monday found that the former president has an advantage in each of these swing states less than four months until Election Day.The survey, conducted from July 4 to 12, is the latest polling victory for Trump, whose lead over Biden held steady following CNN's presidential debate in Atlanta last month, according to most recent surveys.During the debate, Biden sounded hoarse and appeared to stumble through several answers, doing little to quell concerns about his age. Biden's team later said he had a cold and was suffering from jet lag. Meanwhile, the poll was conducted before Saturday's shooting at Trump's campaign rally in Butler, Pennsylvania, which is being investigated as an assassination attempt.Trump was speaking at the rally when he was shot on stage, with a bullet hitting the upper part of his right ear. The gunman identified by the FBI as 20-year-old Thomas Matthew Crooks of Bethel Park, Pennsylvania, was shot and killed by the Secret Service. A rally attendee, 50-year-old former firefighter Corey Comperatore was also killed during the incident. Those injured, identified as 57-year-old David Dutch of New Kensington, Pennsylvania, and 74-year-old James Copenhaver of Moon Township, Pennsylvania, are in stable condition.A spokesperson for Trump's campaign said on Saturday that the former president was \"fine\" and was \"being checked out at a local medical facility.\" Trump was released from the hospital later that night.It remains unclear, however, how the shooting will affect future polls.ArizonaAccording to the new YouGov poll, Trump held a 7-point lead (44 to 37 percent) in Arizona.In 2020, Biden flipped the state, winning it by about 0.3 percentage points. Arizona had not backed a Democratic presidential candidate since 1996. However, Phoenix and its suburbs have slowly become more Democratic, boosting Biden and other Democrats in the Sun Belt state.GeorgiaMeanwhile, Trump held a 4-point lead (44 to 40 percent) in Georgia. The southern state tells a similar story—a traditionally Republican-leaning state that has grown more competitive due to Democratic shifts in Atlanta and its booming suburbs.Georgia provided Biden his most narrow victory in 2020, voting for him over Trump by less than a quarter of a percentage point.MichiganIn Michigan, a key Rust Belt state Biden won in 2020, the poll found Trump leading Biden by two points (42 to 40 percent).Biden won Michigan by nearly 3 points in 2020, but has faced questions about his ability to carry it in November due to his stance on the Israel-Hamas conflict, which has sparked pushback from some of the state's Arab American voters. Trump won it in 2016, a major upset for Democrats who have benefitted from union voters and strong margins out of Detroit.NevadaIn Nevada, where Republicans have not won a presidential race since 2004, Trump held a 4-point lead (46 to 42 percent). Biden won Nevada by 2.4 points in 2020. Elections in Nevada are powered by Democratic-leaning Clark County, home to Las Vegas. But polls show Nevada as one of Trump's stronger swing states in 2024.North CarolinaThe former president also held a 4-point lead in North Carolina (44 to 40 percent). Four years earlier, Trump won the Tar Heel State by 1.3 points against Biden. Democrats haven't won North Carolina presidentially since 2008. But they have won several gubernatorial races in the state and margins have remained close in most statewide races.PennsylvaniaTrump held a 3-point lead (43 to 40 percent) in Pennsylvania, which backed Biden by 1.2 percentage points in 2020. Rural areas in the state have quickly become more Republican, meaning Biden needs to continue making gains in Philadelphia suburbs to hold onto the state in November.WisconsinMeanwhile, the former president held a 5-point lead (43 to 38 percent) over Biden in Wisconsin, which backed him by only 0.63 percentage points in 2020. Like Michigan and Pennsylvania, Trump won the state in 2016 before Biden flipped it back four years later.Newsweek reached out to the Trump and Biden campaigns for comment via email.Republican Senate Candidates Underperforming Key Swing StatesDespite Trump winning each swing state in the poll, Democratic Senate candidates also held leads in the same YouGov poll.In Arizona, Democratic Representative Ruben Gallego led former gubernatorial GOP candidate Kari Lake by 7 points (48 to 41 percent). Meanwhile, Democratic Representative Elissa Slotkin led former Representative Mike Rogers by 9 points (48 to 39 percent) in Michigan.Senator Jacky Rosen, a Democrat, led Republican candidate Sam Brown by 7 points (47 to 40 percent) in Nevada. Senator Bob Casey, a Democrat, led Republican businessman David McCormick by 12 points (50 to 38 percent) in Pennsylvania. Meanwhile, Democratic Senator Tammy Baldwin led Republican candidate Eric Hovde by 7 points (50 to 43 percent) in Wisconsin.","summary":"A new poll shows the former president leading President Joe Biden in several key battleground states.","url":"https://www.newsweek.com/donald-trump-polls-republican-national-convention-1925512","image":"https://d.newsweek.com/en/full/2428820/donald-trump-good-polling-news-rnc.jpg","video":null,"publish_date":"2024-07-15 23:13:56","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.035},{"id":251843840,"title":"Biden defends calling Trump a threat to democracy","text":"Joe Biden defended the rhetoric he has used against Donald Trump, in his first interview since the attempt on his rival's life. The president said his campaign had a duty to clearly communicate the threat of a second Trump term. He told NBC's Lester Holt it had been a \"mistake\" to have said it was “time to put Trump in a bullseye\" during a private donor call days before the assassination attempt, and disagreed there was a need to tone down his rhetoric. Mr Biden said he meant Democrats needed to focus more on Trump, his policies and the false statements he made during the presidential debate late last month. The president has repeatedly called for Americans to \"lower the temperature\" since the shooting. About a dozen Republicans have blamed Mr Biden and Democrats at-large for inciting the attempt on Trump's life. Many have cited Biden's \"bullseye\" comment. According to Politico, Mr Biden said on the call: \"I have one job, and that's to beat Donald Trump. I'm absolutely certain I'm the best person to be able to do that. So, we're done talking about the debate. It’s time to put Trump in a bullseye.\" Biden, in an Oval Office address, denounced the attack and called for Americans to \"take a step back\" and warned that \"political rhetoric in this country has gotten very heated\". When asked by NBC if he has also taken a step back to examine his past remarks for anything \"that could incite people who are not balanced\", Mr Biden deflected and said the inflammatory rhetoric has not come from him. \"I've not engaged in that rhetoric,\" Biden says firmly. \"Now, my opponent is engaged in that rhetoric.\" \"How do you talk about the threat to democracy, which is real, when a president says things like he says?\" Mr Biden said. \"Do you just not say anything, because it may incite somebody?\" FBI officials identified the gunman who targeted Trump as Thomas Matthew Crooks, 20, a kitchen worker from Bethel Park, Pennsylvania, who is a registered Republican. A Secret Service sniper shot Crooks dead after he fired at the president.","summary":"President responds to accusations from Republican politicians that he fuelled threat to Trump with rhetoric.","url":"https://www.bbc.com/news/articles/cd1rzde0n4do","image":"https://ichef.bbci.co.uk/news/1024/branded_news/6fda/live/44f74e10-42fa-11ef-a4c0-c328bfe38457.jpg","video":null,"publish_date":"2024-07-15 23:12:41","author":"Christal Hayes","authors":["Christal Hayes"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.206},{"id":251841976,"title":"Biden defends his decision to stay in the race, affirming his sharp mental acuity","text":"WASHINGTON — After tempering attacks on Donald Trump following Saturday’s assassination attempt, President Joe Biden plunged back into campaign mode Monday, defending his decision to remain in the race despite calls for him to exit. In an interview with NBC News anchor Lester Holt, Biden at times grew combative and said he isn’t leaving the race even though some Democratic leaders have expressed fears that he can’t win. To see more of the interview, watch “NBC Nightly News with Lester Holt” tonight at 6:30 p.m. ET/5:30 p.m. CT. or check your local listings. “I’m old,” Biden said. “But I’m only three years older than Trump, number one. And number two, my mental acuity has been pretty damn good. I’ve gotten more done than any president has in a long time in three-and-a-half years. I’m willing to be judged on that.” “I understand why people say, ‘God, he’s 81 years old. Whoa. What’s he gonna be when he’s 83 years old, 84 years?’ It’s a legitimate question to ask.” Biden’s interview is the latest in a series of events, rallies and Q&As he’s done since his dismal performance during his debate with Trump on June 27. Alarmed by his halting delivery, some Democratic lawmakers have questioned whether he has the vigor needed to carry the fight against Trump. Biden reiterated in the interview that he’s staying put. Democratic voters picked him to head the ticket during the primary season, he said. “I listen to them,” he said. Holt asked the president who he consults when it comes to issues like remaining in the race or dropping out. “Me,” Biden said. “I’ve been doing this a long time.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON — After tempering attacks on Donald Trump following Saturday’s assassination attempt,&#8230;\n\n\nThis Post: Biden defends his decision to stay in the race, affirming his sharp mental acuity first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/biden-defends-his-decision-to-stay-in-the-race-affirming-his-sharp-mental-acuity/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-07/240715-nn-exclusive-interview-joe-biden-se-545p-ee4a0f.jpg","video":null,"publish_date":"2024-07-15 23:11:00","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.061},{"id":251842756,"title":"Biden directs Secret Service to protect RFK Jr. after Trump backs candidate’s request: '$3 million to date'","text":"Homeland Security Secretary Alejandro Mayorkas on Monday announced that President Joe Biden ordered Secret Service protection for Independent presidential candidate Robert F. Kennedy Jr., according to CNN. The order comes after Donald Trump called the protection following the shooting that occurred at his Butler, Pennsylvania rally Saturday, leaving the former president injured, and one attendee dead. \"In light of this weekend’s events, the president has directed me to work with the Secret Service to provide protection to Robert Kennedy, Jr.,\" Mayorkas said during a White House news briefing. READ MORE: 'Fight! Fight! Fight!' RNC’s 'chilling' MAGA chant echoes Trump – and '1930’s Germany' \"Thank you, President Biden, for extending me Secret Service protection,\" the Independent candidate said in a statement, according to ABC News. ABC reports Kennedy \"also thanked his private security firm, Gavin de Becker & Associates, 'for keeping me safe for the past 15 months of my presidential campaign.'\" The president, ABC notes, called for Kennedy's protection \"both prior to and after the events of this past weekend,\" Mayorkas said during the briefing. Politico reports, \"De Becker’s private security firm has been handling the campaign’s private security, costing the campaign about $3 million to date in addition to $2.6 million in outstanding debts, according to the latest federal financial disclosures.\" READ MORE: Latest far-right conspiracy blames Women and DEI for Trump rally shooting: report CNN's full report is available at this link. ABC's report is here. Politico's report is here.","summary":"Homeland Security Secretary Alejandro Mayorkas on Monday announced that President Joe Biden ordered Secret Service protection for Independent presidential candidate Robert F. Kennedy Jr., according to CNN. \n\nThe order comes after Donald Trump called the protection following the shooting that occurred at his Butler, Pennsylvania rally Saturday, leaving the former president injured, and one attendee dead. \n\n\"In light of this weekend’s events, the president has directed me to work with the Secret Service to provide protection to Robert Kennedy, Jr.,\" Mayorkas said during a White House news briefing. \n\nREAD MORE: 'Fight! Fight! Fight!' RNC’s 'chilling' MAGA chant echoes Trump – and '1930’s Germany'\n\n\"Thank you, President Biden, for extending me Secret Service protection,\" the Independent candidate said in a statement, according to ABC News. \n\nABC reports Kennedy \"also thanked his private security firm, Gavin de Becker & Associates, 'for keeping me safe for the past 15 months of my presidential campaign.'\"\n\nThe pr","url":"https://www.alternet.org/biden-secret-service-rfk-jr/","image":"https://www.alternet.org/media-library/image.jpg?id=52684699&width=1200&height=600&coordinates=0%2C40%2C0%2C131","video":null,"publish_date":"2024-07-15 23:07:59","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","source_country":"US","sentiment":0.169},{"id":251841802,"title":"Top Biden security official apportions blame for Trump shooting","text":"Republican presidential candidate Donald Trump was nearly killed due to a “failure” of his Secret Service protection detail, US Homeland Security Secretary Alejandro Mayorkas has said. Trump was speaking at a campaign rally in Butler, Pennsylvania, on Saturday when he narrowly dodged a bullet that took off a part of his ear. One person in the stands was killed, and two others were seriously wounded before the Secret Service neutralized the gunman. ”An incident like this cannot happen,” Mayorkas told CNN on Monday. “When I say that something like this cannot happen, we are speaking of a failure.” “We are going to analyze, through an independent review, how that occurred, why it occurred, and make recommendations and findings to ensure it doesn’t happen again,” he added. Trump’s protection detail has been criticized for its response to the Butler attack, from failing to notice the shooter on a roof about 120 meters away to being too slow to cover their protectee once the shots were fired. Trump himself thanked the Secret Service for protecting him and called on the White House to grant a detail to RFK Jr., an independent candidate. President Joe Biden did so on Monday afternoon. The Secret Service has been under Homeland Security since 2003. The agency was originally created during the Civil War to investigate currency counterfeiting. Its duties were expanded to include protecting presidents in 1901. Secret Service agents are currently tasked with protecting the sitting president and vice president from the moment they are elected, as well as former presidents, officials in the line of succession, and major presidential and VP candidates, along with their immediate families. Republican lawmakers have demanded an investigation into the Butler attack. Secret Service Director Kimberly Cheatle has said the agency will cooperate with both the congressional investigations and the White House’s independent review. Thomas M. Crooks, the 20-year-old identified as the would-be assassin, had climbed onto the roof of a building directly in the line of sight of where Trump was speaking. Although locals who spotted him alerted police, it took several minutes for law enforcement to react. On Monday evening, it emerged that the building from which Crooks shot was the staging area for the local police tactical team. This was reported by ABC News, citing law enforcement sources. The revelation raises even more questions about how the assassin managed to get into position unhindered.","summary":"The attempted assassination of Donald Trump happened in part due to a Secret Service “failure,” DHS head Alejandro Mayorkas has said \nRead Full Article at RT.com","url":"https://www.rt.com/news/601122-trump-shooting-mayorkas-failure/","image":"https://mf.b37mrtl.ru/files/2024.07/article/6695aaea20302759a5712c2d.jpg","video":null,"publish_date":"2024-07-15 23:07:22","author":null,"language":"en","catgory":"politics","source_country":"ru","sentiment":-0.187},{"id":251844396,"title":"UK and its allies face ‘deadly quartet’ of nations, says defence expert","text":"Britain and its allies are facing a “deadly quartet” of China, Russia, Iran and North Korea who are acting together against the west, according to the newly appointed head of Labour’s defence review. George Robertson, a former Nato secretary general, said the UK had to be prepared to take on all four if necessary, reflecting western concerns that the grouping are increasingly sharing arms, components and military intelligence. Flanked by the new defence secretary, John Healey, Lord Robertson told a briefing that: “We’re confronted by a deadly quartet of nations increasingly working together,” and that Britain and its Nato allies have “got to be able to confront that particular quartet”. The peer was referring to the four nations considered hostile to the west and who are now believed to constitute the leading threat to the UK’s security as Islamist terrorism has subsided. Robertson, who was also a defence secretary under Tony Blair, was speaking as his appointment to lead a three-person defence review was announced by Healey. The strategic exercise will conclude in the first half of next year, and help ministers set defence and foreign policy priorities for the rest of the parliament. The review chief’s China phrasing was a marked shift in tone from the previous government’s approach, which preferred to describe Beijing as a “systemic challenge” rather than a threat, but reflects a toughening seen at last week’s Nato summit. In Washington DC, the 32-country alliance rebuked China for acting as a “decisive enabler” for Russia’s invasion of Ukraine, by supplying Moscow components for weapons and chemicals for explosives – the strongest criticism the north Atlantic alliance has ever made of Beijing. Robertson said that the “Nato summit last week in Washington made it perfectly clear that the challenge of China was something that had to be taken very, very seriously”, and that “what happens in the Asia-Pacific can happen in the Euro-Atlantic very quickly afterwards”. Iran and North Korea have also supplied drones and artillery shells respectively to Russia to support Vladimir Putin’s invasion of Ukraine – and tactics used by Moscow were in turn applied by Tehran when it launched a major missile and drone raid on Israel in April in response to the bombing of its embassy in Damascus. Last week, the US president, Joe Biden, also highlighted the fact the four countries were increasingly acting together. “It’s a concern that you have China, North Korea, Russia, Iran, countries that are not necessarily coordinated in the past looking to figure out how they can have a better impact,” though he said he would not spell out in public what he believed that impact was. The US leader said he wanted China’s president, Xi Jinping, to understand “there’s a price to pay” for continuing to assist Russia in the war in Ukraine. Healey praised Robertson, who will work alongside Fiona Hill, a British-born Russian affairs expert who has advised the US presidents George W Bush, Barack Obama and Donald Trump, and Gen Sir Richard Barrons, a former deputy chief of the UK defence staff, for taking on the review. The three represented, Healey said, the “very best combination of external experts we could put together”, and they will work together within the Ministry of Defence, consulting and taking submissions from the military, defence industry, academics and other experts, before producing the conclusions. Healey said he hoped the exercise would amount to “Britain’s defence review, not just the new Labour government’s defence review”. He said that it would take place “amid the war in Europe with Putin’s illegal invasion of Ukraine” and “conflict in the Middle East, growing threats and aggression and instability across the globe”. Its aim would be to “consider the threats we face, the capabilities we need, the state of our armed forces and also the resources available”. As well as Healey, the team will report to Keir Starmer, the prime minister, and Rachel Reeves, the chancellor, and its work will help determine when Labour would, as it has promised, lift defence spending to 2.5% of GDP from its existing level of 2.32% – an increase of about £5bn in real terms. Healey was cautious on when Labour may set out a timetable to reach the threshold, other than to say that it would be announced as part of a future “fiscal event”. A first budget is expected in the autumn, though the defence secretary would not say if a budgetary decision could be anticipated at that point. The new minister also said he had “not come into the job to cut armed forces numbers” and complained that the size of the British army had fallen below the previous government’s target of 73,000. He also insisted that if Trump is elected as US president it would not amount to a threat to Nato. Healey argued the Nato alliance was durable, having lasted 75 years since its creation in the aftermath of the second world war – and that the UK and other members would be pragmatic if the Republican returned to the White House, saying: “We will work with whatever president is elected.”","summary":"China, Russia, Iran and North Korea increasingly acting together against west, according to defence review chief\n\nBritain and its allies are facing a “deadly quartet” of China, Russia, Iran and North Korea who are acting together against the west, according to the newly appointed head of Labour’s defence review.\n\nGeorge Robertson, a former Nato secretary general, said the UK had to be prepared to take on all four if necessary, reflecting western concerns that the grouping are increasingly sharing arms, components and military intelligence.\n\n Continue reading...","url":"https://www.theguardian.com/politics/article/2024/jul/16/uk-and-its-allies-face-deadly-quartet-of-nations-says-defence-expert","image":"https://i.guim.co.uk/img/media/0bd32064eeeb91dbf2d2a8c444192b3534ee65e2/547_99_3362_2017/master/3362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZG","video":null,"publish_date":"2024-07-15 23:01:01","author":"Dan Sabbagh","authors":["Dan Sabbagh"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.011},{"id":251842986,"title":"Trump Media, gun stocks surge after assassination attempt","text":"Crypto stocks, gun stocks and shares of other companies that could benefit from a Donald Trump presidency jumped today after an assassination attempt on the Republican candidate boosted expectations he would win the November election. Trump’s survival after he was shot in the ear during a rally in Pennsylvania on Saturday increased his already considerable lead in betting odds over President Joe Biden. Those odds rose more later today after Trump chose U.S. Senator J.D. Vance to be his vice presidential running mate as the Republican Party officially nominated the former president to run again at the start of the party’s national convention in Milwaukee. On politics-wagering website PredictIt, contracts for a Trump election victory traded at 70 cents, up from 60 cents on Friday, with a potential payout of $1. Contracts for a Biden victory were at 26 cents. Shares of Trump Media & Technology Group, majority-owned by Trump, soared 31%, lifting its stock market value to $7.7 billion, despite revenue comparable to two U.S. Starbucks shops. Trump Media is the parent company of the social media platform Truth Social, and its shares have now surged 132% in 2024 as retail traders bet Trump will win a second term as president. “It’s nearly four months to go (until the election) and things can change, but today the markets are betting on Trump being the victor,” said Ben Laidler, head of equity strategy at Bradesco BBI, adding that Trump Media “is the tip of the spear and the most sensitive to a Trump victory.” Shares of electric vehicle maker Tesla ended 1.8% higher after billionaire CEO Elon Musk publicly endorsed Trump following the shooting. Tesla gave back earlier gains of as much as 7% after the announcement of Vance as Trump’s running mate. Vance last year introduced legislation to eliminate EV tax subsidies and replace them with tax credits for U.S.-made gasoline or diesel-powered vehicles. The bill would gut a core part of the White House clean vehicle strategy and has no realistic chance of winning approval in the current Democratic-controlled Senate. Crypto stocks soared today, tracking a 10% rally in bitcoin to a two-week high. Trump has presented himself as a champion of cryptocurrency. Crypto exchange Coinbase Global and bitcoin miners Riot Platforms and Marathon Digital jumped between 11% and 18%. Long-dated U.S. bond yields rose on expectations that Trump policies would drive up government debt and stoke inflation, while the benchmark S&P 500 rose 0.3%. “Most investors are not changing their overall commitment to U.S. equities. After all, the broad stock market rose under the last Trump administration and has risen under the Biden administration as well,” said Rick Meckler, partner at Cherry Lane Investments. Gun makers and ammunition stocks Smith & Wesson Brands, Sturm Ruger & Company and Ammo jumped between 5% and 15%. Gun stocks in the past have surged following mass shootings, civil unrest and fears of gun control that have led to people to buy more firearms out of fear that their availability would become limited. Shares of private prison operators Geo Group and CoreCivic each jumped about 8%. Both are potential beneficiaries of a Trump presidency as he has promised to crack down on illegal immigration, which could boost demand for detention centers. Video-sharing platform Rumble, popular with conservatives, soared 21%. Clean energy stocks slipped as Trump has said he would reverse many of the Biden administration’s signature climate policies, including tax incentives, if he wins the election. The Invesco Solar ETF fell 5.9% and the iShares Global Clean Energy ETF fell 3.9%. The iShares MSCI China ETF dropped about 2%. Investors believe a second Trump presidency could fuel trade tensions between Beijing and the United States. U.S. voters view Trump as the better candidate for the economy, according to Reuters/Ipsos polls, even as Biden’s White House seeks to benefit from a solid economy with inflation slowing and low unemployment. “In the absence of any real policy proclamations from Trump, traders are finding themselves having to speculate,” said Mark Malek, chief investment officer of Siebert Financial Corp. “A second Trump presidency would mean expansionary economic stimulus in general, lower income taxes, less regulation, and increased tariffs.” Additional reporting by Pranav Kashyap in Bengalaru.","summary":"Crypto stocks, gun stocks and shares of other companies that could benefit from a Donald Trump presidency jumped today after an assassination attempt on the Republican candidate boosted expectations he would win the November election. Trump&#8217;s survival after he was shot in the ear during a rally in Pennsylvania on Saturday increased his already considerable lead in betting odds over President Joe Biden. Those odds rose more later today after Trump chose U.S. Senator J.D. Vance to be his vice presidential running mate as the Republican Party officially nominated the former president to run again at the start of the party&#8217;s national convention in Milwaukee. On politics-wagering website PredictIt, contracts for a Trump election victory traded at 70 cents, up from 60 cents on Friday, with a potential payout of $1. Contracts for a Biden victory were at 26 cents. Shares of Trump Media &#038; Technology Group, majority-owned by Trump, soared 31%, lifting its stock market value to $7.7 billion, despite rev","url":"https://www.staradvertiser.com/2024/07/15/breaking-news/trump-media-gun-stocks-surge-after-assassination-attempt/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240715_brk_tme01.jpg","video":null,"publish_date":"2024-07-15 23:00:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":0.046},{"id":251843056,"title":"Biden defends mental acuity during NBC interview: ‘Pretty damn good’","text":"President Joe Biden defended his mental acuity Monday but said he understands why people are asking “legitimate” questions about his age and fitness for office. The president sat for an interview, scheduled prior to the assassination attempt on former President Donald Trump over the weekend, with NBC News’s Lester Holt at the White House before departing Washington, D.C., for Las Vegas, Nevada, on Monday evening. During the interview, Holt pressed Biden on his age, yielding an exchange that NBC characterized as “combative.” “I’m old,” the president responded. “But I’m only three years older than Trump, number one. And number two, my mental acuity has been pretty damn good. I’ve gotten more done than any president has in a long time in three-and-a-half years. I’m willing to be judged on that.” “I understand why people say, ‘God, he’s 81 years old. Whoa. What’s he gonna be when he’s 83 years old, 84 years?'”, the president continued. “It’s a legitimate question to ask.” Biden had slowed down his campaign attacks against Trump in the days following the assassination attempt. Still, a number of Republicans, including Trump’s new running mate, Sen. J.D. Vance (R-OH), blamed Biden’s rhetoric for emboldening suspected shooter Thomas Matthew Crooks.CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Holt also questioned the president Monday about his specific use of the word “bullseye” in discussing Trump in the past. Biden conceded that using that particular word was a “mistake” but still pressed viewers to put “crosshairs” on Trump’s “agenda.”","summary":"President Joe Biden defended his mental acuity Monday but said he understands why people are asking &#8220;legitimate&#8221; questions about his age and fitness for office. The president sat for an interview, scheduled prior to the assassination attempt on former President Donald Trump over the weekend, with NBC News&#8217;s Lester Holt at the White House before [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3083995/biden-defends-mental-acuity-nbc-interview-pretty-damn-good/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/biden-mental-acuity.webp","video":null,"publish_date":"2024-07-15 22:57:26","author":"Christian Datoc","authors":["Christian Datoc"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.098},{"id":251841346,"title":"With judge tossing Trump’s classified-docs case, Dems should now end ALL their lawfare","text":"Donald Trump is on a roll: Just two days after he dodged a near-fatal bullet, a federal judge threw out special counsel Jack Smith’s classified-documents case against him. Indeed, US District Judge Aileen Cannon effectively tossed Smith himself, ruling that his appointment was unconstitutional. That doesn’t immediately remove Smith from his other Trump case, alleging the ex-prez plotted to overthrow the 2020 election, but the Supreme Court recently put that one in deep doubt, too — a ruling that could also derail Manhattan DA Alvin Bragg’s victory in New York state courts. Democrats’ multipronged, utterly cynical “lawfare” drive effort to derail Trump before Election Day is (rightly) failing as badly as Thomas Crooks’ bullets. Maybe its time to honor President Biden’s call for unity by dropping the whole dirty lawfare campaign? Cannon found Smith had no legal authority to prosecute Trump in the documents case; it was up to Congress to appoint “constitutional officers” and approve spending for such a prosecution: “That role cannot be usurped by the executive branch or diffused elsewhere.” She didn’t even get into the “selective prosecution” issue, namely how President Biden, Hillary Clinton and others have skated despite similar document abuses. Look: Polls of swing-state voters already show that the “threat to democracy” issue hurts Biden worse than Trump, significantly because of these persecution/prosecutions. House Speaker Mike Johnson has it right: “As we work to unify this country . . . we must also work to end the lawfare and political witch hunts that have unfairly targeted President Trump and destroyed the American people’s faith in our system of justice.” Focus on trying to beat Trump in the voting booth, not the courts. Joe got the spirit right in his Monday night remarks: Settle our differences with the “battle box.”","summary":"If the attempt to assassinate Donald Trump wasn’t enough, a federal judge's dismissal of the classified-documents case against him should prompt Democrats to drop their lawfare cases against him.","url":"https://nypost.com/2024/07/15/opinion/after-judge-tossed-trumps-classified-docs-case-dems-should-end-their-lawfare/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-5syk84e4n-1721084142796.jpg?quality=75&strip=all&1721069766&w=1200","video":null,"publish_date":"2024-07-15 22:56:31","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.331},{"id":251843954,"title":"Secret Service protection for third presidential candidate","text":"US President Joe Biden has directed the Secret Service to protect independent presidential candidate Robert F Kennedy Jr, after the attempted assassination of Donald Trump, the Homeland Security secretary said today. Kennedy is a longshot to win Electoral College votes, much less the presidency. But his campaign events have drawn large crowds of supporters and people interested in his message. His campaign has been urging the president to provide him with Secret Service protection for months, and has sent multiple requests after various incidents. In October, a man was arrested after trespassing twice in one day at Kennedy's Los Angeles home, and a month earlier, an armed man accused of impersonating a federal officer was taken into custody outside a Kennedy campaign event. LIVE UPDATES: Widow reveals last words of 'hero' killed at Trump rally Kennedy's uncle, President John F Kennedy, and his father, Senator Robert F Kennedy, were both assassinated. \"Thank you, President Biden, for extending me Secret Service protection,\" Kennedy said in a statement. He also thanked his private security firm, Gavin de Becker and Associates, \"for keeping me safe for the past 15 months of my presidential campaign.\" Homeland Security Secretary Alejandro Mayorkas said Biden had directed the protection for Kennedy \"both prior to and after the events of this past weekend.\" READ MORE: JD said Trump could be 'America's Hitler'. Now he might join him in the White House The Secret Service is legally required to protect major party presidential and vice presidential candidates and their families 120 days out from a general election, but third-party candidates are treated on an as-needed basis. Kennedy, who has paid millions for private security, said the cost limited his ability to campaign. The Department of Homeland Security acknowledged in its 2024 budget overview that recent requests for candidate protection were coming in earlier than in the past. Threats to political candidates are common, but law enforcement officials have said that there has been an uptick in violent rhetoric since the weekend attack at the Trump rally. Mayorkas said both Biden and Trump are \"constantly the subject of threats.\" READ MORE: Federal judge dismisses Trump classified documents case \"We are in a heightened and very dynamic threat environment,\" he said. Kennedy met with Trump Monday \"to discuss national unity,\" Kennedy spokesperson Stefanie Spear said. He also hopes to meet with Democratic leaders, she said, adding he is not dropping out of the race. With a famous name and a loyal base, Kennedy has the potential to do better than any third-party presidential candidate since Ross Perot in the 1990s. But he didn't participate in the first presidential debate on June 27. Both the Biden and Trump campaigns, who fear he could be a spoiler, bypassed the nonpartisan debate commission and agreed to a schedule that essentially left out Kennedy. READ MORE: Authorities hunt for clues, but motive of Trump shooter remains elusive Supporters rally for Trump as photos show how shooting unfoldedView Gallery Kennedy, who last year challenged Biden for the Democratic nomination before launching an independent bid, has argued that his relatively strong showing in a few national polls gives his candidacy heft. Polls during the 2016 presidential campaign regularly put libertarian Gary Johnson's support in the high single or low double digits, but he ultimately received only about three per cent of the vote nationwide. Trump became the official Republican presidential nominee on Monday after receiving the votes of enough delegates at the Republican National Convention. He was not seriously injured in the shooting over the weekend in Pennsylvania. There is an independent review of the attack. Mayorkas said Trump's protection has been enhanced based on the \"evolving nature of the threats to the former president\" and his shift from presumptive nominee to nominee. FOLLOW US ON WHATSAPP HERE: Stay across all the latest in breaking news, celebrity and sport via our WhatsApp channel. No comments, no algorithm and nobody can see your private details.","summary":"R﻿obert F Kennedy Jr&#x27;s father and uncle were both slain by assassins in the 1960s.","url":"https://www.9news.com.au/world/donald-trump-shooting-joe-biden-orders-secret-service-to-protect-robert-f-kennedy-jr/5431ffe8-9c13-461b-96a7-7a5dc19e0227","image":"https://imageresizer.static9.net.au/x5vyvVGGpWDR0TqtEA4rckgFl-w=/0x413:6000x3788/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Faa5494d3-7c2b-4ba8-86d7-7cbdc243e75a","video":null,"publish_date":"2024-07-15 22:56:22","author":"9News,Associated Press","authors":["9News","Associated Press"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.02},{"id":251841418,"title":"Donald Trump reveals Ohio Senator JD Vance is his running mate in the US presidential election","text":"Donald Trump has announced that Ohio Senator JD Vance — who once proposed to ban gender-affirming care for minors in the state — is his running mate for the US presidential election. While the current president Joe Biden has been working with Vice President Kamala Harris since she became his running mate in August 2020, Trump has only recently revealed who he has chosen as his Republican running mate for the general election this year. The former president, who is currently rallying for a non-consecutive year second presidential term, announced his new running mate to be Vance via his social network, Truth Social. Trump – who was targeted in an assassination attempt last week – revealed that the 39-year-old former venture capitalist will be his running mate for the US election in November. Vance is a New York Times best-selling author and graduated from Yale Law School. He also proposed a ban on gender-affirming care for minors during his time as Ohio Senator. Vance announced the bill, called the “Protect Children’s Innocence Act”, in 2023. The bill mirrored several proposed bans on gender-affirming healthcare across the US by outlawing gender-affirming surgeries and physically reversible puberty blockers for minors. “Under no circumstances should doctors be allowed to perform these gruesome, irreversible operations on underage children,” Vance said in a statement at the time, after announcing the bill. His new role might come as a shock to some, given he reportedly once called himself a “never Trumper”. Vance reportedly described the prospective president as an “idiot” and “America’s Hitler” after his 2016 election win. In recent times, though, Vance has appeared to change his tune. It was reported that the politician attended the former president’s recent hush money trial in New York.","summary":"Donald Trump has announced that Ohio Senator JD Vance — who once proposed to ban gender-affirming care for minors in the state — is his running mate for the US presidential election. While the current president Joe Biden has been working with Vice President Kamala Harris since she became his running mate in August 2020, [&#8230;]\n\n\nThe post Donald Trump reveals Ohio Senator JD Vance is his running mate in the US presidential election appeared first on PinkNews | Latest lesbian, gay, bi and trans news | LGBTQ+ news.","url":"https://www.thepinknews.com/2024/07/15/donald-trump-jd-vance/","image":"https://www.thepinknews.com/wp-content/uploads/2024/07/GettyImages-1240191090.jpg","video":null,"publish_date":"2024-07-15 22:53:50","author":"Gabriella Ferlita","authors":["Gabriella Ferlita"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.12},{"id":251841344,"title":"Secret Service chief Kim Cheatle should be gone already","text":"Kim Cheatle must resign, or get fired. The near-assassination of former President Donald Trump is the Secret Service’s most stunning failure in decades. That’s the opinion of her boss, Homeland Secretary Alejandro Mayorkas. “When I say that something like this cannot happen, we are speaking of a failure,” he said Monday on CNN; on ABC, it was: “A direct line of sight like that to the former president should not occur.” Follow The Post’s latest stories on the assassination attempt against former President Donald Trump: Trump says he ‘felt the bullet ripping through my skin’ in first statement since assassination attempt Donald Trump urges the nation to not let ‘evil win’ and to ‘fear not’ after shooting Gunman behind attempted assassination of Trump had head blown off by Secret Service, sources say; rally-goer killed Trump shooter Thomas Matthew Crooks was loner ‘relentlessly’ bullied in high school: classmate How Trump’s split-second head turn may have saved his life from assassin’s bullet Ex-volunteer fire chief Corey Comperatore ID’d as Trump sniper victim, shielded his daughter from assassin’s bullets Search for Trump shooter’s motive delayed by explosives found in home and car: sources Keep up to date with The Post’s live blog on the assassination attempt on Trump The total security breakdown at Trump’s Butler, Pa., rally — which came an inch from killing the ex-prez, and did take Corey Comperatore’s life with two other civilians put in critical condition — is on her, no matter what scapegoats her minions offer up. Despicably, she’s so far refused to to accept blame, with the Secret Service instead faulting local police for failing to secure the critical rooftop. As if officers in rural Pennsylvania are supposed to step up when the professionals charged with protecting an ex-and-likely-future-president don’t do their jobs. She certainly doesn’t need to stay in the job to testify before Congress next week about what went wrong Saturday. Not that she’s the only one facing questions: The Post has learned that she got the directorship thanks mainly to a close relationship with First Lady Jill Biden after serving on the Bidens’ detail when Joe was veep. Or perhaps the finger needs pointing at Anthony “Rasputin” Bernal, who we’re told pushed her to become the first woman Secret Service chief. One who served his obsession with “diversity” as she proudly prioritized making the agency 30% female by 2030. Sorry: Protecting the principals has to be the Service’s only priority. Under Cheatle’s leadership, it botched that job, and only luck prevented an assassination that could’ve thrown the nation into crisis. She should be gone already.","summary":"The total security breakdown at Trump’s Butler, Pa., rally — which came an inch from killing the ex-prez, and did take Corey Comperatore's life with two other civilians put in critical condition — is on her, no matter what scapegoats her minions offer up.","url":"https://nypost.com/2024/07/15/opinion/secret-service-chief-kim-cheatle-should-be-gone-already-and-fired/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/united-states-secret-service-director-83241663_63f9ba.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-15 22:53:09","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.289},{"id":251843582,"title":"NFL Hall of Famer says he was unjustly handcuffed and 'humiliated' on a flight","text":"CTVNews.ca Top Stories Follow Live: JD Vance officially nominated at RNC The Republican National Convention kicked off this week, with delegates and officials descending on Wisconsin amid the tumult that follows a Saturday assassination attempt on Trump as he becomes the GOP’s official nominee. Follow for live updates of the RNC. 'Somebody who knows Canada well': Ambassador says of Trump running mate JD Vance Canada's ambassador to the United States says Sen. JD Vance, the recently announced pick for former U.S. president and Republican nominee Donald Trump's running mate, 'knows Canada well.' Trucker who caused Broncos crash applies to have permanent resident status returned The truck driver who caused the deadly Humboldt Broncos bus crash has applied to have his permanent resident status returned. Sask. TikTok star Bella Brave dies after latest hospitalization Sask. TikTok star \"Be Brave\" Bella Thomson has died. She was 10-years-old. Manitoba man who rammed gates of Rideau Hall granted statutory release A Manitoba man who armed himself and rammed the gates of Rideau Hall with a truck in 2020 to confront Prime Minister Justin Trudeau has been granted statutory release. Motive of man who tried to assassinate Donald Trump remains elusive Former U.S. president Donald Trump called for unity and resilience after an attempt on his life injected fresh uncertainty into an already tumultuous presidential campaign, while President Joe Biden implored Americans to 'cool it down' in the final stretch and 'resolve our differences at the ballot box.' 'Balaclava rapist' Larry Takahashi gets full parole more than 40 years after attacks A serial sex offender known as the \"balaclava rapist\" for attacking 23 women in Edmonton more than 40 years ago has been granted full parole while he continues to serve three concurrent life sentences. Who is JD Vance? Things to know about Donald Trump's pick for vice president Former U.S. President Donald Trump on Monday chose Sen. JD Vance of Ohio to be his running mate as he looks to return to the White House. NFL Hall of Famer says he was unjustly handcuffed and 'humiliated' on a flight Pro Football Hall of Famer Terrell Davis said Monday he was 'humiliated' after being handcuffed and removed from a United Airlines flight, then later apologized to by law enforcement, over the weekend. Canada 'Balaclava rapist' Larry Takahashi gets full parole more than 40 years after attacks A serial sex offender known as the \"balaclava rapist\" for attacking 23 women in Edmonton more than 40 years ago has been granted full parole while he continues to serve three concurrent life sentences. Labour groups apply to intervene in appeal of Sask. law that forces workers to 'out' trans youth Three unions have joined forces to intervene in the appeal case over Saskatchewan's pronoun consent law. Legault rectifies remarks that Quebec has no political violence Premier François Legault is being invited to brush up on his history after declaring today that politicians in Quebec don't face the kind of violence seen over the weekend in the United States. Mayor of Kamloops, B.C., vows to stay on despite calls to resign Stripped of some of his official powers and facing calls to resign, the mayor of Kamloops, B.C. was defiant Monday, telling supporters he intends to stay on as mayor despite his ongoing feud with the rest of city council. Pro-Palestinian encampment at the University of Manitoba ends after two months A pro-Palestinian encampment at the University of Manitoba has been dismantled more than two months after it was set up. Gaza protesters remain as B.C. university's deadline to leave expires A deadline for pro-Palestinian protesters to dismantle an encampment at Vancouver Island University in Naniamo, B.C., has expired without the demonstrators leaving. World Biden says it was a 'mistake' to say he wanted to put a 'bull's-eye' on Trump President Joe Biden told NBC News in an interview airing Monday that it was a 'mistake' to say he wanted to put a 'bull's-eye' on Republican nominee Donald Trump, but argued that the rhetoric coming from his opponent was more incendiary while warning that Trump remained a threat to democratic institutions. Donald Trump announces Ohio Sen. JD Vance as VP pick Former U.S. President Donald Trump chose Sen. JD Vance of Ohio as his running mate on Monday, picking a onetime critic who became a loyal ally and is now the first millennial to join a major-party ticket at a time of deep concern about the advanced age of America's political leaders. Biden orders Secret Service to protect RFK Jr. after attempt on Trump's life President Joe Biden has directed the U.S. Secret Service to protect independent presidential candidate Robert F. Kennedy Jr., after the attempted assassination of Donald Trump, the Homeland Security secretary said Monday. The man killed at a Trump rally died shielding his family. Neighbours share stories of 2 others hurt The bystander killed when a sniper opened fire at a rally for former U.S. President Donald Trump in Pennsylvania was a beloved family man and girl dad who served his community with 'quiet resilience,' his loved ones said Monday. Amid chaos and gunfire, Trump raised his fist and projected a characteristic image of defiance An image of Donald Trump, his face smeared with blood and forcing his right fist through a tangle of agents' arms, created iconic photographs and video that are sure to become an indelible part of history. Special counsel to appeal judge's dismissal of classified documents case against Donald Trump Special counsel Jack Smith intends to appeal a judge's dismissal of the classified documents case against former President Donald Trump. Politics Manitoba man who rammed gates of Rideau Hall granted statutory release A Manitoba man who armed himself and rammed the gates of Rideau Hall with a truck in 2020 to confront Prime Minister Justin Trudeau has been granted statutory release. Provincial-federal turf battles over health, housing on agenda of premiers meeting in Halifax Healthcare, housing and the environment will be on the agenda as Canada's premiers gather in Halifax for the annual summer meeting of the Council of the Federation. 'Somebody who knows Canada well': Ambassador says of Trump running mate JD Vance Canada's ambassador to the United States says Sen. JD Vance, the recently announced pick for former U.S. president and Republican nominee Donald Trump's running mate, 'knows Canada well.' Health Ontario reports rise in mpox cases. Here is what you need to know Ontario is reporting a rise in mpox cases, serving as a reminder that the infectious disease is still present, despite a descent from its peak two years ago. What a doctor needs to check after cardiac arrest, according to new research In the years following an out-of-hospital cardiac arrest, women are more likely than men to treat anxiety or depression, according to a new report. Tips for staying safe against blue-green algae this summer With temperatures rising for the oncoming summer, many shutdowns due to the toxic blue-green algae has made for a tough time finding a safe spot to swim in the region – with one of the most recent shutdowns at Cunard Pond Beach in Halifax. Sci-Tech Can AI be an author? Federal Court asked to decide in new copyright case The Federal Court of Canada is being asked to declare that only humans — and not artificial intelligence — can be considered authors under Canada’s copyright law. Scientists have confirmed a cave on the moon that could be used to shelter future explorers Scientists have confirmed a cave on the moon, not far from where Neil Armstrong and Buzz Aldrin landed 55 years ago, and suspect there are hundreds more that could house future astronauts. Fossil of an ancient shark that swam in the age of dinosaurs solves centuries-long mystery During the Cretaceous Period, a genus of sharks roamed the sea with rows of unusual teeth. Mostly large and rounded, these chompers were not meant to slice through their prey, but to grind and crush shelled creatures. Entertainment Jennifer Lawrence to film movie in Alberta later this summer A new movie staring Jennifer Lawrence will be filming in Alberta later this summer. Judge removed from long-running gang and racketeering case against rapper Young Thug and others The judge overseeing the long-running racketeering and gang prosecution against rapper Young Thug and others has been removed from the case after two defendants sought his recusal, citing a meeting the judge held with prosecutors and a state witness. In Shannen Doherty’s final role, she rebelled against cancer by sharing her journey For all the things that Shannen Doherty had to fight for over the years – from her reputation to her health – it was clear in what would be one of the final episodes of her podcast that the actress was putting everything into the battle for her life. Business Corus Entertainment says ongoing job cuts will amount to 25% of full-time positions Corus Entertainment Inc. says it expects to have slashed 25 per cent of its full-time workforce by the end of next month compared with the beginning of its 2023 fiscal year, as the company continues to \"aggressively cut costs.\" Canadian Natural fined for not stopping birds from nesting on tailings pond island A major oilsands producer has been fined after hundreds of birds, wolves and coyotes were exposed to toxins at one of its tailings ponds. Tourism association calls for end to LCBO strike, says dispute hurting operators The Tourism Industry Association of Ontario is calling for a swift resolution to an ongoing strike by the province's liquor store workers, saying the labour dispute is affecting tourism operators during their peak season. Lifestyle My simple travel hack that saves us money on vacation meals One writer used to make do with deli sandwiches and brought-from-home snacks, but now they have a secret weapon for quick but satisfying road trip lunches. NEW NEW | Things flight attendants say they would never do when travelling For some airline passengers, flying can be a daunting and stressful journey. For others, it's a welcome experience to see the world from hundreds of feet high. CTVNews.ca spoke with a Canadian flight attendant to find out what he wouldn't advise passengers to do before and during flights. Work friends can be hard to find. Here's how to combat loneliness in the workplace As North America navigates what U.S. Surgeon General Vivek Murthy described last year as a loneliness epidemic, employers and employees are trying to address what for many people is a lack of real friendships at work. Sports Colombia's soccer federation president and son among 27 arrested in chaos at Copa America final Colombia's soccer federation president and his son were among 27 people arrested during the crowd control issues that broke out Sunday at the Copa America final between Argentina and Colombia, police said Monday. NFL Hall of Famer says he was unjustly handcuffed and 'humiliated' on a flight Pro Football Hall of Famer Terrell Davis said Monday he was 'humiliated' after being handcuffed and removed from a United Airlines flight, then later apologized to by law enforcement, over the weekend. River Seine still not safe for swimming on most days due to E. Coli bacteria levels, with Olympics set to start on July 26 Weeks before the Olympic Games are set to begin in Paris, the River Seine is still not safe for swimming on most days due to high levels of E. Coli bacteria in the water, according to official data. Autos Video released of wild police car chase involving white Lamborghini north of Toronto Police north of Toronto have released dramatic video of a car chase that led officers across York Region in pursuit of a Lamborghini SUV that was clocked at speeds in excess of 200 km/h. Novice driver fled police travelling 188 km/h on Hwy. 11 while allegedly impaired A 31-year-old man from Milford Bay is facing multiple charges following a traffic stop last week. 4 in 10 Canadians say theft is a risk factor in vehicle purchasing: Nanos As many as four out of 10 Canadians say it is 'important' to know if a vehicle they're interested in purchasing is more likely to be targeted by thieves, according to a new Nanos Research survey. Local Spotlight Sudbury's Big Nickel celebrates its 60th birthday An event July 22 at Dynamic Earth in Sudbury will mark the 60th anniversary of the iconic Big Nickel, the largest coin in the world. Cyclist riding across Canada for children's charity stops in Montreal Cyclist Jagjeet Singh cruised through Montreal on Sunday morning as he rides across the country to raise money for a children's charity. Rare marine fossil found in eastern Saskatchewan A rare ammonite fossil – about 75 million years old - has been discovered in eastern Saskatchewan. Ontario dad highlights Calgary Flames' act of kindness Seven-year-old goalie Hudson Hardill is an unlikely Calgary Flames fan, being that he lives in Peterborough, Ont., and his dad Chris is a Toronto Maple Leafs fan. 'I nearly died': WestJet employee and Spice Girls superfan dances with Mel C A WestJet employee's chance encounter on a recent flight spiced up her life in a big way. He thought his gnomes were stolen. But then a secret society returned them A Kelowna, B.C., man says he's always liked gnomes because they have a 'bit of mystery' to them. And he recently got a taste of that whimsy when his garden gnomes disappeared, and came back to him in a peculiar fashion. Toronto's iconic 'Leslieville dollhouse' set to hit the market on Thursday After more than 50 years, Toronto's iconic 'Leslieville dollhouse' will soon have a new owner. Little free Blockbuster set up in Winnipeg One man is bringing a blast from the past to a Winnipeg community. 'Her whole future ahead of her': Sask. photographer captures Manitoba graduate posing on iceberg Some say a photograph is simply a memory frozen in time – and a high school graduation photo taken in Churchill, Man. takes that adage to a completely new level. Vancouver Wildfire disrupts traffic along Highway 1 between Chilliwack and Hope Local and provincial crews are responding to a small wildfire in B.C.'s Fraser Valley that disrupted traffic along Highway 1 for several hours Monday. Police nab Metro Vancouver teens allegedly street racing at twice the speed limit Police in Port Moody, B.C. say they caught a pair of teenaged drivers racing down a city street at more than twice the speed limit over the weekend. Man arrested after B.C. mammoth statue set ablaze Mounties say a 41-year-old man is facing possible criminal charges, including arson, after a driftwood mammoth sculpture was set ablaze Monday in Colwood, B.C. Toronto Alcohol expansion plans accelerated in Ontario as LCBO strike continues As the LCBO strike enters its second week, the Ontario government is speeding up its alcohol expansion plans, announcing licensed grocery stores will be able to start selling ready-to-drink (RTD) beverages as of July 18. Toronto not in a position to assume operations of shuttered Ontario Science Centre, staff say The City of Toronto is not in a position to take over operations of the now shuttered Ontario Science Centre, staff say. Collision closes westbound lanes of Highway 401 near DVP in Toronto A portion of Highway 401 in Toronto is closed following a collision near the Don Valley Parkway on Monday evening. Calgary Calgary shelters look for support as heat wave puts city's most vulnerable at risk Calgary will see another stretch of hot weather this week, prompting local agencies that assist the city's most vulnerable to ask for help. Calgary e-scooter changes coming to 17 Avenue S.W. Users will no longer be able to ride Calgary’s shared e-scooters on a stretch of 17 Avenue S.W. Calgary to increase water pressure in feeder main, could ease water restrictions Thursday City officials say an additional pump at the Bearspaw water treatment plant will be activated by mid-day Monday to increase water speed and pressure on the feeder main. Ottawa SEVERE THUNDERSTORM WATCH SEVERE THUNDERSTORM WATCH | Thunderstorms bring heavy downpours to Ottawa and region A line of severe thunderstorms moving across eastern Ontario brought heavy downpours to the capital Monday afternoon and evening. Former Ottawa police chief comments on dignitary security in wake of attempted assassination of Donald Trump Days after the attempted assassination of former U.S. President Donald Trump, residents in Ottawa remain shocked it happened at all, as questions are raised about security measures for Canadian officials and visiting dignitaries. Manitoba man who rammed gates of Rideau Hall granted statutory release A Manitoba man who armed himself and rammed the gates of Rideau Hall with a truck in 2020 to confront Prime Minister Justin Trudeau has been granted statutory release. Montreal Legault rectifies remarks that Quebec has no political violence Premier François Legault is being invited to brush up on his history after declaring today that politicians in Quebec don't face the kind of violence seen over the weekend in the United States. Heat warning in place for Greater Montreal The Greater Montreal area is under a heat warning as Environment and Climate Change Canada states a warm and humid air mass could lead to a humidex value of 40. Amazon warehouse workers sound alarm ahead of Prime Day Amazon's annual Prime Day event will be held on July 16-17, but behind the deals lie health and security concerns for warehouse and delivery workers. Edmonton Chris Jones fired by Edmonton Elks The Edmonton Elks fired Chris Jones on Monday after the Canadian Football League team's head coach and general manager guided it to a 0-5 start to the 2024 season. Firefighters have responded to 59 calls for people, pets in vehicles so far in July As temperatures begin to climb again in the city, Edmonton Fire Rescue Services is issuing yet another warning to drivers not to leave animals or people in vehicles. Oilers players starting to appreciate special Stanley Cup run and what it'll take to return to final The wound is still fresh, but some Edmonton Oilers players are beginning to appreciate how extraordinary their run to Game 7 of the Stanley Cup Final was — and how important it'll be when they mount another attempt next season. Atlantic Nova Scotia inmate dies at medium security prison: Correctional Service Canada An inmate has died at a medium-security prison in Springhill, N.S., according to the Correctional Service of Canada (CSC). Late week cold front expected to break Maritime heat wave A cold front expected to cross the Maritimes late Wednesday and Thursday will break the current heat wave. Community effort and heroic act from jet skiers help avoid disaster at Pointe-du-Chêne Wharf Community heroics helped avert disaster when a boat caught on fire inside the marina at the Pointe-du-Chêne Wharf in Shediac, N.B. Winnipeg Manitoba man who rammed gates of Rideau Hall granted statutory release A Manitoba man who armed himself and rammed the gates of Rideau Hall with a truck in 2020 to confront Prime Minister Justin Trudeau has been granted statutory release. Man killed in 'targeted' shooting outside soccer game in Winnipeg: police A man has died after a shooting following a soccer game in Winnipeg over the weekend. Pro-Palestinian encampment at the University of Manitoba ends after two months A pro-Palestinian encampment at the University of Manitoba has been dismantled more than two months after it was set up. Regina Sask. TikTok star Bella Brave dies after latest hospitalization Sask. TikTok star \"Be Brave\" Bella Thomson has died. She was 10-years-old. Labour groups apply to intervene in appeal of Sask. law that forces workers to 'out' trans youth Three unions have joined forces to intervene in the appeal case over Saskatchewan's pronoun consent law. Regina contractor pleads guilty to defrauding more than 50 customers Regina-based company Prairie Boy Windows and Doors pleaded guilty in Provincial Court Monday on fraud charges. Kitchener Search continues for two missing women in the Grand River The search continues for two missing boaters in Kitchener, Ont. who reportedly ran into trouble this weekend on the Grand River. Fire destroys new home builds in Brant County A fire that destroyed newly-built homes in Brant County is being treated as suspicious. Airbags stolen from 10 Honda Civics in Guelph Guelph Police say at least 10 airbags were stolen from Honda Civics over the weekend. Saskatoon Labour groups apply to intervene in appeal of Sask. law that forces workers to 'out' trans youth Three unions have joined forces to intervene in the appeal case over Saskatchewan's pronoun consent law. Trucker who caused Broncos crash applies to have permanent resident status returned The truck driver who caused the deadly Humboldt Broncos bus crash has applied to have his permanent resident status returned. Saskatoon Blades will need to find a new head coach The Saskatoon Blades will soon be on the hunt for a new head coach. Northern Ontario Timmins, Ont., woman learns to deal with extremely painful arthritis Psoriasis is a common auto-immune condition – and some patients also develop a form of arthritis that can be debilitating. Police stress safety on trails after another fatal ATV crash in northern Ont. Following another fatal all-terrain vehicle crash, this time in Powassan, Ontario Provincial Police are calling on ATV drivers to take every safety precaution they can before going out in the trails. Most desirable neighbourhoods in northern Ont. to live in: RE/MAX Here are the most desirable neighbourhoods in northern Ontario to live in according to a new real estate report that explores numerous factors. London 'Diverted safe supply is being resold into our community': London police confirm drug diversion a growing concern For the first time, London police are speaking out about the diversion of safe supply drugs happening in the city. VIDEO VIDEO | Torrential downpours flood city streets Heavy rainfall in the London area has caused flooding on many streets throughout the city. Parts of the region are either under a severe thunderstorm watch or a warning as well as a heat warning. 'We know the undertow in that area is dangerous': Calls for safety improvements near Port Stanley breakwall. Search for missing 14 year old continues in Lake Erie. Barrie Barrie man charged with murder in roommate’s death Second-degree murder charge against Sonny Stephens of Barrie in death of Eric Beecroft. LOOK BACK LOOK BACK | Remembering the 'catastrophic' Barrie tornado on 3rd anniversary It's been three years since a tornado stormed through a Barrie neighbourhood on July 15, 2021, leaving destruction in its wake in what Environment Canada called a sneak attack. 1 person dead after being struck by train along Barrie GO line One person is dead after being struck by a GO train along Barrie's Go Line on Monday. Windsor ‘There's no place for violence in any of this’: Shock and dismay continue in Windsor two days after Trump assassination attempt Nearly 48 hours after the attempted assassination of former U.S. President and current presidential hopeful Donald Trump, people in Windsor, Ont. continue to condemn the violence across the border. More needs to be done downtown, despite successful block parties Windsor is a city of dreams. Host it and they will come. A large group of soccer fans gathered to celebrate the Copa America Cup final between Argentina and Columbia Sunday night. Another successful block party in downtown Windsor. Streetcar No. 351 move causes temporary Riverfront Trail closure A portion of Windsor, Ont.’s Riverfront Trail is closed Monday until Aug. 3 to allow the city to move Streetcar Number 351. Vancouver Island Man arrested after B.C. mammoth statue set ablaze Mounties say a 41-year-old man is facing possible criminal charges, including arson, after a driftwood mammoth sculpture was set ablaze Monday in Colwood, B.C. 'Balaclava rapist' Larry Takahashi gets full parole more than 40 years after attacks A serial sex offender known as the \"balaclava rapist\" for attacking 23 women in Edmonton more than 40 years ago has been granted full parole while he continues to serve three concurrent life sentences. Mounties say man with bra on head tried to stab stranger in Nanaimo, B.C. Mounties on Vancouver Island are searching for a suspect who allegedly tried to stab a Nanaimo resident while he was walking his dog in the city last week. Kelowna Motorcyclist seriously injured in Kelowna crash: RCMP A motorcyclist was severely injured in a crash with an SUV Sunday afternoon, according to the Kelowna RCMP. Crews searching for Alta. man swept away by river in B.C. A search effort is underway for a man who was swept away by the North Thompson River in Kamloops on Friday. 1 dead, 17 displaced after Kelowna apartment fire One person is dead and 17 others have been displaced after a stubborn fire burned overnight in a Kelowna apartment building. Lethbridge Southern Alberta lottery winner plans to retire: 'I'm debt free' A southern Alberta man says his recent lottery win will help him retire early. Investigation underway after bullet hole discovered in south Lethbridge living room Lethbridge police are investigating after a bullet hole was discovered in a southside home. Judge in Coutts murder-conspiracy trial warns jury about defence statement The judge in the trial of two men charged with conspiracy to commit murder at the border blockade at Coutts, Alta., has cautioned the jury about an opening statement by a defence lawyer. Sault Ste. Marie Police stress safety on trails after another fatal ATV crash in northern Ont. Following another fatal all-terrain vehicle crash, this time in Powassan, Ontario Provincial Police are calling on ATV drivers to take every safety precaution they can before going out in the trails. Motorcycle, moose collide on Hwy. 17 in northwestern Ont. A 74-year-old motorcycle driver was injured last week when he collided with a moose. Cities can’t clear encampments, don’t have resources to solve problem, report to Sault council says A report by an Ontario municipal group says cities are bearing the brunt of the homeless crisis, but don’t have the legal or financial means to deal with the problem. N.L. Newfoundland wildfires force temporary shutdown of iron ore mines Wildfires burning near Labrador City, N.L. have prompted mining companies in the area to temporarily halt operations. Firefighter hopes rain will be sufficient to dampen western Labrador wildfire Water bombers from Quebec are helping to fight a wildfire that has forced the evacuation of Labrador City. Premier says weather co-operating as firefighters attack Labrador City blaze A change in wind direction, cooler temperatures and possible precipitation made for favourable conditions for attacking the wildfire threatening Labrador City, the premier of Newfoundland and Labrador said Sunday. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks I'm Fairly Certain You’ll Never Drive Without This Car Phone Mount Again (And It's On Sale Right Now) If You Have No Idea What To Get Them For Their Birthday, Try One Of These Gifts Prime Day Is A Few Weeks Away, But You Can Already Snag These 30+ Deals On Amazon Canada Home This Best-Selling Geedel Cheese Grater Deserves All Your Attention 17 Game-Changing Travel Products You Won’t Want To Leave Behind The Best Window Air Conditioners To Beat The Summer Heat In Canada In 2024 Gifts 19 Foolproof Gifts For Kids That Cost Less Than $50 21 Kitchen Goodies And Gifts For The Foodie In Your Life (Or Yourself) 15 Gifts They'll Get Plenty Of Use Out Of This Summer Beauty If You Want To Ditch Your Heavy Foundation For Summer, Here Are The Best Tinted Moisturizers You Can Get Online Right Now The Maybelline Instant Age Rewind Concealer Is A Tried-And-True Reviewer Favourite — And Here's Why How To Make Your Nails Grow Faster, Longer, And Stronger Deals Prime Day Starts Tomorrow, But Here Are 50+ Of The Best Early Deals You Can Get In Canada Once You Try This Inflatable Stand-Up Paddle Board, You'll Never Go Back (And It's On Sale Right Now) Prime Day Is A Week Away, But These Fashion Deals Are Already Live On Amazon Canada Stay Connected","summary":"Pro Football Hall of Famer Terrell Davis said Monday he was 'humiliated' after being handcuffed and removed from a United Airlines flight, then later apologized to by law enforcement, over the weekend.","url":"https://www.ctvnews.ca/sports/nfl-hall-of-famer-says-he-was-unjustly-handcuffed-and-humiliated-on-a-flight-1.6964912","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/7/15/terrell-davis-1-6964918-1721083727616.jpg","video":null,"publish_date":"2024-07-15 22:49:15","author":"Jesse Bedayn,The Associated Press","authors":["Jesse Bedayn","The Associated Press"],"language":"en","catgory":"entertainment","source_country":"CA","sentiment":-0.122},{"id":251843054,"title":"JD Vance is an atrocious choice as Trump running mate","text":"From both political and governing standpoints, former President Donald Trump has made one of the worst choices imaginable in picking Sen. J.D. Vance (R-OH) to be his running mate. Indeed, he has thrown the flailing Democrats a campaign lifeline, giving them a new, surefire way to scare undecided voters away from voting for Trump or to move from staying neutral to voting for President Joe Biden instead. Vance isn’t remotely suitable to be the proverbial heartbeat of the presidency. First, on purely political grounds, Vance is an odd choice. Vance has been in the Senate less than 18 months without remotely distinguishing himself with legislative accomplishments, and he proved a very weak vote-getter in his one and only political campaign. While he did win, he ran so far behind other statewide Republican candidates in Ohio that it was embarrassing. Gov. Mike DeWine (R-OH) won reelection by 25%. Attorney General Dave Yost and Secretary of State Frank La Rose both won by 20%. But Vance ran a gaffe-prone race and stumbled into office in his heavily Republican state by only 6%. He showed no ability to appeal to traditional suburban voters and little appeal to women. Since being elected, Vance has been, well, a demagogue. Without ever offering a cogent explanation for his switch in tone and positions, Vance went from being a thoughtful contributor to conservative flagship National Review who wrote that blue-collar workers do not work harder than white-collar ones to one who now pretty much spews whatever MAGA, class-oriented nonsense he thinks will keep him in Trump’s good graces. Since 2021 he has been attached at the hip to Trump, despite in 2016 having written, “I go back and forth between thinking Trump is a cynical a**hole like Nixon who wouldn’t be that bad (and might even prove useful) or that he’s America’s Hitler.” In a year when Democrats think one of the biggest Republican vulnerabilities is extremism against abortion, they will hang around Vance’s neck comments he made against allowing legal abortions, even in cases of rape or incest. (That same interview featured remarks that liberals portrayed as Vance claiming rape was merely “inconvenient.” While that portrayal was largely out of context, the media will hammer him on that, too.) Meanwhile, in a country evenly divided about whether to increase or decrease aid to Ukraine but strongly supportive of Ukraine’s moral cause, Vance has not just questioned U.S. assistance but consistently demagogued against Ukraine. “There are people who would cut Social Security, throw our grandparents into poverty. Why? So that one of Zelensky’s ministers can buy a bigger yacht,” Vance said on a podcast hosted by former Trump adviser Steve Bannon. Perhaps Trump doesn’t realize how strongly many swing voters feel in favor of Ukraine, but he and Vance will soon find out, to their dismay. Economically, Vance is at the forefront of a faux-populist revolt against free markets. On the Constitution and the rule of law, he said he would not have done what former Vice President Mike Pence did in following his duty to count the 2020 electoral votes as duly certified by state officials. As National Review’s wise and astute Dan McLaughlin put it, “Trump picking Vance is a giant middle finger to conservatives.” And he is politically malicious without honesty, asserting without the slightest evidence that Biden’s rhetoric “led directly to President Trump’s attempted assassination.” Politically, Vance is strong only among subpopulations in which Trump already is well ahead, mostly white workers, but brings no new voter groups or states closer to supporting Trump. What Trump doesn’t realize is the visceral reaction against Vance that exists among a large subset of voters still undecided between the lesser of the two evils of Trump and Biden. They see him as callow, fake, and woefully inexperienced, with neither the gravitas nor the integrity to be a leader of the free world. And they are correct.","summary":"From both political and governing standpoints, former President Donald Trump has made one of the worst choices imaginable in picking Sen. J.D. Vance (R-OH) to be his running mate. Indeed, he has thrown the flailing Democrats a campaign lifeline, giving them a new, surefire way to scare undecided voters away from voting for Trump or [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/3084017/jd-vance-atrocious-choice-trump-running-mate/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/J.D.-Vance.webp","video":null,"publish_date":"2024-07-15 22:46:50","author":"Quin Hillyer","authors":["Quin Hillyer"],"language":"en","source_country":"US","sentiment":-0.277},{"id":251841128,"title":"2024 election: Both candidates call for unity after Trump assassination attempt, but will it last?","text":"MILWAUKEE -- \"Fight, fight, fight\" was the rallying cry from opening day of the Republican National Convention in Milwaukee. That came hours after President Joe Biden asked the nation to tone down the political rhetoric. \"It's time to cool it down. We all have a responsibility to do that,\" Biden said. But the image of Donald Trump with his fist in the air and yelling \"fight\" three times moments after he was shot is exactly the message the former president is hoping will give him the momentum from the convention all the way to the election. \"This is something that could really stick, because it can really be weaponized by the Republicans in support of their candidate,\" said Northwestern University School of Communications Professor Heather Hendershot. Political and media experts say rather than policies, Trump relies on simple messaging of \"making America great again,\" and the post-assassination attempt image fits right into it. SEE ALSO | Republican convention protests begin to form in Milwaukee despite shooting at Trump rally \"Trump has been the master of imagery, and he knows how to take advantage of every opportunity to get his message across,\" said ABC7 Chicago Political Analyst Laura Washington. So, where does that leave the Democrats, who planned on using this week to heavily criticize Trump, but have pulled back after the shooting? \"If they feel like they have to deemphasize negativity around Trump, but they're having issues spinning their own candidate as positive, where do they go from there? So, it is really kind of a catch-22,\" Hendershot said. So far, Biden and his supporters have called for unity and calm. On Truth Social Monday, Trump also called for unity, but went on to write about the legal issues against him using the language \"witch hunt,\" \"January 6th Hoax,\" and \"the Manhattan D.A.'s Zombie Case.\" \"By next week, we will see negative ads on both sides, and the gloves will come off again,\" Washington said. With so much attention on Trump this week, political experts say Democrats should spend the week laying low and figuring out a strategy, so next week they unify behind a clear plan moving forward.","summary":"President Joe Biden has asked the nation to tone down political rhetoric after an assassination attempt on Donald Trump.","url":"https://abc13.com/post/presidential-election-2024-both-candidates-call-unity-after/15061642/","image":"https://cdn.abcotvs.com/dip/images/15061775_071524-wls-schulte-rally-shooting-aftermath-messaging-5p-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/071524-wls-schulte-rally-shooting-aftermath-messaging-5p-vid.mp4","publish_date":"2024-07-15 22:46:04","author":"Sarah Schulte,WLS","authors":["Sarah Schulte","WLS"],"language":"en","source_country":"US","sentiment":-0.35},{"id":251841224,"title":"2024 election: Both candidates call for unity after Trump assassination attempt, but will it last?","text":"MILWAUKEE -- \"Fight, fight, fight\" was the rallying cry from opening day of the Republican National Convention in Milwaukee. That came hours after President Joe Biden asked the nation to tone down the political rhetoric. \"It's time to cool it down. We all have a responsibility to do that,\" Biden said. But the image of Donald Trump with his fist in the air and yelling \"fight\" three times moments after he was shot is exactly the message the former president is hoping will give him the momentum from the convention all the way to the election. \"This is something that could really stick, because it can really be weaponized by the Republicans in support of their candidate,\" said Northwestern University School of Communications Professor Heather Hendershot. Political and media experts say rather than policies, Trump relies on simple messaging of \"making America great again,\" and the post-assassination attempt image fits right into it. SEE ALSO | Republican convention protests begin to form in Milwaukee despite shooting at Trump rally \"Trump has been the master of imagery, and he knows how to take advantage of every opportunity to get his message across,\" said ABC7 Chicago Political Analyst Laura Washington. So, where does that leave the Democrats, who planned on using this week to heavily criticize Trump, but have pulled back after the shooting? \"If they feel like they have to deemphasize negativity around Trump, but they're having issues spinning their own candidate as positive, where do they go from there? So, it is really kind of a catch-22,\" Hendershot said. So far, Biden and his supporters have called for unity and calm. On Truth Social Monday, Trump also called for unity, but went on to write about the legal issues against him using the language \"witch hunt,\" \"January 6th Hoax,\" and \"the Manhattan D.A.'s Zombie Case.\" \"By next week, we will see negative ads on both sides, and the gloves will come off again,\" Washington said. With so much attention on Trump this week, political experts say Democrats should spend the week laying low and figuring out a strategy, so next week they unify behind a clear plan moving forward.","summary":"President Joe Biden has asked the nation to tone down political rhetoric after an assassination attempt on Donald Trump.","url":"https://abc7news.com/post/presidential-election-2024-both-candidates-call-unity-after/15061642/","image":"https://cdn.abcotvs.com/dip/images/15061775_071524-wls-schulte-rally-shooting-aftermath-messaging-5p-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/071524-wls-schulte-rally-shooting-aftermath-messaging-5p-vid.mp4","publish_date":"2024-07-15 22:46:04","author":"Sarah Schulte,WLS","authors":["Sarah Schulte","WLS"],"language":"en","source_country":"US","sentiment":-0.35},{"id":251841070,"title":"That bullet intended for Trump could have completely ripped apart American life","text":"On Saturday afternoon in Butler, Pennsylvania, Donald Trump pulled his latest rabbit out of a hat: He cheated death. As Washington Free Beacon editor Peter Hasson noted on X, Teflon Don has outlasted two impeachments, four indictments — and, with his fist defiantly raised in the air and blood running down his cheek, bested a would be assassin. The former president, quite literally, dodged a bullet. So did our great country. With one fateful turn of Trump’s head, Americans were collectively saved from unimaginable chaos. Yet, some saw it differently — and weren’t shy about their blood thirst. The list of Trump Derangement Syndrome sufferers taking to social media to express regret over the botched hit has been long and diverse. It’s included a staffer for a Dem congressman, a Morgan State professor, a nonbinary middle school teacher and even a firefighter in Pennsylvania — who wrote on Facebook, “too bad it didn’t hit him square” alongside a popcorn box emoji. Apparently lost on him was the fact that Corey Comperatore, a fellow smoke-eater, was taken out instead. A New York City nurse, said the gunman needed to “work on your skills.” At a concert in Sydney, Australia, Tenacious D — the band fronted by actors Jack Black and Kyle Gass — was uniquely disgusting. Onstage, Black, who gave a speech at the recent George Clooney-fronted LA fundraiser for Joe Biden, sang “Happy Birthday” to his bandmate and told him to make a wish. Without missing a beat, Gass said: “Don’t miss Trump next time.” So much for the compassionate lefties of La La Land. Yesterday, a friend of a friend even expressed it to me without an ounce of shame. “It’s terrible that he missed.” Shocked, I simply raised my eyebrows and said, “No. Quite the opposite. We should be grateful.” For one thing, how inhumane and grotesque it is to wish for anyone’s murder. And if the gunman had succeeded, we’d be in a very different America right now. Taking out Trump would have opened a Pandora’s box: a portal to a political hellscape and a cascade of real-world consequences reverberating around the globe. The already tenuous ties holding our society together would be ripped apart. Violence, anger and an insatiable appetite for revenge would have led to a place so dark and twisted, I’d rather not visit even the hypothetical. Who remembers the violent excesses of the “fiery but mostly peaceful” summer of 2020, which left cities across our country lawless and burned out? They also left innocent people dead. And then there was the turmoil of January 6. Both events were shameful — and a repeat of either would be catastrophic in this election year. It would lead to volatility in the stock market and disrupt the economy. Our foreign enemies, clocking our ever growing weakness and divisions, would be licking their chops while sharing a cocktail of schadenfreude. Also: a family would lose their father, husband, grandfather. What did these creeps really want? To see Trump’s head blown off on stage, in front of men, women and children, with the macabre scene replayed over and over online like a snuff film? It’s nihilistic. It’s grim. And it’s selfish and shortsighted. Because it would not have ended well for any one of us, regardless of which political jersey we wear. Funnily enough, I don’t see these people posting the gunman’s image on social media like a fallen foot soldier. It’s human to disagree with someone. It’s also possible to be highly critical of a politician and their policies, actions and moral code (or lack thereof) and not wish them a bloody and public death. As Americans, we all should want fair elections. A candidate should be taken out at the ballot box by bad ideas and ineffective leadership. Not by a sharp metal projectile fired from a depraved gunman. That is not justice — that’s a hallmark of a third world country. And yet, I have faith. There were many civilized Democrats who grasped the gravity of the situation. They say a near death experience gives one a new lease on life. Fresh from the dramatic moment, Trump said he’s rewriting his Republican National Convention speech to preach unity. Perhaps that renewed spirit will ring true for all of our citizens. The USA needs the healing.","summary":"Donald Trump cheated death and the US metaphorically dodged a bullet. But too many people aren't grateful for that.","url":"https://nypost.com/2024/07/15/opinion/the-bullet-meant-for-trump-could-have-torn-apart-american-life/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/trump-column-kirsten.jpg?quality=75&strip=all&1721064347&w=1200","video":null,"publish_date":"2024-07-15 22:44:01","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","source_country":"us","sentiment":0.122},{"id":251840886,"title":"Trump’s running mate: What happens to JD Vance’s Senate seat?","text":"By Zachary B. Wolf | CNN The Senate is narrowly divided and Democrats hold a slim majority. But there’s no need for Ohio Sen. JD Vance, whom former President Donald Trump selected as his running mate Monday, to leave the chamber during the campaign. It makes sense to look to a senator as vice president: The role’s main official duty is to serve as president of the US Senate, although recent vice presidents don’t tend to spend too much time on Capitol Hill. In fact, there is a long history of presidential candidates selecting senators as running mates. President Joe Biden was at the end of a long career as a US senator from Delaware when he was tapped as then-Sen. Barack Obama’s running mate in 2008. Biden and Obama both continued to serve in the Senate during the campaign, as did Sen. John McCain, the Arizonan who was Republicans’ pick that year. Biden picked then-Sen. Kamala Harris as his own running mate in 2020. In 2016, Hillary Clinton picked Sen. Tim Kaine as her running mate. Kaine never gave up his seat and went back to serving as a senator after Clinton’s loss to Trump. In 2004, then-Sen. John Kerry, a Democrat, picked then-Sen. John Edwards as his running mate. So what does that mean for the seat? Usually, when a senator is elected as either president or vice president, they will resign from their Senate seat in early January after the election. Biden, however, is an outlier in this. He kept his Senate seat longer than most in early 2009, perhaps so that he could edge past some other former senators in the all-time Senate tenure list. Biden sits at No. 19. It would then fall to Ohio Republican Gov. Mike DeWine, himself a former senator, to appoint a replacement until the next regular state election, when there would be a special election to fill the rest of the term. This can be a fraught process. Former Illinois Gov. Rod Blagojevich went to federal prison for essentially trying to trade away the appointment to fill out Obama’s term. For Biden, longtime aide and friend Ted Kaufman was appointed in 2009 to succeed him in the Senate. Kaufman did not run for the seat in his own right. California Gov. Gavin Newsom appointed Sen. Alex Padilla to succeed Harris in the Senate, and Padilla has since been elected to the seat.","summary":"Vance won his seat in the Senate in 2022 and won’t be up for reelection as a senator until 2028.","url":"https://www.mercurynews.com/2024/07/15/trumps-running-mate-what-happens-to-jd-vances-senate-seat/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/SJM-L-VANCESEAT-02-0715.jpg?w=1024","video":null,"publish_date":"2024-07-15 22:40:19","author":"Cnn.com Wire Service","authors":["Cnn.com Wire Service"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.257},{"id":251841356,"title":"Cannon’s Mar-a-Lago Dismissal Plays Hard To Trump And His SCOTUS","text":"To some legal observers, Judge Aileen Cannon for the Southern District of Florida showed two qualities in deciding to rule that Special Counsel Jack Smith was unconstitutionally appointed and, in doing so, throw out the Mar-a-Lago records prosecution: cynicism and ambition. “This opinion is a bit of an audition to, I don’t know, an audience of one, not just an audience of nine, if you will,” Jed Shugerman, a professor at Boston University School of Law, told TPM in a phone interview. “If I were looking to put myself on the short list of very rarefied judicial air in a Trump presidency, this is the opinion I would write.” Cannon’s own judicial ambitions aside, several legal experts including Shugerman marveled to TPM at how much her ruling tossing the classified records retention case read like an appellate opinion, and not that of a district court judge. Going far beyond the typical role of a judge at her level, Cannon laid new legal ground, contravening decades of decisions across the country, including two at the D.C. Circuit, to the contrary. She also opened herself up to the possibility that Smith could both appeal the case — his office said Monday it would — and move for Cannon’s removal based on her handling of the matter. The future of the case also depends on President Joe Biden securing re-election in November, a prospect about which many elected Democrats have professed a growing level of skepticism. If Trump wins in November, he’s promised to order the DOJ to drop the federal cases against him, and would likely fire Smith and his team. The existence of special counsels has long been seen as a bulwark of DOJ independence. When criminal investigations touch on the presidency, they’ve allowed federal prosecutors to examine the allegations in a manner that’s theoretically free of interference from the person in charge of the executive branch. Cannon’s decision, if broadened out to its furthest aperture, suggests that should come to an end, in part because of her finding that DOJ-issued regulations and not congressional statutes underpinned elements of any special counsel’s appointment. “There’s no special counsel that we would care about that would be valid under this opinion,” Shugerman said. In some ways, it’s a logical next step after the immunity ruling earlier this month in Trump v. United States: not only is it exceedingly difficult to charge the president with a crime, but it’s impossible for the DOJ to have an independent prosecutor. Justice Clarence Thomas outlined a broadly similar view of why Smith’s appointment is unconstitutional in a concurrence in that case. Smith’s options All that isn’t to understate the sheer radicalness of Cannon’s decision. Several attorneys told TPM that they expected the 11th Circuit to reverse Cannon’s decision, opening the question of whether it would return to her or if Smith would be able to get the appeals court to remove Cannon from the case. “I think getting this overturned before the election is very likely. I mean, I don’t think that would be a huge effort,” Peter Zeidenberg, a former federal prosecutor now at Arent Fox, told TPM. “I think Jack Smith could write a brief in the next 10 days, and ask for expedited briefing, and this could get resolved in a month.” But it’s not clear what value a potential victory at the 11th Circuit and declination by the Supreme Court would have if the case returns to Judge Cannon. Since Trump first sued in the pre-indictment phase to block the investigation, Cannon has managed to extensively delay the case, first by approving Trump’s request in the civil lawsuit and later by declining to rule on a series of issues post-indictment. Both parties have said that they were prepared to try the case by the summer; Cannon indefinitely delayed the trial. “Winning on this and the case going straight back to her is not particularly useful, she’s just going to rule against him on the next issue that comes up,” Brian Greer, a former attorney in the CIA general counsel’s office, told TPM. Smith could have a difficult time persuading the 11th Circuit to remove Cannon from the case, particularly given that the appeals court has only reversed her once. Other options, Greer said, could include refiling the case on an obstruction charge in D.C., or having the U.S. Attorney’s Office for the Southern District of Florida reindict the case. These are long-shot options. So far, Smith’s office has said only that they’ll appeal the case. In his inimitable way, Smith spokesman Peter Carr said that Cannon’s ruling “deviates from the uniform conclusion of all previous courts.”","summary":"To some legal observers, Judge Aileen Cannon for the Southern District of Florida showed two qualities in deciding to rule...","url":"https://talkingpointsmemo.com/news/cannons-mar-a-lago-dismissal-plays-hard-to-trump-and-his-scotus","image":"https://talkingpointsmemo.com/wp-content/uploads/2023/06/GettyImages-1258564499-scaled.jpg","video":null,"publish_date":"2024-07-15 22:39:30","author":"Josh Kovensky","authors":["Josh Kovensky"],"language":"en","source_country":"US","sentiment":0.02},{"id":251840854,"title":"Republicans sue Michigan governor over voter registration locations","text":"July 15 (UPI) -- Michigan Gov. Gretchen Whitmer has been sued by Donald Trump's presidential campaign and the Republican National Committee for allowing federal Veterans Affairs and Small Business Administration locations to be used for voter registration. The Republicans allege Whitmer and Michigan Secretary of State Jocelyn Benson, both Democrats, exceeded their authority when they struck agreements to use the VA and SBA offices as \"voter registration agencies,\" or VRAs, according to a suit filed Monday in federal court in Michigan. \"Under Michigan law, the authority to make such designations is held solely by the Legislature,\" the filing said. Additional defendants are Michigan Director of Elections Jonathan Brater, the SBA, VA and their directors. Michigan is a battleground state for the presidential election. Trump won in 2016 and President Joe Biden won in 2020. \"The RNC and its members are concerned that Defendants' failure to comply with Michigan statutes governing VRA designation undermines the integrity of elections by increasing the opportunity for individuals to register to vote even though they are ineligible to do so, and by sowing confusion regarding whether the agencies purporting to offer assistance in registering voters are doing so in accordance with applicable law,\" the suit reads. The suit also contends that the \"SBA and VA's continued unlawful operation as VRAs have caused economic, financial, and political injury to the Plaintiffs, including by forcing them to allocate additional resources and misallocate their scarce resources in ways they otherwise would not have.\" According to the lawsuit, the National Voter Registration Act assigns power to designate voter registration agencies to the legislature, not the governor's office. Whitmer hadn't responded to media outlets for comment. Angela Benander, director of communications for Benson's secretary of state office, said in a statement to the Detroit Press: \"It is unfortunate that this divisive, partisan lawsuit was filed today. Making it easier for veterans and small business owners in Michigan to register to vote should not be controversial. \"We will review this and any other litigation that comes our way but remain committed to ensuring that every Michigan voter has the tools and resources they need to participate in every election.\" Last year, her office announced three VA offices would be pilot locations for a new voter registration partnership. Her office also announced a voter registration agreement with the SBA in March. \"I'm proud today to announce this historic partnership between the state of Michigan and the U.S. Department of Veterans Affairs to ensure we expand opportunities for all veterans and their families to play an active role in our democracy,\" Benson said in September. \"This partnership will break down many barriers that keep veterans from participating in our democratic process and will provide the information and tools they need to fully exercise their voting rights in every election.\" In March, the RNC sued Benson in federal court in an attempt to force election officials to trim down the state's voter rolls. \"At least 53 Michigan counties have more active registered voters than they have adult citizens who are over the age of 18. That number of voters is impossibly high,\" the lawsuit said. \"An additional 23 counties have active-voter registration rates that exceed 90 percent of adult citizens over the age of 18. That figure far eclipses the national and statewide voter registration rate in recent elections.\" Benson said more than 700,000 voters were been removed from the voter rolls since she took office in 2019, and another half million will be removed if they do not vote in this year's general election.","summary":"Michigan Gov. Gretchen Whitmer has been sued by Republicans for allowing federal Veterans Affairs and Small Business Administration locations to be used for voter registration,","url":"https://www.upi.com/Top_News/US/2024/07/15/Mich-election-sites-lawsuit-against-Whitmer/9961721078634/","image":"https://cdnph.upi.com/ph/st/th/9961721078634/2024/upi/7c1749bc50954c65dbc05e00c7866d66/v1.2/Republicans-sue-Michigan-governor-over-voter-registration-locations.jpg","video":null,"publish_date":"2024-07-15 22:37:06","author":"Allen Cone","authors":["Allen Cone"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.186},{"id":251842670,"title":"Joe Biden admits it was a ‘mistake’ to discuss putting Donald Trump in ‘the Bullseye’ days before assassination attempt","text":"JOE Biden has admitted it was a mistake to discuss putting Donald Trump \"in the bullseye\" just days before an attempted assassination on the former president. In an interview with NBC's Lester Holt on Monday, Biden stressed he was referring to the level of focus on Trump's agenda at the time, insisting there was not enough. However, the president defended his statement, saying in hindsight he regrets using the word \"bullseye\" after Saturday's attempted assassination of Donald Trump. But Biden stresses his message remains the same. \"What I was talking about at the time was there is very little focus on Trump's agenda.\" the president told Holt. \"I didn't mean crosshairs or bullseye,\" Biden explained. \"I meant to focus on him, focus on what he is doing, focus on his policies, focus on the number of lies he told at the debate, there is a whole range of things,\" Biden said. \"I'm not the guy who said I want to be a dictator on day one, I'm not the guy who refused to accept the outcome of the election,\" he continued. When asked if he feels there is anything he has said in the past that may have \"incited\" people, Biden again defended his past statements. \"I'm not engaged in that rhetoric,\" he said. \"How do you talk about the threat to democracy, which is real, when a president says the things that he says,\" Biden asked Holt. \"Do you just not say because it may incite somebody?\" Biden then attacked Trump, saying the former is actively engaged in that type of rhetoric, citing past statements from Trump such as the country turning into a \"bloodbath\" if he were to lose the upcoming election. “Now if I don’t get elected, it’s going to be a bloodbath for the country, that will be the least of it,\" Trump said at an Ohio rally in March. “If this election isn’t won, I’m not sure that you’ll ever have another election in this country,\" Trump added. Biden attacked this statement and others, such as Trump promising to pardon all those found guilty of crimes involving January 6, and even when Trump made jokes about Nancy Pelosi's husband being attacked with a hammer. Biden said he believes these statements are examples of Trump and his use of real violent rhetoric that is actually responsible for the turmoil this election cycle. 'I DON'T KNOW IF THAT'S POSSIBLE' On Sunday, both Trump and Biden called for unity within the country after Saturday's attempt on Trump's life. In only the third speech given from the Oval Office during his presidency, Biden spoke to the American people on Sunday in a 9-minute speech calling for peace. \"My fellow Americans, I want to speak to you tonight about the need for us to lower the temperature in our politics,\" he said. \"Do remember, while we may disagree, we are not enemies. We’re neighbors, we’re friends, coworkers, citizens, and most importantly, we are fellow Americans. We must stand together. “Disagreement is inevitable in American democracy,” Biden continued. Differing opinions aside, the president said politics should never turn into \"a killing field.\" “I’m not supposed to be here, I’m supposed to be dead,” Trump told The New York Post Sunday night. In his first interview after his brush with death, Trump hinted at a possible change in approach for the next four months leading up to the election. “I had all prepared an extremely tough speech, really good, all about the corrupt, horrible administration,” he told The Post about a speech he had prepared for this week's Republican National Convention. “But I threw it away,\" Trump said. Trump said he is reworking his speech in an attempt \"to try to unite the country.\" \"I don’t know if that’s possible,\" he said. \"People are very divided.” More to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos Like us on Facebook at TheSunUS and follow us on X at @TheUSSun","summary":"","url":"https://www.thesun.co.uk/news/29249835/joe-biden-donald-trump-bullseye/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/07/AB-BULLSEYE-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-15 22:36:36","author":"Brandon Cruz","authors":["Brandon Cruz"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.455},{"id":251842478,"title":"Joe Biden admits it was a ‘mistake’ to discuss putting Donald Trump in ‘the Bullseye’ days before assassination attempt","text":"JOE Biden has admitted it was a mistake to discuss putting Donald Trump \"in the bullseye\" just days before an attempted assassination on the former president. In an interview with NBC's Lester Holt on Monday, Biden stressed he was referring to the level of focus on Trump's agenda at the time, insisting there was not enough. However, the president defended his statement, saying in hindsight he regrets using the word \"bullseye\" after Saturday's attempted assassination of Donald Trump. But Biden stresses his message remains the same. \"What I was talking about at the time was there is very little focus on Trump's agenda.\" the president told Holt. \"I didn't mean crosshairs or bullseye,\" Biden explained. \"I meant to focus on him, focus on what he is doing, focus on his policies, focus on the number of lies he told at the debate, there is a whole range of things,\" Biden said. \"I'm not the guy who said I want to be a dictator on day one, I'm not the guy who refused to accept the outcome of the election,\" he continued. When asked if he feels there is anything he has said in the past that may have \"incited\" people, Biden again defended his past statements. \"I'm not engaged in that rhetoric,\" he said. \"How do you talk about the threat to democracy, which is real, when a president says the things that he says,\" Biden asked Holt. \"Do you just not say because it may incite somebody?\" Biden then attacked Trump, saying the former is actively engaged in that type of rhetoric, citing past statements from Trump such as the country turning into a \"bloodbath\" if he were to lose the upcoming election. “Now if I don’t get elected, it’s going to be a bloodbath for the country, that will be the least of it,\" Trump said at an Ohio rally in March. “If this election isn’t won, I’m not sure that you’ll ever have another election in this country,\" Trump added. Biden attacked this statement and others, such as Trump promising to pardon all those found guilty of crimes involving January 6, and even when Trump made jokes about Nancy Pelosi's husband being attacked with a hammer. Biden said he believes these statements are examples of Trump and his use of real violent rhetoric that is actually responsible for the turmoil this election cycle. On Sunday, both Trump and Biden called for unity within the country after Saturday's attempt on Trump's life. In only the third speech given from the Oval Office during his presidency, Biden spoke to the American people on Sunday in a 9-minute speech calling for peace. “I’m not supposed to be here, I’m supposed to be dead,” Trump told The New York Post Sunday night. In his first interview after his brush with death, Trump hinted at a possible change in approach for the next four months leading up to the election. “I had all prepared an extremely tough speech, really good, all about the corrupt, horrible administration,” he told The Post about a speech he had prepared for this week's Republican National Convention. “But I threw it away,\" Trump said. Trump said he is reworking his speech in an attempt \"to try to unite the country.\" \"I don’t know if that’s possible,\" he said. \"People are very divided.” More to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos Like us on Facebook at TheSunUS and follow us on X at @TheUSSun","summary":"","url":"https://www.thesun.ie/news/13413261/joe-biden-donald-trump-bullseye/","image":"https://www.thesun.ie/wp-content/uploads/sites/3/2024/07/AB-BULLSEYE-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-15 22:36:36","author":"Brandon Cruz","authors":["Brandon Cruz"],"language":"en","catgory":"politics","source_country":"ie","sentiment":-0.424},{"id":251842266,"title":"Joe Biden admits it was a ‘mistake’ to discuss putting Donald Trump in ‘the Bullseye’ days before assassination attempt","text":"JOE Biden has admitted it was a mistake to discuss putting Donald Trump \"in the bullseye\" just days before an attempted assassination on the former president. In an interview with NBC's Lester Holt on Monday, Biden stressed he was referring to the level of focus on Trump's agenda at the time, insisting there was not enough. However, the president defended his statement, saying in hindsight he regrets using the word \"bullseye\" after Saturday's attempted assassination of Donald Trump. But Biden stresses his message remains the same. \"What I was talking about at the time was there is very little focus on Trump's agenda.\" the president told Holt. \"I didn't mean crosshairs or bullseye,\" Biden explained. \"I meant to focus on him, focus on what he is doing, focus on his policies, focus on the number of lies he told at the debate, there is a whole range of things,\" Biden said. \"I'm not the guy who said I want to be a dictator on day one, I'm not the guy who refused to accept the outcome of the election,\" he continued. When asked if he feels there is anything he has said in the past that may have \"incited\" people, Biden again defended his past statements. \"I'm not engaged in that rhetoric,\" he said. \"How do you talk about the threat to democracy, which is real, when a president says the things that he says,\" Biden asked Holt. \"Do you just not say because it may incite somebody?\" Biden then attacked Trump, saying the former is actively engaged in that type of rhetoric, citing past statements from Trump such as the country turning into a \"bloodbath\" if he were to lose the upcoming election. “Now if I don’t get elected, it’s going to be a bloodbath for the country, that will be the least of it,\" Trump said at an Ohio rally in March. “If this election isn’t won, I’m not sure that you’ll ever have another election in this country,\" Trump added. Biden attacked this statement and others, such as Trump promising to pardon all those found guilty of crimes involving January 6, and even when Trump made jokes about Nancy Pelosi's husband being attacked with a hammer. Biden said he believes these statements are examples of Trump and his use of real violent rhetoric that is actually responsible for the turmoil this election cycle. On Sunday, both Trump and Biden called for unity within the country after Saturday's attempt on Trump's life. More to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos Like us on Facebook at TheSunUS and follow us on X at @TheUSSun","summary":"","url":"https://www.thescottishsun.co.uk/news/13164671/joe-biden-donald-trump-bullseye/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2024/07/AB-BULLSEYE-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-15 22:36:36","author":"Brandon Cruz","authors":["Brandon Cruz"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.425},{"id":251840878,"title":"How to Watch Biden’s NBC Interview With Lester Holt: What Time Is It?","text":"Just days after an attempted assassination of his opponent for the presidency, President Joe Biden sat down for an interview with NBC News anchor Lester Holt. The interview took place at the White House Monday – a change in the original plan for the safety of the president. This will be Biden’s second major interview scheduled since the first presidential debate. His ABC interview with George Stephanopoulos intended to calm voters after his dismal debate performance, but viewers were not so easily swayed. In his first press conference since the debate, Biden held his ground through his remarks and round of questioning, but not without a few flubs: Vice President Trump and President Putin, most notably. Curious about how the president will fare in tonight’s sit-down interview with Lester Holt? Keep reading for where to watch. What time is the interview? The unedited interview will be broadcast during a special program slot on NBC at 9 p.m. ET / 6 p.m. ET Monday. How can I watch it? Biden’s first sit down interview since the assassination attempt against former president and now official GOP nominee Donald Trump will be broadcast live in full on NBC. Excerpts of the interview are expected to be shown during the prior evening news program. Is the interview streaming? Viewers can stream the special online on “NBC News Now” at 9 p.m. ET. Portions of the interview will air earlier in the day on “NBC Nightly News With Lester Holt” at 6:30 p.m. ET and clips and coverage will be available on NBCNews.com. Where is the interview happening? The interview was scheduled to take place in Austin, Texas, but the president canceled the trip after the assassination attempt and conducted it instead at the White House. Watch a clip from the interview","summary":"Biden's second sit-down interview since the debate and Trump's assassination attempt will air on NBC Monday\n\n\nThe post How to Watch Biden&#8217;s NBC Interview With Lester Holt: What Time Is It? appeared first on TheWrap.","url":"https://www.thewrap.com/how-to-watch-biden-interview-nbc-online-streaming/","image":"https://www.thewrap.com/wp-content/uploads/2024/07/Screenshot-2024-07-15-at-3.23.36-PM.png","video":null,"publish_date":"2024-07-15 22:36:30","author":"Tess Patton","authors":["Tess Patton"],"language":"en","source_country":"US","sentiment":0.074},{"id":251841028,"title":"Former Secret Service Agent to EWTN News: Attack on Trump Shows ‘It’s a Very Dangerous World’","text":"The American public should avoid rushing to judgments before knowing the facts of the assassination attempt on former president Donald Trump, a former Secret Service agent told EWTN News Nightly Monday. “I assure you, every vulnerability was known, and there were mitigative measures put in place,” said Paul Eckloff, 23-year veteran of the Secret Service who served in the Presidential Protective Division during the George W. Bush, Obama and Trump administrations. “But, sadly, as we saw on Saturday, no protective plan or operation is perfect,” he added. “They’re designed by men and women, and they can be defeated by them.” Eckloff said security planning is “not an exact science, and it’s a very dangerous world.” He told EWTN News Nightly the Secret Service likely only had a few days to prepare for the July 13 Trump rally in Butler, Pennsylvania. He said agents, officers and technicians meet with local and state law enforcement in the days leading up to events like the rally. “President Trump has far more security than the average former president; and as the primary candidate for the Republican Party, he has some assets that others may not — approaching the presidential level of protection,” Eckloff said. Homeland Security Secretary Alejandro Mayorkas said in a White House press briefing Monday that the security of Trump and President Joe Biden is one of the “most vital priorities” of the Biden administration, the Secret Service, the FBI, and partners within the federal government. “Both prior to and after the events of this past weekend, the Secret Service enhanced former President Trump's protection based on the evolving nature of threats to the former president,” Mayorkas said. Mayorkas said protective measures at the Republican National Convention in Milwaukee this week will include personnel and technology such as anti-scale fencing and screening technology. He also told reporters the FBI is leading a criminal investigation and an independent review to analyze security measures “before, during, and after” the Trump rally in Butler. Eckloff said he himself has “more questions than the public would ask” about Saturday’s attempted assassination of Trump, but he said eyewitness testimonies can be flawed, particularly when recalling the amount of time passed, referring to the viral BBC interview of a man saying he warned a police officer of the attempted assassin Thomas Matthew Crooks on the roof. Eckloff also explained that an officer cannot leave his post and is limited to communication via radio. “The questions need to be asked about the security of the building that the shooter scaled and about the police interactions that potentially spurred his rapid action and allowed the counter sniper to neutralize,” Eckloff said. The counter-sniper who shot and killed Crooks had only a “split second” to realize Crooks was a threat and shoot him, he told EWTN News Nightly. “I think it’s important for people to understand the superhuman things you’re asking from humans,” he said. “If he had shot an innocent individual trying to get a view of the former president without a weapon, we’d be having a very different conversation.” He said there “justifiably will be criticisms” regarding the security plan, but he doesn’t believe anyone should question “the dedication and the sacrifice” the men and women in the Secret Service demonstrated at the rally. “You can ask questions, you can demand better, but to publicly eviscerate the men and women who threw their bodies, who put that vest on — not to save their own lives, but to save former president Trump — I just wish more people would recognize the heroism that we saw on Saturday afternoon,” he said. Eckloff said former Secret Service agents like himself have a unique response to the deadly events of Saturday evening. “What former agents feel is something I don’t know any other American or anybody else on Earth feels,” Eckloff said. “We wish we were there. We wish it happened on our watch because we know that we can add to it, we can help reach and save the former president or president. It’s like we want to dive into the screen and use our bodies to shield the problem.” Eckloff also said his “heart goes out” to Corey Comparatore, a rally attendee and devout Christian husband and father who was killed shielding his family, comparing his sacrificial actions to that of a Secret Service agent. WATCH","summary":"news","url":"https://www.ncregister.com/news/former-secret-service-on-attack-on-trump-ewtn-news","image":"https://publisher-ncreg.s3.us-east-2.amazonaws.com/pb-ncregister/swp/hv9hms/media/20240715170724_104ad70b9de1fe6ca6b65d741291782257a9d6f45792d32de5950c7ff2c7ca14.png","video":null,"publish_date":"2024-07-15 22:33:54","author":"Adriana Azarian","authors":["Adriana Azarian"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.462}]}