{"offset":0,"number":50,"available":7212,"news":[{"id":252248864,"title":"Biden’s health continues to improve, his treatment for COVID continues — doctor","text":"WASHINGTON, July 21. /TASS/. The health of US President Joe Biden, who tested positive for the novel coronavirus infection on July 17, continues to improve, physician to the president Kevin O’Connor said in a statement, published by the White House’s press service. The statement says that although Biden is still experiencing non-productive cough and hoarseness, \"his symptoms continue to improve steadily.\" His pulse, blood pressure, respiratory rate and temperature remain absolutely normal, O’Connor added. \"The President continues to tolerate treatment well and will continue Paxlovid as planned. He continues to perform all of his presidential duties,\" the statement says. On July 17, White House Press Secretary Karine Jean-Pierre said in a statement that Biden had tested positive for the novel coronavirus. The White House said he would return to his Delaware residence where he would self-isolate and will continue to carry out all of his duties fully during that time. The president’s personal doctor informed that the US leader is experiencing runny nose, non-productive cough and general malaise.","summary":"His pulse, blood pressure, respiratory rate and temperature remain absolutely normal, Kevin O’Connor said","url":"https://tass.com/world/1819337","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2024-07-21 00:55:13","author":"Tass","authors":["Tass"],"language":"en","source_country":"ru","sentiment":-0.057},{"id":252248728,"title":"Trump Embraces Polarizing Rhetoric at First Rally Following Assassination Attempt","text":"One week after a bullet nearly took his life, former President Donald Trump delivered a speech filled with divisive rhetoric that was largely in line with his usual tone. Despite Trump having told reporters that he would pivot to a message of unity, the former president used his Saturday speech in Grand Rapids, Michigan, to call President Joe Biden and Vice President Kamala Harris names, refer to Biden’s allies as “thugs,” argue without evidence that Democrats cheated in the 2020 election, and characterize migrants as coming from prisons, jails and mental institutions. The bombastic, expressive intonation that has defined his political career returned, as well as his penchant for name-calling, referring to Biden as “Crooked Joe,” “feeble old guy,” “low IQ” and “stupid,” and Harris as “Laughin’ Kamala,” “crazy” and “nuts.” He referred to Democrats as “enemies of the democracy” and bemoaned the “grossly incompetent people running our country.” Trump railed against migrants, arguing that the U.S. was a “dumping ground” for the world, which is “laughing at us.” He called for a “big deportation” to “get them the hell out.” The former president has long claimed without evidence that Democrats committed fraud in 2020, a false message that he reiterated on Saturday. “That’s the only thing they’re good at,” he said, adding later that “they have no shame whatsoever.” The name-calling and divisive rhetoric came just days after Trump said in his Republican National Convention acceptance speech that “the discord and division in our society must be healed.” Biden campaign spokesperson Ammar Moussa slammed Trump’s rally in a statement. “We were promised a new Donald Trump who would unite the country — instead all we saw tonight was the same Donald Americans keep rejecting over and over: He’s peddling the same lies, running the same campaign of revenge and retribution, touting the same failed policies, and — as usual — focused only on himself,” Moussa said. The Trump campaign has argued that it does not care who is at the top of the Democratic ticket, but a senior adviser to Trump said that it prefers Biden to be the nominee because the campaign had been planning for that matchup. During his Saturday speech, Trump criticized the Democrats who are urging Biden to exit the race. “This guy goes and he gets the votes, and now they want to take it away,” Trump said. “That’s democracy. They talk about democracy. ‘Let’s take it away from him.’” Trump also thanked Americans for their “extraordinary outpouring” of support after last Saturday’s shooting. “I shouldn’t be here,” Trump said. Saturday’s rally is Trump’s first since the assassination attempt in Butler, Pennsylvania, one week ago during which one attendee was killed and two were hospitalized. The former president said that the media “covered it fairly,” a departure from how he usually talks about reporters. However, minutes later he pivoted back to criticizing journalists. Trump also revealed during the rally that China’s President Xi Jinping wrote him a note after the shooting. “I got along very well with President Xi. He’s a great guy,” Trump said. “Wrote me a beautiful note the other day when he heard about what happened.” Trump did not describe the contents of the note. The atmosphere at the arena appeared cheerful and patriotic as many supporters expressed confidence in Trump’s electoral prospects. “If he can fight that hard and have all that money and do whatever he wants and comes out here and fights for us, that’s pretty powerful,” said Ben Beckon from Grand Rapids, Michigan. Trump’s running mate, Sen. JD Vance of Ohio, took the stage before the former president and almost immediately laid into his opponent, Harris. “What has she done other than collect a check from her political offices?” he said, adding that she was handling the border “during the biggest disaster, open border that we’ve ever had in this country.” Later, he tried to head off the suggestion that his ticket holds extreme views. “There’s nothing radical about stopping the poison and the gangs and the criminals, from taking care of our country,” Vance said. “We’ve got to shut down that border, shut down the fentanyl and make America safe for American citizens again.” The Biden campaign had pre-emptively criticized Saturday’s rally by calling the Trump-Vance ticket “the most extreme, anti-worker presidential ticket in American history.” “Today, an Ivy league billionaire who screwed over workers will partner with an Ivy League millionaire who left workers behind to hit the campaign trail,” the campaign said in an email ahead of the rally. A supporter at Trump’s rally summed up the former president’s running mate decision: “If Trump trusts him, I trust him,” Yvonne Beadle from Algonac, Michigan, told NBC News. “I don’t know much about him,” said Mandie Kirkpatrick from Ludington, Michigan. “Of course there’s a lot of things flying around about him. I trust Trump’s decision, so if he says he’s good, then I trust that.” The Grand Rapids rally comes on the heels of the Republican National Convention in Milwaukee, where Trump officially became the Republican nominee for president. His acceptance speech was the longest in convention history, topping the previous record he set in 2016. During his speech, which marked his first public remarks since the shooting, he offered his most detailed recollection of the assassination attempt so far. “The amazing thing is that prior to the shot, if I had not moved my head at the very last instant, the assassin’s bullet would have perfectly hit its mark, and I would not be with you tonight,” Trump said during Thursday’s acceptance speech. Much of the rest of his convention speech circled back to familiar themes and rhetoric he uses on the campaign trail. He reiterated a pledge to “launch the largest deportation operation in the history of our country,” accused opponents of cheating in elections without evidence, and criticized the United Auto Workers union. Michigan remains a crucial swing state on the road to the White House. Biden won the state in 2020, while Trump won it in 2016. Polling indicates that Biden and Trump remained locked in a tight race in battleground states. A July CBS News/YouGov poll found that in battleground states, Biden polled at 48% and Trump at 51%, though the results were within the margin of error.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOne week after a bullet nearly took his life, former President Donald&#8230;\n\n\nThis Post: Trump Embraces Polarizing Rhetoric at First Rally Following Assassination Attempt first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-embraces-polarizing-rhetoric-at-first-rally-following-assassination-attempt/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-07/240720-trump-vance-ch-1317-a6310f.jpg","video":null,"publish_date":"2024-07-21 00:42:02","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.816},{"id":252248726,"title":"FBI informant Alexander Smirnov’s face revealed in newly discovered photos. He faces charges for alleged lies about Joe and Hunter Biden bribery accusations.","text":"FBI informant Alexander Smirnov, who was indicted for lying to the feds after claiming Joe Biden took a $5million bribe, has been unmasked for the first time by DailyMail.com. Israeli-American Smirnov, 43, was secretly used for years by the FBI as a trusted Confidential Human Source. But every time he appears in public he goes to great lengths to cover his face to avoid being recognized. But now DailyMail.com has obtained previously unpublished pictures of the man who told his FBI handler he was at meetings with a Ukrainian oligarch who bragged about bribing Joe Biden and his son Hunter with $10million. Republican lawmakers published an FBI write-up of the claims, and seized upon it as evidence of the president’s corruption. But in February prosecutors charged Smirnov with lying to the FBI by fabricating the bribery story – and suggested that he was in fact a Russian double agent planting Kremlin disinformation. Smirnov, represented by top Vegas attorney David Chesnoff, has entered a not guilty plea. Photographs exclusively obtained by DailyMail.com show him partying in Las Vegas, his city of residence before he was thrown in federal prison awaiting trial. The mysterious informant has never been pictured in public without a mask. At a court hearing on February 20, Smirnov’s girlfriend Diana Lavrenyuk, 58, and cousin Linor Shefer, 38, were pictured flanking him as he walked through a gaggle of journalists and photographers with his face covered with sunglasses, a face mask, scarf and hood. Photographs inside the federal courthouse were prohibited. The unmasked pictures, obtained by DailyMail.com from a source who has worked with Smirnov, show him flying business class with Lavrenyuk, taking a selfie while smoking a cigarette beside the Bellagio Fountain in Vegas, and attending a gala dinner with his girlfriend, who wore a red dress, furs, and a costume mask over her eyes. Other undated photos show Smirnov dressed in a black suit, red rose boutonniere and gold chain, appearing sloppy with his eyes closed, at a Vegas hotel dinner table with Lavrenyuk posing by his side. In April CBS News previously obtained a grainy passport photo of Smirnov from several years ago – the only other unmasked picture of the mysterious man. The Israeli-American kept a low profile while he acted as a paid informant for federal law enforcement over 13 years, helping numerous criminal and counterintelligence probes, according to prosecutors. His indictment revealed he was the ‘Confidential Human Source’ who told handlers about alleged 2015 and 2016 meetings with the owner of Ukrainian gas firm Burisma, Mykola Zlochevsky, in which the oligarch boasted about bribing Joe and his son Hunter Biden with $5million each. Smirnov now faces 25 years in prison for allegedly fabricating the claims, and is accused of ‘high-level’ and ‘extremely recent’ links with senior Russian intelligence officials – including the chief of an assassination squad. An FBI report describing his claims about the Bidens became one of the shocking documents in the Republican impeachment probe of the President when it was published last year. The allegations are now being cast as potential Russian propaganda by Special Prosecutor David Weiss. In federal court filings, Weiss said Smirnov’s travel and communication records show he didn’t engage with Burisma executives until 2017, and he never met Zlochevsky. One of Weiss’s court submissions claimed Smirnov had ‘high-level contacts with Russian intelligence operatives,’ and that he passed on ‘false information’ to the FBI from these sources. The filing said Smirnov told his FBI handlers that one of his confidants was a son of a ‘former high-ranking Russian government official,’ who ‘controls two groups of individuals tasked with carrying out assassination efforts in a third-party country.’ Prosecutors said Smirnov had planned to be back in the US for just two days, before flying to meet his Kremlin spy contacts, when he was arrested in Vegas. Weiss claimed Smirnov had $6million in ‘liquid funds’, including $3.8million accessible by his ‘wife/girlfriend’, who pays his personal expenses from her own account – an apparent reference to Lavrenyuk, 58. Residency records show her living with Smirnov in San Juan Capistrano, California, until 2023. A three-bed, 2,805 sq ft condo in a Vegas luxury high-rise was purchased in her name for $980,000 in February 2022. Smirnov has a murky background with ties to trading of penny stock public companies and offshore companies. A source who worked with Smirnov provided company documents showing the FBI informant is linked to a firm called A.S. Financials Ltd in the Republic of Vanuatu, a tiny Pacific island chain off the northeast coast of Australia. Despite being named after Smirnov’s initials, the firm’s sole director and shareholder is his father, Konstantin Smirnov, a Russian-born Israeli resident, 2017 company documents show. Konstantin is also a partner in Felymos Trades Inc, a company based in the offshore tax haven of Panama, another document obtained by DailyMail.com shows. Hints of the FBI informant’s double-life slipped through to neighbors at his former home in San Juan Capistrano in conversations over dinner at a local steakhouse or backyard barbecue. ‘He said he had connections with important people. In one conversation he mentioned that he had a meeting with the Minister of Defense in Afghanistan,’ one neighbor, who asked to remain anonymous, told DailyMail.com. ‘And he had connections with important people in the US.’ ‘I know he was involved with the government. I know he was originally from the East Bloc. Though I don’t think he actually told me that,’ said Mike Pastore, a 75-year-old mortgage broker who lives opposite the terracotta-tiled four-bed house where Smirnov resided the past five years before moving to Vegas in 2023. ‘From time to time, we talked about geopolitical stuff, and he was well informed. It was an interesting conversation with him… He traveled a lot.’ The government’s prosecution of Smirnov for lying is a dramatic reversal of their position from just last year, when FBI director Christopher Wray said that the then-unidentified informant was so valuable to the Bureau’s investigations that they could not release a write-up of his interviews with a handler to Republican lawmakers. And after using the intelligence Smirnov provided for many federal probes over a decade, the new charges against him have opened a can of worms for the government. Other defendants, who were convicted after federal probes involving Smirnov, have started challenging their charges. Andrew Hackett, 35, says he is a victim of a government cover-up of Smirnov’s involvement in his case, over a pump-and-dump stock trading scheme. The Justice Department claimed he used telemarketing and newsletters to pump up the price of a penny stock he owned, then planned to ‘dump the stock at inflated prices on innocent investors’. Hackett was convicted of securities fraud in August 2021 and sentenced to 46 months in prison. Last week Hackett, who does not have a lawyer, filed a motion for a new trial in a California federal court, claiming the government failed to hand over evidence recorded by Smirnov that could prove his innocence. Hackett says that Smirnov participated in his business calls, spoke with Hackett’s business partners, and would have recorded those calls and meetings as part of his work as an FBI informant – but that prosecutors failed to hand over those records before Hackett’s 2018 trial. Hackett believes those records will show that he was conducting business legally, rather than orchestrating a pump-and-dump fraud. ‘Smirnov’s interactions and reports […] would have reasonably affected the jury’s judgment,’ Hackett wrote in his July 5 legal filing to a Los Angeles federal court. ‘The intentional non-disclosure of such evidence allowed the Government to mislead the jury, deceive the Court during its Motions in Limine, and provide a false presentation of the facts at trial. ‘The Government purposely continues to withhold disclosure of such evidence, in violation of the defendant’s due process rights.’ DailyMail.com has obtained audio recordings of some of those business calls, where Smirnov can be heard speaking with an apparent Russian accent.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFBI informant Alexander Smirnov, who was indicted for lying to the feds&#8230;\n\n\nThis Post: FBI informant Alexander Smirnov&#8217;s face revealed in newly discovered photos. He faces charges for alleged lies about Joe and Hunter Biden bribery accusations. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/fbi-informant-alexander-smirnovs-face-revealed-in-newly-discovered-photos-he-faces-charges-for-alleged-lies-about-joe-and-hunter-biden-bribery-accusations/","image":"https://i.dailymail.co.uk/1s/2024/07/16/22/87418933-13640465-image-a-9_1721164061278.jpg","video":null,"publish_date":"2024-07-21 00:38:51","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.038},{"id":252248652,"title":"Challenges in Biden’s campaign are causing worry among Democrats","text":"If you are a Trump-hating Democrat, you are probably having trouble separating your nightmares from reality. After all, the Republicans just had a wildly successful convention while your party is forming circular firing squads. Worst of all, Joe Biden has picked a terrible time to throw a hissy fit, making it impossible to know who will be your party’s presidential nominee. Consider two reports circulating Friday: One says Biden is “in it to win it” and sees a path to victory, the other insists he and his family are discussing his imminent withdrawal. At this point, it’s not clear which is true or even which would be better for Dems. One thing is certain: the confusion perfectly captures the helter-skelter mess Biden has created. His misbegotten presidency amounts to a long list of major failures and he should have had the sense a year ago to pass the torch. But he and the people around him grew fat with arrogance and, cosseted by a cheerleading media, came to believe their own lies about his “accomplishments.” The comeuppance is harsh, with even his exit a disaster. Make no mistake — it will be an exit from the race. He’s running out of time and options, and his attacks on Barack Obama and Hillary Clinton demonstrate that he’s mad enough to blow up the party on his way out the door. Feeling betrayed by people he thought were friends and allies, he’s hitting back by making the most incendiary charge one Dem can make against others: blaming them for Trump’s 2016 election. A Biden source tells NBC: “Can we all just remember for a minute that these same people who are trying to push Joe Biden out are the same people who literally gave us Donald Trump? In 2015, Obama, Pelosi, Schumer pushed Biden aside in favor of Hillary; they were wrong then, and they are wrong now.” The source went on to denounce polls as “BS” and added: “maybe, just maybe, Joe Biden is more in touch with actual Americans than Obama-Pelosi-Schumer?” If that’s Biden’s view, it’s especially bizarre coming from a man who has spent 50 years in Washington, where “actual Americans,” as in ordinary people, are as scarce as the proverbial hen’s teeth. His denial about the polls is also strange given that they have been consistent for months in showing that two-thirds of Democrats believe he should withdraw. A poll here or there might be off, but it’s a fool’s errand to argue with a clear consensus. Perhaps Biden doesn’t even remember the debate debacle on June 27, but it sealed his fate. I said then he was toast and predicted he would be gone from the race within a month, so his exit is on schedule. There’s another reason why Biden can’t be saved: when a Dem incumbent has lost the leftist media, there is no hope. Without the propaganda arm to cover up his stumbles and attack Trump, Biden is forced to articulate his own case, a job beyond his cognitive capacity. The New York Times, which has turned on Biden with a vengeance, recounted Saturday in painful detail how he fumbled every effort to save himself. The Gray Lady is finally getting the picture: the president is a bumbling incompetent, and always has been. In fact, Biden and his few remaining allies have given up arguing he has done a good job as president, focusing entirely on how bad they claim Trump would be. That the president told donors “it’s time to put Trump in a bullseye” shortly before the assassination attempt on the former president is an omen that Biden’s luck has run out. Finally, in a move that recalls the way vultures circle over a soon-to-be corpse, Vice President Kamala Harris picked Friday to visit an ice-cream store. There’s nothing subtle about stealing your boss’ favorite photo-op! Although there’s talk among party pooh-bahs of holding a mini-primary before or during the August convention, they’ll need Biden’s cooperation because the vast majority of delegates are pledged to him on the first ballot. And any move that doesn’t result in Harris being the nominee could split the party along racial lines. That would be rough justice given how Dems have racialized politics for decades. Meanwhile, the GOP convention was the party’s most enthusiastic in years and showcased several key developments. Among them are that Republicans are firmly united behind Trump and his goal of transforming the party into a populist force for working and middle-class Americans. Those forgotten voters provided his winning edge in 2016 and he is going back to the well with reinforcements. He is also broadening the base by making extra efforts to attract black and Latino workers. The roster of speakers included an incredibly diverse line-up, and even featured the president of the Teamsters Union. If there were any doubts about Trump’s focus on workers, they ended with his selection of Ohio Sen. JD Vance as his running mate. His announcement said the author of “Hillbilly Elegy” will be “strongly focused on the people he fought so brilliantly for, the American Workers and Farmers in Pennsylvania, Michigan, Wisconsin, Ohio, Minnesota, and far beyond . . .” It’s no secret the upper Midwest states hold the keys to victory, and Trump’s commitment to winning them is underscored by the way he assigned them to Vance. Indeed, that was a clarifying moment about why he chose Vance. During his conversations about his veep options, Trump always cited two general criteria: Someone who could help him win and someone who could succeed him. Among the contenders, Vance scored highest on both tests. He is half Trump’s age, a clear working-class populist, a big fundraiser and whip-smart. There are, it is true, differences between their economic and tax ideas, but that won’t be a problem unless Vance is foolish enough to undercut Trump. It’s more likely he will quickly realize there is no Republican future in pursuing policies that please Chuck Schumer and Bernie Sanders. As for Trump himself, his acceptance speech managed to be both inspiring and disappointing. His calls for national unity and his riveting description of the effort to kill him made the speech a must-see historic event. Unfortunately, he talked too long — 1 hour and 32 minutes — and lapsed into a rally ramble full of non sequiturs that diluted the initial impact. Less would have been more. In fairness, he had been through an extraordinary week and my interview with him the day after the shooting left me convinced he really does want to unite America and reduce the nasty rhetoric. He partially succeeded Thursday, but still has work to do to persuade fence-sitting voters he realizes the gravity of the nation’s polarization. If he can do that, it won’t matter whether Biden or somebody else is the Dem nominee. Building on his successful policies, a kinder, gentler Trump would win in a landslide.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIf you are a Trump-hating Democrat, you are probably having trouble separating&#8230;\n\n\nThis Post: Challenges in Biden&#8217;s campaign are causing worry among Democrats first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/challenges-in-bidens-campaign-are-causing-worry-among-democrats/","image":"https://internewscast.com/wp-content/uploads/2024/07/Bidens-fading-campaign-is-creating-a-Democrat-nightmare.jpg","video":null,"publish_date":"2024-07-21 00:31:21","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.344},{"id":252248792,"title":"Biden’s fading campaign is creating a Democrat nightmare","text":"If you are a Trump-hating Democrat, you are probably having trouble separating your nightmares from reality. After all, the Republicans just had a wildly successful convention while your party is forming circular firing squads. Worst of all, Joe Biden has picked a terrible time to throw a hissy fit, making it impossible to know who will be your party’s presidential nominee. Consider two reports circulating Friday: One says Biden is “in it to win it” and sees a path to victory, the other insists he and his family are discussing his imminent withdrawal. At this point, it’s not clear which is true or even which would be better for Dems. One thing is certain: the confusion perfectly captures the helter-skelter mess Biden has created. His misbegotten presidency amounts to a long list of major failures and he should have had the sense a year ago to pass the torch. But he and the people around him grew fat with arrogance and, cosseted by a cheerleading media, came to believe their own lies about his “accomplishments.” The comeuppance is harsh, with even his exit a disaster. Getting ugly, and sad Make no mistake — it will be an exit from the race. He’s running out of time and options, and his attacks on Barack Obama and Hillary Clinton demonstrate that he’s mad enough to blow up the party on his way out the door. Feeling betrayed by people he thought were friends and allies, he’s hitting back by making the most incendiary charge one Dem can make against others: blaming them for Trump’s 2016 election. A Biden source tells NBC: “Can we all just remember for a minute that these same people who are trying to push Joe Biden out are the same people who literally gave us Donald Trump? In 2015, Obama, Pelosi, Schumer pushed Biden aside in favor of Hillary; they were wrong then, and they are wrong now.” The source went on to denounce polls as “BS” and added: “maybe, just maybe, Joe Biden is more in touch with actual Americans than Obama-Pelosi-Schumer?” If that’s Biden’s view, it’s especially bizarre coming from a man who has spent 50 years in Washington, where “actual Americans,” as in ordinary people, are as scarce as the proverbial hen’s teeth. His denial about the polls is also strange given that they have been consistent for months in showing that two-thirds of Democrats believe he should withdraw. A poll here or there might be off, but it’s a fool’s errand to argue with a clear consensus. Perhaps Biden doesn’t even remember the debate debacle on June 27, but it sealed his fate. I said then he was toast and predicted he would be gone from the race within a month, so his exit is on schedule. There’s another reason why Biden can’t be saved: when a Dem incumbent has lost the leftist media, there is no hope. Without the propaganda arm to cover up his stumbles and attack Trump, Biden is forced to articulate his own case, a job beyond his cognitive capacity. The New York Times, which has turned on Biden with a vengeance, recounted Saturday in painful detail how he fumbled every effort to save himself. The Gray Lady is finally getting the picture: the president is a bumbling incompetent, and always has been. With allies like these . . . In fact, Biden and his few remaining allies have given up arguing he has done a good job as president, focusing entirely on how bad they claim Trump would be. That the president told donors “it’s time to put Trump in a bullseye” shortly before the assassination attempt on the former president is an omen that Biden’s luck has run out. Finally, in a move that recalls the way vultures circle over a soon-to-be corpse, Vice President Kamala Harris picked Friday to visit an ice-cream store. There’s nothing subtle about stealing your boss’ favorite photo-op! Although there’s talk among party pooh-bahs of holding a mini-primary before or during the August convention, they’ll need Biden’s cooperation because the vast majority of delegates are pledged to him on the first ballot. And any move that doesn’t result in Harris being the nominee could split the party along racial lines. That would be rough justice given how Dems have racialized politics for decades. Meanwhile, the GOP convention was the party’s most enthusiastic in years and showcased several key developments. Among them are that Republicans are firmly united behind Trump and his goal of transforming the party into a populist force for working and middle-class Americans. Those forgotten voters provided his winning edge in 2016 and he is going back to the well with reinforcements. He is also broadening the base by making extra efforts to attract black and Latino workers. The roster of speakers included an incredibly diverse line-up, and even featured the president of the Teamsters Union. If there were any doubts about Trump’s focus on workers, they ended with his selection of Ohio Sen. JD Vance as his running mate. His announcement said the author of “Hillbilly Elegy” will be “strongly focused on the people he fought so brilliantly for, the American Workers and Farmers in Pennsylvania, Michigan, Wisconsin, Ohio, Minnesota, and far beyond . . .” It’s no secret the upper Midwest states hold the keys to victory, and Trump’s commitment to winning them is underscored by the way he assigned them to Vance. Indeed, that was a clarifying moment about why he chose Vance. During his conversations about his veep options, Trump always cited two general criteria: Someone who could help him win and someone who could succeed him. GOP ticket’s promise Among the contenders, Vance scored highest on both tests. He is half Trump’s age, a clear working-class populist, a big fundraiser and whip-smart. There are, it is true, differences between their economic and tax ideas, but that won’t be a problem unless Vance is foolish enough to undercut Trump. It’s more likely he will quickly realize there is no Republican future in pursuing policies that please Chuck Schumer and Bernie Sanders. As for Trump himself, his acceptance speech managed to be both inspiring and disappointing. His calls for national unity and his riveting description of the effort to kill him made the speech a must-see historic event. Unfortunately, he talked too long — 1 hour and 32 minutes — and lapsed into a rally ramble full of non sequiturs that diluted the initial impact. Less would have been more. In fairness, he had been through an extraordinary week and my interview with him the day after the shooting left me convinced he really does want to unite America and reduce the nasty rhetoric. He partially succeeded Thursday, but still has work to do to persuade fence-sitting voters he realizes the gravity of the nation’s polarization. If he can do that, it won’t matter whether Biden or somebody else is the Dem nominee. Building on his successful policies, a kinder, gentler Trump would win in a landslide.","summary":"If you are a Trump-hating Democrat, you are probably having trouble separating your nightmares from reality.","url":"https://nypost.com/2024/07/20/opinion/bidens-fading-campaign-is-creating-a-democrat-nightmare/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/2024-las-vegas-nevada-biden-85656631_22dc98.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-21 00:26:04","author":"Michael Goodwin","authors":["Michael Goodwin"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.397},{"id":252248442,"title":"Beyond Biden, Democrats are split over who would be next — VP Harris or launch a ‘mini primary’","text":"By LISA MASCARO, DARLENE SUPERVILLE and WILL WEISSERT WASHINGTON — As Democrats churn over whether President Joe Biden should stay in the 2024 race, the party turmoil is deepening over whether his Vice President Kamala Harris is next in line for the job or if a “mini primary” should be quickly launched to choose a new nominee before the party’s August convention. Harris hit the campaign fundraising circuit Saturday in breezy Provincetown, Massachusetts, and picked up a nod from the state’s prominent Democratic Sen. Elizabeth Warren, who said before the visit that if Biden were to step aside, his vice president is “ready to step up.” At the event, which organizers said raised $2 million and was attended by 1,000 guests, Harris did not mention the calls for Biden to leave the race or for her to replace him, instead repeating one of her regular campaign lines: “We’re going to win this election,” she said. “Do we believe in freedom? Do we believe in equality? Do we believe in the promise of America? Then are we ready to fight for it?” she called to a cheering crowd. “When we fight, we win.” But installing Harris to the top of the ticket, which would be a history-making moment for the party elevating the first woman, Black person and person of South Asian descent as its presidential nominee, is not at all certain. Officials from the highest ranks, including Speaker Emerita Nancy Pelosi, prefer an open process, some believing it would strengthen any Democratic nominee to confront Republican Donald Trump. “If you think that there is consensus among the people who want Joe Biden to leave…. that they will support Kamala, Vice President Harris, you would be mistaken,” Rep. Alexandria Ocasio-Cortez said this week on a widely discussed social media post. With the publicly aired deliberations, Democrats are prolonging an extraordinary moment of uncertainty and upheaval. Biden has weighty options before him this weekend that could set the direction of the country and his party as the nation heads toward the November election. It’s creating a stark juxtaposition with Republicans, who, after years of bitter and chaotic infighting over Trump, are energized and embracing the former president’s far-right takeover of the GOP, despite his criminal conviction in a hush money case and pending federal criminal indictment for trying to overturn the 2020 election before the Jan. 6, 2021, attack on the Capitol. Biden, despite a week of campaign stops, interviews and insistence that he is the best candidate to take on Trump in a rematch, hasn’t been able to quell the uproar. Skeptical Democrats doubt he can keep the White House after his stumbled debate performance last month, and worry he will take hopes for party control of Congress down with him. On Saturday, Rep. Mark Takano, the top Democrat on the House Veterans Affairs Committee, added his name to the list of nearly three dozen Democrats in Congress who say it’s time for Biden to leave the race. The Californian called on Biden to “pass the torch,” to Harris. More lawmakers are expected to speak out in the days ahead. Donors have raised concerns. “There is no joy in the recognition he should not be our nominee in November,” said Democratic Rep. Morgan McGarvey of Kentucky, one of the Democrats urging Biden’s exit from the race. From his beach home in Delaware, Biden, 81, is isolating after announcing a COVID infection, but also politically with a small circle of family and close advisers. White House doctor Kevin O’Connor said Saturday that Biden’s symptoms were improving, but that he remained plagued by a dry cough and hoarseness. He received separate briefings Saturday on domestic and national security issues, the White House said. The president’s team insisted he’s ready to return to the campaign this coming week to counter what he called a “dark vision” laid out by Trump. “Together, as a party and as a country, we can and will defeat him at the ballot box,” Biden said in a statement Friday. But outside the Rehoboth enclave, the debate and passions are intensifying. Very few of the Democratic lawmakers who are agitating for Biden to leave have mentioned Harris in their statements, and some have said they favor an open nominating process that would throw the party’s endorsement behind a new candidate. A person familiar with Pelosi’s thinking said that while she is a friend and admirer of the vice president, she believes that anybody who wants to be president is better served by such a process, believing that whoever emerges as the candidate would be strengthened to win the election. The person spoke on condition of anonymity to characterize Pelosi’s thought process. Rep. Zoe Lofgren of California, a Pelosi ally who has called on Biden to step aside, said Friday on MSNBC that some kind of “mini-primary” that would include Harris makes sense. Democratic Sens. Jon Tester of Montana and Peter Welch of Vermont have both called for Biden to exit the race and said they would favor an open nominating process at the convention. “Having it be open would strengthen whoever is the ultimate nominee,” Welch said in an interview with The Associated Press. Other Democrats say it would be politically unthinkable to move to someone other than Harris, and logistically unworkable with a virtual nominating vote being planned for early next month, before the Democratic convention opens in Chicago on Aug. 19. Minnesota Rep. Betty McCollum, who has called on Biden to step aside, explicitly endorsed Harris as a replacement. “To give Democrats a strong, viable path to winning the White House, I am calling upon President Biden to release his delegates and empower Vice-President Harris to step forward to become the Democratic nominee for President,” McCollum said in her statement. The standoff over Biden’s political future has become increasingly untenable for the party and its leaders, a month from the Democratic National Convention that should be a unifying moment to nominate their incumbent president to confront Trump. Instead, the party is at a crossroads unseen in generations. It’s unclear what else, if anything, the president could do to reverse course and win back lawmakers and Democratic voters, who are wary of his ability to defeat Trump and serve another term, Biden, who sent a defiant letter to Democrats in Congress vowing to stay in the race, has yet to visit Capitol Hill to shore up support, an absence noticed by senators and representatives. The president did conduct a round of virtual conversations with various caucuses in the past week — some of which ended poorly. Associated Press writers Mary Clare Jalonick, Seung Min Kim, Farnoush Amiri and Zeke Miller in Washington contributed to this report.","summary":"Officials from the highest ranks, including Speaker Emerita Nancy Pelosi, prefer an open process, some believing it would strengthen any Democratic nominee.","url":"https://www.ocregister.com/2024/07/20/beyond-biden-democrats-are-split-over-who-would-be-next-vp-harris-or-launch-a-mini-primary/","image":"https://www.ocregister.com/wp-content/uploads/2024/07/AP24199694798323.jpg?w=1024","video":null,"publish_date":"2024-07-21 00:12:42","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.014},{"id":252248416,"title":"Key Moments from Donald Trump's Michigan Rally","text":"Former President Donald Trump held his first campaign rally since surviving an assassination attempt last weekend, addressing a crowd at Van Andel Arena in Grand Rapids, Michigan, on Saturday.The event came on the heels of Trump's official nomination at the Republican National Convention (RNC) and recent legal victories.Heightened Security MeasuresSecurity was notably tighter at the Michigan rally, with the U.S. Secret Service taking the lead following the incident in Butler, Pennsylvania. Local law enforcement agencies, including the Grand Rapids Police Department, Kent County Sheriff's Office, and Michigan State Police, provided additional support.Trump's Appearance, No BandageAs Trump took the stage, he sported a smaller, beige-colored bandage on his ear, a visible reminder of the recent assassination attempt. The former president had been wearing a visible, white bandage over his right ear following the attempt on his life in Pennsylvania.Despite the ordeal, Trump appeared energetic and defiant, addressing the incident and praising the actions of his security team and first responders.JD Vance's Debut as Running MateOhio Senator JD Vance made his first appearance as Trump's newly announced running mate. In his 13-minute speech, Vance focused on appealing to blue-collar and middle-class voters in key Rust Belt states.He attacked the Biden administration's border policies and echoed Trump's \"Make America Safe Again\" slogan.Vance criticized Vice President Kamala Harris for her role as \"border czar,\" calling it a disaster. He emphasized his own humble beginnings in Ohio and stressed the importance of restoring the American dream for every child in the country.\"Took a Bullet for Democracy\" ClaimIn a striking moment during the rally, Trump declared that he \"took a bullet for democracy.\" This statement was a direct reference to the assassination attempt at his rally in Butler, Pennsylvania, last weekend.Rep. Ronny Jackson, Trump's physician, has stated that a bullet grazed Trump's right ear during the incident.Impromptu \"Poll\" on Democratic OpponentsIn a notable moment, Trump paused to comment on recent efforts by some Democrats to push President Biden off their ticket. He then conducted an impromptu \"poll\" with the Republican audience, asking who they most wanted him to run against.Trump first mentioned Vice President Kamala Harris, mispronouncing her name, which elicited boos from the crowd.When he named \"crooked Joe Biden,\" the crowd's booing intensified significantly. Trump also mentioned Gretchen Whitmer, the Democratic governor of Michigan, who received boos but not as loudly as those for Biden.Controversial Remarks on Foreign LeadersTrump doubled down on his praise for leaders that the Biden administration and other U.S. officials have condemned as dictators. He spoke positively about Chinese President Xi Jinping, describing him as a \"brilliant man\" who controls 1.4 billion people with an \"iron fist.\" Trump asserted that Xi makes people like Biden look like \"babies\" in comparison.In a notable revelation, Trump claimed that Xi and other world leaders had reached out to him following last week's assassination attempt. \"I got along very well with President Xi, who's a great guy,\" Trump said. \"He wrote me a beautiful note the other day when he heard about what happened.\"Trump extended this claim to other global leaders, stating, \"Most of the leaders did, you know, a lot of them didn't like what I was doing to them, but they also knew it was about time, the jig was up, right? It was about time. But they wrote me, almost all of them wrote me notes. It was nice.\"The former president used these purported communications to emphasize his international relationships, adding, \"No, I have a good relationship with all of them. That's a good thing.\"Acknowledging the scrutiny his praise of Xi often draws in the press, Trump remained undeterred, even expanding on his comments. He went further by describing both Xi and Russian President Vladimir Putin as \"smart\" and \"tough.\"Distancing from Project 2025In a surprising move, Trump used the rally to distance himself from Project 2025, a conservative policy initiative run by some of his allies. He declared that he is not an \"extremist\" and criticized the project as an effort from the \"severe right\" and \"seriously extreme.\"Trump positioned Project 2025 as \"the opposite of the radical left,\" seemingly attempting to portray himself as a more moderate choice in the upcoming election. This marks a significant escalation in Trump's efforts to separate himself from the Heritage Foundation-led initiative, which has been a target of criticism from Democrats.Looking AheadAs the rally concluded, Trump promised a vigorous campaign in the coming months, with a particular focus on battleground states like Michigan.The 2024 presidential race is shaping up to be one of the most closely watched in recent American history, with legal battles still looming for Trump and questions about Biden's political future persisting.Newsweek contacted the Trump-Vance campaign via email on Saturday for comment.","summary":"The former president said he took a \"bullet for democracy\" while addressing the crowd during the campaign stop.","url":"https://www.newsweek.com/key-moment-donald-trump-michigan-rally-1928061","image":"https://d.newsweek.com/en/full/2433341/donald-trump-michigan.jpg","video":null,"publish_date":"2024-07-21 00:11:27","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.203},{"id":252248316,"title":"Letter from Trump campaign provides update on his injury and treatment following last week’s assassination attempt","text":"NEW YORK – Donald Trump’s campaign released an update on the former president’s health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania. The memo, from Texas Rep. Ronny Jackson, who served as Trump’s White House physician, offers new details on the nature of the GOP nominee’s injuries and the treatment he received in the immediate aftermath of the attack. According to Jackson, Trump sustained a gunshot wound to the right ear from a high-powered riffle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” The bullet track, he said, “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear. There was initially significant bleeding, followed by marked swelling of the entire upper ear.” While the swelling has since resolved and the wound “is beginning to granulate and heal properly,” he said Trump is still experiencing intermittent bleeding, requiring the dressing that was on display at last week’s Republican National Convention. At Saturday’s rally, the white gauze on Trump’s ear was replaced by a skin-colored bandage. “Given the broad and blunt nature of the wound itself, no sutures were required,” Jackson wrote. Trump was initially treated by medical staff at Butler Memorial Hospital. According to Jackson, doctors “provided a thorough evaluation for additional injuries that included a CT of his head.” Trump, he said, “will have further evaluations, including a comprehensive hearing exam, as needed. He will follow up with his primary care physician, as directed by the doctors that initially evaluated him,” he wrote. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” he added. The letter is the first official update about the former president’s condition since the night of the shooting. Jackson, a staunch Trump supporter, said in the letter that, as Trump’s former doctor, he was deeply concerned about the former president’s wellbeing in the aftermath of the attack and met him in Bedminster, New Jersey, late Saturday after Trump returned from Pennsylvania “to personally check on him, and offer my assistance in any way possible.” He said he has been with Trump since that time, evaluating and treating his wound daily. That includes traveling with him Saturday to Michigan, where the former president will hold his first rally since the shooting, joined by his newly named running mate, Ohio Sen. JD Vance. Jackson appears to be licensed to practice medicine in Florida, according to a state health department database. Records from the American Board of Emergency Medicine also show that Jackson has a certification in Emergency Medicine, valid through the end of 2025. A spokesperson for the congressman did not immediately provide a response and Trump campaign’s did not immediately respond to questions. Last year, Trump’s campaign released a letter on President Joe Biden’s 81st birthday from Dr. Bruce A. Aronwald, a New Jersey physician, who said he had been the former president’s doctor since 2021. ___ A previous version of this story mistakenly said Jackson’s emergency certification was valid through the end of 2015. It is valid through the end of 2025. ___ Associated Press writer Cedar Attanasio contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – Donald Trump&#8217;s campaign released an update on the former&#8230;\n\n\nThis Post: Letter from Trump campaign provides update on his injury and treatment following last week&#8217;s assassination attempt first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/letter-from-trump-campaign-provides-update-on-his-injury-and-treatment-following-last-weeks-assassination-attempt/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Trump-campaign-releases-letter-on-his-injury.jpg","video":null,"publish_date":"2024-07-21 00:10:47","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.119},{"id":252248440,"title":"Trump holds first rally after assassination attempt with his new running mate, Vance, by his side","text":"By JOEY CAPPELLETTI and JILL COLVIN GRAND RAPIDS, Mich. — Donald Trump held his first campaign rally since he survived an assassination attempt Saturday, returning to the battleground state of Michigan alongside his newly named running mate. “It was exactly one week ago, even to the hour, even to the minute,” Trump told the crowd, reflecting on the July 13 shooting in Pennsylvania that left him with a bloodied ear, killed one of his supporters and left two others injured. “I stand before you only by the grace of almighty God,” he said, the white gauze on his ear now replaced by a skin-colored bandage. “I shouldn’t be here right now,” he went on. Trump was joined by Ohio Sen. JD Vance at the pair’s first event together since they became the GOP’s nominees at the Republican National Convention in Milwaukee. “I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said before Trump’s arrival. Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, insulting his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience. At one point, Trump glanced at a screen showing him from an unusual angle and joked about his combover. “That’s a severe sucker. What’s with that one?” he said. “I apologize. Man! I looked up there, I said, ‘Whoa!’ That’s like a work of art!” At another point, as he invited a supporter on stage, he quipped, “He does not carry guns!” But Trump also talked about the shooting, acting out how he’d turned his head to look up at a chart of southern border crossings projected on a giant screen, narrowly dodging the bullet that hit his ear. “I owe immigration my life,” he said. Hours before he took the stage, Trump’s supporters crowded the streets of downtown Grand Rapids in anticipation of the former president’s remarks. Supporters began lining up Friday morning, and by Saturday afternoon, the line stretched close to a mile from the entrance of the 12,000-seat Van Andel Arena. Many wore shirts featuring the image of Trump, on stage, after he was shot, pumping his fist in the air, along with the usual red “Make America Great Again” hats. Mike Gaydos, who traveled from Indiana with his three sons to attend the rally, said he didn’t consider himself a “huge” Trump supporter in the past but wanted to show support for the former president following his attempted assassination. “We can’t allow something like that to collar us,” he said. “Bravery is what I thought he showed that day, and I want to show my sons about bravery as well.” Numerous streets, closed as an additional security precaution, were dotted with vendors selling food and apparel. Among them was a vendor from North Carolina who said he had spent the night making shirts featuring “Trump Vance ’24.” Downtown Grand Rapids also saw a significant police presence, with officers stationed on nearly every block, while others patrolled on horseback and bicycles. The heightened security outside the venue created a tense environment, with some attendees mentioning that drones overhead had made them nervous. The event was held indoors, which makes it easier to secure. Attendees were required to pass through a metal detector upon entering the arena, yet the presence of security inside appeared consistent with previous events. “This is the tightest I’ve ever seen the security,” said Renee White, who said that she’s been to 33 of Trump’s rallies. “We usually can bring in some small bags, but today I had to just leave stuff out there.” White had been seated behind the podium at the rally in Butler, Pennsylvania, where the gunman opened fire from a nearby rooftop. She described the shooting as “surreal” but said that it wouldn’t stop her from going to his rallies. “If I’m going to be taken out, at least I’m doing something I love to do, right?” she said. On Saturday, she was again seated behind Trump, almost in the same spot as she had been in Butler. Trump’s choice of Vance was aimed, in part, at helping him win support from Rust Belt voters in places like Michigan, Pennsylvania, Wisconsin and Ohio who helped Trump notch his surprise 2016 victory. Vance specifically mentioned those places during his acceptance speech at the convention, stressing his roots growing up poor in small-town Ohio and pledging not to forget working-class people whose “jobs were sent overseas and children were sent to war.” Democrats have dominated recent elections in Michigan, but Republicans now see an opening in the state, especially as Democrats remain divided about whether Biden should drop out of the race. Biden has insisted he is not quitting, and has attempted to turn the focus back towards Trump, saying Friday that Trump’s acceptance speech at the Republican convention showcased a “dark vision for the future.” Trump on Saturday polled the crowd on who they’d like to see as his opponent, with cheers for Biden and loud boos when Trump asked about Vice President Kamala Harris. Trump and his team have tried to cast Democrats’ efforts to replace Biden as a “coup” in what appears to be part of a larger effort to try to distract from Trump’s efforts to overturn the 2020 election after he refused to accept the results, as well as the Jan. 6 attack on the Capitol by his supporters. “At this very moment, Democrat Party bosses are frantically trying to overthrow the results of their own party’s primaries to dump Crooked Joe Biden from the ballot,” Trump charged. Later, he pushed back against efforts to cast him as a threat to democracy and an extremist, even as he has vowed mass deportations and threatened retribution against his political enemies. “They keep saying, ’He’s a threat to democracy…’ Last week I took a bullet for democracy,” he said to rousing cheers. Trump also again tried to distance himself from the Heritage Foundation’s Project 2025, a policy and personnel plan for a second Trump term that was crafted by a host of former administration officials. Trump blasted the project, which has become a centerpiece of Biden’s campaign, as “severe right” and “seriously extreme,” just like the ”radical left.” “I don’t know anything about it,” he insisted. Biden’s campaign responded with a statement that noted Trump’s speech accepting the GOP nomination, in which he urged unity and said he was “running to be president for all of America, not half of America.” “We were promised a new Donald Trump who would unite the country — instead all we saw tonight was the same Donald Americans keep rejecting over and over,” said Biden-Harris spokesperson Ammar Moussa. “He’s peddling the same lies, running the same campaign of revenge and retribution, touting the same failed policies, and — as usual — focused only on himself.” The 81-year-old Democratic incumbent, who appeared in Detroit this month, is currently isolating at his beach home in Delaware recovering from COVID-19. U.S. Rep. Hillary Scholten, a Democrat representing Grand Rapids, is among the growing number of lawmakers calling on Biden to exit the race after his disastrous performance at last month’s debate. Colvin reported from New York","summary":"Hours before he took the stage, Trump’s supporters crowded the streets of downtown Grand Rapids, Michigan, in anticipation of the former president’s remarks.","url":"https://www.ocregister.com/2024/07/20/trump-holds-first-rally-after-assassination-attempt-with-his-new-running-mate-vance-by-his-side/","image":"https://www.ocregister.com/wp-content/uploads/2024/07/Election_2024_Trump_21016.jpg?w=1024","video":null,"publish_date":"2024-07-21 00:08:57","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.069},{"id":252248206,"title":"Alarming revelations from a recent Secret Service whistleblower suggest a shortage of trained agents and a controversial director with links to Jill Biden.","text":"There was a surreal scene at the Republican National Convention on Wednesday as irate senior senators chased the embattled director of the U.S. Secret Service into a women’s bathroom. ‘You answer to us!’ ‘You can’t hide from us!’ Senators Marsha Blackburn and John Barrasso shouted and pointed angrily – pursuing Secret Service director Kimberly A. Cheatle through the lobby of Milwaukee’s Fiserv Forum and up a flight of stairs. Cheatle, 53, flanked by her agents, scurried into the lavatory. Her staff held the door, blocking the livid lawmakers out. ‘It is appalling that the Secret Service Director refused to answer our questions,’ said Senator Blackburn after the incident. Fury had erupted earlier in the day after Cheatle and her top aides briefed senators in a private conference call about the attempted assassination of President Donald Trump at a campaign rally in rural Butler, Pennsylvania on Saturday. Senator Barrasso called the meeting a ‘100% cover-your-a** briefing.’ Cheatle was apparently unable to explain how agents failed to stop Thomas Matthew Crooks from clambering onto a roof and shooting at Trump from less than 150 yards away – even though the gunman was spotted by law enforcement 20 minutes before the shots were fired. ‘No one has taken responsibility. No one has been held responsible. Someone has died. The president was almost killed. The head of the Secret Service needs to go,’ Barrasso said later. Now as more fingers are pointed at Cheatle, new allegations have revealed the depth of dysfunction within the service, with Department of Homeland Security whistleblowers claiming the majority of Trump’s security detail on Saturday were ‘not even Secret Service’ and were ‘unfamiliar with standard protocols’. Republican Senator Josh Hawley wrote to the DHS Secretary Alejandro Mayorkas on Friday outlining those allegations and a litany of other claimed security flaws: ‘Detection canines were not used to monitor entry and detect threats in the usual manner. ‘Individuals without proper designations were able to gain access to backstage areas. Department personnel did not appropriately police the security buffer around the podium and were also not stationed at regular intervals around the event’s security perimeter.’ Whether or not Hawley’s wild claims are true, the Secret Service and Cheatle have a lot to answer for. And now experts tell DailyMail.com that these failings are a symptom of an ‘agency in crisis’ after decades of understaffing and corrupt promotion and hiring practices. John Koskinen, from the nonpartisan National Academy of Public Administration, led an 18-month study into the Secret Service’s workforce in 2019. Saturday’s events shocked him, but Koskinen was not surprised by the whistleblower claims, telling DailyMail.com that the Service has been struggling to cover an increasing number of people and respond to more sophisticated threats in recent years. ‘Life has gotten much more complicated,’ he said, ‘the threats are more sophisticated and ongoing, and now you’re in the middle of a campaign.’ Cheatle, 53, was appointed director of the Secret Service in 2022, having worked for the agency for 27 years before leaving in 2019 to head up global security at PepsiCo. Announcing her selection, President Joe Biden revealed that ‘Kim’ had ‘served on my security detail when I was Vice President’ and he and Dr. Jill Biden ‘came to trust her judgment and counsel’. Some sources went as far as to tell the New York Post on Monday that Cheatle had been personally tapped for the role by First Lady Jill Biden’s top aide, Anthony Bernal, who is reportedly ‘obsessed’ with DEI. ‘Cheatle served on Dr. Biden’s second lady detail and Anthony pushed for her,’ one source said. ‘I heard at the time she was being considered for director that Anthony had pushed her forward as an option,’ another added. For her part, Cheatle has spoken openly about her goals of raising the number of the agency’s female recruits to 30 percent of all new hires by the year 2030. And she hasn’t done herself any favors in public appearances since that shock security failure in Pennsylvania on last weekend. Cheatle said in an interview on ABC News days after the shooting that agents did not secure the roof from which the assassin fired because, ‘That building in particular has a sloped roof, at its highest point… And so, there’s a safety factor that would be considered there that we wouldn’t want to put somebody up on a sloped roof.’ Critics, like former FBI Assistant Director Chris Swecker said that explanation was ‘absurd.’ ‘Nobody’s saying you have to have somebody on the rooftop. You need to have eyes on the rooftop 100 percent of the time,’ he told the Mail. ‘If they’re too scared to climb up on top of the roof, just keep your eyes on it.’ Tristan Leavitt, who ran a year-long investigation into the Secret Service for the GOP Oversight Committee in 2015, told DailyMail.com it was likely that Cheatle was promoted due to her close relationship with the Bidens. ‘It is pretty standard,’ he said, ‘directors have typically come from within, so if you’re going to pick someone from within, you’re going to pick someone you have a good relationship with.’ The danger, Leavitt says, is that personal connection is ‘not a great basis on which to select someone’. He added: ‘The assassination attempt on Saturday appears to be closely associated to a manpower issue, the Secret Service have been hemorrhaging staff for a long time’. ‘Many, many agents within the Secret Service thought that within the service the best people weren’t being promoted, it’s more about who you knew,’ he said. ‘It’s an agency in crisis.’ Of course, previous Secret Service directors have also worked closely with presidents prior to their selection. James Murray, who was the director before Cheatle, served at Trump’s 2016 election and inauguration, and Joe Clancy, a few years before him, served in Barack Obama’s personal protection detail. However, this is not the first time that Cheatle’s or the Secret Service’s close ties to the Bidens have been called into question. Agents were accused of improperly intervening in the investigation into whether the President’s son Hunter Biden lied on federal firearms forms to buy a revolver at a Delaware gun shop in 2018. In June, Hunter was convicted on three felony charges related to the purchase. But early on in that case, FBI documents revealed, that the gun store owner claimed that Secret Service agents showed up at his business and asked to remove the documents Hunter has signed. The shop-owner refused and the agents allegedly left. The Secret Service has denied the claims, but two years later, the government transparency group Judicial Watch obtained hundreds of pages of internal communications between Secret Service officials about the alleged incident. The documents revealed that agency officials discussed media reports of the incident. One agent found it ‘odd’ that the agency would be involved in the investigation since the Biden Family was not receiving Secret Service protection at the time. Another official responded: ‘Maybe we were asked for a favor?’ ‘These new documents suggest that one can’t take at face value the Secret Service’s denial that it wasn’t involved in the Hunter Biden gun cover-up,’ Judicial Watch President Tom Fitton told DailyMail.com at the time. Cheatle herself was then dragged into the debacle surrounding Hunter’s trials in September 2023, when the House Oversight Committee ordered her to make her employees available for interview after whistleblowers alleged Secret Service agents tipped off the Bidens about an IRS investigation into Hunter. Additionally, IRS supervisory agent Gary Shapley and FBI supervisory special agent Joe Gordon alleged that they were told by FBI brass to wait for Secret Service permission before they could go to Hunter’s home to interview him. According to Shapley and Gordon that Secret Service call never came. Following Trump’s near-death, Leavitt says there is no way Cheatle will be able to stay in her post. ‘The difference between life and death in Saturday’s attempted assassination of former President Trump was centimeters and a slight wind,’ he said on X. And as fury mounts, he says it is not a question of if Cheatle resigns, but when.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThere was a surreal scene at the Republican National Convention on Wednesday&#8230;\n\n\nThis Post: Alarming revelations from a recent Secret Service whistleblower suggest a shortage of trained agents and a controversial director with links to Jill Biden. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/alarming-revelations-from-a-recent-secret-service-whistleblower-suggest-a-shortage-of-trained-agents-and-a-controversial-director-with-links-to-jill-biden/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Damning-new-Secret-Service-whistleblower-claims-about.jpg","video":null,"publish_date":"2024-07-21 00:08:05","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.804},{"id":252248672,"title":"Trump revels in campaign trail return after shooting","text":"GRAND RAPIDS, Michigan — Despite promising during his nomination acceptance speech during last week’s Republican National Convention not to keep revisiting his assassination attempt, former President Donald Trump relived the moment during his first post-shooting rally in Grand Rapids. “It was exactly a week ago today almost to the hour, almost to the minute,” Trump told a crowd of 13,000 people Saturday in downtown Grand Rapids to chants of “fight, fight, fight,” the same words he uttered before Secret Service ushered him off the stage to safety seven days ago in Butler, Pennsylvania. When the crowd started booing members of the news media who were present at Trump’s mention, the former president discouraged them, contending that the attempt on his life was covered fairly. “They keep saying, ‘He’s a threat to democracy,'” he said. “I’m saying, ‘What the hell did I do for democracy? Last week I took a bullet for democracy! What did I do against democracy?’ Crazy.” Trump, who now has a smaller bandage covering where the bullet grazed his ear, shared with the crowd that he had telephone discussions with Elon Musk, who announced his endorsement of the former president this week. The SpaceX CEO also committed to donating $45 million to his campaign a month, revealing that he does not have a problem with the Republican presidential nominee’s position against electric vehicles, a hot-button issue in Michigan. Trump also welcomed Judge Aileen Cannon’s dismissal of his classified documents case in Florida, claiming, “When you have honorable judges … good things can happen.” Thousands of people were outside the Van Andel Arena by 9 a.m. Saturday, hours before Trump was scheduled to speak at 5 p.m., expecting stricter security after last week. The indoor venue can be compared with the outdoor Butler Farm Show, which experts describe as a soft target for attacks, such as the one that unfolded. A week after Secret Service agents, who have been criticized since the shooting, put themselves between Trump and a possible second bullet, the group outside repeatedly cheered and applauded passing police officers. The second promise Trump broke during his convention address was his aides’ pledge that he would not say President Joe Biden‘s name. Trump made no such promise for Saturday, mocking Democrats for reconsidering the incumbent as their nominee in a county the former president won in 2016 but lost in 2020. “It’s sort of interesting, this guy goes and he gets the votes and now they want to take it away,” he said of the primary. “That’s democracy. They talk about democracy, ‘Let’s take it away from him’.” Gov. Gretchen Whitmer (D-MI), among the rumored Democrats who could replace Biden as the party’s nominee should he decide to step aside, responded to Trump and Vance’s appearance in Michigan in a video, reiterating that her state is for abortion access, lowering costs, and workers’ rights. “Oh, and one more thing, Michigan is going to reject your extreme Project 2025 agenda,” Whitmer said, referring to policies proposed by the Heritage Foundation, a conservative think tank. Distancing himself from Project 2025 as a plan of the “severe right,” Trump quipped that he would rather run against Whitmer, conducting a poll of the crowd regarding who should be the Democratic nominee. “I’d like to run against her,” he said, reminding the crowd that Whitmer’s husband could do “whatever he wanted” during her COVID-19 lockdown. Trump was introduced by Sen. J.D. Vance (R-OH), his running mate, who spoke twice during his campaign trail debut Saturday. “You’re going to be a fantastic vice president of the United States,” Trump said. “I chose him because he’s for the worker, he is for the people who work so hard.” During his historically long prime-time acceptance remarks Thursday at Milwaukee’s Fiserv Forum, Trump told that arena that “the assassin’s bullet came within a quarter of an inch of taking my life.” “So many people have asked me what happened, ‘Tell us what happened please,’ and therefore I’ll tell you what happened, and you’ll never hear it from me a second time because it’s too painful to tell,” he said. After announcing that $6.3 million had been raised for the families of the victims of the Butler rally, including Corey Comperatore, the former fire department chief who was killed, Trump alluded to a chart with immigration statistics. The Republican presidential nominee has taken to projecting the chart at his rallies, and turning toward it last week caused the bullet to sideswipe his head instead of pierce his skull. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER “Last time I put up that chart, I didn’t really get to look at it,” he said. “Without that chart, I would not be here today.” Trump has cemented his position in the 2024 race against Biden as Democrats openly discuss replacing the president as their nominee. Trump leads Biden in Michigan by an average of 2 percentage points, in Pennsylvania by 4.5 points, and Wisconsin by 3.5 points, according to RealClearPolitics.","summary":"GRAND RAPIDS, Michigan — Despite promising during his nomination acceptance speech during last week’s Republican National Convention not to keep revisiting his assassination attempt, former President Donald Trump relived the moment during his first post-shooting rally in Grand Rapids. &#8220;It was exactly a week ago today almost to the hour, almost to the minute,&#8221; Trump told [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3092344/trump-revels-in-campaign-trail-return/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/trump-vance-michigan-scaled.webp","video":null,"publish_date":"2024-07-20 23:59:57","author":"Naomi Lim And Amy Delaura","authors":["Naomi Lim And Amy Delaura"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.3},{"id":252248438,"title":"Donald Trump says China’s Xi Jinping wrote him a ‘beautiful note’ after assassination attempt","text":"Former US President Donald Trump said on Saturday that Chinese President Xi Jinping wrote him a note after the Republican presidential nominee suffered a gunshot wound to his ear during an assassination attempt last week. “[Xi] wrote me a beautiful note the other day when he heard about what happened,” Trump told a crowd in Grand Rapids, Michigan, in his first campaign rally since narrowly escaping the July 13 assassination attempt. Trump mentioned Xi’s letter while discussing his economic policy toward China during his presidency, adding: “I got along very well with President Xi.” The former US president also referenced messages from other world leaders following the shooting at a rally in Pennsylvania. Trump, who called for national unity in a speech on Thursday as he accepted his party’s presidential nomination at the Republican National Convention, made no mention of that in his remarks before a raucous crowd on Saturday. He frequently mocked Democratic US President Joe Biden as feeble. He derided senior Democrats, including Pelosi, for trying to persuade Biden to end his re-election bid. Referring to Pelosi, Trump said: “She’s turned on him like a dog. She’s as crazy as a bed bug.” The Trump campaign did not immediately respond to a request for comment about Trump comparing Pelosi to a dog. Fresh from his nominating convention where his takeover of the Republican Party was cemented, Trump appeared in Grand Rapids with his new vice-presidential pick, Senator J.D. Vance from Ohio. They took the stage in their first campaign event together with the Republican Party unified behind them. In contrast, it is no longer certain that US President Joe Biden will be the Democratic Party’s nominee facing Trump in the November 5 election. Biden has faced calls from some senior Democrats to end his re-election bid after his poor debate performance last month raised concerns over whether he could beat Trump or complete another four-year term. Trump attacked Democrats, saying they wanted to kick Biden off the ticket after he won their presidential nominating contest. “They have a couple of problems. No 1, they have no idea who their candidate is,” Trump said to laughter and jeers. “This guy goes and he gets the votes and now they want to take it away.” “As you’re seeing, the Democrat Party is not the party of democracy. They’re really the enemies of democracy.” He added: “And they keep saying, ‘He’s a threat to democracy.’ I’m saying, ‘What the hell did I do for democracy?’ “Last week, I took a bullet for democracy.” Trump referred to the assassination attempt several times on Saturday. “I hope I don’t have to go through that again. It was so horrible,” Trump said. Opinion polls show a tight race between the Trump and Biden at a national level but Biden trailing Trump in the battleground states that are likely to determine the winner. Many Democrats fear he may not have a realistic path to victory and that the party needs a new candidate to take on Trump. There was a heavy police presence at Trump’s rally in Grand Rapids on Saturday, with police on every street corner for several blocks. US Secret Service officers were positioned on the top balconies in the Van Andel Arena, giving them a bird’s-eye view of the crowd inside. Bag searches for those entering the indoor arena earlier in the day were long and thorough, and the Secret Service sweep of the building took about an hour longer than usual. The rally in Butler, Pennsylvania, last weekend was outdoors. At that event, the gunman was able to scale the roof of a building outside the Secret Service perimeter before opening fire on Trump, clipping his ear, killing a rally-goer and wounding several others. The Secret Service, which is responsible for protecting Trump, declined to comment on security for the Grand Rapids event. An investigation is under way into the security failures at the Butler rally. Trump gave a detailed account of his narrow brush with death in his convention speech on Thursday, telling the audience that he was only talking to them “by the grace of Almighty God”. Trump’s former doctor, Ronny Jackson, said on Saturday that the former president is recovering as expected from the gunshot wound to his right ear, but noted intermittent bleeding and said Trump may require a hearing exam. The bullet fired by the would-be assassin at the July 13 rally in Pennsylvania came “less than a quarter of an inch from entering his head,” said Jackson, a Republican congressman from Texas who had served as doctor to US Presidents Trump and Barack Obama.","summary":"The Republican US presidential candidate also mocked rival Biden as feeble and compared senior Democrat Pelosi to a dog.","url":"https://www.scmp.com/news/world/united-states-canada/article/3271278/donald-trump-mocks-democrats-first-campaign-rally-after-assassination-attempt","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/07/21/40cb24a6-347d-4dca-bcd0-b993622ee9cc_ab2d3929.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/15/Web%20Video.mp4","publish_date":"2024-07-20 23:58:05","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.312},{"id":252248310,"title":"Harris gets back on the trail as Biden recovers from COVID","text":"PROVINCETOWN, Mass./REHOBOTH BEACH, Del. — Vice President Harris was back on the campaign trail this weekend, raising money for the Biden-Harris ticket on Cape Cod while President Biden remained sidelined by a case of COVID in his beach house in Delaware. In a large tent near the the harbor, hundreds of Democratic donors cheered and waved fans imprinted with \"Veeptown\" — a play on P-Town, as the beach town known for its LGBTQ history and community is called. Harris focused on former President Donald Trump's policies that removed protections for discrimination for LGBTQ people for health care, employment, and students and his ban on transgender military service. She said Trump's running mate, Ohio Sen. JD Vance, \"undoubtedly will be a rubber stamp for Trump's extremist anti-LGBTQ agenda,\" citing legislation he proposed that would ban gender-affirming care. That prompted a yell of \"Go get 'em, Kamala!\" from one of the donors. Harris is in the spotlight as Biden is sidelined The fundraiser came as the future of Biden's campaign is in question. A disastrous debate against Trump three weeks ago fueled a growing chorus of calls from Democratic party officials and donors for Biden, 81, to end his bid for a second term and let a younger candidate take over. Biden has insisted he will stay in the race. Harris has not publicly engaged in the debate, and did not mention it in her Provincetown remarks. She praised Biden, saying she was \"testifying\" that he fights for \"everyday working Americans.\" But some of the lawmakers asking Biden to step aside have been testifying that Harris should be at the top of the ticket. On Saturday, Rep. Mark Takano, D-Calif., called her a \"tenacious prosecutor\" with the experience to beat Trump. \"Joe, I love you and respect you. But the stakes are too high to fail. It's time to pass the torch to Kamala,\" Takano said in a statement. Sen. Elizabeth Warren, D-Mass. — who has not called for Biden to leave the race — said Harris would unite the party if Biden changes his mind, and praised her for her work on economic issues and abortion rights. \"Look — if you're running against a convicted felon, then a prosecutor like Kamala is really a good person to make that case,\" Warren said on MSBNC. Biden has said he'll be back on the trail this week Biden had been pushing back on concerns about his age and abilities, doing a flurry of events in swing states, as well as as a solo press conference and several interviews. But that came to a halt when he tested positive for COVID last week. His doctor said in a memo on Saturday that Biden's symptoms are improving, though he still has a cough. Since the Republican National Convention ended, the pace of Democrats asking Biden to leave has picked up. Campaign spokesman Michael Tyler told reporters on Saturday that the president would be back out on the trail next week once he gets the green light from his doctor.","summary":"Vice President Harris was in Provincetown, Mass. raising money for the Biden-Harris campaign. Meanwhile, President Biden is stuck in Rehoboth Beach, Del., after COVID took him off the trail.","url":"https://www.npr.org/2024/07/20/nx-s1-5047354/harris-lgbtq-biden-covid","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5559x3127+0+507/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6d%2Fcf%2F811d154f48cfb44ef6dc4bc481b8%2Fgettyimages-2162039073.jpg","video":null,"publish_date":"2024-07-20 23:54:02","author":"Asma Khalid","authors":["Asma Khalid"],"language":"en","source_country":"us","sentiment":-0.015},{"id":252248020,"title":"Spooky video shows deserted roads near Mar-a-Lago following a shooting involving Trump, leading to increased security by Secret Service until the election","text":"THE streets around Mar-a-Lago will remain empty as the Secret Service ramps up security around former President Donald Trump following an assassination attempt last week. Starting July 20, Palm Beach, Florida residents were alerted that no through traffic would be allowed near Trump’s personal resort. The restriction will extend until at least Election Day on November 5, “at minimum,” said town officials. Members of the Secret Service made the decision after Trump was injured at a campaign rally in Butler, Pennsylvania on July 13. A 20-year-old gunman shot at the former president, injuring his ear and killing a rally attendee. Thomas Crooks, the shooter, was fatally shot by a Secret Service sniper, however, the agency has come under fire for supposed failings on the day of the rally. Aside from the attempt on Trump’s life, there have also been ongoing threats including one from Iran weeks before the rally shooting. The street closure will affect the intersection of South County Road and South Ocean Boulevard to the traffic circle that connects Southern Boulevard and South Ocean Boulevard. “We learned on Saturday that whatever it was we were doing did not work. My hope and prayer is that the Secret Service gets it right,” Tim Miller, a retired agent told local NBC affiliate WPTV. DEMANDING ANSWERS Kimberly Cheatle, the Director of the Secret Service was subpoenaed on Wednesday by the House Oversight and Accountability Committee to appear at a congressional hearing regarding the attempted assassination. James Comer, the chairman of the committee, said the subpoena was necessary due to the “lack of transparency and failure to cooperate,” which led many to question Cheatle’s leadership. “The assassination attempt of the former President and current Republican nominee for president represents a total failure of the agency’s core mission and demands Congressional oversight,” he wrote in a letter to Cheatle. That same day, House Speaker Mike Johnson said he was planning to create a task force to investigate security failings during the assassination attempt. Johnson added that he would call on Cheatle to resign from her position. “I think she’s shown what her priorities are,” he told Fox News. However, Cheatle said she would fully participate in a review and would work with congressional committees to look into the shooting. ‘ABSOLUTE MIRACLE’ Republican Representative Ronny Jackson, who served as Trump’s doctor during his presidency revealed that he has been evaluating the wound to his right ear daily. Jackson, who represents the 13th Congressional District of Texas, confirmed that Trump received a gunshot wound to his ear. In a tweet, he explained that the bullet was less than a quarter inch away from Trump’s head, calling it a “miracle” that he survived. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” he wrote. “I am extremely thankful his life was spared. “It is an absolute miracle he wasn’t killed.” More from The U.S. Sun on the Trump rally shooting: Thomas Matthew Crooks, 20, was identified as a person of interest by the Secret Service 62 minutes before the shooting took place, according to reports. Local police spotted Crooks lurking on the rally grounds with a rangefinder, a hunting device used to measure distances to remote objects, about 30 minutes before Donald Trump took the stage at Butler, Pennsylvania. Federal officials said Crooks had a cell phone and a transmitter on him when he was killed on the roof of the AGR building about 400 feet from the rally’s podium. Crooks visited the site of Trump’s rally in Butler at least one time before the shooting, according to CBS News. He also conducted online searches for the date of Trump’s rally in Butler, the Democratic National Convention, FBI Director Christopher Way, Attorney General Merrick Garland, and members of the British Royal Family, the outlet reported. The would-be assassin searched for images of Trump and President Joe Biden. Crooks also hid his father’s assault rifle in advance, according to Fox News. FBI investigators are still working on determining a motive behind Thomas Crooks’ shooting. Crooks’ laptop and two cell phones have been sent to the FBI’s laboratory in Virginia for further analysis. Jackson added that there was significant bleeding and swelling on the upper part of the ear, which has since gone down. However, because the ears have many blood vessels, Jackson said there has been “intermittent bleeding,” which requires bandages. “Given the broad and blunt nature of the wound itself, no sutures were required,” he wrote. Trump will receive more evaluations, including a “comprehensive hearing exam,” said Jackson.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTHE streets around Mar-a-Lago will remain empty as the Secret Service ramps&#8230;\n\n\nThis Post: Spooky video shows deserted roads near Mar-a-Lago following a shooting involving Trump, leading to increased security by Secret Service until the election first appeared on Internewscast Journal","url":"https://internewscast.com/news/spooky-video-shows-deserted-roads-near-mar-a-lago-following-a-shooting-involving-trump-leading-to-increased-security-by-secret-service-until-the-election/","image":"https://internewscast.com/wp-content/uploads/2024/07/Eerie-footage-of-empty-streets-around-Mar-a-Lago-after-Trump-shooting.jpg","video":null,"publish_date":"2024-07-20 23:52:30","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.373},{"id":252248250,"title":"Trump holds first rally with running mate JD Vance","text":"Former President Donald Trump is holding his first campaign rally since he survived an attempted assassination, returning to the battleground state of Michigan alongside his new running mate.\"It was exactly one week ago, even to the hour, even to the minute,\" Trump said before the crowd in Grand Rapids, Michigan, reflecting on the July 13 shooting in Pennsylvania that left him with a bloodied ear, killed one supporter in the crowd and left two others injured.\"I stand before you only by the grace of almighty God,\" he said, the white gauze on his ear now replaced by a skin-colored bandage. \"I shouldn't be here right now,\" he went on.Trump was joined by Sen. JD Vance of Ohio at the pair's first event together since they became the GOP's nominees at the Republican National Convention in Milwaukee.\"I find it hard to believe that a week ago, an assassin tried to take Donald Trump's life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,\" Vance said before Trump's arrival.Michigan is one of the handful of crucial swing states expected to determine the outcome of November's presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democratic President Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency.After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, lashing out at his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience.At one point, Trump glanced at a screen showing him from an unusual angle and joked about his combover.\"That's a severe sucker. What's with that one?\" he said. \"I apologize. Man! I looked up there, I said, 'Whoa!' That's like a work of art!\"At another point, as he invited a supporter on stage, he quipped, \"He does not carry guns!\"But Trump also talked about the shooting, acting out how he'd turned his head to look up at a chart of southern border crossings projected on a giant screen and narrowly dodging the bullet that hit his ear.\"I owe immigration my life,\" he said. \"It's true.\"Hours before he took the stage, Trump's supporters crowded the streets of downtown Grand Rapids in anticipation of the former president's remarks. Supporters began lining up Friday morning, and by Saturday afternoon, the line stretched close to a mile from the entrance of the 12,000 seat Van Andel Arena.Many in the packed arena were seen wearing shirts featuring the image of Trump, on stage, after he was shot, pumping his fist in the air after surviving the shooting, along with the usual red \"Make America Great Again\" hats.Mike Gaydos, who traveled from Indiana with his three sons to attend the rally, said he didn't consider himself a \"huge\" Trump supporter in the past but wanted to show support for the former president following his attempted assassination.\"We can't allow something like that to collar us,\" he said. \"Bravery is what I thought he showed that day and I want to show my sons about bravery as well.\"Security heightened following assassination attemptNumerous streets, closed as an additional security precaution, were dotted with vendors selling food and apparel. Among them was a vendor from North Carolina who said he had spent the night making shirts featuring \"Trump Vance '24.\"Downtown Grand Rapids also saw a significant police presence, with officers stationed on nearly every block, while others patrolled on horseback and bicycles. The heightened security outside the venue created a tense environment, with some attendees mentioning that drones overhead had made them nervous. The event was held indoors — a change from last week in Pennsylvania, where the shooter fired from a rooftop outside the security perimeter.Attendees were required to pass through a metal detector upon entering the downtown Grand Rapids indoor arena, yet the presence of security inside appeared consistent with previous events.\"This is the tightest I've ever seen the security,\" said Renee White, who said that she's been to 33 of Trump's rallies. \"We usually can bring in some small bags but today I had to just leave stuff out there.\"White was seated behind the podium at the rally in Butler, Pennsylvania, where the gunman opened fire from a nearby rooftop. She described the shooting as \"surreal\" but said that it wouldn't stop her from going to rallies.\"If I'm going to be taken out, at least I'm doing something I love to do, right?\" said White.Republicans see opportunity in MichiganTrump's choice of Vance was seen as a move to gain support among so-called Rust Belt voters in places like Michigan, Pennsylvania, Wisconsin and Ohio who helped Trump notch his surprise 2016 victory. Vance specifically mentioned those places during his acceptance speech at the convention, stressing his roots growing up poor in small-town Ohio and pledging not to forget working-class people whose \"jobs were sent overseas and children were sent to war.\"Democrats have dominated recent elections in Michigan, but Republicans now see an opening in the state as Democrats are increasingly divided about whether Mr. Biden should drop out of the race. Biden has insisted he is not quitting and has attempted to turn the focus back towards Trump, saying Friday that Trump's acceptance speech at the Republican convention showcased a \"dark vision for the future.\"Trump weighs in on controversy surrounding Biden's reelection bidTrump, at Saturday's rally, polled the crowd on who they'd like to see as his opponent, with cheers for Biden and loud boos when Trump asked about Vice President Kamala Harris.Trump and his team have tried to cast Democrats' efforts to replace Mr. Biden as a \"coup,\" in what appears to be part of a larger effort to try to distract from Trump's efforts to overturn the 2020 election after he refused to accept the results and the Jan. 6 attack on the Capitol by his supporters.\"At this very moment, Democrat Party bosses are frantically trying to overthrow the results of their own party's primaries to dump Crooked Joe Biden from the ballot,\" he said. \"As you're seeing, the Democratic Party is not the party of democracy. They're really the enemies of Democracy.\"Later, Trump pushed back against efforts to cast him as an extremist, even as he has vowed mass deportations and threatened retribution against his political enemies.\"They keep saying, 'He's a threat to democracy...' Last week I took a bullet for democracy,\" he said to rousing cheers.Trump also again tried to distance himself from the Heritage Foundation's Project 2025, a policy and personnel plan for a second Trump term that was crafted by a host of former Trump administration officials.Trump blasted the project, which has become a centerpiece of Biden's campaign against Trump, as \"severe right\" and \"seriously extreme,\" just like the \"radical left.\"\"I don't know anything about it,\" he insisted.The 81-year-old Democratic incumbent, who appeared in Detroit this month, is currently isolating at his beach home in Delaware recovering from COVID-19.Grand Rapids, the largest city in Kent County, was historically a Republican stronghold, but has trended increasingly blue. It was one of three Michigan counties that Trump won in 2016 but Biden flipped in 2020. It's also an area where former United Nations Ambassador Nikki Haley secured a substantial number of votes as she ran against Trump in the GOP primary, a group of voters that both presidential campaigns are now hoping to pick up. Haley urged her supporters to back Trump in a convention floor speech.Rep. Hillary Scholten, a Democrat representing Grand Rapids, is among the growing number of lawmakers calling on Mr. Biden to exit the race after last month's disastrous debate performance.","summary":"It was the pair's first event together since they became the GOP's nominees at the Republican National Convention in Milwaukee.","url":"https://www.cbsnews.com/news/trump-jd-vance-first-joint-rally-grand-rapids-michigan/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/20/2f8e3c1d-104d-47ad-acd0-12f0c53383fd/thumbnail/1200x630/e6412de980eb511d8cb047bf5b8716a9/gettyimages-2162827631.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3066138_hls/master.m3u8","publish_date":"2024-07-20 23:48:25","author":null,"language":"en","source_country":"US","sentiment":-0.054},{"id":252247700,"title":"“Official: Gunman at Trump rally used drone to scout site before attack”","text":"WASHINGTON — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday’s shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump’s appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Associated Press writer Jill Colvin contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON &#8212; The gunman in the attempted assassination of former President Donald&#8230;\n\n\nThis Post: &#8220;Official: Gunman at Trump rally used drone to scout site before attack&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/official-gunman-at-trump-rally-used-drone-to-scout-site-before-attack/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-07-20 23:46:48","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.491},{"id":252247922,"title":"Biden stews at allies’ pressure him to drop out of race","text":"WASHINGTON >> Sick with COVID and abandoned by allies, President Joe Biden has been fuming at his Delaware beach house, increasingly resentful about what he sees as an orchestrated campaign to drive him out of the race and bitter toward some of those he once considered close, including his onetime running mate Barack Obama. Biden has been around politics long enough to assume that the leaks appearing in the media in recent days are being coordinated to raise the pressure on him to step aside, according to people close to him. He considers Rep. Nancy Pelosi, the former House speaker, the main instigator but is irritated at Obama as well, seeing him as a puppet master behind the scenes. The friction between the sitting president and leaders of his own party so close to an election is unlike anything seen in Washington in generations — especially because the Democrats now working to ease him out were some of the allies most critical to his success over the last dozen years. It was Obama who elevated Biden from a presidential also-ran to the vice presidency, setting him up to win the White House in 2020, and it was Pelosi and Sen. Chuck Schumer, the Senate Democratic leader, who pushed through Biden’s landmark legislative achievements. But several people close to Biden, who insisted on anonymity to discuss internal matters, described an under-the-weather president coughing and hacking more than 100 miles from the corridors of power as his presidency meets its most perilous moment. He has watched with rising exasperation as a succession of news stories appeared, one after the other, reporting that Schumer, Pelosi, Obama and Rep. Hakeem Jeffries of New York, the House Democratic leader, all had warned of a devastating defeat for the party in November. And he certainly noticed that Obama has not done anything to help him in recent days even as his own former aides publicly have led the way in calling on Biden to withdraw in what was interpreted, rightly or wrongly, as a message from the former president’s camp. The unseen but clearly felt presence of Obama, in particular, has brought a Shakespearean quality to the drama now playing out, given their eight-year partnership. While Biden and his team publicly insist that he is staying in the race, privately, people close to him have said that he is increasingly accepting that he may not be able to, and some have begun discussing dates and venues for a possible announcement that he is stepping aside. One factor that may stretch out a decision: Advisers believe that Biden would not want to do it before Prime Minister Benjamin Netanyahu of Israel visits Washington on Wednesday at the initiative of Republicans to address Congress, unwilling to give the premier the satisfaction, given their strained relations lately over the war in the Gaza Strip. Yet Biden bristles at pressure, and those pushing him risk his getting back up and prompting him to remain after all. A person familiar with his thinking said he had not changed his mind as of Saturday afternoon. In privately railing about Obama and even aides to former President Bill Clinton, Biden has made clear that he finds it particularly rich that the architects of historic Democratic losses in the 1994 and 2010 midterm elections would be lecturing him about how to save the party after he presided over a better-than-expected midterm in 2022. While one person said Biden is not irked at Clinton himself — in fact, he is grateful the former president has been pressing donors to keep giving — others said that Obama is another story. “We have to cauterize this wound right now, and the sooner we can do it, the better,” said Rep. Gerald E. Connolly, D-Va., who has not publicly called for the president to step aside. He said the barrage of criticism must be difficult for Biden. “I mean, to me, this is very painful. I think it just shows the cold calculus of politics.” More congressional Democrats publicly called on the president Friday to pass the torch to another candidate to take on former President Donald Trump in the fall. Among them were Sen. Martin Heinrich of New Mexico, Sen. Sherrod Brown of Ohio and at least nine House Democrats, including Rep. Zoe Lofgren, a close ally of Pelosi, her fellow Californian. The fact that Pelosi’s allies have been coming out is seen as no coincidence at the president’s vacation house in Rehoboth Beach, Delaware. When another of her allies, Rep. Adam B. Schiff of California, spoke out earlier this week, a Biden administration official noted that it might be Schiff’s lips moving, but it was Pelosi doing the speaking. It has not just been her allies. Rep. Seth Moulton, D-Mass. and a Pelosi rival, said Friday that Biden, “a mentor and friend” who had helped him get elected to the House in 2014, “didn’t seem to recognize me” when they met at the D-Day anniversary commemoration in France last month. “Of course, that can happen as anyone ages, but as I watched the disastrous debate a few weeks ago, I have to admit that what I saw in Normandy was part of a deeper problem,” Moulton wrote in The Boston Globe, repeating his call for Biden to drop out. Biden pushed back Friday with a statement vowing to continue the race. “I look forward to getting back on the campaign trail next week to continue exposing the threat of Donald Trump’s Project 2025 agenda while making the case for my own record and the vision that I have for America: one where we save our democracy, protect our rights and freedoms, and create opportunity for everyone,” he said. The White House and the Biden campaign have denied that he is about to drop out. “Absolutely, the president is in this race,” Jennifer O’Malley Dillon, the campaign chair, said on MSNBC’s “Morning Joe” Friday, one of the president’s favorite shows and a regular venue for Democrats speaking to other Democrats. “You’ve heard him say that time and time again.” She acknowledged, though, that the campaign has seen erosion. “I’m not here to say that this hasn’t been a tough several weeks for the campaign,” she said. “There’s no doubt that it has been. And we’ve definitely seen some slippage in support, but it has been a small movement.” She argued that polls show the race was “hardened already” before the debate and not that many voters have shifted since. “The American people know that the president is older,” she said. “They see that. They knew that before the debate. Yes, of course, we have a lot of work to do to make sure that we are reassuring the American people that, yes, he’s old, but he can do the job, and he can win.” All of the political machinations were occurring as the president was fighting off symptoms from COVID in isolation in Rehoboth. He was still coughing and hoarse Friday, but he was improving, according to his doctor. Jill Biden was with him, although staying in a separate room. Among those with him in Rehoboth this weekend will be his aides Steve Ricchetti and Annie Tomasini. Anthony Bernal, the first lady’s chief of staff, accompanied her. It was unclear if Biden would still return to Washington on Sunday as planned, but he was tentatively scheduled to travel Wednesday to Austin, Texas, for a postponed celebration of the 60th anniversary of the Civil Rights Act at the Lyndon B. Johnson Presidential Library. Biden’s pique at his former partner, Obama, represents the latest chapter in a complicated relationship. While not close when they teamed up to run in 2008, they became friends over their two terms in the White House together, bonding especially when Biden’s son Beau died in 2015. But Biden has nursed a grudge ever since Obama gently discouraged him from running for president in 2016, steering the Democratic nomination to Hillary Clinton, who lost to Trump. So Obama’s advice may not be particularly welcome in Rehoboth at this point, which is perhaps one reason the former president is not offering it directly, according to people close to him. Obama last saw Biden at a lavish, record-setting Hollywood fundraiser before the debate in June, when the two appeared onstage together. At the end, Obama appeared to be leading Biden offstage. One former Obama aide who was present that night said that it was clear that the former president was startled and shaken by how much Biden had aged and seemed disoriented. That fundraiser was the last big haul for the campaign, which had hoped to raise about $50 million this month from large donors for the Biden Victory Fund, just as it did in June. But after the debate, it may collect less than $25 million in July, an excruciatingly modest sum for a summer month in a presidential race, according to four people briefed on the campaign’s finances. The campaign is not required to disclose its July fundraising numbers until mid-August, and a spokesperson dismissed the reports as “speculation.” As they try to influence Biden, many associates are holding back from harsh public statements because they feel empathy for him and worry such statements might backfire. Going public, some said, might cause the president to dig in even more. And some were reluctant to have their names attached to statements because they worry about his reaction to a pile-on from his friends. While the roughly 40 members of Congress who have publicly called on the president to leave the race represent a minority, privately, dozens more are said to agree. Two House Democrats estimated that on a secret ballot, 70% to 80% of their caucus would prefer Biden to withdraw. “They’re not going to be able to contain this. I think the dam has broken,” Connolly said. Even before Friday’s announcements, he said, “my sense was that a majority of my colleagues were so uneasy, they would welcome a decision to change horses.” But Sen. Chris Coons, D-Del., one of the president’s closest allies, made an impassioned defense of Biden’s ability to serve a second term. Speaking from the stage of the Aspen Security Conference in Colorado, Coons cited the president’s work hosting a NATO summit as well as his recent news conference and campaign events. “There are folks still saying he is not strong enough or capable enough to be our next president,” Coons said. “I disagree.” ——— This article originally appeared in The New York Times.","summary":"WASHINGTON >> Sick with COVID and abandoned by allies, President Joe Biden has been fuming at his Delaware beach house, increasingly resentful about what he sees as an orchestrated campaign to drive him out of the race and bitter toward some of those he once considered close, including his onetime running mate Barack Obama.","url":"https://www.staradvertiser.com/2024/07/20/breaking-news/biden-stews-at-allies-pressure-him-to-drop-out-of-race/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240720_WEB_CALIF-BIDEN-FUNDRAISER-6.jpg","video":null,"publish_date":"2024-07-20 23:45:00","author":"New York Times","authors":["New York Times"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.103},{"id":252247554,"title":"Trump holds first rally after attempt on life, Vance by his side","text":"“I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said before Trump’s arrival. Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, lashing out at his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience. At one point, Trump glanced at a screen showing him from an unusual angle and joked about his comb over. “That’s a severe sucker. What’s with that one?” he said. “I apologise. Man! I looked up there, I said, ‘Whoa!’ That’s like a work of art!”","summary":"Donald Trump addressed a Michigan rally exactly a week after he was shot. Not much has changed.","url":"https://www.smh.com.au/world/north-america/trump-holds-first-rally-after-attempt-on-life-vance-by-his-side-20240721-p5jv98.html","image":"https://static.ffx.io/images/$zoom_0.29085397897897897%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_131%2C$y_192/t_crop_custom/q_86%2Cf_auto/5d773043e40eec05275d0846a6ef4092f8601d8f","video":null,"publish_date":"2024-07-20 23:42:10","author":"Jill Colvin,Joey Cappelletti","authors":["Jill Colvin","Joey Cappelletti"],"language":"en","source_country":"au","sentiment":-0.134},{"id":252247892,"title":"Trump holds first rally after attempt on life, Vance by his side","text":"“I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said before Trump’s arrival. Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. After appearing uncharacteristically subdued and emotional during the Republican convention, Trump returned to his usual rally mode, lashing out at his Democratic rivals, repeating his lies about the 2020 election, and peppering his address with jokes that sparked laughter from an enthusiastic audience. At one point, Trump glanced at a screen showing him from an unusual angle and joked about his comb over. “That’s a severe sucker. What’s with that one?” he said. “I apologise. Man! I looked up there, I said, ‘Whoa!’ That’s like a work of art!”","summary":"Donald Trump addressed a Michigan rally exactly a week after he was shot. Not much has changed.","url":"https://www.theage.com.au/world/north-america/trump-holds-first-rally-after-attempt-on-life-vance-by-his-side-20240721-p5jv98.html","image":"https://static.ffx.io/images/$zoom_0.29085397897897897%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_131%2C$y_192/t_crop_custom/q_86%2Cf_auto/5d773043e40eec05275d0846a6ef4092f8601d8f","video":null,"publish_date":"2024-07-20 23:42:10","author":"Jill Colvin,Joey Cappelletti","authors":["Jill Colvin","Joey Cappelletti"],"language":"en","source_country":"au","sentiment":-0.134},{"id":252247660,"title":"Trump says he 'took a bullet for democracy' in first campaign rally since assassination attempt","text":"In his first campaign rally since a shooter made an attempt on his life, Donald Trump has declared he \"took a bullet for democracy\". The Republican presidential candidate held an event in Grand Rapids, Michigan, just seven days after surviving an assassination attempt at another rally in Pennsylvania. He was joined by his newly minted running mate JD Vance, who along with Mr Trump was officially nominated by the party at this week's Republican National Convention (RNC). Supporters began lining up outside the Van Andel arena from 6am local time, forming lines that snaked around 10 city blocks. In an almost two-hour speech, Mr Trump revisited the attempt on his life, criticised President Joe Biden, and attempted to distance himself from \"extremists\" on the far-right. Taking a less sombre tone than in his acceptance speech at the RNC, Mr Trump spoke about the assassination attempt, again crediting a sign for saving his life. \"It was exactly one week ago, even to the hour, even to the minute,\" he began his speech. Mr Trump told his supporters on Thursday night (local time) that he would only recount what had happened once, as it was \"too painful\" to revisit. He explained that in the seconds before a bullet grazed his ear, he had turned his head to the right to look at a chart titled \"illegal immigration into the US\". In front of the Grand Rapids crowd, he brought up that chart again, declaring: \"I owe immigration my life.\" Mr Trump went on to describe the conservative think tank Project 2025, which is aiming to shape the policy of a second Trump presidency, as a group on the \"severe right\" with \"radical\" ideas. \"I don't know what the hell it is. I don't know anything about it. I don't want to know anything about it,\" he said. Mr Trump also invited Michigan's Republican candidates for the Senate, Sandy Pensler and Mike Rogers, to the stage. Mr Pensler told the crowd he was ending his campaign bid to make way for Mr Rogers. Mr Rogers thanked his opponent and Mr Trump for their endorsement, telling the presidential candidate: \"It wasn't that the bullet took you to the ground, it was the fact that you got back up for America.\" In a speech that returned to the typical tone of a Trump election rally, the former president took aim at the Biden administration and made jokes about the Democratic campaign. At one point, he conducted a straw poll with his fans, asking them to cheer to indicate who they'd rather see him run against at the election in November. At the mention of Vice-President Kamala Harris, the crowd booed, and then erupted into cheers when he asked if they'd like to see him run against Mr Biden. It comes as pressure mounts on Mr Biden to drop out of the race and allow someone else to replace him at the top of the party's ticket. More than 30 congressional Democrats have spoken out publicly calling on Mr Biden to consider stepping aside.","summary":"Republican presidential candidate Donald Trump holds his first campaign event since the attempt on his life, telling a crowd of supporters he \"took a bullet for democracy\".","url":"https://www.abc.net.au/news/2024-07-21/trump-campaign-rally-grand-rapids/104123232","image":"https://live-production.wcms.abc-cdn.net.au/0328ef4aed94f94a18138d66b69a9512?impolicy=wcms_crop_resize&cropH=1618&cropW=2877&xPos=0&yPos=156&width=862&height=485","video":null,"publish_date":"2024-07-20 23:39:49","author":"Lucy Sweeney","authors":["Lucy Sweeney"],"language":"en","catgory":"politics","source_country":"AU","sentiment":-0.485},{"id":252248098,"title":"Gunman in Trump rally attack flew drone over rally site in advance of event, official says","text":"WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday’s shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump’s appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead...","url":"https://wsvn.com/news/politics/gunman-in-trump-rally-attack-flew-drone-over-rally-site-in-advance-of-event-official-says/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/07/240714_Thomas_Crooks_Pennsylvania_rally_gunman.jpg?quality=60&strip=color","video":null,"publish_date":"2024-07-20 23:32:38","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.51},{"id":252247514,"title":"Trump says he 'took a bullet for democracy' at massive battleground state rally alongside running mate Vance","text":"GRAND RAPIDS, Mich. — Former President Donald Trump declared Saturday that he \"took a bullet for democracy\" while firing up a crowd of voters in Grand Rapids, Michigan, at his first rally since surviving an assassination attempt last week. More than 12,000 people piled into the Van Andel Arena, home to the Grand Rapids Griffins hockey team, to see him and his running mate, Ohio Sen. JD Vance, who are coming off a packed week at the Republican National Convention (RNC) in Milwaukee, where each accepted their respective nominations to appear on the GOP ticket together. \"They keep saying he's a threat to democracy. I'm saying, ‘’What the hell did I do to democracy?' Last week I took a bullet for democracy,\" Trump said as the crowd cheered, referencing an often used Democrat talking point. \"What did I do against democracy? Crazy.\" WATCH: THOUSANDS DESCEND ON MICHIGAN TOWN FOR FIRST TRUMP RALLY SINCE FAILED ASSASSINATION ATTEMPT Vance spoke ahead of Trump, and dedicated part of his time on stage to slamming Vice President Kamala Harris, asking rallygoers \"what the hell\" she has ever done and noting his own service as a U.S. Marine. \"I've served in the United States Marine Corps … What the hell have you done?\" Vance said. \"What has she done other than collect a check from her political offices?\" he asked, before going on to talk about his grandmother, who he calls \"Mamaw,\" and his upbringing. Harris ripped Vance after his Wednesday speech at the RNC in which he accepted his role on the 2024 ticket. \"It was compelling. It’s a compelling story. But it’s not the full story,\" Harris said after Vance's RNC speech. \"Frankly, what is very telling is what he did not talk about on that stage. He did not talk about Project 2025, the 900-page blueprint for a second term. He did not talk about it because their plans are extreme, and they are divisive.\" RNC DELEGATES, GUESTS MAKE PREDICTIONS ABOUT BIDEN'S POLITICAL FUTURE AMID REPORTS HE MIGHT EXIT 2024 RACE Vance later spoke to rallygoers about the various challenges facing the nation under President Biden's administration, including the fentanyl crisis, the border crisis and the economy. Trump took the stage after Vance, beginning his speech by saying that he \"shouldn't be here right now, but something very, something very special happened.\" He took a moment to recognize the supporters who were injured or killed at the rally last week. \"We continue to pray for the recovery of the two citizens who were wounded in that evil attack – David Dutch and James Copenhaver, two really incredible people,\" the Republican frontrunner said. \"We remain in contact and send our deepest respect to the families.\" ALINA HABBA TAKES ON MAJOR ROLE IN TRUMP CAMPAIGN, DISHES ON HIS HIGHLY ANTICIPATED RNC SPEECH Trump also acknowledged the death of Corey Comparatore, calling him a \"hero\" for protecting his family from the bullets. \"Corey Comparatore was a brave firefighter who died, [his] funeral [was] yesterday,\" Trump said. \"Corey was a hero. And we will carry his memory in our hearts for all time.\" Later in his speech, Trump conducted a \"poll\" with the audience members about who should become the Democratic nominee if President Biden steps down from the race. \"We're going to do a poll, and it's going to be a very nice poll and great. Who is your favorite candidate? Who would you like?\" Trump said. GOV. WHITMER TELLS ‘THE VIEW’ SHE NEVER SAID MICHIGAN’S UNWINNABLE FOR BIDEN: ‘CRAZIEST THING TO THINK’ \"So who would you like to most run against, if you're us, if we want to win? Ready? Kamala Harris? Crooked Joe Biden?\" Trump asked. The audience booed louder in response to Biden. The former president also slammed Michigan Gov. Gretchen Whitmer, calling her a \"terrible\" leader. \"Well, you have a terrible governor here who did a terrible job. Whitmer – I'd like to run against her, actually,\" Trump laughed. CLICK HERE TO GET THE FOX NEWS APP Michigan is expected to be one of the most closely watched battleground states in November, and could narrowly determine who will serve the American people in the White House for the next four years. Polls have largely suggested Trump leads Biden in every battleground state, as well as in some states that have trended more Democratic in recent years. That comes as a growing number of Democrats call for Biden to step aside from the 2024 race, in favor of Harris or another candidate. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Thousands have gathered in Michigan for a joint rally with former President Trump and his running mate, JD Vance, the first since a failed assassination attempt last week against Trump.","url":"https://www.foxnews.com/politics/trump-says-took-bullet-democracy-massive-battleground-state-rally-alongside-running-mate-vance","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/AP24202794649570.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-20 23:31:14","author":"Andrea Vacchiano,Brandon Gillespie","authors":["Andrea Vacchiano","Brandon Gillespie"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.02},{"id":252248100,"title":"Trump campaign releases letter on his injury, treatment after last week’s assassination attempt","text":"NEW YORK (AP) — Donald Trump’s campaign released an update on the former president’s health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania. The memo, from Texas Rep. Ronny Jackson, who served as Trump’s White House physician, offers new details on the nature of the GOP nominee’s injuries and the treatment he received in the immediate aftermath of the attack. According to Jackson, Trump sustained a gunshot wound to the right ear from a high-powered riffle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” The bullet track, he said, “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear. There was initially significant bleeding, followed by marked swelling of the entire upper ear.” While the swelling has since resolved and the wound “is beginning to granulate and heal properly,” he said Trump is still experiencing intermittent bleeding, requiring the dressing that was on display at last week’s Republican National Convention. At Saturday’s rally, the white gauze on Trump’s ear was replaced by a skin-colored bandage. “Given the broad and blunt nature of the wound itself, no sutures were required,” Jackson wrote. Trump was initially treated by medical staff at Butler Memorial Hospital. According to Jackson, doctors “provided a thorough evaluation for additional injuries that included a CT of his head.” Trump, he said, “will have further evaluations, including a comprehensive hearing exam, as needed. He will follow up with his primary care physician, as directed by the doctors that initially evaluated him,” he wrote. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,” he added. The letter is the first official update about the former president’s condition since the night of the shooting. Jackson, a staunch Trump supporter, said in the letter that, as Trump’s former doctor, he was deeply concerned about the former president’s wellbeing in the aftermath of the attack and met him in Bedminster, New Jersey, late Saturday after Trump returned from Pennsylvania “to personally check on him, and offer my assistance in any way possible.” He said he has been with Trump since that time, evaluating and treating his wound daily. That includes traveling with him Saturday to Michigan, where the former president will hold his first rally since the shooting, joined by his newly named running mate, Ohio Sen. JD Vance. Jackson appears to be licensed to practice medicine in Florida, according to a state health department database. Records from the American Board of Emergency Medicine also show that Jackson has a certification in Emergency Medicine, valid through the end of 2025. A spokesperson for the congressman did not immediately provide a response and Trump campaign’s did not immediately respond to questions. Last year, Trump’s campaign released a letter on President Joe Biden’s 81st birthday from Dr. Bruce A. Aronwald, a New Jersey physician, who said he had been the former president’s doctor since 2021. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"NEW YORK (AP) — Donald Trump&#8217;s campaign released an update on the former president&#8217;s health Saturday, one week after he survived an attempted assassination at a rally...","url":"https://wsvn.com/news/politics/trump-campaign-releases-letter-on-his-injury-treatment-after-last-weeks-assassination-attempt/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/07/240715_Trump_bandaged_ear_RNC.jpg?quality=60&strip=color","video":null,"publish_date":"2024-07-20 23:18:39","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":-0.12},{"id":252247454,"title":"Alyssa Farah Griffin Once Took a Jab at Ex-Boss Donald Trump Over His 'Thirstiest' Post Ever","text":"Former Trump White House communications director Alyssa Farah Griffin once took a jab at her ex-boss over what she called his 'thirstiest' social media post ever. The incident unfolded on Super Bowl Sunday when Donald Trump posted a message on his Truth Social platform about Taylor Swift and Travis Kelce. Griffin, now a co-host on ABC's The View, didn't hold back in her critique. She offered a blunt summary of Trump's message on the broadcast. She started by saying, \"Can I mention my one Super Bowl highlight that we didn't get to? And I hate to interject politics... Donald Trump sent out the thirstiest tweet—er, 'Truth'—of all time, basically saying, 'Taylor Swift should like me and I think Travis Kelce should, too.' It was the funniest thing.\" She added, \"I was losing my mind over it. [Trump] knows how powerful they both are as an entity, and it was just the saddest thing I've seen,\" as per Newsweek. Trump wrote, \"I signed and was responsible for the Music Modernization Act for Taylor Swift and all other Musical Artists. Joe Biden didn't do anything for Taylor and never will. There's no way she could endorse Crooked Joe Biden, the worst and most corrupt President in the History of our Country, and be disloyal to the man who made her so much money.\" He continued, \"Besides that, I like her boyfriend, Travis, even though he may be a Liberal, and probably can't stand me!\" The timing of Trump's post coincided with baseless right-wing claims that Swift's relationship with Kansas City Chiefs tight end Kelce was part of a Democratic plot to boost President Joe Biden's re-election chances in November, as per HuffPost. These conspiracy theories gained traction as Swift cheered on Kelce during the Super Bowl, which ended with the Chiefs' victory over the San Francisco 49ers. Griffin's mockery of Trump's post resonated with many viewers. Some commenters on The View's YouTube channel applauded her humor and willingness to call out what they saw as Trump's tendency to exaggerate. One viewer remarked, \"I really don't care anything about football, but Kansas City winning makes the MAGAts heads explode! That's golden for Mel.\" Journalist Kara Swisher also weighed in on Trump's post, tweeting, \"Taking undeserved credit for her enormous success is classic (and heinous), but this reads as if he’s stone cold terrified of her and her power and realizes — after a lifetime of terrorizing women — that this is the one who can actually end him. Even her boyfriend frightens him.\" Though her fans have slammed these baseless theories, it is worth noting that Swift's showing up at NFL games has made a big difference. Apex Marketing Group claimed her presence has added $331.5 million to the Kansas City Chiefs brand. People are calling this \"The Taylor Effect,\" but her impact goes beyond football. A survey by Lending Tree found that around 13% of Americans are more into football because she is involved.","summary":"The incident unfolded on Super Bowl Sunday when Donald Trump posted a message on his Truth Social platform about a famous singer.","url":"https://www.inquisitr.com/alyssa-farah-griffin-once-took-a-jab-at-ex-boss-donald-trump-over-his-thirstiest-post-ever","image":"https://dab57h0r8ahff.cloudfront.net/706104/uploads/8682a000-466a-11ef-aa3b-4783b017997d_1200_630.jpeg","video":null,"publish_date":"2024-07-20 23:16:00","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.149},{"id":252247450,"title":"Trump calls Biden a ‘sick, weak, pathetic man’ in first rally since shooting","text":"Donald Trump warned of “slaughter in the suburbs” and called Joe Biden a “sick, weak, pathetic man” in his first rally since surviving an assassination attempt last weekend. The Republican presidential nominee had promised “unity” for the United States in the wake of his shooting in Pennsylvania last Saturday, which shocked the country and heralded a surge in support for Trump in opinion polls. But at a rally in Grand Rapids in Michigan on Saturday night, Trump returned to his usual rhetoric as he railed against the “radical Left Democrats”, accused his opponents of “rigging” the election and calling Mr Biden “crooked”. He also goaded Nancy Pelosi over reports that she has advised Mr Biden to quit the election race, accusing her of turning on the president “like a dog”. He took to the stage without the large white bandage that covered his ear at the Republican convention earlier this week, instead wearing a small plaster. Michigan is one of the vital swing states in the US election and has become even more important since the attempt on Trump’s life, with recent polls showing a chunky swing towards the former president, much to the alarm of Democrats. Republican momentum is in stark contrast to the mire around President Joe Biden, who remains hunkered at home with Covid, resisting unprecedented Democratic pressure to step aside. join the conversation in the comments","summary":"<![CDATA[Donald Trump warned of “slaughter in the suburbs” and called Joe Biden a “sick, weak, pathetic man” in his first rally since surviving an assassination attempt last weekend.\n\n]]>","url":"https://www.telegraph.co.uk/us/politics/2024/07/20/barack-obama-joe-biden-pelosi-latest-news-us-election/","image":"https://www.telegraph.co.uk/content/dam/en-us/politics/2024/07/20/TELEMMGLPICT000386288081_17215111818100-xlarge_trans_NvBQzQNjv4Bqqi-ULC5HvxH1EG-rVeSh2hWW7mUa35xjAb4OXlMYu_g.jpeg?imwidth=1200","video":null,"publish_date":"2024-07-20 23:15:48","author":"Josh White,Michael Murphy,Susie Coen","authors":["Josh White","Michael Murphy","Susie Coen"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.542},{"id":252247158,"title":"Trump mocks Democrats in first campaign rally since assassination attempt","text":"GRAND RAPIDS >> Donald Trump held his first campaign rally today since he narrowly escaped an assassination attempt one week ago, poking fun at Democrats in turmoil at a heavily secured indoor arena in the election battleground state of Michigan. Fresh from his nominating convention where his takeover of the Republican Party was cemented, Trump appeared in Grand Rapids with his new vice presidential pick, Sen. JD Vance from Ohio. They took the stage in their first campaign event together with the Republican Party unified behind them. In contrast, it is no longer certain that President Joe Biden will be the Democratic Party’s nominee facing Trump in the Nov. 5 election. Biden has faced calls from some senior Democrats to end his re-election bid after his poor debate performance last month raised concerns over whether he could beat Trump or complete another four-year term. Trump mocked Democrats, saying they wanted to kick Biden off the ticket after he won their presidential nominating contest. “They have a couple of problems. No. 1, they have no idea who their candidate is,” Trump said to laughter and jeers. “This guy goes and he gets the votes and now they want to take it away.” “As you’re seeing, the Democrat Party is not the party of democracy. They’re really the enemies of democracy.” He added: “And they keep saying, ‘He’s a threat to democracy.’ I’m saying, ‘What the hell did I do for democracy?’ “Last week, I took a bullet for democracy.” Opinion polls show a tight race between the two men at a national level but Biden trailing Trump in the battleground states that will likely determine the winner. Many Democrats fear he may not have a realistic path to victory and that the party needs a new candidate to take on Trump. There was a heavy police presence at Trump’s rally in Grand Rapids today, with police on every street corner for several blocks. U.S. Secret Service officers were positioned on the top balconies in the Van Andel Arena, giving them a bird’s eye view of the crowd inside. Bag searches for those entering the indoor arena earlier in the day were long and thorough, and the Secret Service sweep of the building took about an hour longer than usual. The rally in Butler, Pennsylvania, last weekend was outdoors. At that event, the gunman was able to scale the roof of a building outside the Secret Service perimeter before opening fire on Trump, clipping his ear, killing a rally-goer and wounding several others. The Secret Service, which is responsible for protecting Trump, declined to comment on security for the Grand Rapids event. An investigation is under way into the security failures at the Butler rally. Trump gave a detailed account of his narrow brush with death in his convention speech on Thursday, telling the audience that he was only talking to them “by the grace of Almighty God.” Trump’s former physician, Ronny Jackson, said today that the former president is recovering as expected from the gunshot wound to his right ear, but noted intermittent bleeding and said Trump may require a hearing exam. The bullet fired by the would-be assassin at the July 13 rally in Pennsylvania came “less than a quarter of an inch from entering his head,” said Jackson, a Republican congressman from Texas who had served as physician to Presidents Trump and Barack Obama.","summary":"GRAND RAPIDS >> Donald Trump held his first campaign rally today since he narrowly escaped an assassination attempt one week ago, poking fun at Democrats in turmoil at a heavily secured indoor arena in the election battleground state of Michigan.","url":"https://www.staradvertiser.com/2024/07/20/breaking-news/trump-mocks-democrats-in-first-campaign-rally-since-assassination-attempt/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240720_WEB_Vance-Trump.jpg","video":null,"publish_date":"2024-07-20 23:15:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.325},{"id":252247120,"title":"'I took a bullet for democracy,' Trump tells first rally since shooting","text":"Security was reportedly tight inside the Van Andel Arena in Grand Rapids, Michigan, amid questions over Secret Service lapses at the Pennsylvania rally - though there were few visible signs of any greater law enforcement presence. Meanwhile, Biden loyalists continued to defend the embattled president as the drumbeat of calls for him to abandon his campaign grows louder. The 81-year-old and his team have remained publicly adamant that he is staying in the race, though some reports suggest discussions have begun in his inner circle about how exactly he might step aside. BIDEN'S \"BIG DECISION\" There has been massive speculation over who could replace him. As vice president, Harris appears best positioned to do so. Senator Elizabeth Warren, a leading progressive who sought the party's presidential nod in 2020, gave Harris a boost Saturday without turning her back on the president. \"Joe Biden is our nominee,\" she said on MSNBC. \"He has a really big decision to make. \"But what gives me a lot of hope right now is that if President Biden decides to step back, we have Vice President Kamala Harris, who is ready to step up, to unite the party, to take on Donald Trump, and to win in November.\" Some Democrats, however, fear that such a late switch could trigger chaos, dooming the party at the polls. Team Trump, for its part, is effervescent after an exceptional streak of luck - from the failed assassination bid to favorable court rulings and Biden's disastrous debate performance last month.","summary":"The Republican presidential nominee appeared wearing a new, smaller, flesh-coloured bandage over his right ear, bloodied in the attack by a 20-year-old gunman at a rally in Pennsylvania that killed one bystander.","url":"https://www.channelnewsasia.com/world/trump-shooting-took-bullet-democracy-campaign-rally-biden-november-election-4493861","image":"https://onecms-res.cloudinary.com/image/upload/s--UddLHXWP--/c_crop,h_1237,w_2200,x_0,y_17/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2024/07/21/2024-07-20t2254","video":null,"publish_date":"2024-07-20 23:08:40","author":null,"language":"en","catgory":"politics","source_country":"sg","sentiment":0.114},{"id":252247374,"title":"Trump makes wild claims on immigration and boasts about Musk donations in first rally since shooting","text":"Donald Trump traveled to Michigan on Saturday for his first campaign appearance since being shot last week, and his first alongside his newly announced running mate JD Vance, the US senator for Ohio. His ear may have been bandaged, but otherwise, Trump seemed little different than his old self, continuing to mock Democrats, lie about the 2020 election, demonize migrants in racist terms, praise right-wing dictators, and tell bizarre stories of dubious truthfulness. Trump didn’t waste time in quickly addressing the recent assassination attempt. “I stand before you only by the grace of almighty God,” he told the crowd in Grand Rapids. “I shouldn’t be here. I shouldn’t be here.” “We will fight, fight, fight, and we will win, win win,” Trump added, a reference to when he held up his fist and chanted “fight” after being shot at in Pennsylvania last week. Elsewhere, Trump described the shooting as the moment he “took a bullet for democracy.” The former president then moved onto mocking the Democratic circus around whether Joe Biden will remain their 2024 presidential candidate. “They have no idea who their candidate is, and neither do we,” Trump said. Elsewhere, he called Nancy Pelosi “crazy,” and accused her of turning on Joe Biden “like a dog,” after reports she privately told the president he should step aside and can’t beat Trump in November. Trump seemed to be exceptionally confident in his campaign, even for someone who habitually boasts about himself. At one point, he told a bizarre story about offering to take the leader of North Korea to a baseball game as a way to stop him from pursuing further nuclear weapons. “Just relax, chill, you’ve got so much nuclear weapons,” Trump told the crowd. “Let’s go to a baseball game. I’ll show you what a baseball game is. We’ll go watch the Yankees.” It wasn’t the only mention of a strong man: Trump also celebrated praise he has claimed he got from Hungarian far-right leader Viktor Orbán. In fact, Trump was riding so high, he didn’t even seem worried about alienating one of his biggest, most influential recent backers: Elon Musk. Trump praised the tech billionaire for the millions he’s given to the wider Trump re-election effort, then spent a significant chunk of his speech bashing electric cars, trucks, boats, military vehicles — anything that might one day become the kind of EV that the Tesla co-founder made his name building. In between the jokes about Democrats and familiar, still-false claims that they “rigged” the 2020 election, Trump reserved special ire for migrants, describing them in ways that echoed the far-right “Great Replacement” theory. “They wanna get people to vote,” Trump said of those who advocate for immigration to the US. “This is an invasion of our country,” Trump added of migrants entering the US, people who he claimed were leading the “plunder, rape, and slaughter of our American suburbs and cities.” In fact there’s no documented relationship between increased migration and crime, and studies suggest immigrants are less likely than those born in the US to break the law. It wasn’t the only exaggerated claim of the night. The former president also attempted to distance himself from Project 2025, a policy blueprint for his potential second term from a far-right think tank, despite his well-documented ties to its authors. “I don’t know what the hell it is... They’re seriously extreme, but I don’t know anything about it. I don’t want to know anything about it,” Trump said. “But what they do is misinformation, and they keep saying he’s a threat to democracy. The hell did I do with democracy? Last week I took a bullet for democracy.” Prior to Trump taking the stage, his new VP pick JD Vance warmed up the crowd, and bashed his Democratic counterpart Kamala Harris. “What the hell have you done other than collect a check?” Vance asked during his speech, prompting the audience to burst into applause.","summary":"Former president embraced familiar lies and attacks on migrants in first speech alongside new VP pick JD Vance","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-michigan-rally-elon-musk-b2583144.html","image":"https://static.independent.co.uk/2024/07/20/23/97348c81543045648dffa464d9b1e24d.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/AjYgd8ke-4VHSaSK0.mp4","publish_date":"2024-07-20 23:02:33","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.158},{"id":252247804,"title":"\"They Have No Idea Who Their Candidate Is\": Trump Mocks Democrats At Rally","text":"Donald Trump held his first campaign rally on Saturday since he narrowly escaped an assassination attempt one week ago, mocking Democrats and at one point comparing former Democratic House Speaker Nancy Pelosi to a \"dog.\" Trump, who called for national unity in a speech on Thursday as he accepted his party's presidential nomination at the Republican National Convention, made no mention of that in his remarks before a raucous crowd of supporters in Grand Rapids. He frequently mocked Democratic President Joe Biden as feeble. He derided senior Democrats, including Pelosi, for trying to persuade Biden to end his re-election bid. Referring to Pelosi, Trump said: \"She's turned on him like a dog. She's as crazy as a bed bug.\" The Trump campaign did not immediately respond to a request for comment about Trump comparing Pelosi to a dog. Fresh from his nominating convention where his takeover of the Republican Party was cemented, Trump appeared in Grand Rapids with his new vice presidential pick, Senator J.D. Vance from Ohio. They took the stage in their first campaign event together with the Republican Party unified behind them. In contrast, it is no longer certain that President Joe Biden will be the Democratic Party's nominee facing Trump in the Nov. 5 election. Biden has faced calls from some senior Democrats to end his re-election bid after his poor debate performance last month raised concerns over whether he could beat Trump or complete another four-year term. Trump attacked Democrats, saying they wanted to kick Biden off the ticket after he won their presidential nominating contest. \"They have a couple of problems. No. 1, they have no idea who their candidate is,\" Trump said to laughter and jeers. \"This guy goes and he gets the votes and now they want to take it away.\" \"As you're seeing, the Democrat Party is not the party of democracy. They're really the enemies of democracy.\" He added: \"And they keep saying, 'He's a threat to democracy.' I'm saying, 'What the hell did I do for democracy?' Last week, I took a bullet for democracy.\" Trump referred to the assassination attempt several times on Saturday. \"I hope I don't have to go through that again. It was so horrible,\" Trump said. Opinion polls show a tight race between the Trump and Biden at a national level but Biden trailing Trump in the battleground states that will likely determine the winner. Many Democrats fear he may not have a realistic path to victory and that the party needs a new candidate to take on Trump. There was a heavy police presence at Trump's rally in Grand Rapids on Saturday, with police on every street corner for several blocks. U.S. Secret Service officers were positioned on the top balconies in the Van Andel Arena, giving them a bird's eye view of the crowd inside. Bag searches for those entering the indoor arena earlier in the day were long and thorough, and the Secret Service sweep of the building took about an hour longer than usual. The rally in Butler, Pennsylvania, last weekend was outdoors. At that event, the gunman was able to scale the roof of a building outside the Secret Service perimeter before opening fire on Trump, clipping his ear, killing a rally-goer and wounding several others. The Secret Service, which is responsible for protecting Trump, declined to comment on security for the Grand Rapids event. An investigation is under way into the security failures at the Butler rally. Trump gave a detailed account of his narrow brush with death in his convention speech on Thursday, telling the audience that he was only talking to them \"by the grace of Almighty God.\" Trump's former physician, Ronny Jackson, said on Saturday that the former president is recovering as expected from the gunshot wound to his right ear, but noted intermittent bleeding and said Trump may require a hearing exam. The bullet fired by the would-be assassin at the July 13 rally in Pennsylvania came \"less than a quarter of an inch from entering his head,\" said Jackson, a Republican congressman from Texas who had served as physician to Presidents Trump and Barack Obama. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Donald Trump held his first campaign rally on Saturday since he narrowly escaped an assassination attempt one week ago, poking fun at Democrats in turmoil at a heavily secured indoor arena in the...","url":"https://www.ndtv.com/world-news/they-have-no-idea-who-their-candidate-is-trump-mocks-democrats-at-first-rally-since-shooting-6151294","image":"https://c.ndtvimg.com/2024-07/98oqr5g8_trump-rally_625x300_21_July_24.jpeg?ver-20240615.100","video":null,"publish_date":"2024-07-20 23:01:51","author":null,"language":"en","catgory":"politics","source_country":"in","sentiment":-0.352},{"id":252247376,"title":"Trump campaign releases letter on his injury, treatment after last week's assassination attempt","text":"Donald Trump's campaign released an update on the former president's health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania. The memo, from Texas Rep. Ronny Jackson, who served as Trump's White House physician, offers new details on the nature of the GOP nominee's injuries and the treatment he received in the immediate aftermath of the attack. According to Jackson, Trump sustained a gunshot wound to the right ear from a high-powered riffle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” The bullet track, he said, “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear. There was initially significant bleeding, followed by marked swelling of the entire upper ear.” While the swelling has since resolved and the wound “is beginning to granulate and heal properly,” he said Trump is still experiencing intermittent bleeding, requiring the dressing that was on display at last week's Republican National Convention. At Saturday's rally, the white gauze on Trump's ear was replaced by a skin-colored bandage. “Given the broad and blunt nature of the wound itself, no sutures were required,” Jackson wrote. Trump was initially treated by medical staff at Butler Memorial Hospital. According to Jackson, doctors “provided a thorough evaluation for additional injuries that included a CT of his head.” Trump, he said, “will have further evaluations, including a comprehensive hearing exam, as needed. He will follow up with his primary care physician, as directed by the doctors that initially evaluated him,\" he wrote. “In summary, former President Trump is doing well, and he is recovering as expected from the gunshot wound sustained last Saturday afternoon,\" he added. The letter is the first official update about the former president's condition since the night of the shooting. Jackson, a staunch Trump supporter, said in the letter that, as Trump's former doctor, he was deeply concerned about the former president's wellbeing in the aftermath of the attack and met him in Bedminster, New Jersey, late Saturday after Trump returned from Pennsylvania “to personally check on him, and offer my assistance in any way possible.” He said he has been with Trump since that time, evaluating and treating his wound daily. That includes traveling with him Saturday to Michigan, where the former president will hold his first rally since the shooting, joined by his newly named running mate, Ohio Sen. JD Vance. Jackson appears to be licensed to practice medicine in Florida, according to a state health department database. Records from the American Board of Emergency Medicine also show that Jackson also has a certification in Emergency Medicine, valid through the end of 2025. A spokesperson for the congressman did not immediately provide a response and Trump campaign's did not immediately respond to questions. Last year, Trump's campaign released a letter on President Joe Biden's 81st birthday from Dr. Bruce A. Aronwald, a New Jersey physician, who said he had been the former president's doctor since 2021. ___ A previous version of this story mistakenly said Jackson's emergency certification was valid through the end of 2015. It is valid through the end of 2025. ___ Associated Press writer Cedar Attanasio contributed to this report.","summary":"Donald Trump’s campaign released an update on the former president’s health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pennsylvania","url":"https://www.independent.co.uk/news/world/americas/donald-trump-ap-ronny-jackson-new-york-pennsylvania-b2583145.html","image":"https://static.independent.co.uk/2024/07/20/23/Election_2024_RNC_Photo_Gallery_01080.jpg?width=1200","video":null,"publish_date":"2024-07-20 22:51:02","author":"Jill Colvin","authors":["Jill Colvin"],"language":"en","source_country":"gb","sentiment":-0.097},{"id":252246540,"title":"‘The View’ hosts erupt on Chris Christie for refusing to back Biden: ‘You cannot throw away your vote!’","text":"Former New Jersey Republican governor and longtime Trump critic Chris Christie faced backlash from co-hosts of “The View” after declaring that he would not vote for either former President Donald Trump or President Joe Biden. In the wake of Trump’s choice of JD Vance as his running mate and his RNC acceptance speech on Thursday night, Christie argued on Friday that the former Republican president had failed his “chance to be unifying,” arguing he could have picked someone like Virginia Gov. Glenn Youngkin as his vice president. “I know you’re not voting for Trump, would you vote for a Democratic ticket?” show co-host Ana Navarro asked shortly afterward. “Right now, I’m not voting for either. I’m just not. I can’t. One guy is completely mentally incompetent to do the job —” Christie replied as the co-hosts erupted. “But you have to vote!” co-host Joy Behar argued. “No, I’m gonna vote down ticket. I don’t have to vote [for president], no!” Christie said, standing his ground, as one co-host could be heard telling him, “Yes, you do.” “You cannot throw away your vote! I asked you the last time you were on, Chris, and you’re gonna sit this one out?” co-host Sunny Hostin said, speaking over him. Navarro grilled Christie, arguing that it was ironic he was telling Democrats to ditch their current presidential nominee when he planned to vote for neither. The former governor said he will maintain this position as long as Biden remains the Democratic nominee, but may change his mind if a better leading candidate is offered. “I’m willing to consider anybody who presents themself as someone who will make the country better. Now, I’m not encouraged by Kamala Harris’ performance thus far,” he said. When asked by Hostin why he was not a Harris fan, he said, “’Why not?’ We only have like a minute-thirty. I don’t have enough time.” Hostin has been one of Harris’ most staunch defenders over the years, arguing that she is criticized because of her Black racial background or for being a woman, and claiming her widely-parodied word salads are actually a product of her legal background rather than gaffes. After Christie declared that the Biden-Harris ticket would not win in November, Behar asked if he would be willing to vote for a Harris-Josh Shapiro ticket, featuring the more moderate governor of Pennsylvania as the vice president. “Don’t know. Let me see what they have to say,” he said. When multiple hosts objected to this answer, he declared, “I’m sorry that I care for what people stand for. I apologize. I’m not gonna pre-commit to it! Let them perform and earn my vote! People should have their vote earned!” When Behar argued that by the next time they see him, he would surely be voting for Biden, Christie joked, “Voting for you, Joy. I’ll write you in!”","summary":"Former New Jersey Gov. Chris Christie faced backlash from co-hosts of \"The View\" after declaring that he would not vote for either former President Donald Trump or President Joe Biden.","url":"https://nypost.com/2024/07/20/us-news/the-view-hosts-erupt-on-chris-christie-for-refusing-to-back-biden-you-cannot-throw-away-your-vote/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-20bjan0j4-1721513886832.jpg?quality=75&strip=all&1721499597&w=1200","video":"https://cdn.jwplayer.com/videos/ILJBWey1-RyIcpnTz.mp4","publish_date":"2024-07-20 22:46:14","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":-0.381},{"id":252247808,"title":"\"I Took A Bullet For Democracy\": Trump At First Rally Since Shooting","text":"Donald Trump, holding his first campaign rally Saturday since surviving an assassination attempt, rejected concerns that he is a threat to democracy, triumphantly telling a cheering crowd: \"Last week I took a bullet for democracy.\" \"I'm not an extremist at all,\" the Republican continued at the rally in swing state Michigan, dismissing his reported links to Project 2025, a shadow manifesto from figures close to him that has been characterized by opponents as an authoritarian, right-wing wish list. And he mocked the rival Democratic Party, roiled by unprecedented pressure for President Joe Biden to abandon his reelection bid amid concerns over his age and fitness to serve, if reelected, until 2029. \"They have no idea who their candidate is... This guy goes and he gets the votes, and now they want to take it away. That's democracy,\" Trump told the 12,000-strong crowd of passionate supporters. In the fiery but typically rambling speech, the Republican presidential riffed on his hardline immigration views, while espousing falsehoods about migrant crime. He also expressed admiration for foreign autocrats including the \"brilliant\" Xi Jinping of China, whom he praised for controlling \"1.4 billion people with an iron fist.\" And he evoked the seconds after a gunman tried to kill him at a rally in Pennsylvania, when, bloodied and surrounded by Secret Service agents, he raised a fist and yelled for his supporters to \"fight!\" The crowd in Grand Rapids chanted the word back to him Saturday more than once, though some appeared to tire of the lengthy address after 90 minutes and began filing out of the arena. The rally represented a moment remarkable by any measure, with Trump back on stage exactly one week since the assassination attempt. He appeared wearing a new, smaller, flesh-colored bandage over his right ear, grazed in the attack by a 20-year-old gunman on a rooftop who also killed one bystander. Security was reportedly tight inside the Van Andel Arena in Grand Rapids, Michigan, amid questions over Secret Service lapses at the Pennsylvania rally -- though there were few visible signs of any greater law enforcement presence. Biden's 'big decision' Meanwhile, Biden loyalists continued to defend the embattled president as the drumbeat of calls for him to abandon his campaign grows louder. The 81-year-old and his team have remained publicly adamant that he is staying in the race, though some reports suggest discussions have begun in his inner circle about how exactly he might step aside. There has been massive speculation over who could replace him. As vice president, Harris appears best positioned to do so. Senator Elizabeth Warren, a leading progressive who sought the party's presidential nod in 2020, gave Harris a boost Saturday without turning her back on the president. \"Joe Biden is our nominee,\" she said on MSNBC. \"He has a really big decision to make. \"But what gives me a lot of hope right now is that if President Biden decides to step back, we have Vice President Kamala Harris, who is ready to step up, to unite the party, to take on Donald Trump, and to win in November.\" Some Democrats, however, fear that such a late switch could trigger chaos, dooming the party at the polls. Team Trump, for its part, is effervescent after an exceptional streak of luck -- from the failed assassination bid to favorable court rulings and Biden's disastrous debate performance last month. Saturday was Trump's debut campaign appearance with running mate J.D. Vance, a 39-year-old US senator from Ohio who could help win over critical swing states like Michigan, Pennsylvania and Wisconsin. Vance warmed up the crowd, taking a swipe at Harris. \"I did serve in the United States Marine Corps and build a business. What the hell have you done, other than collect a check?\" he said of the former US senator and California attorney general. Trump supporters had begun lining up in their dozens in Grand Rapids on Friday, nearly a full day before the rally began. Edward Young, 64, attending his 81st Trump rally, was wearing a T-shirt showing the already iconic photo of Trump pumping his fist immediately after being shot. \"They have turned him into a martyr and left him alive,\" he said. \"Now he's more powerful than ever.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Donald Trump, holding his first campaign rally Saturday since surviving an assassination attempt, dismissed concerns that he is a threat to democracy, triumphantly telling a cheering crowd: \"Last week...","url":"https://www.ndtv.com/world-news/i-took-a-bullet-for-democracy-donald-trump-at-first-rally-since-assassination-attempt-6151238","image":"https://c.ndtvimg.com/2024-07/m4kevn28_donald-trump-_625x300_21_July_24.jpeg?ver-20240615.100","video":null,"publish_date":"2024-07-20 22:41:43","author":"Secret Service","authors":["Secret Service"],"language":"en","catgory":"politics","source_country":"in","sentiment":0.007},{"id":252246440,"title":"“Trump makes triumphant return to campaign trail following assassination attempt”","text":"Donald Trump appeared at his first campaign rally on Saturday since surviving an assassination attempt, joined on stage by his newly selected running mate JD Vance. Exactly one week after a shooter’s bullet narrowly missed Trump’s head at a rally in Butler, Pennsylvania, the former president looked relaxed as he rallied thousands of supporters on Saturday night in Grand Rapids, Michigan. “I shouldn’t be here. I shouldn’t be here,” Trump said on Saturday, arguing God had saved his life. “But something very, something very special happened, let’s face it.” Trump was introduced on stage by Vance, the 39-year-old Ohio senator who he formally selected as his vice-presidential pick on Monday, at the start of a four-day Republican National Convention that was dominated by the fallout from the shooting. “I don’t think there has ever been a convention where there was such unity and love,” Trump said on Saturday. “The fake news even said it that way. I want to be nice.” Trump formally accepted his party’s nomination for president for a third time at the convention in a lengthy speech that appealed for national unity in the wake of the shooting. But the former president soon veered off script, and his record-setting 92-minute speech was rife with the “America First” message and often divisive rhetoric that appeals to his base of supporters but risks turning off swing voters. He stepped up those attacks on Saturday. Trump’s decision to make Vance his running mate has been widely seen as part of an effort to win over white, working-class voters in key Midwestern swing states, including Michigan, Wisconsin and Pennsylvania. Vance shot to national fame in 2016 with the publication of his memoir Hillbilly Elegy, about his poverty-stricken childhood in nearby Ohio. “You know, I chose him because he is for the worker, he is for the people that work so hard, and perhaps weren’t treated like they should have been,” Trump said on Saturday. The Trump campaign has until now provided little information about the former president’s medical condition after the shooting. At the Republican convention this week in Wisconsin, Trump could be seen each night wearing a gauze bandage on his right ear. Trump appeared on stage in Grand Rapids wearing a smaller bandage on Saturday. Hours before the Michigan rally, Texas congressman Ronny Jackson, who was Trump’s White House physician, published a letter saying he had been evaluating and treating Trump daily since the shooting. Jackson said the assassin’s bullet came “less than a quarter of an inch” from entering Trump’s head, and “struck the top of his right ear”. The congressman added the “bullet track produced a 2cm wide wound that extended down to the cartilaginous surface of the ear,” and there had been “initially significant bleeding, followed by marked swelling of the entire upper ear”. Jackson said the swelling had gone down and the wound, which did not require stitches, was beginning to heal. But he added that given there was “still intermittent bleeding,” Trump would continue to wear a bandage for the time being. Trump’s return to the campaign trail comes at a time of unprecedented polling strength for the former president, who has opened up a lead in national and swing state opinion polls over his Democratic opponent, US President Joe Biden. Betting markets this week put the odds of Biden winning re-election at an all-time low. Biden’s campaign has been in a tailspin for more than three weeks, since the 81-year-old president’s disastrous debate performance raised questions about his fitness for office. Democratic lawmakers, influential donors and party operatives have worked behind the scenes and increasingly gone public with their efforts to pressure the president to abandon his re-election bid. Biden, who has not been seen in public since Wednesday and is at his Delaware holiday home recovering from Covid-19, has insisted that he is staying in the race for the White House. But his defiance has done little to quell speculation about who might replace him on the top of the ticket. On Saturday night, Trump polled the arena in Grand Rapids, asking: “Who would you most like to run against if you’re us, if we want to win?” That prompted boos from the crowd as the former president asked about Biden and his vice-president, Kamala Harris. “[Democrats] have a couple of problems,” Trump said with a laugh. “Number one, they have no idea who their candidate is, and neither do we.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nUnlock the US Election Countdown newsletter for free Donald Trump appeared at&#8230;\n\n\nThis Post: &#8220;Trump makes triumphant return to campaign trail following assassination attempt&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/business/trump-makes-triumphant-return-to-campaign-trail-following-assassination-attempt/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Trump-returns-to-campaign-trail-for-first.jpg3Fsource3Dnext-article26fit3Dscale-down26quality3Dhighest26width3D70026dpr3D1.jpeg","video":null,"publish_date":"2024-07-20 22:38:48","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.327},{"id":252246364,"title":"Gunman in Trump rally attack flew drone over rally site in advance of event, official says","text":"The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday's shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump's appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Associated Press writer Jill Colvin contributed to this report. © Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an…","url":"https://japantoday.com/category/world/gunman-in-trump-rally-attack-flew-drone-over-rally-site-in-advance-of-event-official-says","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/b0/ad/4f7f3482a178b5982c33841af1d6f2df55d7/download/_w1700.jpg","video":null,"publish_date":"2024-07-20 22:33:04","author":"Eric Tucker,Japan Today Editor","authors":["Eric Tucker","Japan Today Editor"],"language":"en","catgory":"politics","source_country":"jp","sentiment":-0.515},{"id":252246532,"title":"Trump holds first rally after assassination attempt with his new running mate, Vance, by his side","text":"GRAND RAPIDS, Mich. (AP) — Donald Trump is holding his first campaign rally since he survived an attempted assassination last week, returning to the battleground state of Michigan alongside his new running mate. Exactly a week after the July 13 shooting in Pennsylvania that left Trump with a bloodied ear, killed one man in the crowd and left two others injured, he opened by offering a “very special thanks to Americans nationwide, including all of you here today for your extraordinary outpouring of love and support in the wake of the horrific last Saturday evening.” The crowd responded by chanting, “Fight, fight, fight!” The gauze on his ear appeared to have been replaced by a skin-colored bandage. Trump was joined by Ohio Sen. JD Vance at the pair’s first event together since they became the GOP’s nominees at the Republican National Convention in Milwaukee. “I find it hard to believe that a week ago, an assassin tried to take Donald Trump’s life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,” Vance said, speaking before Trump’s arrival. “I chose him because he’s for the worker,” Trump said of Vance. Hours before he took the stage, Trump’s supporters crowded the streets of downtown Grand Rapids in anticipation of the former president’s remarks. Supporters began lining up Friday morning, and by Saturday afternoon, the line stretched close to a mile from the venue’s entrance. Close to an hour before he was set to take the stage, supporters had filled nearly every seat in the 12,000-person Van Andel Arena. Many were seen wearing shirts featuring the image of Trump, on stage, after he was shot, pumping his fist in the air after surviving the shooting, along with the usual red “Make America Great Again” hats. Mike Gaydos, who traveled from Indiana with his three sons to attend the rally, said he didn’t consider himself a “huge” Trump supporter in the past but wanted to show support for the former president following his attempted assassination. “We can’t allow something like that to collar us,” he said. “Bravery is what I thought he showed that day and I want to show my sons about bravery as well.” Numerous streets, closed as an additional security precaution, were dotted with vendors selling food and apparel. Among them was a vendor from North Carolina who said he had spent the night making shirts featuring “Trump Vance ’24.” Downtown Grand Rapids also saw a significant police presence, with officers stationed on nearly every block, while others patrolled on horseback and bicycles. The heightened security outside the venue created a tense environment, with some attendees mentioning that drones overhead had made them nervous. Attendees were required to pass through a metal detector upon entering the downtown Grand Rapids indoor arena, yet the presence of security inside appeared consistent with previous events. “This is the tightest I’ve ever seen the security,” said Renee White, who said that she’s been to 33 of Trump’s rallies. “We usually can bring in some small bags but today I had to just leave stuff out there.” White was seated behind the podium at the rally in Butler, Pennsylvania, where the gunman opened fire from a nearby rooftop. She described the shooting as “surreal” but said that it wouldn’t stop her from going to rallies. “If I’m going to be taken out, at least I’m doing something I love to do, right?” said White. She said she had become emotional when Trump, in his RNC speech to delegates, described the shooting in detail. “I’m not supposed to be here tonight,” Trump told the packed convention hall. The crowd of thousands, which was listening in silence, shouted back, “Yes, you are.” Michigan is one of the handful of crucial swing states expected to determine the outcome of November’s presidential election. Trump narrowly won the state by just over 10,000 votes in 2016, but Democrat Joe Biden flipped it back in 2020, winning by a margin of 154,000 votes on his way to the presidency. Trump’s choice of Vance was seen as a move to gain support among so-called Rust Belt voters in places like Michigan, Pennsylvania, Wisconsin and Ohio who helped Trump notch his surprise 2016 victory. Vance specifically mentioned those places during his acceptance speech at the convention, stressing his roots growing up poor in small-town Ohio and pledging not to forget working-class people whose “jobs were sent overseas and children were sent to war.” Democrats have dominated recent elections in Michigan, but Republicans now see an opening in the state as Democrats are increasingly divided about whether Biden should drop out of the race. Biden has insisted he is not quitting, and has attempted to turn the focus back towards Trump, saying Friday that Trump’s acceptance speech at the Republican convention showcased a “dark vision for the future.” The 81-year-old Democratic incumbent, who appeared in Detroit this month, is currently isolating at his beach home in Delaware recovering from COVID-19. Grand Rapids, the largest city in Kent County, was historically a Republican stronghold, but has trended increasingly blue. It was one of three Michigan counties that Trump won in 2016 but Biden flipped in 2020. It’s also an area where Republican Nikki Haley secured a substantial number of votes as she ran against Trump in the GOP primary, a group of voters that both presidential campaigns are now hoping to pick up. Haley urged her supporters to back Trump in a convention floor speech. U.S. Rep. Hillary Scholten, a Democrat representing Grand Rapids, is among the growing number of lawmakers calling on Biden to exit the race after last month’s disastrous debate performance. ___ Colvin reported from New York, (Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"GRAND RAPIDS, Mich. (AP) —&#160;Donald Trump&#160;is holding his first campaign rally since he survived an&#160;attempted assassination&#160;last week, returning to the battleground state of Michigan alongside...","url":"https://whdh.com/news/trump-holds-first-rally-after-assassination-attempt-with-his-new-running-mate-vance-by-his-side/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/07/trump-first-rally.jpg?quality=60&strip=color","video":"https://bcbolt446c5271-a.akamaihd.net/media/v1/pmp4/static/clear/4744899807001/8a77fba0-c025-48ad-bd7a-23168e8ee2a5/ff8ec6df-9f25-4aeb-98fb-396468759f16/main.mp4?akamai_token=exp=1721537191~acl=/media/v1/pmp4/static/clear/4744899807001/8a77fba0-c025-48ad-","publish_date":"2024-07-20 22:30:17","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","source_country":"us","sentiment":0.038},{"id":252246434,"title":"Trump shares his preferred opponent from the Democratic party and discusses Project 2025 while addressing a large gathering a week after a tragic shooting incident: ‘I defended democracy at great personal risk.’","text":"Donald Trump has held his first campaign rally since being shot and thanked his supporters for their outpouring of love while ridiculing Democrats for being a party of corrupt insiders intent on dislodging their leader in a coup. Gone was the big, white, gauze-filled bandage that he wore during the week to protect his wounded ear. It was replaced with a smaller, flesh-colored dressing. ‘Last week I took a bullet for democracy,’ he said Saturday. As Joe Biden, 81, recovers out-of-sight at home from COVID-19, 78-year-old Trump walked out to a thunderous welcome, providing an extraordinary political split screen for the 2024 election. While one president fights for his political life, another has survived a 2020 defeat, a criminal conviction and an assassin’s bullet to once again stand astride his party. He returned to the stage in Grand Rapids a changed man, according to his confidants. But he launched quickly into his usual rally schtick, holding a poll of his supporters to find out who they would most like to face in the election. They booed for Vice President Kamala Harris, but booed even harder for Biden. ‘I don’t think we have to go too much further,’ said Trump, before turning his attention to Michigan’s Gov. Gretchen Whitmer, who is also spoken of as a possible candidate. ‘You have a terrible governor who did a terrible job. i’d like to run against her.’ After the formality of the Republican National Convention and its delegates last week in Milwaukee, Trump reveled in the adoration of his grass roots supporters. They held their fists in the air as he entered the arena and chanted ‘fight, fight, fight,’ in homage to the way Trump responded after picking himself up from the ground after being wounded last weekend. He used the occasion to distance himself from the radical Project 2025 plan developed by allies and former officials as a blueprint for a second Trump administration. ‘Some on the right – severe right – came up with this Project 25,’ he said. ‘And I don’t even know … they’re sorta the opposite of the radical left … I don’t know what the hell it is … some of the things – they’re seriously extreme.’ Democrats have hit him with the extreme plans. ‘I don’t know what the hell it is,’ claimed Trump. Security was visibly tighter than other rallies. Not only was it held indoors, but bags were checked in much close detail than usual by Secret Service agents beside the Magnetometers. Michigan is one of the key swing states that could decide the outcome of the election. Trump won it by a little more than 10,000 votes in 2016, but Joe Biden flipped it four years later. Grand Rapids holds particular special significance for Trump. He held his final election rally of the 2016 campaign here before securing a shock win. He returned for his final 2020 rally but could not secure victory. During the past week family, advisers and officials all said the shooting had changed Trump and his party convention speech on Thursday was billed as a chance to call for unity and understanding. That lasted about 15 minutes as the former president quickly segued into a rally speech, slamming Biden, ‘crazy Nancy Pelosi,’ and his usual targets. On Saturday he went straight into his usual barnstorming rally fare, much to the delight of an army of fans that wasn’t about to be deterred by the small matter of an assassin’s bullet. ‘One of the messages that President Trump put out after what happened in Butler was a message that could best be characterized by two words: Fear not,’ said Blake Marnell, a veteran of more than 40 rallies. Dressed in his famous ‘brick suit,’ he was present in Butler, less than 10 yards from Trump, as he was shot in the ear and Secret Service agents bundled him to the ground. Beside him were other ‘Front Row Joes’ who travel the country from rally to rally. ‘We saw the hand of God protecting the president last week and I feel safe being here because that hands protects all of us here,’ said Rick Lane, 55, from Pennsylvania, wearing one of the ‘I bleed red, white, and Trump’ T-shirts made by his own apparel company.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump has held his first campaign rally since being shot and&#8230;\n\n\nThis Post: Trump shares his preferred opponent from the Democratic party and discusses Project 2025 while addressing a large gathering a week after a tragic shooting incident: &#8216;I defended democracy at great personal risk.&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-shares-his-preferred-opponent-from-the-democratic-party-and-discusses-project-2025-while-addressing-a-large-gathering-a-week-after-a-tragic-shooting-incident-i-defended-democracy-at-great-per/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Trump-reveals-the-Democratic-candidate-he-wants.jpg","video":null,"publish_date":"2024-07-20 22:29:03","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.42},{"id":252246438,"title":"Governor Kathy Hochul Seeks Emergency Declaration from President Biden Following Devastating Weather in New York","text":"New York Gov. Kathy Hochul has requested President Joe Biden to issue a federal Emergency Declaration following the severe weather that caused widespread damage in parts of the state earlier this week. In her letter to Biden, Hochul highlights the strong winds and intense precipitation that resulted in destruction in 15 counties, including Genesee, Herkimer, Montgomery, Oswego, Oneida, Saratoga, and Schuyler on July 15 and 16. The governor also mentions the 17 tornadoes that have occurred in the state this month, which she describes as “unprecedented,” representing the highest number of confirmed tornadoes for New York in July since recording began in 1950. The letter was sent to the president on Saturday. Explaining she’s already declared a statewide emergency, Hochul said federal assistance was needed to help clear debris from roadways and restore battered utilities. “New York has seen an unprecedented 17 confirmed tornados so far this month — more than Oklahoma, Kansas, Alabama, Mississippi, and Iowa combined,” Hochul wrote on X. “As we help communities recover from last week’s severe weather, I’ve requested a federal Emergency Declaration to support our efforts.” The letter asks that the $5 million limit imposed on federal assistance be waived, anticipating more will be needed. While Biden’s administration considers the request, the state’s Division of Homeland Security and Emergency Services continues outreach to the impacted counties. If granted, the declaration would set aside moneys to address additional damage caused by storms on July 11 and July 12.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNew York Gov. Kathy Hochul has requested President Joe Biden to issue&#8230;\n\n\nThis Post: Governor Kathy Hochul Seeks Emergency Declaration from President Biden Following Devastating Weather in New York first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/governor-kathy-hochul-seeks-emergency-declaration-from-president-biden-following-devastating-weather-in-new-york/","image":"https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2024%2F07%2F85756184.jpg?quality%3D90%26strip%3Dall","video":null,"publish_date":"2024-07-20 22:26:04","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.362},{"id":252245882,"title":"Gov. Kathy Hochul asks Biden for emergency declaration after severe weather devastates parts of NY","text":"New York Gov. Kathy Hochul has asked President Joe Biden to issue a federal Emergency Declaration after severe weather devastated portions of the state earlier this week. Hochul’s letter to Biden notes the high winds and heavy rainfall that wrought havoc across 15 counties, including Genesee, Herkimer, Montgomery, Oswego, Oneida, Saratoga, Schuyler on both July 15 and 16. The governor also references the “unprecedented” 17 tornadoes that’ve already formed in the state this month, marking the largest number of confirmed tornadoes for New York in July since record keeping began in 1950. The letter was sent to the president on Saturday. Explaining she’s already declared a statewide emergency, Hochul said federal assistance was needed to help clear debris from roadways and restore battered utilities. “New York has seen an unprecedented 17 confirmed tornados so far this month — more than Oklahoma, Kansas, Alabama, Mississippi, and Iowa combined,” Hochul wrote on X. “As we help communities recover from last week’s severe weather, I’ve requested a federal Emergency Declaration to support our efforts.” The letter asks that the $5 million limit imposed on federal assistance be waived, anticipating more will be needed. While Biden’s administration considers the request, the state’s Division of Homeland Security and Emergency Services continues outreach to the impacted counties. If granted, the declaration would set aside moneys to address additional damage caused by storms on July 11 and July 12.","summary":"Hochul said federal assistance was needed to help clear debris from roadways and restore battered utilities.","url":"https://nypost.com/2024/07/20/us-news/gov-kathy-hochul-asks-biden-for-emergency-declaration-after-severe-weather-devastates-parts-of-ny/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/85756184.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/YPaeFVyf-RyIcpnTz.mp4","publish_date":"2024-07-20 22:22:58","author":"Chris Harris","authors":["Chris Harris"],"language":"en","source_country":"us","sentiment":-0.397},{"id":252247304,"title":"Gunman in Trump assassination attempt flew a drone over the rally site ahead of shooting, official says","text":"The drone has been recovered by the FBI, which is leading the investigation into last Saturday’s shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump’s appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee.","summary":"More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee.","url":"https://fortune.com/2024/07/20/trump-assassination-attempt-gunman-drone-campaign-rally-site-shooting/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/07/AP24198007342884-e1721513346169.jpg","video":null,"publish_date":"2024-07-20 22:17:12","author":"Eric Tucker,The Associated Press","authors":["Eric Tucker","The Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.494},{"id":252245588,"title":"Sheila Jackson Lee, founder of Pakistan Caucus, dies of cancer","text":"US Congresswoman Sheila Jackson Lee, founder and co-chairperson of the Congressional Pakistan Caucus, has died at the age of 74 after a battle with cancer, her family announced. In a statement of Friday, her family said “Today, with incredible grief for our loss yet deep gratitude for the life she shared with us, we announce the passing of United States Representative Sheila Jackson Lee of the 18th Congressional District of Texas.” “A local, national, and international humanitarian, she was acknowledged worldwide for her courageous fights for racial justice, criminal justice, and human rights, with a special emphasis on women and children,” the statement said. Jackson Lee announced in June that she had been diagnosed with pancreatic cancer and was undergoing treatment. The long-time congresswoman served in the House since 1995 and leaves a legacy of pushing for legislation related to civil rights. Jackson Lee was the lead sponsor of the Juneteenth National Independence Day Act, and she pushed for the Sentencing Reform Act of 2015, as well as the George Floyd Law Enforcement Trust and Integrity Act. “This is America’s holiday. And America’s holiday is not just for Black people,” Jackson Lee said of Juneteenth in a 2023 MSNBC interview. “It is about freedom, and it is about democracy.” The Texas Democrat introduced legislation for the reauthorization of the Violence Against Women Act, which President Joe Biden signed in 2022.","summary":"US Congresswoman Sheila Jackson Lee, founder and co-chairperson of the Congressional Pakistan Caucus, has died at the age of 74 after a battle with cancer, her family announced. In a statement of Friday, her family said &#8220;Today, with incredible grief for our loss yet deep gratitude for the life she shared with us, we announce [&#8230;]","url":"https://dailytimes.com.pk/1210194/sheila-jackson-lee-founder-of-pakistan-caucus-dies-of-cancer/","image":"https://dailytimes.com.pk/assets/uploads/2024/07/2nd-Lead-2-9.jpg","video":null,"publish_date":"2024-07-20 22:08:44","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","source_country":"pk","sentiment":0.03},{"id":252245550,"title":"Official: Gunman at Trump rally used drone to scope out event beforehand","text":"WASHINGTON – The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday’s shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee’s White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came “less than a quarter of an inch from entering his head, and struck the top of his right ear.” One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump’s appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. ____ Associated Press writer Jill Colvin contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – The gunman in the attempted assassination of former President Donald&#8230;\n\n\nThis Post: Official: Gunman at Trump rally used drone to scope out event beforehand first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/official-gunman-at-trump-rally-used-drone-to-scope-out-event-beforehand/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Gunman-in-Trump-rally-attack-flew-drone.jpg","video":null,"publish_date":"2024-07-20 22:07:54","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.501},{"id":252246358,"title":"Gunman in Trump rally attack flew drone over rally site in advance of event, official says","text":"WASHINGTON -- The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday's shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee's White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came \"less than a quarter of an inch from entering his head, and struck the top of his right ear.\" One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump's appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Associated Press writer Jill Colvin contributed to this report.","summary":"The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event.","url":"https://abc7news.com/post/gunman-trump-rally-attack-flew-drone-rally-site/15075519/","image":"https://cdn.abcotvs.com/dip/images/15075522_AP24198007342884.jpg?w=1600","video":"https://vcl.abcotv.net/video/wpvi/071824-wpvi-n1-trump-shooting-investigation-edited-pkg-video-vid.mp4","publish_date":"2024-07-20 22:06:38","author":"Eric Tucker","authors":["Eric Tucker"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.491},{"id":252245406,"title":"Gunman in Trump rally attack flew drone over rally site in advance of event, official says","text":"WASHINGTON -- The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event, a law enforcement official said Saturday. The drone has been recovered by the FBI, which is leading the investigation into last Saturday's shooting at the rally by 20-year-old Thomas Matthew Crooks. Crooks fired multiple rounds from the roof of a building adjacent to the Butler Farm Show grounds, where Trump was speaking, before being fatally shot by a Secret Service counter sniper. The existence of the device and its use at some point before the shooting could help explain why Crooks knew to fire from the point. The official who described the drone was not authorized to discuss the matter publicly and spoke to The Associated Press on the condition of anonymity. Details of the drone were first reported by The Wall Street Journal. Trump said this week that one bullet clipped his right ear. A memo released Saturday by the Trump campaign and authored by Texas Rep. Ronny Jackson, who served as the GOP nominee's White House physician, said that Trump sustained a gunshot wound to the right ear from a high-powered rifle that came \"less than a quarter of an inch from entering his head, and struck the top of his right ear.\" One of the bullets aimed toward Trump killed 50-year-old firefighter Corey Comperatore, a spectator who was in the bleachers. Two others were seriously wounded. The FBI is continuing to investigate what may have motivated Crooks to carry out the attack. So far, officials have not found any ideological bent that could help explain his actions. Investigators who searched his phone found photos of Trump, President Joe Biden and other senior government officials, and also found that he had looked up the dates for the Democratic National Conventional as well as Trump's appearances. He also searched for information about major depressive order. More details about the investigation are expected to be made public in the coming week when FBI Director Chris Wray appears before the House Judiciary Committee. Associated Press writer Jill Colvin contributed to this report.","summary":"The gunman in the attempted assassination of former President Donald Trump is believed to have flown a drone around the Pennsylvania rally site ahead of time in an apparent attempt to scope out the site before the event.","url":"https://abc13.com/post/gunman-trump-rally-attack-flew-drone-rally-site/15075519/","image":"https://cdn.abcotvs.com/dip/images/15075522_AP24198007342884.jpg","video":null,"publish_date":"2024-07-20 22:04:42","author":"Eric Tucker","authors":["Eric Tucker"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.491},{"id":252246740,"title":"'Special thanks ...': Donald Trump holds rally with J D Vance after assassination attempt","text":"Donald Trump has returned to the campaign trail, holding his first rally since surviving an assassination attempt last week. The former president chose Michigan, a crucial battleground state, to make his comeback alongside his newly selected running mate, Ohio senator J D Vance. The event took place exactly one week after the shocking incident in Pennsylvania, where a gunman opened fire, leaving Trump with a minor injury to his ear, one person dead, and two others wounded.As he took the stage, Trump expressed his gratitude, saying, \"Very special thanks to Americans nationwide, including all of you here today for your extraordinary outpouring of love and support in the wake of the horrific last Saturday evening.\" The crowd responded with chants of \"Fight, fight, fight!\" as Trump stood before them, his ear bandage now replaced with a skin-colored one.Vance, who joined Trump for their first joint appearance since being nominated at the Republican National Convention in Milwaukee, remarked on the incredible turnout despite the recent assassination attempt. \"I find it hard to believe that a week ago, an assassin tried to take Donald Trump's life, and now we have got a hell of a crowd in Michigan to welcome him back on the campaign trail,\" he said. Trump, in turn, praised Vance, saying, \"I chose him because he's for the worker.\"In a triumphant declaration to an enthusiastic audience, Donald Trump said, \"Last week I took a bullet for democracy.\" The former president vehemently denied any extremist affiliations, refuting alleged connections to Project 2025, a controversial manifesto spearheaded by his close associates. Critics have denounced the project as a far-right, authoritarian agenda.Trump also took aim at the Democratic Party, which is grappling with unprecedented calls for US President Joe Biden to withdraw from the presidential race due to concerns about his age and ability to effectively serve until 2029 if reelected. The former president mockingly remarked, \"They have no idea who their candidate is... This guy goes and he gets the votes, and now they want to take it away. That's democracy.\"Despite occasionally lapsing into his signature meandering campaign rhetoric, the rally marked a remarkable moment by any standard, as Trump returned to the stage precisely one week after an assailant attempted to assassinate him. The event drew a fervent crowd of 12,000 supporters, underscoring his enduring appeal among his base.Hours before the rally, supporters flooded the streets of downtown Grand Rapids, eagerly awaiting the former president's arrival. The line of attendees stretched nearly a mile from the venue's entrance, with many wearing shirts featuring the image of Trump defiantly pumping his fist in the air after surviving the shooting. The iconic red \"Make America Great Again\" hats were also a common sight among the crowd.The rally was held at the Van Andel Arena, an indoor venue capable of accommodating more than 12,000 people. The decision to hold the event indoors was a departure from Trump's previous rallies this election cycle, which were primarily held outdoors.","summary":"","url":"https://timesofindia.indiatimes.com/world/us/special-thanks-donald-trump-holds-rally-with-j-d-vance-after-assassination-attempt/articleshow/111892428.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-111892436/111892436.jpg","video":null,"publish_date":"2024-07-20 22:03:22","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","catgory":"politics","source_country":"in","sentiment":-0.023},{"id":252245480,"title":"Ukrainian crisis is Europe’s responsibility – Trump ‘envoy’","text":"Ukraine is in Europe’s “own backyard,” and solving the ongoing crisis is within its responsibility, a close associate of US presidential hopeful Donald Trump, Richard Grenell, believes. Grenell, who held several senior diplomatic posts during Trump’s first tenure and is now widely regarded as his “envoy” and likely pick for the Secretary of State, should the Republican candidate win the elections, made the remarks in an interview with German tabloid Bild on Friday. Among other things, the diplomat suggested Ukraine was largely within the EU’s “responsibility” rather than Washington’s. “It’s in your backyard. If there was a war in Mexico, we would do most, if not all, of the job. And we certainly wouldn’t ask the Germans for help if there was a war in Mexico,” Grenell stated. Europe has certainly fared better during the Trump administration, he claimed. “There were no wars in Europe during Donald Trump’s time in office,” he pointed out. Grenell also criticized incumbent US leader Joe Biden for his apparent lack of any effort to engage in diplomacy with Russia and “talk” to President Vladimir Putin. “Biden has not spoken to [Putin] in three years. I think talking to people is a tactic. Not the goal, not the solution – but it gets us there,” he suggested. Grenell has been rather vocal about the Ukrainian conflict lately, floating a proposal earlier this month on how exactly the hostilities could be solved. The diplomat said Ukraine should not become a member of NATO any time soon, while transforming the country into a federation of sorts with a more autonomous region could be the key to ending the hostilities. “Autonomous regions can mean a lot of things to a lot of people, but you got to work through those details,” Grenell stated during a Bloomberg News roundtable. The proposal received a cold response in Moscow, with Russian Foreign Ministry spokeswoman Maria Zakharova dismissing it as an attempt to re-imagine the long-defunct 2014–15 Minsk Agreements. The deal, which had provided a roadmap out of the conflict in then-Ukrainian Donbass, was ultimately revealed both by Kiev and its Western backers to be a mere ruse to buy time for arming Ukraine. “Where were you, Rick, when the Minsk agreements dedicated to exactly this were on the table of the international community, and Russia did its best in support of them and called for finding a form of federalization of Ukraine to preserve its integrity?” Zakharova wrote in a Telegram post.","summary":"Ukraine is in Europe’s “backyard,” and the ongoing conflict is within its responsibility rather than Washington’s, a close Trump ally says \nRead Full Article at RT.com","url":"https://www.rt.com/news/601396-ukrainian-crisis-us-europe/","image":"https://mf.b37mrtl.ru/files/2024.07/article/669c334c85f540146d02e7fb.jpg","video":null,"publish_date":"2024-07-20 22:00:25","author":null,"language":"en","catgory":"politics","source_country":"ru","sentiment":-0.164},{"id":252245360,"title":"Biden pushes party unity as he resists calls to step aside","text":"A rapidly growing chorus of Democratic lawmakers called Friday for President Joe Biden to drop his reelection bid, even as the president insisted he´s ready to return to the campaign trail next week to counter what he called a “dark vision” laid out by Republican Donald Trump. As more Democratic members of Congress urged him to drop out – bringing the total since his disastrous debate against Trump to nearly three dozen – Biden remained isolated at his beach house in Delaware after being diagnosed with COVID-19. The president, who has insisted he can beat Trump, was huddling with family and relying on a few longtime aides as he resisted efforts to shove him aside. Late Friday, Ohio Sen. Sherrod Brown, a Democrat who is in a tough race for reelection, called for Biden to step aside. Brown said in a statement that he agrees with “the many Ohioans” who have reached out to him. “I think the president should end his campaign,” he said. And in a statement later Friday, Rep. Morgan McGarvey, D-Ky., also called on Biden to drop out while saying, “there is no joy in the recognition he should not be our nominee in November. But the stakes of this election are too high.” Biden said Trump’s acceptance speech at the Republican National Convention showcased a “dark vision for the future.” The president, seeking to move the political conversation away from his fate and onto his rival’s agenda, said Friday he was planning to return to the campaign trail next week and insisted he has a path to victory over Trump, despite the worries of some of his party’s most eminent members. “Together, as a party and as a country, we can and will defeat him at the ballot box,” Biden said. “The stakes are high, and the choice is clear. Together, we will win.” Earlier in the day, his campaign chair, Jen O’Malley Dillion, acknowledged “slippage” in support for the president but insisted he’s “absolutely” remaining in the race and the campaign sees “multiple paths” to beating Trump. “We have a lot of work to do to reassure the American people that, yes, he´s old, but he can win,” she told MSNBC’s “Morning Joe” show. She said voters concerned about Biden’s fitness to lead aren’t switching to vote for Trump. Meanwhile, the Democratic National Committee’s rulemaking arm held a meeting Friday, pressing ahead with plans for a virtual roll call before Aug. 7 to nominate the presidential pick, ahead of the party´s convention later in the month in Chicago. “President Biden deserves the respect to have important family conversations with members of the caucus and colleagues in the House and Senate and Democratic leadership and not be battling leaks and press statements,” Sen. Chris Coons of Delaware, Biden´s closest friend in Congress and his campaign co-chair, told The Associated Press. It’s a pivotal few days for the president and his party: Trump has wrapped up an enthusiastic Republican National Convention in Milwaukee on Thursday. And Democrats, racing time, are considering the extraordinary possibility of Biden stepping aside for a new presidential nominee before their own convention. Among the democrats expressing worries to allies about Biden’s chances were former President Barack Obama and Speaker Emerita Nancy Pelosi, who has privately told Biden the party could lose the ability to seize control of the House if he doesn´t step aside. New Mexico Sen. Martin Heinrich called on Biden to exit the race, making him the third Senate Democrat to do so. “By passing the torch, he would secure his legacy as one of our nation´s greatest leaders and allow us to unite behind a candidate who can best defeat Donald Trump and safeguard the future of our democracy,” said Heinrich, who’s up for reelection. And Reps. Jared Huffman, Mark Veasey, Chuy Garcia and Mark Pocan, representing a wide swath of the caucus, together called on Biden to step aside. “We must defeat Donald Trump to save our democracy,” they wrote. Separately, Rep. Sean Casten of Illinois wrote in an op-ed that with “a heavy heart and much personal reflection” he, too, was calling on Biden to “pass the torch to a new generation.” Campaign officials said Biden was even more committed to staying in the race. And senior West Wing aides have had no internal discussions or conversations with the president about dropping out. On Friday, Biden picked up a key endorsement from the political arm of the Congressional Hispanic Caucus. CHC BOLD PAC said the Biden administration has shown “unwavering commitment” to Latinos and “the stakes couldn´t be higher” in this election. But there is also time to reconsider. Biden has been told the campaign is having trouble raising money, and key Democrats see an opportunity as he is away from the campaign for a few days to encourage his exit. Among his Cabinet, some are resigned to the likelihood of him losing in November.","summary":"A rapidly growing chorus of Democratic lawmakers called Friday for President Joe Biden to drop his reelection bid, even as the president insisted he´s ready to return to the campaign trail next week to counter what he called a &#8220;dark vision&#8221; laid out by Republican Donald Trump. As more Democratic members of Congress urged him [&#8230;]","url":"https://dailytimes.com.pk/1210174/biden-pushes-party-unity-as-he-resists-calls-to-step-aside/","image":"https://dailytimes.com.pk/assets/uploads/2024/07/Biden-pushes-party-unity-as-he-resists-calls-.jpg","video":null,"publish_date":"2024-07-20 21:59:28","author":"Republican Donald Trump,Sajid Salamat","authors":["Republican Donald Trump","Sajid Salamat"],"language":"en","catgory":"politics","source_country":"pk","sentiment":-0.137},{"id":252245342,"title":"Blinken points to wider pledges to support Ukraine in case US backs away under Trump","text":"Ukraine is on its way to being able to “stand on its own feet” militarily, Secretary of State Antony Blinken said Friday, noting that more than 20 other countries have pledged to maintain their own military and financial aid to the country even if the U.S. were to withdraw its support under a different president. Blinken for the first time directly addressed the possibility that former President Donald Trump could win the November election and back away from commitments to Ukraine. The U.S., under President Joe Biden, has been the most important supporter of Ukraine’s more than two-year battle against invading Russian forces. Trump’s public comments have varied between criticizing U.S. backing for Ukraine’s defense and supporting it, while his running mate, Sen. JD Vance, has been a leader of Republican efforts to block what have been billions in U.S. military and financial assistance to Ukraine since Russia invaded in 2022. Concerns among Ukraine and its supporters that the country could lose vital U.S. support have increased as Trump’s campaign surges and Biden’s falters. Trump and Ukrainian President Volodymyr Zelenskyy spoke on the phone Friday. “I noted the vital bipartisan and bicameral American support for protecting our nation´s freedom and independence,” Zelenskyy wrote on X, saying they agreed “to discuss at a personal meeting what steps can make peace fair and truly lasting.” Trump said on his social media platform that he appreciated Zelenskyy’s outreach and promised to “end the war that has cost so many lives and devastated countless innocent families.”","summary":"Ukraine is on its way to being able to &#8220;stand on its own feet&#8221; militarily, Secretary of State Antony Blinken said Friday, noting that more than 20 other countries have pledged to maintain their own military and financial aid to the country even if the U.S. were to withdraw its support under a different president. [&#8230;]","url":"https://dailytimes.com.pk/1210168/blinken-points-to-wider-pledges-to-support-ukraine-in-case-us-backs-away-under-trump/","image":null,"video":null,"publish_date":"2024-07-20 21:57:12","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","catgory":"politics","source_country":"pk","sentiment":0.026},{"id":252245188,"title":"J.D. Vance appears with Trump at Michigan rally as running mate for the first time, while supporters share their opinions on his VP candidacy","text":"J.D. Vance received a thunderous standing ovation from the MAGA supporters packing the Van Andel Arena in Grand Rapids, MI on Saturday as he made his debut on the campaign trail as Donald Trump’s running mate. He used his appearance to introduce himself to Republican voters with less than four months to go until election day and go on the attack against his opponent Vice President Kamala Harris. ‘What a cool thing it was to be asked by President Trump’s running mate and get out there on the campaign trail,’ Vance said kicking off his remarks. ‘There’s some bad news actually. The Vice President Kamala Harris, she doesn’t like me,’ he said, launching his own line of attacks that can be expected in the months to come between now and Election Day. Vance accused Harris of claiming he has ‘no loyalty’ to the country before touting his time in the Marine Corps. He also slammed her work in the Biden administration on the border. ‘She did serve as the border czar during the biggest disaster, open border we’ve ever had in this country,’ he claimed. ‘Let’s get President Trump back there, close down this border and bring back some common sense of security to this country,’ he said. The event in Grand Rapids, Michigan was the first campaign rally Vance has appeared at since he joined the GOP ticket. The Ohio senator spoke just hours before Trump was set to take the stage as well. ‘We have never had an election where you have four years of one guy, four years of the other guy, and who could possibly reject the idea that four and a half years President Trump has been a hell of a lot better than four years of Joe Biden,’ Vance said. Vance came back out later to introduce Trump. Before their event, two planes were spotted at the airport including one for Vance as he sets out on the campaign trail. Trump named the conservative Ohio senator, veteran and best-selling author as his running mate on Monday afternoon during the Republican National Convention after months of speculation over who he would pick as his number two. The one-time Trump critic turned ardent supporter officially accepted the Republican vice presidential nomination at the convention in Milwaukee, WI on Wednesday night. He’s now working to introduce himself to Trump supporters and Independent voters with less than four months until election day. Some Republican officials told DailyMail.com that they see the 39-year-old MAGA favorite as a good choice to bring in young conservatives and as someone who could help the ticket erode the so-called blue wall in Pennsylvania, Michigan and Wisconsin. But many Trump supporters in Grand Rapids were still getting to know about the Ohio native and former venture capitalist who was only elected to the Senate less than two years ago. Those who knew of him were mostly familiar with his book ‘Hillbilly Elegy’ or had seen the 2020 Ron Howard movie based off it by the same name. ‘At first I didn’t know until he gave his speech, and I learned a little bit,’ said Denise Cook who drove to Grand Rapids from Portage, Indiana. ‘I’d already seen Hillbilly Elegy, and I just know I thought he was kind of young, but after watching his speech, he spoke so eloquently,’ she said, pointing to his convention acceptance speech on Wednesday. Gregory McPherson from Traverse City, MI was also familiar with Vance because of his book. ‘I think it’s perfect,’ he said of Trump’s choice. ‘I’ve followed J.D. Vance ever since his book came out and I believe he’s the strong American, believes in America and just the strength of what we can all be together.’ Denise Bontembo from Battle Creek, MI called Trump choosing Vance fantastic. ‘I’m from Ohio, he’s from Ohio. I’m an Ohio state fan, and I’m a marine,’ she explained. ‘He’s young, that will revitalize the party,’ she added. ‘I wasn’t really familiar with him. However, what I do know about him I do like,’ said Ben Casarez. ‘I like the fact that he could probably move forward in four more years. I think that there’s nothing that they can really dig up on him, but we need to keep this Trump thing moving.’ ‘I think it’s very interesting. He wasn’t on my radar. I know that he had been talked about. I had my picks that I wanted, but I’m happy with J.D. Vance,’ said Lisa Donlin from Kalamazoo. Ahead of the Trump rally in Michigan, the Biden campaign held a call where Democrats slammed the former president and Ohio senator’s visit to the state. ‘If there are two things we know about Michigan voters: it’s first, they don’t like Buckeyes, and they don’t like politicians who want to rip away their reproductive freedom and JD Vance is both,’ said Democratic Michigan Senator Debbie Stabenow, noting the senator’s anti-abortion record.","summary":"Internewscast Journal\n\nInternewscast\n\n\nJ.D. Vance received a thunderous standing ovation from the MAGA supporters packing the&#8230;\n\n\nThis Post: J.D. Vance appears with Trump at Michigan rally as running mate for the first time, while supporters share their opinions on his VP candidacy first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/j-d-vance-appears-with-trump-at-michigan-rally-as-running-mate-for-the-first-time-while-supporters-share-their-opinions-on-his-vp-candidacy/","image":"https://i.dailymail.co.uk/1s/2024/07/20/20/87573759-13654869-image-a-43_1721505186974.jpg","video":null,"publish_date":"2024-07-20 21:56:16","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.029},{"id":252247272,"title":"Workplace habit of 'coffee badging' prompts reported new policy at Amazon","text":"CTVNews.ca Top Stories Workplace habit of 'coffee badging' prompts reported new policy at Amazon The term 'coffee badging' has gained some new significance this week with multiple outlets reporting Amazon is allegedly taking measures to counter the workplace trend it refers to. Trudeau and family head to British Columbia for vacation in unnamed location Prime Minister Justin Trudeau will head to British Columbia on Sunday, where he will be on vacation with his family until Aug. 1. A 12-year-old girl is accused of smothering her younger cousin over an iPhone A 12-year-old girl in Tennessee has been charged with murder, accused of smothering her eight-year-old cousin as the younger girl slept. A relative said they had been arguing over an iPhone. 'I took a bullet for democracy': Trump holds first rally after assassination attempt Donald Trump is holding his first campaign rally since he survived an attempted assassination, returning to the battleground state of Michigan alongside his new running mate. Democratic consensus solidifies around Harris, should Biden step aside No one quite knows what the process of picking a new nominee would be if Joe Biden did step aside – but many Democrats say that any process is likelier than ever to quickly end with Vice President Kamala Harris as the nominee. Here are the signs you're ready to downsize your home Amid the cost-of-living crisis, many Canadians are looking to find ways to save money, such as downsizing their home. But one Ottawa broker says there are several signs to consider before making the big decision. investigation investigation | Prominent Vancouver lawyer accused of moving criminal cash dies before hearing Vancouver lawyer Michael Bolton likely defended thousands of people over 50 years of practice. But in the end, he would not get a chance to defend himself. Israeli military says it has struck several Houthi targets in Yemen in response to attacks The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day. Quebec woman's death warns of dangers of cosmetic surgery abroad Brian McConnell's daughter, Florence McConnell, died after a liposuction surgery complication in Morocco. Now, he warns others against undergoing cosmetic surgeries abroad. Canada Stranger sexually assaulted Surrey woman while she was asleep in her home, RCMP say A woman in Surrey's Newton neighbourhood woke up to a stranger groping her early Saturday morning, according to local police. ‘It looks scary, but they’re harmless’: Bees removed from Winnipeg street light A swarm of bees living in a lamppost in Winnipeg’s Sage Creek neighbourhood has found a new home for its hive. LCBO confirms strike over, stores to reopen Tuesday The Liquor Control Board of Ontario (LCBO) and the union representing 10,000 of its workers reached a tentative agreement Saturday, clearing the way for stores to open Tuesday. Newfoundland RCMP charge 71-year-old man with impaired driving after head-on collision kills two Mounties in Newfoundland say a 71-year-old man is facing charges today related to his alleged involvement in a collision that killed two women in January. How B.C.'s firefighting smokejumpers take 'ultra-extreme and make it seem mundane' Standing on the edge of an open aircraft hatch, a smokejumper in a pale yellow suit steadies himself before rocking back then swinging out the door and vanishing as gravity takes over. investigation investigation | Prominent Vancouver lawyer accused of moving criminal cash dies before hearing Vancouver lawyer Michael Bolton likely defended thousands of people over 50 years of practice. But in the end, he would not get a chance to defend himself. World Trump releases letter on injury, treatment after last week's assassination attempt Donald Trump's campaign released an update on the former U.S. president's health Saturday, one week after he survived an attempted assassination at a rally in Butler, Pa. Israeli military says it has struck several Houthi targets in Yemen in response to attacks The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day. 'Didn't bother nobody:' U.S. postal worker killed while delivering mail A mail carrier was fatally shot while walking a route in Chicago, authorities said. Investigators at the U.S. Postal Service are offering up to US$250,000 for tips that solve the case. Beyond Biden, Democrats are split over who would be next: Harris, or a 'mini primary' As Democrats churn over whether U.S. President Joe Biden should stay in the 2024 race, the party turmoil is deepening over whether his Vice-President Kamala Harris is next in line for the job or if a 'mini primary' should be quickly launched to choose a new nominee before the party's August convention. 'I took a bullet for democracy': Trump holds first rally after assassination attempt Donald Trump is holding his first campaign rally since he survived an attempted assassination, returning to the battleground state of Michigan alongside his new running mate. Scammers trying to exploit global tech outage, cybersecurity agencies warn As the world continues to recover from massive business and travel disruptions caused by a faulty software update from cybersecurity firm CrowdStrike, malicious actors are trying to exploit the situation for their own gain. Politics Trudeau and family head to British Columbia for vacation in unnamed location Prime Minister Justin Trudeau will head to British Columbia on Sunday, where he will be on vacation with his family until Aug. 1. What a Donald Trump presidency means for Canada The most striking thing about walking the floor of the Republican National Convention (RNC) is seeing just how much this is Donald Trump's party, CTV News' Vassy Kapelos says. Ottawa says it has 'taken note' of UN court call for end to Israeli settlements The federal government says it has 'taken note' of a ruling from the top UN court that called Israel's presence in the occupied Palestinian territories unlawful. Health Steam cleaners, kids' helmets, multivitamins: Here are the recalls of the week Health Canada issued recalls for various items this week, including steam cleaners, hedgehog pet food, kids' bike helmets and multivitamins. Quebec woman's death warns of dangers of cosmetic surgery abroad Brian McConnell's daughter, Florence McConnell, died after a liposuction surgery complication in Morocco. Now, he warns others against undergoing cosmetic surgeries abroad. WeCook ready-to-eat meatball dish recalled over possible Listeria contamination The Canadian Food Inspection Agency is recalling a WeCook ready-to-eat meatball dish due to possible Listeria contamination. Sci-Tech July's full buck moon will peak in time for the Apollo 11 lunar landing anniversary July's full moon will shine bright in the sky this weekend — and lands near the anniversary of a special lunar event worth celebrating. A faulty software update causes havoc worldwide for airlines, hospitals and governments A faulty software update caused technological havoc worldwide on Friday, grounding flights, knocking media outlets offline, and disrupting hospitals, small businesses and government offices. The breadth of the outages highlighted the fragility of a digitized world dependent on just a few providers for key computing services. Love at first sight? AI making it even harder to detect romance scams As more people look to find love on dating apps and social media these days, so too are those looking to commit romance scams as artificial intelligence makes it harder to know what's real and what isn't. Entertainment Daughter of Stan Rogers performing in musical dedicated to his songs “Stan Rogers: A Matter of Heart” is a musical production focused on the songs and stories of the famed Canadian performer running in the Island Theatre Festival on P.E.I. in July and August. Rapper Sean Kingston and his mother indicted on federal charges in $1M fraud scheme Rapper and singer Sean Kingston and his mother have been indicted in South Florida on federal charges of committing more than $1 million worth of fraud. Cheng Pei-pei, 'queen of martial arts' movies, dead at 78 Actress Cheng Pei-pei, best known for her martial arts roles in films such as 'Come Drink with Me' and 'Crouching Tiger, Hidden Dragon,' has died. She was 78. Business Workplace habit of 'coffee badging' prompts reported new policy at Amazon The term 'coffee badging' has gained some new significance this week with multiple outlets reporting Amazon is allegedly taking measures to counter the workplace trend it refers to. Canada's airports, hospitals begin returning to normal after global IT outage Canada’s airports, hospitals and police services are still returning to normal operations a day after a defective update to computers using Microsoft Windows caused a global technology outage. A downtown apartment for $1,200 a month? Here is one group’s plan on how Toronto can rethink its vacant office space A Canadian think-tank has a plan to keep young people from fleeing urban centres in search of more affordable accommodations. Lifestyle Here are the signs you're ready to downsize your home Amid the cost-of-living crisis, many Canadians are looking to find ways to save money, such as downsizing their home. But one Ottawa broker says there are several signs to consider before making the big decision. Workplace habit of 'coffee badging' prompts reported new policy at Amazon The term 'coffee badging' has gained some new significance this week with multiple outlets reporting Amazon is allegedly taking measures to counter the workplace trend it refers to. Data shows more travellers seeking unique experiences for vacation More people are seeking out unique experiences for their vacation, according to travel consultant and expert Onanta Forbes from Travel Time. She says there has been a surge in travellers wanting to stay in interesting accommodations such as farms, domes and container homes. Sports Wally Buono to receive Wall of Fame honour from Calgary Stampeders When Wally Buono steps onto the field at McMahon Stadium on Sunday, he’ll soak in every moment in front of family, friends and fans. Already an Olympic medallist, Montreal judoka Beauchemin-Pinard is hungry for more in Paris A bronze medallist at the Tokyo Olympics in 2021 who also won silver at the 2022 world championships, 30-year-old Catherine Beauchemin-Pinard has a bachelor's degree in accounting and is on track for a specialized graduate diploma in taxation. Japan women's gymnastics captain out of Paris Games for smoking Shoko Miyata, the 19-year-old captain of the Japan women's artistic gymnastics team, has withdrawn from the squad for the Paris Games after violating the team's code of conduct by smoking, the Japanese Gymnastics Association said on Friday. Autos Stellantis warns of battery fires in Chrysler Pacifica hybrid minivans Stellantis is warning the owners of more than 2,900 hybrid minivans in Canada to stop charging their vehicles and park them outdoors, away from buildings and other cars, due to the risk of battery fires. Ford to produce F-Series pickups at Oakville plant starting in 2026 Ford Motor Co. says it plans to assemble its F-Series Super Duty pickup trucks at its Oakville, Ont., assembly plant starting in 2026, adding capacity of up to 100,000 additional units. Toronto traffic has reached crisis level, poll data reveal Toronto traffic has reached the point of a congestion crisis, according to the Toronto Region Board of Trade, whose new numbers warn of a significant impact on the city’s economy. Local Spotlight 'Powerful symbol of the progress we have made': Land being returned to Manitoba Métis Federation Around 100 acres of Manitoba Crown Land near the Saskatchewan border is being returned to the Métis community. Cape Breton moose hunting suspended for 3 years due to 'significant' drop in population Nova Scotia is suspending the licensed Cape Breton moose hunt for three years due to what the province is calling a “significant drop” in the population. What Canadian dog owners need to know before crossing the border Canadian pet owners visiting the United States will soon have to follow new rules, including requiring their dogs be microchipped. Social media prank could lead to charges after teens allegedly damage homes A well-known childhood prank known as 'nicky nicky nine doors,' or 'ding dong ditch,' has escalated into a more serious game that could lead to charges for some Surrey, B.C. teens. Benefit concert to be held for N.B. teen badly injured in 'freak accident' It's been more than a month since their good friend was seriously hurt in an accident and two teens from Riverview, N.B., are still having a hard time dealing with it. Here's what happens to rejected Halifax bridge coins Halifax bridges have collected thousands of coins from around the world. Video shows B.C. grizzly basking in clawfoot tub A donated clawfoot bathtub has become the preferred lounging spot for a pair of B.C. grizzly bears, who have been taking turns relaxing and reclining in it – with minimal sibling squabbling – for the past year. Cemetery 'investigators' connecting families with forgotten gravestones A pair of cemetery investigators are cleaning and preserving as many gravestones they have permission to work on, as they conduct their research and document gravestones. 'Just so grateful': B.C. man uses Google Lens to reunite woman with lost family heirloom After more than three years, a B.C. woman has been reunited with a lost family heirloom. Vancouver Stranger sexually assaulted Surrey woman while she was asleep in her home, RCMP say A woman in Surrey's Newton neighbourhood woke up to a stranger groping her early Saturday morning, according to local police. Lions Gate Bridge, Stanley Park Causeway closed after 'serious collision' A major thoroughfare in Vancouver has been shut down in both directions Saturday afternoon due to a “serious collision,” authorities say. 'A celebration of diversity': Surrey Fusion Festival showcases city's many cultures Thousands of people are making their way to Surrey's Holland Park this weekend for the 17th annual Surrey Fusion Festival. Toronto LCBO confirms strike over, stores to reopen Tuesday The Liquor Control Board of Ontario (LCBO) and the union representing 10,000 of its workers reached a tentative agreement Saturday, clearing the way for stores to open Tuesday. Baby dies after pregnant woman fatally struck by vehicle in downtown Toronto A woman fatally struck by a sedan in downtown Toronto earlier this week was pregnant, and her baby has also died, police say. House fire in North York leaves 65-year-old woman dead A 65-year-old woman is dead after being pulled from a two-alarm house fire in North York Saturday morning. Calgary Wally Buono to receive Wall of Fame honour from Calgary Stampeders When Wally Buono steps onto the field at McMahon Stadium on Sunday, he’ll soak in every moment in front of family, friends and fans. 14 residences, 10 commercial properties impacted by new Montgomery water main break: City A new water main break that took place close to the feeder main break that has restricted residents water use since early June is impacting 14 residences, the city said Saturday. Fiestaval Latino heats up Olympic Plaza One of Calgary’s Latin festivals drew the crowds downtown for a weekend of music, food and fun. Ottawa Ottawa teacher facing sexual assault charges involving minor, police looking for other victims The Ottawa Police Service says a teacher is facing charges related to alleged sexual assaults involving a minor under the age of 18. What's happening in Ottawa this weekend: July 19-21 CTVNewsOttawa.ca looks at things to do in Ottawa this weekend. Ottawa mother raising awareness on importance of donating umbilical cord blood An Ottawa mother is raising awareness on the benefits of donating her baby’s umbilical cord blood to the Canadian Blood Services after she was born in May. Montreal Montreal woman feels scared after seeing drone outside her bedroom window It's not something you like to see when you're in your apartment, laying in bed in your underwear on a hot summer day: a drone hovering outside your window. Trendy Griffintown pizzeria's permits suspended after Quebec liquor board ruling Moretti Pizzeria in Montreal's Griffintown neighbourhood, that was no stranger to police stops, fights and organized crime member visits has has its permits suspended for 25 days following a ruling from the liquor control board (RACJ). Montreal Shakespeare company ready to hit a park near you Repercussion Theatre's travelling Shakespeare in the park is ready for another big production in the Montreal area. Edmonton Alberta town takes action fighting crime, addressing homelessness, addictions issues In Cold Lake, Alta., drivers leaning through windows at the McDonald’s drive-thru have been ambushed by people running by and snatching food right out of their hands. 2 people found dead in western Alberta river: RCMP Two people were found dead after going missing in the Smoky River in west-central Alberta. More northern Alberta communities evacuated as hot windy weather drives extreme fire behaviour Residents of two more northern Alberta communities were forced to leave their homes Saturday due to an encroaching wildfire. Atlantic Newfoundland premier says crew members on missing fishing boat found alive Newfoundland and Labrador Premier Andrew Furey said on social media early Saturday morning that the entire province is \"relieved\" to learn the crew aboard the Elite Navigator has been found alive. Becca Told Me to Ride marks its fourth year In honour of Rebecca Schofield, over 50 bikers headed out on the road Saturday for the fourth Becca Told Me to Ride. Halifax Pride parade back in full-force The Halifax Pride parade returns after being cancelled in 2023. Winnipeg ‘It looks scary, but they’re harmless’: Bees removed from Winnipeg street light A swarm of bees living in a lamppost in Winnipeg’s Sage Creek neighbourhood has found a new home for its hive. 'We're famous for our skies': The science behind a Manitoba sunset To catch a glimpse of a beautiful sunrise or sunset is one of the great wonders of nature. Winnipeg police arrest man found asleep in stolen vehicle A Winnipeg man is facing a number of charges after police found him sleeping at the wheel of a stolen vehicle Friday morning. Regina Health inspectors investigate conditions at motel after another family complains about bedbugs Health inspectors are investigating conditions at a motel in Regina used by Social Services for emergency accommodations. It come after another family complained about being attacked by bedbugs. Riders get back in win column with victory over Bombers The Saskatchewan Roughriders remained dominant on defence as they held Winnipeg to only field goals for points on Friday night in their 19-9 victory. Lawson Aquatic Centre hosting diving championships this weekend The Lawson Aquatic Centre is playing host to some of the best young divers in the country for the National Canadian Junior Development Championships. Kitchener Third annual Scotland's Yard Road Hockey Classic returns to Kitchener Excitement and energy filled the air Saturday as the third annual Scotland's Yard Road Hockey Classic made its much anticipated return to Kitchener. LCBO confirms strike over, stores to reopen Tuesday The Liquor Control Board of Ontario (LCBO) and the union representing 10,000 of its workers reached a tentative agreement Saturday, clearing the way for stores to open Tuesday. Rockwood man killed in Highway 7 crash Ontario Provincial Police are investigating a fatal collision involving a 78-year-old Rockwood man. Saskatoon Saskatoon's bus rapid transit gets a new name A new transit system meant to change the way people move around Saskatoon is beginning to take shape. Phone lines still down at all Saskatoon leisure centres, outdoor pools after IT outage Saskatoon residents seeking to beat the heat at a leisure centre or outdoor pool this weekend should be aware that phone booking is unavailable. Fundraiser launched to help family return Sask. drowning victim to India A GoFundMe page has been set up to support the family of Yuren Patel, a 23-year-old man who drowned at Waskesiu Lake in Prince Albert National Park last week on Sunday. Northern Ontario Sudbury police investigating arson after speed camera set on fire Six speed cameras set up around Greater Sudbury have drawn a lot of ire from residents, attracting some vandalism and police are now investigating after one was set on fire overnight. Fatal motorcycle crash in northern Ont. A 60-year-old has died following a motorcycle crash Thursday at the intersection of Highway 17 and Second Avenue in the Greater Sudbury community of Coniston on Thursday. Defence for Sault murder suspect to argue he was not mentally competent The defence lawyer for Steven Jones plans to argue that he was not mentally competent when a victim was stabbed to death and a second was seriously injured. London LCBO confirms strike over, stores to reopen Tuesday The Liquor Control Board of Ontario (LCBO) and the union representing 10,000 of its workers reached a tentative agreement Saturday, clearing the way for stores to open Tuesday. Hazmat response to north London, Ont. apartment complex Circumstances around a deceased individual in an apartment raise concerns for first responders. Overnight ED closure in Wingham The emergency department at Wingham’s hospital will be closed from 9 p.m. Saturday until 7 a.m. Sunday. Barrie LCBO strike over, local employees react to decision While employees still picketed in front of closed LCBO stores on Saturday, many were optimistic as a tentative deal to end the strike was reached between the LCBO and the Ontario Public Service Employees Union (OPSEU). Local leaders take part in annual dunk tank fundraiser Local municipal leaders attended the annual dunk your local leader's event on Saturday. Tall Pines Music and Arts Festival returns to Gravenhurst The Tall Pines Music and Arts Festival returned to Gravenhurst on Saturday. Windsor LCBO confirms strike over, stores to reopen Tuesday The Liquor Control Board of Ontario (LCBO) and the union representing 10,000 of its workers reached a tentative agreement Saturday, clearing the way for stores to open Tuesday. Bringing Kabaddi Cup to WFCU Centre raises sport to 'another level' in Windsor After being held outdoors last year, the Windsor Kabaddi Cup returned for its second annual edition this weekend inside the WFCU Centre. The Windsor Kabaddi Cup featured 60 players divided into six teams of 10, competing in the traditional Indian team sport. Paws on stage: Windsor theatre group holds dog auditions for Christmas musical A theatre group in Windsor is holding auditions for an upcoming Christmas musical production — but this time, the stars vying for the spotlight are of the four-legged variety. Vancouver Island Trudeau and family head to British Columbia for vacation in unnamed location Prime Minister Justin Trudeau will head to British Columbia on Sunday, where he will be on vacation with his family until Aug. 1. How B.C.'s firefighting smokejumpers take 'ultra-extreme and make it seem mundane' Standing on the edge of an open aircraft hatch, a smokejumper in a pale yellow suit steadies himself before rocking back then swinging out the door and vanishing as gravity takes over. Victoria's plan to better enforce daytime sheltering rule will fail, advocates say Outreach workers say the City of Victoria shouldn’t bother developing a plan to better enforce its bylaw against daytime sheltering. They say enforcing the rule won’t work because there’s nowhere for people to go. Kelowna 2 dead after serious crash on Highway 1 in B.C. Interior Two people are dead after a serious crash that shut down Highway 1 near Sorrento, B.C. Saturday morning. Structures lost to Shetland Creek wildfire as more heat, thunderstorms strike parts of B.C. The number of wildfires in British Columbia has flared as more lightning storms bring the potential for further fire starts. How B.C.'s firefighting smokejumpers take 'ultra-extreme and make it seem mundane' Standing on the edge of an open aircraft hatch, a smokejumper in a pale yellow suit steadies himself before rocking back then swinging out the door and vanishing as gravity takes over. Lethbridge Outdoor workers doing best to stay cool despite heat wave Most people will do everything they can to stay inside or find some shade during this heat wave but for some that just isn't an option. 'No plan': Accused in Coutts murder-conspiracy trial denies plot to kill police Chris Carbert brought guns and body armour to the Coutts blockade, but says there was no plan for violence unless he had to perhaps flee to the mountains and fend off someone trying to give him a COVID-19 vaccine shot. Lethbridge police concerned about 'bait-and-switch tactic' on social media Lethbridge police are warning the public over what they're calling a \"bait-and-switch tactic\" being used by scammers who are posting on social media about phony alerts about missing children, seniors and pets. Sault Ste. Marie ‘I Got Caught Wearing My Life Jacket': Provincial police advocating for safety in and around the water As part of National Drowning Prevention Week, Ontario Provincial Police is reminding people to be safe while in and around water and to remember their lifejackets. Provincial police cleared in incident where mentally distressed suspect shot twice by northern Ont. officer Provincial police in northern Ontario have been cleared in an incident where a 35-year-old man was injured while being arrested on a Mental Health Act warrant in Thessalon, Ont. Sault women raise money to send soccer jerseys to kids in Africa A pair of soccer moms in Sault Ste. Marie have rallied the community around a good cause. N.L. Essential workers allowed to return to Labrador City as wildfire eases Newfoundland and Labrador Premier Andrew Furey called it a 'good news day' as he announced some Labrador City residents will be allowed to return home after a wildfire forced an evacuation last week. Newfoundland RCMP charge 71-year-old man with impaired driving after head-on collision kills two Mounties in Newfoundland say a 71-year-old man is facing charges today related to his alleged involvement in a collision that killed two women in January. Newfoundland premier says crew members on missing fishing boat found alive Newfoundland and Labrador Premier Andrew Furey said on social media early Saturday morning that the entire province is \"relieved\" to learn the crew aboard the Elite Navigator has been found alive. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks I'm Fairly Certain You’ll Never Drive Without This Car Phone Mount Again (And It's On Sale Right Now) If You Have No Idea What To Get Them For Their Birthday, Try One Of These Gifts Prime Day Is A Few Weeks Away, But You Can Already Snag These 30+ Deals On Amazon Canada Home 12 Of The Best Outdoor Rugs You Can Get Online Right Now How to Keep Your Yard Looking Its Best This Summer This Best-Selling Geedel Cheese Grater Deserves All Your Attention Gifts 20 Brilliant Gifts You'll Want To Order For Yourself, Too 19 Foolproof Gifts For Kids That Cost Less Than $50 21 Kitchen Goodies And Gifts For The Foodie In Your Life (Or Yourself) Beauty If You're On The Hunt For A Retinol Serum, Here Are 15 That Reviewers Are Loving Right Now If You Want To Ditch Your Heavy Foundation For Summer, Here Are The Best Tinted Moisturizers You Can Get Online Right Now The Maybelline Instant Age Rewind Concealer Is A Tried-And-True Reviewer Favourite — And Here's Why Deals Amazon Prime Day May Be Over, But You Can Still Take Advantage Of These 70+ Amazing Deals Amazon Prime Day Is Almost Over — Here Are 100+ Of The Best Deals And Discounts You Can Still Snag Amazon Prime Day Deal: You Can Get This 23andMe+ Premium Membership Bundle For 50% Off Right Now Stay Connected","summary":"The term 'coffee badging' has gained some new significance this week with multiple outlets reporting Amazon is allegedly taking measures to counter the workplace trend it refers to.","url":"https://www.ctvnews.ca/business/workplace-habit-of-coffee-badging-prompts-reported-new-policy-at-amazon-1.6971788","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/7/20/woman-with-coffee-cup-1-6971795-1721512034475.jpg","video":null,"publish_date":"2024-07-20 21:47:00","author":"Megan DeLaire","authors":["Megan DeLaire"],"language":"en","source_country":"CA","sentiment":-0.208},{"id":252247730,"title":"Kamala Harris hits fundraising trail amid ongoing calls for Biden to leave race","text":"U.S. Vice President Kamala Harris will headline a fundraiser in Massachusetts on Saturday as President Joe Biden faces continued pressure from fellow Democrats and big money donors to end his floundering campaign. Biden and top aides on Friday vowed to continue with the campaign, even as major donors signalled they were unwilling to open their checkbooks unless the 81-year-old president stepped aside. The crisis of confidence in Biden's ability to win the November 5th election has placed a huge spotlight on Harris, widely believed to be the most likely replacement if he steps down. Her fundraising events, including the one on Saturday in Provincetown, Massachusetts, are getting added interest from donors who want to signal they are willing to coalesce around her potential bid for the White House, according to three Democratic fundraisers. The fundraiser, expected to fetch $2 million, is being hosted by celebrity wedding planner Bryan Rafanelli and is expected to draw some 800 people, according to a source familiar with the planning. Transportation Secretary Pete Buttigieg is expected to speak at the event, with celebrities and singers such as Jennifer Coolidge, Billy Porter and Darren Criss among the guests, the source said. Thirty-five congressional Democrats, representing more than 10 per cent of the party's members in Congress, have now publicly called on Biden, who is isolating at his Delaware home with a case of COVID-19, to drop out following a disastrous debate last month against Republican former President Donald Trump that raised questions about the incumbent's ability to win the election or carry out his duties for another four years. Biden's doctor on Saturday said the president still has mild COVID-19 symptoms, such as a cough and hoarse voice, but his vital signs are normal and he continues to perform his duties. Democratic former President Bill Clinton and former U.S. Secretary of State Hillary Clinton have privately been supportive of Biden's decision to stay in the race and have been actively encouraging donors to stay with him, NBC News reported on Saturday, citing two sources familiar with the matter. Separately, U.S. Representative Mark Takano of California on Saturday became the latest Democratic congressman to call on Biden to step aside as a presidential candidate. Biden's campaign hoped to raise some $50 million in big-dollar donations in July for the Biden Victory Fund but was on track for less than half that figure as of Friday, according to two sources familiar with the fundraising efforts. The campaign called reports of a July fundraising slump overstated, noting that it anticipated a drop-off in large donations due to vacations. It said the campaign still has 10 fundraisers on the schedule this month. Harris assured major Democratic donors on Friday that the party would prevail in the presidential election as more lawmakers called for Biden to stand down. \"We are going to win this election,\" she said on a call arranged on short notice to calm donors, according to a person on the call. \"We know which candidate in this election puts the American people first: Our president, Joe Biden.\" Harris attended the call \"at the direct request of senior advisers to the president,\" one of the people said, an account confirmed by another person familiar with the matter.","summary":"Biden and top aides on Friday vowed to continue with the campaign, even as major donors signalled they were unwilling to open their checkbooks unless the 81-year-old president stepped aside.","url":"https://www.breakingnews.ie/world/kamala-harris-hits-fundraising-trail-amid-ongoing-calls-for-biden-to-leave-race-1652307.html","image":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjNcXFwvMDVcXFwvMjcwNzQyMTBcXFwvYzdkMjA4MzItYWFmNS00OWEwLWFlZTEtYzhmMTdkNDExYjk3LmpwZ1wiLFwid2lkdGhcIjo3MDAsXC","video":null,"publish_date":"2024-07-20 21:44:44","author":"BreakingNews.ie,Michael Bolton","authors":["BreakingNews.ie","Michael Bolton"],"language":"en","catgory":"politics","source_country":"ie","sentiment":-0.104}]}