{"offset":0,"number":50,"available":9189,"news":[{"id":252556978,"title":"Navy SEALs who were dismissed for religious objections to the COVID vaccine achieve a significant victory over the Biden administration.","text":"Thousands of Navy SEALs and service members negatively impacted by President Joe Biden’s COVID-19 vaccine mandate scored a major win in court after a years-long legal battle. The mandate enacted in August 2021 led to the forced firing of over 8,000 service members who refused the shot on religious or medical grounds. Navy SEALs and other special operators suffered professional setbacks for refusing the vaccine, despite having their religious accommodation requests denied multiple times. They were fired, denied trainings to advance in rank and, in some cases, even forced by the military to repay their initial signing bonuses between $4,000 and $7,000. SEALs and other special operations warfare troops were also told they would have to pay back the cost of their training by the federal government – hundreds of thousands of dollars – and hand over their hard-earned ‘Trident’ pin. According to the settlement first obtained by DailyMail.com, service members who quit the Navy after being ‘mistreated’ will have their records corrected. In addition, the Navy also ‘agreed to post a statement affirming the Navy’s respect for religious service members.’ The military will provide ‘more training’ for the actual commanders who review religious accommodation requests as well as change their policy. Lastly, the government will pay $1.5 million in attorneys’ fees that accumulated over nearly four years of litigation. ‘This has been a long and difficult journey, but the Navy SEALs never gave up,’ Danielle Runyan, senior counsel at First Liberty Institute told DailyMail.com. ‘We are thrilled that those members of the Navy who were guided by their conscience and steadfast in their faith will not be penalized in their Navy careers.’ First Liberty and Hacker Stephens LLP secured the settlement on behalf of the troops that was accepted by the United States District Court Northern District of Texas Fort Worth Division on Wednesday. Heather Gebelin Hacker added that it is a ‘hard-fought but significant victory.’ A spokesperson for the Navy referred DailyMail.com to the Department of Justice for comment which did not immediately respond. Earlier this year, over 200 active duty and retired service members vowed to hold the Biden administration accountable for ‘trampling’ on their rights by enforcing the COVID-19 vaccine mandate. Over 200 service members declared that they will do ‘everything’ in their power to get accountability since not a single leader has resigned or been held to account despite the rollback of the vaccine mandate last year. In a letter obtained by DailyMail.com, the current and former troops accuse Biden’s military brass of ‘continuing to ignore’ their pleas to correct the ‘injuries and laws that were broken.’ They are threatening to even force Biden’s top leaders to be brought out of retirement so they can be court-martialed and held to account. ‘While implementing the COVID-19 vaccine mandate, military leaders broke the law, trampled constitutional rights, denied informed consent, permitted unwilling medical experimentation, and suppressed the free exercise of religion,’ the letter states. It goes on to say both service members and their families were ‘significantly harmed’ and their ‘suffering continues to be felt financially, emotionally, and physically.’ ‘Some service members became part of our ever-growing veteran homeless population, some developed debilitating vaccine injuries, and some even lost their lives,’ the letter continues. The mandate was eventually rescinded in the December 2022 defense authorization bill, but it did not reinstate service members who were fired for not receiving the shot nor provide any other compensation. In the open letter, they explicitly name now-retired and still serving top commanders that they are demanding accountability from. Those include the former Chairman of the Joint Chiefs of Staff Gen. Mark Milley who exited the military in October and Gen. James McConville who served as the 40th chief of staff of the Army until 2023. ‘These individuals enabled lawlessness and the unwilling experimentation on service members,’ they state. ‘The moral and physical injuries they helped inflict are significant. They betrayed the trust of service members and the American people. Their actions caused irreparable harm to the Armed Forces and the institutions for which we have fought and bled.’ They have ‘refused to resign’ or take any accountability for their actions, the service members state. The letter goes on to mutually pledge to hold them to account through ‘lawful word and action.’ The Army recently was under scrutiny for attempting to win back favor with soldiers who were fired after declining the COVID-19 vaccine for religious or medical reasons, offering a ‘correction of military records.’ But the letter sparked an outcry of fury at the Defense Department by lawmakers and current and former service members who said there was always a process in place to do just that. Since the mandate, Army has also faced a huge shortage of recruits in fiscal year 2022 at 55,000 – which was 10,000 short of its target for the year. Congress is also working to further remedy the wrongs that these service members faced, but many soldiers have told DailyMail.com that it is just the start. In the most recent National Defense Authorization Act (NDAA), which passed a year later in December 2023, there is a provision allowing former service members who were fired to change their discharge status. But some current and former troops are saying that the amendments in the FY 2024 NDAA are not strong enough to undo the ‘serious harassment’ they endured over the last two years. John Frankman, who was in the Special Forces as part of the Green Berets, said that the ‘missed career opportunities’ he endured over the last two years could never be undone by any action of Congress. Another active-duty Army officer previously told DailyMail.com that the fired troops have had ‘their lives turned upside down and were betrayed by those charged with protecting them.’ And a formal apology from their service branches would be key to be able to have trust restored, he added.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThousands of Navy SEALs and service members negatively impacted by President Joe&#8230;\n\n\nThis Post: Navy SEALs who were dismissed for religious objections to the COVID vaccine achieve a significant victory over the Biden administration. first appeared on Internewscast Journal","url":"https://internewscast.com/politics/navy-seals-who-were-dismissed-for-religious-objections-to-the-covid-vaccine-achieve-a-significant-victory-over-the-biden-administration/","image":"https://i.dailymail.co.uk/1s/2024/07/24/23/87717269-13668593-Navy_SEALs_and_other_special_operators_suffered_professional_set-a-2_1721861965729.jpg","video":null,"publish_date":"2024-07-25 00:08:51","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.322},{"id":252556942,"title":"US President Joe Biden uses Oval Office address to explain his decision to drop out of the presidential race","text":"The West Australian Perth Now Click to open navigation ‌‌ News Chevron Down Icon Breaking News Western Australia National World Technology Opinion Weather Sport Chevron Down Icon AFL Olympics Cricket Soccer Basketball Tennis NRL Rugby Motor Racing MMA Golf Netball Cycling Entertainment Chevron Down Icon Confidential Movies Best Short Film Television Music Reviews Books Competitions Business Chevron Down Icon Breaking News Economy Markets Property Commercial Property Workplace Matters Lifestyle Chevron Down Icon Food Personal Finance Health Parenting Fashion Travel Home & Garden Relationships Stars Real Estate HUH? Local News Chevron Down Icon North Central South Mandurah Competitions Find My Paper Digital Editions Shop Now Read your local paperNews to your inbox Camera IconUS President Joe Biden addresses the nation to explain his decision not to seek re-election.Credit: White House/White House breaking US President Joe Biden uses Oval Office address to explain his decision to drop out of the presidential race Max CorstorphanThe Nightly July 25, 2024 8:07AM Comments TopicsPoliticsWorld News US President Joe Biden has spoken from the Oval Office in the White House, addressing his decision to not run for re-election. “My fellow Americans, I’m speaking to you tonight from behind the Resolute Desk in the Oval Office, in this sacred space,” Mr Biden said. “I’m surrounded by portraits of extraordinary American presidents. “Thomas Jefferson wrote the immortal words that guide this nation. George Washington, who showed us presidents are not kings. Abraham Lincoln, who implored us to reject malice. Franklin Roosevelt, who inspired us to reject fear. “I revere this office, but I love my country more. It’s been the honour of my life to serve as your president. But in the defence of democracy which is at stake, I think it’s more important than any title. “I draw strength and I find joy in working for the American people. But this sacred task of perfecting our union is not about me. “It’s about you. Your families, your futures. “I believe my record as president, my leadership in the world, and my vision for America’s future all merited a second term. “But nothing, nothing can come in the way of saving our democracy. That includes personal ambition. So I’ve decided the best way forward is to pass the torch to a new generation.” It is Mr Biden’s first public address since his announcement via social media on Sunday that he had ended his bid for a second term and was endorsing Vice President Kamala Harris. Biden has kept a low profile since last week when he came down with a COVID-19 infection and went into isolation at his private residence in the state of Delaware. More to come... - With AAP Share to Facebook Share to Twitter Email Us Copy the Link Register and have your say. Register to comment Already have an account? Log in Book nowDelve into the world of aviation and leadership as the Hon Dr Brendan Nelson AO shares how he steers the aerospacegiant’s strategy in key international markets. From around the site OnlineHorror reason couple nearly lost $350k ‘A trip to emergency’10 year-old’s DEADLY find in Woolies spaghetti TravelMajor airline unveils luxurious new business class suites Violent attackBrown sued for $76m over 'brutal’ assault of concertgoers Your Local News Share to TwitterShare to FacebookShare to InstagramShare to YoutubeEmail UsGet Digital Edition Book nowDelve into the world of aviation and leadership as the Hon Dr Brendan Nelson AO shares how he steers the aerospacegiant’s strategy in key international markets. Perth Now Email UsNewsletter Chevron Down IconSubmit story tip Camera IconSubmit photos Get Digital EditionDigital edition Chevron Down IconBack to top Follow Us Share to FacebookShare to TwitterShare to InstagramShare to YoutubeGet Digital EditionEmail Us About Us Contact Us Careers Letter to the Editor Place an Ad Privacy Policy Code of Conduct Editorial Complaints Terms of Use Cookie Settings © West Australian Newspapers Limited 2024 News Sport Entertainment Business Lifestyle Shop Now Privacy Policy Code of Conduct Editorial Complaints Terms of Use Cookie Settings Subscribe to the Paper Read your PerthNow Local Newspaper Advertise on PerthNow Our Partners Real Estate View Healthengine Huddle Insurance Carbar CarExpert Raiz Invest Institchu Starts at 60 MoneyMe Iseekplant The Nightly The West Australian 7plus 7NEWS TV Guide Streamer","summary":"US President Joe Biden is speaking from the Oval Office in the White House, addressing his decision to not run for re-election. ","url":"https://www.perthnow.com.au/politics/us-president-joe-biden-uses-oval-office-address-to-explain-his-decision-to-drop-out-of-the-presidential-race-c-15471467","image":"https://images.perthnow.com.au/publication/C-15471467/be6c4332e1365c54b7f59671011de879d981800f-16x9-x0y3w2665h1499.jpg?imwidth=1200","video":null,"publish_date":"2024-07-25 00:07:17","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","catgory":"politics","source_country":"au","sentiment":0.52},{"id":252556976,"title":"Joe Biden to Explain Decision to Hand Over Leadership to Younger Generation","text":"Joe Biden will say the “best way forward is to pass the torch to a new generation” in the US president’s first public remarks since he announced he would not seek a second term in office. In a speech to the nation on Wednesday evening, Biden will say: “The defence of democracy is more important than any title. I draw strength, and find joy, in working for the American people,” according to prepared remarks shared by the White House. “But this sacred task of perfecting our union is not about me,” the president will add. “It’s about you.” The rare public address from the Oval Office, coming with just over 100 days to go until November’s presidential election, will be Biden’s first appearance since he announced at the weekend that he was suspending his re-election campaign and endorsing vice-president Kamala Harris to run in his place. Biden has avoided the public eye since he was diagnosed last week with Covid-19 and went to recover at his Delaware holiday home. He returned to the White House on Tuesday but held no public events until his address. The president will make clear that while he was not seeking re-election, he intended to serve out the remainder of his term. “Over the next six months I will be focused on doing my job as president,” Biden will say. “That means I will continue to lower costs for hard-working families and grow our economy. I will keep defending our personal freedoms and our civil rights — from the right to vote — to the right to choose.” “The great thing about America is here, kings and dictators do not rule. The people do,” he will add. “History is in your hands. The power is in your hands. The idea of America — lies in your hands.” Biden will face several foreign policy challenges in his final months in office. He is set to hold a high-stakes meeting at the White House on Thursday with Israeli Prime Minister Benjamin Netanyahu. The Biden administration is pressing to get a Gaza ceasefire deal over the line in what would be a significant foreign policy achievement that would burnish the president’s legacy. Biden’s decision not to run for re-election marks the beginning of the end of a storied career in Washington that has spanned more than half a century. First elected to the US Senate in 1972, he spent more than three decades in the upper chamber of Congress before serving two terms as Barack Obama’s vice-president, from 2009 to 2017. Biden’s departure from the presidential race means Harris is set to face off against Donald Trump at the ballot box. National opinion polls suggest a tight race, with Trump having a slight edge with just over three months to go until election day. Additional reporting by Felicia Schwartz and Steff Chávez in Washington","summary":"Internewscast Journal\n\nInternewscast\n\n\nUnlock the US Election Countdown newsletter for free Joe Biden will say&#8230;\n\n\nThis Post: Joe Biden to Explain Decision to Hand Over Leadership to Younger Generation first appeared on Internewscast Journal","url":"https://internewscast.com/business/joe-biden-to-explain-decision-to-hand-over-leadership-to-younger-generation/","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fwww.ft.com%2F__origami%2Fservice%2Fimage%2Fv2%2Fimages%2Fraw%2Fhttps%253A%252F%252Fd1e00ek4ebabms.cloudfront.net%252Fproduction%252F4c69afbf-8615-415d-935e-d1c8378d430d.jpg%3Fsource%3D","video":null,"publish_date":"2024-07-25 00:05:48","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.011},{"id":252556954,"title":"Biden defends passing the torch to Harris as he gives first speech since dropping out of race","text":"President Joe Biden told Americans he chose to drop out of the 2024 presidential race in order to unite the nation. “I have decided the best way forward is to pass the torch to a new generation,” Biden said Wednesday in his first official address to the nation since announcing his campaign withdrawal. “That is the best way to unite our nation.” The Oval Office address comes days after Biden announced in a letter that he would leave the presidential race and throw his support behind Vice President Kamala Harris, amid mounting pressure from Democratic Party members. Wednesday evening, the president spoke from behind his Oval Office desk and emphasized the importance of Americans deciding the future of the country, not him. “I draw strength, and find joy, in working for the American people. But this sacred task of perfecting our Union is not about me. It’s about you. Your families. Your futures. It’s about ‘We the People’,” Biden said. He encouraged voters to take the power of the future in their hands and vote for a democratic future – something he has continuously warned Trump will not respect. Both Biden and Harris have raised concerns that Trump will implement drastic changes to the executive branch, consolidating power and installing loyalists over civil servants – an aspect of Project 2025. “The defense of democracy is more important than any title,” Biden said during his primetime address. Biden has already endorsed Harris as the Democratic presidential nominee. Since announcing his withdrawal, Democratic leaders such as Chuck Schumer, Hakeem Jeffries, Nancy Pelosi, Elizabeth Warren, Hillary Clinton and more have also endorsed Harris. Within 24 hours, Harris surpassed the 1,976 delegates needed for the nomination in a first round of voting among Democratic delegates. Biden also addressed his plans for the next six months of his presidency, saying he would continue working toward the goals he set for his administration like lowering costs for working class families, growing the economy and defending civil rights.","summary":"President Joe Biden warned Americans about the future of democracy in November","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-oval-office-speech-election-race-b2585490.html","image":"https://static.independent.co.uk/2024/07/24/23/SEI213921843-1.jpg?width=1200","video":null,"publish_date":"2024-07-25 00:05:37","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","source_country":"gb","sentiment":0.144},{"id":252556980,"title":"Before attacking former President Trump, the shooter looked up information about JFK’s assassination.","text":"JACKSONVILLE, Fla. – The man who shot former President Donald Trump researched details of Lee Harvey Oswald and the JFK assassination before opening fire on Trump at a Pennsylvania rally. This revelation came to light today during a congressional hearing where FBI Director Christopher Wray provided new details about the assassination attempt. Wray revealed that the shooter, Thomas Crooks, had early access to the rally site before Trump took the stage. Newly released video shows the rooftop where Thomas Crooks attempted to assassinate Trump. An unidentified agent can be heard on body camera video. “I believe the sniper that was seen in pictures was inside that building there, so that’s the sniper who sent the original pictures, he’s the guy who saw him near the bike.” an agent said. In the video, law enforcement discusses spotting Crooks before losing sight of him. “Detain those guys, find out what they know. I’m trying to get good information,” an agent said. Wray testified before a congressional committee today that Crooks fired 8 shots within five seconds from his father’s AR-15 rifle. He also said that two hours before the rally, Crooks launched a drone to conduct surveillance of the rally site, approximately 200 yards from the stage. “We have discovered a drone that the shooter used, and it’s being analyzed by the FBI lab,” Wray said. “We think he was livestreaming the event, two hours before the event, yes.” Investigators noted the drone was in the air for approximately 11 minutes, with Crooks watching the live stream on his phone. Wray also revealed that Crooks was prepared for more damage with explosive devices. “We’ve discovered three devices (explosive), two in his vehicle and one at his residence,” Wray said. A search of Crooks’ digital devices showed he researched news stories and images of several prominent political figures, including Trump and President Joe Biden. Wray cautioned that the motive behind the attempted assassination is still not fully understood. News4JAX also spoke with Scott Erickson who is the Director of the Center for Law and Justice at the America First Policy Institute. Erickson has more than 20 years of experience in both state and federal law enforcement. “The Secret Service has a no-fail mission, which means they can’t fail,” Erickson said. “There are no exceptions to that. Clearly, there was a failure, and it was quite catastrophic. If you don’t have sufficient resources, and you know there are gaps, you shouldn’t move forward with the event, or you need to take necessary steps to secure that before proceeding.” Erickson expressed confidence that federal investigators will determine the reasons behind the security failures. Wray also mentioned an Iranian plot to assassinate former President Trump, warning that law enforcement agencies might see more brazen attacks from Iran in the future.","summary":"Internewscast Journal\n\nInternewscast\n\n\nJACKSONVILLE, Fla. – The man who shot former President Donald Trump researched&#8230;\n\n\nThis Post: Before attacking former President Trump, the shooter looked up information about JFK&#8217;s assassination. first appeared on Internewscast Journal","url":"https://internewscast.com/news/before-attacking-former-president-trump-the-shooter-looked-up-information-about-jfks-assassination/","image":"https://www.news4jax.com/resizer/v2/TR7ZCQ747BABDNYJQEXGBGX3M4.jpg?auth=82bf5ee89e06253f287fcdd28619dd65769136ded17b9e46e667cccb133ab2d1","video":null,"publish_date":"2024-07-25 00:03:53","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.313},{"id":252556726,"title":"I ran in Democratic primaries for 25 years — the Kamala Harris coronation is a betrayal","text":"In 1968, I ran as a Democrat in my first primary election, as I sought to become a New York state Assemblyman. I fought four more tough primary races against fellow Democrats David Dinkins and Robert Wagner Jr. as we vied to become Manhattan borough president, and yet another in 1985 against Ken Lipper to become City Council president. In every primary I had to work my butt off to prove myself to my party and my constituents. Those races made me a better public servant and a better man. That’s what the democratic process is for — and what the Democratic Party is all about: testing our candidates through primary contests and giving our voters a voice. This is not happening with Kamala Harris. And it’s one of the reasons the Democratic Party will lose to Donald Trump in November. If they actually wanted to live up to their name, Democratic leaders would insist on an open convention where delegates could freely select a presidential nominee in Joe Biden’s place. Instead, Harris is getting a free ride from the media and from many in her party: Those who failed to pass Biden off as competent are now highly motivated to try to position Harris as someone who’s qualified to be president. The anti-Trump press is ready to deify her, Hollywood donors are poised to fill her coffers, and the left is going all out to maintain their power. Only one problem: Harris is utterly unqualified for the job. Harris was one of the worst vice presidents in history, an abject failure at virtually every task except for casting tie-breaker voters for big spending bills that caused the inflation we’re all suffering through. Her first assignment was to fix the border, but she never did. Instead, she fixed it for the left — letting millions of unauthorized immigrants pour into this country and then backing free healthcare for them all. She has no foreign-policy experience, with a background as a California “prosecutor” and less than a full term in the US Senate. She has not been tested on the national stage in any serious way and got zero votes as a failed presidential candidate. She is turning her back on our democratic ally Israel, even as it faces attacks on three sides from Iranian proxies who are holding Americans hostage. Her stance only gives comfort to Hamas and signals the continuation of weak-kneed pro-Iran policies. This week, in her first speech as a 2024 candidate, she promised massive new spending programs. As a senator, she backed the full $10 trillion Green New Deal. So a vote for Harris is a vote for spending that could kick off another round of inflation, continued open borders costing us billions, higher energy prices and electric vehicle mandates. There isn’t a left-wing idea out there that Harris has not supported, from the transgender agenda to banning private health insurance altogether. Her idea of freedom is joining a union, not fostering American individualism and innovation. Her idea of the future is expanded government handouts for virtually everything. Despite Harris’ trademark cackle, her election would be no laughing matter. All of the flaws and mistakes of the Biden-Harris administration will be magnified if the veep makes it to the Oval Office. She is nothing but the Great Pretender, the sequel. Donald Trump has had to survive false accusations of racism, fines meant to bankrupt him, partisan lawsuits in an attempt to jail him, an assassin’s bullet — and now even a second presidential opponent, after demolishing his first one. Don’t be fooled by all the Harris hype: She is nothing but a new mask for the left, a failed vice president who in nearly four years on the job never did anything to distinguish herself. As an elected Democratic official for 25 years, I could not in good conscience vote for Kamala Harris. I would have to vote for Donald Trump. Andrew Stein, a Democrat, served as New York City Council president,1986-94.","summary":"The Democratic Party is all about testing candidates through primary contests and giving voters a voice, but Kamala Harris is doing an end-run around those principles.","url":"https://nypost.com/2024/07/24/opinion/the-kamala-harris-coronation-betrays-democrats-values/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-b64m8t6zb-1721861517726.jpg?quality=75&strip=all&1721847237&w=1200","video":"https://cdn.jwplayer.com/videos/Po2IN1dl-RyIcpnTz.mp4","publish_date":"2024-07-25 00:00:10","author":"Andrew Stein","authors":["Andrew Stein"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.267},{"id":252556988,"title":"Watch: Biden explains his decision to exit presidential race","text":"[The stream is slated to start at 8 p.m. ET. Please refresh the page if you do not see a player above at that time.] President Joe Biden will deliver a speech from the Oval Office to explain his decision to drop out of the presidential race against former President Donald Trump, and to lay out his plan for the remaining months of his term. It is the first time Biden has addressed the nation since exiting the race and endorsing Vice President Kamala Harris to replace him. The president returned to Washington on Tuesday after quarantining at his Delaware beach house with Covid-19. Subscribe to CNBC on YouTube.","summary":"President Biden was isolating with Covid-19 when he announced his decision to drop out of the race against Donald Trump.","url":"https://www.cnbc.com/2024/07/24/watch-biden-oval-office-address-exit-race.html","image":"https://image.cnbcfm.com/api/v1/image/108005874-1721002207103-108005874-17210021222024-07-15t000723z_168186846_rc2av8axmxxj_rtrmadp_0_usa-election-trump-biden.jpg?v=1721002544","video":null,"publish_date":"2024-07-24 23:50:29","author":"Rebecca Picciotto","authors":["Rebecca Picciotto"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.034},{"id":252556442,"title":"Donald Trump shifts focus to ‘radical left extremist’ Kamala Harris at first rally after Biden’s exit","text":"Donald Trump declared victory over Joe Biden on Wednesday evening and promised thousands of adoring fans in North Carolina that there’d be no more Mr Nice Guy as he promised he would make Kamala Harris his next victim. He took a lap of honor at his first rally since Biden dropped out of the race and unveiled his new attack strategy for Harris. And he laughed off reports that he was a changed man after coming within an inch of being assassinated. ‘I was supposed to be nice. They say something happened to me when I got shot,’ he said at a sports arena in Charlotte. ‘I became nice. ‘When you are dealing with these people you can’t afford to be nice. So if you don’t mind I’m not going to be nice.’ This election was meant to be boring: Two old, when men squaring off just like they did in 2020. But Trump has already survived an assassination attempt and now he is adjusting to a new contest. Biden is gone, after sensationally dropping out Sunday, and he must now recalibrate to take on the first black woman (in all likelihood) to be her party’s nominee. ‘As you know three days ago we officially defeated the worst president in the history of our nation,’ he said setting off a deafening roar from more than 10,000 supporters. ‘So now we have a new victim to defeat, lying Kamala Harris.’ He ran down her record as a prosecutor in California, derided her work on immigration and claimed the ‘fake news’ had quickly changed its tune on a vice president that it previously wrote off as ineffective. ‘Everything Kamala touches turns into a total disaster,’ he said. ‘Check out San Francisco: 20 years ago it was the greatest city in our country. Now it is unliveable.’ His supporters think the change of candidate changes little in the race, even as Harris’s campaign reports an avalanche of cash and volunteers. ‘It would be OK if it were just her,’ said Susan Putnam, a retired office worker, as she waited for Trump to appear. ‘But it’s not. She’ll have the deep state behind her.’ The race is likely to be tight. A Reuters/Ipsos poll completed on Tuesday showed Harris with a two-point lead over Trump, 44 percent to 42 percent, although other polls have shown the former president narrowly ahead. North Carolina voted narrowly for Trump in the past two elections. However, Democrats see it as a potential pickup and the state’s term-limited governor, Roy Cooper, is among the possible running mates being considered by Harris. His campaign and allies have pivoted rapidly to attacks on the vice president, tying her to the administration’s struggles to tame inflation and a crisis at the border. A super PAC launched TV ads on Monday, accusing Harris of covering up Biden’s obvious mental decline. ‘But Kamala knew Joe couldn’t do the job, so she did it,’ says the narrator of the ad, funded by MAGA Inc. ‘Look what she got done, a border invasion, runaway inflation, the American Dream dead. They created this mess. They … no, Kamala owns this failed record.’ And on Tuesday, Trump said the switch in candidates held no fear for him. He said her campaign for president imploded in 2020. ‘So if she campaigns that way now and this is only going to be tougher, although she does have a lot of support from the fake news. There’s no question about that,’ he told reporters on a briefing call. ‘But if she campaigns the way she campaigned then, you know, I suspect she won’t be too tough.’ The change in candidate has provided a fillip to Democrats too. The Harris campaign on Wednesday said it has raised $126 million since Sunday, with 64% of donors making their first contribution of the 2024 campaign. Harris held her first rally since becoming the likely nominee a day earlier in Milwaukee, where she warned that Trump would take the nation ‘backward.’ ‘Do we want to live in a country of freedom, compassion and rule of law, or a country of chaos, fear and hate?’ she asked.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump declared victory over Joe Biden on Wednesday evening and promised&#8230;\n\n\nThis Post: Donald Trump shifts focus to &#8216;radical left extremist&#8217; Kamala Harris at first rally after Biden&#8217;s exit first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/donald-trump-shifts-focus-to-radical-left-extremist-kamala-harris-at-first-rally-after-bidens-exit/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Donald-Trump-turns-his-attention-to-radical.jpg","video":null,"publish_date":"2024-07-24 23:48:43","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.255},{"id":252556920,"title":"Trump attacks Harris on immigration in first rally since Biden exit","text":"WASHINGTON >> Republican presidential candidate Donald Trump today attacked his new Democratic rival Kamala Harris as the “ultra-liberal driving force” who should be held responsible for the Biden administration’s policies on immigration. “As border czar, Kamala threw open our borders that allowed 20 million illegal aliens to stampede into our country from all over the world,” Trump said at a North Carolina rally, his first since President Joe Biden bowed out of the race at the weekend. Biden put Harris in charge of working with countries in Central America to help stem the tide of migration, but she was not given responsibility for border security nor was she named “border czar.” To the roars of the crowd, the former president described Vice President Harris as the most liberal politician ever elected in American history. “She will destroy our country if she ever gets elected,” the former president said at the event, held in Charlotte, North Carolina, one of a handful of battleground states considered crucial to winning the Nov. 5 presidential election. Harris, the first Black woman and Asian American to serve as vice president, would become the first woman elected president if she prevails on Nov. 5. In the three days since Biden dropped out, she has shaken up a staid race and sparked new energy among Democrats. Trump’s rally began two hours before Biden, 81, is to address the nation from the Oval Office to explain why he dropped out of the race under mounting pressure from fellow Democrats. His decision followed a disastrous June debate with Trump that exacerbated questions about his ability to win the election or to serve another four years if he succeeded. “I have decided the best way forward is to pass the torch to a new generation. That is the best way to unite our nation,” Biden will say, according to excerpts of his planned address released by the White House. Biden plans to say that he intends to focus on his work as president in the six months left in his term. “That means I will continue to lower costs for hard-working families and grow our economy. I will keep defending our personal freedoms and our civil rights – from the right to vote – to the right to choose,” according to his prepared remarks, outlining some themes that Harris is expected to build her campaign around. The president returned to Washington on Tuesday afternoon after isolating with COVID at his home in Delaware, where he made the announcement that he was ending his campaign. Earlier today, the 59-year-old vice president called on a rally of more than 6,000 Black women in Indianapolis to help her revitalize the Democratic campaign. The Democratic National Committee’s rules committee agreed today on a plan to formally nominate Harris as soon as Aug. 1 — before the party’s Aug. 19-22 convention in Chicago — with Harris picking a running mate by Aug. 7. Harris spoke at an event in Indianapolis hosted by the Zeta Phi Beta Sorority, which was founded at Howard University, the historically Black college she attended. She hopes to tap sororities’ multi-generational network of Black women — who played an important role in Biden’s 2020 victory — to deliver strong voter turnout for Democrats again in November. “I thank you. And now, in this moment, our nation needs your leadership once again,” Harris said. Harris and Trump are closely competitive, public opinion polls showed this week. A Reuters/Ipsos poll completed on Tuesday showed Harris with a marginal two-percentage-point lead over Trump, 44% to 42%. A CNN poll conducted by SSRS showed Trump leading Harris, 49% to 46%. Both findings were within the polls’ margins of error. BIDEN TO SPEAK Trump, coming off a triumphant week in which his party unified around his presidential bid after a failed assassination attempt two weekends ago, has had to watch as Biden’s sudden departure from the race shifted the narrative and sparked a surge of attention toward Harris at his expense. Hillary Clinton, the 2016 Democratic nominee who lost to Trump, said in an opinion piece in the New York Times, that she was excited about the Harris candidacy. “She represents a fresh start for American politics. She can offer a hopeful, unifying vision. She is talented, experienced and ready to be president. And I know she can defeat Donald Trump,” Clinton said. Harris campaign chair Jen O’Malley Dillon said in a memo made public today that Democrats would aim to compete in the swing states of Michigan, Wisconsin, Pennsylvania, North Carolina, Georgia, Arizona and Nevada, opening up a map that in the final weeks of Biden’s campaign had appeared to be more focused on the Midwest. “This race is more fluid now – the vice president is well-known but less well-known than both Trump and President Biden, particularly among Dem-leaning constituencies,” O’Malley Dillon wrote. The Harris campaign today said it has raised $126 million since Sunday, with 64% of donors making their first contribution of the 2024 campaign. Additional reporting by Trevor Hunnicutt, Susan Heavey and Jarrett Renshaw.","summary":"WASHINGTON >> Republican presidential candidate Donald Trump today attacked his new Democratic rival Kamala Harris as the &#8220;ultra-liberal driving force&#8221; who should be held responsible for the Biden administration&#8217;s policies on immigration.","url":"https://www.staradvertiser.com/2024/07/24/breaking-news/trump-attacks-harris-on-immigration-in-first-rally-since-biden-exit/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240724_brk_tru01.jpg","video":null,"publish_date":"2024-07-24 23:45:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.053},{"id":252556464,"title":"Pentagon to review 20 Medals of Honor from Wounded Knee Massacre","text":"Defense Secretary Lloyd Austin directed the Pentagon to review the 20 Medals of Honor awarded to U.S. troops for their actions at Wounded Knee in 1890, when soldiers killed and injured between 350 and 375 Lakota men, women and children. Austin ordered the creation of a special panel to determine whether to retain or rescind the medals, the Department of Defense announced Wednesday. In a July 19 memorandum ordering the review, Austin said the panel would investigate “each awardee’s individual actions” and also “consider the context of the overall engagement.” “It’s never too late to do what’s right,” an unnamed senior defense official said in a statement Wednesday. “And that’s what is intended by the review that the secretary directed, which is to ensure that we go back and review each of these medals in a rigorous and individualized manner.” The killings, referred to as the Wounded Knee Massacre, occurred Dec. 29, 1890, near Wounded Knee Creek in South Dakota. It was part of a larger effort by the U.S. government to repress Native American tribes of the Great Plains and eradicate a religious movement known as Ghost Dance. Reports about the Ghost Dance movement prompted the U.S. Army to guard reservations. On Dec. 29, 1890, troops from the 7th Cavalry were confiscating weapons from Lakota people when a struggle with a reportedly deaf man sparked a chaotic one-sided firefight. When the smoke cleared, dozens of cavalry troopers were wounded or killed by friendly fire — likely from their artillery — and hundreds of Lakota were dead. For their actions that day, 20 cavalrymen were awarded the Medal of Honor, the nation’s highest military honor. Austin’s memorandum lists the recipients, along with short descriptions of why each man received a medal. One citation says a recipient showed distinguished conduct “in a battle with hostile Indians.” Another says one man “voluntarily led a party into a ravine to dislodge Sioux Indians concealed therein.” A few citations said troops had rescued their fellow soldiers, and some said only that the men exhibited “extraordinary gallantry.” Congress officially apologized for the massacre around its 100th anniversary in 1990, but it did not rescind the medals then. In 2022, Congress approved a measure encouraging the Pentagon to review the awards. The panel reviewing the Medals of Honor will comprise five experts, including two from the Department of the Interior, Austin’s memo states. The panel is expected to submit a report to Austin by Oct. 15 with recommendations for each recipient, and then Austin will take those recommendations to President Joe Biden. When reviewing the awards, panelists will consider the context at the time and use the military’s 1890 standards for awarding the Medal of Honor, rather than today’s standards. Panelists will determine whether any of the soldiers did anything disqualifying them from the award, which includes intentionally directing an attack against someone who surrendered in good faith, murdering or raping a prisoner or engaging in any other act “demonstrating immorality,” Austin’s memo reads. The U.S. Army was ordered to hand over all historical documentation about the massacre, including personnel files for the awardees, by Friday. The Pentagon noted that this isn’t the first time Medals of Honor have come under scrutiny. In 1916, Congress ordered the Army to review all Medals of Honor awarded since the Civil War. At that time, a panel of five retired generals decided to rescind 911 of the awards. Six of those medals were later reinstated. This story was produced in partnership with Military Veterans in Journalism. Please send tips to MVJ-Tips@militarytimes.com.","summary":"A panel of five experts will determine by Oct. 15 whether the medals should be retained or rescinded.","url":"https://www.marinecorpstimes.com/news/pentagon-congress/2024/07/24/pentagon-to-review-20-medals-of-honor-from-wounded-knee-massacre/","image":"https://www.marinecorpstimes.com/resizer/zNuxP6MJu8XMpyYKYe5ZSk2KSfs=/1024x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/archetype/YAWVDLMTZFCWZKZXTXSAA5IEQA.jpg","video":null,"publish_date":"2024-07-24 23:44:57","author":"Nikki Wentling","authors":["Nikki Wentling"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.004},{"id":252556266,"title":"Trump calls Kamala Harris ‘radical left lunatic’, says she wants ‘execution’ of babies","text":"Donald Trump launched a volley of attacks against US Vice-President Kamala Harris Wednesday, calling her a “radical left lunatic” in his first rally since she became the de facto Democratic Party nominee for November’s election. In a speech claiming she was in favour of the “execution” of babies due to her stance on abortions, the former US president and Republican nominee said: “She is a radical left lunatic who will destroy our country.” “We’re not going to let that happen,” he told the crowd in North Carolina. Trump’s speech comes as Harris, 59, hits the campaign trail armed with US President Joe Biden’s endorsement – after his historic decision over the weekend not to seek re-election. The 78-year-old Republican repeatedly attacked Biden, 81, over his age but has been forced to pivot as he has now become the oldest nominee in history. Trump called Harris “the ultra liberal driving force behind every single Biden catastrophe”. He claimed that she wanted “abortions in the eighth and ninth month of pregnancy” as well as “right up until birth and even after birth, the execution of a baby”. To the roars of the crowd, Trump described Harris as the most liberal politician ever elected in American history. “She will destroy our country if she ever gets elected [as US president],” he said. “As border tsar, Kamala threw open our borders that allowed 20 million illegal aliens to stampede into our country from all over the world.” Biden put Harris in charge of working with countries in Central America to help stem the tide of migration, but she was not given responsibility for border security nor was she named “border tsar”. Harris, the first black woman and Asian-American to serve as US vice-president, would become the first woman elected president if she prevails on November 5. In the three days since Biden dropped out, she has shaken up a staid race and sparked new energy among Democrats. Trump’s rally began two hours before Biden addresses the nation from the Oval Office to explain why he dropped out of the race under mounting pressure from fellow Democrats. Saying Democratic Party bosses were behind Biden’s decision to step down, the Republican accused Harris of covering up Biden’s “mental unfitness”. Earlier in the day, the White House denied it had covered up any possible decline in Biden’s health before his decision to drop out of the election race. Harris and Trump are closely competitive, public opinion polls showed this week. A Reuters/Ipsos poll completed on Tuesday showed Harris with a marginal two-percentage-point lead over Trump, 44 per cent to 42 per cent. A CNN poll conducted by SSRS showed Trump leading Harris, 49 per cent to 46 per cent. Both findings were within the polls’ margins of error. The Democratic National Committee’s rules committee has agreed on a plan to formally nominate Harris as soon as August 1 – before the party’s August 19-22 convention in Chicago – with Harris picking a running mate by August 7. On Wednesday, Harris called on a rally of more than 6,000 black women in Indianapolis hosted by the Zeta Phi Beta Sorority to help her revitalise the Democratic campaign. She hopes to tap sororities’ multi-generational network of black women – who played an important role in Biden’s 2020 victory – to deliver strong voter turnout for Democrats again in November. “I thank you. And now, in this moment, our nation needs your leadership once again,” Harris said. Additional reporting by Reuters","summary":"The Republican US presidential candidate launched a string of attacks on his Democrat opponent in his first rally since Biden’s exit.","url":"https://www.scmp.com/news/world/united-states-canada/article/3271774/trump-calls-kamala-harris-radical-left-lunatic-says-she-wants-execution-babies","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/07/25/fdb42cf0-73c1-4bd4-a8fe-dafaf419ce97_6ae5b65b.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/22/web%20video.mp4","publish_date":"2024-07-24 23:40:46","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.215},{"id":252556308,"title":"Massachusetts Democratic Committee votes to endorse Kamala Harris for president","text":"Well that was fast. It took only a few days since President Joe Biden announced he was dropping out for the Massachusetts Democratic State Committee to unanimously endorse Kamala Harris for president. The state Dem committee on Wednesday evening met virtually and voted unanimously to back Harris as the 2024 Democratic nominee against former President Donald Trump. This came after a unanimous vote of endorsement of the Massachusetts delegates to the Democratic convention. “The message is clear: there is resounding support for Vice President Harris from Democrats here in Massachusetts and around the country,” Massachusetts Democratic Party Chair Steve Kerrigan said in a statement. “Our Party is united, energized, and ready to defeat Donald Trump and J.D. Vance this November,” he added. Harris has been endorsed this week by several elected officials in the Bay State, including Gov. Maura Healey, U.S. Sen. Elizabeth Warren, U.S. Sen. Ed Markey, and Members of Congress. State Committee Member Sharon Stout made the motion to endorse Harris. “Let us unite behind Vice President Harris,” said Stout, of Newton. “Let us give her our full endorsement and work tirelessly to ensure her victory. Together, we can make history. Together, we can build a stronger, fairer, more peaceful America for all.” Massachusetts will send 116 delegates to the Democratic convention in Chicago next month. Harris has already secured the support of enough Democratic delegates to become the nominee, according to an Associated Press survey, as top Democrats have rallied to her in the aftermath of Biden’s decision to drop his bid for reelection. Material from the Associated Press was used in this report.","summary":"The Massachusetts Democratic State Committee voted unanimously to back Kamala Harris as the nominee against former President Donald Trump.","url":"https://www.bostonherald.com/2024/07/24/massachusetts-democratic-committee-votes-to-endorse-kamala-harris-for-president/","image":"https://www.bostonherald.com/wp-content/uploads/2024/07/OCR-L-BIDEN-DELEGATES-0722.jpg?w=1024","video":null,"publish_date":"2024-07-24 23:40:39","author":"Rick Sobey","authors":["Rick Sobey"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.029},{"id":252556140,"title":"Everything we know about the Sonya Massey shooting","text":"Early in the disastrous July 6 encounter between Sonya Massey and now-terminated Sangamon County Sheriff’s Deputy Sean Grayson, she told the officer and his partner, “I love y’all, thank y’all.” Massey, who reportedly suffered from mental illness, had called 911 a few minutes before 1 a.m., asking for police to respond to her home in Springfield, Illinois. She told the dispatcher that she heard “banging” noises outside, and thought it might be a prowler. Roughly 30 minutes later, she lay dying on her kitchen floor. Here’s what we know about how things went down: Sonya Lynaye Wilburn-Massey was born February 12, 1988, in San Diego. The mother of two teenagers, Malachi Hill Massey and Jeanette Massey, “loved to do hair and spend time with her family,” according to her obituary. Massey had been diagnosed with paranoid schizophrenia, but was managing it with medication, her daughter said. At 12:49 a.m., Massey dialed 911 and says she is “hearing stuff” she finds suspicious, requesting police to “come and see” what is going on. Grayson and his partner, who has not been publicly identified, arrived at her house and use their flashlights to search the yard, bodycam footage shows. The officers knocked on Massey’s front door, but she didn’t answer until around 1:15 a.m., according to the footage. They found her to be “calm,” and “not aggressive,” although “perhaps unwell,” court records say. “Are you doing alright, mentally?” one asked. “Yes, I took my medicine,” Massey replied, according to the footage, which was captured by Grayson’s partner’s bodycam. (Grayson didn’t activate his own bodycam until after the shooting, according to prosecutors.) While Grayson’s partner checked out the rest of the small house, Grayson spotted a pot of water on the nearby stove and told Massey to shut it off. “We don’t need a fire while we’re here,” he says. In the chaotic moments that followed, Massey picked up the pot, which prompted Grayson and his partner to retreat. Massey asked where they’re going, to which Grayson said they are trying to get away from her “hot, steaming water.” A seemingly confused Massey then asked, “Away from the hot, steaming water? I’ll rebuke you in the name of Jesus.” Grayson reacted by drawing his weapon, shouting, “You better f*****g not! I swear to God, I’ll f*****g shoot you right in your f*****g face! Drop the fucking pot! Drop the fucking pot! Drop it!” At 1:21 a.m., Grayson fired three shots at Massey, killing her with a bullet to the face. His partner told him he is going to get his first-aid kit from their patrol car, but Grayson said that “it’s a headshot,” and “there’s nothing we can do.” Two minutes later, Grayson radioed the dispatcher and asked if police had previously been called to Massey’s home over mental health concerns. At one point, an officer—it is unclear whose voice it is—told dispatch that Massey’s gunshot wound was “self-inflicted.” Emergency medical crews and additional law enforcement units began to arrive, and at 1:47 a.m., Massey was taken to nearby HSHS St. John’s Hospital emergency room, where she is pronounced dead. Autopsy results released on July 8 by Sangamon County Coroner Jim Allmon say Massey died of a single gunshot wound to the head, and classified her death as a homicide. Three days after that, civil rights attorney Ben Crump announced he has been retained by the Massey family. On July 17, Grayson was indicted on first-degree murder charges. It later emerged that he has worked for six different law enforcement agencies over the past four years, which raised questions about his service record. It remains unclear why Grayson bounced around so frequently. The next day, Grayson pleaded not guilty and is denied bail. Massey’s funeral was held July 19. On Monday, authorities released the bodycam footage of Massey’s final minutes. A protest march followed a few hours later. On Tuesday, Illinois Gov. JB Pritzker met with the Massey family, and the Department of Justice opened its own investigation into the shooting. President Joe Biden issued a statement Monday, saying, “When we call for help, all of us as Americans – regardless of who we are or where we live – should be able to do so without fearing for our lives. Sonya’s death at the hands of a responding officer reminds us that all too often Black Americans face fears for their safety in ways many of the rest of us do not.” Massey’s loved ones, Biden went on, deserve justice. “I am heartbroken for her children and her entire family as they face this unthinkable and senseless loss. Jill and I mourn with the rest of the country and our prayers are with Sonya’s family, loved ones, and community during this devastating time.” In her own statement, vice president and presumptive Democratic presidential nominee Kamala Harris said, “Sonya Massey deserved to be safe. The disturbing footage released yesterday confirms what we know from the lived experiences of so many — we have much work to do to ensure that our justice system fully lives up to its name.” Sangamon County Sheriff Jack Campbell also issued a statement on Monday, lambasting Grayson for his deadly decision. “Grayson had other options available that he should have used,” Campbell said. “His actions were inexcusable and do not reflect the values or training of our office. He will now face judgment by the criminal justice system and will never again work in law enforcement. Ms. Massey needlessly lost her life, and her family deserves answers. I trust the legal process will provide them.”","summary":"Sean Grayson, the deputy who shot and killed Sonya Massey, “will now face judgment by the criminal justice system and will never again work in law enforcement,” according to Sangamon County Sheriff Jack Campbell.","url":"https://www.independent.co.uk/news/world/americas/sonia-massey-police-shooting-mental-illness-b2585416.html","image":"https://static.independent.co.uk/2024/07/24/21/Screenshot-2024-07-24-at-4.47.08%E2%80%AFPM.jpg?width=1200","video":null,"publish_date":"2024-07-24 23:39:17","author":"The Independent","authors":["The Independent"],"language":"en","source_country":"gb","sentiment":-0.341},{"id":252556178,"title":"DNC Rules Committee sets up nomination process for Chicago convention","text":"CHICAGO (WLS) — The Rules Committee for the Democratic National Convention met Wednesday to formalize the nomination process for the presidential nominee. All of this comes less than a month from the start of the DNC in Chicago The DNC is set to move forward with a virtual roll call vote, as it pushes ahead to choose a presidential nominee before the party gathers in Chicago next month. Vice President Kamala Harris is overwhelmingly favored to replace President Joe Biden at the top of the ticket. But, there is still time for other candidates to get into the race. Wednesday, members of the DNC Rules Committee took up a proposal on how to move forward. It would mean delegates could begin voting on the party’s presidential nominees as early as next week under a draft plan released by the DNC. The plans are to have it all finalized by Aug. 3, and maybe even sooner. It all depends on whether the Kamala Harris campaign momentum is enough to scare off any potential rivals. Harris gave the keynote speech to the Zeta Phi Beta sorority meeting in Indianapolis Wednesday, campaigning as the presumptive nominee. It comes one day after Harris told supporters at a rally in Milwaukee that she had already secured enough delegate support to win the nomination. Now, Harris is clearly focused on the White House, and not any potential rivals. “And we know, when we organize, mountains move; when we mobilize, nations change; and when we vote, we make history,” she said. The rules committee held a virtual meeting to vote on the formal ground rules for the nomination process. “As a party, we have an obligation to design and implement a fair nomination process for delegates to officially express their preferences through a vote,” said Jaime Harrison, Democratic National Committee chairman. Other interested candidates have until Saturday to declare their intention to seek the nomination. The virtual voting would then begin in early August for qualified candidates. With the momentum Harris has already established, it seems highly unlikely anyone else will run. A new CNN poll, conducted after Biden announced he was ending his reelection campaign and endorsing Harris, shows the vice president trailing Donald Trump 46-to-49%, with the margin of error making it a virtual tie. “So let us continue to fight with optimism, with faith and with hope. Because, when we fight, we win,” Harris said. The virtual nomination process has to be finished in time for the nominee to select a vice presidential running mate and get it certified before Aug. 7. That’s the date needed to qualify to get on the ballot in Ohio.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCHICAGO (WLS) &#8212; The Rules Committee for the Democratic National Convention met&#8230;\n\n\nThis Post: DNC Rules Committee sets up nomination process for Chicago convention first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/dnc-rules-committee-sets-up-nomination-process-for-chicago-convention/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-DNC-Rules-Committee-formalizes-nomination-process-ahead.jpg","video":null,"publish_date":"2024-07-24 23:37:04","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.181},{"id":252556182,"title":"Impact of Kamala Harris as President on Social Security","text":"() — Lawmakers have less than a decade to fix Social Security. Otherwise, millions of Americans will see their benefits slashed, yet both political parties have been reluctant to address the issue. With President Joe Biden out of the 2024 race, the focus has shifted to Vice President Kamala Harris, and many are wondering what a potential Harris presidency could mean for retirees. Both Harris and former President Donald Trump have vowed to protect Social Security but have so far offered few specifics on how they would change the program. As a senator, Harris co-sponsored the Social Security Expansion Act, which would have increased benefits for some and changed how annual cost-of-living adjustments (COLA) are calculated. It also would have required wealthy Americans to pay more into the system. A major Social Security overhaul would require bipartisan cooperation on Capitol Hill, but here’s what a Harris administration may push for: Extend payroll tax to the wealthy The Biden administration has said it will address the solvency issue by asking “the highest-income Americans to pay their fair share.” If Harris takes a similar approach, she’ll likely push for expanding the payroll tax to include higher incomes. Currently, the primary source of income for Social Security is a dedicated payroll tax, which is capped at $168,600 for 2024 — any income above that isn’t subject to the tax. Biden’s reform plan suggested expanding the payroll tax to include earnings above $400,000. The legislation Harris co-sponsored in 2019 would have applied the tax to income above $250,000. Polling suggests eliminating the tax cap would have broad support, with 79% of Republicans and 88% of Democrats in favor of the $400,000 proposal, according to a 2022 survey. Opponents of the idea argue that getting rid of the taxable maximum could weaken the link between the amount individuals pay in Social Security taxes and the amount they receive in retirement benefits, the Peter G. Peterson Foundation noted in an article. There are also concerns such a change would distort labor supply decisions more than the current payroll tax. It’s also worth noting that Biden’s 2020 campaign promise to raise taxes on the wealthy hasn’t happened. Changing the COLA formula Each year, Social Security benefits are reassessed and adjusted for inflation. The annual calculation often results in a cost-of-living adjustment (COLA), which is based on the Consumer Price Index for Urban Wage Earners and Clerical Workers (CPI-W). CPI-W reflects the spending patterns of everyday Americans, but some argue that a different measure would be more accurate for older adults. Earlier this year, Senate Democrats introduced a bill that would change the way the COLA is calculated so it takes into account the Consumer Price Index for Elderly Consumers (CPI-E). The senators said the CPI-E is more reflective of the actual costs incurred by older adults, in part because medical expenses are weighted more heavily. Changing the COLA calculation wouldn’t solve the long-term funding issue, but it could lead to a higher annual benefit increase because it usually grows faster than the CPI-W index. Harris’ 2019 legislation also called for that change, a sign she’s in favor of it. Raising the primary insurance amount The primary insurance amount (PIA) is the money a person receives if they start collecting retirement benefits at their normal retirement age. It’s calculated based on a person’s average indexed monthly earnings, which essentially summarize what you made over your career and adjusts for inflation. If implemented, the Biden-Harris plan from 2020 would have provided a benefit bump up for older beneficiaries. Under that proposal, the benefit would gradually increase between ages 78 and 82, then reach 5% by age 82 and beyond, according to the Penn Wharton Budget Model. Increased benefits for low earners Benefits are primarily based on what workers made over their careers, meaning lower lifetime earnings correspond to lower benefits. For those with extremely low earnings, there’s a floor in place called the “special minimum benefit.” The Biden-Harris 2020 proposal called for an increase to the special minimum benefit of 5% to 50% for long-term low-earners with work histories between 10 and 30 years. The bill Harris co-sponsored in 2019 also called for an increase to the minimum benefit, which would vary depending on how long a person was in the workforce. In 2019, about 32,000 of the 64 million Social Security recipients qualified for the minimum benefit.","summary":"Internewscast Journal\n\nInternewscast\n\n\n() — Lawmakers have less than a decade to fix Social Security.&#8230;\n\n\nThis Post: Impact of Kamala Harris as President on Social Security first appeared on Internewscast Journal","url":"https://internewscast.com/news/impact-of-kamala-harris-as-president-on-social-security/","image":"https://www.newsnationnow.com/wp-content/uploads/sites/108/2024/07/GettyImages-2162466794.jpg?w=900","video":null,"publish_date":"2024-07-24 23:35:13","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.178},{"id":252555998,"title":"Joe Biden’s Dem friends all jumped ship — and now we’re ‘left’ with Kamala Harris","text":"‘Left’ behind by Kamala We speak now of our temp US president and the one in-waiting. Beside her prime vision — to put Israel on life support — nothing’s behind that cackle. Joe and Jill have gone up the hill. So why’s this newie not banning migrants? Why’s our new playtime a fatal drug overdose? Why no escalator on Air Force One? What’s she think about crazy high food prices? Insurance premium hikes? High mortgage rates? Fatal drug overdoses? Bill O’Reilly asks about airline chaos, no prison for criminals, declining educational testing scores in schools. Until 20 minutes ago she was part of slowmoJoe snoozing or falling. Besides son Hunter’s trial, he and she bettered what? Liberal miceketeers Chuck, Nancy, Schiff, Clooney, schloomp Bernie Sanders jumped ship. Left is only Joe — our temporary shuffler-in-chief — whose wife supported her friend the Secret Service’s crackerjack lady boss — and who hangs on thinking she’s as well-dressed as Bess Truman and looks to be called “Doctor” — like Fauci. From Breitbart News, Kamala Harris’ far-left record: Co-sponsored legislation to protect immigrants being held in detention Supported taxpayer-funded coverage to illegal immigrants Supported decriminalizing illegal border crossings Wouldn’t treat illegal aliens as “criminals” Argued that temporarily closing the border violated federal law Backed the backers of Defund the Police Raised money for far-left’s Minnesota Freedom Fund, which bails out of jail violent criminals, including accused murderers and rapists Supported cuts to LA’s police department Supported 94 executive actions in Biden’s first 100 days — more than 50 rescinded Trump-era border security measures Backed Bernie Sanders’ Medicare for All legislation Backed banning private health insurance Compared ICE to the KKK Called adding more police to the streets “wrong” In their wake Summertime. People wearing whites, oranges, pinks, bright colors. One friend arrived in all-over black. Explanation? “I’m in mourning for my onetime beloved Republican party.” Setting starry stage in Newark This weekend. It’s Stephen Colbert and Paul Giamatti at a Montclair Film Festival-sponsored thing. Friday 8 p.m., New Jersey Performing Arts Center. Giamatti — from period pieces such as “12 Years a Slave” to being Oscar-nominated for “The Holdovers” — also co-hosts Webby-nominated podcast “Chinwag.” “Conversations,” he says, “that dive deep into the wilderness of the mind.” Doctor told a woman, age 80, she’s in perfect health. Woman: “It’s because I take birth-control pills for my headaches. My granddaughter’s 23. We have breakfast every morning. When she’s not looking, I stick the birth-control pill in her coffee. Right away it gets rid of my headache.” Only in New York, kids, only in New York.","summary":"We speak now of our temp US president and the one in-waiting. Beside her prime vision — to put Israel on life support — nothing’s behind that cackle.","url":"https://nypost.com/2024/07/24/opinion/joe-bidens-dem-friends-all-jumped-ship-and-now-were-left-with-kamala-harris/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-cwdck0hwz-1721862334841.jpg?quality=75&strip=all&1721848012&w=1200","video":null,"publish_date":"2024-07-24 23:33:50","author":"Cindy Adams","authors":["Cindy Adams"],"language":"en","source_country":"us","sentiment":0.16},{"id":252555906,"title":"Biden to deliver 1st remarks since dropping re-election bid. What to know","text":"U.S. President Joe Biden will deliver his first public remarks Wednesday evening since ending his campaign for a second term, where he is expected to lay out his reasoning and his goals for the rest of his presidency. Biden will speak in a primetime televised address from the Oval Office at 8 p.m. Eastern, delivering highly anticipated remarks that will also lay out his administrative record — a legacy Democrats now hope will be continued by Vice-President Kamala Harris, who Biden endorsed upon dropping out and has become the new presumptive nominee. “The president wants to build on those historical initiatives that he’s been able to get done,” White House press secretary Karine Jean-Pierre said Wednesday in previewing the speech. She pointed to sweeping domestic legislation, renewal of alliances abroad and other accomplishments Biden has achieved despite “a difficult political climate.” Harris, addressing the historically Black sorority Zeta Phi Beta in Indianapolis on Wednesday, previewed Biden’s remarks, saying, “He will talk about not only the work, the extraordinary work, that he has accomplished, but about his work in the next six months.” Biden made the shocking announcement he was ending his re-election bid in a letter posted to social media on Sunday, sending Democrats scrambling to find a new way forward with just over 100 days before the presidential election in November. The party quickly coalesced around Harris, with top lawmakers and a majority of delegates previously pledged to Biden offering their endorsements. The party also raised a record US$81 million in the 24 hours after Harris launched her campaign. That enthusiasm marked a rapid turnaround after three weeks of panic and growing calls for Biden to leave the race after the president’s disastrous debate performance last month, where Biden struggled to finish sentences and mount arguments against his Republican opponent Donald Trump. Over the ensuing 25 days, a growing number of Democratic lawmakers and notable party supporters made the case that Biden was no longer an effective candidate who could beat Trump, urging him to step aside. Donors stopped writing cheques, with some publicly stating they wouldn’t resume contributions until Biden was no longer the nominee. Biden at first remained defiant, including in high-profile interviews and press conferences where he defended his record and said only “the Lord Almighty” would convince him to drop his re-election bid. The campaign also insisted Biden was not leaving, including just hours before Biden issued his letter saying otherwise. Jean-Pierre, in her first briefing with reporters since last week, declined to answer many questions about what led to Biden’s decision, saying she did not want to get ahead of his remarks. She said the president met with “a small group of advisors” and his family on Saturday evening to weigh how to move forward, and let his staff know he was dropping out of the race moments before his written announcement Sunday afternoon. She also pushed back on suggestions Biden’s health led to his decision, and that it would inhibit his ability to serve the last six months of his term or even another four years. “I think it speaks to how honourable this president is, how selfless this president is, that he was able to make this decision and say, ‘This is not about me, this is about the American people, this is about the country,'” she said. “I think that speaks for itself.” Jean-Pierre also wouldn’t say if Harris would be more closely involved in the day-to-day business of running the country as she seeks to take over from Biden in the event she wins in November. “The president and the vice-president speak regularly, they see each other regularly,” she said. “The president is committed to being president and leading this country forward, in the way that he believes Americans want to see this country moving forward. And the vice-president is going to continue to be a critical partner. Nothing’s going to change in that.” Biden’s decision to end his candidacy also buoyed the spirits of congressional Democrats who had been fretting that the incumbent president would drag down their prospects of retaining the Senate and retaking the House of Representatives. Republicans, who currently control the House by a razor-thin majority, have already sought to undo some of the legislative achievements of the Biden administration — signaling they would further threaten Biden’s legacy with full control of Congress and the White House. —With files from the Associated Press","summary":"Biden will deliver a primetime televised address to the United States after dropping out of the 2024 election and endorsing his Vice-President Kamala Harris.","url":"https://globalnews.ca/news/10641276/biden-speech-us-campaign-harris/","image":"https://globalnews.ca/wp-content/uploads/2024/07/20240723110752-669fd1ff60536bd2ab34e72ajpeg_050b06.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2024-07-24 23:30:57","author":"Sean Boynton","authors":["Sean Boynton"],"language":"en","catgory":"politics","source_country":"ca","sentiment":0.07},{"id":252555848,"title":"Letters: Remaking U.S. | Back Harris | White wash | Rhetorical game | Free speech","text":"Republican effort to remake U.S. terrifies If you haven’t seen it, you might want to read the synopsis of Project 2025. Essentially it’s a manifesto for Donald Trump to take over every aspect of American lives, but only to benefit him and his loyalists. They plan to remove government employees and agencies. They have no regard for non-Whites, LGBTQ, abortions, women, foreigners and non-Trumpists. There will be no need for Congress or the Supreme Court because all decisions will come from the demagogue himself and his self-designed army. Was “1984” a primer for Trump? How much surveillance will there be? How many jails and holding camps will they build for all those in opposition? Will they restore a vigorous execution system? They want to end American democracy as we know it. If you’re not concerned about this, then study Germany in 1939. Stuart Shicoff Martinez Back Harris to beat Trump at ballot box Presidents Biden and Obama are the two best presidents I have experienced in my lifetime. I applaud, admire and respect President Biden so much for sacrificing for our good and not focusing on himself. He and his team, including Vice President Harris, pulled us out of an extremely dark time. In November, we have two choices: democracy vs. dictatorship. It’s time to finally put aside gender and race and focus on the issues that matter to us all. If you haven’t yet read Project 2025, please read it. There’s a summary on Wikipedia so you don’t have to read 900 pages. It’s Donald Trump’s blueprint for a dictatorship and police state and covers all of the issues that are important to Americans. Kamala Harris is the most qualified and experienced individual who can beat Trump at the ballot box. It’s a no-brainer. Ramona Krausnick Dublin Democrats’ whitewashing of the coercion of Biden According to Martha Raddatz, ABC News, senior White House sources recently said that Joe Biden was lashing out at any suggestion of dropping out. But with a political tidal wave of Democratic elites knocking over his determination to continue running on the basis that he could not win, and after the final assault by Nancy Pelosi and Chuck Schumer, Biden was finally forced to resign from the race. A New York Times opinion piece calls this “a noble patriotic move; a selfless American giving up power willingly for the good of the country.” Coercion is more like it. This narrative is a Democratic Party line whitewashing reality which we will see repeated ad nauseum. Stephan Pinto Walnut Creek GOP’s dangerous rhetorical game still on Re: “Left is stoking outrage and anger” (Page A9, July 21). Shaun McCutcheon, chairman of the Coolidge Reagan Foundation, advocates for the shooting of protesters: “Rioters don’t riot where they will be shot.” He says that leftist leaders who were soft on protesters were the causes of the Donald Trump assassination attempt. This scary kind of thinking confirms the wisdom of voting for the best Democratic candidate in November. Steve Turnwall Lafayette Upcoming federal case pivots on free speech The case against the Uhuru 3 — Omali Yeshitela, Penny Hess, and Jesse Nevel — is a troubling challenge of our most important constitutional right. Progress in this country has come from its citizens speaking their mind and advocating for change, knowing they are protected by their First Amendment right. The outcome in this trial will be extremely important in securing our right to keep speaking freely and pushing for progress. Eric Swanson Emeryville","summary":"East Bay Times Letters to the Editor for July 25, 2024","url":"https://www.mercurynews.com/2024/07/24/letters-1808/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/AP24201057195827.jpg?w=1024","video":null,"publish_date":"2024-07-24 23:30:19","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.005},{"id":252555890,"title":"South Korea’s Economy Shrinks After Surge at Start of 2024","text":"South Korean President Yoon Suk Yeol has routinely met with his US counterpart Joe Biden, at times involving Japanese Prime Minsiter Fumio Kishida, as they sought to strengthen strategic and technology ties. Washington has been driving closer coordination with its Asian allies as it seeks to reduce Beijing’s influence in the region both politically and economically. The Asia-Pacific region still relies heavily on China for economic growth and there are signs the property slump in China is improving. South Korea’s exports to the world’s second-largest economy rose 20% from a year earlier for the first 20 days of July, according to customs office data. That’s a little more than the 17.6% gain in the value of shipments to the US. What Bloomberg Economics Says… “We expect surging global demand for computer chips to drive a faster expansion in the quarters ahead, allowing full-year growth to reach 2.5% in 2024.” — Hyosung Kwon, economist For the full report, click here From the previous quarter, private consumption fell 0.2% while government spending was up 0.7%. Exports in real terms increased 0.9% and facilities investment dropped 2.1%. Machinery including chipmaking equipment led the decrease in investment, the BOK said in its statement. Construction investment contracted 1.1% following a surprise 3.3% expansion in the previous quarter. (Updates with added details)","summary":"South Korea’s economy flipped back into reverse last quarter after hotter-than-expected growth at the start of the year, adding to challenges for policymakers as they struggle to stimulate investment and consumption.","url":"https://financialpost.com/pmn/business-pmn/south-koreas-economy-shrinks-after-surge-at-start-of-2024","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/07/776155252.jpg","video":null,"publish_date":"2024-07-24 23:29:24","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","catgory":"business","source_country":"CA","sentiment":0.386},{"id":252556556,"title":"As US Congress cheered for Netanyahu, protesters gathered to denounce him","text":"Washington, DC – Hours before Israeli Prime Minister Benjamin Netanyahu arrived at the United States Capitol to deliver a speech to Congress, a woman with a blue scarf concealing her face sat alone on a park bench and waved a Palestinian flag near Union Station in Washington, DC. “We will fight for freedom wherever it’s being denied all over the world. We connect with the Palestinians because we are freedom fighters here in America,” the lone protester, who asked to remain anonymous, told Al Jazeera on Wednesday. She was one of the thousands of protesters who would ultimately gather across the capital city to demonstrate against the Israeli prime minister’s speech. As US legislators clapped for Netanyahu inside the domed edifice, activists outside called for him to be tried for abuses linked to Israel’s war in Gaza. Many argued that Netanyahu is a war criminal who belongs in jail, not in the halls of Congress. The demonstrators held effigies of a blood-stained Netanyahu, waved Palestinian flags and chanted “free Palestine” as the Israeli prime minister spoke. Top Republican and Democratic legislators in both the Senate and House of Representatives invited Netanyahu to speak before the joint session of Congress. But despite the bipartisan show of support, dozens of lawmakers boycotted the address on Wednesday, echoing concerns voiced by the demonstrators. Irene Ippolito, a protester draped in a red keffiyeh, described the congressional leadership as a “bunch of sycophants” for bringing Netanyahu to Congress. “We need to be out here. We need to say, ‘Not in our name’,” Ippolito told Al Jazeera. “As American citizens, we have to realise that this could not be taking place without our taxpayer dollars sending tonnes of weapons to Israel as it slaughters men, women and children in Gaza.” She added that the atrocities in Gaza are the “most documented genocide in human history”. Security measures Protesters like Ippolito braved searing summer heat, blocked roads and a heavy police presence as they descended on the site of the demonstration, just west of the Capitol. Some even arrived from across the country. As the protest continued, organisers led a march east through the Capitol Hill neighbourhood. Law enforcement agents had cordoned off the Capitol with a metal fence earlier this week. But on Wednesday morning, they enlarged the security perimeter, turning away vehicles and pedestrians that approached the building. Clusters of heavily armed officers and security agents in riot gear could be seen all around the area. Capitol Police said they deployed pepper spray towards activists who had “become violent” without providing further details. Al Jazeera did witness exchanges of harsh words between officers and demonstrators, but no clashes or physical violence. Adam Abusalah, an Arab American activist from Dearborn, Michigan, said it is a “shame” that Netanyahu was invited to speak to Congress. “It’s a disgrace that members from both parties have invited him to speak here. It’s a disgrace that Kamala Harris, the presumptive nominee of the Democratic Party, will meet with him,” Abusalah told Al Jazeera at an anti-Netanyahu protest near the Capitol. “We are here to say enough is enough. As Americans, we will not stand for that.” Harris — who, as vice president, has the ceremonial role of presiding over the Senate — was at an event in Indianapolis and did not attend Netanyahu’s address at the Capitol. But she is set to meet with him later this week. The vice president is now the likely nominee of the Democratic Party after President Joe Biden dropped out of the race. The Biden administration has authorised more than $14bn in military aid to Israel to help fund the war effort while offering the US ally diplomatic cover at international forums. ‘He has no right to be here’ Some of the protesters’ anger on Wednesday was directed at the US president. “Biden, Biden you can’t hide. We charge you with genocide,” they chanted. Karim, a Palestinian American protester who wished to be identified by his first name only, said he would not support Harris for the presidency after she had served as Biden’s vice president. Instead, he said he would vote for Green Party candidate Jill Stein, who spoke at the demonstration. Karim arrived in Washington, DC, on a bus with dozens of demonstrators on Wednesday, and he expressed bewilderment that Netanyahu was invited to speak at the Capitol. “He has no right to be here,” he told Al Jazeera. “We don’t support criminals of war. We don’t support genocidal maniacs.” In his remarks to US lawmakers, Netanyahu defended the Israeli war, which has killed more than 39,000 Palestinians, displaced more than 80 percent of Gaza’s population and brought the territory to the verge of famine. He also pledged to fight until “total victory” despite US-led efforts to secure a ceasefire deal. The Israeli prime minister hit out at antiwar protesters in the US, accusing them of siding with Hamas. “These protesters that stand with them, they should be ashamed of themselves,” Netanyahu said. He also called the protesters outside the Capitol “Iran’s useful idiots”, earning a standing ovation from US legislators. ‘Hitler number two’ On the streets of Washington, DC, the demonstrators had nothing but contempt for the Israeli leader. Several posters compared him to Nazi leader Adolf Hitler. Protester Sarah Bowls said the top legislators who invited Netanyahu to the US Capitol should be “ashamed” of themselves. “We should be boycotting him. He should be arrested. He should be at The Hague,” she said, referring to the Dutch city where the International Criminal Court (ICC) is based. ICC prosecutors are seeking arrest warrants for Netanyahu and his Defense Minister Yoav Gallant for alleged war crimes in Gaza. Bowls added that she is “sick” of her government continuing to fund and enable “genocide” against Palestinians. Jenny Bennett, who travelled from Dayton, Ohio, to join the demonstration, also admonished Netanyahu. “He is Hitler number two,” Bennett told Al Jazeera. “This is not OK. We are all equal. This is a genocide, and it needs to end — now.”","summary":"Thousands rally in Washington, DC, to call for end to Gaza war and rebuke the Israeli prime minister as &#039;war criminal&#039;.","url":"https://www.aljazeera.com/news/2024/7/24/as-us-congress-cheered-for-netanyahu-protesters-gathered-to-denounce-him?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2024/07/IMG_1314-1721859980.jpg?resize=1920%2C1440","video":null,"publish_date":"2024-07-24 23:26:21","author":"Ali Harb,Apps Support","authors":["Ali Harb","Apps Support"],"language":"en","catgory":"politics","source_country":"QA","sentiment":0.04},{"id":252555902,"title":"Megadonors Send Millions to Trump, Biden Funds in June: Filings","text":"Big money partisan donors and dark money funds rallied behind their chosen candidates in June, according to federal filings. Between July 15 and July 20, every committee registered with the Federal Election Commission issued financial statements covering their recent activity. According to the documents, committees working to aid the Trump campaign cumulatively held about $15.6 million more than those helping the Biden campaign entering July. At the end of June, a group of campaign committees, political action committees, and joint fundraising committees working to boost former President Donald Trump’s candidacy had about $296.8 million in cash on hand. By comparison, a group of campaign committees, PACs, and joint fundraising committees working on behalf of former President Joe Biden reported a total of $281.1 million in cash on hand. On July 21, President Biden dropped out of the presidential race after weeks of intense political pressure. Later the same day, he endorsed Vice President Kamala Harris to take his place and receive the Democratic Party’s nomination for president. On July 22, Ms. Harris secured the support of the necessary number of delegates to make her the likely nominee. Shortly after President Biden’s announcement, all of the committees associated with his run rebranded as Harris for President, Harris Action Fund, and Harris Victory Fund. Nevertheless, there are questions surrounding the legality of Ms. Harris using the money raised for President Biden. The FEC’s bipartisan, six-member commission may ultimately settle the issue. In June, the committee collected three $5 million contributions from previous donors: Robert Bigelow, Linda McMahon, and RAI Services Co. With his gift, Mr. Bigelow, the founder, president, and program manager of Bigelow Aerospace in North Las Vegas, Nevada, brought his total 2024 support for the super PAC to about $14.2 million. Ms. McMahon, administrator of the Small Business Administration during the Trump presidency, increased her total support to $10 million so far this year. The wife of former World Wrestling Entertainment CEO Vince McMahon, she was a significant supporter of former President Trump’s 2020 run. Then, she led the super PAC America First Action Inc. RAI Services is part of British American Tobacco p.l.c. Through June, the group gave $8.5 million to MAGA Inc. According to federal donor records, RAI Services is backing Republican and conservative causes in the 2024 election cycle. Along with those gifts, MAGA Inc. received six $1 million contributions. Two came from former Sen. Kelly Loeffler, who is now chair of the nonprofit Greater Georgia Action Inc., and her husband, Jeff Sprecher, the CEO of Intercontinental Exchange Inc. Both have previously supported Trump-related causes. Another million-dollar check was written by Patricia Duggan, the wife of Summit Therapeutics Chairman and CEO Bob Duggan. In 2020, both were multimillion-dollar supporters of America First Action, according to donor records maintained by watchdog group OpenSecrets. Three business leaders also gave $1 million gifts in June: Thomas Klingenstein, Benjamin Leon Jr., and Roger Penske. Mr. Klingenstein is a principal in the investment firm Cohen Klingenstein LLC. He is also the chairman of the Claremont Institute, a conservative think tank founded in 1979. “[Mr. Klingenstein] believes that we are in a cold civil war and that our enemy—what he calls the ‘Woke regime’—are winning, in large measure, because Republican leaders have yet to engage,” a biography page for him on the Institute’s website said. As a donor, Mr. Klingenstein is a consistent six-figure supporter of the conservative super PAC Club for Growth Action and a regular contributor to Republican causes, according to OpenSecrets records. Born in Cuba, Mr. Leon is the founder and chairman of Miami-area health service provider Leon Medical Centers. In his political giving career, Mr. Leon supported both Republican and Democratic causes and candidates. However, according to OpenSecrets records, his largest gifts typically go to conservatives. Mr. Penske is chairman and CEO of Penske Corp. Inc., a diversified transportation and automobile services company. According to donor records maintained by OpenSecrets, Mr. Penske and his privately owned company are not major political donors, but they typically support Republican and conservative causes. The MAGA Inc. gift is the largest of Mr. Penske’s giving career. According to FEC records, 36 donors gave more than $800,000 to the joint fundraising committee Trump 47 Committee Inc. during the second quarter. Notable contributors included Winklevoss Capital co-founders Tyler Winklevoss and Cameron Winklevoss, Home Depot Inc. founder Bernie Marcus, ABC Supply co-founder Diane Hendricks, Jimmy John’s founder James Liautaud, Miriam Adelson, owner of the Las Vegas Sands Corp., and Jared Kushner, a former senior adviser in the Trump White House, and Kushner Companies founder Charles Kushner. The largest check came from a 501(c)(4) nonprofit that shares a key officer with the hybrid PAC. Future Forward USA Action sent the committee about $15.2 million in June. Those donations brought the total 2024 support of the PAC to about $27.3 million. According to its most recent tax filings, Future Forward Action is led by Chauncey McLean. Mr. McLean is listed as the PAC’s treasurer. The PAC and the nonprofit also share a Capitol Hill address. As a 501 nonprofit, Future Forward is not required to disclose its donors. For that reason, 501s are often called dark money groups. Future Forward PAC also received a $5 million contribution from a fund linked to Open Society Foundations founder George Soros. In June, Democracy PAC sent $5 million to Future Forward, bringing its total 2024 giving to the PAC to $10 million. According to FEC records, Democracy PAC has received repeated donations from Mr. Soros since its inception in 2019. The fund’s largest backer is the 501(c)(4) nonprofit Fund for Policy Reform. George Soros’s son, Alexander Soros, is listed as a director for the Fund in its most recent tax filing. Reid Hoffman, the founder of LinkedIn Corp., sent $3 million to Future Forward in June. According to watchdog group OpenSecrets, Mr. Hoffman is the largest individual supporter of Democratic candidates and causes in the 2024 cycle in terms of total dollars and has now given $10 million to Future Forward in 2024. Another technology figure, ex-Google chief Eric Schmidt, sent $1.6 million to Future Forward in June. Mr. Schmidt is the chair of the technology think tank The Schmidt Special Competitive Studies Project LLC. According to donor records maintained by OpenSecrets, Mr. Schmidt is a limited donor to the Democratic Party and liberal causes. Future Forward also got $1 million in contributions from Amos Hostetter and the Laborers’ International Union of North America. Mr. Hostetter is the chairman of Pilot House Associates LLC and the co-founder of the Barr Foundation. LIUNA is a labor union that’s endorsed President Biden. Two notable donors combined to make a $1 million contribution to Future Forward, too. According to FEC records, James Murdoch, the son of international media titan Rupert Murdoch and ex-head of 21st Century Fox, and his wife, Kathryn Murdoch, both gave $500,000 to the PAC. The Murdochs are co-founders of the Quadrivium Foundation. James Murdoch is also the CEO of Lupa Systems. According to OpenSecrets donor records, Kathryn Murdoch is a consistent, multimillion-dollar supporter of liberal causes. Additionally, the main Biden joint fundraising committee at the time, the Biden Victory Fund, collected 10 donations of more than $800,000. Two heirs of the Simon family fortune, Cynthia Simon Skjodt and Debbie Simon, combined to give about $1.9 million. Jill Glazer, the wife of Tampa Bay Buccaneers and Manchester United owner Avram Glazer, gave about $929,000. Matt Cohler, a general partner at venture capital firm Benchmark, sent about $929,000. Bloomberg LP founder Michael Bloomberg donated about $929,000. Laura Katzenberg, daughter of media mogul Jeffrey Katzenberg, gave about $929,000. Adam Lewis, grandson of Progressive Corp. co-founder Joseph Lewis, and his wife, Melony Lewis, both sent about $929,000. Ellen Bronfman Hauptman, an heir to the Seagram’s beverage fortune built by the Bronfman family and the co-chair of private investment firm Andell Holdings, gave $923,000. Robert Pohlad, a leader of the Pohlad Cos., gave $923,000.","summary":"Loyal Democratic and Republican megadonors and new contributors plowed huge sums into political action committees boosting the 2024 presidential candidates.","url":"https://www.theepochtimes.com/us/megadonors-send-millions-to-trump-biden-funds-in-june-filings-5692993","image":"https://img.theepochtimes.com/assets/uploads/2024/07/19/id5689538-07152024-DSC01322-RNC-2024-Trump-Vance-DonaldsKO-300x180.jpg","video":null,"publish_date":"2024-07-24 23:25:46","author":"Austin Alonzo","authors":["Austin Alonzo"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.061},{"id":252555674,"title":"Joe Biden to Speak in Oval Office After Dropping 2024 Race, Stresses Importance of Defending Democracy Over Titles","text":"President Joe Biden plans to tell viewers tonight that “the defense of democracy is more important than any title,” as he delivers an Oval Office address following his decision to drop out of the 2024 presidential race. “I draw strength, and find joy, in working for the American people,” Biden plans to say, according to excerpts released by the White House. “But this sacred task of perfecting our Union is not about me. It’s about you. Your families. Your futures.” Biden also plans to say that he “decided that the best way forward is to pass the torch to a new generation. That is the best way to unite our nation.” Biden returned to the White House on Tuesday, two days after he released a letter on X/Twitter announcing that he was standing down in the presidential campaign. Shortly after that, he endorsed Vice President Kamala Harris to take his place atop the Democratic ticket. Broadcast networks plan special reports on Biden’s remarks, set to start at 8 p.m. ET/5 p.m. PT, with coverage also across cable news and streaming channels. In his remarks, Biden also plans to say that he will be “focused on my job as president” in the remaining six months of his term. “That means I will continue to lower costs for hard-working families and grow our economy. I will keep defending our personal freedoms and our civil rights – from the right to vote – to the right to choose,” Biden plans to say. “That means I will continue to lower costs for hard-working families and grow our economy. I will keep defending our personal freedoms and our civil rights – from the right to vote – to the right to choose,” the president will say. Earlier today, White House Press Secretary Karine Jean-Pierre told reporters that the suggestion that Biden should resign now was “ridiculous.” She said that the president’s decision to drop out of the race was “not about his health,” and that he believed that he could serve another four years. She said that the decision to drop out was made on Saturday evening, when he met with a small group of advisers, and the decision was finalized the next day. The letter was posted to social media at 1:46 p.m. ET. More to come.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Joe Biden plans to tell viewers tonight that “the defense of&#8230;\n\n\nThis Post: Joe Biden to Speak in Oval Office After Dropping 2024 Race, Stresses Importance of Defending Democracy Over Titles first appeared on Internewscast Journal","url":"https://internewscast.com/news/joe-biden-to-speak-in-oval-office-after-dropping-2024-race-stresses-importance-of-defending-democracy-over-titles/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Joe-Biden-In-Oval-Office-Address-Following.jpg","video":null,"publish_date":"2024-07-24 23:24:42","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.032},{"id":252555654,"title":"Obama's inner circle signals 44th president firmly behind Harris despite not saying so publicly","text":"Former President Obama has not yet endorsed Vice President Kamala Harris as the Democratic nominee for president, though allies in the Obama orbit indicate the 44th president is squarely behind Harris’ campaign. President Biden dropped out of the 2024 race Sunday afternoon in a letter posted to his X account, which was shortly followed by him endorsing Harris for president. Democrats nationwide soon united in their calls for Harris to become the party’s nominee as they square up for another election battle against former President Donald Trump. Though Democratic leaders such as Sen. Chuck Schumer and Rep. Hakeem Jeffries, as well as the Clintons and former House Speaker Nancy Pelosi have offered Harris their endorsements, Obama has remained mum. \"Michelle and I just want to express our love and gratitude to Joe and Jill for leading us so ably and courageously during these perilous times — and for their commitment to the ideals of freedom and equality that this country was founded on,\" Obama wrote in his statement following Biden bowing out, which did not including mentioning Harris. GROWING LIST OF OBAMA ALLIES, FORMER ADVISERS LOOK TO SINK BIDEN RE-ELECTION BID Since leaving the Oval Office, Obama has typically held his endorsement card close to his chest. He endorsed former Secretary of State Hillary Clinton in June of 2016, while his endorsement of Biden in 2020 was only made days ahead of the DNC. Obama remained coy for a long while during the 2020 election about whom he would endorse, saying he would not back anyone during the primary. As Democratic contenders such as Pete Buttigieg, Sen. Elizabeth Warren and Sen. Bernie Sanders dropped out of the primary race and cleared a path for Biden, however, Obama finally endorsed his former veep in August of that year. Harris was also a contender in the 2020 race, and had long had a friendship with Obama prior to her 2020 run, sparking media speculation that the 44th president could throw his support behind Harris instead of his VP. OBAMA ALLIES, ADVISERS HELPED LEAD THE CHARGE AMONG DEMS LOOKING TO SINK BIDEN AHEAD OF OFFICIAL ANNOUNCEMENT Harris was among the first elected Democrats in the nation to endorse Obama’s first run for president in the 2008 election, snubbing Hillary Clinton in favor of the then-Illinois senator. \"I’m told that I was the first elected person in California to endorse [Obama] when he decided to run for president,\" Harris said back in 2019 while she was campaigning for president. \"I will remind you, and it is important to know, that early in those days Joe Biden was running against him.\" Harris was in attendance when Obama announced his candidacy for president in 2007, after first meeting him 2004 when he was an Illinois state senator running for the U.S. Senate, the Washington Examiner previously reported. \"Barack Obama will be a president who finally ends the era of fear that has been used to divide and demoralize our country,\" Harris said during California's Democratic convention in 2008. As Harris built her political career from San Francisco district attorney to California attorney general and then senator, Harris was even dubbed \"the female Obama\" by some political analysts. EX-OBAMA ADVISER SAYS BIDEN CAN'T BEAT 'FATHER TIME' AND IS 'NOT WINNING THIS RACE' Fast forward to Harris’ 2020 campaign for the presidency, those in Obama's orbit rallied around Harris’ campaign while the 44th president kept quiet. Public relations executive Michael Kempner and his wife held a fundraiser for Harris in the Hamptons that cycle, after they raised millions for Obama during his 2012 re-election campaign, Politico reported at the time. Eugene Duffy, who served as national finance committee member for Obama in 2008, helped fundraise for Harris that cycle, as did Obama donor and supporter, Jeff Shell, the former CEO of NBCUniversal. Though Obama is again remaining coy with his endorsement in 2024 cycle, powerful advisers and allies in his orbit have joined Harris' campaign. Harris tapped Obama’s former attorney general Eric Holder to lead the vetting process of Harris’ potential running mates, while the campaign also reportedly contacted longtime Obama adviser David Plouffe for a leadership position on the team. Jennifer O'Malley Dillon, who worked as Obama’s 2012 deputy campaign manager and Biden’s 2024 reelection campaign chair, was announced as Harris’ campaign manager. OBAMA SILENT OVER REPORTS HE'S WORKING ‘BEHIND THE SCENES’ TO FORCE BIDEN OUT OF THE 2024 RACE Ahead of Biden dropping out of the race on Sunday afternoon, Obama allies notably helped lead the charge in calling for Biden to exit the race in favor of a candidate they believed was more suitable to take on Trump. Obama's former chief campaign strategist David Axelrod declared earlier this month that Biden is \"not winning this race.\" Actor George Clooney called on Biden to drop out of the race in a bombshell op-ed that was published just weeks after the Hollywood star co-hosted Biden, alongside Obama, for a ritzy campaign event in Los Angeles. Clooney has long had a personal friendship with Obama and former first lady Michelle Obama, including vacationing with the first couple in previous years. OBAMA AGAIN STEPPING INTO ROLE AS JOE'S CLOSER AHEAD OF TRUMP V BIDEN REMATCH Another ally in Obama's orbit, Jon Favreau, who served as former director of speech writing for Obama, also called on Biden to drop out of the race this month, saying he attended the fundraiser in L.A. with Clooney and Obama and witnessed firsthand Biden's state of mental acuity. Favreau, alongside former Obama advisers Jon Lovett and Tommy Vietor — known collectively as the \"Obama Bros\" when they worked in the White House — also dedicated the majority of a podcast episode of \"Pod Save America\" this month to trashing Biden. The \"Obama Bros\" and other former advisers in Obama’s orbit have since taken to social media to celebrate Harris’ run. As momentum builds behind Harris’ candidacy, with the DNC anticipated to certify her as the nominee on Aug. 1, Obama’s statement Sunday follows his history of not expeditiously tipping the political scales in favor of one candidate over another. CLICK HERE TO GET THE FOX NEWS APP ​​\"We will be navigating uncharted waters in the days ahead. I have extraordinary confidence that the leaders of our party will be able to create a process from which an outstanding nominee emerges,\" Obama said in his statement on Sunday. \"I believe that Joe Biden’s vision of a generous, prosperous, and united America that provides opportunity for everyone will be on full display at the Democratic Convention in August. And I expect that every single one of us are prepared to carry that message of hope and progress forward into November and beyond.\" Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Former President Obama&apos;s history of presidential endorsements and supporters rallying around Vice President Harris indicate he supports her run despite not outright endorsing her.","url":"https://www.foxnews.com/politics/obamas-inner-circle-signals-44th-president-firmly-behind-harris-despite-not-saying-so-publicly","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/kamalaobama.png?ve=1&tl=1","video":null,"publish_date":"2024-07-24 23:20:28","author":"Emma Colton","authors":["Emma Colton"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.341},{"id":252555540,"title":"Harris’ Past Anti-Fracking Position Seized Upon by GOP","text":"“Kamala Harris is even more extreme than Joe Biden – She wants to ban fracking and kill countless jobs in states like PA for American workers,” Donald Trump Jr. posted on X. A Harris spokesperson didn’t immediately respond to a request for comment, but her campaign released a statement Wednesday highlighting Trump’s entreaties for $1 billion in donations from the oil industry, adding the move threatens to “sacrifice good paying jobs” that are driving an American energy and manufacturing boom. “Under the Biden-Harris administration, America is more energy independent than ever,” said Harris for President spokesperson Joseph Costello. “Trump promises to dismantle all this progress and sell out America’s future for his own personal gain.” During her brief primary run, Harris told a CNN town hall she opposed hydraulic fracturing, which involves pumping water, sand and chemicals underground to free oil and gas from dense rock formations, and has drawn vehement opposition from some green groups and progressive voters. “There’s no question I’m in favor of banning fracking,” Harris said at the 2019 candidate climate forum. As California’s attorney general, Harris also sued the Obama administration over the approvals of fracking off her state’s coast. Harris later moderated her views after being selected as Biden’s running mate, with the campaign emphasizing new restrictions and regulations for the technique instead.","summary":"As a 2019 presidential candidate, Kamala Harris pledged to ban fracking. Now Republicans are betting her opposition to the drilling technique will hurt her at the polls.","url":"https://financialpost.com/pmn/business-pmn/harris-past-anti-fracking-position-seized-upon-by-gop","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/07/776093228.jpg","video":null,"publish_date":"2024-07-24 23:19:08","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","catgory":"politics","source_country":"CA","sentiment":0.14},{"id":252555346,"title":"[Graphic News] Trump vs. Harris: 2024 presidential showdown","text":"The upcoming US presidential election on Nov. 5 has set the stage for a new showdown between former Republican President Donald Trump and current Vice President Kamala Harris, the likely Democratic candidate. According to the Associated Press, recent surveys indicate that Vice President Harris has secured the delegates to be the Democratic nominee, effectively replacing President Joe Biden as the party's candidate.","summary":"The upcoming US presidential election on Nov. 5 has set the stage for a new showdown between former Republican President Donald Trump and current Vice President Kamala Harris, the likely Democratic candidate. According to the Associated Press, recent surveys indicate that Vice President Harris has secured the delegates to be the Democratic nominee, effectively replacing President Joe Biden as the party&#039;s candidate.","url":"https://www.koreaherald.com/view.php?ud=20240724050752","image":"https://res.heraldm.com/content/image/2024/07/24/20240724050773_0.gif","video":null,"publish_date":"2024-07-24 23:18:06","author":"Nam Kyung-Don","authors":["Nam Kyung-Don"],"language":"en","catgory":"politics","source_country":"kr","sentiment":-0.297},{"id":252555706,"title":"Biden to give Oval Office address about his exit from election race","text":"US President Joe Biden is expected to detail his reasons for pulling out of the election race in a prime-time address to the nation shortly. Mr Biden is due to give an Oval Office address at 8pm, local time (10am AEST) — his first extensive public comments since posting an open letter on social media announcing his decision on Sunday. \"He wants to speak directly to the American people tonight,\" White House spokeswoman Karine Jean-Pierre said. \"You don't use the Oval Office often; you use it for incredibly important moments, and that's what you're going to hear tonight.\" Mr Biden was in isolation with COVID when he announced his decision via the X platform, writing: \"While it has been my intention to seek re-election, I believe it is in the best interest of my party and the country for me to stand down and to focus solely on fulfilling my duties as president for the remainder of my term.\" It followed weeks of sustained pressure from a growing number of prominent Democrats who were concerned about his visible signs of aging, and his ability to compete with Republican nominee Donald Trump. Earlier on Wednesday, Mr Biden's likely replacement on the Democratic Party ticket, Vice-President Kamala Harris, made a pitch to thousands of Black women at an event in Indianapolis. \"Our nation, as it always has, is counting on you to energise, to organise and to mobilise,\" she told the convention for a historically Black sorority group, Zeta Phi Beta. Trump held his own event in North Carolina, where he attacked his opponent as a \"radical left lunatic who will destroy our country if she ever gets the chance to get into office\". \"For three-and-a-half years, lyin' Kamala Harris has been the ultra-liberal driving force behind every single Biden catastrophe,\" he said. Mr Biden endorsed Ms Harris half an hour after announcing he would not run for re-election, and she has since won the backing of most top Democrats, including those who had been seen as her potential rivals. On Monday, she announced she had secured the votes of the necessary number of delegates to lock in the nomination. She is yet to announce a vice-presidential running mate.","summary":"US President Joe Biden prepares to detail his reasons for pulling out of the 2024 US presidential election in a prime-time Oval Office address, scheduled to begin shortly.","url":"https://www.abc.net.au/news/2024-07-25/biden-first-address-since-dropping-out-election-race/104138988","image":"https://live-production.wcms.abc-cdn.net.au/8efc667ca63618ddbc4e7fd63799f432?impolicy=wcms_crop_resize&cropH=1142&cropW=2031&xPos=0&yPos=8&width=862&height=485","video":null,"publish_date":"2024-07-24 23:16:46","author":"Brad Ryan","authors":["Brad Ryan"],"language":"en","catgory":"politics","source_country":"AU","sentiment":-0.102},{"id":252555312,"title":"Cardi B defends Kamala Harris against criticism over Vice President’s dating history","text":"Cardi B has called out the Kamala Harris detractors who have used the Vice President’s dating history as a means to question her qualifications. Since Harris, 59, was endorsed by President Joe Biden to be his replacement in the 2024 presidential race, she has faced increased scrutiny from her conservative opponents. From complaints about her laugh to targeting her race and gender, Harris is now facing attacks from some Donald Trump supporters who have accused her of sleeping her way to the top. “What does Kamala Harris husband or relationships have to do wit [sic] her credentials?” Grammy-winning rapper Cardi B tweeted on Tuesday (July 23). “Do y’all hire people based on who they f***ing??” Before Harris was elected as San Francisco’s district attorney in 2004, she had been in a decade-long relationship with Willie Brown, then-speaker of the California State Assembly, who would go on to become the mayor of San Francisco that same year. “Yes, we dated. It was more than 20 years ago,” Brown, now 90, confirmed in a 2019 article in the San Francisco Chronicle titled: “Sure, I dated Kamala Harris. So what?” Some critics have falsely claimed that Harris had an affair with Brown while he was still married. However, in a fact-checking piece, The Associated Press points out that Harris had been separated from his wife for years – since 1982 – before he and Harris began dating in the Nineties. Harris wrote that he supported Harris’s first race to be San Francisco district attorney – just as he has supported a long list of other California politicians, including former House Speaker Nancy Pelosi, former Senator Dianne Feinstein and Governor Gavin Newsom, The AP reported. Harris’s other exes, including actor and TV host Montel Williams, have also faced scrutiny from Trump supporters. “Here she is ‘dating’ @Montel_Williams in 2001, who appears to be holding hands with more than one woman at the same time on the red carpet,” one person tweeted alongside a video of the moment. Williams responded, clarifying that the other “woman” was his then-teenage daughter, Ashley. Harris has been married to entertainment lawyer Doug Emhoff, 59, since 2014. While she doesn’t have any biological children, Harris is the proud stepmom – dubbed “Momala” – to Emhoff’s two adult children, Cole and Ella. Writing about her stepchildren in a personal 2019 essay for Elle, Harris detailed the moment she met Emhoff’s children for the first time. “Children need consistency; I didn’t want to insert myself into their lives as a temporary fixture because I didn’t want to disappoint them,” she said, calling them “brilliant, talented, funny kids who have grown to be remarkable adults.”","summary":"Harris has been accused of jumpstarting her career by having an affair with former politician Willie Brown","url":"https://www.independent.co.uk/arts-entertainment/music/news/kamala-harris-husband-willie-brown-cardi-b-b2585400.html","image":"https://static.independent.co.uk/2024/07/24/20/Untitled-design.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/TEV2fOz2-4VHSaSK0.mp4","publish_date":"2024-07-24 23:13:41","author":"Inga Parkel","authors":["Inga Parkel"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.223},{"id":252556476,"title":"Biden to tell prime-time audience passing torch to Harris is ‘best way to unite our nation’","text":"President Joe Biden will portray his decision to drop out of the 2024 race during his highly-anticipated primetime address to the nation as his last act in defense of democracy, according to experts. “The defense of democracy is more important than any title,” Biden is expected to say from the White House‘s Oval Office on Wednesday, according to his prepared remarks. “I draw strength, and find joy, in working for the American people. But this sacred task of perfecting our Union is not about me. It’s about you. Your families. Your futures. It’s about ‘We the People.’” “I have decided the best way forward is to pass the torch to a new generation,” he will say. “That is the best way to unite our nation.” In his remarks, written in consultation with longtime aide Mike Donilon and only his fourth to be delivered from the Oval Office, he will also say: “The great thing about America is here, kings and dictators do not rule. The people do. History is in your hands. The power is in your hands. The idea of America – lies in your hands.” Across the street, people are gathering in Lafayette Square as part of a thank you rally for Biden organized by more liberal organization MoveOn. Biden not seeking reelection means that the end of his administration on Jan. 20 will end his time in Washington, D.C., to which he first started commuting in 1973 after he became one of the youngest senators in history, then a newly widowed father-of-two. His first wife Neilia and their one-year-old daughter Naomi died in a holiday car crash months earlier. After 36 years in the Senate, former President Barack Obama chose him to be his two-term vice president before discouraging him from contesting the presidency against eventual 2016 Democratic nominee Hillary Clinton, one year after he lost his eldest son Beau to cancer. Wednesday night’s address, the first of its kind since former President Lyndon Johnson made a similar announcement in 1968, will be the second public comments Biden has made about his decision to stand aside, other than his letter last weekend and social media post endorsing Harris. Calling into Harris’s first appearance at their campaign headquarters in Wilmington, Delaware on Monday as a presidential candidate before later that night she became the presumptive Democratic nominee, Biden underscored his pride in their team and promised that he is “not going anywhere.” “I know yesterday’s news is surprising and it’s hard for you to hear, but it was the right thing to do,” Biden told about 100 aides, some of whom were crying. “I know it’s hard because you’ve poured your heart and soul into me to help us win this thing, help me get this nomination, help me win the nomination and then go on to win the presidency… I know how hard you’ve worked, how many sacrifices you’ve made, and so many of you uprooted your lives for me.” As campaign manager Julie Chavez Rodriguez, a former Harris Senate staffer, held up a phone to the microphone of a podium set up in a room decorated with new “Harris” signs, Biden implored the group to “embrace” Harris because “she’s the best,” adding “the name has changed at the top of the ticket, but the mission hasn’t.” “We still need to save this democracy,” Biden said. “I’ve got six months left of my presidency, and I’m determined to get as much done as I possibly can, both foreign policy and domestic policy; keep lowering costs for families; continue to speak out on guns and childcare, eldercare, prescription drugs, and climate.” “Climate still is the existential threat that we face, and if we don’t win this thing, it’s all in jeopardy,” he went on. “We’ve got to keep working for an end to the war in Gaza. I’ll be working very closely with the Israelis and with the Palestinians to try to work out how we can get the Gaza war to end, and the Middle East peace, and get all those hostages home. I think we’re on a verge of being able to do that.” Harris repeatedly praised Biden during the event, reiterating that she loved him and that his 50-year career had been consequential, in addition to during her first rally as his heir apparent in Milwaukee, Wisconsin on Tuesday and during an official stop for the Zeta Phi Beta Sorority, Incorporated’s Grand Boulé in Indianapolis, Indiana on Wednesday. “In this moment, I believe we face a choice between two different visions for our nation: one focused on the future, the other focused on the past,” the vice president said Wednesday. “With your support, I am fighting for our nation’s future.” CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER “We know when we organize, mountains move. When we mobilize, nations change. And when we vote, we make history,” she continued. “So let’s continue to fight with optimism, with faith, and with hope. Because when we fight, we win.” Nationally, Trump has an average 2 percentage point edge on Harris in early polling conducted this month since the debate, according to RealClearPolitics.","summary":"President Joe Biden will portray his decision to drop out of the 2024 race during his highly anticipated primetime address to the nation as his last act in defense of democracy, according to experts. “The defense of democracy is more important than any title,&#8221; Biden is expected to say from the White House&#8216;s Oval Office [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3097208/joe-biden-speech-2024-election-kamala-harris/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Joe_Biden_WH_speaking_41.webp","video":null,"publish_date":"2024-07-24 23:11:57","author":"Naomi Lim","authors":["Naomi Lim"],"language":"en","source_country":"US","sentiment":0.104},{"id":252555286,"title":"Biden’s Exit From 2024 Race ‘Not for Health Reasons,’ White House Says","text":"President Joe Biden did not end his reelection bid due to health concerns, according to White House press secretary Karine Jean-Pierre. The president will state his reasons for ending the campaign in a televised address at 8 p.m. on July 24. The highly anticipated appearance will occur after days of speculation about the president’s health following his testing positive for COVID-19 on July 19 and subsequent retreat to his Rehoboth Beach house in Delaware to recover. There, after consulting with family and close advisers, the president reversed his position after weeks of assuring the public that he would remain the Democratic candidate despite rising pressure from elected Democrats who had come to believe he would not win reelection. Ms. Jean-Pierre addressed that rumor in her remarks. “First of all there’s been no cover-up; want to be very clear about that,” she said. “It is not about his health ... that’s not the reason.” According to Ms. Jean-Pierre, President Biden met with a small group of advisers and family members on July 20 and made his final decision the following day. The president did not state a reason for the decision, saying only that it was made in the best interest of the party and of the country. The announcement ended more than three weeks of intense speculation regarding his candidacy. During a televised debate with former President Donald Trump on June 27, President Biden at times appeared to misspeak and leave sentences unfinished. The debate performance prompted a number of Democratic donors, lawmakers, and celebrities to call on President Biden to end his campaign. The president responded with his intent to stay in the race. In a July 5 interview with ABC News, President Biden joked that he would only consider dropping out if “the Lord Almighty” were to come down and tell him that he cannot beat former President Donald Trump. Earlier this month, during a July 8 interview on MSNBC’s “Morning Joe,” he voiced his frustration toward those who urged him to step aside, particularly party elites, pundits, and donors. On July 17, in an interview on BET News, he said he would reconsider his decision to run only if doctors warned him of a serious medical condition. White House staff consistently rejected rumors of his withdrawal, with one staff member saying on social media platform X: “Incorrect. Keep the faith.” Even while recovering from COVID-19 at his Delaware house last week, President Biden issued a statement saying that he “looked forward to getting back on the campaign trail.” That determination apparently dissipated over the course of a few days, coinciding with the COVID-19 diagnosis. President Biden endorsed his former running mate, Vice President Kamala Harris, as part of his withdrawal statement. “Today I want to offer my full support and endorsement for Kamala to be the nominee of our party this year,” he wrote. President Biden, 81, has stated that he intends to finish his term, which will complete a 52-year career in public service that began with his election to the U.S. Senate in 1972 at the age of 29. “The president has no regrets, has no regrets,” Ms. Jean-Pierre said.","summary":"The July 24 appearance will answer speculation about the state of the president's health and the reason behind a sudden change of mind regarding the campaign.","url":"https://www.theepochtimes.com/us/bidens-exit-from-2024-race-not-for-health-reasons-white-house-says-5693099","image":"https://img.theepochtimes.com/assets/uploads/2024/07/24/id5692668-Biden-GettyImages-2162555758-300x180.jpg","video":null,"publish_date":"2024-07-24 23:11:40","author":"Emel Akan,Lawrence Wilson","authors":["Emel Akan","Lawrence Wilson"],"language":"en","source_country":"us","sentiment":-0.18},{"id":252556124,"title":"Biden’s Supreme Court reform plan appears to be at a standstill","text":"President Joe Biden’s plan to implement legislative reform to the Supreme Court doesn’t appear to be making any ground. During Wednesday’s White House press briefing, press secretary Karine Jean-Pierre was asked if Biden was still committed to making sweeping changes to the Supreme Court, such as term limits, an enforceable ethics code, and a constitutional amendment that would eliminate presidential immunity. “The president believes that when you hold a high office, you should be held by a certain ethics and transparency,” Jean-Pierre said. “That’s something that the president believes, and so he certainly will do everything that he can. I don’t have any policy announcements to make at this moment.” Democrats have called for an ethics code in the wake of controversy surrounding Justices Clarence Thomas and Samuel Alito. Thomas has been criticized for accepting luxurious “gifts” from wealthy donors without disclosing them. He has maintained that he was not required to do so. Democrats have called on Alito to recuse himself from a Jan. 6-related case after a flag associated with those who stormed the Capitol was seen flying outside of one of his residencies. Alito said that was all his wife’s doing, and neither he nor Thomas has suggested they will step down. Implementing term limits has been a major talking point for Democrats. Last year, Sen. Alex Padilla (D-CA) introduced a bill that would implement 18-year term limits for Supreme Court justices. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER However, even before Biden made his announcement that he was ending his presidential bid, the chances of him passing legislation in the coming months were very slim considering that Republicans hold a majority in the House. “The president has gotten a lot done, historic pieces of legislation passed,” Jean-Pierre said. “That wasn’t done with an easy political climate. We’re going have more to share what the next several months of his term is going to look like.”","summary":"President Joe Biden&#8217;s plan to implement legislative reform to the Supreme Court doesn&#8217;t appear to be making any ground. During Wednesday&#8217;s White House press briefing, press secretary Karine Jean-Pierre was asked if Biden was still committed to making sweeping changes to the Supreme Court, such as term limits, an enforceable ethics code, and a constitutional [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3098344/biden-supreme-court-reform-plan-appears-at-standstill/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/joe-biden-camapign-events.webp","video":null,"publish_date":"2024-07-24 23:11:28","author":"Elaine Mallon","authors":["Elaine Mallon"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.329},{"id":252556756,"title":"DNC issues 3-day ultimatum to any potential Harris challengers","text":"The Democratic National Committee (DNC) is telling any would-be challengers to Vice President Kamala Harris to either file their paperwork in the next three days or to wait until 2028. Politico reported Wednesday that the DNC is hoping to close the door on any chances of a fractured party by the end of the week. Delegates who will officially select the party's nominee at next month's Democratic National Convention recently approved rules for the upcoming virtual roll call on July 30. Any candidates aiming to ask delegates to support their bid for the nomination will need to submit their paperwork confirming their candidacy by Saturday at 6 PM Eastern Time. Then, in order for any candidate to qualify for the virtual roll call on August 7, they will need to gather 300 signatures from delegates — with no more than 50 coming from the same state — by Tuesday, July 30. According to Politico, the August 7 deadline is set in stone, given Ohio's ballot access deadlines. READ MORE: Trump 'freaking out' as he's 'caught in a no-win situation' against Harris: report “Failure to certify both nominees in advance of each state’s ballot access deadline opens us up to very real political and litigation risk, both before and after the election,” DNC legal counsel Pat Moore told the publication. “Republicans will use this moment to do what they do: to sue, to try to bar us from the ballot, or to try to disqualify our voters.” Should no potential candidates file paperwork by Saturday, then Harris will be guaranteed the Democratic Party's nomination at the convention next month. However, the convention's nomination will likely be a formality, as Harris has already managed to unite virtually the entire party behind her candidacy since President Joe Biden issued a statement confirming his exit from the 2024 race — and his endorsement of his vice president — on Sunday evening. Since Biden stepped aside, Harris has been accumulating endorsements from popular Democratic governors like Andy Beshear (D-Kentucky), Phil Murphy (D-New Jersey), Gavin Newsom (D-California) and Josh Shapiro (D-Pennsylvania). Earlier this week, House Minority Leader Hakeem Jeffries (D-New York) and Senate Majority Leader Chuck Schumer (D-New York) threw their weight behind Harris' bid. \"Kamala Harris is now the right person to take up the torch, defeat Donald Trump, and succeed Joe Biden as president,\" Transportation Secretary Pete Buttigieg, who ran against Biden and Harris for the 2020 Democratic nomination, told the Wall Street Journal. READ MORE: Schumer and Jeffries gleefully endorse Harris in joint presser after Trump morning meltdown Harris' nomination appeared inevitable almost as soon as Biden endorsed her. In the 24 hours following Biden's announcement, Harris raised a record-setting $81 million in campaign donations. That's almost $30 million more than former President Donald Trump raised following his 34 felony convictions. She raised another $45 million the next day, meaning the vice president has added $126 million to the $240 million war chest she inherited from Biden. Harris' campaign has also signed up roughly 100,000 new volunteers to reach out to voters since her bid for the presidency launched last weekend, according to WBAL journalist Jayne Miller. These volunteers will likely be deputized to turn out voters in major battleground states likely to play a pivotal role in deciding the winner of the 2024 election, like Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin. The Democratic National Convention will kick off in Chicago, Illinois on August 19, and will end on August 22, likely with Harris formally accepting her party's presidential nomination. READ MORE: (Opinion) Why the unity around Harris is good for democracy Click here to read Politico's report in full.","summary":"The Democratic National Committee (DNC) is telling any would-be challengers to Vice President Kamala Harris to either file their paperwork in the next three days or to wait until 2028.\n\nPolitico reported Wednesday that the DNC is hoping to close the door on any chances of a fractured party by the end of the week. Delegates who will officially select the party's nominee at next month's Democratic National Convention recently approved rules for the upcoming virtual roll call on July 30. Any candidates aiming to ask delegates to support their bid for the nomination will need to submit their paperwork confirming their candidacy by Saturday at 6 PM Eastern Time. \n\nThen, in order for any candidate to qualify for the virtual roll call on August 7, they will need to gather 300 signatures from delegates — with no more than 50 coming from the same state — by Tuesday, July 30. According to Politico, the August 7 deadline is set in stone, given Ohio's ballot access deadlines.\n\nREAD MORE: Trump 'freaking out' as he's 'cau","url":"https://www.alternet.org/dnc-harris/","image":"https://www.alternet.org/media-library/image.jpg?id=52253259&width=1200&height=600&coordinates=0%2C560%2C0%2C560","video":null,"publish_date":"2024-07-24 23:10:01","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"US","sentiment":-0.285},{"id":252554890,"title":"Passing the baton","text":"AP – Even though United States (US) President Joe Biden won’t be on the ballot this November, voters still will be weighing his legacy. As Vice President Kamala Harris moves to take his place as the Democratic standard-bearer, Biden’s accomplishments remain very much at risk should Republican Donald Trump prevail. How Biden’s single term – and his decision to step aside – are remembered will be intertwined with Harris’ electoral success in November, particularly as the vice president runs tightly on the achievements of the Biden administration. Biden had an opportunity to make a case for his legacy – sweeping domestic legislation, renewal of alliances abroad, defense of democracy – yesterday when he delivered an Oval Office address about his decision to bow out of the race and “what lies ahead”. And no matter how frustrated Biden is at being pushed aside by his party – and he’s plenty upset – he has too much at stake simply to wash his hands of this election. Biden endorsed Harris shortly after he announced on Sunday that he would end his candidacy, effectively giving her a head start over would-be challengers and helping to jumpstart a candidacy focused largely on continuing his own agenda. “If she wins, then it will be confirmation that he did the right thing to fight against the threat that is Trump, and he will be seen as a legend on behalf of democracy,” said executive director of the George Washington Presidential Library at Mount Vernon presidential historian Lindsay Chervinsky. “If she loses, I think there will be questions about, did he step down too late? Would the Democratic Party have been more effective if he had said he was not going to run?” Similar what-ifs play out at the end of every presidency. But Biden’s defiance in the face of questions about his fitness for office and then his late submission to his party’s crisis of confidence heighten the stakes. The last vice president to run for the top job was Democrat Al Gore, who sought to distance himself from President Bill Clinton during the 2000 campaign after the president’s affair with a White House intern and subsequent impeachment. Harris, in contrast, has spent the better part of the last three years praising Biden’s doings – meaning any attempt to now distance herself would be difficult to explain. And she has to rely on the Biden political operation she inherited to win the election with just over 100 days to go before polls close. Speaking to campaign staff on Monday, Harris said Biden’s legacy of accomplishment “just over the last three and a half years is unmatched in modern history”. Trump and his allies, for their part, were eager to tie Harris to Biden’s record even before the president left the race – and not in a good way. One campaign email to supporters declared “Kamala Haris is Joe Biden 2.0 – Kamala Harris owns Joe Biden’s terrible record because it is her record as well”, calling out high inflation and border policies, among other things. Biden this week promised the staffers of his former campaign that he was still “going to be on the road” as he handed off the reins of the organisation to Harris, adding, “I’m not going anywhere”. His advisers said he intends to hold campaign events and fundraisers benefiting Harris, albeit at a far slower pace than had he remained on the ballot himself. Harris advisers will ultimately have to decide how to deploy the president, whose popularity sagged as voters on both sides of the aisle questioned his fitness for office. The president’s allies insist that no matter what, Biden’s place in the history books is intact.","summary":"","url":"https://borneobulletin.com.bn/passing-the-baton/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/07/page-24-d_25072024.jpg","video":null,"publish_date":"2024-07-24 23:02:53","author":null,"language":"en","source_country":"bn","sentiment":-0.13},{"id":252555204,"title":"Trump targets Vice President Kamala Harris with 'You're fired!' jibe during Charlotte campaign rally","text":"In a dramatic throwback to his reality TV days, Donald Trump brought back his famous \"You're fired!\" line at a Charlotte rally, aiming it squarely at Kamala Harris as he pledged to trounce her in the upcoming 2024 election. \"Kamala, you're fired! Get out of here! You're fired! \" bellowed Trump, eliciting roars from the throng of supporters crammed into the indoor arena for his campaign event. He began by targeting Harris with, \"Now we have a new victim to defeat, Lyin' Kamala Harris,\" which was met with jeers. He then lambasted her: \"For three and a half years, Lyin' Kamala Harris has been the ultra-liberal driving force behind every single Biden catastrophe. She is a radical left lunatic who will destroy our country if she gets the chance to get into office. We're not going to let that happen,\" sparking another wave of applause. This rally marked Trump's first public campaign appearance since Joe Biden announced he wouldn't be running in the 2024 presidential race. The ex-president's choice to campaign in North Carolina swing state he previously clinched but where Democrats are making strides underscores his commitment to reclaiming the state this November, reports the Mirror US. Moreover, Trump is casting his sights on traditionally Democratic territories, such as Minnesota, which he's scheduled to visit next Saturday. READ MORE: Kamala Harris makes savage joke about Donald Trump that will have him fuming His rally also marks the second event since he narrowly escaped an assassination attempt in Butler, Pennsylvania. Trump has devoted considerable time readying to take on Biden in the upcoming November election and his focus now shifts towards Vice President Kamala Harris, who is gradually gaining traction as the Democratic frontrunner. During his Wednesday pit stop, Trump was gearing up to unload a volley of criticism directed at Harris. Following Biden's surprising step away from the presidential race, his attacks on Harris turned more fervent, labelling her as \"the same as Biden but much more radical.\" He partly blames her for what he perceives as the shortcomings of the Biden administration, most notably border security issues. Trump's plans for a potential debate with Harris remain somewhat unclear. Initially, he voiced a preference for Fox News over ABC to host the September scheduled debate with Biden. However, his position seemed to have shifted again during a reporter's call on Tuesday. He showed interest in engaging in a debate with Harris \"more than once\", yet didn't confirm his attendance for the currently scheduled debate. He also confirmed he had only agreed upon two debates with Biden, not Harris. Meanwhile, Harris spent her Wednesday in Indiana. Speaking to members of the historically Black sorority Zeta Phi Beta, she made it clear that \"we are not playing around.\" She sought their backing for her presidential bid in the upcoming November elections, which she characterised as \"a choice between two different visions for our nation, one focused on the future, the other focused on the past.\" It's been a whopping 16 years since Indiana voters threw their support behind a Democratic presidential candidate. However, Harris, who proudly identifies as Black and South Asian, was speaking to an audience already excited by her historic potential as the likely Democratic nominee. Her campaign is banking on this group to help expand its coalition. In hushed tones, Republicans have admitted that swapping Biden for Harris weakens part of their party's argument about Trump's vitality and energy. At 81, Biden would have been the oldest presidential nominee entering a general election. Now, that mantle falls to the 78 year old Trump. Harris, at 59, has kicked off a campaign that seems to be sparking interest among younger voters, who could play a crucial role in determining the outcome of what's expected to be a tight general election. North Carolina, a state that Trump managed to secure in both his previous campaigns, was won by less than 1.5 percentage points over Biden in 2020, marking the tightest margin of any state Trump claimed. Despite the ongoing COVID-19 pandemic, Trump campaigned heavily in North Carolina, while Biden largely refrained from physical campaigning and did not personally visit the state in the final 16 days of the election. Mecklenburg County, which houses Charlotte - the largest city in the state - also witnessed Trump's narrowest margin of victory in North Carolina's GOP primary, where he edged out Nikki Haley by less than eight percentage points. This year, Trump had intended to host his first rally since the commencement of his hush money trial in Fayetteville, but the event was cancelled due to poor weather conditions. Instead, Trump called in from his private plane. The Democrats have also been striving to secure North Carolina, a state where the party's most recent presidential win was Barack Obama's 2008 triumph, despite the recent dominance of the GOP. Following his heated June debate with Trump, Biden made an appearance at a campaign event in Raleigh. Despite showcasing a more assertive demeanour than at the debate, it did little to alleviate growing concerns within his party about his chances of reclaiming the White House. Harris is now poised to replace him, and she may look to North Carolina for political backing. Trump's Charlotte appearance marks his second campaign rally following the shocking assassination attempt on him at a Pennsylvania rally on July 13. After recovering, he graciously accepted the GOP's presidential nomination and gave a stirring speech at the Republican National Convention, all while visibly sporting bandages from the shooting incident. In a dramatic development related to the security breach, Secret Service Director Kimberly Cheatle has stepped down. Admitting \"full responsibility for the security lapse\", she resigned in the wake of the startling event that saw a gunman get dangerously close to Trump during the Pennsylvania rally.","summary":"Donald Trump returned to the campaign trail in North Carolina on Wednesday, his first rally since Joe Biden ended his 2024 re-election bid, and revived an old catchphrase","url":"https://www.mirror.co.uk/news/us-news/trump-targets-vice-president-kamala-33320529","image":"https://i2-prod.mirror.co.uk/news/us-news/article33320528.ece/ALTERNATES/s1200/0_election-2024-trump.jpg","video":null,"publish_date":"2024-07-24 23:02:47","author":"Jeremiah Hassel,Phoebe Tonks,Phoebe-Tonks,Reanna Smith","authors":["Jeremiah Hassel","Phoebe Tonks","Phoebe-Tonks","Reanna Smith"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.139},{"id":252554886,"title":"Harris steps into the limelight","text":"AP – If you’re trying to get up to speed on Vice President Kamala Harris’ swift emergence as Democrats’ possible nominee this fall, you really need to know your memes. From “brat summer” to “coconut tree,” it’s been a timeline full of Harris-related memes for many people since President Joe Biden exited the 2024 presidential race on Sunday and endorsed his number two to lead the party. Taking to the Internet to pledge their support for her candidacy, Harris’ backers, much of the time, are crafting new spins on previous online organisms that at one time had been used by Harris’ detractors to throw shade. There are also celebrities getting in the mix, with some of the association seen as a tidal wave of attention on Harris’ candidacy that could help turn back American apathy for what had been a largely binary general election between Biden and Republican Party nominee Donald Trump. It also could be a way for Harris’ campaign to resonate with younger voters, a group Democrats need to turn out in November. Here’s a meme primer for following Harris’ newly launched 2024 campaign: ‘COCONUT TREE’ Coconuts are everywhere in timeline mentions of Harris, an internet organism that began as Harris criticism and is now being embraced by her supporters. The @KamalaHQ account bio text on X reads simply “adding context”, a reference to a much-memed speech where the vice president emphatically recalled a turn of phrase frequently used by her mother. “She would say to us, ‘I don’t know what’s wrong with you young people. You think you just fell out of a coconut tree?'” Harris recollected in 2023 at a White House ceremony, clad in a mauve suit. “You exist in the context of all in which you live and what came before you.” At the time, the somewhat existential-sounding phrase was shared many times over by critics labelling Harris as “crazy”. In the past two days, online users and politicians have latched onto the clip, sometimes sincerely and sometimes ironically, creating coconut-themed posts in support of her candidacy. Even Senator Brian Schatz of Hawaii solidified his endorsement of Harris on X by posting a photo of himself climbing a coconut tree. Colorado Governor Jared Polis simply posted emojis for a coconut, tree and the American flag on X, too. “Kamala has a bunch of word salad quotes that are delightfully nonsensical,” said staffer on Pete Buttigieg’s 2020 campaign and former Biden White House advance staffer Cory Alpert, who describes himself as “chronically online”. “Like you kinda know what she’s trying to say, but it doesn’t really make sense. But it’s the perfect kind of weird authenticity that works online.”","summary":"","url":"https://borneobulletin.com.bn/harris-steps-into-the-limelight/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/07/page-24-a_25072024.jpg","video":null,"publish_date":"2024-07-24 23:01:41","author":null,"language":"en","source_country":"bn","sentiment":-0.096},{"id":252554914,"title":"Letters: Trump’s record | Pushed to GOP | Democrats unite | Parties’ rot | Project 2025","text":"Take a look at Trump’s record with Biden out Re: “Patriotic Biden decision caps a life of service” (Page A6, July 23). We all applaud the service of Joe Biden to our country since 1972. Let us wish Kamala Harris success. She will be running against Donald Trump, who is leading in all the polls. It’s time to review his accomplishments. He added $7.8 trillion to the national debt. The unemployment rate was 6.3% when he left office, an increase of 1.6 percentage points. His 2017 tax cut was the main reason for the increase in debt. He lost 2.9 million jobs. He lost his business license in New York for tax cheating, and was found guilty in the hush money payment case. He must pay $83.3 million to a woman for libel over raping her, and another $454 million to the state of New York for civil fraud. Trump’s charity is banned due to fraud. Trump University was asked to return $25 million to the students. Mohan Raj San Jose Dem policies push small business owners to GOP Re: “GOP adopts effective minority outreach” (Page A9, July 21). It’s not surprising the GOP is making inroads with some minority voters. For decades Democrats have made promises to these groups and have largely failed to deliver. One subset within minority voters the GOP is having success with is small mom-and-pop businesses who are learning the cruel reality of the impact progressive Democrat policies have on their livelihood and quality of life. Soft on crime prosecutors, a regulatory climate penalizing small businesses in favor of large businesses (who can always absorb the costs of new regulations) and ever-increasing prices of energy and utilities due to progressive policies centered around climate mitigation efforts are hammering these small business people. In Republican candidates, they see someone who will at least listen and sympathize with their concerns and advocate for rollbacks of the most onerous policies. I’m not surprised by GOP inroads with these groups. It’s all quite logical. Mark Carbonaro Monterey Now we must unite behind Harris, Dems Sunday was a sad yet beautiful day for us Democrats. Say what you will of Joe Biden’s decision to drop out of the race, can you imagine Joe’s opponent ever doing something like this? Joe has put the country’s needs ahead of his own dreams. By this act alone, our president has managed to define the Democrat Party as a party that puts America first unlike the other party that talks the talk but has yet to walk the walk. I urge everyone to unite behind the Democrat Party and Kamala Harris, the party’s nominee for the presidency. Myokyaw Myint San Jose GOP parade of cowards shows both parties’ rot Once upon a time, we had a presidential candidate who wrote a book called “Profiles in Courage” that provided shining examples of lives well spent and behavior to emulate. Today we have a presidential candidate who orchestrates a parade of groveling cowards each competing in a race to the bottom of the barrel as gross examples of naked opportunism. What’s so great about that? The pervasive rot and division evidenced in our political parties which we deplore up one side and down the other is not the problem we need to solve. It’s merely a glaring symptom of a much deeper, much harder problem. We have collectively abdicated responsibility for our behavior. We have no sense of shame whatsoever. What we deplore in others we only too happily engage in for our own satisfaction. Unless we reverse this trend there will be no more greatness in America. Eugene Ely San Jose Dems should keep focus on Project 2025 By the time the smoke clears on the Democratic candidate at the August Democratic National Convention there will be precious little time left to inform the public about the looming Republican disaster and their horrific Project 2025. Now is the time to act decisively and make use of the 3½ months we have left until the November election. Don Barnby Menlo Park","summary":"Mercury News Letters to the Editor for July 25, 2024","url":"https://www.mercurynews.com/2024/07/24/letters-1807/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/Election_2024_Biden_Drops_Out_60179.jpg?w=1024","video":null,"publish_date":"2024-07-24 23:00:54","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.103},{"id":252554916,"title":"Sheila Jackson Lee dies at 74; longtime Texas congresswoman was ‘a fierce champion of the people’","text":"(CNN) — Sheila Jackson Lee, a longtime Democratic congresswoman from Texas who was an outspoken advocate for Black Americans for decades, has died. She was 74. “Today, with incredible grief for our loss yet deep gratitude for the life she shared with us, we announce the passing of United States Representative Sheila Jackson Lee of the 18th Congressional District of Texas,” her family said in a statement Friday, July 19. Jackson Lee announced in June that she had been diagnosed with pancreatic cancer. At the time, she acknowledged that “the road ahead will not be easy” and said she had “faith that God will strengthen me.” Her family remembered her as “a fierce champion of the people,” saying that “she was affectionately and simply known as ‘Congresswoman’ by her constituents in recognition of her near-ubiquitous presence and service to their daily lives for more than 30 years.” Born Jan. 12, 1950, in Queens, New York, Jackson Lee was among the first women to graduate from Yale University and served as a Houston municipal judge and a city councilwoman before she was first elected to represent Texas’ 18th Congressional District in 1994, unseating a Democratic incumbent in the primary for the Houston-area seat. During her congressional tenure, Jackson Lee was an outspoken advocate for progressive interests and Black Americans. She was one of the sponsors of legislation to establish Juneteenth as a national holiday, frequently spoke out against police brutality and advocated federal legislation to prosecute police misconduct. She was widely admired among progressives for her opposition to the Iraq War and was a fierce critic of former President Donald Trump. She opposed the tallying of electoral votes certifying Trump as the winner of the 2016 election, citing an unfounded claim about “massive voter suppression,” and occasionally used her position on the House Judiciary Committee to excoriate members of Trump’s circle. Although she was unsuccessful in some of her most ambitious aims, Jackson Lee remained an advocate for racial justice, particularly in the wake of George Floyd’s killing at the hands of police in 2020. “We will not stop until the nation knows Black lives matter, and reparations are passed as the most significant civil rights legislation of the 21st century,” Jackson Lee said at a march in Washington in 2020. At the time of her death, she was a chief deputy whip for House Democrats and a vice chair of the Congressional Progressive Caucus. She formerly served as whip of the Congressional Black Caucus. “Congresswoman Jackson Lee was a patriot and a fighter to the very end. Words cannot express the sense of loss our Caucus feels for our beloved friend. She will be deeply missed by all who knew her,” Congressional Black Caucus Chairman Steven Horsford and members of the caucus said in a statement following her death. Jackson Lee’s tenure in Congress was not without controversy. Her ties to Enron – her district included the corporation’s headquarters and it was a major contributor to her early congressional campaigns, The New York Times reported – were scrutinized in the aftermath of its failure in the early 2000s, though she denied taking it easy on the company. And in 2019, she resigned as chairwoman of the nonprofit Congressional Black Caucus Foundation and stepped down from a House Judiciary subcommittee chairmanship after a lawsuit that alleged she fired a staffer who reported sexual assault by a supervisor at the foundation. At the time, Jackson Lee declined to “discuss specific details about internal personnel matters” but otherwise denied the allegations, and the lawsuit was ultimately dismissed by a federal judge in February 2020. Last year, Lee sought the Houston mayorship, earning endorsements from former House Speaker Nancy Pelosi, former President Bill Clinton, former Secretary of State Hillary Clinton and Harris County Judge Lina Hidalgo. She lost in a runoff to Texas state Sen. John Whitmire, a fellow Democrat. Following that loss, Jackson Lee filed to seek a 16th term in Congress, and in March, she won a competitive Democratic primary over former Houston City Council Member Amanda Edwards, a former intern. President Joe Biden remembered Jackson Lee as a “great American,” writing in a statement, “Sheila Jackson Lee is part of a long line of patriots who delivered the promise of America to all Americans. Jill and I send our love and condolences to her family, her constituents, and beloved colleagues of the Congressional Black Caucus.” House Democratic Leader Hakeem Jeffries said in a statement that House Democrats and the city of Houston “mourn a giant,” remembering the congresswoman as “an accomplished legislator, passionate public servant, loving mentor and wonderful friend to so many of us in the Congressional Black Caucus and House Democratic Caucus family.” “I am grateful for her fearless advocacy, fierce determination, formidable service and legacy of leadership,” Jeffries said. Calling her death a “tremendous loss,” Senate Majority Leader Chuck Schumer wrote on X that the congresswoman “fought so hard throughout her life to make our country a better place for all.” On CNN’s “Laura Coates Live,” fellow Texas Rep. Al Green remembered Jackson Lee as “someone in Congress that was always, always working to bring about a just resolution to any problem,” adding that she helped him become a better congressman. In Congress, she developed a reputation for grabbing a seat close to the entranceway in the House chamber for the president’s annual State of the Union address so she could engage with the commander in chief. It wasn’t for the photo opportunities, she insisted to The Huffington Post in 2016, it was also an opportunity to quickly conduct business with presidents. As to why she was able to gain regular access to such a prized perch, she said, “Because of so many good friends, I am welcomed in that seat.” Funeral arrangements are pending, according to the family. “Her legislative victories impacted millions, from establishing the Juneteenth Federal Holiday to reauthorizing the Violence Against Women Act. However, she impacted us most as our beloved wife, sister, mother, and Bebe (grandmother),” her family said Friday. “She will be dearly missed, but her legacy will continue to inspire all who believe in freedom, justice, and democracy.”","summary":"The Houston-area congresswoman, a Democrat, helped establish Juneteenth as a federal holiday and spoke out about police brutality.","url":"https://www.mercurynews.com/2024/07/24/sheila-jackson-lee-long-serving-democratic-congresswoman-and-advocate-for-black-americans-dies-at-74/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/SJM-L-OBLEE-0724.jpg?w=1024","video":null,"publish_date":"2024-07-24 23:00:19","author":"Cnn.com Wire Service","authors":["Cnn.com Wire Service"],"language":"en","source_country":"us","sentiment":0.001},{"id":252556122,"title":"WATCH LIVE: Biden addresses nation after withdrawing from race","text":"President Joe Biden will give an Oval Office address at 8 p.m. Wednesday about the remaining months of his presidency. The remarks are Biden’s first to the nation since he withdrew from the presidential race and endorsed Vice President Kamala Harris on Sunday. “At 8 PM ET, I will address the nation from the Oval Office on what lies ahead, and how I will finish the job for the American people,” Biden wrote on X. Biden was diagnosed with COVID-19 last week and had been recovering at his Rehoboth Beach, Delaware, home until he returned to the White House on Tuesday. He suspended his reelection campaign Sunday night after dozens of elected Democrats called on him to step aside.","summary":"President Joe Biden will give an Oval Office address at 8 p.m. Wednesday about the remaining months of his presidency. The remarks are Biden&#8217;s first to the nation since he withdrew from the presidential race and endorsed Vice President Kamala Harris on Sunday. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER &#8220;At 8 PM [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3097170/watch-live-biden-addresses-nation-after-withdrawing/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/biden-oval-office.webp","video":null,"publish_date":"2024-07-24 23:00:00","author":"Annabella Rosciglione","authors":["Annabella Rosciglione"],"language":"en","source_country":"US","sentiment":-0.361},{"id":252555620,"title":"Joe Biden to frame dropping out of race as ‘defence of democracy’","text":"Then 69 € per month. Complete digital access to quality FT journalism. Cancel anytime during your trial. Global news & analysisExpert opinionFT App on Android & iOSFT Edit appFirstFT: the day's biggest stories20+ curated newslettersFollow topics & set alerts with myFTFT Videos & Podcasts20 monthly gift articles to shareLex: FT's flagship investment column15+ Premium newsletters by leading expertsFT Digital Edition: our digitised print edition Weekday Print EditionFT WeekendFT Digital EditionGlobal news & analysisExpert opinionSpecial featuresExclusive FT analysis FT Digital EditionGlobal news & analysisExpert opinionSpecial featuresExclusive FT analysis Global news & analysisExpert opinionFT App on Android & iOSFT Edit appFirstFT: the day's biggest stories20+ curated newslettersFollow topics & set alerts with myFTFT Videos & Podcasts10 monthly gift articles to share Global news & analysisExpert opinionFT App on Android & iOSFT Edit appFirstFT: the day's biggest stories20+ curated newslettersFollow topics & set alerts with myFTFT Videos & Podcasts20 monthly gift articles to shareLex: FT's flagship investment column15+ Premium newsletters by leading expertsFT Digital Edition: our digitised print edition Everything in PrintWeekday Print EditionFT WeekendFT Digital EditionGlobal news & analysisExpert opinionSpecial featuresExclusive FT analysisPlusEverything in Premium Digital Everything in Standard DigitalGlobal news & analysisExpert opinionSpecial featuresFirstFT newsletterVideos & PodcastsFT App on Android & iOSFT Edit app10 gift articles per monthExclusive FT analysisPremium newslettersFT Digital Edition10 additional gift articles per month Make and share highlightsFT WorkspaceMarkets data widgetSubscription ManagerWorkflow integrationsOccasional readers go freeVolume discount FT Weekend Print deliveryPlusEverything in Standard Digital FT Weekend Print deliveryPlusEverything in Premium Digital","url":"https://www.ft.com/content/0d56bc44-9afb-4d0d-a756-4341ea72121f","image":null,"video":null,"publish_date":"2024-07-24 22:58:34","author":null,"language":"en","catgory":"politics","source_country":"gb","sentiment":0.312},{"id":252555454,"title":"This really grinds the “Veep” showrunner's gears about those Kamala Harris–Selina Meyer comparisons","text":"Five years after it went off the air, Veep's popularity has reached an all-time high thanks to life seemingly imitating art. While showrunner David Mandel, who took over from series creator Armando Iannucci in season 5, is happy at the resurgence, something about the Kamala Harris–Selina Meyer comparisons doesn't sit well with him. When President Joe Biden announced he would not seek reelection and endorsed his VP, Harris, fans of the acclaimed HBO comedy immediately thought of the very similar situation from the season 2 finale: Julia Louis-Dreyfus' Meyer informs her staff that POTUS won't be running for reelection and that she intends to run for the highest office in the land. Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more. \"First, I love that apparently Kamala is a Veep fan,\" Mandel told The Hollywood Reporter. \"I think it’s great. I think it’s great that she has a sense of humor, because we’ve seen the other side that has no sense of humor.\" However, Mandel says he is \"driven crazy\" when people try to use Veep and Selina Meyer to \"diminish\" Harris. \"But there are two types of people doing Veep memes right now: There are people really enjoying Selina’s moment of telling her staff that she’s running for president; there’s a joy there that’s fun and nice and celebratory,\" he continued. \"And then there are assholes who are using it differently. Surprise surprise, Kamala is a woman of color, and it seems like those people are using it as a simple way of insulting her. So I don’t like that part.\" Expanding on the idea of people \"trying to hang Selina around Kamala’s neck,\" Mandel argues that Donald Trump is the \"Selina-est candidate,\" noting that he's, \"Vain, worried about his looks, has a ridiculously better relationship with his body people than his own children, petty, vindictive, worries about his own money, doesn’t believe what he says, says whatever to get elected.\" Also, both Trump and Selina openly hate women, though Mandel adds that at least Selina had some kind of moral compass because she \"held firm\" in her belief in a woman's right to choose. That is definitely where the similarities end.","summary":"David Mandel loves that Harris loves the show, but thinks Trump is the &#39;Selina-est&#39; candidate.","url":"https://ew.com/veep-showrunner-thoughts-on-kamala-harris-selina-meyer-comparisons-8683285","image":"https://ew.com/thmb/-b5c7FvK1zqDQ2hZGOP9U-ifqOg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Kamala-HarrisSelina-Meyer-072424-c457cc5503c94e8e8f1b2a567be9456a.jpg","video":"https://content.jwplatform.com/videos/C4NqOBcC-GQ0UtFMY.mp4","publish_date":"2024-07-24 22:56:57","author":"Lester Fabian Brathwaite","authors":["Lester Fabian Brathwaite"],"language":"en","source_country":"US","sentiment":0.262},{"id":252554836,"title":"Joe Biden speech LIVE updates: US President to address nation after stepping down as Democratic presidential nominee","text":"US elections are often won and lost on the usual battlegrounds (Michigan, Pennsylvania, Wisconsin) but both Vice President Kamala Harris and Republican presidential candidate Donald Trump have hit North Carolina multiple times this year because party strategists believe this swing state could be critical come November. Trump won North Carolina by a tiny 1.4 per cent in 2020, but Republicans fear the Dems could flip it this year, so they’ve embarked on a strategy called ‘Operation Domino’ to help Trump retain the state. While US elections tend to centre on the usual battlegrounds – Pennsylvania, Wisconsin, and Arizona among them – party strategists believe the 2024 path to the Oval Office runs through volatile, swinging North Carolina, where Republicans, Democrats and independents each account for about a third of the voting population. It’s here that the conservative-dominated state legislature recently redrew the congressional map to give Republicans an advantage – a process known as partisan “gerrymandering” – which could help the party flip several Democrat seats in Congress. Read the full story on election battlegrounds here.","summary":"United States President Joe Biden is set to speak from the Oval Office, the first formal speech since he announced he was no longer running for president.","url":"https://www.theage.com.au/world/north-america/joe-biden-speech-live-updates-us-president-to-address-nation-after-stepping-down-as-democratic-presidential-nominee-20240725-p5jwe7.html","image":"https://static.ffx.io/images/$zoom_0.2177668106107341%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_35/t_crop_custom/q_86%2Cf_auto/947e9b566a338e066a6e1d3a5ecc4322db2f6678","video":null,"publish_date":"2024-07-24 22:55:59","author":"Olivia Ireland","authors":["Olivia Ireland"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.15},{"id":252554626,"title":"Joe Biden speech LIVE updates: US President to address nation after stepping down as Democratic presidential nominee","text":"US elections are often won and lost on the usual battlegrounds (Michigan, Pennsylvania, Wisconsin) but both Vice President Kamala Harris and Republican presidential candidate Donald Trump have hit North Carolina multiple times this year because party strategists believe this swing state could be critical come November. Trump won North Carolina by a tiny 1.4 per cent in 2020, but Republicans fear the Dems could flip it this year, so they’ve embarked on a strategy called ‘Operation Domino’ to help Trump retain the state. While US elections tend to centre on the usual battlegrounds – Pennsylvania, Wisconsin, and Arizona among them – party strategists believe the 2024 path to the Oval Office runs through volatile, swinging North Carolina, where Republicans, Democrats and independents each account for about a third of the voting population. It’s here that the conservative-dominated state legislature recently redrew the congressional map to give Republicans an advantage – a process known as partisan “gerrymandering” – which could help the party flip several Democrat seats in Congress. Read the full story on election battlegrounds here.","summary":"United States President Joe Biden is set to speak from the Oval Office, the first formal speech since he announced he was no longer running for president.","url":"https://www.smh.com.au/world/north-america/joe-biden-speech-live-updates-us-president-to-address-nation-after-stepping-down-as-democratic-presidential-nominee-20240725-p5jwe7.html","image":"https://static.ffx.io/images/$zoom_0.2177668106107341%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_35/t_crop_custom/q_86%2Cf_auto/947e9b566a338e066a6e1d3a5ecc4322db2f6678","video":null,"publish_date":"2024-07-24 22:55:59","author":"Olivia Ireland","authors":["Olivia Ireland"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.15},{"id":252554688,"title":"Biden will explain why he chose not to run in 2024 and start to shape his legacy in Oval Office address","text":"WASHINGTON – Insisting that “the defense of democracy is more important than any title,” President Joe Biden on Wednesday will explain in an Oval Office address his decision to drop his bid for reelection and to throw his support behind Vice President Kamala Harris. The address will offer the public their first chance to hear directly from Biden his rationale for dropping out of the 2024 after weeks of insisting he believed himself to be the best candidate to take on former President Donald Trump, whom he has called an existential threat to the nation’s democracy. It will also give Biden a chance to try to shape how history views his one and only term in office. “The defense of democracy is more important than any title,” Biden will say according to excerpts released by the White House. “I draw strength, and find joy, in working FOR the American people. But this sacred task of perfecting our Union is not about me. It’s about you. Your families. Your futures. It’s about ‘We the People.’” Biden’s candidacy faced a crisis of confidence from Democrats after his abysmal debate against Trump nearly a month ago, where he spoke haltingly, appeared ashen and failed to rebut his predecessor’s attacks. It sparked a mutiny within his party over not just whether he was capable of beating Trump in November, but also whether at 81, he was still fit for the high-pressure job. Biden tried to outlast the skepticism and quell the concerns with interviews and tepid rallies, but the pressure to step aside only mounted from the party’s political elites and from ordinary voters. On Sunday afternoon while isolating at his Rehoboth Beach, Delaware, home with COVID-19, Biden finally bowed in a letter posted to his account on X announcing his decision to leave the race, followed up later by an endorsement of Harris. “I have decided the best way forward is to pass the torch to a new generation,” Biden was set to say Wednesday. “That is the best way to unite our nation.” Biden’s address is being carried by the major television news networks. He is set to pledge to remain focused on being president until his term expires at noon on Jan. 20, 2025. The president was hoping to use the address to outline the stakes in the election, which both Biden and Harris have framed as a choice between freedom and chaos, but was expected to try to steer clear of overt campaigning from his official office. “The great thing about America is here, kings and dictators do not rule,” Biden was set to say. “The people do. History is in your hands. The power is in your hands. The idea of America — lies in your hands.” Press secretary Karine Jean-Pierre said Wednesday that any question of Biden resigning his office — which would allow Harris to run as an incumbent — was “ridiculous.” Jean-Pierre said Biden has “no regrets” about his decision to stay in the race as long as he did, or his decision to quit it over the weekend. She said Biden’s decision had nothing to do with his health.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – Insisting that “the defense of democracy is more important than&#8230;\n\n\nThis Post: Biden will explain why he chose not to run in 2024 and start to shape his legacy in Oval Office address first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/biden-will-explain-why-he-chose-not-to-run-in-2024-and-start-to-shape-his-legacy-in-oval-office-address/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Biden-to-use-Oval-Office-address-to.jpg","video":null,"publish_date":"2024-07-24 22:54:50","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.026},{"id":252555424,"title":"Harris asks for 2024 support from women of colour during an address at a historically Black sorority","text":"INDIANAPOLIS - Vice President Kamala Harris told members of the historically Black sorority Zeta Phi Beta on Wednesday that \"we are not playing around\" and asked for their help in electing her president in November. \"In this moment, I believe we face a choice between two different visions for our nation, one focused on the future, the other focused on the past,\" she said in a speech three days after after launching her bid for the White House. \"And with your support, I am fighting for our nation's future.\" Voters in Indiana haven't backed a Democratic presidential candidate in nearly 16 years. But Harris, a woman of Black and South Asian descent, was speaking to a group already excited by her historic status as the likely Democratic nominee and one that her campaign hopes can expand its coalition. America Votes: Latest U.S. election news and analysis from a Canadian perspective On Wednesday, she thanked the room full of women for their work electing her vice president, and Joe Biden president. \"And now, in this moment, our nation needs your leadership once again,\" she said. In a memo released Wednesday, campaign chair Jen O'Malley Dillon pointed to support among female, nonwhite and younger voters as critical to success. \"Where Vice President Harris goes, grassroots enthusiasm follows,\" O'Malley Dillon wrote. \"This campaign will be close, it will be hard fought, but Vice President Harris is in a position of strength -- and she's going to win.\" Still, Democrats face challenges as the country is nursing frustrations over higher prices following a spike in inflation, while Donald Trump, the Republican nominee, survived a recent assassination attempt that further energized his already loyal base. But the memo was more optimistic than the narrow path the campaign saw after the 81-year old Biden delivered a disastrous debate performance in June. He quit the race Sunday. The information you need to know, sent directly to you: Download the CTV News App Harris mentioned he'd be addressing the nation later Wednesday on why he decided to step aside, and called him a \"leader with a bold vision.\" \"We are all deeply, deeply grateful for his service to our nation,\" she said before turning to contrast the administration's agenda with that of Trump's. \"These extremists want to take us back, but we are not going back,\" she said. \"All across our nation we are witnessing a full-on assault on hard-fought, hard-won freedoms and rights.\" She cited the freedom to vote, to be safe from gun violence, to love whom you want to love openly, to \"learn and acknowledge our true and full history,\" and the freedom \"of a woman to make decisions about her body and not have her government telling her what to do.\" She landed in Houston later Wednesday, visiting the city's emergency operations centre to discuss the ongoing recovery efforts following Hurricane Beryl and to thank emergency management and first responders. On Thursday, she's speaking at the national convention of the American Federation of Teachers, which has endorsed her candidacy. While the campaign will keep emphasizing what it calls its Blue Wall of states -- Michigan, Wisconsin and Pennsylvania -- to get the needed 270 electoral votes, Harris hopes to be competitive in North Carolina, Georgia, Arizona and Nevada as well. Trump has generally run stronger with white voters who do not hold a college degree. AP VoteCast, a comprehensive survey of voters and nonvoters that aims to tell the story behind election results, found that group made up 43 per cent of all voters in 2020 and Trump won them by a margin of 62 per cent to 37 per cent, even though overall he lost the election. For Democrats, Black women would probably make a fundamental difference in November, and Harris has already shown signs of galvanizing their support. In the 2020 election, AP VoteCast found that Black women were just seven per cent of the electorate. But 93 per cent of them voted for Biden, helping to give him narrow victories in states such as Michigan, Pennsylvania and Georgia. After Harris announced her candidacy, roughly 90,000 Black women logged onto a video call Sunday night for her campaign. It was a sudden show of support for an alumni of Howard University and sister in the Alpha Kappa Alpha sorority who has made Beyonce's song \"Freedom\" her walk-on music at events.","summary":"Vice President Kamala Harris told members of the historically Black sorority Zeta Phi Beta on Wednesday that 'we are not playing around' and asked for their help in electing her president in November.","url":"https://www.ctvnews.ca/world/harris-asks-for-2024-support-from-women-of-colour-during-an-address-at-a-historically-black-sorority-1.6976526","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/7/24/u-s--vice-president-kamala-harris-1-6976554-1721861241166.jpg","video":null,"publish_date":"2024-07-24 22:50:38","author":"Josh Boak,The Associated Press","authors":["Josh Boak","The Associated Press"],"language":"en","source_country":"ca","sentiment":0.108},{"id":252554504,"title":"Nantucket wind-farm wreck reveals the true cost of the left’s green energy push","text":"Joe Biden’s presidency isn’t the only thing in freefall this summer. On July 13, a massive blade from a wind turbine nearly as tall as the Eiffel Tower collapsed into Nantucket Sound, throwing the Massachusetts tourist destination into economic crisis at the height of the summer season and creating a political headache for the green warriors who have championed these costly and unproven boondoggles. Yet media coverage has been notably subdued, even though miles of the island’s famous ocean beaches had to be closed for days due to the dangerous debris. After all, the Biden-Harris administration has pledged to generate 30 gigawatts of offshore wind by 2030, a national imperative they won’t abandon come hell or dirty water. For comparison, the $4 billion Nantucket wind farm currently collapsing into the Atlantic had hoped to generate a mere 0.8 gigawatts — meaning the administration’s wind scheme offers 37 times as much potential economic and environmental disaster. When the Vineyard Wind project that broke down so horrifically this month was greenlit by Biden’s Department of Interior in May 2021, it was billed as “the first large-scale, offshore wind project in the United States.” Three years later, it’s falling apart for no apparent reason, with no storm or adverse weather to blame. Literally, a wind farm was broken by the wind. The implications are worth considering as Vice President Kamala Harris, a climate zealot who ran to Biden’s left in the 2020 Democratic primary as an early and unabashed champion of the Green New Deal, takes her imperiled party’s reins. The “blade failure incident,” as it has been generously dubbed by its corporate supporters, has left a trail of damage in its wake. “Large floating debris and sharp fiberglass shards” led to the immediate closure of Nantucket’s famous south-facing ocean beaches, the Boston Herald reported. At 300 feet long, each individual blade is the length of a football field, so the shattered turbine arm threw off plenty of wreckage: more than six truckloads’ worth was collected, with more still washing up this week. Opponents of the wind farm had projected it would cost Nantucket’s tourism industry as much as $800 million over the next 30 years as they blighted the island’s pristine horizon. Yet like the movie “Jaws,” this month’s incident and its forced beach closures had an even more immediate effect. “This is the time of the year where every day is like a week to me for earning,” the owner of a local surf shop lamented during a recent hearing of the Nantucket Select Board. “Nobody has any answers … everyone has said it’s pretty clear they have no idea how long this is going to take.” The lack of accountability from those responsible for the project has been a common theme. “You’re kind of good at saying nothing in a whole lot of words,” one local woman railed against Vineyard Wind CEO Klaue Moeller when he met with residents on July 18. Far from instilling confidence or providing answers, the Vineyard Wind clean-up crew instead managed to get their Jeep stuck in the sand, drawing mockery as a symbol of the company’s ineptitude. Lest you dismiss Vineyard Wind as an isolated bad actor, take a look at other offshore wind projects. In New Jersey, offshore wind power conglomerate Orsted scrapped its projects after deeming them no longer financially feasible. The Danish company paid Garden State taxpayers only $125 million of the $300 million it owed, despite New Jersey Governor Phil Murphy vowing to “fight like hell” to get all the money back. Questions remain about wind farms’ role in the death of endangered right whales. Meanwhile, wind turbines are undeniably causing the deaths of millions of birds each year. In New England, the feds have shut down Vineyard Wind’s operations until the damage from the blade has been contained. But rest assured, a Democratic Party led by Kamala Harris will be back for more — much more. In her first remarks after Biden’s weekend bow-out, she claimed that their “legacy of accomplishment over the past three years is unmatched in modern history.” Of course, the centerpiece of the left’s list of Biden “accomplishments” is the 2022 Inflation Reduction Act, which included $369 billion worth of green giveaways. And during her ill-fated 2020 run for president, Harris wanted to spend exponentially more on crazy climate projects — to the tune of $10 trillion in public and private funding. If you live in New England, watch your head: falling blades from failing wind farms could be launched your way at any moment — all in the name of “climate science.” Daniel Turner is founder and executive director of Power The Future, a nonprofit advocate for American energy jobs.","summary":"A Massachusetts wind farm was literally broken by the wind, ruining the island's summer season and creating a political headache for the left.","url":"https://nypost.com/2024/07/24/opinion/nantucket-wind-farm-wreck-reveals-the-costs-of-green-energy/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/NANAMAN1.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-24 22:48:43","author":"Daniel Turner","authors":["Daniel Turner"],"language":"en","source_country":"us","sentiment":-0.365},{"id":252554542,"title":"Harris campaign casts wider net for VP and looks outside elected office for candidates","text":"Vice President Kamala Harris is reportedly casting a wider net in her search for a running mate, looking to current administration officials, Democratic lawmakers and potentially other high-profile figures who do not currently hold elected office. It previously appeared that Harris had winnowed her list to just two people. But with a team helping her vet a pool of potential vice presidential picks, that number seems to be growing, with only two weeks left to decide. Harris is now vetting roughly a dozen candidates, including Commerce Secretary Gina Raimondo and Transportation Secretary Pete Buttigieg, according to CBS News. That list adds to previously reported candidates including Kentucky Governor Andy Beshear, North Carolina Governor Roy Cooper, Senator Mark Kelly of Arizona, Illinois Governor JB Pritzker, Pennsylvania Governor Josh Shapiro, Minnesota Governor Tim Walz, and Michigan Governor Gretchen Whitmer. That campaign is also looking at people who are not holding office, according to CBS. The presumptive Democratic presidential nominee has moved quickly to unite members of Congress and a majority of Democratic delegates around her candidacy within days of President Joe Biden ending his re-election campaign and endorsing his vice president. She recently tapped former attorney general Eric Holder to help vet potential running mates. A team working with Holder, the nation’s first Black attorney general who served for six years during Barack Obama’s administration, started conversations with potential running mates earlier this week. Within 24 hours of its launch, her campaign pulled in more than $81m in donations – marking the biggest single-day raise in presidential history – leaving Biden’s running mate-turned-preferred nominee standing to inherit the president’s massive campaign war chest, which now faces legal threats from Donald Trump’s campaign. By Monday night, she clinched a majority of Democratic delegates to secure the party’s nomination at next month’s Democratic National Convention in Chicago. Harris’s team is planning to wrap up its vetting process before August 7 to meet an Ohio deadline that requires nominees to be certified by 90 days before Election Day in order to get on the ballot. The Democratic National Committee will hold its convention on August 19, where Harris is expected to formally receive the party’s nomination. On Wednesday, Democrats announced a compressed schedule for other candidates to enter the race for the nomination, with a submission window that closes on Saturday night. By July 30, candidates must have secured at least 300 delegate signatures. Electronic voting by the delegates is expected to begin as soon as August 1. Delegates are poised to nominate Harris by virtual vote by August 7.","summary":"A dozen Democratic figures are reportedly now in consideration as Harris rallies the party around her candidacy","url":"https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-running-mate-vice-president-b2585460.html","image":"https://static.independent.co.uk/2024/07/24/22/2163508766.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/Jfo7Nywz-4VHSaSK0.mp4","publish_date":"2024-07-24 22:46:22","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.117},{"id":252555024,"title":"From Oval Office, Biden begins his farewell to U.S. politics","text":"WASHINGTON >> President Joe Biden will tell Americans on Wednesday night it is time to “pass the torch to a new generation” in an Oval Office address to explain why stepped aside from the 2024 in what amounts to a long goodbye after a 50 years of public service. “The great thing about America is here, kings and dictators do not rule. The people do. History is in your hands. The power is in your hands. The idea of America — lies in your hands,” Biden will say, according to speech excerpts released by the White House ahead of his 8 p.m. EDT (0000 GMT/Thursday) speech. It will be his first extended public remarks since he relented to pressure from fellow Democrats and announced on Sunday via social media that he had decided not to seek reelection on Nov. 5. Biden is the first incumbent president not to seek reelection since 1968 when Lyndon Johnson, under fire for his handling of the Vietnam War, abruptly pulled out of the campaign on March 31. Besides Johnson, Biden joins James K. Polk, James Buchanan, Rutherford B. Hayes, Calvin Coolidge and Harry Truman, who all decided not to stand for a second elected term. “I have decided the best way forward is to pass the torch to a new generation. That is the best way to unite our nation,” he said in the speech excerpts. Biden faced calls to step aside after his rocky performance in the June 27 debate against Republican Donald Trump raised troubling questions about his mental acuity. The White House has denied that Biden has any cognitive issues despite a recent increase in verbal slipups. Biden will say he will focus on his job as president over his remaining six months in office. It will be the fourth time Biden will use the formal setting of the Oval Office since taking office in 2021. His last Oval Office speech was on July 15 when he urged Americans to cool the political rhetoric after the attempted assassination of Trump.","summary":"WASHINGTON >> President Joe Biden will tell Americans on Wednesday night it is time to &#8220;pass the torch to a new generation&#8221; in an Oval Office address to explain why stepped aside from the 2024 in what amounts to a long goodbye after a 50 years of public service. &#8220;The great thing about America is here, kings and dictators do not rule. The people do. History is in your hands. The power is in your hands. The idea of America &#8212; lies in your hands,&#8221; Biden will say, according to speech excerpts released by the White House ahead of his 8 p.m. EDT (0000 GMT/Thursday) speech.","url":"https://www.staradvertiser.com/2024/07/24/breaking-news/from-oval-office-biden-begins-his-farewell-to-u-s-politics/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_2024-07-23T180944Z_932823580_RC2319A3JR8X_RTRMADP_3_USA-ELECTION-BIDEN.JPG","video":null,"publish_date":"2024-07-24 22:43:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.245},{"id":252554334,"title":"Doctors say Biden exiting race may be best health move, plus a history of presidential illnesses","text":"DOCTORS' APPROVAL – Two doctors explain why President Biden's decision to back out of the 2024 election may have been best for his health. Continue reading… VIRAL CONCERNS – As President Biden makes his first public appearance since contracting COVID-19, concerns about his health persist. Continue reading… MEDICAL HISTORY – Before Joe Biden, these 5 past presidents battled health issues ahead of re-election. Continue reading… DEADLY BACTERIA - A listeria infection linked to deli meats has killed two people and infected 28 across the U.S., the CDC warns. Continue reading… DEMENTIA DISCOVERY - Mayo Clinic has identified a new type of memory loss that’s often mistaken for Alzheimer’s. Doctors break down the findings. Continue reading… ‘STAY BEAUTIFUL’ – A new study from the University of Vermont found that Taylor Swift has had a mostly positive impact on body image and diet culture. Experts weigh in. Continue reading… REST ON THE ROAD – Sleep and travel don't always mix. Experts share 7 tips on how to get restful sleep during the summer vacation season. Continue reading… TRAIL TRAGEDY – Another heat-related hiking death spotlights the need for safety protocols. Experts share 9 things to know before heading on an outdoor adventure. Continue reading… ASK A DOCTOR – \"Is it safe to swim underwater with your eyes open?\" Ophthalmologist Dr. Brian Boxer Wachler has the answer. Continue reading… FOLLOW FOX NEWS ON SOCIAL MEDIA Facebook Instagram YouTube Twitter LinkedIn SIGN UP FOR OUR NEWSLETTERS Fox News First Fox News Opinion Fox News LifestyleFox News Health Fox News Autos Fox News Entertainment (FOX411) DOWNLOAD OUR APPS Fox News Fox Business Fox Weather Fox Sports Tubi WATCH FOX NEWS ONLINE Fox News Go STREAM FOX NATION Fox Nation","summary":"The Fox News Health Newsletter brings you trending and important stories about health warnings, drug shortages, mental health issues and more in this weekly recap.","url":"https://www.foxnews.com/health/docs-say-biden-exiting-race-may-best-health-move-history-presidential-illnesses","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/524/biden-covid-wilson-split.png?ve=1&tl=1","video":null,"publish_date":"2024-07-24 22:42:03","author":null,"language":"en","source_country":"US","sentiment":0.26},{"id":252554820,"title":"'A narrative you love': White House slams Doocy’s 'cover up' claim","text":"Three days after President Joe Biden heeded the call of his Party’s leaders and ended his re-election campaign, White House Press Secretary Karine Jean-Pierre blasted Fox News’s Peter Doocy for alleging a long-term “cover-up” of the President’s health had taken place. President Biden, who returned to the White House Tuesday after a week-long slog with COVID, will address the nation Wednesday night in a rare Oval Office primetime speech, to explain his historic and nearly unprecedented decision to exit the race and endorse Vice President Kamala Harris. “It would seem that the White House knew that President was slipping. And it was hidden from the American people. So who ordered White House officials to cover up a declining president?” asked Doocy, who has been a thorn in the administration’s side for much of Biden’s term. “I know that that is a narrative that you love,” Jean-Pierre reminded him. “He did a press conference at NATO, ‘I’m in it,’ ” Doocy charged. ‘There’s all these things to finish,’ and then ten days later, ‘I’m dropping out.’ ” READ MORE: Trump Said Some Disabled People – Including His Young Relative – Should Just ‘Die’: Nephew “First of all, there’s been no cover up,” Jean-Pierre declared. “I want to be very clear about that. I know that is the narrative that you all want. It is not.” “I’m going to say this again, and, you’re going to hear it directly from the President – I hope you listen tonight. I think it’s going to be incredibly powerful and important, the Oval Office, as you know, when they make speeches from the Oval Office it’s because they want to directly make sure that the American people hear it from them. Obviously going to be done in primetime. I would listen to the President.” “And then what I will say is that it is not easy,” she continued, “making a decision that the President made on Sunday, it is just not. It is not . And as all you have you reported, it is historic. It is unusual. This is not the norm, and making a decision like that for someone who has been in public service for 54 years. U.S. Senator for 36, Vice President to President Obama for eight, and now a first term as president himself. These are not easy decisions to make. They’re just not. And so the fact that he was able to make that decision in a selfless way. That’s admirable.” Jean-Pierre’s assertion the mainstream media wants to promote a “cover-up” narrative is substantiated by MSNBC’s Elise Jordan, who in video that aired Wednesday asked a focus group, “Who do you blame for President Biden’s being in office in this condition?” and then, “Who deserves the blame?” READ MORE: Under Consideration for VP, Buttigieg Refuses to Speculate on Being Harris’ Running Mate Professor and media critic Jeff Jarvis responded, “Hang that in the museum of dead journalism, in the collection of leading questions.” Jarvis added Jordan then – referring to Vice President Kamala Harris – said: “If she’s willing to hide that kind of information…. Is is it a power grab or…?” Watch the video of Doocy and Jean-Pierre below or at this link. READ MORE: Buttigieg Praises Harris’s Focus on ‘People’s Families’ – Slams Vance’s ‘Childless’ Attack","summary":"Three days after President Joe Biden heeded the call of his Party’s leaders and ended his re-election campaign, White House Press Secretary Karine Jean-Pierre blasted Fox News’s Peter Doocy for alleging a long-term “cover-up” of the President’s health had taken place.\n\nPresident Biden, who returned to the White House Tuesday after a week-long slog with COVID, will address the nation Wednesday night in a rare Oval Office primetime speech, to explain his historic and nearly unprecedented decision to exit the race and endorse Vice President Kamala Harris.\n\n“It would seem that the White House knew that President was slipping. And it was hidden from the American people. So who ordered White House officials to cover up a declining president?” asked Doocy, who has been a thorn in the administration’s side for much of Biden’s term.\n\n“I know that that is a narrative that you love,” Jean-Pierre reminded him.\n\n“He did a press conference at NATO, ‘I’m in it,’ ” Doocy charged. ‘There’s all these things to finish,’ and the","url":"https://www.alternet.org/white-house-peter-doocy/","image":"https://www.alternet.org/media-library/image.png?id=52969497&width=1200&height=600&coordinates=0%2C0%2C0%2C52","video":null,"publish_date":"2024-07-24 22:39:08","author":"David Badash","authors":["David Badash"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.078},{"id":252554582,"title":"The fight to define Harris is on. And for now, Republicans are dominating Democrats on the airwaves","text":"NEW YORK (AP) — Just days into her new role as the Democratic Party’s likely presidential nominee, Kamala Harris is already facing a wave of Republican-backed attack ads questioning her personality, her progressive record and what she knew about President Joe Biden’s decline. But for now, at least, Democrats have yet to engage in the summertime advertising fight. And in a sharp reversal from much of the year, Republicans are suddenly dominating the airways. Overall, Trump and his allies are outspending Harris’ team 25-to-1 on television and radio advertising — more than $68 million for Republicans compared to just $2.6 million for Democrats — in the period that began on Monday, the day after Biden stepped aside, through the end of August, according to an AP analysis of data compiled by the media tracking firm AdImpact. The stunning disparity reflects actual spending for this week and reservations for subsequent weeks, which will almost certainly change in the coming days. But for now, the numbers highlight a dangerous imbalance for Democrats at the very moment that millions of voters are re-shaping their opinions of the vice president, who has spent much of the last four years in Biden’s shadow. Some Harris allies are already sounding the alarm. “Public opinion is like cement. It’s soft at first and then it hardens,” said Sarah Longwell, co-founder of Republican Voters Against Trump. “The next three weeks are definitive. She needs to define herself before Trump defines her.” The Harris campaign had no immediate comment. To be sure, Harris only earned Biden’s endorsement on Sunday. And in the days since, friends and foes agree that she’s benefited from a flood of so-called “earned” news media coverage, much of it positive. Trump pollster Tony Fabrizio described it as “Harris’ honeymoon” in a memo on Tuesday that predicted a surge in the polls for the Democratic vice president. Meanwhile, Harris’ team has the money to launch a robust advertising campaign whenever it wants to. Her campaign raised a jaw-dropping $100 million between Sunday afternoon as of Monday night alone. And allies, led by the super PAC Future Forward, received donor commitments of $150 million in the first 24 hours after Biden left the race. “Obviously, advertising is important and will pick up, but it’s not the only factor,” said Democratic strategist Josh Schwerin. “With Harris taking over as the presumptive nominee, she’s getting wall-to-wall largely positive coverage. … You always need to take in the context of the entire media ecosystem.” Still, some of the Harris attack ads may be beginning to shape the narrative. Biden allies privately raised concerns about a new ad from Pennsylvania Republican Senate candidate Dave McCormick that describes Harris as “the most liberal nominee ever.” The ad highlights her progressive positions on immigration, policing, energy and health care. It ends with audio of Harris’ loud laugh, which has been a frequent Republican focus. Trump’s campaign has been largely silent on the airwaves since he emerged as his party’s presumptive presidential nominee this spring. The delay in ad spending reflected, in part, the former president’s financial challenges following an expensive primary and overwhelming legal bills. Backed by allied super PACs that are running tens of millions in ads this summer, however, the Trump campaign can also afford to wait until more voters are paying attention this fall to pour money into advertising. The pro-Trump Preserve America super PAC, backed by casino magnate Miriam Adelson, has reserved $45 million worth of advertising through the end of August. MAGA Inc. has booked another $23 million. Democrats, meanwhile, just halted its advertising spending after devoting enormous sums to boost Biden in the weeks and months before he dropped out. Overall, Biden’s campaign spent more than $138 million on advertising between Jan. 1 of this year through Sunday, when he announced his decision to step aside. While much of the advertising went after Trump, the ads also featured Biden, who is no longer a candidate and largely viewed as a political liability for Harris. It is only a matter of time, days perhaps, before Harris and her allies ramp up their advertising plans. While AdImpact found only about $2.6 million in Democratic-backed ad reservations through the end of August, the pro-Biden super PAC Future Forward is set to begin rolling out a $129 million advertising campaign in September. But for now, voters are only seeing presidential ads that knock Harris. One of them, from MAGA Inc., blames the vice president for “a border invasion, runaway inflation,” and the death of the American dream. “Kamala knew Joe couldn’t do the job, so she did it,” says the narrator in the spot that started running Sunday across Pennsylvania, Georgia and Arizona. “They created this mess. They — no, Kamala — owns this failed record.” Steve Peoples, The Associated Press","summary":"NEW YORK (AP) — Just days into her new role as the Democratic Party&#8217;s likely presidential nominee, Kamala Harris is already facing a wave of Republican-backed attack ads questioning her personality, her progressive record and what she knew about President Joe Biden&#8217;s decline. But for now, at least, Democrats have yet to engage in the [&#8230;]","url":"https://toronto.citynews.ca/2024/07/24/the-fight-to-define-harris-is-on-and-for-now-republicans-are-dominating-democrats-on-the-airwaves/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/07/8f207342-291c-4ab7-aaad-e290a7fa6254.jpg","video":null,"publish_date":"2024-07-24 22:38:52","author":"News Staff,Steve Peoples","authors":["News Staff","Steve Peoples"],"language":"en","catgory":"politics","source_country":"ca","sentiment":0.043},{"id":252554580,"title":"Biden to use Oval Office address to explain his decision to quit 2024 race, begin to shape legacy","text":"WASHINGTON (AP) — Insisting that “the defense of democracy is more important than any title,” President Joe Biden on Wednesday will explain in an Oval Office address his decision to drop his bid for reelection and to throw his support behind Vice President Kamala Harris. The address will offer the public their first chance to hear directly from Biden his rationale for dropping out of the 2024 after weeks of insisting he believed himself to be the best candidate to take on former President Donald Trump, whom he has called an existential threat to the nation’s democracy. It will also give Biden a chance to try to shape how history views his one and only term in office. “The defense of democracy is more important than any title,” Biden will say according to excerpts released by the White House. “I draw strength, and find joy, in working FOR the American people. But this sacred task of perfecting our Union is not about me. It’s about you. Your families. Your futures. It’s about ‘We the People.’” Biden’s candidacy faced a crisis of confidence from Democrats after his abysmal debate against Trump nearly a month ago, where he spoke haltingly, appeared ashen and failed to rebut his predecessor’s attacks. It sparked a mutiny within his party over not just whether he was capable of beating Trump in November, but also whether at 81, he was still fit for the high-pressure job. Biden tried to outlast the skepticism and quell the concerns with interviews and tepid rallies, but the pressure to step aside only mounted from the party’s political elites and from ordinary voters. On Sunday afternoon while isolating at his Rehoboth Beach, Delaware, home with COVID-19, Biden finally bowed in a letter posted to his account on X announcing his decision to leave the race, followed up later by an endorsement of Harris. “I have decided the best way forward is to pass the torch to a new generation,” Biden was set to say Wednesday. “That is the best way to unite our nation.” Biden’s address is being carried by the major television news networks. He is set to pledge to remain focused on being president until his term expires at noon on Jan. 20, 2025. “The great thing about America is here, kings and dictators do not rule. The people do. History is in your hands. The power is in your hands. The idea of America — lies in your hands.” Press secretary Karine Jean-Pierre said Wednesday that any question of Biden resigning his office — which would allow Harris to run as an incumbent — was “ridiculous.” Jean-Pierre said Biden has “no regrets” about his decision to stay in the race as long as he did, or his decision to quit it over the weekend. Zeke Miller, Seung Min Kim And Will Weissert, The Associated Press","summary":"WASHINGTON (AP) — Insisting that “the defense of democracy is more important than any title,” President Joe Biden on Wednesday will explain in an Oval Office address his decision to drop his bid for reelection and to throw his support behind Vice President Kamala Harris. The address will offer the public their first chance to [&#8230;]","url":"https://toronto.citynews.ca/2024/07/24/biden-to-use-oval-office-address-to-explain-his-decision-to-quit-2024-race-begin-to-shape-legacy/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/07/d366cfb0-7e4d-4bb9-86ad-7d838591ac1b.jpg","video":null,"publish_date":"2024-07-24 22:37:25","author":"News Staff,Zeke Miller","authors":["News Staff","Zeke Miller"],"language":"en","catgory":"politics","source_country":"ca","sentiment":0.028}]}