{"offset":0,"number":50,"available":505,"news":[{"id":361098704,"title":"It’s her first fashion week but Elon Musk’s daughter is taking it in her stride","text":"And at the presentation for accessories designer Alexis Bittar, she took part in a mock Miss USA pageant – an obvious reference to President Donald Trump, her father’s sometimes-ally, who owned that pageant from 1996 to 2015. Every contestant in the pageant was a trans woman, and all of them wore sashes from red states. Wilson played a bratty Miss South Carolina who scoffed, sneered and rolled her eyes when she lost to Miss Louisiana, played by trans activist and model Gia Love.\n\nCatching up with her backstage at Monday’s Chris Habana show – her fourth in as many days – Wilson listed her mental order of operations for a successful runway walk.\n\n“Don’t trip, don’t die, serve c---, slay,” she said. “I think in that order.”\n\nLast September, the political statements at New York Fashion Week were overt: the hot accessory was a camouflage Harris/Walz hat; Batsheva showed “Cat Lady” sweatshirts and Prabal Gurung sent a coconut tree dress down the runway in an apparent reference to a Kamala Harris meme. The Council of Fashion Designers of America sponsored a get-out-the-vote march, and Jill Biden addressed the crowd.","summary":"A mock Miss USA pageant, bolting down the runway and references to transgender rights: Vivian Wilson’s first foray at New York Fashion Week was anything but ordinary.","url":"https://www.brisbanetimes.com.au/lifestyle/fashion/it-s-her-first-fashion-week-but-elon-musk-s-daughter-is-taking-it-in-her-stride-20250917-p5mvo1.html","image":"https://static.ffx.io/images/$zoom_0.2391%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_241%2C$y_2/t_crop_custom/q_86%2Cf_auto/fa89d58e07a11fa279ad54858517dc56841a7a18","video":null,"publish_date":"2025-09-17 00:28:28","author":"Maura Judkis","authors":["Maura Judkis"],"language":"en","source_country":"au","sentiment":0.03},{"id":361101190,"title":"'Lucky Loser': Trump's 'psychotic' NYT lawsuit ridiculed by legal experts","text":"US President Donald Trump on Monday evening filed a defamation lawsuit against The New York Times that was quickly ridiculed by legal experts for entirely lacking merit.\n\nIn the lawsuit, Trump accused the Times of conspiring to prevent his victory in the 2024 election through a campaign of “election interference” that included, among other things, its editorial board’s decision to endorse former Vice President Kamala Harris.\n\n“It came as no surprise when, shortly before the election, the newspaper published, on the front page, highlighted in a location never seen before, its deranged endorsement of Kamala Harris with the hyperbolic opening line ‘[i]t is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump,‘” the lawsuit states.\n\nPointing to what it claimed was defamatory material published by the Times, the lawsuit singled out “a malicious, defamatory, and disparaging book written by two of its reporters and three false, malicious, defamatory, and disparaging articles, all carefully crafted by Defendants, with actual malice, calculated to inflict maximum damage upon President Trump.”\n\nThe book in question is ”Lucky Loser,” written by Pulitzer Prize-winning Times reporters Russ Buettner and Susanne Craig, which did a deep examination of the president’s finances and contrasted it with what it described as his false claims of unprecedented success in business.\n\nThe three articles cited by the lawsuit include one that quotes Trump’s own former chief of staff, John Kelly, warning that he would rule “like a dictator” in his second term; a news analysis piece that described Trump as facing a well documented “lifetime of scandals”; and an article by Buettner and Craig that is an adapted excerpt from their book.\n\n“The book and articles are part of a decades-long pattern by The New York Times of intentional and malicious defamation against President Trump,” the complaint stated. “Defendants maliciously published the book and the articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump.”\n\nThe lawsuit then demanded the Times pay $15 billion in compensatory damages.\n\nThe Times issued a brief response to the lawsuit in which it defended its reporting and labeled Trump’s defamation allegations as baseless.\n\n“This lawsuit has no merit,” said the paper. “It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.”\n\nSome experts who examined the lawsuit were quick to side with the Times in this dispute, and many of them flat-out ridiculed Trump for filing the suit in the first place.\n\nHolger Hestermeyer, chair of international and EU law at the Vienna School of International Studies, wrote on Bluesky that the lawsuit was “a full frontal attack on free speech” that also “almost reads like a parody.”\n\nIn addition to lampooning the suit’s specific defamation claims, Hestermeyer also mocked the suit for being loaded with hyperbolic statements, including one that said “The Apprentice” reality TV series “represented the cultural magnitude of President Trump’s singular brilliance, which captured the zeitgeist of our time.”\n\nAttorney George Conway delivered an even pithier dismissal of the suit.\n\n“Is it possible for a legal pleading to be psychotic?” he asked rhetorically. “I think we have an answer.”\n\nChris Geidner, a journalist who publishes the “Law Dork” newsletter, similarly expressed astonishment at the contents of Trump’s lawsuit.\n\n“I honestly thought there was a chance that I’d fallen asleep and was dreaming the most absurd, childlike, ego-maniac lawsuit when I tried to read this Trump defamation complaint against the Times, Penguin Random House, and individual journalists,” he wrote. “Like, seriously. What are we even doing here, folks?”\n\nBloomberg columnist Tim O’Brien, who was unsuccessfully sued by Trump for defamation over his 2005 book “TrumpNation,” predicted that Trump’s lawsuit against the Times would similarly end poorly for him.\n\n“Trump says he plans to sue the Times for $15 billion,” O’Brien wrote on Bluesky. “Been there, done that. He sued me for less—$5 billion. Discovery will be invasive and grueling—and involve Trump’s finances, family history and political machinations. And that’s just for starters.”","summary":"US President Donald Trump on Monday evening filed a defamation lawsuit against The New York Times that was quickly ridiculed by legal experts for entirely lacking merit.\n\nIn the lawsuit, Trump accused the Times of conspiring to prevent his victory in the 2024 election through a campaign of “election interference” that included, among other things, its editorial board’s decision to endorse former Vice President Kamala Harris.\n\n\n“It came as no surprise when, shortly before the election, the newspaper published, on the front page, highlighted in a location never seen before, its deranged endorsement of Kamala Harris with the hyperbolic opening line ‘[i]t is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump,‘” the lawsuit states.\n\nPointing to what it claimed was defamatory material published by the Times, the lawsuit singled out “a malicious, defamatory, and disparaging book written by two of its reporters and three false, malicious, defamatory, and disparaging","url":"https://www.alternet.org/lucky-loser-lawsuit/","image":"https://www.alternet.org/media-library/image.jpg?id=60752331&width=1200&height=600&coordinates=0%2C270%2C0%2C270","video":null,"publish_date":"2025-09-16 22:58:31","author":"Brad Reed","authors":["Brad Reed"],"language":"en","category":"politics","source_country":"us","sentiment":-0.106},{"id":361089766,"title":"Minnesota Gov. Tim Walz announces run for third term","text":"Minnesota Gov. Tim Walz on Tuesday announced his plans to seek reelection, launching a rare bid for a third consecutive term that would make history if he wins.Walz, a Democrat, revealed his intention to run again in a video posted on social media, touting policy achievements in office and making an appeal for unity.\"We've made historic progress in our state, but we're not done yet. I'm staying in the fight,\" the governor said.In his announcement video, Walz called Minnesota \"the best place on Earth with the best people,\" but acknowledged the state has \"seen terrible times this year.\"\"I'm heartbroken and angry about the beautiful people we lost to gun violence,\" Walz said, referencing the high-profile political assassination of Rep. Melissa Hortman and her husband Mark and the mass shooting at Annunciation Catholic Church late last month. \"But it's in these moments we have to come together, because I've seen what we can do when we work together.\"Walz said in the video that, if reelected, his priorities would include cracking down on fraud, making health care more affordable, investing in public schools and getting \"serious about gun violence.\"The former teacher and Congressman was elected governor in 2018 and won reelection in 2022. In 2024, former Vice President Kamala Harris chose him as her running mate in the presidential election, which catapulted him to the national stage.After the loss to President Trump and Vice President JD Vance, Walz returned to Minnesota to serve out the remaining two years of his term. Earlier this year, he went on a town hall tour of GOP districts across the Midwest, prompting speculation about a future presidential run. In an interview with The New Yorker in March, Walz said if the circumstances were right and he has the right \"skill set\" for the moment, he would consider running in 2028. Since Mr. Trump took office, he and Walz have continued the clashes begun during election season. In his announcement video, Walz said he will \"never stop fighting to protect us from the chaos, corruption and cruelty coming out of Washington.\"During his gubernatorial tenure, Walz and Democratic lawmakers approved several progressive victories, including universal free school meals, the legalization of recreational marijuana, codified abortion rights and more. Polling suggests Walz faces some political headwinds heading into his reelection campaign. A Star Tribune Minnesota poll in June found that half of Minnesotans did not want Walz to seek a third term. A majority of independents disapprove of his performance, as well as voters who live outside of Hennepin and Ramsey counties.And his time in office hasn't been without controversy. After authorities announced charges in the $250 million Feeding Our Future fraud case — the largest COVID-19 fraud case in the country — Walz faced scrutiny for how his administration handled it and Republicans blamed him for letting it happen under his watch. The scandal prompted a renewed focus on fraud and governmental oversight in the most recent legislative session, which included some changes, though plans for a new state watchdog agency failed to pass. Since Feeding Our Future, there have been additional investigations into fraud in state programs, including alleged bogus claims billed at autism centers and for housing services. Fraud in state government is already becoming a centerpiece to Republicans' campaign against him.Walz's 2022 challenger Scott Jensen is running again for the Republican nomination. State Rep. Kristin Robbins, who chairs the new House fraud-focused committee, and businessman Kendall Qualls have also launched campaigns.Walz defeated Jensen in 2022 by eight percentage points.In its 167 years as a state, Minnesota has never elected a governor for three consecutive four-year terms, according to the Minnesota Legislative Reference Library. Rudy Perpich served three non-consecutive terms and is the state's longest serving governor.Before his reelection, Walz led the state through the COVID-19 pandemic, the police murder of George Floyd and the unrest that followed. Walz and state lawmakers this year achieved what he called \"the most impressive achievement\" of his career, wrapping up a contentious budget agreement during a special session of the most closely divided Legislature in Minnesota history. The work to finalize the $66 billion biennial budget staved off a government shutdown and made significant headway into a projected $6 billion deficit in future years. \"This is why I got into this business, to try and make a difference, work together, compromise, find common ground,\" Walz said of the agreement. \"The commitment to making democracy work was as strong as I've seen.\"Walz's party made key concessions to get the deal across the finish line, including removing adult undocumented immigrants from the state's health care program.","summary":"Minnesota Gov. Tim Walz on Tuesday announced his plans to seek reelection, launching a rare bid for a third consecutive term that would make history if he wins.","url":"https://www.cbsnews.com/news/minnesota-gov-tim-walz-running-for-reelection/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/27/e50c1cb6-d9d5-4ec8-afa3-2fc40f5209ab/thumbnail/1200x630/c4dcf196942c94cc15321921d4d9581b/gettyimages-2208526883.jpg","video":null,"publish_date":"2025-09-16 22:28:50","author":"Anthony Bettin,Caroline Cummings","authors":["Anthony Bettin","Caroline Cummings"],"language":"en","category":"politics","source_country":"us","sentiment":0.068},{"id":361101008,"title":"Kamala Harris to Appear on ‘The View’ Year After Disastrous Campaign Appearance","text":"Former vice president and two-time presidential contest loser Kamala Harris is set to return to ABC’s The View next Tuesday nearly a year after last appearing on the show.\n\nHarris made a last ditch appearance on the far-left day-time talk show to flog her failing presidential campaign in October of 2024, only weeks before the November election, but it was all to no avail because she lost the election in a landslide.\n\nNow the former veep is set to return to the show to flog her upcoming book, “107 Days,” in which she reportedly slags her former boss, Joe Biden, and his White House staffers and blames them in part for her huge electoral loss.\n\nHarris is set to guest on The View on Sept. 23.\n\nChief moderator Whoopi Goldberg told viewers on Tuesday that Harris would be gracing the table on the following week. “She’ll be here, we’ll be here, I hope you’ll join us all, because we want to hear what she has to say,” Goldberg said.\n\nMany felt that Harris’ last appearance on the show helped torpedo her campaign. For instance, at one point the gaggle asked her what she would do differently than Joe Biden had done, she couldn’t think of a thing.\n\n“There is not a thing that comes to mind,” she said after being asked what she would do differently than Biden had.\n\nShe then went on to claim she was part of all of Biden’s disastrous decision.\n\n“And I’ve been part of most of the decisions that have had impact,” she claimed. “The work that we have done, for example, capping the cost of insulin at $35 for our seniors something I care deeply about, a allowing Medicare to negotiate drug prices and bring the cost of prescription medication down for seniors, but my intention is to expand that for Americans. The work we have done to invest in American industries, whether it be in terms of manufacturing and creating 800,000 new jobs around manufacturing. Those were all a shared priority.”\n\nHarris will also appear in prime time for the fist time in nearly a year by appearing on the extremist, left-winger Rachel Maddow Show on the day before her shot on The View next week.\n\nFollow Warner Todd Huston on Facebook at: Facebook.com/Warner.Todd.Huston, Truth Social @WarnerToddHuston, or at X/Twitter @WTHuston","summary":"Former vice president and two-time presidential contest loser Kamala Harris is set to return to ABC's 'The View' next Tuesday.\n\n\nThe post Kamala Harris to Appear on ‘The View’ Year After Disastrous Campaign Appearance appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/09/16/kamala-harris-to-appear-on-the-view-year-after-disastrous-campaign-appearance/","image":"https://media.breitbart.com/media/2025/09/kamalatheview-640x335.jpg","video":null,"publish_date":"2025-09-16 22:14:08","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.083},{"id":361099204,"title":"Taylor Swift ‘used bulletproof shield’ at last NFL game after Charlie Kirk shooting","text":"Taylor Swift reportedly turned up to an NFL game on Sunday behind a bulletproof wall (Picture: David Eulitt/Getty Images)\n\nOn Sunday Taylor Swift appeared to be filmed being escorted to her fiancé Travis Kelce’s NFL game behind a portable wall, leaving fans perplexed at such secrecy. \n\nWhile some theorised Swift could be hiding a baby bump; making one of her secretive entrances like at her shows; or simply wished to avoid outshining her future husband’s big moment at Arrowhead Stadium – now it’s claimed this was a bullet-proof protective shield. \n\nThis reported precaution at the Kansas City Chiefs vs Philadelphia Eagles game comes amid worries over gun violence following the assasination of Charlie Kirk, sources say. \n\n‘If someone is going to do a tit-for-tat for Charlie Kirk, Taylor is a pretty logical choice,’ the insider told the Daily Mail, who reported Swift was behind the screen. \n\nThey added: ‘They used the screen to keep her safe. They have used that screen before, but usually it is for the President or someone like that, not a celebrity. But this was a weird week.’\n\nMAGA spokesperson Kirk was fatally shot by a gunman last Wednesday while speaking to students at Utah Valley University. \n\n Swift hasn’t used this precaution before, but sources claim there were worries after Charlie Kirk’s fatal shooting (Picture: David Eulitt/Getty Images)\n\n Swift was said to be behind this screen while entering the NFL game\n\nKirk, a conservative influencer who founded Turning Point USA, has previously made comments about Swift, including his controversial hope that Kelce could ‘de-radicalise’ her and that she should ‘submit’ to her future husband. \n\nSwift is reportedly concerned about stalkers and hate mail from extremist groups, which came after she endorsed Kamala Harris in the 2024 presidential run against Donald Trump. \n\n‘Taylor had concerns because she has received hate mail from the same kinds of extreme groups,’ another source told the publication. \n\n‘Charlie’s murder, and the weirdness with her stalkers, is why she will take serious measures to increase her security and only a core group of people know what her schedule is.\n\n‘She was targeted by far-right extremist groups after going against Trump [by endorsing Kamala Harris] and there are legitimate concerns about some of the threats that have been made. They aren’t taking any chances.’\n\nSwift’s houses have been targeted by a number of stalkers over the years. \n\n Taylor has endured lots of problems with stalkers in the past (Picture: Matt Winkelmeyer/Getty Images for The Recording Academy)\n\n This comes after Taylor and Travis announced their engagement on social media (Picture: Ezra Shaw/Getty Images)\n\nIn 2023 Mitchell Taebel, 37, was arrested after showing up outside her Nashville home and charged with intimidation, harassment, stalking by threatening serious injury or death and invasion of privacy.\n\nHe claimed that he was the Getaway Car singer’s ‘soulmate’, and left a string of concerning pictures and messages for her and her team, as well as her dad.\n\nIn 2024, an alleged stalker – seen at Swift’s New York City apartment a reported 30 times – was arrested after trying to break in. \n\nIn 2021, Patrick Nissen, then 28, was arrested in the vestibule of her New York City apartment building and was charged with a misdemeanour for second-degree criminal trespassing after being found in her building without permission. \n\nThe same year, a man, then aged 52, was arrested after attempting to enter Taylor’s Manhattan home, claiming to police that he had spoken to the star on Instagram. \n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"The screen is 'usually for the President'.","url":"https://metro.co.uk/2025/09/16/taylor-swift-used-bulletproof-shield-last-nfl-game-charlie-kirk-shooting-24183113/","image":"https://metro.co.uk/wp-content/uploads/2025/09/GettyImages-2196122888_14c012-e1758059607625.jpg?quality=90&strip=all","video":null,"publish_date":"2025-09-16 22:07:57","author":"Kitty Chrisp","authors":["Kitty Chrisp"],"language":"en","source_country":"gb","sentiment":0.21},{"id":361092618,"title":"California’s sky-high living costs afford it the nation’s highest poverty label — again","text":"Last year’s presidential election underscored, particularly to Democrats, that the costs of living were a major factor in the outcome.\n\nInflation had increased sharply during Joe Biden’s presidency, and voters’ angst about rising prices worked against Vice President Kamala Harris’ campaign to succeed him in the White House.\n\nNot surprisingly, therefore, when the California Legislature opened its 2025 session, its dominant Democrats declared that they would focus on taming the state’s notoriously high costs for housing, fuel, utilities and other necessities of modern life.\n\nThe session ended last week and as it did, by happenstance, the Census Bureau reported that California once again has the nation’s highest “supplemental” rate of poverty when its living costs are included in calculations over a three-year period.\n\nCalifornia’s rate, 17.7%, means that nearly 7 million of its residents are impoverished, 5 percentage points higher than the national rate and tied with Louisiana. The lowest rate is 6.7% in Maine.\n\nCalifornia’s rate is also 2.3 percentage points higher than it was in the Census Bureau’s previous three-year calculation, implying that its living costs vis-à-vis incomes had increased markedly.\n\nThe situation is even gloomier in a report last month from the Public Policy Institute of California and the Stanford Center on Poverty and Inequality.\n\nUsing methodology similar to that of the Census Bureau, they calculate that 16.9% of Californians were poverty-stricken in 2023 and another 17.9% were near-poor. That translates into 13.2 million Californians struggling to put roofs over their heads, food on the tables, fuel in their cars and electric power in their appliances and light fixtures.\n\nLos Angeles County, which has about 25% of the state’s population, has the highest poverty rate of any county, 19.9%. Poverty in the Central Coast region is nearly as high at 19.3%, while Sacramento has the state’s lowest rate, 13%.\n\nAnother data point about poverty in California is found in the newly enacted state budget. It declares that 14.9 million Californians are enrolled in Medi-Cal, the state’s health care program for the poor.\n\nSo, one might wonder, did the Legislature’s 2025 session deliver on promises to reduce the costs of living?\n\nLegislative leaders claim some success.\n\n“We went big,” Assembly Speaker Robert Rivas, said in a summary of the session’s work. “We produced results. We delivered historic progress — on housing, on energy, on climate, on health care, and on human rights. And that progress is something every one of us can be proud of.\n\n“And while our work is not finished fixing California’s housing system, this year marked a turning point in California’s housing story,” Rivas continued. “And today, we also advanced the most significant energy package in years. We passed measures that will deliver real relief for families on their electricity bills. We took action to stabilize gas supplies, to prevent price shocks — while keeping health and environmental protections in place.”\n\nBy integrating California’s electric power grid with those of other Western states, the elected officials say, shortages of electric power will be mitigated.\n\nBy reducing impediments to housing development, they say, higher levels of construction will moderate increases in rents and home prices.\n\nWhether any of these legislative efforts actually lower or at least stabilize Californians’ living costs won’t be known for months, or even years. Meanwhile, California’s high poverty rate will continue to be a civic embarrassment.\n\nDan Walters is a CalMatters columnist.","summary":"Last year’s presidential election underscored, particularly to Democrats, that the costs of living were a major factor in the outcome.","url":"https://www.sandiegouniontribune.com/2025/09/16/californias-sky-high-living-costs-afford-it-the-nations-highest-poverty-label-again/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/AP_18300051425739.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-16 21:51:58","author":"Dan Walters,Gqlshare","authors":["Dan Walters","Gqlshare"],"language":"en","source_country":"us","sentiment":0.026},{"id":361101920,"title":"The Latest: Kash Patel confronts Senate questions over probe into Charlie Kirk’s killing","text":"FBI Director Kash Patel touted his leadership of the nation’s top federal law enforcement agency as he faced questions from senators about the investigation into Charlie Kirk’s killing, the case against sex offender Jeffrey Epstein and the firings of senior FBI officials who have accused Patel of illegal political retribution.\n\nHis appearance Tuesday before the Senate Judiciary Committee represents the first oversight hearing of Patel’s young but tumultuous tenure and provides a high-stakes platform for him to confront skeptical Democrats at a time of internal upheaval and mounting concerns about political violence inside the United States, which President Donald Trump has squarely blamed on the left. Patel listed a series of what he said were accomplishments of his first months on the job, including his efforts to fight violent crime and protect children.\n\nThe Latest:\n\n House Democratic leader asks if Trump is turning down the rhetoric \n\nLeader Hakeem Jeffries pushed back against a proposal to punish a lawmaker for their comments in the aftermath of the Kirk assassination, and instead said leaders should be “lifting people up.”\n\n“The question that should be asked is, ‘Has the president brought the rhetoric down?’” he said at a press conference at the Capitol. “We need to come together, not as Democrats or Republicans or independents, but as Americans.”\n\n New Pentagon policy says troops can only be exempt from shaving for a year \n\nDefense Secretary Pete Hegseth has ordered that troops across all the services who need an exemption from shaving for longer than a year should now be kicked out of the service.\n\nIn a Aug. 20 memo that was made public Monday, Hegseth said that while commanders are still able to issue servicemembers exemptions from shaving – a policy that has existed for decades – those exemptions will now have to come with a medical treatment plan. Troops who still need treatment after one year will be separated from service, the memo decreed.\n\nMost shaving waivers are for troops diagnosed with pseudofolliculitis barbae, or PFB, a condition in which hairs curl back into the skin after shaving and cause irritation. It is a condition that disproportionately affects Black men. The memo is silent on what treatments the military would offer for troops impacted by the new policy or if it will front the cost for those treatments.\n\n Attorneys for immigrant children allege poor conditions persist at detention facility \n\nAttorneys defending immigrant families held in federal custody are alleging such things as bottled water for sale, a child with appendicitis told to wait three days, and families released from custody only to be re-detained.\n\nThe declarations are part of an ongoing lawsuit where the federal government is requesting to end protections for immigrant children. Since the unlicensed detention center in Dilley, Texas, started holding families when it reopened in March, families reported long detention stays, children fighting adults for clean water and a lack of adequate medical care.\n\nThe federal judge presiding over this case last month requested more information about the length of detention for children. ICE provided a report that said the children in custody over 72 hours went down from six days to five days in June and July, respectively. But attorneys representing the children who reviewed the report said the government has held some children for over a week and often without justification.\n\n Illinois governor says Trump ‘losing it’ over National Guard inconsistency \n\nJB Pritzker, a frequent Trump critic, accused the president of being forgetful and unreliable, suggesting he “might be suffering from some dementia.”\n\n“When he said that he wasn’t coming to Chicago, I didn’t trust that,” Pritzker said Tuesday. “When he says he is coming to Chicago, it’s hard to believe anything he says.”\n\nTrump has vowed to send military troops to the nation’s third-largest city but repeatedly changed his statements. He’s said he’d prefer cooperative cities but on Tuesday again mentioned Chicago as a possibility for the next deployment.\n\nElected leaders and many residents strongly oppose any federal intervention.\n\n Microsoft says it will invest $30B in the UK through 2028 \n\nThe investment includes $15 billion in capital expenditures to build out cloud computing and artificial intelligence infrastructure. A project with British company Nscale aims to build the nation’s largest supercomputer, running on more than 23,000 advanced graphics processor chips.\n\n“We’re focused on British pounds, not empty tech promises, because it’s easy to have big numbers but we will be good for every cent of this investment,” Microsoft’s president, Brad Smith, told reporters Tuesday.\n\nHe said the investments were separate from those made through the Stargate project and Microsoft’s longtime partner OpenAI, maker of ChatGPT, which is increasingly trying to set its own course without the software giant’s help.\n\nSmith credited the U.K.’s “regulatory stability” and its commitment to expanding the supply of electricity needed to power data centers. He said Microsoft didn’t receive any request from the Trump administration to make the announcement.\n\n Crime victims targeted in immigration crackdown \n\nA man detained by authorities days after he nearly died in an Iowa shooting is one of a growing number of crime victims who have been targeted in the Trump administration’s crackdown on illegal immigration.\n\nFelipe de Jesus Hernandez Marcelo was shot in June during an attempted robbery in Muscatine, Iowa, and has been detained since shortly after he got out of the hospital.\n\nIn January, Immigration and Customs Enforcement rescinded a policy that had shielded many victims from detention and removal. The number of people applying for visas that allow some victims to remain in the country has plummeted since then. Others have been detained unexpectedly by ICE as they go through the lengthy application process.\n\n▶ Read more about how ICE is moving to deport more victims of crime\n\n Trump again delays enforcement of TikTok ban \n\nTrump is extending a deadline for the social media app TikTok to shut down.\n\nIt will be the fourth time that Trump has ignored federal law and extended a deadline for TikTok to go out of business. Trump has signed an executive order to keep TikTok operating, a day after he said he’d reached a framework deal with China to keep it operating.\n\n Trump forms federal board to prevent strike on nation’s largest commuter rail system \n\nThe president issued an executive order creating a Presidential Emergency Board meant to resolve a contract dispute that nearly triggered a strike on the Long Island Railroad this week.\n\n“Once again, President Trump is stepping up when Democrats have failed,” Kush Desai, a White House spokesperson, said in an apparent dig at Democratic New York Gov. Kathy Hochul.\n\nUnionized LIRR workers voted to authorize a strike on Monday but also approved seeking federal intervention. The move pushed the possibility of a strike at least into January.\n\n Netanyahu invited back to the White House \n\nThe Israeli prime minister says Trump had invited him to visit on Sept. 29, after he addresses the United Nations General Assembly.\n\nIt will be Netanyahu’s fourth visit to the White House since Trump assumed office in January.\n\n Democratic governors warn Congress it should not let ACA tax credits expire \n\nA group of Democratic governors is urging congressional leaders to extend Affordable Care Act tax credits. They write in a letter that letting the credits expire would cause harm that “will be felt for years.”\n\nThe appeal comes as Congress is moving toward a potential government shutdown, with Republicans and Democrats at odds over how to continue the tax credits that have made health insurance more affordable for millions.\n\nThe 18 Democratic governors wrote that “these subsidies are the only reason health insurance is still within reach in a country where the cost of living keeps going up.”\n\nThe letter was sent Monday and advised both Republican and Democratic leaders in the House and Senate that “this isn’t a partisan issue.”\n\n White House, Pentagon mum on details after Trump says US `knocked off’ third alleged Venezuelan drug boat \n\nNeither offered any further on-the-record detail after Trump suggested the U.S. military had carried out an operation on a third vessel from Venezuela.\n\nAsked earlier on Tuesday by a reporter about Venezuelan President Nicolas Maduro’s angry response to two military strikes carried out by the U.S. military in recent weeks on alleged drug smuggling boats in the Caribbean, Trump replied “We knocked off, actually, three boats not two.”\n\nThe Pentagon referred questions to the White House, which has not provided details about where and when the third military operation took place.\n\n Trump says Republicans will hold a ‘very exciting’ midterm political convention \n\nPresident Trump says on social media that Republicans will hold the gathering to highlight “the great things we have done” since he was reelected in 2024.\n\nThe convention’s date and location are still to come, Trump says. But he promised that “it will be quite the Event, and very exciting!”\n\nTrump first floated the idea after news reports that the Democratic Party was considering its own gathering before the 2026 midterm elections to highlight candidates and garner attention as the party aims to regain control of both houses of Congress next year.\n\n FBI director wraps up his testimony \n\nPatel has finished testifying after a contentious 4 ½ hour hearing before Congress.\n\nThe final round of questioning for the FBI director came from Republican Sen. Thom Tillis of North Carolina. Tillis issued a call to both sides of the aisle, including fellow conservatives, to tone down the rhetoric in the face of escalating political violence in the U.S.\n\n“How on earth are we de-escalating the situation with the tensions as high as they were last week with going out and saying we’re at war?” Tillis said. “There are people out here on our side of the aisle that still need to look in the mirror.” \n\n Patel shouts down Sen. Adam Schiff \n\nThe FBI director shouted over the California Democrat during questioning on how the Trump administration has handled the Jeffrey Epstein files and Epstein’s former girlfriend Ghislaine Maxwell.\n\n“You are the biggest fraud to ever sit in the United States Senate,” Patel shouted at Schiff.\n\n“You are a political buffoon at best!” Patel added.\n\nSchiff tried to yell over him, saying, “You can make an internet troll the FBI director, but (he) will always be nothing more than an internet troll.”\n\nSen. Chuck Grassley, Republican chairman of the Senate Judicial Committee, pounded his gavel repeatedly, but Patel continued.\n\nThe feud between Patel and Schiff dates back years, to when Patel was a staffer on the House Intelligence Committee and Schiff was a House member.\n\n Congresswoman says hundreds of immigration arrests in Chicago \n\nU.S. Rep. Lauren Underwood of Illinois says immigration agents have arrested 250 people in the Chicago area since a new enforcement campaign was announced last week.\n\nThe Democrat is a member of the Homeland Security Subcommittee on Appropriations and got the information after a requested briefing with immigration officials. She shared details late Monday.\n\nUnderwood says the arrests began Sept. 6, two days earlier than a program touted as “Midway Blitz” was publicly announced. She says the operation would include the entire state of Illinois and neighboring Lake County in Indiana.\n\nTop administration officials arrived in Chicago Tuesday, potentially signaling a more aggressive phase of immigration enforcement. DHS officials have not responded to questions about the number of arrests in the Chicago area.\n\n Trump is intensifying immigration enforcement in Boston \n\nImmigrants are being detained in various locations, sparking fear and leading some people to stay home. Advocates report increased activity from U.S. Immigration and Customs Enforcement, with unmarked vehicles targeting work vans and staking out neighborhoods with large immigrant populations.\n\nOne Metro Boston city canceled its Hispanic Heritage Month festival due to safety concerns. ICE’s “Patriot 2.0” operation follows a previous crackdown in Boston.\n\nThe U.S. Department of Justice has also filed a lawsuit against Boston over its so-called sanctuary policies. Advocates argue the city’s policy of limiting cooperation with ICE keeps the city safe and ensures Boston remains a place for all residents.\n\nOpponents argue challenging the federal government risks much-needed federal funding and allows criminals to walk the streets.\n\n▶ Read more about ICE detentions intensifying in so-called sanctuary cities\n\n Patel defends social media post about Kirk subject in custody \n\nPatel had posted in the hours after the killing of conservative activist Charlie Kirk that “the subject” was in custody even though the actual suspect was still at large.\n\n“I don’t see it as a mistake. I see it as something -- working with the public to identify that there was a subject in custody,” Patel told senators.\n\nHe said he wanted to inform the public that a subject had been taken into custody, even though that person did not end up being the suspect in the shooting.\n\nHe told senators: “Could I have been more careful in my verbiage and said we had a subject instead of the subject? Sure.”\n\nSen. Peter Welch, a Vermont Democrat, pushed back, saying it caused confusion by making it sound like authorities had caught the person suspected of killing Kirk.\n\nPatel shot back by saying, “That’s not what I said.”\n\n Senate Democrats concerned over military lawyers as immigration judges \n\nA group of Democratic senators say they are deeply concerned that a Pentagon plan to allow military lawyers to work as temporary immigration judges will violate a ban on using service members for law enforcement and affect the military justice system.\n\nThe letter, sent to the military services and provided to The Associated Press, comes two weeks after Defense Secretary Pete Hegseth approved sending up to 600 military lawyers to the Justice Department to serve as temporary immigration judges. It is among the steps the Trump administration has taken to use the military in broader ways than previously seen, particularly in its immigration crackdown, including sending the National Guard into American cities and deploying active duty troops to the U.S.-Mexico border.\n\n“These military officers would serve under the command and control of the Attorney General and would execute administrative determinations at the direction of the Attorney General,” according to the letter signed by 12 Democrats on the Senate Armed Services Committee. It added that “these actions are inherently law enforcement actions that may not be performed by members of the armed forces.”\n\n Indiana governor says redistricting is inevitable \n\nRepublican Gov. Mike Braun said that the redistricting conversation is “moving” and it’s likely inevitable. But he doesn’t want to call a special session unless there will be a successful outcome.\n\n“I’ve been very clear, I want it to be organic,” he said in a video reported by WRTV in Indianapolis.\n\nIndiana GOP lawmakers have been hesitant about redistricting while Texas and Missouri barrel ahead, emblematic of Indiana’s independent streak. Braun said a special session could happen any time after November.\n\nThe GOP legislative caucuses met last week to discuss redistricting a few weeks after visiting the White House.\n\n Pennsylvania governor says US must ‘turn the tide’ against political violence, reject vengeance \n\nGov. Josh Shapiro says the nation must “turn the tide” against political violence and the belief that government can’t solve problems while also rejecting vengeance.\n\nShapiro, a Democrat, delivered the remarks at the Eradicate Hate Global Summit in Pittsburgh. Shapiro said leaders must condemn all forms of political violence and shouldn’t use violence as a pretext for more violence or to prosecute constitutionally protected speech.\n\nShapiro also criticized Trump, saying some people “in the dark corners of the internet, all the way to the Oval Office, want to cherry-pick which instances of political violence they want to condemn.”\n\nIn April, Shapiro and his family fled the governor’s official residence in the middle of the night after an alleged arsonist set it on fire in an attempt to kill Shapiro.\n\n Mayor responds to Border Patrol head in Chicago, signs executive order protecting right to protest \n\nChicago Mayor Brandon Johnson said he has had no direct conversations with the White House or Border Patrol and reaffirmed that Chicago police would not collaborate with ICE.\n\n“I get that people are feeling a level of anxiety, but they should be assured that we’re going to work with all of our stakeholders to make sure the people of Chicago are safe and supported,” he said at a news conference following his signing of an executive order aiming to protect the right to protest.\n\nThe order states that, if federal law enforcement disrupts peaceful protests, Chicago police will “collaborate with protest organizers to develop a mutually acceptable alternative plan.”\n\nJohnson said the order was an attempt to be “proactive” amid federal intervention and after protesters clashed with federal immigration agents Friday outside an ICE processing facility in Broadview, Illinois.\n\n House Republicans release short-term measure to avoid shutdown \n\nThey unveiled a stopgap spending bill to keep the federal government through Nov. 21.\n\nThe bill generally funds agencies at current levels, though there is an extra $88 million to boost security for lawmakers and members of the Supreme Court and the executive branch. The House is expected to vote on the measure by Friday.\n\nThe budget year draws to a close at the end of the month and Congress has yet to approve funding levels for the coming fiscal year. So, lawmakers will need to pass a stopgap measure to keep agencies funded while they work out their differences for the full year.\n\nDemocratic leaders have insisted that Republicans negotiate with them on the spending bill to protect health insurance coverage for millions of Americans. But Republicans leaders have rebuffed those demands and say those discussions are for another time and would not be part of the continuing resolution.\n\nAny spending bill that passes will need some support from Democrats in the Senate as the measure will need at least 60 votes to advance to a final vote.\n\n Patel hearing explodes in fiery exchange with Sen. Cory Booker \n\nPatel and the New Jersey Democrat got into a shouting match as Booker charged that Patel is responsible for a “generational destruction of the nation’s premier law enforcement agency.”\n\nPatel fired back at Booker, telling him that he was an “embarrassment.”\n\nFor several moments, the Republican chairman of the committee, Sen. Chuck Grassley, pounded his gavel but struggled to gain control of the two men.\n\nStill, Booker predicted that Patel would not last long in his post. He told Patel that Trump “will cut you loose. This may be the last time I have a hearing with you.”\n\n Patel pushes back on Democrats saying he got job because of Trump loyalty \n\nPatel took the opportunity to give a fiery retort to Democratic senators who say the reason he got the job was his loyalty to President Donald Trump.\n\nPatel’s leadership of the FBI has been marked by turmoil and Democratic accusations that he’s using the law enforcement agency to carry out Trump’s goals.\n\nBut Patel told the Senate panel that it was “an entire falsehood” to suggest that he only got the job because he was a Trump loyalist.\n\nPatel pointed to his experience as an attorney, congressional staffer and administration official, saying, “There was no loyalty then. There’s no loyalty now to anything but the Constitution.”\n\n Party switcher Geoff Duncan announces run for Georgia governor as Democrat \n\nFormer Republican and onetime Georgia Lt. Gov. Geoff Duncan is running as a Democrat for governor, a remarkable step for a staunch critic of Trump who left the conservative fold in a region where party switchers have gone in the other direction for generations.\n\n“I’ve never wavered in taking on Trump. So Georgia Republicans threw me out of their party,” Duncan said in his announcement video released Tuesday. “I was leaving anyway. Now I’m running for governor as a proud Democrat.”\n\nA 50-year-old resident of a Republican stronghold north of Atlanta, Duncan joins an already crowded field of lifelong Democrats. Top candidates include former Atlanta Mayor Keisha Lance Bottoms, state Sen. Jason Esteves and former labor commissioner Michael Thurmond.\n\n Trump criticizes reporters after suing the New York Times, tells one ‘you have ‘a lot of hate in your heart’ \n\nTrump seemed miffed when an Australian Broadcasting Corp. reporter asked about his wealth since returning to office. Trump told the reporter, ’You’re hurting Australia very much right now, and they want to get along with me.”\n\nHe told the reporter that Prime Minister Anthony Albanese would be visiting soon and “I’m going to tell him about you. You set a very bad tone.”\n\nThe president also criticized ABC News correspondent Jonathan Karl, whom he’s known for years. Karl asked Trump about the attorney general’s comments that she will be going after hate speech after the killing of Charlie Kirk.\n\nKarl told Trump that even some of his allies say hate speech is free speech.\n\nTrump responded by telling Karl the administration would “probably go after people like you, because you treat me so unfairly, it’s hate. You have a lot of hate in your heart.”\n\n Lawmakers behind the TikTok bill say they’re tracking discussions about a deal \n\nThe House Select Committee on China says any deal between Beijing and Washington must comply with a law requiring TikTok to be divested from its Chinese ownership or face a ban in the U.S.\n\nA framework deal was reached over the future of the popular social media platform at a trade meeting Monday in Madrid. Details remain unknown. Rep. Raja Krishnamoorthi, the committee’s ranking Democrat, said he wants information on the ownership structure.\n\n“Underpinning all of our concerns is the Chinese Communist Party’s access to American data,” he said. The social media platform needs user data to determine what to show users, and Krishnamoorthi said he would be open to discussions if the app is protected from Beijing’s infiltration.\n\n Democratic senator tells Patel: ‘You lied to us.’ \n\nIn a tense exchange, Sen. Richard Blumenthal accused the FBI director of lying when he told lawmakers at his confirmation hearing that agents would not be subject to political retribution.\n\nPatel objected to the accusation, telling the Democrat from Connecticut: “You accusing me of lying is something I don’t take lightly, but I’m not going to get into a tit for tat with you.”\n\nThe FBI director insisted that decisions to fire certain FBI agents were made by him, not the White House.\n\n“Any termination at the FBI was a decision that I made based on the evidence that I have as director of the FBI,” Patel said. “It’s my job and I’m not going to shy away from it.”\n\n Patel says FBI has ‘no credible information’ that Epstein trafficked teenage girls to others \n\n“There is no credible information — none. If there were, I would bring the case yesterday that he trafficked to other individuals,” Patel said, while also acknowledging that previous investigations of Epstein were limited.\n\nSen. John Kennedy, a Louisiana Republican, said that kind of answer was unlikely to satisfy demands to release more information.\n\n“This issue is not going to go away,” Kennedy said. “And I think the central question for the American people is this: They know that Epstein trafficked young women for sex to himself. They want to know who if anyone else he trafficked these young women to.”\n\nPatel said that the current case files only included “limited search warrants” between 2006 and 2007 because federal prosecutors in Florida had previously cut a secret deal with Epstein that allowed him to avoid prosecution for his previous actions\n\n Patel says he’s concerned about threats against judges \n\nPatel says the FBI has 35 open investigations into threats against judges, who have faced a sharp increase in violent messages in recent years.\n\nFederal judges were targeted in 17 of those cases, while the others involved threats against state court judges, Patel said.\n\nThe FBI director said he’s concerned about the problem, and the agency is referring cases for prosecution when it’s supported by the evidence.\n\nJudges have increasingly spoken out against threats of violence, pointing to worrying rhetoric from both sides of the political aisle in recent years and saying the threats have reached a new peak during the second Trump administration.\n\n Head of LA immigration crackdown and DHS secretary say they're in Chicago \n\nU.S. Homeland Security Secretary Kristi Noem said in an X post that she was “on the ground” Tuesday in Chicago “to make clear we are not backing down.”\n\n“Our work is only beginning,” she said.\n\nGregory Bovino, who spearheaded the immigration crackdown that sparked widespread protests in Los Angeles, also announced his arrival: “Well, Chicago, we’ve arrived!” he said. “Operation At Large is here to continue the mission we started in Los Angeles.”\n\nAdvocates for immigrants say they’ve noticed an uptick in detentions by ICE agents in Chicago as the nation’s third-largest city braces for Trump’s promised immigration crackdown and National Guard deployment. The threats have deepened dread among already fearful immigrant communities, which cancelled and delayed Mexican Independence Day celebrations. An ICE officer fatally shot a suspect trying to evade arrest last week.\n\n House Speaker warns leaders not to call political opponents ‘fascists’ \n\nJohnson also defended employers who take action against employees whose comments go too far.\n\n“That’s not the government censoring speech, that’s personal behavior and decorum,” the Republican from Louisiana said.\n\nJohnson noted that Trump has been called “the most despicable names” and he urged all leaders to tone it down.\n\n“Leaders cannot call their political opponents Nazis and fascists and enemies of the state because they disagree with their policy priorities,” he said.\n\n Johnson says bill to avoid shutdown being unveiled soon \n\nSpeaker Mike Johnson said a bill to avoid a partial government shutdown at month’s end would not include health care provisions sought by Democrats.\n\n“It will be a clean, short-term continuing resolution. End of story,” Johnson told reporters. He said the measure will be unveiled Tuesday.\n\nMinority leader Hakeem Jeffries has said House Democrats won’t support a partisan bill that “continues to gut the healthcare of the American people.”\n\nBut Johnson said Republicans are not going to revisit their big tax cut bill that trimmed Medicaid spending over the coming decade, and said the looming expiration of tax credits for some health insurance coverage is a “December policy issue.”\n\n“The same Democrats who decried government shutdowns under President Biden appear to have no heartache whatsoever at walking our nation off that cliff right now,” Johnson said.\n\n Trump files $15 billion defamation lawsuit against The New York Times \n\nThe lawsuit against the paper and four of its journalists, filed Monday in U.S. District Court in Florida, says several articles and one book published in the leadup to the 2024 election are “part of a decades-long pattern by the New York Times of intentional and malicious defamation against President Trump.”\n\nTimes spokesman Charles Stadtlander said Tuesday the lawsuit “lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics.” Penguin Random House, which published the book, called the lawsuit “meritless.”\n\nTrump has gone after other media outlets, including filing a $10 billion defamation lawsuit against the The Wall Street Journal and media mogul Rupert Murdoch in July after the newspaper published a story reporting on his ties to wealthy financier Jeffrey Epstein.\n\n Patel describes a widening probe of Kirk shooting, including Discord chat \n\nPatel was asked by Sen. Josh Hawley, R-Mo., whether the Kirk shooting is being treated as part of a broader trend of violence against religious groups, and Patel responded, “We are investigating Charlie’s assassination fully and completely and running out every lead related to any allegation of broader violence.”\n\nPatel also said that the FBI is investigating “anyone and everyone” who was involved in an online gaming chatroom on Discord with the alleged shooter. That chatroom involved “a lot more” than 20 people, Patel said.\n\n Patel says he’d work with Congress to address gun violence \n\nThe FBI director told Sen. Amy Klobuchar that he is “willing to engage and explore new ways” to address gun violence in the United States.\n\n“Whatever creativity we can use to eliminate even just one shooting, one horrific death, I am in favor of engaging with Congress fully to do,” Patel told the Democrat from Minnesota.\n\nPatel was later pressed by Klobuchar on whether he supports a ban on so-called assault weapons.\n\nThe FBI director said there are “instances on this legislation that could prevent future attacks” but said he would not “weigh into the creation of legislation.”\n\n Patel says the mission against drug traffickers will extend for years \n\nThe FBI director says his agency, as well as the U.S. military and intelligence community, will be conducting a yearslong mission that seeks to use counterterrorism tactics against drug-trafficking organizations.\n\n“We must treat them like foreign terrorist organizations post-9/11. We must treat them like the al-Qaidas of the world,” Patel told the Senate Judiciary Committee.\n\nPatel argued that law enforcement resources alone aren’t enough to dismantle criminal groups that traffic drugs into the U.S. and that the Trump administration is taking an “interagency” approach.\n\n“Whether that’s in a kill operation, a capture operation, a surrender operation, or a host nation takedown, like we did with the counterterrorism mission sets in Afghanistan and Iraq and Pakistan and elsewhere, we are applying that to the drug traffickers in Mexico and Venezuela and Colombia,” Patel said.\n\n Tim Walz, the 2024 Democratic VP candidate, says he’ll seek to remain Minnesota’s governor \n\nMinnesota Gov. Tim Walz said Tuesday he will seek a third term in the 2026 elections, hoping to beat the odds to become the longest-serving governor in a state where voters have usually said two terms were plenty.\n\n“I’ve always tried to do what’s right for Minnesota, and I’ll never stop fighting to protect us from the chaos, corruption, and cruelty coming out of Washington,” Walz said in a campaign video.\n\nWalz has been frequently mentioned as a potential 2028 presidential candidate. He sharply criticized Trump while touring early caucus and primary states after he and Democratic presidential nominee Kamala Harris were defeated. But he told Axios in July he would not run for president if he sought reelection.\n\n▶ Read more about Walz’s decision to run for governor again\n\n Patel refuses to address FBI firings \n\nQuestioned by Durbin on the recent firings of FBI agents, Patel said he would not get into personnel decisions and accused the Democrat of unfairly attacking FBI leadership.\n\nEarlier in the hearing, Patel called it “absolutely disgraceful” to cite what the FBI director described as a “one-sided story” about the firings.\n\n“Your attack on the current leadership of the men and women of the FBI is equally disgraceful,” the FBI director told Durbin.\n\nPatel is facing a lawsuit from three high-ranking FBI officials who have accused him of illegally firing them in a “campaign of retribution.”\n\n Trump says US strikes have now destroyed three boats suspected of carrying drugs from Venezuela \n\n“We knocked off, actually, three boats not two,” Trump told reporters when asked about Venezuelan President Nicolas Maduro’s angry response to U.S. military operations that the White House says is targeting Venezuelan drug smugglers.\n\nTrump had confirmed earlier that the U.S. military on Monday had targeted a second boat allegedly carrying drugs from Venezuela, killing three aboard the vessel. He also hinted that the military targeting of cartels could be further expanded.\n\nThe White House did not immediately respond to questions about when and where the third strike occurred.\n\nTrump also sent a new warning to the Maduro government on Tuesday:\n\n“Stop sending Tren de Aragua to the United States,” Trump said. “Stop sending drugs into the United States.”\n\n Patel declines to provide legal justification for strikes on Venezuelan boats \n\nSen. Lindsey Graham, a South Carolina Republican who is a close ally of Trump, asked the FBI director what legal justification the administration is using for military strikes on Venezuelan boats that the president has said are carrying drugs.\n\nPatel declined to answer, saying he would leave that to Attorney General Pam Bondi.\n\nWhile Republicans in Congress haven’t objected to Trump using the U.S. military to strike the boats, some are beginning to ask questions on how the operations are conducted and their legal justification.\n\nStill, Graham expressed support for an aggressive approach to nations where drugs are manufactured.\n\n“We will hunt down every single one of those narco-traffickers,” Patel told Graham.\n\n Patel says investigation into pipe bombs on Jan. 6, 2021, is ‘ongoing’ \n\nDurbin asked Patel about statements from Dan Bongino before he became deputy director of the FBI that the bombs found at the Democratic National Committee and the Republican National Committee on Jan. 6, 2021, were an “inside job.”\n\nThe FBI director declined to comment on Bongino’s comments, but said he found Durbin’s criticism of Bongino “disgusting.”\n\n“So you have no evidence?” asked Durbin, the top Democrat on the Senate Judiciary Committee.\n\n“I got a lot of evidence, and I’ll give it to you when I can,” Patel said.\n\nThe person who placed the bombs just before the attack on the U.S. Capitol that day has never been identified.\n\n Patel spars with Durbin over Epstein files \n\nDuring one combative exchange, Patel was pressed by the top Democrat on the Senate Judiciary Committee over an unsigned memo released by the Justice Department in July that said there was no evidence of a Jeffrey Epstein “client list.”\n\nPatel responded with a dig at former President Joe Biden, telling Durbin: “Would you have preferred I used autopen?”\n\nRepublicans have accused the Democratic president of signing pardons in this final days in the White House with an autopen instead of by his own hand.\n\n Patel avoids answering questions on polygraph tests in tense exchange \n\nThe Senate hearing is quickly becoming tense, with the FBI director repeatedly avoiding answering questions from Sen. Durbin on how the bureau has administered polygraph tests to staff.\n\nPatel told Durbin, the top Democrat on the Judiciary Committee, that he wouldn’t discuss the specifics of how polygraph tests are administered or what questions come up.\n\nDurbin responded, “You have to have a decent memory when you come before a committee.”\n\nThe Associated Press has previously reported that agents and senior executives alike have been subjected to polygraph exams aimed at ferreting out disclosures of information related to Patel. \n\n Epstein comes up early \n\nPatel brought up the Epstein files in his opening statement, seeking to address a topic that’s brought criticism from some quarters of Trump’s conservative base who want to see more information released about the probe.\n\nThe FBI director faulted the original case against Jeffrey Epstein that ended in a plea deal years ago. He says it involved a “very limited search warrant” and asserted that the Trump administration has done more to release all “credible information” they could under the law.\n\nPatel also said Epstein had not been a source for the FBI.\n\nHe didn’t acknowledge criticism that the FBI and Justice Department have faced in recent months over the abrupt announcement in July that they would not be releasing additional documents from their trove of evidence.\n\n Trump welcomes Georgia Supreme Court decision in elections case against him \n\nThe state’s high court on Tuesday declined to hear Fulton County District Attorney Fani Willis’ appeal of her removal from the case.\n\nTrump reacted to the news by saying it was a “great decision” and a “rigged case to start off with.”\n\nHe also called for Willis to be jailed for attempting to prosecute him and several other individuals.\n\n▶ Read more on the ruling in the Georgia election fraud case against Trump and others\n\n Patel projects defiance \n\nPatel has concluded his opening statement before the Senate Judiciary Committee with a bit of a challenge for his critics: “I’m not going anywhere.”\n\nThe FBI director pointed to his experience as a congressional staffer and Trump administration official, saying, “If you want to criticize my 16 years of service, please bring it on.”\n\nSenate Republicans have continued to express confidence in Patel despite criticism from some conservative commentators of how he’s led the FBI’s response to the killing of Charlie Kirk.\n\nDemocrats, meanwhile, will intensely question Patel over what they say is a highly politicized approach to the FBI.\n\n Durbin calls for lower ‘temperature’ after Kirk’s death \n\nThe Illinois Democrat says both political parties “have a responsibility to bring down the temperature” and encourage unity following Kirk’s killing.\n\nIn his opening remarks earlier in the hearing, Durbin said Democrats are not responsible for Kirk’s death, just as Republicans are not responsible for the killing of a Democratic state lawmaker in Minnesota earlier this year.\n\nThe country is going through a period of division and political violence, he said, but “Republicans are not Nazis, Democrats are not evil.”\n\n Patel touts shift of FBI to target violent crime \n\nPatel’s opening remarks highlighted his efforts to transform the bureau to focus on combating violent crime.\n\nPatel said the FBI has arrested more than 23,000 violent criminals this year — an increase compared with last year. He also touted the FBI’s efforts to target drug trafficking and violent drug cartels.\n\nCritics have raised concerns that the focus on immigration enforcement and violent crime could divert attention from the FBI’s ability to focus on matters like counterterrorism.\n\n Patel gives a timeline of FBI’s response to Kirk shooting \n\nHe has faced some criticism from conservative corners about how he has led the FBI in the wake of the shooting, but Patel told the Senate panel that his agency — “at my direction” — successfully brought the suspect in Charlie Kirk’s killing into custody.\n\nHe also has touted the number of arrests made by the FBI, saying it represents an increase from the Biden administration.\n\n“We are leading the mission to crush violent crime and defend the homeland,” Patel said.\n\n Trump calls King Charles III, Queen Camilla friends as he prepares to depart for U.K. \n\nThe president said, “they’ve been friends of mine for a long time,” called the king an “elegant gentleman” and said, “I think he represents the country so well.”\n\nThe president, speaking as he was leaving the White House, said that U.K. officials want to continue trade negotiations during his coming visit.\n\n“They’d like to see if they can get a little bit better deal, so we’ll talk to them” he said.\n\n Durbin says Patel came to FBI with a ‘political mission’ \n\nThe top Democrat on the Senate Judiciary Committee, Dick Durbin, opened his remarks by criticizing Patel for the removal of career FBI officials and the diversion of agents to help with immigration enforcement.\n\nDurbin called Patel “arguably the most partisan FBI director ever,” saying he has “already inflicted untold damage on the FBI.” Durbin accused Patel of putting the country’s “national security and public safety at risk.”\n\n Grassley lists GOP criticism of past FBI probes as Kash Patel hearing kicks off \n\nRepublican Senate Judiciary Committee Chairman Chuck Grassley opened the hearing expressing sympathy for the fatal shooting last week of Charlie Kirk, which is under FBI investigation. \n\nThen he ran through a list of GOP criticisms of FBI investigations related to politics, ranging from the prosecution of White House adviser Peter Navarro for his response to a congressional subpoena, to the probe into Hillary Clinton’s use of a private email server. He also pledged to release new whistleblower records.\n\nGrassley decried Kirk’s “political assassination,” calling Kirk a “man of God, faith, family and country.”\n\n Suspect in Charlie Kirk shooting likely to face charges Tuesday \n\nProsecutors are preparing to file a capital murder charge Tuesday against the Utah man who authorities say held a “leftist ideology” and may have been “radicalized” online before he was arrested in the assassination of Charlie Kirk.\n\nCharges against 22-year-old Tyler Robinson are expected to come ahead of Tuesday’s first court hearing since he was accused last week of shooting Kirk, a conservative activist credited with energizing the Republican youth movement and helping Donald Trump win back the White House in 2024.\n\n Wall Street mostly higher ahead of retail sales data and Fed interest rate decision \n\nU.S. indices were mostly higher early Tuesday after Wall Street set new records and investor expectation grew that the Federal Reserve will announce its first interest rate cut of 2025 on Wednesday.\n\nS&P 500 futures rose 0.2% before the bell Tuesday while Big Tech stocks pulled Nasdaq futures 0.3% higher. Futures for the Dow Jones industrials were unchanged.\n\nOracle shares jumped 5% on speculation it would play a major part in the U.S.-China deal to keep TikTok operating in the U.S. after the Trump administration announced the framework of a trade deal on Monday.\n\nU.S. Treasury Secretary Scott Bessent said after the latest round of trade talks between the world’s two largest economies that Trump and Chinese Premier Xi Jinping would speak Friday to possibly finalize the deal.\n\n Georgia Supreme Court declines to hear Fani Willis’ appeal in Trump election case \n\nCiting an “appearance of impropriety” created by a romantic relationship Fulton County District Attorney had with special prosecutor Nathan Wade, the Georgia Court of Appeals had ruled that she and her office not continue to prosecute the case. election interference case against Donald Trump and others.\n\nSteve Sadow, Trump’s attorney in the Georgia case, said in a statement that Willis “deserved nothing less than disqualification.” A spokesperson for Willis did not immediately respond to a text message seeking comment.\n\nThe decision means it will be up to the Prosecuting Attorneys’ Council of Georgia to find another prosecutor, who could continue on the track that Willis has taken, decide to pursue only some charges or dismiss the case altogether.","summary":"FBI Director Kash Patel is confronting skeptical Democrats at a Senate hearing Tuesday, touting his leadership of the nation’s top federal law enforcement agency and facing questions about the investigation into Charlie Kirk’s killing, the case against sex offender Jeffrey Epstein and the firings of senior FBI officials who have accused Patel of illegal political retribution","url":"https://www.independent.co.uk/news/world/americas/fbi-jeffrey-epstein-white-house-donald-trump-charlie-kirk-b2827829.html","image":"https://static.independent.co.uk/2025/09/16/21/APTOPIX_FBI_Congress_95731.jpg?width=1200","video":null,"publish_date":"2025-09-16 20:19:49","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.23},{"id":361073936,"title":"Colorado voters are dissatisfied with Democrats. Polis, Hickenlooper and Bennet can’t hide (Editorial)","text":"Americans are recoiling from the Democratic Party, and even in blue states like Colorado, Democrats are feeling the burn.\n\nWith Republicans fielding the best candidate for governor they’ve had in a decade – Sen. Barbara Kirkmeyer – liberal politicians would be wise to address the root causes of this dissatisfaction publicly, frequently and head-on. The reality is that Americans are struggling — our politics are becoming more violent, everything is more expensive, and the job market is tightening.\n\nAfter years of enjoying popularity, Colorado’s top Democrats are now showing a remarkable drop in their approval ratings among voters. President Donald Trump remains deeply unpopular in the state, but Gov. Jared Polis, Sen. Michael Bennet and Sen. John Hickenlooper are failing to break a 50% approval rating, meaning more of those asked than not said they were unhappy with the politicians’ work.\n\nThese results from a poll conducted in early August of 1,136 registered Colorado voters by Magellan Strategies mirror what we are seeing across the nation. Americans are dissatisfied.\n\nAccording to a New York Times analysis of available voter registration numbers, the Democratic Party is hemorrhaging voters across the board and particularly in swing states. Meanwhile, the Republican Party is gaining voters after years of losses.\n\nPart of the shift is voters simply changing their affiliation to unaffiliated, but the Magellan Poll clearly indicates that there is more afoot than voters just looking to participate in open primaries.\n\nMagellan, a conservative-leaning Colorado firm, found that among voters who supported Kamala Harris in 2024, 47% have unfavorable opinions of the Democratic Party.\n\nTo be clear, voters who were polled still said they were more likely to support a Democrat for governor next year. Only 38% of those polled said they would likely support a Republican for governor. Kirkmeyer has an uphill battle to be certain, but her opponents are weakened.\n\nWe’d hazard a guess that the non-existent Democratic primary in 2023 to challenge a sitting president who was showing cognitive decline while in office is part of the reason voters are upset. It will take time for voters to forgive – and no one will ever forget – the disastrous presidential debate.\n\nBut national politics can’t take all the blame.\n\nGov. Jared Polis has served almost eight years in office and 52% of voters told pollsters that they had an unfavorable opinion of his work, and 35% strongly disapprove. That is softened only by the fact that 56% of voters polled strongly disapproved of the job President Donald Trump is doing, but Colorado has rejected Trump three times in general elections and the Republican Party rejected him in the 2016 caucus.\n\nU.S. Sen. Michael Bennet is doing slightly better with 44% of voters reporting disapproval of him, and U.S. Sen. John Hickenlooper was at 49%.\n\nBennet is going to face Attorney General Phil Weiser in the Democratic Primary for governor. Weiser wasn’t included in the poll and neither were any of the Republican candidates.\n\nThe bottom line is that Democrats cannot spend this election talking about Donald Trump, and pretending that voters don't have real concerns about the governance of both political parties. Voters may still put many or even most Democrats into office, but if the party wants to recover, its top leaders must start this election cycle with something more than fear and loathing.\n\nColoradans are concerned. The Magellan poll found that 54% of voters anticipate the economy will decline in the next 12 months (with more Democrats expressing this fear than Republicans), a pessimistic view that requires our politicians to articulate a plan for the worst-case scenario.\n\nSimilarly, 54% think Colorado is headed in the wrong direction (with more Republicans unhappy than Democrats), and the high cost of living, public safety, and homelessness were mentioned frequently by voters as top concerns, according to Magellan. These issues will only be harder to address given the decline in federal, state and local revenue sources. Our next governor will articulate a feasible plan.\n\nFinally, Democrats will win safe seats in 2026 with their heads in the sand, but if the party wants to gain ground in swing districts, its politicians are going to have to step up to the challenge at hand – restoring faith in and favorability of the party. Can that be done without rehashing the many missteps of the past four years? We would like to see elected officials be accountable and transparent.\n\nBut Colorado must move forward, as must the nation.\n\nIf Democrats want to stop losing ground, they've got to appeal to voters as far more than an alternative to Trump.\n\nSign up for Sound Off to get a weekly roundup of our columns, editorials and more. \n\nTo send a letter to the editor about this article, submit online or check out our guidelines for how to submit by email or mail.","summary":"Americans are recoiling from our two dismal political parties, and even in blue states like Colorado Democrats are feeling the burn.","url":"https://www.denverpost.com/2025/09/16/colorado-voters-dissatisfied-democrats-polis-hickenlooper-bennet/","image":"https://www.denverpost.com/wp-content/uploads/2023/10/TDP-L-BUCKLEY-PRESSER_JAC9660.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-16 20:07:01","author":"The Denver Post Editorial Board","authors":["The Denver Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.585},{"id":361075282,"title":"Republican Governor Warns of Trump’s Revenge if They Don’t Redistrict","text":"Trump is essentially filing this lawsuit on the grounds that the Times’ coverage isn’t kind enough to him. The 85-page lawsuit specifically calls out Times writers Peter Baker, Michael S. Schmidt, Susanne Craig, and Russ Buettner. The latter two wrote the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, published last year. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar [sic] Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual “mouthpiece” for the Radical Left Democrat Party,” Trump wrote Monday evening on Truth Social. “I view it as the single largest illegal Campaign contribution, EVER. Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThis is a tried and true method for Trump, as he sued Disney’s ABC and Paramount Global’s CBS News for defamation, settling each case for millions of dollars. The Times likely isn’t planning on folding in the same way, as publisher A.G. Sulzberger told media members in a Monday gala speech before Trump’s announcement to “stand up for your journalism. Stand up for your journalists. Stand up for your rights.”","summary":"Indiana Governor Mike Braun wants state legislators to get moving on approving a new congressional district map, to spare them from President Donald Trump’s wrath. \n\nSpeaking on Fort Wayne’s WOWO radio Monday, Braun floated the idea of lawmakers returning for a special session in November, to scrounge up extra GOP seats ahead of the 2026 midterm elections. \n\n“If we try to drag our feet as a state on it, probably, we’ll have consequences of not working with the Trump administration as tightly as we should,” he said.  \n\nBraun is the only lawmaker in Indiana with the authority to call a special session in November. Special sessions are historically pretty expensive for taxpayers. If Braun doesn’t call a special session, Republicans’ redistricting efforts would have to wait until the next session begins in January 2026. \n\nBraun said Tuesday that he preferred to start working “earlier rather than later,” or “anytime from early November through the very earliest part” of the next legislative session. \n\n“All I’m tel","url":"https://newrepublic.com/post/200539/republican-governor-donald-trump-revenge-redistrict-indiana","image":"https://images.newrepublic.com/90fc9be3b684d087f727138bc4aa63398334f58a.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-09-16 19:20:56","author":"Edith Olmsted","authors":["Edith Olmsted"],"language":"en","category":"politics","source_country":"US","sentiment":0.108},{"id":361053818,"title":"Pam Bondi Is Really Wrong About Hate Speech","text":"Attorney General Pam Bondi has made quite the First Amendment-related faux pas: In a recent interview about what the federal government could do to deter political violence in the wake of Charlie Kirk's assassination, she said the federal government would \"go after\" anyone engaged in hate speech.\n\nBondi should know, however, that hate speech is vigorously protected by the First Amendment, and as such, cannot be policed.\n\nUnfortunately, the attorney general made an illusory distinction between free speech and hate speech, implying that the latter was subject to government action.\n\n\"There's free speech and then there's hate speech, and there is no place, especially now, especially after what happened to Charlie, in our society,\" she said.\n\nAttorney General Pam Bondi: \"There's free speech and then there's hate speech, and there is no place, especially now, especially after what happened to Charlie, in our society…We will absolutely target you, go after you, if you are targeting anyone with hate speech.\" pic.twitter.com/Bqj6TQOGwP\n— The Bulwark (@BulwarkOnline) September 16, 2025\n\nBondi sounds like Minnesota Gov. Tim Walz, Kamala Harris' pick to be vice president, who made similar claims during the 2024 campaign—and that's a very bad thing. Both are appallingly wrong. The Supreme Court has repeatedly affirmed that so-called hate speech falls under First Amendment protection, most recently in the 2017 case Matal v. Tam, which was decided unanimously.\n\nAfter numerous commentators—including many fellow conservatives—called out Bondi, she clarified that she was referring to \"hate speech that crosses the line into threats of violence.\" She's correct that true threats of violence against specific individuals or institutions lose First Amendment protection if they are specific enough, though general advocacy of violence is usually still protected. This kind of speech isn't called hate speech though; it's called incitement. Hate speech, on its own, is simply not a separate category of unprotected speech, from the standpoint of the Supreme Court.\n\nIn a separate interview, Bondi also suggested that employers had an obligation to fire employees for engaging in hate speech or for actions such as refusing to print pro-Kirk posters at Home Depot.\n\nGiven that conservative legal advocates have worked tirelessly to defeat public accommodation laws that clash with private entities' moral, political, or religious beliefs, many on the right were not pleased to hear Bondi adopting this position. The Daily Wire's Matt Walsh called her opinion \"insane\" and said that President Trump should fire her. Sen. Ted Cruz (R–Texas) similarly clarified that the First Amendment absolutely protects hate speech, while noting that individuals could still suffer professional consequences for saying cruel things about Kirk.\n\nIronically, Bondi could have avoided this mess had she listened more closely to one specific person: Charlie Kirk. As journalist Brad Polumbo pointed out, Kirk previously wrote on X: \"Hate speech does not exist legally in America. There's ugly speech. There's gross speech. There's evil speech. And ALL of it is protected by the First Amendment. Keep America free.\"\n\nWords to remember.","summary":"The attorney general is now getting called out by fellow conservatives.","url":"https://reason.com/2025/09/16/pam-bondi-is-really-wrong-about-hate-speech/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/09/upiphotosthree097462-scaled.jpg","video":null,"publish_date":"2025-09-16 18:59:05","author":"Robby Soave","authors":["Robby Soave"],"language":"en","category":"politics","source_country":"US","sentiment":-0.46},{"id":361049646,"title":"Netflix’s Christmas NFL Games Set Announcer Teams","text":"Skip to main content\n\nSeptember 16, 2025 11:53am\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nNoah Eagle and Ian Eagle\n\nTheo Wargo/Getty Images\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nThe second set of Christmas Day NFL games on Netflix will bring back several of the people who called the action the first time around.\n\nThe NFL and the streamer announced the names of the people calling the two games on Tuesday. As was the case last year, CBS Sports is producing the games for Netflix, and all three members of the booth for the early game on Christmas (Dallas Cowboys at Washington Commanders) will come from CBS.\n\nIan Eagle will do play-by-play for the game, joined by analysts Nate Burleson and Matt Ryan. Eagle is CBS’ No. 2 NFL play-by-play announcer, and Burleson and Ryan (both former NFL players) work on CBS’ Sunday pregame show The NFL Today. Burleson also co-hosts CBS Mornings.\n\nEagle and Burleson called one of Netflix’s Christmas games last season, along with fellow CBS analyst JJ Watt.\n\nThe late afternoon game (Detroit Lions at Minnesota Vikings) will have NBC’s Noah Eagle (Ian’s son) on play by play and Super Bowl-winning quarterback Drew Brees as analyst. Noah Eagle also did play by play for Netflix a year ago, while Brees will make a return to the broadcast booth. He was with NBC Sports for a couple of years following his retirement from the NFL.\n\nSideline reporters for the two games and the crew for Netflix’s studio programming (which will be produced by NFL Media) will be announced later.\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nWhere ‘Gen V’ Season 2 Finds Its Supes (and Couples) After ‘The Boys’ Season 4\n\nCarrie Ann Inaba to Miss ‘Dancing with the Stars’ Season 34 Premiere\n\nJulie McNamara\n\nJulie McNamara Returns to Development at CBS Studios, Sort of, as Partner to Jennie Snyder Urman\n\nFour ‘Real Housewives’ Get ‘Wife Swap’ Treatment in New Bravo Series\n\nRachel Maddow\n\nKamala Harris to Appear on ‘The Rachel Maddow Show’ in First Major News Interview\n\nThe Real Housewives of Salt Lake City\n\nHow to Watch ‘The Real Housewives of Salt Lake City’ Season 6 Online With Sling TV\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"Noah and Ian Eagle will once again take on play-by-play duties for the two contests.","url":"https://www.hollywoodreporter.com/tv/tv-news/netflix-2025-nfl-christmas-games-announcers-1236372757/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/09/GettyImages-2216150454.jpg","video":null,"publish_date":"2025-09-16 18:53:52","author":"Rick Porter","authors":["Rick Porter"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.385},{"id":361039996,"title":"Sonia Sotomayor Appears to Rip Pam Bondi: “That Law School Failed”","text":"Trump is essentially filing this lawsuit on the grounds that the Times’ coverage isn’t kind enough to him. The 85-page lawsuit specifically calls out Times writers Peter Baker, Michael S. Schmidt, Susanne Craig, and Russ Buettner. The latter two wrote the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, published last year. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar [sic] Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual “mouthpiece” for the Radical Left Democrat Party,” Trump wrote Monday evening on Truth Social. “I view it as the single largest illegal Campaign contribution, EVER. Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThis is a tried and true method for Trump, as he sued Disney’s ABC and Paramount Global’s CBS News for defamation, settling each case for millions of dollars. The Times likely isn’t planning on folding in the same way, as publisher A.G. Sulzberger told media members in a Monday gala speech before Trump’s announcement to “stand up for your journalism. Stand up for your journalists. Stand up for your rights.”","summary":"Supreme Court Justice Sonia Sotomayor on Tuesday seemed to throw a sidelong barb at Attorney General Pam Bondi for foolishly suggesting the existence of a “hate speech” exception to free speech.\n\nAs the far-right wages an ongoing crusade against people accused of mocking slain conservative activist Charlie Kirk, Bondi said on a Monday podcast that “hate speech” is not free speech. The Department of Justice, she vowed, will “target you, go after you, if you are targeting anyone with hate speech.” \n\nThe sentiment was widely criticized, including by MAGA commentators, for undermining the First Amendment. Bondi attempted to walk back her statement on Tuesday.\n\nDuring a Tuesday morning panel at New York Law School, Sotomayor seemingly took aim at Bondi, but did not mention the attorney general by name. \n\n“Every time I listen to a lawyer-trained representative saying we should criminalize free speech in some way, I think to myself, that law school failed,” the liberal justice reportedly said. “If any student who be","url":"https://newrepublic.com/post/200532/sonia-sotomayor-pam-bondi-that-law-school-failed","image":"https://images.newrepublic.com/63397dc2110da5c5fc064f29e34923aa27480010.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-09-16 18:35:23","author":"Robert McCoy","authors":["Robert McCoy"],"language":"en","category":"politics","source_country":"lr","sentiment":0.108},{"id":361039990,"title":"Kash Patel Loses It When Adam Schiff Asks About Ghislaine Maxwell","text":"Trump is essentially filing this lawsuit on the grounds that the Times’ coverage isn’t kind enough to him. The 85-page lawsuit specifically calls out Times writers Peter Baker, Michael S. Schmidt, Susanne Craig, and Russ Buettner. The latter two wrote the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, published last year. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar [sic] Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual “mouthpiece” for the Radical Left Democrat Party,” Trump wrote Monday evening on Truth Social. “I view it as the single largest illegal Campaign contribution, EVER. Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThis is a tried and true method for Trump, as he sued Disney’s ABC and Paramount Global’s CBS News for defamation, settling each case for millions of dollars. The Times likely isn’t planning on folding in the same way, as publisher A.G. Sulzberger told media members in a Monday gala speech before Trump’s announcement to “stand up for your journalism. Stand up for your journalists. Stand up for your rights.”","summary":"FBI Director Kash Patel is apparently not making child sex predators a priority at the bureau.\n\nPatel finished his latest—and potentially last—hearing before the Senate Judiciary Committee kicking and screaming Tuesday, raising his voice to Senator Adam Schiff after the lawmaker questioned the recent transfer of Ghislaine Maxwell to a minimum security prison camp in Texas.\n\nSchiff pointed out that the facility was “not suitable for a sex offender,” and that Maxwell’s transfer had been arranged after she provided testimony to federal authorities, including members of the FBI.\n\n“Who made that decision and why?” asked Schiff.\n\nPatel responded hastily: “The Bureau of Prisons.”\n\n“The Bureau of Prisons decided on their own—without any consultation from [deputy Attorney General Todd] Blanche or anyone else—that they were going to suddenly after this interview, completely unrelated to this interview, completely unrelated to anything she said, move her to a prison not suitable for a sex offender?” pressed Schiff. “Do ","url":"https://newrepublic.com/post/200535/kash-patel-adam-schiff-ghislaine-maxwell","image":"https://images.newrepublic.com/ff31dcef9503f0e9ad96b73778ca5a99673702b9.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-09-16 18:28:53","author":"Ellie Quinlan Houghtaling,Everyone Hates Elon","authors":["Ellie Quinlan Houghtaling","Everyone Hates Elon"],"language":"en","category":"politics","source_country":"lr","sentiment":0.108},{"id":361041048,"title":"President Donald Trump Files $15B Defamation Lawsuit Against NY Times","text":"Source: Kevin Dietsch / Getty President Donald Trump is suing the New York Times for what appears to be little more than an assault on the president’s vanity. According to NBC News, Trump filed a $15 billion defamation suit against the Times, four of its reporters, and a publishing company on Monday in U.S. District Court for the Middle District of Florida. The suit accuses the defendants of attempting to ruin his reputation as a businessman, undermine his 2024 presidential campaign, and “prejudice judges and juries against him in coverage of his campaign,” NBC reported. Even if we were to pretend for a moment that this lawsuit isn’t just part of Trump’s continued propaganda effort to attack the free press and convince people (including himself) that every unfavorable story about him is “fake news,” one sample of the language in the suit pretty much reveals it’s all about Trump being a big, ego-driven baby whose feelings are hurt because not everyone worships the ground he walks on. That’s not hyperbole, either. The suit literally alleges that the Times “continued spreading false and defamatory content about President Trump” and refused to recognize that he “secured the greatest personal and political achievement in American history” with his 2024 win. Imagine winning your bid for a second term in the White House and still being so salty you feel the need to sue a publication for rooting against you. Even if we were to consider Trump’s 2024 win — which came after his 2020 loss and him losing the popular vote by about 3 million votes in 2016 — a great “political achievement, it would only be great and historic because a bumbling idiot who Mr. Magooed his way into a Republican politics monopoly and managed to get reelected even after he started a domestic terrorist attack on the U.S. Capitol after spreading months of propaganda about 2020 election fraud as part of an extended temper tantrum. Sure, it’s historic, but Trump would still want to sue if a media outlet told the truth about the reasons why. The suit even singles out the NYT’s editorial board for endorsing Trump’s Democratic opponent, former VP Kamala Harris. (Again, does this man realize that he won this election already?) “The [editorial] Board asserted hypocritically and without evidence that President Trump would ‘defy the norms and dismantle the institutions that have made our country strong,'” the suit states. Oh really? Trump is going to “defy norms” and start dismantling long-standing institutions? You don’t say! Gee, one should really hope the defendants can’t show that Trump has, oh, I don’t know, “defied norms” by doing things like sending the National Guard and other troops into U.S. cities to fight crime against the wishes of those cities’ leadership and, often, without even consulting them. It would be a shame if the Times argued that Trump has moved to dismantle the institutions that have made our country strong by, say, playing fast and loose with the U.S. Constitution by picking and choosing when due process matters or withholding congressional-approved federal funding from states and “institutions” without bothering to go through Congress. It’s not like the Trump administration has rolled back or sought to do away with key civil rights protections that have been in place for decades, taken over institutions of the arts like the Kennedy Center and the Smithsonian, moving to force them to MAGA-fy their content, programming, and exhibits. No, no, Trump has plenty reason to sue — as long as he hasn’t sought to undermine the democratic electoral process, dismantle the Department of Education, propagandize the media into “fake news” oblivion, re-write history to appease conservative ideology, threaten to take away the citizenship of U.S. citizens just for being “nasty” to him, and repeatedly muse about possibly becoming a dictator. Whew, that would have been a shame. Anyway, Trump also named in his suit Penguin Random House, which published a book by Craig and Buettner titled Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success. The four specific Times reporters he named as defendants are Susanne Craig, Russ Buettner, Peter Baker, and Michael S. Schmidt. “Today, the Times is a full-throated mouthpiece for the Democrat Party,” the lawsuit alleges. “The newspaper’s editorial routine is now one of industrial-scale defamation and libel against political opponents. As such, the Times has become a leading, and unapologetic purveyor of falsehoods against President Trump.” (By this logic, every Democrat over the last couple of decades should be getting their attorneys on the phone to sue Fox News, but whatever.) Newsroom lawyer David McCraw responded by defending the reporting in articles mentioned by Trump’s lawyers. “Little needs to be said about the rest of your letter, which is principally a litany of personal complaints about The New York Times and its reporters, punctuated with falsehoods and premised on the deeply troubling notion that anyone who dares to report unfavorable facts about a presidential candidate is engaged in ‘sabotage’ (as opposed to, say, contributing to the free exchange of information and ideas that makes our democracy possible),” McCraw wrote, according to the letter attached to Monday’s suit. Carolyn K. Foley, Penguin Random House senior vice president and associate general counsel, responded to Trump’s lawyer Edward Andrew Paltzik: “The fact that the authors of the book do not share your favorable view of your client’s career, does not provide the foundation for a defamation claim.” It’s worth mentioning that Trump’s latest anti-media lawsuit comes after ABC and Paramount, the parent company of CBS, both settled lawsuits brought by Trump, who also filed a suit against the Wall Street Journal and its ownership in July. Welp, if the truth hurts, you take legal action against the truth teller. It’s the Trumpian way. SEE ALSO: Thanks To Donald Trump, The American Dream Is Dead Donald Trump Wants To Send Americans To Foreign Prisons Donald Trump Wants To Give Reparations To Jan. 6 Insurrectionists","summary":"Donald Trump's lawsuit names the New York Times, four of its reporters, and the publisher of an anti-Trump book, accusing them of ruining his reputation.","url":"https://newsone.com/6463731/president-donald-trump-files-15b-defamation-lawsuit-against-ny-times/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/09/175803910834.jpg?quality=80&strip=all&w=1024&crop=0,0,100,725px","video":null,"publish_date":"2025-09-16 18:00:00","author":"Zack Linly","authors":["Zack Linly"],"language":"en","category":"politics","source_country":"US","sentiment":-0.245},{"id":361065698,"title":"'White Lotus' Star Jennifer Coolidge Faces Backlash For Alleged Charlie Kirk Follow On Instagram","text":"Actress Jennifer Coolidge has had something of a renaissance in recent years, thanks to her role on the very popular series The White Lotus, and has been adored by many on the left. That is, until this weekend, when a fan account of the show realized that Coolidge was following late political activist and media personality Charlie Kirk. As you might expect, the reaction to this was reasonable… …I'm kidding; of course, it wasn't. READ: TRANS CYCLIST TELLS PROTESTERS TO 'SUCK A SAWN-OFF SHOTGUN' DAYS AFTER CELEBRATING CHARLIE KIRK'S DEATH The account @oocwhitelotus (which stands for \"Out of Context White Lotus\") typically shares clips from the show and other content focused on the show and its stars. Well, on Saturday, the night before the Emmy Awards at which The White Lotus and its stars had a big presence, the account posted a photo of Kirk's Instagram page under which it said that he was followed by Coolidge. Now, I have no clue where the actress known for her iconic role as Stifler's Mom, her parts in a bunch of Christopher Guest films, and a great guest spot in the Seinfeld episode, \"The Masseuse,\" stands on the political spectrum. I think that's a good thing, but if I had to wager a guess, I probably would've assumed she fell somewhere between Bill Maher and Michael Moore. She's considered a \"gay icon\" and follows left-wing politicians like Kamala Harris and Hillary Clinton, too, per Daily Mail. Maybe she does, maybe she doesn't. Perhaps, like a lot of people, her politics aren't a one-size-fits-all approach in which she said, \"I'm with the blue team!\" and, instead, resonated with at least some of Kirk's ideas. Many of those ideas were very common sense and reasonable to any rational person willing to actually listen to them. And, this is if that photo is genuine. I checked, and it didn't look like she still followed Kirk's page, if she ever did. Well, many of the page's followers did what you'd expect: knee-jerk progressive outrage and immediately announced that they were done with a woman they had probably been fans of for years, over one person she followed on social media. It's wild how quickly the left will turn on its own — which I mean, people it previously championed — over something as trivial as an alleged social media follow. But, at this point, it's really par for the course.","summary":"","url":"https://www.outkick.com/culture/jennifer-coolidge-charlie-kirk-follow-backlash","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/09/coolidge-kirk.jpg","video":null,"publish_date":"2025-09-16 17:30:10","author":"Matt Reigle","authors":["Matt Reigle"],"language":"en","source_country":"us","sentiment":-0.111},{"id":361038334,"title":"Opinion: Political change comes to San Francisco Bay Area","text":"This column was originally published by CalMatters. Sign up for their newsletters.\n\nCalifornia is one of the nation’s bluest states, and its bluest region is the nine-county San Francisco Bay Area.\n\nIn San Francisco itself, there are eight times as many registered Democrats as there are Republicans and while Democratic margins in other Bay Area counties are not as lopsided, 4-to-1 or even 5-to-1 ratios are standard.\n\nLast year’s presidential election saw similar overwhelming majorities in the region for Vice President Kamala Harris — a product of Bay Area politics — over Donald Trump.\n\nAccordingly, 100% of the Bay Area’s congressional and legislative seats are held by Democrats, and the party utterly dominates county boards of supervisors, city councils and the governing boards of school districts and other units of local government.\n\nJohn Burton, a long-serving congressman and state legislator who died recently at age 92, personified the Bay Area’s history of Democratic hegemony.\n\nThe political organization he, his late brother, Phil Burton, and former Assembly Speaker and San Francisco Mayor Willie Brown founded in the 1950s remains — at least as long as the 91-year-old Brown remains alive — a very potent player in regional, state and even national politics.\n\nHowever, Democrats didn’t always dominate Bay Area politics. Until the 1960s, the region had many Republican officeholders and a few remained into the 1980s, particularly in the suburbs.\n\nThe Bay Area is not going to change its partisan stripes anytime soon, and probably never. However, an interesting phenomenon is developing in the region — the rise of Democratic political figures who hew to the middle, much to the chagrin of those on the party’s left wing.\n\nTwo Democratic mayors, San Francisco’s Daniel Lurie and San Jose’s Matt Mahan, personify the drift, and an atmospheric change in San Francisco’s governing Board of Supervisors, long a bastion of progressive politics, is another indication.\n\nLurie, elected last year, comes from personal wealth and philanthropic engagement and shuns ideological conflicts while promoting fiscal responsibility and reform of his city’s notoriously restrictive regulatory processes.\n\nHis most recent effort is what he calls PermitSF, a package of “six ordinances with common-sense changes for those living, building housing, or operating a business in San Francisco.”\n\n“Today, we are getting rid of the nonsense and focusing on common sense, with a new set of reforms that will make it easier for San Franciscans to live, grow, and invest in this city,” Lurie said as he revealed the package.\n\nProgressives on the city’s governing board may resist Lurie’s actions but, as a recent San Francisco analysis of voting records points out, “For the first time since 2019, the city’s left-leaning supervisors are outnumbered by a more centrist group that not only has more seats but also consistently votes together.”\n\nMeanwhile, Mahan, who had careers in philanthropy and high technology before running for mayor in 2022, is also a non-doctrinaire Democrat. He broke with the party by endorsing Proposition 36, a 2024 ballot measure to crack down on crime, and recently published an article sharply criticizing Newsom for ignoring the state’s bad business climate.\n\nMahan said “the governor, and every elected official and leader, also need to own up to the truth. And the truth is that California has the highest unemployment rate in the nation, at 5.5%, and nearly half the nation’s unsheltered homeless people. We have the highest energy and housing costs in the continental United States, and, largely because of these high costs, the highest effective poverty rate in the nation.”\n\nWhen one political party becomes dominant, it often fragments into factions defined by geography, culture, personality or ideology. What’s happening in the Bay Area exemplifies that pattern.\n\nNewsom will learn that being an early frontrunner pins a target on his back.\n\nCalMatters is a nonpartisan and nonprofit news organization bringing Californians stories that probe, explain and explore solutions to quality of life issues while holding our leaders accountable.\n\nWant to submit a letter to the editor, guest column or opinion piece? Find our guidelines and submission form here.","summary":"An interesting phenomenon is developing in the liberal region — the rise of Democratic political figures who hew to the middle.","url":"https://timesofsandiego.com/opinion/2025/09/16/political-change-comes-san-francisco-bay-area/","image":"https://i0.wp.com/timesofsandiego.com/wp-content/uploads/2024/11/San-Francisco-Sales-Force-scaled.jpg?fit=2560%2C1707&ssl=1","video":null,"publish_date":"2025-09-16 17:00:00","author":"Dan Walters • CalMatters Columnist,Jeff Chiu","authors":["Dan Walters • CalMatters Columnist","Jeff Chiu"],"language":"en","category":"politics","source_country":"us","sentiment":0.117},{"id":361025802,"title":"Trump files $15 billion defamation case against New York Times, Penguin Random House - Reuters","text":"SummaryCompaniesTrump sues NYT, Penguin Random House for $15 billionNYT says case is meritless, aimed at stifling reportingLawsuit is Trump's latest attack on major media outlets\n\nSept 15 (Reuters) - President Donald Trump has filed a $15 billion defamation lawsuit against the New York Times and book publisher Penguin Random House, his latest legal assault on major media companies he accuses of treating him unfairly.\n\nThe lawsuit filed on Monday in Florida federal court centers on a book about Trump by two New York Times reporters and three \"false, malicious, defamatory, and disparaging\" articles that he says were aimed at sabotaging his chances in the 2024 presidential election.\n\nAdvertisement · Scroll to continue\n\nIn a statement on Tuesday, the Times said Trump's lawsuit has no legitimate legal claims and is an attempt to stifle and discourage independent reporting.\n\nPenguin Random House did not respond to requests for comment.\n\nU.S. law makes it difficult for public figures like Trump to prevail in defamation cases, requiring them to prove defendants published information they knew or should have known was false.\n\nTrump has nonetheless mounted a flurry of legal attacks against major media outlets during his second term, including a $10 billion defamation case against the Wall Street Journal in July.\n\nIn his Monday lawsuit, Trump accused the New York Times and Penguin Random House of maliciously publishing articles and a book filled with \"repugnant distortions and fabrications about President Trump.\"\n\nAdvertisement · Scroll to continue\n\nItem 1 of 3 U.S. President Donald Trump, accompanied by U.S. Homeland Security Secretary Kristi Noem, U.S. Attorney General Pam Bondi, U.S. Senators Marsha Blackburn (R-TN) and Bill Hagerty (R-TN), speaks during an event to sign a memorandum to send federal resources to Memphis, Tennessee, for a surge against local crime, in the Oval Office at the White House in Washington, D.C., U.S., September 15, 2025. REUTERS/Jonathan Ernst REFILE - CORRECTING THE TITLES OF BLACKBURN AND HAGERTY FROM \"TENNESSEE SENATORS\" TO \"U.S. SENATORS\".[1/3]U.S. President Donald Trump, accompanied by U.S. Homeland Security Secretary Kristi Noem, U.S. Attorney General Pam Bondi, U.S. Senators Marsha Blackburn (R-TN) and Bill Hagerty (R-TN), speaks during an event to sign a memorandum to send federal resources to Memphis, Tennessee, for a surge... Purchase Licensing Rights, opens new tab Read more\n\nThe lawsuit cites three articles, including an editorial prior to the 2024 election saying Trump was unfit for office, and a 2024 book titled \"Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success,\" which was written by two Times reporters and published by Penguin Random House.\n\nThose publications harmed Trump's business and personal reputation, thereby causing massive economic damage to his brand value and significant damage to his future financial prospects, Trump's lawyers said in a court filing.\n\nThe filing comes after Trump threatened, opens new tab last week to sue the New York Times for its reporting on an allegedly sexually suggestive note and drawing given to Jeffrey Epstein, the disgraced financier and sex offender who died by suicide in a New York jail cell in 2019.\n\nTrump has said he parted ways with Epstein before the financier's legal troubles became public in 2006.\n\nTrump has intensified his legal attacks on the media during his second term.\n\nIn July, Trump sued the Wall Street Journal and its owners for $10 billion over the newspaper's coverage of Trump's ties to Epstein. The Journal has said the lawsuit is meritless.\n\nAlso in July, CBS parent company Paramount agreed to give $16 million to Trump's presidential library to settle his lawsuit alleging that the CBS news program \"60 Minutes\" deceptively edited an interview with former Vice President Kamala Harris to boost the Democrat's chances in the 2024 election.\n\nAnd in December, ABC News agreed to give $15 million to Trump’s library to settle a lawsuit over comments that anchor George Stephanopoulos made on air involving sex abuse claims brought against Trump by writer E. Jean Carroll.\n\nReporting by Jack Queen in New York and Gursimran Kaur and Shivani Tanna in Bengaluru; Editing by Kim Coghill, Clarence Fernandez, Michael Perry and Daniel Wallis\n\nPurchase Licensing Rights\n\nJack QueenThomson ReutersJack Queen covers major lawsuits against the Trump administration involving urgent questions of executive power and how their resolution could affect the law and the legal profession in the years to come. Previously, he covered criminal and civil cases against Trump during the interim of his presidential terms, including gavel-to-gavel coverage of his historic hush money trial in New York and his civil fraud trial, which ended in a half-billion-dollar judgment. Jack has also covered high-profile defamation cases including the Dominion Voting Systems' lawsuit against Fox News, which settled for $787 million after intense pretrial litigation. Based in New York, he specializes in breaking news as well as analysis, explainers and other explanatory reporting.","summary":"Trump files $15 billion defamation case against New York Times, Penguin Random House  Reuters","url":"https://www.reuters.com/world/us/trump-files-15-billion-defamation-case-against-new-york-times-penguin-random-2025-09-16/","image":"https://www.reuters.com/resizer/v2/H7CPQZC62JICLEFBR37QGKM5XU.jpg?auth=21aa7d5dd2bc3560185ac1691952c322e945f2ed12a2725759e8592220771270&height=1005&width=1920&quality=80&smart=true","video":"https://ajo.prod.reuters.tv/v3/playlist/702363/master.m3u8","publish_date":"2025-09-16 16:57:35","author":"Jack Queen","authors":["Jack Queen"],"language":"en","source_country":"gb","sentiment":-0.526},{"id":361042596,"title":"'Contradictory conclusions': Why Trump isn’t as 'unpopular' as you might think","text":"After President Donald Trump lost the 2020 election, his detractors — a mixture of Democrats, centrists, liberals, progressives, and right-wing Never Trump conservatives — hoped that he was finished in U.S. politics. But Trump showed his resilience in 2024: Despite four criminal indictments, two impeachments, a conviction on 34 felony counts, and major losses in costly civil lawsuits, Trump narrowly defeated Democratic nominee Kamala Harris and returned to the White House on January 20, 2025.\n\nTrump, now almost eight months into his second presidency, is faring poorly in many polls. But journalist David M. Drucker, in an opinion column published by Bloomberg News on September 16, argues that Trump's poll numbers have more nuance than meets the eye.\n\n\"President Donald Trump is not as popular as he claims,\" Drucker writes. \"But neither is he as unpopular as his opponents might like to think. That's the simple explanation. Dig under the hood, however, and things get complicated. I'm constantly asked to assess Trump's political standing; it's among the more consistent questions posed to professional political analysts. And — in case you hadn't noticed — there is a ton of polling out there. But these surveys, many of them credible and worth considering, often spit out different data, allowing interested readers to draw different, sometimes contradictory, conclusions.\"\n\nREAD MORE: 'Something is wrong': MAGA pundits say Trump is 'lying to us' about Charlie Kirk shooting \n\nDrucker stresses that while Trump's poll numbers aren't great, he isn't \"flatlining\" either.\n\n\"Even respected polling averages — which you should absolutely heed more than individual polls — aren't saying quite the same thing,\" Drucker explains. \"The Silver Bulletin’s most recent average clocks the president’s job approval rating at 44.2 percent; the RealClearPolitics average is 45.9 percent and the Cook Political Report's average is 42.9 percent. Yes, the numbers are similar. But mentally, 46 percent and 43 percent can feel much different — after all, elections have been decided by slimmer margins.\"\n\nDrucker continues, \"Either way, Trump's 'topline' job approval rating — the overall share of voters who approve of how he's doing — is short of 50 percent — a vital sign that suggests poor political health for the president personally. And yet, to extend the analogy further, Trump is not flatlining.\"\n\nCNN polling expert Harry Enten stresses that Trump's hardcore MAGA base is as devoted as ever.\n\nREAD MORE: Liberals need to stop spreading this myth about Charlie Kirk \n\nEnten told Drucker, \"His base is solid as a rock…. There is zero doubt that Trump is in a better position now than he was at this point in his first presidency…. Maybe the right baseline is comparing him to other second-term presidents. In that way, he’s in a better position than George W. Bush and, arguably, Barack Obama.\"\n\nREAD MORE: 'Deeply troubling': Military expert warns Trump is unilaterally 'deciding to kill people' \n\nRead David M. Drucker's full column for Bloomberg News at this link (subscription required).","summary":"After President Donald Trump lost the 2020 election, his detractors — a mixture of Democrats, centrists, liberals, progressives, and right-wing Never Trump conservatives — hoped that he was finished in U.S. politics. But Trump showed his resilience in 2024: Despite four criminal indictments, two impeachments, a conviction on 34 felony counts, and major losses in costly civil lawsuits, Trump narrowly defeated Democratic nominee Kamala Harris and returned to the White House on January 20, 2025.\n\nTrump, now almost eight months into his second presidency, is faring poorly in many polls. But journalist David M. Drucker, in an opinion column published by Bloomberg News on September 16, argues that Trump's poll numbers have more nuance than meets the eye.\n\n\"President Donald Trump is not as popular as he claims,\" Drucker writes. \"But neither is he as unpopular as his opponents might like to think. That's the simple explanation. Dig under the hood, however, and things get complicated. I'm constantly asked to assess Tr","url":"https://www.alternet.org/trump-polls-drucker/","image":"https://www.alternet.org/media-library/image.jpg?id=61607993&width=1200&height=600&coordinates=0%2C500%2C0%2C500","video":null,"publish_date":"2025-09-16 16:38:29","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":-0.108},{"id":361040714,"title":"Tim Walz seeks third term as Minnesota's governor in 2026","text":"Sept. 16 (UPI) -- Minnesota Gov. Tim Walz announced Tuesday he will seek a third term in the state's 2026 elections.\n\nWalz, who was the Democratic Party's 2024 vice presidential nominee, released a campaign video announcement saying he has \"always tried to do what's right for Minnesota.\"\n\n\"I've seen how we help eachother in the hard times,\" Walz opened his 2-minute long clip posted to social media. \"And I'lll never stop fighting to protect us from the chaos, corruption and cruelty coming out of Washington.\"\n\nWalz was picked last year in August by then-U.S. Vice President Kamala Harris to be her running mate after President Joe Biden later dropped out of the race following a debate performance with now-President Donald Trump that left top brass in the Democratic Party establishment publicly questioning Biden's fitness to continue.\n\nMinnesota is one of around 36 states that allow a governor to seek election for more than two terms.\n\nHe now joins Illinois Democratic Gov. JB Pritzker seeking a third term in the 2026 election.\n\nSeveral Republicans have jumped in the race including Walz's 2022 GOP opponent Scott Jensen, who Walz and Lt. Gov. Peggy Flanagan beat in 2022 by about 7 points.\n\nIf Walz wins, he will be the first Minnesota governor to serve more than two terms since then-Gov. Rudy Perpich, also a Democrat-Farmer-Labor party member, left office in 1991 for Republican Gov. Arne Carlson.\n\nWalz revealed he was considering a special legislative session to address Minnesota's gun laws following the shooting death of state lawmaker Melissa Hortman.\n\nOn Tuesday, he paid tribute to Hortman saying \"we've sen terrible times this year,\" and that he was \"heartbroken and angry about the beautiful people we've lost to gun violence.\"\n\n\"But it's in these moments we have to come together,\" he said. \"We can't lose hope because I've seen what what we can when we come together.\"\n\nEarlier this year he endorsed Minnesota native Ken Martin in his successful bid to lead the Democratic National Committee as chair.\n\nRumors swirled that Walz would run for Minnesota's U.S. Senate seat being vacated by Sen. Tina Smith, a fellow Democrat, after last November's presidential election won by Trump.\n\nBut Walz revealed he would explore a third term around the same time that Flanagan rolled out her own campaign to win Smith's seat in Washington.\n\nWalz, however, has yet to endorse Flanagan amid rumors of a rift between the two following their successful 2018 and 2022 gubernatorial bids.","summary":"Minnesota Gov. Tim Walz announced Tuesday his plans to be the state's chief executive for a third term in the 2026 midterm election.","url":"https://www.upi.com/Top_News/US/2025/09/16/Minnesota-Tim-Walz-governor-reelection-campaign-2026/5051758033734/","image":"https://cdnph.upi.com/sv/ph/og/upi/5051758033734/2025/1/3ffcf9843cdf749d5cf0d470e0ce0b39/v1.5/Tim-Walz-seeks-third-term-as-Minnesotas-governor-in-2026.jpg","video":null,"publish_date":"2025-09-16 16:26:08","author":"Chris Benson","authors":["Chris Benson"],"language":"en","category":"politics","source_country":"US","sentiment":0.011},{"id":361009910,"title":"Trump files $15B defamation lawsuit against The New York Times","text":"President Donald Trump has added The New York Times to the list of media companies he's challenged in court, filing a $15 billion defamation lawsuit that targets four of its journalists in a book and three articles published within a two-month period before the last election.In a Truth Social post announcing the lawsuit early Tuesday, Trump called the Times “one of the worst and most degenerate newspapers in the nation's history” and a virtual mouthpiece for Democrats. The lawsuit was filed in U.S. District Court in Florida.The Times called the lawsuit meritless and an attempt to discourage independent reporting. “The New York Times will not be deterred by intimidation tactics,” spokesman Charlie Stadtlander said.It follows lawsuits Trump has filed against ABC News and CBS News' “60 Minutes,” both of which were settled out of court by the news organizations' parent companies. Trump also sued The Wall Street Journal and media mogul Rupert Murdoch in July after the newspaper published a story reporting on his ties to wealthy financier Jeffrey Epstein.The lawsuit names a book and an article written by Times reporters Russ Buettner and Susanne Craig that focuses on Trump's finances and his pre-presidency starring role in television's “The Apprentice.”RELATED STORY | Paramount Global reaches $16 million settlement with Trump for edited Harris interviewTrump said in the lawsuit they “maliciously peddled the fact-free narrative” that television producer Mark Burnett discovered Trump into a celebrity — “even though at and prior to the time of publications defendants knew that President Trump was already a mega-celebrity and an enormous success in business.” The 85-page lawsuit also attacks claims the reporters made about Trump's early business dealings and his father, Fred.Trump also cites an article by Peter Baker last Oct. 20 headlined “For Trump, a Lifetime of Scandals Heads Toward a Moment of Judgment.” He also sues Michael S. Schmidt for a piece two days later featuring an interview with Trump's first-term chief of staff, John Kelly, headlined “As Election Nears, Kelly Warns Trump Would Rule Like a Dictator.”In the lawsuit, Trump claimed The Times “could not accept President Trump's win in 2016 and could not fathom his winning again in a landslide.” It wasn't a part of the case, but Trump attacked the newspaper's “deranged” editorial endorsement of opponent Kamala Harris last year.“The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA and our Nation as a whole,” Trump said on Truth Social. “I am PROUD to hold this once-respected ‘rag’ responsible.”None of Trump's media lawsuits have made it to court, but in court papers he claimed the settlements with ABC and CBS as part of his “successful undertaking to restore integrity to journalism.”RELATED STORY | Appeals court upholds $83.3M defamation judgment against Trump in Carroll CaseThe president has also been involved in a lawsuit by The Associated Press over restricting the news organization's access to cover him in retaliation for its decision not to follow his executive order to change the name of the Gulf of Mexico to the Gulf of America.The Times' Stadtlander said that the news organization “will continue to pursue the facts without fear or favor and stand up for journalists' First Amendment right to ask questions on behalf of the American people.”Penguin Random House, publisher of Buettner and Craig's book, “Lucky Loser: How Donald Trump Squandered His Father's Fortune and Created the Illusion of Success,” said it stands by the book and its authors.","summary":"President Donald Trump has added The New York Times to the list of media companies he's challenged in court, filing a $15 billion defamation lawsuit.","url":"https://www.scrippsnews.com/politics/the-president/trump-files-15b-defamation-lawsuit-against-the-new-york-times","image":"https://ewscripps.brightspotcdn.com/dims4/default/6ad8eef/2147483647/strip/true/crop/1024x538+0+24/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F8f%2F4d%2F89ff805742dfb4d79882965701cc%2Fap25259191379299.jpg","video":null,"publish_date":"2025-09-16 16:25:26","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":0.143},{"id":360993786,"title":"Trump Announces $15 Billion Lawsuit Against ‘Degenerate’ Newspaper","text":"President Donald Trump is bringing a $15 billion lawsuit against the New York Times for “a decades long method of lying” about him. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual ‘mouthpiece’ for the Radical Left Democrat Party,” Trump wrote on Truth Social.\n\nThe suit will be brought in Florida. \n\nTrump said the NYT “has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.” \n\nHe said he is proud to hold the paper accountable after his successful litigation against “George Slopadopoulos/ABC/Disney, and 60 Minutes/CBS/Paramount, who knew that they were falsely ‘smearing’ me through a highly sophisticated system of document and visual alteration, which was, in effect, a malicious form of defamation, and thus, settled for record amounts.”\n\nA spokesperson for the Times told The Daily Signal the lawsuit has no merit. \n\n“It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting,” the spokesperson said. “The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.” \n\nThe New York Times’ endorsement of Kamala Harris was the “single largest illegal Campaign contribution, EVER,” Trump said. \n\n“They practiced this longterm INTENT and pattern of abuse, which is both unacceptable and illegal,” he said. “The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, NOW!”","summary":"President Donald Trump is bringing a $15 billion lawsuit against the New York Times for &#8220;a decades long method of lying&#8221; about him. &#8220;Today, I... Read More\n\n\nThe post Trump Announces $15 Billion Lawsuit Against &#8216;Degenerate&#8217; Newspaper appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/16/trump-announces-15-billion-lawsuit-against-degenerate-newspaper/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/mic.jpg","video":null,"publish_date":"2025-09-16 16:10:00","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","category":"politics","source_country":"us","sentiment":0.196},{"id":361049910,"title":"‘He lied to us’: CBS News staffers say new owner David Ellison ‘just can’t be trusted’","text":"During his symbolic first stop at the CBS News offices after closing the Paramount-Skydance mega-merger last month, David Ellison – the network’s new owner – said “all the right things” during his meet-and-greet with staff.\n\nBarely a month later, whatever goodwill the chief executive had built up had evaporated entirely, with multiple network staffers telling The Independent that Ellison had “lost the trust” of the newsroom, who now see him as nothing but a “liar” as he takes steps to appease the right and President Donald Trump.\n\n“He lied to us,” one long-time CBS News employee bluntly stated.\n\nAccording to sources, Ellison’s lack of credibility with the “Tiffany Network” news staff comes down to the “broken promises” he delivered following a politically-strained merger process that saw Paramount’s former leadership agree to pay Trump $16 million to settle a “meritless” lawsuit over a 60 Minutes interview with Kamala Harris.\n\nOnce the $8.4 billion deal to merge Paramount with Ellison’s Skydance was closed, the 42-year-old media mogul – whose father is Oracle founder, Trump ally, and one of the world’s richest men Larry Ellison – vowed that he would not “politicize” the new Paramount or its news network. \n\n“Of course we believe in the independence of journalism, we believe in basically being in the trust business, we believe in being in the truth business,” he declared on his first day as the new chairman of Paramount Skydance. “But also, I’ve watched others wade in to the political spectrum and, I just want to be transparent, I have no interest in doing that.”\n\nThe last few weeks, according to sources who spoke to The Independent, have shown that Ellison’s pledge about having “no interest” in playing politics with the newsroom is ringing hollow.\n\nEarlier this month, it was reported that Ellison was on the verge of purchasing The Free Press for “well above” $100 million and installing its stridently pro-Israel, anti-woke founder Bari Weiss into a senior leadership role at CBS News. Weiss, who was an opinion columnist for the New York Times before launching her “heterodox” media empire, would potentially be named the network’s editor in chief or co-president as part of the deal.\n\n“The idea that the overvaluation of a rag like The Free Press is going to give Bari Weiss riches beyond her wildest dreams… is adding insult to injury to most of the real journalists at CBS News,” one network journalist told The Independent. “One, she's not a journalist, as far as we're concerned. And two, the idea that she's going to carry some sort of editorial stick for us is hard to swallow.”\n\nThe Independent has contacted representatives of Paramount, Weiss and Ellison for comment.\n\nAdditionally, following up on Ellison’s vow to the Trump administration in order to secure approval for the merger, CBS News announced that it was bringing on former Trump appointee and conservative think tank leader Kenneth Weinstein to root out “complaints of bias” as the network’s ombudsman.\n\n“Everyone seemed to be blindsided by it,” one veteran staffer told The Independent, adding that Weinstein “is not a journalist” but rather a “political operative.”\n\nThe hiring of Weinstein, who has a lengthy history of praising Trump and donating to Republicans, came on the heels of the network seemingly capitulating to the administration by implementing new rules for interviews on its Sunday news show, Face the Nation. \n\nAfter Homeland Security Secretary Kristi Noem complained that one of her answers on a Face the Nation interview was “shamefully edited,” CBS initially defended the decision to trim the interview “for time” before Paramount executives effectively sided with the White House amid ongoing public pressure. Going forward, all interviews on the show will be broadcast either live, or live to tape, and in their entirety.\n\nEllison is also facing an investigation by House Democrats into the merger process and whether there were any violations of anti-bribery laws. \n\nBesides examining the Paramount settlement with Trump, Democrats are questioning Ellison about the president’s claim that they reached a “side deal” to air $20 million of pro-Trump advertisements on CBS, as well as the pre-merger concessions regarding a CBS ombudsman, and a promise to eradicate all DEI policies at the new Paramount. The lawmakers are also seeking answers about decision-making behind the cancellation of prominent Trump critic Stephen Colbert’s top-rated CBS late-night show.\n\nTo add to the turmoil for the news network, Ellison and his senior leaders have vowed to cut $2 billion in operating costs at Paramount, which they’ve acknowledged will lead to painful layoffs of thousands of employees across the company in the near future. \n\nAt the same time, Larry and David Ellison are preparing a majority cash bid to purchase Warner Bros. Discovery and combine it with Paramount, creating an immense media powerhouse and potentially merging CBS News with CNN – which would drastically reshape the news landscape.\n\nThe prospect of Weiss overseeing CBS News – and maybe even CNN, one of Trump’s most reviled media outlets – along with a Trump loyalist serving as an ombudsman, and an executive leadership that seems largely sympathetic to the president has not been well-received in the newsroom.\n\nMore than anything, though, it has led to a souring of their opinion of Ellison as the company’s leader.\n\n“He’s a liar, okay,” the network journalist said. “I mean, we all know that David Ellison is a liar and he just can't be trusted, and he can't be entrusted with the legacy of CBS News.”\n\nThe journalist added that Ellison is “essentially going to hand the keys to the kingdom to Bari Weiss and to anyone and everyone who is an ideologue that supports his and his father's world.”\n\nOther CBS employees, meanwhile, told The Independent that the widespread feeling within the network is that most of the staff no longer feel Ellison is an honest broker and that he has lost any and all credibility.\n\n“I think people now just can’t trust him,” a network insider stated. “The first thing he said is he wasn’t gonna politicize this thing, and it feels like that's what he’s doing. And he may not know that that’s what he’s doing, but that’s what he’s doing.”\n\nLeaving an even more bitter pill in the mouths of the network’s news staff is the possibility that not only could Weiss – an opinion writer and pundit with no experience managing a news organization of CBS News’ size – be their boss, but that she could land a hefty payday while hundreds of staffers receive pink slips.\n\n“We're gonna lose true journalists in cuts to pay, in part, for her garbage website,” the network journalist said. “The fact that we don't have money to pay journalists, but we have money to pay Bari Weiss between $100 and $200 million is indicative of what the Ellisons’ true goal here is. And it's not journalism.”","summary":"EXCLUSIVE: Multiple CBS News staffers said new owner David Ellison has broken his promise not to “politicize” the network by installing a Trump loyalist as ombudsman, and courting The Free Press founder Bari Weiss for a senior editorial position","url":"https://www.independent.co.uk/news/world/americas/cbs-news-david-ellison-bari-weiss-b2827230.html","image":"https://static.independent.co.uk/2025/08/07/17/17/DAVID_ELLISON_0252_FINAL_800x800.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/xgaaYRH8-4VHSaSK0.mp4","publish_date":"2025-09-16 16:09:40","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.155},{"id":361039994,"title":"New York Times Hits Back After Trump Files Colossal Lawsuit","text":"Trump is essentially filing this lawsuit on the grounds that the Times’ coverage isn’t kind enough to him. The 85-page lawsuit specifically calls out Times writers Peter Baker, Michael S. Schmidt, Susanne Craig, and Russ Buettner. The latter two wrote the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, published last year. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar [sic] Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual “mouthpiece” for the Radical Left Democrat Party,” Trump wrote Monday evening on Truth Social. “I view it as the single largest illegal Campaign contribution, EVER. Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThis is a tried and true method for Trump, as he sued Disney’s ABC and Paramount Global’s CBS News for defamation, settling each case for millions of dollars. The Times likely isn’t planning on folding in the same way, as publisher A.G. Sulzberger told media members in a Monday gala speech before Trump’s announcement to “stand up for your journalism. Stand up for your journalists. Stand up for your rights.”","summary":"The New York Times is fighting back after President Trump filed a massive $15 billion defamation lawsuit against the paper. \n\n“This lawsuit has no merit. It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics,” a spokesperson for the Times said in a statement. “We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.”\n\nTrump is essentially filing this lawsuit on the grounds that the Times’ coverage isn’t kind enough to him. The 85-page lawsuit specifically calls out Times writers Peter Baker, Michael S. Schmidt, Susanne Craig, and Russ Buettner. The latter two wrote the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, published last year. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar [sic] Defamation and Libel Laws","url":"https://newrepublic.com/post/200523/new-york-times-trump-lawsuit","image":"https://images.newrepublic.com/c5c590487e6974387f4d88623188501551703109.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-09-16 16:08:26","author":"Malcolm Ferguson","authors":["Malcolm Ferguson"],"language":"en","source_country":"lr","sentiment":0.108},{"id":360993260,"title":"Trump sues New York Times for alleged libel, seeks $15 billion","text":"President Donald Trump sued the New York Times, four of its reporters, and publisher Penguin Random House for at least $15 billion on Monday, claiming defamation and libel, and citing reputational damage, a Florida court filing showed.\n\nTrump’s suit cites a series of New York Times articles, one an editorial prior to the 2024 presidential election, which said he was unfit for office, and a 2024 book published by Penguin titled “Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success.”\n\n“Defendants maliciously published the Book and the Articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump,” according to the filing lodged on Monday in the U.S. District Court, Middle District Florida.\n\nThe New York Times and Penguin did not immediately respond to a request for comment outside regular business hours.\n\nThe publications have harmed Trump’s business and personal reputation, thereby causing massive economic damage to his brand value and significant damage to his future financial prospects, Trump’s lawyers alleged in the filing.\n\n“The harm to the value of TMTG (Trump Media and Technology Group) stock is one example of how the Defendants’ defamation has injured President Trump,” said his lawyers, citing “a precipitous decline in the stock price.”\n\nTMTG stock has been under pressure in recent months fueled by worries about the end of a so-called lock-up period related to its stock market debut in March.\n\nThe filing comes after Trump threatened last week to sue the New York Times for its reporting on an allegedly sexually suggestive note and drawing given to Jeffrey Epstein.\n\nEpstein, the disgraced financier and sex offender, died by suicide in a New York jail cell in 2019. Trump has said he parted ways with Epstein before the financier’s legal troubles became public in 2006.\n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar Defamation and Libel Lawsuit against The New York Times,” Trump said on Monday in a post on his social media platform Truth Social.\n\nIn his post, Trump accused the paper of lying about him, his family and businesses, as well as Republican-led movements and ideologies such as the America First Movement, and Make America Great Again, or MAGA.\n\nIn his second term, Trump has intensified his crackdown against media companies. Earlier this year he sued the Wall Street Journal and its owners, including Rupert Murdoch, for at least $10 billion over the newspaper’s report that his name was on a 2003 birthday greeting for Epstein.\n\nIn July, CBS parent company Paramount agreed to settle a lawsuit filed by Trump alleging that the CBS news program “60 Minutes” deceptively edited an interview with former Vice President Kamala Harris that the network broadcast in October.","summary":"President Donald Trump sued the New York Times, four of its reporters, and publisher Penguin Random House for at least $15 billion on Monday, claiming defamation and libel, and citing reputational damage, a Florida court filing showed.","url":"https://www.staradvertiser.com/2025/09/16/breaking-news/trump-sues-new-york-times-for-alleged-libel-seeks-15-billion/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/web1_2025-09-16T061630Z_749457407_RC2LSGAR40T1_RTRMADP_3_USA-TRUMP-NEW-YORK-TIMES.JPG","video":null,"publish_date":"2025-09-16 16:05:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.012},{"id":361047188,"title":"JD Vance Vows to Be a Better Husband to Usha Vance – His Words Will Leave You Stunned","text":"America is heartbroken by conservative politician Charlie Kirk’s death. He leaves behind his wife, Erika, and two children born in 2022 and 2024. Vice President JD Vance has made a surprising personal vow: to be kinder to his wife, Usha Vance, as a tribute to the late right-wing activist. He shared the commitment while guest-hosting an episode of ‘The Charlie Kirk Show’.\n\nThe episode opened with a heartfelt story about a private moment he shared with Kirk’s wife, Erika Kirk, shortly after he died on September 10. According to JD Vance, Erika described her husband as a man who “never raised his voice, never cursed at her, and was never mean-spirited.”\n\nAccording to The Daily Beast, Vance admitted that he lacks the gentleness she’s shown in his marriage. “Overall, I think I’m a pretty good husband,” Vance said. “But I can’t say I’ve never lost my temper. I can’t say I’ve never been unpleasant or raised my voice. Like most husbands, even the good ones. I’ve had my faults.”\n\nJD Vance continued, saying that Erika Kirk’s reflections prompted him to reconsider his approach to family life. “Maybe the best way I can honor Charlie’s memory is to be a better husband and father—to try to live up to the example he set in his own marriage.”\n\nUsha and JD have been married since 2014, the year after they graduated from Yale Law School. The couple met there as students and fell in love. At the Republican National Convention, Usha Vance introduced JD Vance and recalled when she had met Vance at Yale Law School: ” He was fresh out of Ohio State,” which he attended with the support of the GI Bill.\n\n🚨 BREAKING: After JD Vance meets with Charlie Kirk’s family and friends today in Utah, Charlie’s casket will be flown to Phoenix, Arizona on AIR FORCE TWO, per NewsNation.\nUsha Vance will be there as well.\n❤️🇺🇸 pic.twitter.com/AaPFpF0Wgf\n— Eric Daugherty (@EricLDaugh) September 11, 2025\n\n“We were friends first, because, I mean, who wouldn’t want to be friends with JD? He was, then as now, the most interesting person I knew,” she said. Usha Vance, a highly accomplished attorney who studied at Yale and Cambridge and once clerked for the U.S. Supreme Court, was a top A-class student born to immigrant parents from South India.\n\nUsha Vance:\n“That JD and I could meet at all, let alone fall in love and marry, is a testament to this great country.” pic.twitter.com/joFWvqRFzQ\n— The American Conservative (@amconmag) July 18, 2024\n\nMeanwhile, JD Vance has seen a tumultuous childhood, which includes his mother’s past trauma with substance addiction and the downside of being a single mother. Furthermore, in the podcast, Vance also promised to be more present and patient with his children, referencing a recent family trip to the Taj Mahal as a reminder of their time together.\n\nUsha Vance has also supported her husband in front of the media when he received backlash for his controversial remark. Like Trump, Vance is also direct with his words, which unfortunately got him into trouble.\n\nToday I visited the Taj Mahal with Usha and the kids.\nIt’s a beautiful historic site, and I’m grateful for the warm welcome we received there! pic.twitter.com/3FNnlNAKd2\n— Vice President JD Vance (@VP) April 23, 2025\n\nFor instance, in September 2024, JD faced backlash for supporting activist Laura Loomer’s racist remarks. They were reportedly targeted toward Kamala Harris’ Indian roots. However, despite Usha being an Indian herself, she stood by his side during the next rally and shared a kiss to showcase support before he took the spotlight on the stage.\n\nLooking at JD Vance reflecting on his relationship better proves he is a total green flag husband! (Gen Z, thanks for teaching us this term.) What do you think?","summary":"Vice President JD Vance pledged to be a more supportive and kinder husband to his wife, Usha Vance.","url":"https://www.inquisitr.com/jd-vance-vows-to-be-a-better-husband-to-usha-vance-his-words-will-leave-you-stunned","image":"https://www.inquisitr.com/wp-content/uploads/2025/09/JD-Vance-and-Usha-Vance-.jpg","video":null,"publish_date":"2025-09-16 15:56:43","author":"Sweta Choudhury","authors":["Sweta Choudhury"],"language":"en","source_country":"us","sentiment":0.321},{"id":361042602,"title":"'Not a monarchy': Trump’s lawsuit against NYT sparks mockery — and free speech warnings","text":"President Donald Trump has filed another lawsuit against The New York Times, drawing warnings from legal experts about free speech and First Amendment implications — even as they mock the filing itself.\n\nTrump filed the $15 billion defamation and libel lawsuit against the paper of record, which he called “one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual ‘mouthpiece’ for the Radical Left Democrat Party.”\n\nAt issue, he said on his Truth Social website, is their endorsement of then-Democratic presidential nominee Kamala Harris, which Trump called “the single largest illegal Campaign contribution, EVER.”\n\nREAD MORE: Greene Says Kirk Killing Sparked ‘Spiritual Revival’ for Christ — Urges ‘National Divorce’\n\n“The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, NOW!” he declared.\n\nAccording to Politico, the lawsuit “alleges the reporting had harmed Trump’s ‘unique brand’ and business interests, including his media company’s stock value, causing ‘reputational injury’ worth ‘billions of dollars.'”\n\nBloomberg News reported that “The New York Times said in a statement that the lawsuit ‘has no merit’ and ‘is an attempt to stifle and discourage independent reporting’.”\n\n“It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting,” a Times spokesperson said on Tuesday. “The New York Times will not be deterred by intimidation tactics.”\n\nCritics and legal experts have mocked the legal filing.\n\n“Is it possible for a legal pleading to be psychotic?” asked attorney George Conway, a well-known Trump critic. “I think we have an answer.”\n\nFormer U.S. Attorney Joyce Vance, a professor of law and MSNBC/NBC News legal analyst, wrote: “I’d like to see the judge dismiss and grant rule 11 sanctions. That’s not a stretch here. We do, after all, have a 1st Amendment and a constitutional republic, not a monarchy/dictatorship.”\n\nREAD MORE: Vance Hosts Stephen Miller on Kirk’s Show to Preach ‘Real Unity’ — While Blaming the Left\n\nRule 11 sanctions refer to penalties a court may impose on attorneys for filing frivolous lawsuits.\n\n“The 85-page lawsuit reads like a pro-Trump op-ed, with page after page of gushing praise for the president,” wrote CNN chief media analyst Brian Stelter. “The suit demands $15 billion in damages, which exceeds the entire market cap of The New York Times Company.”\n\nBut Stelter also called Trump’s lawsuit “the latest example of what First Amendment experts have described as a presidential strategy to silence critical news coverage and curb free speech by filing legally dubious suits.”\n\nOthers also warned of the First Amendment implications.\n\nFormer Biden White House senior advisor Neera Tanden, president and CEO of the Center for American Progress, remarked, “So much for free speech.”\n\nAttorney Ron Filipkowski, the editor-in-chief for MeidasTouch News, urged, “No Settlements! Needs to be the rally cry for every press outlet, university, business, law firm, nonprofit, and other entity that is targeted by the regime. Settlements sell us all out.”\n\nREAD MORE: Trump Teases Threat to Defund NYC After Governor’s Endorsement for Mayor","summary":"President Donald Trump has filed another lawsuit against The New York Times, drawing warnings from legal experts about free speech and First Amendment implications — even as they mock the filing itself.\n\nTrump filed the $15 billion defamation and libel lawsuit against the paper of record, which he called “one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual ‘mouthpiece’ for the Radical Left Democrat Party.”\n\n At issue, he said on his Truth Social website, is their endorsement of then-Democratic presidential nominee Kamala Harris, which Trump called “the single largest illegal Campaign contribution, EVER.”\n\n READ MORE: Greene Says Kirk Killing Sparked ‘Spiritual Revival’ for Christ — Urges ‘National Divorce’\n\n“The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, NOW!” he declared.\n\n According to Politico, the lawsuit “alleges the reporting had harmed Trump’s ‘unique brand’ and business interests, including his med","url":"https://www.alternet.org/news-politics/nyt-trump/","image":"https://www.alternet.org/media-library/image.png?id=61498847&width=1200&height=600&coordinates=0%2C60%2C0%2C60","video":null,"publish_date":"2025-09-16 15:48:24","author":"David Badash","authors":["David Badash"],"language":"en","category":"politics","source_country":"us","sentiment":-0.117},{"id":361033170,"title":"Georgia Supreme Court declines to let Fulton County DA Fani Willis return to Trump election interference case","text":"(CNN) — The Georgia Supreme Court on Tuesday declined to hear an appeal from Fulton County District Attorney Fani Willis on her removal from the case prosecuting President Donald Trump and his alleged co-conspirators over their efforts to overturn the 2020 election.\n\nThe case against Trump and his co-defendants will be referred to the Prosecuting Attorneys’ Council in Georgia, according to a statement from Willis. It will be up to the council, a bipartisan collaboration of six district attorneys and three solicitors general from across the state to decide whether a new prosecutor will be appointed to pursue the case.\n\nThe council’s executive director, Peter Skandalakis, said he would be responsible for appointing a new prosecutor. He told CNN he could also take the case on his own.\n\nThe court in a 4-3 decision backed an appeals court’s decision to disqualify Willis in December 2024 over her romantic relationship with the special prosecutor she appointed to the case.\n\nWriting for the majority, Justice Andrew Pinson wrote the lower court’s decision “does not raise a question of gravity that warrants our further review.”\n\nJustice Carla Wong McMillian wrote the dissenting opinion, saying that guidance from the high court would be “desirable,” given the confusing nature of the case.\n\nWillis said in a statement that she disagreed with the court’s decision not to review her appeal, but that she respected the legal process.\n\n“I hope that whoever is assigned to handle the case will have the courage to do what the evidence and the law demand,” she said.\n\nThe president, speaking to reporters at the White House on Tuesday, called the ruling “a great decision” and criticized Willis’ prosecution as “a rigged case.”\n\nTrump was indicted on state charges in Fulton County in August 2023, the fourth indictment he faced that year. Trump was charged alongside 18 co-defendants on racketeering charges. Willis accused them of participating in a conspiracy to unlawfully change the results of the 2020 presidential election in Georgia, which Trump lost that year. The president won Georgia last year against then-Vice President Kamala Harris.\n\nWillis, a Democrat, faced mounting scrutiny throughout her grand jury investigation and following the indictment of Trump and his co-defendants.\n\nOne of Trump’s co-defendants, Michael Roman, moved to dismiss the indictment and disqualify Willis for her romantic relationship with Special Assistant District Attorney Nathan Wade, stating that Willis had a personal financial interest in the case.\n\nSteve Sadow, Trump’s lead defense attorney on the case, said Tuesday the high court “correctly denied” allowing Willis to return.\n\n“Willis’ misconduct during the investigation and prosecution of President Trump was egregious and she deserved nothing less than disqualification. This proper decision should bring an end to the wrongful political, lawfare persecutions of the President,” Sadow said in a statement.\n\nChief Justice Nels Peterson did not participate in the decision, and Justice Benjamin Land was disqualified from the decision.\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Time Warner Company. All rights reserved.","summary":"(CNN) — The Georgia Supreme Court on Tuesday declined to hear an appeal from Fulton County District Attorney Fani Willis on her removal from the...","url":"https://wsvn.com/news/politics/georgia-supreme-court-declines-to-let-fulton-county-da-fani-willis-return-to-trump-election-interference-case/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/09/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbWZtbzVpemkwMDBsM2I2bnU0MjU2anIx-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtZm1vNDhibDAwMXgyNnBiODN0dDRobWY.jpg?quality=60&strip=color","video":null,"publish_date":"2025-09-16 15:45:31","author":"Tynisa Senior","authors":["Tynisa Senior"],"language":"en","category":"politics","source_country":"us","sentiment":-0.205},{"id":361073070,"title":"‘We’re not done yet’: Walz launches reelection bid for third term as governor","text":"MINNEAPOLIS (AP) — Minnesota Gov. Tim Walz said Tuesday he will seek a third term in the 2026 elections, hoping to beat the odds to become the longest-serving governor in a state where voters have usually said two terms were plenty.\n\nIn a campaign video posted on YouTube, Walz said he’s running because his work is not done and he wants to make Minnesota a place where everyone has a chance to succeed.\n\n“I’ve seen how we help each other through the hard times,” he said. “And boy, we’ve seen terrible times this year. I’m heartbroken and angry about the beautiful people we lost to gun violence. But it’s in these moments we have to come together. We can’t lose hope because I’ve seen what we can do when we work together.”\n\nVice President Kamala Harris picked Walz as her running mate on the 2024 Democratic presidential ticket after his attack line against former President Donald Trump and his running mate, then-Ohio Sen. JD Vance — “These guys are just weird” — spread widely.\n\nWalz had been building up his national profile since their defeat in November. He was a sharp critic of Trump as he toured early caucus and primary states. In May, he called on Democrats in South Carolina to stand up to Trump, saying, “Maybe it’s time for us to be a little meaner.”\n\n“I’ve always tried to do what’s right for Minnesota, and I’ll never stop fighting to protect us from the chaos, corruption, and cruelty coming out of Washington,” Walz said in his announcement.\n\nWalz, 61, has been frequently mentioned as a potential 2028 presidential candidate, but he told Axios in July he would not run for president if he sought reelection.\n\nHis close political ally, former Minnesota House Speaker Melissa Hortman, was assassinated in June by a man posing as a police officer. Walz delivered a eulogy at her funeral. Trump refused to call Walz to offer condolences, saying it would have been a waste of time.\n\nWalz and Minnesota mourned again late last month when two children were killed and 21 people were injured in a shooting at a Minneapolis church where students from an affiliated school were celebrating Mass.\n\nWalz then said he would call a special session of the Legislature to pass school and gun safety laws, but he has not set a date yet, nor proposed specific legislation for it. He said in his announcement Tuesday that one of his priorities is to “get serious about gun violence.”\n\nWalz’s run for the vice presidency introduced the former high school teacher with a “Midwest Dad” image to a wider, national audience. But it also brought new scrutiny of his record as governor and as a congressman before that, and his tendency to embellish or exaggerate details and mangle his words.\n\nHe proudly touted the accomplishments of the 2023 legislative session, when Democrats used their full control to enact a sweeping platform of liberal priorities, including free school meals for all students, and expanded protections for abortion and transgender rights.\n\nBut he also faced renewed criticism from the right for his handling of the unrest that followed the murder of George Floyd in Minneapolis in 2020 and a $300 million pandemic food aid fraud case. Republicans are sure to use that case and newer revelations of fraud in other state-run programs against him in 2026.\n\nMinnesota’s most prominent GOP office-holder, U.S. House Majority Whip Tom Emmer, was among the Republicans on Tuesday who highlighted fraud under Walz’s watch.\n\n“Walz is a proven failure,” Emmer said in a statement. “Instead of boasting about a strong economy, great schools, or safe streets, the only thing Minnesotans can tout is the fact that Walz allowed the nation’s largest taxpayer-funded COVID program fraud to occur under his watch.”\n\nNo Minnesota governor has won a third consecutive term since the state switched to four-year terms in 1963. But no Minnesota Republican has won a statewide race since Tim Pawlenty was reelected to a second term as governor in 2006.\n\nOn the Republican side of the race, former business executive and Army veteran Kendall Qualls announced his candidacy in May and hopes to become Minnesota’s first Black governor. Qualls lost the GOP endorsement in 2022 to family physician and former state senator Scott Jensen, who announced in July that he’s running again.\n\nThe only current GOP office-holder in the race so far is state Rep. Kristin Robbins, of Maple Grove, who chairs a House committee formed this year to investigate fraud in government programs. She announced her candidacy Aug. 20.","summary":"Minnesota Gov. Tim Walz will run again in 2026, hoping to beat the odds to become Minnesota's longest-serving governor.\n\n\nThe post &#8216;We&#8217;re not done yet&#8217;: Walz launches reelection bid for third term as governor appeared first on MinnPost.","url":"https://www.minnpost.com/state-government/2025/09/were-not-done-yet-walz-launches-reelection-bid-for-third-term-as-governor/","image":"https://www.minnpost.com/wp-content/uploads/2025/04/MP-GovWalz-StofSt.jpg","video":null,"publish_date":"2025-09-16 15:44:08","author":"Associated Press,Steve Karnowski,Tom Olmscheid","authors":["Associated Press","Steve Karnowski","Tom Olmscheid"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129},{"id":360993482,"title":"‘Full-Throated Mouthpiece Of The Democrat Party’: Trump Files $15 Billion Lawsuit Against New York Times","text":"President Donald Trump filed a $15 billion defamation lawsuit against The New York Times on Monday for allegedly attempting to undermine his character and his 2024 presidential candidacy with “actual malice.”\n\nThe lawsuit accused the Times of being a “full-throated mouthpiece of the Democrat Party” by publishing dozens of articles that promoted “falsehoods” about Trump to help former Vice President Kamala Harris win the election. Trump’s legal team alleged that these articles and a book written by two reporters were all “carefully crafted” with “actual malice” to impair Trump’s candidacy and his reputation.\n\n“Whatever the historical merit of this self-congratulation, the Times has betrayed the journalistic ideals of honesty, objectivity, and accuracy that it once professed,” the lawsuit reads. “Today, the Times is a full-throated mouthpiece of the Democrat Party. The newspaper’s editorial routine is now one of industrial-scale defamation and libel against political opponents. As such, the Times has become a leading, and unapologetic, purveyor of falsehoods against President Trump on the legacy media landscape.”\n\nThe defendants named in the suit are The New York Times Company, Susanne Craig, Russ Buettner, Peter Baker and Michael S. Schmidt. The book in question, “Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success,” was written by Craig and Buettner. (RELATED: Trump Files Suit Against Murdoch Over WSJ Epstein Story)\n\nTrump wrote on Truth Social that it is his “honor” to sue “one of the worst and most degenerate newspapers” in the country.\n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual “mouthpiece” for the Radical Left Democrat Party. I view it as the single largest illegal Campaign contribution, EVER,” Trump wrote. “Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The “Times” has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThe lawsuit alleged that the book was attempting to smear Trump’s success on “The Apprentice” by inaccurately stating that executive producer Mark Burnett discovered Trump and made him a celebrity.\n\nThe suit pointed to the Times’ editorial board endorsing Harris in September 2024 and stating that Trump would “defy the norms and dismantle the institutions that have made our country strong.” It also accused an article from Oct. 20, 2024, titled, “For Trump, a Lifetime of Scandals Heads Toward a Moment of Judgement” and another from Oct. 22, 2024, titled, “As Election Nears, Kelly Warns Trump Would Rule Like a Dictator,” as being “malicious” and “defamatory.”\n\nThe lawsuit accused the Times and the reporters of having “falsified, distorted and manipulated facts” with the intention of defaming Trump.\n\nA spokesperson for The Times told its own newspaper that the lawsuit “lacks any legitimate legal claims” and that it will not be “deterred by intimidation tactics.”\n\n“This lawsuit has no merit,” the spokesperson said. “It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.”\n\nCBS and its parent company, Paramount, agreed to pay a $36 million settlement to Trump to end a lawsuit relating to the editing of a “60 Minutes” interview with Harris. ABC News agreed to a $15 million settlement in December 2024 after Trump sued the network over host George Stephanopoulos’ false claim that the president was found liable of rape.\n\nThe Times also had to issue a correction on Thursday after it falsely stated that Turning Point USA founder Charlie Kirk made a claim about Jewish people “pushing the exact kind of hatred against whites” that they want people to stop using against them. Kirk was reading that quote from another person’s tweet and criticizing the statement.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'One of the worst and most degenerate newspapers'","url":"https://dailycaller.com/2025/09/16/trump-15-billion-lawsuit-new-york-times/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/GettyImages-2234916805-scaled-e1758034567378.jpg","video":null,"publish_date":"2025-09-16 15:23:35","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","category":"politics","source_country":"us","sentiment":0.071},{"id":361049284,"title":"Trump sues NYT for $15B over defamation","text":"US President Donald Trump sued the New York Times (NYT), four of its reporters, and publisher Penguin Random House for at least $15 billion on Monday, claiming defamation and libel, and citing reputational damage, a Florida court filing showed, Azernews reports, citing Tribune.\n\nTrump's suit cites a series of New York Times articles, one an editorial before the 2024 presidential election, which said he was unfit for office, and a 2024 book published by Penguin titled \"Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success\".\n\n\"Defendants maliciously published the Book and the Articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump,\" according to the filing lodged on Monday in the US District Court, Middle District of Florida.\n\nThe New York Times and Penguin did not immediately respond to a request for comment outside regular business hours.\n\nThe publications have harmed Trump's business and personal reputation, thereby causing massive economic damage to his brand value and significant damage to his future financial prospects, Trump's lawyers said in the filing.\n\n\"The harm to the value of TMTG (Trump Media and Technology Group) stock is one example of how the Defendants’ defamation has injured President Trump,\" said his lawyers, citing \"a precipitous decline in the stock price.\"\n\nTMTG stock has been under pressure in recent months, fueled by worries about the end of a so-called lock-up period related to its stock market debut in March.\n\nTrump and Jeffrey Epstein\n\nThe filing comes after Trump threatened last week to sue the New York Times for its reporting on an allegedly sexually suggestive note and drawing given to Jeffrey Epstein.\n\nEpstein, the disgraced financier and sex offender, died by suicide in a New York jail cell in 2019.\n\nTrump has said he parted ways with Epstein before the financier's legal troubles became public in 2006.\n\n\"Today, I have the Great Honor of bringing a $15 billion defamation and Libel Lawsuit against The New York Times,\" Trump said earlier on Monday in a post on his social media platform Truth Social.\n\nIn his post, Trump accused the paper of lying about him, his family and businesses, as well as Republican-led movements and ideologies such as the America First Movement, and Make America Great Again, or MAGA.\n\nIn his second term, Trump has intensified his crackdown against media companies. Earlier this year he sued the Wall Street Journal and its owners, including Rupert Murdoch, for at least $10 billion over the newspaper's report that his name was on a 2003 birthday greeting for Epstein.\n\nIn July, CBS parent company Paramount agreed to settle a lawsuit filed by Trump alleging that the CBS news program \"60 Minutes\" deceptively edited an interview with former Vice President Kamala Harris that the network broadcast in October.","summary":"","url":"http://www.today.az/news/regions/262026.html","image":"http://www.today.az/pictures/pic262026.jpg","video":null,"publish_date":"2025-09-16 15:10:00","author":null,"language":"en","category":"politics","source_country":"az","sentiment":-0.007},{"id":360974508,"title":"Former Paramount Chair Shari Redstone Joins Israeli Film Company As Chair—As Hollywood’s Israel Boycott Grows","text":"Shari Redstone, who until Paramount’s merger with Skydance served as the media company’s chairwoman, joined Israeli film studio Sipur as its chair, amid a Hollywood boycott of the Israeli film industry that has garnered thousands of signatories.\n\nShari Redstone was Paramount's chair until its merger with Skydance. (Photo by Jesse Grant/Getty Images for Viacom)\n\nRedstone made an investment into Sipur and will serve as the production company’s chair, where she will work with the company’s co-founders to expand its reach internationally, multiple outlets reported Tuesday morning.\n\nRedstone told Variety her investment in Sipur is a “super opportunity” and praised the company for its “vision to be the first international production studio out of Israel.”\n\nSipur, which means “story” in Hebrew, was founded in 2019 by company CEO Emilio Schenker and Gideon Tadmor, and it has since backed projects including the Emmy-winning documentary “We Will Dance Again,” which chronicles the Oct. 7 attack on Israel.\n\nRedstone previously told the New York Times she wanted to leave Paramount to devote more time to pro-Israel activism: “I wanted to support Israel, and address issues around antisemitism and racism,” Redstone said, adding she felt CBS News needed more “balance” in its coverage of Israel’s war in Gaza.\n\nRedstone’s move comes as a Hollywood boycott of the Israeli film industry grows, which Paramount condemned over the weekend.\n\nWhy Is Hollywood Boycotting Israel?\n\nMore than 4,500 Hollywood actors, directors and film industry workers have signed an open letter since its publication Sept. 8, pledging to “not to screen films, appear at or otherwise work with Israeli film institutions—including festivals, cinemas, broadcasters and production companies—that are implicated in genocide and apartheid against the Palestinian people.” The letter states it is answering the “call of Palestinian filmmakers” who have urged Hollywood to “end complicity in their oppression.” At the time of publication, the letter had about 1,000 signatures. Some of Hollywood’s biggest A-list actors have signed the letter, including Emma Stone, Olivia Colman, Joaquin Phoenix, Mark Ruffalo and Javier Bardem, as well as directors including Adam McKay, Yorgos Lanthimos and Ava DuVernay. Paramount on Friday became the first major Hollywood studio to condemn the boycott. “Silencing individual creative artists based on their nationality does not promote better understanding or advance the cause of peace,” Paramount said in a statement. Variety reported on Monday some Israeli filmmakers have pushed back against the boycott, stating it would harm Israeli-produced films that are anti-war, citing multiple anti-war films that are shortlisted this year to be Israel’s entry to the Academy Awards. Filmmakers for Palestine, which created the open letter, criticized Paramount’s statement in a response, stating it hopes the company is not “intentionally misrepresenting the pledge in an attempt to silence our colleagues in the film industry,” stating the boycott does not target individuals based on identity but instead targets “Israeli film institutions and companies.”\n\nKey Background\n\nRedstone departed Paramount when the company’s merger with Skydance closed in August, ending the Redstone family’s decades-long controlling stake in the company. Her father, the late billionaire Sumner Redstone, acquired Paramount Pictures in 1994, and her grandfather, Michael Redstone, founded theater operator National Amusements, which was acquired by Skydance and absorbed into Paramount in the merger. Shari Redstone had served as Paramount’s chairwoman since 2019. The Paramount merger was overshadowed by politics, including a lawsuit President Donald Trump filed alleging CBS News deceptively edited an interview of his election opponent, former Vice President Kamala Harris, which was later settled. Redstone previously told the Times Trump’s lawsuit and scrutiny of CBS News could make the network more balanced: “Part of me thought, maybe Trump could accomplish what I never got done,” Redstone said.\n\nFurther Reading\n\nParamount Criticizes Celebrity-Endorsed Israeli Film Boycott (New York Times)\n\nIsraeli Boycott Pledge Adds Hundreds Of Signatories Including Emma Stone & Peter Sarsgaard, Israeli Producers Association Responds — Update (Deadline)\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Paramount, where Redstone served as chair until its merger with Skydance, criticized a boycott pledge signed by thousands in the Hollywood film industry over the weekend.","url":"https://www.forbes.com/sites/conormurray/2025/09/16/former-paramount-chair-shari-redstone-joins-israeli-film-company-as-chair-as-hollywoods-israel-boycott-grows/","image":"https://imageio.forbes.com/specials-images/imageserve/68c978249392f810a0911422/0x0.jpg?format=jpg&crop=2692,1516,x116,y165,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-09-16 14:47:54","author":"Conor Murray,Forbes Staff,Jesse Grant","authors":["Conor Murray","Forbes Staff","Jesse Grant"],"language":"en","source_country":"US","sentiment":-0.032},{"id":361005124,"title":"Failed VP Nom Tim Walz Running For Third Gov Term","text":"Democratic Minnesota Gov. Tim Walz announced he will run for a third term in 2026 on Monday.\n\nWalz, a failed vice presidential nominee who has become a vocal critic of President Donald Trump in his second term, launched his reelection bid after ruling out a run for president in July. The two-term governor is likely to face a competitive Republican challenger in a state that the 2024 Democratic presidential ticket of former Vice President Kamala Harris and himself won by roughly five percentage points. (RELATED: Tim Walz Appears To Tell Supporters All Is Not Lost Because Trump Will Die Soon)\n\n“We’ve made historic progress in our state, but we’re not done yet,” Walz wrote in a post on the social media platform X announcing his run for a third term. “I’m staying in the fight — and I need you with me.”\n\nMinnesota is among a handful of states that allow incumbent governors to seek reelection for more than two consecutive terms. Democratic Illinois Gov. JB Pritzker is also running for a third term in 2026.\n\nWalz also recently sparked controversy by appearing to wish for President Donald Trump’s death during a speech on Sept. 2 in front of supporters.\n\n“You get up in the morning and you doom scroll through things and although I will say this, you woke up the last few days thinking there might be news,” the Minnesota Democrat said in a reference to the false #TrumpIsDead hashtags that spread across social media over Labor Day weekend. “Just saying, just saying. There will be news sometime, just so you know. There will be news.”\n\nWalz also raged about Trump supporters’ “stupid, frickin’ red hat” during a speech at the Democratic National Committee’s summer meeting in Minneapolis in August.\n\n“Think of how easy it would be to be a damn Republican. Oh, what should I wear today? This stupid, frickin’ red hat,” Walz said. “What should I say today? I don’t know, just make sure it’s cruel.”\n\nSeveral Minnesota Republicans have lined up to challenge Walz’ reelection bid, including state Rep. Kristin Robbins and former state senator Scott Jensen, who lost to him in 2022.\n\nThe nonpartisan Cook Political Report rates the contest as “likely Democrat.”\n\nWalz has called for a special legislative session to pass gun control legislation in Minnesota following a mass shooting and political assassination that have left two Catholic school children and a state lawmaker and her husband dead.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"Democratic Minnesota Gov. Tim Walz announced he will run for a third term in 2026 on Monday. Walz, a failed vice presidential nominee who has become a vocal critic of President Donald Trump in his second term, launched his reelection bid after ruling out a run for president in July. The two-term governor is likely [&#8230;]","url":"https://dailycaller.com/2025/09/16/tim-walz-running-third-term/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Tim-Walz-1-scaled-e1758030970553.jpg","video":null,"publish_date":"2025-09-16 14:46:05","author":"Adam Pack","authors":["Adam Pack"],"language":"en","source_country":"US","sentiment":-0.19},{"id":361011612,"title":"US President Donald Trump Sues New York Times For $15 Billion Over Defamation","text":"Washington: U.S. President Donald Trump sued the New York Times, four of its reporters and publisher Penguin Random House for at least $15 billion on Monday, claiming defamation and libel and citing reputational damage, a Florida court filing showed.Trump has gone after major media outlets, including the Wall Street Journal and Paramount, in his second term for what he describes as false or misleading coverage and has sought billions of dollars in damages from them.Monday's suit cites a series of New York Times articles, one an editorial prior to the 2024 presidential election, which said he was unfit for office, and a 2024 book published by Penguin titled \"Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success\".\"Defendants maliciously published the Book and the Articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump,\" according to the filing lodged on Monday in the U.S. District Court for the Middle District of Florida.Trump also sued the Wall Street Journal and its owners, including Rupert Murdoch, earlier this year for at least $10 billion over the newspaper's report that his name was on a 2003 birthday greeting for Jeffrey Epstein that included a sexually suggestive drawing and a reference to secrets they shared.In July, CBS parent company Paramount agreed to settle a lawsuit filed by Trump alleging that the CBS news program \"60 Minutes\" deceptively edited an interview with former Vice President Kamala Harris that the network broadcast in October.Trump's lawyers said in the filing on Monday that the New York Times had harmed Trump's business and personal reputation, thereby causing massive economic damage to his brand value and significant damage to his future financial prospects.\"The harm to the value of TMTG (Trump Media and Technology Group) stock is one example of how the Defendants' defamation has injured President Trump,\" said his lawyers, citing \"a precipitous decline in the stock price.\"TMTG stock has been under pressure in recent months, fueled by worries about the end of a so-called lock-up period related to its stock market debut in March.\"This lawsuit has no merit. It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting,\" a spokesperson for the New York Times said.\"The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists' First Amendment right to ask questions on behalf of the American people.\"Penguin Random House did not immediately respond to a Reuters request for comment.In order to win a libel suit in the U.S., a public figure must demonstrate the offending statement was made with \"actual malice,\" meaning with knowledge it was false or with reckless disregard as to whether it was false.This defamation protection standard was established by the U.S. Supreme Court in its landmark 1964 ruling in the case New York Times v. Sullivan - which Trump has often criticized as too protective of the news media.The Supreme Court in recent years has turned away opportunities to revisit it.The filing comes after Trump threatened last week to sue the New York Times for its reporting on an allegedly sexually suggestive note and drawing given to Epstein.Epstein, the disgraced financier and sex offender, died by suicide in a New York jail cell in 2019.Trump has said he parted ways with Epstein before the financier's legal troubles became public in 2006.\"Today, I have the Great Honor of bringing a $15 Billion Dollar Defamation and Libel Lawsuit against The New York Times,\" Trump said earlier on Monday in a post on his social media platform Truth Social.In his post, Trump accused the paper of lying about him, his family and businesses, as well as Republican-led movements and ideologies such as the America First Movement, and Make America Great Again, or MAGA.","summary":"Donald Trump sued the New York Times, four of its reporters and publisher Penguin Random House for at least $15 billion on Monday.","url":"https://www.republicworld.com/world-news/trump-sues-new-york-times-for-defamation-and-libel-seeks-15-billion","image":"https://img.republicworld.com/all_images/us-president-donald-trump-1756143029399-16_9.webp","video":null,"publish_date":"2025-09-16 14:42:31","author":"Thomson Reuters","authors":["Thomson Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.043},{"id":360989260,"title":"Tim Walz, the 2024 Democratic VP candidate, says he’ll seek a third term as Minnesota’s governor (World)","text":"Minnesota Gov. Tim Walz said Tuesday he will seek a third term in the 2026 elections, hoping to beat the odds to become the longest-serving governor in a state where voters have usually said two terms were plenty.\n\nIn a campaign video posted on YouTube, Walz said he’s running because his work is not done and he wants to make Minnesota a place where everyone has a chance succeed.\n\n“I’ve seen how we help each other through the hard times,” he said. “And boy, we’ve seen terrible times this year. I’m heartbroken and angry about the beautiful people we lost to gun violence. But it’s in these moments we have to come together. We can’t lose hope because I’ve seen what we can do when we work together.”\n\nVice President Kamala Harris picked Walz as her running mate on the 2024 Democratic presidential ticket after his attack line against former President Donald Trump and his running mate, then-Ohio Sen. JD Vance — “These guys are just weird” — spread widely.\n\nWalz had been building up his national profile since their defeat in November. He’s been a sharp critic of Trump as he’s toured early caucus and primary states. In May, he called on Democrats in South Carolina to stand up to Trump, saying, “Maybe it’s time for us to be a little meaner.”\n\nThe governor came under heavy GOP criticism after a Minnesota speech in May when he compared Immigration and Customs Enforcement agents under Trump to the Gestapo in Nazi Germany. Congressional Republicans called him out at a hearing on immigration in June, but he refused to apologize.\n\nWalz, 61, is also frequently mentioned as a potential 2028 presidential candidate, but in an interview with Axios in July, he said he would not make a White House bid if he sought reelection.\n\nWalz said in February that he would not run for the U.S. Senate seat being vacated by Tina Smith because he was more interested in staying governor. While his gubernatorial campaign was actively raising money, he held off on making it official, hoping to first get past this year’s regular and special sessions of the Legislature.\n\nBut within days after finishing that work, his close political ally, former Minnesota House Speaker Melissa Hortman, was assassinated by a man posing as a police officer. Walz delivered a eulogy at her funeral. Trump refused to call Walz to offer condolences, saying it would have been a waste of time.\n\nWalz’s run for the vice presidency introduced the former high school teacher with a “Midwest Dad” image to a wider, national audience. But it also brought new scrutiny of his record as governor and as a congressman before that, and his tendency to embellish or exaggerate details and mangle his words.\n\nHe proudly touted the accomplishments of the 2023 legislative session, when Democrats used their full control to enact a sweeping platform of liberal priorities, including free school meals for all students, and expanded protections for abortion and transgender rights.\n\nBut he also faced renewed criticism from the right for his handling of the unrest that followed the murder of George Floyd in Minneapolis in 2020, a $250 million pandemic food aid fraud case and his military record with the Minnesota National Guard. Critics said he exaggerated his rank and faulted him for leaving the military to run for Congress before his unit deployed to Iraq.\n\nWalz was first elected in 2018 by over 11 percentage points and by nearly 8 points in 2022. But no Minnesota governor has won a third consecutive term since the state switched to four-year terms in 1963.\n\nNo Minnesota Republican has won a statewide race since Tim Pawlenty was reelected to a second term as governor in 2006. However, the traditionally Democratic state has become increasingly competitive in recent years. A couple of GOP candidates came close to winning statewide races in 2022 and the state House was tied between Republicans and Democrats for the 2025 session.\n\nOn the Republican side of the governor’s race, former business executive and Army veteran Kendall Qualls announced his candidacy in May and hopes to become Minnesota’s first Black governor. Qualls also ran in 2022 but lost the GOP endorsement to family physician and former state senator Scott Jensen, who announced in July that he’s running again.\n\nThe only current GOP office-holder in the race so far is state Rep. Kristin Robbins, of Maple Grove, who chairs a House committee formed this year to investigate fraud in government programs. She announced her candidacy Aug. 20.","summary":"Minnesota Gov. Tim Walz said Tuesday he will seek a third term in the 2026 elections, hoping to beat the odds to become the longest-serving governor in a state where voters have usually said two terms were plenty.\n\nIn a campaign video posted on YouTube, Walz said he&rsquo;s running because his wor...","url":"https://www.castanet.net/news/World/572608/Tim-Walz-the-2024-Democratic-VP-candidate-says-he-ll-seek-a-third-term-as-Minnesota-s-governor","image":"https://www.castanet.net/content/2025/9/c0e82c68286a985d30cd0eeafd2b90b4d4140b21f78972a61aa9c181d44527fe.jpg","video":null,"publish_date":"2025-09-16 14:39:00","author":"Tina Smith","authors":["Tina Smith"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.023},{"id":360979130,"title":"Minnesota Gov. Tim Walz launches campaign for third term: 'I’m staying in the fight'","text":"Saying that he's \"not done yet,\" Democratic Gov. Tim Walz, the 2024 Democratic vice presidential nominee, on Tuesday launched a campaign for a third term as Minnesota governor. \"We’ve made historic progress in our state, but we’re not done yet,\" Walz wrote in a social media post. And taking a jab at President Donald Trump and his administration, Walz said in a campaign launch video that \"I'll never stop fighting to protect us from the chaos, corruption, and cruelty coming out of Washington.\" \"I’ve seen how we help each other through the hard times,\" Walz added. \"And boy, we’ve seen terrible times this year. I’m heartbroken and angry about the beautiful people we lost to gun violence. But it’s in these moments we have to come together. We can’t lose hope because I’ve seen what we can do when we work together.\" THE MOST VULNERABLE REPUBLICAN GOVERNOR IN 2026 LAUNCHES RE-ELECION BID Then-Vice President Kamala Harris picked Walz as her running mate after she replaced then-President Joe Biden atop the Democrats' national ticket last summer. Taking aim at Trump and his running mate, now-Vice President JD Vance, Walz criticized the GOP ticket as \"just weird.\" But Trump ended up sweeping all seven key battleground states in last year's presidential election to win back the White House. TRUMP NOT ON BALLOT BUT FRONT-AND-CENTER IN 2025 ELECTIONS This year, Walz has kept up his verbal critiques of Trump as the governor has continued to build his national profile. But the 61-year-old governor was heavily criticized by Republicans after comparing Immigration and Customs Enforcement (ICE) agents to Nazi Germany's Gestapo. The governor was called out by congressional Republicans during a June hearing, but he refused to apologize. Walz, a former high school teacher and football coach, is often mentioned as a possible 2028 Democratic presidential candidate, but he told Axios this summer that he wouldn't seek the White House if he ran for re-election as governor in 2026. His three months as Harris' running mate put Walz under the glare of the national political spotlight, and brought new scrutiny about his record as governor, and before that as a congressman, and his handling of the violent protests following the 2020 murder of George Floyd in Minneapolis. He was also criticized for exaggerating his rank during his years with the Minnesota National Guard, and was faulted for leaving the military to run for Congress ahead of his unit being deployed to the war in Iraq. Walz was first elected governor in 2018, winning by 11 percentage points. He won re-election in 2022 by an 8-point margin. CLICK HERE TO GET THE FOX NEWS APP But he'll be bucking history as he runs again in 2026. No Minnesota governor has won a third consecutive term since the state switched to four-year terms six decades ago. Former business executive and Army veteran Kendall Qualls and physician and former state Sen. Scott Jenson, the 2022 GOP gubernatorial nominee, are among the candidates running for the Republican nomination.","summary":"Minnesota governor Tim Walz seeks historic third term while criticizing Trump administration and facing Republican challengers in 2026 gubernatorial race.","url":"https://www.foxnews.com/politics/minnesota-gov-tim-walz-launches-campaign-third-term-im-staying-fight","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/tim-walz.jpg","video":"https://www.foxnews.com/video/6378316788112","publish_date":"2025-09-16 14:37:54","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","source_country":"US","sentiment":0.122},{"id":360979104,"title":"Ex-GOP official turned Democrat targets Trump in battleground state gubernatorial campaign launch","text":"Former Georgia Lt. Gov. Geoff Duncan, a Republican turned Democrat, says he will take on President Donald Trump if he wins election next year as governor in the key southeastern battleground state. Duncan on Tuesday denounced Trump as he declared his candidacy, joining an increasingly crowded field in the Democratic Party primary. \"I will stand up to Trump and his yes men in our state while bringing down the costs of childcare, health care, and housing so every Georgia family is in the best position possible,\" Duncan pledged as he launched his campaign. Duncan, a former healthcare executive and minor league baseball player, served in Georgia's legislature for four years before running and winning election as lieutenant governor in 2018. He decided against seeking re-election in 2022. DUNCAN SAYS TRUMP'S ATTACKS JUSTIFY HIS SWITCH FROM THE GOP TO DEMOCRATS After leaving office, Duncan – who was a vocal GOP critic of Trump's repeated efforts to reverse his razor-thin November 2020 election defeat in battleground Georgia to former President Joe Biden – worked towards what he said was \"healing and rebuilding a Republican Party that is damaged but not destroyed.\" Duncan endorsed Biden in the 2024 presidential race and later supported then-Vice President Kamala Harris after she replaced Biden at the top of the Democrats' 2024 ticket. Duncan spoke in a high-profile speech at the Democratic National Convention in Chicago last summer. THE MOST VULNERABLE REPUBLICAN GOVERNOR IN 2026 LAUNCHES RE-ELECION BID The Georgia Republican Party expelled him from the GOP earlier this year. Duncan, in a campaign launch video, spotlighted his clashes with Trump, saying he \"never wavered in taking on Trump. So Georgia Republicans threw me out of their party. I was leaving anyway.\" \"Now I’m running for governor as a proud Democrat. To focus on what matters most to Georgians,\" he added. Duncan joins a Democratic primary field that already includes former Atlanta Mayor Keisha Lance Bottoms, former DeKalb County CEO Mike Thurmond and former State Sen. Jason Esteves. In the Republican primary, Lt. Gov. Burt Jones landed Trump's endorsement as he battles state Attorney General Chris Carr. TRUMP NOT ON BALLOT BUT FRONT-AND-CENTER IN 2025 ELECTIONS The winner of next year's general election will succeed popular term-limited GOP Gov. Brian Kemp. After Duncan switched parties in August, Trump took to social media to call him \"a total loser.\" The president charged that Duncan was \"never able to get anything done, all he ever did was complain. We didn’t want him in the Republican Party any longer, so I’m told he became a Democrat. Good riddance Geoff. You don’t even have a chance!!!\" CLICK HERE TO GET THE FOX NEWS APP Asked about the criticisms, Duncan said in a Fox News Digital interview, \"I think he's making my case for me that the Republican Party no longer wants to love their neighbor. There's nothing in that tweet or Truth Social post or whatever that shows any sort of attitude that I want to be a part of.\" Duncan, taking aim at Trump, added, \"I hope he figures out how to run this country better than he is now for the next couple of years. But I'm proud to not be a Republican, especially with him at the tip of the spear.\"","summary":"Republican-turned-Democrat Geoff Duncan joins Georgia&apos;s Democratic gubernatorial primary after being expelled from the GOP for criticizing Trump","url":"https://www.foxnews.com/politics/ex-gop-official-turned-democrat-targets-trump-battleground-state-gubernatorial-campaign-launch","image":"https://static.foxnews.com/foxnews.com/content/uploads/2023/08/former-georgia-lt-gov-geoff-duncan.jpg","video":"https://www.foxnews.com/video/6376698023112","publish_date":"2025-09-16 14:37:03","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":-0.503},{"id":360970202,"title":"Schwarzenegger rails against Newsom’s proposal to redraw California’s congressional maps","text":"DEMOCRATS RELEASE NEW CALIFORNIA MAP THAT TARGETS FIVE GOP DISTRICTS\n\nNewsom and California Democrats advanced that redistricting map, called Proposition 50, in reaction to President Donald Trump’s push to redistrict Texas and other red states. Schwarzenegger sharply criticized the idea that Democrats need to use the same tactics to fight Trump’s efforts at redistricting, saying that “two bad behaviors don’t make a right behavior.”\n\nThe former Republican governor, bodybuilder, and Terminator star has been a longtime critic of Trump. He endorsed former Vice President Kamala Harris for president in 2024.\n\nSchwarzenegger said the redrawing of the map was not transparent, as it was redrawn by politicians, not California voters, and released by the Democratic Congressional Campaign Committee.\n\n“They are trying to fight for democracy by getting rid of the democratic principles of California,” he said. “It is insane to let that happen. This is why it is important for you to vote no on Proposition 50.”\n\nSchwarzenegger made the comments while speaking before a crowd at the University of Southern California, directly urging students to vote no on the special election question. He said redistricting makes it too easy for politicians of the favored party not to perform as well in their home districts, since they have much smaller chances of voters flipping the district in retaliation.\n\n“When they draw the district lines fair, there’s competition and therefore the parties have to perform,” he said. “As soon as they go and draw the district lines themselves, they don’t have to perform.”\n\nCALIFORNIA REDISTRICTING BALLOT MEASURE COULD COST OVER $280 MILLION IN SPECIAL ELECTION: REPORT\n\nThe special election this fall could cost the state over $280 million, according to a report from the Mercury News.\n\nNewsom said he would reimburse California counties for costs associated with the special election for Proposition 50.","summary":"Former California Gov. Arnold Schwarzenegger called on voters to reject the state&#8217;s redistricting ballot measure, calling it a proposition &#8220;against democracy.&#8221; Schwarzenegger vehemently opposed the redistricting proposal, spearheaded by Gov. Gavin Newsom (D-CA), set to hit statewide ballots in a special election on Nov. 4. Californians will voice their opinions on whether to redistrict the [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3809131/arnold-schwarzenegger-redistricting-california-ballot-measure/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/AP25163200848881.webp?w=696","video":null,"publish_date":"2025-09-16 14:35:34","author":"Molly Parks","authors":["Molly Parks"],"language":"en","source_country":"US","sentiment":-0.603},{"id":361041036,"title":"Kamala Harris Reveals Old Democrat Truths In Her New Book [Op-Ed]","text":"Source: Houston Chronicle/Hearst Newspapers / Getty I hope Kamala Harris’ long-overdue acknowledgment of Joe Biden’s doomed reelection bid doesn’t fade too far from the news cycle. As frustrating as “better late than never” applies in this instance, there are old-head Democrats out there who need to read her words and pre-order the book—especially the Biden loyalists who still refuse to see his selfish and self-sabotaging behavior during his presidency. Those fans, the Bidennettes as I usually call them, need to stop acting as if Joe Biden was some combination of a political genius and their play uncle and see his selfish and self-sabotaging behavior during his presidency more clearly. In an excerpt from 107 Days, the former vice president’s forthcoming book about her historic yet failing presidential campaign last year, she writes that when it comes to then 81-year-old Biden running for a second term: “‘It’s Joe and Jill’s decision.’ We all said that, like a mantra, as if we’d all been hypnotized. Was it grace, or was it recklessness? In retrospect, I think it was recklessness. “The stakes were simply too high.” Harris continued in her book excerpt in The Atlantic. “This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition. It should have been more than a personal decision.” Umm, yeah, obviously. If only she had said this during her rushed campaign, when the enabling of Biden’s ego by his family members and closest advisors caught up with him at the presidential debate last June. I understand the difficult position she was placed in – she notes that given their past and her position as his VP, it might’ve looked self-serving for her to suggest he forgo another round. Still, the man was 81, and there was a reason why his staff purposely hid him from the press for the majority of his term. So, it was irresponsible for all parties involved not to tell that elderly man to his face that he was too old to run for president again – especially when the public said as much over and over again in polls – no matter what his wife, son, and hangers-on wanted. Speaking of Biden’s kinfolk and political advisers, Harris also shares her feelings about how Biden’s people treated her as VP. “I often learned that the president’s staff was adding fuel to negative narratives that sprang up around me,” Harris writes. “One narrative that took a stubborn hold was that I had a ‘chaotic’ office and unusually high staff turnover during my first year.” And there were columns published at the time that openly discussed the tension between Harris and first lady Jill Biden, who resented Harris for taking issue with Biden’s position on busing and the good old days of working with segregationists back in the 2020 Democratic primary. This was always stupid in terms of strategy, of course, given that their fates were tied together. Only Harris appears to have grasped this, though. “When polls indicated that I was getting more popular, the people around him didn’t like the contrast that was emerging,” Harris notes. “None of them grasped that if I did well, he did well. That given the concerns about his age, my visible success as his vice president was vital. It would serve as a testament to his judgment in choosing me and reassurance that if something happened, the country was in good hands. My success was important for him.” “His team,” Harris ends the chapter by writing, “didn’t get it.” The response from Biden’s camp has been predictably defensive—and in doing so, they’ve inadvertently proven her point. Rather than acknowledging the strategic failures she’s highlighting, they’ve doubled down with the same dismissive attitude that hampered her vice presidency. “Vice President Harris was simply not good at the job,” one former Biden White House official told Axios. “She had basically zero substantive role in any of the administration’s key work streams, and instead would just dive bomb in for stilted photo ops that exposed how out of depth she was.” Biden is “not the reason she struggled in office or tanked her 2019 [presidential] campaign,” the ex-official continued. “Or lost the 2024 campaign, for that matter. The independent variable there is the vice president, not Biden or his aides.” Another told the outlet, “No one wants to hear your pity party.” Separately, one aide told Politico: “I hate that we’re beating up on a man struggling with cancer, and [who] did genuinely serve our country pretty damn well, even if he made a critical error at the end. But maybe what is even more painful is we needed more of this distinction and acknowledgement during the campaign. … I’m most offended by this being too little, too late.” The best nameless comment comes from a former Biden aide, who asked, “Why didn’t she do this during the campaign,” when her “main imperative would’ve been to distance herself because there was an election going on.” The whiff of sexism, racism, and projection in these comments is unsurprising given the source. Biden appointed some Black women judges, but as Rhonda Elaine Foxx, former Biden campaign director of women’s engagement, wrote on X, she had to email Biden staffers about the dismissive way “women of color were being treated on the campaign.” Biden’s political legacy in the 1980s and 1990s alone never warranted him such high regard in the Black community, but the treatment of Harris as a burden versus an asset only affirms what many skeptics like me have made of him and his ilk in the Democratic Party. That doesn’t excuse Harris’ mistakes in the campaign, but she was set up to fail. The Harris-Biden dynamic isn’t just about two individuals—it’s a symptom of a broader Democratic Party problem. While it’s her right to remain loyal to Joe Biden (she reportedly warned him about the excerpt), her experience exposes how the party’s gerontocracy operates: older leaders cling to power while younger voices are marginalized, then blamed when things go wrong. Biden may be out of office, but the same pattern is playing out elsewhere in the party. Last year, the problem was Joe Biden, and this year it’s people like the 88-year-old D.C. Congresswoman Eleanor Holmes Norton, who, despite her trailblazing legacy, is running for reelection to represent a district that’s 46% Black and has a median age of 34. Like Biden, she’s choosing personal attachment to power over what’s best for her constituents and party. The pattern is clear: Democratic elders would rather risk everything than step aside gracefully. Trump is not the only selfish old fool who’s endangering us, and there needs to be a Democrat who can say that before a book release—not after the damage is done. SEE ALSO: Kamala Harris’ Economy: Where Working Class Fits In Op-Ed: Gavin Newsom’s Troll Game Is Strong—But Don’t Let It Fool You","summary":"Michael Arceneaux writes that the way the Democratic Party gerontocracy is set up, older leaders cling to power while younger voices are marginalized.","url":"https://newsone.com/6462740/kamala-harris-reveals-old-democrat-truths-in-her-new-book/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/09/17579933554499.jpg?quality=80&strip=all&w=1024&crop=0,0,100,683px","video":null,"publish_date":"2025-09-16 14:00:00","author":"Michael Arceneaux","authors":["Michael Arceneaux"],"language":"en","source_country":"US","sentiment":-0.249},{"id":360962134,"title":"Trump files $15B suit against New York Times for defamation, libel","text":"Sept. 16 (UPI) -- President Donald Trump filed a suit for defamation and libel against The New York Times, seeking $15 billion in damages over alleged false statements about him, family members and his businesses and accusing the newspaper of flagrant political bias.\n\nCourt records indicated that the lawsuit was filed in federal court in Tampa, Fla., on Monday.\n\nTrump took to his Truth Social platform to accuse the newspaper of being a \"virtual mouthpiece for the Radical Left Democratic Party,\" but did not give details of the alleged falsehoods.\n\nThe action for damages amounting to more than the full market capitalization of The New York Times Company, was, Trump said, motivated by an imperative to \"restore integrity to journalism.\"\n\n\"The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, NOW!\" said Trump.\"\n\nHe also criticized the paper's endorsement of Kamala Harris for president in the 2024 election.\n\nHowever, experts said it was another instance of a strategy of using lawsuits of doubtful legality to gag critical voices and suppress free speech.\n\nDefamation and libel allegations are incredibly difficult to make stick in court because of the burden of proving \"actual malice\" -- showing the defendant was aware the statements were untrue, or was reckless with regard to their veracity.\n\nEndorsing a candidate running for political office is not defamatory.\n\nThe move came a week after Trump vowed to sue The New York Times over stories it ran about a letter he is alleged to have written to the late convicted sex offender Jeffrey Epstein and two months after he sued the Wall Street Journal over the same letter, a note consisting of the outline of a naked woman with text printed above his alleged signature.\n\nThe note, written for Epstein's 50th birthday, dates from 2003, before Epstein was convicted.\n\nTrump has won multi-million dollar settlements from ABC News and CBS News, in December and July, respectively, prompting groups representing the journalism industry to warn that opting to settle out of court was only fueling Trump's \"lawfare.\"\n\nAddressing the Reporters & Editors 50th anniversary gala in New York on Monday, before the latest suit was filed, NYT publisher A G Sulzberger warned of a growing so-called \"anti-press playbook\" trend among \"aspiring strongmen\" globally of leveraging civil law to exert financial pressure on media.","summary":"President Donald Trump filed a multi-billion-dollar lawsuit in a Florida federal court alleging The New York Times had defamed him, his family and businesses.","url":"https://www.upi.com/Top_News/US/2025/09/16/trump-New-York-Times-lawsuit/8771758021348/","image":"https://cdnph.upi.com/sv/ph/og/upi/8771758021348/2025/1/5c1be4fbabde65ee4d0b70fdc7635c27/v1.5/Trump-files-15B-suit-against-New-York-Times-for-defamation-libel.jpg","video":null,"publish_date":"2025-09-16 13:33:50","author":"Paul Godfrey","authors":["Paul Godfrey"],"language":"en","category":"politics","source_country":"US","sentiment":-0.137},{"id":360964674,"title":"Former Georgia Republican enters race for governor by blasting Trump","text":"Former Republican Lt. Gov. Geoff Duncan is running for Georgia governor as a Democrat.\n\nDuncan announced his campaign Tuesday with a video targeting President Donald Trump.\n\n“Georgians deserve leaders with the courage to take on Donald Trump and do what’s right,” Duncan said in the video. “As Georgia’s first Democratic governor in 28 years, I will stand up to Trump and his ‘yes’ men in our state while bringing down the costs of child care, health care, and housing so every Georgia family is in the best position possible. That’s what Georgia deserves.”\n\nDuncan pledged to “make Georgia the frontline of democracy and a backstop against extremism.”\n\nA former state representative and professional baseball player, Duncan served one term as lieutenant governor, declining to run for re-election in 2022 after vocally criticizing Trump’s efforts to overturn the 2020 election.\n\nIn 2021, Duncan authored a book called GOP 2.0 outlining his vision for a post-Trump Republican Party, and after his time in office, he became a fixture on cable news shows as an anti-Trump Republican. He was considered as a presidential candidate for the centrist No Labels party in 2024.\n\nLast year, he campaigned on behalf of Democratic presidential nominee Kamala Harris, including at the Democratic National Convention in Chicago, where he blasted the modern Republican Party as “a cult worshiping a felonist.” Before that, he had endorsed former President Joe Biden for another term.\n\nIn January, the Georgia Republican Party passed a resolution seeking to bar Duncan from calling himself a Republican and banishing him from party events, saying that his support for Harris and opposition to Trump and other GOP candidates meant he had “forfeited any claim to being even a nominal ‘Republican.’”\n\nIn his announcement video, Duncan called attacks from Trump a “badge of honor.”\n\n“I’ve never wavered in taking on Trump,” he said. “So Georgia Republicans threw me out of their party. I was leaving anyway.”\n\nDuncan officially announced his new affiliation last month.\n\nDuncan joins a field of Democrats with a longer history with the party, including former Atlanta Mayor Keisha Lance Bottoms, state Sen. Jason Esteves of Atlanta and former DeKalb County CEO Michael Thurmond.\n\nThe winner of the May Democratic primary will face off against the top finisher in the GOP field led by Duncan’s successor, Lt. Gov. Burt Jones, a major Trump ally, and Attorney General Chris Carr, who has sought to align himself with the wing of the Georgia Republican Party represented by Gov. Brian Kemp, supporting Trump’s policies while trying to keep a distance from the president’s more controversial behaviors.\n\nA Jones-Duncan match-up would represent a true political grudge match. Duncan stripped then-state Sen. Burt Jones of his committee chairmanship following Trump’s 2020 loss and Jones’ role in supporting Trump’s baseless claims of election fraud.","summary":"Former Republican Lt. Gov. Geoff Duncan is running for Georgia governor as a Democrat.\n\nDuncan announced his campaign Tuesday with a video targeting President Donald Trump.\n\n“Georgians deserve leaders with the courage to take on Donald Trump and do what’s right,” Duncan said in the video. “As Georgia’s first Democratic governor in 28 years, I will stand up to Trump and his ‘yes’ men in our state while bringing down the costs of child care, health care, and housing so every Georgia family is in the best position possible. That’s what Georgia deserves.”\n\nDuncan pledged to “make Georgia the frontline of democracy and a backstop against extremism.”\n\nA former state representative and professional baseball player, Duncan served one term as lieutenant governor, declining to run for re-election in 2022 after vocally criticizing Trump’s efforts to overturn the 2020 election.\n\nIn 2021, Duncan authored a book called GOP 2.0 outlining his vision for a post-Trump Republican Party, and after his time in office, he became a","url":"https://www.alternet.org/former-georgia-republican-enters-race-for-governor-with-anti-trump-message/","image":"https://www.alternet.org/media-library/image.jpg?id=61607435&width=1200&height=600&coordinates=0%2C171%2C0%2C171","video":null,"publish_date":"2025-09-16 13:33:30","author":"Georgia Recorder,Ross Williams","authors":["Georgia Recorder","Ross Williams"],"language":"en","category":"politics","source_country":"us","sentiment":-0.223},{"id":360976272,"title":"Trump announces $15 billion defamation lawsuit against New York Times","text":"Washington, DC: US President Donald Trump said he will file a $15 billion defamation and libel lawsuit against The New York Times, accusing the newspaper of running what he called a decades-long “method of lying” against him, his family, and the America First movement.\n\nIn a post on his social media platform, Truth Social, US President Donald Trump described the lawsuit as the largest illegal campaign contribution ever, alleging that the Times had effectively become a “mouthpiece” for the Democratic Party. He also criticised the newspaper’s front-page endorsement of Vice President Kamala Harris, calling it “something heretofore unheard of.”\n\n“The ‘Times’ has engaged in a decades-long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole,” Trump wrote.\n\nTrump’s move follows his threat last week to sue the Times after it reported on a sexually suggestive note and drawing given to financier Jeffrey Epstein for his 50th birthday in 2003.\n\nThe note appeared to carry Trump’s signature, though the president and his aides have denied any involvement, according to CNN.\n\nTrump did not provide details of the allegations in his lawsuit, but said it would be filed in Florida.\n\nHe has repeatedly argued that such lawsuits are part of his effort to “restore integrity to journalism”, as per CNN.\n\nCNN reported that in a complaint filed in a federal court in Tampa, Trump’s legal team alleged that The New York Times had engaged in a systematic campaign of “false, malicious, defamatory, and disparaging” reporting intended to damage his presidential campaign and tarnish his legacy.\n\n(Source: ANI)\n\nAlso Read: 73-year-old sikh woman, living in US for decades, detained by ICE","summary":"Washington, DC: US President Donald Trump said he will file a $15 billion defamation and libel lawsuit against The New York Times, accusing the newspaper of running what he called a decades-long &#8220;method of lying&#8221; against him, his family, and the America First movement. In a post on his social media platform, Truth Social, US [&#8230;]\n\n\nThe post Trump announces $15 billion defamation lawsuit against New York Times appeared first on KalingaTV.","url":"https://kalingatv.com/world/trump-announces-15-billion-defamation-lawsuit-against-new-york-times/","image":"https://www.kalingatv.com/wp-content/uploads/2025/03/cropped-Ktv-Logo-512.png","video":null,"publish_date":"2025-09-16 13:25:59","author":"KalingaTV Bureau","authors":["KalingaTV Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":-0.208},{"id":360955452,"title":"Minnesota Gov. Tim Walz will run for a third term in 2026","text":"Minnesota Gov. Tim Walz on Tuesday announced that he would seek re-election to a third term in 2026. “I want to make Minnesota a place where everyone has a chance to succeed, in every corner of the state,” Walz said in an announcement video. Minnesota is one of several states that allows incumbent governors to serve more than two terms. Walz, the Democratic Party's vice presidential nominee in 2024, joins Illinois Gov. JB Pritzker, also a Democrat, in seeking a third term in 2026. Several Republican candidates have already launched their campaigns, including state Rep. Kristin Robbins and Scott Jensen, who was the 2022 GOP nominee for governor. Walz was re-elected to a second term four years ago, beating Jensen by more than 7 percentage points. Two years later, then-Vice President Kamala Harris carried Minnesota with Walz on her ticket in the 2024 presidential election, but by a slimmer margin of just over 4 percentage points. Minnesota has trended slightly more in favor of Democrats in recent years, though it has long had a reputation as a swing state. Walz rose to national prominence last year as Harris' running mate in the presidential election, jumping into the campaign in August after then-President Joe Biden suspended his re-election bid in July. Since that campaign ended, the governor has fueled speculation that he could run for president himself in 2028, when a crowded field of ambitious Democrats is expected to seek the presidency. In the spring, Walz began to travel to several early Democratic presidential primary states, including Iowa and South Carolina, and offered public analysis of why he thought Democrats lost in 2024. Back home, Walz has had to deal with two high-profile violent incidents in Minnesota this year. In June, state Rep. Melissa Hortman and her husband were fatally shot and state Sen. John Hoffman was shot and injured in what Walz at the time called \"politically motivated\" attacks against the Democratic legislators. And just last month, two students at Annunciation Catholic School in Minneapolis died were shot and killed and several others were injured after a suspect opened fire during the school's Catholic mass. In his announcement video, Walz said of his state, “I’ve seen how we help each other through the hard times, and boy, we’ve seen terrible times this year. I’m heartbroken and angry about the beautiful people we lost to gun violence. But it’s in these moments that we have to come together.” Walz earlier this month called for a special session in the Minnesota state legislature, during which he hopes to pass a package of gun control legislation. The governor's announcement on Tuesday coincided with the date of a special legislative election to fill Hortman's vacant seat in the state legislature. Walz, who worked closely with Hortman, referred to her following her death earlier this year as a \"great leader\" and a \"formidable public servant,\" who served with \"grace, compassion, and tirelessness.\"","summary":"Minnesota Gov. Tim Walz on Tuesday announced that he would seek re-election to a third term in 2026.“I want to make Minnesota a place where everyone has a chance to succeed, in every corner of the state,” Walz said in an announcement video","url":"https://www.nbcnews.com/politics/2026-election/minnesota-gov-tim-walz-will-run-third-term-2026-rcna229383","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-09/250905-tim-walz-mn-1600-89d471.jpg","video":null,"publish_date":"2025-09-16 13:03:04","author":"Alexandra Marquez","authors":["Alexandra Marquez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.316},{"id":360964688,"title":"Liberals need to stop spreading this myth about Charlie Kirk","text":"What can you say about a 31-year-old hatemonger who died? If you’re a pundit, you have to say something nice because the president took Charlie Kirk’s calls. As the leader of the MAGA youth, Kirk was powerful and, by the rules of Washington, that entitles him to a warm and respectful sendoff.\n\nBut what can a nice liberal say about a man who made his fortune peddling gutter racism and vicious conspiracy theories? \n\nThey can’t praise Kirk’s wit, which ran towards LaQueesha jokes and cringeworthy impressions of Black women. They can’t lionize him as a worthy intellectual opponent. This was, after all, someone who believed Haiti was infested by demonic voodoo that might be turning people into cats. \n\nWith limited raw material to work with, the image-makers have repackaged Charlie Kirk as a champion of reason and dialogue. It would have been enough to condemn Kirk’s horrific assassination, denounce political violence, and extend profound sympathy to his family, but leading liberals felt obliged to remake a snarling crank into a martyr for liberal democracy. \n\nCalifornia Governor Gavin Newsom kicked off the myth-making. “I knew Charlie, and I admired his passion and commitment to debate. [...] The best way to honor Charlie's memory is to continue his work: engage with each other, across ideology, through spirited discourse.”\n\n“Kirk was practicing politics in exactly the right way,” Ezra Klein wrote in the New York Times, “He was showing up to campuses and talking with anyone who would talk to him. He was one of the era’s most effective practitioners of persuasion.” \n\nHere, Klein is contrasting Kirk’s nonviolent approach with that of the terrorist who murdered him. It’s damning Kirk by faint praise to say he was doing politics better than his assassin, but it’s unequivocally true. However, holding Kirk up as a champion of tolerance and dialogue paints him in a false light to millions who might only know him through a New York Times headline or Newsom’s socials. \n\nKirk’s commitment to democratic values was situational at best. He bussed insurrectionists to the Capitol on January 6th. Free speech was a tool for him, not a universal principle. He got his start as an activist by compiling a McCarthyite list of liberal professors. For years, he and his organization built support for speech bans and laws muzzling academics. Far from valuing respectful dialogue, Kirk often painted his political enemies as less than real Americans. He even called for Rep. Ilhan Omar, an American citizen and a sitting member of Congress, to be denaturalized and deported. \n\nKirk made light of political violence against his adversaries, whether it was the crimes of the J6ers, the attempted murder of Paul Pelosi, or the recent terror spree in Minnesota. Kirk urged his millions of listeners to bail out Pelosi's attacker. The hammer-wielding assailant was trying to kidnap then-Speaker Nancy Pelosi based on the same debunked 2020 election conspiracy theories Kirk broadcast to his audience of millions, but Kirk baselessly insinuated that the attacker was Pelosi’s gay lover. When an antivax Christian nationalist shot two Democratic state legislators and their spouses, Kirk blamed Minnesota governor Tim Walz. \n\nCharlie Kirk was a prolific and vituperative racist even by the standards of MAGA influencers. “Anyone holding a DEl job deserves your scorn,” Kirk tweeted last year, “Next time you meet one, you should ask them: \"You're a stupid person doing a race hustle job, how do you live with yourself?\" So much for comity. \n\nKirk claimed his Black enemies were incompetents who got their jobs through racial preference. Justice Ketanji Brown Jackson, former Vice President Kamala Harris, and former Defense Secretary Lloyd Austin were just a few of the leaders he dismissed as diversity hires. \n\n“You do not have the brain processing power to otherwise be taken really seriously,” Kirk said of the nation’s newest Supreme Court justice, “You had to go steal a white person’s slot to go be taken somewhat seriously.” Kirk’s contempt for Black women ran the gamut from New York Attorney General Tish James, whom he called a “savage,” to customer service reps. “If I’m dealing with someone in customer service who’s a moronic Black woman, I wonder: ‘is she there because of her excellence or is she there because of affirmative action?’” he said. \n\nInsulting Black pilots became part of Kirk’s rancid shtick. “I’m sorry. If I see a Black pilot, I’m going to be like, ‘Boy, I hope he’s qualified,’” Kirk said. Another time, Kirk mimicked an imaginary Black pilot called “LaQueesha James” who he imagined as so incompetent she greeted the passengers with “‘Hi, ladies and gentlemen, pray for me!’” On yet another broadcast, he did a bit about imaginary dudes “Ramon and Cadillac” getting to fly the plane just because they’re Black. \n\nWhen a plane crashed, or a natural disaster struck, Kirk liked to pick out a Black, female, or gay officials, label them “DEI hires,” and accuse them of killing innocent people. He was such a deranged racist that he tried to blame Black fire chief of Austin, Texas, for flash flood deaths in Kerr County, 130 miles away. Kirk plastered the man’s name and face across the internet, risking reprisals against him. “They brought [the chief] in from Atlanta, and his priority was not putting out fires or being prepared for floods. No. His priority was to make sure that the fire department was Blacker,” Kirk claimed. “How many little girls died at Camp Mystic because the Austin Fire Department hired a DEl fire chief?” he tweeted. \n\nKirk shamelessly exploited the fears of his audience. He claimed that, more and more in America, “prowling Blacks go around for fun to go target white people.” Kirk’s group, Turning Point USA, wrapped itself in the “White Boy Summer” flag and even sold merch with the notorious white supremacist slogan. \n\nWe are not going to solve the crisis of political violence by clinging to self-created illusions. Charlie Kirk was a victim, but he was no martyr.","summary":"What can you say about a 31-year-old hatemonger who died? If you’re a pundit, you have to say something nice because the president took Charlie Kirk’s calls. As the leader of the MAGA youth, Kirk was powerful and, by the rules of Washington, that entitles him to a warm and respectful sendoff.\n\nBut what can a nice liberal say about a man who made his fortune peddling gutter racism and vicious conspiracy theories? \n\nThey can’t praise Kirk’s wit, which ran towards LaQueesha jokes and cringeworthy impressions of Black women. They can’t lionize him as a worthy intellectual opponent. This was, after all, someone who believed Haiti was infested by demonic voodoo that might be turning people into cats. \n\nWith limited raw material to work with, the image-makers have repackaged Charlie Kirk as a champion of reason and dialogue. It would have been enough to condemn Kirk’s horrific assassination, denounce political violence, and extend profound sympathy to his family, but leading liberals felt obliged to remake a snarlin","url":"https://www.alternet.org/alternet-exclusives/charlie-kirk-myth/","image":"https://www.alternet.org/media-library/image.jpg?id=61589411&width=1200&height=600&coordinates=0%2C250%2C0%2C250","video":null,"publish_date":"2025-09-16 12:36:38","author":"Lindsay Beyerstein","authors":["Lindsay Beyerstein"],"language":"en","source_country":"us","sentiment":0.076},{"id":360993470,"title":"Nancy Mace To Force Vote On Censuring Ilhan Omar After Hateful Remarks On Charlie Kirk","text":"Democratic Minnesota Rep. Ilhan Omar could face serious consequences over her inflammatory remarks about Turning Point USA founder Charlie Kirk following his assassination on Wednesday.\n\nRepublican South Carolina Rep. Nancy Mace unveiled a resolution on Monday that would formally censure Omar and strip the far-left “Squad” member of her committee assignments over her comments on Kirk’s slaying. Mace told reporters that she would file a privileged motion on Tuesday — meaning she will unilaterally force the House to vote on the measure as early as this week. (RELATED: Ilhan Omar Claims Without Evidence Republicans Want Kamala Harris Dead)\n\n“She is inciting violence against conservatives in the wake of Charlie Kirk’s political assassination,” Mace said in a video filmed outside Omar’s office on Monday evening. “She is dehumanizing conservatives all across the country, calling Charlie Kirk a terrorist.”\n\n“I’m not going to be silent on this because enough is enough,” Mace continued.\n\nOmar told Zeteo News’ Mehdi Hasan on Thursday that it is “f-ed up” for Americans to memorialize Kirk for his good works.\n\n“I think there are a lot of people out there talking about him just wanting to have a civil debate,” Omar said. “There is nothing more f-ed up than to completely pretend that his words and actions have not been recorded and in existence for the last decade or so.”\n\n“These people are full of shit and it’s important for us to call them out,” Omar added.\n\nOmar would be removed from her position on the House Committee on Education and Workforce and the Budget Committee if Mace’s resolution passes the House. Republicans notably failed to strip Democratic New Jersey Rep. LaMonica McIver — who is alleged to have assaulted law enforcement officers — of her membership on the Homeland Security Committee on Sept. 3 after five GOP lawmakers joined Democrats in defeating a resolution offered by Republican Louisiana Rep. Clay Higgins.\n\nOmar also reposted a video characterizing Kirk as a “reprehensible human being” and a “stochastic terrorist,” sparking outrage from Republicans.\n\n“Kirk was a reprehensible human being. He enacted his political agenda by preying on weak-minded people,” the video says. “He was a stochastic terrorist, an adamant transphobe … he believed in the subjugation of women and with his last dying words he was spewing racist dog whistles.”\n\nRepublican Georgia Rep. Buddy Carter also introduced a resolution on Monday that would oust Omar from her two current committees, Fox News Digital first reported.\n\nSpeaker Mike Johnson told reporters on Monday that he has not decided whether to hold a vote on either measure.\n\n“We’ll have to talk about it, I haven’t even seen them yet,” Johnson said.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"","url":"https://dailycaller.com/2025/09/16/nancy-mace-ilhan-omar-censure-charlie-kirk/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Nancy-Mace-scaled-e1757985984976.jpg","video":null,"publish_date":"2025-09-16 12:25:09","author":"Adam Pack","authors":["Adam Pack"],"language":"en","source_country":"us","sentiment":-0.192},{"id":361014556,"title":"Minnesota Gov. Tim Walz will run for a third term in 2026","text":"Minnesota Gov. Tim Walz, last year’s Democratic nominee for vice president, will run for a third term, he announced Tuesday.\n\n“I want to make Minnesota a place where everyone has a chance to succeed in every corner of the state,” Walz said in a video announcing his reelection plans.\n\nWalz, who leaped into the national spotlight after Kamala Harris picked him as her running mate last year, has previously said he would not run for president in 2028 if he sought a third term in the governor’s mansion.\n\nIn his campaign launch video, Walz alluded to the June assassination of former state House Speaker Melissa Hortman, a close ally who was killed alongside her husband and dog in their home while another state lawmaker and his wife were injured by the alleged gunman. A special election to fill Hortman’s seat in the state House is set for Tuesday. \n\n“I’m heartbroken and angry about the beautiful people we’ve lost to gun violence,” Walz said in the video. “But it’s in these moments we have to come together.”\n\nBefore he was elected governor in 2018, Walz served six terms in the House representing the largely rural 1st District in southern Minnesota. After flipping the seat in 2006, he had a series of mostly comfortable reelection wins, save for his last race in 2016 when he defeated Republican Jim Hagedorn by less than a point as Donald Trump was carrying the district by double digits. Hagedorn flipped the seat in 2018, and Republicans have held it ever since. \n\nMinnesota Democrats controlled the state House and state Senate in 2023 and 2024, allowing Walz to push through several policy priorities. In his video Tuesday, he touted a paid family leave plan set to take effect next year, tax cuts for middle class families and investments in public safety among his administration’s accomplishments. He also emphasized education, noting that the state’s graduation rates have risen. \n\nIn announcing his campaign, Walz didn’t go after Trump by name or refer to his unsuccessful vice presidential run, although he did vow to “never stop fighting to protect us from the chaos, corruption and cruelty coming out of Washington.” \n\nWalz will need to find a new running mate for next year’s election. Lt. Gov. Peggy Flanagan is running to succeed retiring Democratic-Farmer-Labor Sen. Tina Smith. \n\nA large field of Republicans are seeking to challenge Walz next year, including 2022 gubernatorial nominee and former state Sen. Scott Jensen, state Rep. Kristin Robbins, former St. Cloud City Councilmember Jeff Johnson, retired mixed martial arts fighter Brad Kohler, retired Navy officer Phillip Parrish, and Kendall Qualls, who ran for governor in 2022 and Minnesota’s 3rd District in 2020. More candidates could also enter the race. \n\nRepublicans haven’t won a statewide election in Minnesota since 2006, when Gov. Tim Pawlenty was reelected.","summary":"Minnesota Gov. Tim Walz, last year’s Democratic nominee for vice president, will run for a third term, he announced Tuesday. “I want to make Minnesota a place where everyone has a chance to succeed in every corner of the state,” Walz said in a video announcing his reelection plans. Walz, who leaped into the national [&#8230;]\n\n\nThe post Minnesota Gov. Tim Walz will run for a third term in 2026 appeared first on Roll Call.","url":"https://rollcall.com/2025/09/16/tim-walz-minnesota-governor-reelection/","image":"https://rollcall.com/app/uploads/2025/09/howard_harris_TW_636_110624.jpg","video":null,"publish_date":"2025-09-16 12:22:04","author":"Mary Ellen McIntire,Posted September 16, 2025 At 12:22pm","authors":["Mary Ellen McIntire","Posted September 16, 2025 At 12:22pm"],"language":"en","category":"politics","source_country":"US","sentiment":0.15},{"id":360930840,"title":"Donald Trump Files USD 15 Billion Defamation Lawsuit Against 'New York Times', Says ‘Publication Running Decades-Long Campaign of Lies’","text":"Washington, September 16: US President Donald Trump has announced that he is suing The New York Times, accusing the American daily of running a \"decades-long campaign of lies\" against him and serving as a \"virtual mouthpiece for the radical Left Democrat Party\". Trump said he is filing a $15 billion defamation and libel lawsuit against the publication, which he accused of systematically targeting him, his family, his businesses, and his political movement. In a statement posted on 'Truth Social' on Monday (US time), Trump wrote, \"Today, I have the Great Honor of bringing a 15 billion dollar Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the history of our country, becoming a virtual 'mouthpiece' for the radical left Democrat Party.\" ‘Worst and Most Degenerate Newspapers’: Donald Trump Announces USD 15 Billion Defamation Lawsuit Against New York Times. The Republican leader also attacked the newspaper's alleged endorsement of his Democratic rival Kamala Harris, claiming its placement on the front page amounted to \"the single largest illegal campaign contribution, ever.\" \"The 'Times' has engaged in a decades-long method of lying about your favourite President (me!), my family, business, the America First Movement, MAGA, and our nation as a whole,\" he said. Donald Trump Files USD 15 Billion Lawsuit Against New York Times \"I am proud to hold this once respected 'rag' responsible, as we are doing with the Fake News Networks such as our successful litigation against George Slopadopoulos/ABC/Disney, and 60 Minutes/CBS/Paramount, who knew that they were falsely 'smearing' me through a highly sophisticated system of document and visual alteration, which was, in effect, a malicious form of defamation, and thus, settled for record amounts,\" Trump stated. Donald Trump Says US-China Trade Meeting 'Gone Very Well', Hints at TikTok Deal Saying Deal Reached on 'Certain' Company That Young People in America Wanted To Save. Placing The New York Times' coverage in the same category as outlets like ABC and CBS, Trump alleged that these organisations had \"practised\" a long-term pattern of abuse. \"This is both unacceptable and illegal,\" he stated. \"The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, now! The suit is being brought in the Great State of Florida. Thank you for your attention to this matter,\" he added. The lawsuit against The New York Times comes on the heels of Trump's earlier legal actions against other major broadcasters. ABC News had previously settled a lawsuit with Trump by agreeing to make a $15 million donation to the planned Trump Library. That case involved disputes over the language used to describe his liability in the civil lawsuit brought by writer E. Jean Carroll. Similarly, Paramount, the parent company of CBS, settled a separate lawsuit with Trump over editorial decisions in a 2024 interview with Democratic leader Kamala Harris, agreeing to pay $16 million, also directed toward the Trump Library project.","summary":"US President Donald Trump has announced that he is suing The New York Times, accusing the American daily of running a 'decades-long campaign of lies' against him and serving as a 'virtual mouthpiece for the radical Left Democrat Party'. Trump said he is filing a USD 15 billion defamation and libel lawsuit against the publication.","url":"https://www.latestly.com/world/donald-trump-files-usd-15-billion-defamation-lawsuit-against-new-york-times-says-publication-running-decades-long-campaign-of-lies-7114284.html","image":"https://st1.latestly.com/wp-content/uploads/2025/06/TRUMP-23.jpg","video":null,"publish_date":"2025-09-16 11:23:29","author":"Ians","authors":["Ians"],"language":"en","category":"politics","source_country":"in","sentiment":0.273},{"id":360970774,"title":"Most degenerate newspaper: Trump slaps $15 billion defamation suit on New York Times","text":"US President Donald Trump has announced that he is suing The New York Times, accusing the American daily of running a \"decades-long campaign of lies\" against him and serving as a \"virtual mouthpiece for the radical Left Democrat Party\". Trump said he is filing a $15 billion defamation and libel lawsuit against the publication, which he accused of systematically targeting him, his family, his businesses, and his political movement. In a statement posted on 'Truth Social' on Monday (US time), Trump wrote, \"Today, I have the Great Honor of bringing a 15 billion dollar Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the history of our country, becoming a virtual 'mouthpiece' for the radical left Democrat Party.\" The Republican leader also attacked the newspaper's alleged endorsement of his Democratic rival Kamala Harris, claiming its placement on the front page amounted to \"the single largest illegal campaign contribution, ever.\" \"The 'Times' has engaged in a decades-long method of lying about your favourite President (me!), my family, business, the America First Movement, MAGA, and our nation as a whole,\" he said. \"I am proud to hold this once respected 'rag' responsible, as we are doing with the Fake News Networks such as our successful litigation against George Slopadopoulos/ABC/Disney, and 60 Minutes/CBS/Paramount, who knew that they were falsely 'smearing' me through a highly sophisticated system of document and visual alteration, which was, in effect, a malicious form of defamation, and thus, settled for record amounts,\" Trump stated. Placing The New York Times' coverage in the same category as outlets like ABC and CBS, Trump alleged that these organisations had \"practised\" a long-term pattern of abuse. \"This is both unacceptable and illegal,\" he stated. \"The New York Times has been allowed to freely lie, smear, and defame me for far too long, and that stops, now! The suit is being brought in the Great State of Florida. Thank you for your attention to this matter,\" he added. The lawsuit against The New York Times comes on the heels of Trump's earlier legal actions against other major broadcasters. ABC News had previously settled a lawsuit with Trump by agreeing to make a $15 million donation to the planned Trump Library. That case involved disputes over the language used to describe his liability in the civil lawsuit brought by writer E. Jean Carroll. Similarly, Paramount, the parent company of CBS, settled a separate lawsuit with Trump over editorial decisions in a 2024 interview with Democratic leader Kamala Harris, agreeing to pay $16 million, also directed toward the Trump Library project. (With inputs from IANS)","summary":"In a statement posted on 'Truth Social' on Monday (US time), Trump wrote, \"Today, I have the Great Honor of bringing a 15 billion dollar Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the history of our country, becoming a virtual 'mouthpiece' for the radical left Democrat Party.\"","url":"https://www.ibtimes.co.in/most-degenerate-newspaper-trump-slaps-15-billion-defamation-suit-new-york-times-888632","image":"https://data1.ibtimes.co.in/en/full/821603/most-degenerate-newspaper-trump-slaps-15-billion-defamation-suit-new-york-times.jpg","video":null,"publish_date":"2025-09-16 10:43:41","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.304},{"id":360961432,"title":"Chicago anchorman Bill Kurtis on his new book ‘Whirlwind’ and journalism’s crisis moment","text":"Bill Kurtis was a mainstay of Chicago’s television news landscape for decades, appearing at the anchor desk alongside Walter Jacobson on WBBM and nationally with Diane Sawyer on CBS Morning News.\n\nAs a broadcast journalist, he covered some of the 20th century’s most gruesome murder cases, from Charles Manson to Richard Speck, and broke landmark reporting on the use of Agent Orange during the Vietnam War. More recently, he has lent his signature deep voice to both Will Ferrell’s “Anchorman” and NPR’s weekly quiz show “Wait Wait...Don’t Tell Me!”\n\nBut his broadcast career almost didn’t happen at all. Kurtis, who turns 85 this month, recounts it all in his aptly titled memoir “Whirlwind,” which is out Tuesday from University Press of Kansas.\n\nIt all began the night Kurtis was on air during a tornado in his native Kansas. The young 20-something was still deciding between being a newsman or putting his law degree to work, having already accepted a job at a firm.\n\nBut that night, with a tornado on the horizon, Kurtis looked into the camera and said, with a bit of drama: “For God’s sake, take cover.” Just three months later, he was headed for a TV gig in Chicago, with his law career permanently in the rearview.\n\nNow, as Kurtis takes stock of his personal history, he says the journalism industry is at a crossroads. The parent company that owns his former professional home, CBS News, settled a $16 million lawsuit with President Donald Trump over the editing of a “60 Minutes” interview with former Vice President Kamala Harris during the 2024 presidential election. And in July, the network said it will cancel Stephen Colbert’s late night show next spring.\n\nIt’s all got Kurtis, a storied newsman, worried about where we go from here, he recently told WBEZ’s Courtney Kueppers. Below is a transcript of that conversation, which has been lightly edited for length and clarity.\n\nI understand the title “Whirlwind” has a bit of a double meaning — not only your whirlwind career but also a pivotal moment that launched you into broadcasting. Can you tell me about that moment in Topeka that inspired the book’s title?\n\nWhen I graduated from law school, I was 26 years old, and because I had a deep voice, I had worked at a series of part-time [broadcasting] jobs, even doing Little League baseball and experience with a classical music station. So, I had worked out my mic fright.\n\nA friend of mine happened to be a news director in Topeka and asked, “Can you fill in for me doing the 6 o’clock news?” I left a tax review class and was happy to do that. I did the 6 o’clock and the general manager came down and said, “Stick around. We have a cold front coming in from Manhattan [Kansas] and have reports of some high winds.”\n\nAt 7 o’clock, I’m on camera waiting to go on to give the all clear, because it’s always an all clear, there’s never a tornado, when all of a sudden, I heard a two-way radio from one of our cameramen on the western edge of the city and [it] said, “I’ve got a tornado on the ground. It’s huge.”\n\nHe said it’s wiped out [an] apartment complex. For me, that was truth zero. It’s time to go. The camera goes on. And a lot happened in the flash of time before I said those words, because I knew the next words that I would say would mean life or death for people, but I had to make it serious enough to convince them to go to the shelter, go to the basement. And so I said, “For God’s sake, take cover.” Five words would mean life and death to a lot of people, and it would mean the beginning of a 60-year career in broadcasting.\n\nI heard you say, I think referring to that evening, that “television done the right way could be a force for good.” Do you still feel that way? \n\nI do. I believe that it is. Journalists are individual and independent people who are dedicated to the search for truth. We’re professionals, like doctors and lawyers. We were written into the First Amendment, when they were writing the Constitution — they didn’t put doctors or lawyers in there, because they knew we were very important.\n\nYou did landmark reporting on the use of Agent Orange during the Vietnam War. You have said that that was the biggest story of your career. What are you most proud of in terms of that reporting?\n\nWell, with that reporting [for WBBM], it was really investigative reporting in which I was able to use my law degree. I was writing a story for the 10 o’clock news, and it was 12 names of veterans who were dealing with symptoms that couldn’t really be explained, and they were brushed off by [Veterans Affairs] and sent home. I started to interview them, and I knew at the time, in a flash, if this is true and if it really was caused by our own chemical and biological warfare, it would be a national, international story.\n\nBut there were 40 years of research that it was not harmful to human beings. Well, it may not have been harmful if you used it according to instructions, that’s always the out, so I had to prove that it was dangerous to human beings.\n\nI was interviewing a guy who had served in Pleiku [a city in central Vietnam] with Special Forces who said, “Yes, I was exposed. It was a white mist that came over the trees, and then we could see it dripping off the leaves. So, I was definitely exposed.” He was sitting in a living room, and his 5-year-old child came in and was standing with Daddy and put his hand on his knee, and it exposed a little tip of a finger that was hanging by the skin. And it was a congenital problem — a birth defect, exactly what we were trying to prove. It was that picture that was so powerful. It really told this story.\n\nToday — and this was a fight to get through — presumptive evidence applies to 20 to 50 types of cancer in which a veteran doesn’t even have to show that they were exposed. All they have to do is say “We served in Vietnam” and they are automatically in this line to be treated in the VA.\n\nThe guys come to me all the time and say, “Thank you. I’ve got prostate cancer, but you know, the VA helped me.” That’s why I say it was the high point in my career, because it combined law, investigative reporting and carrying it through, staying with it, as I believe journalism should do.\n\nAs someone who spent your career in television broadcasting, are you concerned about the rise of misinformation in this fractured media landscape?\n\nOh God, yes. We’re at the pivot point where the government is taking down our system of government, everything we know, piece by piece.\n\nI can’t speak for “60 Minutes,” but according to what I have heard, they settled the lawsuits so that CBS could sell itself, and what we have heard is that they wanted a bias monitor. So, for the first time that I have been aware in my whole career, a person from the government would review the stories that you are covering.\n\nThat kind of thing sends shivers up. We’ve been searching for the truth independently all these years. We’re not bad people, we’re professionals. So, I am scared.\n\nYou spent so much of your career at CBS, where there have been so many changes, not only at “60 Minutes” but the decision to cancel Colbert. What do you make of that?\n\nWell, they have an excuse, because they’re going to pull the show, and I can understand if they’re not making money, sure, you have to change. But it also carries a message. It’s a concession to Trump. He won.\n\nShifting gears a little bit, many of our listeners know your iconic voice from “Wait Wait... Don’t Tell Me!” Why was that something that you were interested in being a part of?\n\nPeter Sagal, the star of the show, and I were friends, and when Carl Kasell retired, they needed somebody to be their score keeper. I guess they wanted somebody from the news business.\n\nNews people do not do movies or comedy shows, and I had adhered to that all my life, but I said, “Oh, why not? I’ll fill in for a while.” So, I go on, and it’s a live show and there are audiences from 700 weekly to 8,000 we had at Tanglewood just a couple weeks ago. And I can tell you that one of the most satisfying things in the world is to get a laugh from 8,000 people. It doesn’t make me a comedian, it’s just fun. I’m retired, you know? Why not do these other things?\n\nYou do have, of course, this sort of instantly recognizable, famous voice. Do you do anything to maintain your voice?\n\nPeople are surprised at this: I don’t do anything, nothing. I mean, I was born with it. Now, I’ve worked since I was 16 until today, and that’s kind of an exercise — like pumping iron would be for somebody physically. Vocal cords are a muscle, and you have to use them in order to keep them flexible and in order to keep that voice. But I did, and without any other formal training or formal exercise, it’s been very good to me.\n\nCourtney Kueppers is an arts and culture reporter at WBEZ.","url":"https://chicago.suntimes.com/entertainment-culture/2025/09/16/bill-kurtis-chicago-anchorman-journalism-whirlwind-cbs-lawsuit-npr","image":"https://cst.brightspotcdn.com/dims4/default/6cd9e4b/2147483647/strip/false/crop/4580x3053+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fc0%2F3f%2Fed7be9dd4af8877f7eaa1b577aa7%2Fgardn","video":null,"publish_date":"2025-09-16 10:30:00","author":"Courtney Kueppers | WBEZ","authors":["Courtney Kueppers | WBEZ"],"language":"en","source_country":"us","sentiment":0.056},{"id":360908114,"title":"Trump sues New York Times for $15 billion for alleged \"defamation and libel\"","text":"President Trump is suing The New York Times for $15 billion for what he says in a post on his Truth Social platform is a years-long pattern of \"defamation and libel\" by the paper against him.Mr. Trump claims in the post that the Times \"has been allowed to freely lie, smear, and defame me for far too long, and that stops, NOW\" and accuses the Times of \"becoming a virtual 'mouthpiece' for the Radical Left Democrat Party.\"He says the Times \"has engaged in a decades long method of lying\" about him, his family and the Trump Organization as well as \"the America First Movement, MAGA, and our Nation as a whole.\"Specifically, the 85 page-long suit cites a book written by two Times reporters and three articles, all published during the 2024 presidential campaign.According to the suit, all were \"carefully crafted ... with actual malice, calculated to inflict maximum damage upon President Trump, and all published during the height of a Presidential Election.\" Defendants include the Times, reporters Susanne Craig and Russ Buettner, who wrote the book, and reporters Peter Baker and Michael Schmidt, who wrote the articles, along with Penguin Random House, the book's publisher.\"Lucky Loser: How Donald Trump Squandered His Father's Fortune and Created the Illusion of Success,\" published in September 2024, was \"false, malicious, and defamatory,\" the suit asserts.The suit goes on to cite a Times article by Craig and Buettner previewing the book, and articles by Baker and Schmidt.It also mentions the Times endorsement of Kamala Harris for president, an endorsement it calls \"deranged.\" The Truth Social post says it was \"actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF!\"The suit brings up settlements of other recent actions involving CBS News and Paramount, as well as ABC News.Mr. Trump also sued The Wall Street Journal and Rupert Murdoch for $10 billion in July over a story on his relationship with Jeffrey Epstein.CBS News has reached out to the Times and Penguin for comment. The suit was filed in U.S. District Court in Tampa, Florida.","summary":"President Trump is suing The New York Times for $15 billion for what he says is a years-long pattern of defamation and libel by the paper against him.","url":"https://www.cbsnews.com/news/trump-new-york-15-billion-alleged-defamation-libel/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/09/14/de174094-ca73-41d8-b114-dbf436275903/thumbnail/1200x630/7cd6b3581f675c57978ec00842dd3eba/gettyimages-2234215795.jpg","video":null,"publish_date":"2025-09-16 10:26:15","author":"Brian Dakss","authors":["Brian Dakss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.076},{"id":360911784,"title":"Trump Sues New York Times for $15 Billion Over Campaign Reporting","text":"President Donald Trump on Monday filed a federal defamation lawsuit against the New York Times, four of its reporters, and Penguin Random House regarding their coverage of his 2024 campaign.\n\nThe suit, which was filed in the U.S. District Court for the Middle District of Florida—where Trump resides outside the White House—alleged that the newspaper sought to damage his reputation as a businessman, undermine his campaign, and bias judges and juries against him with their coverage.\n\nThe reporters and defendants in the case include Susanne Craig, Russ Buettner, Peter Baker, and Michael S. Schmidt. Penguin Random House published Craig and Buettner’s book titled “Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success.”\n\nSchmidt, Craig and Baker have all spent time as analysts for MSNBC or NBC News.\n\nAccording to the lawsuit, the newspaper “continued spreading false and defamatory content about President Trump” and failed to acknowledge that he “secured the greatest personal and political achievement in American history” with his 2024 victory.\n\nThe suit singles out a New York Times editorial endorsing Democratic opponent Kamala Harris. \n\nThe suit claims that the [editorial] Board “asserted hypocritically and without evidence that President Trump would ‘defy the norms and dismantle the institutions that have made our country strong.'”\n\nAdditionally, it highlights three in-depth articles from 2024 by the newspaper’s reporters named in the filing, which challenged narratives about Trump’s success as a businessman, revisited past scandals, and analyzed his character as one that could potentially steer the Oval Office towards dictatorship.\n\n“Today, the Times is a full-throated mouthpiece for the Democrat Party,” the filing alleges. “The newspaper’s editorial routine is now one of industrial-scale defamation and libel against political opponents. As such, the Times has become a leading, and unapologetic purveyor of falsehoods against President Trump.”\n\nNeither the New York Times, Penguin Random House, nor the reporters named in the suit immediately responded to requests for comment early Tuesday. NBC News contacted MSNBC for comment.\n\nThe suit includes letters sent by Trump’s lawyers to the New York Times and Penguin Random House in October, along with responses from the two media organizations’ lawyers. The letter to the Times demanded it cease and desist from making “false and defamatory statements” about the president, while listing a litany of complaints about Times coverage.\n\nNewsroom lawyer David McCraw responded by defending the reporting in articles mentioned by Trump’s lawyers. \n\n“Little needs to be said about the rest of your letter, which is principally a litany of personal complaints about The New York Times and its reporters, punctuated with falsehoods and premised on the deeply troubling notion that anyone who dares to report unfavorable facts about a presidential candidate is engaged in “sabotage” (as opposed to, say, contributing to the free exchange of information and ideas that makes our democracy possible),” McCraw wrote, according to the letter attached to Monday’s suit. \n\nCarolyn K. Foley, Penguin Random House senior vice president and associate general counsel, responded to Trump lawyer Edward Andrew Paltzik: “The fact that the authors of the book do not share your favorable view of your client’s career, does not provide the foundation for a defamation claim.”\n\nMonday’s filing seeks no less than $15 billion in compensatory damages for the alleged defamation, as well as unspecified punitive damages.\n\nABC and Paramount, the parent company of CBS, have settled lawsuits brought by Trump and the president launched a new one against the Wall Street Journal and its ownership in July.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump on Monday filed a federal defamation lawsuit against the&#8230;\n\n\nThis Post: Trump Sues New York Times for $15 Billion Over Campaign Reporting first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-sues-new-york-times-for-15-billion-over-campaign-reporting/","image":"https://internewscast.com/wp-content/uploads/2025/09/Trump-files-15-billion-lawsuit-against-New-York-Times-over.jpg","video":null,"publish_date":"2025-09-16 10:14:51","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.353}]}