{"offset":0,"number":50,"available":393,"news":[{"id":361360706,"title":"Manchin recalls close ties with 'outsider' Trump, cold shoulder from Obama in new book","text":"Former Sen. Joe Manchin, I-W.Va., said he spoke more with President Donald Trump in the first two years of Trump’s term than with former President Barack Obama during Obama’s eight years in office. In his new book, \"Dead Center: In Defense of Common Sense,\" released this week, Manchin outlined a cordial working relationship with Trump and a far chillier, less active back and forth with Obama. Manchin, who switched from the Democratic Party to become an Independent before retiring from the Senate last year, wrote that he considered Trump a fellow \"outsider\" when he arrived in Washington, D.C., for his first term and lauded him as the \"most engaged president I ever worked with\" since former President Bill Clinton. MANCHIN SAYS HE WANTED GOP TO WIN SENATE TO STOP DEMOCRATS' QUEST FOR 'RAW POLITICAL POWER' \"From the start, President Trump had an open line of communication with me,\" he wrote. \"I spoke to him more in the first two years of his presidency than I did to President Obama during all eight years of his time in office.\" He noted, \"If you want to have influence with Donald Trump, you have to be the last person he talks to about a topic,\" and said he would jokingly ask that the president ensure he was the last person he called. \"He’d laugh, and we’d talk it out,\" he said. He recalled his 2018 election campaign in the wake of Trump’s dominant, 40-point win in the state. Trump told Manchin that he was being pressured to campaign against him and promised he wouldn’t. Ultimately, Trump visited the state five times, but Manchin still came out on top. JOE MANCHIN TELLS 'THE VIEW' WHY HE COULDN'T ENDORSE KAMALA HARRIS He was later invited to the Oval Office to meet with Trump, where, in front of then-Vice President Mike Pence and Ivanka Trump, the president \"blurted to his other guests, ‘I told you we couldn’t beat him,’\" Manchin wrote. Manchin's relationship with the former president goes back to his time as governor of West Virginia, when Obama was still a senator. The two worked together on a coal deal in Illinois that had previously excluded West Virginia. During the 2008 election cycle, he said he invited both then-Sen. Hillary Clinton, D-N.Y., and Obama to come to West Virginia to campaign, but said Obama shook off the invitation and told him, \"Let’s be honest with each other —- my demographics don’t work well in your state.\" NEW BOOK REVEALS WHAT OBAMA AND 'CONQUEROR' TRUMP CHATTED ABOUT IN VIRAL MOMENT DURING CARTER'S FUNERAL \"But he didn’t come, and that night belonged to Hillary,\" he wrote. \"She made the most of her visit and won the primary by 41 points.\" He said their relationship became even chillier when Obama launched his \"war on coal\" with a push for green initiatives that targeted fossil fuels and states like West Virginia. CLICK HERE TO GET THE FOX NEWS APP Manchin argued that the Democratic Party had grown dismissive and lost touch with the working class as a means to reshape their agenda through a progressive lens. That led to a seismic shift in West Virginia’s political alignment, from Democratic to now largely Republican, he said. And in the process that began when Obama won in 2008, he said that rural states like his felt \"overlooked and undervalued.\" \"But that’s exactly how Democrats handled West Virginia, and no one embodied that disconnect more than President Obama,\" he wrote. Fox News Digital reached out to Obama's office and the White House for comment but did not immediately hear back.","summary":"In his new memoir, former Sen. Joe Manchin, I-W.Va., blamed the policies of former President Barack Obama and the Democratic Party for shifting West Virginia from blue to red.","url":"https://www.foxnews.com/politics/manchin-recalls-close-ties-outsider-trump-cold-shoulder-from-obama-new-book","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/joe-manchin-donald-trump.jpg","video":"https://www.foxnews.com/video/6374092045112","publish_date":"2025-09-17 21:20:38","author":"Alex Miller","authors":["Alex Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.219},{"id":361370992,"title":"Jimmy Kimmel faces FEDERAL investigation after telling viewers Charlie Kirk suspect Tyler Robinson was MAGA","text":"Late-night host Jimmy Kimmel could be probed by federal investigators after telling his audience that Charlie Kirk's suspected killer was a MAGA supporter.\n\nFederal Communications Commission boss Brendan Carr told conservative podcaster Benny Johnson on Wednesday he was considering an investigation into Kimmel and his network ABC over remarks the host made about suspected shooter Tyler Robinson, 22, in the wake of Kirk's murder.\n\nProsecutors say the suspect - who was charged with killing Kirk at a university event in Orem, Utah - had leftist leanings.\n\n'When you look at the conduct that has taken place by Jimmy Kimmel, it appears to be some of the sickest conduct possible,' Carr told Johnson.\n\n'As you've indicated, there are avenues here for the FCC, so there... are some ways in which I need to be a little bit careful because we could be called ultimately to be a judge on some of these claims that come up.'\n\nKimmel's comments about Robinson came during his Monday night monologue.\n\n'We hit some new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and doing everything they can to score political points from it,' the host said. \n\nIn response to Kimmel's remarks, Carr floated the idea of suspending the host - one of several prospective 'remedies' for the situation, he said.\n\nAt one point, Johnson asked Carr what kind of action he thought should be taken, proposing an on-air apology from Kimmel.\n\n'I think what you said there strikes me as a very reasonable, minimal step that can be taken,' Carr replied. \n\nThe FCC chief also spoke about President Trump's approach to legacy media.\n\n'And one thing that President Trump did when he ran for office here is ran directly at that legacy media establishment,' Carr said.\n\n'He smashed a façade that they get to control what we say, what we think, the narrative around events.'\n\nCarr claimed that 'we're seeing a lot of consequences that are flowing from President Trump doing that.'\n\nHe brought up successful bids to defund both NPR and PBS, as well as the 'retirement' of Stephen Colbert, whose show has been cancelled by CBS.\n\n'Joy Reid is out at MSNBC. Terry Moran is gone from ABC and now admitting that they are biased,' Carr said.\n\n'CBS has now made some commitments to us that will return to more fact-based journalism. \n\n'So I think you see some lashing out from people like Kimmel, who are frankly talentless, and are looking for ways to get attention.'\n\nThe federal official's warning is likely to spook bosses at ABC, who settled with Trump for $16million last year after Good Morning America's George Stephanopoulos said on air that Trump had been found civilly liable for the rape of writer E. Jean Carroll.\n\nTrump had actually been found liable for sexually abusing Carroll during an encounter in a Manhattan department store dressing room in the mid-'90s.\n\nThe president also secured a $16million settlement from CBS News parent Paramount over a lawsuit the president filed accusing the network of 'deceptively' editing an interview with Kamala Harris.\n\nCarr was appointed to his position by Trump in November. The official previously served as a general counsel for the FCC and three terms as its commissioner. \n\nCarr has backed legislation that would punish social media companies that block or suspend users for certain 'viewpoints,' and also supported Trump's call for licenses to be stripped from the three major broadcast networks for coverage choices he deemed uncalled for.\n\nLast Wednesday, MSNBC fired political analyst Matthew Dowd for implying it was Kirk's 'hateful words' that got him killed.\n\n'Frankly, I think it's really sort of past time that a lot of these licensed broadcasters themselves push back on Comcast and Disney and say, \"Listen, we are going to... we're not going to run Kimmel anymore until you straighten this out,\"' Carr continued in his conversation with Johnson.\n\n'\"Because we, the licensed broadcaster, are running the possibility of fines or license revocation from the FCC if we continue to run content that ends up being a pattern of news distortion.\"'\n\n'So, I think - again - Disney needs to seem some change here, but the individual licensed stations that are taking their content, it's time for them to step up and say, you know, this garbage - to the extent that that's what comes down the pipe in the future - isn't something that we think serves the needs of our local communities.\n\n'But this sort of status quo is not acceptable, where we are.' \n\nRobinson, a Utah native raised by a conservative family, has been charged with capital murder and had his first court appearance Tuesday. \n\nIn a text to his roommate shortly after the murder, Robinson allegedly said of Kirk: 'I had enough of his hatred. Some hate can't be negotiated out.' \n\nIn another, Robinson discussed how his father 'has been pretty die-hard MAGA' since President Trump had been re-elected. \n\nOn NBC's Meet the Press on Sunday, Utah Governor Spencer Cox said that Robinson comes from a conservative family but that 'his ideology was very different than his family.'\n\n'Clearly there was a lot of gaming going on,' Cox said. 'Friends have confirmed that there was kind of that deep, dark internet, the Reddit culture, and these other dark places of the internet where this person was going deep.","summary":"News of a probe will likely spook Kimmel's bosses at ABC.","url":"https://www.dailymail.co.uk/media/article-15108601/Jimmy-Kimmel-charlie-kirk-tyler-robinson-brendan-carr.html","image":"https://i.dailymail.co.uk/1s/2025/09/17/20/102227843-0-image-m-7_1758135843105.jpg","video":null,"publish_date":"2025-09-17 21:01:11","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.007},{"id":361353676,"title":"JD Vance Says He Would Not Be VP If It Weren’t For Charlie Kirk","text":"Vice President J.D. Vance honored Turning Point USA founder Charlie Kirk’s legacy by saying on Wednesday that he would not be vice president without his activism.\n\nVance traveled to Howell, Michigan, to visit a precision metal stamping facility and “deliver remarks” on President Donald Trump’s tax cuts for working families and businesses. The vice president credited Kirk and Turning Point USA for “creating a movement” that made it possible for President Donald Trump and Vance to win the 2024 election.\n\n“We love these kids and we love the organization that was founded by Charlie Kirk. And I know I speak for all of the kids behind me, all of the great TPUSA members and also the alums that over the past ten years, Turning Point USA has not just been an organization, it has been the fountain of a movement all across the United States of America,” Vance said. “If you look at just the youth vote in 2024 and how much young voters shifted from Democrat to Republican from 2020 to 2024, Charlie Kirk created a movement and that movement made Donald J. Trump the President of the United States and it made me the Vice President of the United States. I would not be here without Charlie.” (RELATED: Glenn Beck Honors Charlie Kirk By Displaying Rush Limbaugh’s Golden Microphone While Guest Hosting His Show)\n\nWhile former Vice President Kamala Harris won the youth vote, every age group showed a notable shift toward Trump in the 2024 election in comparison to 2020. Among those ages 18 to 29, 56% of men and 40% of women voted for Trump, a jump from the 41% and 33% who supported the president in 2020, according to Tufts Now.\n\nVance organized for Kirk’s casket to be flown from Utah to Arizona on Air Force Two and guest hosted “The Charlie Kirk Show” on Monday. During the episode, Vance eviscerated the idea that political violence is a “both sides” issue and called for American conservatives to fight for their cause and against those who want to silence them.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Charlie Kirk created a movement'","url":"https://dailycaller.com/2025/09/17/jd-vance-charlie-kirk-turning-point-usa/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-17-at-2.54.55 PM-e1758135352475.png","video":null,"publish_date":"2025-09-17 19:08:15","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","source_country":"US","sentiment":0.082},{"id":361333508,"title":"Just what Democrats don't need: A new group telling them to surrender","text":"The Democratic Party has been floundering since former Vice President Kamala Harris lost the 2024 election against Donald Trump—and a new think tank is pushing to make things even worse for the party.\n\nThe group and its founder, former Democratic Party operative Adam Jentleson, were profiled in The New York Times on Wednesday. He said the Searchlight Institute said seeks to push the Democrats away from openly supporting human rights for LGBTQ+ Americans and to join Republicans in denying the reality of the science of climate change.\n\n“The folks who are most to blame about Trump are the ones who pushed Democrats to take indefensible positions,” Jentleson said. He also speciously claimed that the ACLU, which has defended human rights for decades and has pushed back on Republican’s abuses of immigrants, “did more to contribute to Trump’s victory than many conservative groups.”\n\nThe article noted that among the major donors who have given $10 million to Searchlight to move Democrats to the right are real estate investor Eric Laufer and hedge fund manager Stephen Mandel, both billionaires who would likely benefit from the party moving away from populist positions.\n\nJentleson’s posture that Democrats lost by being too wedded to progressive positions does not align with reality.\n\nRelated | 'Outrage and betrayal': House Democrats fume over Schumer's treachery\n\nFor instance, while under former President Joe Biden the Democratic Party was certainly more accepting of transgender Americans, the party still shied away from a full-throated defense of trans existence. During the 2024 party convention, transgender rights were barely even mentioned even though those rights were in the crosshairs for most of Trump’s first term.\n\nSimilarly, Democrats sounded more in line with conservative positions on immigration during the 2024 campaign, with extensive arguments in favor of “border security” and a pivot away from the Obama administration’s advocacy of a path to citizenship.\n\nTurning away from the party’s base on these and other issues is far more likely to have hurt Democrats in the election than the progressive shaming being embraced by the Searchlight Institute.\n\nA March poll from Navigator Research demonstrated the internal problem facing Democrats. Only 31% of people surveyed believe the Democrats are focused on “helping people like me” while 54% said they are focused on others. Democrats were also on the losing side of looking out for working people and valuing work.\n\nIt would not seem to make sense morally or politically to turn away from supporting key party constituencies among the LGBTQ+ or immigrant community based on that poor showing.\n\nIn fact, since Trump came back to the White House polling shows support for the party has improved when leaders pushed back against abuses, most notably attacks on migrants.\n\nThe biggest controversy within the Democratic caucus was the March decision by Senate Minority Leader Chuck Schumer to fund the Trump administration’s activities. Trump’s newly enabled agenda mirrored the one that Searchlight is now advocating for—and Americans, particularly the Democratic voters the party needs to survive, loathed it.\n\nIn reality, the progressive issues that Jentleson and Searchlight claim hurt Democrats were elevated to the point of caricature by outside elements.\n\nIt was mainstream news outlets like The New York Times that carried out a campaign of misinformation on transgender rights. The Times was joined by conservative propaganda outlets like Fox News in smearing transgender people, and instead of directly addressing the issue head-on, Democrats ignored it and hoped it would all go away. Republicans took advantage of this cowardice and spent millions to promote a false, unanswered narrative that paid electoral dividends.\n\nRelated | Wrongful deportation highlights Democratic split on how to fight Trump\n\nThe Searchlight remedy is to abandon this particularly vulnerable group of Americans, along with ignoring or downplaying other vital issues like climate change and immigration, ceding ground to right-wing extremism in the Republican Party.\n\nIn an ideal world the untold millions of dollars that Searchlight intends to use to pull Democrats to the right would probably be better spent on investing in a progressive media infrastructure. That would help inform the public of the importance of these issues and spotlight the Democrats who dare to stand up and do the right thing.\n\nOr the party could just become Republican-lite and lose more elections to the next iteration of Donald Trump and his ilk.","summary":"The Democratic Party has been floundering since former Vice President Kamala Harris lost the 2024 election against Donald Trump—and a new think tank is pushing to make things even worse for the party.\n\n\n\nThe group and its founder, former Democratic Party operative Adam Jentleson, were profiled in The New York Times on Wednesday. He said the Searchlight Institute said seeks to push the Democrats away from openly supporting human rights for LGBTQ+ Americans and to join Republicans in denying the reality of the science of climate change.\n\n\n\n“The folks who are most to blame about Trump are the ones who pushed Democrats to take indefensible positions,” Jentleson said. He also speciously claimed that the ACLU, which has defended human rights for decades and has pushed back on Republican’s abuses of immigrants, “did more to contribute to Trump’s victory than many conservative groups.”\n\n\n\nThe article noted that among the major donors who have given $10 million to Searchlight to move Democrats to the right are real es","url":"https://www.dailykos.com/story/2025/9/17/2344033/-Just-what-Democrats-don-t-need-A-new-group-telling-them-to-surrender?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1469306/story_image/AP25230640451378.jpg?1755615310","video":null,"publish_date":"2025-09-17 19:02:02","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.364},{"id":361319448,"title":" Cruz Blasts CNN’s Collins for ‘No Motive’ Misinformation","text":"By Eric Mack From Newsmax\n\nscreenshot Newsmax TV\n\nIn another example of leftist media seemingly attempting to cover for a radical left-winger’s “political assassination,” Sen. Ted Cruz, R-Texas, accused CNN’s Kaitlan Collins of spreading “misinformation” on claiming the Charlie Kirk investigation has revealed no motive.\n\n“You just said law enforcement has not laid out a motive: That is objectively false,” Cruz fired back at Collins. “That is objectively false.\n\nSpecial: Charlie Kirk Feared for Himself, Future of America, See More\n\n“What you are saying is objectively false, and CNN should not be engaged in misinformation.”\n\nCruz hearkened back to last week’s MSNBC analyst who was fired for making the erroneous claim that Kirk might have been killed by a gun-toting supporter who fired his gun off in celebration.\n\n“Of course we know,” Cruz said. “Come on. We don’t have a motive yet? Really? Really, that’s CNN’s position?\n\n“He just happened to fire the gun in celebration? You can’t tell the motive here?”\n\nCruz, who Harvard Law School professor emeritus Alan Dershowitz has called one of his “most brilliant students” in his half century teaching there, reminded the left-wing CNN host that law enforcement has publicly laid out the motive with evidence.\n\n“Actually, they have” laid out the motive, Cruz said. “They said he was a left-wing activist who hated Charlie Kirk.\n\n“Pardon?” Cruz said when Collins remained silent.\n\nCollins, repeating the “with all due respect” to the decorated legal expert, attempted to double down on the narrative, and Cruz had to again shoot back, “they have. That statement is false.”\n\n“You don’t want facts: Go ahead, give your speech,” Cruz said. \n\nAfter crosstalk, Cruz denounced the blaming of conservative speech for political assassinations by left-wing shooters that hate President Donald Trump and Kirk.\n\n“Anyone who engages in acts of violence should go to jail, but I will say there has been an enormous amount – and CNN has been guilty of this, or both-sides-ism – of saying, ‘Gosh, both sides are violent.’\n\n“And understand, yes, there is violence on both sides, but it is the left that overwhelmingly celebrates this.” \n\nCruz pointed to the left’s social media answer to X called Bluesky.\n\n“It is a cesspool of leftists celebrating the murder of Charlie Kirk,” Cruz lamented.\n\n“You look at recent polling that says over 50% of Democrats saying that violence against Elon Musk is justified, violence against Donald Trump is justified.”\n\nNotably, for years Democrats and former President Joe Biden has led with a campaign narrative that Trump is a “threat to democracy,” and his Democrat followers claiming Trump supporters are “fascists.”\n\n“This is a left-wing problem,” Cruz added.\n\nCollins attempted to equivocate with the assassination of a Democrat lawmaker, but Cruz had to remind her of the “fact” the “assassin there had been an appointee of Tim Walz,” the democrat governor who had joined Biden and former Vice President Kamala Harris in calling the right a “threat to democracy.”\n\nWalz, notably, also was criticized earlier this month for joking he had hoped to wake up to social media news that Trump had suddenly died.\n\n“Yes, there are crazed lunatics on the right and left, but if you look at murders committed for political agendas, they are overwhelmingly on the left,” Cruz told Collins, calling out the “disproportionate problem” and noting the celebratory “reaction.”\n\n“What I am not doing is what leftists are doing: Leftists are celebrating that murder,” Cruz said. “I think the murder in Minnesota was horrible.\n\n“You would have a point, if I said let’s set up a bail fund for that murder. Then you would have a point, but it’s only one side that’s doing that.”\n\nLatest: Get Charlie Kirk’s last published work, FREE Offer! See More Here\n\nEric Mack has been a writer and editor at Newsmax since 2016. He is a 1998 Syracuse University journalism graduate and a New York Press Association award-winning writer.\n\nRelated Stories:\n\nTrump: Biden Tried to Put Charlie Kirk ‘Out of Business’\n\nPatel: FBI Process Led Father to Turn In His Son\n\n© 2025 Newsmax. All rights reserved.\n\nFor more on this story go to: NEWSMAX","summary":"By Eric Mack    From Newsmax screenshot Newsmax TV In another example of leftist media seemingly attempting to cover for a radical left-winger&#8217;s &#8220;political assassination,&#8221; Sen. Ted Cruz, R-Texas, accused CNN&#8217;s Kaitlan Collins of spreading &#8220;misinformation&#8221; on claiming the&#160;Charlie Kirk investigation has revealed...\n\n\nThe post  Cruz Blasts CNN&#8217;s Collins for &#8216;No Motive&#8217; Misinformation appeared first on IEyeNews.","url":"https://www.ieyenews.com/cruz-blasts-cnns-collins-for-no-motive-misinformation/","image":"https://www.ieyenews.com/wp-content/uploads/2025/09/Screenshot-2025-09-17-at-1.45.28-PM.png","video":null,"publish_date":"2025-09-17 18:50:52","author":"ieyenews","authors":["ieyenews"],"language":"en","source_country":"ky","sentiment":-0.215},{"id":361326520,"title":"Trump's $15 Billion Lawsuit Against The New York Times Is His Craziest One Yet","text":"President Donald Trump is no stranger to filing defamation lawsuits against media companies, with varying degrees of merit. This week, he added to that list, filing a lawsuit more ridiculous and meritless than any of the others so far.\n\n\"Today, I have the Great Honor of bringing a $15 Billion Dollar Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country,\" Trump wrote Tuesday on Truth Social. \"The 'Times' has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole. I am PROUD to hold this once respected 'rag' responsible.\"\n\nThe complaint nominally lists claims about Trump, made during the 2024 campaign in Times articles and the book Lucky Loser, that have caused him \"reputational and economic harm\"—for example, that he inherited and squandered his father's fortune, and that he only rehabilitated his image as a successful businessman by hosting the reality show The Apprentice.\n\nBut rather than straightforwardly listing the facts of the case, the complaint spends dozens of pages histrionically detailing how great Trump is and how terrible The New York Times is. It reads less like a formal legal document than one of Trump's social media posts, calling the Times a \"full-throated mouthpiece of the Democrat Party\" engaging in \"wrong and partisan criticism.\"\n\n\"This lawsuit has no merit,\" the Times said in a statement. \"It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting.\"\n\nIn its very first statements of fact, the lawsuit brags that Trump \"won the 2024 Presidential Election over Vice President Kamala Harris in historic fashion, emerging victorious in both the Electoral College and the popular vote, and securing a resounding mandate from the American people,\" which it calls \"the greatest personal and political achievement in American history.\" It even includes a screenshot of the election results. (During his first term, Trump often passed out copies of the 2016 election map to visitors.)\n\nMuch of the complaint reads this way, like a breathless hagiography any attorney should be embarrassed to file. In a lawsuit nominally making the case that the country's most prestigious newspaper intentionally defamed Trump and harmed his reputation, the complaint lists more than two dozen of his film and TV credits. This is presented as proof that he had \"masterfully applied his eminence in real estate and business to worldwide publicity,\" which \"bolster[ed] his sterling reputation…as evidenced by his appearances and speaking parts in numerous well-known movies, television shows, and beauty pageants.\"\n\nTo the allegation that The Apprentice saved him irrelevance, Trump says it was the other way around. The filing counters that while the series was \"one of the top-rated shows of all time and a trailblazer in American television,\" its success was \"thanks solely to President Trump's sui generis charisma and unique business acumen….'The Apprentice' represented the cultural magnitude of President Trump's singular brilliance, which captured the zeitgeist of our time.\"\n\nAgain, this is presented as evidence that Trump is owed billions of dollars in restitution for being defamed by a newspaper.\n\nThe lawsuit seeks \"compensatory damages\" of at least $15 billion—suggesting Trump suffered at least that amount in harm or loss—plus unspecified punitive damages. It's hard to imagine he suffered any harm from the book or articles: For one thing, most of the claims were well-trod territory, but also, he won the election.\n\nTrump arrives at this number, deciding he has suffered $15 billion worth of harm, through some fanciful accounting. \"The value of President Trump's one-of-a-kind, unprecedented personal brand alone is reasonably estimated to be worth at over $100,000,000,000,\" the lawsuit claims, incredibly. (In May 2025, Bloomberg estimated Trump's net worth at $5.4 billion.)\n\nOf course, if the lawsuit survives a motion to dismiss, Trump is extremely unlikely to prevail on the merits. As a public figure, he faces a tougher hurdle to prove defamation. According to the U.S. Supreme Court's 1964 decision New York Times Co. v. Sullivan, defamation of a public figure requires proving \"actual malice.\"\n\nTrump's lawsuit tries to do this in a novel way. \"Defendants each desire for President Trump [to] fail politically and financially,\" it claims. \"Each feels actual malice towards President Trump in the colloquial sense….Put bluntly, Defendants baselessly hate President Trump in a deranged way.\"\n\nPoints for creativity, but that's not how any of this works. Sullivan defines actual malice as \"knowledge that statements are false or in reckless disregard of the truth.\" Even if what the reporters wrote was not true and actually hurt his reputation, Trump must prove either that they knew the information was false when they printed it, or that they were so careless with the truth that they should have known better. It has nothing to do with whether the speaker hates the person they're talking about. The complaint even seems to understand this, claiming the defendants showed malice \"in the colloquial sense\"—i.e., not in the legal sense.\n\nSince March 2024, Trump has sued ABC and CBS, extracting $15 million and $16 million settlements for similarly questionable allegations. More recently, he sued The Wall Street Journal for reporting on the existence of a birthday card he reportedly wrote in the early 2000s to Jeffrey Epstein, the financier later convicted of sex trafficking young girls. Trump called it a \"fake story\" and implied the note did not exist, though Democrats on the House Oversight Committee later released a copy purportedly obtained through a subpoena of Epstein's estate. That case is ongoing.\n\nAnd yet this latest lawsuit is somehow Trump's craziest one yet. Over 85 pages, the complaint makes little effort to quantify any actual harm to Trump's reputation, instead simply claiming he is the greatest man to ever walk the Earth and that any information to the contrary is not just inaccurate but malicious.\n\n\"The complaint is frivolous on its face, seeking to transform protected First Amendment speech—including investigative reporting about Trump's business practices, family wealth, and celebrity status—into actionable defamation claims,\" Katie Fallow, deputy litigation director of the Knight First Amendment Institute at Columbia University, said in a statement. \"The complaint is full of bluster but short on any allegations of specific false statements of fact that would meet the rigorous standards for defamation claims brought by public figures.\"\n\n\"Like Trump's numerous past (and ongoing) lawsuits, the complaint reads like a childish gripe about people being mean to him that arguably doesn't raise even barely plausible claims—let alone meet the exceedingly high bar the First Amendment erects to defamation claims from public figures like Trump,\" Ari Cohn, lead counsel for tech policy at the Foundation for Individual Rights and Expression (FIRE), told Reason in a statement. \"This lawsuit is yet another extortion racket, wrapped in a perverse, antidemocratic commodification of votes and political support as a form of damages. The courts will most likely see right through it, but as with all the president's legal endeavors, winning isn't the point—the process is the punishment.\"\n\nIndeed, winning these cases seems less important than inflicting pain on media companies Trump doesn't like.\n\n\"This humiliating settlement starkly illustrates how the powers of the presidency can be abused to punish news outlets for constitutionally protected speech,\" Reason's Jacob Sullum wrote after the Paramount settlement. \"It does not bode well for freedom of the press under a president who has no compunction about weaponizing the government against journalists who irk him.\"\n\nAnd just weeks later, Trump filed his most meritless case yet.","summary":"The complaint suggests the Times showed \"actual malice\" because its reporters hated him. That's not how that works.","url":"https://reason.com/2025/09/17/trumps-15-billion-lawsuit-against-the-new-york-times-is-his-craziest-one-yet/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/09/donald-trump-new-york-times-front-page.jpg","video":null,"publish_date":"2025-09-17 18:25:46","author":"Joe Lancaster","authors":["Joe Lancaster"],"language":"en","category":"politics","source_country":"us","sentiment":0.138},{"id":361313292,"title":"Fed approves quarter-point interest rate cut and sees two more coming this year","text":"Governors Michelle Bowman and Christopher Waller, looked at for possible additional dissents, both voted for the 25-basis point reduction. All were appointed by President Donald Trump, who has badgered the Fed all summer to cut not merely in its traditional quarter-point moves but to lower the fed funds rate quickly and aggressively.\n\nIn the post-meeting statement, the committee again characterized economic activity as having \"moderated\" but added language saying that \"job gains have slowed\" and noted that inflation \"has moved up and remains somewhat elevated.\" Lower job growth and higher inflation are in conflict with the Fed's twin goals of stable prices and full employment.\n\n \"Uncertainty about the economic outlook remains elevated\" the Fed statement said. \"The Committee is attentive to the risks to both sides of its dual mandate and judges that downside risks to employment have risen.\"\n\nMarkets showed mixed reaction to the developments, with the Dow Jones Industrial Average up more than 300 points but the S&P 500 and Nasdaq Composite posting losses. Treasury yields were modestly lower.\n\nAlong with the rate decision, officials in their closely watched \"dot plot\" of individual expectations pointed to two more cuts before the end of the year. The grid, however, showed a wide level of disparity, with one dot, possibly Miran's, pointing to a total of 1.25 percentage points in additional reductions this year.\n\nThe plot is done anonymously, with one dot for each meeting participant, but Miran has been an advocate for much lower rates. Nine of the 19 participants indicated just one more reduction this year, while 10 saw two, which would indicate moves at the October and December meetings. One official did not want any cuts, including Wednesday's.\n\n\"A majority of the FOMC is now targeting two further cuts this year, indicating that the doves on the committee are now in the driver's seat,\" said Simon Dangoor, head of fixed income macro strategies at Goldman Sachs Asset Management. \"We think it would take a significant upside surprise in inflation or labor market rebound to take the Fed off its current easing trajectory.\"\n\nThe plot indicated one cut in 2026, significantly slower than current market pricing of three. Traders had fully priced in this week's move. Officials also indicated another reduction in 2027, as the Fed approaches a long-run neutral rate of 3%. A half-dozen officials saw the long-run rate below the median neutral level.\n\nProjections released following the meeting on general economic conditions saw slightly faster economic growth than was projected in June, while the outlooks for unemployment and inflation were unchanged.\n\nA stunning level of political drama preceded the meeting, especially for an institution that generally does its business quietly and with few dissenting voices.\n\nA year ago, against similar worries that a gradual rise in the unemployment rate could be signaling broader weakness, the FOMC approved a jumbo half-point reduction that Trump has said was politically motivated to influence the presidential election in favor of his Democratic opponent, Kamala Harris.\n\nTrump's hectoring of the Fed and Miran's appointment have raised questions over the traditional independence the central bank has had from political influence. Miran also has openly criticized Chair Jerome Powell and his colleagues and is generally seen as a loyalist vote for the president and his desire for significantly lower rates.\n\nThe president has said lower rates are needed to bolster the moribund housing market and to reduce financing costs for government debt.\n\nThere was an additional layer of political intrigue this week as a court blocked Trump from removing Governor Lisa Cook, an appointee under former President Joe Biden. The White House has accused Cook of mortgage fraud involving federally backed loans she received for homes she purchased, though no charges have been brought.\n\nCook was among those who joined the majority in voting of the quarter-point cut.\n\nRecent signals have shown that economic growth remains solid and consumer spending topping forecasts, though the labor market has been a point of contention.\n\nOn the jobs front, the unemployment rate hit 4.3% in August, still relatively tame by historical standards but the highest since October 2021. Job creation has been stagnant this year, and a recent update from the Bureau of Labor Statistics showed that the economy created nearly a million fewer jobs than initially reported in the 12-month period prior to March 2025.\n\nGovernor Waller in particular has expressed concern that the Fed should ease policy now to head off future issues in the labor market. His name also has been in the mix as a potential replacement for Powell, whose term expires in May 2026.","summary":"The Federal Reserve on Wednesday released its decision on interest rates and updated its economic projections.","url":"https://www.cnbc.com/2025/09/17/fed-rate-decision-september-2025.html","image":"https://image.cnbcfm.com/api/v1/image/108199679-1758070078166-gettyimages-2227756775-_s010915_rrgvymua.jpeg?v=1758070207","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2025/M09D17/7000389128/1758132195-41692038117-hd_L.mp4","publish_date":"2025-09-17 18:25:11","author":"Jeff Cox","authors":["Jeff Cox"],"language":"en","source_country":"US","sentiment":-0.145},{"id":361384884,"title":"Trump: Biden Admin ‘Tried to Force Charlie, and Many Other People and Movements, Out of Business’","text":"President Donald Trump on Tuesday stated that the Biden administration and former special counsel Jack Smith targeted conservative groups including Charlie Kirk’s Turning Point USA, weaponized the Justice Department against political opponents, and allowed Judge Juan Merchan to preside over a trial against him despite what Trump described as a conflict of interest involving the judge’s daughter’s fundraising for Democrats.\n\nTrump wrote on Truth Social:\n\nWhy was the wonderful Turning Point under INVESTIGATION by “Deranged” Jack Smith and the Corrupt & Incompetent Biden Administration. They tried to force Charlie, and many other people and movements, out of business. They Weaponized the Justice Department against Sleepy Joe Biden’s Political Opponents, including ME! They allowed the daughter of a Judge, on one of the corrupt trials against me, to become the biggest fund raiser for Biden and Kamala, making many Millions of Dollars for herself and her family, but with her father, the Judge, not only refusing to RECUSE himself, but putting a gag order on me, not allowing ANY talk about their family corruption and unprecedented conflict of interest. Every leading legal analyst and pundit said this trial was wrong and should not have been allowed to go forward. But it did because of a Corrupt Judge who will hopefully pay a very big price for his illegal actions, someday!”\n\nTrump’s post followed findings from Sen. Chuck Grassley (R-IA) during a Senate Judiciary Committee hearing that the FBI investigated Turning Point USA, the conservative organization founded by Charlie Kirk, under a probe called “Arctic Frost.” Kirk was assassinated last week while speaking to students at Utah Valley University.\n\nGrassley pointed out that whistleblowers revealed the FBI expanded the case beyond election-related matters to include Republican organizations, the Republican National Committee, and 92 Republican-linked groups and individuals. He remarked that Arctic Frost “was the vehicle by which partisan FBI agents and Department of Justice prosecutors could achieve their partisan ends and improperly investigate the entire Republican political apparatus.”\n\nTrump also reiterated concerns he has raised since 2023 regarding Judge Merchan’s role in his New York case. As Breitbart News previously reported, Merchan’s daughter, Loren Merchan, is president and partner of Authentic Campaigns, a firm that has worked for Democratic candidates including President Joe Biden, Vice President Kamala Harris, and Rep. Adam Schiff (D-CA). Schiff, a client of Loren Merchan’s firm, used the guilty verdict against Trump in his business records case to raise campaign funds. Loren Merchan also was said to have an image of Trump behind bars as a social media profile picture, which was changed after being reported in 2024.\n\nJudge Merchan himself previously donated small amounts to Democrat groups, including Biden for President, Progressive Turnout Project, and Stop Republicans, according to Federal Election Commission records. Legal experts noted such contributions may violate New York’s judicial ethics code, though some contended the small amounts were trivial. Others, including former U.S. Attorney Brett Tolman, explained the donations and family connections created an appearance of conflict and should have prompted Merchan’s recusal.\n\nMerchan has presided over multiple Trump-related cases, including the Trump Organization’s tax fraud trial and the “hush money” case brought by Manhattan District Attorney Alvin Bragg. He imposed a gag order on Trump, restricting comments about witnesses, staff, and family members connected to the proceedings. Trump has argued the gag order violates his First Amendment rights, particularly given his claims that Loren Merchan has financially benefited from his cases.\n\nThe Justice Department’s former special counsel, Jack Smith, who oversaw two investigations into Trump during the Biden administration, is also under review by the U.S. Office of Special Counsel for possible Hatch Act violations related to alleged political activity during his prosecutions. Smith’s attorneys have denied wrongdoing, calling the probe “imaginary and unfounded.”","summary":"President Donald Trump on Tuesday stated that the Biden administration and former special counsel Jack Smith targeted conservative groups including Charlie Kirk’s Turning Point USA, weaponized the Justice Department against political opponents, and allowed Judge Juan Merchan to preside over a trial against him despite what Trump described as a conflict of interest involving the judge’s daughter’s fundraising for Democrats.\n\n\nThe post Trump: Biden Admin ‘Tried to Force Charlie, and Many Other People and Movements, Out of Business’ appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/17/trump-biden-admin-tried-to-force-charlie-and-many-other-people-and-movements-out-of-business/","image":"https://media.breitbart.com/media/2025/09/54234940558a62d51898e-640x335.jpg","video":null,"publish_date":"2025-09-17 18:17:09","author":"Charlie Kirk,Jasmyn Jordan","authors":["Charlie Kirk","Jasmyn Jordan"],"language":"en","source_country":"US","sentiment":-0.279},{"id":361316614,"title":"Ben & Jerry’s co-founder says ice cream brand’s activism is ‘silenced’ in resignation","text":"“What has made their work so important to me, and what allowed the company to be more than just an ice cream company, was the independence to pursue our values, which was guaranteed when Unilever bought the company,” Greenfield’s statement reads. “For more than twenty years under their ownership, Ben & Jerry’s stood up and spoke out in support of peace, justice, and human rights, not as abstract concepts, but in relation to real events happening in our world.”\n\n“That independence existed in no small part because of the unique merger agreement Ben and I negotiated with Unilever, one that enshrined our social mission and values in the company’s governance structure in perpetuity,” Greenfield said. “It’s profoundly disappointing to come to the conclusion that that independence, the very basis of our sale to Unilever, is gone.”\n\nGreenfield also said Ben & Jerry’s is being “silenced” out of “fear for upsetting those in power.” He concluded his statement by saying he would continue to work toward “equity, justice and a better world” outside Ben & Jerry’s.\n\nThe Washington Examiner contacted Unilever for comment.\n\nGreenfield and Cohen advocated former Vice President Kamala Harris’s 2024 campaign by introducing an ice cream flavor called “Kamala’s Coconut Jubilee,” a reference to her famous “fell out of a coconut tree” remark. The flavor was introduced under the Ben’s Best ice cream brand, which is not affiliated with the Ben & Jerry’s brand.\n\nCohen also went viral in May when he and several protesters disrupted a Senate hearing for Health and Human Services Secretary Robert F. Kennedy Jr. Cohen appeared to be shouting, “You’re killing poor kids in Gaza and paying for it by cutting Medicaid for kids here,” as Capitol Police escorted him out.","summary":"Ben &#38; Jerry’s co-founder Jerry Greenfield said Tuesday that he is splitting from the ice cream company, claiming that it is being “silenced” by its parent company, Unilever. Ben &#38; Jerry’s and its two co-founders are known for being vocal about current events and politics, such as advocating returning lands to native tribes and “gender-affirming [&#8230;]","url":"https://www.washingtonexaminer.com/news/business/3811650/ben-and-jerrys-activism-silenced-jerry-greenfield-resignation/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP25260449404515.jpg?w=696","video":null,"publish_date":"2025-09-17 17:57:58","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","source_country":"US","sentiment":0.171},{"id":361302404,"title":"Democrats Have Left the Planet","text":"As seen on Guteld!, Pete Buttigieg has now boldly stated that Kamala Harris should never have entered the presidential race! Meanwhile, the news of Charlie Kirk’s death raises questions about the Democrats’ grip on reality. Don’t miss out on Greg’s thrilling analysis!\n\nLearn more about your ad choices. Visit podcastchoices.com/adchoices","summary":"As seen on Guteld!, Pete Buttigieg has now boldly stated that Kamala Harris should never have entered the presidential race! Meanwhile, the news of Charlie Kirk&#8217;s death raises questions about the Democrats&#8217; grip on reality. Don&#8217;t miss out on Greg&#8217;s thrilling analysis! Learn more about your ad choices. Visit podcastchoices.com/adchoices","url":"https://radio.foxnews.com/2025/09/17/democrats-have-left-the-planet/","image":"https://static-radio.foxnews.com/radio.foxnews.com/content/uploads/2024/12/HEADER_BANNER_GUTFELD_MONOLOGUES.png","video":null,"publish_date":"2025-09-17 16:54:38","author":"FOX News Radio","authors":["FOX News Radio"],"language":"en","category":"politics","source_country":"us","sentiment":-0.666},{"id":361291850,"title":"Stephen A. Smith's staggering annual income revealed as ESPN star eyes political takeover","text":"Stephen A. Smith's money-spinning empire will expand once again on Wednesday night when his new politicial talkshow with Sirius XM launches.\n\n'Straight Shooter with Stephen A' sees Smith continue to position himself as a political commentator, an area where the man best known for his passionate sporting analysis is becoming more comfortable.\n\nAnd no wonder given how, if nothing else, is is proving extremely lucrative for the 57-year-old.\n\nAccording to a new report in The Athletic which coincides with the start of Smith's new show, the sports commentator is now raking in a whopping $40million-a-year from across three platforms.\n\nSmith, the report states, earns a base of around $33million that touches $40m once revenue from YouTube channel and podcast is taken into account.\n\nBack in March, Smith put pen to paper on a new five-year ESPN deal worth a staggering $105million. On top of that, the overall worth of his Sirius XM deal comes in at $36million across three years, The Athletic says.\n\nSpeaking in a debate with OutKick founder Clay Travis in New York this week, Smith joked that his life is 'really, really good' at present.\n\nBut his pivot towards political debate has seen speculation mount that he may one day make a run for the White House.\n\nIf he cares that much about his money, being the President will not appeal - he'd get paid $400,000-a-year to be in the Oval Office, as The Athletic points out.\n\nYet in his debate with Travis, Smith said people have repeatedly asked him to consider such a move. \n\n'I have no desire whatsoever to be a politician,' he said. 'But I've been asked by various people - including my pastor, including people in this business and others - to keep an open mind, because you never know what the state of affairs in this country will be in a couple of years.'\n\nSmith's next move with Sirius, placing him deeper in the political realm, is also interesting because, in increasingly partisan times, he appears very comfortable in tipping his hat to both parties.\n\nHe has often described himself as financially and economically Republican but voted for Kamala Harris at the last election.\n\nAnd he has praised Trump along the way in his second term as president as well as criticizing his predecessor, Joe Biden, for allowing the war between Russia and Ukraine to begin.\n\nAs ever with Smith, words are not in short supply when it comes to his views on everyday culture. Keeping them fresh across three different platforms that are paying him serious money might be his biggest battle in the coming years.","summary":"Stephen A. Smith's money-spinning empire will expand once again on Wednesday night when his new politicial talkshow with Sirius XM launches.","url":"https://www.dailymail.co.uk/sport/othersports/article-15108025/Stephen-Smiths-staggering-annual-income-ESPN-politics-takeover.html","image":"https://i.dailymail.co.uk/1s/2025/09/17/16/102222211-0-image-m-14_1758123160876.jpg","video":null,"publish_date":"2025-09-17 16:44:24","author":"Editor,Jack Bezants","authors":["Editor","Jack Bezants"],"language":"en","category":"politics","source_country":"gb","sentiment":0.445},{"id":361318014,"title":"Democrat Calls on His Party to Stop Calling Trump Supporters Nazis in the Wake of Charlie Kirk’s Death","text":"Sen. Dick Durbin, D-Ill., gave one concrete piece of advice for members of his party who truly seek to mend America’s divisions and turn down the temperature after the assassination of Turning Point USA Founder Charlie Kirk.\n\nKate Bolduan, a host of “CNN News Central,” noted on Tuesday that many Americans are engaging in “finger pointing” about whose rhetoric may be responsible for Kirk’s death. She asked Durbin about how America can “try to make this moment—a tragic moment—of positive change, through a lot of people calling [for] bringing the temperature down.”\n\n“Just looking inward rather than outward going forward, do you think Democrats, if you believe that Republicans have done this, do you think Democrats have also gone too far in some of their rhetoric in demonizing the other side?” she asked.\n\n“Absolutely,” Durbin, the second-highest ranking Democrat in the Senate, responded.\n\n“I mean, this notion that we’re going to characterize MAGA as Nazis, for example. On the other side, the Republicans would characterize the Democrats as the party of murder or evil—I mean, the outrage is coming from both sides and is unacceptable in both instances,” he responded. (MAGA refers to the “Make America Great Again” movement behind Trump.)\n\n“So yes, both sides can learn a lesson here, and the loss of Mr. Kirk is a good reason to do it,” Durbin added.\n\nIn his opening remarks at a Senate hearing Tuesday, Durbin attacked FBI Director Kash Patel for previously calling Democrats evil.\n\n“Let’s be clear: Republicans are not Nazis and Democrats are not ‘evil,’ as Mr. Patel has claimed,” Durbin said. “Democrats are not responsible for the murder of Charlie Kirk, as Republicans were not responsible for the murder of [Minnesota Democrat state legislator] Melissa Hortman. Our political opponents are not our enemies. We are all Americans. And we should be working together to keep the American people safe and protect their constitutional rights.”\n\nCalling MAGA Nazis\n\nDemocrats and left-leaning media figures have repeatedly compared President Trump to Adolf Hitler and his supporters to members of Hitler’s National Socialist Party.\n\nThen-Vice President Kamala Harris’ presidential campaign compared Trump to Hitler in a post on X. \n\nIn June 2019, Rep. Alexandria Ocasio-Cortez, D-N.Y., accused Trump’s first administration of running “concentration camps” along the U.S.-Mexico border. She used the term “never again,” suggesting a comparison between migrant detention facilities and the Holocaust. \n\nShe defended her use of that language, saying, “I don’t use those words lightly. … A presidency that creates concentration camps is fascist and it’s very difficult to say that.” \n\nEarlier this year, Gov. JB Pritzker, D-Ill., compared the Trump administration to the Nazis, saying the administration uses a similar “authoritarian playbook.” Pritzker recently said, “I have never called Republicans ‘Nazis.'”\n\nA Michigan Democratic Party county chairman called Trump’s second inauguration in January a “Nazi rally.” When asked about Trump’s supporters, Bill Swift said, “You support and uphold the president and the GOP party that openly put Nazism on display and cheered that Nazism at the heart and center of our republic. You have made your stand. You stand with Nazis. We don’t owe you respect.”\n\nThen-CNN host Don Lemon compared Trump supporters to both Nazis and the Ku Klux Klan in 2021. In December 2023, MSNBC host Rachel Maddow compared Trump to both Hitler and Italian dictator Benito Mussolini.\n\n‘The Party of Murder’\n\nFollowing Kirk’s assassination, Tesla CEO Elon Musk stated Sunday, “The Left is the party of murder.”\n\n“You see how much violence there’s on the Left, with our friend Charlie Kirk getting murdered in cold blood this week, and people on the Left celebrating it openly,” he said.\n\nRep. Marjorie Taylor Greene, R-Ga., called the Democratic Party “flat out evil” following the assassination attempt against then-former President Trump.\n\n“We are in a battle between GOOD and EVIL,” she posted in July 2024. “The Democrats are the party of pedophiles, murdering the innocent unborn, violence, and bloody, meaningless, wars.”\n\nRepublicans in Connecticut are demanding the resignation of Fairfield Town Committee Representative Melissa Longo after she called Democrats “faithless, God hating evil, vile people.” Longo refused to resign, accusing her fellow Republicans of “cowardice” and hypocrisy. \n\nDurbin’s Past Comparison to Nazis\n\nIn 2005, Durbin apologized after comparing American interrogators at the Guantanamo Bay prison camp to Nazis. \n\nDurbin announced in April that he will not be running for reelection.","summary":"Sen. Dick Durbin, D-Ill., gave one concrete piece of advice for members of his party who truly seek to mend America&#8217;s divisions and turn down... Read More\n\n\nThe post Democrat Calls on His Party to Stop Calling Trump Supporters Nazis in the Wake of Charlie Kirk&#8217;s Death appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/17/democrat-calls-his-party-stop-calling-trump-supporters-nazis-wake-charlie-kirks-death/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/Dick-Durbin.jpg","video":null,"publish_date":"2025-09-17 16:17:31","author":"Tyler O'Neil","authors":["Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":-0.325},{"id":361311680,"title":"Republican who defied Trump over 2020 election results launches battleground state governor bid","text":"Georgia Secretary of State Brad Raffensperger, who rejected a push by President Donald Trump to overturn the 2020 presidential election results in the key southeastern battleground state, launched a 2026 Republican bid for governor. Raffensperger's announcement on Wednesday adds more drama to an already combustible GOP gubernatorial primary between Lt. Gov. Burt Jones and state Attorney General Chris Carr. And while Raffensperger has a long track record as a conservative Republican, he'll likely once again face the scorn of Trump, who last month endorsed Jones for governor. \"I’m a conservative Republican, and I’m prepared to make the tough decisions. I follow the law and the Constitution, and I’ll always do the right thing for Georgia no matter what,\" Raffensperger said in a campaign launch video. \"As governor, I'll deliver a bold conservative agenda, and build Georgia even stronger.\" REPUBLICAN-TURNED-DEMOCRAT LAUNCHES GEORGIA GOVERNOR BID Raffensperger's agenda includes a push to eliminate the state income tax, capping property taxes for seniors, repealing taxes and fees on closing costs for homebuyers, expanding tax credits for parental school choice, banning drugs that block puberty from gender-affirming care and purging \"woke curriculums\" from schools. A statement from his campaign also highlighted that Raffensperger pledged \"to work alongside President Donald Trump and congressional leaders to bring jobs back to Georgia, deport criminal aliens, and restore law and order in communities across the state.\" The now-70-year-old engineering entrepreneur, along with Republican Gov. Brian Kemp, refused to aid Trump as the president tried to reverse now-former President Joe Biden's razor-thin 2020 election victory in Georgia. THE MOST VULNERABLE REPUBLICAN GOVERNOR IN 2026 LAUNCHES RE-ELECTION BID Trump appeared to pressure Raffensperger in an early January 2020 call when the president urged Raffensperger to \"find\" enough votes to upend Biden's victory. Raffensperger told Trump at the time that his data was wrong and that \"we believe our numbers are right.\" That earned Trump's scorn, and he backed Republican primary challenges against Kemp and Raffensperger when they both ran for re-election in 2022. But Kemp and Raffensperger ended up easily defeating the Trump-supported primary challengers en route to general election victories. The Democratic Governors Association's Kevin Donohoe, pointing to Raffensperger's 2026 campaign launch, argued that it \"injects a new level of chaos into what was already a messy primary — and is bad news for Burt Jones and Chris Carr.\" Raffensperger's announcement came the day after former Republican Lt. Gov. Geoff Duncan launched a Democratic campaign for Georgia governor, in the race to succeed Kemp, who is term-limited. Duncan, who as lieutenant governor was also a vocal GOP critic of Trump's repeated efforts to overturn his 2020 loss in Georgia, decided against seeking re-election in 2022. Duncan endorsed Biden in the 2024 presidential race and later supported then-Vice President Kamala Harris after she replaced Biden at the top of the Democrats' 2024 ticket. Duncan spoke in a high-profile speech at the Democratic National Convention in Chicago last summer. Earlier this summer he announced he had switched parties and become a Democrat. CLICK HERE TO GET THE FOX NEWS APP Duncan joined a Democratic primary field that already includes former Atlanta Mayor Keisha Lance Bottoms, former DeKalb County CEO Mike Thurmond and former State Sen. Jason Esteves. While Georgia was once right-leaning, it has become a key general election battleground. But Republicans have won every gubernatorial contest in the state since 2002.","summary":"Georgia&apos;s Raffensperger announces governor bid with conservative agenda including eliminating state income tax while facing Trump-endorsed opposition.","url":"https://www.foxnews.com/politics/republican-who-defied-trump-over-2020-election-results-launches-battleground-state-governor-bid","image":"https://static.foxnews.com/foxnews.com/content/uploads/2022/11/Brad-Raffensperger-2.jpg","video":"https://www.foxnews.com/video/6376698023112","publish_date":"2025-09-17 16:12:36","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":-0.438},{"id":361300678,"title":"Tennessee's governor welcomed the National Guard. Illinois' JB Pritzker is a hard no.","text":"President Trump on Monday said he intended to send National Guard troops to Memphis as part of what he says is an attack on crime. Trump added that he still hopes to send troops to Chicago, though it's unclear how he legally can do so. The news gives fresh relevance to our recent interview with Illinois Gov. JB Pritzker, who has declined to ask for the military.\n\nThis interview with Pritzker was an opportunity to see him respond to an immigration enforcement surge in Chicago — and to hear from one of the governors who is thinking of a run for president.\n\nDemocrats have talked of Pritzker as a possible candidate at least since 2022-2023, when he was seen as a possible alternative to President Biden, should Biden drop out. Pritzker was a governor of a big state, and also a billionaire, which would make it possible for him to jump-start the financing for a campaign.\n\n\"Oh, I had no aim or desire. I didn't take it seriously, other than I'm flattered,\" he told me. When Biden at last did drop out in 2024, it was too late for a primary and Pritzker supported Kamala Harris, the president's choice.\n\nWill the 2028 campaign be different? Pritzker hasn't said, but indicated that he feels ready. \"There are things that governors will learn in their executive functions and things that I came into office understanding, having executive positions in the private sector, that are very helpful in running any kind of organization, especially the largest organization that exists in the United States.\"\n\nHe's one of several governors — along with California's Gavin Newsom, Michigan's Gretchen Whitmer, and Kentucky's Andy Beshear — who may see an opening. Democrats and Republicans alike will be scanning interviews like ours for relevant information.","summary":"Trump on Monday said he planned to send National Guard troops to Memphis. The news gives fresh relevance to NPR's recent interview with Illinois Gov. JB Pritzker, who declined to ask for the military.","url":"https://www.npr.org/2025/09/17/g-s1-89190/jb-pritzker-tenessee-memphis-national-guard","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1440x1080+480+0/resize/1440x1080!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fcc%2Fcd%2Fd0e2ddf84a5581f03aa441ae5a1d%2Fthumbnail-me-buttigieg-copy.png","video":null,"publish_date":"2025-09-17 15:43:16","author":"Steve Inskeep","authors":["Steve Inskeep"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129},{"id":361321190,"title":"Taylor Swift 'Terrified' of Charlie Kirk 'Retaliation' Attack Against Her Amid Claims She Hid Behind Bullet Proof Screen After Receiving 'Legitimate Threats'","text":"Taylor Swift is \"terrified\" of being targeted in a Charlie Kirk revenge attack, according to new claims.\n\nRadarOnline.com can reveal the music superstar has been the subject of \"legitimate threats\" in wake of the MAGA influencer's murder, which sparked extra security measures put in the place when the star attended fiancé Travis Kelce’s NFL opener last weekend.Safety ConcernsVideo footage, which went viral, saw a bullet proof wall erected to guard Swift as she made her way to her seat for the game.\n\nThe secrecy behind her appearance sparked a frenzy among her fanbase, with many of her followers believing age was attempting to hide a baby bump.\n\nHowever, insiders claim there was a more sinister reason behind the wall.\n\nA source told the Daily Mail: \"They used the screen to keep her safe. \n\n\"They have used that screen before, but usually it is for the President or someone like that, not a celebrity. But this was a weird week.\"Screen ProtectorConservative activist Kirk, 31, was assassinated by a gunman last Wednesday while speaking at Utah Valley University.\n\nMeanwhile, Swift is a known liberal who has backed the last two Democratic Party candidates, in the 2020 and 2024 presidential elections.\n\nKirk even spoke about Swift a fornight before his death, remarking on her recent engagement to tight end Kelce, 35. \n\n\"This is something that I hope will make Taylor Swift more conservative,\" he said, before adding that the singer should \"submit\" to her future husband.\n\nKirk also controversially said the sportsman could \"de-radicalize\" Swift from being \"a cat lady to a J.D. Vance supporter.\"Kirk JibesFor her part, Swift is said to have been left in shock at Kirk's very public assassination. And it is that trauma, coupled with her ongoing issues of stalking, that has meant those around her are not 'taking any chances' when it comes to safety.\n\nAnother insider added: \"Taylor had concerns because she has received hate mail from the same kinds of extreme group. \n\n\"Charlie's murder, and the weirdness with her stalkers, is why she will take serious measures to increase her security and only a core group of people know what her schedule is.\"She was targeted by far-right extremist groups after going against Donald Trump (by endorsing Kamala Harris) and there are legitimate concerns about some of the threats that have been made. They aren't taking any chances.\"\n\nIn August last year, Swift found herself the target of a foiled terror attack in Vienna, Austria, and was forced to cancel three of her Eras world tour dates in the capital. She later said the incident filled her with a \"new sense of fear.\"It came days after three young girls were tragically knifed to death while at a Taylor Swift-themed dance class in Southport, England.\n\nThe incidents have understandably left Swift on high alert, with the singer previously revealing that she always carries QuikClot – army grade bandage dressing – \"for gunshot or stab wounds.\"\n\n\"You get enough stalkers trying to break into your house and you kind of start prepping for bad things,\" she said in 2019.","summary":"Taylor Swift is 'terrified' being targeted in a Charlie Kirk revenge attack according to new claims and is not 'taking any chances' when it comes to her safety.","url":"https://radaronline.com/p/taylor-swift-terrified-charlie-kirk-retaliation-attack-bullet-proof-screen-threats/","image":"https://media.radaronline.com/brand-img/kgNKVWoza/0x0/1-1758105574067.jpg","video":null,"publish_date":"2025-09-17 15:43:16","author":"Mike Boyce","authors":["Mike Boyce"],"language":"en","source_country":"us","sentiment":-0.065},{"id":361353830,"title":"Charlie Kirk and the failure of online moderation","text":"The murder of the right-wing influencer Charlie Kirk highlighted the extent to which social media companies are failing in their supposed commitment to monitor content. Graphic, close-up videos of the shooting swamped platforms within moments of the killing, including in X’s “For You” feeds curated for users by the algorithm. TikTok and BlueSky took down the most graphic of videos, while Meta spent days trying to catch up with the volume of content, adding warning labels to some videos. Many remained on X and YouTube.\n\nPlatforms are scaling back moderation in the name of protecting free speech – all as Vice-President JD Vance’s commitment to free speech wobbled somewhat as he encouraged Americans to report colleagues celebrating the death of Kirk.\n\nIt’s good to see GB News presenter Bev Turner settling in so well with the cranks and conspiracy theorists Stateside.\n\nTurner, the broadcaster’s new US correspondent, who has almost a quarter of a million followers on X, was quick to share a post naming the “prime suspect” in the killing of Kirk. Except they weren’t the suspect – it was just another conspiracy theory circulating on 4chan. And still, Turner’s influence grows…\n\nLA Times owner Patrick Soon-Shiong enraged his staff and lost thousands of subscribers when he forced editors to withdraw the paper’s endorsement of Kamala Harris ahead of last year’s US election. He has also killed a column critical of Trump, claiming he wants to make the title more “balanced”. But now the LA Times is facing competition from a new proudly partisan left-wing online outlet, Drop Site, which has been gaining a huge following for its coverage of the war in Gaza. Its publisher? Soon-Shiong’s daughter, Nika.\n\nA group of BBC staff are planning to write to director-general Tim Davie calling for a boycott of the Eurovision Song Contest if Israel is allowed to take part next summer. Spain has already voted to boycott the event; Ireland and the Netherlands have threatened a similar move. Staff shared concerns after Davie told the Public Accounts Committee the BBC would “work with” the contest’s organisers “on the issue”: “Eurovision has never been about politics; it should be a celebration of music and culture that brings people together,” he said. One angry employee told me: “Eurovision is supposed to be about the coming together of nations for fun. To have Israel there would be wholly wrong as its horrendous war on Gaza continues.”\n\nCould Lady Rothschild be looking at selling her stake in the Economist to join in the consortium still trying to buy the Daily Telegraph? The businesswoman is looking to sell her 20 per cent stake in the magazine for a possible £400m. Last year Rothschild and her partner, Lord Saatchi, put together a bid for the Telegraph, but refused to pitch in at the inflated asking price of £500m. The sale of the paper limps forward, but leaders RedBird are believed to still be looking for additional investment.\n\nA string of insider secrets about palace life have ended up in the Sun, the Times, the Mirror, Daily Mail and Daily Express over the past year, including Kate’s fondness for Moroccan argan oil and the King’s dislike of scented candles. The source? “Royal cleaner” Anne Simmons. Now investigative reporter Rob Waugh has revealed no one has heard of her; it seems the source of the stories is a public relations firm.\n\nSnout line: Got a story? Write to tips@newstatesman.co.uk","summary":"Your weekly dose of news and gossip from journalism, broadcasting and beyond.","url":"https://www.newstatesman.com/politics/media/2025/09/charlie-kirk-and-the-failure-of-online-moderation","image":"https://dl6pgk4f88hky.cloudfront.net/2025/09/17/00031918.jpg","video":null,"publish_date":"2025-09-17 15:41:57","author":"Alison Phillips","authors":["Alison Phillips"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.018},{"id":361269420,"title":"‘We Disenfranchised Ourselves’: Stephen A. Smith Laments Black Voters’ Blind Loyalty To Dems","text":"ESPN’s Stephen A. Smith bemoaned black voters’ unconditional loyalty to the Democratic Party during the Front Office Sports Tuned In Summit Tuesday, arguing it disempowers them.\n\nPresident Donald Trump received 13% of the black vote in November, including 21% of men and 7% of women, according to a CNN exit poll. During a debate livestreamed on Front Office Sports’ YouTube channel about Trump’s increased support among black men, Smith asserted that both parties make more of an effort to attract Latino voters than black voters because they are not loyal to one party. (RELATED: ‘Never Seen Anything Like This’: Crucial Voter Groups Fleeing Democrats, Says Stunned Fmr Clinton Pollster)\n\n“[S]ince 1964, when [former President] Lyndon B. Johnson told the world, ‘You know what? When we pass civil rights legislation, okay, guess what? We’ll have the Negroes voting for us for the next 200 years.’ And sure enough, over the past 60 years or so, a vast majority of African-Americans have voted Democrat,” Smith said. “We know that if we’re doing our homework, we serve to disenfranchise ourselves, because we told the Democratic Party, ‘You got our vote no matter what.’ We told the Republicans, ‘You ain’t getting our vote no matter what.'”\n\n“Neither was incentivized to really put forth an effort to give us the representation we deserved. And as a result, we disenfranchised ourselves. But we’re not seeing it that way. You got migrants coming to this country that clearly see it that way,” he continued. “Look at the Hispanic population. You got Mexicans, Puerto Ricans, Guatemalans, everybody, Cubans, everything. And you don’t know who’s going to vote what. So guess what? Both sides are trying to appeal to them, which means they’re not being ignored. That’s the game. And unfortunately, we as a black community lost our way in that regard.”\n\nSmith said earlier in the debate that black men prioritize the economy and safety and accused liberals of being lenient on crime. He also criticized Democrats for letting in millions of illegal immigrants.\n\n“[W]hen you’re looking at those certain situations, and these are the kind of things that the liberal movement was promoting, oblivious to the — or not caring enough about — the ultimate detrimental impact it would have, there were people that rose up and said, ‘Enough of this,'” he said.\n\nHe further argued that black men voting for Trump in 2024 was a “huge step.”\n\nMoreover, Smith said on on NewsNation’s “CUOMO” in May that he was pleased with Trump’s 2024 election victory because he believed the Democratic Party has long manipulated black voters.\n\n“I think, for the longest time, black Americans have played the role of suckers to the Democratic Party,” Smith said. “They’ve guilted us into voting for them, making us feel as if we’re going to be ostracized, creating division within our own communities or what have you to get our vote, instead of saying to us, ‘Hey, this is what we will do for you. And it will work better than what they’re offering.’”\n\nFormer Vice President Kamala Harris garnered 77% of the black male vote in 2024, compared to 79% for Joe Biden in 2020 and 82% for Hillary Clinton in 2016, according to CNN exit polls. All three Democratic candidates received at least 90% of the black female vote.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Lost our way'","url":"https://dailycaller.com/2025/09/17/we-disenfranchised-ourselves-stephen-a-smith-laments-black-voters-blind-loyalty-to-dems/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-17-9.13.49-AM-e1758114864317.png","video":null,"publish_date":"2025-09-17 14:15:04","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","source_country":"US","sentiment":-0.119},{"id":361222850,"title":"Trump’s DC Crime Success Puts Spotlight on Chicago’s Deadly ‘War Zone’","text":"President Donald Trump’s focus on crime across America is timely and necessary. It’s epidemic in many blue cities in our country, and something must, and can, be done about it. His crackdown in Washington, D.C., proves that dramatic reductions in crime in cities acclimatized to perpetual lawlessness and violence are possible, but only if you have the political courage to do so.\n\nNext up is Chicago, another city plagued by non-stop violent crime. Trump’s focus there has forced local leaders to defend their lax policies and deny the reality of rampant crime in their cities—claims that ring hollow to terrorized local residents.\n\nBefore exposing the crime rates in Chicago and the lax policies that have caused them, let’s look at the results of the D.C. crime crackdown.\n\nIn Washington, D.C., since the operation began on Aug. 7, arrests are up, homicides are down nearly 60%, and violent crime has decreased by 17%. In one two-week stretch, there wasn’t one homicide, which is, sadly, remarkable.\n\nDespite this impressive decline, more effort is needed. There have been 106 homicides, 984 reported robberies, and 3,157 car thefts this year alone. Those numbers are unacceptable in any city, especially the nation’s capital.\n\nLax local laws passed by the D.C. City Council and local judges who give criminals a pass every day are major contributors to the city’s culture of violence. To fix these gaps, Congress is considering several proposals to fix the criminal justice system in D.C. permanently.\n\nAs a developer who owns property in Chicago, Trump is quite familiar with the chronic crime carnage in the Windy City. The numbers speak for themselves, despite what Gov. JB Pritzker and Mayor Brandon Johnson declare.\n\nTo put this carnage into perspective, between 2003 and 2010, 3,481 Americans were killed in action in Iraq, an average of 435 a year. In the war in Afghanistan, between 2001 and 2014, 1,833 Americans were killed in action, an average of 141 per year. In Chicago, between 2017 and 2024, there were 5,220 homicides, an average of 652 per year. Chicago is a war zone, pure and simple.\n\nLike in most big blue cities across America, there is a stark difference in crime rates between the richest and poorest parts of town. White liberal elites in the safest parts of town are oblivious to, or at least immune from, the constant drumbeat of violent crime in their own city. Chicago is a perfect example.\n\nDistrict 3, which includes Hyde Park and Washington Park, had a homicide rate of 80.68 per 100,000 residents, according to 2024 Chicago Police Department data. District 6 (Englewood, Roseland, Woodlawn) had a rate of 73.43 per 100,000 residents. And District 11 (Humboldt Park, West Garfield Park, Near West Side) had a homicide rate of 72.86 per 100,000 residents.\n\nCompare those killing fields to Jefferson Park (1.97), Lincoln Square (2.29), and Uptown (3.27)—home to doctors, lawyers, venture capitalists, and other professionals. Not surprisingly, liberal elites who live in those areas tend to be the ones who complain the loudest when Trump engages in increased federal enforcement, including offering much-needed assistance to state and local officials.\n\nIt’s also no coincidence that the first George Soros-backed “progressive” prosecutor, Kim Foxx, was in Chicago. As I detailed in my book, Foxx was hoisted from obscurity into office in 2017 with almost $700,000 of Soros-connected financial support. Foxx unleashed a tsunami of pro-criminal, anti-victim, anti-business policies on the city as its top prosecutor, causing a dramatic increase in violent crime.\n\nIn the six years prior to that, there was an average of 510 homicides per year (2011—2016). In the three years before Foxx was elected, 4,460 rapes were reported to the police, an average of 1,486 per year. During Foxx’s tenure (2017—2022), 10,789 rapes were reported to the police, an average of 1,804 per year.\n\nTwo weeks into the job, Foxx announced that she had raised the bar for prosecuting felony shoplifting from $300 per incident to $1,000 per incident, even though the law in Illinois was clear: felony shoplifting starts at $300.\n\nWhen she made that announcement, there were 101 people in Cook County Jail on felony retail theft charges. Ali Abid, a staff attorney at the Chicago Appleseed Fund for Justice, said, “I think this is a really positive step.” Abid’s boss, Malcolm Rich, was on Foxx’s transition team with then-Sen. Kamala Harris.\n\nBut Rob Karr, the president of the Illinois Retail Merchants Association, said he was “extraordinarily shocked and disappointed,” adding Foxx’s rewriting of the laws “sends a message that retail theft is victimless and not serious … this is tantamount to declaring open season on retail stores.”\n\nBy 2019, three years into Foxx’s social experiment, Karr was proved right. Retail theft reports had skyrocketed across the city. In the ritzy Rush Street shopping district, reported incidents had more than doubled. And on State Street, retail theft cases were up 32%.\n\nTrump’s use of the bully pulpit to highlight the high crime rates of Chicago and other blue cities is welcome news. Gone are the days of feel-good slogans about “reimagining” reform and “mass incarceration.” The Soros rogue prosecutor movement has failed, as has the “defund the police” and cashless bail experiment.\n\nAmericans of all stripes want and deserve to live in safe neighborhoods. Thankfully, the national mood has shifted in the right direction on crime.\n\nOriginally published by Fox News","summary":"President&#160;Donald Trump’s focus&#160;on&#160;crime&#160;across America is timely&#160;and&#160;necessary. It’s epidemic in many blue cities in our country,&#160;and&#160;something must,&#160;and&#160;can, be done about it. His crackdown in Washington, D.C.,... Read More\n\n\nThe post Trump&#8217;s DC Crime Success Puts Spotlight on Chicago&#8217;s Deadly &#8216;War Zone&#8217; appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/09/17/trump-dc-crime-success-puts-spotlight-chicago-deadly-war-zone/","image":"https://www.dailysignal.com/wp-content/uploads/2025/09/GettyImages-2234208704.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-09-17 12:00:00","author":"Cully Stimson","authors":["Cully Stimson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.341},{"id":361234638,"title":"Donald Trump Slammed for ‘Disgusting’ Response to Democratic Lawmaker’s Assassination, Critics Slam His Selective Empathy","text":"Donald Trump‘s selective mourning has lately been raising eyebrows. The President didn’t shy from expressing grief and anger when far-right activist Charlie Kirk was assassinated this month. However, his bizarre reaction to a question related to Melissa Hortman is not only perceived as ignorant but also as insensitive.\n\nRecently, during his interaction with the press, the 47th POTUS was caught off guard when he was asked if it would have been appropriate to lower the national flag after Minnesota state rep Melissa Hortman was shot to death at her home on June 14, 2025. \n\nTrump’s reaction was unexpected. “Uh, I’m not familiar. The who?” he said in reaction to CBS News correspondent Nancy Cordes’ question. However, he then added that he would have ‘gladly’ agreed to the gesture if Minnesota Governor Tim Walz had formally asked him.\n\n🚨HOLY SHIT!! Trump was asked if flags should be lowered for Melissa Hortman – the Democratic lawmaker murdered in Michigan: Trump: “Uh, I’m not familiar, who?”\nThat’s all you need to know. Only Conservative lives matter to them.\n\n— CALL TO ACTIVISM (@CalltoActivism) September 15, 2025 \n\nAs the clip of Trump’s statement surfaced online, netizens were quick to compare his cold reaction to Hortman’s killing with his 4-minute-long condolence video after Kirk’s death. \n\nTrump called Kirk’s assassination “a dark moment for America,” while launching a verbal attack on the “radical left.”\n\nHe pointed out that the left compares conservatives, including him, to ‘Nazis’ while stating, “That rhetoric is directly responsible for the terrorism that we’re seeing in our country today, and it must stop right now.”\n\nTrump, in his rant, listed several incidents, including his own assassination attempt, the murder of United Healthcare CEO Brian Thompson, and the shooting of Rep. Steve Scalise, in his attempt to blame the left for political violence. However, he conveniently skipped mentioning the incidents where the Democrats fell prey to the violence. His video message had no mention of Hortman and her husband’s assassination in June, nor any mention of the shooting of Democratic State Senator John Hoffman and his wife Yvette. \n\nIt isn’t hard to see through Donald Trump’s selective empathy towards the victims of political violence. He called Kirk “martyr for truth,” while he dismissed Hortman’s killing by describing it as “a terrible shooting.”\n\nTrump’s utter cluelessness about Melissa Hortman’s murder isn’t just embarrassing, it’s a damning indictment of his selective empathy, where only red lives get the flags at half-mast.\n— Richard Angwin (@RichardAngwin) September 15, 2025 \n\nHe even refused to call Walz as he himself confessed, “The guy doesn’t have a clue. He’s a mess. So, you know, I could be nice and call him, but why waste time?”\n\nWhile the Democrats, including former President Joe Biden and former VP Kamala Harris, mourned the loss and attended her funeral, Trump and his Republican senators were busy playing golf, because “why waste time,” after all. \n\nIn June 2025, Democratic elected official Melissa Hortman and her husband Mark, along with their dog, were assassinated by a Trump supporter\nTrump did not lower the flags to half-mast\nHe did not attend their funeral\nPresident Biden, on the other hand, knelt before their… pic.twitter.com/DI0cDK4PSD\n— TheFrenchie (@ML3democrats) September 11, 2025 \n\nTrump’s attempts to dismiss attacks on Democrats aren’t going unnoticed as critics have been calling out his ‘disgusting’ behavior. An angry user wrote on Threads, “Absolutely disgusting. A woman loses her life and the leader’s response is basically, ‘never heard of her.’ No empathy, no respect, not even the decency to acknowledge her humanity. It’s always the same, if it doesn’t serve his ego or political gain, he can’t be bothered. That level of cold indifference is exactly why people feel this country has lost its moral compass.”\n\n“The ‘level of backwardness & plain dumbness’ he exhibits is obscene!” another wrote. \n\nSomeone else furiously wrote, “Trump orders flags to be at half staff for a political influencer. AN INFLUENCER. But when 2 Minnesota House members, POLITICIANS, were assassinated, he didn’t even bother to call the governor and said it would be ‘a waste of time.’ Do you see the difference here?”\n\nTrump, however, remains unaffected by the criticism. Probably, this is one of the reasons why his die-hard fans love him dearly. What are your thoughts?","summary":"Donald Trump's cold reaction to Melissa Hortman'skilling leaves netizens stunned.","url":"https://www.inquisitr.com/donald-trump-slammed-for-disgusting-response-to-democratic-lawmakers-assassination-critics-slam-his-selective-empathy","image":"https://www.inquisitr.com/wp-content/uploads/2025/09/Untitled-design-2025-09-17T160726.724.jpg","video":null,"publish_date":"2025-09-17 11:59:32","author":"Kanika Saini,Youtube/the Guardian","authors":["Kanika Saini","Youtube/the Guardian"],"language":"en","category":"politics","source_country":"us","sentiment":-0.409},{"id":361235062,"title":"Kirk's alleged shooter faces death penalty. And, Pritzker concerned for 2026 elections","text":"Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nUtah state prosecutors are seeking the death penalty for 22-year-old Tyler Robinson, who was charged yesterday with aggravated murder in the shooting death of conservative activist Charlie Kirk. Authorities also charged Robinson with firearm counts and multiple obstruction-of-justice charges. The suspect is accused of trying to dispose of the clothes he allegedly wore during the shooting, telling his roommate to delete incriminating messages and not cooperate with investigators working on the case.\n\n🎧 Before his parents convinced him to turn himself in, Robinson implied to them that he'd rather take his own life than go to jail, according to prosecutors. Robinson wore a suicide prevention smock to his first court appearance since he was taken into custody, which he attended remotely. NPR's Tovia Smith tells Up First that the suspect showed no emotion as the judge read the charges against him. A text exchange between Robinson and his roommate appears to show the accused confessing to the deadly shooting. The roommate doesn't appear to have any advance knowledge of the shooting. Prosecutors say Robinson's parents reported that their son recently shifted politically to the left and began focusing on trans rights after he started dating his roommate, who authorities say is a biological male transitioning to female.➡️ Are politically motivated attacks posing a bigger threat in the U.S.? Experts analyzing gun violence unpack the data and trends.\n\nPresident Trump is in the U.K. for his second state visit to the country. He is the first U.S. president to receive the honor of a second large ceremonial visit. The trip will include two parts: spending time with the royal family and working on foreign policy. Trump is expected today to take a carriage ride around the Windsor Castle grounds and attend a banquet with the king and queen.\n\n🎧 Tomorrow, the policy-focused portion of the trip will begin with a meeting with British Prime Minister Keir Starmer. The meeting isn't completely separate from today's list of events, says NPR's Danielle Kurtzleben. A U.K. foreign policy expert informed Kurtzleben that the idea is to use Trump's love of the monarchy to leverage the president on other issues, including U.S. companies investing in the U.K. Starmer and Trump could also talk about how European leaders want the president to give more support to Ukraine in the war against Russia.\n\nFBI Director Kash Patel will face questioning today from the House Judiciary Committee. This comes a day after a combative hearing before the Senate Judiciary Committee, during which Patel defended his leadership of the nation's premier law enforcement agency. Patel is facing criticism for the usage of his social media account to announce inaccurate information about Kirk's murder, his handling of the Jeffrey Epstein case and for the firings of veteran agents.\n\n🎧 The Senate hearing lasted more than four hours and had \"two starkly different messages,\" according to NPR's Elena Moore. Democrats spoke on reasons why they feel Patel isn't fit for the job, pointing to his missteps. Republicans mostly stayed in Patel's corner and focused on the issue of political violence. GOP lawmakers alleged that the far left is inciting a broader culture of political violence. However, Democrats opposed the narrative as they have also been targets in recent acts.\n\nPicture show\n\nTemperatures in Europe are increasing at twice the average global rate, speeding up glacial melts and threatening the continent's largest rivers. The glaciers in the Swiss Alps have already lost nearly two-thirds of their ice over the past century. If the current climate continues, it is possible that by 2100 you \"wouldn't find any ice anymore,\" says Swiss glaciologist Daniel Farinotti. The water that glaciers have stored for centuries flows down to Europe's biggest rivers during the hot and dry summer months, replacing rainwater and snowmelt from the spring. A glacier in the Swiss Alps is the source for several rivers, including the Rhône, the Rhine, the Danube and the Po. Without those masses of ice, the rivers will be forever altered. See photos and read more about the important work being done to track the rapid melt.\n\nFrom our hosts\n\nby Steve Inskeep, Morning Edition and Up First host\n\nTrump on Monday said he intended to send National Guard troops to Memphis as part of what he says is an attack on crime. Trump added that he still hopes to send troops to Chicago, though it's unclear how he can legally do so. The news gives fresh relevance to our recent interview with Illinois Gov. JB Pritzker, who has declined to ask for the military.\n\nThis interview with Pritzker was an opportunity to see him respond to an immigration enforcement surge in Chicago — and to hear from one of the governors who is thinking of a run for president.\n\nDemocrats have talked of Pritzker as a possible candidate since at least 2022-2023, when he was seen as a possible alternative to President Joe Biden, should Biden drop out. Pritzker was a governor of a big state and a billionaire, which would make it possible for him to jump-start the financing for a campaign.\n\n\"Oh, I had no aim or desire. I didn't take it seriously, other than I'm flattered,\" he told me. When Biden at last did drop out in 2024, it was too late for a primary and Pritzker supported Kamala Harris, the president's choice.\n\nWill the 2028 campaign be different? Pritzker hasn't said, but indicated that he feels ready. \"There are things that governors will learn in their executive functions and things that I came into office understanding, having executive positions in the private sector, that are very helpful in running any kind of organization, especially the largest organization that exists in the United States.\"\n\nHe's one of several governors — along with California's Gavin Newsom, Michigan's Gretchen Whitmer, and Kentucky's Andy Beshear — who may see an opening. Democrats and Republicans alike will be scanning interviews like ours for relevant information.\n\n3 things to know before you go\n\nHave you ever wanted your coffee drinking experience to be a little more special? NPR's Word of the Week, \"zarf,\" could help. They are devices dating back to the Ottoman Empire that people used to hold the hot drinks.Movie star and film visionary Robert Redford died at his home in Utah yesterday at 89. He was renowned for his roles in Butch Cassidy and the Sundance Kid, The Sting and All The President's Men.The Trump administration has continued to ramp up ICE operations throughout the country. NPR wants to hear from people whose lives have been altered by the change. Fill out this form, and your experience could be featured in Morning Edition.\n\nThis newsletter was edited by Suzanne Nuyen.","summary":"Tyler Robinson, the 22-year-old accused of shooting and killing Charlie Kirk, faces the death penalty in Utah. And, Illinois Gov. JB Pritzker talks about why he is worried about the 2026 elections","url":"https://www.npr.org/2025/09/17/g-s1-89178/up-first-newsletter-charlie-kirk-tyler-robinson-trump-uk-visit-kash-patel","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2667x2000+201+0/resize/2667x2000!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F38%2Ff9%2Fcedad3b64683a0a51ef53de2a293%2Fgettyimages-2235278887.jpg","video":null,"publish_date":"2025-09-17 11:09:19","author":"Brittney Melton","authors":["Brittney Melton"],"language":"en","source_country":"us","sentiment":0.161},{"id":361231008,"title":"Trump sold Americans a 'fantasy' — and it’s now unraveling","text":"In the 2024 election, the fact that Donald Trump's hardcore MAGA base aggressively supported him came as no surprise. But it was independents and swing voters who ultimately got Trump past the finish line and gave him a narrow victory in a close election. \n\nTrump won the popular vote for the first time in 2024, defeating Democratic nominee Kamala Harris by roughly 1.5 percent — and the economy, according to polls, played a key role in that victory. Although the United States enjoyed record-low unemployment during Joe Biden's presidency, frustration over inflation worked to Trump's advantage.\n\nBut The New York Times' Jamelle Bouie, in his September 17 column, argues that Trump sold U.S. voters a \"fantasy\" that is now unravelling.\n\nREAD MORE: 'I'm the one asking the questions': CNN host cuts off Ted Cruz after he shouts over her\n\nTrump, according to Bouie, told 2024 voters that \"that there were no trade-offs\" with the economy — and that Americans \"could have their cake and eat it, too\" when, \"in reality,\" it \"was a binary choice.\"\n\n\"The essence of President Trump's pitch to the American people last year was simple: They could have it both ways,\" Bouie explains. \"They could have a powerful, revitalized economy and 'mass deportations now.' They could build new factories and take manufacturing jobs back from foreign competitors as well as expel every person who, in their view, didn't belong in the United States. They could live in a 'golden age' of plenty — and seal it away from others outside the country with a closed, hardened border.\"\n\nOne \"binary choice,\" according to Bouie, was that \"Americans could have a strong, growing economy, which requires immigration to bring in new people and fill demand for labor, or they could finance a deportation force and close the border to everyone but a small, select few.\"\n\n\"Millions of Americans embraced the fantasy,\" Bouie laments. \"Now, about eight months into Trump's second term, the reality of the situation is inescapable. As promised, Trump launched a campaign of mass deportation. Our cities are crawling with masked federal agents, snatching anyone who looks 'illegal' to them — a bit of racial profiling that has, for now, been sanctioned by the Supreme Court. The jobs, however, haven't arrived.\"\n\nREAD MORE: 'Undisputed idiot king': Former NBC journalist calls Eric Trump 'the epitome of stupidity' \n\nThe New York Times columnist continues, \"There are fewer manufacturing jobs than there were in 2024, thanks in part to the president's tariffs and, well, his immigration policies…. To embrace nativism in a global, connected economic world is to sacrifice prosperity for the sake of exclusion, just as the main effect of racial segregation in the American South was to leave the region impoverished and underdeveloped.\"\n\nREAD MORE: 'Didn't work for you': CNN analyst confronts Trump's favorite pundit on political violence\n\nJamelle Bouie's full New York Times column is available at this link (subscription required).","summary":"In the 2024 election, the fact that Donald Trump's hardcore MAGA base aggressively supported him came as no surprise. But it was independents and swing voters who ultimately got Trump past the finish line and gave him a narrow victory in a close election. \n\nTrump won the popular vote for the first time in 2024, defeating Democratic nominee Kamala Harris by roughly 1.5 percent — and the economy, according to polls, played a key role in that victory. Although the United States enjoyed record-low unemployment during Joe Biden's presidency, frustration over inflation worked to Trump's advantage.\n\nBut The New York Times' Jamelle Bouie, in his September 17 column, argues that Trump sold U.S. voters a \"fantasy\" that is now unravelling.\n\nREAD MORE: 'I'm the one asking the questions': CNN host cuts off Ted Cruz after he shouts over her\n\nTrump, according to Bouie, told 2024 voters that \"that there were no trade-offs\" with the economy — and that Americans \"could have their cake and eat it, too\" when, \"in reality,\" it \"w","url":"https://www.alternet.org/trump-economy-bouie/","image":"https://www.alternet.org/media-library/image.jpg?id=61611332&width=1200&height=600&coordinates=0%2C401%2C0%2C401","video":null,"publish_date":"2025-09-17 10:52:59","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":0.289},{"id":361305608,"title":"Spanberger backed by 2 former GOP lawmakers in bid to be Virginia governor","text":"Democrat Abigail Spanberger is heading into the final stretch of her campaign to try and become the next governor of Virginia with vocal support from two former Republican members of Congress. In a new development first reported by CBS News, Spanberger's campaign is set to tout endorsements from former Reps. Barbara Comstock and Denver Riggleman. The show of support from the two, who both backed Democrat Kamala Harris in last year's presidential race, also includes an advertisement. \"I saw firsthand that Abigail was one of the most bipartisan members of Congress,\" Riggleman says in the advertisement, while Comstock adds that her \"support for Abigail isn't about party, it's what's best for Virginia.\" After a victory in 2021, GOP Virginia Gov. Glenn Youngkin cannot run for a consecutive term this year due to state law. His chosen candidate in this year's contest, Republican Lt. Gov. Winsome Earle-Sears, is contending with national political tensions from Donald Trump's second term as president while she attempts to become the first GOP candidate since 1997 to succeed a fellow Republican as governor of the commonwealth.\"This election is a choice between sanity and chaos. We must protect our children from Abigail Spanberger's extremist agenda,\" Earle-Sears said in a social media post earlier this month. The decision by Spanberger's campaign to highlight support from the two former Republican members of Congress comes ahead of early in-person voting starting on Friday. Riggleman served one term in the U.S. House, and was defeated by a Republican challenger in 2020 before going on to serve as a senior technical adviser for the House Jan. 6 select committee following the 2021 Capitol riot. After winning two terms, Comstock lost her battleground congressional seat to a Democrat in the 2018 midterms during Mr. Trump's first term. Both are now examples of former Republican-elected officials who have criticized Mr. Trump since leaving office. Riggleman also appeared in an advertisement supporting Spanberger's 2022 reelection run for the U.S. House. The Virginia governor's race this November will be one of the first statewide races to be held during Mr. Trump's second term in the White House. The statewide off-year contest in Virginia is often viewed as at least being in part a referendum on the current incumbent president. Virginia has become a more reliably blue state in recent years, but Democrats' vote share in the state did drop during the 2024 presidential election. While then-Vice President Harris carried the state, she earned fewer votes than Joe Biden did during the 2020 contest. And at a time when Democrats are continuing to search for a path forward on messaging and branding issues, Spanberger's attempt to win back the governor's office from the GOP represents a closely watched contest that may carry national political implications in the coming years.","summary":"Early in-person voting in the Virginia governor's race between Republican Winsome Earle-Sears and Democrat Abigail Spanberger starts Friday.","url":"https://www.cbsnews.com/news/abigail-spanberger-virginia-governor-riggleman-comstock-endorsement/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/09/17/9dc19d79-0b1f-41d0-aed6-90bbb5896567/thumbnail/1200x630g4/88fe82440f7c850d863d0c20d3613aa1/gettyimages-2233217520.jpg","video":null,"publish_date":"2025-09-17 10:00:21","author":"Hunter Woodall","authors":["Hunter Woodall"],"language":"en","category":"politics","source_country":"us","sentiment":0.096},{"id":361197902,"title":"Kristi Noem tears into predecessor Alejandro Mayorkas on ‘Pod Force One’ for opening southern border: ‘Don’t know how he slept at night’","text":"Homeland Security Secretary Kristi Noem blasted her predecessor in an exclusive interview with “Pod Force One,” out Wednesday, claiming Alejandro Mayorkas opened the southern border to drug and human traffickers.\n\n“I don’t know how he slept at night,” Noem told The Post’s Miranda Devine, suggesting that Mayorkas took his “direction” from the Biden White House, where Vice President Kamala Harris served as “border czar.”\n\n“I don’t know how he slept at night knowing the vulnerabilities he was creating for this country and the people he was letting in and allowing to undo us,” the 53-year-old said.\n\nUnder former President Joe Biden, the number of border crossings broke all-time records and more than 8 million migrants entered the US — including criminals, known gang members and hundreds of others on terror watchlists.\n\n“I think one of the biggest disservices they did to the country was not fulfill the mission of what the department was established for; it literally is to secure the homeland,” Noem went on.\n\n“And he opened the doors and said, ‘Come on in. If you are from an evil foreign government or a terrorist organization or a gang, you’re more than welcome, and we’re going to ignore our laws and treat you better than we do the American citizens.'”\n\nHouse Republicans impeached Mayorkas in February 2024 for having willfully refused to comply with federal immigration laws and lying to Congress about the US border being “secure.”\n\n“They didn’t even try to close the border,” Noem said on the podcast. \n\n“That’s what I think. Knowing you were doing nothing and watching, if you watched, the inhumanity of what was happening at the border.”\n\nThe Democrat-controlled Senate voted against holding an impeachment trial, acquitting Biden’s border enforcement official.\n\nSince returning to the White House, Trump has overseen the deportation of more than 300,000 migrants who illegally entered the country, the majority of whom are believed to have criminal records.\n\nAnother 2 million in the US interior have rap sheets.\n\nMore than 320,000 kids were also lost under the Biden administration after entering the US as unaccompanied minors and being shuttled from housing nonprofits — given billions of dollars in federal grants — to sponsors, some of whom were unvetted and also had alleged criminal and gang ties.\n\nAt least 7,300 reports of migrant children being trafficked were never even investigated, according to the US Department of Health and Human Services, which partnered with DHS’ Office of Refugee Resettlement to house them.\n\nEvery week, Post columnist Miranda Devine sits down for exclusive and candid conversations with the most influential disruptors in Washington. Subscribe here!\n\n“We knew children were going missing,” Noem said. \n\n“We knew they were raping our girls at the border and trafficking our little boys. And they knew all that was going on and watched.”\n\n“[They] watched the same child cross the border over and over again with a different group of adults and they just went to bed at night,” she went on. \n\n“And as a mom and a grandma, that’s the stuff that I don’t know how they did that. I don’t know how they sat there and facilitated that.”\n\nThe Trump administration has since rescued 13,000 children and HHS is still processing thousands of reports alleging trafficking, fraudulent sponsorships of the kids or other alleged abuse.\n\nElsewhere in the interview, Noem shared that she spent time with Border Patrol agents who had been “demonized” after being falsely accused by Biden, Mayorkas and Vice President Kamala Harris in 2021 of whipping migrants entering through Texas with their horses’ reins.\n\n“I went down there and rode horse with them for a day, because, well, obviously I like to ride horses, but I went right away as soon as I was sworn in to go spend time with them, because they were so demonized,” the DHS chief said. \n\n“And their leadership did that to them.”\n\nMayorkas was informed by an aide that there was no evidence the agents “strapped” Haitian migrants attempting to cross the US-Mexico border after a photographer who was present shared his account — but didn’t contradict Biden’s false claims or alter his own statements about the incident.\n\n“Our nation saw horrifying images that do not reflect who we are,” Mayorkas had said at the time, while Harris claimed the agents’ actions reminded her of “times of slavery.” \n\nNoem told “Pod Force One” she “just wanted them to know that their previous leadership had ridden over them, but I was going to ride with them, and I was going to be a part of helping them do their jobs again.”","summary":"Noem believes that former Homeland Security Secretary Alejandro Mayorkas took his \"direction\" from the Biden White House, where Vice President Kamala Harris served as \"border czar.\"","url":"https://nypost.com/2025/09/17/us-news/kristi-noem-tears-into-predecessor-alejandro-mayorkas-on-pod-force-one-for-opening-southern-border-dont-know-how-he-slept-at-night/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/111542881.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/sgIf2lyB-RyIcpnTz.mp4","publish_date":"2025-09-17 10:00:00","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.054},{"id":361181312,"title":"Stephen Colbert Celebrates Emmys Win: ‘Donald Trump Doesn’t Have One’","text":"Skip to main content\n\nSeptember 17, 2025\n\nStephen Colbert on 'The Late Show'\n\nYouTube/The Late Show\n\nStephen Colbert showed off his shiny new Emmy on The Late Show, earning a standing ovation and a chant of “Stephen, Stephen” from the audience as he kicked off his show on Tuesday night.\n\n“On Sunday night we won our first Emmy for Outstanding Talk Series,” Colbert said. “Man, I’m telling you, we should have gotten cancelled years ago. This award belongs to all 200 of the incredibly hard-working people who make this show.”\n\nHe went on to thank the show’s writers, stage crew, production staff, talent, editors, and many more staff members. He also shared his gratitude with the audience, who “ultimately make this show possible.” “So this belong to you too, but I’m going to keep it,” Colbert quipped. “And if anyone so much as touches it I will jab your eyes out with the wings right there.”\n\nColbert continued, “I’m so grateful to everyone at the Academy who voted for us and to the Emmy producers for the flattering lighting that made me look so much younger on Sunday night.” He then showed a photo of Owen Cooper, who won for his role on Adolescence.\n\nAfter giving a shout out to his fellow nominees, including Jon Stewart and Jimmy Kimmel, Colbert noted, “Speaking of Emmys, Donald Trump doesn’t have one.”\n\nOn Sunday, The Late Show won the Emmy for Outstanding Talk Series, marking the first time the late-night show has scored a trophy in the category. “Thank you for this honor. I want to thank CBS for giving us the privilege to be part of the late-night tradition, which I hope continues long after we’re no longer doing this show,” Colbert said during his acceptance speech. “I gotta thank these people, the 200 incredible professionals. You are the pros, and I’m so proud to be one of you. We gotta thank the people who supported us the last 20 years.”\n\nTrending Stories\n\nMatt Cameron Admits He Was ‘Having Some Issues’ With Pearl Jam’s ‘Constant Touring’\n\nJustin Bieber Scores Seven-Figure Coachella Payday: 'He’s Fully in the Driver’s Seat'\n\nBody Identified as Sources Say D4vd's Tesla Was Spotted in Neighborhood Last May\n\nNFL Teams That Didn’t Honor Charlie Kirk Face the Wrath of Conservative Fans\n\nCBS announced in July that the popular late-night talk show would end in May 2026, amid financial issues at the network. Though at the time, many suggested political pressure was a factor: Paramount was trying to merge with Skydance Media, with both companies awaiting approval from the FCC (it was eventually approved). Paramount also settled a lawsuit brought by President Donald Trump, who claimed 60 Minutes engaged in election interference by editing an interview with Kamala Harris.\n\nSince the announcement of the late-night show’s cancellation, much of Hollywood has stood up in support of Colbert, including Kimmel, who used his Emmys FYC ad to declare, “I’m voting for Stephen.”\n\n‘Hot Bullsh-t': Amy Poehler Slams the Oscars for Lack of Comedy Awards\n\nCharisma Madarang\n\nFrancis Ford Coppola Recalls Scooter Ride With Robert Redford That Almost Went Sideways\n\nCharisma Madarang\n\nRobert Redford Represented an America We Must 'Fight to Protect,' Says Jane Fonda\n\n'Thank You'\n\nCharisma Madarang\n\n'Alien: Earth' Episode 7: An Eyeball in Sheep's Clothing\n\nAlan Sepinwall\n\nWoody Harrelson Remembers 'Legendary' Robert Redford: 'Champion of Indie Films'\n\n'A Real Gentleman'\n\nCharisma Madarang\n\nGo to PMC.com\n\nMost Popular\n\nMatthew Dowd Fired From MSNBC for Charlie Kirk Comments\n\nComedy Central Pulls 'South Park' Episode After Charlie Kirk Assassination\n\nWhy Taylor Swift’s Attendance at the Chiefs’ Season Opener Isn’t a Total Guarantee\n\nDame Dash Named Revolt TV Chairman, Unveils 'My Paid In Full' Docuseries Trailer\n\nYou might also like\n\n3Cat Sets Ferran Adrià Bio About the Chef Who Turned El Bulli Into the Most Famous Restaurant in the World (EXCLUSIVE) \n\n3 hours ago\n\n11 Stunning Beauty Advent Calendars for Teens, From NYX to Charlotte Tilbury That'll Arrive Before Christmas\n\n9 months ago\n\nMiu Miu’s Artist Collaborator Helen Marten Mines Radical Optimism at Art Basel Paris\n\nJane Fonda, Barbra Streisand, Martin Scorsese, Morgan Freeman Pay Tribute to Robert Redford: ‘He Stood for an America We Have to Keep Fighting for’\n\n8 hours ago\n\nWhat’s Next for Women’s Sports? Experts Dish at Sportico’s Rise\n\n8 hours ago\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.\n\nPowered by WordPress.com VIP","summary":"\"Man, I'm telling you, we should have gotten cancelled years ago,\" the host said on The Late Show","url":"https://www.rollingstone.com/tv-movies/tv-movie-news/stephen-colbert-emmys-win-the-late-show-1235429330/","image":"https://www.rollingstone.com/wp-content/uploads/2025/09/colbert_8e308a.jpg","video":null,"publish_date":"2025-09-17 08:40:38","author":"Emily Zemler","authors":["Emily Zemler"],"language":"en","category":"politics","source_country":"us","sentiment":0.299},{"id":361164358,"title":"Why is Donald Trump suing the New York Times for $15 billion?","text":"Donald Trump is bringing a $15bn defamation and libel lawsuit against the New York Times, which he has described as “one of the worst and most degenerate newspapers in the History of our Country.”\n\nIn a post on Truth Social, the president accused the newspaper of being a “mouthpiece” for the Democratic Party as he criticised its endorsement of Kamala Harris in the 2024 presidential race as “the single largest illegal Campaign contribution, EVER”.\n\nHe continued that The Times had lied about him, his family, his business, the America First Movement, the MAGA movement, and “our Nation as a whole” in the lawsuit against the paper and four of its journalists.\n\nThe lawsuit comes less than a week after The Times said it had been threatened with legal action by the White House, following reporting on a crude birthday note given to the late sex offender Jeffrey Epstein, which bears Trump’s signature. However, the president has denied being its author. \n\nBut as well as recent reporting on Trump’s links to Epstein, the 174-year-old newspaper has rarely held back when it comes to reporting on the president’s financial dealings, his alleged ties to Russia, as well as turmoil in his administration.\n\nWhile Trump accuses the newspaper of a “decades-long pattern” of “intentional and malicious defamation” against him, court documents filed in the U.S. District Court in Florida name several articles and one book written in 2024 by two of the publication’s journalists that have come under scrutiny.\n\n\"Defendants maliciously published the Book and the Articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump,\" according to the filing lodged on Monday.\n\nTrump took particular issue with theTimes for its front page editorial endorsement of Harris in September last year, titled “The Only Patriotic Choice for President”, which said “[i]t is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump”, adding that Trump would “defy the norms and dismantle the institutions that have made our country strong.”\n\nOther articles cited in the court documents include opinion pieces that Trump’s lawyers allege “called for the Senate to retire the filibuster for the purpose of ramming through radical legislation designed to undermine election integrity,” characterized the Constitution as broken and dangerous, and “proposed ‘pack[ing] the Union with new states’ to guarantee its amendment.”\n\nLater on Monday, the newspaper issued a response to the suit. \n\n“This lawsuit has no merit. It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people,” the statement read. \n\nA book published by Penguin titled Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, written by two Times journalists, was also criticised as trying to damage Trump’s business and personal reputation, inflicting significant economic harm on his brand value and significantly affecting his future financial prospects.\n\n\"The harm to the value of TMTG (Trump Media and Technology Group) stock is one example of how the defendants’ defamation has injured President Trump,\" said his lawyers, citing \"a precipitous decline in the stock price.\"\n\nThis isn’t the first time Trump has taken legal action against the media since becoming president. In his Truth Social post, he stated that he was holding the “Fake News Networks” responsible, citing “successful litigation against George Slopadopoulos/ABC/Disney, and 60 Minutes/CBS/Paramount.”\n\nLawsuits against ABC News and anchor George Stephanopoulos, as well as the CBS news program 60 Minutes for its interview with Kamala Harris, were settled respectively for $15 million and $16 million.\n\nIn July, he launched legal action against the Murdoch-owned Wall Street Journal after it first reported the existence of a note featuring Trump’s signature, which was allegedly given to Epstein. The case is expected in court soon and represents a risk to Trump if more evidence relevant to the case could be made public.\n\nThe lawsuit against The Times was filed the same day a cadre of senior White House figures, including Deputy Chief of Staff Steven Miller and Vice President J.D. Vance, called for vengeance on the left, in the wake of the shooting death of right-wing activist Charlie Kirk.","summary":"Trump’s lawsuit comes less than a week after the New York Times said it had been threatened with legal action by the White House","url":"https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-suing-new-york-times-15-billion-b2827374.html","image":"https://static.independent.co.uk/2025/06/26/23/23/GettyImages-2221849502.jpg?width=1200","video":null,"publish_date":"2025-09-17 07:10:30","author":"Bryony Gooch","authors":["Bryony Gooch"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.159},{"id":361177514,"title":"Why Trump is suing the New York Times, his white whale, without citing mistakes","text":"Donald Trump grew up in Queens – a very nice neighborhood, to be sure, but still an outer borough. Across the East River is the glittering skyline of what those who don’t live there call \"the city.\" And in the midst of that island is the New York Times building. When the Times found the real estate developer worthy of profiling, in 1976, it was puff piece at first sight: \"He is tall, lean and blond, with dazzling white teeth, and he looks ever so much like Robert Redford. He rides around town in a chauffeured silver Cadillac with his initials, DJT, on the plates. He dates slinky fashion models, belongs to the most elegant clubs and, at only 30 years of age, estimates that he is worth \"more than $200 million.\" TRUMP ANNOUNCES $15 BILLION LAWSUIT AGAINST THE NEW YORK TIMES FOR DEFAMATION, LIBEL The Redford reference is now sadly dated because of the actor’s passing in his sleep (\"Good way to go, I guess,\" says Trump.) But in the piece, the \"fast talker\" acknowledged that his father, Fred Trump, who built middle-class housing in Queens and Brooklyn, only recently tried to crack the Manhattan market because of \"psychology.\" (My favorite sentence: \"Mr. Trump, who says he is publicity shy, allowed a reporter to accompany him on what he described as a typical work day.\") I bring all this up, as a Brooklyn guy who has lived in Queens, to underscore how the president has always craved the paper’s approval. TRUMP TAKES AIM AT CNN AND NEW YORK TIMES OVER IRAN STRIKE COVERAGE, BUT JOURNALISTS ARE SHRUGGING And he got it – though the tabloids loved his feuds even more – until he went into politics. Now the president has filed a $15 billion lawsuit against the New York Times. It’s a strange suit, and it has a snowball’s chance in hell of succeeding. A Times statement says: \"This lawsuit has no merit. It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting.\" What’s odd is that there was no triggering story, no specific inaccuracy alleged. That’s in sharp contrast to the president’s successful suits against CBS and ABC. Of course, filing a suit – forcing even the biggest companies to spend a fortune on legal fees – is often the point. Back in the 1980s, Trump sued the Pulitzer-winning Chicago Tribune architecture critic, Paul Gapp, for $500 million, for criticizing his plan to build America’s tallest building – a 150-story tower – in Manhattan. \"One of the silliest things anyone could inflict on New York or any other city,\" Gapp wrote. Trump said he had \"virtually torpedoed\" the project, subjecting him to \"public ridicule and contempt.\" A judge later dismissed the suit as involving protected opinion. The new suit names such reporters as chief White House correspondent Peter Baker and investigative journalist Michael Schmidt. It also names Susanne Craig and Ross Buettner, in part for their book \"Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success.\" Craig revealed some of Trump’s tax returns, and she and her team won a Pulitzer for reporting on his finances. In the ABC case, the network settled for $16 million for George Stephanopoulos having said Trump was found liable for rape, not \"sexual abuse,\" in the civil suit brought by E. Jean Carroll. CBS also agreed to pay $16 million after the unethical editing of the Kamala Harris interview on \"60 Minutes,\" to make her sound more coherent. He has also sued the Wall Street Journal’s parent company for reporting on his birthday message to Jeffrey Epstein – which he continues to deny, although the message from the predator’s files has surfaced with many similarities. CBS PARENT COMPANY SPARKS MASSIVE OUTRAGE WITH TRUMP LAWSUIT SETTLEMENT In the lawsuit against the Times, filed in Florida, the president just trashes its campaign coverage. He says on Truth Social he is moving against \"one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual ‘mouthpiece’ for the Radical Left Democrat Party. I view it as the single largest illegal Campaign contribution, EVER. Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole. I am PROUD to hold this once respected ‘rag’ responsible…\" I’m going out on a limb to say that running an editorial on the front page falls under the category of free speech, and lots of papers have occasionally done it. And remember, as the ultimate public figure, Trump would have to prove malice on the paper’s part, or reckless disregard for whether something is true or not. Given that the president’s coverage is overwhelmingly negative, let’s say for the sake of argument that the Times is leading the resistance. The Trump suit blames \"persistent election interference from the legacy media.\" But unless a plaintiff can point to a verifiable inaccuracy, it falls under the protective umbrella of First Amendment reporting and opinion. SUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF ON THE DAY'S HOTTEST STORIES With Marine One in the background yesterday, ABC’s Jonathan Karl, whom Trump knows well, asked him about criticism of Pam Bondi’s investigations of left-wingers: \"A lot of people, a lot of your allies, say hate speech is free speech.\" \"She’d probably go after people like you! Because you treat me so unfairly! It’s hate! You have a lot of hate in your heart!\" A moment later, Trump said: \"Maybe they’ll come after ABC. Well, ABC paid me $16 million recently for a form of hate speech, right? Your company paid me $16 million for a form of hate speech, so maybe they’ll have to go after you.\" CLICK HERE TO GET THE FOX NEWS APP For the president, a lawsuit is wielded as a weapon. That’s why he’s suing the New York Times, the paper across the river, with which he’s always had a love-hate relationship – and lately, mostly hate.","summary":"President Trump, ever fixated on the New York Times, is now suing the paper for $15 billion with no clear trigger – the latest he&apos;s levied against the press since retaking office.","url":"https://www.foxnews.com/politics/why-trump-suing-new-york-times-white-whale-without-citing-mistakes","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/donald-trump.jpg","video":"https://www.foxnews.com/video/6379418257112","publish_date":"2025-09-17 07:00:05","author":"Howard Kurtz","authors":["Howard Kurtz"],"language":"en","category":"politics","source_country":"us","sentiment":0.092},{"id":361145856,"title":"Someone beamed yuge pic of Epstein and Trump onto Windsor Castle as he arrived for state visit","text":"Four people have been arrested after protesters projected images of Donald Trump and Jeffrey Epstein onto Windsor Castle during the US president’s controversial second state visit.\n\nImages linking Trump with the deceased sex offender were shown on the castle’s walls, where King Charles will host Trump later today.\n\nThames Valley Police said they had arrested four adults, no further details, on suspicion of malicious communications the public stunt at the palace.\n\nThey remain in custody.\n\nTrump’s meeting with the King and Queen will take place out of public view due to the ‘unprecedented’ security operation around the state visit.\n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n An inscription reading “To Jeff, you are the greatest!”, a message found by The New York Times in a copy of U.S. President Donald Trump’s book “Trump: The Art of the Comeback”, which belonged to Jeffrey Epstein, is projected on Windsor castle (Picture: REUTERS)\n\nThe President and First Lady are due to be welcomed by Charles later on today, before they take a private carriage ride later on. He will also meet with the Prince and Princess of Wales around the grounds of Windsor Castle.\n\nThe King and Trump will then inspect the largest guard of honour ever assembled for a state visit, with 1300 military personnel taking part.\n\nA mass protest is also due to be held by the Stop Trump Coalition in Parliament Square against the second state visit at 2pm.\n\n Newest first\n Oldest first\n\n September 17, 2025 8:01 am Inside Winfield House where Trump stayed overnight Luke Alsford \n\n The house sits on 12 acres of land (Picture: Shutterstock)\n\nIt’s been called ‘America’s unofficial party house’ and is the first place Trump went to after landing in the UK.The US president stayed overnight at Winfield House – the official residence of the US ambassador to the UK.The estate boasts the second largest private garden in London, after Buckingham Palace’s, as large as seven football pitches.The historic rooms regularly host US Presidents, from Trump and Biden to Eisenhower and Bush, to other world leaders and British monarchs.Lavish parties and dinners are also a regular there, including one hosted by Trump for the King when he was last on a state visit.\n\n Trump hosted a lavish state dinner for then Prince Charles and Camilla, Duchess of Cornwall, during their state visit (Picture: Shutterstock)\n\n An array of American and British vinyls on display in Winfield House (Picture: Shutterstock)\n\n September 17, 2025 7:11 am Trump appeared to be up late into the night Luke Alsford If his social media is anything to go by, the president did not exactly get an early night before today’s pomp and pageantry.Trump was busy posting on his Truth Social page well past 3am this morning.He was directing his ire at his predecessor Joe Biden and his deputy Kamala Harris over their handling of legal cases against him.\n\n Caption: (Picture: Truth Social)\n\n September 17, 2025 7:30 am Trump appeared to be up late into the night Luke Alsford If his social media is anything to go by, the president did not exactly get an early night before today’s pomp and pageantry.Trump was busy posting on his Truth Social page well past 3am this morning.He was directing his ire at his predecessor Joe Biden and his deputy Kamala Harris over their handling of legal cases against him.\n\n Trump was busy last night (Picture: Truth Social)\n\n September 17, 2025 7:10 am What security measures are in place for Trump’s visit? Luke Alsford \n\n A seven-foot-high wall has also been temporarily erected (Picture: Maureen McLean/Shutterstock)\n\nThe ‘complex’ security operation around today’s welcome ceremony has been described as ‘unprecedented’ by the Ministry of Defence.It is expected to cost at least £10 million and involve drones policing the air above Windsor.Airspace restrictions over the historic castle are among a plethora of measures will swing into action around Windsor.A man was arrested ahead of Trump’s visit on Tuesday after a drone was flown near to the royal residence.A seven-foot-high wall has also been temporarily erected around the estate. \n\n September 17, 2025 6:56 am The schedule for today’s events Luke Alsford \n\n King Charles III and the Princess of Wales, pictured yesterday at the Funeral of the Duchess of Kent will take a carriage ride with the president and first lady around Windsor Castle (Photo by Chris Jackson/Getty Images)\n\nThe president and first lady will be formally welcomed by the King and Queen at Windsor Castle later this afternoon.They will also meet the Prince and Princess of Wales before watching a military procession, including servicemen from the Royal Air Force, Royal Marines and the Army.The president and the King will inspect the largest Guard of Honour ever assembled for a state visit, before Trump joins the royal family in the state dining room.Later in the day, Trump is set to visit the tomb of Queen Elizabeth II at St George’s Chapel.\n\n Police officers carrying out security searches outside Windsor Castle on Monday (Picture: AP)\n\nA flypast will also take place, featuring F-35 jets from the UK and US forces, as well as the RAF aerobatic team or the Red Arrows.Gun salutes will also be fired from the east lawn on the estate and from the Tower of London.Both Trump and the King will give speeches at the traditional state banquet at Windsor Castle on Wednesday evening. \n\n September 17, 2025 6:51 am Day 2 of Trump’s state visit after the president touched down last night Luke Alsford \n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n Good morning and welcome to Metro’s live blog of Donald Trump’s unprecedented second state visit to the UK this week.The US president touched down at Stansted Airport last night ahead of two days of British pomp and pageantry.His helicopter, Marine One, was seen flying over London en route to Winfield House, the home of the US ambassador, where he stayed overnight.Protests around Windsor were already in full force, with videos Trump and Epstein later projected onto the Castle walls.Trump has said today is going to be ‘a very big day’, with the US leader meeting King Charles at Windsor Castle later today.At 2pm, a huge anti-Trump protest is also due to get underway in central London. \n\n September 16, 2025 10:59 pm Goodnight from Metro Josh Milton Thank you for following our live coverage today.We are wrapping up here, but we will be back in the morning with the latest updates on Trump’s state visit. \n\n September 16, 2025 10:44 pm US President ‘loves’ the UK ahead of UK-wide anti-Trump protests Josh Milton Donald Trump landed at the US ambassador’s residence in Regent’s Park, central London, just now.Discussing the UK, he told reporters: ‘Well, I love it. I love Turnberry [the golf course he owns], I love Aberdeen.‘I have a lot of things here that… they warm my heart. I want to tell you it’s a very special place.’ \n\n September 16, 2025 10:41 pm Trump praises photographs of himself Josh Milton \n\n (Picture: Stefan Rousseau/PA Wire)\n\nTrump has set the tone of this week’s state visit pretty quickly. He told reporters after landing: ‘Enjoy yourselves. You’re going to have some great pictures today. You’re going to have the best pictures. ‘It’s going to be a beautiful event. Everyone’s looking forward to it.’ \n\n September 16, 2025 10:39 pm Video of Trump and Epstein plastered on Windsor by protesters Josh Milton \n\n (Picture: Trump)\n\nDonald Trump is in Windsor Castle – well, kind of. The US president won’t be at the royal residence until tomorrow, but an archive photograph of him with the late paedophile Jeffrey Epstein is being projected onto the side of Windsor Castle.Protesters are beaming photos of the pair, as well as Virginia Giuffre, Epstein’s most well-known victim, who died in April.Four arrests have been made over the Windsor Castle projections.\n\n Trump’s mugshot was also projected (Picture: Reuters)\n\n Prince Andrew alongside Epstein was similarly plastered on the side of the royal castle (Picture: Reuters)\n\n September 16, 2025 9:38 pm Trumps board Marine One Josh Milton The Trumps have now boarded their next flight – the helicopter Marine One. They’ll be travelling to Winfield House in Regent’s Park, a townhouse that is the residence of the US ambassador to the UK. \n\n September 16, 2025 9:25 pm Donald and Melania Trump disembark Air Force One Josh Milton \n\n Donald Trump and Melania Trump disembark from Air Force One (Picture: Reuters)\n\nThe US President and the First Lady have disembarked Air Force One and are currently shaking the hands of top government officials.Among them are the US Chief of Protocol, Ambassador Monica Crowley, and Viscount Hood, Lord-in-Waiting, who is representing the king.\n\n (Picture: Stefan Rousseau/PA Wire)\n\n (Picture: Stefan Rousseau/PA Wire)\n\n September 16, 2025 9:02 pm Trump’s welcoming party coming into position Josh Milton \n\n Foreign Secretary Yvette Cooper waits for Trump (Picture: Reuters)\n\n September 16, 2025 8:38 pm Helicopter that will pick up Trump arrives Josh Milton \n\n Toby Shepheard / Parsons Media)\n\nThe helicopter that will pick up President Trump and Melania once they land has arrived at Stansted.Air Force One should be arriving shortly and is expected no later than 9pm. \n\n Security officers are at the ready (Picture: Toby Shepheard/Parsons Media)\n\n September 16, 2025 8:15 pm ‘I would rather be with America than against them’ Josh Milton Phil Warren, 45, from Windsor, who runs Warren Property Matters in Eton, said his offices on Eton High Street shook last week when airfact flew over. ‘There is some disruption but it’s no different from any other time there’s a wedding or another royal event at the castle. We are just waiting for the arrival now,’ he added to Metro. ‘The way I see it is, I go to America every year, I love America, they back us up and I would rather be with them than against them.’ \n\n September 16, 2025 8:14 pm Trump dog chew toys flying off the shelves Josh Milton Claire Alford, manager of pet shop A Dog’s Life in Windsor town centre, has been doing a swift trade in Donald Trump chewy pet toys. She told Metro: ‘We’ve always had them in the shop, but with Trump coming here, they’ve become more popular. They are selling like hot cakes. ‘Putting politics aside, we are here to run a business and for us it’s been pretty good. We started off with about 250 a few days ago and we’ve got around 50 left. I’m hoping that they go soon. ‘Some are buying because they want it for their pet to destroy, others are buying because they want them. There’s a mix of emotions.’\n\n Some are making the most of it. A local pet shop opposite Windsor Castle is selling Pet hate toys by the box load, according to shop manager Claire (Picture: w8media)\n\n September 16, 2025 8:05 pm Does Air Force One have a flight tracker? Josh Milton We know that Donald Trump’s plane will land in Stansted at roughly 8.30pm. But if you’re hoping to track the president’s plane, known as Air Force One, it might be a tad tricky. Air Force One – the call sign for whatever plane the president is travelling aboard – is a Boeing VC-25, a military version of the Boeing 747 airliner.But like other high-profile aircraft, Air Force One can’t be tracked like most commercial flights. On the plane’s page on the aviation tracker, FlightRadar24, no flight routes or data are displayed. \n\n September 16, 2025 7:34 pm Here’s what to expect from Trump’s second state visit Josh Milton \n\n Donald Trump and Melania Trump board Air Force One (Picture: Reuters)\n\nIn roughly an hour, Donald Trump will land in the UK for his second-ever state visit. And it starts off sufficiently British, to say the least. The president of the United States is landing at Stansted Airport, which doesn’t exactly rank too high in lists of the country’s best airports. Afterwards, however, it gets slightly classier. His two-day visit, hosted by King Charles and Queen Camilla, will see Trump visit Windsor Castle tomorrow. Trump will watch a fly-past by the Red Arrows, the aerobatics display team of the Royal Air Force, before seeing the Beating Retreat, a colourful military ceremony. On Thursday, Trump will travel to Chequers, Keir Starmer’s country home, and will also hold a news conference with the prime minister. He’ll remain at Windsor, ending the trip by joining Catherine, Princess of Wales, at Frogmore Gardens for an event with the Scouts Association.You can read more about Trump’s state visit here. \n\n September 16, 2025 7:17 pm Marco Rubio lands in UK Josh Milton He’s not quite the president of the United States, but Secretary of State Marco Rubio just landed in the UK. Rubio and his wife, Jeanette Dousdebes, were greeted by the foreign secretary, Yvette Cooper, as they arrived at Stansted Airport.\n\n (Picture: Reuters)\n\n September 16, 2025 6:30 pm Anti-Trump protesters ready for president’s arrival Josh Milton \n\n People are gathering in Windsor (Picture: w8media)\n\nDozens of Stop Trump Coalition members are now gathering for a protest in Windsor against Trump’s visit. The group has planned nine other demonstrations across the UK tomorrow, including London and Manchester. Human rights, women’s rights, climate, anti-racism, Republican, socialist and pro-Palestine groups are among those backing the protests. \n\n (Picture: Yui Mok/PA Wire)\n\n (Picture: Yui Mok/PA Wire)\n\n (Picture: Yui Mok/PA Wire)","summary":"","url":"https://metro.co.uk/2025/09/17/four-arrested-epstein-trump-photos-projected-onto-windsor-castle-24181039/","image":"https://metro.co.uk/wp-content/uploads/2025/09/SEI_266413149-9442.jpg?quality=90&strip=all","video":null,"publish_date":"2025-09-17 05:52:52","author":"Luke Alsford","authors":["Luke Alsford"],"language":"en","source_country":"gb","sentiment":0.212},{"id":361179476,"title":"Cenk Admits People At TPUSA Event Treated Him With Respect","text":"“The Young Turks” host Cenk Uygur admitted Tuesday to Daily Caller News Foundation founder Tucker Carlson that Turning Point USA attendees treated him with respect after he spoke at one of the organization’s events.\n\nIn December 2024, Uygur joined TPUSA founder Charlie Kirk on stage at “AmericaFest,” calling for a “populist revolt” against Democratic Party leaders. Reflecting on Kirk’s assassination and Democrats’ reactions on “The Tucker Carlson Show,” Carlson asked Uygur how attendees treated him at the event before praising Uygur’s outlet for their commitment to nonviolence.\n\nUgyur began by thanking Carlson for the sentiment. (RELATED: Kirk’s Exec Producer Reveals Story Behind Emotional Image Of Erika Kirk Holding Cross Necklace)\n\n“So now how was I treated at AmFest? I’ve got to be honest with you. And, so the reason why I preface it by saying, I got to be honest with you is because sometimes when we go and talk to the right-wing and, and as you said, we haven’t moved on a thing, right? So folks come to us, and I have a simple principle. Take the win,” Uygur said.\n\n“Now you agree with me that, uh, anti-war is the right position. Is my correct answer that I still hate you? No, that is not the correct answer,” Uygur added. “The correct answer is, ‘Oh, thank God. All right. Great!’ And now we’ll work on the next thing and the next thing and the next thing. But for now, at least we had no agreements before. Now we have to have a number of really important agreements. So, but nevertheless, I had my share of critics on the left.”\n\nSince Kirk’s assassination Wednesday, hundreds of leftists, including educators, have been fired after publicly posting celebratory responses to his murder. Other Democrats, including lawmakers, have not only blamed President Donald Trump and Republicans for Kirk’s death, but have also ridiculed Kirk’s supporters.\n\nUygur went on to criticize the disapproval of “platforming” certain people, noting that Kirk had allowed him to speak.\n\n“So with that giant preface, I’ll say the people there, honestly, were universally wonderful,” Uygur continued as Carlson was heard laughing.”They were! And so you can say, ‘Oh, well, you know, ha ha. That means Cenk’s in with the right wing. No, I’m just telling you what happened. If they were jerks, I would tell you that they were jerks, but they weren’t.”\n\nTensions between Republicans and Democrats increased during the 2024 presidential election cycle. Corporate media and the campaign of former Vice President Kamala Harris escalated their rhetoric against Trump. Trump was called a fascist by Harris, with former President Joe Biden saying Trump should be locked up.\n\nAccording to a recent Napolitan News Service poll, data shows 26% of those aged 18 to 34 believe America is “better off now that Charlie Kirk has been killed,” despite saying “it is always difficult to wish ill of another human being.” Among Democrats, 24% agreed with the sentiment.\n\nDespite vitriol from some Democrats, TPUSA has seen rapid growth online and on campuses. According to Kirk’s executive producer Andrew Kolvet, the group received more than 32,000 inquiries in just 48 hours to start new chapters. By comparison, TPUSA currently has “900 official college chapters and around 1,200 high school chapters, with a presence on 3,500 total,” Kolvet wrote on X.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Universally wonderful'","url":"https://dailycaller.com/2025/09/17/cenk-uygur-tpusa-event-treated-tucker-carlson-charlie-kirk-assassination/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Screenshot-2025-09-16-at-7.50.07 PM-e1758077512157.png","video":null,"publish_date":"2025-09-17 04:38:16","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","source_country":"US","sentiment":0.002},{"id":361146304,"title":"Trump’s $15B Lawsuit Against The New York Times Shows Just How Much He Craves the Spotlight","text":"Donald Trump has done it again. The President’s love for the spotlight is well known and now that he has launched a new $15 billion lawsuit against The New York Times, he has proven that he is right on track with his history of suing media outlets that published anything he did not like. \n\nHe took to Truth Social to announce the legal action, insisting the defendants aim to “tarnish his legacy of achievement, destroy his reputation as a successful businessman, and subject him to humiliation and ridicule”.\n\nTrump’s frustration appears to stem largely from the newspaper’s 2024 endorsement of Kamala Harris. As the editorial board wrote, she was “the only patriotic choice for president.” Trump claimed this endorsement featured on the print version’s front page, though that does not appear to be the case. Despite winning the 2024 election himself, Trump clearly can’t let go of the fact that The New York Times supported Harris and not him.\n\nThe lawsuit claims major grievances about how The New York Times covered his tenure on The Apprentice and his own unique appeal. The legal complaint declares, “’The Apprentice’ was a success thanks solely to President Trump’s sui generis charisma and unique business acumen.” \n\nFurther, it states, “’The Apprentice’ represented the cultural magnitude of President Trump’s singular brilliance, which captured the zeitgeist of our time.” This shows again how Trump is obsessed with himself and wants to portray himself only in a favorable light.\n\nView this post on Instagram\n\nBut The New York Times wasn’t alone in drawing Trump’s ire. The lawsuit also names Penguin Random House and various writers, focusing on the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success. Trump argues that neither this book nor the coverage in the Times properly captures his “business genius and charisma.” \n\nHe takes particular issue with the portrayal that Mark Burnett, creator of The Apprentice, discovered him. The suit snipes at the suggestion that “Burnett’s decision to work with President Trump on ‘The Apprentice’ was on par with Christopher Columbus discovering the New World circa 1492.” \n\nTrump’s legal team hinted at the idea that his image was essentially manufactured by others, a narrative that, as the lawsuit notes, is repeated in media beyond just The New York Times.\n\nView this post on Instagram\n\nPublic reaction on social media has been vivid and mostly unsympathetic. One X user jabbed, “His combover alludes to his vanity and the deeply flawed man he really is beneath the makeup. A pathetic, petty little narcissist. His only skill is his shameless self promotion.” \n\nAnother ridiculed the lawsuit as “just another billionaire tantrum to bully the free press.” The staggering dollar amount attracted ridicule as well, with one comment reading, “Does the next person he sees, get sued for 10 zillion?”\n\nThe outcome of Trump’s case remains uncertain. Legal experts point to Supreme Court precedent, which requires proof of “actual malice,” a standard practice for any public figure claiming defamation. \n\nAs of September 15, the paperwork filed in Tampa includes a request for a jury trial. Whether Trump’s quest for reputation-restoration succeeds or simply fuels further debate remains to be seen.","summary":"Trump has slammed a $15 billion lawsuit against The New York Times.","url":"https://www.inquisitr.com/trumps-15b-lawsuit-against-the-new-york-times-shows-just-how-much-he-craves-the-spotlight","image":"https://www.inquisitr.com/wp-content/uploads/2025/09/Trump-is-after-The-New-York-Times.jpg","video":null,"publish_date":"2025-09-17 04:25:32","author":"Pramila Tripathi","authors":["Pramila Tripathi"],"language":"en","category":"politics","source_country":"us","sentiment":0.135},{"id":361123116,"title":"Arnold Schwarzenegger's grim prediction for the US following Charlie Kirk's assassination","text":"Arnold Schwarzenegger shared a chilling prediction on Monday following the assassination of Charlie Kirk, a conservative political commentator who was shot dead in Utah on September 10 while debating gun control laws in the US. The Terminator star shared an impassioned speech at the University of Southern California, calling for bipartisan unity and criticizing the discourse surrounding Charlie's death. Arnold was the Governor of California from 2003 to 2011, and while he is a Republican, the actor has declared his dislike of Donald Trump on several occasions.\n\n\"I was very, very upset that someone's life was taken because they have a different opinion. I mean, it's just unbelievable,\" he said during his speech. \"It's a human being, a human life is gone. And he was a great father, a great husband and I was thinking about his children. They will only be reading about him now, instead of him reading to them bedtime stories.\"\n\nCharlie is survived by his wife, Erika Kirk, and his two young children, who were present at the time of his death. He was allegedly killed by 22-year-old Tyler Robinson, a Utah resident who disagreed with the father of two's conservative views and his stance against LGBTQIA+ rights in particular. \"We have to acknowledge that the cause of all of this is the social media companies that are dividing us, the mainstream media companies that are dividing us, the political parties…that are dividing us,\" Arnold declared.\n\n\"Each and every one of you in here can make a difference. You can show leadership. This is about leadership.\" He added that people were \"getting hit from so many different angles\" and predicted that democracy could come to an end altogether. \"We have to be very careful that we don't get closer to the cliff. Because when you fall down that cliff, down there, there is no democracy,\" the 78-year-old said.\n\n\"We have to be very, very careful. I think it is very important that we turn this around and that we show people power. Because the people can turn this around, the people have the ultimate power.\" Arnold encouraged the audience to exercise their right to vote and to \"make a difference\".\n\nArnold has never been quiet about his dislike of Donald Trump; in October 2024, just before the election, the former bodybuilder wrote a lengthy message on X endorsing Democrat Kamala Harris in the race rather than his own party. \"I don't really do endorsements. I'm not shy about sharing my views, but I hate politics and don't trust most politicians,\" he began.\n\n\"We need to close the door on this chapter of American history, and I know that former President Trump won't do that. He will divide, he will insult, he will find new ways to be more un-American than he already has been, and we, the people, will get nothing but more anger.\"\n\nArnold established a political institute at USC in 2012, which, according to the website, is \"committed to advancing post-partisanship, where leaders put people over political parties and work together to find the best ideas and solutions to benefit the people they serve.\"","summary":"Arnold Schwarzenegger condemned the killing of Charlie Kirk and called for people to band together in a powerful speech on Monday. See details.","url":"https://www.hellomagazine.com/celebrities/856262/arnold-schwarzenegger-grim-prediction-for-the-us-following-charlie-kirk-assassination/","image":"https://58v76y8z87lo.hellomagazine.com/horizon/landscape/0a4d9f73d47a-untitled-design-2025-09-17t125142480.jpg","video":null,"publish_date":"2025-09-17 02:57:21","author":"Faye James","authors":["Faye James"],"language":"en","source_country":"gb","sentiment":-0.035},{"id":361117520,"title":"Stop Left-Wing Terror Networks and Their Funding","text":"Back to Videos\n\n Hemingway: It Doesn't Stop Until The Power Of The State Is Used To Deconstruct Left-Wing Terror Networks\n\n | \n\n Posted By Ian Schwartz\n On Date September 15, 2025\n \n\n \n \n Hemingway: It Doesn't Stop Until The Power Of The State Is Used To Deconstruct Left-Wing Terror Networks0 seconds of 2 minutes, 59 secondsVolume 90%Press shift question mark to access a list of keyboard shortcutsKeyboard ShortcutsShortcuts Open/Close/ or ?Play/PauseSPACEIncrease Volume�Decrease Volume�Seek Forward�Seek Backward�Captions On/OffcFullscreen/Exit FullscreenfMute/UnmutemDecrease Caption Size-Increase Caption Size+ or =Seek %0-9\n\n Next UpJesse Watters: People Who Celebrate Charlie Kirk's Death Should Be Shunned From Society, These Sadists Walk Amongst Us04:34http://www.realclearpolitics.com/video/2025/09/15/hemingway_it_doesnt_stop_until_the_power_of_the_state_is_used_to_deconstruct_left-wing_terror_networks.htmlCopied\n\n Live00:1702:4202:59More Videos04:34Jesse Watters: People Who Celebrate Charlie Kirk's Death Should Be Shunned From Society, These Sadists Walk Amongst Us02:15Kash Patel vs. Sen. Schiff: You Are The Biggest Fraud To Ever Sit In The Senate, \"You Are A Political Buffoon At Best\"09:35Tucker Carlson: I Learned From Charlie Kirk How To Disagree With People On Topics You Take Seriously Without Hating Them03:37Fetterman: You Don't Compare Anyone To Hitler, When You Do You Will Incite Somebody To \"Take Them Out\"03:14Gutfeld Calls For Mutually Assured Destruction: \"If You Take Somebody's Life, We're Going To Take Yours\"02:32Jesse Watters: Murder Is Not About Free Speech, This Isn't Cancel Culture03:31Andy Ngo: Kirk Assassination Reveals Severe Mental Illness And \"Death Cult\" Mindset On Far Left03:27Sen. Chuck Grassley: Whistleblower Documents Show Biden's FBI Targeted Charlie Kirk And Turning Point USA03:08CNN's Enten: Popularity Of Socialism Among Democrats Is Up Like A Rocket, A Jump Of Nearly 30 Points In 15 Years01:28Stacey Abrams: We Can Not Allow Trump To Exploit Charlie Kirk's Assassination To Advance Authoritarian RuleClose \n\nFOX News contributor Mollie Hemingway reacts to the public support for the assassination of Charlie Kirk in an interview with FOX News host Laura Ingraham.\n\n\"I think a really important first step would be for the media to acknowledge that Donald Trump is a legitimate president, that his supporters are legitimate,\" Hemingway told Ingraham. \"And I actually don't think it stops though, unless the power of the state is used to deconstruct these left-wing terror networks. Look into their funding. I mean, I was pleased to see that that's happening, but people need to take it seriously before things get much worse.\"\n\nLAURA INGRAHAM: Mollie, the fact is this has been normalized and accepted and encouraged, so that's why they thought they could mess around and find out, to put it nicely.\n\nMOLLIE HEMINGWAY: Well, we've had many years now of a lot of corporate media and even prominent Democrats saying that they could not normalize Republicans, they couldn't normalize Donald Trump.\n\nLAURA INGRAHAM: He was subhuman.\n\nMOLLIE HEMINGWAY: Right. And, and, you know, you had President Biden give that really awful speech where he declared half of the country was, you know, beneath contempt. Really bad behavior that has led people to think that it was okay to do this.\n\nThere are many reasons why you cannot tolerate public support for the assassination of a citizen for his political...\n\nLAURA INGRAHAM: How is this not cancel culture, then, Mollie?\n\nMOLLIE HEMINGWAY: People say it's cancel culture, which usually refers to when a teenager tweeted something and then ten years later he gets fired, or someone makes a joke that's misunderstood, you know, something like that. Public support for assassination of U.S. citizens for their political beliefs is actually just on its face immoral. You cannot, you cannot tolerate that.\n\nThere also are all sorts of other reasons. Shows an inability to control oneself that employers really aren't going to want to see in, you know, teachers, doctors. Obviously no member of the military can support the assassination of, of conservatives because they don't like their political beliefs.\n\nThat is a total violation of their oath. So I think actually it's important that people understand that things have gone way too far and there needs to be a correction. And I do think most of the country is unified against this left-wing terrorism, but --\n\nLAURA INGRAHAM: I, I, I think you're right, however, Ari, and I want you in on this. I do believe that there is a core group of hateful, well-connected individuals who are extremely influential, who behind closed doors, I can't imagine what they'd say behind closed doors, but in public they were celebrating this. And I don't think we should sweep it under the rug and just say, oh, it's just a, they're popping off.\n\nIt's a, you know, and I'm not saying you were doing that at all, but I'm just saying this, this is a sickness that has been encouraged and fed by our culture and our highest ranking politicians.\n\nARI FLESICHER: That core group is led by Democratic leaders and that's the problem. They didn't come out and advocate or endorse murder, but what they did do is call Donald Trump a fascist. When asked point blank, Kamala Harris said he is a fascist. Her vice presidential running mate said the same thing. Joe Biden said he's an existential threat to democracy. These are the types of things that politicians say that has got to stop.\n\nLAURA INGRAHAM: Mollie, is it going to stop? \n\nMOLLIE HEMINGWAY: Well, I think a really important first step would be for the media to acknowledge that Donald Trump is a legitimate president, that his supporters are legitimate. And I actually don't think it stops though, unless the power of the state is used to deconstruct these left-wing terror networks. Look into their funding. I mean, I was pleased to see that that's happening, but people need to take it seriously before things get much worse.\n\nLAURA INGRAHAM: Disassemble them one by one.\n\n Recommended\n\n \n\n Brit Hume: Outpouring For Charlie Kirk Shows He Had A Much Bigger Impact On The Country Than We May Have Known\n\n September 15, 2025\n\n FOX News senior political analyst Brit Hume addressed the political and religious impact of the assassination of conservative activist Charlie Kirk on Monday's broadcast of \"Special Report.\"\n\n\"This outpouring that we're hearing, which as you noted earlier even is occurring overseas, is really...\n \n Brit HumeBRET BAIERcharlie kirkDonald Trump\n \n\n \n\n Tucker Carlson: I Learned From Charlie Kirk How To Disagree With People On Topics You Take Seriously Without Hating Them\n\n September 15, 2025\n\n Tucker Carlson remembers Charlie Kirk on a special edition of \"The Charlie Kirk Show\" hosted by Vice President J.D. Vance.\n\nVICE PRESIDENT J.D. VANCE: Welcome back to the Charlie Kirk Show. Joining me now is my friend and a close friend of Charlie, the great Tucker Carlson. Tucker, thank you so...\n \n Tucker Carlsoncharlie kirkJ.D. Vance\n \n\n \n\n Jesse Watters: People Who Celebrate Charlie Kirk's Death Should Be Shunned From Society, These Sadists Walk Amongst Us\n\n September 15, 2025\n\n FOX News Channel host Jesse Watters delivered a monologue on Monday's \"Jesse Watters Tonight\" on how society should handle people who celebrate the assassination of Charlie Kirk.\n\nJESSE WATTERS, FOX NEWS: That last lady got arrested and expelled from school. Let that be a lesson to everyone out...\n \n Jesse Watterscharlie kirk\n \n\n \n\n Halperin: Turning Point USA Has The Potential To Become Part Of The Culture, Revolutionize Things\n\n September 15, 2025\n\n 2Way hosts Mark Halperin, Sean Spicer, and Dan Turrentine discuss the reaction to Charlie Kirk's assassination.\n\nMARK HALPERIN, 2WAY: First of all, this will increase the power of J.D. Vance within the Republican Party because of his closeness to Charlie. To the extent you didn't think he was the...\n \n Mark Halperincharlie kirk\n \n\nRelated Topics: Mollie Hemingway, Charlie Kirk, Laura Ingraham\n\n Send Tips\n\n Follow Us\n\n Latest Political Videos","summary":"","url":"https://www.realclearpolitics.com/video/2025/09/15/hemingway_it_doesnt_stop_until_the_power_of_the_state_is_used_to_deconstruct_left-wing_terror_networks.html","image":"https://assets.realclear.com/images/69/696534_5_.jpg","video":null,"publish_date":"2025-09-17 02:36:07","author":"FOX News,Ian Schwartz,Mollie Hemingway","authors":["FOX News","Ian Schwartz","Mollie Hemingway"],"language":"en","source_country":"US","sentiment":-0.447},{"id":361153830,"title":"Trump Sues New York Times for Defamation, Libel, Demands $15bn","text":"Emmanuel Addeh in Abuja\n\nPresident Donald Trump has sued the New York Times, four of its reporters, and publisher Penguin Random House for at least $15 billion, claiming defamation and libel, and citing reputational damage, a Florida court filing showed.\n\nTrump’s suit cited a series of New York Times articles, an editorial prior to the 2024 presidential election, which said he was unfit for office, and a 2024 book published by Penguin titled “Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success”.\n\n“Defendants maliciously published the Book and the Articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump,” according to the filing lodged on Monday in the U.S. District Court, Middle District Florida.\n\nThe New York Times and Penguin did not immediately respond to a request for comment outside regular business hours, Reuters reported.\n\nThe publications have harmed Trump’s business and personal reputation, thereby causing massive economic damage to his brand value and significant damage to his future financial prospects, Trump’s lawyers said in the filing.\n\n“The harm to the value of TMTG (Trump Media and Technology Group) stock is one example of how the Defendants’ defamation has injured President Trump,” said his lawyers, citing “a precipitous decline in the stock price.”\n\nTMTG stock has been under pressure in recent months fueled by worries about the end of a so-called lock-up period related to its stock market debut in March.\n\nThe filing comes after Trump threatened last week to sue the New York Times for its reporting on an allegedly sexually suggestive note and drawing given to Jeffrey Epstein.\n\nEpstein, the disgraced financier and sex offender, died by suicide in a New York jail cell in 2019.\n\nTrump has said he parted ways with Epstein before the financier’s legal troubles became public in 2006.\n\n“Today, I have the Great Honour of bringing a $15 billion Defamation and Libel Lawsuit against The New York Times,” Trump said earlier on Monday in a post on his social media platform Truth Social.\n\nIn his post, Trump accused the paper of lying about him, his family and businesses, as well as Republican-led movements and ideologies such as the America First Movement, and Make America Great Again, or MAGA.\n\nIn his second term, Trump has intensified his crackdown against media companies. Earlier this year he sued the Wall Street Journal and its owners, including Rupert Murdoch, for at least $10 billion over the newspaper’s report that his name was on a 2003 birthday greeting for Epstein.\n\nIn July, CBS parent company Paramount agreed to settle a lawsuit filed by Trump alleging that the CBS news program “60 Minutes” deceptively edited an interview with former Vice President Kamala Harris that the network broadcast in October.","summary":"Emmanuel Addeh in Abuja President Donald Trump has sued the New York Times, four of its reporters, and publisher Penguin Random House for at least $15 billion, claiming defamation and\n\n\nThe post Trump Sues New York Times for Defamation, Libel, Demands $15bn appeared first on THISDAYLIVE.","url":"https://www.thisdaylive.com/2025/09/17/trump-sues-new-york-times-for-defamation-libel-demands-15bn/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Donald-Trump-1.gif","video":null,"publish_date":"2025-09-17 02:31:37","author":"Adeyinka Salami","authors":["Adeyinka Salami"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.048},{"id":361116948,"title":"Michael Goodwin: Cowardly Kathy Hochul kowtowing to Mamdani proves Dems will always put their party ahead of NYC’s well-being","text":"The race to jump off the cliff is on, as top New York Democrats line up like so many lemmings to back Zohran Mamdani.\n\nSpare me the expressions of shock. \n\nIt was only a matter of time until they all fell in line.\n\nBeing an elected Dem means accepting the rule that thinking for yourself is not allowed. \n\nFollowing orders in the name of party unity is the price of admission.\n\nThe appearance of a wall of resistance against Mamdani because of his radical positions was shattered when Gov. Hochul waved a white flag and backed the antisemitic, cop-hating socialist.\n\nThe Post report that Assembly Speaker Carl Heastie will soon do the same puts pressure on other prominent holdouts to join the mob.\n\nNeither Sen. Chuck Schumer nor Rep. Hakeem Jeffries is a profile in courage, so expect their surrender any day now. \n\nNo matter how they frame it, the truth is that they will be putting party loyalty over the well-being of New York.\n\nFinancial dead end\n\nWith a Republican president and Republicans holding both chambers of Congress, backing a socialist is a dead-end idea that will undercut any bids by the city for added federal support.\n\nPresident Trump has made it clear he wants to help New York, but state leaders keep treating him like an enemy. \n\nAs such, they are playing to the nutjobs in their party instead of abiding by their oaths to represent all the people of the city and state.\n\nHochul’s backing of Mamdani is a prime example.\n\nHer tortured explanations were more pathetic than her usual gibberish, and indicate she didn’t win a single concession from him that would change the impact of his destructive policies if he’s elected.\n\nShe previously said she would not support Mamdani’s call for tax increases and his plan to open government supermarkets in each of the five boroughs. \n\nThere was no mention of either in her published endorsement.\n\nShe explained herself in part by denouncing Trump, and wrote “I needed to know the next mayor will not be someone who would surrender one inch” to the president.\n\nWhat a strange thing to say. \n\nBet your bottom dollar that before long, Hochul will be on bended knee in the Oval Office, rattling the tin cup for federal help.\n\nWhat she lacks in common sense she makes up for in shamelessness.\n\nShe defended her endorsement by saying she is confident Mamdani “has the courage, urgency and optimism New York City needs to lead it through the challenges of this moment.”\n\nThat makes no sense if she -really does object to his policies on taxes, police, rent freezes, government stores and a deep hate for Israel.\n\nIt is beyond obvious that her motive is purely personal. \n\nFirst, she faces a possible far-left primary challenge next year from her wayward lieutenant governor, -Antonio Delgado.\n\nHowever, I believe Hochul is far more worried about next year’s general election.\n\nShe’s essentially betting that Mamdani will be the sitting mayor next fall, will endorse her and use his office to turn out the vote to secure her victory.\n\nThe basis for that scenario is that Republicans have not won a statewide race since 2002, when George Pataki won his third term as governor.\n\nSince then, Dems have consistently won statewide races by running up big margins in the city while still losing the vast majority of the state’s 62 counties.\n\nTake the case of then-Rep. Lee Zeldin, Hochul’s GOP opponent in 2022. \n\nHe was very focused on the historic pattern, and once told me his only chance of winning was to get close to 35% of the vote in the five boroughs and run up big margins in less populated -Republican areas.\n\nZeldin ran a spirited campaign and won most of the counties, including Long Island’s Nassau and Suffolk, but got only 30% of the city vote, and lost the state by five points.\n\nThe 30% city vote is something of a ceiling for Republicans these days, with Trump matching it during his 2024 election. \n\nAlthough the president got nearly 44% in the state overall, Kamala Harris got 70% in the city, which provided enough of a cushion for her to win New York’s 28 electoral votes.\n\nThe election of 1984, when -Ronald Reagan won 49 states, is the last time the Empire State backed a Republican for president.\n\nHochul’s sagging polls\n\nHochul’s tax-and-spend habits and weak leadership led to sagging poll numbers for most of the last two years, which raised GOP hopes for 2026. \n\nAt least three GOP officials have tested the waters, with upstate Rep. Elise Stefanik now considered the most likely nominee.\n\nYet a Siena poll released Tuesday brought bad news for Stefanik, with Hochul holding a 25-point margin in a face-off, 52% to 27%. \n\nAlthough independents -favored Stefanik last month, Hochul now has their support by 18 points, Siena reports.\n\nThe findings underscore how important it is that enough city voters come to their senses and back an alternative to Mamdani this year.\n\nThe problem, of course, remains that his three main opponents are dividing the anti-Mamdani vote.\n\nWith former Gov. Andrew Cuomo consistently running second, Trump has tried to convince the other two candidates, Mayor -Adams and Republican nominee Curtis Sliwa, to drop out.\n\nI have long believed Cuomo would have the best chance at victory in a one-on-one showdown, but with Adams and Sliwa vowing to stay in, Mamdani is on course to capture City Hall.\n\nHeaven help New York.\n\n‘Question’able defense\n\nSoon after President Trump filed a lawsuit charging The New York Times with defamation and libel, the paper’s publisher sent an in-house note to staff members.\n\nIn it, A.G. Sulzberger called the suit “frivolous,” said it has “no legal merit” and is “an attempt to punish independent reporting.”\n\nHe adds “we are confident in our journalism and confident in the First Amendment protections.”\n\nHe goes on to say “everyone, regardless of their politics, should be troubled by the growing anti-press campaign led by President Trump and his administration, which challenges not just journalists but our right to ask questions on behalf of the American people.”\n\nIn fact, Trump isn’t challenging the right to ask questions, and he answers more media questions than any president in memory. Sulzberger never complained about Hidin’ Joe Biden.\n\nThe real issue is that the Times abandoned all standards of fairness to get Trump the minute he entered politics in 2015. \n\nIts coverage reflects an obvious desire to destroy him personally and politically.\n\nThe First Amendment may protect that, and I hope it does. \n\nBut no honest person can possibly believe the paper’s coverage of Trump is remotely close to fair and balanced.\n\nThe Gray Lady has become a nasty, leftist propaganda outlet on Sulzberger’s watch. \n\nFor that, he has nobody to blame but himself.","summary":"The race to jump off the cliff is on, as top New York Democrats line up like so many lemmings to back Zohran Mamdani.","url":"https://nypost.com/2025/09/16/opinion/hochul-kowtowing-to-mamdani-shows-dems-will-put-party-ahead-of-nycs-well-being/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/091025-nyc-mayoral-candidate-zohran-111089708_656a54-e1758073090150.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-09-17 02:28:05","author":"Michael Goodwin","authors":["Michael Goodwin"],"language":"en","source_country":"zm","sentiment":-0.22},{"id":361132194,"title":"Taylor Swift is terrified of Charlie Kirk 'retaliation' attack against HER... as friends tell of 'legitimate threats' and why she really hid behind that bulletproof screen","text":"Strolling into stadiums before swigging from red solo cups with her A-list entourage and mother-in-law to-be Donna Kelce, Taylor Swift was once at risk of overshadowing her boyfriend's NFL games.\n\nBut it was a far more muted affair on Sunday, with the pop star shielded behind what is believed to have been a bullet-resistant screen as she was sneaked into the Arrowhead Stadium to watch Travis Kelce's Kansas City Chiefs take on the Philadelphia Eagles.\n\nVideo showed security guards quickly unfolding the giant protective barrier to ensure that Swift, 35, could slip into Arrowhead unseen.\n\nThe clip - coupled with the absence of any pictures of Swift cheering in her usual private stadium suite - sparked a frenzy of speculation. The loudest whisper: Was she hiding a pregnancy bump?\n\nIt is understood that even the Chiefs players were warned in advance that there would be heightened security at the game, but were offered no explanation why.\n\nNow, insiders have told the Daily Mail the full story.\n\nOne insider pointed to increased tensions in the wake of Charlie Kirk's murder, just days before the game.\n\n'If someone is going to do a tit-for-tat for Charlie Kirk, Taylor is a pretty logical choice,' the insider said. 'They used the screen to keep her safe. They have used that screen before, but usually it is for the President or someone like that, not a celebrity. But this was a weird week.'\n\n31-year-old conservative activist Kirk was assassinated by a gunman last Wednesday while speaking at Utah Valley University.\n\nMeanwhile, Swift is a known liberal who has backed the last two Democratic Party candidates, in the 2020 and 2024 presidential elections.\n\nKirk even spoke about Swift a fornight before his death, remarking on her recent engagement to tight end Kelce, 35. \n\n'This is something that I hope will make Taylor Swift more conservative,' he said, before adding that the singer should 'submit' to her future husband.\n\nKirk also controversially said the burly sporstman could 'de-radicalize' Swift from being 'a cat lady to a JD Vance supporter.'\n\nFor her part, Swift is said to have been left in shock at Kirk's very public assassination. And it is that trauma, coupled with her ongoing issues of stalking, that has meant those around her are not 'taking any chances' when it comes to safety.\n\n'Taylor had concerns because she has received hate mail from the same kinds of extreme groups,' said another insider. 'Charlie's murder, and the weirdness with her stalkers, is why she will take serious measures to increase her security and only a core group of people know what her schedule is.\n\n'She was targeted by far-right extremist groups after going against Trump [by endorsing Kamala Harris] and there are legitimate concerns about some of the threats that have been made. They aren't taking any chances.'\n\nIn August last year, Swift found herself the target of a foiled terror attack in Vienna, Austria, and was forced to cancel three of her 'Eras' world tour dates in the capital. She later said the incident filled her with a 'new sense of fear.'\n\nIt came days after three young girls were tragically knifed to death while at a Taylor Swift-themed dance class in Southport, England.\n\nSwift has also found herself the target of multiple male stalkers.\n\nMost recently, she was granted a restraining order against Colorado man Jason Brain Wagner, who sent hundreds of emails and showed up at Swift's in Los Angeles multiple times.\n\nOther stalkers have sickeningly threatened her with rape and murder over the years, with some even trying to break into her New York residence.\n\nThe incidents have understandably left Swift on high alert, with the singer previously revealing that she always carries QuikClot – army grade bandage dressing – 'for gunshot or stab wounds.'\n\n'You get enough stalkers trying to break into your house and you kind of start prepping for bad things,' she said in 2019.\n\nThat fear of violence is shared by her 73-year-old father Scott Swift, who said he was so 'terrified' about his daughter's safety after throw her support behind two Democratic candidates in her home state of Tennessee in late 2018, that he 'went out and bought armored cars.'\n\nSwift endorsed Harris back in September last year, prompting Trump to hit back saying he 'was not a Taylor fan' and declaring 'she'll probably pay a price for it in the marketplace.'\n\nThe president later went so far as to say that he 'hates' her. \n\nWith an increasingly divisive political landscape and with millions following her every move, Swift 'just wants to be safe', her friends say.\n\n'She took these precautions because the world right now is totally screwed up and she not only wants to protect herself but everyone that she surrounds herself with,' another insider said of the bulletproof screen.\n\n'To take these precautions now is nothing new, she always has security by her side, and she isn't going to start taking any chances now.","summary":"She shielded behind a bullet-resistant screen as she was sneaked into the Arrowhead Stadium on Sunday to watch Travis Kelce's Kansas City Chiefs take on the Philadelphia Eagles.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15103291/Taylor-Swift-bulletproof-Travis-Kelce-security-charlie-kirk.html","image":"https://i.dailymail.co.uk/1s/2025/09/16/12/102178861-0-image-m-32_1758023803341.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/29/2508498827339936449/1024x576_MP4_2508498827339936449.mp4","publish_date":"2025-09-17 02:25:36","author":"Editor,Emma Powell,Russ Weakland,Steve Helling","authors":["Editor","Emma Powell","Russ Weakland","Steve Helling"],"language":"en","source_country":"gb","sentiment":-0.129},{"id":361112846,"title":"‘We Are Not Doing That’: CNN Host Tries To Stop Scott Jennings As He Shares His Thoughts About Political Violence","text":"CNN host Kasie Hunt tried to interrupt Republican strategist Scott Jennings Tuesday during “The Arena” as he pointed out that Democratic Pennsylvania Gov. Josh Shapiro failed to mention the political ideology of the suspect who attempted to burn his house down.\n\nEarlier on Tuesday, Shapiro spoke at the Eradicate Hate Global Summit in Pittsburgh, saying that political violence “has no place in our society, regardless of what motivates it.” Shapiro briefly mentioned the attack on his home in April. Hunt asked Jennings if Shapiro “has got a point” advocating against political violence. (RELATED: Democrat Rep Tells CNN That Labeling GOP ‘Fascist’ Or ‘Hitler’ Doesn’t Incite People)\n\n“Well, I think his point would be strengthened if he were honest today about who burned his house down. It was a free Palestine leftist who came and burned down the governor’s mansion. He left that out. He left that out of his tweet today,” Jennings said. “He’s talking about cherry picking political violence. And we’re talking about where there might be political violence. The violence against the governor of Pennsylvania and his family came from the left.”\n\n“I think there’s a rush by Democrats who want to be president in 2028 to try to turn. Somehow Donald Trump’s friend gets shot,” Jennings added. “Now everybody wants to blame Donald Trump for it. I guess that’s what you have to do to get elected president as a Democrat.”\n\nIn April, officials arrested a self-proclaimed socialist who supported the Black Lives Matter movement, Cody Balmer, after he turned himself in for attempting to burn down Shapiro’s official residence. Balmer was charged with attempted murder, terrorism, aggravated arson and burglary.\n\nHunt then cut in as Jennings spoke, saying, “We are not doing that sitting here,” and directed CNN’s Kate Bedingfield to respond. Jennings pushed back, however, asking, “Is that not what’s happening?” Bedingfield replied and said “it doesn’t matter where the violence came from.”\n\n“To sit here and suggest that somehow him not mentioning it was some sort of sleight of hand to try to make it seem like it was … you missed the entire point of what he was saying,” Bedingfield said. “And it’s a message that is badly, badly needed in this country at this moment.”\n\nJennings responded.\n\n“Look, I think that if we cannot be honest, if I were him and somebody tried to burn my house down,” Jennings said. “I think I’d be honest about who did it and why they did it. And it would matter for people to know that, would it not?”\n\nTurning Point USA founder Charlie Kirk was assassinated last week. Hundreds of leftists, including educators, have been fired after publicly celebrating his murder. Some Democrats — along with others who ridiculed Kirk’s supporters — were quick to blame President Donald Trump and Republicans for the crime.\n\nHunt asked Jennings if his message wasn’t one that encouraged people to “rise above,” adding, “because anyone that is committing an act of political violence, who is trying to kill someone else for what they believe in, it’s like it is inherently wrong and awful.”\n\n“Why are your two impulses mutually exclusive? Why can’t we all say all political violence is bad, which I wholeheartedly believe, and also be honest when people have clear intentions?” Jennings asked. “I think there’s a difference between people that have clear intentions and clearly deranged people. But in the case of Shapiro, and I think in the case of Charlie Kirk, we know the intentions, the political intentions, [from] the people at play.”\n\n“When we sort of skirt around it, and we’re not honest about it, we let it off the hook. And I don’t think we should let people with clear political intentions to commit violence off the hook,” Jennings said. “So I like what he said about condemning violence. I just would like it a little more if we could just be a little bit honest about what happened at his home.”\n\nTensions between Republicans and Democrats increased during the 2024 presidential election cycle. Corporate media and the campaign of former Vice President Kamala Harris escalated their rhetoric against Trump. Trump was called a fascist by Harris, with former President Joe Biden saying Trump should be locked up.\n\nAccording to a recent Napolitan News Service poll, data shows 26% of those aged 18 to 34 believe America is “better off now that Charlie Kirk has been killed,” despite saying “it is always difficult to wish ill of another human being.” Among Democrats, 24% agreed with the sentiment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Came from the left'","url":"https://dailycaller.com/2025/09/16/cnn-host-kasie-hunt-attempts-halt-scott-jennings-democrats-josh-shapiro/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/09/Untitled-design-1-1-e1758065109933.jpg","video":null,"publish_date":"2025-09-17 01:26:48","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.601},{"id":361119738,"title":"It’s her first fashion week but Elon Musk’s daughter is taking it in her stride","text":"And at the presentation for accessories designer Alexis Bittar, she took part in a mock Miss USA pageant – an obvious reference to President Donald Trump, her father’s sometimes-ally, who owned that pageant from 1996 to 2015. Every contestant in the pageant was a trans woman, and all of them wore sashes from red states. Wilson played a bratty Miss South Carolina who scoffed, sneered and rolled her eyes when she lost to Miss Louisiana, played by trans activist and model Gia Love.\n\nCatching up with her backstage at Monday’s Chris Habana show – her fourth in as many days – Wilson listed her mental order of operations for a successful runway walk.\n\n“Don’t trip, don’t die, serve c---, slay,” she said. “I think in that order.”\n\nLast September, the political statements at New York Fashion Week were overt: the hot accessory was a camouflage Harris/Walz hat; Batsheva showed “Cat Lady” sweatshirts and Prabal Gurung sent a coconut tree dress down the runway in an apparent reference to a Kamala Harris meme. The Council of Fashion Designers of America sponsored a get-out-the-vote march, and Jill Biden addressed the crowd.","summary":"A mock Miss USA pageant, bolting down the runway and references to transgender rights: Vivian Wilson’s first foray at New York Fashion Week was anything but ordinary.","url":"https://www.smh.com.au/lifestyle/fashion/it-s-her-first-fashion-week-but-elon-musk-s-daughter-is-taking-it-in-her-stride-20250917-p5mvo1.html","image":"https://static.ffx.io/images/$zoom_0.2391%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_241%2C$y_2/t_crop_custom/q_86%2Cf_auto/fa89d58e07a11fa279ad54858517dc56841a7a18","video":null,"publish_date":"2025-09-17 00:28:28","author":"Maura Judkis","authors":["Maura Judkis"],"language":"en","source_country":"au","sentiment":0.03},{"id":361120104,"title":"It’s her first fashion week but Elon Musk’s daughter is taking it in her stride","text":"And at the presentation for accessories designer Alexis Bittar, she took part in a mock Miss USA pageant – an obvious reference to President Donald Trump, her father’s sometimes-ally, who owned that pageant from 1996 to 2015. Every contestant in the pageant was a trans woman, and all of them wore sashes from red states. Wilson played a bratty Miss South Carolina who scoffed, sneered and rolled her eyes when she lost to Miss Louisiana, played by trans activist and model Gia Love.\n\nCatching up with her backstage at Monday’s Chris Habana show – her fourth in as many days – Wilson listed her mental order of operations for a successful runway walk.\n\n“Don’t trip, don’t die, serve c---, slay,” she said. “I think in that order.”\n\nLast September, the political statements at New York Fashion Week were overt: the hot accessory was a camouflage Harris/Walz hat; Batsheva showed “Cat Lady” sweatshirts and Prabal Gurung sent a coconut tree dress down the runway in an apparent reference to a Kamala Harris meme. The Council of Fashion Designers of America sponsored a get-out-the-vote march, and Jill Biden addressed the crowd.","summary":"A mock Miss USA pageant, bolting down the runway and references to transgender rights: Vivian Wilson’s first foray at New York Fashion Week was anything but ordinary.","url":"https://www.theage.com.au/lifestyle/fashion/it-s-her-first-fashion-week-but-elon-musk-s-daughter-is-taking-it-in-her-stride-20250917-p5mvo1.html","image":"https://static.ffx.io/images/$zoom_0.2391%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_241%2C$y_2/t_crop_custom/q_86%2Cf_auto/fa89d58e07a11fa279ad54858517dc56841a7a18","video":null,"publish_date":"2025-09-17 00:28:28","author":"Maura Judkis","authors":["Maura Judkis"],"language":"en","source_country":"au","sentiment":0.03},{"id":361098704,"title":"It’s her first fashion week but Elon Musk’s daughter is taking it in her stride","text":"And at the presentation for accessories designer Alexis Bittar, she took part in a mock Miss USA pageant – an obvious reference to President Donald Trump, her father’s sometimes-ally, who owned that pageant from 1996 to 2015. Every contestant in the pageant was a trans woman, and all of them wore sashes from red states. Wilson played a bratty Miss South Carolina who scoffed, sneered and rolled her eyes when she lost to Miss Louisiana, played by trans activist and model Gia Love.\n\nCatching up with her backstage at Monday’s Chris Habana show – her fourth in as many days – Wilson listed her mental order of operations for a successful runway walk.\n\n“Don’t trip, don’t die, serve c---, slay,” she said. “I think in that order.”\n\nLast September, the political statements at New York Fashion Week were overt: the hot accessory was a camouflage Harris/Walz hat; Batsheva showed “Cat Lady” sweatshirts and Prabal Gurung sent a coconut tree dress down the runway in an apparent reference to a Kamala Harris meme. The Council of Fashion Designers of America sponsored a get-out-the-vote march, and Jill Biden addressed the crowd.","summary":"A mock Miss USA pageant, bolting down the runway and references to transgender rights: Vivian Wilson’s first foray at New York Fashion Week was anything but ordinary.","url":"https://www.brisbanetimes.com.au/lifestyle/fashion/it-s-her-first-fashion-week-but-elon-musk-s-daughter-is-taking-it-in-her-stride-20250917-p5mvo1.html","image":"https://static.ffx.io/images/$zoom_0.2391%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_241%2C$y_2/t_crop_custom/q_86%2Cf_auto/fa89d58e07a11fa279ad54858517dc56841a7a18","video":null,"publish_date":"2025-09-17 00:28:28","author":"Maura Judkis","authors":["Maura Judkis"],"language":"en","source_country":"au","sentiment":0.03},{"id":361101190,"title":"'Lucky Loser': Trump's 'psychotic' NYT lawsuit ridiculed by legal experts","text":"US President Donald Trump on Monday evening filed a defamation lawsuit against The New York Times that was quickly ridiculed by legal experts for entirely lacking merit.\n\nIn the lawsuit, Trump accused the Times of conspiring to prevent his victory in the 2024 election through a campaign of “election interference” that included, among other things, its editorial board’s decision to endorse former Vice President Kamala Harris.\n\n“It came as no surprise when, shortly before the election, the newspaper published, on the front page, highlighted in a location never seen before, its deranged endorsement of Kamala Harris with the hyperbolic opening line ‘[i]t is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump,‘” the lawsuit states.\n\nPointing to what it claimed was defamatory material published by the Times, the lawsuit singled out “a malicious, defamatory, and disparaging book written by two of its reporters and three false, malicious, defamatory, and disparaging articles, all carefully crafted by Defendants, with actual malice, calculated to inflict maximum damage upon President Trump.”\n\nThe book in question is ”Lucky Loser,” written by Pulitzer Prize-winning Times reporters Russ Buettner and Susanne Craig, which did a deep examination of the president’s finances and contrasted it with what it described as his false claims of unprecedented success in business.\n\nThe three articles cited by the lawsuit include one that quotes Trump’s own former chief of staff, John Kelly, warning that he would rule “like a dictator” in his second term; a news analysis piece that described Trump as facing a well documented “lifetime of scandals”; and an article by Buettner and Craig that is an adapted excerpt from their book.\n\n“The book and articles are part of a decades-long pattern by The New York Times of intentional and malicious defamation against President Trump,” the complaint stated. “Defendants maliciously published the book and the articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump.”\n\nThe lawsuit then demanded the Times pay $15 billion in compensatory damages.\n\nThe Times issued a brief response to the lawsuit in which it defended its reporting and labeled Trump’s defamation allegations as baseless.\n\n“This lawsuit has no merit,” said the paper. “It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favor and stand up for journalists’ First Amendment right to ask questions on behalf of the American people.”\n\nSome experts who examined the lawsuit were quick to side with the Times in this dispute, and many of them flat-out ridiculed Trump for filing the suit in the first place.\n\nHolger Hestermeyer, chair of international and EU law at the Vienna School of International Studies, wrote on Bluesky that the lawsuit was “a full frontal attack on free speech” that also “almost reads like a parody.”\n\nIn addition to lampooning the suit’s specific defamation claims, Hestermeyer also mocked the suit for being loaded with hyperbolic statements, including one that said “The Apprentice” reality TV series “represented the cultural magnitude of President Trump’s singular brilliance, which captured the zeitgeist of our time.”\n\nAttorney George Conway delivered an even pithier dismissal of the suit.\n\n“Is it possible for a legal pleading to be psychotic?” he asked rhetorically. “I think we have an answer.”\n\nChris Geidner, a journalist who publishes the “Law Dork” newsletter, similarly expressed astonishment at the contents of Trump’s lawsuit.\n\n“I honestly thought there was a chance that I’d fallen asleep and was dreaming the most absurd, childlike, ego-maniac lawsuit when I tried to read this Trump defamation complaint against the Times, Penguin Random House, and individual journalists,” he wrote. “Like, seriously. What are we even doing here, folks?”\n\nBloomberg columnist Tim O’Brien, who was unsuccessfully sued by Trump for defamation over his 2005 book “TrumpNation,” predicted that Trump’s lawsuit against the Times would similarly end poorly for him.\n\n“Trump says he plans to sue the Times for $15 billion,” O’Brien wrote on Bluesky. “Been there, done that. He sued me for less—$5 billion. Discovery will be invasive and grueling—and involve Trump’s finances, family history and political machinations. And that’s just for starters.”","summary":"US President Donald Trump on Monday evening filed a defamation lawsuit against The New York Times that was quickly ridiculed by legal experts for entirely lacking merit.\n\nIn the lawsuit, Trump accused the Times of conspiring to prevent his victory in the 2024 election through a campaign of “election interference” that included, among other things, its editorial board’s decision to endorse former Vice President Kamala Harris.\n\n\n“It came as no surprise when, shortly before the election, the newspaper published, on the front page, highlighted in a location never seen before, its deranged endorsement of Kamala Harris with the hyperbolic opening line ‘[i]t is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump,‘” the lawsuit states.\n\nPointing to what it claimed was defamatory material published by the Times, the lawsuit singled out “a malicious, defamatory, and disparaging book written by two of its reporters and three false, malicious, defamatory, and disparaging","url":"https://www.alternet.org/lucky-loser-lawsuit/","image":"https://www.alternet.org/media-library/image.jpg?id=60752331&width=1200&height=600&coordinates=0%2C270%2C0%2C270","video":null,"publish_date":"2025-09-16 22:58:31","author":"Brad Reed","authors":["Brad Reed"],"language":"en","category":"politics","source_country":"us","sentiment":-0.106},{"id":361320750,"title":"Report: Joe Biden facing post-presidency with far fewer economic options than other presidents","text":"It seems like the cash flow the Biden family members enjoyed during his years in power in Washington now is only a trickle.\n\nWND reported some weeks ago that former First Son Hunter Biden, documented by congressional investigators to be among the Biden family recipients of tens of millions of dollars in a years-long influence peddling operation while Joe Biden was vice president, then president, was claiming of a lack of money.\n\nA report in the New York Post at the time explained the 55-year-old was pleading with a judge to dismiss one of his lawsuits because he was too broke to continue it.\n\nHunter Biden cited plunging sales of his artwork, a lack of interest in his book, and “significant” debt.\n\nHe said in a court filing, “[Hunter] has suffered a significant downturn in his income and has significant debt in the millions of dollars range.”\n\nHe said he knew his “financial position” was deteriorating, then suddenly realized action had to be taken.\n\n“In the 2 to 3 years prior to December 2023, I sold 27 pieces for art at an average price of $54,481.48, but since then I have only sold 1 piece of art for $36,000. Similarly, for my book sales, in the six month period before the statements (April 1, 2023 through September 30, 2023), based on the September 30, 2023 statement, 3,161 copies of my book were sold, but in the six months after the statements, only approximately 1,100 books were sold.”\n\nAnd he’s not getting any invitations for those speeches, which often bring big paychecks.\n\nNow a new report from the Wall Street Journal points out that Hunter Biden isn’t alone: Joe Biden isn’t having a great time financially either.\n\nIn fact, that publication said Joe Biden’s “post-presidency” is “less lucrative than what he had expected.”\n\nAfter two terms as vice president, and one as president, his current reality is “a leaner next chapter that lacks the well-funded foundations, plans for exquisite libraries and full calendar of paid speeches.”\n\nAll of those perks have been delivered for other former presidents.\n\nHe’s taking American Airlines flights instead of private jets, and while paid speaking engagements can generate $300,000 or more, they are “limited, and at least one organization tried to negotiate below that range.”\n\nHe has said he intends to pay off some $800,000 in personal debt, including loans on one of his homes, the Rehoboth Beach house.\n\n“On top of bills for his son Hunter Biden’s legal woes, Biden also wanted to help his daughter Ashley, who filed for divorce last month, and ensure money is left for his grandchildren, people close to the Bidens said,” according to the report.\n\nThere is a $10 million book deal that will provide some financial boost, and he gets pensions from taxpayers of more than $400,000 a year.\n\nOne publication source said if the family keeps a “modest-for-the-powerful” lifestyle, things will work out.\n\nBut Hunter Biden recently delivered a round of harsh statements on podcasts, “including one that triggered a lawsuit threat from First Lady Melania Trump.”\n\nOne recent appearance for Joe Biden was to SHRM, a lobbying organization, which reportedly had offered $275,000 for his appearance, eventually agreeing to the $300,000 that was at the low end of the requested range.\n\nAnd Joe Biden’s “memoir” was sold to the Hachette Book Group for a payment in the range of $10 million, only a fraction of what the Obamas secured when they left the White House.\n\nEven social media has noticed:\n\nJoe Biden is mired in debt and struggling to secure income\nSince leaving office, the former U.S. president has faced serious challenges. His book deal was far smaller than those of his predecessors, he is weighed down by debts—his own and his son’s—and he is having difficulty… pic.twitter.com/8HguW9jNVd\n— Gameover️ (@EricS2075) September 16, 2025\n\nOne big change is what investigators have bluntly called a pay-for-play scheme run by family members for years but no longer generates any revenue, as Joe Biden is out of power in the U.S.\n\nCOMER: We have “uncovered a mountain of evidence, revealing how Joe Biden abused his public office for his family’s financial gain. For years, President Biden has lied to the American people about his knowledge of and participation in his family’s corrupt business schemes.” pic.twitter.com/sPQP778xrt\n— Benny Johnson (@bennyjohnson) September 28, 2023\n\nBREAKING: James Comer says new financial records have revealed 6 new Biden family members involved in suspicious foreign transactions believed to be a direct result of influence peddling, bringing the total to 9 family members. pic.twitter.com/JKU6HJoA1O\n— Benny Johnson (@bennyjohnson) April 17, 2023\n\nEven his fundraising for a presidential library isn’t going well.\n\n“I want an $800,000 refund,” demanded John Morgan, a lawyer. He was referring to the nearly $1 million he said he raised for Biden that went to then-Vice President Kamala Harris last year, after she assumed Biden’s role as the Democratic presidential nominee, one report explained.\n\n“I don’t believe a library will ever be built unless it’s a bookmobile from the old days,” he said.","summary":"Speech fees not arriving, debt needs to be paid off, fundraising dismal","url":"https://www.wnd.com/2025/09/report-joe-biden-facing-post-presidency-far-fewer/","image":"https://www.wnd.com/wp-content/uploads/2022/08/joe-biden-confused-huh-jpg.jpg","video":null,"publish_date":"2025-09-16 22:36:53","author":"Bob Unruh","authors":["Bob Unruh"],"language":"en","source_country":"us","sentiment":-0.436},{"id":361089766,"title":"Minnesota Gov. Tim Walz announces run for third term","text":"Minnesota Gov. Tim Walz on Tuesday announced his plans to seek reelection, launching a rare bid for a third consecutive term that would make history if he wins.Walz, a Democrat, revealed his intention to run again in a video posted on social media, touting policy achievements in office and making an appeal for unity.\"We've made historic progress in our state, but we're not done yet. I'm staying in the fight,\" the governor said.In his announcement video, Walz called Minnesota \"the best place on Earth with the best people,\" but acknowledged the state has \"seen terrible times this year.\"\"I'm heartbroken and angry about the beautiful people we lost to gun violence,\" Walz said, referencing the high-profile political assassination of Rep. Melissa Hortman and her husband Mark and the mass shooting at Annunciation Catholic Church late last month. \"But it's in these moments we have to come together, because I've seen what we can do when we work together.\"Walz said in the video that, if reelected, his priorities would include cracking down on fraud, making health care more affordable, investing in public schools and getting \"serious about gun violence.\"The former teacher and Congressman was elected governor in 2018 and won reelection in 2022. In 2024, former Vice President Kamala Harris chose him as her running mate in the presidential election, which catapulted him to the national stage.After the loss to President Trump and Vice President JD Vance, Walz returned to Minnesota to serve out the remaining two years of his term. Earlier this year, he went on a town hall tour of GOP districts across the Midwest, prompting speculation about a future presidential run. In an interview with The New Yorker in March, Walz said if the circumstances were right and he has the right \"skill set\" for the moment, he would consider running in 2028. Since Mr. Trump took office, he and Walz have continued the clashes begun during election season. In his announcement video, Walz said he will \"never stop fighting to protect us from the chaos, corruption and cruelty coming out of Washington.\"During his gubernatorial tenure, Walz and Democratic lawmakers approved several progressive victories, including universal free school meals, the legalization of recreational marijuana, codified abortion rights and more. Polling suggests Walz faces some political headwinds heading into his reelection campaign. A Star Tribune Minnesota poll in June found that half of Minnesotans did not want Walz to seek a third term. A majority of independents disapprove of his performance, as well as voters who live outside of Hennepin and Ramsey counties.And his time in office hasn't been without controversy. After authorities announced charges in the $250 million Feeding Our Future fraud case — the largest COVID-19 fraud case in the country — Walz faced scrutiny for how his administration handled it and Republicans blamed him for letting it happen under his watch. The scandal prompted a renewed focus on fraud and governmental oversight in the most recent legislative session, which included some changes, though plans for a new state watchdog agency failed to pass. Since Feeding Our Future, there have been additional investigations into fraud in state programs, including alleged bogus claims billed at autism centers and for housing services. Fraud in state government is already becoming a centerpiece to Republicans' campaign against him.Walz's 2022 challenger Scott Jensen is running again for the Republican nomination. State Rep. Kristin Robbins, who chairs the new House fraud-focused committee, and businessman Kendall Qualls have also launched campaigns.Walz defeated Jensen in 2022 by eight percentage points.In its 167 years as a state, Minnesota has never elected a governor for three consecutive four-year terms, according to the Minnesota Legislative Reference Library. Rudy Perpich served three non-consecutive terms and is the state's longest serving governor.Before his reelection, Walz led the state through the COVID-19 pandemic, the police murder of George Floyd and the unrest that followed. Walz and state lawmakers this year achieved what he called \"the most impressive achievement\" of his career, wrapping up a contentious budget agreement during a special session of the most closely divided Legislature in Minnesota history. The work to finalize the $66 billion biennial budget staved off a government shutdown and made significant headway into a projected $6 billion deficit in future years. \"This is why I got into this business, to try and make a difference, work together, compromise, find common ground,\" Walz said of the agreement. \"The commitment to making democracy work was as strong as I've seen.\"Walz's party made key concessions to get the deal across the finish line, including removing adult undocumented immigrants from the state's health care program.","summary":"Minnesota Gov. Tim Walz on Tuesday announced his plans to seek reelection, launching a rare bid for a third consecutive term that would make history if he wins.","url":"https://www.cbsnews.com/news/minnesota-gov-tim-walz-running-for-reelection/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/05/27/e50c1cb6-d9d5-4ec8-afa3-2fc40f5209ab/thumbnail/1200x630/c4dcf196942c94cc15321921d4d9581b/gettyimages-2208526883.jpg","video":null,"publish_date":"2025-09-16 22:28:50","author":"Anthony Bettin,Caroline Cummings","authors":["Anthony Bettin","Caroline Cummings"],"language":"en","category":"politics","source_country":"us","sentiment":0.068},{"id":361131084,"title":"The Irony of Using Charlie Kirk’s Murder to Silence Debate","text":"This is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the best in culture. Sign up for it here.\n\nA strange thing happens when a notable public figure is killed: Their rough edges are sanded down, and a multidimensional person is flattened into the simplicity of a myth.\n\nThis has happened with jarring speed to Charlie Kirk, the conservative influencer murdered last week in Utah. Many paeans to Kirk, including from those who opposed him on many issues, have focused on Kirk’s eagerness to engage with those with whom he disagreed. Some of Kirk’s friends and allies have even compared him to Martin Luther King Jr., another prominent leader assassinated for his politics. In the rush to canonize Kirk, people are transforming him into someone he might not recognize—and highlighting an extreme tension within the MAGA movement.\n\nKirk’s commitment to debate was inextricable from his political views; he wasn’t a value-neutral advocate for free speech. Kirk arose as a countercultural figure and deployed the First Amendment as a crucial tool for spreading his ideas: In an environment where they were not welcome, he pointed out that they were protected. Now that Kirk’s political allies hold power, however, many appear eager to suppress ideas they dislike. The Trump administration is vowing to use Kirk’s death as an excuse to crack down on dissent even as it lionizes him for defending it.\n\nKirk began his career planting Turning Point USA chapters on college campuses. As many conservatives were writing off academia, Kirk was evangelizing, creating a beachhead for right-wing views in traditionally liberal environments. Free speech was an important shield for him, because some of his ideas were bigoted, or articulated abrasively.\n\nSome people now praising Kirk are conflating a commitment to argument with a devotion to civility. Kirk succeeded, in part, by eschewing civility in favor of conflict. He said, for example, that “Joe Biden is a bumbling, dementia-filled—Alzheimer’s—corrupt tyrant who should honestly be put in prison and/or given the death penalty for his crimes against America.” (In the same radio show, he questioned whether Kamala Harris is Black.) He bused supporters to Washington on January 6, 2021; invoked the Fifth Amendment rather than answer questions about the insurrection; and campaigned for pardons for the perpetrators.\n\nKirk railed against transgender and gay rights. He called George Floyd a “scumbag,” declared the Civil Rights Act of 1964 a “mistake,” and claimed that many influential Black figures were in their roles only because of affirmative action. “If I see a Black pilot, I’m going to be like, ‘Boy, I hope he’s qualified,’” he said. He said that if Donald Trump lost in 2024, hundreds of thousands of Haitian migrants would be brought to Alabama, where they would “become your masters.” Comparisons to King are especially ironic because King, Kirk said, was “awful. He's not a good person.”\n\nFree speech protects an airing of these ideas, some of which have since come to dominate the Republican Party and help carry it to electoral success. But free speech is always a danger to power, and now that the GOP has control of the White House and both houses of Congress, and has a friendly Supreme Court—as well as a growing number of cultural and corporate institutions—Kirk’s allies are rattled by it.\n\nIn some cases, they have called for the punishment of speech about Kirk’s death. The day after Kirk’s killing, Representative Clay Higgins of Louisiana demanded that social-media companies ban anyone who “belittled the assassination of Charlie Kirk.” Yet Kirk himself criticized this kind of use of government power in 2020, when he was locked out of Twitter. “We are seeing right now that Big Tech has become the enforcement and the communication arm of the Biden campaign and the Democrat Party,” Kirk said. “It is undemocratic, it is anti-American, and every single person that believes in a free society should be outraged and quite honestly compelled to action against what these tech companies have been able to do to our country.”\n\nThe limited calls for social-media bans have quickly transformed—as free-speech hard-liners warn that it does—into a broader call for censorship. “There’s free speech and then there’s hate speech,” Attorney General Pam Bondi said on the former Trump aide Katie Miller’s podcast yesterday. “We will absolutely target you, go after you, if you are targeting anyone with hate speech.” Miller’s husband, the White House aide Stephen Miller, vowed to “uproot and dismantle” liberal groups in response to the assassination. The law does not, in fact, recognize any such distinction—as more traditional conservatives, such as National Review’s Charles C. W. Cooke, note. But even the putatively libertarian Senator Rand Paul is endorsing employers punishing speech from their workers.\n\nThe Trump administration is reportedly now planning a sweeping crackdown on the Democratic Party and on progressive politics as a whole. Yesterday, the president filed a $15 billion lawsuit against The New York Times, several of its reporters, and a major publisher for writing things he didn’t like. (The Times and the publisher, Penguin Random House, called the suit meritless.) In another era, this would have seemed laughable, but some major media companies have concluded that settling such claims is more expedient than defeating them in court. Trump’s son has suggested going beyond lodging defamation claims, bluntly advocating the abridgment of the First Amendment.\n\n“You can’t call someone who you disagree with, or simply can’t win an argument with, a Nazi, a fascist, a dictator, a greatest threat to democracy in the history of civilization, and then pretend you had nothing to do with it when the more radical wing—and there does not seem to be all that much difference to me these days—takes up arms and tries to kill those they disagree with,” Donald Trump Jr. said last week.\n\nRejecting the horrors of political violence is indeed essential to a functional democratic society, but that is why free speech is so important. A Kirk quote has been circulated widely in the past few days: “When people stop talking, that’s when you get violence.” The MAGA embrace of censorship is not a bid to win a battle of ideas. It’s to force people to shut up. Kirk warned why this was dangerous.\n\nHere are three new stories from The Atlantic:\n\nToday’s News\n\nExplore all of our newsletters here.\n\nEvening Read\n\nYou’re Probably Wearing Too Much Deodorant\n\nBy Franklin Schneider\n\nMore From The Atlantic\n\nCulture Break\n\nReflect. The Thrilla in Manila nearly killed Muhammad Ali and Joe Frazier. Vann R. Newkirk II revisits history’s most brutal boxing match 50 years later.\n\nExplore. The WNBA superstar Maya Moore walked away from basketball to focus on social-justice activism. Jemele Hill asked her: Was it worth it?\n\nRafaela Jinich contributed to this newsletter.\n\nWhen you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic.","summary":"The conservative activist couldn’t have risen to prominence without robust free speech.","url":"https://www.theatlantic.com/newsletters/archive/2025/09/charlie-kirk-free-speech-republican-party/684235/","image":"https://cdn.theatlantic.com/thumbor/Y9vhrVB8RvSUjvioyYQ6LbtrvTk=/0x0:2000x1125/720x405/media/newsletters/2025/09/2025_09_16_daily-1/original.jpg","video":null,"publish_date":"2025-09-16 22:17:00","author":"David A. Graham","authors":["David A. Graham"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.156},{"id":361101008,"title":"Kamala Harris to Appear on ‘The View’ Year After Disastrous Campaign Appearance","text":"Former vice president and two-time presidential contest loser Kamala Harris is set to return to ABC’s The View next Tuesday nearly a year after last appearing on the show.\n\nHarris made a last ditch appearance on the far-left day-time talk show to flog her failing presidential campaign in October of 2024, only weeks before the November election, but it was all to no avail because she lost the election in a landslide.\n\nNow the former veep is set to return to the show to flog her upcoming book, “107 Days,” in which she reportedly slags her former boss, Joe Biden, and his White House staffers and blames them in part for her huge electoral loss.\n\nHarris is set to guest on The View on Sept. 23.\n\nChief moderator Whoopi Goldberg told viewers on Tuesday that Harris would be gracing the table on the following week. “She’ll be here, we’ll be here, I hope you’ll join us all, because we want to hear what she has to say,” Goldberg said.\n\nMany felt that Harris’ last appearance on the show helped torpedo her campaign. For instance, at one point the gaggle asked her what she would do differently than Joe Biden had done, she couldn’t think of a thing.\n\n“There is not a thing that comes to mind,” she said after being asked what she would do differently than Biden had.\n\nShe then went on to claim she was part of all of Biden’s disastrous decision.\n\n“And I’ve been part of most of the decisions that have had impact,” she claimed. “The work that we have done, for example, capping the cost of insulin at $35 for our seniors something I care deeply about, a allowing Medicare to negotiate drug prices and bring the cost of prescription medication down for seniors, but my intention is to expand that for Americans. The work we have done to invest in American industries, whether it be in terms of manufacturing and creating 800,000 new jobs around manufacturing. Those were all a shared priority.”\n\nHarris will also appear in prime time for the fist time in nearly a year by appearing on the extremist, left-winger Rachel Maddow Show on the day before her shot on The View next week.\n\nFollow Warner Todd Huston on Facebook at: Facebook.com/Warner.Todd.Huston, Truth Social @WarnerToddHuston, or at X/Twitter @WTHuston","summary":"Former vice president and two-time presidential contest loser Kamala Harris is set to return to ABC's 'The View' next Tuesday.\n\n\nThe post Kamala Harris to Appear on ‘The View’ Year After Disastrous Campaign Appearance appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/09/16/kamala-harris-to-appear-on-the-view-year-after-disastrous-campaign-appearance/","image":"https://media.breitbart.com/media/2025/09/kamalatheview-640x335.jpg","video":null,"publish_date":"2025-09-16 22:14:08","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.083},{"id":361099204,"title":"Taylor Swift ‘used bulletproof shield’ at last NFL game after Charlie Kirk shooting","text":"Taylor Swift reportedly turned up to an NFL game on Sunday behind a bulletproof wall (Picture: David Eulitt/Getty Images)\n\nOn Sunday Taylor Swift appeared to be filmed being escorted to her fiancé Travis Kelce’s NFL game behind a portable wall, leaving fans perplexed at such secrecy. \n\nWhile some theorised Swift could be hiding a baby bump; making one of her secretive entrances like at her shows; or simply wished to avoid outshining her future husband’s big moment at Arrowhead Stadium – now it’s claimed this was a bullet-proof protective shield. \n\nThis reported precaution at the Kansas City Chiefs vs Philadelphia Eagles game comes amid worries over gun violence following the assasination of Charlie Kirk, sources say. \n\n‘If someone is going to do a tit-for-tat for Charlie Kirk, Taylor is a pretty logical choice,’ the insider told the Daily Mail, who reported Swift was behind the screen. \n\nThey added: ‘They used the screen to keep her safe. They have used that screen before, but usually it is for the President or someone like that, not a celebrity. But this was a weird week.’\n\nMAGA spokesperson Kirk was fatally shot by a gunman last Wednesday while speaking to students at Utah Valley University. \n\n Swift hasn’t used this precaution before, but sources claim there were worries after Charlie Kirk’s fatal shooting (Picture: David Eulitt/Getty Images)\n\n Swift was said to be behind this screen while entering the NFL game\n\nKirk, a conservative influencer who founded Turning Point USA, has previously made comments about Swift, including his controversial hope that Kelce could ‘de-radicalise’ her and that she should ‘submit’ to her future husband. \n\nSwift is reportedly concerned about stalkers and hate mail from extremist groups, which came after she endorsed Kamala Harris in the 2024 presidential run against Donald Trump. \n\n‘Taylor had concerns because she has received hate mail from the same kinds of extreme groups,’ another source told the publication. \n\n‘Charlie’s murder, and the weirdness with her stalkers, is why she will take serious measures to increase her security and only a core group of people know what her schedule is.\n\n‘She was targeted by far-right extremist groups after going against Trump [by endorsing Kamala Harris] and there are legitimate concerns about some of the threats that have been made. They aren’t taking any chances.’\n\nSwift’s houses have been targeted by a number of stalkers over the years. \n\n Taylor has endured lots of problems with stalkers in the past (Picture: Matt Winkelmeyer/Getty Images for The Recording Academy)\n\n This comes after Taylor and Travis announced their engagement on social media (Picture: Ezra Shaw/Getty Images)\n\nIn 2023 Mitchell Taebel, 37, was arrested after showing up outside her Nashville home and charged with intimidation, harassment, stalking by threatening serious injury or death and invasion of privacy.\n\nHe claimed that he was the Getaway Car singer’s ‘soulmate’, and left a string of concerning pictures and messages for her and her team, as well as her dad.\n\nIn 2024, an alleged stalker – seen at Swift’s New York City apartment a reported 30 times – was arrested after trying to break in. \n\nIn 2021, Patrick Nissen, then 28, was arrested in the vestibule of her New York City apartment building and was charged with a misdemeanour for second-degree criminal trespassing after being found in her building without permission. \n\nThe same year, a man, then aged 52, was arrested after attempting to enter Taylor’s Manhattan home, claiming to police that he had spoken to the star on Instagram. \n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"The screen is 'usually for the President'.","url":"https://metro.co.uk/2025/09/16/taylor-swift-used-bulletproof-shield-last-nfl-game-charlie-kirk-shooting-24183113/","image":"https://metro.co.uk/wp-content/uploads/2025/09/GettyImages-2196122888_14c012-e1758059607625.jpg?quality=90&strip=all","video":null,"publish_date":"2025-09-16 22:07:57","author":"Kitty Chrisp","authors":["Kitty Chrisp"],"language":"en","source_country":"gb","sentiment":0.21},{"id":361092618,"title":"California’s sky-high living costs afford it the nation’s highest poverty label — again","text":"Last year’s presidential election underscored, particularly to Democrats, that the costs of living were a major factor in the outcome.\n\nInflation had increased sharply during Joe Biden’s presidency, and voters’ angst about rising prices worked against Vice President Kamala Harris’ campaign to succeed him in the White House.\n\nNot surprisingly, therefore, when the California Legislature opened its 2025 session, its dominant Democrats declared that they would focus on taming the state’s notoriously high costs for housing, fuel, utilities and other necessities of modern life.\n\nThe session ended last week and as it did, by happenstance, the Census Bureau reported that California once again has the nation’s highest “supplemental” rate of poverty when its living costs are included in calculations over a three-year period.\n\nCalifornia’s rate, 17.7%, means that nearly 7 million of its residents are impoverished, 5 percentage points higher than the national rate and tied with Louisiana. The lowest rate is 6.7% in Maine.\n\nCalifornia’s rate is also 2.3 percentage points higher than it was in the Census Bureau’s previous three-year calculation, implying that its living costs vis-à-vis incomes had increased markedly.\n\nThe situation is even gloomier in a report last month from the Public Policy Institute of California and the Stanford Center on Poverty and Inequality.\n\nUsing methodology similar to that of the Census Bureau, they calculate that 16.9% of Californians were poverty-stricken in 2023 and another 17.9% were near-poor. That translates into 13.2 million Californians struggling to put roofs over their heads, food on the tables, fuel in their cars and electric power in their appliances and light fixtures.\n\nLos Angeles County, which has about 25% of the state’s population, has the highest poverty rate of any county, 19.9%. Poverty in the Central Coast region is nearly as high at 19.3%, while Sacramento has the state’s lowest rate, 13%.\n\nAnother data point about poverty in California is found in the newly enacted state budget. It declares that 14.9 million Californians are enrolled in Medi-Cal, the state’s health care program for the poor.\n\nSo, one might wonder, did the Legislature’s 2025 session deliver on promises to reduce the costs of living?\n\nLegislative leaders claim some success.\n\n“We went big,” Assembly Speaker Robert Rivas, said in a summary of the session’s work. “We produced results. We delivered historic progress — on housing, on energy, on climate, on health care, and on human rights. And that progress is something every one of us can be proud of.\n\n“And while our work is not finished fixing California’s housing system, this year marked a turning point in California’s housing story,” Rivas continued. “And today, we also advanced the most significant energy package in years. We passed measures that will deliver real relief for families on their electricity bills. We took action to stabilize gas supplies, to prevent price shocks — while keeping health and environmental protections in place.”\n\nBy integrating California’s electric power grid with those of other Western states, the elected officials say, shortages of electric power will be mitigated.\n\nBy reducing impediments to housing development, they say, higher levels of construction will moderate increases in rents and home prices.\n\nWhether any of these legislative efforts actually lower or at least stabilize Californians’ living costs won’t be known for months, or even years. Meanwhile, California’s high poverty rate will continue to be a civic embarrassment.\n\nDan Walters is a CalMatters columnist.","summary":"Last year’s presidential election underscored, particularly to Democrats, that the costs of living were a major factor in the outcome.","url":"https://www.sandiegouniontribune.com/2025/09/16/californias-sky-high-living-costs-afford-it-the-nations-highest-poverty-label-again/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/08/AP_18300051425739.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-16 21:51:58","author":"Dan Walters,Gqlshare","authors":["Dan Walters","Gqlshare"],"language":"en","source_country":"us","sentiment":0.026},{"id":361204402,"title":"Donald Trump files $15bn lawsuit against the New York Times - Donald Trump","text":"Donald Trump has filed a $15bn defamation lawsuit against the New York Times in his latest use of legal action targeting a major media outlet.\n\nThe US president accused it of being a “mouthpiece” for the Democratic party and of “spreading false and defamatory content” about him.\n\nThe New York Times said last week that it had been threatened with legal action by the White House after articles about a crude birthday note given to the late sex offender Jeffrey Epstein. The note bears Trump’s signature but the president has denied being its author.\n\nIn July Trump launched legal action against another big US paper, the Wall Street Journal, and its proprietor, Rupert Murdoch, after it first reported on the existence of the note, which also featured a lewd drawing. The note has since been published but Trump continues to deny being its author.\n\nThe filing against the NYT, the latest demonstration of the president’s willingness to use legal action against the media, was made by Trump’s lawyers to a district court in Florida on Monday night.\n\nIt names several articles and one book written by two of the publication’s journalists and published in the lead-up to the 2024 election.\n\n“The Times has betrayed the journalistic ideals of honesty, objectivity, and accuracy that it once professed,” it states, also accusing the NYT of being “a leading, and unapologetic, purveyor of falsehoods against President Trump”.\n\nA spokesperson for the NYT said: “This lawsuit has no merit. It lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics. We will continue to pursue the facts without fear or favour and stand up for journalists’ first amendment right to ask questions on behalf of the American people.”\n\nThe suit makes a series of verbose claims about Trump’s achievements, wealth and skill on the television show The Apprentice. It claims he secured “the greatest personal and political achievement in American history” with his election win, while accusing the NYT of trying to damage his “worldwide reputation for success”.\n\nIt states The Apprentice was a success because of “President Trump’s sui generis charisma and unique business acumen”. It describes his father, Fred C Trump, as “a legendary businessman and a patriot”.\n\n“Thereafter, President Trump’s stewardship of the Trump Organization has made it and the Trump name synonymous not only with New York City real estate but also with worldwide excellence, luxury, and opulence,” it states, taking issue with the NYT’s reporting of his business dealings.\n\nThe suit accuses the NYT, as well as other “legacy media” regarded as opponents, of engaging in election interference. It points to the paper’s decision to endorse the Democratic nominee Kamala Harris in the last presidential race.\n\nThe NYT made the endorsement while other major outlets took the unusual move of refusing to endorse a candidate in the race. The Washington Post, owned by the Amazon founder Jeff Bezos, opted against endorsing a candidate. That decision was criticised by some as an attempt to appease Trump and led to a backlash among subscribers and Post employees.\n\nThe case against the NYT is just the latest of several multibillion-dollar lawsuits Trump has launched against US media outlets since his return to the White House.\n\nLawsuits have been brought against ABC News and the anchor George Stephanopoulos, as well as Paramount over its 60 Minutes interview with Harris. Those cases were settled for $15m and $16m respectively. The case against the Wall Street Journal is ongoing.\n\nIn a post on his Truth Social platform, Trump denounced the NYT as “one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual ‘mouthpiece’ for the Radical Left Democrat Party”.\n\n“I view it as the single largest illegal Campaign contribution, EVER,” he said, though he did not provide any evidence for the claim. “Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF!\n\n“The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThe lawsuit cites articles in the NYT based on Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, a book by the reporters Susanne Craig and Russ Buettner.\n\n“Defendants maliciously published the book and the articles knowing that these publications were filled with repugnant distortions and fabrications about President Trump,” the filing states. Penguin Random House, the publisher of the book, which is also being sued as part of the action, has not yet commented on the suit.\n\nArticles in the NYT to be cited in the filing include one published before the November election, which was described as an “election-interfering salvo”. The suit says the articles were part of a long-term pattern of “intentional and malicious defamation”. It seeks damages of “not less than $15bn”.\n\nTrump’s team has previously filed a libel suit against the NYT in relation to an opinion article concerning Russian interference in the 2016 US election. It was dismissed on the grounds of “protected speech”.\n\nTrump also has sued the newspaper and his estranged niece over a 2018 story about his family’s wealth and tax arrangements, describing it as an “insidious plot” to obtain his records. A New York judge threw out the case in 2023.","summary":"Donald Trump files $15bn lawsuit against the New York Times - Donald Trump","url":"https://www.theguardian.com/us-news/2025/sep/16/donald-trump-says-he-is-suing-new-york-times-15bn-lawsuit-against-newspaper-ntwnfb","image":"https://i.guim.co.uk/img/media/7ed4477bbb05b2dcac390b8d3a325f815617cfb7/751_94_4459_3569/master/4459.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64","video":null,"publish_date":"2025-09-16 20:36:07","author":"Michael Savage","authors":["Michael Savage"],"language":"en","category":"politics","source_country":"au","sentiment":0.123},{"id":361101920,"title":"The Latest: Kash Patel confronts Senate questions over probe into Charlie Kirk’s killing","text":"FBI Director Kash Patel touted his leadership of the nation’s top federal law enforcement agency as he faced questions from senators about the investigation into Charlie Kirk’s killing, the case against sex offender Jeffrey Epstein and the firings of senior FBI officials who have accused Patel of illegal political retribution.\n\nHis appearance Tuesday before the Senate Judiciary Committee represents the first oversight hearing of Patel’s young but tumultuous tenure and provides a high-stakes platform for him to confront skeptical Democrats at a time of internal upheaval and mounting concerns about political violence inside the United States, which President Donald Trump has squarely blamed on the left. Patel listed a series of what he said were accomplishments of his first months on the job, including his efforts to fight violent crime and protect children.\n\nThe Latest:\n\n House Democratic leader asks if Trump is turning down the rhetoric \n\nLeader Hakeem Jeffries pushed back against a proposal to punish a lawmaker for their comments in the aftermath of the Kirk assassination, and instead said leaders should be “lifting people up.”\n\n“The question that should be asked is, ‘Has the president brought the rhetoric down?’” he said at a press conference at the Capitol. “We need to come together, not as Democrats or Republicans or independents, but as Americans.”\n\n New Pentagon policy says troops can only be exempt from shaving for a year \n\nDefense Secretary Pete Hegseth has ordered that troops across all the services who need an exemption from shaving for longer than a year should now be kicked out of the service.\n\nIn a Aug. 20 memo that was made public Monday, Hegseth said that while commanders are still able to issue servicemembers exemptions from shaving – a policy that has existed for decades – those exemptions will now have to come with a medical treatment plan. Troops who still need treatment after one year will be separated from service, the memo decreed.\n\nMost shaving waivers are for troops diagnosed with pseudofolliculitis barbae, or PFB, a condition in which hairs curl back into the skin after shaving and cause irritation. It is a condition that disproportionately affects Black men. The memo is silent on what treatments the military would offer for troops impacted by the new policy or if it will front the cost for those treatments.\n\n Attorneys for immigrant children allege poor conditions persist at detention facility \n\nAttorneys defending immigrant families held in federal custody are alleging such things as bottled water for sale, a child with appendicitis told to wait three days, and families released from custody only to be re-detained.\n\nThe declarations are part of an ongoing lawsuit where the federal government is requesting to end protections for immigrant children. Since the unlicensed detention center in Dilley, Texas, started holding families when it reopened in March, families reported long detention stays, children fighting adults for clean water and a lack of adequate medical care.\n\nThe federal judge presiding over this case last month requested more information about the length of detention for children. ICE provided a report that said the children in custody over 72 hours went down from six days to five days in June and July, respectively. But attorneys representing the children who reviewed the report said the government has held some children for over a week and often without justification.\n\n Illinois governor says Trump ‘losing it’ over National Guard inconsistency \n\nJB Pritzker, a frequent Trump critic, accused the president of being forgetful and unreliable, suggesting he “might be suffering from some dementia.”\n\n“When he said that he wasn’t coming to Chicago, I didn’t trust that,” Pritzker said Tuesday. “When he says he is coming to Chicago, it’s hard to believe anything he says.”\n\nTrump has vowed to send military troops to the nation’s third-largest city but repeatedly changed his statements. He’s said he’d prefer cooperative cities but on Tuesday again mentioned Chicago as a possibility for the next deployment.\n\nElected leaders and many residents strongly oppose any federal intervention.\n\n Microsoft says it will invest $30B in the UK through 2028 \n\nThe investment includes $15 billion in capital expenditures to build out cloud computing and artificial intelligence infrastructure. A project with British company Nscale aims to build the nation’s largest supercomputer, running on more than 23,000 advanced graphics processor chips.\n\n“We’re focused on British pounds, not empty tech promises, because it’s easy to have big numbers but we will be good for every cent of this investment,” Microsoft’s president, Brad Smith, told reporters Tuesday.\n\nHe said the investments were separate from those made through the Stargate project and Microsoft’s longtime partner OpenAI, maker of ChatGPT, which is increasingly trying to set its own course without the software giant’s help.\n\nSmith credited the U.K.’s “regulatory stability” and its commitment to expanding the supply of electricity needed to power data centers. He said Microsoft didn’t receive any request from the Trump administration to make the announcement.\n\n Crime victims targeted in immigration crackdown \n\nA man detained by authorities days after he nearly died in an Iowa shooting is one of a growing number of crime victims who have been targeted in the Trump administration’s crackdown on illegal immigration.\n\nFelipe de Jesus Hernandez Marcelo was shot in June during an attempted robbery in Muscatine, Iowa, and has been detained since shortly after he got out of the hospital.\n\nIn January, Immigration and Customs Enforcement rescinded a policy that had shielded many victims from detention and removal. The number of people applying for visas that allow some victims to remain in the country has plummeted since then. Others have been detained unexpectedly by ICE as they go through the lengthy application process.\n\n▶ Read more about how ICE is moving to deport more victims of crime\n\n Trump again delays enforcement of TikTok ban \n\nTrump is extending a deadline for the social media app TikTok to shut down.\n\nIt will be the fourth time that Trump has ignored federal law and extended a deadline for TikTok to go out of business. Trump has signed an executive order to keep TikTok operating, a day after he said he’d reached a framework deal with China to keep it operating.\n\n Trump forms federal board to prevent strike on nation’s largest commuter rail system \n\nThe president issued an executive order creating a Presidential Emergency Board meant to resolve a contract dispute that nearly triggered a strike on the Long Island Railroad this week.\n\n“Once again, President Trump is stepping up when Democrats have failed,” Kush Desai, a White House spokesperson, said in an apparent dig at Democratic New York Gov. Kathy Hochul.\n\nUnionized LIRR workers voted to authorize a strike on Monday but also approved seeking federal intervention. The move pushed the possibility of a strike at least into January.\n\n Netanyahu invited back to the White House \n\nThe Israeli prime minister says Trump had invited him to visit on Sept. 29, after he addresses the United Nations General Assembly.\n\nIt will be Netanyahu’s fourth visit to the White House since Trump assumed office in January.\n\n Democratic governors warn Congress it should not let ACA tax credits expire \n\nA group of Democratic governors is urging congressional leaders to extend Affordable Care Act tax credits. They write in a letter that letting the credits expire would cause harm that “will be felt for years.”\n\nThe appeal comes as Congress is moving toward a potential government shutdown, with Republicans and Democrats at odds over how to continue the tax credits that have made health insurance more affordable for millions.\n\nThe 18 Democratic governors wrote that “these subsidies are the only reason health insurance is still within reach in a country where the cost of living keeps going up.”\n\nThe letter was sent Monday and advised both Republican and Democratic leaders in the House and Senate that “this isn’t a partisan issue.”\n\n White House, Pentagon mum on details after Trump says US `knocked off’ third alleged Venezuelan drug boat \n\nNeither offered any further on-the-record detail after Trump suggested the U.S. military had carried out an operation on a third vessel from Venezuela.\n\nAsked earlier on Tuesday by a reporter about Venezuelan President Nicolas Maduro’s angry response to two military strikes carried out by the U.S. military in recent weeks on alleged drug smuggling boats in the Caribbean, Trump replied “We knocked off, actually, three boats not two.”\n\nThe Pentagon referred questions to the White House, which has not provided details about where and when the third military operation took place.\n\n Trump says Republicans will hold a ‘very exciting’ midterm political convention \n\nPresident Trump says on social media that Republicans will hold the gathering to highlight “the great things we have done” since he was reelected in 2024.\n\nThe convention’s date and location are still to come, Trump says. But he promised that “it will be quite the Event, and very exciting!”\n\nTrump first floated the idea after news reports that the Democratic Party was considering its own gathering before the 2026 midterm elections to highlight candidates and garner attention as the party aims to regain control of both houses of Congress next year.\n\n FBI director wraps up his testimony \n\nPatel has finished testifying after a contentious 4 ½ hour hearing before Congress.\n\nThe final round of questioning for the FBI director came from Republican Sen. Thom Tillis of North Carolina. Tillis issued a call to both sides of the aisle, including fellow conservatives, to tone down the rhetoric in the face of escalating political violence in the U.S.\n\n“How on earth are we de-escalating the situation with the tensions as high as they were last week with going out and saying we’re at war?” Tillis said. “There are people out here on our side of the aisle that still need to look in the mirror.” \n\n Patel shouts down Sen. Adam Schiff \n\nThe FBI director shouted over the California Democrat during questioning on how the Trump administration has handled the Jeffrey Epstein files and Epstein’s former girlfriend Ghislaine Maxwell.\n\n“You are the biggest fraud to ever sit in the United States Senate,” Patel shouted at Schiff.\n\n“You are a political buffoon at best!” Patel added.\n\nSchiff tried to yell over him, saying, “You can make an internet troll the FBI director, but (he) will always be nothing more than an internet troll.”\n\nSen. Chuck Grassley, Republican chairman of the Senate Judicial Committee, pounded his gavel repeatedly, but Patel continued.\n\nThe feud between Patel and Schiff dates back years, to when Patel was a staffer on the House Intelligence Committee and Schiff was a House member.\n\n Congresswoman says hundreds of immigration arrests in Chicago \n\nU.S. Rep. Lauren Underwood of Illinois says immigration agents have arrested 250 people in the Chicago area since a new enforcement campaign was announced last week.\n\nThe Democrat is a member of the Homeland Security Subcommittee on Appropriations and got the information after a requested briefing with immigration officials. She shared details late Monday.\n\nUnderwood says the arrests began Sept. 6, two days earlier than a program touted as “Midway Blitz” was publicly announced. She says the operation would include the entire state of Illinois and neighboring Lake County in Indiana.\n\nTop administration officials arrived in Chicago Tuesday, potentially signaling a more aggressive phase of immigration enforcement. DHS officials have not responded to questions about the number of arrests in the Chicago area.\n\n Trump is intensifying immigration enforcement in Boston \n\nImmigrants are being detained in various locations, sparking fear and leading some people to stay home. Advocates report increased activity from U.S. Immigration and Customs Enforcement, with unmarked vehicles targeting work vans and staking out neighborhoods with large immigrant populations.\n\nOne Metro Boston city canceled its Hispanic Heritage Month festival due to safety concerns. ICE’s “Patriot 2.0” operation follows a previous crackdown in Boston.\n\nThe U.S. Department of Justice has also filed a lawsuit against Boston over its so-called sanctuary policies. Advocates argue the city’s policy of limiting cooperation with ICE keeps the city safe and ensures Boston remains a place for all residents.\n\nOpponents argue challenging the federal government risks much-needed federal funding and allows criminals to walk the streets.\n\n▶ Read more about ICE detentions intensifying in so-called sanctuary cities\n\n Patel defends social media post about Kirk subject in custody \n\nPatel had posted in the hours after the killing of conservative activist Charlie Kirk that “the subject” was in custody even though the actual suspect was still at large.\n\n“I don’t see it as a mistake. I see it as something -- working with the public to identify that there was a subject in custody,” Patel told senators.\n\nHe said he wanted to inform the public that a subject had been taken into custody, even though that person did not end up being the suspect in the shooting.\n\nHe told senators: “Could I have been more careful in my verbiage and said we had a subject instead of the subject? Sure.”\n\nSen. Peter Welch, a Vermont Democrat, pushed back, saying it caused confusion by making it sound like authorities had caught the person suspected of killing Kirk.\n\nPatel shot back by saying, “That’s not what I said.”\n\n Senate Democrats concerned over military lawyers as immigration judges \n\nA group of Democratic senators say they are deeply concerned that a Pentagon plan to allow military lawyers to work as temporary immigration judges will violate a ban on using service members for law enforcement and affect the military justice system.\n\nThe letter, sent to the military services and provided to The Associated Press, comes two weeks after Defense Secretary Pete Hegseth approved sending up to 600 military lawyers to the Justice Department to serve as temporary immigration judges. It is among the steps the Trump administration has taken to use the military in broader ways than previously seen, particularly in its immigration crackdown, including sending the National Guard into American cities and deploying active duty troops to the U.S.-Mexico border.\n\n“These military officers would serve under the command and control of the Attorney General and would execute administrative determinations at the direction of the Attorney General,” according to the letter signed by 12 Democrats on the Senate Armed Services Committee. It added that “these actions are inherently law enforcement actions that may not be performed by members of the armed forces.”\n\n Indiana governor says redistricting is inevitable \n\nRepublican Gov. Mike Braun said that the redistricting conversation is “moving” and it’s likely inevitable. But he doesn’t want to call a special session unless there will be a successful outcome.\n\n“I’ve been very clear, I want it to be organic,” he said in a video reported by WRTV in Indianapolis.\n\nIndiana GOP lawmakers have been hesitant about redistricting while Texas and Missouri barrel ahead, emblematic of Indiana’s independent streak. Braun said a special session could happen any time after November.\n\nThe GOP legislative caucuses met last week to discuss redistricting a few weeks after visiting the White House.\n\n Pennsylvania governor says US must ‘turn the tide’ against political violence, reject vengeance \n\nGov. Josh Shapiro says the nation must “turn the tide” against political violence and the belief that government can’t solve problems while also rejecting vengeance.\n\nShapiro, a Democrat, delivered the remarks at the Eradicate Hate Global Summit in Pittsburgh. Shapiro said leaders must condemn all forms of political violence and shouldn’t use violence as a pretext for more violence or to prosecute constitutionally protected speech.\n\nShapiro also criticized Trump, saying some people “in the dark corners of the internet, all the way to the Oval Office, want to cherry-pick which instances of political violence they want to condemn.”\n\nIn April, Shapiro and his family fled the governor’s official residence in the middle of the night after an alleged arsonist set it on fire in an attempt to kill Shapiro.\n\n Mayor responds to Border Patrol head in Chicago, signs executive order protecting right to protest \n\nChicago Mayor Brandon Johnson said he has had no direct conversations with the White House or Border Patrol and reaffirmed that Chicago police would not collaborate with ICE.\n\n“I get that people are feeling a level of anxiety, but they should be assured that we’re going to work with all of our stakeholders to make sure the people of Chicago are safe and supported,” he said at a news conference following his signing of an executive order aiming to protect the right to protest.\n\nThe order states that, if federal law enforcement disrupts peaceful protests, Chicago police will “collaborate with protest organizers to develop a mutually acceptable alternative plan.”\n\nJohnson said the order was an attempt to be “proactive” amid federal intervention and after protesters clashed with federal immigration agents Friday outside an ICE processing facility in Broadview, Illinois.\n\n House Republicans release short-term measure to avoid shutdown \n\nThey unveiled a stopgap spending bill to keep the federal government through Nov. 21.\n\nThe bill generally funds agencies at current levels, though there is an extra $88 million to boost security for lawmakers and members of the Supreme Court and the executive branch. The House is expected to vote on the measure by Friday.\n\nThe budget year draws to a close at the end of the month and Congress has yet to approve funding levels for the coming fiscal year. So, lawmakers will need to pass a stopgap measure to keep agencies funded while they work out their differences for the full year.\n\nDemocratic leaders have insisted that Republicans negotiate with them on the spending bill to protect health insurance coverage for millions of Americans. But Republicans leaders have rebuffed those demands and say those discussions are for another time and would not be part of the continuing resolution.\n\nAny spending bill that passes will need some support from Democrats in the Senate as the measure will need at least 60 votes to advance to a final vote.\n\n Patel hearing explodes in fiery exchange with Sen. Cory Booker \n\nPatel and the New Jersey Democrat got into a shouting match as Booker charged that Patel is responsible for a “generational destruction of the nation’s premier law enforcement agency.”\n\nPatel fired back at Booker, telling him that he was an “embarrassment.”\n\nFor several moments, the Republican chairman of the committee, Sen. Chuck Grassley, pounded his gavel but struggled to gain control of the two men.\n\nStill, Booker predicted that Patel would not last long in his post. He told Patel that Trump “will cut you loose. This may be the last time I have a hearing with you.”\n\n Patel pushes back on Democrats saying he got job because of Trump loyalty \n\nPatel took the opportunity to give a fiery retort to Democratic senators who say the reason he got the job was his loyalty to President Donald Trump.\n\nPatel’s leadership of the FBI has been marked by turmoil and Democratic accusations that he’s using the law enforcement agency to carry out Trump’s goals.\n\nBut Patel told the Senate panel that it was “an entire falsehood” to suggest that he only got the job because he was a Trump loyalist.\n\nPatel pointed to his experience as an attorney, congressional staffer and administration official, saying, “There was no loyalty then. There’s no loyalty now to anything but the Constitution.”\n\n Party switcher Geoff Duncan announces run for Georgia governor as Democrat \n\nFormer Republican and onetime Georgia Lt. Gov. Geoff Duncan is running as a Democrat for governor, a remarkable step for a staunch critic of Trump who left the conservative fold in a region where party switchers have gone in the other direction for generations.\n\n“I’ve never wavered in taking on Trump. So Georgia Republicans threw me out of their party,” Duncan said in his announcement video released Tuesday. “I was leaving anyway. Now I’m running for governor as a proud Democrat.”\n\nA 50-year-old resident of a Republican stronghold north of Atlanta, Duncan joins an already crowded field of lifelong Democrats. Top candidates include former Atlanta Mayor Keisha Lance Bottoms, state Sen. Jason Esteves and former labor commissioner Michael Thurmond.\n\n Trump criticizes reporters after suing the New York Times, tells one ‘you have ‘a lot of hate in your heart’ \n\nTrump seemed miffed when an Australian Broadcasting Corp. reporter asked about his wealth since returning to office. Trump told the reporter, ’You’re hurting Australia very much right now, and they want to get along with me.”\n\nHe told the reporter that Prime Minister Anthony Albanese would be visiting soon and “I’m going to tell him about you. You set a very bad tone.”\n\nThe president also criticized ABC News correspondent Jonathan Karl, whom he’s known for years. Karl asked Trump about the attorney general’s comments that she will be going after hate speech after the killing of Charlie Kirk.\n\nKarl told Trump that even some of his allies say hate speech is free speech.\n\nTrump responded by telling Karl the administration would “probably go after people like you, because you treat me so unfairly, it’s hate. You have a lot of hate in your heart.”\n\n Lawmakers behind the TikTok bill say they’re tracking discussions about a deal \n\nThe House Select Committee on China says any deal between Beijing and Washington must comply with a law requiring TikTok to be divested from its Chinese ownership or face a ban in the U.S.\n\nA framework deal was reached over the future of the popular social media platform at a trade meeting Monday in Madrid. Details remain unknown. Rep. Raja Krishnamoorthi, the committee’s ranking Democrat, said he wants information on the ownership structure.\n\n“Underpinning all of our concerns is the Chinese Communist Party’s access to American data,” he said. The social media platform needs user data to determine what to show users, and Krishnamoorthi said he would be open to discussions if the app is protected from Beijing’s infiltration.\n\n Democratic senator tells Patel: ‘You lied to us.’ \n\nIn a tense exchange, Sen. Richard Blumenthal accused the FBI director of lying when he told lawmakers at his confirmation hearing that agents would not be subject to political retribution.\n\nPatel objected to the accusation, telling the Democrat from Connecticut: “You accusing me of lying is something I don’t take lightly, but I’m not going to get into a tit for tat with you.”\n\nThe FBI director insisted that decisions to fire certain FBI agents were made by him, not the White House.\n\n“Any termination at the FBI was a decision that I made based on the evidence that I have as director of the FBI,” Patel said. “It’s my job and I’m not going to shy away from it.”\n\n Patel says FBI has ‘no credible information’ that Epstein trafficked teenage girls to others \n\n“There is no credible information — none. If there were, I would bring the case yesterday that he trafficked to other individuals,” Patel said, while also acknowledging that previous investigations of Epstein were limited.\n\nSen. John Kennedy, a Louisiana Republican, said that kind of answer was unlikely to satisfy demands to release more information.\n\n“This issue is not going to go away,” Kennedy said. “And I think the central question for the American people is this: They know that Epstein trafficked young women for sex to himself. They want to know who if anyone else he trafficked these young women to.”\n\nPatel said that the current case files only included “limited search warrants” between 2006 and 2007 because federal prosecutors in Florida had previously cut a secret deal with Epstein that allowed him to avoid prosecution for his previous actions\n\n Patel says he’s concerned about threats against judges \n\nPatel says the FBI has 35 open investigations into threats against judges, who have faced a sharp increase in violent messages in recent years.\n\nFederal judges were targeted in 17 of those cases, while the others involved threats against state court judges, Patel said.\n\nThe FBI director said he’s concerned about the problem, and the agency is referring cases for prosecution when it’s supported by the evidence.\n\nJudges have increasingly spoken out against threats of violence, pointing to worrying rhetoric from both sides of the political aisle in recent years and saying the threats have reached a new peak during the second Trump administration.\n\n Head of LA immigration crackdown and DHS secretary say they're in Chicago \n\nU.S. Homeland Security Secretary Kristi Noem said in an X post that she was “on the ground” Tuesday in Chicago “to make clear we are not backing down.”\n\n“Our work is only beginning,” she said.\n\nGregory Bovino, who spearheaded the immigration crackdown that sparked widespread protests in Los Angeles, also announced his arrival: “Well, Chicago, we’ve arrived!” he said. “Operation At Large is here to continue the mission we started in Los Angeles.”\n\nAdvocates for immigrants say they’ve noticed an uptick in detentions by ICE agents in Chicago as the nation’s third-largest city braces for Trump’s promised immigration crackdown and National Guard deployment. The threats have deepened dread among already fearful immigrant communities, which cancelled and delayed Mexican Independence Day celebrations. An ICE officer fatally shot a suspect trying to evade arrest last week.\n\n House Speaker warns leaders not to call political opponents ‘fascists’ \n\nJohnson also defended employers who take action against employees whose comments go too far.\n\n“That’s not the government censoring speech, that’s personal behavior and decorum,” the Republican from Louisiana said.\n\nJohnson noted that Trump has been called “the most despicable names” and he urged all leaders to tone it down.\n\n“Leaders cannot call their political opponents Nazis and fascists and enemies of the state because they disagree with their policy priorities,” he said.\n\n Johnson says bill to avoid shutdown being unveiled soon \n\nSpeaker Mike Johnson said a bill to avoid a partial government shutdown at month’s end would not include health care provisions sought by Democrats.\n\n“It will be a clean, short-term continuing resolution. End of story,” Johnson told reporters. He said the measure will be unveiled Tuesday.\n\nMinority leader Hakeem Jeffries has said House Democrats won’t support a partisan bill that “continues to gut the healthcare of the American people.”\n\nBut Johnson said Republicans are not going to revisit their big tax cut bill that trimmed Medicaid spending over the coming decade, and said the looming expiration of tax credits for some health insurance coverage is a “December policy issue.”\n\n“The same Democrats who decried government shutdowns under President Biden appear to have no heartache whatsoever at walking our nation off that cliff right now,” Johnson said.\n\n Trump files $15 billion defamation lawsuit against The New York Times \n\nThe lawsuit against the paper and four of its journalists, filed Monday in U.S. District Court in Florida, says several articles and one book published in the leadup to the 2024 election are “part of a decades-long pattern by the New York Times of intentional and malicious defamation against President Trump.”\n\nTimes spokesman Charles Stadtlander said Tuesday the lawsuit “lacks any legitimate legal claims and instead is an attempt to stifle and discourage independent reporting. The New York Times will not be deterred by intimidation tactics.” Penguin Random House, which published the book, called the lawsuit “meritless.”\n\nTrump has gone after other media outlets, including filing a $10 billion defamation lawsuit against the The Wall Street Journal and media mogul Rupert Murdoch in July after the newspaper published a story reporting on his ties to wealthy financier Jeffrey Epstein.\n\n Patel describes a widening probe of Kirk shooting, including Discord chat \n\nPatel was asked by Sen. Josh Hawley, R-Mo., whether the Kirk shooting is being treated as part of a broader trend of violence against religious groups, and Patel responded, “We are investigating Charlie’s assassination fully and completely and running out every lead related to any allegation of broader violence.”\n\nPatel also said that the FBI is investigating “anyone and everyone” who was involved in an online gaming chatroom on Discord with the alleged shooter. That chatroom involved “a lot more” than 20 people, Patel said.\n\n Patel says he’d work with Congress to address gun violence \n\nThe FBI director told Sen. Amy Klobuchar that he is “willing to engage and explore new ways” to address gun violence in the United States.\n\n“Whatever creativity we can use to eliminate even just one shooting, one horrific death, I am in favor of engaging with Congress fully to do,” Patel told the Democrat from Minnesota.\n\nPatel was later pressed by Klobuchar on whether he supports a ban on so-called assault weapons.\n\nThe FBI director said there are “instances on this legislation that could prevent future attacks” but said he would not “weigh into the creation of legislation.”\n\n Patel says the mission against drug traffickers will extend for years \n\nThe FBI director says his agency, as well as the U.S. military and intelligence community, will be conducting a yearslong mission that seeks to use counterterrorism tactics against drug-trafficking organizations.\n\n“We must treat them like foreign terrorist organizations post-9/11. We must treat them like the al-Qaidas of the world,” Patel told the Senate Judiciary Committee.\n\nPatel argued that law enforcement resources alone aren’t enough to dismantle criminal groups that traffic drugs into the U.S. and that the Trump administration is taking an “interagency” approach.\n\n“Whether that’s in a kill operation, a capture operation, a surrender operation, or a host nation takedown, like we did with the counterterrorism mission sets in Afghanistan and Iraq and Pakistan and elsewhere, we are applying that to the drug traffickers in Mexico and Venezuela and Colombia,” Patel said.\n\n Tim Walz, the 2024 Democratic VP candidate, says he’ll seek to remain Minnesota’s governor \n\nMinnesota Gov. Tim Walz said Tuesday he will seek a third term in the 2026 elections, hoping to beat the odds to become the longest-serving governor in a state where voters have usually said two terms were plenty.\n\n“I’ve always tried to do what’s right for Minnesota, and I’ll never stop fighting to protect us from the chaos, corruption, and cruelty coming out of Washington,” Walz said in a campaign video.\n\nWalz has been frequently mentioned as a potential 2028 presidential candidate. He sharply criticized Trump while touring early caucus and primary states after he and Democratic presidential nominee Kamala Harris were defeated. But he told Axios in July he would not run for president if he sought reelection.\n\n▶ Read more about Walz’s decision to run for governor again\n\n Patel refuses to address FBI firings \n\nQuestioned by Durbin on the recent firings of FBI agents, Patel said he would not get into personnel decisions and accused the Democrat of unfairly attacking FBI leadership.\n\nEarlier in the hearing, Patel called it “absolutely disgraceful” to cite what the FBI director described as a “one-sided story” about the firings.\n\n“Your attack on the current leadership of the men and women of the FBI is equally disgraceful,” the FBI director told Durbin.\n\nPatel is facing a lawsuit from three high-ranking FBI officials who have accused him of illegally firing them in a “campaign of retribution.”\n\n Trump says US strikes have now destroyed three boats suspected of carrying drugs from Venezuela \n\n“We knocked off, actually, three boats not two,” Trump told reporters when asked about Venezuelan President Nicolas Maduro’s angry response to U.S. military operations that the White House says is targeting Venezuelan drug smugglers.\n\nTrump had confirmed earlier that the U.S. military on Monday had targeted a second boat allegedly carrying drugs from Venezuela, killing three aboard the vessel. He also hinted that the military targeting of cartels could be further expanded.\n\nThe White House did not immediately respond to questions about when and where the third strike occurred.\n\nTrump also sent a new warning to the Maduro government on Tuesday:\n\n“Stop sending Tren de Aragua to the United States,” Trump said. “Stop sending drugs into the United States.”\n\n Patel declines to provide legal justification for strikes on Venezuelan boats \n\nSen. Lindsey Graham, a South Carolina Republican who is a close ally of Trump, asked the FBI director what legal justification the administration is using for military strikes on Venezuelan boats that the president has said are carrying drugs.\n\nPatel declined to answer, saying he would leave that to Attorney General Pam Bondi.\n\nWhile Republicans in Congress haven’t objected to Trump using the U.S. military to strike the boats, some are beginning to ask questions on how the operations are conducted and their legal justification.\n\nStill, Graham expressed support for an aggressive approach to nations where drugs are manufactured.\n\n“We will hunt down every single one of those narco-traffickers,” Patel told Graham.\n\n Patel says investigation into pipe bombs on Jan. 6, 2021, is ‘ongoing’ \n\nDurbin asked Patel about statements from Dan Bongino before he became deputy director of the FBI that the bombs found at the Democratic National Committee and the Republican National Committee on Jan. 6, 2021, were an “inside job.”\n\nThe FBI director declined to comment on Bongino’s comments, but said he found Durbin’s criticism of Bongino “disgusting.”\n\n“So you have no evidence?” asked Durbin, the top Democrat on the Senate Judiciary Committee.\n\n“I got a lot of evidence, and I’ll give it to you when I can,” Patel said.\n\nThe person who placed the bombs just before the attack on the U.S. Capitol that day has never been identified.\n\n Patel spars with Durbin over Epstein files \n\nDuring one combative exchange, Patel was pressed by the top Democrat on the Senate Judiciary Committee over an unsigned memo released by the Justice Department in July that said there was no evidence of a Jeffrey Epstein “client list.”\n\nPatel responded with a dig at former President Joe Biden, telling Durbin: “Would you have preferred I used autopen?”\n\nRepublicans have accused the Democratic president of signing pardons in this final days in the White House with an autopen instead of by his own hand.\n\n Patel avoids answering questions on polygraph tests in tense exchange \n\nThe Senate hearing is quickly becoming tense, with the FBI director repeatedly avoiding answering questions from Sen. Durbin on how the bureau has administered polygraph tests to staff.\n\nPatel told Durbin, the top Democrat on the Judiciary Committee, that he wouldn’t discuss the specifics of how polygraph tests are administered or what questions come up.\n\nDurbin responded, “You have to have a decent memory when you come before a committee.”\n\nThe Associated Press has previously reported that agents and senior executives alike have been subjected to polygraph exams aimed at ferreting out disclosures of information related to Patel. \n\n Epstein comes up early \n\nPatel brought up the Epstein files in his opening statement, seeking to address a topic that’s brought criticism from some quarters of Trump’s conservative base who want to see more information released about the probe.\n\nThe FBI director faulted the original case against Jeffrey Epstein that ended in a plea deal years ago. He says it involved a “very limited search warrant” and asserted that the Trump administration has done more to release all “credible information” they could under the law.\n\nPatel also said Epstein had not been a source for the FBI.\n\nHe didn’t acknowledge criticism that the FBI and Justice Department have faced in recent months over the abrupt announcement in July that they would not be releasing additional documents from their trove of evidence.\n\n Trump welcomes Georgia Supreme Court decision in elections case against him \n\nThe state’s high court on Tuesday declined to hear Fulton County District Attorney Fani Willis’ appeal of her removal from the case.\n\nTrump reacted to the news by saying it was a “great decision” and a “rigged case to start off with.”\n\nHe also called for Willis to be jailed for attempting to prosecute him and several other individuals.\n\n▶ Read more on the ruling in the Georgia election fraud case against Trump and others\n\n Patel projects defiance \n\nPatel has concluded his opening statement before the Senate Judiciary Committee with a bit of a challenge for his critics: “I’m not going anywhere.”\n\nThe FBI director pointed to his experience as a congressional staffer and Trump administration official, saying, “If you want to criticize my 16 years of service, please bring it on.”\n\nSenate Republicans have continued to express confidence in Patel despite criticism from some conservative commentators of how he’s led the FBI’s response to the killing of Charlie Kirk.\n\nDemocrats, meanwhile, will intensely question Patel over what they say is a highly politicized approach to the FBI.\n\n Durbin calls for lower ‘temperature’ after Kirk’s death \n\nThe Illinois Democrat says both political parties “have a responsibility to bring down the temperature” and encourage unity following Kirk’s killing.\n\nIn his opening remarks earlier in the hearing, Durbin said Democrats are not responsible for Kirk’s death, just as Republicans are not responsible for the killing of a Democratic state lawmaker in Minnesota earlier this year.\n\nThe country is going through a period of division and political violence, he said, but “Republicans are not Nazis, Democrats are not evil.”\n\n Patel touts shift of FBI to target violent crime \n\nPatel’s opening remarks highlighted his efforts to transform the bureau to focus on combating violent crime.\n\nPatel said the FBI has arrested more than 23,000 violent criminals this year — an increase compared with last year. He also touted the FBI’s efforts to target drug trafficking and violent drug cartels.\n\nCritics have raised concerns that the focus on immigration enforcement and violent crime could divert attention from the FBI’s ability to focus on matters like counterterrorism.\n\n Patel gives a timeline of FBI’s response to Kirk shooting \n\nHe has faced some criticism from conservative corners about how he has led the FBI in the wake of the shooting, but Patel told the Senate panel that his agency — “at my direction” — successfully brought the suspect in Charlie Kirk’s killing into custody.\n\nHe also has touted the number of arrests made by the FBI, saying it represents an increase from the Biden administration.\n\n“We are leading the mission to crush violent crime and defend the homeland,” Patel said.\n\n Trump calls King Charles III, Queen Camilla friends as he prepares to depart for U.K. \n\nThe president said, “they’ve been friends of mine for a long time,” called the king an “elegant gentleman” and said, “I think he represents the country so well.”\n\nThe president, speaking as he was leaving the White House, said that U.K. officials want to continue trade negotiations during his coming visit.\n\n“They’d like to see if they can get a little bit better deal, so we’ll talk to them” he said.\n\n Durbin says Patel came to FBI with a ‘political mission’ \n\nThe top Democrat on the Senate Judiciary Committee, Dick Durbin, opened his remarks by criticizing Patel for the removal of career FBI officials and the diversion of agents to help with immigration enforcement.\n\nDurbin called Patel “arguably the most partisan FBI director ever,” saying he has “already inflicted untold damage on the FBI.” Durbin accused Patel of putting the country’s “national security and public safety at risk.”\n\n Grassley lists GOP criticism of past FBI probes as Kash Patel hearing kicks off \n\nRepublican Senate Judiciary Committee Chairman Chuck Grassley opened the hearing expressing sympathy for the fatal shooting last week of Charlie Kirk, which is under FBI investigation. \n\nThen he ran through a list of GOP criticisms of FBI investigations related to politics, ranging from the prosecution of White House adviser Peter Navarro for his response to a congressional subpoena, to the probe into Hillary Clinton’s use of a private email server. He also pledged to release new whistleblower records.\n\nGrassley decried Kirk’s “political assassination,” calling Kirk a “man of God, faith, family and country.”\n\n Suspect in Charlie Kirk shooting likely to face charges Tuesday \n\nProsecutors are preparing to file a capital murder charge Tuesday against the Utah man who authorities say held a “leftist ideology” and may have been “radicalized” online before he was arrested in the assassination of Charlie Kirk.\n\nCharges against 22-year-old Tyler Robinson are expected to come ahead of Tuesday’s first court hearing since he was accused last week of shooting Kirk, a conservative activist credited with energizing the Republican youth movement and helping Donald Trump win back the White House in 2024.\n\n Wall Street mostly higher ahead of retail sales data and Fed interest rate decision \n\nU.S. indices were mostly higher early Tuesday after Wall Street set new records and investor expectation grew that the Federal Reserve will announce its first interest rate cut of 2025 on Wednesday.\n\nS&P 500 futures rose 0.2% before the bell Tuesday while Big Tech stocks pulled Nasdaq futures 0.3% higher. Futures for the Dow Jones industrials were unchanged.\n\nOracle shares jumped 5% on speculation it would play a major part in the U.S.-China deal to keep TikTok operating in the U.S. after the Trump administration announced the framework of a trade deal on Monday.\n\nU.S. Treasury Secretary Scott Bessent said after the latest round of trade talks between the world’s two largest economies that Trump and Chinese Premier Xi Jinping would speak Friday to possibly finalize the deal.\n\n Georgia Supreme Court declines to hear Fani Willis’ appeal in Trump election case \n\nCiting an “appearance of impropriety” created by a romantic relationship Fulton County District Attorney had with special prosecutor Nathan Wade, the Georgia Court of Appeals had ruled that she and her office not continue to prosecute the case. election interference case against Donald Trump and others.\n\nSteve Sadow, Trump’s attorney in the Georgia case, said in a statement that Willis “deserved nothing less than disqualification.” A spokesperson for Willis did not immediately respond to a text message seeking comment.\n\nThe decision means it will be up to the Prosecuting Attorneys’ Council of Georgia to find another prosecutor, who could continue on the track that Willis has taken, decide to pursue only some charges or dismiss the case altogether.","summary":"FBI Director Kash Patel is confronting skeptical Democrats at a Senate hearing Tuesday, touting his leadership of the nation’s top federal law enforcement agency and facing questions about the investigation into Charlie Kirk’s killing, the case against sex offender Jeffrey Epstein and the firings of senior FBI officials who have accused Patel of illegal political retribution","url":"https://www.independent.co.uk/news/world/americas/fbi-jeffrey-epstein-white-house-donald-trump-charlie-kirk-b2827829.html","image":"https://static.independent.co.uk/2025/09/16/21/APTOPIX_FBI_Congress_95731.jpg?width=1200","video":null,"publish_date":"2025-09-16 20:19:49","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.23},{"id":361073936,"title":"Colorado voters are dissatisfied with Democrats. Polis, Hickenlooper and Bennet can’t hide (Editorial)","text":"Americans are recoiling from the Democratic Party, and even in blue states like Colorado, Democrats are feeling the burn.\n\nWith Republicans fielding the best candidate for governor they’ve had in a decade – Sen. Barbara Kirkmeyer – liberal politicians would be wise to address the root causes of this dissatisfaction publicly, frequently and head-on. The reality is that Americans are struggling — our politics are becoming more violent, everything is more expensive, and the job market is tightening.\n\nAfter years of enjoying popularity, Colorado’s top Democrats are now showing a remarkable drop in their approval ratings among voters. President Donald Trump remains deeply unpopular in the state, but Gov. Jared Polis, Sen. Michael Bennet and Sen. John Hickenlooper are failing to break a 50% approval rating, meaning more of those asked than not said they were unhappy with the politicians’ work.\n\nThese results from a poll conducted in early August of 1,136 registered Colorado voters by Magellan Strategies mirror what we are seeing across the nation. Americans are dissatisfied.\n\nAccording to a New York Times analysis of available voter registration numbers, the Democratic Party is hemorrhaging voters across the board and particularly in swing states. Meanwhile, the Republican Party is gaining voters after years of losses.\n\nPart of the shift is voters simply changing their affiliation to unaffiliated, but the Magellan Poll clearly indicates that there is more afoot than voters just looking to participate in open primaries.\n\nMagellan, a conservative-leaning Colorado firm, found that among voters who supported Kamala Harris in 2024, 47% have unfavorable opinions of the Democratic Party.\n\nTo be clear, voters who were polled still said they were more likely to support a Democrat for governor next year. Only 38% of those polled said they would likely support a Republican for governor. Kirkmeyer has an uphill battle to be certain, but her opponents are weakened.\n\nWe’d hazard a guess that the non-existent Democratic primary in 2023 to challenge a sitting president who was showing cognitive decline while in office is part of the reason voters are upset. It will take time for voters to forgive – and no one will ever forget – the disastrous presidential debate.\n\nBut national politics can’t take all the blame.\n\nGov. Jared Polis has served almost eight years in office and 52% of voters told pollsters that they had an unfavorable opinion of his work, and 35% strongly disapprove. That is softened only by the fact that 56% of voters polled strongly disapproved of the job President Donald Trump is doing, but Colorado has rejected Trump three times in general elections and the Republican Party rejected him in the 2016 caucus.\n\nU.S. Sen. Michael Bennet is doing slightly better with 44% of voters reporting disapproval of him, and U.S. Sen. John Hickenlooper was at 49%.\n\nBennet is going to face Attorney General Phil Weiser in the Democratic Primary for governor. Weiser wasn’t included in the poll and neither were any of the Republican candidates.\n\nThe bottom line is that Democrats cannot spend this election talking about Donald Trump, and pretending that voters don't have real concerns about the governance of both political parties. Voters may still put many or even most Democrats into office, but if the party wants to recover, its top leaders must start this election cycle with something more than fear and loathing.\n\nColoradans are concerned. The Magellan poll found that 54% of voters anticipate the economy will decline in the next 12 months (with more Democrats expressing this fear than Republicans), a pessimistic view that requires our politicians to articulate a plan for the worst-case scenario.\n\nSimilarly, 54% think Colorado is headed in the wrong direction (with more Republicans unhappy than Democrats), and the high cost of living, public safety, and homelessness were mentioned frequently by voters as top concerns, according to Magellan. These issues will only be harder to address given the decline in federal, state and local revenue sources. Our next governor will articulate a feasible plan.\n\nFinally, Democrats will win safe seats in 2026 with their heads in the sand, but if the party wants to gain ground in swing districts, its politicians are going to have to step up to the challenge at hand – restoring faith in and favorability of the party. Can that be done without rehashing the many missteps of the past four years? We would like to see elected officials be accountable and transparent.\n\nBut Colorado must move forward, as must the nation.\n\nIf Democrats want to stop losing ground, they've got to appeal to voters as far more than an alternative to Trump.\n\nSign up for Sound Off to get a weekly roundup of our columns, editorials and more. \n\nTo send a letter to the editor about this article, submit online or check out our guidelines for how to submit by email or mail.","summary":"Americans are recoiling from our two dismal political parties, and even in blue states like Colorado Democrats are feeling the burn.","url":"https://www.denverpost.com/2025/09/16/colorado-voters-dissatisfied-democrats-polis-hickenlooper-bennet/","image":"https://www.denverpost.com/wp-content/uploads/2023/10/TDP-L-BUCKLEY-PRESSER_JAC9660.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-16 20:07:01","author":"The Denver Post Editorial Board","authors":["The Denver Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.585},{"id":361075282,"title":"Republican Governor Warns of Trump’s Revenge if They Don’t Redistrict","text":"Trump is essentially filing this lawsuit on the grounds that the Times’ coverage isn’t kind enough to him. The 85-page lawsuit specifically calls out Times writers Peter Baker, Michael S. Schmidt, Susanne Craig, and Russ Buettner. The latter two wrote the book Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success, published last year. \n\n“Today, I have the Great Honor of bringing a $15 Billion Dollar [sic] Defamation and Libel Lawsuit against The New York Times, one of the worst and most degenerate newspapers in the History of our Country, becoming a virtual “mouthpiece” for the Radical Left Democrat Party,” Trump wrote Monday evening on Truth Social. “I view it as the single largest illegal Campaign contribution, EVER. Their Endorsement of Kamala Harris was actually put dead center on the front page of The New York Times, something heretofore UNHEARD OF! The ‘Times’ has engaged in a decades long method of lying about your Favorite President (ME!), my family, business, the America First Movement, MAGA, and our Nation as a whole.”\n\nThis is a tried and true method for Trump, as he sued Disney’s ABC and Paramount Global’s CBS News for defamation, settling each case for millions of dollars. The Times likely isn’t planning on folding in the same way, as publisher A.G. Sulzberger told media members in a Monday gala speech before Trump’s announcement to “stand up for your journalism. Stand up for your journalists. Stand up for your rights.”","summary":"Indiana Governor Mike Braun wants state legislators to get moving on approving a new congressional district map, to spare them from President Donald Trump’s wrath. \n\nSpeaking on Fort Wayne’s WOWO radio Monday, Braun floated the idea of lawmakers returning for a special session in November, to scrounge up extra GOP seats ahead of the 2026 midterm elections. \n\n“If we try to drag our feet as a state on it, probably, we’ll have consequences of not working with the Trump administration as tightly as we should,” he said.  \n\nBraun is the only lawmaker in Indiana with the authority to call a special session in November. Special sessions are historically pretty expensive for taxpayers. If Braun doesn’t call a special session, Republicans’ redistricting efforts would have to wait until the next session begins in January 2026. \n\nBraun said Tuesday that he preferred to start working “earlier rather than later,” or “anytime from early November through the very earliest part” of the next legislative session. \n\n“All I’m tel","url":"https://newrepublic.com/post/200539/republican-governor-donald-trump-revenge-redistrict-indiana","image":"https://images.newrepublic.com/90fc9be3b684d087f727138bc4aa63398334f58a.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-09-16 19:20:56","author":"Edith Olmsted","authors":["Edith Olmsted"],"language":"en","category":"politics","source_country":"US","sentiment":0.108},{"id":361053818,"title":"Pam Bondi Is Really Wrong About Hate Speech","text":"Attorney General Pam Bondi has made quite the First Amendment-related faux pas: In a recent interview about what the federal government could do to deter political violence in the wake of Charlie Kirk's assassination, she said the federal government would \"go after\" anyone engaged in hate speech.\n\nBondi should know, however, that hate speech is vigorously protected by the First Amendment, and as such, cannot be policed.\n\nUnfortunately, the attorney general made an illusory distinction between free speech and hate speech, implying that the latter was subject to government action.\n\n\"There's free speech and then there's hate speech, and there is no place, especially now, especially after what happened to Charlie, in our society,\" she said.\n\nAttorney General Pam Bondi: \"There's free speech and then there's hate speech, and there is no place, especially now, especially after what happened to Charlie, in our society…We will absolutely target you, go after you, if you are targeting anyone with hate speech.\" pic.twitter.com/Bqj6TQOGwP\n— The Bulwark (@BulwarkOnline) September 16, 2025\n\nBondi sounds like Minnesota Gov. Tim Walz, Kamala Harris' pick to be vice president, who made similar claims during the 2024 campaign—and that's a very bad thing. Both are appallingly wrong. The Supreme Court has repeatedly affirmed that so-called hate speech falls under First Amendment protection, most recently in the 2017 case Matal v. Tam, which was decided unanimously.\n\nAfter numerous commentators—including many fellow conservatives—called out Bondi, she clarified that she was referring to \"hate speech that crosses the line into threats of violence.\" She's correct that true threats of violence against specific individuals or institutions lose First Amendment protection if they are specific enough, though general advocacy of violence is usually still protected. This kind of speech isn't called hate speech though; it's called incitement. Hate speech, on its own, is simply not a separate category of unprotected speech, from the standpoint of the Supreme Court.\n\nIn a separate interview, Bondi also suggested that employers had an obligation to fire employees for engaging in hate speech or for actions such as refusing to print pro-Kirk posters at Home Depot.\n\nGiven that conservative legal advocates have worked tirelessly to defeat public accommodation laws that clash with private entities' moral, political, or religious beliefs, many on the right were not pleased to hear Bondi adopting this position. The Daily Wire's Matt Walsh called her opinion \"insane\" and said that President Trump should fire her. Sen. Ted Cruz (R–Texas) similarly clarified that the First Amendment absolutely protects hate speech, while noting that individuals could still suffer professional consequences for saying cruel things about Kirk.\n\nIronically, Bondi could have avoided this mess had she listened more closely to one specific person: Charlie Kirk. As journalist Brad Polumbo pointed out, Kirk previously wrote on X: \"Hate speech does not exist legally in America. There's ugly speech. There's gross speech. There's evil speech. And ALL of it is protected by the First Amendment. Keep America free.\"\n\nWords to remember.","summary":"The attorney general is now getting called out by fellow conservatives.","url":"https://reason.com/2025/09/16/pam-bondi-is-really-wrong-about-hate-speech/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/09/upiphotosthree097462-scaled.jpg","video":null,"publish_date":"2025-09-16 18:59:05","author":"Robby Soave","authors":["Robby Soave"],"language":"en","category":"politics","source_country":"US","sentiment":-0.46}]}