{"offset":0,"number":50,"available":422,"news":[{"id":322409582,"title":"Why Sussan Ley’s election ‘won’t fix’ the Liberal Party’s problem with female voters","text":"The 63-year-old, one of the longest-serving female MPs in today’s parliament, is only the second woman to lead a major Australian political party, and one of a handful to lead any party at all. \n\nMs Ley has said she hopes the occasion will send “a signal to the women of Australia” about the future of the Liberal Party – that “we need more women in our party organisation, we need more women in this party room”. \n\n“We did let women down, there’s no doubt about that,” she said of Peter Dutton’s campaign for the prime ministership against Anthony Albanese. \n\n“I want to rule a line under that. I don’t want to see that decline for one more day. That means a genuine, serious engagement with a new leadership team and new agenda, and one that I will personally drive.” \n\nThere is no question Ms Ley’s election is a milestone for the Liberals. \n\nWhether it is enough to finally solve the problem that has been haunting the party for over decade – the so-called one it has with women – remains to be seen. \n\n‘It didn’t start at the last election’\n\nThe Australian National University (ANU) found female Coalition voters had dropped from 45 per cent in 2013 to just 33 per cent at this year’s election, while an Australian Financial Review/Freshwater poll published in March showed just 28 per cent of women preferred Mr Dutton for prime minister. \n\nAccording to a 2013 study by the University of Wollongong, a party leader’s gender is but one of a multitude of factors that women consider when determining their vote. \n\nA decade later, you only have to look at the US to see that is still the case. \n\nIn November, Kamala Harris became the second female presidential candidate to fail at breaking the highest glass ceiling in American politics, and the second to be trounced by Donald Trump, following his landslide victory over Hillary Clinton in 2016. \n\nNot only was the Republican the more desirable candidate for white women over the age of 45, but fewer females voted for Ms Harris than they did for former President Joe Biden. \n\n‘Parties are more likely to be the holdup’\n\nAustralian voters have shown – on a local, state and federal level – that they are “not opposed” to voting for women. \n\nWhat is “more likely to be the hold-up”, La Trobe University political researcher Phoebe Hayman told news.com.au, are the parties themselves. \n\nEarlier this month, West Australian teal independent Kate Chaney told reporters that the Liberals’ 2018 rejection of Julie Bishop in favour of Scott Morrison as leader was its “sliding doors moment”, where “a lot of women looked … and thought, this does not look like a party that represents me”. \n\nThe Hume-Loughnane review of the 2022 election loss similarly found that defectors in teal seats were highly likely to agree with the statement that “the treatment or attitude toward women within the Liberal Party had a strong influence on my vote”. \n\nThe perception of female politicians as more compassionate, collegial and caring – all attributes that are seen as important during internal crises – “may be what is needed within the Liberal Party as it goes through a period of reflection”, Ms Hayman said. \n\n“However, women leaders are often punished for not adequately embodying masculine leadership traits when things improve, particularly by those within their party,” she continued.\n\n“Research shows women party leaders are more likely than men to have short tenures that end by either being pushed out or pressured to resign.” \n\nOn Friday, Today host Karl Stefanovic asked Ms Ley point-blank if sexism was the reason it had taken the Liberals “so long to elect a female leader”. \n\nThough Ms Ley responded she was “incredibly humbled to have the endorsement of my party room”, Australia Institute Chief Political Analyst Amy Remeikis told news.com.au the fact she only beat Angus Taylor by four votes - her 29 to his 25 - was worth noting.\n\n“Sussan Ley’s biggest issue is that there is no sign the party is united behind her,” Ms Remeikis said. \n\n“About half the party room does not want her as leader. And being a woman doesn’t mean that the party’s men-driven issues are solved, because the same people who supported Scott Morrison and Peter Dutton are still there. \n\n“Ley was also a defender of many of the policies Morrison and Dutton had in place and has shown she is just as willing to engage in reactionary politics and culture wars.” \n\n‘There is no opportunity for a circuit-breaker’\n\nWhat the Liberals can – or will – do now to reconnect with their female voter base is unclear.\n\nGiven Mr Dutton failed to produce any policy that spoke to women, the party might consider offerings in such areas as the environment, education and healthcare, Ms Hayman said, which female voters tend to prioritise.\n\nThe Labor Party now boasts a majority female government for the first time, with women outnumbering men in the lower house. However this was achieved almost three decades after the party made the decision to set gender quotas in the 1990s.\n\nThe Liberal Party did not follow suit, opting for “targets” instead despite Mr Morrison’s suggestion that quotas be considered in 2021. \n\nIt also “does not have” the 30-ish years Labor did to turn things around – an impossible feat unless it has “a complete rethink of who the modern Liberal Party is”, Ms Remeikis said. \n\n“Labor was also able to do that because of the federated nature of the party, where the Liberal Party has always prided itself on being led by its base,” she added.\n\n“But that means if the base and branches don’t want to see change and are doubling down on the direction of the party, then there is no opportunity for a circuit-breaker.” \n\n‘Liberals are in an electoral blackhole’\n\n“Symbolic representation” may be a good start, Ms Hayman said, “but symbolism alone won’t fix the party’s problems”. \n\n“For women to substantively represented in politics and to have women’s issues prioritised in policy platforms, they need to hold a critical mass within their party, giving them the confidence to come forward with opinions, perspectives and to support each other in party ballots,” she said.","summary":"Sussan Ley’s appointment as the Liberals’ first female leader is significant – but it may not be enough to fix the party’s biggest problem.","url":"https://www.news.com.au/finance/work/leaders/why-sussan-leys-election-wont-fix-the-liberal-partys-problem-with-female-voters/news-story/589679c90ff0f871ebee00f3b29426ac?from=rss-basic","image":"https://content.api.news/v3/images/bin/432b6dedb3aded1411394f61c6257443","video":null,"publish_date":"2025-05-17 22:02:35","author":"Natalie Brown","authors":["Natalie Brown"],"language":"en","category":"politics","source_country":"au","sentiment":-0.136},{"id":322390852,"title":"There Are No Rigged Elections in America, Except at DNC. Just Ask David Hogg.","text":"Who could’ve seen it coming?\n\nJust 101 days into his tenure as the Democratic Party’s youngest vice chair—and the first “Zoomer” to hold that office—party elites have already declared David Hogg’s election null and void, a complaint that sounds suspiciously like “election fraud.”\n\nIt’s the latest embarrassment from a spent political party that pales in comparison to President Donald Trump’s incredibly successful first 100 days. If Republicans are wise, they’ll take advantage of the chaos ahead of the 2026 midterms.\n\nThe complaint centers on broken parliamentary procedures—the preferred excuse of weasels and dictators alike to undermine democratic elections—specifically, DNC rules mandating “gender parity” to tip the scales in favor of female candidates running against men.\n\nIn other words, DEI did Hogg in.\n\nHogg, who was elected to help Democrats win back young male voters, complained that “the DNC has pledged to remove me, and this vote has provided an avenue to fast-track that effort.” Party elites, he believes, want to “defend an indefensible status quo.”\n\nThe DNC’s procedural revelation comes just two days after Hogg blasted his party for driving away young men who “feel like they have to walk on eggshells … constantly because they’re going to be judged or ostracized or excommunicated.”\n\nOh, the irony. More importantly, will conservatives capitalize on the blunder?\n\nFor years, Democrat politicians have told Americans that elections couldn’t be more trustworthy, that only they could safeguard democracy from MAGA Republicans, and that their party represents everyday people over ultra-wealthy special interests.\n\nNone of that is true, as this latest Chinese Communist Party-style election nullification reminds us.\n\nDemocrats routinely meddle with their internal elections to manufacture “victories” for party insiders, voters be damned. Remember the superdelegates in 2016 and 2020? Sen. Bernie Sanders of Vermont sure does—the “oligarchs and billionaires” he complains about cost him the Democratic nomination twice by rigging obscure parliamentary rules against him.\n\nCongressional Democrats haven’t accepted a Republican presidential victory as legitimate since 1988. House Democrats tried to nullify Republican election victories in 2016 and 2024 as illegitimate, yet called allegations of a stolen election in the extremely questionable COVID-19 election results in 2020 “misinformation.”\n\nAs for protecting democracy, leftists tried to turn 2024 into a one-party election in many states by removing Trump from the ballot. That was an inside job by D.C. operatives to thwart the will of voters, who delivered Trump a landslide victory anyway.\n\nDon’t forget Democrats’ effort to nullify the Constitution with a “national popular vote” scheme to award all Electoral College votes to whichever candidate wins the most popular votes nationwide. In 2016, that would’ve meant awarding all 538 electoral votes to Hillary Clinton—even in states she lost or didn’t bother to visit, like Wisconsin.\n\nAmazingly, Democrats suddenly went mute about the national popular vote after November 2024, with Michigan Democrats quietly abandoning their national popular vote bill mere weeks after Trump won a popular vote majority.\n\nThis from a party controlled by a small constellation of ultrapartisan activists, agitators, lobbyists, and political operatives in the Beltway. Recall that Kamala Harris never won a primary vote anywhere—not in two presidential elections.\n\nMassive dark-money donors with strong ties to Big Business and Wall Street magnates bankrolled Harris’ campaign from the start. Even in California, she was the ultimate product of one-party machine politics: a mediocre prosecutor who failed upward at every turn by collecting enough party IOUs to earn a political promotion. Her promise was to govern as a figurehead for the faceless Deep State cabal that the Left no longer tries to hide.\n\nIt was only after Harris came into contact with real, flesh-and-blood Americans in places like—shudder—Nevada and Pennsylvania that she fell to pieces. Normal people, it turns out, don’t consider mindless babbling and cackling substitutes for ideas and leadership.\n\nNow those same special interests are behind the second Trump “Resistance” to undermine the agenda most voters voted for.\n\nThere’s a common thread here: Democratic politicians and their allies attack the system as “rigged” and “unfair” when they lose. They’re champions of the system until the system doesn’t work for them, even a single time; then they reveal themselves for the lying opportunists they’ve been all along. Hogg, for all his inanity and gun control bona fides, was honest enough to criticize his party’s toxic obeisance to the radical feminists and trans nazis who’ve made the world’s oldest political party repulsive to young men (and most everyone else).\n\nHogg just proved that democracy cannot be tolerated in the Democratic Party. Dissent will be crushed with extreme prejudice. He’ll shortly be replaced by a gay black woman who pledges to enforce the party line, no questions asked.\n\nRepublicans should thank God for this gift. We have an opportunity to further expose and permanently defeat the woke mob while it’s distracted by infighting, but that window is quickly closing. If this is how the Democratic Party treats its own “democracy,” America, how will it treat yours?\n\nOriginally published by RealClearPolitics\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Who could&#8217;ve seen it coming? Just 101 days into his tenure as the Democratic Party&#8217;s youngest vice chair—and the first &#8220;Zoomer&#8221; to hold that office—party... Read More\n\n\nThe post There Are No Rigged Elections in America, Except at DNC. Just Ask David Hogg. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/17/there-are-no-rigged-elections-america-except-dnc/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/20250516_DavidHogg.jpg","video":null,"publish_date":"2025-05-17 20:00:00","author":"Hayden Ludwig","authors":["Hayden Ludwig"],"language":"en","category":"politics","source_country":"us","sentiment":-0.095},{"id":322412086,"title":"Walz calls Trump a ‘tyrant’ who is trampling Americans’ rights and violating the rule of law","text":"Democratic Gov. Tim Walz of Minnesota assailed Donald Trump in a law school graduation speech Saturday, accusing the Republican president of creating a national emergency by repeatedly violating the rule of law.\n\nWalz, the vice presidential nominee in 2024, used his remarks at the University of Minnesota’s law school commencement ceremony to call on graduates to stand up to abuses of power. Lawyers, he said, “our first and last line of defense.’’\n\n‘‘Right now, more than any other time in my lifetime, we need you to live up to the oath that you’re about to make. Because, I have to be honest with you: You are graduating into a genuine emergency,\" Walz told the crowd, which greeted him with loud applause. ‘‘Every single day, the president of the United States finds new ways to trample rights and undermine the rule of law.\"\n\nWalz pointed to Trump’s immigration crackdown, which includes deporting alleged gang members to a notorious prison in El Salvador without due process, and the offer of a gifted jet from the Qatari ruling family to the president.\n\n‘‘This is what the crumbling of rule of law looks like in real time. And it’s exactly what the founders of this nation feared: A tyrant, abusing power to persecute scapegoats and enemies,\" he said.\n\nSince Kamala Harris’ loss to Trump in November, Democrats have been debating which direction to take the party amid deep frustrations from Democratic voters that its leaders are failing to do enough to check the new administration.\n\nWalz is among a long list of potential 2028 candidates who have been traveling to early voting states.\n\nOthers include Illinois Gov. JB Pritzker, who sharply criticized ‘‘do-nothing\" Democrats last month for failing to oppose Trump. Pritzker, who is scheduled to headline a Minnesota Democratic dinner in June, drew attention in February when he used part of his joint budget and State of the State address to draw a parallel between Trump’s rhetoric and the rise of Nazi Germany.","summary":"Democratic Gov. Tim Walz of Minnesota assailed Donald Trump in a law school graduation speech Saturday, accusing the Republican president of creating a national emergency by repeatedly violating the rule of law.","url":"https://www.startribune.com/walz-calls-trump-a-tyrant-who-is-trampling-americans-rights-and-violating-the-rule-of-law/601356487","image":"https://arc.stimg.co/startribunemedia/H2MI36TKVBDRLE7Y3WXEDFEDEU.jpg?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2025-05-17 19:45:02","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.183},{"id":322405228,"title":"Biden’s Decline Was ‘Much Worse Behind the Scenes,’ Per New Book","text":"People close to President Joe Biden hid the extent of his decline, new reporting shows. Free from fears that sharing the truth might help elect Donald Trump, they are finally coming clean to journalists. Had they spoken up earlier, maybe things would look different. A new book makes the argument that the 82-year-old’s refusal to address his waning capabilities or accept defeat was a critical factor in Trump’s path back to power. \n\n Biden’s decline has long been apparent. As far back as 2019, his eye was bleeding during a televised town hall, and he was saying “look, fat” to an Iowa voter after challenging him to pushups. By early 2024, Biden was confusing the French president with a former French president who died in the 90s. The president was forced to drop out of the election last summer after a nightmarish debate performance against Trump revealed he was in terrible shape. \n\n But the extent of Biden’s deterioration was not a major topic of reporting for much of his presidency — and his decline was actively covered up, according to CNN’s Jake Tapper and Axios’ Alex Thompson. \n\n Their new book, Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again, uses interviews with more than 200 sources to show those close to Biden were trying to hide his plummeting cognitive abilities.\n\n “What we found by writing this book is that everything that we saw going on in front of the camera was much worse behind the scenes,” Tapper told the New Yorker’s David Remnick in an interview published Saturday. The journalists’ longtime sources were much more forthcoming after the election when they no longer had to worry about hurting Biden’s or Vice President Kamala Harris’ chances. \n\n It was clear to those around Biden that he was struggling. The people with access to the president shrank from the end of 2023 to 2024 as his decline became “precipitous,” as Thompson put it.\n\n When he decided to run for reelection, there were people close to the president who didn’t think it was a good idea. But no one actually told Biden that another bid for office would be irresponsible. Thompson partly blames Biden for creating an atmosphere that discouraged dissent. \n\n Tapper elaborated: “The point with Biden was such that I have never seen, until maybe the current administration — an administration where the president is so surrounded by people who will never tell him anything negative, ever, and in fact will block negative stuff from coming to him.”\n\n Biden Cabinet members told Tapper and Thompson that Cabinet meetings were “disturbing and frustrating.” As early as 2021, meetings followed scripts. In 2022, he forgot the name of one of his top advisors, the journalists report.\n\n October 2023 marked the beginning of what one Cabinet member called the “weird period,” where members of the Cabinet, with the exception of Secretary of State Antony Blinken and Secretary of Defense Lloyd Austin, did not interact with Biden. One secretary who did manage to meet with Biden in spring of 2024 found him “mumbly and incoherent and difficult to understand,” Tapper said.\n\n “But no one came forward,” Tapper said.” When they would complain internally, they were told, ‘He’s fine, be quiet.’”\n\n One person who did speak out was actor George Clooney. Thompson and Tapper report that Biden didn’t recognize the movie star at the June 2024 fundraiser Clooney was co-hosting. Biden’s aide even told him “you know George,” which didn’t spark the president’s memory. The aide then said “George Clooney.” \n\n “And then he’s, like, ‘Sure, yeah. Hey, how’re you doing?’” Tapper said. The incident prompted Clooney to write an op-ed in the New York Times where he argued that the Democrats needed a new nominee for president. \n\n “No one has been able to point out where Joe Biden had to make a presidential decision or make a presidential address where he was unable to do his job because of mental decline,” a spokesperson told the New Yorker when they published an excerpt from the book detailing this incident. \n\n And what if Biden had been reelected? People close to Biden think there would have been a constitutional crisis. Members of the Democratic party would have realized Biden was incapable of doing the job, and Biden’s inner circle would have refused to give up power. \n\n “There is more to being president than not being Donald Trump,” Thompson said. “And I think that sort of speaks to the frustrating choice Democrats and the country faced in this last election. You had somebody who even members of his own administration believed was not up to doing the job he was running for, for four more years, versus someone who they sincerely believed was going to hurt the country in significant ways.”","summary":"Jake Tapper and Alex Thompson spoke with the New Yorker about their reporting on Joe Biden’s decline and how his inner circle tried to hide it","url":"https://www.rollingstone.com/politics/politics-news/biden-decline-much-worse-behind-the-scenes-new-book-1235342039/","image":"https://www.rollingstone.com/wp-content/uploads/2025/05/GettyImages-2194939123.jpg","video":null,"publish_date":"2025-05-17 19:43:47","author":"Daniel Kreps,Naomi Lachance","authors":["Daniel Kreps","Naomi Lachance"],"language":"en","source_country":"us","sentiment":-0.506},{"id":322386232,"title":"Walz calls Trump a \"tyrant\" who abuses power and violates rule of law","text":"Democratic Gov. Tim Walz of Minnesota criticized Donald Trump in a law school graduation speech Saturday, accusing the Republican president of creating a national emergency by repeatedly violating the rule of law.Walz, the vice presidential nominee in 2024, used his remarks at the University of Minnesota's law school commencement ceremony to call on graduates to stand up to abuses of power. Lawyers, he said, are \"our first and last line of defense.\"\"Right now, more than any other time in my lifetime, we need you to live up to the oath that you're about to make. Because, I have to be honest with you: You are graduating into a genuine emergency,\" Walz told the crowd, which greeted him with loud applause. \"Every single day, the president of the United States finds new ways to trample rights and undermine the rule of law.\"Walz pointed to Trump's immigration crackdown, which includes deporting alleged gang members to a notorious prison in El Salvador, questions about lack of due process and the offer of a gifted jet from the Qatari ruling family to the president.\"This is what the crumbling of rule of law looks like in real time. And it's exactly what the founders of this nation feared: A tyrant, abusing power to persecute scapegoats and enemies,\" he said.Since Kamala Harris' loss to Trump in November, Democrats have been debating which direction to take the party amid deep frustrations from Democratic voters that its leaders are failing to do enough to check the new administration.Walz is among a long list of potential 2028 candidates who have been traveling to early voting states.Others include Illinois Gov. JB Pritzker, who sharply criticized \"do-nothing\" Democrats last month for failing to oppose Trump. Pritzker, who is scheduled to headline a Minnesota Democratic dinner in June, drew attention in February when he used part of his joint budget and State of the State address to draw a parallel between Trump's rhetoric and the rise of Nazi Germany.This past week, President Joe Biden's transportation secretary, Pete Buttigieg, returned to Iowa for a town hall where he criticized Trump's administration while demanding that Democrats make their agenda clear and reach out to people who disagree with them.California Gov. Gavin Newsom has been hosting a high-profile podcast. Vermont Sen. Bernie Sanders and New York Rep. Alexandria Ocasio-Cortez have been drawing huge crowds to rallies across the country. Walz and Gov. Wes Moore of Maryland have scheduled stops in South Carolina at the end of May.In his commencement speech, Walz acknowledged his words were particularly pointed for a celebratory ceremony.\"Some would say, 'Boy, this is getting way too political for a commencement address.' But I would argue: I wouldn't be honoring my oath if I didn't address this head on,\" he said to applause and cheers.Later, he scoffed at some Democrats who have urged the party to focus on issues such as trade, where Trump is polling badly, instead of the rule of law.He also attacked \"feckless\" and \"cowardly\" big law firms that have acquiesced to Trump in the face of threats, with some offering millions in pro bono work and other benefits.\"It's a flagrant betrayal of the oath they took as lawyers,\" he said, urging graduates to refuse to work for or with those firms as they make their way into the workforce.","summary":"Walz, the vice presidential nominee in 2024, made his remarks at the University of Minnesota's law school commencement ceremony.","url":"https://www.cbsnews.com/news/walz-calls-trump-a-tyrant/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/08/076c323f-2de8-4e43-9778-4c927ed19d0f/thumbnail/1200x630/a82d545f9e70c96ce14cc2be701ade62/gettyimages-2182605122-1.jpg?v=6df9366690ed146f169dd0670c453f91","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3597018_hls/master.m3u8","publish_date":"2025-05-17 19:29:46","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.331},{"id":322380412,"title":"Scapegoating Joe Biden Isn’t Going to Solve the Democratic Party’s Problems","text":"“We got so screwed by Biden, as a party,” former Barack Obama adviser David Plouffe is quoted saying in a New Yorker excerpt from Jake Tapper and Alex Thompson’s new book, “Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again.”\n\nThe supposition of the piece, headlined “How Joe Biden Handed the Presidency to Donald Trump,” is that Democrats only failed to hold the White House because of Biden’s prideful obstinacy.\n\nScapegoating Biden for all the Left’s considerable political problems is an ugly hypocrisy. It is also self-delusional. There is a reason the Democratic Party’s polling is at historic lows right now, and it’s not just Biden’s memory problems.\n\nLet’s recall that every congressional Democrat decided to shoehorn the Inflation Reduction Act into law even after most economists warned it would plunge the nation into price spikes. Biden wasn’t the only one leaning into the hysterics of “semi-fascism.” If anything, Biden had merely adopted the social science quackery on gender that so many Democrats champion.\n\nDid any elected Democrat speak out about the anarchy of illegal immigration? If so, I must have missed it. Yet, according to a preelection Pew poll, 78% of people believed the border was a crisis or major problem.\n\nOne of the big criticisms of Biden is that he failed to make room for another candidate earlier. Almost surely, Kamala Harris would have been the nominee regardless of when Biden dropped out. Does anyone really believe a hyper-ambitious politician ensconced in the White House was going to step aside or let some middling governor wrest the nomination from her? The only Democrat who consistently outperformed Harris in most polls after Biden’s debate debacle was Michelle Obama. It was going to be Harris.\n\nWhat makes anyone think that Harris would have experienced more success had she enjoyed more time? After an initial jolt up, the vice president’s popularity steadily declined. Harris needed less time, not more. The more the public heard from her, the more they disliked her.\n\nHarris, like any other possible Democrat candidate, was compelled to run on the president’s record. And that record, championed by virtually every Democrat, was unpopular long before the media were compelled to acknowledge the president’s declining mental state.\n\nThe Democratic Party had blown it. Polls found that only 36% approved of Biden’s handling of the economy, 28% approved of his handling of immigration, 33% approved of his handling of foreign policy, and 30% approved of his handling of the Middle East.\n\nNow, even with those numbers, elections are a contest between two visions. A CBS News poll found that 65% of Americans remember the economy under Trump fondly, while only 38% said the same about Biden.\n\nDoes anyone really believe that Govs. Wes Moore, Gretchen Whitmer, Gavin Newsom, Andy Beshear or JB Pritzker possess the kind of charismatic personality or compelling message to overcome that record? It’s exceptionally unlikely.\n\nPlouffe might have been one of the few Democrats who publicly questioned the wisdom of running a man whose mental acuity had slipped for years. Until the day of the first 2024 presidential debates, however, virtually the entirety of the party and media had been shielding Biden. If the president had refused to debate Trump, the Left would have almost surely kept on concealing Biden’s condition. It had no choice but to turn on the president once he had been exposed.\n\nWe learn in The New Yorker that Biden didn’t recognize George Clooney at the infamous Hollywood fundraiser where Barack Obama had to lead the president off stage by hand. Recall that even at this point, the big media were still gaslighting the public about the president’s deteriorating acuity. Three days later, Tapper’s colleague wrote in CNN’s media newsletter that the claim had been a “fabrication.”\n\nTwo days before the debate, then-Majority Leader Chuck Schumer, D-N.Y., had told reporters the president was sharper than he’d been in years. “He’s fine. All this right-wing propaganda that his mental acuity has declined is wrong,” he said.\n\nIn the New Yorker piece, we learn that Schumer would speak to Biden on the phone regularly, “and, after some chit chat,” the president would “admit that he’d forgotten why he’d called. Sometimes he rambled. Sometimes he forgot names. Schumer wasnt concerned about Biden’s acuity, but he was worried about the optics.”\n\nThe president is the most powerful man in the world, and the Senate leader was worried about optics. So, indeed, was the rest of his party.\n\nWhich is merely to say that Democrats screwed themselves.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"“We got so screwed by Biden, as a party,” former Barack Obama adviser David Plouffe is quoted saying in a New Yorker excerpt from Jake... Read More\n\n\nThe post Scapegoating Joe Biden Isn’t Going to Solve the Democratic Party’s Problems appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/17/scapegoating-joe-biden-isnt-going-to-solve-the-democratic-partys-problems/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/250516-BidenAge.jpg","video":null,"publish_date":"2025-05-17 18:00:00","author":"Climate Alarmist Policies,David Harsanyi","authors":["Climate Alarmist Policies","David Harsanyi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.389},{"id":322378012,"title":"Walz calls Trump a 'tyrant' who is trampling Americans' rights and violating the rule of law","text":"Democratic Gov. Tim Walz of Minnesota assailed Donald Trump in a law school graduation speech Saturday, accusing the Republican president of creating a national emergency by repeatedly violating the rule of law. Walz, the vice presidential nominee in 2024, used his remarks at the University of Minnesota's law school commencement ceremony to call on graduates to stand up to abuses of power. Lawyers, he said, \"our first and last line of defense.\" \"Right now, more than any other time in my lifetime, we need you to live up to the oath that you're about to make. Because, I have to be honest with you: You are graduating into a genuine emergency,\" Walz told the crowd, which greeted him with loud applause. \"Every single day, the president of the United States finds new ways to trample rights and undermine the rule of law.\" Walz pointed to Trump's immigration crackdown, which includes deporting alleged gang members to a notorious prison in El Salvador without due process, and the offer of a gifted jet from the Qatari ruling family to the president. \"This is what the crumbling of rule of law looks like in real time. And it's exactly what the founders of this nation feared: A tyrant, abusing power to persecute scapegoats and enemies,\" he said. Since Kamala Harris' loss to Trump in November, Democrats have been debating which direction to take the party amid deep frustrations from Democratic voters that its leaders are failing to do enough to check the new administration. Walz is among a long list of potential 2028 candidates who have been traveling to early voting states. Others include Illinois Gov. JB Pritzker, who sharply criticized \"do-nothing\" Democrats last month for failing to oppose Trump. Pritzker, who is scheduled to headline a Minnesota Democratic dinner in June, drew attention in February when he used part of his joint budget and State of the State address to draw a parallel between Trump's rhetoric and the rise of Nazi Germany. This past week, President Joe Biden's transportation secretary, Pete Buttigieg, returned to Iowa for a town hall where he criticized Trump's administration while demanding that Democrats make their agenda clear and reach out to people who disagree with them. California Gov. Gavin Newsom has been hosting a high-profile podcast. Vermont Sen. Bernie Sanders and New York Rep. Alexandria Ocasio-Cortez have been drawing huge crowds to rallies across the country. Walz and Gov. Wes Moore of Maryland have scheduled stops in South Carolina at the end of May. In his commencement speech, Walz acknowledged his words were particularly pointed for a celebratory ceremony. \"Some would say, 'Boy, this is getting way too political for a commencement address.' But I would argue: I wouldn't be honoring my oath if I didn't address this head on,\" he said to applause and cheers. Later, he scoffed at some Democrats who have urged the party to focus on issues such as trade, where Trump is polling badly, instead of the rule of law. He also attacked \"feckless\" and \"cowardly\" big law firms that have acquiesced to Trump in the face of threats, with some offering millions in pro bono work and other benefits. \"It's a flagrant betrayal of the oath they took as lawyers,\" he said, urging graduates to refuse to work for or with those firms as they make their way into the workforce.","summary":"Minnesota Governor Tim Walz, a potential 2028 presidential contender, strongly criticized Donald Trump's actions during a law school graduation speech. Walz accused Trump of repeatedly violating the rule of law and creating a national emergency. He urged graduates to defend against abuses of power, citing Trump's immigration policies and alleged ethical breaches.","url":"https://timesofindia.indiatimes.com/world/us/walz-calls-trump-a-tyrant-who-is-trampling-americans-rights-and-violating-the-rule-of-law/articleshow/121239956.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-121240023/121240023.jpg","video":null,"publish_date":"2025-05-17 17:34:47","author":"Jill Colvin","authors":["Jill Colvin"],"language":"en","category":"politics","source_country":"in","sentiment":0.318},{"id":322358386,"title":"This cabinet member is the clear favorite to succeed Donald Trump as Republican candidate in U.S elections 2028","text":"A new poll by J.L. Partners shows JD Vance is the favorite to become the Republican candidate in the 2028 U.S. elections. 46% of Republicans who were asked in May said they would support Vice President JD Vance in the primaries, according to the reports, by the New York Post.Vance is the only one with double-digit support in the poll. Florida Governor Ron DeSantis came second with 8%. Vivek Ramaswamy, a candidate from Ohio, got 7%. Marco Rubio and Senator Ted Cruz from Texas each got 6%. Nikki Haley, ex-Governor of South Carolina, got 5%. The poll did not include Donald Trump, who will be term-limited in January 2029, according to a New York Post report.Even though he can’t run again legally, Trump and his team have hinted he might try to run for a third time, which would be against the Constitution.On the Democratic side, Kamala Harris is the top pick with 30% support. Pete Buttigieg came second with 8%. Josh Shapiro and Gavin Newsom both got 7%.JD Vance is 40 years old, who on earlier occasions let his not so flattering opinions of Trump known. In 2016, he even called Trump “America’s Hitler.” Nine years and a full 360 degree turn later, he is fully supporting Trump and the MAGA movement, and has turned out to be one of his most loyal aides. Trump appointed him as his Vice President, only 2 years after JD Vance was elected for the first time.DeSantis, 46, lost Trump’s support in 2023 after running against him. He is liked by Republicans who don’t want the MAGA movement to go on.Rubio, 53, ran against Trump in 2016, and Trump mocked him by calling him “Little Marco”, but now, they are allies. Rubio is part of the Trump administration and was even on Trump’s VP shortlist last year. He is MAGA, but not as loud as Trump, Vance, or DeSantis.In March, Trump said the MAGA movement has a strong future. He mentioned that Vance and Rubio are some of his favorite choices for the future. Trump said, “You look at Marco, you look at JD Vance, who’s fantastic, according to the reports. I could name 10, 15, 20 people. We have a tremendous party”, according to the report by NBC's Meet the Press. FAQsQ1. Who’s winning in the Republican race for 2028?Right now, most Republican voters are picking JD Vance as their top choice.Q2. Can Trump run for president again in 2028?Nope, the rules say a person can only be president two times.","summary":"A new poll shows JD Vance is leading among Republicans for the 2028 U.S. elections. He now supports Trump strongly, even though he once criticized him.","url":"https://economictimes.indiatimes.com/news/international/us/this-cabinet-member-is-the-clear-favorite-to-succeed-donald-trump-as-republican-candidate-in-u-s-elections-2028/articleshow/121239033.cms","image":"https://img.etimg.com/thumb/msid-121239071,resizemode-4,width-1200,height-900,imgsize-44784,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-17 16:07:37","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.106},{"id":322350626,"title":"Biden interview audio reveals who brought up Beau's death — and it wasn't Hur","text":"Former President k lashed out against special counsel Robert Hur over a report in which he described the longtime lawmaker as a \"sympathetic, well-meaning, elderly man with a poor memory.\" The part of Hur’s report that most angered Biden was the suggestion that the then-president could not remember when his son, Beau, died. However, new audio obtained by Axios sheds light on Biden’s lapses in memory. In February 2024, Biden and several high-profile Democrats — as well as media personalities — attacked Hur. During a press conference on Hur’s report, Biden said, \"There’s some attention paid to some language in the report about my recollection of events. There’s even a reference that I don’t remember when my son died. How in the hell dare he raise that?\" CONSERVATIVES REACT TO LEAKED BIDEN AUDIO ON SOCIAL MEDIA: 'THIS IS PAINFUL' Then-Vice President Kamala Harris slammed Hur in February 2024, saying his report was \"gratuitous, inaccurate and inappropriate.\" She also suggested that it was \"clearly politically motivated.\" Harris recalled Biden’s alleged sharpness at the time, noting that Hur’s interview took place on Oct. 8, 2023 — just one day after Hamas’ attack on Israel. Harris said she was \"in almost every meeting\" with Biden and that he was \"in front of and on top of it all.\" Reps. Jerry Nadler, D-N.Y., and Pramila Jayapal, D-Wash., grilled Hur when he testified on Capitol Hill in March 2024. Both lawmakers attempted to get Hur to say that his report \"exonerated\" Biden — which he did not do. Then–Rep. Adam Schiff, D-Calif., also criticized the special counsel, suggesting that Hur knew his description of Biden would \"ignite a political firestorm,\" something Hur denied. JONATHAN TURLEY: BIDEN NOT THE ONLY LOSER REVEALED BY SHOCKING HUR AUDIO Former Obama advisor David Axelrod also criticized the report, calling it a \"shiv the special counsel stuck into the Biden reelection campaign,\" according to CNN. On Friday, Axios published a bombshell report that included audio recordings from Biden’s interview with Hur, something the previous administration refused to release. The audio includes long pauses in which Biden struggled to recall the dates of several major events, including when President Donald Trump was elected to office for his first term, his son’s death or his exit from office as vice president. CLICK HERE TO GET THE FOX NEWS APP Since his report was released, Hur has seen two key moments of vindication aside from Friday’s report. The first came when the transcript of his interview was released in March 2024. At the time, the White House refused to release the audio, citing fears of AI deepfakes. Hur appeared to receive further vindication when Biden had his disastrous debate against then-candidate Trump in June 2024. Less than a month after the debate, Biden withdrew from the 2024 presidential race and endorsed Harris.","summary":"A newly released recording of then-President Joe Biden&apos;s October 2023 interview with special counsel Robert Hur is full of awkward pauses, stuttering and misremembered dates.","url":"https://www.foxnews.com/politics/biden-interview-audio-reveals-who-brought-up-beaus-death-wasnt-hur","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/joe-biden-robert-hur.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-17 16:04:30","author":"Rachel Wolf","authors":["Rachel Wolf"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.352},{"id":322355134,"title":"Trump lashes back at Springsteen, calls him a jerk. Says he hates Taylor Swift","text":"Donald Trump’s at it again, chucking verbal grenades at Bruce Springsteen, Taylor Swift, and the Supreme Court in a Truth Social rant that’s got fans, pundits, and legal eagles in a right tizzy. \n\nThis is not the first time Trump has criticised global personalities such as Springsteen and Swift, who supported Kamala Harris during her 2024 presidential campaign. \n\nBut Trump’s recent social media posts are among his first insulting A-listers since his return to office. During his first term, the president frequently confronted renowned actors and TV personalities, including Meryl Streep and Robert De Niro.\n\nSpringsteen fired shots at Trump and his administration in three statements made during the opening night of his Land of Hope and Dreams Tour in Manchester, England.\n\nBefore performing “Land of Hope and Dreams” Wednesday night, he called the current US government “corrupt, incompetent and treasonous.” And before singing “House of a Thousand Guitars,” he said, “the union of people around a common set of values” are “all that stands between democracy and authoritarianism.” \n\nAs he introduced “My City of Ruins,” Springsteen called Trump an “unfit president” in a longer speech criticising what he described as “very weird, strange and dangerous s— going on” in the United States.\n\nSpringsteen is an ‘obnoxious jerk’\n\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden,” Trump wrote on Truth Social on Friday morning. He lashed out more at Biden, saying he is “a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.”\n\nAnd back to Springsteen with what appeared to be a threat more than a warning: “He is “dumb as a rock,” and couldn’t see what was going on, or could he (which is even worse!)? He ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just “standard fare.” Then we’ll all see how it goes for him!”\n\nAn hour before lashing out at Springsteen, Trump took aim at Swift, saying she’s past her prime. “Has anyone noticed that, since I said “I HATE TAYLOR SWIFT,” she’s no longer “HOT?”\n\nTrump raged against the pop singer on the same platform in September, days after Swift endorsed Harris for president, and warned her 280 million followers against AI deepfakes of her endorsing Trump. \n\nSwift previously compared Trump’s presidency to an “autocracy” and accused him of “stoking the fires of white supremacy and racism.”","summary":"Donald Trump’s at it again, chucking verbal grenades at Bruce Springsteen, Taylor Swift, and the Supreme Court in a Truth [&#8230;]","url":"https://euroweeklynews.com/2025/05/17/trump-lashes-back-at-springsteen-calls-him-a-jerk-says-he-hates-taylor-swift/","image":"https://cdn.euroweeklynews.com/wp-content/uploads/2025/05/Trumps-not-happy-at-all-with-Bruce-Springsteen-rant-during-his-Manchester-concert-Wednesday-May14th-Photo-Shutterstock-1.jpg","video":null,"publish_date":"2025-05-17 15:54:30","author":"Olivier Acuña Barba","authors":["Olivier Acuña Barba"],"language":"en","category":"entertainment","source_country":"es","sentiment":-0.261},{"id":322354454,"title":"Mary Trump Issues 'Dangerous Times' Warning Over Donald Trump","text":"Mary Trump, a vocal critic and estranged niece of President Donald Trump, warned in a Thursday blog post that the country is \"living in uniquely dangerous times\" during his second term, but maintained there is still hope for Democrats to push back.Newsweek has reached out to Mary Trump via her Substack email and to the Democratic National Committee (DNC) for comment via email on Saturday morning.Why It Matters Mary Trump has been outspoken against her uncle for years, and in 2020, published Too Much and Never Enough, a tell-all book about Trump and their family. In it, she says the president is \"utterly incapable of leading this country and it's dangerous to allow him to do so.\"Donald Trump returned to the Oval Office in January, after winning the popular vote and the Electoral College in November 2024. The scale of the Republican Party's triumph in November—taking the White House, flipping the Senate, and maintaining control of the House—has sparked widespread soul-searching within the Democratic Party over what went wrong and how to rebuild. Democratic leaders have come under criticism from within, some for pushing the party too far left, and others for appearing too conciliatory toward Trump.In his first three months back in office, President Trump has faced significant support and backlash. His administration has been hit with a wave of lawsuits over executive orders and wartime powers that critics say threaten due process, a cornerstone of the U.S. Constitution.What To KnowMary Trump opened her Thursday blog post by describing the current moment as \"uniquely dangerous times,\" later labeling it as a \"treacherous point in our history,\" and urged readers to \"start showing up in different ways from what we might be used to.\"She wrote that she remains \"in this fight\" against her uncle \"because it's necessary,\" and reflected on her fears leading up to the 2020 election, when she asked: \"What happens if Donald gets a second shot at the presidency?\"Her answer: \"It will be the end of the American experiment.\" Later in her Substack post, she accused her uncle and the Republican Party of being \"hellbent on taking away something that is extraordinarily precious to me and to everybody reading this: our democracy—our imperfect, striving-to-be-more-perfect democracy.\"The idea of a crumbling American democracy has been echoed by many Democrats and Trump critics who say Trump is overreaching his presidential powers and dismantling key institutions. Many Republicans, meanwhile, say that the president is restructuring the government to make it more efficient, effective and functional for Americans.Mary Trump also criticized her political allies, writing in her post: \"We haven't done enough to protect it,\" adding: \"Our institutions are failing us and one of the reasons that's the case is because the Democratic Party has convinced itself for far too long that our institutions did not need to be strengthened, they did not need to be protected.\"She urged Democrats to \"work around the edges\" and to \"plan ahead,\" outlining a strategy that includes opposing Republicans while being \"honest about the ways in which the Democrats are falling short.\"\"We all have power. We are all on the right side of history. We are angry, and we have every right to be. And our anger is righteous. If we focus our anger, if we come together and understand that any differences we have are irrelevant compared to what we are fighting for we can unite effectively to win that fight,\" she wrote.Democrats have faced internal divisions and external pressure following significant losses in 2024. Some rising voices in the party, including independent Senator Bernie Sanders of Vermont who caucuses with Democrats and Representative Alexandria Ocasio-Cortez of New York, have built their platforms around opposition to Trump and his \"oligarchy,\" holding rallies across the country. Meanwhile, Senate Minority Leader Chuck Schumer of New York has backed some Trump-aligned GOP initiatives, including a reconciliation budget bill.After Mary Trump's tell-all book was released, Donald Trump called it \"disgraceful.\" He told former Fox News Sunday host Chris Wallace that \"she was not exactly a family favorite,\" adding, \"We didn't have a lot of respect or like for her.\"What People Are Saying Comedian and host Bill Maher said on his show earlier this month: \"If the thought leaders in the Democratic Party keep encouraging and not rebuking the idea that America is cringe, and the people who run Gaza are great, the Democrats are doomed.\"Senator Mark Warner, a Virginia Democrat, said in February: \"I think the Democrats' brand is really bad, and I think this was an election based on culture. And the Democrats' failure to connect on a cultural basis with a wide swath of Americans is hugely problematic. I think the majority of the party realizes that the ideological purity of some of the groups is a recipe for disaster and that, candidly, the attack on over-the-top wokeism was a valid attack.\"Former Secretary of Transportation Pete Buttigieg said on the FLAGRANT podcast that aired in April: \"I do think my party needs to do a much better job, especially with the kind of finger-wagging that you're talking about; I think we are like very prone to that.\"Representative Alexandria Ocasio-Cortez at an April Los Angeles rally: \"Big money is how we got Donald Trump. And his whole presidency began with launching tools for bribery, meme coins to fleece working people and move around money in the dark, extortion settlements from media companies and law firms who gladly pay them.\"What Happens Next?The 2026 midterm elections are expected to be a bellwether of the Trump administration and the Democratic Party.It's unclear who the party will eventually support in the 2028 presidential election, with some early polling showing former Vice President Kamala Harris leading the pack of potential presidential candidates, followed by Ocasio-Cortez, California Governor Gavin Newsom and Buttigieg.","summary":"Mary Trump, the estranged niece of the president, warned that Democrats need to mobilize to counteract this current \"dangerous\" moment under Trump.","url":"https://www.newsweek.com/mary-trump-issues-dangerous-times-warning-over-donald-trump-2073626","image":"https://d.newsweek.com/en/full/2646646/mary-trump-donald-trump.png","video":null,"publish_date":"2025-05-17 15:43:21","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","category":"politics","source_country":"us","sentiment":-0.135},{"id":322364126,"title":"Travis Kelce reacts to Donald Trump’s ‘hot’ comment about Taylor Swift","text":"President Donald Trump has gone viral again for making another comment about Taylor Swift.\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” Trump wrote Friday, May 16 on Truth Social, referencing his post about the singer last year. \nSwift was not the only one whom Trump targeted. 20-time Grammy winner and New Jersey native Bruce Springsteen was also someone who Trump negatively spoke about online Friday.\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,” Trump wrote. “Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy.”\nIn response to Trump’s bashing of Swift and Springsteen, American Federation of Musicians president Tino Gagliardi stood up to the president about his inappropriate lashings.\n“Bruce Springsteen and Taylor Swift are not just brilliant musicians, they are role models and inspirations to millions of people in the United States and across the world,” Gagliardi said.\n“Whether it’s Born in the USA or the Eras Tour, their music is timeless, impactful, and has deep cultural meaning,” he added. “Musicians have the right to freedom of expression, and we stand in solidarity with all our members.”\nSimilar to his response before Swift’s boyfriend, Travis Kelce, expressed his outrage for Trump’s comments about his girlfriend privately according to a source per Daily Mail.\n“Travis is livid that the President of the United States is talking negatively about Taylor,” a source told the publication. “He is so mad that he is going to use it as motivation during training for the season ahead, especially if Trump continues talking.\n“Since Travis can’t say anything publicly because that would just open another can of worms, he has to figure out ways to get it out of his system because he would love to protect Taylor and stick up for her. But keeping quiet is the move he has to do right now.”\nTrump has publicly taunted Swift since she endorsed former Vice President Kamala Harris and Tim Walz. She also cleared up rumors that she was endorsing Trump when she was told AI images of her were on his site.\n“Recently I was made aware that AI of ‘me’ falsely endorsing Donald Trump’s presidential run was posted to his site. It really conjured up my fears around AI, and the dangers of spreading misinformation. It brought me to the conclusion that I need to be very transparent about my actual plans for this election as a voter. The simplest way to combat misinformation is with the truth,” she wrote in a Instagram caption of a photo holding up her cat.\nShe continued declaring her endorsement for Harris and Walz, “I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election. I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them. I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos. I was so heartened and impressed by her selection of running mate @timwalz, who has been standing up for LGBTQ+ rights, IVF, and a woman’s right to her own body for decades.”\n\nView this post on Instagram\n\nA post shared by Taylor Swift (@taylorswift)\n\nHarris and Walz evidently came up short in the election and Trump began his second term in the office in January.","summary":"President Donald Trump has gone viral again for making another comment about Taylor Swift. “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she&#8217;s no longer ‘HOT?’” Trump wrote Friday, May 16 on Truth Social, referencing his post about the singer last year. Swift was not the only one whom Trump targeted. 20-time [&#8230;]\n\n\nThe post Travis Kelce reacts to Donald Trump&#8217;s &#8216;hot&#8217; comment about Taylor Swift appeared first on ClutchPoints.","url":"https://clutchpoints.com/celebrity/travis-kelce-reacts-donald-trump-hot-comment-taylor-swift","image":"https://wp.clutchpoints.com/wp-content/uploads/2025/05/Travis-Kelce-reacts-to-Donald-Trumps-hot-comment-about-Taylor-Swift.jpg","video":null,"publish_date":"2025-05-17 15:41:00","author":"Autumn Hawkins","authors":["Autumn Hawkins"],"language":"en","source_country":"us","sentiment":0.154},{"id":322423570,"title":"Newly released audio appears to confirm Biden’s memory lapses in 2023","text":"A newly released recording appears to confirm that Joe Biden suffered some memory lapses while US president, struggling to recall the year his son died or when Donald Trump was first elected.\n\nWhile being interviewed by a special counsel over his handling of classified records, the audio shows Biden’s responses are marked by long pauses, a faint whispered voice and confusion over key dates, such as when his son Beau died (2015) or when Trump won his first presidency (2016).\n\nThe audio, obtained by Axios through an undisclosed source and then released by the outlet, includes attempts by Biden’s staff to remind or correct him on details during his interviews in October 2023 with Robert Hur, a special counsel at the Department of Justice. Hur, who investigated Biden’s handling of classified material, subsequently described the then president as a “sympathetic, well-meaning elderly man with a poor memory” in his final report, which recommended against charging Biden with any sort of crime.\n\nA written transcript of the five-hour interview was released last year. But the newly released audio provides some context for Biden’s struggle to recall certain facts.\n\nAt the time, White House officials strongly denied that Biden was impaired in his ability to do his job as president, with allies continuing to back Biden until a disastrous debate with Trump in June 2024 resulted in mounting pressure for him to step aside as the Democratic candidate. He did so in favor of his vice-president, Kamala Harris, a month later.\n\nPolling at the time showed that many Americans considered Biden, at the time 81 years old, to be too old to run again as president. Though he had beaten Trump in 2020, Biden’s decision to try to run against him again, with Trump just three years younger than him, has come under intensifying scrutiny.\n\nAt the release of Hur’s report, Biden and his allies reacted angrily to its claims. “There’s even a reference that I don’t remember when my son died,” Biden said last year. “How in the hell dare he raise that? Frankly, when I was asked the question, I thought to myself it wasn’t any of their damn business.”\n\nThe audio also includes Biden talking about how Barack Obama – whom he served as vice-president – didn’t want him to run for the White House in 2016 due to the belief that Hillary Clinton “had a better shot of winning the presidency than I did”. There were also deviations to ponder the influence of the Gutenberg printing press and the experience of driving a Corvette with the comedian Jay Leno.\n\nTrump repeatedly mocked Biden’s age and gaffes before going on to defeat Harris in last year’s election.\n\nHowever, the current president has also had lapses of his own, appearing to confuse E Jean Carroll, who accused him of sexual abuse and was awarded damages, with his ex-wife Marla Maples when shown a photograph during a deposition. He also claimed that the audience “went crazy” during his televised debate with Harris last year (there was no audience whatsoever in the room).\n\nTrump has also continued his habit of delivering discursive speeches littered with multiple untruths and gross exaggerations while president and has even been accused of falling asleep during events, although the White House has denied these claims.\n\nOn Friday, Trump further raised eyebrows when he referenced the most notorious racial epithet when discussing the recent ceasefire between India and Pakistan, both nuclear-armed countries, with Fox News.\n\n“It was getting deeper and more, I mean, more missiles,” Trump said. “Everyone was stronger, stronger, to a point where the next ones are going to be you know what: the N-word.”\n\n“You know what the N-word is, right?” he asked host Brett Baier, who replied: “nuclear”. Trump said “yeah”, and both men laughed over the exchange.","summary":"Interview by special counsel shows then president having problems remembering key dates and life events\n\nA newly released recording appears to confirm that Joe Biden suffered some memory lapses while US president, struggling to recall the year his son died or when Donald Trump was first elected.\n\nWhile being interviewed by a special counsel over his handling of classified records, the audio shows Biden’s responses are marked by long pauses, a faint whispered voice and confusion over key dates, such as when his son Beau died (2015) or when Trump won his first presidency (2016).\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/may/17/audio-biden-memory-lapses","image":"https://i.guim.co.uk/img/media/9dfd4871fe075d8fe09c114288c3f2af24f15e57/21_0_4112_3291/master/4112.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVm","video":null,"publish_date":"2025-05-17 15:07:15","author":"Oliver Milman","authors":["Oliver Milman"],"language":"en","source_country":"gb","sentiment":-0.286},{"id":322355628,"title":"Republicans voted to kill ‘woke'—only to hurt their own communities","text":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\nThere are few places more Republican than Idaho, a state that gave Donald Trump 67% of the vote in the 2024 presidential election. His opponent, then-Vice President Kamala Harris, couldn’t even muster one-third of the vote, languishing back at 30%. \n\nA rational person would look at that vote and say: Congrats, Gem Staters. You got what you voted for—you should be so happy! But Pocatello, Idaho, sure isn’t acting it. \n\nThe Biden administration awarded this city an EPA grant of $16 million from a program that helps “disadvantaged communities tackle environmental and climate justice challenges.” And the town was going to use that money for all sorts of good stuff, according to the Idaho Statesman\n\n“In Pocatello, that would have meant creating sewer infrastructure for newly annexed parts of the city’s South 5th Avenue corridor near the Foothills, helping to increase drinking-water quality and access to fire hydrants,” the paper reported.\n\nBut Trump’s EPA cancelled the grant on May 2, saying it was “no longer consistent with EPA funding priorities.” You see, the program was for “disadvantaged communities” dealing with “environmental and climate justice challenges.” In other words, it was WOKE. \n\nNever mind that Pocatello is 86% white. \n\n“The grant would have helped to address concerns that ‘are truly material, that just help everybody. And now, I don’t know what we’re going to do,’” one of the city’s council members told the Idaho Statesman.\n\nIt absolutely would’ve helped the city, but hey, Idaho decided that keeping a handful of trans girls from playing sports was so much more important. And Idahoans really don’t like California, so maybe we should be grateful that the blue state (along with Washington, Massachusetts, and New Jersey) no longer has to subsidize their quality-of-life improvements. \n\nSo what are they going to do now? One option: raise their own taxes. The right-wing Tax Foundation ranks Idaho the 11th lowest-tax state. Gem State residents can keep voting to keep their tax burden low and Republicans in power in Boise and Washington, or they can vote for safe drinking water and functional fire hydrants. \n\nThis is also a reminder that former President Joe Biden funneled tens of billions in federal dollars to exactly these kinds of places in the hope that conservatives would reward Democrats with their votes. Indeed, most of his infrastructure spending went to rural and red areas, to the detriment of states, cities, and regions that have been reliably Democratic. \n\n“Most (51%) of the investments directly tied to incentives from the IRA and the CHIPS Act are flowing to Republican states, compared with 20% to blue states, according to a Fitch Ratings analysis shared exclusively with CNN,” the network reported. “Fitch defined red states as those that voted for former President Donald Trump in 2020 by more than three percentage points.”\n\nRelated | It’s fascinating to watch Trump supporters realize they screwed up\n\nThis has to end. The next time Democrats are in power, they need to more intentionally reward those regions that vote blue, to give them a tangible reason to keep voting for them. What good does it do Detroit voters if the Democrats they help elect end up focusing federal assistance and development elsewhere? \n\n“About 50% of the jobs announced from the investments linked to the IRA and the CHIPS Act are expected to be in red states, compared with 17% for blue, according to the Fitch analysis shared with CNN,” the report further noted. “Another 33% are expected to be located in swing states.”\n\nIs it any wonder that Democratic performance dropped between 2020 and 2024? Politicians have to reward their supporters, not piss away precious resources on ungrateful assholes who aren’t just voting for the other guy, but are proudly parading their “FJB” and “Let’s Go Brandon” signs, spreading conspiracies about “the Biden crime family,” and propagating their bigotry and hatred. \n\nThat infrastructure investment money should’ve been spent in South Philly and the Chicago’s South Side and Los Angeles and yes, certainly in swing states too. But you give people a reason to vote for you by delivering for them and creating a direct benefit for their support. It’s what politics used to be. \n\nAnd if Idaho wants some of that infrastructure money, along with the clean water and upgraded fire-fighting resources it can deliver, then they can get their piece of the pie by voting Democratic. \n\nOr they can stew in their dilapidated town with crumbling infrastructure, standing tall in the knowledge that at some college on the other side of the country, a trans swimmer won’t be able to compete. \n\nPriorities, you know?","summary":"This is an occasional roundup of people who voted for Donald Trump and are shocked to find out no one is immune from the damage and pain he causes. Many are now grappling with the consequences of their choice as it affects them and their loved ones—and possibly regretting their vote.\n\n\n\n\nThere are few places more Republican than Idaho, a state that gave Donald Trump 67% of the vote in the 2024 presidential election. His opponent, then-Vice President Kamala Harris, couldn’t even muster one-third of the vote, languishing back at 30%. \n\n\n\nA rational person would look at that vote and say: Congrats, Gem Staters. You got what you voted for—you should be so happy! But Pocatello, Idaho, sure isn’t acting it. \n\n\n\nThe Biden administration awarded this city an EPA grant of $16 million from a program that helps “disadvantaged communities tackle environmental and climate justice challenges.” And the town was going to use that money for all sorts of good stuff, according to the Idaho Statesman\n\n\n\n\nThe Proud to be Pocatell","url":"https://www.dailykos.com/story/2025/5/17/2322498/-Republicans-voted-to-kill-woke-only-to-hurt-their-own-communities?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1433154/story_image/AP24307840236984.jpg?1747344692","video":null,"publish_date":"2025-05-17 15:00:18","author":"kos","authors":["kos"],"language":"en","category":"politics","source_country":"US","sentiment":-0.022},{"id":322373558,"title":"Chappell Roan controversy explained: all the times she has created a storm","text":"Most of Chappell Roan's controversies range from wearing provocative costumes at public events to passionately criticising conservative politics and boldly embracing LGBTQI themes in her music and performances. The singer has stirred more than a few storms, sparking public debates.\n\nKey takeaways\n\nChappell Roan’s performances and music often carry bold political and social messages, especially around LGBTQ+ rights and feminism.She openly critiques the music industry's treatment of gay artists and resists pressure to conform to mainstream expectations.Some controversies are speculative and amplified by fan culture rather than confirmed conflict.\n\nProfile summary\n\nChappell Roan controversy: boldest moments that created a storm\n\nPerhaps you have seen the American singer trending on social media and have wondered what is going on with Chappell Roan. Multiple times she has caused a stir online and offline due to her take on certain issues. Here are some of her most controversial moments.\n\nGovernors Ball 2024: Statue of Liberty-inspired protest performance\n\nAt the 2024 Governors Ball in New York City, Chappell Roan delivered a provocative performance that stirred both acclaim and controversy. Emerging from a giant red apple, she was adorned in green body paint and a Statue of Liberty-inspired ensemble, complete with a crown and exposed backside—a bold homage to New York and a statement on freedom.\n\nDuring her set, Roan recited the iconic poem from the statue, asserting that its call for the tired and poor extends to trans rights, women's rights, and oppressed people in occupied territories, referencing the Israeli-Palestinian conflict. She also used the opportunity to disclose that she turned down the White House's invitation to perform at the Pride event. The singer said:\n\nThis is a response to the White House, who asked me to perform for Pride. We want liberty, justice and freedom for all. When you do that, that’s when I’ll come.\n\nThe performance, blending theatrical flair with political commentary, sparked widespread discussion and highlighted Roan's commitment to advocacy through her art. While some people hailed it on social media, others, especially conservatives, considered it disrespectful and anti-America.\n\nCritique of the music industry's treatment of gay artists\n\nAt the 2025 Grammy Awards, Chappell Roan used her Best New Artist acceptance speech to critique the music industry's treatment of gay artists. She highlighted the lack of liveable wages and healthcare for emerging artists, drawing from her own experience of being signed as a minor and later dropped by her label.\n\nRoan emphasised the need for record labels to treat artists as valuable employees, advocating for better support systems within the industry. Her speech sparked a backlash from some industry figures, who labelled her as uninformed but also garnered support from fellow artists and creatives. Part of her speech read:\n\nI told myself that if I ever won a Grammy and got to stand up here before the most powerful people in music, I would demand that labels in the industry profiting millions of dollars off of artists would offer a liveable wage and health care, especially to developing artists.\n\nRoan's advocacy extends beyond the Grammys; she has also spoken out about the challenges faced by gay artists in country music, noting that many remain closeted due to industry stigma. Through her platform, Roan continues to push for systemic changes to better support the artists in the music industry.\n\nFemininomenon music video sparks feminist debate\n\nChappell Roan's Femininomenon music video became a focal point of controversy due to its provocative themes and bold visuals. The video features Roan in a campy, drag-inspired performance, incorporating elements like dirt bikes and exaggerated femininity, which some viewers found polarising.\n\nCritics argued that the video's overt sexuality and theatricality were excessive, while supporters praised it as a celebration of gay identity and empowerment. The video's release sparked widespread discussion on social media platforms, with debates centring around artistic expression, representation, and the boundaries of pop culture performance.\n\nRumoured feud with fellow gay artist\n\nChappell Roan's rumoured feud with Plane Jane, a fellow gay artist and a finalist from RuPaul’s Drag Race Season 16, ignited when Plane Jane, through a tweet, criticised Roan’s love for drag and performance. The comment sparked backlash from Roan’s fans, who highlighted her deep involvement with drag culture, including collaborations with local queens and her drag-inspired performances.\n\nAlthough Plane Jane later paid homage to Roan by dressing as her at the 2024 MTV VMAs, the incident underscored tensions within the gay artistic community regarding authenticity and representation.\n\nRed Wine Supernova and substance use allegations\n\nChappell Roan's song Red Wine Supernova became the centre of controversy following a provocative drag performance by Filipinx queen Brigiding. During a drag brunch, Brigiding lip-synced to the track and theatrically poured red wine from a spout hidden beneath her costume into a fan's glass.\n\nThe act sparked online debates, with some accusing it of misogyny and disrespect, while others defended it as a campy embodiment of drag culture's boundary-pushing artistry. Brigiding stood by the performance, and through a Facebook post, she emphasised its alignment with the expressive freedom celebrated in drag.\n\nThis incident highlighted ongoing discussions about gender expression, artistic licence, and the evolving dynamics within LGBTQ communities. Advocates of mental health and sober communities flagged the line for potentially romanticising substance abuse.\n\nOff-script comments at the 2023 VMAs\n\nAt the 2024 MTV Video Music Awards, Chappell Roan sparked controversy with an off-script outburst on the red carpet. In a viral moment, she shouted gross words at a photographer who had been yelling at her. Roan later explained that the red carpet experience was overwhelming, especially for someone with anxiety around loud environments, and felt compelled to stand her ground.\n\nThe incident ignited debate online, with some criticising her reaction as unprofessional. Others defended her response as a boundary-setting move amid the pressures of sudden fame.\n\nCalling out anti-trans legislation in the U.S.\n\nChappell Roan has been a vocal advocate for trans rights, using her platform to highlight the challenges faced by the transgender community in the U.S. At the 2025 Grammy Awards, she delivered a powerful message on the red carpet, stating:\n\nIt’s brutal right now, but trans people have always existed and they will forever exist. And they will never, no matter what happens, take trans joy away, and that has to be protected more than anything because I would not be here without trans girls.\n\nRoan, who did not endorse a presidential candidate in the 2024 election, criticised both major political parties for their handling of trans rights and international issues. She later clarified that while she planned to vote for Kamala Harris, she would offer no formal endorsement, stressing the need for critical thinking and holding leaders accountable.\n\nDrag-inspired Met Gala look rejected by critics\n\nAt the 2025 Met Gala, Chappell Roan made a bold debut with a glam-rock ensemble that sparked both admiration and criticism. Her outfit featured a hot pink patchwork suit with bell bottoms and a feathered cape, complemented by dramatic makeup and voluminous red curls.\n\nWhile some praised her daring high fashion choice, others felt it deviated from the event's theme, leading to debates about cultural representation and thematic relevance. Despite the mixed reactions, Roan's appearance underscored her commitment to expressive and theatrical fashion.\n\nCall Her Daddy podcast comments about parenthood\n\nChappell Roan's most recent controversy centres on her candid remarks about parenthood during a March 2025 appearance on the Call Her Daddy podcast. In response to Alex Cooper's question about whether she is still close with friends back home in Missouri, she said:\n\nAll of my friends who have kids are in hell. I actually don’t know anyone who’s, like, happy and has children at this age. I literally have not met anyone who’s happy, anyone who has light in their eyes, anyone who has slept.\n\nThese comments ignited a significant backlash, with many parents accusing her of trivialising the challenges of raising children and reinforcing negative stereotypes about motherhood. While some defended Roan's perspective as a reflection of her personal experiences and observations, others criticised her for making sweeping generalizations.\n\nWhat is the controversy with Roan?\n\nRoan has stirred controversy for her outspoken political views, provocative performances, and unapologetic sexual identity. Her public statements and art often challenge societal norms, which has drawn both praise and criticism.\n\nWhat happened at the Governors Ball with Chappell Roan?\n\nAt the 2024 Governors Ball, Roan performed dressed as a drag-inspired Statue of Liberty and made a political statement supporting trans rights and marginalised communities. This performance sparked a wave of backlash and support.\n\nWhat was the issue with Chappell Roan's Met Gala-inspired outfit?\n\nRoan wasn’t officially invited but posted a photo of herself in a drag-inspired gown made of protest signs. While fans celebrated it, some fashion critics found it too politically charged.\n\nChappell Roan's controversies highlight her resilience and determination to stay true to her voice. She has been in the spotlight for challenging the status quo, including performing in drag, calling out injustice, and embracing bold visuals. Even though she has faced backlash multiple times, she is a darling to the marginalised, whom she champions their rights.\n\nLegit.ng recently published Oona O’Brien’s biography. She is a rising American model and actress best recognised for her role as Devon Lee in the Netflix series Cobra Kai. She began modelling in her childhood and has worked with several brands and prints.\n\nOona O’Brien was interested in acting and modelling from a young age, and while her modelling career kicked off early, she waited until 2020 to make her acting debut. Her journey into the entertainment industry has so far been successful, but she has a lot of potential in the industry. Here is all you should know about the young American actress.\n\nSource: Legit.ng","summary":"Explore every major Chappell Roan controversy. The singer does not shy away from expressing her opinions, and the bold moves have sparked storms multiple times.","url":"https://www.legit.ng/ask-legit/biographies/1654513-chappell-roan-controversy-explained-times-created-a-storm/","image":"https://cdn.legit.ng/images/1200x675/f93ece3fb842d522.jpeg?v=1","video":null,"publish_date":"2025-05-17 14:58:36","author":"Bayo Olupohunda,Muhunya Muhonji","authors":["Bayo Olupohunda","Muhunya Muhonji"],"language":"en","source_country":"ng","sentiment":0.498},{"id":322331440,"title":"Dave Portnoy savages 'disgusting' Democrats over 'scandal' that makes Donald Trump look like 'Mother Teresa'","text":"Dave Portnoy savages 'disgusting' Democrats over 'scandal' that makes Donald Trump look like 'Mother Teresa'\n\nREAD MORE: Dave Portnoy slammed over 'lame excuse' for Celtics' loss\n\nBy DANIEL MATTHEWS\n\nPublished: 15:53 BST, 17 May 2025 | Updated: 15:53 BST, 17 May 2025\n\nDave Portnoy has accused the Democratic Party of making Donald Trump look like Mother Teresa in a blistering rant about Joe Biden and 'the greatest scandal in the history of American politics.'\n\nThe Barstool Sports founder was responding to revelations in an explosive new book, 'Original Sin', which alleges a stunning cover-up of Biden's cognitive decline.\n\nThe book is co-authored by CNN's Jake Tapper and Axios' Alex Thompson and Portnoy claims the allegations and fallout 'make you want to puke'.\n\nHe took aim at the 'liberal media' and the Democrats - including Senate Democratic Leader Chuck Schumer - venting: 'You're all responsible, you're all guilty, you're all disgusting... (the Democrats) are the most crooked organization ever.'\n\nBiden, now 82, was slated to face off against Trump in last year's presidential election. But he eventually pulled out - and was replaced by Kamala Harris - following a disastrous debate performance.\n\n'This was the greatest scandal in the history of American politics,' Portnoy said. \n\nDave Portnoy accused the Democratic Party of making Donald Trump look like 'Mother Teresa'\n\nHe was responding to allegations of a stunning cover-up of Joe Biden's cognitive decline\n\nThe Barstool boss claims he often receives 'hate' over voting for Trump at last year's election\n\n'The fact (Biden) ran, the fact they whacked him and then just installed Kamala so they could control her. And people still wonder: \"Hey Dave, how did you vote for Trump?\"' \n\nThe Barstool boss claims he often receives 'hate' over voting for Trump, with critics claiming 'he must be a Nazi,' he must hate civil rights.' \n\n'They never look in the f***ing mirror,' he fumed. 'People have this image - the left - like you're a bad person, you're dishonest, you're a liar, a cheat if you vote for Trump. \n\n'Have you looked at the other side? They're the most crooked organization ever. Trump is Mother Teresa compared to these people... either you were a wiling, complicit person in the cover-up of the Democrats or you're a brain-dead moron who doesn't see reality.'\n\nHe added: 'Next time a Democrat, a liberal, an extreme left says you're a Nazi, you voted for Trump. You were part of the greatest cover-up in the history of American politics. Don't forget it.'\n\nCNNDemocratsJoe Biden\n\nShare or comment on this article:\nDave Portnoy savages 'disgusting' Democrats over 'scandal' that makes Donald Trump look like 'Mother Teresa'\n\nAdd comment","summary":"He took aim at the 'liberal media' and the Democrats - including Senate Democratic Leader Chuck Schumer - venting: 'You're all responsible, you're all guilty, you're all disgusting.'","url":"https://www.dailymail.co.uk/sport/othersports/article-14722563/Dave-Portnoy-Democrats-scandal-joe-biden-Donald-Trump-Mother-Teresa.html","image":"https://i.dailymail.co.uk/1s/2025/05/17/15/98481595-0-image-m-19_1747493603307.jpg","video":null,"publish_date":"2025-05-17 14:53:42","author":"Daniel Matthews,Editor","authors":["Daniel Matthews","Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.421},{"id":322381260,"title":"Should Democrats stick with Harris? New poll shows surprising result in Trump rematch","text":"If President Donald Trump and Former Vice President Kamala Harris were to have a rematch election, Harris would be the victor, according to a new poll.\n\nThe Strength in Numbers/Verasight poll shows Harris winning 40% of the vote in a hypothetical rematch while Trump only wins 36%. Only 1% of adults who responded said they were undecided.\n\nEven though 40% of adults said they would vote for Harris over Trump, 43% of them said they would not vote at all, according to the poll.\n\nIf you remove those who won’t vote from the poll, however, Harris is still the victor, receiving 47% of the vote to Trump’s 42%.\n\nThe survey’s findings present a scenario where the electorate is not pleased with Trump’s overall performance, according to the poll’s summary.\n\nThe poll found that 56% of respondents said they think Trump’s policy decisions have made the economy worse, while 22% said the policies have made things better.\n\nA total of 15% said the impact of Trump’s policies is neutral and 7% said they “don’t know” or are “not sure,” the poll’s summary reads.\n\nDespite these dour numbers for the president, the Democratic Party only has a slim advantage when it comes to voters trusting them on policy issues.\n\nWhen it comes to jobs and the economy, 41% of adults responded that they trust Democrats to handle this issue better than Republicans. Only 39% said they trust the GOP more on jobs and the economy, according to the poll.\n\nDemocrats also have a slight advantage on inflation, with 38% of adults saying they trust the party over the GOP while 37% say the opposite.\n\nDemocrats do have a sizable advantage on three issues: government funding and social programs (48% trust Democrats, 35% trust Republicans), healthcare (46% Democrats, 33% GOP) and education (46% Democrats, 35% GOP).\n\nRepublicans, meanwhile, hold an advantage on immigration. Of those who participated in the poll, 46% of adults trust Republicans on the issue of immigration over Democrats, while 33% trust Democrats over Republicans.\n\nFor border security, the GOP holds an advantage here, too, with 50% of adults trusting the Republicans on border security over Democrats. Only 29% of respondents say Democrats are better trusted on this issue.\n\nRepublicans also have a leg up on Democrats when it comes to deportations, with 45% of adults trusting the GOP over Democrats and 34% saying they trust the Democrats over the GOP.\n\nOn the issue of foreign policy, however, both parties were tied at 40% each, according to the poll.\n\nIf the 2026 midterm elections were held today, 47% of adults said they were more likely to vote for a Democrat for their congressional district compared to 41% who said they would vote for a Republican.\n\nA total of 12% of adults said they don’t know or are not sure.\n\n“Voters do not trust the major parties to handle the country’s most pressing problems,” the poll’s summary reads. “With control of Congress up for grabs in 2026, voters look to be leaning toward Democrats, and disproportionately regret voting for Trump in 2024,” it added. “But Republicans retain a strong base of support and are not down and out yet.”\n\nThe poll has a sample size of 1,000 U.S. adult residents and was conducted from May 1-6, 2025. It has a margin of error of 3.2%.\n\nMore on Politics\n\nRead the original article on MassLive.","url":"https://www.yahoo.com/news/democrats-stick-harris-poll-shows-142331921.html","image":"https://s.yimg.com/ny/api/res/1.2/U31wO45DhT7Ik96XWoq4bg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD05NDY-/https://media.zenfs.com/en/masslive_articles_390/a3e2ed7bba7601a853523f677fc8a9b4","video":null,"publish_date":"2025-05-17 14:23:31","author":"Adam Bass","authors":["Adam Bass"],"language":"en","category":"politics","source_country":"us","sentiment":-0.517},{"id":322325326,"title":"Biden audio release pressures Democrats who would rather talk about Trump","text":"PHOENIX (AP): Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party.\n\nAudio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about Biden’s health back in the spotlight. Months after former President Kamala Harris lost to President Donald Trump, a new book alleges that White House aides covered up Biden’s physical and mental decline.\n\nSeveral potential Democratic contenders for the 2028 nomination have been asked in recent days whether they believe Biden was declining in office or whether he should have sought reelection before a disastrous debate performance led to his withdrawal.\n\nMany Democrats would prefer to focus on Trump’s second term. Trump has done his best to prevent that — mentioning Biden’s name an average of six times per day during his first 100 days in office, according to an NBC News analysis — and Republicans have followed his lead, betting that voters frustrated by Trump’s policy moves will still prefer him over memories of an unpopular presidency.\n\nIn the race for Virginia governor, one of this year’s highest-profile contests, Republican Winsome Earle-Sears is running a pair of digital ads tying Democrat Abigail Spanberger to Biden, with images of the two hugging and the former president calling her a friend.\n\n“The stench of Joe Biden still lingers on the Democratic Party,” Democratic strategist Sawyer Hackett said. “We have to do the hard work of fixing that, and I think that includes telling the truth, frankly, about when we were wrong.”\n\nDemocratic Sen. Chris Murphy of Connecticut told Politico this week that “there’s no doubt” that Biden, now 82, experienced cognitive decline as president.\n\nPete Buttigieg, the former transportation secretary, wasn’t nearly as blunt but still stopped short of defending Biden’s decision to run. He responded “maybe” when asked Tuesday whether the Democratic Party would have been better off if Biden hadn’t tried to run for a second term.\n\n“Right now, with the advantage of hindsight, I think most people would agree that that’s the case,” Buttigieg told reporters during a stop in Iowa.\n\nIllinois Gov. JB Pritzker said he didn’t see signs of mental or physical decline in his meetings with Biden.\n\n“I saw him a few times,” he told CNN this week. “I certainly went to the White House whenever there was an opportunity for me to make the case for something for people in my state. And I never had the experience of anything other than a guy who brought to the table a lot of good ideas about how to solve problems.”\n\nThe book “Original Sin,” by journalists Jake Tapper of CNN and Alex Thompson of Axios, revives a core controversy of Biden’s presidency: his decision to run for a second term despite voters, including Democrats, telling pollsters that he should not run again. Biden would have been 86 at the end of a second term had he won in November.\n\nA spokesperson for Biden did not respond to a request for comment.\n\n“We continue to await anything that shows where Joe Biden had to make a presidential decision or where national security was threatened or where he was unable to do his job,” the spokesperson has told many media outlets in response to the book.\n\nLate Friday, Axios published portions from audio recordings of Biden’s six hours of interviews with prosecutors investigating his handling of classified documents after his term as vice president ended in 2017.\n\nThe Biden administration had already released transcripts of the interviews, but the recordings shed light on special counsel Robert Hur’s characterization of Biden as “a sympathetic, well-meaning, elderly man with a poor memory” and appeared to validate his claim that the then-president struggled to recall key dates, including the year his son Beau died of cancer in 2015.\n\nBiden and his aides pushed back aggressively against Hur’s report, which they characterized as a partisan hit. Biden was at that time — early 2024 — still planning to run for a second term and fending off accusations that he was too old for another four years in the job.\n\nThe recordings released by Axios include Biden’s discussion of his son’s death. His responses to some of the prosecutors’ questions are punctuated by long pauses, and his lawyers at times stepped in to help him recall dates and timelines.\n\nBefore he dropped his reelection bid last summer, Biden faced widespread doubts within his own party, even as Democratic leaders dismissed both a series of verbal flubs and Republican allegations about his declining acuity.\n\nIn January 2022, just a year into Biden’s first term, an AP-NORC Center for Public Affairs Research poll found that only 48 percent of Democrats wanted him to seek reelection. That fell to 37 percent of Democrats in an AP-NORC poll conducted in February 2023. Three-quarters of Americans — and 69 percent of Democrats — said in August 2023 that they believed Biden was too old to serve as president for another four-year term.\n\nAnd shortly after his debate flop, nearly two-thirds of Democrats said Biden should withdraw from the race.\n\nBiden and former first lady Jill Biden appeared on ABC’s “The View” in a preemptive defense of his health and decision-making before the first excerpts of “Original Sin” were published.\n\nHe said he’s responsible for Trump’s victory but attributed Harris’ loss, at least in part, to sexism and racism. He maintained that he would have won had he remained the Democratic nominee. Both Bidens rejected concerns about his cognitive decline.\n\nPatricia McEnerney, a 74-year-old Democrat in Goodyear, Arizona, said Biden should not have tried to run again.\n\n“I think it’s sad the way it ended,” she said.\n\nShe compared him to Douglas MacArthur, the World War II and Korean War general famously dismissed by President Harry Truman.\n\n“I think he needs to stop giving interviews. I think that would help,” McEnerney said. “Like MacArthur said, generals just fade away.”\n\nJanet Stumps, a 66-year-old Democrat also from Goodyear, a Phoenix suburb, had a different view.\n\n“I don’t think it’s going to hurt the Democrats,” Stumps said. “I feel badly that he feels he has to defend himself. I don’t think he has to. Everybody ages. And the fact that he did what he did at his age, I think he should be commended for it.”\n\nHackett, the Democratic strategist, predicted Biden won’t be a major factor in the 2026 midterms or the 2028 presidential primaries. But he said Democrats who want voters to trust them would be well-served “by telling the truth about the mistakes that our party made in the run-up to 2024.”\n\n“Those mistakes were largely driven by Joe Biden, and I think any Democrat not willing to say that is not really prepared to face the voters, who want the truth and they want authenticity,” Hackett said.\n\nRick Wilson, a former GOP strategist who co-founded the anti-Trump group the Lincoln Project, said Republicans want to talk about Biden to avoid defending Trump. But he said the strategy is folly.\n\nBesides “political nerds,” he said, “no one else cares.”","summary":"PHOENIX (AP): Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party. Audio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about [&#8230;]","url":"https://thefrontierpost.com/biden-audio-release-pressures-democrats-who-would-rather-talk-about-trump/","image":"https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvdGhlZnJvbnRpZXJwb3N0LmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDVcLzQ2MDI2NjQtNTgyOTA0NzY5LmpwZWciLCJ0eHQiOiJCaWRlbiBhdWRpbyByZWxlYXNlIHByZXNzdXJlcyBEZW1vY3JhdHMgd2hvIHdvd","video":null,"publish_date":"2025-05-17 14:16:52","author":"The Frontier Post","authors":["The Frontier Post"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.493},{"id":322401764,"title":"CNN's Phillip Covers Up Her Own Role In Hiding Biden's Decline","text":"CNN Saturday Morning Table for Five\n\n10:16 AM ET\n\nABBY PHILLIP: Welcome back. “Joe Biden totally effed us.” That a quote from a Kamala Harris official in a new book that paints a damning picture of how far the White House went to hide his decline. Among the revelations from Jake Tapper and Alex Thompson's book, Biden's team hid him from his staff and even members of his cabinet. \n\nThey considered that he may need a wheelchair in the future, and contradicted warnings from his doctor, and Biden didn't recognize George Clooney, one of his longtime supporters and, of course, one of the most famous movie stars and faces on the planet.\n\nBut as the scandal branches grow. What about the people who have political runways, the Pete Buttigieges of the world? Hitting a Midwest tour. Kamala Harris thinking about a run for California governor. Will and should their futures be impacted by this scandal? It kind of seems like the answer has to be yes, right? Especially for someone like Kamala Harris, who was in the White House.\n\nCNN Newsnight\n\n10:00 PM ET\n\nABBY PHILLIP: The news a lot of Americans see and the manipulation that's distorting the 2024 election. That's tonight on NewsNight.\n\nGood evening, I'm Abby Phillip in New York. The November choice is between two old men. We know that. But tonight I want to talk about the Joe Biden that Republicans want you to see and the pipeline of videos that aren't telling the full truth. Now, those videos are probably right now clogging the public consciousness as Americans start to think about their votes. The RNC wants to weaponize questions around Biden's age.\n\nAnd the follow-up to that question is, is he mentally fit enough to do the job again? It's a question that Donald Trump hopes is on voters' minds.\n\nDONALD TRUMP: I think you should take a cognitive test like I did. I took a cognitive test and I aced it.\n\nPHILLIP: The latest video shoving this question in voters faces is this one from a star-studded fundraiser a couple days ago. President Biden and former President Obama on stage, waving to this crowd, and then there's a six-second pause, and then a walk off the stage. The New York Post screamed, “Freeze up.” The White House fired back, accusing the conservative outlet of wildly misinterpreting what happened. It's far from the only example of this push-pull between what the president is seen and heard doing and how Republicans and conservative news allies are labeling what he's seen and heard doing.\nNow, you don't have to scroll too far down on the RNC's research account to find posts winking and nodding that Biden isn't all there. Posts like this one, showing Biden at the G7 summit wandering around. Now, the RNC would have you believe that this was all aimlessly. The New York Post saw the video and put the stills on the front page, “meanderer-in-chief.” The problem is, that is also wildly misleading. Biden wasn't staring off into the distance like a puppy distracted by a bird. He was watching a diving demonstration. He had a conversation with those aerial stuntmen.","summary":"CNN Saturday Morning Table for Five host Abby Phillip was confident that Democrats who covered up President Joe Biden’s mental decline should face consequences, and while that may sound like a random act of journalism from CNN, it was more of a way for Phillip to cover up her own role in dismissing the idea that Biden wasn’t all there.\n\nPhillip came out of a commercial break reporting, ‘“Joe Biden totally effed us.’ That a quote from a Kamala Harris official in a new book that paints a damning picture of how far the White House went to hide his decline. Among the revelations from Jake Tapper and Alex Thompson's book, Biden's team hid him from his staff and even members of his cabinet.” \n\n \n\n\n\n\n\n \n\nMoving on to some examples, Phillip added, “They considered that he may need a wheelchair in the future, and contradicted warnings from his doctor, and Biden didn't recognize George Clooney, one of his longtime supporters and, of course, one of the most famous movie stars and faces on the planet.”\n\nPhillip concluded","url":"https://www.newsbusters.org/blogs/nb/alex-christy/2025/05/17/cnns-phillip-covers-her-own-role-hiding-bidens-decline","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/2025-05-17-CNN-CNN%20Saturday%20Morning%20Table%20for%20Five-Phillip.jpg?itok=r9dwE8xR","video":null,"publish_date":"2025-05-17 14:00:00","author":"Alex Christy","authors":["Alex Christy"],"language":"en","source_country":"US","sentiment":-0.048},{"id":322329226,"title":"Hasan Piker was detained by border patrol for his politics. Now the progressive bro whisperer is begging Democrats to ‘get angry’","text":"Hasan Piker yaps about politics for eight hours a day, every day, with his 4.4 million mostly progressive young male followers on Twitch and YouTube — a career as a political commentator that earned him the nickname “Joe Rogan of the Left” and also led to him being interrogated by border agents upon returning from overseas earlier this week.\n\n“I am unfiltered, and I also have a well-established world view that I'm unafraid of saying out loud and defending,” Piker told The Independent in an interview recently. A vocal critic of President Donald Trump, his administration, and Israel’s bombardment of Gaza — Piker has also scorned the Democratic Party in its current dilapidated state, saying that he believes many Americans are desperate for them to provide a genuine opposition to Trump and his fascist tendencies. “I want these guys to fight, and I think there's a lot of appetite for these guys to fight for the best of their ability,” he said.\n\nPiker is not alone: approval ratings for the Democratic Party sank to their lowest in six years, dropping from 89 percent having a favorable view of the party in 2019, to now just 75 percent, according to an April Pew Research Center poll. “Right now the resistance is aesthetic,” Piker said, pointing out Corey Booker’s 25-hour Senate speech, which broke records but didn’t stop any legislation.\n\nOn Monday, Piker revealed that U.S. customs officials detained him for hours at Chicago's O'Hare International Airport as he tried to enter the country, subjecting him to questioning about Trump and if he considered Hamas a terror organization or a resistance group. \n\nPiker, a U.S. citizen, later said he was willing to answer questions without a lawyer and put himself “at risk to investigate what their line of inquiry would look like” but warned others not to do the same.\n\nThe 33-year-old millennial originally from Turkey, who double majored in communications and political science at Rutgers University, began working for his uncle, Cenk Uygur, as a commentator for his online news show The Young Turks. Piker’s video content later got him branded as “Woke Bae” — a liberal heartthrob for progressive young women back in 2017, according to BuzzFeed. The following March, he launched his Twitch channel, starting with a few sporadic videos before spiraling into daily streaming and millions of people tuning in. \n\nTrump’s efforts to entice the young male “bro” voter — a low propensity group where Republicans usually fall short — were seen as crucial to him winning the presidency again. Piker has his own version of the manosphere voter: his average viewer is a white man under 30, many in their early 20s, according to the streamer’s latest census (although he says more women and LGBTQ-identifying people are beginning to watch). That audience has led to plenty of comparisons with Joe Rogan, the undisputed king of the male podcast.\n\nPiker said he understands the Rogan comparison but finds it comical, since he instead sees his job as “directly countering Rogan, as he spreads misinformation.” Regardless, Piker praised the conservative podcaster for being “probably one of the most influential people, for better or for worse, in the United States of America right now, maybe even the world.\"\n\nAhead of the election last November, Trump appeared on Rogan’s podcast “The Joe Rogan Experience” — an offer his opponent, Kamala Harris, declined — for a three hour meandering chat about everything from North Korea to aliens and his “unbelievable” health.\n\n“He can get away with saying unhinged things all the time because he’s a guy, he's a billionaire, he's a television personality,” Piker explained. “He's literally destroying global trade for no reason whatsoever, and his cult is still on board. He's able to dominate TV and constantly open up a barrage of lies.”\n\nAs frustrating as Piker finds it to watch Trump, his main complaints are with the Democrats for not doing enough to attract voters.\n\n“They're so academic, so smug,” Piker said. “The crisis is that they are trying to repackage this identity in a way that appeals to voters. But because they're so elitist, I think it’s virtually impossible.”\n\nTwo of the only progressive politicians actively trying are Bernie Sanders and Alexandria Ocasio-Cortez, who are leading the “Fighting Oligarchy” campaign across the U.S., where tens of thousands have turned up to protest the Trump administration and the corrupt influence of billionaires and technocrats in U.S. politics.\n\nIn April, Piker interviewed Sanders, 83, and Ocasio-Cortez, 35, during their record-breaking Los Angeles pit stop, but says that the pair — polling has Ocasio-Cortez as the most likely Democratic nominee for 2028 — need more fire in their belly to revive the struggling movement.\n\n\"I want more out of AOC and Bernie,” he said. “I want them to channel the anger and resentment that they have towards issues to chip away and undermine Trump's agenda.”\n\nOne issue he believes needs more attention is the ongoing war in Gaza, particularly since Biden administration’s unwavering support of Israel’s military in Gaza turned off many Democratic voters in the 2024 election.\n\n“I use Gaza as a microcosm of the much larger problem within the Democratic Party in terms of their inability to hear the demands of the population and offer them concessions,” Piker said.\n\nNew York Democratic congressman Ritchie Torres even filed a complaint with Twitch in October 2024, accusing Piker of becoming “the poster child for the post-October 7th outbreak of\n\nRecently, Piker called the far-right Israeli National Security Minister, Itamar Ben-Gvir, “a porky little nazi pig” on X after Yale University banned a pro-Palestine group for protesting his visit. \n\nHe insists that it is a valid criticism of one of the instigators of the Israel-Gaza war.\n\n“There is no difference between me calling Itamar Ben-Gvir a ‘porky little nazi pig’ than me calling Trump a ‘porky little nazi pig’,” he said. “These guys are both fascists, and I think it's appropriate to call them as such.\"\n\nAnd he doesn’t plan on shying away from the topic anytime soon, naming Louis Theroux, whose latest documentary The Settlers follows Israeli settlements in the West Bank, and Irish-language rappers Kneecap, who made anti-Israel statements at Coachella last month, as his next dream interview guests. \n\nThose plans read similarly to his hopes for the Democratic Party: finding activists who are more about action than posturing. \"They can identify the anger and resentment and channel it to more successful avenues, because that's what the Republicans do,\" Piker said. “The Democrats are very weak — they refuse to read the room.”","summary":"Shortly before the American streamer was detained by U.S. border officials and questioned about his political beliefs, he spoke with Madeline Sherratt about his frustrations with the Trump administration — and the weak attempts by Democrats to hold the president accountable.","url":"https://www.independent.co.uk/news/world/americas/us-politics/hasan-piker-democrats-joe-rogan-trump-b2751758.html","image":"https://static.independent.co.uk/2024/07/16/19/Screenshot-2024-07-16-at-2.42.26%E2%80%AFPM.jpg?width=1200","video":null,"publish_date":"2025-05-17 13:39:00","author":"Madeline Sherratt","authors":["Madeline Sherratt"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.06},{"id":322341838,"title":"“I hate Taylor Swift, she’s no longer ‘HOT’,” says Trump","text":"The US President – currently on his way home from a whirlwind diplomatic trip to the Middle East – has repeatedly targeted Taylor Swift since 2020, when she endorsed former President Joe Biden in that year’s presidential race.\n\nLast September, when the wildly-successful musician again endorsed his opponent – this time former Vice President Kamala Harris – Trump wrote in a Truth Social post: “I hate Taylor Swift.”\n\nAnd on Friday, the President made it clear he’s still nursing a grudge against the wealthiest female musician on the planet when he took to the platform – seemingly unprompted and without further elaboration – and wrote: “Has anyone noticed that, since I said “I HATE TAYLOR SWIFT, she’s no longer ‘HOT’?”.\n\nBar her endorsements of Joe Biden and Kamala Harris, Swift has publicly ignored the 78-year-old’s relentless swipes.\n\nDonald Trump followed his shot at Swift with a lengthy tirade against Bruce Springsteen.\n\nIn another Truth Social post, the President said the music legend was a “dried out prune” who was “dumb as a rock”, seemingly in retaliation to Bruce Springsteen criticising the leader – without naming him – at a concert in Manchester earlier this week.\n\n“In my home, the America I love, the America I’ve written about, and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration,” Springsteen told fans during his ‘Land of Hope and Dreams’ tour.\n\n“Tonight, we ask all who believe in democracy and the best of our American experience to rise with us, raise your voices against authoritarianism, and let freedom ring.”\n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,” Trump wrote, before really letting rip.\n\n“Never liked him, never liked his music, or his Radical Left Politics, and, importantly, he’s not a talented guy – Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our country.\n\n“If I wasn’t elected, it would have been GONE by now! Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)?\n\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare.’ Then we’ll all see how it goes for him!”\n\nSee post below:\n\nAsaase Broadcasting Company airs on Asaase 99.5 Accra, Asaase 98.5 Kumasi, Asaase 99.7 Tamale, Asaase 100.3 Cape Coast, AsaasePa 107.3 (Accra). Affiliates: Bawku FM 101.5, Bead FM 99.9 (Bimbilla), Mining City Radio 89.5 (Tarkwa), Nandom FM 101.9, Nyatefe Radio 94.5 (Dzodze), Sissala Radio 96.3 (Tumu), Somuaa FM 89.9 (Gushegu), Stone City 90.7 (Ho) and Wale FM 106.9 (Walewale). Listen online: asaaseradio.com, Sound Garden and TuneIn. Follow us: X: @asaaseradio995, @Asaase985ksi, @Asaase997tamale, @asaase1003, asaasepa1073 Instagram: asaaseradio99.5, asaase985ksi, asaase100.3, asaase99.7tamale, asaasepa107.3 LinkedIn: company/asaaseradio995. TikTok: @asaaseradio99.5 Facebook: asaase99.5, asaase985ksi, Asaase100.3, asaase99.7, AsaasePa107.3. YouTube: AsaaseRadioXtra. Join the conversation. Accra: call 020 000 9951/054 888 8995, WhatsApp 020 000 0995. Kumasi: call 059 415 7985 or call/WhatsApp 020 631 5260. Tamale: call/WhatsApp/SMS 053 554 6468. Cape Coast: call/WhatsApp 059 388 2652. #AsaaseRadio #AsaasePa #TheVoiceofOurLand","summary":"US President Donald Trump has declared Taylor Swift is “no longer hot” in a new post on social media, reigniting his mostly one-sided feud with the global megastar. The US President – currently on his way home from a whirlwind diplomatic trip to the Middle East – has repeatedly targeted Taylor Swift since 2020, when she endorsed &#8230;\n\n\nThe post &#8220;I hate Taylor Swift, she&#8217;s no longer &#8216;HOT&#8217;,&#8221; says Trump appeared first on Asaase Radio.","url":"https://asaaseradio.com/i-hate-taylor-swift-shes-no-longer-hot-says-trump/","image":"https://asaaseradio.com/wp-content/uploads/2025/05/Trump-Swift.webp","video":null,"publish_date":"2025-05-17 13:19:03","author":"Abigail Teye","authors":["Abigail Teye"],"language":"en","category":"entertainment","source_country":"gh","sentiment":-0.434},{"id":322407482,"title":"Trump calls former FBI director James Comey a 'dirty cop,' after outrage over '8647' post - USA Today","text":"President Donald Trump, who survived two assassination attempts last year, said former FBI Director James Comey knew “exactly” what he was doing when he shared a social media post.\n\nComey’s post has been interpreted as a call to assassinate Trump by supporters and some government officials, including Tulsi Gabbard, Trump’s director of national intelligence.\n\nComey, who is currently being investigated by the U.S. Secret Service, shared a picture on Instagram on May 15 with the number “8647” fashioned out of seashells on a beach, with a caption: \"Cool shell formation on my beach walk.\"\n\n“A child knows what that meant,” said Trump in an interview with FOX News Channel’s Special Report with Bret Baier, which aired on May 16. “That meant assassination.”\n\nIn U.S. slang, the number 86 can be used as a verb as in to remove someone from a bar for unruly behavior, or to reject someone, and 47 could signify Trump, the 47th president, according to Merriam-Webster.\n\nComey, who was fired by Trump in 2017, later deleted the post, saying he thought it was a political message.\n\nTrump said he did not buy his explanation.\n\n“He wasn't very competent, but he was competent enough to know what that meant,” said Trump. “And he did it for a reason.”\n\nComey was leading the FBI investigation into Russian interference in the 2016 election when Trump fired him in May 2017. Comey later backed Biden’s presidential bid in 2020 and former Vice President Kamala Harris’s presidential bid in 2024.\n\n“And when you add his history to that,” said Trump. “He’s a dirty cop.”\n\nAsked if Comey should be in jail, Trump demurred and said he would let U.S. Attorney General Pam Bondi handle the decision.\n\n\"We vigorously investigate anything that can be taken as a potential threat against our protectees,” U.S. Secret Service spokesman Anthony Guglielmi said in a post on X.\n\nLast July, Trump was the target of a 20-year-old gunman at a rally in Butler, Pennsylvania. A bullet struck and injured the upper part of his right ear. Days later, Trump wore a large white bandage on his ear while attending the Republican National Convention to accept his party's presidential nomination.\n\nA Secret Service agent helped stop a second assassination attempt by spotting a man with a rifle hiding in shrubbery near Trump's golf course in West Palm Beach, Florida.\n\nSwapna Venugopal Ramaswamy is a White House Correspondent for USA TODAY. You can follow her on X @SwapnaVenugopal","summary":"Trump calls former FBI director James Comey a 'dirty cop,' after outrage over '8647' post  USA Today","url":"https://www.usatoday.com/story/news/politics/2025/05/17/james-comey-dirty-cop-fbi-trump/83681644007/","image":"https://www.usatoday.com/gcdn/authoring/authoring-images/2025/05/16/USAT/83674478007-20250515-vpc-fbis-james-comey-faces-investigation-over-8647-post-thumb-getty-00-00-00-00-still-004.jpg?crop=1919,1079,x0,y0&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2025-05-17 12:41:47","author":"Swapna Venugopal Ramaswamy","authors":["Swapna Venugopal Ramaswamy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.082},{"id":322311166,"title":"Trump still more popular than Murphy in N.J., latest poll says","text":"Republican President Donald Trump is still polling better in blue-leaning New Jersey than its Democratic governor, Phil Murphy, according to a new survey. \n\nAnd, in a rarity, Murphy’s numbers are actually underwater this time. \n\nThursday’s poll from Emerson College/PIX11/The Hill found Trump has a split job-approval rating in the Garden State four months into his second presidency — with 47% approving of his performance, 47% disapproving, and 6% being neutral.\n\nBy comparison, 40% approve of Murphy’s performance, while 45% disapprove and 15% are neutral. \n\nDespite Trump’s roller-coaster national polling in recent months, his numbers in the Garden State aren’t much of a drop compared to Emerson’s last Jersey survey, from January. \n\nBack then, 48% of voters had a favorable view of Trump, compared to 46% with a negative opinion. \n\nThat was the first time a poll showed Trump with a positive favorability margin in New Jersey, where he once owned Atlantic City casinos and still owns golf courses. The survey came after Trump improved his margins significantly here in last year’s election, finishing just 6 percentage points behind Democratic opponent Kamala Harris — the best showing by a Republican presidential contender in the state since 1992.\n\nMeanwhile, Murphy’s numbers are down from January, when 44% viewed him favorably and 42% unfavorably as he entered his final year in office.\n\nOne caveat: The January poll tested Trump and Murphy’s favorability and the new poll their job performance.\n\nThursday’s poll could mark the first time Murphy has ever had upside down approval numbers in his eight years as governor. The Democrat has polled moderately well throughout his tenure — even though he won re-election by a mere 3 percentage points in 2021. Murphy was also the first Democratic New Jersey governor since the late 1970s to secure a second term.\n\nIt’s common for governors’ approval to fall over time. Murphy’s Republican predecessor, by comparison, polled in the teens in his second term.\n\nThursday’s poll comes as 11 candidates across both parties are running to succeed Murphy as governor. Democrats are hoping to buck history by hanging onto the the governor’s office. No party has won three straight terms in the job since 1961. \n\nTrump has also been a major topic in Jersey’s gubernatorial primaries, with Democrats vowing to fight him and (most) Republicans clamoring to align with him. Thursday’s survey found 53% of Garden State voters want the next governor to work with Trump, while 47% want them to stand up to him.\n\n“Democrats want the next Governor to stand up to Trump (76%), while Republicans want the next Governor to work with Trump (90%),” said Spencer Kimball, executive director of Emerson College Polling. “Independents align more with Republicans in wanting the Governor to work with the president at 60%, compared to 40% who want the Governor to stand up to the president.” \n\nMeanwhile, on other national issues, the survey found:\n\n46% of Jersey voters think the Trump administration’s recent deportations of undocumented immigrants have made their community safer, while 24% think the opposite, and 31% believe they’ve had no impact on safety.4 in 5 Jersey voters have been paying close attention to the issues at Newark’s airport. Asked who is responsible for the mess, 31% most blame the Trump administration, 29% the Federal Aviation Administration (or FAA), 20% former President Joe Biden‘s administration, 8% the Murphy administration, and 6% Congress. This is split along party lines a plurality of Democrats blaming Trump and more Republicans blaming the Biden administration. \n\nThe poll was conducted May 11-13 with 1,000 registered New Jersey voters. The margin of error was plus-or-minus 3 percentage points.\n\nThank you for relying on us to provide the local news you can trust. Please consider supporting NJ.com with a voluntary subscription.\n\nBrent Johnson may be reached at bjohnson@njadvancemedia.com. Follow him on X at @johnsb01.","summary":"The new poll also found a rarity: Gov. Phil Murphy's approval numbers were underwater.","url":"https://www.nj.com/politics/2025/05/trump-still-more-popular-than-murphy-in-nj-latest-poll-says.html","image":"https://www.nj.com/resizer/v2/X46PIRBBLRBIDAGMQ4DMEOQWKE.png?auth=f392f34906e2e9ca28ab9fe3b79e7ff1efe928279d9d27aa01aa2d638ac56e42&width=1280&quality=90","video":null,"publish_date":"2025-05-17 12:30:00","author":"Brent Johnson","authors":["Brent Johnson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.33},{"id":322411472,"title":"Donald Trump Just Shamed Taylor Swift Again—Says She’s Not ‘Hot Anymore’","text":"Donald Trump is feuding with Taylor Swift yet again! He posted on his TruthSocial about her being no longer hot or famous. This comes in connection with his last dig at Swift in September during his election campaign. Taylor was supporting his opponent, Kamala Harris. To show his reaction, he posted I HATE TAYLOR SWIFT.\n\nThis feud isn’t new, and Trump just keeps adding more to it. As per his belief, posting all this has made people believe she’s less hot. It is comical, to say the least, how his social media posts have anything to do with Taylor Swift looking good. Besides, he assumes that she is not even popular now since he took a jab at her.\n\nToday, Trump tweeted – and yes, this is real – “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’”\nBecause nothing says presidential leadership like an old man in a diaper bullying a young woman over her looks. Stellar example, Mr. President. pic.twitter.com/fMdr6I2KrM\n— Mitch Jackson | On Bluesky @mitch.social (@mitchjackson) May 16, 2025\n\nHis recent post read, “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” Trump usually posts whatever he likes with zero filter on his social accounts. Even the White House did not comment on this.\n\nTrump’s claim is that Taylor’s popularity declined after he commented on her in September of last year, and she can’t seem to recover from it even now. After the September dig, we don’t know what made him turn his attention to Swift again, but it seems uncalled for.\n\nHe also mocked her at the Philadelphia Eagles’ Super Bowl visit last month. Trump said, upon seeing her in person, he’s not impressed and feels that she even worked out with so much fame. Trump was the first US president to attend the Super Bowl and the crowd went gaga seeing him. On the other hand his supporters did the opposite to Taylor.\n\nlike this post if taylor swift is “still hot” despite what the president has to say pic.twitter.com/bhnBqlEdZW\n— Taylor Swift Updates (@tswiftscoop) May 16, 2025\n\nThe crowd cheered for him and went on to boo Swift at the game in February. They weren’t happy to see her on the Jumbotron. Maybe there were no Swifties at the game to support their pop queen. That day may not have been the best one for Tay-Tay as she saw her boyfriend’s team lose 40-22 to the Philadelphia Eagles.\n\nAnother infamous jab that Trump took at her was in his support for MAGA. He stated she had a harder night in comparison to the Kansas City Chiefs. Getting booed must have been hard, as MAGA is unforgiving while supporting Trump.\n\nThis has been an ongoing little venture for the president. Taylor Swift chooses to remain classy and not dignify his statements with a response. She did not revert to his comments even on a single occasion. Even though there’s Bad Blood between them, Swift is focusing on Shaking It Off. Maybe she’ll channel it all into a new hit song! Many netizens have come in support of her, so she’s still famous and hot. \n\nHere are some photos of Taylor Swift where she looks absolutely stunning.","summary":"Donald Trump's long standing feud with Taylor Swift since she supported Kamala Harris.","url":"https://www.inquisitr.com/donald-trump-just-shamed-taylor-swift-again-says-shes-not-hot-anymore","image":"https://www.inquisitr.com/wp-content/uploads/2025/05/Donald-Trump-feuds-with-Taylor-Swift.jpg","video":null,"publish_date":"2025-05-17 11:46:05","author":"Diksha","authors":["Diksha"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":322304014,"title":"Trump suggests his opinion of Taylor Swift has made her less popular","text":"President Trump suggested Friday his swipe at Taylor Swift last year has hurt her popularity.\"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?',\" the president wrote in a Truth Social post Friday, as he flew back from the Middle East to the U.S. after the first major overseas trip of his second term.A White House official told CBS News: \"As a business and entertainment mogul President Trump is highly qualified to comment on the rise and fall of various celebrities,\" including Swift.Mr. Trump posted \"I HATE TAYLOR SWIFT!\" last fall, days after the singer endorsed former Vice President Kamala Harris. Swift's Eras tour was still in progress at the time. The post was quickly overshadowed by news of a second assassination attempt against Mr. Trump hours later.It wasn't clear what prompted Mr. Trump's mid-air musing about Swift. The pop megastar has been keeping a lower public profile in recent weeks. Her Eras tour has ended, and boyfriend Travis Kelce's football season is over. Swift fans caught a glimpse of her at a Mother's Day brunch in Philadelphia with the Kelce family, but she's been photographed less frequently, except for the occasional date night, since the Kansas City Chiefs lost their Super Bowl bid.Mr. Trump lashed out at Bruce Springsteen less than an hour later, calling him \"Highly Overrated\" and mocking what he called his \"atrophied\" skin, days after Springsteen called the Trump administration \"treasonous\" at a concert in the U.K.The president's digs at Swift and Springsteen came at the tail end of a four-day tour of Saudi Arabia, Qatar and the United Arab Emirates. During the trip, Mr. Trump met with allied Arab leaders, pledged to drop sanctions against Syria in a surprise move and announced a set of economic deals with Gulf states. Shortly before the trip started, reports emerged that Qatar would donate a Boeing 747 for Mr. Trump's use, drawing ethics concerns — though Mr. Trump defended the move.The bad blood between Swift and the president extends back years. Swift has only occasionally waded into politics, but has endorsed Mr. Trump's opponents twice, backing former President Joe Biden in 2020 and Vice President Kamala Harris in 2024. Last year, she suggested she endorsed Harris in part because Mr. Trump had shared images on Truth Social that implied Swift supported him. In endorsing Harris, Swift said she was \"a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos.\" Swift also endorsed Democrat Phil Bredesen in his unsuccessful 2018 race against Tennessee Sen. Marsha Blackburn, whom Swift called \"Trump in a wig\" in a documentary released in early 2020.Mr. Trump responded to the 2018 endorsement by saying, \"I like Taylor's music about 25% less now,\" adding that Swift \"doesn't know anything about\" Blackburn.Mr. Trump called Swift \"unusually beautiful\" and said, \"I hear she's very talented\" in a 2023 interview with Variety editor Ramin Setoodeh — but questioned her stated political views.\"She's legitimately liberal? It's not an act? It surprises me that a country star can be successful being liberal,\" Mr. Trump said of the crossover star to Setoodeh, according to excerpts published by Variety last year.Swift's representative did not offer a response to Mr. Trump's post on Friday.","summary":"While Mr. Trump was in the air and on his way back to the U.S. from his first major overseas trip of his second term, the president posted about Taylor Swift.","url":"https://www.cbsnews.com/news/trump-taylor-swift-less-popular/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/16/2cc214dd-cb82-44dc-8c05-4f6658ba7c3c/thumbnail/1200x630/29e34484272c04cd48cb54723874183a/ap24233639034742.jpg?v=6df9366690ed146f169dd0670c453f91","video":null,"publish_date":"2025-05-17 11:43:33","author":"Caitlin Yilek,Joe Walsh","authors":["Caitlin Yilek","Joe Walsh"],"language":"en","source_country":"US","sentiment":-0.168},{"id":322303962,"title":"Donald Trump attacks ‘dried out prune of a rocker’ Bruce Springsteen and ‘no longer hot’ Taylor Swift","text":"Donald Trump has angrily insulted Bruce Springsteen after the veteran musician said Mr Trump was heading a “corrupt, incompetent and treasonous administration”.\n\nSpringsteen made a series of vehement speeches on stage in Manchester, England, as he kicked off his latest tour, arguing that Mr Trump was “an unfit president” heading up “a rogue government”. He said that in the US, “the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death ... they’re taking sadistic pleasure in the pain they inflict on loyal American workers ... They are abandoning our great allies and siding with dictators against those struggling for their freedom.”\n\nMr Trump responded on his Truth Social platform, calling Springsteen “highly overrated ... not a talented guy – just a pushy, obnoxious JERK”.\n\nSpringsteen campaigned on behalf of Joe Biden, just as he did with Barack Obama and later Kamala Harris. Mr Trump said: “Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock’, and couldn’t see what was going on, or could he (which is even worse!)? This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare’. Then we’ll all see how it goes for him!”\n\nAn hour earlier, and apropos of seemingly nothing, Mr Trump took aim at another musician, Taylor Swift.\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” he wrote on Truth Social.\n\nMr Trump was once a fan of Swift, telling her “you are fantastic!” and posting “Taylor is terrific!” on X in 2012, and later calling her “unusually beautiful”. But after Swift’s endorsement of Kamala Harris, he wrote, “I HATE TAYLOR SWIFT!” on Truth Social.\n\nSpringsteen and Swift have not responded to the posts.\n\nThe American Federation of Musicians international president Tino Gagliardi said in a statement: “The American Federation of Musicians of the United States and Canada will not remain silent as two of our members – Bruce Springsteen and Taylor Swift – are singled out and personally attacked by the President of the United States. \n\n“Bruce Springsteen and Taylor Swift are not just brilliant musicians, they are role models and inspirations to millions of people in the United States and across the world. Whether it’s Born in the USA or the Eras Tour, their music is timeless, impactful, and has deep cultural meaning. Musicians have the right to freedom of expression, and we stand in solidarity with all our members.”\n\nSpringsteen’s tour continues at Co-Op Live in Manchester. A five-star Guardian review of the opening night said: “The choice to finish on a fiery yet emotional version of Bob Dylan’s Chimes of Freedom hits home a clear message tonight. And despite the hurt and despair that underpins much of it, there are few artists able to pluck hope from the darkest depths of the US, with such elegance and beauty, quite like Bruce Springsteen.”\n\nSwift, meanwhile, is keeping a relatively low public profile after a tremendously successful couple of years in which her career-spanning Eras tour became the highest-grossing tour of all time. Fans are looking forward to the rerelease of Reputation, the final part of her project to rerecord earlier studio albums, but no release date has been announced. – The Guardian","summary":"Veteran musician’s fiery speeches trigger angry insults from US president","url":"https://www.irishtimes.com/world/us/2025/05/17/donald-trump-attacks-dried-out-prune-of-a-rocker-bruce-springsteen-and-no-longer-hot-taylor-swift/","image":"https://www.irishtimes.com/resizer/v2/K7O2CNQ6GRHXJBBM4FHBTW4UIA.JPG?auth=ee9e9c091e38c45156de6500b88bae47af16558d4ab773b48ecef11e8b2fa006&smart=true&width=1600&height=900","video":null,"publish_date":"2025-05-17 11:18:30","author":"Sat May","authors":["Sat May"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.143},{"id":322301766,"title":"Trump calls American singer Bruce Springsteen ‘obnoxious jerk’ over criticism","text":"President Donald Trump used his downtime on Air Force One on Friday to insult “obnoxious jerk” Bruce Springsteen and declare Taylor Swift “no longer HOT” in social media blasts against the music giants.\n\nTrump — returning from a whirlwind Middle East diplomatic trip — took to his Truth Social platform to feud with Springsteen, who this week told a British concert audience that his homeland is now ruled by a “corrupt, incompetent and treasonous administration.”\n\nIn return, the 78-year-old president said the legendary rocker, nicknamed “the Boss,” is “Highly Overrated.”\n\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK,” Trump wrote in the lengthy tirade.\n\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare’. Then we’ll all see how it goes for him!”\n\nWhile in Manchester on his ‘Land of Hope & Dreams tour Wednesday, Springsteen told fans that “my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years“ is in danger.\n\nIn a video from his UK concert, Springsteen can be heard saying, “There’s some very weird, strange, and dangerous sh*t going on out there right now. In America, they are persecuting people for using their right to free speech and voicing their dissent. This is happening now.”\n\nIt’s unclear what Springsteen was specifically referring to, but the Trump administration’s attempted deportation of the Columbia University graduate Mahmoud Khalil — a permanent legal resident of the US — sparked widespread outrage and protests in March. Khalil was targeted because of his association with the anti-Israel protests at Columbia.\n\n“In America, the richest men are taking satisfaction, and abandoning the world’s poorest children to sickness and death. This is happening now,” Springsteen went on to say.\n\nIn March, Trump shuttered the US Agency for International Development (USAID), cancelling 83 per cent of its programmes, folding the rest under the Department of State, and reducing the agency’s 10,000-person workforce to just 15 positions.\n\n“They’re taking sadistic pleasure in the pain that they inflict on loyal American workers. They’re rolling back historic civil rights legislation that led to a more just and plural society,” said the singer.\n\nTrump has signed several executive orders related to civil rights, including one early in his administration that eliminated diversity, equity, and inclusion initiatives across the federal government. Another order required agencies to recognise only two sexes — male and female.\n\nMore recently, Trump signed an order to repeal or amend provisions of the 1964 Civil Rights Act, claiming the change “guarantees equality of opportunity, not equal outcomes.”\n\n“They’re abandoning their allies and siding with dictators against those struggling for their freedom,” Springsteen added. In February, Vice President JD Vance used his speech at the Munich Security Conference to aggressively criticise European allies, stating that the biggest threat to their security was “from within,” not from China or Russia.\n\n“They’re defunding American universities that won’t bow down to their ideological demands,” Springsteen continued.\n\nIn March, Trump announced that he wanted to cut federal funding for colleges that allow what he called “illegal protests.” He pulled $400 million from Columbia University, accusing it of failing to protect Jewish students. It was the epicentre of pro-Palestinian protests last year.\n\nIn April, Trump officials cut about $2.3 billion in federal funds to Harvard University after it resisted White House demands to shut down diversity, equity, and inclusion programmes. He also froze funds for Cornell and Northwestern after similar protests.\n\n“They’re removing residents off American streets, and without due process of law are deporting them to foreign detention centres and prisons. This is all happening now,” said Springsteen at his concert.\n\nLast month, the US Supreme Court issued a brief order preventing the Trump administration from deporting a group of Venezuelan immigrants without due process. According to an emergency application filed by ACLU lawyers, the administration had begun moving these immigrants to a Texas detention facility without giving legal reasons.\n\nTrump also had strong words for Swift, who endorsed Biden’s replacement as the Democratic candidate in 2024, Kamala Harris. In a separate post, which provided no context, the US president said: “Has anyone noticed that, since I said ‘I hate Taylor Swift,’ she’s no longer ‘hot?’” He appeared to be referencing a post in September last year when he declared “I hate Taylor Swift!”","summary":"https://images.dawn.com/news/1193640/trump-calls-bruce-springsteen-obnoxious-jerk-after-singer-denounces-his-corrupt-incompetent-administration","url":"https://images.dawn.com/news/1193640/trump-calls-bruce-springsteen-obnoxious-jerk-after-singer-denounces-his-corrupt-incompetent-administration","image":"https://i.dawn.com/large/2025/05/171450579fdda01.png?r=145102","video":null,"publish_date":"2025-05-17 10:59:47","author":"Images Staff | AFP","authors":["Images Staff | AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.048},{"id":322302004,"title":"Silences and mumbling: What the leaked interview revealed about Joe Biden's memory lapse","text":"Recently leaked audio of former US President Joe Biden’s 2023 interview with Special Counsel Robert Hur has revealed a striking, firsthand account of the memory issues previously detailed only in transcripts. The recordings—captured during a six-hour session in October 2023—reveal the former president's struggle to recall key facts, including the year of his son Beau’s death and the timing of Donald Trump’s election win. Conducted in the White House Map Room, the interview was part of a federal investigation into Biden’s handling of classified documents. Throughout the audio, Biden’s voice is often hesitant, marked by long pauses, mumbling, and reliance on his legal team to assist with recollection. In one moment, he incorrectly states, “In 2017, Beau had passed,” before being gently corrected by his attorneys—Beau Biden died in 2015. The recordings, obtained by Axios, also reveal Biden asking for confirmation about when Trump was elected and struggling to recall if he had told his ghostwriter about discovering classified materials. “I don’t remember... and I’m not supposed to speculate, right?” he says during one exchange. Background sounds—like a grandfather clock ticking—punctuate the quiet moments, emphasizing the tension and Biden’s visible fatigue. Despite the emotional weight of discussing his late son and moments of apparent weariness, Biden declined breaks during the interview, saying, “No, let me just keep going and get it done.” Hur’s investigation ultimately concluded that Biden had indeed mishandled classified materials, but no charges were filed. The report cited that a jury would likely view him as “a sympathetic, well-meaning, elderly man with a poor memory.” The timing of the audio’s release has further fueled intra-party debate among Democrats, coming after Biden’s withdrawal from the 2024 race following a shaky debate performance and mounting pressure from party leaders. While Vice President Kamala Harris later lost to Donald Trump, a forthcoming book Original Sin by CNN’s Jake Tapper and Axios’ Alex Thompson alleges that Biden’s team actively concealed signs of his cognitive and physical decline during the campaign. The Trump campaign has indicated that the full recordings will soon be made public. The Biden administration had previously resisted releasing them, citing the need to protect law enforcement materials.","summary":"Audio of President Joe Biden's interview with Special Counsel Robert Hur is out. It shows Biden struggling with memory. He had trouble recalling key details. These included his son's death year and Trump's election. The recordings offer insight into his cognitive state. This happened during a federal probe. The investigation looked into mishandling of classified documents.","url":"https://economictimes.indiatimes.com/news/international/global-trends/joe-bidens-memory-lapse-leaked-interview-full-audio-robert-hur-donald-trump/articleshow/121233259.cms","image":"https://img.etimg.com/thumb/msid-121233508,resizemode-4,width-1200,height-900,imgsize-755123,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-17 10:06:28","author":"Et Online","authors":["Et Online"],"language":"en","source_country":"in","sentiment":-0.159},{"id":322330312,"title":"Elon Musk slammed for response to post 'body-shaming' Taylor Swift after Trump said 'she's no longer hot'","text":"Elon Musk has highlighted comments made by Donald Trump on social media about Taylor Swift 'no longer' being 'hot'. \n\nIt's not like Donald Trump and Elon Musk have anything better to do, right? Not like one is supposed to be running the country and the other overseeing Twitter alongside advising said president of the US.\n\nInstead, it seems the pair have been directing their keyboard warrior fury towards none other than pop star Taylor Swift.\n\nWhether it be in 2018 when Trump said he liked Swift's music '25 percent less' after she showed support for the Democrats, earlier this year when Trump highlighted Swift getting 'booed out of' the stadium after a Chiefs game, or yet another jab made about her Super Bowl appearance.\n\nIt appears Trump isn't finished there, now taking aim at Swift's appearance.\n\nIn a post to Truth Social on May 16, Trump said: \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she’s no longer 'HOT?'\"\n\nA Twitter account titled Autism Capital later shared a screenshot of the post to the platform, adding: \"Trump woke up today and said 'You know what it’s been a while since I blasted Taylor Swift.'\"\n\nAnother account then shared a photograph of Swift performing on stage alongside a 'Pepe the Frog' meme edited into the image holding a ruler by Swift's bottom.\n\nAnd who should respond? Why, Kekius Maximus of course, AKA Elon Musk - adding a laughing emoji.\n\nAnd it's not taken long for people to slam Musk for his response to the post.\n\nOne Reddit user accused Musk of 'body-shaming' the singer.\n\nA second added: \"They need to leave her the f**k alone what’s their obsession with her.\"\n\nA third theorized the reason Trump and Musk are so 'obsessed' with Swift is because 'she's their class peer as a billionaire and they hate it'.\n\nAnd someone else wrote: \"Same guy who threatened to put a baby in her last year? Dude is disgusting.\"\n\nIndeed, it's not the first time Musk has brought up Swift either.\n\nWhen Trump went head-to-head with Kamala Harris to become the 47th President of the US, Swift weighed in online with where she'd be casting her vote.\n\nSwift took to Instagram to state her support for Harris and her running mate, Tim Walz, explaining that an AI image of her seemingly endorsing Trump had supported her decision for transparency.\n\nShe said: \"It really conjured up my fears around AI, and the dangers of spreading misinformation. It brought me to the conclusion that I need to be very transparent about my actual plans for this election as a voter. The simplest way to combat misinformation is with the truth.\"\n\nAt the end of the statement, she signed ‘childless cat lady’ below her name, referencing JD Vance’s remarks about prominent Democrats being a ‘bunch of childless cat ladies’.\n\nAnd in a bizarre turn of events, Musk then took to Twitter to respond: \"Fine Taylor … you win … I will give you a child and guard your cats with my life.\"\n\nOh, and Musk hasn't stopped there either.\n\nAfter being accused of doing a 'Nazi salute' while at Trump's inauguration ceremony, Musk seemingly saw it as yet another opportunity to mention Swift.\n\nMusk later shared a picture of Adolf Hitler performing a Nazi salute alongside a shot of Swift with her arm raised.\n\nOn Reddit, a post included footage of Swift from the supposed incident in 2014, showing she's actually blowing a kiss to the crowd...\n\nUNILAD has contacted representatives of Elon Musk and Taylor Swift for comment.","summary":"![CDATA[It's not the first time Musk has brought up Swift either...]]","url":"https://www.unilad.com/news/us-news/elon-musk-slammed-response-body-shaming-taylor-swift-trump-841388-20250517","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/bltfc6c61d8c6daabcb/682853f0416b32cb2b8ff390/elon-musk-slammed-taylor-swift-trump-no-longer-hot.","video":null,"publish_date":"2025-05-17 09:51:35","author":"Poppy Bilderbeck","authors":["Poppy Bilderbeck"],"language":"en","source_country":"gb","sentiment":-0.077},{"id":322343174,"title":"He voted for Trump, twice. Now he wants to take down MAGA and the \"pathetic\" Tommy Tuberville","text":"Last fall, Kyle Sweetser was a Republican, but an unhappy one. For the third time in a row, Donald Trump had secured his party’s nomination for president — this time without anyone being able to credibly deny what MAGA actually meant for America. The GOP candidate had already been president once, during which time he floated bleach as an antiviral and rejected the outcome of a free and fair election, urging a mob of his supporters to march on the U.S. Capitol and demand that he remain in power despite a majority of Americans asking him to leave.\n\nAs a small businessman in Mobile, Alabama, Sweetser, who voted for Trump the first time around, had been hurt by the president’s rejection of a traditional conservative value: free trade. Tariffs on steel imports had raised costs for his construction firm, but the president, from his perspective, seemed unperturbed by the impacts of his erratic approach to trade policy. Still, what was a Republican to do in 2020: Vote Democrat?\n\nBy 2024, Sweetser was indeed ready to betray his longtime Republican partisanship. The Jan. 6 insurrection made it impossible to deny that Trump poses a threat to American democracy; his refusal to condemn Russia’s full invasion of Ukraine showed that he was unwilling to defend it abroad, either. Standing in front of Independence Hall in Philadelphia last October, Sweetser — by then an active participant in “Republican Voters Against Trump,” the brainchild of former GOP strategist Sarah Longwell — spoke to Salon about why he was ditching “tribalism” and backing the Democratic nominee: then-Vice President Kamala Harris.\n\nThe turning point wasn’t any one thing, Sweetser told Salon at the time, but simply opening his eyes and ears. “I started to pay attention to things that he said,” he explained. And those things, as longtime listeners can attest, are often at odds with reality, any notion of personal responsibility and arguably even conservatism itself — at least the variety that values free markets and constitutional governance over devotion to one man who cares little about either.\n\nThe November election was the final straw in terms of party registration. Today, though, Sweetser is not just a registered Democrat but is hoping to be the Democratic candidate next year who takes on U.S. Sen. Tommy Tuberville, R-Ala. As with convincing Republicans to turn on Trump, he has chosen an uphill battle in what is practically a one-party state: the last time Alabama sent a Democrat to the Senate it was because the Republican nominee was accused of soliciting sex from minors.\n\nSpeaking this month with Salon, Sweetser, a married father of two, explained why he ditched the GOP and why he thinks many in Alabama may be willing to do the same by the 2026 elections.\n\nThis interview has been edited for length and clarity.\n\nSalon: We spoke briefly right in front of Independence Hall, something like six months ago, and back then you were still a Republican against Trump. How did you end up becoming a Democrat against Trump? What happened to make you switch?\n\nSweetser: So basically, you know, to put things bluntly, that was like a last-ditch effort, really, to try to stop the direction the GOP was going. After 2020, specifically after January 6, I decided to do everything in my power to kind of fight against — speak out against — the direction the GOP was going in. Aside from economic issues, I noticed, you know, societal issues, especially down here in the South. My wife is half Thai and going in and out of houses and working in construction, people are a lot more comfortable having people tell you that, basically, they hate immigrants. That is essentially what it boils down to. It just got to a point where, to me, it's about not only helping our state, because this is taught behavior. They're teaching people to be xenophobic, they're teaching people now to be racist, and they're teaching people to be sexist, and that was going away. So like I said, I decided I had to do everything for power to fight back against it.\n\nWhen Nikki Haley hopped in, that was an opportunity for the Republican Party to kind of right the ship. I do feel, going back and looking and talking to people, you did have a lot of Republicans there, but there were a lot of Democrat crossovers as well that crossed over to try to help stop Trump through that means. [But] I mean, this was a long time coming. Like I said, I decided I really wasn't a part of it. After 2021, feeling a bit politically homeless, I decided that, if we couldn't stop them in the primaries, then there was really no place for socially liberal Republicans, if that makes sense; Republicans that are maybe fiscally conservative, or a moderate version of that with strong foreign policy. There's really no place. … Some of the policies that Trump shifted to would be considered far left. And honestly, the truth behind it is, Kamala Harris, the way that she ran her campaign, hopping in there late was, I thought was excellent. She was more conservative than Trump on — as far as the principled conservative goes — on pretty much everything from her economic policy to her foreign policy, to her law-and-order stance and the Constitution.\n\nIf you look at Trump, and you look at his stance in those ways, he's not a conservative — he's a right-wing populist, which, unfortunately, these days, they've taken these terms and they kind of turn them on their head for political reasons. And so it really confuses people when you throw these terms out there, [but] a social conservative with no principles or values is not a conservative at all. But long story short, that was it. I mean, there was really no going back from that point. And I've been asked so many times, over and over and over again, to run as a Democrat in the state of Alabama. Alabama has huge issues. And yet, you look at our past couple races here, and the people at the top of the ticket lose by what, 20, 30 points.\n\nTo that point, do you feel like you're going on a noble suicide mission?\n\nWell, no, I mean, this is something that has to be done. There is a grand opportunity. It’s sad how the state of Alabama has been left by the Republican Party, and it's a tragedy. But there is an opportunity here to install a two-party system again in our state. We've had one-party Republican rule for 15 years; 40% of our population lives in poverty, okay? Fifteen years of Republican rule: that's a supermajority Republican state House, Republican state senate, office of the governor. Not only do they have that — and they have most of the judges in the Supreme Court — now you have a Republican U.S. Senate, Republican U.S. House, Republican president. So they are literally the establishment. They've been the establishment here.\n\nAnd you look at a lot of these guys, the chair of the Alabama Republican Party — he's registered to vote in Tennessee. … Then you have Tommy Tuberville, who lives in a $6 million mansion in Santa Rosa Beach, Florida, spends most of his time there. … I mean, we are in bad shape down here. I'll be honest with you: We're in bad shape. I'm so proud of Alabama. I'm proud of the people that live here. But the bottom line is that 40% of our population lives in poverty, and we die quicker than everybody else in the United States, almost; we're 49th in life expectancy, and a lot of that is related to poverty. People don't have the access or the ability to get the health care that they need. We've got sky-high infant mortality rates here, likely due to poverty.\n\nYou've got sewage infrastructure that is falling apart and overflowing into our waterways and the Republican Party can't get it together. They can't use their political capital to rebuild this infrastructure. Just a few weeks ago, we had 4 million gallons of sewage during a storm, 4 million gallons, come out it and much of it ends up in our waterways, that then goes down to Mobile Bay; that affects our seafood industry; that affects Baldwin County; Alabama's multi-billion dollar tourism industry — we've got nice beaches down here; that affects recreational fishermen; that affects people swimming in the water. … And this stuff doesn't get reported on the way that it needs to. We just get left behind.\n\nAnd a lot of that is what really spoke to people in the state of Alabama: just feeling left behind always. But they [the local GOP] were able to use this where it really should have been kind of focused in on the Republican Party here, and the failings of the Republican Party, and turn it onto the federal government. And it was effective. It worked for someone like me. And as I got into this stuff, I started understanding, I started learning a lot more, I started to change my mind about things.\n\nRight now, our state is not being served by somebody like Tommy Tuberville, and you can replace them with any other kind of guy, and they're just going to do the same thing. You look at his record, and specifically, I think, two years in, [Sen.] Katie Britt, [she] was at $200 million, bringing in $200 million to the state of Alabama, when Tommy Tuberville was at like $67 million — absolutely pathetic.\n\nThat's what you get when you got a guy that lives in a multi-million-dollar beach house in Florida. The state party fails to hold this guy accountable. And you know, you show up to vote and you've got an all Republican and all Democrat bubble on your ticket, and so people don't pay attention, but you look down that ticket and you see 50-60% or more are unopposed Republicans that win by default. So there is zero accountability. I would say they wouldn't have any kind of principles, because they don't have to.\n\nSo really, this is about rebuilding the Democratic Party and state of Alabama, bringing in the working class in the state of Alabama. I have a construction background. I have a small business background. I work in and out of people's houses. I talk to people where they're comfortable. I work in and out of chemical plants, manufacturing facilities, you name it. I've been in those places. I worked on an oil spill, the Deepwater Horizon, when it blew in the Gulf of Mexico. I worked on a boat as a small boat captain. I eventually was put on, as a civilian, a special task force with the Coast Guard. And I was the youngest captain on that task force by about 20 years. I put myself in danger to protect the environment, protect our beaches here, because it means a lot to me.\n\nThe Republicans, they failed here on the environment. … People love the outdoors, but Republicans have been failing us all the way across the board. But it has a lot to do with accountability. When you have zero accountability, then you end up with this.\n\nAs you well know, Alabama has had a long history of being a one-party state. Like 50 years ago, that one party was the Democrats. And you can get into the historical reasons there was the switch — you know, the Civil Rights Act and attempts by Republicans to explicitly appeal to white racial resentment, etc. — but my question is: How do you then break that one-party mentality? Because the only time it's been broken in my memory is when the Republican candidate was accused of being a literal pedophile. Then a Democrat got elected.\n\nYou're well aware of partisanship. I’ve had the same conversations with my family: that today's Republican Party is not really conservative, but it falls back to, “Well, we don't like liberals, and the liberals want to abort babies and make kids trans” and all this stuff. It's about what they're against, not what they're for. How do you counter that mentality where it's, like, you don't have to love every Republican, but you know the Democrats, your whole life, you've been told that they are the enemy.\n\nWe pick a new fight. We pick new fights and new battles. We don't fall into the same battles where Democrats lose over and over again. And we can fight on these same issues, especially in the state of Alabama. For instance, the supposed pro-life stance of the Republican Party, which is bogus, by the way, in our state — what direction do they go from this point? … Because they have to keep going somewhere, it has to keep rolling or it shuts down. So the direction, as far as I can tell, that they're going is: they want to track women across state lines, like cattle. … I mean, it would be an egregious step…. They especially talked about this a lot last year, going after people, legally, for going to clinics out of the state or whatever. Well, how do you do that? Now you have to track people. That's how you do it. My point is that this is the battle that we need to fight, because you will find probably a good majority of Republicans here will not agree with that. The government does not need to be tracking law-abiding citizens based on pregnancy. I mean, that's just the bottom line.\n\nSure, so maybe you don't refight the whole abortion battle, but you can point out that the government tracking women's periods and movements around the state, that's just — from a constitutional conservative perspective, that's a little bit much.\n\nYeah, it's too much. And to other Democrats, look: If you don't draw a line and choose the fight that you can win, then you will continue to lose, and you will continue to lose your rights. So right now, that is the line. And another thing: We got to play like Republicans here, or the MAGA Republicans here, but we can use the truth instead of lies. Look at [Tennessee]. A state elected official in [Tennessee], a year or two ago, was trying to put a bill up for banning interracial marriages. I mean, could you imagine if a Democrat did something like that? It would be blown up all over the news, nonstop. It doesn't matter what state it’s in: they would make the Democratic Party own that.\n\nWe need to make the Republican Party own that stuff. Because, to be completely honest, from talking to people in their houses, people believe that stuff [about Democrats]. We do not need to let that catch fire; we need to put that fire out. And the way to put that fire out is to put it out there and make them own. And guess what? We will all be better for if we make the Republican Party own policies like that, because then they'll have to come out as a whole, and they will have to say they don't agree with that, and then the people in their base that think that they are being served by this rhetoric, or whatever it is, will have to come to terms with that.\n\nA lot of that is why we're here today. There hasn't been the pushback that we need, really, in our state. Like I was pointing to Tommy Tuberville living in Florida, and the vice chair of the RNC living in or having a driver's license and registered to vote in Tennessee. I mean, come on, we have to start swinging. We have to start swinging hard against them — metaphorically, of course — and taking the fight to these people. And look, I get it: Doing all the activism that I've done over the past two years in trying to break through to people, I get it — when you get on their radar, you get hundreds, maybe thousands of threats. They threaten to destroy your business, they threaten to kill your family, they threaten to kill you. They threaten to end you forever, basically. And I get that people are scared, but I'm not scared, and I'm gonna take it to them.\n\nWant a daily wrap-up of all the news and commentary Salon has to offer? Subscribe to our morning newsletter, Crash Course.\n\nIs there anyone in the Democratic Party who you see as a model for the kind of campaign you would like to run or politician you would like to be? I'm thinking maybe even outside the Democratic Party, like Dan Osborn in the last cycle.\n\nI look at everybody, and I try to take the best of what I can take, and that's what we're going with right now. … I'll be honest though: Kamala Harris' platform in 2024 was a surprise, and it was excellent. Obviously, you're not going to agree with everything, but I think that was a definite movement in the right direction. And I just think that that's something good to look at. And really how she spoke and did things and carried herself. She did excellent. I really appreciate what she did. And so hopefully we can stay in that direction, and we can focus on winning some of these voters over that have been kind of turned off by the whole system.\n\nThe state of Alabama, for instance, 2024: as big a motivated Trump country as we are, you look at the voter turnout. Out of all the people that registered, only 57% turned out for that. So we got 43% that were completely turned off. Then on top of that, you've got Trump isn't going to be on the ballot in ‘26, so that's going to chop into some of his people. So the goal is: One, to, like I said, target some of these socially liberal Republicans and win them over and move them over to the Democratic Party, because honestly, they're better represented. And there's going to be a lot of people there, they’re in a rock and a hard place, even if it's 51% to 49%, what represents their interests, or what represents what they believe, a lot of these people, I don't think they understand that the Democratic Party represents them better than the Republican Party. Looking at the economy, looking at the failures of the GOP in our state and how it's led to these issues where we've got rural hospitals that are being closed, over 80% operate in the red. That's rural Alabama — it’s going to get shut down by the new GOP policies trying to cut Medicaid.\n\nYou’ve mentioned a couple times now how Kamala Harris' 2024 campaign, you thought her platform was pretty solid and in some ways even conservative in the traditional sense. But at the end of the day, she lost. And some people take the lesson from that, especially for someone like you running in a state like Alabama, that the lesson is “we just gotta lean into being kind of Trump-lite; we gotta be a little harsher to immigrants; we gotta be a little bit harsher to trans people; we gotta be a little bit harsher to X, Y and Z; maybe give the police a lot more money.\" Kind of be Trump, but competent.\n\nWhat do you think of that whole debate, like the idea that the way to win in a state like yours is to be a more professional, intelligent MAGA Republican?\n\nThat ship has sailed. That's something that I don't think we're going to see come back. And those guys are better off making a few concessions and coming over to the Democratic Party. Look at the economy: I'm running to represent the state, and the state's interests, as a U.S. senator, and so I'm going to run based on, one, I lived in Alabama pretty much my whole life and I know people here. I know how our economy works. I've bled and sweat and helped build Alabama — personally, with my hands. Look, some of these other guys — all pretty much suits — they've taken that approach. This is a different approach that I'm taking and that we're taking, and it's going to be effective at winning people over. I don't hope, I know it's going to be effective at winning people over.\n\nThe Trump-lite thing to me is still disgusting. Because, as I said before, I've watched what his rhetoric is doing to people here. It's teaching people to hate gay people, the LGBTQ community. It's teaching people to hate immigrants. And there's many cases that I could point to. … There was the whole Haitian immigrant thing. Well, they freaked out over in Baldwin County, and the local politicians, Republicans, held a town hall and acted like there were 1,000 people there. “Oh, the Haitians are coming here!” And they weren't. They weren't coming there. But what happened was, is because of that, people in Mobile — where I live, on the other side of the bay — started commenting and saying, “Oh, I saw some Haitian immigrants here today.” And then you realize now they're just targeting people because of the color of their skin. We didn’t have any Haitian immigrants at the time, you what I'm saying?\n\nI mean, this is horrible. And I don't have a problem going toe to toe with these people and telling them they're wrong and what they're doing is wrong, because somebody's got to do it. And you've got to do it loud, but you do have to do it right. In Tommy Tuberville’s case and the Republican Party's case, you look at the whole LGBTQ, trans athletes stuff. I think there's zero of these NCAA athletes that are in the state of Alabama; there's like eight or something out of 175,000 NCAA athletes. While 40% of our state is in poverty, and we die quicker than everyone else. That is an absolute insult to the people of Alabama. People need to know it. It needs to be repeated, just like they repeat lies over and over and over again. The truth needs to be repeated over and over and over and over again. They are teaching people to hate — they are dividing people so they can literally steal from us. I mean, that's the way I look at it, with these tariffs, which are regressive taxes, which hurt states like Alabama, where we have so many people in poverty because regressive taxes hurt lower-income individuals the most. It's just like I said, I'm gonna bring it to them.\n\nYou talked about the tariffs right there, and you've talked about how Trump won't be on the ballot in 2026. Without having you divulge all of your campaign strategy, I'm just curious how much you try to tie your opponent to Donald Trump, knowing that he has a kind of cult-like fan base that boosts the GOP turnout numbers during presidential years. Is it smart to run against Trump in 2026, you think? And I mean, obviously, a lot will happen between now and then; it might make having to run against Trump inevitable. But I'm just curious, tying Tommy Tuberville to Trump's unpopular tariffs, to corruption with Qatar, all that kind of stuff — is that the way you think you win?\n\nWell, you know, it's going to be a day-to-day thing as things develop. But the way I win is by representing Alabama. That's the way I win: by representing people here, by pointing to the issues that are the problem and making the Republican Party as a whole own these problems, because they are their problems. They are the establishment. They have been in the establishment. And this whole charade that they're pulling, it can't last. So what do they do? It's more about, what are they going to do? I don't think they can continue to run the social conservative campaign, because, like I said, they're kind of like, where does it go from here? They keep going, right? So where is it going to go? Are they going to turn Alabama into a theocracy, like Iran, where women don't have rights? I mean, what are they going to do? They're there. They're on the ledge. They went that direction. So now, what are they going to do? They can't win on the economy. They sure can't win on the economy, so we'll see. But more than likely, what they're going to do is they're going to pick a minority group, and they're going to blame that minority group, and they're going to go across the media, they're going to go use their social media influencers, and they're going to villainize some minority group so they can divide people in Alabama. So that's what I'm watching for: for them to do something like that, because that's their playbook and that's all they got while they steal from us.","url":"https://www.yahoo.com/news/voted-trump-twice-now-wants-094504011.html","image":"https://s.yimg.com/ny/api/res/1.2/4L61TMxxD07xHsblFNqU1Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mzg-/https://media.zenfs.com/en/salon_articles_879/f979ddf403ba2e5ce15399a3c1dbddc5","video":null,"publish_date":"2025-05-17 09:45:04","author":"Charles R. Davis","authors":["Charles R. Davis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":322290326,"title":"Zohran Mamdani Courts Cool Crowd in New York Mayoral Campaign","text":"To be young and online in New York is to be aware of a set of social media cool kids — artists, podcasters, writers, models, folks about town — with the power to define what’s in, and what isn’t. Typically, these people anoint influencers, restaurants, bars, literary magazines and other cultural institutions, permitting them entry into a glossy universe of good taste.\n\nNow they’ve set their sights on a mayoral candidate.\n\nIn the past three months, Zohran Mamdani, the upstart Democratic Socialist mayoral hopeful, has appeared onstage at Brooklyn Steel to speak to a sold-out concert by MJ Lenderman, the Pitchfork-approved singer-songwriter; he has tagged along with the ubiquitous TikTok host Kareem Rahma for his show “Keep the Meter Running”; he has accompanied the leftist personality Hasan Piker on his wildly popular streaming show; and he has posed at campaign events with figures of the Brooklyn cultural elite including the millennial celebrity chef supreme Alison Roman and Ella Emhoff, the fashion-darling stepdaughter of former Vice President Kamala Harris.\n\nThe event that best summed up the embrace of Mr. Mamdani’s campaign by New York City’s young microinfluencers, though, is one that took place in March at an East Village club.\n\nIt came about with the help of the publicist Kaitlin Phillips, who has a roster of clients that includes A24, Prada and the Substack phenom Emily Sundberg. Her name is synonymous with the world of Lower Manhattan hype and image making: fashionable, online, in the know.","summary":"Voguish downtowners are aligning themselves with Zohran Mamdani, a young assemblyman vying for New York mayor. Can their clout help a long-shot campaign?","url":"https://www.nytimes.com/2025/05/17/style/zohran-mamdani-campaign-downtown-clout.html","image":"https://static01.nyt.com/images/2025/05/17/multimedia/17ST-ZOHRAN-DOWNTOWN-01-qgzk/17ST-ZOHRAN-DOWNTOWN-01-qgzk-facebookJumbo.jpg","video":null,"publish_date":"2025-05-17 09:01:24","author":"Joseph Bernstein","authors":["Joseph Bernstein"],"language":"en","category":"politics","source_country":"us","sentiment":0.508},{"id":322282042,"title":"Trump attacks Springsteen: Read the President’s entire 151-word rant against Bruce","text":"President Donald Trump has often used social media to attack his dissenters. Rock legend and New Jersey native Bruce Springsteen is the latest to feel his wrath.\n\nAfter Springsteen called Trump “incompetent and treasonous” in Manchester, England at the Wednesday kickoff of his European tour, Trump fired back at The Boss on Friday morning via social site Truth Social.\n\nHere’s what Trump had to say about Springsteen: \n\nTrump’s diatribe comes after Springsteen was highly critical of the President in the United Kingdom.\n\n“In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration.”\n\nSpringsteen not only made those statements at the show, but posted a transcript and video of the remarks to his website. \n\nSpringsteen and Trump being critical of one another is nothing new — the two have traded barbs throughout the last decade. \n\nThe 75-year-old Springsteen endorsed former Vice President Kamala Harris during her 2024 presidential campaign and called Trump “the most dangerous candidate in my lifetime.” He also called President Trump a “moron” in an interview with Rolling Stone in 2016.\n\nTrump previously said he had bigger crowds than Springsteen during a 2024 rally in Wildwood.\n\n“You know they’d all vote for me. You know, like Bruce Springsteen,” Trump said. “We have a much bigger crowd than Bruce Springsteen. Right?”\n\nRelated coverage:\n\n• Trump blasts Springsteen like never before: ‘Dumb as a rock,’ should ‘KEEP HIS MOUTH SHUT’\n\n• Springsteen blasts Trump yet again, calls him ‘incompetent and treasonous’ at concert\n\n• Springsteen opens 1st post-election concert with a ‘fighting prayer for my country’\n\n• Springsteen endorses Kamala Harris, calls Trump the ‘most dangerous candidate in my lifetime’\n\n• Springsteen vs. Trump: A timeline of mutual hatred\n\nOur journalism needs your support. Please subscribe today to NJ.com.\n\nJeremy Schneider may be reached at jschneider@njadvancemedia.com and followed on Twitter at @J_Schneider and on Instagram at @JeremyIsHungryAgain.","summary":"The Boss and the President are going at it","url":"https://www.nj.com/entertainment/2025/05/trump-attacks-springsteen-read-the-presidents-entire-151-word-rant-against-bruce.html","image":"https://www.nj.com/resizer/v2/R3777JGWVNBVJJE2EWZMIAHVPQ.png?auth=1c5c21d0831c32db274d439044751e2b1a4c645ced1b7b3bc9adca2850fdb391&width=1280&quality=90","video":null,"publish_date":"2025-05-17 09:00:00","author":"Jeremy Schneider","authors":["Jeremy Schneider"],"language":"en","category":"politics","source_country":"us","sentiment":0.042},{"id":322257088,"title":"Biden jokes 'I'm a young man' during interview with Special Counsel Robert Hur","text":"Former President Joe Biden joked that he was a \"young man\" during an October 2023 interview with Special Counsel Robert Hur over his mishandling of classified documents, newly released audio shows. Axios released audio on Friday from Biden's interviews with Hur in which the then-president appeared to struggle to remember when his son Beau died, when he left office as vice president, what year President Donald Trump was elected to his first term or why he had classified documents that should not have been in his possession. In addition to Biden's memory lapses, the recordings showed him slurring his words and muttering when speaking to Hur. BIDEN STRUGGLES WITH WORDS, KEY MEMORIES IN LEAKED AUDIO FROM SPECIAL COUNSEL HUR INTERVIEW Transcripts of the interviews — conducted on Oct. 8 and 9, 2023 — were released on March 12, 2024. On the first day of the interview, Hur stressed the importance of answering truthfully and urged Biden to make his best effort to recall the events in question, which the prosecutor acknowledged happened years ago. \"I'm a young man, so it's not a problem,\" Biden, now 82, jokingly responded. \"Okay, great. Glad to hear it,\" Hur replied. BIDEN REPEATEDLY SAYS 'I DON'T REMEMBER' REGARDING CLASSIFIED DOCUMENTS IN NEWLY RELEASED HUR INTERVIEW AUDIO Hur, who was appointed by then-Attorney General Merrick Garland to investigate Biden's handling of classified documents, said in his report, released on Feb. 5, 2024, that he declined to bring charges against the president, in part, because a jury would find him a \"sympathetic, well-meaning elderly man with a poor memory.\" The report acknowledged that the documents were \"willfully\" obtained by Biden during his time as vice president and as a senator. \"I'm well-meaning and I'm an elderly man and I know what the hell I'm doing. I've been president, and I put this country back on its feet. I don't need his recommendation,\" Biden said when questioned by Fox News White House correspondent Peter Doocy days after Hur released his report. The special counsel's report, in addition to Biden's gaffe-prone public appearances, amplified pressure from Republicans who said he lacked the mental fitness needed to serve as president. CLICK HERE TO GET THE FOX NEWS APP Democrats and Biden's White House initially criticized Hur for his report, insisting the then-president was \"sharp\" and that the special counsel was politically motivated. Later in 2024, during Biden's re-election campaign, Democrats urged him to drop out of the race over his performance in the June presidential debate against Trump, citing his age and mental acuity. Biden formally dropped out of the presidential race in July and finished his term. His vice president, Kamala Harris, was defeated by Trump in November's general election.","summary":"Former President Joe Biden joked that he was a &quot;young man&quot; during his October 2023 interview with Special Counsel Robert Hur over his mishandling of classified documents.","url":"https://www.foxnews.com/politics/biden-jokes-im-young-man-during-interview-special-counsel-robert-hur","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/d419b400-President-Biden.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-17 08:28:45","author":"Landon Mion","authors":["Landon Mion"],"language":"en","source_country":"US","sentiment":-0.142},{"id":322240126,"title":"Gaskin: Reflecting on history amid AAPI Heritage Month","text":"May marks Asian American and Pacific Islander Heritage Month, a perfect time to reflect on the diverse experiences of various Asian American communities.\n\nWe often think of discrimination against “Asians” as a group and don’t drill down into the differences different Asian groups faced. While injustices against Japanese and Chinese Americans are widely recognized, other Asian groups have faced significant but often overlooked discrimination. Highlighting these stories, and the varied religious and secular responses, deepens our understanding of America’s racial history.\n\nVietnamese Americans faced severe discrimination as refugees following the Vietnam War, experiencing economic marginalization, language barriers, and violent anti-refugee hostility, exemplified by Ku Klux Klan attacks on Gulf Coast Vietnamese fishermen. Positively, many evangelical, Catholic, and mainline Protestant churches played a pivotal role in refugee resettlement, offering housing, language training, and employment support. Additionally, secular advocacy organizations significantly championed refugee rights. Notable Vietnamese American leaders who emerged include Viet Thanh Nguyen, Pulitzer Prize-winning author, and Joseph Cao, the first Vietnamese American elected to Congress, both refugees.\n\nCambodian Americans, fleeing the Khmer Rouge genocide, faced unique discrimination rooted in severe trauma. Many struggled with mental health stigma, poverty, and negative stereotypes. Cambodian youth, especially in Long Beach, California, encountered criminalization and social marginalization. Positively, Catholic and mainline Protestant groups provided trauma-informed care and educational assistance. Secular organizations like the Southeast Asia Resource Action Center offered culturally sensitive mental health and advocacy support. Prominent Cambodian American leaders include Loung Ung, human rights activist and author, and Dr. Haing S. Ngor, an Oscar-winning actor and genocide awareness advocate.\n\nLaotian Americans, notably the ethnic Hmong who assisted U.S. forces during the “Secret War,” confronted profound cultural isolation and economic difficulties upon resettlement. Evangelical groups provided humanitarian assistance, though at times emphasizing religious conversion. Secular organizations complemented these efforts by offering linguistic and cultural support. Mee Moua, the first Hmong American elected to a state legislature, exemplifies Laotian leadership, advocating for immigrant and civil rights.\n\nFilipino Americans historically endured discrimination characterized by labor exploitation, racial violence, and negative colonial stereotypes. Filipino agricultural workers, notably led by labor activist Larry Itliong during the 1965 Delano grape strikes, challenged oppressive working conditions. The Catholic Church supported Filipino workers through social justice advocacy. Labor unions significantly amplified secular advocacy efforts. Influential leaders like Itliong and writer Carlos Bulosan captured Filipino struggles, contributing significantly to civil rights.\n\nKorean Americans faced severe discrimination, particularly highlighted by the 1992 Los Angeles riots when Korean businesses were disproportionately damaged. Korean Protestant churches provided critical community support. Secular organizations, including the American Civil Liberties Union (ACLU), supported recovery efforts. Young Kim, one of the first Korean American women elected to Congress, emerged as a significant leader, championing immigrant entrepreneurship and social integration.\n\nSouth Asian Americans — including Indian, Pakistani, Bangladeshi, Sri Lankan, and other communities — faced discrimination linked to religious and cultural identities, particularly heightened after 9/11. Historical immigration restrictions, racial profiling, and hate crimes significantly impacted these communities, notably affecting Sikh and Muslim populations. Progressive Christian denominations actively condemned anti-South Asian violence, fostering interfaith alliances. The Sikh Coalition and secular interfaith groups, including the Anti-Defamation League (ADL), played crucial roles in combating racism and promoting tolerance.\n\nProminent South Asian American leaders include Vice President Kamala Harris, of Indian descent. Hansen Clarke, the first U.S. Congressman of Bangladeshi descent, notably advocated for immigrant communities and social equity. Julia Wijesinghe, a prominent Sri Lankan American human rights lawyer, emerged as a vital advocate for immigrant rights, refugee protections, and Sri Lankan Tamil community issues.\n\nBurmese Americans, particularly persecuted minorities like the Karen people, encountered significant trauma and discrimination during resettlement. Louisa Benson Craig, a Karen activist who resettled in the U.S., became a leading advocate for refugees and human rights, raising awareness about persecution in Myanmar.\n\nThai Americans often experienced cultural invisibility and racial stereotyping. Senator Tammy Duckworth, born in Thailand, has become a powerful voice in American politics. An Iraq War veteran and advocate for veterans’ rights, Duckworth’s career highlights Thai American contributions and resilience.\n\nPacific Islander communities — Native Hawaiians, Samoans, Chamorros, Tongans, and Fijians — endured discrimination through educational and economic marginalization, healthcare neglect, and harmful racial stereotypes, exacerbated by historical colonial exploitation. Progressive Protestant and Catholic denominations have advocated for indigenous rights and cultural preservation. Secular Native Hawaiian sovereignty movements and community-led organizations significantly advanced land rights, educational equity, and cultural empowerment. Daniel Akaka, the first Native Hawaiian in the U.S. Senate, exemplifies Pacific Islander leadership, strongly advocating for indigenous rights.\n\nAcross these groups, recurring discriminatory patterns include the “perpetual foreigner” stereotype, the misleading “model minority” myth, and marginalization based on language proficiency.\n\nBy acknowledging both the challenges faced and the strengths demonstrated by these diverse groups, we can build a genuinely inclusive society that respects and honors all Asian American and Pacific Islander communities.\n\nEd Gaskin is Executive Director of Greater Grove Hall Main Streets and founder of Sunday Celebrations","summary":"May marks Asian American and Pacific Islander Heritage Month, a perfect time to reflect on the diverse experiences of various Asian American communities.","url":"https://www.bostonherald.com/2025/05/17/gaskin-reflecting-on-history-amid-aapi-heritage-month/","image":"https://www.bostonherald.com/wp-content/uploads/2025/05/BHR-L-GASKIN.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-17 07:11:42","author":"Ed Gaskin","authors":["Ed Gaskin"],"language":"en","source_country":"US","sentiment":0.434},{"id":322228018,"title":"Teenage illegal migrant killed young woman... then walked free from jail","text":"A 15-year-old illegal migrant who was unlicensed, uninsured, and driving his mother's Jeep at 90mph in a residential zone killing a young woman in the process, has walked free from jail with two years of probation and 100 hours of community service. \n\nKaitlyn Weaver's crumpled Volkswagen lay shattered at an Aurora, Colorado intersection after the killer driver smashed into to her car on July 8, 2024.\n\nThe force of the impact crushed the driver's side. Emergency crews raced to extract 24-year-old Kaitlyn from the wreckage and she was placed on life support for two days - just long enough for her parents to donate her organs.\n\nPolice charged the teen responsible with vehicular homicide with Kaitlyn's family being told by the Arapahoe County District Attorney's Office that there would be no plea deal.\n\nBut then progressive district attorney Amy Padden was elected, stunning the Weaver's with news that her office would offer the killer probation. \n\nKaitlyn, a University of Colorado psychology graduate and drug rehab worker, was driving through Aurora when she stopped at a four-way intersection. \n\nWhile waiting at a stop sign and chatting on speakerphone with her boyfriend, she was T-boned at deadly speed by a Jeep Cherokee driven by the Colombian national, still unnamed due to juvenile privacy laws.\n\n'It was an instantaneous death,' her father, John Weaver, told Fox News. 'She didn't even see him coming.\n\n'She spent her life trying to help people. She was an amazing human being,' he added.\n\n'They said by doing two years' probation, that's probably more than the judge would give if he pleaded guilty,' Weaver recalled as he discussed the light sentence. \n\n'You don't have to participate in a bad system. If the judge wanted to sentence him to less, that's the judge's issue. But by offering this plea, now you're part of the problem.'\n\nThe unlicensed and uninsured teenage driver had taken his mother's Jeep without permission and was racing other teens through residential streets. \n\nThe teen promised prosecutors he would attend school and avoid future legal trouble in exchange for no jail time and has since applied for asylum in the United States.\n\nMatthew Durkin, an attorney for the Weaver family, called the plea deal 'abhorrent.'\n\n'There's no deterrence. If he had taken a firearm and recklessly just shot it and killed someone, this would be a different case. They would be pushing it completely differently,' John Weaver said.\n\nInstead, the teen's immigration status, age, and the progressive leanings of the DA's office appear to have shielded him from real consequences.\n\n'We had a collision where the immigration system and the criminal justice system collided, and now my daughter's dead,' John added.\n\nColorado law protects the identities of minors in criminal court and the illegal immigrant who took Kaitlyn's life has never been publicly named nor had his mugshot released. \n\nThanks to the Arapahoe County judge, he remains shielded from public view.\n\nFurthermore, the court allowed him to file for asylum instead of enforcing deportation proceedings.\n\nWoke, progressive District Attorney Amy Padden, who has been photographed with Kamala Harris and Georgia's Stacey Abrams, has been under fire since the plea deal became public. \n\nCritics point to her cozy ties with top Democrats and her record of pushing juvenile justice reform as a reason she went soft on a case that demanded hard accountability.\n\nIn a statement, Arapahoe County Assistant DA Ryan Brackley stated: 'We unequivocally condemn such reckless and unlawful behavior, which had devastating and irreversible results... No legal outcome can truly make up for the profound loss and void Kaitlyn's loved ones will live with permanently.'\n\nPadden also addressed the case on Facebook with a lecture about speeding. \n\n'We acknowledge Kaitlyn Weaver's death was the direct result of a crash caused by an unlicensed teenager driving at nearly twice the posted speed limit,' she wrote.\n\n'This tragic loss is a powerful reminder that it is not just alcohol or drug impaired driving that takes lives. Driving at dangerous speeds has deadly consequences too.' \n\nKaitlyn Weaver had dedicated her life to helping people - first at a suicide hotline, then at a drug rehabilitation center in Aurora.\n\n'She was really trying to make a difference in their lives every day,' dad, John, said.\n\n'Immigration and the criminal justice system and all these things landed together one day in Aurora,' he mourned. 'Now I sit here today without a daughter.","summary":"A 15-year-old illegal immigrant who killed 24-year-old Kaitlyn Weaver in a 90mph crash has walked free after a Colorado DA offered a probation-only plea deal.","url":"https://www.dailymail.co.uk/news/article-14721411/Teenage-illegal-migrant-killed-young-woman-walked-free-jail.html","image":"https://i.dailymail.co.uk/1s/2025/05/17/02/98470147-0-image-m-31_1747445709395.jpg","video":null,"publish_date":"2025-05-17 06:23:08","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.428},{"id":322202914,"title":"MAGA without Donald Trump? 2028 belongs to the GOP, but Trump has a replacement","text":"America is already building a new political consensus for 2028, and a new chapter of the conservative movement is taking shape, but with a new face at the helm, claims a recent poll survey.Vice President JD Vance has emerged as the clear frontrunner for the Republican nomination, according to a recent J.L. Partners poll for the 2028 US presidential race. The survey was conducted on May 13-14, 2025, and among 975 registered Republican voters, it reveals that 46 per cent support Vance, placing him well ahead of other potential candidates. Trump said in March that the future of MAGA looked “so strong,” with Rubio and Vance appearing to be the early favorites to get the president’s backing come primary season. “You look at Marco, you look at JD Vance, who’s fantastic,” he told NBC News. “You look at, I could name 10, 15, 20 people right now just sitting here. No, I think we have a tremendous party.”Florida Governor Ron DeSantis trails with 8 percent support, followed by Ohio gubernatorial candidate Vivek Ramaswamy at 7 percent. Senators Marco Rubio and Ted Cruz each garnered 6 percent, while former South Carolina Governor Nikki Haley received 5 percent.Vance's ascent is notable, considering his initial criticism of Donald Trump during the 2016 campaign, when he referred to Trump as America's Hitler. However, Vance has since become a staunch ally of the former president, aligning closely with Trump's policies and rhetoric. His loyalty was rewarded when Trump selected him as his running mate in the 2024 election.Vance has been an active figure in the administration as the Vice President, particularly on issues related to immigration and law enforcement. He recently criticized leaders of sanctuary cities for undermining law enforcement and pledged federal defunding for jurisdictions that do not cooperate with immigration enforcement. Vance's appeal extends beyond traditional Republican strongholds. He has cultivated relationships with Silicon Valley figures, attending fundraisers hosted by venture capitalist Chamath Palihapitiya, reflecting his outreach to tech industry donors. On the Democratic side, former Vice President Kamala Harris leads with 30 percent support, followed by former Transportation Secretary Pete Buttigieg at 8 percent, and Governors Josh Shapiro of Pennsylvania and Gavin Newsom of California at 7 percent each. The poll did not include Donald Trump, who, at 78, will be constitutionally ineligible to run for a third term in 2028. However, Trump has hinted at seeking a third term, raising questions about the future direction of the Republican Party.Vance's rise from a venture capitalist and author of the memoir Hillbilly Elegy to Vice President and leading presidential contender underscores his rapid ascent in American politics. His strong showing in early polls suggests he is well-positioned to carry forward the MAGA movement's legacy into the next election cycle.","summary":"JD Vance is leading the race for the Republican nomination in 2028. A recent poll shows him ahead of Ron DeSantis and others. Donald Trump praised Vance and Marco Rubio as potential successors. Kamala Harris is the frontrunner for the Democrats. Vance, once critical of Trump, is now a key ally.","url":"https://economictimes.indiatimes.com/news/international/us/maga-without-donald-trump-2028-belongs-to-the-gop-but-trump-has-a-replacement/articleshow/121228371.cms","image":"https://img.etimg.com/thumb/msid-121228353,resizemode-4,width-1200,height-900,imgsize-895910,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-17 05:16:05","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.267},{"id":322271956,"title":"Trump Bashes Bruce Springsteen And Taylor Swift On Truth Social","text":"President Donald Trump took to Truth Social on Friday to disparage Bruce Springsteen and Taylor Swift - both vocal critics of his policies - almost two days after Springsteen condemned Trump during a concert in England.\n\nThis is not the first time Trump has criticized celebrities such as Springsteen and Swift, both of whom supported Kamala Harris during her 2024 presidential campaign. But Trump's recent social media posts are among his first insulting A-listers since his return to office. During his first term, the president frequently brawled with high-profile entertainers including Meryl Streep and Robert De Niro.\n\nSpringsteen railed against the Trump administration in three statements made during opening night of his Land of Hope and Dreams Tour in Manchester, England.\n\nBefore performing \"Land of Hope and Dreams” Wednesday night, he called the administration \"corrupt, incompetent and treasonous.” Ahead of singing \"House of a Thousand Guitars,” he said \"the union of people around a common set of values” are \"all that stands between democracy and authoritarianism.” As he introduced \"My City of Ruins,” Springsteen called Trump an \"unfit president” in a longer speech criticizing what he described as \"very weird, strange and dangerous s--- going on” in the United States.\n\n\"They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won't bow down to their ideological demands,” Springsteen said. \"They are removing residents off American streets and, without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now.”\n\nHe also criticized attacks on free speech, the abandonment of \"the world's poorest children” and the rollback of \"historic civil rights legislation.”\n\nTrump, in turn, lambasted Springsteen's political beliefs - and his appearance.\n\n Taylor Swift got police escort to London gigs after Austria terror plot\n 'I HATE TAYLOR SWIFT' Trump tweets\n Trump blasts Supreme Court over block on deportations\n\n\"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he's not a talented guy - Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden,” Trump wrote on Truth Social on Friday morning.\n\nHe also called Springsteen \"Highly Overrated” and \"dumb as a rock” and warned that \"this dried out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that's just 'standard fare.' Then we'll all see how it goes for him!”\n\nSpringsteen performed at a star-studded rally for Harris in October, calling Trump an \"American tyrant.”\n\nThe White House doubled down on the Springsteen insults in a statement: \"When this loser Springsteen comes back home to his own City of Ruins in his head, he'll realize his Glory Days are behind him and his fans have left him Out in the Street, putting him in a Tenth Avenue Freeze-Out because he has a severe case of Trump Derangement Syndrome that has rotted his brain,” White House Communications Director Steven Cheung wrote in an email to The Washington Post on Friday afternoon. (Yes, those are references to well-known Springsteen songs.)\n\nLess than an hour before his Springsteen post, Trump jabbed at Swift, another megastar with a history of criticizing him: \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'”\n\nTrump raged against the pop singer on the same platform in September, days after Swift endorsed Harris for president.\n\nThe superstar announced after the first Trump-Harris presidential debate that she planned to vote for the vice president in an Instagram post signed \"Taylor Swift, Childless Cat Lady.”\n\nIn Swift's statement, she cited a Trump endorsement falsely attributed to her as the reason she was being transparent about her voting plans: \"It really conjured up my fears around AI, and the dangers of spreading misinformation,” she wrote.\n\nSwift previously compared Trump's presidency to an \"autocracy” and accused him of \"stoking the fires of white supremacy and racism.”","summary":"(MENAFN - The Peninsula)\nThe Washington Post\n President Donald Trump took to Truth Social on Friday to disparage Bruce Springsteen and Taylor Swift - both vocal critics of his policies - almost two ...","url":"https://menafn.com/1109560885/Trump-Bashes-Bruce-Springsteen-And-Taylor-Swift-On-Truth-Social","image":"https://menafn.com/updates/pr/2025-05/17/TP_a51c6image_story.jpg","video":null,"publish_date":"2025-05-17 05:09:29","author":"Date,MENAFN","authors":["Date","MENAFN"],"language":"en","category":"entertainment","source_country":"jo","sentiment":-0.041},{"id":322211632,"title":"FLASHBACK: Biden shrugs off Hur report when pressed by Peter Doocy: 'I know what the hell I'm doing'","text":"Former President Joe Biden early last year dismissed Special Counsel Robert Hur's report that sparked additional concern about his mental acuity, just months after he was interviewed about his mishandling of classified documents. Axios on Friday released audio from Biden's October 2023 interviews with Hur. In the recordings, Biden seemed to struggle to remember when his son Beau died, when he left office as vice president, what year President Donald Trump was elected to his first term, or why he had classified documents that should not have been in his possession. The recordings not only showed Biden's memory lapses, but also slurring his words and muttering when speaking to Hur. Transcripts of the interviews — conducted on Oct. 8 and 9 of 2023 — were released on March 12, 2024. In February 2024, Fox News White House correspondent Peter Doocy was the first to question Biden about Hur's report on his mental fitness. BIDEN STRUGGLES WITH WORDS, KEY MEMORIES IN LEAKED AUDIO FROM SPECIAL COUNSEL HUR INTERVIEW \"Something the special counsel said in his report is that one of the reasons you were not charged is because, in his description, you are a ‘well-meaning, elderly man with a poor memory,'\" Doocy said to Biden at a press conference on Feb. 8, 2024. Biden responded: \"I'm well-meaning and I'm an elderly man and I know what the hell I'm doing. I've been president and I put this country back on its feet. I don't need his recommendation—\" Doocy then asked Biden how bad his memory was and if he could continue as president. BIDEN REPEATEDLY SAYS 'I DON'T REMEMBER' REGARDING CLASSIFIED DOCUMENTS IN NEWLY RELEASED HUR INTERVIEW AUDIO \"My memory is so bad I let you speak,\" Biden told him. Hur, who was appointed by then-Attorney General Merrick Garland to investigate Biden's handling of classified documents, said he declined to bring charges against him, in part, because a jury would find him to be a \"sympathetic, well-meaning elderly man with a poor memory,\" despite the acknowledgment that the documents were \"willfully\" obtained by Biden during his time as vice president and as a senator. The special counsel's report, in addition to gaffes seen during Biden's public appearances, amplified pressure from Republicans who said he lacked the mental fitness needed to serve as president. CLICK HERE TO GET THE FOX NEWS APP Democrats and Biden's White House initially criticized Hur for his report, repeatedly insisting he was \"sharp\" and that the special counsel was politically motivated. Later in 2024, amid Biden's re-election campaign, Democrats called on him to drop his candidacy over his performance in the June presidential debate against Trump, citing his age and mental acuity. Biden, now 82, ended his presidential campaign in July but finished his term, and his vice president, Kamala Harris, was defeated by Trump in November's general election.","summary":"Former President Joe Biden early last year dismissed Special Counsel Robert Hur&apos;s report that sparked additional concern about his mental acuity.","url":"https://www.foxnews.com/politics/flashback-biden-shrugs-hur-report-when-pressed-peter-doocy","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/biden-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-17 04:23:56","author":"Landon Mion","authors":["Landon Mion"],"language":"en","source_country":"us","sentiment":-0.24},{"id":322319258,"title":"Biden audio release pressures Democrats who would rather talk about Trump","text":"Former President Biden’s time in office is behind him, but his age and mental acuity have become an issue for the next leaders in his party. Audio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about Biden's health back in the spotlight. Months after former Vice President Kamala Harris lost the presidential election to Donald Trump, a new book alleges that White House aides covered up Biden's physical and mental decline. Several potential Democratic contenders for the 2028 nomination have been asked in recent days whether they believe Biden was declining in office or whether he should have sought reelection before a disastrous debate performance led to his withdrawal. Many Democrats would prefer to focus on President Trump's second term and his sagging poll numbers. Trump has done his best to prevent that — mentioning Biden's name an average of six times per day during his first 100 days in office, according to an NBC News analysis — and Republicans have followed his lead, betting that voters frustrated by Trump's policy moves will still prefer him over memories of another unpopular presidency. In the race for Virginia governor, one of this year's highest-profile contests, Republican Winsome Earle-Sears is running a pair of digital ads tying Democratic former Rep. Abigail Spanberger to Biden, with images of the two hugging and the former president calling her a friend. “The stench of Joe Biden still lingers on the Democratic Party,” Democratic strategist Sawyer Hackett said. “We have to do the hard work of fixing that, and I think that includes telling the truth, frankly, about when we were wrong.” Democratic Sen. Chris Murphy of Connecticut told Politico this week that “there’s no doubt” that Biden, now 82, experienced cognitive decline as president. Pete Buttigieg, who was Biden's Transportation secretary, wasn’t as blunt but stopped short of defending Biden’s initial decision to run for reelection. He responded “maybe” when asked Tuesday whether the Democratic Party would have been better off if Biden hadn’t declared a bid for a second term. “Right now, with the advantage of hindsight, I think most people would agree that that’s the case,” Buttigieg told reporters during a stop in Iowa. Illinois Gov. J.B. Pritzker said he didn't see signs of mental or physical decline in his meetings with Biden. “I saw him a few times,” he told CNN this week. “I certainly went to the White House whenever there was an opportunity for me to make the case for something for people in my state. And I never had the experience of anything other than a guy who brought to the table a lot of good ideas about how to solve problems.” The book “Original Sin,” by journalists Jake Tapper of CNN and Alex Thompson of Axios, revives a core controversy of Biden’s presidency: his decision to run for a second term despite voters, including Democrats, telling pollsters that he should not. Biden would have been 86 at the end of a second term had he won in November. A spokesperson for Biden did not respond to a request for comment. “We continue to await anything that shows where Joe Biden had to make a presidential decision or where national security was threatened or where he was unable to do his job,” the spokesperson has told many media outlets in response to the book. Late Friday, Axios published portions from audio recordings of Biden's six hours of interviews with prosecutors investigating his handling of classified documents after his term as vice president ended in 2017, for which he was not charged. The Biden administration had already released transcripts of the interviews, but the recordings shed light on special counsel Robert Hur's characterization of Biden as “a sympathetic, well-meaning, elderly man with a poor memory” and appeared to validate his claim that the then-president struggled to recall key dates, including the year his son Beau died of cancer — 2015. Biden and his aides fiercely objected to Hur's report, which they characterized as a partisan hit. Biden at that time — early 2024 — was still planning to run for a second term and fending off accusations that he was too old for another four years in the job. The recordings released by Axios include Biden's discussion of his son's death. His responses to some of the prosecutors' questions are punctuated by long pauses, and his lawyers at times stepped in to help him recall dates and timelines. Before he dropped his reelection bid last summer, Biden faced widespread doubts within his own party, even as Democratic leaders dismissed a series of verbal flubs and Republican allegations about his declining acuity. In January 2022, a year into Biden’s first term, an AP-NORC Center for Public Affairs Research poll found that only 48% of Democrats wanted him to seek reelection. That fell to 37% of Democrats in an AP-NORC poll in February 2023. Three-quarters of Americans — and 69% of Democrats — said in August 2023 that they believed Biden was too old to serve as president for another four-year term. And shortly after his debate flop, nearly two-thirds of Democrats said Biden should withdraw from the race. Biden and former First Lady Jill Biden appeared on ABC’s “The View” on May 8 in a preemptive defense of his health and decision-making before the first excerpts of “Original Sin” were published. The former president said he’s responsible for Trump’s victory but attributed Harris’ loss, at least in part, to sexism and racism. He maintained that he would have won had he remained the Democratic nominee. Both Bidens rejected concerns about his cognitive decline. Patricia McEnerney, a 74-year-old Democrat in Goodyear, Ariz., said Biden should not have tried to run again. “I think it’s sad the way it ended,” she said. She compared him to Douglas MacArthur, the World War II and Korean War general famously dismissed by President Truman. “I think he needs to stop giving interviews. I think that would help,” McEnerney said. “Like MacArthur said, generals just fade away.” Janet Stumps, a 66-year-old Democrat also from Goodyear, a Phoenix suburb, had a different view. “I don’t think it’s going to hurt the Democrats,” Stumps said. “I feel badly that he feels he has to defend himself. I don’t think he has to. Everybody ages. And the fact that he did what he did at his age, I think he should be commended for it.” Hackett, the Democratic strategist, predicted Biden won’t be a major factor in the 2026 midterms or the 2028 presidential primaries. But he said Democrats who want voters to trust them would be well-served “by telling the truth about the mistakes that our party made in the run-up to 2024.” “Those mistakes were largely driven by Joe Biden, and I think any Democrat not willing to say that is not really prepared to face the voters, who want the truth and they want authenticity,” Hackett said. Rick Wilson, a former GOP strategist who co-founded the anti-Trump group the Lincoln Project, said Republicans want to talk about Biden to avoid defending Trump. But he said the strategy is folly. Besides “political nerds,” he said, “no one else cares.” Cooper writes for the Associated Press. AP writer Thomas Beaumont in Cedar Rapids, Iowa, contributed to this report.","summary":"Former President Biden’s time in office is behind him, but his age and mental acuity have become an issue for the next leaders of the Democratic Party.","url":"https://www.latimes.com/world-nation/story/2025-05-16/biden-audio-release-pressures-democrats-who-would-rather-talk-about-trump","image":"https://ca-times.brightspotcdn.com/dims4/default/ef92502/2147483647/strip/true/crop/8186x4298+0+580/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb7%2F35%2F2eaedd4603af03e4fcd56dd7d948%2Fb13697f97c2a48868a8e","video":null,"publish_date":"2025-05-17 04:18:25","author":"Jonathan J. Cooper","authors":["Jonathan J. Cooper"],"language":"en","category":"politics","source_country":"US","sentiment":-0.45},{"id":322195614,"title":"Joe Biden's Hur Tape Could Backfire on Kamala Harris","text":"Former President Joe Biden's newly revealed audiotape of his interview with ex-special counsel Robert Hur calls into question then-Vice President Kamala Harris' defense of her boss's cognitive abilities.Newsweek reached out to Biden and Harris' offices via online form Friday for comment.Why It MattersThe interview was conducted in 2023, amid the special counsel's investigation into Biden's handling of classified documents. President Donald Trump was also under investigation for accusations of improper handling of classified documents after his first term.Ultimately, Hur recommended Biden not be prosecuted, calling the former president a \"sympathetic, well-meaning elderly man with a poor memory.\" Democrats and Republicans alike strongly reacted to Hur's findings, as some called his remarks out of line and others griped with his conclusion.The obtained audio comes at the end of a harsh week for the former president, as excerpts from CNN's Jake Tapper and Axios' Alex Thompson's new book Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again were published by multiple media outlets.Biden dropped out of the 2024 presidential race in late July, following a disastrous debate performance against then-Republican presidential nominee Trump. Biden repeatedly stared at Trump and made halting statements where he appeared to lose his train of thought. Biden later said he had \"a bad, bad night.\"Questions swirled about his mental acuity and possible decline as the White House and Harris fielded questions about his cognitive ability in the final months of his presidency.What To KnowImmediately following the release of Hur's February 2024 report, Biden's second in command defended her boss, saying in part, \"What I saw [in] that report last night, I believe is, as a former prosecutor ... the comments that were made by that prosecutor--gratuitous, inaccurate, and inappropriate.\"The former vice president went on to praise Biden's readiness and coordination after Hamas' attack of Israel on October 7, 2023.Harris continued, \"The way that the president's demeanor in that report was characterized, could not be more wrong on the facts and clearly politically motivated.\"\"We should expect that there would be a higher level of integrity than what we saw,\" Harris said.Former White House spokesperson Ian Sams also raced to Biden's defense in the aftermath of the report, saying to the media in part, \"You're left to wonder, why this report spends time making gratuitous and inappropriate criticisms of the president.\"This week, a Democratic congressman raised concerns about his own party, suggesting that some officials may still be in denial about the November election loss and the magnitude of the defeat at the hands of Trump.Speaking to Politico, Democratic Representative Seth Moulton of Massachusetts was asked about Tapper and Thompson's book, saying, \"It's OK for us to come to grips with our failures so that we can make the changes necessary to win.\" He then expressed his worry: \"And while I am very much focused on the future, I'm concerned that there's still a lot of denial in our party about how badly we've lost.\"\"Some of the same people who just want to move on are the same people who are basically in denial that we lost,\" Moulton said.Following her election loss to Trump in 2024, Harris has maintained a somewhat low political profile, as rumors swirl about her potential future in state or federal politics.In early polls testing the Democratic primary waters for 2028, Harris has appeared as a top contender alongside New York Congresswoman Alexandria Ocasio-Cortez and former Biden Transportation Secretary Pete Buttigieg. In a poll by Echelon Insights taken from May 8 to May 12 among 1,000 voters \"in the likely electorate,\" Buttigieg had 10 percent of the vote versus other potential candidates.Harris had 32 percent and Ocasio-Cortez had 8 percent of the vote. The poll has a 3.8 percent margin of error.What People Are SayingPolitical analyst Craig Agranoff, to Newsweek via text message Friday night: \"Her criticism of Hur's report, particularly the characterization of President Biden as an 'elderly man with a poor memory,' was a strategic move to defend her administration at the time.\"Agranoff continued: \"However, in hindsight, it risks casting a shadow over her credibility, as public concerns about Biden's age and mental acuity became more pronounced during the 2024 campaign. This moment reflects a broader challenge for Democrats: balancing loyalty to their leadership with the need for transparency about electability.\"Concluding, the political analyst said: \"Harris's response was understandable in context, but it may have contributed to perceptions that the party was out of touch with voters' concerns about Biden's fitness, which ultimately hurt their case in 2024. That said, it's too simplistic to pin the party's struggles solely on her; Democrats faced a complex electoral landscape, and this was just one piece of a larger puzzle.\"Former Obama adviser David Axelrod posted to X, formerly Twitter, on Thursday: \"A lot of folks now are acknowledging what was obvious then: A guy, who was already showing frailties and would have been closer to 90 than 80 by the end of his second term should not have run for the hardest job on the planet. Never was going to end well.\"Axelrod continued: \"Next to being President, the pressure of running for it is almost as hard. The idea that an 81-year-old man, already limited, could handle both--and then serve another four years--always was nuts. And the people closest to him did him no favor by not telling him the truth.\"GOP Congressman James Comer of Kentucky posted to X on Friday: \"&#128680;Joe Biden's former White House aides can't hide behind the walls of the Oval Office anymore. They orchestrated a deliberate effort with the liberal media to conceal the truth about Joe's mental decline. Joining @FoxNews HANNITY tonight at 9pmET. Tune in!\"What Happens NextIt is unclear whom the Democrats will rally behind as their next leader amid the party's uncertain direction at the moment.","summary":"The ex-vice president's previous comments about Robert Hur's report in defense of Biden could cast doubt on her credibility, a legal analyst told \"Newsweek.\"","url":"https://www.newsweek.com/joe-bidens-hur-tape-could-backfire-kamala-harris-2073566","image":"https://d.newsweek.com/en/full/2646571/joe-biden-kamala-harris.jpg","video":null,"publish_date":"2025-05-17 03:58:16","author":"Anna Commander","authors":["Anna Commander"],"language":"en","source_country":"us","sentiment":-0.095},{"id":322185738,"title":"Recordings of Biden-Hur interview emerge, highlighting his memory lapses","text":"Snippets from a 2023 interview that led Justice Department special counsel Robert Hur to describe former President Joe Biden as an \"elderly man with a poor memory\" were obtained and published by Axios Friday, showing Biden's halting tone of voice and difficulty remembering dates.CBS News has confirmed the audio matches the transcript of the interview released by the Biden White House in 2024.In one four-minute clip, Biden was asked by Hur's team — which was investigating Biden's handling of classified records — about where he kept his documents shortly after leaving office as vice president. Biden's response is marked by long pauses, and his voice appears hoarse at times. His speech is especially halting as he describes the period around his son Beau's death.In the audio obtained by news outlet Axios, Biden can also be heard struggling to remember the year when Beau died or the year when President Trump was first elected. Members of his staff can be heard correcting him or reminding him of the date.A written transcript of the five-hour interview was released last year, but portions of the audio released Friday provide context on Biden's demeanor and memory problems at certain points in the session.In response to the audio, Biden spokesperson Kelly Scully told CBS News in a statement, \"The transcripts were released by the Biden administration more than a year ago. The audio does nothing but confirm what is already public.\"Biden's verbal delivery was a key part of Hur's report. The special counsel wrote in February 2024 that Biden sounded like a \"sympathetic, well-meaning, elderly man with a poor memory.\" Hur said it's a view jurors may share, making it hard to convict Biden of knowingly holding sensitive documents at his home and office. Hur's report noted \"significant limitations\" to Biden's memory, including his difficulty remembering when his son died.Hur recommended against charging Biden with a crime, though he did conclude that Biden \"willfully\" retained government documents.At the time, Biden and his allies reacted furiously to Hur's report — especially the \"elderly man with a poor memory\" line and the comment about Beau Biden's death.\"There's even a reference that I don't remember when my son died. How in the hell dare he raise that? Frankly, when I was asked the question, I thought to myself it wasn't any of their damn business,\" Biden said last year. \"I don't need anyone to tell me when he passed away.\"Biden's personal attorney Bob Bauer called the report a \"shabby piece of work\" filled with \"totally inappropriate and pejorative comments.\" The Biden White House counsel's office asked Hur's team to revise the report, calling its references to Biden's memory \"inflammatory.\"The report was released as concerns swirled about then-80-year-old Biden's age and fitness to run for another term, though at the time, Democratic officials publicly backed Biden and slammed Hur. Republicans, meanwhile, cited the report as evidence of Biden's fading cognitive abilities and pushed for audio of the interview to be released.But months later, Biden's rocky June debate against Mr. Trump — in which he repeatedly struggled to complete his sentences — reignited worries about his age, leading to Biden's withdrawal from the presidential race amid pressure from his party. Biden's decisions during that period have drawn new scrutiny in recent weeks, as books that offer glimpses inside his campaign hit the shelves. Some of the books describe Biden's struggles with age, his aides' maneuvers to keep him in the race and the abrupt shift from Biden to eventual nominee Kamala Harris weeks after the Trump-Biden debate.Biden has strongly denied any lapses in his cognitive ability, telling \"The View\" last week, \"there's nothing to sustain that.\"","summary":"Former President Joe Biden's speech is marked with long pauses and a halting delivery in a recording of his interview about classified documents released Friday.","url":"https://www.cbsnews.com/news/biden-hur-interview-tapes-special-counsel/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/01/19/8ad1f4cc-05bd-48d5-a5e8-991e66f54681/thumbnail/1200x630/f2f037c5a71ce9be7a6994d44174af77/ap25019580843480.jpg?v=6df9366690ed146f169dd0670c453f91","video":null,"publish_date":"2025-05-17 03:03:46","author":"Joe Walsh","authors":["Joe Walsh"],"language":"en","source_country":"us","sentiment":-0.286},{"id":322184032,"title":"Trump Bashes 'Obnoxious Jerk' Bruce Springsteen, Says Taylor Swift 'No Longer Hot'","text":"President Donald Trump used his down time on Air Force One Friday to insult “obnoxious JERK” Bruce Springsteen and declare Taylor Swift “no longer HOT” in social media blasts against the music giants.\nTrump — returning from a whirlwind Middle East diplomatic trip — took to his Truth Social platform to feud with Springsteen, who this week told a British concert audience that his homeland is now ruled by a “corrupt, incompetent and treasonous administration.”\nIn return, the 78-year-old Republican said the legendary rocker, nicknamed “the Boss,” is “Highly Overrated.”\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy – Just a pushy, obnoxious JERK,” Trump wrote in the lengthy tirade.\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just “standard fare.” Then we’ll all see how it goes for him!”\nSpringsteen is an outspoken liberal critic of Trump and campaigned for Democratic president Joe Biden’s ultimately abandoned reelection run last year.\nWhile in Manchester on his “Land of Hope & Dreams” tour Wednesday, he told fans that “my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years” is in danger.\n“Raise your voices against authoritarianism and let freedom ring,” Springsteen said.\nTrump also had strong words for Swift, who endorsed Biden’s replacement as the Democratic candidate in 2024, Kamala Harris.\nIn a separate post, which provided no context, the US president said: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?'”\nHe appeared to be referencing a post in September last year when he declared “I HATE TAYLOR SWIFT!”\nSwift, 35, is the wealthiest female musician on the planet, with an estimated personal wealth of $1.6 billion, 14 Grammys and 30 MTV Video Music awards.","url":"https://www.news18.com/world/trump-bashes-obnoxious-jerk-bruce-springsteen-says-taylor-swift-no-longer-hot-9340684.html","image":"https://images.news18.com/ibnlive/uploads/2025/04/Untitled-design-2025-04-26T093341.701-2025-04-2da2367d080b2e4b7d83fc6717e1d7a4.jpg","video":null,"publish_date":"2025-05-17 02:39:55","author":"Mallika Soni,News18","authors":["Mallika Soni","News18"],"language":"en","category":"entertainment","source_country":"in","sentiment":-0.006},{"id":322176772,"title":"Biden White House Ripped After Robert Hur Audio Revealed: 'Scandal'","text":"Former President Joe Biden's administration was blasted on social media following a report from Axios featuring audio from Biden's interview with former special counsel Robert Hur, depicting the former president's memory lapses and prolonged pauses.Newsweek reached out to Biden's office via online form and the Democratic National Committee (DNC) via email Friday night for comment.Why It MattersThe interview was conducted in 2023, amid the special counsel's investigation into Biden's handling of classified documents. President Donald Trump was also under investigation for accusations of improper handling of classified documents after his first term.Ultimately, Hur recommended Biden not be prosecuted, calling the former president a \"sympathetic, well-meaning elderly man with a poor memory.\" Democrats and Republicans alike strongly reacted to Hur's findings, as some called his remarks out of line and others griped with his conclusion.The obtained audio comes at the end of a harsh week for the former president, as excerpts from CNN's Jake Tapper and Axios' Alex Thompson's new book Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again were published by multiple media outlets.Biden dropped out of the 2024 presidential race in late July, following a disastrous debate performance against then-Republican presidential nominee Trump. Biden repeatedly stared at Trump and made halting statements where he appeared to lose his train of thought. Biden later said he had \"a bad, bad night.\"Questions swirled about his mental acuity and possible decline as the White House and Vice President Kamala Harris fielded questions about his cognitive ability in the final months of his presidency.What To KnowIn the Axios report, Biden can be heard taking elongated pauses, stumbling on key dates like the death of his son Beau Biden, and not finishing his train of thought.A clock can also be heard in the background, marking every second of elapsing time between thoughts.The interviews were held over a two-day period, with Axios reporting that the former president sounded \"much more engaged and vigorous\" on day two.After the audio was made public, Republicans jumped to react to the news on social media.GOP Congressman James Comer of Kentucky said on X, formerly Twitter, on Friday that, \"Democrats told you the Biden Hur audio tapes didn't matter. Democrats told you Special Counsel Robert Hur was interfering in an election. Democrats told you over and over that Joe Biden was 'sharp.' The cover-up of Joe's mental decline is a scandal of historic proportions.\"The GOP Oversight Committee also reacted on X: \"When we subpoenaed the Hur audio tapes, Democrat Jamie Raskin claimed the 'format of the medium' doesn't matter. Reading 250 pages doesn't capture the mumbling, confusion, or long silences. The tape speaks for itself.\"Hur's transcript of the interviews was released in March 2024.Republican Congressman Andy Biggs of Arizona also said on X Friday, \"Joe Biden was a demented, feeble, old man during his presidency. Who was running the country?\"Steve Guest, Senator Ted Cruz's former communications adviser, reacted to the audio on X Friday, saying, \"Joe Biden's brain was pudding as president and his team covered it up.\"Guest continued, \"There are people with advanced dementia in nursing homes whose nurses can hold more coherent conversations with them than Robert Hur had with Joe Biden.\"In Biden's 2024 annual physical, his doctor Kevin O'Connor said that Biden was \"a healthy, active, robust 81-year-old male, who remains fit to successfully execute the duties of the Presidency.\"Axios also reports that during the interview, Biden went off on tangents about riding in a Corvette with Jay Leno, the type of wood and moldings that were in renovated rooms of his house and how former President Barack Obama advised him not to run for office in 2016.In the audio, Biden's attorney Bob Bauer can also be heard coming to his defense, saying after a question that \"I just really would like to avoid, for the purpose of a clean record, getting into speculative areas.\"What People Are SayingBiden spokesperson Kelly Scully, to Axios: \"The transcripts were released by the Biden administration more than a year ago. The audio does nothing but confirm what is already public.\"Former Obama adviser David Axelrod posted to X on Thursday: \"A lot of folks now are acknowledging what was obvious then: A guy, who was already showing frailties and would have been closer to 90 than 80 by the end of his second term should not have run for the hardest job on the planet. Never was going to end well.\"Axelrod continued, \"Next to being President, the pressure of running for it is almost as hard. The idea that an 81-year-old man, already limited, could handle both--and then serve another four years--always was nuts. And the people closest to him did him no favor by not telling him the truth.\"What Happens NextIt is unclear whom the Democrats will rally behind as their next leader amid the party's uncertain direction at the moment.","summary":"The Biden administration is taking more heat after a turbulent week filled with questions about the former president's cognitive abilities.","url":"https://www.newsweek.com/biden-white-house-ripped-after-robert-hur-audio-revealed-scandal-2073560","image":"https://d.newsweek.com/en/full/2646566/robert-hur.jpg","video":null,"publish_date":"2025-05-17 02:19:37","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"us","sentiment":-0.044},{"id":322188328,"title":"Trump calls Springsteen a 'dried out prune', says Taylor Swift 'no longer hot'","text":"US President Donald Trump has lashed out at two music giants, declaring Bruce Springsteen a \"dried out prune\" and Taylor Swift \"no longer HOT\".\n\nReturning from a whirlwind Middle East diplomatic trip on Friday, local time, Mr Trump took to his social media platform Truth Social to feud with Springsteen.\n\nSpringsteen, known as The Boss, described the Trump administration as \"corrupt, incompetent and treasonous\" during a concert in Manchester this week — the first show in his current European tour.\n\n\"They're rolling back historic civil rights legislation that led to a more just and moral society,\" Springsteen said.\n\nMr Trump hit back on Truth Social, calling Springsteen \"highly overrated\".\n\n\"Never liked him, never liked his music, or his Radical Left Politics,\" he wrote.\n\n\"And, importantly, he's not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL.\"\n\nThe US president continued by calling Springsteen \"dumb as a rock\".\n\n\"This dried out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country,\" he said.\n\nTrump takes jab at Swift\n\nMr Trump also took aim at Swift on his social media platform.\n\n\"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\" he said in the post.\n\nLast September, the US president posted \"I HATE TAYLOR SWIFT\" after the singer endorsed Democratic nominee Kamala Harris for president.\n\nIn February this year, he celebrated on Truth Social when Swift was booed at the Super Bowl.\n\n\"The only one that had a tougher night than the Kansas City Chiefs was Taylor Swift,\" he wrote.\n\nSpringsteen and Swift support Democrats \n\nSpringsteen, 75, has long been an outspoken supporter of Democratic politics.\n\nHe campaigned for former US president Barack Obama and backed then-Democratic candidate Hillary Clinton in the 2016 election.\n\nLast year, Springsteen appeared at a Democratic campaign rally in Philadelphia in support of the party's presidential candidate, Ms Harris.\n\nSwift, widely considered the world's most influential pop star, has also spoken out in support of Democratic politicians since 2018.\n\nShe endorsed Kamala Harris prior to the 2024 US presidential election, after AI material depicting her and her fans endorsing Mr Trump circulated online.\n\nMr Trump shared the deepfakes images and added \"I accept!\".\n\nSwift also threw her support behind Mr Biden in 2020, directly addressing Mr Trump in a social media post saying: \"We will vote you out in November.\"","summary":"US President Donald Trump takes aim at US music giants Bruce Springsteen and Taylor Swift in blistering posts on social media.","url":"https://www.abc.net.au/news/2025-05-17/trump-takes-aim-at-taylor-swift-and-bruce-springsteen/105304746","image":"https://live-production.wcms.abc-cdn.net.au/eadc7ee5cf5a7ec93eb67064be2692b1?impolicy=wcms_crop_resize&cropH=1337&cropW=2376&xPos=0&yPos=124&width=862&height=485","video":null,"publish_date":"2025-05-17 02:03:21","author":"Charmayne Allison","authors":["Charmayne Allison"],"language":"en","source_country":"AU","sentiment":-0.13},{"id":322246112,"title":"Biden audio release pressures Democrats who would rather talk about Trump","text":"PHOENIX (AP) — Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party.\n\nAudio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about Biden’s health back in the spotlight. Months after former President Kamala Harris lost to President Donald Trump, a new book alleges that White House aides covered up Biden’s physical and mental decline.\n\nSeveral potential Democratic contenders for the 2028 nomination have been asked in recent days whether they believe Biden was declining in office or whether he should have sought reelection before a disastrous debate performance led to his withdrawal.\n\nMany Democrats would prefer to focus on Trump’s second term. Trump has done his best to prevent that — mentioning Biden’s name an average of six times per day during his first 100 days in office, according to an NBC News analysis — and Republicans have followed his lead, betting that voters frustrated by Trump’s policy moves will still prefer him over memories of an unpopular presidency.\n\nIn the race for Virginia governor, one of this year’s highest-profile contests, Republican Winsome Earle-Sears is running a pair of digital ads tying Democrat Abigail Spanberger to Biden, with images of the two hugging and the former president calling her a friend.\n\n“The stench of Joe Biden still lingers on the Democratic Party,” Democratic strategist Sawyer Hackett said. “We have to do the hard work of fixing that, and I think that includes telling the truth, frankly, about when we were wrong.”\n\nDemocratic Sen. Chris Murphy of Connecticut told Politico this week that “there’s no doubt” that Biden, now 82, experienced cognitive decline as president.\n\nPete Buttigieg, the former transportation secretary, wasn’t nearly as blunt but still stopped short of defending Biden’s decision to run. He responded “maybe” when asked Tuesday whether the Democratic Party would have been better off if Biden hadn’t tried to run for a second term.\n\n“Right now, with the advantage of hindsight, I think most people would agree that that’s the case,” Buttigieg told reporters during a stop in Iowa.\n\nIllinois Gov. JB Pritzker said he didn’t see signs of mental or physical decline in his meetings with Biden.\n\n“I saw him a few times,” he told CNN this week. “I certainly went to the White House whenever there was an opportunity for me to make the case for something for people in my state. And I never had the experience of anything other than a guy who brought to the table a lot of good ideas about how to solve problems.”\n\nThe book “Original Sin,” by journalists Jake Tapper of CNN and Alex Thompson of Axios, revives a core controversy of Biden’s presidency: his decision to run for a second term despite voters, including Democrats, telling pollsters that he should not run again. Biden would have been 86 at the end of a second term had he won in November.\n\nA spokesperson for Biden did not respond to a request for comment.\n\n“We continue to await anything that shows where Joe Biden had to make a presidential decision or where national security was threatened or where he was unable to do his job,” the spokesperson has told many media outlets in response to the book.\n\nLate Friday, Axios published portions from audio recordings of Biden’s six hours of interviews with prosecutors investigating his handling of classified documents after his term as vice president ended in 2017.\n\nThe Biden administration had already released transcripts of the interviews, but the recordings shed light on special counsel Robert Hur’s characterization of Biden as “a sympathetic, well-meaning, elderly man with a poor memory” and appeared to validate his claim that the then-president struggled to recall key dates, including the year his son Beau died of cancer in 2015.\n\nBiden and his aides pushed back aggressively against Hur’s report, which they characterized as a partisan hit. Biden was at that time — early 2024 — still planning to run for a second term and fending off accusations that he was too old for another four years in the job.\n\nThe recordings released by Axios include Biden’s discussion of his son’s death. His responses to some of the prosecutors’ questions are punctuated by long pauses, and his lawyers at times stepped in to help him recall dates and timelines.\n\nBefore he dropped his reelection bid last summer, Biden faced widespread doubts within his own party, even as Democratic leaders dismissed both a series of verbal flubs and Republican allegations about his declining acuity.\n\nIn January 2022, just a year into Biden’s first term, an AP-NORC Center for Public Affairs Research poll found that only 48% of Democrats wanted him to seek reelection. That fell to 37% of Democrats in an AP-NORC poll conducted in February 2023. Three-quarters of Americans — and 69% of Democrats — said in August 2023 that they believed Biden was too old to serve as president for another four-year term.\n\nAnd shortly after his debate flop, nearly two-thirds of Democrats said Biden should withdraw from the race.\n\nBiden and former first lady Jill Biden appeared on ABC’s “The View” in a preemptive defense of his health and decision-making before the first excerpts of “Original Sin” were published.\n\nHe said he’s responsible for Trump’s victory but attributed Harris’ loss, at least in part, to sexism and racism. He maintained that he would have won had he remained the Democratic nominee. Both Bidens rejected concerns about his cognitive decline.\n\nPatricia McEnerney, a 74-year-old Democrat in Goodyear, Arizona, said Biden should not have tried to run again.\n\n“I think it’s sad the way it ended,” she said.\n\nShe compared him to Douglas MacArthur, the World War II and Korean War general famously dismissed by President Harry Truman.\n\n“I think he needs to stop giving interviews. I think that would help,” McEnerney said. “Like MacArthur said, generals just fade away.”\n\nJanet Stumps, a 66-year-old Democrat also from Goodyear, a Phoenix suburb, had a different view.\n\n“I don’t think it’s going to hurt the Democrats,” Stumps said. “I feel badly that he feels he has to defend himself. I don’t think he has to. Everybody ages. And the fact that he did what he did at his age, I think he should be commended for it.”\n\nHackett, the Democratic strategist, predicted Biden won’t be a major factor in the 2026 midterms or the 2028 presidential primaries. But he said Democrats who want voters to trust them would be well-served “by telling the truth about the mistakes that our party made in the run-up to 2024.”\n\n“Those mistakes were largely driven by Joe Biden, and I think any Democrat not willing to say that is not really prepared to face the voters, who want the truth and they want authenticity,” Hackett said.\n\nRick Wilson, a former GOP strategist who co-founded the anti-Trump group the Lincoln Project, said Republicans want to talk about Biden to avoid defending Trump. But he said the strategy is folly.\n\nBesides “political nerds,” he said, “no one else cares.”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"PHOENIX (AP) — Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for...","url":"https://wsvn.com/news/politics/biden-audio-release-pressures-democrats-who-would-rather-talk-about-trump/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/01/250104_Biden_Congressional_Medal_of_Honor_speech.png","video":null,"publish_date":"2025-05-17 01:52:52","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.493},{"id":322175434,"title":"'Obnoxious Jerk', 'No Longer Hot': Trump Insults Bruce Springsteen, Taylor Swift","text":"President Donald Trump used his down time on Air Force One Friday to insult \"obnoxious JERK\" Bruce Springsteen and declare Taylor Swift \"no longer HOT\" in social media blasts against the music giants.Trump -- returning from a whirlwind Middle East diplomatic trip -- took to his Truth Social platform to feud with Springsteen, who this week told a British concert audience that his homeland is now ruled by a \"corrupt, incompetent and treasonous administration.\"In return, the 78-year-old Republican said the legendary rocker, nicknamed \"the Boss,\" is \"Highly Overrated.\"\"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he's not a talented guy - Just a pushy, obnoxious JERK,\" Trump wrote in the lengthy tirade.\"This dried out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that's just \"standard fare.\" Then we'll all see how it goes for him!\"Springsteen is an outspoken liberal critic of Trump and campaigned for Democratic president Joe Biden's ultimately abandoned reelection run last year.While in Manchester on his \"Land of Hope & Dreams\" tour Wednesday, he told fans that \"my home, the America I love, the America I've written about, that has been a beacon of hope and liberty for 250 years\" is in danger.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");\"Raise your voices against authoritarianism and let freedom ring,\" Springsteen said.Trump also had strong words for Swift, who endorsed Biden's replacement as the Democratic candidate in 2024, Kamala Harris.In a separate post, which provided no context, the US president said: \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\"He appeared to be referencing a post in September last year when he declared \"I HATE TAYLOR SWIFT!\"Swift, 35, is the wealthiest female musician on the planet, with an estimated personal wealth of $1.6 billion, 14 Grammys and 30 MTV Video Music awards.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"President Donald Trump used his down time on Air Force One to insult \"obnoxious JERK\" Bruce Springsteen and declare Taylor Swift \"no longer HOT\" in social media blasts against the music giants.","url":"https://www.ndtv.com/world-news/obnoxious-jerk-no-longer-hot-trump-insults-bruce-springsteen-taylor-swift-8434978","image":"https://c.ndtvimg.com/2025-05/qlcbrrbg_trump-taylor-bruce_625x300_17_May_25.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-05-17 01:50:25","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"in","sentiment":-0.101},{"id":322173508,"title":"Audio of Biden’s Special Counsel Interview Reveals Jarring Memory Lapses","text":"The long-sought-after audio of Joe Biden‘s 2023 interview with Special Counsel Robert Hur has finally arrived.\n\nIn the six-hour recording, extracts of which have been published by Axios, Biden repeatedly struggles to recall key dates, slurs his speech, and fumbles through long, uncomfortable silences. At one point, he fails to remember when his son Beau died. In another, he needs help identifying the year Trump was elected. The ticking of a grandfather clock in the White House’s Map Room provides an eerie metronome to Biden’s stumbles. \n\n“I don’t recall,” Biden says when questioned why he kept documents after his term as vice president. “Did I have this? Was this in my possession, this memo?”\n\nThe interview, part of Hur’s investigation into Biden’s improper retention of classified documents, had already provoked alarm for Hur’s claim that a jury would likely view the then-president as “a sympathetic, well-meaning, elderly man with a poor memory.” While the transcript of the interview has been out for more than a year, now the public can judge that for themselves. \n\nDespite Biden’s defenders insisting he was sharp and engaged, the audio released on Friday night paints a confronting picture. While Biden occasionally cracked jokes and rambled comically about Jay Leno and the Gutenberg printing press, he often veered off-topic and couldn’t clearly explain how classified files ended up in his home. \n\n“Am I making any sense to you?” Biden asked at one point during the discussion.\n\nDemocrats, including then-Vice President Kamala Harris, had previously attacked Hur’s characterization of Biden’s age and mental state as “gratuitous” and politically motivated. However, the tape’s awkward pauses and meandering answers are already stirring anxiety in the party, especially with the upcoming release of Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again, a new book by CNN’s Jake Tapper and Axios’ Alex Thompson. \n\n“I’m a young man, so it’s not a problem,” Biden joked during the interview.\n\nThe White House had fought the release of the audio, citing concerns over precedent and partisan misuse. But Republicans and conservative groups like Judicial Watch have argued that the public deserves to hear it. Now they can.","summary":"Photo Illustration by Victoria Sunday/The Daily Beast/Getty ImagesThe long-sought-after audio of Joe Biden‘s 2023 interview with Special Counsel Robert Hur has finally arrived.\n\nIn the six-hour recording, extracts of which have been published by Axios, Biden repeatedly struggles to recall key dates, slurs his speech, and fumbles through long, uncomfortable silences. At one point, he fails to remember when his son Beau died. In another, he needs help identifying the year Trump was elected. The ticking of a grandfather clock in the White House’s Map Room provides an eerie metronome to Biden’s stumbles. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/shocking-audio-of-bidens-special-counsel-interview-reveals-memory-lapses-and-stumbles/","image":"https://www.thedailybeast.com/resizer/v2/YHDY5FSTFVB47BAARWWIDUVCFY.jpg?smart=true&auth=badf58a7a90bd24e150c0619ae7b67473d410af162711cd09a5ba902492bc22e&width=1440&height=1080","video":null,"publish_date":"2025-05-17 01:19:26","author":"Jack Revell","authors":["Jack Revell"],"language":"en","source_country":"us","sentiment":-0.345},{"id":322165962,"title":"Leaked audio reveals extent of Biden’s struggle to remember key details in 2023 interview, including when son died","text":"Audio of President Joe Biden’s 2023 interview with Special Counsel Robert Hur concerning the improper possession of classified documents has been released more than a year after his administration released transcripts.\n\nThe recordings, published by Axios, reveal the extent to which the 46th president, then 80, struggled to remember key details and dates, was prompted by his lawyers, and spoke in a halting, whispering voice, punctuated by long silences.\n\nThey shed light on why the White House refused to release the audio while Biden was still in office amid questions regarding his mental acuity, and also perhaps why Hur’s conclusion was that jurors in any trial that might arise over his possession of the documents would have viewed him as a “sympathetic, well-meaning, elderly man with a poor memory.”\n\nAt the time, the White House hit back at Hur’s assessment of the president, insisting he was “sharp” and that any attacks on Biden were politically motivated — yet the special counsel comes across as respectful, and the tone of the interview is friendly and mostly appears relaxed.\n\nThe release of the audio comes as the Trump administration was reportedly weighing up releasing the recordings. It also comes ahead of the publication of a new book about a White House and presidential campaign hiding the decline of the president as he ran for another term in office. Original Sin by Axios’ Alex Thompson and CNN’s Jake Tapper will be released on Tuesday.\n\nDuring the two three-hour sessions with Hur and his co-counsel Marc Kricknaum, Biden’s attorneys had to remind him of the year his son Beau died and the year that Donald Trump was elected president for the first time — 2015 and 2016, respectively. \n\nBiden spokesperson Kelly Scully told Axios: “The transcripts were released by the Biden administration more than a year ago. The audio does nothing but confirm what is already public.”\n\nWhere the recordings do add a new dimension to what is already known from the transcripts is the length of pauses and the slowly unfolding nature of some answers.\n\nFurther emphasizing these silent moments from the president is the sound of a ticking clock in the background.\n\nNevertheless, Biden remains engaged despite memory lapses. At times, Axios notes, he cracks jokes and makes humorous asides, and throughout, he “sounded more like a nostalgic, grandfatherly storyteller than a potential defendant who could be accused of hoarding secret papers.”\n\nPerhaps the upshot of the basis of the interview was that he had little recollection as to how or why he came to have classified documents in his possession after his two terms as vice president to President Barack Obama.\n\nAt one point, his attorney, Bob Bauer, warns about getting into speculation as to how the documents may have ended up where they did, emphasizing that the president does not recall specific details. \n\nThe timing of the interviews is also noteworthy. The first session took place on October 8, 2023, the day after Hamas attacked Israel from Gaza. In the aftermath of an international crisis that would go on to spark the conflict that continues to this day, Biden is slow, forgetful, and often veers off topic.\n\nHowever, during the second session, the following day, October 9, the president sounds more engaged and vigorous, Axios notes.\n\nWhile Hur’s report did not recommend moving ahead with a prosecution and attempting to persuade a jury of Biden’s guilt in purposefully taking classified materials.\n\n“It would be difficult to convince a jury that they should convict him — by then a former president, well into his 80s — of a serious felony that requires a mental state of willfulness,” he had concluded.\n\nThe Biden camp blasted comments about the president’s age as “gratuitous, inaccurate and inappropriate,” while Donald Trump’s super PAC said that if Biden wasn’t fit enough for trial, he wasn’t fit enough to be president.\n\nThompson and Tapper’s upcoming book is a collection of their reporting on the cover-up around Biden’s mental and physical decline. The book’s excerpts are already causing a ruckus, as they detail startling instances of Biden’s gaps in mental acuity that were reportedly hidden from the public through 2024.\n\nBiden, whom aides reportedly considered putting in a wheelchair at points, reportedly did not recognize Hollywood megastar George Clooney at an event the president had flown in to Los Angeles specifically for Clooney to host on his behalf. Other excerpts claimed he forgot the names of longtime aides, including that of his national security adviser, Jake Sullivan.\n\nDemocrats are now struggling to respond to criticism of why it took so long for Biden to step aside in favor of Kamala Harris, and questions about how long any cover-up of the president’s decline had been going on.\n\nThe release of these audio recordings and the upcoming publication of Original Sin will likely completely swamp any continued denials from Biden defenders regarding the president’s mental fitness more than a year before the 2024 election.\n\nIt could be the break the Democratic Party needs to move forward and start winning back trust from the American people.\n\nWith additional reporting from John Bowden in Washington, D.C.","summary":"Recordings of then-president’s interview with special counsel Robert Hur regarding misplaced classified documents released more than one year after transcripts","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-interview-leaked-recording-special-counsel-b2752746.html","image":"https://static.independent.co.uk/2025/05/16/9/18/BRITAIN-UN-CLIMATE-COP26-kbvbqcx2.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/a98vGseh-4VHSaSK0.mp4","publish_date":"2025-05-17 00:48:21","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","source_country":"gb","sentiment":-0.132},{"id":322173744,"title":"Biden audio release pressures Democrats who would rather talk about Trump (World)","text":"PHOENIX (AP) — Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party.\n\nAudio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about Biden's health back in the spotlight. Months after former President Kamala Harris lost to President Donald Trump, a new book alleges that White House aides covered up Biden's physical and mental decline.\n\nSeveral potential Democratic contenders for the 2028 nomination have been asked in recent days whether they believe Biden was declining in office or whether he should have sought reelection before a disastrous debate performance led to his withdrawal.\n\nMany Democrats would prefer to focus on Trump's second term. Trump has done his best to prevent that — mentioning Biden's name an average of six times per day during his first 100 days in office, according to an NBC News analysis — and Republicans have followed his lead, betting that voters frustrated by Trump's policy moves will still prefer him over memories of an unpopular presidency.\n\nIn the race for Virginia governor, one of this year's highest-profile contests, Republican Winsome Earle-Sears is running a pair of digital ads tying Democrat Abigail Spanberger to Biden, with images of the two hugging and the former president calling her a friend.\n\n“The stench of Joe Biden still lingers on the Democratic Party,” Democratic strategist Sawyer Hackett said. “We have to do the hard work of fixing that, and I think that includes telling the truth, frankly, about when we were wrong.”\n\nDemocratic Sen. Chris Murphy of Connecticut told Politico this week that “there’s no doubt” that Biden, now 82, experienced cognitive decline as president.\n\nPete Buttigieg, the former transportation secretary, wasn’t nearly as blunt but still stopped short of defending Biden’s decision to run. He responded “maybe” when asked Tuesday whether the Democratic Party would have been better off if Biden hadn’t tried to run for a second term.\n\n“Right now, with the advantage of hindsight, I think most people would agree that that’s the case,” Buttigieg told reporters during a stop in Iowa.\n\nIllinois Gov. JB Pritzker said he didn't see signs of mental or physical decline in his meetings with Biden.\n\n“I saw him a few times,” he told CNN this week. “I certainly went to the White House whenever there was an opportunity for me to make the case for something for people in my state. And I never had the experience of anything other than a guy who brought to the table a lot of good ideas about how to solve problems.”\n\nThe book “Original Sin,” by journalists Jake Tapper of CNN and Alex Thompson of Axios, revives a core controversy of Biden’s presidency: his decision to run for a second term despite voters, including Democrats, telling pollsters that he should not run again. Biden would have been 86 at the end of a second term had he won in November.\n\nA spokesperson for Biden did not respond to a request for comment.\n\n“We continue to await anything that shows where Joe Biden had to make a presidential decision or where national security was threatened or where he was unable to do his job,” the spokesperson has told many media outlets in response to the book.\n\nLate Friday, Axios published portions from audio recordings of Biden's six hours of interviews with prosecutors investigating his handling of classified documents after his term as vice president ended in 2017.\n\nThe Biden administration had already released transcripts of the interviews, but the recordings shed light on special counsel Robert Hur's characterization of Biden as “a sympathetic, well-meaning, elderly man with a poor memory” and appeared to validate his claim that the then-president struggled to recall key dates, including the year his son Beau died of cancer in 2015.\n\nBiden and his aides pushed back aggressively against Hur's report, which they characterized as a partisan hit. Biden was at that time — early 2024 — still planning to run for a second term and fending off accusations that he was too old for another four years in the job.\n\nThe recordings released by Axios include Biden's discussion of his son's death. His responses to some of the prosecutors' questions are punctuated by long pauses, and his lawyers at times stepped in to help him recall dates and timelines.\n\nBefore he dropped his reelection bid last summer, Biden faced widespread doubts within his own party, even as Democratic leaders dismissed both a series of verbal flubs and Republican allegations about his declining acuity.\n\nIn January 2022, just a year into Biden’s first term, an AP-NORC Center for Public Affairs Research poll found that only 48% of Democrats wanted him to seek reelection. That fell to 37% of Democrats in an AP-NORC poll conducted in February 2023. Three-quarters of Americans — and 69% of Democrats — said in August 2023 that they believed Biden was too old to serve as president for another four-year term.\n\nAnd shortly after his debate flop, nearly two-thirds of Democrats said Biden should withdraw from the race.\n\nBiden and former first lady Jill Biden appeared on ABC’s “The View” in a preemptive defense of his health and decision-making before the first excerpts of “Original Sin” were published.\n\nHe said he’s responsible for Trump’s victory but attributed Harris’ loss, at least in part, to sexism and racism. He maintained that he would have won had he remained the Democratic nominee. Both Bidens rejected concerns about his cognitive decline.\n\nPatricia McEnerney, a 74-year-old Democrat in Goodyear, Arizona, said Biden should not have tried to run again.\n\n“I think it’s sad the way it ended,” she said.\n\nShe compared him to Douglas MacArthur, the World War II and Korean War general famously dismissed by President Harry Truman.\n\n“I think he needs to stop giving interviews. I think that would help,” McEnerney said. “Like MacArthur said, generals just fade away.”\n\nJanet Stumps, a 66-year-old Democrat also from Goodyear, a Phoenix suburb, had a different view.\n\n“I don’t think it’s going to hurt the Democrats,” Stumps said. “I feel badly that he feels he has to defend himself. I don’t think he has to. Everybody ages. And the fact that he did what he did at his age, I think he should be commended for it.”\n\nHackett, the Democratic strategist, predicted Biden won’t be a major factor in the 2026 midterms or the 2028 presidential primaries. But he said Democrats who want voters to trust them would be well-served “by telling the truth about the mistakes that our party made in the run-up to 2024.”\n\n“Those mistakes were largely driven by Joe Biden, and I think any Democrat not willing to say that is not really prepared to face the voters, who want the truth and they want authenticity,” Hackett said.\n\nRick Wilson, a former GOP strategist who co-founded the anti-Trump group the Lincoln Project, said Republicans want to talk about Biden to avoid defending Trump. But he said the strategy is folly.\n\nBesides “political nerds,” he said, “no one else cares.”","summary":"PHOENIX (AP) - Joe Biden's time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party. Audio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting q...","url":"https://www.castanet.net/news/World/550902/Biden-audio-release-pressures-Democrats-who-would-rather-talk-about-Trump","image":"https://www.castanet.net/content/2025/5/74d6c6c2cd89452b6f2481912c923c4c7526598e8b8b350396eedda9fc96361a_p4199070.jpg","video":null,"publish_date":"2025-05-17 00:44:00","author":"President Harry Truman,The Canadian Press","authors":["President Harry Truman","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.493}]}