{"offset":0,"number":50,"available":299,"news":[{"id":387294628,"title":"What to know about Rob Reiner and wife Michele’s deaths","text":"Advertisement 1This advertisement has not loaded yet, but your article continues below.\n\nFlowers rest on director Rob Reiner's star on the Hollywood Walk of Fame on December 15, 2025 in Los Angeles, California. Photo by Mario Tama /Getty ImagesArticle contentRob Reiner and his wife of 36 years, Michele Singer Reiner, were killed on Sunday afternoon in their Los Angeles home.Sign In or Create an Accountor View more offersArticle contentTheir shocking and tragic stabbing deaths impacted many in and away from Hollywood with celebrities peppering social media sites with tributes.Article contentWe apologize, but this video has failed to load.Try refreshing your browser, ortap here to see other videos from our team.We apologize, but this video has failed to load.Try refreshing your browser, ortap here to see other videos from our team.Article contentWhat happened and who found the bodies?Article contentParamedics responded to calls to the couple’s Brentwood home on Sunday, before detectives with the Los Angeles Police Department’s Robbery Homicide Division responded to an “apparent homicide” at the residence.Article contentArticle contentThe Reiners were reportedly found by their daughter, Romy, with sources telling TMZ that both Rob and Michele had lacerations consistent with stab wounds and that the couple’s throats were slit by a family member during a heated argument.Article contentWho’s the main suspect?Article contentSoon after news broke of the couple’s death, their son Nick Reiner was identified as a person of interest.Article contentThe 32-year-old screenwriter was taken into custody on an unknown felony charge for questioning before he was arrested.Article contentNick is being held at Parker Center Jail in downtown L.A. on $4-million bail for his parents’ murders, according to county jail records.Article contentHowever, the Los Angeles District Attorney’s Office has not yet filed criminal charges in the Reiners’ deaths, CNN reported.Article contentWho is Nick Reiner?Article contentNick Reiner co-wrote the 2015 film Being Charlie, which was inspired by his own experiences with drug addiction, rehab stints and homelessness.Article contentArticle contentThe movie was directed by his father, who at the time, said that working together was “the most satisfying experience I’ve ever had,” adding that it “brought us closer together.”Article contentRead More HUNTER: Double murder of Rob Reiner and wife again unmasks LA's dark side Rob Reiner praised alleged killer son Nick: 'It brought us closer together' Advertisement 1Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentEldest daughter Tracy Reiner breaks silenceArticle contentTracy Reiner, Rob Reiner’s eldest daughter from his first marriage to the late Penny Marshall, revealed that she is “in shock” over her father’s tragic death.Article contentThe actress — who appeared as the character Betty Spaghetti in A League of Their Own — was adopted by Rob during their 10-year marriage (from 1971-81).Article content“I came from the greatest family ever,” Tracy told NBC News. “I don’t know what to say. I’m in shock.”Article contentTracy’s comments come after the family released a statement following Rob and Michele’s deaths.Article content“It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner,” the family said in a statement late Sunday.Advertisement 1This advertisement has not loaded yet.Trending Braving winter cold, Jimmy John's lovers line up for free opening sandwich Local News Arson teams called in after fire destroys house in downtown Windsor Local News Advertisement 2Story continues belowThis advertisement has not loaded yet, but your article continues below. 'More than just a sheet of ice' — Windsor opens City Hall Square skating rink Local News Windsor police looking for man who stole $8,000 worth of electronics from mall Local News Windsor police now digitally tracking hundreds of high-risk offenders in real-time Local News \n\nAdvertisement 2AdvertisementThis advertisement has not loaded yet, but your article continues below.\n\nArticle content“We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.”Article contentCelebrities pay their respectsArticle contentThe couple were mourned by friends and fans alike, given how ingrained he was in the entertainment industry and how they both were passionate about their work outside of Hollywood.Article contentRob and Michele were passionate advocates for marriage equality and early childhood development, among many other causes.Article contentThey helped found the American Foundation for Equal Rights, which battled Prop 8, a proposed ban to same-sex marriage in California.Article contentIn the political world, former presidents Joe Biden and Barack Obama, former vice president Kamala Harris, Gov. Gavin Newsom and L.A. Mayor Karen Bass spoke about the “devastating” loss.Article contentCelebrities, including The Princess Bride star Cary Elwes, Stand By Me actor Jerry O’Connell along with James Woods, Ben Stiller, Roseanne Barr and George Wallace — and so many others — honoured the icon renowned for his prolific work.Article contentArticle contentMeanwhile, President Donald Trump offered up a political message after the Reiners’ deaths, suggesting the director’s death stemmed from “Trump Derangement Syndrome.”Article contentSally Struthers’ faded friendshipArticle contentHis All in the Family on-screen wife Sally Struthers has not yet spoken publicly about the Reiners’ deaths, though earlier this year, she spoke highly of her “Meatball” in an interview with Celebrity Drop.Article content“Rob Reiner was light years ahead of everyone with what to do,” she said, adding he was a “very smart guy” who was already plotting out his career following fictional life with the Bunkers.Article contentWhile some confusion over their on-screen relationship led to their off-screen friendship to fade over the years, Struthers admitted she wasn’t upset that they didn’t remain close.Article content“Friendships can change, not just in show business,” she said at the time.Article content“People can ghost you and you don’t know why. Just things change. They turn on a dime and you have to just let it go.”Article contentRECOMMENDED VIDEOArticle contentWe apologize, but this video has failed to load.Try refreshing your browser, ortap here to see other videos from our team.Article content\n\nFeatured Local Savings","url":"https://windsorstar.com/entertainment/celebrity/what-to-know-about-rob-reiner-and-wife-micheles-stabbing-deaths-so-far","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/12/GettyImages-2252073057-e1765826372874.jpg","video":null,"publish_date":"2025-12-15 22:35:25","author":"Denette Wilford","authors":["Denette Wilford"],"language":"en","source_country":"ca","sentiment":0.099},{"id":387275340,"title":"The Guardian view on combating Europe’s national populists: protect the less well-off from the winds of change | Editorial","text":"More than a year after the election that handed Donald Trump a decisive comeback victory, the Democratic party has still not released its postmortem analysis. But last week, an influential progressive lobby group published its own. Kamala Harris’s campaign, its authors argued, failed to connect with core constituencies because it did not focus enough on addressing basic economic anxieties. By prioritising the menace to democracy that Maga authoritarianism represented, progressives neglected the bread-and-butter issues that were uppermost in many people’s minds.\n\nAs the EU braces for a tumultuous period of politics between now and the end of the decade, that is a lesson that needs to be fully absorbed in Brussels, Paris and Berlin. The White House, as its recently published national security strategy makes clear, is hopeful that “patriotic” parties in Europe will soon replicate Mr Trump’s success. In the EU’s Franco-German engine room, Marine Le Pen’s National Rally (RN) and Alternative für Deutschland (AfD) lead the polls, backed by large swaths of blue-collar voters. But among mainstream leaders and parties, it is hard to discern a response that is adequate to troubling times.\n\nThe challenges Europe faces are expensive and era-defining. They include the war in Ukraine, maintaining the momentum of the green transition, addressing demographic change and developing economies that are less vulnerable to bullying by Mr Trump and China. According to the Brussels-based Breugel thinktank, the new age of geopolitical insecurity could require an additional €250bn in annual EU defence spending. Mario Draghi’s report last year on European economic competitiveness demanded massive investment in public goods and infrastructure, to be partly funded by jointly held EU debt.\n\nSuch a fiscal paradigm shift would boost growth figures that have flatlined for years. But at both the pan-European and national levels, there continues to be a lack of boldness when it comes to revenue raising. The EU’s so-called “frugal” nations oppose the idea of collective borrowing, and Brussels’ budget proposals for the next seven years are deeply unambitious. In France, the idea of a wealth tax on the super-rich is overwhelmingly popular with voters. But Emmanuel Macron’s beleaguered centrist government – though desperate to cut its budget deficit – refuses to contemplate such a move.\n\nThe reality is that in the absence of such measures, the less well-off will pay the price of financial adjustment through austerity budgets and greater inequality. Bitter recent disputes over pension cutbacks in both France and Germany testify to a developing struggle over the future of the European social model – a phenomenon that the RN and the AfD have happily exploited to promote a politics of welfare chauvinism. Ms Le Pen’s party, for example, has opposed moves to raise the retirement age and has said that it would target any benefit cuts at non-French nationals.\n\nIn the US, Mr Trump’s pledges to protect blue‑collar interests were deeply disingenuous, as subsequent Medicaid cuts and tax breaks for the wealthy underlined. But in the absence of a convincing progressive counteroffer from the Harris campaign, they worked on the campaign trail. Without a fundamental change in economic approach, social contracts across the continent risk being ripped up. Governments must avoid handing this political gift to the Trumpian forces already on the march in Europe.","summary":"As EU countries face multiple challenges in a new era, they must fight to preserve the continent’s social model. That means a new economic approach\n\nMore than a year after the election that handed Donald Trump a decisive comeback victory, the Democratic party has still not released its postmortem analysis. But last week, an influential progressive lobby group published its own. Kamala Harris’s campaign, its authors argued, failed to connect with core constituencies because it did not focus enough on addressing basic economic anxieties. By prioritising the menace to democracy that Maga authoritarianism represented, progressives neglected the bread-and-butter issues that were uppermost in many people’s minds.\n\nAs the EU braces for a tumultuous period of politics between now and the end of the decade, that is a lesson that needs to be fully absorbed in Brussels, Paris and Berlin. The White House, as its recently published national security strategy makes clear, is hopeful that “patriotic” parties in Europe will ","url":"https://www.theguardian.com/commentisfree/2025/dec/15/the-guardian-view-on-combating-europes-national-populists-protect-the-less-well-off-from-the-winds-of-change","image":"https://i.guim.co.uk/img/media/87b071d219ec88cddcced368d720e6820d5ed72b/0_0_1941_1552/master/1941.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2","video":null,"publish_date":"2025-12-15 19:23:19","author":"Editorial","authors":["Editorial"],"language":"en","category":"politics","source_country":"gb","sentiment":0.005},{"id":387269352,"title":"Hollywood director, wife found dead in US home, son arrested","text":"Police took Rob Reiner’s son into custody after the Hollywood director of hits including “When Harry Met Sally” and his wife were found dead in their Los Angeles home, US media reported Monday.\n\nNetworks CBS and ABC said Nick Reiner was arrested, and the Los Angeles Times reported he was booked into the Los Angeles County jail on suspicion of murder, citing jail records.\n\nLos Angeles deputy police chief Alan Hamilton had said earlier they were seeking to interview “every family member” of the 78-year-old actor-director and his wife, Michele Singer Reiner.\n\nThe bodies were discovered Sunday and police said they were treating the case as an “apparent homicide.”\n\nAs tributes poured in for Reiner, Donald Trump unleashed a crude broadside on the Hollywood icon, appearing to blame the deaths on the director’s “raging” criticism of the US president.\n\nSeveral US news media cited police sources as saying the couple were stabbed, while celebrity news website TMZ, which first broke the story, reported that their throats had been cut by a family member during an argument.\n\nReiner directed classic films including 1984’s rock music mockumentary “This is Spinal Tap,” fantasy gem “The Princess Bride” from 1987, and the 1992 courtroom drama “A Few Good Men.”\n\nHis films spanned everything from laugh-out-loud comedy to searing drama and earned him a global following.\n\nReiner was politically active and an outspoken supporter of progressive causes — potentially a reason for the extraordinary statement by Trump on Monday less than a day after the killings.\n\nWhile movie fans around the world grieved, Trump claimed Reiner died “reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME.”\n\n“He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness,” the president posted.\n\n– A beloved director –\n\nDemocratic politicians and Hollywood figures expressed shock over the deaths. \n\nFormer US vice president Kamala Harris was friends with the couple and said on X she was “devastated to learn of their passing,” while former president Barack Obama said he and his wife Michelle were “heartbroken.”\n\nReiner gave television and movie viewers “some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of people,” Obama said on X.\n\nMovie heavyweight John Cusack said he was “at a loss for any words that make sense” about the deaths.\n\nHorror and thriller writer Stephen King, whose novella “The Body” was the basis for Reiner’s 1986 coming-of-age classic “Stand By Me,” lauded a “wonderful friend.”\n\nReiner rose to acting fame as the oafish son-in-law Michael “Meathead” Stivic on groundbreaking 1970s sitcom “All in the Family,” before transitioning to directing. Even as a force behind the camera, he often appeared in cameo roles in his own films.\n\nHe directed the 1989 romantic comedy “When Harry Met Sally,” starring Billy Crystal and Meg Ryan, and famously cast his real-life mother Estelle Reiner to utter the line “I’ll have what she’s having” after Ryan’s classic fake orgasm scene in Katz’s Delicatessen.\n\nHis 1992 thriller “A Few Good Men,” starring Hollywood heavyweights Tom Cruise and Jack Nicholson, earned an Oscar nomination for Best Picture.\n\nReiner backed efforts to secure equal marriage rights for LGBTQ people and create California’s First 5 program, which provides child development programs funded by taxes on tobacco products.\n\nHe also helped fundraise for Democratic presidential candidates including Hillary Clinton.\n\nHe was the son of legendary comedian Carl Reiner, who won 11 Emmy Awards for his television performances and wrote screenplays with movie greats Mel Brooks and Neil Simon.","summary":"Hollywood director Rob Reiner and his wife were found dead in their Los Angeles home. Police have arrested their son in connection with the homicide.\n\nRead More: https://punchng.com/hollywood-director-wife-found-dead-in-us-home-son-arrested/","url":"https://punchng.com/hollywood-director-wife-found-dead-in-us-home-son-arrested/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/01005424/USA-flag.jpg","video":null,"publish_date":"2025-12-15 18:57:16","author":"Agency Report,Punch Newspapers","authors":["Agency Report","Punch Newspapers"],"language":"en","source_country":"ng","sentiment":0.147},{"id":387266680,"title":"Ruben Gallego se perfila como figura demócrata clave para captar voto hispano","text":"Por ADRIANA GÓMEZ LICÓN\n\nMIAMI (AP) — En una cálida mañana de domingo en Miami, el congresista Ruben Gallego se bajó de un auto y se acercó a los feligreses que salían de una iglesia bajo las palmeras para repartir volantes en este barrio dominicano. Gallego dejó atrás a algunos de sus colaboradores al buscar apoyo para una compañera demócrata que se postulaba a la alcaldía de la ciudad de mayoría hispana.\n\n“Mucho gusto”, dijo a los feligreses. “Soy Ruben Gallego, de Arizona”, dijo al presentarse sin mencionar que es senador federal.\n\nEl demócrata de Arizona se perfila como una figura crucial para un partido que busca desesperadamente recuperar el apoyo latino que se desvaneció en 2024 con la elección del presidente Donald Trump. Sus viajes en otoño incluyeron Nueva Jersey, Virginia y Florida, donde hizo campaña por los demócratas que posteriormente ganaron sus elecciones. Los estrategas dicen que Gallego demuestra su fuerza como estrella emergente del partido, a la vez que sienta las bases para una candidatura presidencial en 2028, a pesar de no ser tan conocido como Gavin Newsom, el gobernador de California, o Alexandria Ocasio-Cortez, legisladora federal.\n\nEs un rol que se cree que Gallego mantendrá el próximo año, cuando los demócratas esperan poner fin al control republicano en el Congreso y contrarrestar la agenda de Trump.\n\n“Ruben Gallego va a ser nuestra arma secreta, no tan secreta”, dijo Maria Cardona, una operadora demócrata de larga trayectoria y miembro del Comité Nacional Demócrata.\n\nUna figura muy solicitada\n\nGallego se encuentra entre los demócratas nombrados como posibles contendientes para 2028 que tuvieron la agenda de viajes más apretada en 2025. Hizo campaña por las candidatas demócratas en las contiendas para el gobierno estatal de Nueva Jersey y Virginia, y para la alcaldía de Miami.\n\n“Ruben les brinda una validación instantánea, no sólo porque su apellido es Gallego”, dijo Chuck Rocha, quien movilizó a los latinos en la candidatura presidencial del senador Bernie Sanders, en 2020, y la de Gallego, en 2024. “Ha sacrificado su vida por su país, creció en un hogar de inmigrantes sin recursos, y ahora es senador federal. Ese es el tipo de persona que quieres a tu lado hablando con los latinos sobre por qué deberían votar por esta mujer blanca”.\n\nEn las elecciones presidenciales de 2024, Trump logró avances en zonas predominantemente puertorriqueñas del este de Pensilvania; transformó el valle del Río Grande, en el sur de Texas; y mejoró sus cifras a lo largo del corredor de la carretera Interestatal 4 de Florida. Lo hizo al centrarse con fuerza en la economía y la seguridad fronteriza.\n\nNo obstante, los resultados de las elecciones recientes han dado indicios de que grupos clave de votantes —incluidos los hispanos—, se alejan de los republicanos. Y en Miami, Eileen Higgins se convirtió en la primera persona demócrata en ser elegida para la alcaldía de la ciudad en casi 30 años.\n\n“Vamos a lugares donde hay una gran población latina”, dijo Gallego a The Associated Press en Miami. “Obviamente, se inclinaron demasiado por Trump la última vez, en nuestra opinión, y queremos hablar con los demócratas, y queremos hablar con los latinos y queremos hablar con los candidatos sobre cómo volver a tener a esa población en nuestra esquina”.\n\nEl propio Gallego superó a la vicepresidenta Kamala Harris en 2024, cuando ganó por más de 2 puntos un escaño en el Senado por Arizona y Trump se alzó con el triunfo en el estado por casi 6 puntos. Y reconoce el mérito del presidente republicano por sus medidas de seguridad fronteriza y, en ocasiones, elogia el estilo directo de Trump de no darle demasiadas vueltas a las propuestas económicas al elaborar su mensaje populista con ideas como “sin impuestos a las propinas”.\n\n“Necesitamos que nos identifiquen como alguien que apoya a la clase trabajadora”, expresó Gallego en un evento reciente.\n\nCómo la asequibilidad es personal\n\nGallego creció en la pobreza en Evergreen Park, un suburbio del área metropolitana de Chicago, y frecuentaba la zona de Little Village, un barrio predominantemente mexicano en el sudoeste de la ciudad. Fue criado por una madre soltera luego que su padre abandonara a la familia y fuera encarcelado por narcotráfico. Gallego trabajó en varios empleos para ayudar a pagar las facturas cuando aún estaba en la preparatoria. Fue aceptado en la Universidad de Harvard, se unió a la infantería de Marina y combatió en Irak con una unidad que sufrió numerosas bajas.\n\n“Todos los demócratas hablan ahora de asequibilidad, asequibilidad, asequibilidad”, dijo Jesse Lehrich, estratega demócrata. “¿Pero cuántos de ellos saben realmente lo que se siente no saber de dónde saldrá el próximo cheque para el alquiler? ¿O no saber cómo van a pagar los comestibles esta semana?”.\n\nLehrich, quien sigue de cerca los viajes y las apariciones en los medios de los contendientes para las elecciones de 2028, agregó que no hay muchos demócratas de alto nivel que hablen como personas comunes, y agregó que, en contraste, Gallego puede “carecer de modales pulidos”.\n\nAl senador, quien anteriormente sirvió en la Cámara de Representantes de Estados Unidos, le gusta alardear de que no escuchó a la clase dirigente de Washington cuando decidió realizar fiestas para ver peleas de box y organizó un rodeo y una exhibición de autos lowrider —clásicos de la cultura chicana—, con lo que desestimó las preocupaciones de que eso será percibido como condescendiente con los partidarios hispanos.\n\nNo da la impresión de ser tan refinado como otros —como Josh Shapiro, el gobernador de Pensilvania, o Pete Buttigieg, exsecretario de Transporte—, pero Lehrich opina que eso podría beneficiar a Gallego porque la gente anhela lo directo.\n\n“Como que se siente que él es perfecto para este momento”, añadió Lehrich.\n\nUn latino en el Partido Republicano\n\nAlgunos estrategas y comentaristas afirman que el Partido Demócrata no ha hecho un buen trabajo a la hora de impulsar a candidatos hispanos a nivel nacional. Les preocupa que los republicanos apoyen a otro exsenador latino, Marco Rubio, el actual secretario de Estado, quien se postuló a la presidencia en 2016 y a quien Trump menciona con frecuencia cuando habla de 2028.\n\nXochitl Hinojosa, comentarista política, dijo que ve la fortaleza de Gallego no sólo en lo atractivo que resulta para los votantes latinos, sino también en un electorado más amplio en áreas en disputa, y enfatiza lo difícil que es para un candidato cruzar la meta cuando el candidato presidencial no lo logra en ese estado.\n\n“Creo que el haber ganado un escaño muy difícil lo ha catapultado a la cima”, dijo Hinojosa. “Los demócratas deben reflexionar que debemos pensar en los latinos si los republicanos tienen a un latino en su papeleta electoral y los demócratas no”.\n\nAl preguntarle sobre una posible candidatura presidencial para 2028, Gallego indicó que es demasiado pronto para responder.\n\n“Pienso en que tengo tres hijos. Y tengo seis años en el Senado”, dilucidó. “Nos vamos a centrar en eso y estamos aquí para ayudar a los demócratas de todo el país. Y veremos qué sucede en el futuro”.","summary":"Por ADRIANA G&#211;MEZ LIC&#211;N MIAMI (AP) &#8212; En una c&#225;lida ma&#241;ana de domingo en Miami, el congresista Ruben Gallego se baj&#243; de un auto y se acerc&#243; a los feligreses que sal&#237;an de una iglesia bajo las palmeras para repartir volantes en este barrio dominicano. Gallego dej&#243; atr&#225;s a algunos de sus colaboradores al buscar [&#8230;]","url":"https://www.bostonherald.com/2025/12/15/ruben-gallego-se-perfila-como-figura-demcrata-clave-para-captar-voto-hispano/","image":"https://www.bostonherald.com/wp-content/uploads/2025/12/EEUU-ELECCIONES_2026-GALLEGO_66527.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-15 18:48:58","author":"Associated Press Spanish","authors":["Associated Press Spanish"],"language":"en","source_country":"us","sentiment":0.875},{"id":387294846,"title":"Trump to construct 'fake news wing' blaring clips of media 'animus' in high-rise presidential library","text":"President Donald Trump could include a 'fake news wing' as part of his high-rise presidential library that he wants to build in downtown Miami.\n\nThe Washington Post reported Sunday on the progress that's been made on the Trump presidential library, with $50 million raised this year by the Donald J. Trump Library Foundation. \n\nPart of that headway was the state of Florida, somewhat controversially, giving Trump a parcel of land appraised at $60 million, but that real estate investors have said could be worth closer to $300 million. \n\nThe land, which had been used as a parking lot for Miami Dade College, is located next to the Freedom Tower, a recently restored landmark on Biscayne Boulevard that represents 'freedom of the press,' having formerly housed the Miami News. \n\nIt's also called the 'Ellis Island of the South,' as the building was used by the federal government to process Cuban refugees in the 1960s, fleeing Communism. \n\nBuilding a Trump library next door to the Freedom Tower has been met with opposition by some groups, who point to the president's hardline immigration policies. \n\nIncluding a 'fake news wing' in a high-rise adjacent to a press freedom monument could also ruffle some feathers. \n\nIt was conservative podcast host Benny Johnson, a former BuzzFeed News reporter who was fired for plagiarism, who gave Eric Trump the idea for a 'fake news wing.' \n\nJohnson pointed to the millions of dollars President Trump has received in settlements from media companies and suggested that those funds could be used to create the wing.\n\n'Please, for the love of God, make the fake news wing of the library sponsored by ABC News and CBS and 60 Minutes and put their logos right up there,' Johnson told Eric Trump during a podcast interview in late October. 'And just show everyone who paid for the fake news of the library.' \n\nEric Trump called Johnson's suggestion 'beautiful.' \n\nThe president's son suggested the wing would be a floor of the planned high-rise building, which Politico reported earlier this month could stretch to 47 stories, as Trump is the 45th and 47th president.\n\nThe high-rise could also include a hotel, restaurant and office space, making it stand out from other presidential library projects. \n\nEric Trump said 'fake news' exhibits could include former Vice President Kamala Harris' 60 Minutes interview played on repeat, which Trump's team claimed was deceptively edited ahead of the 2024 election.\n\nCBS said Harris' interview was edited for time, as is customary for most taped television interviews. \n\nStill, Paramount, CBS' parent company, paid Trump a $16 million settlement in July, as the company was trying to finalize an $8 billion sale to Skydance Media, which Trump's FCC approved. \n\nThe settlement was paid specifically to the Trump Library Foundation. \n\nEric Trump also suggested there be an exhibit on Charlottesville, arguing that his father's 'very fine people on both sides' comments got twisted by the mainstream media.\n\n'We can remind people who all these people are,' he continued. 'The fact that Stephanopoulos literally ran the Clinton war room but now they have to fairly moderate debates,' Eric Trump said.\n\nGeorge Stephanopoulos worked in President Bill Clinton's White House before working for ABC News. \n\n'I will do an entire floor dedicated to the fake news, and I'll have a little trademark in your honor, Benny,' Eric Trump told Johnson.","summary":"President Donald Trump could include a 'fake news wing' as part of his high-rise presidential library that he wants to build in downtown Miami.","url":"https://www.dailymail.co.uk/news/article-15385535/donald-trump-presidential-library-fake-news-wing.html","image":"https://i.dailymail.co.uk/1s/2025/12/15/17/104742463-0-image-m-13_1765818327336.jpg","video":null,"publish_date":"2025-12-15 18:47:20","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.205},{"id":387281958,"title":"Hollywood stars, politicians react to deaths of Rob Reiner and his wife","text":"Hollywood stars and political leaders alike are paying homage to Rob Reiner, the prolific movie director, actor and social activist whose shocking death has triggered a wave of heartfelt tributes online. Reiner and his wife, Michele Singer Reiner, were found dead Sunday in their Los Angeles home in what police described as an apparent homicide. Police said Monday that their son Nick Reiner has been arrested on murder charges.With a career that spanned multiple genres over more than five decades, Rob Reiner is considered a legend by many in the film and television industry. He rose to fame as a comedic actor in the CBS sitcom \"All in the Family,\" and his directing credits include classic titles like \"A Few Good Men,\" \"The Princess Bride,\" \"When Harry Met Sally...\" and \"This is Spinal Tap.\"Stephen King said he was \"horrified and saddened\" by the news of the Reiners' deaths in a post shared on X. Reiner's coming-of-age drama \"Stand by Me\" was based on King's novella \"The Body,\" and he also went on to direct the 1990 screen adaptation of the author's thriller \"Misery,\" both of which won acclaim. \"Wonderful friend, political ally, and brilliant filmmaker,\" King said. \"Rest in peace, Rob. You always stood by me.\"The actor and television host Jerry O'Connell, who was one of the young co-stars in \"Stand By Me,\" shared an photo on Instagram of himself and Reiner on the set of the 1986 movie. In its caption, he wrote: \"Love you Rob. Sincerely.\"In an interview on \"CBS Mornings,\" O'Connell described Reiner's death as \"surreal\" and reflected on the formative role that Reiner played in his life. \"Rob was like a father to me,\" he said. \"Everything I have is because of Rob Reiner. ... It's just a sad, shocking day.\"\"What a huge loss,\" wrote Ben Stiller, who said Reiner was one of his favorite directors and praised his \"incredible run of movies.\"\"He made some of the most formative movies for my generation,\" Stiller posted on X. \"'Spinal Tap' is one of the best comedies ever made — and the list goes on. He was a kind caring person who was really really funny. I didn't know him well but was always a fan and I feel a real sadness for those who did, and his family.\"\"Thank you Rob for giving us so much joy to hold on to. Life and talent always turned up to 11,\" actor Virginia Madsen, who appeared in Reiner's 1996 film \"Ghosts of Mississippi,\" wrote on Instagram. James Woods, who starred in the same film, said in a post on X that Reiner had fought for him to play that part, and they \"remained good friends ever since.\"Actor Josh Gad called Reiner \"one of the greatest directors of our time.\" His Instagram post included several photos of them together.\"He was a friend. He was simply a beautiful person,\" Gad captioned it. \"Rob Reiner and his wife Michelle were two of the most kind and caring souls you could ever imagine. He cared so much for those who had no voices. This loss is devastating. I cannot express how much this hurts. Love you Rob and Michelle. Thank you for all you gave us.\"Fellow director Joe Russo said he \"can't handle the truth that one of the greatest filmmakers to ever live is gone\" in a post on X, referencing the iconic line from \"A Few Good Men.\"\"We lost one of the few good men. RIP, Rob Reiner,\" Russo added.Actor and Screen Actors Guild president Sean Astin said in a news release that Reiner was \"one of those most significant figures in the history of film and television,\" whose cultural influence \"simply can't be overstated.\"\"All in the Family\" creator Norman Lear, who died in 2023 at age 101, \"often referred to Rob as a son, and their close relationship was extraordinary,\" Lear's family said in a statement. The family said they were \"devastated by the deaths of Rob and Michele Reiner.\"\"Norman would have wanted to remind us that Rob and Michele spent every breath trying to make this country a better place, and they pursued that through their art, their activism, their philanthropy, and their love for family and friends,\" the family said.Politicians from California and beyond have spoken out to express their condolences and celebrate Reiner's accomplishments in cinema as well as political activism. Reiner was a vocal advocate for Democratic campaigns and, in California, led initiatives for LGBTQ rights and early childhood development.Former Vice President Kamala Harris said Reiner and his wife \"were dear friends,\" and Harris and her husband, Doug Emhoff, \"are devastated to learn of their passing.\" Harris, who previously represented California in the U.S. Senate, said Reiner's work \"has impacted generations of Americans.\" \"The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture,\" Harris wrote on X. \"Rob loved our country, cared deeply about the future of our nation, and fought for America's democracy.\" Former House Speaker and current Rep. Nancy Pelosi, of California, described Reiner as \"creative, funny, and beloved\" and said in a statement that she and her family were mourning \"the loss of our very dear friends.\"California Gov. Gavin Newsom said in a statement that he's \"heartbroken by the tragic loss of Rob Reiner and Michele Singer Reiner,\" while Los Angeles Mayor Karen Bass called the Reiners' deaths \"a devastating loss for our city and our country.\"\"Rob Reiner's contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice,\" Bass said in a statement.Former President Barack Obama also shared a statement on X, saying, \"Rob's achievements in film and television gave us some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action. Together, he and his wife lived lives defined by purpose.\"","summary":"Tributes and condolences have poured in for the prolific director, actor and activist Rob Reiner and his wife, Michele, who were found dead Sunday in their home in Los Angeles.","url":"https://www.cbsnews.com/news/rob-reiner-death-hollywood-stars-politicians-react/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/12/15/b6046959-c36e-4440-a796-7a2537222421/thumbnail/1200x630g2/db276b11076a39d520335051058231b8/gettyimages-50810276.jpg","video":null,"publish_date":"2025-12-15 18:25:11","author":"Emily Mae Czachor","authors":["Emily Mae Czachor"],"language":"en","category":"politics","source_country":"US","sentiment":0.715},{"id":387250378,"title":"Donald Trump blames Rob Reiner's death on 'incurable case of Trump Derangement Syndrome'","text":"Donald Trump appeared to suggest that the fatal stabbing of Rob Reiner and his wife, Michele, was due to “Trump Derangement Syndrome”.\n\nIn a post on Truth Social, the US President said that the “once very talented movie director and comedy star,” had died “reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease” called TDS - or Trump Derangement Syndrome.\n\nTDS is said to refer to a feeling of disdain for the president, which Trump supporters in the US have used to describe negative reactions to the president that are characterized as irrational and disconnected from Trump's actual policy positions \n\nIn his post the president went on: “He was known to have driven people CRAZY by his raging obsession with President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness”\n\nThis is not the first time that the president has taken aim at a public figure after their death – withTrump also mocking the late John McCain and General Colin Powell after their deaths.\n\nReiner, a 78-year-old celebrated director and actor, was outspoken in his support of liberal causes and the Democratic Party.\n\nHe even went as far as minimising concerns about Joe Biden’s age, saying “Look, he's old!” in an interview in February 2024 before Biden dropped out. \n\nThe movie legend was a prominent critic of Trump, labelling him “mentally unfit” and branding him an autocrat in multiple interviews. \n\nHe told Variety in 2017, “Donald Trump is the single most unqualified human being to ever assume the presidency of the United States”.\n\nReiner is known for celebrated movie classics including Stand By Me, The Princess Bride, Few Good Men, and When Harry Met Sally.\n\nThey reportedly had their throats slit after an argument became fatal, and were found dead at their LA home on Sunday.\n\nRepublican congresswoman Marjorie Taylor Greene criticised the president’s statement, saying: “Rob Reiner and his wife were tragically killed at the hands of their own son, who reportedly had drug addiction and other issues, and their remaining children are left in serious mourning and heartbreak”.\n\n“This is a family tragedy, not about politics or political enemies. Many families deal with a family member with drug addiction and mental health issues. It’s incredibly difficult and should be met with empathy, especially when it ends in murder.”\n\nRight-wing commentator Robbie Starbuck also wrote: “I don’t care what their politics were or how they felt about Trump, no law abiding human deserves this.\n\n“We should pray for + send condolences to his loved ones and NOT make it political.”\n\nMichele Reiner was the photographer behind Trump's portrait for his bestselling book “The Art of the Deal.”\n\nThe couple lived just across the street from their daughter, Romy, who reportedly found the horrifying scene when she visited.\n\nFormer Vice President and Democratic presidential nominee Kamala Harris paid tribute to the couple on X: “Rob Reiner's work has impacted generations of Americans. The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture. Rob loved our country, cared deeply about the future of our nation, and fought for America's democracy.\n\n“Rob and his wife, Michele, loved each other very much. They were dear friends, and Doug and I are devastated to learn of their passing. Our thoughts are with their loved ones during this tragic time.”","summary":"Donald Trump appeared to suggest that the fatal stabbing of Rob Reiner and his wife, Michele, was due to “Trump Derangement Syndrome”.","url":"https://www.standard.co.uk/news/world/rob-reiner-murdertrump-derangement-syndrome-b1262675.html","image":"https://static.standard.co.uk/2025/12/15/17/16/FotoJet-(73).jpg?width=1200","video":null,"publish_date":"2025-12-15 17:36:26","author":"Georgia Bell","authors":["Georgia Bell"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.031},{"id":387263306,"title":"Donald Trump branded ‘repugnant’ after post about Rob Reiner and wife Michele’s deaths","text":"US President Donald Trump has been criticised for his comments about Rob Reiner’s death (Picture: Getty)\n\nDonald Trump has been criticised for his post following the shocking deaths of Rob Reiner and his wife Michele.\n\nThe bodies of the Hollywood director, 78, and his 68-year-old wife were discovered at their home in Los Angeles yesterday.\n\nTheir son Nick, 32, has been taken into custody and held on $4million (£3,007,744) bail, according to Los Angeles Sheriff’s Department records seen by Metro.\n\nAfter the news of the deaths broke, US President Trump took to his Truth Social account, claiming Reiner had ‘Trump Derangement Syndrome’.\n\nHe called the When Harry Met Sally icon a ‘once very talented movie director and comedy star’.\n\nTrump continued: ‘[He] passed away reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as Trump Derangement Syndrome.’\n\n Reiner and his wife Michele were killed in their home (Picture: Kent NISHIMURA / AFP via Getty Images)\n\n Trump posted about ‘the Golden Age of America’ (Picture: TruthSocial)\n\n‘He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness.’\n\nReiner was an outspoken Democrat with the likes of Kamala Harris, Governor Gavin Newsom, and Nancy Pelosi paying tribute to him.\n\n LA Mayor Karen Bass said in a statement: ‘Rob Reiner’s contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice.’\n\nTrump’s comments were shared on X, with numerous people criticising him for making the tragedy ‘about him’.\n\n https://www.instagram.com/p/DSStrmDCSH_/\n\nAmong those condemning the rant is musician Jack White, who had some stern words for the world leader.\n\nThe White Stripes star, 50, vented on Instagram: ‘Trump you disgusting, vile, egomaniac loser, child. Neither he nor any one of his followers can defend this gross, horrible insult to a beautiful artist who gave the world so much.\n\n‘To use someone’s tragic death to promote your own vanity and fascist authoritarian agenda is a corrupt and narcissistic sin. Shame on you trump and anyone who defends this.’\n\nHe concluded in tribute to Reiner: ‘God bless you Rob Reiner and thank you for what you gave the world. I never even met you and I still stand by you.’\n\n Reiner was a vocal Democrat and liberal supporter (Picture: ROBYN BECK/AFP via Getty Images)\n\n He and his wife reportedly suffered from knife wounds (Picture: Kevin Winter/Getty Images)\n\nElsewhere, WHITEH0TPEPPERS said: ‘Mind you it was their own son that murdered them. imagine making a family tragedy about yourself.’\n\nJeetendra Rana added that ‘even by Trump’s standards’ this was ‘tasteless and unnecessary’.\n\nThe post was blasted as ‘absolutely repugnant’, as PrinceChrisMUFC explained: ‘Weaponising a horrific tragedy like this to score political points is a new low, even by current standards.’\n\nThe police have not indicated that the attack was linked to any political motivations, with the investigation still ongoing.\n\nOne police source said the couple appeared to have suffered knife wounds, and their death is being investigated as a double homicide.\n\nTheir son Nick was arrested at 9:15pm local time and charged the following morning at 5:04am.\n\n Trump was branded ‘repugnant’ for ‘making the losses about him’ (Picture: AP Photo/Jose Luis Magana)\n\n Reiner was best known for directing hits like The Princess Bride and more (Picture: THA/Shutterstock)\n\n‘It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner,’ a family spokesperson previously said.\n\n‘We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.’\n\nReiner started his career as an actor, gaining attention for his role in All In The Family, before appearing in the likes of Sleepless in Seattle and The Wolf of Wall Street.\n\nHe made his debut behind the camera with the iconic mockumentary This Is Spinal Tap in 1984, returning for the sequel earlier this year.\n\nOver the years, he became a hugely respected filmmaker, directing The Princess Bride, When Harry Met Sally, The Bucket List, and more.\n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"He claimed Reiner has 'passed away due to the anger he caused'.","url":"https://metro.co.uk/2025/12/15/donald-trump-branded-repugnant-after-post-about-rob-reiner-and-wife-micheles-deaths-25505583/","image":"https://metro.co.uk/wp-content/uploads/2025/12/SEC_278109976-46f1.jpg?quality=90&strip=all","video":null,"publish_date":"2025-12-15 17:33:07","author":"Danni Scott","authors":["Danni Scott"],"language":"en","category":"politics","source_country":"gb","sentiment":0.276},{"id":387289472,"title":"Son arrested after Rob Reiner and wife found dead: U.S. media","text":"Police took Rob Reiner’s son into custody after the Hollywood director of hits including “When Harry Met Sally” and his wife were found dead in their Los Angeles home, U.S. media reported on Monday (December 15, 2025). \n\nNetworks CBS and ABC said Nick Reiner was arrested, and the Los Angeles Times reported he was booked into the Los Angeles County jail on suspicion of murder, citing jail records. \n\nLos Angeles deputy police chief Alan Hamilton had said earlier they were seeking to interview “every family member” of the 78-year-old actor-director and his wife, Michele Singer Reiner. \n\nThe bodies were discovered on Sunday (December 14) and police said they were treating the case as an “apparent homicide.” \n\nAs tributes poured in for Reiner, Donald Trump unleashed a crude broadside on the Hollywood icon, appearing to blame the deaths on the director’s “raging” criticism of the U.S. President. \n\nSeveral U.S. news media cited police sources as saying the couple were stabbed, while celebrity news website TMZ, which first broke the story, reported that their throats had been cut by a family member during an argument. \n\nReiner directed classic films including 1984’s rock music mockumentary “This is Spinal Tap,” fantasy gem “The Princess Bride” from 1987, and the 1992 courtroom drama “A Few Good Men.” \n\nHis films spanned everything from laugh-out-loud comedy to searing drama and earned him a global following. \n\nReiner was politically active and an outspoken supporter of progressive causes — potentially a reason for the extraordinary statement by Mr. Trump on Monday (December 15), less than a day after the killings. \n\nWhile movie fans around the world grieved, Mr. Trump claimed Reiner died “reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME.” \n\n“He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness,” the President posted. \n\nA beloved director \n\nDemocratic politicians and Hollywood figures expressed shock over the deaths. \n\nFormer U.S. vice-president Kamala Harris was friends with the couple and said on X she was “devastated to learn of their passing,” while former president Barack Obama said he and his wife Michelle were “heartbroken.” \n\nReiner gave television and movie viewers “some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of people,” Mr. Obama said on X. \n\nMovie heavyweight John Cusack said he was “at a loss for any words that make sense” about the deaths. \n\nHorror and thriller writer Stephen King, whose novella “The Body” was the basis for Reiner’s 1986 coming-of-age classic “Stand By Me,” lauded a “wonderful friend.” \n\nReiner rose to acting fame as the oafish son-in-law Michael “Meathead” Stivic on groundbreaking 1970s sitcom “All in the Family,” before transitioning to directing. Even as a force behind the camera, he often appeared in cameo roles in his own films. \n\nHe directed the 1989 romantic comedy “When Harry Met Sally,” starring Billy Crystal and Meg Ryan, and famously cast his real-life mother Estelle Reiner to utter the line “I’ll have what she’s having” after Ryan’s classic fake orgasm scene in Katz’s Delicatessen. \n\nHis 1992 thriller “A Few Good Men,” starring Hollywood heavyweights Tom Cruise and Jack Nicholson, earned an Oscar nomination for Best Picture. \n\nReiner backed efforts to secure equal marriage rights for LGBTQ people and create California’s First 5 program, which provides child development programs funded by taxes on tobacco products. \n\nHe also helped fundraise for Democratic presidential candidates including Hillary Clinton. \n\nHe was the son of legendary comedian Carl Reiner, who won 11 Emmy Awards for his television performances and wrote screenplays with movie greats Mel Brooks and Neil Simon.","summary":"Reiner was politically active and an outspoken supporter of progressive causes — potentially a reason for the extraordinary statement by Donald Trump on Monday (December 15), less than a day after the killings","url":"https://www.thehindu.com/news/international/son-arrested-after-rob-reiner-and-wife-found-dead-us-media/article70400277.ece","image":"https://th-i.thgim.com/public/incoming/imlz50/article70400301.ece/alternates/LANDSCAPE_1200/2025-12-15T163154Z_1843222209_RC24HIAK0UMT_RTRMADP_3_PEOPLE-ROB-REINER.JPG","video":null,"publish_date":"2025-12-15 16:51:21","author":"Donald Trump","authors":["Donald Trump"],"language":"en","source_country":"in","sentiment":0.125},{"id":387229566,"title":"Pelosi reveals she and Biden still haven't spoken, rejects premise that she told him to drop out","text":"Former House Speaker Nancy Pelosi revealed in an interview released Saturday that she and former President Joe Biden still have not spoken after she played a role in encouraging him to drop out of the 2024 election. USA Today's Susan Page asked Pelosi about her involvement in Biden’s decision to exit the race during an interview on \"The Excerpt\" podcast and whether she has spoken to the former president since. \"No, but I want to just recharacterize what you said. My conversations with the president were more about let's make sure we're understanding what the polls say, and there are certain attitudes that the public had, had they been taken into consideration. If they had sat down with more pollsters, it might have come to a place where we said, ‘This is it, the president should go,’ but they just decided that their polls were right and that was that. So I didn't go in there to say to the president, 'You shouldn't run.' I said, ‘We've got to compare polls because we have different numbers,'\" Pelosi said. The former House Speaker said she was upset by the fact that they hadn't spoken, though she added she respected Biden’s decision. PELOSI DEMURS ON IF ‘EVERYTHING IS OK’ BETWEEN HER AND BIDEN: ‘YOU’D HAVE TO ASK HIM' \"Well, I'm saddened by it because I love him and respect him, but I respect his decision in that regard,\" Pelosi said. Pelosi joined MSNBC's \"Morning Joe\" in July 2024 following the former president's disastrous debate performance and said, \"It’s up to the president to decide if he is going to run,\" suggesting that Biden was still weighing his options despite insisting at the time he would remain in the race. Reports at the time said Pelosi and other Democratic leaders were working behind the scenes to persuade Biden to drop out, as Pelosi was reportedly convinced he would lose to then-President Donald Trump. EX-BIDEN ADVISOR TEARS INTO DISLOYAL DEMOCRATIC PARTY, SAYS FORCING BIDEN OUT WAS 'UNDEMOCRATIC' After Trump defeated former Vice President Kamala Harris in the election, former first lady Jill Biden said she was disappointed in Pelosi. \"It’s been on my mind a lot lately,\" she told The Washington Post in a January interview. \"We were friends for 50 years. It was disappointing.\" \"Let’s just say I was disappointed with how it unfolded,\" the former first lady added. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Pelosi told Page that Joe Biden made a \"lovely\" statement when she announced her plans to retire from Congress at the end of her current term. Biden put out a statement reacting to Pelosi's decision last month. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"I often said Nancy Pelosi was the best Speaker of the House in American history — it’s why I awarded her the Presidential Medal of Freedom. When I was President, we worked together to grow our economy, create millions of jobs, and make historic investments in our nation’s future. She has devoted much of her life to this country, and America will always be grateful. Jill and I wish Nancy and Paul all the best,\" he wrote on X.","summary":"Former House Speaker Nancy Pelosi revealed she still hasn&apos;t spoken to former President Joe Biden since his 2024 election exit and said she&apos;s &quot;saddened&quot; by the silence.","url":"https://www.foxnews.com/media/pelosi-admits-shes-saddened-ongoing-silence-from-biden-after-pushing-him-out-race","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/pelosi-biden-rift.jpg","video":null,"publish_date":"2025-12-15 16:28:31","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"US","sentiment":-0.449},{"id":387229572,"title":"Democratic heavyweights Harris, Newsom turn heads, fuel 2028 speculation","text":"It appears to be game on in the race for the next Democratic presidential nomination, as two of the party's most high-profile politicians, who are considered potential top-tier 2028 contenders, stirred more speculation at a major Democratic Party summit. Former Vice President Kamala Harris, the Democrats' 2024 standard-bearer after then-President Joe Biden exited the race, showcased an edgier stump speech as she railed against both major parties and the political status quo in an address at the Democratic National Committee's (DNC) winter meeting this past weekend. And California Gov. Gavin Newsom landed the red carpet treatment, as he mingled with delegates during the opening day of the DNC's confab, which was held this year in Los Angeles, home turf to both Harris and Newsom. The main focus for the hundreds of committee members and party officials who attended the summit was reviewing the party's decisive victories in last month's 2025 elections and better than expected performances in this year's special elections, and training sessions to prepare for next year's crucial midterm contests. 21 DEMOCRATS WHO MAY RUN FOR THE WHITE HOUSE IN 2028 But with the unofficial start of the next White House race less than a year away, and what's likely to be a bruising battle among Democrats over the party's presidential nominating calendar getting underway, 2028 was also in the spotlight. \"Obviously, we must focus on the midterms,\" Harris said in her Friday speech. \"But Democrats, we must also have a clear vision for what comes after the midterms. And then after Trump. We need to answer the question. We need to answer the question: what comes next for our party and our democracy?\" Harris argued that \"both parties have failed to hold the public's trust\" and that \"people are done with the status quo, and they're ready to break things to force change.\" 2028 LOOMS LARGE: HARRIS, NEWSOM, PRITZKER CONVERGE AT MAJOR DNC MEETING And Harris, who was swept by President Donald Trump in all key battleground states in the 2024 election, said that Trump is representative of a bigger problem plaguing the nation's politics. \"He and the rise of the MAGA movement, I believe, are a symptom of a failed system that is the result of years of outsourcing and offshoring, financial deregulation, growing income inequality, a broken campaign finance system and endless partisan gridlock all contributing to how we got here today,\" she emphasized. \"The vice president received a very warm and enthusiastic reception,\" a committee member told Fox News Digital. And when she alluded to who would be in contention for the 2028 nomination, some in the room shouted, \"You.\" According to those in the room, Harris also landed a warm welcome less than 24 hours earlier as she spoke at the United Farm Workers annual gala. Expect to see more of Harris in the new year, helping Democrats from coast to coast as the party works to win back congressional majorities in the midterms. And Harris has added more 2026 stops to her book tour promoting \"107 Days,\" her reflections on her abbreviated 2024 presidential campaign. Among the stops is one in South Carolina, a crucial early-voting primary state in the Democratic Party's presidential nominating calendar. SUCCEEDING TRUMP IN 2028: SIX REPUBLICANS TO KEEP YOUR EYES ON While Newsom didn't address the delegates at Friday's general session, he was treated like a VIP on Thursday as he held meetings and mingled with delegates during the opening day of the winter meeting. A DNC committee member who witnessed the commotion told Fox News Digital, \"Newsom received a rock star reception as he was mobbed by party leaders and activists alike while he attempted to walk from meeting to meeting.\" Newsom on Thursday met with the Democratic Party chairs from New Hampshire, the first-in-the-nation presidential primary state, and Nevada, another crucial early voting state. \"We had a great discussion on a wide range of issues,\" longtime New Hampshire Democratic Party Chair Ray Buckley told Fox News Digital. Newsom's stature in his own party has soared this year, thanks to his very vocal and visual pushback against the president, including his viral social media trolling of Trump and his successful California push to counter the Republican congressional redistricting effort. \"Newsom has shown an ability to stand up to Trump in a bold and highly effective manner without shying away from core democratic values,\" veteran Democratic strategist Joe Caiazzo told Fox News Digital. While both Newsom and Harris made a splash at the DNC winter meeting, they both have plenty of detractors who worry that neither would be electable in 2028 when the Democrats try to win back the White House. And if one or both of them launch presidential campaigns, they'll likely be joined by a large crowd of other contenders. One of those possible White House hopefuls is Illinois Gov. JB Pritzker, who was also making the rounds during the opening day of the DNC meeting. Fox News Digital confirmed that the billionaire governor helped raise over $1 million for the DNC at a fundraiser Thursday night. A DNC insider said the appearances by Harris, Newsom and Pritzker gave \"them an opportunity to start honing in on a winning message for Democrats in 2028.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP There are more than a dozen other Democrats thought to be potential 2028 White House contenders. And most of them have also been paying visits to the early voting states, as well as parachuting onto the 2025 campaign trail. Among them are Govs. Josh Shapiro of Pennsylvania, Andy Beshear of Kentucky, Wes Moore of Maryland and Gretchen Whitmer of Michigan; Sens. Cory Booker of New Jersey, Amy Klobuchar of Minnesota, Ruben Gallego and Mark Kelly of Arizona, and Chris Murphy of Connecticut; progressive superstar Rep. Alexandria Ocasio-Cortez of New York and Rep. Ro Khanna of California, another leading progressive; and two moderate Democrats, former Transportation Secretary Pete Buttigieg and former Chicago mayor and former White House chief of staff Rahm Emanuel.","summary":"Early 2028 Democratic presidential race heats up as Kamala Harris delivers edgy speech while Gavin Newsom receives star treatment at DNC meeting.","url":"https://www.foxnews.com/politics/democratic-heavyweights-harris-newsom-turn-heads-fuel-2028-speculation","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/gavin-newsom-kamala-harris.jpg","video":null,"publish_date":"2025-12-15 16:20:30","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":0.369},{"id":387294760,"title":"In Wake of Islamic Terror Attack, Australian PM Albanese Warns of Rising Threat of What?","text":"Is anyone surprised that the Left is blaming everything and anything other than the people and ideology responsible for yesterday's Islamic terror attack in Sydney, Australia? We're not. \n\nThe Left's narrative is unfolding in real-time. Australia — which already has strict gun laws — is going to gun control even harder in response to the shooting. London Mayor Sadiq Khan blamed President Trump's rhetoric for a rise in anti-Muslim \"hatred\" in the U.K. and elsewhere.\n\nNow Australian Prime Minister Anthony Albanese is following in Khan's footsteps and warning of a rise in \"right-wing extremist groups.\"\n\n🚨 WTF?! After Islamic terrorists KILLED 15 people in Australia, the prime minister warns about \"right-wing extremist groups\"You've GOT to be kidding me.If the threat was right-wingers, trust me, YOU'D KNOW. pic.twitter.com/fB7JYUewue— Eric Daugherty (@EricLDaugh) December 15, 2025\n\n\"We take HA advice very seriously. We work closely with them. We receive regular updates as well. The director general of HA warned about a range of threats, be it antisemitism, the rise of right-wing extremist groups as well, and we continue to work closely with our security agencies,\" Albanese said.\n\n\"HA\" likely refers to Australia's Home Affairs.\n\nNotably absent from his remarks is the threat from Islamists, including Naveed Akram, who was from Pakistan. Akram was one of the two terrorists who opened fire on Jews celebrating Hanukkah on Bondi Beach yesterday. Akram was known to authorities for his Islamist ties.\n\nThey always do this. Shift the narrative away from the guilty.— PNW Conservative (@PNWConservative) December 15, 2025\n\nThey not only shift blame away from the guilty, but they also use it as an opportunity to attack the groups they hate, despite the fact that there have been no \"right-wing extremist group\" terror attacks.\n\nThey will lie to your face rather than face the reality of what they have done to you.— SteveEP 🇺🇸 (@SteveEP_) December 15, 2025\n\nYes. Because they know they'd be in serious trouble if they admitted what they've done.\n\nA total lefty of the Fabian class who indulges in self harm to his country and its heritage https://t.co/gs9gZrSXHW— Joe Parsons (@joeparsonsqa) December 15, 2025\n\nThat's what Leftists do. Repeatedly.\n\nExactly what Joe Biden would have said and DID say for 4yrs. https://t.co/SGKyBIl9jh— john jackson (@pvtjokerus) December 15, 2025\n\nAnd exactly what Kamala Harris would have continued saying.\n\nEditor’s Note: Every single day, here at Townhall, we will stand up and FIGHT, FIGHT, FIGHT against the radical left and deliver the conservative reporting our readers deserve.\n\nHelp us continue to tell the truth about the Trump administration and its successes. Join Townhall VIP and use promo code FIGHT to get 60% off your membership.","url":"https://townhall.com/tipsheet/amy-curtis/2025/12/15/australian-pm-right-wing-extremist-groups-n2667894","image":"https://media.townhall.com/cdn/hodl/2025/349/f24a8adf-b6a4-40bf-b1cc-af2db5a7070a.jpg","video":null,"publish_date":"2025-12-15 16:00:21","author":"Amy Curtis","authors":["Amy Curtis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.42},{"id":387221044,"title":"Major Democratic donor Rob Reiner and wife found dead in home: What we know","text":"The couple’s son had spoken to the media in the past about his struggles with drug addiction, which he said made him drift from his home. He has also said he spent stretches of his life homeless.\n\nThe entertainment industry was stunned, as the Reiners’ Brentwood home is in a wealthy area where many celebrities live. It’s also the same area where O.J. Simpson was charged with murdering Nicole Brown Simpson and Ron Goldman.\n\nHere’s what we know about the incident so far.\n\nHow did the Reiners die?\n\nPolice found two bodies at the Reiners’ home around 3:40 p.m. on Sunday after responding to a death investigation. The Los Angeles Police Department called the couple’s death an “apparent homicide.”\n\nAuthorities blocked off the street with yellow tape as police cars and news vans crowded around the Reiners’ home.\n\nAlan Hamilton, LAPD deputy police chief, said authorities were trying to obtain a search warrant for the home. The victims were not initially identified, but Los Angeles Mayor Karen Bass confirmed the couple’s deaths. Reiner was 78, and Singer Reiner was 68.\n\n“This is a devastating loss for our city and our country,” Bass wrote on X. “Rob Reiner’s contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice.”\n\nA family member found the couple with their throats cut, TMZ reported, and told police a different family member murdered them.\n\nReiner’s family and major Democrats mourn couple’s death\n\n“It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner. We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time,” they said in a statement.\n\nHamilton said the LAPD will speak to each family member to gather more information on what transpired.\n\n“We’re going to try to speak to every family member that we can to get to the facts of this investigation,” he said.\n\nSeveral major Democrats also mourned Reiner, a large donor to liberal causes.\n\nFormer President Barack Obama, former House Speaker Rep. Nancy Pelosi (D-CA), Gov. Gavin Newsom (D-CA), and former Vice President Kamala Harris expressed their sorrow on social media.\n\nReiner donated to Democrats as recently as last year, according to Federal Election Commission records reviewed by the Washington Examiner. He backed Harris in the 2024 presidential election and contributed more than $12,000 to her campaign. His largest donations came in 2020, when he backed former President Joe Biden with more than $100,000 in donations.\n\nHe also supported Obama in 2012 with a $40,000 donation.\n\n“Michelle and I are heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele,” Obama wrote on X.\n\n“Rob’s achievements in film and television gave us some of our most cherished stories on screen,” he added. “But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action.”\n\nNewsom and his wife, Jennifer Siebel Newsom, said they are “heartbroken by the tragic loss of Rob Reiner and Michele Singer Reiner,” with the governor adding, “Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.”\n\nHarris, a possible 2028 presidential nominee, said Reiner “has impacted generations of Americans.”\n\n“The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture. Rob loved our country, cared deeply about the future of our nation, and fought for America’s democracy,” she wrote on X.\n\nWhat was the couple known for?\n\nReiner directed entertainment hits in the 1980s and 1990s, such as Stand by Me, This Is Spinal Tap, A Few Good Men, When Harry Met Sally, and The Princess Bride.\n\nHe earned nominations at the Golden Globe Awards for three of those movies, as well as one for 1995’s The American President. Reiner never won a Golden Globe, but was widely acclaimed as a star director.\n\nThe Los Angeles Times said his work had an “astonishing versatility,” as he directed everything from an intense courtroom drama to a romantic comedy.\n\nReiner also worked as an actor, making his mark as Mike “Meathead” Stivic on CBS’s All in the Family, which ran from 1971 to 1979. He earned two Emmys for his performance as Stivic.\n\nAmong his most notable recent acting roles was a supporting part in 2013’s The Wolf of Wall Street, directed by Martin Scorsese.\n\nROB REINER, WIFE FOUND DEAD INSIDE LOS ANGELES HOME\n\nHe met his wife while directing When Harry Met Sally, and the couple married in 1989. Reiner said meeting his wife inspired him to change the ending of the movie so that the main characters end up together. They had three children.\n\nSinger Reiner worked as a photographer, producer, and actress on some of her husband’s projects and was nominated for an Emmy for his 2024 documentary, Albert Brooks: Defending My Life.","summary":"Film director Rob Reiner and his wife, Michele Singer Reiner, were found dead in their California home this weekend, sparking many questions. Nick Reiner, the couple’s 32-year-old son, was arrested on Sunday and is being held on a felony charge with a $4 million bail, according to LAPD jail records reviewed by the Washington Examiner. [&#8230;]","url":"https://www.washingtonexaminer.com/news/crime/3917666/democratic-donor-rob-reiner-wife-found-dead-what-we-know/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/12/reiner.jpg?w=696","video":null,"publish_date":"2025-12-15 15:48:57","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.096},{"id":387239734,"title":"Rob and Michele Reiner, Remembered: Hollywood Pays Tribute to Its “Dear Friends”","text":"Rob Reiner was a longtime Democrat and vocal opponent of Trump who once considered running for governor against Arnold Schwarzenegger. On his social media platform of choice, Trump sent insincere condolences while furthering his own agenda, positioning himself as a victim. “A very sad thing happened last night in Hollywood. Rob Reiner, a tortured and struggling, but once very talented movie director and comedy star, has passed away, together with his wife, Michele, reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS,” Trump wrote. “He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before. May Rob and Michele rest in peace!”\nHowever, the director has received several sincere tributes from friends and past collaborators. Guest and his wife, Oscar winner Jamie Lee Curtis, released a statement about the Reiners: “Christopher and I are numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michele Singer Reiner and our ONLY focus and care right now is for their children and immediate families, and we will offer all support possible to help them,” it read. “There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage, and their global care for a world in crisis. We have lost great friends. Please give us time to grieve.”\nThe son of comedy legend Carl Reiner, Rob Reiner began his long and varied career in Hollywood as an actor, winning two Primetime Emmys for his role as Meathead (a.k.a. Michael) on Lear’s classic sitcom All in the Family. In the 1980s, Reiner would focus his sights on directing; his first film was the mockumentary This Is Spinal Tap, starring himself, Guest, Harry Shearer, and Michael McKean. Reiner went on to direct a string of critically acclaimed, widely beloved films in a number of genres: coming-of-age (Stand by Me, 1986); fantasy-adventure (The Princess Bride, 1987); romantic comedy (When Harry Met Sally…, 1989); psychological horror (Misery, 1990); and courtroom drama (A Few Good Men, 1992).\nStars of the late filmmaker’s past projects came out in droves to honor him. Elwes, Reiner’s Princess Bride star, posted on Instagram a photo showing two director’s chairs on the set of the movie. “No words,” Elwes wrote in the caption. Jerry O’Connell, who starred in Reiner’s Stand by Me as a child, posted a photo on X of himself and Reiner on the set of that film, adding the simple caption, “Love you, Rob. Sincerely.” Elijah Wood, who starred in Reiner’s much-maligned 1994 film, North, wrote on X that he was “horrified to hear of the passing of Rob Reiner and his wonderful wife Michelle [sic]. So much love to their kids and family.” John Cusack, who starred in Reiner’s 1985 film, The Sure Thing, wrote on X, “Shocked by the death of Rob Reiner - a great man,” while Virginia Madsen, who starred in his 1996 drama, Ghosts of Mississippi, paid tribute to Reiner on Instagram, posting a photo of the two together. “Thank you Rob for giving us so much joy to hold on to. Life and talent always turned up to 11,” she wrote.\nIt wasn’t just former collaborators who paid tribute to Reiner and his wife. Ben Stiller—who, like Reiner, had a famously funny father (that would be Jerry Stiller)—paid tribute to Reiner on X. Although Stiller said he “didn’t know him well,” he expressed “what a huge loss” Reiner’s death was for the entertainment industry.\n“Rob Reiner was one of my favorite directors. He made some of the most formative movies for my generation,” Stiller wrote. “He came out form [sic] behind a huge comedic shadow of the great Carl Reiner and being a tv actor to being a great director who made an incredible run of movies. Spinal Tap is one of the best comedies ever made - and the list goes on. He was a kind caring person who was really really funny.” Bridesmaids director Paul Feig posted a photo of himself with Reiner at Comic-Con in San Diego, saying it was one of his “most cherished pictures.”\n“Rob was my true hero,” Feig continued. “A true visionary titan and a lovely lovely person. One never knows if it’s proper to post during something as tragic as this. But I just want the world to know what so many of us know in the industry. Rob was the best.”\nFellow sitcom actor turned director Ron Howard also expressed his condolences on X. “Our careers and lives intersected often over the decades from Rob writing the pilot script for Happy Days and then as we each shifted from acting careers into directing and producing,” Howard wrote. “He proved to be a superlative filmmaker, a supportive colleague and at all times a dedicated citizen. Rob will be missed on so many levels. My heart goes out to his family and his many close friends.”\nAs Trump was well aware, Reiner was a vocal Democrat—and as such, prominent figures in the Democratic Party have also expressed their condolences. On X, former president Barack Obama wrote that he and Michelle were “heartbroken by the tragic passing” of the Reiners. “Rob’s achievements in film and television gave us some of our most cherished stories on screen,” he continued. “But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action.”\nFormer Speaker of the House and current California congresswoman Nancy Pelosi said she was devastated by the “deadly assault” against Reiner and his wife. “Rob cared deeply about people and demonstrated that in his civic activities — whether by supporting the First 5 initiative or fighting against Prop 8 in California,” she shared on X. “Civically, he was a champion for the First Amendment and the creative rights of artists.” Former vice president and California senator Kamala Harris also expressed her condolences to the “loved ones” of her “dear friends” the Reiners. “Rob Reiner’s work has impacted generations of Americans. The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture,” she wrote on X. “Rob loved our country, cared deeply about the future of our nation, and fought for America’s democracy.”\nLegendary producer Norman Lear, who created All in the Family and, in the process, gave Reiner his breakthrough role, died at the age of 101 in 2023. Still, his estate released a heartfelt statement on the occasion of Reiner’s death. “The Lear family is devastated by the deaths of Rob and Michele Reiner,” began the statement. “Norman often referred to Rob as a son, and their close relationship was extraordinary, to us and the world. Norman would have wanted to remind us that Rob and Michele spent every breath trying to make this country a better place, and they pursued that through their art, their activism, their philanthropy, and their love for family and friends. Lyn Lear had remained very close with them and said, ‘The world is unmistakably darker tonight, and we are left bereft.’”","summary":"After Rob Reiner and his wife Michele’s sudden, tragic deaths, celebrities and politicians are posting remembrances of the late filmmaker—while President Trump offers snide condolences to a liberal afflicted with “TRUMP DERANGEMENT SYNDROME.”","url":"https://www.vanityfair.com/hollywood/story/rob-and-michele-reiner-remembered-hollywood-pays-tribute-to-their-dear-friends","image":"https://media.vanityfair.com/photos/69402b4d5eb7a1a578dbb360/16:9/w_2256,h_1269,c_limit/450937953","video":null,"publish_date":"2025-12-15 15:40:23","author":"Chris Murphy","authors":["Chris Murphy"],"language":"en","source_country":"US","sentiment":0.358},{"id":387216936,"title":"Hollywood Director Rob Reiner, Wife’s Deaths Investigated As Homicide","text":"Police were conducting a homicide investigation Monday after Hollywood giant Rob Reiner — director of a string of hits including “When Harry Met Sally” — and his wife, Michele Reiner, were found dead in their Los Angeles home.\n\nAs tributes poured in for Reiner, 78, Los Angeles deputy police chief Alan Hamilton said they were seeking to interview “every family member” of the actor-director and his wife, Michele Singer Reiner.\n\nThe bodies were discovered Sunday, and police said they were treating the case as an “apparent homicide.”\n\nREAD ALSO: Saudi Sets New Death Penalty Record After Executing 340 In 2025\n\nSeveral US news media cited police sources as saying the couple were stabbed, while celebrity news website TMZ, which first broke the story, reported Monday that their throats had been cut by a family member during an argument.\n\nThe Los Angeles Times reported that a source with knowledge of the investigation said there was no sign of forced entry into the home.\n\nHamilton said no arrests have been made and did not publicly identify any potential suspect or even person of interest.\n\n“I’m not going to confirm whether someone’s being interviewed at this time or not. We’re going to try to speak to every family member that we can to get to the facts of this investigation,” he added.\n\nReiner, 78, directed classic films including 1984’s rock music mockumentary “This is Spinal Tap,” fantasy gem “The Princess Bride” from 1987, and the 1992 courtroom drama “A Few Good Men.”\n\nHis films spanned everything from laugh-out-loud comedy to searing drama and earned him a global following.\n\nFormer US vice president Kamala Harris was friends with the couple and said on X she was “devastated to learn of their passing,” while former president Barack Obama said he and his wife Michelle were “heartbroken” by the tragedy.\n\nReiner gave television and movie viewers “some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of people,” Obama said on X.\n\nMovie heavyweight John Cusack said he was “at a loss for any words that make sense” about the deaths.\n\nHorror and thriller writer Stephen King, whose novella “The Body” was the basis for Reiner’s 1986 coming-of-age classic “Stand By Me,” lauded a “wonderful friend.”\n\n“You always stood by me,” he wrote on X.\n\n“Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity,” California Gavin Newsom posted.\n\n‘I’ll have what she’s having’\n\nReiner rose to acting fame as the oafish son-in-law Michael “Meathead” Stivic on groundbreaking 1970s sitcom “All in the Family,” before transitioning to directing. Even as a force behind the camera, he often appeared in cameo roles in his own films.\n\nHe directed the 1989 romantic comedy “When Harry Met Sally,” starring Billy Crystal and Meg Ryan, and famously cast his real-life mother Estelle Reiner to utter the line “I’ll have what she’s having” after Ryan’s classic fake orgasm scene in Katz’s Delicatessen.\n\nHis 1992 thriller “A Few Good Men,” starring Hollywood heavyweights Tom Cruise and Jack Nicholson, earned an Oscar nomination for Best Picture.\n\nReiner was also an outspoken supporter of progressive causes, backing efforts to secure equal marriage rights for LGBTQ people and create California’s First 5 program, which provides child development programs funded by taxes on tobacco products.\n\nHe also helped fundraise for Democratic presidential candidates including Hillary Clinton.\n\nHe was the son of legendary comedian Carl Reiner, who won 11 Emmy Awards for his television performances and wrote screenplays with movie greats Mel Brooks and Neil Simon.","url":"https://www.channelstv.com/2025/12/15/hollywood-director-rob-reiner-wifes-deaths-investigated-as-homicide/","image":"https://www.channelstv.com/wp-content/uploads/2025/12/files-entertainment-reiner-obit.jpg","video":null,"publish_date":"2025-12-15 15:12:52","author":"Channels Television","authors":["Channels Television"],"language":"en","source_country":"in","sentiment":0.294},{"id":387170338,"title":"Biden officials go silent when asked about Afghan refugee program after guardsmen shooting","text":"Former top Biden administration decision makers were silent on whether they stand by the vetting procedures deployed for \"Operation Allies Welcome,\" the Afghan resettlement program that was utilized by the alleged National Guard attacker to get to the U.S. The heinous incident that claimed the life of one West Virginia National Guard member and gravely wounded another on Thanksgiving Eve sprung back to the forefront last week when House Homeland Security Committee ranking member Bennie Thompson, D-Miss., infuriated Homeland Security Secretary Kristi Noem when he referred to it as an \"unfortunate accident.\" The attack renewed questions over whether Democrats still stand by the vetting processes put in place by the previous administration — and whether officials involved in the Afghanistan withdrawal and refugee resettlement would revise those decisions today. Fox News Digital has reached out to several members of the Biden administration with roles directly or tangentially related to the Afghanistan withdrawal and the resettlement of Afghan refugees. SENATOR RENEWS PUSH TO MANDATE VETTING FOR AFGHAN EVACUEES AFTER NATIONAL GUARD SHOOTING Inquiries to former President Joe Biden’s office, former Vice President Kamala Harris and a second request to an individual listed as Harris’ literary agent were not returned within a week. Messages sent to former Joint Chiefs Chairman Gen. Mark Milley [Ret.], as well as via an official at the Princeton University School of Public and International Affairs – where he is listed as a visiting professor – also went unanswered. Milley, though a general, was not in a command position – as the chairman of the Joint Chiefs of Staff is an advisory role. In that regard, he did not make any operational decisions, but instead was in the president's ear when it came to military advice. Milley later told senators on Capitol Hill that he recommended maintaining a small, 2,500-troop force in Afghanistan. Fox News Digital also reached out to former Central Command (CENTCOM) commander, Gen. Kenneth \"Frank\" McKenzie via his new role at the University of South Florida, for comment – which was not returned. AFGHAN EVACUEE ARRESTED BEFORE DC SHOOTING FEDERALLY CHARGED WITH THREATENING TERROR ATTACK CENTCOM covers the Middle East and was tasked with overseeing security and evacuation operations out of Hamid Karzai International Airport in Kabul. Messages sent to addresses listed for National Security Adviser Jacob Sullivan and Deputy National Security Adviser Jon Finer were not returned. Finer is now a visiting fellow at Columbia University’s School of Public and International Affairs, and Sullivan’s wife – Rep. Maggie Goodlander, D-N.H., is in her first term in Congress. Sullivan was a key adviser to Biden during the withdrawal and was later pressed by CNN whether he feels \"personally responsible for the failures\" therein. He replied that the \"strategic call President Biden made, looking back three years, history has judged well and will continue to judge well. From the point of view that, if we were still in Afghanistan today, Americans would be fighting and dying; Russia would have more leverage over us; we would be less able to respond to the major strategic challenges we face.\" A woman who answered a line listed for former Secretary of State Antony Blinken redirected Fox News Digital to a press liaison. That request was not returned. Blinken, as leader of the State Department, was the point person for the diplomatic aspect of the withdrawal. He advised Biden on what to do about the Taliban's \"Doha Agreement\" that was forged by the previous Trump administration, while the department coordinated overflight rights, temporary housing and other issues regarding the refugee outflow from Kabul. SENATE REPUBLICANS LAUNCH INVESTIGATION INTO BIDEN IMMIGRATION PROGRAMS AFTER DC NATIONAL GUARD SHOOTING A woman who answered an extension listed for former Pentagon chief Gen. Lloyd Austin III [Ret.] said she would take a message and that Austin would return the call if he wished. As Pentagon chief, Austin was the top bureaucrat in the U.S. military structure at the time of the withdrawal. After the Thanksgiving Eve attack, U.S. Citizenship for Immigration Services administrator Joe Edlow announced a review of the green card system, citing suspect Rahmanullah Lakanwal’s situation. His predecessor, Biden-appointed Ur Jaddou, did not respond to a request for comment. AFGHAN EVACUEES WITH CHILD-FONDLING, TERROR ARRESTS SWEPT UP IN DHS CRACKDOWN AFTER BOTCHED VETTING EXPOSED Fox News Digital also reached out to alleged addresses linked to former Homeland Security Adviser Liz Sherwood-Randall, but did not receive responses. Fox News Digital also reached out to the Belfer Center at Harvard, which recently cited that Sherwood-Randall would be rejoining their ranks to lead their \"Initiative on Bioconvergence, Biosecurity, and Bioresilience.\" Fox News Digital also attempted to reach Harris’ national security adviser, Phil Gordon, via his new role at a global advisory firm, but did not receive a response. Efforts to reach Biden confidants Ronald Klain and Jeffrey Zients were unsuccessful. FBI PROBES POSSIBLE TIES OF NATIONAL GUARD SHOOTER TO TABLIGHI JAMAAT, A ‘CATALYST’ FOR JIHAD Tracey Jacobson, now the chargé d’affaires for the U.S. in Dhaka, Bangladesh, led the administration’s Afghanistan coordination task force charged with processing and relocating Afghan allies. She did not respond to an inquiry. During the Afghan withdrawal, Jacobson was named by the Biden administration to lead an Afghanistan coordination task force as part of its \"whole-of-government effort to process, transport and relocate Afghan Special Immigrant Visa applicants and other Afghan allies,\" according to Biden. 2021 AFGHAN REMARKS HAUNT GOP LAWMAKER'S SENATE BID AFTER DC GUARD SHOOTING Former U.S. Customs and Border Protection Commissioner Chris Magnus was asked by DHS Secretary Alejandro Mayorkas to resign in 2022 or risk being the first Biden administration official fired, according to The New York Times. DHS officials ultimately cut his access to the agency’s social media accounts, according to the paper, and a report from Heritage Foundation fellow Simon Hankinson cited that he ultimately left the job soon after. His role would have also placed him in the midst of the orchestration of Operation Allies Welcome and Operation Allies Refuge. He was also unable to be reached for comment. Another Mayorkas deputy, then-FEMA Director Robert Fenton Jr., was reportedly tasked with setting up Operation Allies Welcome centers to help evacuees \"integrate successfully and safely into new communities.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP Fenton remains the Region 9 administrator for the agency, tasked with an area covering the west coast and South Pacific protectorates. An inquiry to Fenton was not returned. Mayorkas himself could not be reached directly for comment. Efforts to reach him via a law firm he was or is connected to, as well as the Carnegie Endowment for International Peace, where he is a visiting scholar, were either unsuccessful or not returned.","summary":"Former Biden officials including Gen. Mark Milley and Antony Blinken do not respond to questions about Afghanistan refugee vetting after Washington attack.","url":"https://www.foxnews.com/politics/biden-officials-go-silent-when-asked-about-afghan-refugee-program-after-guardsmen-shooting","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/milley-austin-biden-mayorkas.png","video":null,"publish_date":"2025-12-15 13:00:34","author":"Charles Creitz","authors":["Charles Creitz"],"language":"en","category":"politics","source_country":"us","sentiment":-0.387},{"id":387130002,"title":"Rob Reiner's shocking death stuns onlookers — and spurs tributes","text":"Legendary film director Rob Reiner and his wife Michele Singer were found dead in their California home Sunday in what law enforcement is investigating as “an apparent homicide,” leaving figures from across the political spectrum stunned and sparking a wave of tributes for both his film career and political activism.\n\n“We lost Rob Reiner tonight. Not only was he a legend in Hollywood, one of our biggest industries, but he was also a patriot,” wrote The Young Turks founder Cenk Uygur in a social media post on X. “Whether you agreed with him or not, there was something you couldn't take from him – he cared about this country! He tried so hard to make a difference!”\n\nReiner’s career in film spanned several decades, and saw him direct countless critically-acclaimed films that have gone on to become enduring fixtures in American cinema, including 1987’s “The Princess Bride,” 1992’s “A Few Good Men” and “When Harry Met Sally.”\n\nBeyond his work in Hollywood, Reiner was also a longtime supporter of the Democratic Party and a vocal advocate for human rights and progressive social causes, as well as a fierce critic of President Donald Trump.\n\nCalifornia Gov. Gavin Newsom said he and his wife Jen were “heartbroken” over the news of Reiner and his wife’s sudden death, praising the director and Brentwood resident for not only his films, but his political advocacy.\n\n“His boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others – and encouraging us to dream bigger,” Newsom wrote in a social media post on X.\n\n“That empathy extended well beyond his films. Rob was a passionate advocate for children and for civil rights – from taking on Big Tobacco, fighting for marriage equality, to serving as a powerful voice in early education. He made California a better place through his good works.”\n\nFormer Vice President Kamala Harris praised Reiner for having “fought for America’s democracy,” and author Stephen King called Reiner a “wonderful friend,” a “brilliant filmmaker (including 2 of mine)” and a “political ally.” Former President Barack Obama wrote that he was also “heartbroken” over the news, and argued Reiner and his wife would be “remembered for the values they championed.”","summary":"Legendary film director Rob Reiner and his wife Michele Singer were found dead in their California home Sunday in what law enforcement is investigating as “an apparent homicide,” leaving figures from across the political spectrum stunned and sparking a wave of tributes for both his film career and political activism.\n\n“We lost Rob Reiner tonight. Not only was he a legend in Hollywood, one of our biggest industries, but he was also a patriot,” wrote The Young Turks founder Cenk Uygur in a social media post on X. “Whether you agreed with him or not, there was something you couldn't take from him – he cared about this country! He tried so hard to make a difference!”\n\nReiner’s career in film spanned several decades, and saw him direct countless critically-acclaimed films that have gone on to become enduring fixtures in American cinema, including 1987’s “The Princess Bride,” 1992’s “A Few Good Men” and “When Harry Met Sally.”\n\nBeyond his work in Hollywood, Reiner was also a longtime supporter of the Democratic Par","url":"https://www.rawstory.com/rob-reiner-2674399595/","image":"https://www.rawstory.com/media-library/image.jpg?id=62485490&width=1200&height=1200&coordinates=326%2C0%2C327%2C0","video":null,"publish_date":"2025-12-15 11:50:15","author":"Alexander Willis","authors":["Alexander Willis"],"language":"en","source_country":"US","sentiment":0.28},{"id":387150170,"title":"Hollywood 'devastated' at death of director Rob Reiner and his wife","text":"Mr Reiner, 78, was a prolific Hollywood director and created some of the most well-known movies of the 1980s and 1990s, including legal thriller A Few Good Men in 1992 and romantic comedy When Harry Met Sally in 1989.\n\nThe director's other films included his 1984 hit This Is Spinal Tap, and The Princess Bride and Stand By Me in 1987.\n\n Monty Python star Eric Idle said in a post on X that he spoke with Mr Reiner in the hours before his death.\n\nThe English actor, 82, called Mr Reiner “a clever, talented and very thoughtful man”, and said: “I spoke to him last night for over an hour. I always enjoyed his company. I met him at his Dad’s in 1975.\n\n“He was telling me about filming at Stonehenge and his thoughts for the future. This is so awful. I shall miss him.”\n\nUS actor James Woods said he and Mr Reiner had been friends since they made 1996 thriller Ghosts Of Mississippi together.\n\nIn an online post, he said: “The studio didn’t think I was old enough to do the part, but Rob fought for me.\n\n“Political differences never stood in the way of our love and respect for each other. I am devastated by this terrible event.”\n\n Frozen actor Josh Gad described Mr Reiner as “one of the greatest directors of our time” in a post on Instagram.\n\nHe said: “He was simply a beautiful person. Rob Reiner and his wife Michelle were two of the most kind and caring souls you could ever imagine.\n\n“He cared so much for those who had no voices. This loss is devastating. I cannot express how much this hurts. Love you Rob and Michelle. Thank you for all you gave us.”\n\nJohn Cusack, who starred in Mt Reiner’s film The Sure Thing, wrote on X: “Shocked by the death of Rob Reiner – a great man.”\n\n The Lord Of The Rings star Elijah Wood, who appeared in Mr Reiner’s 1994 family film North, posted: “Horrified to hear of the passing of Rob Reiner and his wonderful wife Michelle. So much love to their kids and family.”\n\nIn a post on X, American actor and Zoolander star Ben Stiller described Mr Reiner’s death as a “huge loss”, and said: “Rob Reiner was one of my favourite directors.”\n\n“He came out form behind a huge comedic shadow of the great Carl Reiner and being a TV actor to being a great director who made an incredible run of movies.\n\n“He was a kind caring person who was really really funny. I didn’t know him well but was always a fan and I feel a real sadness for those who did, and his family.”\n\nRob’s father, comedian, director and actor Carl Reiner helped create The Dick Van Dyke Show and appeared in films including Ocean’s Eleven, and died in June 2020, aged 98.\n\nAlso among those who have paid tribute is actor and comedian Rob Schneider, who is best known for his role as Rob Hilliard in the Grown Ups films.\n\nIn a post on X, Ms Schneider, 62, said he was “deeply saddened”, and described Mr Reiner as “one of the most accomplished American directors who ever lived”.\n\nProminent political figures also paid tribute, including former US president Barack Obama, who wrote on X that he and his wife Michelle were “heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele”.\n\nHe added: “Rob’s achievements in film and television gave us some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of people — and a lifelong commitment to putting that belief into action.”\n\nFormer US vice president Kamala Harris also paid tribute to her “dear friends”, Mr Reiner and his wife.\n\nIn a post on X, Ms Harris said: “Rob and his wife Michele loved each other very much.\n\n“Doug and I are devastated to learn of their passing. Our thoughts are with their loved ones during this tragic time.”\n\nFormer US speaker Nancy Pelosi described the news of Mr Reiner’s death as “devastating”, describing him as “creative, funny, and beloved” in a tribute on X.\n\nMs Pelosi also went on to praise his support of the Californian state-level initiative First 5, which aims to reduce childhood poverty in those up to the age of five years old by offering programs for health, learning, and family support.\n\nShe also noted his activism working to overturn California’s Proposition 8, a constitutional amendment that outlawed same-sex marriages.\n\nShe said: “Rob cared deeply about people and demonstrated that in his civic activities — whether by supporting the First 5 initiative or fighting against Prop 8 in California. Civically, he was a champion for the First Amendment and the creative rights of artists. And professionally, he was an iconic figure in film who made us laugh, cry and think with the movies he created.\n\n“Paul and I and our entire family mourn the loss of our very dear friends and are praying for their loved ones during an unimaginable time of grief.”\n\nThe mayor of Los Angeles, Karen Bass, said Mr Reiner’s death is a “devastating loss”, and wrote on X: “I am heartbroken by the tragic loss of Rob and his wife Michele. I knew Rob and have tremendous respect for him.”\n\nCalifornia state governor Gavin Newsom said: “Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.”\n\nReports say authorities have not yet confirmed the identities of the people found dead.\n\nUS publication Variety said a family spokesman for Mr Reiner confirmed “the tragic passing of Michele and Rob Reiner” to them, in a statement that added: “We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.”\n\nAway from directing, r Reiner also had acting credits, having made a name for himself playing Meathead in the 1970s TV show All In The Family, which aired between 1971-1979 in the US.\n\nHe also appeared in front of the camera in Sleepless In Seattle, The Wolf Of Wall Street, TV series New Girl and most recently in season four of The Bear.\n\nIn September this year, Spinal Tap II: The End Continues, the sequel to the 1984 film, was released, following David St Hubbins (Michael McKean), Nigel Tufnel (Christopher Guest), and Derek Smalls (Harry Shearer), who reunite after a 15-year hiatus, with Mr Reiner starring as documentary filmmaker Martin “Marty” DiBergi.\n\nThe film also featured cameos from Paul McCartney and Elton John.\n\nThe original film followed the band from their beginnings as skiffle group The Originals, through to their time as a 1960s R&B group called The Thamesmen, who had a hit with Gimme Some Money, before eventually becoming Spinal Tap, which begins as a psychedelic band and then moves into heavy metal.","summary":"Authorities are investigating an 'apparent homicide' at Mr Reiner’s home in Los Angeles after police, firefighters and paramedics were called to the property on Sunday","url":"https://www.irishexaminer.com/world/arid-41760332.html","image":"https://www.irishexaminer.com/cms_media/module_img/9797/4898933_1_seoimage1x1_2.4819555.jpg.jpg","video":null,"publish_date":"2025-12-15 11:40:00","author":"Hannah Roberts, Pa Senior Entertainment Reporter,Irishexaminer.com","authors":["Hannah Roberts, Pa Senior Entertainment Reporter","Irishexaminer.com"],"language":"en","source_country":"ie","sentiment":0.457},{"id":387177238,"title":"Rob Reiner dead: Jamie Lee Curtis, Ben Stiller and stars lead tributes after tragic death","text":"Hollywood has been left reeling by the sudden death of director and actor Rob Reiner, who was found dead alongside his wife, Michele Singer Reiner, at their Los Angeles home in what authorities are treating as a homicide.\n\nTributes from across the film industry began to pour in as reports emerged that the bodies of a 78-year-old man and a 68-year-old woman had been discovered by authorities inside a property owned by Reiner in the Brentwood area of Los Angeles.\n\nA spokesperson for the Reiner family later confirmed their deaths on Sunday evening, saying: “We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.” \n\nReiner was a prolific Hollywood director and created some of the most well-known movies of the 1980s and 1990s, including legal thriller A Few Good Men in 1992 and romantic comedy When Harry Met Sally in 1989.\n\nActor-filmmaker Ben Stiller, who has called Reiner a major influence in his career, said the deaths were “a huge loss.” \n\nHe added: “Rob Reiner was one of my favorite directors. He made some of the most formative movies for my generation. He came out from behind a huge comedic shadow of the great Carl Reiner and being a tv actor to being a great director who made an incredible run of movies.”\n\nChristopher Guest, who starred in This Is Spinal Tap and The Princess Bride, and his wife Jamie Lee Curtis said in a joint statement that they were “numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner and our ONLY focus and care right now is for their children and immediate families and we will offer all support possible to help them.\n\n“There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis,” the couple wrote. “We have lost great friends. Please give us time to grieve.”\n\nJohn Cusack, who starred in Reiner’s film The Sure Thing, wrote on X: “Shocked by the death of Rob Reiner – a great man.”\n\nThe Lord Of The Rings star Elijah Wood, who appeared in Reiner’s 1994 family film North, posted: “Horrified to hear of the passing of Rob Reiner and his wonderful wife Michelle. So much love to their kids and family.”\n\nDirector Paul Feig wrote on X: “Rob is one of my heroes. I had the honor of calling him a friend. I pray this isn’t what it sounds like it is. I just saw [him] and Michele two nights ago.” \n\nFellow filmmaker Joe Russo posted: “I can’t handle the truth that one of the greatest filmmakers to ever live is gone. We lost one of the few good men. RIP, Rob Reiner.” \n\nJames Woods said he and Reiner had been friends since they made 1996 thriller Ghosts Of Mississippi together, writing: “The studio didn’t think I was old enough to do the part, but Rob fought for me. Political differences never stood in the way of our love and respect for each other. I am devastated by this terrible event.”\n\nFrozen actor Josh Gad described Reiner as “one of the greatest directors of our time” in a post on Instagram.\n\nHe said: “He was one of the greatest directors of our time. He was a friend. He was simply a beautiful person. Rob Reiner and his wife Michelle were two of the most kind and caring souls you could ever imagine. He cared so much for those who had no voices. This loss is devastating. I cannot express how much this hurts. Love you Rob and Michelle. Thank you for all you gave us.”\n\nProminent political figures also paid tribute, including former US president Barack Obama, who wrote on X that he and his wife Michelle were “heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele”.\n\nHe added: “Rob’s achievements in film and television gave us some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action.”\n\nFormer Vice President of the United States Kamala Harris also paid tribute online to her “dear friends”, sharing on X: “Rob Reiner's work has impacted generations of Americans. \n\n“The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture. Rob loved our country, cared deeply about the future of our nation, and fought for America's democracy. Rob and his wife Michele loved each other very much. \n\n“They were dear friends, and Doug and I are devastated to learn of their passing. Our thoughts are with their loved ones during this tragic time. Reports say authorities have not yet confirmed the identities of the people found dead.”\n\nCalifornia state governor Gavin Newsom said: “Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.”\n\nReiner and his wife Michele were found dead at their home in Los Angeles in what police are treating as a homicide.\n\nThe couple were found in their $13.5 million Brentwood mansion by their daughter, Romy, People magazine reported.\n\nBoth appeared to have suffered stab wounds, sources familiar with the matter have reported. The New York Post reported that the couple’s 32-year-old son, screenwriter Nick Reiner, is a person of interest. \n\nReiner’s other films included his 1984 hit This Is Spinal Tap, and The Princess Bride and Stand By Me in 1987.\n\nHe also had acting credits, having made a name for himself playing Meathead in the 1970s TV show All In The Family, which aired between 1971-1979 in the US.\n\nHe also appeared in front of the camera in Sleepless In Seattle, The Wolf Of Wall Street, TV series New Girl and most recently in season four of The Bear.\n\nIn September this year, Spinal Tap II: The End Continues, the sequel he directed to the 1984 film was released, following David St Hubbins (Michael McKean), Nigel Tufnel (Christopher Guest), and Derek Smalls (Harry Shearer) who reunite after a 15-year hiatus, with Reiner starring as documentary filmmaker Martin ‘Marty’ DiBergi.\n\nThe film also featured cameos from Sir Paul McCartney and Sir Elton John.\n\nThe original film followed the band from their beginnings as the skiffle group, The Originals, through to their time as a 1960s R&B group called The Thamesmen who had a hit with Gimme Some Money, before eventually becoming Spinal Tap, which begins as a psychedelic band before moving into heavy metal.","summary":"Tributes from across the film industry have poured in after the bodies of Reiner and his wife were found in their home","url":"https://www.standard.co.uk/showbiz/rob-reiner-death-hollywood-mourning-b1262584.html","image":"https://static.standard.co.uk/2025/12/15/10/17/GettyImages-1145535190.jpg?width=1200","video":null,"publish_date":"2025-12-15 11:04:35","author":"Lisa McLoughlin","authors":["Lisa McLoughlin"],"language":"en","source_country":"gb","sentiment":0.366},{"id":387105828,"title":"LA police investigate 'apparent homicide' after death of director Rob Reiner and wife Michele","text":"Share your views on our Irish-language content\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nDaft.ie Property\nAllianz Home\nThe 42 Sport\nTG4 Entertainment\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nRob Reiner and his wife Michele Singer pictured at an event together in 2023.Alamy Stock Photo\n\nLA police investigate 'apparent homicide' after death of director Rob Reiner and wife Michele\n\nThe fim community in Los Angeles is in shock following the death of the legendary director. \n\n6.50am, 15 Dec 2025\n\nShare options\n\nLAST UPDATE\n\nLOS ANGLES POLICE ARE investigating the deaths of Hollywood director Rob Reiner and his wife Michele as an “apparent homicide” after the couple was found dead at their southern California mansion.\n\nCondolences poured in for the director as “one of the most significant figures” in the history of film and television, thanks to his smash hit successes like When Harry Met Sally and The Princess Bride.\n\nTributes have also came from the highest levels of US Democratic political circles, as Reiner was an outspoken supporter of liberal causes in Hollywood.\n\nUS media reported that Reiner and his wife Michele Singer Reiner were found dead in their Los Angeles mansion with what appeared to be stab wounds\n\nLos Angeles police did not confirm the identity of the deceased but said homicide detectives were dispatched to the Reiners’ home.\n\n“At this time, no further details are available as this is an ongoing… investigation, into an apparent homicide,” the Los Angeles Police Department said on social media.\n\nLAPD deputy chief Alan Hamilton subsequently told reporters “the Los Angeles Police Department is not seeking anyone as a suspect or as a person of interest, or in any other manner, and we will not be doing that until we conduct our investigation and we move forward”.\n\n“I’m not going to confirm whether someone’s being interviewed at this time or not. We’re going to try to speak to every family member that we can to get to the facts of this investigation,” he added.\n\nBroadcaster CNN reported that a spokesperson for the family had confirmed Reiner and his wife had died.\n\nThe Los Angeles Fire Department told NBC a man and a woman, approximately 78 and 68 years old, were found deceased inside the home.\n\nPolitical heavyweights pay tribute\n\nThe deaths of the director and his wife drew condolences from California political heavyweights like ex-vice president Kamala Harris.\n\nReiner had previously backed efforts to secure equal marriage rights for LGBTQ people and create California’s First 5 programme, which provides child development programs funded by taxes on tobacco products.\n\nAdvertisement\n\nHe also frequently tussled with Donald Trump during the US president’s first term in the White House.\n\nReiner called Trump worse than infamous Hollywood producer Harvey Weinstein in one interview, and later served on the advisory board of a US committee to investigate Russia’s alleged attacks on US democracy.\n\nCalifornia Governor Newsom, Harris and former US President Barack Obama issued separate statements expressing their condolences.\n\nObama hailed Reiner’s “deep belief in the goodness of people” and credited him for a “lifelong commitment to putting that belief into action” in his tribute on social media.\n\n“Together, he and his wife lived lives defined by purpose,” Obama said. “They will be remembered for the values they championed and the countless people they inspired.”\n\nMichelle and I are heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele. Rob’s achievements in film and television gave us some of our most cherished stories on screen. But beneath all of the stories he produced was a deep belief in the goodness of…— Barack Obama (@BarackObama) December 15, 2025 \n\n“Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity,” Newsom said on X, adding he was “heartbroken by the tragic loss”.\n\nCareer on screen and behind the camera\n\nReiner rose to acting fame as the oafish son-in-law Michael ‘Meathead’ Stivic on groundbreaking 1970s sitcom All in the Family, before transitioning to directing with rock mockumentary This is Spinal Tap in 1984.\n\nThat was just the first of a string of hits, as his n 1989 his romantic comedy When Harry Met Sally, starring Billy Crystal and Meg Ryan, was another major success.\n\nAside from those, he also helmed A Few Good Men and adaptations of Stephen King stories for Stand By Me and Misery.\n\nThe Screen Actors Guild – the leading labour union for Hollywood – paid tribute to its long-time member Reiner.\n\nGuild president Sean Astin called Reiner “one of the most significant figures” in the history of film and television whose impact can’t be overstated.\n\n“Tributes will pour in and the impossibly long list of genre defining films and indelible performances will play in our minds and hearts,” Astin said.\n\n“Rob Reiner was a member of our union for nearly 60 years. We send love and warmth to Rob Reiner and Michele Singer Reiner’s families, friends and colleagues. Our entertainment community and audiences around the world will mourn deeply.\n\nOn a personal note, so many of Mr Reiner’s films and performances made me think, made me emotional and especially they made me laugh really hard. That’s how I will remember him.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nEoghan Dalton\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “LA police investigate 'apparent homicide' after death of director Rob Reiner and wife Michele”.\n\nRecipient's Email\n\nFeedback on “LA police investigate 'apparent homicide' after death of director Rob Reiner and wife Michele”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nNews in 60 seconds\n\nA 10 year old girl, a rabbi and a Holocaust survivor among 15 victims in Bondi Beach shooting\n\nThe Daily Poll\nShould congestion charges be introduced in Dublin city centre?\n\n'One of the greatest': Shock at death of acclaimed director and actor Rob Reiner \n\nIrish Jewish community\nIreland's Chief Rabbi says Bondi shooting 'not surprising' given rise in antisemitic rhetoric\n\nGood Morning\nThe 9 at 9: Monday\n\nNew Orleans Saints\n'Dream scenario' - Former Down footballer Charlie Smyth kicks game-winner in NFL\n\nRoad Deaths\nWoman in her 70s dies after Kerry crash as number road victims this year outpaces 2024 \n\nDeath toll climbs to 16 in Bondi Beach terror attack that 'targeted Jewish community'\n\nPolice detain 'person of interest' after two killed in Brown University shooting\n\nFourteen crew members rescued at Dingle Bay after fishing boat runs aground\n\nmore from us\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"The fim community in Los Angeles is in shock following the death of the legendary director.","url":"https://www.thejournal.ie/director-rob-reiner-wife-found-dead-in-los-angeles-6903648-Dec2025/","image":"https://img2.thejournal.ie/article/6903648/river/?height=400&version=6903890","video":null,"publish_date":"2025-12-15 10:36:00","author":null,"language":"en","source_country":"ie","sentiment":0.162},{"id":387117536,"title":"Kamala Harris&#039; 2028 Presidential Chances Get Boost","text":"Former Vice President Kamala Harris is the top choice for the 2028 Democratic presidential nomination, according to a new poll, amid signs she is ramping up for another run at the White House.\n\nHarris clinched 31.1 percent support in the latest survey by Florida-based polling company Big Data Poll, ahead of California Governor Gavin Newsom (20.3 percent) and former Transportation Secretary Pete Buttigieg (10 percent).\n\nIn recent days the former vice president, who lost last year’s presidential election to President Donald Trump, has announced she is expanding her book tour next year, and told attendees at a Democratic National Committee (DNC) meeting in Los Angeles on Friday to have a “clear vision for what comes after the midterms and then after Trump.”\n\n“You,” shouted one member of the audience, according to multiple reports.\n\nFormer Vice President Kamala Harris speaks during The 107 Days book tour hosted by Ana Navarro at the Adrienne Arsht Center for the Performing Arts on November 20, 2025 in Miami Florida. Credit: mpi04/MediaPunch /IPX\n\nThis is a developing story and will be updated.","summary":"The former vice president had more support than California Governor Gavin Newsom in a new poll.","url":"https://www.newsweek.com/kamala-harris-2028-presidential-chances-get-boost-11211876","image":"https://assets.newsweek.com/wp-content/uploads/2025/12/AP25325482553773.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-12-15 10:19:20","author":"Daniel Orton","authors":["Daniel Orton"],"language":"en","category":"politics","source_country":"US","sentiment":0.491},{"id":387128464,"title":"Trump served McDonald's to connect with voters. Now, many feel they can't afford it.","text":"FEASTERVILLE, Pa. — Fishing through his wallet, David Teeling pulls out a wrinkled newspaper clip showing Donald Trump working the drive-thru of a local McDonald's — this McDonald’s, the very same one where he and a few friends routinely meet to talk politics and sports. Teeling keeps the picture as verifiable proof for those who don’t believe him when he explains what happened: The once and future president turned up in suburban Philadelphia toward the end of the 2024 campaign and scooped French fries for the customers pulling up to the window. “Some people believe me and some don’t, so I keep that,” says Teeling, 70, over a cup of coffee. A year ago, Trump visited this site to make the point that he was attuned to everyday people who felt overlooked in the Joe Biden-Kamala Harris economy. These days, it’s Trump who’s in danger of appearing out of touch. Ahead of midterm elections next year, voters are feeling squeezed by high prices and blaming Trump for not doing enough to ease the cost of living, polling shows. A new NBC News Decision Desk survey shows that 53% of adults have changed their grocery-buying habits to stay within budget, while 55% have cut back on entertainment and “extras” so that they can afford life’s necessities. A sampling of grocery prices shows the price of eggs has dropped 29% since Trump was sworn in, though beef prices are up nearly 13%, chicken prices are up 2% and bread is up 4%. Orange juice prices have climbed 28% since the start of Trump's term, according to Nieslen IQ data in the NBC News grocery price tracker. Overall, an AP-NORC poll found that just 31% of adults approved of Trump’s handling of the economy, the lowest rating he’s notched in either his first or second term. “We can improve those numbers,” John McLaughlin, a Trump pollster, said in an interview. “We did it in 2023 and 2024 and we can do it again. In an election year, Trump will be able to spend more time with voters outside the Beltway.” “The White House doesn’t have a choice but to have President Trump campaign in the midterm elections,” McLaughlin added. “Without Trump on the ballot, it’s hard to get his voters to turn out. If you can’t motivate the Trump voters, we’re not going to win in the midterms.” The White House seems to agree. Susie Wiles, Trump’s chief of staff, said in a podcast interview that the idea is to put Trump “on the ballot\" by having him campaign as if it’s 2024 all over again. For Trump, the question is whether he can muster the discipline to consistently deliver a two-part message. He needs to show he grasps that people are struggling while also hammering the point that he’s committed to making their lives better, political strategists say. That’s a tricky balance requiring some humility on Trump’s part, a recognition that “the golden age” he promised at the start of his term is still unrealized. Thus far, Trump blames lingering inflation on Biden, a bogeyman he continues to bash even as the economy bears his imprint with each passing day. He says there is much for voters to cheer, including gas prices, which have fallen from $3.03 a gallon one year ago to $2.92 now; the stock market, where the S&P 500 index is up 16% this year; and new foreign investment in the U.S. totaling trillions of dollars. As for the affordability issue, he calls it a \"hoax\" perpetrated by Democrats. On his social media site last week, Trump wrote that “affordability, just 13 months ago, was a disaster for the American people, but now, it’s totally different! Prices are coming down fast.\" Still, Federal Reserve Chairman Jerome Powell said last week that Trump’s tariffs are pushing inflation higher than the rate would be otherwise. After falling to a low this year of 2.3% in April, inflation rose to 3% in September for the first time since January. September was the last month data was available. Even members of Trump’s own party have said that prices are too high and Republicans can't ignore them. “People aren’t dumb. They know when they go to the grocery store what it costs and what it doesn’t,” Sen. Josh Hawley, R-Mo., told NBC News last week. Michael DuHaime, former political director at the Republican National Committee, put it this way: \"You can continue to talk about Biden or even Obama or Jimmy Carter if you want. The voters will only tolerate it for so long.” Past presidents faced a similar conundrum, with uneven results. No sitting president wants to concede that their economic policies haven’t delivered. Yet a president risks appearing callous by denying what’s obvious to people who can’t afford to buy ground beef at the supermarket. “One of the mistakes we made as part of the Biden team was not leading with more empathy,” Sam Cornale, former CEO of the Democratic National Committee, said in an interview. “We jumped right into trying to explain away the numbers, but voters weren’t feeling it.” An early look at Trump's midterm campaign message unfolded last week when he traveled to a casino resort in the Poconos for a rally devoted to the economy. He showed slides and talked up his record, saying his tariffs are sparking a wave of AI, auto and other types of factory construction. But true to form, he also veered off topic, trashing Biden, Powell, Rep. Ilhan Omar, D-Minn., Minnesota Gov. Tim Walz, late night comedian Jimmy Kimmel, windmills and the African nation of Somalia. “We’re a little behind the 8-ball going into the 2026 election,” said Neil Newhouse, a Republican pollster, in an interview. “The bottom line on the Republican side is we need to focus on what voters are most concerned about: the economy and the cost of living,\" he said, adding that people don't care \"what happens in Somalia or the Middle East or other places. For the most part, they’re focused on their pocketbooks. So that’s what we need to be focused on.” Back at McDonald’s, there is no sign that Trump once traded his suit jacket for an apron in one of his most memorable campaign stops. In the wake of Trump's visit, Yelp disabled its reviews of the restaurant because of caustic write-ups. On occasion, customers will take pictures of the drive-thru window where Trump made his appearance. The staff has turned over since that time; none of the employees at work on a recent weekday were there when Trump showed up. As a company, McDonald's has faced pressures from what its CEO called a \"two-tier economy.\" A steep drop in traffic from lower-income customers played a part in the company's decision to revive its \"Extra Value Meal\" combos this fall, according to chief executive Chris Kempczinski. Teeling said he’s prepared to be patient while Trump’s economic policies kick in. “It has gone up,” he said of the cost of living. “No question about that. But Trump is a CEO. He can turn these things around. It’s going to take a year, maybe two.” Janice Hall, 72, a retired Philadelphia city employee who was eating a cheeseburger and French fries, agrees. “It’s going to slowly go down,” she said. “We haven’t given it any time yet. It’s not even been a year.” She said she’d vote for Trump again if she could. “I think he’s funny; he’s hysterical. He has a personality,” she said. William Sanginiti, 72, a retired engineer, said over a hamburger and a Coke: “There’s always someone who’s going to complain about something. I’m not. I try to live within my means.” A dissenting note came from one of the regulars. Drinking a coffee, a 76-year-old retired truck driver said he doubts Trump will succeed in reducing prices. He said he’s had to alter his spending habits to make ends meet. “I used to eat a lot of beef; I can’t afford that,\" he said, speaking on condition of anonymity. “Even when I see reduced prices at different supermarkets, they’re still on the expensive side.” He mentioned the unemployment rate, which stood at 4.4% in September, the highest it has been in the last four years. “A lot of the people who voted for him, they didn’t vote for the layoffs,” he said.","url":"https://www.nbcnews.com/politics/donald-trump/trump-served-mcdonalds-connect-voters-affordability-economy-polling-rcna248821","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-11/251118-donald-trump-mcdonalds-2-es-f3921d.jpg","video":null,"publish_date":"2025-12-15 10:00:40","author":"Peter Nicholas","authors":["Peter Nicholas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.043},{"id":387275460,"title":"Nancy Pelosi calls female US president in her lifetime unlikely: ‘Marble ceiling’","text":"Nancy Pelosi, the outgoing congresswoman and former House speaker, has conceded that she may not see a woman be elected US president in her lifetime.\n\nThe California Democrat said as much in a USA Today interview published on Sunday with her retirement looming after four decades in Congress – and invoked a turn of phrase referring to a metaphorical barrier impeding advancement in a profession that often confronts women and racial minorities.\n\n“It’s not a glass ceiling. It’s a marble ceiling,” Pelosi told the publication while discussing the defeats her party colleagues Hillary Clinton and Kamala Harris respectively endured against Donald Trump in the 2016 and 2024 presidential elections – as well as institutional resistance she met during her own rise on Capitol Hill.\n\n“I thought certainly the American people are far ahead of the Congress in terms of their acceptance or their enthusiasm for a woman to be president of the United States.”\n\nShe added: “I always thought that a woman would be president of the United States long before a woman would be speaker of the House.”\n\nWith that not occurring, USA Today reported that Pelosi had adjusted her timetable – and even “tempered” her optimism – for when a woman may assume the Oval Office.\n\n“I think it’s … maybe not in my lifetime,” Pelosi, who turns 86 in March, said to the outlet. But she made it a point to predict “within this next generation, there’ll be a woman” serving as US president.\n\nPelosi’s comments in some ways mirror ones delivered by former first lady Michelle Obama in November about whether the US could soon join its North American neighbors Mexico and Canada in having a female chief executive.\n\n“Sadly, we ain’t ready,” the attorney, author and wife of Barack Obama – the US president between 2009 and 2017 – said during a conversation posted on her YouTube page.\n\n“That’s why I’m like: ‘Don’t look at me about running ‘cause you all are lying – you are not ready for a woman.’ We got a lot of growing up to do and there’s still … a lot of men who do not feel like they can be led by a woman, and we saw it.”\n\nNonetheless, Harris, the former US vice-president, has been leading or placing highly in polls of potential 2028 Democratic candidates for the White House. As Axios noted, she also expanded a tour promoting her 2024 campaign memoir 107 Days and appeared before the Democratic National Committee in moves interpreted by many as signs that she is potentially gearing up for another presidential run.\n\nPelosi joined Congress in 1988 to represent San Francisco. She won election to the post 20 times and was the first woman to serve as US House speaker, a role she held from 2007 to 2011 and 2019 to 2023.\n\nIn the USA Today interview, she revisited her role in convincing Joe Biden, her fellow Democrat and longtime political friend, to drop out of seeking re-election to the White House in 2024. She said she and Biden have not spoken ever since he shelved his 2024 campaign before Trump – whom he defeated four years earlier – won a second term.\n\n“I’m saddened by it because I love him and I respect him,” Pelosi told USA Today of her estrangement from Biden. “But I respect his decision in that regard.”\n\nPelosi did say that she was grateful Biden issued a statement declaring her “the best speaker of the House in American history” when she announced in November that she would retire at the end of her final term in January 2027.\n\nOf her decision to retire as an octogenarian, Pelosi said to the publication, “It was time. I mean – I’ve been ready for a while.”\n\nPelosi also reportedly said, with an exasperated tone, that she is commonly asked: “What are you going to do next?”\n\nPelosi told USA Today she mostly replies with something to the effect of: “I don’t have to do anything – I’m old!”","summary":"Former House speaker, 85, expects woman to assume Oval Office this generation but concedes she may not live to see it\n\nNancy Pelosi, the outgoing congresswoman and former House speaker, has conceded that she may not see a woman be elected US president in her lifetime.\n\nThe California Democrat said as much in a USA Today interview published on Sunday with her retirement looming after four decades in Congress – and invoked a turn of phrase referring to a metaphorical barrier impeding advancement in a profession that often confronts women and racial minorities.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/dec/15/nancy-pelosi-female-president","image":"https://i.guim.co.uk/img/media/ac809c2c649abb38a17a9fc0f7f1432010e553e1/397_0_3333_2667/master/3333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-12-15 10:00:29","author":"Ramon Antonio Vargas","authors":["Ramon Antonio Vargas"],"language":"en","source_country":"gb","sentiment":0.179},{"id":387168258,"title":"Former Israeli hostage: Trump’s election instilled fear in Hamas captors","text":"Omer Shem Tov, a 20-year-old Israeli who was held hostage by Hamas in the Gaza Strip for 505 days, has recounted how Donald Trump’s election as U.S. President dramatically altered the behavior of his captors. \n\nKidnapped during the Nova music festival on October 7, 2023, Shem Tov shared his experiences in an interview with Fox News Digital.\n\n“As soon as Trump was elected, I saw the fear in their eyes,” he said. “They knew the situation was going to change… they were very frightened.” According to Shem Tov, this fear led to noticeable changes in his treatment and daily life in captivity after Trump’s victory on November 5, 2024.\n\nDuring the final five months of his detention, Shem Tov was forced to dig, clean, and move explosives in Hamas tunnels, while also carrying food. He described significant stockpiles of supplies kept by his captors, contrasted with the meager rations he received, often only a few biscuits.\n\nShem Tov learned the results of the American election from his captors, who had a television in the tunnels and primarily watched Al Jazeera. He overheard discussions expressing their hope that Kamala Harris would win. “After the election, everything changed,” he said. “The amount of food, their behavior—everything indicated they were preparing for something bigger.” He also described enduring his 21st birthday in captivity, a day marked by fear, extreme hunger, and mistreatment.\n\nReleased in February 2025 under a hostage agreement, Shem Tov later traveled to Washington and met with Donald Trump at the White House. “I told him that many in Israel believed he had been sent by God to help bring back the hostages,” he said. He remains close to the other survivors, describing them as “a second family.”","url":"https://www.i24news.tv/en/news/israel-at-war/survivor-testimonies/artc-former-israeli-hostage-trump-s-election-instilled-fear-in-hamas-captors","image":"https://cdn.i24news.tv/uploads/ad/1c/1c/f9/cf/8d/29/26/be/59/f3/45/9c/ff/bc/27/ad1c1cf9cf8d2926be59f3459cffbc27.jpg","video":null,"publish_date":"2025-12-15 09:12:00","author":null,"language":"en","category":"politics","source_country":"il","sentiment":-0.181},{"id":387053310,"title":"Heartfelt Tributes Flood In Following ‘Devastating Loss’ Of Rob Reiner","text":"High-profile figures from the worlds of entertainment and politics are mourning the death of actor-director Rob Reiner, who was discovered dead — alongside his wife Michele — at their Los Angeles home on Sunday.\n\nAs the Los Angeles Police Department’s Robbery Homicide division launched an investigation into the deaths, tributes were posted online for the moviemaker who frequently boosted Democratic causes and in recent years had become a vocal critic of President Donald Trump.\n\nFormer President Barack Obama said in a statement shared on X that “beneath all of the stories he produced was a deep belief in the goodness of people — and a lifelong commitment to putting that belief into action” and that the couple’s lives were “defined by purpose.”\n\nCalifornia Gov. Gavin Newsom (D) hailed Reiner in a statement as “the big-hearted genius behind so many of the classic stories we love” whose “boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others — and encouraging us to dream bigger. That empathy extended well beyond his films.”\n\nFormer House Speaker Nancy Pelosi (D-Calif.) said it was “hard to think of anyone more remarkable and excellent in every field and endeavor they pursued.” Read Pelosi’s full comments here:\n\nFormer Vice President Kamala Harris, Los Angeles Mayor Karen Bass and actors Elijah Wood, James Woods, John Cusack, Eric Idle, and Ben Stiller also paid their respects in online posts.","url":"https://www.huffpost.com/entry/rob-reiner-tributes_n_693fbf7ae4b00656da39c1a9?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/693fc46a1900004a907f4238.jpeg?cache=8E5O5aaSAy&ops=1778_1000","video":null,"publish_date":"2025-12-15 08:32:27","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"au","sentiment":0.5},{"id":387053242,"title":"Heartfelt Tributes Flood In Following ‘Devastating Loss’ Of Rob Reiner","text":"High-profile figures from the worlds of entertainment and politics are mourning the death of actor-director Rob Reiner, who was discovered dead — alongside his wife Michele — at their Los Angeles home on Sunday.\n\nAs the Los Angeles Police Department’s Robbery Homicide division launched an investigation into the deaths, tributes were posted online for the moviemaker who frequently boosted Democratic causes and in recent years had become a vocal critic of President Donald Trump.\n\nFormer President Barack Obama said in a statement shared on X that “beneath all of the stories he produced was a deep belief in the goodness of people — and a lifelong commitment to putting that belief into action” and that the couple’s lives were “defined by purpose.”\n\nCalifornia Gov. Gavin Newsom (D) hailed Reiner in a statement as “the big-hearted genius behind so many of the classic stories we love” whose “boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others — and encouraging us to dream bigger. That empathy extended well beyond his films.”\n\nFormer House Speaker Nancy Pelosi (D-Calif.) said it was “hard to think of anyone more remarkable and excellent in every field and endeavor they pursued.” Read Pelosi’s full comments here:\n\nFormer Vice President Kamala Harris, Los Angeles Mayor Karen Bass and actors Elijah Wood, James Woods, John Cusack, Eric Idle, and Ben Stiller also paid their respects in online posts.","url":"https://www.huffpost.com/entry/rob-reiner-tributes_n_693fbf7ae4b00656da39c1a9?origin=home-entertainment-feed-unit","image":"https://img.huffingtonpost.com/asset/693fc46a1900004a907f4238.jpeg?cache=8E5O5aaSAy&ops=1778_1000","video":null,"publish_date":"2025-12-15 08:32:27","author":"Lee Moran","authors":["Lee Moran"],"language":"en","source_country":"au","sentiment":0.5},{"id":387229626,"title":"US police probe deaths of director Rob Reiner, wife as ‘apparent homicide’ | Kuwait Times Newspaper","text":"LOS ANGELES: Los Angeles police were investigating the deaths of Hollywood star Rob Reiner and his wife as an “apparent homicide”, as condolences poured in for the director behind hits like “When Harry Met Sally”.\n\nReiner and Michele Singer Reiner were found dead in their Los Angeles mansion with what appeared to be stab wounds, US media reported Sunday.\n\nThe deaths of the “Princess Bride” director and his wife drew condolences from California political heavyweights like ex-vice president Kamala Harris.\n\nLos Angeles police did not confirm the identity of the deceased but said homicide detectives were dispatched to the Reiners’ home. “At this time, no further details are available as this is an ongoing... investigation, into an apparent homicide,” the Los Angeles Police Department said on social media.\n\nLAPD deputy chief Alan Hamilton subsequently told reporters “the Los Angeles Police Department is not seeking anyone as a suspect or as a person of interest, or in any other manner, and we will not be doing that until we conduct our investigation and we move forward”.\n\n“I’m not going to confirm whether someone’s being interviewed at this time or not. We’re going to try to speak to every family member that we can to get to the facts of this investigation,” he added. Broadcaster CNN reported that a spokesperson for the family had confirmed Reiner and his wife had died.\n\nCalifornia Governor Newsom, Harris and former US President Barack Obama issued separate statements expressing their condolences. “Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity,” Newsom said on X, adding he was “heartbroken by the tragic loss”.\n\nLos Angeles Mayor Karen Bass also said that the investigation was ongoing. “I knew Rob and have tremendous respect for him,” Bass said.\n\n“An acclaimed actor, director, producer, writer, and engaged political activist, he always used his gifts in service of others,” she added. The Los Angeles Fire Department told NBC a man and a woman, approximately 78 and 68 years old, were found deceased inside the home.\n\nReiner rose to acting fame as the oafish son-in-law Michael “Meathead” Stivic on groundbreaking 1970s sitcom “All in the Family,” before transitioning to directing with rock mockumentary “This is Spinal Tap” in 1984. Reiner directed the 1989 romantic comedy “When Harry Met Sally,” starring Billy Crystal and Meg Ryan.\n\nHe was also an outspoken supporter of liberal causes in Hollywood, backing efforts to secure equal marriage rights for LGBTQ people and create California’s First 5 program, which provides child development programs funded by taxes on tobacco products. — AFP","url":"https://kuwaittimes.com/article/37143/lifestyle/us-police-probe-deaths-of-director-rob-reiner-wife-as-apparent-homicide/","image":"https://kuwaittimes.com/kuwaittimes/uploads/images/2025/12/15/334950.jpg","video":null,"publish_date":"2025-12-15 08:18:00","author":"Kuwait Times","authors":["Kuwait Times"],"language":"en","source_country":"kw","sentiment":0.13},{"id":387029418,"title":"Schoen: Will Newsom’s record derail White House bid?","text":"Following a series of off-year election wins, and amid growing frustration with the Trump administration, Democrats’ 2028 chances look much brighter than last year at this time.\n\nAs such, California Gov. Gavin Newsom – the current Democratic frontrunner – would figure to have a slightly easier path to the Oval Office, assuming he wins the nomination.\n\nThat being said, while Newsom has very successfully built his national profile, it would be a mistake to overlook his numerous vulnerabilities, any of which could derail his presidential ambitions.\n\nCertainly, the biggest risk to Newsom is his own record in California. \n\nIndeed, the Golden State ranks #50 in affordability according to a US News & World Report ranking at a time when that issue is paramount. \n\nMoreover, despite having the nation’s top-ranked business environment, an economy bigger than India or the United Kingdom, and the benefit of being the home of Silicon Valley, California ranks near the bottom on economic growth (45th). \n\nWorse still, even with California’s tax rate among the highest in the country, the state ranks 42nd in terms of its fiscal stability.\n\nTo be sure, mismanaging California’s finances has been a feature – rather than a bug – of Newsom’s tenure. \n\nFrom FY 2018-2019 – the year before Newsom took office – California’s budget has grown by roughly 61%, a staggering figure.\n\nCalifornia’s $18 billion shortfall – the fourth consecutive year with a deficit – is set to nearly double to $35 billion by FY 2027-2028 according to the nonpartisan Legislative Analyst Office.\n\nTo that end, it’s not simply that Newsom oversaw massive spending and government expansion that makes him particularly vulnerable on his record. \n\nRather, it’s that despite significant spending, Newsom has not delivered solutions to the real problems facing the state.\n\nHomelessness – which California has spent $24 billion combatting since 2019 per analysis from the Hoover Institution – continues to plague the state. \n\nIn fact, from 2019 to 2024, the homeless population increased by “about 30,000, to more than 181,000….California spent the equivalent of about $160,000 per person (based on the 2019 figure)” over five years, yet the situation has only gotten worse.\n\nGoing hand in hand with homelessness is the crime situation. Ranking just 43rd on public safety is not a record to stand on when Americans are concerned about the safety of our streets.\n\nThe same goes for immigration, where Newsom took center stage pushing back on Trump.\n\nAmericans may dislike Trump’s heavy-handedness when it comes to deportations, but they do not want candidates advocating for open borders and amnesty for all.\n\nIt’s easy to imagine Newsom’s Republican – or Democrat – opponents seizing on perceptions of him as weak on crime and too far-left on immigration to hammer him in swing states.\n\nTo be clear, this is not to say Newsom has no shot. \n\nRight now, he’d likely win the Democratic nomination and then could very well win the general election. \n\nFresh off a high profile Proposition 50 win, Newsom’s popularity has soared at home, reaching 56% favorability in polling from the Public Policy Institute of California – up 10-points from June. \n\nSimilarly, he remains the top choice among Democrats for their party’s 2028 nominee, leading Kamala Harris by 6-points (26% to 20%) per RealClearPolitics.\n\nNewsom has also emerged as the most vocal Democratic leader at a time when the party has a large leadership vacuum. \n\nFurther, he is an extremely savvy politician who has taken steps to shift perceptions that he is too far-left. \n\nThis much was on display when Democrats were shunning anyone opposed to their platform, yet Newsom hosted right-wing stalwarts Steve Bannon and the late Charlie Kirk on his podcast. \n\nHe’s also gone on Fox News for debates with conservative hosts, and – vocally at least – come out against some far-left policies as a way of trying to remedy his vulnerabilities.\n\nConversely, California is not remotely representative of the country as a whole.\n\nThus, Newsom’s popularity is unlikely to translate, and it’s dubious whether his rhetoric will make up for his record.\n\nPut another way, Newsom has an uphill challenge convincing voters across the country that his leadership of California qualifies him to lead the country. \n\nWith that in mind, consider California’s problems rebuilding following the Palisades fire.\n\nAs the Wall Street Journal reported, “reminders are everywhere that public officials failed to prepare, failed to respond, and have spent much of the time since…failing to allow homeowners to rebuild.”\n\nEven after the state government – with Newsom’s urging – took steps to cut regulations, the first home in the Palisades was just rebuilt. \n\nThe house cannot be occupied – it’s a show home – yet the fact that just one of the 6,837 structures to be destroyed has been rebuilt is hardly an endorsement of Newsom’s management skills.\n\nFinally, Newsom’s full-throated defense of former President Biden during the 2024 campaign may come back to haunt him.\n\nWhen concerns were growing louder over Biden’s competency, Newsom was one of his staunchest allies, setting up uncomfortable questions over whether Newsom lied to the American people or could not see what millions of voters clearly saw. \n\nUltimately, in spite of these vulnerabilities, Newsom must be considered Democrats’ most likely nominee. He has a larger national profile than virtually any other Democrat, and his ambitions have been obvious for years. \n\nIf he’s successful in the primary, he very well may win a general election if voters are desperate for change from a Trump administration that’s increasingly unpopular.\n\nBut make no mistake, a Gavin Newsom presidency is certainly not a foregone conclusion. Polished as he is, Newsom’s record will come back to bite. And, popular as he may be among Democrats, swing voters in purple states will decide the 2028 election – and they may be more hesitant to buy what he is selling.\n\nDouglas Schoen is a longtime Democratic political consultant.","summary":"Polished as he is, Newsom’s record will come back to bite. And, popular as he may be among Democrats, swing voters in purple states will decide the 2028 election – and they may be more hesitant to buy what he is selling.","url":"https://www.bostonherald.com/2025/12/15/will-gavin-newsoms-record-derail-his-white-house-bid/","image":"https://www.bostonherald.com/wp-content/uploads/2025/12/SUT-L-newsom-prop50-002.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-15 08:16:00","author":"Douglas Schoen","authors":["Douglas Schoen"],"language":"en","category":"politics","source_country":"US","sentiment":0.032},{"id":387165876,"title":"All we know about Rob Reiner's tragic death - search warrant to suspect","text":"Hollywood legend Rob Reiner and his wife Michele Singer Reiner have been discovered dead at their Los Angeles residence. The bodies of the acclaimed actor and director, 78, and his 68-year-old spouse were found at their Brentwood property on Sunday (December 14), with Los Angeles Police confirming they are probing an \"apparent homicide\". As new details emerges from the disturbing case and the devastated family confirmed \"the tragic passing\" of their beloved ones, the Daily Star uncovers everything that we know so far about their deaths. On Sunday night, People magazine reported that Nick Reiner was allegedly involved. The New York Post identified the 32-year-old as a person of interest in the case. However, authorities have not yet verified these claims. The family’s struggles were previously depicted in a film that Rob and Nick co-created a decade ago. Nick Reiner has reportedly battled addiction for many years, a struggle that became the focus of the family’s semi-autobiographical 2015 drama, Being Charlie, The Hollywood Reporter reported. Being Charlie, co-written by Nick Reiner and directed by dad Rob, was a brutally honest look at their family’s battle with Nick’s addiction, with Cary Elwes and Nick Robinson playing their on-screen stand-ins. The film, which debuted at TIFF in 2015, didn’t sugarcoat the chaos as Rob admitted, “When Nick would tell us that it wasn’t working for him, we wouldn’t listen… we listened to [the experts] when we should have been listening to our son.” Michele added: “We were so influenced by these people. They would tell us he’s a liar… and we believed them.” Nick, reflecting on his lowest point, shared: “I got sick of it… I’m not supposed to be out there on the streets and in homeless shelters doing all these … things.” At a Q&A, Rob confessed: “we didn’t set out for it to be cathartic or for it to be therapeutic, but it turned out to be that,” though Nick admitted: “Sometimes it would get overwhelming for me.” Critics said the film exposed “two warring agendas”, a son desperate to show recovery isn’t simple, and a dad hoping for happy endings that aren’t so easy to find. Law enforcement insiders revealed to TMZ.com that the victims at the Brentwood residence sustained wounds \"consistent with a knife [attack]\", though LAPD Deputy Chief Alan Hamilton stressed that officers have not yet pinpointed a suspect. At a press briefing, he stated: \"We have not identified a suspect at this time. No one has been detained.\" PEOPLE confirmed the Los Angeles Fire Department rushed to the couple's residence at approximately 3:30 p. m. on Sunday afternoon to deliver medical assistance, but discovered the pair had already died. The Los Angeles Police Department subsequently verified that the inquiry into this tragedy is being spearheaded by the robbery homicide division, who are handling the deaths as an \"apparent homicide\". A post on X (formerly known as Twitter) from LA Police Department's media relations division read: \"On December 14th, at 3:40 pm, LAPD officers responded to a death investigation in the 200 block of S. Chadbourne Ave. Inside the residence, officers discovered 2 decedents. \"The identity of the decedents has not yet been confirmed. Robbery Homicide Division (RHD) responded to the residence, which has been identified as the home of Rob Reiner. \"At this time, no further details are available as this is an ongoing RHD investigation, into an apparent homicide.\" LAPD Deputy Chief Alan Hamilton said investigators need to get a search warrant to conduct a “full crime scene investigation” at Rob Reiner’s home, CNN reported. He told media: “We’re waiting for the legal process to move forward. \"We have to obtain a search warrant for the residence. Once that is complied with, we will be conducting a full crime scene investigation on the interior and exterior of the residence and the surrounding neighborhood.” The house is in the exact same state as it was when the officers arrived, Hamilton said, as per CNN. Former US President Barack Obama wrote on X that he and his wife, Michelle, are “heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele”. He said: “Rob’s achievements in film and television gave us some of our most cherished stories on screen. \"But beneath all of the stories he produced was a deep belief in the goodness of people — and a lifelong commitment to putting that belief into action. Together, he and his wife lived lives defined by purpose. They will be remembered for the values they championed and the countless people they inspired.” Former US Vice President Kamala Harris described Rob and Michele Reiner as “dear friends” on X, as she wrote: “Rob Reiner’s work has impacted generations of Americans. \"The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture. Rob loved our country, cared deeply about the future of our nation, and fought for America’s democracy. “Rob and his wife Michele loved each other very much. They were dear friends, and Doug and I are devastated to learn of their passing. \"Our thoughts are with their loved ones during this tragic time.” Los Angeles Mayor Karen Bass has since paid her respects to the couple, stating: \"This is a devastating loss for our city and our country. \"Rob Reiner's contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice. An acclaimed actor, director, producer, writer, and engaged political activist, he always used his gifts in service of others. \"Personally, I am heartbroken by the tragic loss of Rob and his wife Michele. I knew Rob and have tremendous respect for him.\" She continued: \"I want to thank all of the first responders who were called to this tragic event. The investigation is ongoing. \"I'm holding all who loved Rob and Michele in my heart.\" California Governor Gavin Newsom also expressed his condolences, saying: \"Rob was the big-hearted genius behind so many of the classic stories we love, with projects as wide-ranging as The Princess Bride to A Few Good Men. \"His boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others – and encouraging us to dream bigger. That empathy extended well beyond his films. Rob was a passionate advocate for children and for civil rights - from taking on Big Tobacco to fighting for marriage equality to serving as a powerful voice in early education. \"He made California a better place through his good works. Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.\" Michele Singer Reiner, who tragically died alongside her husband of over 30 years, was a multi-talented creative force in Hollywood. She launched her career as a photographer, contributing to projects like the “MysteryDisc” video game series and the acclaimed thriller “Misery”, directed by Rob Reiner. Michele also stepped in front of the camera, appearing in Nora Ephron’s holiday comedy “Mixed Nuts”. As a producer, she played a key role in several of her husband’s films, including “Shock and Awe” and the recently released “Spinal Tap II: The End Continues”. Her work on the documentary “Albert Brooks: Defending My Life,” which Rob directed, earned her an Emmy nomination. Michele’s producing credits also include “God & Country,” a documentary exploring Christian nationalism in America. Reiner, the son of actor/director Carl Reiner and actress/singer Estelle Reiner, launched his Hollywood career as an actor, portraying Mike 'Meathead' Stivic in the popular sitcom All in the Family from 1971 to 1979. This role bagged him two Primetime Emmy Awards. His acting portfolio also includes roles in the 1993 rom-com Sleepless in Seattle, The First Wives Club in 1996, the 1998 thriller Primary Colors, and the 2013 film The Wolf of Wall Street. However, he is most renowned for his directing work, which began in the early 1980s with the 1984 music mockumentary This Is Spinal Tap. He then directed Stand by Me (1986), the 1987 fantasy adventure The Princess Bride, and the 1989 rom-com When Harry Met Sally... It was during this time that he met his wife Michele. Reiner continued his directorial journey with the Stephen King adaptation Misery in 1990 and the courtroom drama A Few Good Men in 1992, which earned him an Oscar nomination for Best Picture. His other films include 1995's The American President, And So It Goes in 2014, and 2017's Shock and Awe. His final film saw him return to his roots, bringing Spinal Tap back to the big screen for a sequel, Spinal Tap II: The End Continues, which premiered earlier this year. Reiner was wedded to Penny Marshall from 1971 to 1981, during which time he adopted her daughter from a previous relationship, the actress Tracy Reiner. Subsequently, he tied the knot with photographer Michele, whom he met while filming When Harry Met Sally... The couple went on to have three children together, Jake, Nick and Romy. For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters .","url":"https://www.dailystar.co.uk/news/latest-news/know-rob-reiners-tragic-death-36401481","image":"https://i2-prod.dailystar.co.uk/article36401482.ece/ALTERNATES/s1200b/3_Obit-Rob-Reiner-25349137836195.jpg","video":null,"publish_date":"2025-12-15 07:45:59","author":"Andrea Oldereide","authors":["Andrea Oldereide"],"language":"en","source_country":"gb","sentiment":0.119},{"id":387112016,"title":"Tributes paid following death of director Rob Reiner and his wife Michele","text":"The couple were found dead at their Los Angeles home, according to a law enforcement official briefed on the investigation. The official could not publicly discuss details of the investigation and spoke to The Associated Press on condition of anonymity. Investigators believe they suffered stab wounds and a family member is being questioned. The Los Angeles Fire Department said it responded to a medical aid request shortly after 3.30pm on Sunday (local time) and found a 78-year-old man and 68-year-old woman dead inside. Detectives with the Robbery Homicide Division were investigating an \"apparent homicide\" at Reiner&apos;s home, said captain Mike Bland of the Los Angeles Police Department. A spokesperson for the Reiner family confirmed their deaths in a statement to media on Sunday evening. \"It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner,\" the family spokesperson said in a statement reported by the Guardian. \"We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.\" Los Angeles police have not confirmed the identities of the people found dead at the residence in the upscale Brentwood neighbourhood. There was an outpouring of grief on social media, including from former US president Barack Obama, who said he and his wife Michelle were \"heartbroken\" by the news. \"They will be remembered for the values they championed and the countless people they inspired,\" Obama wrote. Los Angeles mayor Karen Bass said Reiner’s death was a \"devastating loss for our city and country\". \"Rob Reiner’s contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice,\" she said. Former US vice president Kamala Harris said Reiner&apos;s \"work has impacted generations of Americans\", saying the director \"fought for America&apos;s democracy\". Reiner is one of the most prolific directors in Hollywood, and his work includes some of the most memorable movies of the 1980s and &apos;90s, including This is Spinal Tap, A Few Good Men, When Harry Met Sally and The Princess Bride. His role as Meathead in the 1970s TV classic All in the Family, alongside Carol O&apos;Connor&apos;s Archie Bunker, catapulted him to fame. Reiner turned 78 in March. The son of comedy legend Carl Reiner, Rob Reiner has been married to photographer Michele Singer Reiner since 1989. The two met while he was directing When Harry Met Sally and have three children together. Reiner was previously married to actor-director Penny Marshall from 1971 to 1981. He adopted her daughter, Tracy Reiner. Carl Reiner died in 2020 at age 98 and Marshall died in 2018. Killings are rare in the Brentwood neighbourhood. The scene is about 2km from the home where O.J. Simpson&apos;s wife Nicole Brown Simpson and her friend Ron Goldman were killed in 1994. download our app subscribe to our newsletter</b","summary":"Barack Obama said the actor and director's \"achievements in film and television gave us some of our most cherished stories on screen\".","url":"https://www.sbs.com.au/news/article/rob-reiner-wife-michele-dead/n6fenmsor","image":"https://images.sbs.com.au/dims4/default/6f1a5be/2147483647/strip/true/crop/3757x2113+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F6c%2F06%2F0b665436426881ec524358407be6%2Fgettyimages-497372034.jpg","video":null,"publish_date":"2025-12-15 07:06:25","author":"Getty / Walter McBride/wireimage","authors":["Getty / Walter McBride/wireimage"],"language":"en","source_country":"au","sentiment":0.317},{"id":387038940,"title":"Gavin Newsom Mocks Trump For Making An Easily Debunked Claim About California","text":"California Governor Gavin Newsom is calling out President Donald Trump again for spreading misinformation.\n\nOn Sunday, Trump doubled down on his repeated, false claims about rigged elections, claiming this time that he would’ve won California in the 2024 presidential election if he hadn’t been cheated by the Democratic party. \n\nThe president made the comments while delivering remarks at a White House Christmas reception. \n\n“If the vote in California was legitimate, which it’s not. If 38 million ballots … Everything is mail-in voting. They mail out 38 million ballots and they come in — where the hell do they go and where do they come from?” he asked the crowd. \n\nThe right-wing leader continued, “It’s a rigged election in California because we would win California by a lot. And again, they feel they have the advantage with the Hispanic, they don’t because I won the Hispanic vote.”\n\nTrump’s opponent in the 2024 presidential race, former Vice President Kamala Harris, won the 54 electoral votes in California by a sizeable margin, according to multiple polls. \n\nTrump also accused California of being “so rigged” more than “any other [state].”\n\nNewsom didn’t hesitate to mock Trump for his erroneous claims on Sunday. \n\nIn an X post alongside a clip of the president’s comments, the California governor simply wrote, “Hahahahahahahahaha ok.” \n\nEarlier in his speech at the White House, Trump accused Democrats of being “professionals at cheating” in elections.\n\nClaiming that “we won in [the] 2016 [presidential election] by a lot,” Trump went on to allege that his administration has “truckloads” of evidence to show Democrats “rigged” the 2020 election. \n\n“We have all the ammunition, all the stuff, and you’ll see it come out. It’s coming out in truckloads. But then we won again in 2024 with an election we call ‘too big to rig,’” he said. “And we were leading big in the polls, but I said, ‘Go out and vote, you gotta go out and vote, make it too big to rig.’” \n\nTrump added, “[The Democrats] tried to rig it, but they couldn’t do it. It was too big to rig … too many votes.” \n\nWatch Trump’s full remarks below.","summary":"California Governor Gavin Newsom is calling out President Donald Trump again for spreading misinformation.\n\nOn Sunday, Trump doubled down on his repeated, false claims about rigged elections, claiming this time that he would’ve won California in the 2024 presidential election if he hadn’t been cheated by the Democratic party. \n\nThe president made the comments while delivering remarks at a White House Christmas reception. \n\n“If the vote in California was legitimate, which it’s not. If 38 million ballots … Everything is mail-in voting. They mail out 38 million ballots and they come in — where the hell do they go and where do they come from?” he asked the crowd.  \n\nThe right-wing leader continued, “It’s a rigged election in California because we would win California by a lot. And again, they feel they have the advantage with the Hispanic, they don’t because I won the Hispanic vote.”\n\nTrump’s opponent in the 2024 presidential race, former Vice President Kamala Harris, won the 54 electoral votes in California by a","url":"https://www.huffingtonpost.co.uk/entry/gavin-newsom-mocks-trump-for-making-an-easily-debunked-claim-about-california_uk_693fa972e4b0c1ae50e23873","image":"https://img.huffingtonpost.com/asset/693f2c5319000041667f4191.jpeg?cache=V2hNutBd01&ops=500_281%2Cscalefit_1200_630","video":null,"publish_date":"2025-12-15 06:26:02","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"gb","sentiment":-0.859},{"id":387023596,"title":"Rob Reiner used his fame to advocate for progressive causes. 'Just a really special man. A terrible day'","text":"Rob Reiner was known to millions as a TV actor and film director. But the Brentwood resident, known for the classic films \"Stand by Me\" and \"When Harry Met Sally,\" was also a political force, an outspoken supporter of progressive causes and a Democratic Party activist who went beyond the typical role of celebrities who host glitzy fundraisers. Reiner was deeply involved in issues that he cared about, such as early childhood education and the legalization of gay marriage. Reiner, 78, and his wife, Michelle Singer Reiner, were found dead inside his home Sunday, sparking an outpouring of grief from those who worked with him on a variety of causes. Ace Smith — a veteran Democratic strategist to former Vice President Kamala Harris, Gov. Gavin Newsom, former Gov. Jerry Brown and presidential candidate Hillary Clinton — had known Reiner for decades. Reiner, he said, approached politics differently than most celebrities. \"Here's this unique human being who really did make the leap between entertainment and politics,\" Smith said. \"And he really spent the time to understand policy, really, in its true depth, and to make a huge impact in California.\" Reiner was a co-founder of the American Foundation for Equal Rights, the organization that successfully led the fight to overturn Proposition 8, the 2008 ballot measure that banned same-sex marriage. He was active in children's issues through the years, having led the campaign to pass Proposition 10, the California Children and Families Initiative, which created an ambitious program of early childhood development services. Proposition 10 was considered landmark policy. Reiner enlisted help in that effort from Steven Spielberg, Robin Williams, and his own father, comedy legend Carl Reiner. \"He wanted to make a difference. And he did, and he did profoundly,” Smith said. After Proposition 10 passed, Reiner was named the chair of the California Children and Families Commission, also known as First 5 California. He resigned from the post in early 2006 after the commission ran $23 million in ads touting the importance of preschool as Reiner was gathering support for Proposition 82. The measure, which was unsuccessful, would have taxed the wealthy to create universal preschool in California. The filmmaker and his wife spent more than $6 million on the failed proposition. They also donated significant sums to support national Democratic Party groups and candidates including Jerry Brown, Gray Davis, Ed Rendell and Andrew Cuomo. Bruce Fuller, a UC Berkeley professor of education and public policy, called Reiner \"a caring and vigilant advocate for children. He added cachet and cash to California's movement to open preschools for tens of thousands of young families over the past quarter-century.\" Former Los Angeles Mayor Antonio Villaraigosa, who had known Reiner since he was a state lawmaker in the 1990s, worked with him on Proposition 10 and was impressed with how Reiner embraced the cause. \"He was a man with a good answer. It wasn't politics as much as he was always focused on the humanity among us,\" Villaraigosa said. 'When he got behind an issue, he knew everything about it.\" \"Just a really special man. A terrible day,\" the former mayor said. Mayor Karen Bass said in a statement that she was \"heartbroken\" by the day's events, saying Reiner \"always used his gifts in service of others.\" \"Rob Reiner’s contributions reverberate throughout American culture and society, and he has improved countless lives through his creative work and advocacy fighting for social and economic justice,\" the mayor said. \"I'm holding all who loved Rob and Michele in my heart,” Bass said. Newsom added, \"Rob was a passionate advocate for children and for civil rights — from taking on Big Tobacco, fighting for marriage equality, to serving as a powerful voice in early education. He made California a better place through his good works.\" “Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity,” the governor said.","summary":"The Hollywood director known for 'Stand by Me' and 'When Harry Met Sally' was also a political force and an outspoken voice for same-sex marriage and early childhood education.","url":"https://www.latimes.com/california/story/2025-12-14/rob-reiner-used-his-fame-to-advocate-for-progressive-causes","image":"https://ca-times.brightspotcdn.com/dims4/default/8af4a59/2147483647/strip/false/crop/3152x2144+0+0/resize/1486x1011!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fzbk%2Fdamlat_images%2FLA%2FLA_PHOTO_ARCHIVE%2FSDOCS%2836%29%2","video":null,"publish_date":"2025-12-15 06:02:53","author":"David Zahniser,Seema Mehta","authors":["David Zahniser","Seema Mehta"],"language":"en","source_country":"us","sentiment":0.364},{"id":387189284,"title":"Ruben Gallego emerges as key Democratic figure in Latino voter outreach","text":"MIAMI (AP) — On a warm Sunday morning in Miami, Sen. Ruben Gallego stepped out of a car and approached parishioners exiting a church beneath palm trees, handing out flyers in this Dominican neighborhood. Gallego left some of his staff members behind as he drummed up support for a fellow Democrat running to be the next mayor of the majority-Hispanic city.\n\n“Mucho gusto,” he told the churchgoers, Spanish for “nice to meet you.”\n\n“Soy Ruben Gallego de Arizona,” he said, introducing himself without mentioning he is a U.S. senator.\n\nThe Arizona Democrat is emerging as a crucial surrogate for a party desperately seeking to win back the Latino support that slipped in 2024 with the election of President Donald Trump. His fall travels have included trips to New Jersey, Virginia and Florida, where he campaigned for Democrats who went on to win their elections. Strategists say Gallego is flexing his muscle as a rising star for the party while also laying the groundwork for a 2028 presidential run despite not being a household name like California Gov. Gavin Newsom or U.S. Rep. Alexandria Ocasio-Cortez.\n\nIt’s a role Gallego is expected to continue next year, when Democrats hope to break Republicans’ hold on Congress and counter Trump’s agenda.\n\n“Ruben Gallego is going to be our not-so-secret, secret weapon,” said Maria Cardona, a longtime Democratic operative and member of the Democratic National Committee.\n\nA surrogate in high demand\n\nGallego is among the Democrats named as possible 2028 contenders who had the busiest travel calendar in 2025. He stumped for Democratic female candidates in New Jersey’s and Virginia’s gubernatorial races and Miami’s mayoral race.\n\n“Ruben brings instant validation to them not only because his last name is Gallego,” said Chuck Rocha, who mobilized Latinos for U.S. Sen. Bernie Sanders’ presidential bid in 2020 and for Gallego in 2024. “He’s risked his life for his country, he grew up in an immigrant household from nothing, and now he’s a U.S. senator. That’s the kind of guy you want standing beside you talking to Latinos about why they should vote for this white woman.”\n\nIn the 2024 presidential election, Trump made inroads in heavily Puerto Rican areas of eastern Pennsylvania, turned South Texas’ Rio Grande Valley and improved his numbers along Florida’s Interstate 4 corridor by focusing heavily on the economy and border security.\n\nBut results from recent elections have shown signs that key voting groups, including Hispanics, were shifting away from Republicans. And in Miami, Eileen Higgins became the first Democratic mayor to be elected in nearly 30 years.\n\n“We’re going to places where there’s big Latino populations,” Gallego told The Associated Press in Miami. “Obviously, they swung a little too much in our opinion toward Trump last time, and we wanna talk to Democrats and we wanna talk to Latinos, we wanna talk to candidates about how to get that population back into our corner.”\n\nGallego himself outperformed Vice President Kamala Harris in 2024, when he won a Senate seat in Arizona by more than 2 points while Trump carried the state by nearly 6 points. And, he gives the Republican president credit for his border security measures and, at times, praises Trump’s blunt style for not overthinking economic proposals when crafting his populist messaging with ideas such as “no tax on tips.”\n\n“We need to be identified as someone who’s pro-working class,” Gallego said at a recent event.\n\nHow affordability is personal\n\nGallego grew up in poverty in Chicago’s Evergreen Park and frequented Little Village, a predominantly Mexican neighborhood on the city’s southwest side. He was raised by a single mother after his father left the family and was imprisoned for dealing drugs. Gallego worked multiple jobs to help pay the bills while still in high school. He was accepted to Harvard University, joined the Marines and fought in Iraq with a unit that sustained heavy casualties.\n\n“All of the Democrats are now talking about affordability, affordability, affordability,” said Jesse Lehrich, a Democratic strategist. “But how many of those actually know what it feels like to not know where the next rent check is going to come from? Or not know how they’re going to pay for groceries this week?”\n\nLehrich, who is closely tracking the 2028 contenders’ travels and media appearances, said there are not very many top-tier Democrats who sound like regular people, adding that, in contrast, Gallego can be “rough around the edges.”\n\nThe senator, who previously served in the U.S. House, likes boasting that he did not listen to the Washington establishment when he decided to host watch parties for boxing matches and organized a rodeo and a low rider car show, dismissing concerns that it would be perceived as condescending to Hispanic supporters.\n\nHe does not come across as polished as others like Pennsylvania Gov. Josh Shapiro or former Transportation Secretary Pete Buttigieg, but Lehrich says that may work in Gallego’s favor because people are craving rawness.\n\n“He kind of feels perfect for the moment,” Lehrich said.\n\nA Latino on the GOP side\n\nSome strategists and commentators say the Democratic Party has not done a good job at elevating Hispanic candidates at a national level. They worry Republicans are propping up another former Latino senator, now Secretary of State, Marco Rubio, who ran for president in 2016 and is often mentioned by Trump when talking about 2028.\n\nXochitl Hinojosa, a political commentator, said she sees Gallego’s strength not only in appealing to Latino voters, but also in the broader electorate in battleground areas, emphasizing how hard it is for a candidate to pull himself over the finish line when the presidential candidate does not do it in that state.\n\n“I think him winning a very tough seat has catapulted him to the top,” Hinojosa said. “Democrats need to think through how we need to think about Latinos if Republicans have a Latino on the ticket and Democrats don’t.”\n\nAsked about a possible 2028 presidential bid, Gallego indicated it was too early to say.\n\n“My calculation is I have three kids. And I have six years in the Senate,” he said. “We’re going to focus on that, and we’re here to help Democrats all across the country, and we’ll see what happens in the future.”\n\nThis story has been corrected to show Gallego grew up in Evergreen Park, not Little Village.","summary":"MIAMI (AP) — On a warm Sunday morning in Miami, Sen. Ruben Gallego stepped out of a car and approached parishioners exiting a church beneath palm trees, handing out flyers in this Dominican neighborhood. Gallego left some of his staff…","url":"https://www.thestar.com/news/world/united-states/ruben-gallego-emerges-as-key-democratic-figure-in-latino-voter-outreach/article_c268ef7c-5830-597b-a77a-56ae913c6037.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/5/3b/53b8ae7d-7460-584c-80a4-290d065b3bba/693f982955f23.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-12-15 05:05:13","author":"Adriana Gomez Licon The Associated Press","authors":["Adriana Gomez Licon The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.096},{"id":387106424,"title":"Ruben Gallego is aiding Democrats with Latino voter outreach","text":"MIAMI (AP) — On a warm Sunday morning in Miami, Sen. Ruben Gallego stepped out of a car and approached parishioners exiting a church beneath palm trees, handing out flyers in this Dominican neighborhood. Gallego left some of his staff members behind as he drummed up support for a fellow Democrat running to be the next mayor of the majority-Hispanic city. \n\n“Mucho gusto,” he told the churchgoers, Spanish for “nice to meet you.”\n\n“Soy Ruben Gallego de Arizona,” he said, introducing himself without mentioning he is a U.S. senator. \n\nThe Arizona Democrat is emerging as a crucial surrogate for a party desperately seeking to win back the Latino support that slipped in 2024 with the election of President Donald Trump. His fall travels have included trips to New Jersey, Virginia and Florida, where he campaigned for Democrats who went on to win their elections. Strategists say Gallego is flexing his muscle as a rising star for the party while also laying the groundwork for a 2028 presidential run despite not being a household name like California Gov. Gavin Newsom or U.S. Rep. Alexandria Ocasio-Cortez.\n\nIt’s a role Gallego is expected to continue next year, when Democrats hope to break Republicans’ hold on Congress and counter Trump’s agenda. \n\n“Ruben Gallego is going to be our not-so-secret, secret weapon,” said Maria Cardona, a longtime Democratic operative and member of the Democratic National Committee. \n\nA surrogate in high demand\n\nGallego is among the Democrats named as possible 2028 contenders who had the busiest travel calendar in 2025. He stumped for Democratic female candidates in New Jersey’s and Virginia’s gubernatorial races and Miami’s mayoral race.\n\n“Ruben brings instant validation to them not only because his last name is Gallego,” said Chuck Rocha, who mobilized Latinos for U.S. Sen. Bernie Sanders’ presidential bid in 2020 and for Gallego in 2024. “He’s risked his life for his country, he grew up in an immigrant household from nothing, and now he’s a U.S. senator. That’s the kind of guy you want standing beside you talking to Latinos about why they should vote for this white woman.”\n\nIn the 2024 presidential election, Trump made inroads in heavily Puerto Rican areas of eastern Pennsylvania, turned South Texas’ Rio Grande Valley and improved his numbers along Florida’s Interstate 4 corridor by focusing heavily on the economy and border security. \n\nBut results from recent elections have shown signs that key voting groups, including Hispanics, were shifting away from Republicans. And in Miami, Eileen Higgins became the first Democratic mayor to be elected in nearly 30 years. \n\n“We’re going to places where there’s big Latino populations,” Gallego told The Associated Press in Miami. “Obviously, they swung a little too much in our opinion toward Trump last time, and we wanna talk to Democrats and we wanna talk to Latinos, we wanna talk to candidates about how to get that population back into our corner.”\n\nGallego himself outperformed Vice President Kamala Harris in 2024, when he won a Senate seat in Arizona by more than 2 points while Trump carried the state by nearly 6 points. And, he gives the Republican president credit for his border security measures and, at times, praises Trump’s blunt style for not overthinking economic proposals when crafting his populist messaging with ideas such as “no tax on tips.”\n\n“We need to be identified as someone who’s pro-working class,” Gallego said at a recent event.\n\nHow affordability is personal\n\nGallego grew up in poverty in Chicago’s Little Village, a predominantly Mexican neighborhood on the city’s southwest side. He was raised by a single mother after his father left the family and was imprisoned for dealing drugs. Gallego worked multiple jobs to help pay the bills while still in high school. He was accepted to Harvard University, joined the Marines and fought in Iraq with a unit that sustained heavy casualties.\n\n“All of the Democrats are now talking about affordability, affordability, affordability,” said Jesse Lehrich, a Democratic strategist. “But how many of those actually know what it feels like to not know where the next rent check is going to come from? Or not know how they’re going to pay for groceries this week?” \n\nLehrich, who is closely tracking the 2028 contenders’ travels and media appearances, said there are not very many top-tier Democrats who sound like regular people, adding that, in contrast, Gallego can be “rough around the edges.” \n\nThe senator, who previously served in the U.S. House, likes boasting that he did not listen to the Washington establishment when he decided to host watch parties for boxing matches and organized a rodeo and a low rider car show, dismissing concerns that it would be perceived as condescending to Hispanic supporters. \n\nHe does not come across as polished as others like Pennsylvania Gov. Josh Shapiro or former Transportation Secretary Pete Buttigieg, but Lehrich says that may work in Gallego’s favor because people are craving rawness.\n\n“He kind of feels perfect for the moment,” Lehrich said. \n\nA Latino on the GOP side\n\nSome strategists and commentators say the Democratic Party has not done a good job at elevating Hispanic candidates at a national level. They worry Republicans are propping up another former Latino senator, now Secretary of State, Marco Rubio, who ran for president in 2016 and is often mentioned by Trump when talking about 2028. \n\nXochitl Hinojosa, a political commentator, said she sees Gallego’s strength not only in appealing to Latino voters, but also in the broader electorate in battleground areas, emphasizing how hard it is for a candidate to pull himself over the finish line when the presidential candidate does not do it in that state.\n\n“I think him winning a very tough seat has catapulted him to the top,” Hinojosa said. “Democrats need to think through how we need to think about Latinos if Republicans have a Latino on the ticket and Democrats don’t.”\n\nAsked about a possible 2028 presidential bid, Gallego indicated it was too early to say. \n\n“My calculation is I have three kids. And I have six years in the Senate,” he said. “We’re going to focus on that, and we’re here to help Democrats all across the country, and we’ll see what happens in the future.”","url":"https://apnews.com/article/ruben-gallego-democrats-latino-senator-ab9b48c24fcdbc4eb54bcddc48a82a66","image":"https://dims.apnews.com/dims4/default/84d8279/2147483647/strip/false/crop/4236x2824+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F03%2Fd08f06ff30a1813b0599164397c6%2F694cfc8d222849ada866b35eb9b9cb20","video":null,"publish_date":"2025-12-15 05:03:36","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.096},{"id":387022664,"title":"Liberal Lowlife: Mark Kelly","text":"The senior Senator from Arizona is the perfect contrast between resume and execution. On paper, the bald phallus model has the ideal life. He was a fighter pilot, he was an astronaut and the attempted murder of his wife by a crazed leftist brings in a lot of sympathy too. But his character made him lose out to being chosen as running mate for Kamala Harris to a guy who lied about his military service and his even his high school football coaching job.\n\nHow big a scumbag do you have to be to lose out to a guy who lied about his rank and serving in combat? As you might imagine, it involves his fidelity to something important, and it isn’t the truth.\n\nThese are just rumors, of course, as far as the general public knows. The Harris campaign paid people to dig beneath the rumors; what they found remains their little secret. It is, however, worthy of note that while they have expressed disappointment over picking Fraudie Murphy, Minnesota Governor Tim Walz, no one has ever expressed regret about NOT picking Mark Kelly. It’s the difference between being upset over your fantasy football quarterback being injured in week one and using your first round draft pick to choose Arron Hernandez.\n\nKelly might be the only person I’ve ever heard brag about their service in the first Gulf War. Not that there wasn’t danger or it is something those who served shouldn’t be proud of, but it was very short and the Iraqi military turned out to be significantly less a threat than was publicly thought prior to the war.\n\nStill, Kelly did fly his planes and drop his bombs, so there’s that. Still, he talks about it like it was Midway.\n\nThen he went to space, which is cool. He delivered a lot of cargo as a Space Shuttle pilot. I’ve never heard any other Space Shuttle pilot talk about their service like they’d cured a disease like Kelly does, they downplay it. It’s not like being an intergalactic Door Dasher, but still…\n\nKelly then retired from NASA to focus on his family, especially since his wife had been horribly injured when a lunatic tried to kill her at a public event. He wanted to help her write her book and focus on spending time with his family, according to him at the time.\n\nAfter a few years, Kelly made a bunch of money off China and had had enough of his family, so he decided to run for the Senate on his biography and the attack on his wife. He won because his biography, on paper, is impressive, and the attack on his wife was horrible.\n\nSince winning, Mark Kelly has served without distinction. A few self-serving laws regarding Arizona Indian tribes and “co-sponsoring” bills that became law – which is literally the least a Member of Congress can do – and that’s about all he’s done.\n\nHe is still milking his military service, only this time in an attempt to undermine the chain of command. It’s gross, really.\n\nMark Kelly now spends his days kissing the asses of wealthy Democrat donors, sucking up to celebrities and trying to bilk poor people out of what remains on their high-interest credit cards in the hope of running for president in 2028. See, while being a sketchy guy with low character is a disqualifying trait as a running mate, there is no background check when it comes to winning a party’s nomination.\n\nAll the while, he ducks behind his disabled wife every time righteous and justified criticism is hurled his way. It’s gross. He’s gross. He’s also the most frequent emailer to fundraising lists on the left.\n\nHe has sent 13 emails begging for money since December 2nd, with subject lines like “I will not give up on our country” and “President Trump is calling for me to be hanged.” The bald bag of douche is desperate to exploit his popularity among the hate America crowd. It’s hard to feel bad for morons being conned out of their money, but it does add a level of scumbagery when the guy doing it spends his time insisting he’s a hero, a sentiment no person not on his payroll appears to share.\n\nMark Kelly is the perfect Democrat: a shameless self-promoter, perfectly willing to take money from anyone, shady and sleazy business and personal history and quick to duck behind his wife when anyone calls him out on any of it. I’d peg Kelly’s chances of securing the Democratic nomination at this point at about 27 percent.\n\nDerek Hunter is the host of the Derek Hunter Show on WMAL in Washington, DC, and has a free daily podcast (subscribe!) and author of the book, Outrage, INC., which exposes how liberals use fear and hatred to manipulate the masses, and host of the weekly “Week in F*cking Review” podcast where the news is spoken about the way it deserves to be. Follow him on Twitter at @DerekAHunter.","url":"https://townhall.com/columnists/derekhunter/2025/12/15/democrat-douchebag-profiles-mark-kelly-n2667872","image":"https://media.townhall.com/cdn/hodl/2025/101/7f0baa4e-b6da-435d-aae1-28ec0e751f23.jpg","video":null,"publish_date":"2025-12-15 05:01:00","author":"Derek Hunter","authors":["Derek Hunter"],"language":"en","source_country":"us","sentiment":-0.241},{"id":387253916,"title":"Son arrested after Rob Reiner and wife found dead in LA home","text":"Rob Reiner’s son, Nick Reiner, has been taken into custody after the deaths of the director-writer and his wife Michele, a law enforcement official told the Associated Press.\nThe official confirmed the 32-year-old was in police custody on Monday. The official could not publicly discuss details of the investigation and spoke on condition of anonymity.\nOnline jail records show Reiner was booked by Los Angeles police and remained in jail on Monday. It was not immediately clear what charges he would face. The online records showed a US$4 million bail had been set.\nRepresentatives for Reiner’s family did not immediately respond to a request for comment and it was not immediately clear if Nick Reiner had a lawyer who could speak on his behalf.\nLong-time director Reiner, 78, and his wife, 68, were found dead in their Los Angeles home on Sunday in what police had described as an apparent homicide.\n\nA spokesperson for the Reiner family confirmed the deaths on Sunday evening.\n“It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner,” the family spokesperson said in a statement. “We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.”\nLaw enforcement sources had told The Los Angeles Times that a family member was being interviewed in connection with the deaths.\nThe sources, who were not authorised to speak publicly about the ongoing investigation, confirmed that there was no sign of forced entry into the home.\nDetectives with the Robbery Homicide Division were investigating an “apparent homicide” at Reiner’s home, said Captain Mike Bland with the Los Angeles Police Department (LAPD).\nAt a press conference late on Sunday, LAPD Chief Detective Alan Hamilton released little information about the case.\nHe said officers were working to secure a search warrant before launching a “thorough” investigation inside the residence.\n“At this time, the Los Angeles Police Department is not seeking anyone as a suspect or as a person of interest … and we will not be doing that until we conduct our investigation and we move forward,” Hamilton said.\nHe said many family members would be interviewed but that “no one has been detained; no one is being questioned as a suspect”.\n\n“We are going to try to speak to every family member that we can to get to the facts of this investigation.”\nEarlier Sunday, Margaret Stewart, a Los Angeles Fire Department spokesman, said the department was called to the residence around 3.30pm for medical aid. Inside the home, the two bodies were found.\nReiner had a five-decade-long career in Hollywood.\nEarly in his career, he played Michael “Meathead” Stivic on the iconic sitcom All in the Family from 1971 to 1979, alongside Carroll O’Connor as Archie Bunker.\nAs a director, Reiner helmed a string of hits including When Harry Met Sally, The Princess Bride and This Is Spinal Tap. His work took a dramatic turn when he directed the 1986 adaptation of Stephen King’s novella Stand by Me.\nReiner was nominated for an Academy Award for 1993’s A Few Good Men, which starred Jack Nicholson and Tom Cruise, though the movie lost to Clint Eastwood’s western Unforgiven.\nReiner, a native of New York City and son of the late comedy writer and actor Carl Reiner, was also well known for his political activism.\n\nIn the 2004 presidential election, he backed Democratic candidate John Kerry and featured in advertisements taking aim at incumbent President George W. Bush. Reiner also supported Democratic presidential hopefuls Al Gore and Hillary Clinton.\nReiner was married to Penny Marshall, star of Laverne & Shirley, from 1971 to 1981. He met Michele Singer on the set of When Harry Met Sally and the two married in 1989, the year the movie came out.\nMichele began producing films over the last decade, including Shock and Awe, Albert Brooks: Defending My Life and Spinal Tap II: The End Continues, all directed by her husband. She also produced God & Country, a look at Christian nationalism in the US.\nBefore her production career, she was a photographer who captured the image of Donald Trump that appears on the cover of his book Trump: The Art of the Deal.\nThe deaths drew condolences from political heavyweights like California Governor Newsom, former US Vice-President Kamala Harris and former US President Barack Obama, as well as entertainment industry figures.\n“Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity,” Newsom said on X, adding he was “heartbroken by the tragic loss”.\nKillings are rare in the Brentwood neighbourhood. The scene is a short distance from the home where O.J. Simpson’s wife Nicole Brown Simpson and her friend Ron Goldman were killed in 1994.\nBy Sunday evening, law enforcement had swarmed Reiner’s sprawling estate, though an eerie quiet hung over Chadbourne Avenue, which had been sealed from the public with yellow crime scene tape.\nPolice cars were stationed at either end of the block where the Reiner residence is located while a helicopter circled overhead.\nAdditional reporting by Associated Press, Reuters and Agence France-Presse","summary":"Rob Reiner’s son, Nick Reiner, has been taken into custody after the deaths of the director-writer and his wife Michele, a law enforcement official told the Associated Press.\nThe official confirmed the 32-year-old was in police custody on Monday. The official could not publicly discuss details of the investigation and spoke on condition of anonymity.\nOnline jail records show Reiner was booked by Los Angeles police and remained in jail on Monday. It was not immediately clear what charges he would...","url":"https://www.scmp.com/news/world/united-states-canada/article/3336427/2-people-found-dead-los-angeles-home-director-rob-reiner","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/15/f604b6f4-0733-40c9-b7fd-6fc2870d9ff2_3b8096fe.jpg","video":null,"publish_date":"2025-12-15 03:21:17","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","source_country":"cn","sentiment":-0.169},{"id":387104608,"title":"Rob Reiner, his wife killed in apparent homicide — Live updates","text":"Rob Reiner, the acclaimed Hollywood director and actor, was killed alongside his wife, Michele Singer, in their California home, according to Variety and TMZ.\n\nTheir deaths are under investigation by the Los Angeles Police Department after the couple was found in their home in Brentwood.\n\nUSA TODAY was unable to reach a representative for Reiner at the time of publication.\n\nFollow along for updates.\n\nCary Elwes and other stars pay tribute to Rob Reiner\n\nCare Elwes, who played Westley in \"Princess Bride,\" posted a black and white photo presumably from the set of the film with two empty director's chairs, one with his name on it and one with Reiner's name. The slow melody of the movie played, and the caption was simply, \"No words...\"\n\nJames Woods, star of \"Ghosts of Mississippi,\" posted on X: \"Rob and I remained good friends ever since we made GHOSTS OF MISSISSIPPI. The studio didn’t think I was old enough to do the part, but Rob fought for me. Political differences never stood in the way of our love and respect for each other. I am devastated by this terrible event.\"\n\nCorey Feldman, who starred in \"Stand by Me,\" also posted on X: \"OMG THIS IS HORRIBLE NEWS! IM SO SORRY 4 ROB & HIS WIFE, & THEIR CHILDREN & THE WHOLE REINER FAMILY! ALL I CAN SAY IS IM SHOCKED & SADDENED, BUT I #LOVE U ROB! U WILL B 4EVER MISSED!\"\n\nSean Ono Lennon posted, \"Please not Rob Reiner. He is one of the greatest of all time.\"\n\nBarack Obama mourns Rob Reiner \n\nThe former president wrote on X Sunday that he and Michelle are \"heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele.\"\n\n\"Rob's achievements in film and television gave us some of our most cherished stories on screen,\" he wrote. \"But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action. Together, he and his wife lived lives defined by purpose. They will be remembered for the values they championed and the countless people they inspired. We send our deepest condolences to all who loved them.\"\n\nKamala Harris said Reiner and his wife 'loved each other very much'\n\nThe former U.S. vice president also shared a tribute on social media in light of Reiner's death. \n\nShe remembered the director as someone whose work \"has impacted generations of Americans. The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture.\" \n\nHarris continued, \"Rob loved our country, cared deeply about the future of our nation, and fought for America's democracy. Rob and his wife Michele loved each other very much. They were dear friends, and Doug and I are devastated to learn of their passing.\"\n\nChristopher Guest and Jamie Lee Curtis are 'numb' over the loss of their 'great friends'\n\nIn a statement to USA TODAY, the actors said they \"are numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner and our ONLY focus and care right now is for their children and immediate families and we will offer all support possible to help them.\n\n \"There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis.\"\n\nThey closed their statement by simply saying, \"We have lost great friends. Please give us time to grieve.\"\n\nRob Reiner’s family breaks silence on director’s death\n\nAccording to CNN, a spokesperson for the Reiner family said late Sunday evening that the couple have died.\n\nThey described their death as \"tragic\" and asked for privacy.\n\n\"It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner. We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time,\" the spokesperson said in a statement.\n\nNo further details were given.\n\nNancy Pelosi mourns the death of Rob Reiner and his wife\n\nIn a post on X, Rep. Nancy Pelosi - whose husband was attacked in 2022 in their home - called the news of Reiner and his wife’s death \"devastating.\"\n\n\"It’s hard to think of anyone more remarkable and excellent in every field and endeavor they pursued,\" she said in a post to X. \"Rob was creative, funny, and beloved. And in all of their endeavors, Michelle was his indispensable partner, intellectual resource, and a loving wife.\"\n\nGovernor Gavin Newsom and Mayor Karen Bass paid tribute to the director\n\nThe California governor said he and his wife were \"heartbroken\" by the loss of Rob Reiner and Michele Singer. \"Rob was the big-hearted genius behind so many of the classic stories we love,\" he posted on X. \"His boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others – and encouraging us to dream bigger.\"\n\nL.A. Mayor Bass called the loss \"devastating,\" posting on X that Rob Reiner \"improved countless lives through his creative work and advocacy fighting for social and economic justice. An acclaimed actor, director, producer, writer, and engaged political activist, he always used his gifts in service of others. ... Among his numerous contributions, Rob helped create First 5 California, a landmark initiative funded by a tobacco tax to support early childhood development programs. He and Michele fought for early childhood development and marriage equality, working to overturn Proposition 8. They were true champions for LGBTQ+ rights.\" I want to thank all of the first responders who were called to this tragic event. The investigation is ongoing.\" She added, \"I'm holding all who loved Rob and Michele in my heart.\"\n\nLAPD will continue investigating\n\nIn a press conference on Sunday night, LAPD said the robbery-homicide division will continue to investigate through the night and expect to release more information in the morning. They announced they are not seeking anyone as a suspect or person of interest. But they added that no one has been detained at this time. Authorities did confirm that \"many family members\" will be interviewed in the course of their work and that they were obtaining a search warrant to conduct a full crime scene investigation. They did not comment on the injuries sustained by the deceased.\n\nRob Reiner, wife Michele killed by their son Nick: report\n\nAccording to People, the couple was allegedly killed by their son, Nick Reiner, 32. USA TODAY has not been able to independently confirm this information. The New York Post also reported Nick was a person of interest in the case and ET also cited sources that he was allegedly involved.\n\nRob Reiner had been open about son's battle with addiction\n\nIn a 2016 interview with TODAY, the director spoke about the film \"Being Charlie,\" his most personal directorial effort yet. \n\nCo-written with Nick, the film traces a young man's descent into and out of drug addiction.\"Being Charlie,\" starring Nick Robinson, Common, Ricardo Chavira and Morgan Saylor screened at the 2015 Toronto International Film Festival and was released on May 6, 2016. \n\n\"It was very personal,\" Reiner told TODAY at the time, adding that, \"What I didn't understand is the depth of what [Nick] was going through.\" \n\nThe film follows an 18-year-old Charlie who has been in and out of rehab for years. Drawing parallels between the real-life father-son duo, Charlie's father in the film is a former Hollywood star. \n\nReiner and his wife were found by their daughter \n\nAlso according to People, the director and his wife were found dead in their Los Angeles home by their daughter, Romy.\n\nReports surface of two people dead in Rob Reiner's home\n\nTwo people were found dead in the Brentwood home of Hollywood director Rob Reiner on Sunday, Dec. 14, authorities confirmed to USA TODAY.\n\nThe Los Angeles Fire Department told USA TODAY on Sunday, Dec. 14, that paramedics were called to the home on the 200 block of Chadbourne at around 3:30 p.m. local time. LAFD said a man and a woman were found deceased inside the home, and their ages were approximately 78 and 68.\n\nThe Los Angeles Police Department later confirmed the same to USA TODAY.\n\n\"Once inside the residency, officers discovered two decedents,\" LAPD said in their statement, adding that \"the identity of the decedents has not yet been confirmed.\" But according to Variety and TMZ, Reiner and his wife, Michele Singer, 68, were identified as the victims.\n\nLAPD also told USA TODAY that the Robbery Homicide Division was also responding to the residence.\n\nAccording to NBC Los Angeles earlier Sunday, there was a heavy police presence at the residence. Neighbors told the local news outlet that Reiner and his wife live in the home.\n\nWho is Rob Reiner?\n\nReiner, 78, son of comedy legend Carl Reiner, is a director, producer, screenwriter and actor, who has worked on \"The Princess Bride,\" \"When Harry Met Sally,\" TV's \"All in the Family,\" the cult classic \"This Is Spinal Tap\" and \"Spinal Tap II: The End Continues.\"\n\nReiner is married to producer Michele Singer Reiner, and the pair shares three children. The director has a child from his first marriage to \"A League of Their Own\" director Penny Marshall, who died in 2018.\n\nMost recently, Reiner appeared in Hulu’s \"The Bear.\"","url":"https://eu.usatoday.com/story/entertainment/celebrities/2025/12/14/rob-reiner-two-people-found-dead-brentwood-home/87769637007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/12/15/USAT/87770278007-2226869751.jpg?auto=webp&crop=2122,1194,x0,y0&format=pjpg&width=1200","video":null,"publish_date":"2025-12-15 03:02:56","author":"Usa Today","authors":["Usa Today"],"language":"en","category":"politics","source_country":"us","sentiment":0.244},{"id":387061324,"title":"Rob Reiner, his wife killed in apparent homicide — Live updates","text":"Rob Reiner, the acclaimed Hollywood director and actor, was killed alongside his wife, Michele Singer, in their California home, according to Variety and TMZ.\n\nTheir deaths are under investigation by the Los Angeles Police Department after the couple was found in their home in Brentwood.\n\nUSA TODAY was unable to reach a representative for Reiner at the time of publication.\n\nFollow along for updates.\n\nCary Elwes and other stars pay tribute to Rob Reiner\n\nCare Elwes, who played Westley in \"Princess Bride,\" posted a black and white photo presumably from the set of the film with two empty director's chairs, one with his name on it and one with Reiner's name. The slow melody of the movie played, and the caption was simply, \"No words...\"\n\nJames Woods, star of \"Ghosts of Mississippi,\" posted on X: \"Rob and I remained good friends ever since we made GHOSTS OF MISSISSIPPI. The studio didn’t think I was old enough to do the part, but Rob fought for me. Political differences never stood in the way of our love and respect for each other. I am devastated by this terrible event.\"\n\nCorey Feldman, who starred in \"Stand by Me,\" also posted on X: \"OMG THIS IS HORRIBLE NEWS! IM SO SORRY 4 ROB & HIS WIFE, & THEIR CHILDREN & THE WHOLE REINER FAMILY! ALL I CAN SAY IS IM SHOCKED & SADDENED, BUT I #LOVE U ROB! U WILL B 4EVER MISSED!\"\n\nSean Ono Lennon posted, \"Please not Rob Reiner. He is one of the greatest of all time.\"\n\nBarack Obama mourns Rob Reiner \n\nThe former president wrote on X Sunday that he and Michelle are \"heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele.\"\n\n\"Rob's achievements in film and television gave us some of our most cherished stories on screen,\" he wrote. \"But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action. Together, he and his wife lived lives defined by purpose. They will be remembered for the values they championed and the countless people they inspired. We send our deepest condolences to all who loved them.\"\n\nKamala Harris said Reiner and his wife 'loved each other very much'\n\nThe former U.S. vice president also shared a tribute on social media in light of Reiner's death. \n\nShe remembered the director as someone whose work \"has impacted generations of Americans. The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture.\" \n\nHarris continued, \"Rob loved our country, cared deeply about the future of our nation, and fought for America's democracy. Rob and his wife Michele loved each other very much. They were dear friends, and Doug and I are devastated to learn of their passing.\"\n\nChristopher Guest and Jamie Lee Curtis are 'numb' over the loss of their 'great friends'\n\nIn a statement to USA TODAY, the actors said they \"are numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner and our ONLY focus and care right now is for their children and immediate families and we will offer all support possible to help them.\n\n \"There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis.\"\n\nThey closed their statement by simply saying, \"We have lost great friends. Please give us time to grieve.\"\n\nRob Reiner’s family breaks silence on director’s death\n\nAccording to CNN, a spokesperson for the Reiner family said late Sunday evening that the couple have died.\n\nThey described their death as \"tragic\" and asked for privacy.\n\n\"It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner. We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time,\" the spokesperson said in a statement.\n\nNo further details were given.\n\nNancy Pelosi mourns the death of Rob Reiner and his wife\n\nIn a post on X, Rep. Nancy Pelosi - whose husband was attacked in 2022 in their home - called the news of Reiner and his wife’s death \"devastating.\"\n\n\"It’s hard to think of anyone more remarkable and excellent in every field and endeavor they pursued,\" she said in a post to X. \"Rob was creative, funny, and beloved. And in all of their endeavors, Michelle was his indispensable partner, intellectual resource, and a loving wife.\"\n\nGovernor Gavin Newsom and Mayor Karen Bass paid tribute to the director\n\nThe California governor said he and his wife were \"heartbroken\" by the loss of Rob Reiner and Michele Singer. \"Rob was the big-hearted genius behind so many of the classic stories we love,\" he posted on X. \"His boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others – and encouraging us to dream bigger.\"\n\nL.A. Mayor Bass called the loss \"devastating,\" posting on X that Rob Reiner \"improved countless lives through his creative work and advocacy fighting for social and economic justice. An acclaimed actor, director, producer, writer, and engaged political activist, he always used his gifts in service of others. ... Among his numerous contributions, Rob helped create First 5 California, a landmark initiative funded by a tobacco tax to support early childhood development programs. He and Michele fought for early childhood development and marriage equality, working to overturn Proposition 8. They were true champions for LGBTQ+ rights.\" I want to thank all of the first responders who were called to this tragic event. The investigation is ongoing.\" She added, \"I'm holding all who loved Rob and Michele in my heart.\"\n\nLAPD will continue investigating\n\nIn a press conference on Sunday night, LAPD said the robbery-homicide division will continue to investigate through the night and expect to release more information in the morning. They announced they are not seeking anyone as a suspect or person of interest. But they added that no one has been detained at this time. Authorities did confirm that \"many family members\" will be interviewed in the course of their work and that they were obtaining a search warrant to conduct a full crime scene investigation. They did not comment on the injuries sustained by the deceased.\n\nRob Reiner, wife Michele killed by their son Nick: report\n\nAccording to People, the couple was allegedly killed by their son, Nick Reiner, 32. USA TODAY has not been able to independently confirm this information. The New York Post also reported Nick was a person of interest in the case and ET also cited sources that he was allegedly involved.\n\nRob Reiner had been open about son's battle with addiction\n\nIn a 2016 interview with TODAY, the director spoke about the film \"Being Charlie,\" his most personal directorial effort yet. \n\nCo-written with Nick, the film traces a young man's descent into and out of drug addiction.\"Being Charlie,\" starring Nick Robinson, Common, Ricardo Chavira and Morgan Saylor screened at the 2015 Toronto International Film Festival and was released on May 6, 2016. \n\n\"It was very personal,\" Reiner told TODAY at the time, adding that, \"What I didn't understand is the depth of what [Nick] was going through.\" \n\nThe film follows an 18-year-old Charlie who has been in and out of rehab for years. Drawing parallels between the real-life father-son duo, Charlie's father in the film is a former Hollywood star. \n\nReiner and his wife were found by their daughter \n\nAlso according to People, the director and his wife were found dead in their Los Angeles home by their daughter, Romy.\n\nReports surface of two people dead in Rob Reiner's home\n\nTwo people were found dead in the Brentwood home of Hollywood director Rob Reiner on Sunday, Dec. 14, authorities confirmed to USA TODAY.\n\nThe Los Angeles Fire Department told USA TODAY on Sunday, Dec. 14, that paramedics were called to the home on the 200 block of Chadbourne at around 3:30 p.m. local time. LAFD said a man and a woman were found deceased inside the home, and their ages were approximately 78 and 68.\n\nThe Los Angeles Police Department later confirmed the same to USA TODAY.\n\n\"Once inside the residency, officers discovered two decedents,\" LAPD said in their statement, adding that \"the identity of the decedents has not yet been confirmed.\" But according to Variety and TMZ, Reiner and his wife, Michele Singer, 68, were identified as the victims.\n\nLAPD also told USA TODAY that the Robbery Homicide Division was also responding to the residence.\n\nAccording to NBC Los Angeles earlier Sunday, there was a heavy police presence at the residence. Neighbors told the local news outlet that Reiner and his wife live in the home.\n\nWho is Rob Reiner?\n\nReiner, 78, son of comedy legend Carl Reiner, is a director, producer, screenwriter and actor, who has worked on \"The Princess Bride,\" \"When Harry Met Sally,\" TV's \"All in the Family,\" the cult classic \"This Is Spinal Tap\" and \"Spinal Tap II: The End Continues.\"\n\nReiner is married to producer Michele Singer Reiner, and the pair shares three children. The director has a child from his first marriage to \"A League of Their Own\" director Penny Marshall, who died in 2018.\n\nMost recently, Reiner appeared in Hulu’s \"The Bear.\"","url":"https://eu.azcentral.com/story/entertainment/celebrities/2025/12/14/rob-reiner-two-people-found-dead-brentwood-home/87769637007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/12/15/USAT/87770278007-2226869751.jpg?auto=webp&crop=2122,1194,x0,y0&format=pjpg&width=1200","video":null,"publish_date":"2025-12-15 03:02:56","author":"The Arizona Republic","authors":["The Arizona Republic"],"language":"en","category":"politics","source_country":"us","sentiment":0.244},{"id":387113476,"title":"Rob Reiner, his wife killed in apparent homicide — Live updates","text":"Rob Reiner, the acclaimed Hollywood director and actor, was killed alongside his wife, Michele Singer, in their California home, according to Variety and TMZ.\n\nTheir deaths are under investigation by the Los Angeles Police Department after the couple was found in their home in Brentwood.\n\nUSA TODAY was unable to reach a representative for Reiner at the time of publication.\n\nFollow along for updates.\n\nCary Elwes and other stars pay tribute to Rob Reiner\n\nCare Elwes, who played Westley in \"Princess Bride,\" posted a black and white photo presumably from the set of the film with two empty director's chairs, one with his name on it and one with Reiner's name. The slow melody of the movie played, and the caption was simply, \"No words...\"\n\nJames Woods, star of \"Ghosts of Mississippi,\" posted on X: \"Rob and I remained good friends ever since we made GHOSTS OF MISSISSIPPI. The studio didn’t think I was old enough to do the part, but Rob fought for me. Political differences never stood in the way of our love and respect for each other. I am devastated by this terrible event.\"\n\nCorey Feldman, who starred in \"Stand by Me,\" also posted on X: \"OMG THIS IS HORRIBLE NEWS! IM SO SORRY 4 ROB & HIS WIFE, & THEIR CHILDREN & THE WHOLE REINER FAMILY! ALL I CAN SAY IS IM SHOCKED & SADDENED, BUT I #LOVE U ROB! U WILL B 4EVER MISSED!\"\n\nSean Ono Lennon posted, \"Please not Rob Reiner. He is one of the greatest of all time.\"\n\nBarack Obama mourns Rob Reiner \n\nThe former president wrote on X Sunday that he and Michelle are \"heartbroken by the tragic passing of Rob Reiner and his beloved wife, Michele.\"\n\n\"Rob's achievements in film and television gave us some of our most cherished stories on screen,\" he wrote. \"But beneath all of the stories he produced was a deep belief in the goodness of people—and a lifelong commitment to putting that belief into action. Together, he and his wife lived lives defined by purpose. They will be remembered for the values they championed and the countless people they inspired. We send our deepest condolences to all who loved them.\"\n\nKamala Harris said Reiner and his wife 'loved each other very much'\n\nThe former U.S. vice president also shared a tribute on social media in light of Reiner's death. \n\nShe remembered the director as someone whose work \"has impacted generations of Americans. The characters, dialogue, and visuals he brought to life in film and television are woven throughout our culture.\" \n\nHarris continued, \"Rob loved our country, cared deeply about the future of our nation, and fought for America's democracy. Rob and his wife Michele loved each other very much. They were dear friends, and Doug and I are devastated to learn of their passing.\"\n\nChristopher Guest and Jamie Lee Curtis are 'numb' over the loss of their 'great friends'\n\nIn a statement to USA TODAY, the actors said they \"are numb and sad and shocked about the violent, tragic deaths of our dear friends Rob and Michelle Singer Reiner and our ONLY focus and care right now is for their children and immediate families and we will offer all support possible to help them.\n\n \"There will be plenty of time later to discuss the creative lives we shared and the great political and social impact they both had on the entertainment industry, early childhood development, the fight for gay marriage and their global care for a world in crisis.\"\n\nThey closed their statement by simply saying, \"We have lost great friends. Please give us time to grieve.\"\n\nRob Reiner’s family breaks silence on director’s death\n\nAccording to CNN, a spokesperson for the Reiner family said late Sunday evening that the couple have died.\n\nThey described their death as \"tragic\" and asked for privacy.\n\n\"It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner. We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time,\" the spokesperson said in a statement.\n\nNo further details were given.\n\nNancy Pelosi mourns the death of Rob Reiner and his wife\n\nIn a post on X, Rep. Nancy Pelosi - whose husband was attacked in 2022 in their home - called the news of Reiner and his wife’s death \"devastating.\"\n\n\"It’s hard to think of anyone more remarkable and excellent in every field and endeavor they pursued,\" she said in a post to X. \"Rob was creative, funny, and beloved. And in all of their endeavors, Michelle was his indispensable partner, intellectual resource, and a loving wife.\"\n\nGovernor Gavin Newsom and Mayor Karen Bass paid tribute to the director\n\nThe California governor said he and his wife were \"heartbroken\" by the loss of Rob Reiner and Michele Singer. \"Rob was the big-hearted genius behind so many of the classic stories we love,\" he posted on X. \"His boundless empathy made his stories timeless, teaching generations how to see goodness and righteousness in others – and encouraging us to dream bigger.\"\n\nL.A. Mayor Bass called the loss \"devastating,\" posting on X that Rob Reiner \"improved countless lives through his creative work and advocacy fighting for social and economic justice. An acclaimed actor, director, producer, writer, and engaged political activist, he always used his gifts in service of others. ... Among his numerous contributions, Rob helped create First 5 California, a landmark initiative funded by a tobacco tax to support early childhood development programs. He and Michele fought for early childhood development and marriage equality, working to overturn Proposition 8. They were true champions for LGBTQ+ rights.\" I want to thank all of the first responders who were called to this tragic event. The investigation is ongoing.\" She added, \"I'm holding all who loved Rob and Michele in my heart.\"\n\nLAPD will continue investigating\n\nIn a press conference on Sunday night, LAPD said the robbery-homicide division will continue to investigate through the night and expect to release more information in the morning. They announced they are not seeking anyone as a suspect or person of interest. But they added that no one has been detained at this time. Authorities did confirm that \"many family members\" will be interviewed in the course of their work and that they were obtaining a search warrant to conduct a full crime scene investigation. They did not comment on the injuries sustained by the deceased.\n\nRob Reiner, wife Michele killed by their son Nick: report\n\nAccording to People, the couple was allegedly killed by their son, Nick Reiner, 32. USA TODAY has not been able to independently confirm this information. The New York Post also reported Nick was a person of interest in the case and ET also cited sources that he was allegedly involved.\n\nRob Reiner had been open about son's battle with addiction\n\nIn a 2016 interview with TODAY, the director spoke about the film \"Being Charlie,\" his most personal directorial effort yet. \n\nCo-written with Nick, the film traces a young man's descent into and out of drug addiction.\"Being Charlie,\" starring Nick Robinson, Common, Ricardo Chavira and Morgan Saylor screened at the 2015 Toronto International Film Festival and was released on May 6, 2016. \n\n\"It was very personal,\" Reiner told TODAY at the time, adding that, \"What I didn't understand is the depth of what [Nick] was going through.\" \n\nThe film follows an 18-year-old Charlie who has been in and out of rehab for years. Drawing parallels between the real-life father-son duo, Charlie's father in the film is a former Hollywood star. \n\nReiner and his wife were found by their daughter \n\nAlso according to People, the director and his wife were found dead in their Los Angeles home by their daughter, Romy.\n\nReports surface of two people dead in Rob Reiner's home\n\nTwo people were found dead in the Brentwood home of Hollywood director Rob Reiner on Sunday, Dec. 14, authorities confirmed to USA TODAY.\n\nThe Los Angeles Fire Department told USA TODAY on Sunday, Dec. 14, that paramedics were called to the home on the 200 block of Chadbourne at around 3:30 p.m. local time. LAFD said a man and a woman were found deceased inside the home, and their ages were approximately 78 and 68.\n\nThe Los Angeles Police Department later confirmed the same to USA TODAY.\n\n\"Once inside the residency, officers discovered two decedents,\" LAPD said in their statement, adding that \"the identity of the decedents has not yet been confirmed.\" But according to Variety and TMZ, Reiner and his wife, Michele Singer, 68, were identified as the victims.\n\nLAPD also told USA TODAY that the Robbery Homicide Division was also responding to the residence.\n\nAccording to NBC Los Angeles earlier Sunday, there was a heavy police presence at the residence. Neighbors told the local news outlet that Reiner and his wife live in the home.\n\nWho is Rob Reiner?\n\nReiner, 78, son of comedy legend Carl Reiner, is a director, producer, screenwriter and actor, who has worked on \"The Princess Bride,\" \"When Harry Met Sally,\" TV's \"All in the Family,\" the cult classic \"This Is Spinal Tap\" and \"Spinal Tap II: The End Continues.\"\n\nReiner is married to producer Michele Singer Reiner, and the pair shares three children. The director has a child from his first marriage to \"A League of Their Own\" director Penny Marshall, who died in 2018.\n\nMost recently, Reiner appeared in Hulu’s \"The Bear.\"","url":"https://eu.dispatch.com/story/entertainment/celebrities/2025/12/14/rob-reiner-two-people-found-dead-brentwood-home/87769637007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/12/15/USAT/87770278007-2226869751.jpg?auto=webp&crop=2122,1194,x0,y0&format=pjpg&width=1200","video":null,"publish_date":"2025-12-15 03:02:56","author":"The Columbus Dispatch","authors":["The Columbus Dispatch"],"language":"en","category":"politics","source_country":"us","sentiment":0.244},{"id":387110872,"title":"A Republican governor in California? It’s possible.","text":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics or culture.\n\nDemocrats could be at risk of locking themselves out of California’s governor’s mansion. How is that possible in a place as blue as the Golden State? Here’s how.\n\nGov. Gavin Newsom is term-limited from running again, and Democrats are flooding the race, with at least 14 Democrats actively running campaigns. Early polls show former Rep. Katie Porter and current Rep. Eric Swalwell leading a pack that also includes former Health and Human Services Secretary Xavier Becerra, former 2020 presidential candidate Tom Steyer, and former Los Angeles Mayor Antonio Villaraigosa—all relatively serious candidates.\n\nAnd that’s where it gets tricky. \n\nCalifornia uses what’s commonly called a jungle primary, where all candidates—Democratic, Republican, and otherwise—run on the same primary ballot. The top two vote-getters in that primary move on to the general election. \n\nEven if only half of those Democrats draw notable levels of support, there are just two viable Republicans currently in the mix: former Fox News host Steve Hilton and Riverside County Sheriff Chad Bianco. Those two can split the roughly 35% of the state that reliably votes Republican, but five or more well-known Democratic candidates will have to fight over the remaining 65%. That means the Republicans could wind up as the top two vote-getters, shutting Democrats out of the general election.\n\nThis isn’t just some thought experiment. A recent poll from Emerson College suggests this very thing could happen.\n\nThe two Republicans, Porter, and Swalwell each pull in roughly the same level of support in the poll, which was fielded in early December. Bianco leads the pack, with 13%, while Swalwell and Hilton tie for second place, at 12%, and Porter comes in fourth, at 11%. If the primary election’s results break down this way, and if Hilton scores just one more vote than Swalwell, Republicans will take over the governor’s mansion in the nation’s biggest state.\n\nThat said, there are two things to keep in mind about this poll. \n\nFirst, the plurality of California voters (31%) were “undecided” about whom they would support. That sizable chunk of the electorate is likely to have more Democratic votes than Republican ones, and it’s possible that if two Democratic candidates start to pull away from the pack, Republicans could end up getting shut out of the general election. \n\nThat’s what happened in the state’s 2018 Senate race, when Democrats Dianne Feinstein and Kevin de León took the top two spots in the primary and faced off again in the general election. However, that election had an incumbent (Feinstein), and only two notable Democrats ran, leaving de León to pretty easily consolidate the anti-Feinstein Democratic vote. Compare that with next year, when there will be no incumbent and the Democratic options are basically endless.\n\nThe second thing to bear in mind about this poll is that the primary is on June 2, about six months away. That leaves plenty of time for Democrats to save themselves from themselves, and the best way to do that is for low-polling contenders to buck up and drop out—preferably sooner rather than later. In fact, a handful of candidates, including Lt. Gov. Eleni Kounalakis, have already pulled out of the race.\n\nAnd yet … another three fairly well-known Democrats are weighing runs: state Attorney General Rob Bonta, state Assemblymember Buffy Wicks, and billionaire mall magnate Rick Caruso, who ran for Los Angeles mayor in 2022 on a raft of endorsements from A-list celebrities and other rich assholes.\n\nIf all three joined, there could be more than seven notable Democrats in the race. No candidate has the name recognition of a Kamala Harris, who could have cleared the field if she’d decided to run, but also too many of them have just enough name recognition to heavily fracture the Democratic vote. You almost couldn’t engineer a better scenario for Republicans.\n\nNow, it’s very likely some of these larger names do indeed bail before the primary—but it will take more than one or two doing so to nix the possibility of Democrats getting shut out. Currently, the top-polling Democrats in the field are all within the margin of error of the two Republicans, meaning that, for the moment, the danger is alive.\n\nAny updates?\n\n The Trump administration is embroiled in a potential war-crimes scandal after twice striking a boat it accused of smuggling drugs—first, to neutralize the boat, and second, to kill the survivors of the first strike. And the latest Economist/YouGov poll finds that 59% of Americans see such follow-up strikes as unjustified. Only 22% see them as justified. That’s a surprising result given that the public narrowly supports the initial strikes: 48% approve of them, while 41% disapprove.\n\n President Donald Trump is pardoning with abandon—and the public hates it. The same Economist/YouGov poll finds that 66% of Americans oppose him having pardoned former Honduran President Juan Orlando Hernández (convicted of drug trafficking) and Democratic Rep. Henry Cuellar of Texas (indicted on corruption charges). Another 67% disapprove of him having pardoned David Gentile, a private equity executive who defrauded thousands, according to prosecutors.\n\n FIFA invented a peace prize to give Trump because … well, it’s sort of a mystery, because FIFA oversees soccer. Either way, a plurality of Americans (44%) disapprove of Trump being given FIFA’s peace prize, according to YouGov. Thirty-five percent approve, though that’s due mostly to strong Republican support (69% approve).\n\nThe Trump administration’s approach to the housing affordability crisis, as much as it’s had one, has hit on two basic ideas: drive up building costs via tariffs, then blame those dastardly immigrants for wanting a roof over their heads. But new data suggests the public is skeptical of that approach.\n\nThe cost of building materials is seen as the most important reason housing prices have increased, with 84% of Americans saying it’s played a very or somewhat important role, according to the latest Economist/YouGov poll. \n\nMeanwhile, only 46% say immigration has had a similar impact. In fact, of the eight potential causes for high housing prices, it’s the only issue where less than half the country thinks it’s played an important role.\n\nAt the same time, Trump’s desire for lower interest rates is shared by a strong majority of the public. Seventy-three percent say high interest rates have played an important role in driving up housing costs, making it the second-most-important cause in the public’s eyes.\n\nThat said, the manner in which Trump has tried to get those lower interest rates isn’t popular. He has threatened Federal Reserve Chair Jerome Powell and attempted to illegally fire a member of the Fed’s board. And yet only 26% of Americans trust him more than the Fed when it comes to handling the economy, per a September poll from The Economist/YouGov.\n\nSo it’s little surprise that when it comes to issues of housing and real estate, Trump has leaned into racism. For him, that’s just old hat.","summary":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics or culture.\n\n\n\n\nDemocrats could be at risk of locking themselves out of California’s governor’s mansion. How is that possible in a place as blue as the Golden State? Here’s how.\n\n\n\nGov. Gavin Newsom is term-limited from running again, and Democrats are flooding the race, with at least 14 Democrats actively running campaigns. Early polls show former Rep. Katie Porter and current Rep. Eric Swalwell leading a pack that also includes former Health and Human Services Secretary Xavier Becerra, former 2020 presidential candidate Tom Steyer, and former Los Angeles Mayor Antonio Villaraigosa—all relatively serious candidates.\n\n\n\nAnd that’s where it gets tricky. \n\n\n\n\n\nx\nDatawrapper Content\n\n\nCalifornia uses what’s commonly called a jungle primary, where all candidates—Democratic, Republican, and otherwise—run on the same primary ballot. The top two vote","url":"https://www.dailykos.com/story/2025/12/14/2357626/-A-Republican-governor-in-California-It-s-possible?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1506893/story_image/Survey.png?1765470988","video":null,"publish_date":"2025-12-15 00:00:06","author":"Andrew Mangan","authors":["Andrew Mangan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.102},{"id":387254244,"title":"Nancy Pelosi thinks a woman will be elected president, but 'maybe not' in her lifetime","text":"Former House Speaker Nancy Pelosi said that women aspiring to higher office face not just a \"glass ceiling\" but a far tougher \"marble ceiling.\" During an interview with USA Today's Susan Page — published Saturday — Pelosi was asked whether she believed a woman would be elected president during her lifetime. \"I certainly hope so,\" she responded. \"I always thought that a woman would be President of the United States long before a woman would be Speaker of the House.\" Pelosi predicted that a woman would be elected to the Oval Office within the next generation. \"I think it's probably − maybe not in my lifetime, but within this next generation, there'll be a woman,\" she told Page. NANCY MACE CLAIMS NANCY PELOSI 'WAS A MORE EFFECTIVE HOUSE SPEAKER THAN ANY REPUBLICAN THIS CENTURY' The California Democrat recalled that the men who ran things — or the \"poor babies,\" as she referred to them — were less than welcoming towards her when she made her entrance to Congress. \"It's not a glass ceiling, it's a marble ceiling,\" Pelosi told Page. \"I thought certainly the American people are far ahead of the Congress in terms of their acceptance or their enthusiasm for a woman to be President of the United States.\" After becoming the country's first female speaker nearly 20 years ago, Pelosi has seen two women nominated for president, Hillary Clinton in 2016 and former Vice President Kamala Harris in 2024, both of whom were defeated by President Donald Trump. According to USA Today, Clinton's loss to Trump in 2016 was a deciding factor in Pelosi's decision to delay her planned retirement. The outlet noted that these events \"tempered Pelosi's optimism, or at least her timetable, for seeing a woman in the Oval Office.\" MICHELLE OBAMA IS 'ABSOLUTELY CORRECT' SAYING AMERICA NOT READY FOR A WOMAN PRESIDENT, DEM LAWMAKER SAYS Last month, Pelosi expressed a similar sentiment about a future female president, pushing back on Michelle Obama’s recent claim that Americans are \"not ready\" to elect a woman to the White House. When asked by CNN's Anderson Cooper whether she agreed with the former first lady's comments, Pelosi questioned why a woman commander-in-chief would be out of the question. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"Well, I hope — I mean, I respect her and I know that view is one that we all are saddened by, but we — I think we have to change. The fact is that I‘ve heard every excuse in the book, you know, like, 'I‘m not sure a woman could be commander-in-chief.' Well, why not?\" she asked. \"'Well, I served in the military.' Well, OK. And so? So do women serve in the military.\" The former House Speaker added that she \"always thought we would have a woman president long before we had a woman Speaker of the House,\" and that she \"didn't set out to be speaker.\" Following up on Pelosi’s statement, Cooper asked why she believed there would be a female president before a female speaker. \"Because I thought the American people were much more ready for a woman president,\" Pelosi responded. \"Just the thought of it is so exciting and the message it sends to the world. Faster than there would be a woman speaker as this place, I mean, it's shall we say — it's male-dominated for hundreds of years and so when I ran for leadership, they said, 'Who said she could run?'\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"Oh, poor babies. I'm not waiting for you to tell me I can run,\" she added. Pelosi argued that there is a \"pecking order\" of men in Washington who feel that they are entitled to certain positions within the government, and that it \"still exists really on the Republican side.\"","summary":"Former House Speaker Nancy Pelosi told USA Today she wasn&apos;t sure a woman would be elected president &quot;in my lifetime,&quot; but remained optimistic it would happen soon.","url":"https://www.foxnews.com/media/nancy-pelosi-thinks-woman-elected-president-maybe-not-my-lifetime","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/nancy-pelosi-september-2025.jpg","video":null,"publish_date":"2025-12-14 23:00:38","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.04},{"id":387138550,"title":"Gov. Newsom Mocks Trump For Making An Easily Debunked Claim About California","text":"California Gov. Gavin Newsom (D) is calling out President Donald Trump again for spreading misinformation.\n\nOn Sunday, Trump doubled back on his repeated, false claims about rigged elections, claiming this time that he would’ve won California in the 2024 presidential election if he hadn’t been cheated by the Democratic party. \n\nThe president made the comments while delivering remarks at a White House Christmas reception. \n\n“If the vote in California was legitimate, which it’s not. If 38 million ballots … Everything is mail-in voting. They mail out 38 million ballots and they come in — where the hell do they go and where do they come from?” he asked the crowd. \n\nThe right-wing leader continued, “It’s a rigged election in California because we would win California by a lot. And again, they feel they have the advantage with the Hispanic, they don’t because I won the Hispanic vote.”\n\nTrump’s opponent in the 2024 presidential race, former Vice President Kamala Harris, won the 54 electoral votes in California by a sizable margin, according to multiple polls. \n\nTrump also accused California of being “so rigged” more than “any other [state].”\n\nNewsom didn’t hesitate to mock Trump for his erroneous claims on Sunday. \n\nIn an X post alongside a clip of the president’s comments, the California governor simply wrote, “Hahahahahahahahaha ok.” \n\nEarlier in his speech at the White House, Trump accused Democrats of being “professionals at cheating” in elections.\n\nClaiming that “we won in [the] 2016 [presidential election] by a lot,” Trump went on to allege that his administration has “truckloads” of evidence to show Democrats “rigged” the 2020 election. \n\n“We have all the ammunition, all the stuff, and you’ll see it come out. It’s coming out in truckloads. But then we won again in 2024 with an election we call ‘too big to rig,’” he said. “And we were leading big in the polls, but I said, ‘Go out and vote, you gotta go out and vote, make it too big to rig.’” \n\nTrump added, “[The Democrats] tried to rig it, but they couldn’t do it. It was too big to rig … too many votes.” \n\nWatch Trump’s full remarks below.","url":"https://www.huffpost.com/entry/newsom-response-trump-claim-california-rigged_n_693f1d4ce4b0f14dd5de5ec6?origin=top-ad-recirc","image":"https://img.huffingtonpost.com/asset/693f2c5319000041667f4191.jpeg?cache=V2hNutBd01&ops=1778_1000","video":null,"publish_date":"2025-12-14 22:44:52","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"in","sentiment":-0.852},{"id":387138552,"title":"Gov. Newsom Mocks Trump For Making An Easily Debunked Claim About California","text":"California Gov. Gavin Newsom (D) is calling out President Donald Trump again for spreading misinformation.\n\nOn Sunday, Trump doubled back on his repeated, false claims about rigged elections, claiming this time that he would’ve won California in the 2024 presidential election if he hadn’t been cheated by the Democratic party. \n\nThe president made the comments while delivering remarks at a White House Christmas reception. \n\n“If the vote in California was legitimate, which it’s not. If 38 million ballots … Everything is mail-in voting. They mail out 38 million ballots and they come in — where the hell do they go and where do they come from?” he asked the crowd. \n\nThe right-wing leader continued, “It’s a rigged election in California because we would win California by a lot. And again, they feel they have the advantage with the Hispanic, they don’t because I won the Hispanic vote.”\n\nTrump’s opponent in the 2024 presidential race, former Vice President Kamala Harris, won the 54 electoral votes in California by a sizable margin, according to multiple polls. \n\nTrump also accused California of being “so rigged” more than “any other [state].”\n\nNewsom didn’t hesitate to mock Trump for his erroneous claims on Sunday. \n\nIn an X post alongside a clip of the president’s comments, the California governor simply wrote, “Hahahahahahahahaha ok.” \n\nEarlier in his speech at the White House, Trump accused Democrats of being “professionals at cheating” in elections.\n\nClaiming that “we won in [the] 2016 [presidential election] by a lot,” Trump went on to allege that his administration has “truckloads” of evidence to show Democrats “rigged” the 2020 election. \n\n“We have all the ammunition, all the stuff, and you’ll see it come out. It’s coming out in truckloads. But then we won again in 2024 with an election we call ‘too big to rig,’” he said. “And we were leading big in the polls, but I said, ‘Go out and vote, you gotta go out and vote, make it too big to rig.’” \n\nTrump added, “[The Democrats] tried to rig it, but they couldn’t do it. It was too big to rig … too many votes.” \n\nWatch Trump’s full remarks below.","url":"https://www.huffpost.com/entry/newsom-response-trump-claim-california-rigged_n_693f1d4ce4b0f14dd5de5ec6?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/693f2c5319000041667f4191.jpeg?cache=V2hNutBd01&ops=1778_1000","video":null,"publish_date":"2025-12-14 22:44:52","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"in","sentiment":-0.852},{"id":387053292,"title":"Gov. Newsom Mocks Trump For Making An Easily Debunked Claim About California","text":"California Gov. Gavin Newsom (D) is calling out President Donald Trump again for spreading misinformation.\n\nOn Sunday, Trump doubled back on his repeated, false claims about rigged elections, claiming this time that he would’ve won California in the 2024 presidential election if he hadn’t been cheated by the Democratic party. \n\nThe president made the comments while delivering remarks at a White House Christmas reception. \n\n“If the vote in California was legitimate, which it’s not. If 38 million ballots … Everything is mail-in voting. They mail out 38 million ballots and they come in — where the hell do they go and where do they come from?” he asked the crowd. \n\nThe right-wing leader continued, “It’s a rigged election in California because we would win California by a lot. And again, they feel they have the advantage with the Hispanic, they don’t because I won the Hispanic vote.”\n\nTrump’s opponent in the 2024 presidential race, former Vice President Kamala Harris, won the 54 electoral votes in California by a sizable margin, according to multiple polls. \n\nTrump also accused California of being “so rigged” more than “any other [state].”\n\nNewsom didn’t hesitate to mock Trump for his erroneous claims on Sunday. \n\nIn an X post alongside a clip of the president’s comments, the California governor simply wrote, “Hahahahahahahahaha ok.” \n\nEarlier in his speech at the White House, Trump accused Democrats of being “professionals at cheating” in elections.\n\nClaiming that “we won in [the] 2016 [presidential election] by a lot,” Trump went on to allege that his administration has “truckloads” of evidence to show Democrats “rigged” the 2020 election. \n\n“We have all the ammunition, all the stuff, and you’ll see it come out. It’s coming out in truckloads. But then we won again in 2024 with an election we call ‘too big to rig,’” he said. “And we were leading big in the polls, but I said, ‘Go out and vote, you gotta go out and vote, make it too big to rig.’” \n\nTrump added, “[The Democrats] tried to rig it, but they couldn’t do it. It was too big to rig … too many votes.” \n\nWatch Trump’s full remarks below.","url":"https://www.huffpost.com/entry/newsom-response-trump-claim-california-rigged_n_693f1d4ce4b0f14dd5de5ec6?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/693f2c5319000041667f4191.jpeg?cache=V2hNutBd01&ops=1778_1000","video":null,"publish_date":"2025-12-14 22:44:52","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"au","sentiment":-0.852},{"id":387053236,"title":"Gov. Newsom Mocks Trump For Making An Easily Debunked Claim About California","text":"California Gov. Gavin Newsom (D) is calling out President Donald Trump again for spreading misinformation.\n\nOn Sunday, Trump doubled back on his repeated, false claims about rigged elections, claiming this time that he would’ve won California in the 2024 presidential election if he hadn’t been cheated by the Democratic party. \n\nThe president made the comments while delivering remarks at a White House Christmas reception. \n\n“If the vote in California was legitimate, which it’s not. If 38 million ballots … Everything is mail-in voting. They mail out 38 million ballots and they come in — where the hell do they go and where do they come from?” he asked the crowd. \n\nThe right-wing leader continued, “It’s a rigged election in California because we would win California by a lot. And again, they feel they have the advantage with the Hispanic, they don’t because I won the Hispanic vote.”\n\nTrump’s opponent in the 2024 presidential race, former Vice President Kamala Harris, won the 54 electoral votes in California by a sizable margin, according to multiple polls. \n\nTrump also accused California of being “so rigged” more than “any other [state].”\n\nNewsom didn’t hesitate to mock Trump for his erroneous claims on Sunday. \n\nIn an X post alongside a clip of the president’s comments, the California governor simply wrote, “Hahahahahahahahaha ok.” \n\nEarlier in his speech at the White House, Trump accused Democrats of being “professionals at cheating” in elections.\n\nClaiming that “we won in [the] 2016 [presidential election] by a lot,” Trump went on to allege that his administration has “truckloads” of evidence to show Democrats “rigged” the 2020 election. \n\n“We have all the ammunition, all the stuff, and you’ll see it come out. It’s coming out in truckloads. But then we won again in 2024 with an election we call ‘too big to rig,’” he said. “And we were leading big in the polls, but I said, ‘Go out and vote, you gotta go out and vote, make it too big to rig.’” \n\nTrump added, “[The Democrats] tried to rig it, but they couldn’t do it. It was too big to rig … too many votes.” \n\nWatch Trump’s full remarks below.","url":"https://www.huffpost.com/entry/newsom-response-trump-claim-california-rigged_n_693f1d4ce4b0f14dd5de5ec6?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/693f2c5319000041667f4191.jpeg?cache=V2hNutBd01&ops=1778_1000","video":null,"publish_date":"2025-12-14 22:44:52","author":"Jazmin Tolliver","authors":["Jazmin Tolliver"],"language":"en","source_country":"au","sentiment":-0.852},{"id":387139152,"title":"Don’t read too much into the Miami upset","text":"Regarding the Dec. 9 online news article “Miami will have its first Democratic mayor in nearly 30 years”:\n\nEileen Higgins’s victory is special. Last year, Kamala Harris didn’t win an outright majority in Miami, coming up with 49.7 percent of the vote to Donald Trump’s 49 percent, and Trump won Miami-Dade County comfortably, with 56.1 percent of the vote. On Tuesday, Higgins garnered 59.46 percent of the vote, running in a heavily Hispanic city as a White woman against an experienced Cuban-born Republican.","url":"https://www.washingtonpost.com/opinions/2025/12/14/miami-hispanic-democrats-nancy-mace/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/63O3PEHR4UWEEV5TQIJCIKEGDQ_size-normalized.jpg&w=1600&h=900","video":null,"publish_date":"2025-12-14 21:55:30","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.247},{"id":387011266,"title":"Grok is spreading misinformation about the Bondi Beach shooting","text":"Grok’s track record is spotty at best. But even by the very low standards of xAI, its failure in the aftermath of the tragic mass shooting at Bondi Beach in Australia is shocking. The AI chatbot has repeatedly misidentified 43-year-old Ahmed al Ahmed, the man who heroically disarmed one of the shooters, and claimed the verified video of his deed was something else entirely — including that it was an old viral video of a man climbing a tree.\nIn the aftermath of the attack, Ahmed has been widely praised for his heroism, but some have tried to dismiss or even deny his actions. Someone even quickly whipped up a fake news site that appears to be AI-generated, with an article naming a fictitious IT professional, Edward Crabtree, as the man who disarmed the attacker. This, of course, got picked up by Grok and regurgitated on X.\nBut Grok also suggested that images of Ahmed were of an Israeli being held hostage by Hamas. And it claimed that video taken at the scene was actually of Currumbin Beach, Australia, during Cyclone Alfred.\nBroadly, it seems Grok is having trouble understanding queries today and working out the proper answers. It replied to a question about Oracle’s financial difficulties with a summary of the shooting at Bondi Beach. When asked about the validity of a story about a UK police operation, it first stated today’s date, then coughed up poll numbers for Kamala Harris.\nIt’s just one more reminder that AI isn’t reliable enough to be trusted with fact-checking.","summary":"Grok's track record is spotty at best. But even by the very low standards of xAI, its failure in the aftermath of the tragic mass shooting at Bondi Beach in Australia is shocking. The AI chatbot has repeatedly misidentified 43-year-old Ahmed al Ahmed, the man who heroically disarmed one of the shooters, and claimed the [&#8230;]","url":"https://www.theverge.com/news/844443/grok-misinformation-bondi-beach-shooting","image":"https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/STK262_GROK_B_D.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613","video":null,"publish_date":"2025-12-14 21:24:24","author":"Terrence O'brien,Terrence O’Brien","authors":["Terrence O'brien","Terrence O’Brien"],"language":"en","source_country":"us","sentiment":-0.392},{"id":387100834,"title":"Former President Biden Couldn't Even Get Through 15-Second Interview Without Stumbling","text":"Americans haven't seen much of former President Joe Biden since he dropped out of the 2024 United States presidential election, paving the way for then Vice President Kamala Harris to lose handily to Donald Trump. But Biden made a rare public appearance on Sunday, showing up on the field at Lincoln Financial during the Philadelphia Eagles game against the Las Vegas Raiders. He even did a quick interview, dropping a \"Go Birds!\" before pulling a Biden and mumbling some unintelligible words. \"Do you want to give a ‘Go Birds’?\" the interviewer asked. \"Go Birds, man!\" Biden responded before adding, \"All the way, gotta win the Super Bowl again!\" \"How cool is it to be here today?\" the interviewer followed up. \"It's always cool to be here, particularly… [unintelligible],\" Biden said before stumbling through something that sounded like \"We gotta get 'em back moving\"? Honestly, I have no idea what he was trying to say. It's somewhat unreal to think that people believed this man could be President of the United States for four more years. Here he is, doing a very friendly interview that lasted less than 15 seconds, and he couldn't even get through 20 words cleanly before basically giving up on trying to speak English. You do have to give him some credit, though. It's extremely cold in Philadelphia and the 83-year-old former president is braving the weather in the outdoors. Plus, you have to think this public appearance is getting in the way of nap time. At Biden's age, and in his mental state, those midday naps are crucial for his health. I crack jokes, sure, but this \"interview\" served as an important reminder. Fifteen seconds, and everyone could see the 2024 strategy again: keep Biden upright, say the line, and hope the camera moves on. It was never about capability; it was about clinging to power. Democrats pushed it until they couldn’t.","summary":"Former President Joe Biden surfaced at the Eagles–Raiders game in Philadelphia, offering a short “Go Birds!&quot; and a muddled follow-up in a sideline chat that quickly lit up social clips and comments.","url":"https://www.outkick.com/sports/former-president-joe-biden-interview-philadelphia-eagles","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/12/joe-biden-eagles-scaled.jpg","video":null,"publish_date":"2025-12-14 19:57:26","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.171},{"id":387041208,"title":"Grok Is Glitching and Spewing Misinformation About The Bondi Beach Shooting","text":"Elon Musk’s AI chatbot Grok is glitching again.\n\nThis time, among other problems, the chatbot is spewing misinformation about the Bondi Beach shooting, in which at least eleven people were killed at a Hanukkah gathering.\n\nOne of the assailants was eventually disarmed by a bystander, identified as 43-year-old Ahmed al Ahmed. The video of the interaction has been widely shared on social media with many praising the heroism of the man. Except those that have jumped at the opportunity to exploit the tragedy and spread Islamophobia, mainly by denying the validity of the reports identifying the bystander.\n\nGrok is not helping the situation. The chatbot appears to be glitching, at least as of Sunday morning, responding to user queries with irrelevant or at times completely wrong answers.\n\nIn response to a user asking Grok the story behind the video showing al Ahmed tackling the shooter, the AI claimed “This appears to be an old viral video of a man climbing a palm tree in a parking lot, possibly to trim it, resulting in a branch falling and damaging a parked car. Searches across sources show no verified location, date, or injuries. It may be staged; authenticity is uncertain.”\n\nIn another instance, Grok claimed that the photo showing an injured al Ahmed was of an Israeli hostage taken by Hamas on October 7th.\n\nIn response to another user query, Grok questioned the authenticity of al Ahmed’s confrontation yet again, right after an irrelevant paragraph on whether or not the Israeli army was purposefully targeting civilians in Gaza.\n\nIn another instance, Grok described a video clearly marked in the tweet to show the shoot out between the assailants and police in Sydney to instead be from Tropical Cyclone Alfred, which devastated Australia earlier this year. Although in this case, the user doubled down on the response to ask Grok to reevaluate, which caused the chatbot to realize its mistake.\n\nBeyond just misidentifying information, Grok seems to be just truly confused. One user was served up a summary of the Bondi shooting and its fallout in response to a question regarding tech company Oracle. It also seems to be confusing information regarding the Bondi shooting and the Brown University shooting which took place only a few hours before the attack in Australia.\n\nThe glitch is also extending beyond just the Bondi shooting. Throughout Sunday morning, Grok has misidentified famous soccer players, gave out information on acetaminophen use in pregnancy when asked about the abortion pill mifepristone, or talked about Project 2025 and the odds of Kamala Harris running for presidency again when asked to verify a completely separate claim made about a British law enforcement initiative.\n\nIt’s not clear what is causing the glitch. Gizmodo reached out to Grok-developer xAI for comment, but they have only responded with the usual automated reply, “Legacy Media Lies.”\n\nIt’s also not the first time that Grok has lost its grip on reality. The chatbot has given quite a few questionable responses this year, from an “unathorized modification” that caused it to respond to every query with conspiracy theories on “white genocide” in South Africa to saying that it would rather kill the world’s entire Jewish population than vaporize Musk’s mind.","summary":"Grok has lost it. Again.","url":"https://gizmodo.com/grok-is-glitching-and-spewing-misinformation-about-the-bondi-beach-shooting-2000699533","image":"https://gizmodo.com/app/uploads/2025/12/shutterstock_2396034011-1200x675.jpg","video":null,"publish_date":"2025-12-14 18:45:32","author":"Ece Yildirim","authors":["Ece Yildirim"],"language":"en","source_country":"US","sentiment":-0.325},{"id":387037194,"title":"PRedictions, PRojections, PRaise, and PRedators: Faking Authenticity and a Question About Pennies","text":"Ben Bailey (best known as the host of Cash Cab) told me that he’ll sometimes think of a clever one-liner… for a woman, an Asian, or anyone but him. The trick to being a successful standup isn’t just learning how to write funny, original jokes — but funny, original jokes that fit your on-stage persona.\n\nOther than a hodgepodge of singer-songwriters, most pop stars are unencumbered by that burden. They simply pay a third party for the material, and then try their best to perform it.\n\nAnd some are great at it. But even the greatest of the greats will have moments where there’s an obvious disconnect between the performer and the material: Something is off.\n\nYou can always tell when someone doesn’t really believe what they’re saying.\n\nEven if the singer is a Grammy winner. Even if she sings like an angel. Even if everything else looks and sounds tone-perfect.\n\nWe all have an innate bull[feces]-detector that warns us when someone’s words and emotions are out of whack. Somehow, we can sense when a speaker is saying something because someone told them to — and not because it’s something they genuinely believe.\n\nYou see this a lot in D.C.: How many times have you heard a politician give a speech, and you could instantly tell that someone else wrote it?\n\nPolitical speechwriters are the D.C. equivalent of Hollywood breast implants: Pretty much everyone who needs ‘em uses ‘em, but pointing out the composition of speeches and/or breasts before the paying public is considered unseemly.\n\nYou’re spoiling the illusion!\n\nThat’s one of the secret ingredients to Donald Trump’s success: He’s a political singer-songwriter. Sure, he’ll use speechwriters (and occasionally, even follow a teleprompter), but for the most part, he performs his own material. You wind him up, hand him the microphone, and let him go.\n\nGood or bad, he’s always authentic.\n\nAuthenticity is worth its weight in gold in PR, because it’s associated with trust and honesty. They’re not exactly the same — an authentic liar is still a liar — but it demonstrates a higher degree of prima facia transparency.\n\nDonald Trump knows who he is, warts, strengths and all. And nobody’s better at writing for Donald Trump than Donald Trump!\n\nPeggy Noonan was a splendid speechwriter and Ronald Reagan was a generationally gifted performer. The two of them were one helluva one-two punch. Reagan was skilled enough to make any material work — but when his material was great, so was his performance. \n\nHe’d rise to reach the rhetoric.\n\nI wouldn’t want Donald Trump to recite a Peggy Noonan speech because it wouldn’t work. It would come across as phony and weird.\n\nAudiences would know right away: That’s not Trump’s voice.\n\nPolitician, know thyself. The key to being authentic is authentically knowing who you are — and who you’re not.\n\nIt’s probably the most underrated skill in American politics. And in the 2024 presidential race between Kamala Harris and Donald Trump, the difference was glaring.\n\nRepublican voters would be wise to keep this in mind during the 2026 midterms — and select nominees accordingly.\n\nPRedictions: Donald Trump is many things; some good, some bad. But among the good is his creativity. From Greenland to tariffs to the Gulf of America to making Canada our 51st state, he’s a highly creative problem-solver.\n\nThat’s what scares his enemies, both domestically and abroad: You can’t strategize for an outside-the-box thinker like that.\n\nI guarantee you, when Justin Trudeau visited to Mar-a-Lago to kiss Trump’s ring, his advisors prepped him with all kinds of talking points, and they strategized for all sorts of Trumpian behavior. But they didn’t anticipate, “What do we do if Trump says Canada isn’t a real country and ought to be the 51st state?”\n\nBefore Trump said it, it didn’t even occur to them!\n\nFor the Republican Party to prevail in the 2026 midterms, we’re gonna need Trump at his most creative — and thus, his most unpredictable.\n\nI assume he knows it. Furthermore, I’ll betcha he already has some ideas up his sleeves, and as we get closer to Nov. 2026, those ideas we’ll grow in number. That’s usually how the minds of creative people work: The longer they focus on a problem, the more creative solutions they develop.\n\nWhich is why anyone who’s making 2026 midterm predictions before the end of 2025 is predicting the outcome of a strategy that they don’t even know yet.\n\nIf we wanna talk trajectory, that’s fair. Trajectory is based on our current direction. It’s trackable and mappable. And, alas, the current GOP trajectory is lousy: From Miami to Virginia to New Jersey to New York, we clearly have a lot of work to do.\n\nBut in politics, a body in motion doesn’t stay in motion indefinitely. Trendlines aren’t absolute; by definition, the pendulum swings in more than one direction.\n\nI’m curious to see Donald Trump’s strategy. My prediction is, it’s gonna be something nobody else has thought of yet.\n\nPRojection: One of the funniest examples of Donald Trump’s creativity is in the new $1 coin, which — according to CNN — will bear Trump’s likeness.\n\nWait: You might be wondering, “Aren’t there laws that prohibit living people from appearing on U.S. currency?”\n\nThere are. And the Trump administration has just found an unusual loophole.\n\n[…] US law prohibits images of living people on the backs of coins. The US Mint told CNN there is no such restriction on the front of coins, though it’s been US law since 1866 that living people can’t be on paper currency.\n\nWait… what?!\n\nIt’s a coin. It only has two sides! Who’s to say which one is the front and which one’s the back?!\n\n(Well, I guess the Trump administration will.)\n\nWhat a silly, pointless distinction!\n\nIt reminds me of the old Steven Wright joke:\n\nMy buddy got busted for counterfeiting. He was making pennies. They caught him because he was putting the heads and tails on the wrong side.\n\nPRaise: To a Muslim man named Ahmed al Ahmed, who rushed to aid the Jewish victims of the Bondi Beach Hanukkah terrorist attack in Australia, where 12 were killed and 29 were injured. \n\nWatch the video. I don’t know how Ahmed moved so quickly, with balls that big:\n\nThe hero who risked his life to grab the weapon off one of the terrorists during the Bondi Beach terror attack is a 43 yr old Ahmed al Ahmed, His cousin Mustafa revealed while speaking outside the hospital that his cousin was shot twice and is currently undergoing a treatment. https://t.co/eunbniEZPT pic.twitter.com/qdM78JdLMz— Mohammed Zubair (@zoo_bear) December 14, 2025 \n\nHe was shot twice, had no weapon of his own, and still subdued and disarmed a violent terrorist. The guy’s a hero.\n\nThank God he was there.\n\nPRedators: Have you heard? The Democratic Party is spitballing a new marketing slogan. House Minority Leader Hakeem Jeffries is a huge fan of it: \n\n“Strong floor, no ceiling.”\n\nWhat do we fight for as Democrats?Strong Floor. No Ceiling. pic.twitter.com/I0cQo9X67H— Hakeem Jeffries (@RepJeffries) August 14, 2025\n\nRep. Eric Swalwell is also a booster:\n\nWhat do Democrats believe in? I think @OliverBLibby nails it. In America, if you work hard and play by the rules, you deserve a Strong Floor to stand on and No Ceiling on how high you can rise.— Rep. Eric Swalwell (@RepSwalwell) November 16, 2025 \n\nAlas, the Democratic Party’s house organ, a.k.a. MS Now (formerly MSNBC), isn’t exactly impressed:\n\nTry to contain your excitement. Not only will nobody have any idea what that means unless it’s explained, it doesn’t even describe well what Democrats ought to want.[…]Nobody is going to proudly wear a “Strong floor, no ceiling” hat; it will never be the equivalent of Donald Trump’s “Make America Great Again,” one of the most effective slogans in American political history.[…]Democrats need to speak to people’s hopes and their anger. They need to explain who they’re for and who they’re against. They need to identify heroes and villains. They need to show what they won’t compromise on, and why. If they can do all that, voters might start believing in them again. But if “strong floor, no ceiling” is the best slogan they can come up with, they’ll likely be better off without one.\n\nI hope the Democrats run with it, because the counternarrative writes itself: You know who else has a “strong floor and no ceiling,” eh?\n\nThe homeless guy living on the sidewalk.\n\nGood luck with that.","url":"https://pjmedia.com/scott-pinsker/2025/12/14/predictions-projections-praise-and-predators-faking-authenticity-and-a-question-about-pennies-n4947061","image":"https://media.townhall.com/cdn/hodl/2025/309/9d925da5-48fd-4df0-8f0b-576ff2f40925.jpg","video":null,"publish_date":"2025-12-14 17:45:53","author":"Scott Pinsker","authors":["Scott Pinsker"],"language":"en","source_country":"us","sentiment":0.401}]}