{"offset":0,"number":50,"available":428,"news":[{"id":292325618,"title":"Historic Plummet in Illegal Border Crossings Reveals the Root Cause of the Biden Border Crisis","text":"The massive flood of illegal aliens across the southern border has become a trickle, disappearing almost as swiftly as it first emerged four years ago.\n\nThe Daily Signal’s Fred Lucas reported on Tuesday that, according to the White House and U.S. Customs and Border Protection, the number of border apprehensions in January fell to the lowest point in five years.\n\nFebruary looks to have even lower numbers than January. According to the New York Post, “about 359 illegal migrants per day have been caught across the entire southern border — down more than 90% from February 2024.”\n\n“Total illegal border crossings for fiscal year 2025 are on track to fall to the lowest rates since 1968,” Lucas reported. On Monday, President Donald Trump’s border czar, Tom Homan, noted how remarkably quiet the border has suddenly become.\n\nIsn’t it interesting how quickly the issue at the border has begun to solve itself now that we have a president who is willing to uphold the law? It seems even before he returned to office, potential border crossers got the message they wouldn’t be here to stay.\n\nIf you recall, the Biden administration insisted for years that there was no crisis at the border and that it was “secure.”\n\nNot only was there a very real crisis, but given the timing of the surge at the southern border and now its sudden halt, it seems clear that this whole thing was intentionally fabricated. The Biden border problem wasn’t merely a result of incompetence, it was the product of an intentional subversion of U.S. immigration laws.\n\nIn some of his first official acts Biden as president, Biden decimated Trump’s border policies. The Daily Signal reported in 2021 that the “Biden administration immediately stopped wall construction, ended the Remain in Mexico program, tore up the Cooperative Asylum Agreements, started releasing illegal aliens into the U.S., and ended 90% of Immigration and Customs Enforcement removals.”\n\nThe result was four years of mayhem. The border was completely overrun. Cities across the country were filled to the brim with illegal aliens and were begging the Biden administration for help.\n\nIn 2021 the Biden administration enlisted Vice President Kamala Harris in a mission to uncover the “root causes” of illegal immigration from South and Central America. Whether she identified those root causes or not, the problem not only continued, it exploded.\n\nA new record for illegal border crossings was set nearly every year of the Biden presidency.\n\nAccording to an October report from the House Homeland Security Committee, federal law enforcement encountered nearly 11 million illegal aliens crossing the border since Biden took office.\n\nTo put those numbers in perspective, this is more people than the entire population of all but seven states according to the 2020 census.\n\nWhen the border issue became politically toxic, the Biden administration attempted to create the appearance of orderliness while doing nothing to stem the real “root cause” of the problem: their insistence that border enforcement was fundamentally illegitimate.\n\nThe only significant thing the Biden White House did in four years was to insist that Congress pass legislation to send money to mostly Democrat-run cities (and Ukraine) and to codify the catastrophic new border policies into law. This was billed as an attempt to solve the problem that they had loudly insisted didn’t exist.\n\nIt wasn’t a solution, it was a farce meant to distract the American people and construct a sophist argument that it was really Republicans who didn’t want border security. That argument was about as believable as Biden’s absurd claim that Republicans were the ones who wanted to defund the police.\n\nI do believe that peddling these fantasies and the legacy media’s complicity in promoting them are at least part of the reason Trump marched back into the White House in January with even more support than his first go around.\n\nThe bottom line is that the stunning turnaround at the border is primarily due to two simple factors. The Biden administration didn’t want to uphold the law, and Trump does. As the Washington Examiner noted on Wednesday, it didn’t take any new legislation from Congress to see immediate and spectacular changes at the border.\n\n“Biden did not need new legislation, as he had claimed, to push Mexico to help strengthen the border,” editors at the Examiner wrote. “Trump did not need congressional action to reinstate his successful Remain in Mexico policy. Congress can still improve our immigration system, but Biden’s claims that his hands were tied by limited resources dictated by Congress was always a lie.”\n\nThe problem for the Trump administration going forward is what to do about the millions of people now living illegally in the U.S.\n\nThe Biden administration and its immigration activist supporters no doubt hoped that by bringing in so many people, they would make it both messy and unpopular to attempt to deport even a small percentage of them.\n\nBut so far, Trump’s border policies seem more popular than ever. Biden’s border madness created a historic vibe shift. It’s up to the Trump administration to clean up the mess.","summary":"The massive flood of illegal aliens across the southern border has become a trickle, disappearing almost as swiftly as it first emerged four years ago.... Read More\n\n\nThe post Historic Plummet in Illegal Border Crossings Reveals the Root Cause of the Biden Border Crisis appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/19/historic-plummet-illegal-border-crossings-reveals-root-cause-biden-border-crisis/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/250219_BorderCrisis.jpg","video":null,"publish_date":"2025-02-20 00:35:09","author":"Jarrett Stepman","authors":["Jarrett Stepman"],"language":"en","source_country":"us","sentiment":-0.366},{"id":292320676,"title":"California Homeowners to Get Mortgage Help Under New Plan","text":"California Governor Gavin Newsom announced on Wednesday homeowners could receive mortgage help under a new proposed plan after the Los Angeles wildfires caused enormous losses last month.Newsweek has reached out to Newsom's office via email for comment.Why It MattersThe blazes that ravaged Los Angeles County in January are estimated to be the largest wildfire-insured loss in American history, having caused billions in damages. According to official data, the wildfires damaged or destroyed more than 17,000 structures, including thousands of homes.What To KnowNewsom announced on Wednesday a new proposal that will create a $125 million mortgage relief program to assist homeowners at risk of foreclosure or whose homes were destroyed or severely damaged by recent natural disasters dating back to 2023.This means victims of the Park, Franklin, Palisades and Eaton fires could be eligible for relief.Newsom's office noted that the relief package would not impact the proposed 2025-26 budget and instead be funded by using an existing mortgage settlement fund that was reached by then-California Attorney General Kamala Harris with big lenders in the wake of the Great Recession.According to Newsom, if approved, the package will be administered by the California Housing Finance Agency (CalFHA), which oversees those settlement funds, and will include over $100 million in direct mortgage assistance.In addition, funding for the program would also extend an existing counseling services program, which helps affected homeowners navigate their recovery.\"As survivors heal from the trauma of recent disasters, the threat of foreclosure should be the last thing on their minds. This disaster mortgage relief program would help lift this burden and give families more time to focus on recovery,\" Newsom said in a press release.Meanwhile, hoping to provide some temporary help, Newsom has also recently secured agreements with major banks and hundreds of state-chartered lenders to offer a simplified process granting fire victims a 90-day pause on their mortgage payments.California Insurance Coverage Concerns However, the proposed program comes as California homeowners are still facing financial and insurance coverage uncertainty in the wake of the LA fires.State Farm General, the state's largest insurer, has asked for an emergency insurance rate increase as high as 22 percent for some homeowners. State Farm General covers more than 2.8 million policyholders in California.The insurance firm had requested an increase in rates of 22 percent for non-tenant homeowners, 15 percent for renters, 15 percent for condominium unit owners, and 38 percent for \"Rental Dwelling.\" If approved, the new rates would have taken effect on May 1.However, on Friday, insurance commissioner Ricardo Lara turned down the request, stating that State Farm has not demonstrated a need for the increase nor clarified how the additional premium revenue would influence its previous decisions to halt the issuance of new home policies in the state.Lara also said he had several questions regarding the financial viability of State Farm despite previous rate hikes and whether it has provided \"adequate documentation to justify\" the cost increase.State Farm General confirmed last week it has received more than 8,700 claims and has already paid more than $1 billion to customers in the aftermath of the Los Angeles fires, and said the incidents \"will further deplete capital from State Farm General.\"In a previous statement sent to Newsweek on Monday, a spokesperson for State Farm said: \"We have gone to great lengths to clearly answer the questions outlined by the Commissioner. While we're positioned to handle all of the claims associated with the most recent wildfires, State Farm General must seriously consider its options within the California insurance market going forward.\"What People Are SayingCalifornia Governor Gavin Newsom said in a post on X, formerly Twitter, on Wednesday: \"Following the recent LA fires, I am proposing $125 million in mortgage relief for homeowners who have been impacted by natural disasters since 2023 and are at risk of foreclosure. The threat of foreclosure should be the last thing on the minds of survivors of these disasters.\"Commissioner Lara in a statement issued on February 14: \"Our decisions must be guided by transparent data and an honest reckoning with the challenges we all face together. As the elected head of the Department, my primary responsibility is to the people of California. This situation highlights the voters' wisdom in having an independent, elected Insurance Commissioner making decisions to uphold market integrity in response to evolving threats, which today include climate change, rising global reinsurance costs, and a tightening national property insurance market.\"What Happens NextThe proposal will be considered at the CalHFA's next meeting on February 20. If approved, the direct assistance program and eligibility criteria will be developed and announced in more detail.","summary":"California Governor proposed a $125 million mortgage relief program to assist homeowners at risk of foreclosure or whose homes were destroyed.","url":"https://www.newsweek.com/california-homeowners-get-mortgage-help-under-new-plan-2033509","image":"https://d.newsweek.com/en/full/2591834/california-wildfire.jpg","video":null,"publish_date":"2025-02-20 00:06:52","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","category":"business","source_country":"US","sentiment":-0.183},{"id":292310614,"title":"Revealed: George Clooney's Surprise Message to Donald Trump AND the Democrats After Leftie A-Lister Was Hammered With Hate for 'Ousting' Joe Biden From Presidential Race","text":"George Clooney isn't missing his chance to dive into politics on a public stage.\n\nThe die-hard Democrat took his Tuesday spot on The Late Show with Stephen Colbert to crack a joke about the Capitol riot and snarkily wish Trump \"well\" in his presidency after facing backlash for urging Biden to step down last year, RadarOnline.com can reveal.Clooney, 63, appeared on the CBS talk show to promote his Broadway play Good Night, and Good Luck.\n\nThe conversation shifted to politics, with the actor – who endorsed Kamala Harris in the last election – sharing he was raised a Democrat in Kentucky and joking how \"it has been nothing but fun.\"While Donald Trump was never mentioned by name, the Oscar winner continued to discuss the Democrats' loss in the 2024 presidential election.\n\nReferencing the 2021 insurrection, Clooney joked: \"Well I don't know, what am I supposed to do? Storm the f---ing Capitol?\"He further referenced the current president, adding: \"Good for you. I hope you do well because our country needs it, and we will meet you in 3.5 years and see where we go next.\"\n\nThis follows Clooney's op-ed from earlier last year, titled I love Joe Biden. But We Need a New Nominee.\n\nThe actor pushed Joe Biden, who was still a candidate at the time, to withdraw from the race to improve the Democrats' chances of holding onto the White House.Though clearly disappointed by the 2024 election results, Clooney told Colbert that losing is just a natural part of the democratic system.\n\nHe went on: \"It's part of democracy. There are people who agree and disagree, and most of us still like each other, we're all gonna get through it.\"The Money Monster star shared a personal story in an attempt to connect the race to his normal life, saying: \"I have a son who plays in chess tournaments, loves chess. \n\n\"He's seven years old, and he's playing against a lot of older kids and he is not winning all the time, as you can imagine.\n\n\"He gets upset, and I say, 'Listen, shake the guy's hand, you say good game, I'll get you next time.' And that's kind of how... you've got to live by those rules.\"Colbert then joked about the future election after Clooney reacted to Trump's July 2024 comment suggesting people wouldn't need to vote again in four years. \n\nClooney, who raised $30million for Biden's 2024 campaign, was seen as a key figure in encouraging Biden to continue his re-election bid.In early July, shortly before the Democratic National Convention, Clooney wrote the New York Times op-ed urging Biden to step aside as the nominee. \n\nHe praised his character but stated how age and time were working against him, referencing Biden's performance in the June debate.\n\nClooney explained: \"I love Joe Biden. As a senator. As a vice president and as president. I consider him a friend, and I believe in him. Believe in his character. Believe in his morals.\"But the one battle he cannot win is the fight against time. None of us can. It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe 'big f-ing deal' Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate.\"\n\nHe further warned Biden would likely lead the party to defeat in the upcoming election, citing concerns shared by numerous lawmakers. He argued how replacing him would re-energize the party and re-engage voters.Following the op-ed, Biden endorsed Harris as his successor on July 21. \n\nClooney praised Biden's decision, calling it a move that \"saved Democracy,\" and expressed excitement for Harris's campaign.He also supported her by narrating an ad targeting male voters about the impact of voting for Trump on women's lives. \n\nDespite Harris and her running mate Tim Walz's loss to Trump in the Electoral College, they only narrowly lost the popular vote by 1.5%.Clooney was quickly blamed by angry liberals for Harris' election defeat, with devastated Democrats turning on the Hollywood star for urging Biden to step down.\n\nSome Dems felt if Clooney had not gotten involved, Biden may have secured victory due to his appeal to the white working class voter.Plus, they believed Harris did not have adequate time to form a strong campaign.","summary":"The liberal actor had a few shocking words for president Trump during his recent talk show appearance, which came after he urged Biden to step down last year.","url":"https://radaronline.com/p/george-clooney-message-donald-trump-democrats-joe-biden-backlash-presidential-race/","image":"https://media.radaronline.com/brand-img/2D2Td2LYA/0x0/george-clooney-message-donald-trump-democrats-joe-biden-backlash-presidential-race-1739996160149.jpg","video":null,"publish_date":"2025-02-19 23:00:00","author":"Juliane Pettorossi","authors":["Juliane Pettorossi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.119},{"id":292309210,"title":"Why the CBS executive was fired after troubled seven months of scandal","text":"Insiders tell Daily Mail the real reason for a top CBS News executive’s abruptly announced exit from the company after less than seven months was her falling out of favor with her CEO.\n\nA source familiar with the matter made the revelation Thursday, after the network’s president of editorial and news gathering, Adrienne Roark, made waves by announcing her ‘resignation.’\n\nThe insider said that in weeks before, Roark actually had been shopping for a new job – a development CBS News and Stations CEO Wendy McMahon became aware of, and felt betrayed by.\n\n‘Adrienne was essentially Wendy’s right hand, long before Ingrid [Ciprián-Matthews] was pushed out,’ the source said, referring to the network’s former president – and Roark’s predecessor – who resigned this past August after less than a year.\n\n‘This was Adrienne’s dream job,’ the insider went on, referring to how Roark rose through the ranks after starting her career at a CBS affiliate in Ohio decades ago.\n\n‘Wendy found out that Adrienne was searching for a new job and got pissed,’ they said, as Roark is now set to take on a senior role at less prestigious Tegna – a TV group comprised of 68 local-level stations, fifteen of which are CBS affiliates.\n\n‘They brought back former president Susan [Zirinsky] just to get rid of her,’ a former CBS executive producer further revealed, after the network rehired the vet – after her stepping-down in 2021 – as a ‘temporary’ editor last month. \n\n‘Neither Wendy or Adrienne have the editorial experience of leading a national news organizations,’ the first source said, as CBS News continues a yearslong leadership crisis.\n\n‘Roark is mainly local. She was not ready for this job, the intensity of the news cycle – especially at this time,’ they added, as Roark is set to leave CBS by the end of this month, ahead of an anticipated merger between CBS parent Paramount Global and Skydance Media valued around $8billion.\n\nNotably, Roark was one of several execs including McMahon to reprimand one of her anchors for a fiery interview with pro-Palestinian writer Ta-Nehsi Coates that aired on CBS Mornings in October.\n\nThe interview sparked some rare commentary from the billionaire daughter of the late Sumner Redstone and Paramount’s controlling shareholder, who is set to make a pretty penny if the Skydance merger goes through.\n\nLate last month, multiple insiders familiar with the matter revealed the heiress was looking to settle a Donald Trump-filed lawsuit surrounding a supposedly bias 60 Minutes interview as to not jeopardize the deal, which requires governmental approval.\n\nRedstone, in turn, rebuked Roark for her dressing down of the anchor in question, CBS Mornings’ Tony Dokoupil. C-suite staffers were said to have slammed his ‘bias’ when speaking with Coates, and how he tore into his guest’s opinions.\n\nThe rest of the sitdown carried a similar tone, and within hours spawned a wartime conference call headed execs like Roark the following Monday.\n\nAlso on the call Jan Crawford, CBS News’ chief legal correspondent, and one of the few to express hesitance as to why Dokoupil’s line of questioning had not met Roark’s editorial standards.\n\n‘I appreciate you bringing this up,’ Roark said in response, then just weeks into the position left behind by her predecessor, Ciprián-Matthews. ‘I know this is a lot for everybody to process.’ \n\nCiprián-Matthews, meanwhile, abruptly stepped down in August – a move that itself raised eyebrows due to it coming in the midst of an election.\n\nMoreover, the move was made a month after Skydance said it had identified at least $2billion worth of waste to be cut ahead of a prospective merger, seemingly putting the 30 year vet who started at the network in 1993 on the chopping block\n\nShe was investigated in 2021 over favoritism and discriminatory hiring and management practices, three years after becoming CBS’s executive vice president of strategic professional development.\n\nThat same year, McMahon left her high-powered post ABC to become the co-president of CBS News and Stations, which had just been reorganizied to contain aspects of both CBS’s local and national news divisions.\n\nThe two have since been more aligned – a task Roark herself was responsible for, even before being promoted to president of editorial and newsgathering in August. \n\nOn the call on October 7 – just hours after the Coates interview – Roark told those on the line, ‘After a review of our coverage, including the interview, it’s clear that there are times we have not met our editorial standards.’ \n\n‘This has been addressed, and it will continue to be in the future,’ she added – forcing Dokoupil to meet for an hour with members of the CBS News standards and practices team, as well as an in-house Race and Culture Unit, the Times reported\n\nDokoupil, who joined CBS News in 2016 before snagging a spot on Mornings three years later, adhered, leading Redstone, a day later, to weigh in.\n\n‘I think we made a mistake,’ said Redstone at an event in New York City that was part of Advertising Week at the time. ‘I think we made a bad mistake this week.’\n\nWithin weeks, Trump would win the election, after which he filed the suit that named both Paramount and asset CBS as defendants\n\nThe filing surrounds a 60 Minutes interview with then-Vice President Kamala Harris that also aired in October, and that included an edit Trump claimed was favorable to Harris’s since settled campaign.\n\nIn the excerpt, the candidate was asked a question about the Israeli-Hamas conflict, and gave a lengthy answer – one different than the one that aired on Margaret Brennan’s Face the Nation.\n\nTrump’s team went on to accuse the program of selecting a more coherent quote from Harris to help her candidacy, paving the way for reports from publications like the Times and Status indicating that Redstone is looking to make the lawsuit go away.\n\nSeemingly looking to avoid any prospective government pushback, the heiress was part of settlement talks started as early as late last month, three people with ‘knowledge of the talks’ told the Times. \n\nRoark’s exit, meanwhile, is as only the latest casualty for CBS, which just weeks ago launched a revamped version of CBS Evening News with two anchors a more magazine-style format, more akin to that of ratings crown jewel 60 Minutes.\n\nSo far, it has failed to address waning ratings.\n\nCBS CEO McMahon – who declined to name a new executive to lead the national newsgathering division in the wake of Roark’s exit announcement Thursday – is behind that push, and was amongst those to rebuke Dokoupil for his interview.\n\nShe assumed the position after for years holding Roark’s role alongside Neeraj Khemlani, after replacing Zirinsky, a veteran producer who rose through the the ranks after joining the CBS News Washington Bureau in 1972.\n\nThis too was the case with Roark, who began her career in her native Ohio at WBNS-TV, the CBS affiliate in Columbus, more than 20 years ago.\n\nDespite boasting experience with local station management, she had little experience tried running national TV news programs as Zirinsky, Khemlani, and McMahon had done before.\n\nAt Tegna – where she is set to obtain a senior position – a total 22 of the company’s stations are affiliated with NBC, 12 are affiliated with ABC, and six are linked to Fox.","summary":"Internewscast Journal\n\nInternewscast\n\n\nInsiders tell Daily Mail the real reason for a top CBS News executive&#8217;s&#8230;\n\n\nThis Post: Why the CBS executive was fired after troubled seven months of scandal first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/why-the-cbs-executive-was-fired-after-troubled-seven-months-of-scandal/","image":"https://internewscast.com/wp-content/uploads/2025/02/rewrite-this-title-The-real-reason-CBS-executive-was-given.jpg","video":null,"publish_date":"2025-02-19 22:51:04","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.168},{"id":292320400,"title":"'Under attack': JFK's only grandson rips DOGE, family members in series of vulgar social media rants","text":"JFK's grandson took to Instagram on Tuesday and Wednesday to accuse President Donald Trump and the Department of Government Efficiency (DOGE) of attempting to \"steal the past\" from the American people. \"I'm OK, but our country is not,\" Jack Schlossberg, former President John F. Kennedy's only grandson, said in an Instagram post on Tuesday. \"It's under attack from its own government.\" The 32-year-old alleged DOGE is \"generating propaganda,\" not cutting spending. ‘CATASTROPHIC RESULTS’: UNION, TAXPAYER GROUPS TAKE STAB AT DOGE IN LATEST LAWSUIT OVER IRS DATA ACCESS DOGE, a temporary White House organization with an 18-month lifespan, was created by an executive order earlier this year. It is tasked with optimizing the federal government, streamlining operations, and slashing spending. While Schlossbery announced he was quitting social media weeks ago, the post came after the John F. Kennedy Presidential Library and Museum confirmed on Tuesday it is closed \"until further notice.\" \"The sudden dismissal of federal employees at the JFK Library forced the museum to close today,\" according to the statement. \"As the Foundation that supports the JFK Library, we are devastated by this news and will continue to support our colleagues and the Library.\" LAWSUIT TRACKER: NEW RESISTANCE BATTLING TRUMP'S SECOND TERM THROUGH ONSLAUGHT OF LAWSUITS TAKING AIM AT EOS Schlossberg, who served on several of the library's committees, panned the camera to a framed picture with a handwritten message, supposedly given to him by an astronaut, telling viewers they would never know that his grandfather contributed to space exploration if it weren't for the library. \"JFK sent a man to the moon, but you’d never know it if the JFK Library wasn’t open and no one was allowed to talk about it,\" he said. \"It's time to speak out and resist what's happening,\" Schlossberg said. \"If you're not doing that, you're not helping.\" While the rant was initially posted on Instagram, Schlossberg shared the video on X, directly calling out organization leader Elon Musk. DOGE SCORES BIG COURT WIN, ALLOWED ACCESS DATA ON 3 FEDERAL AGENCIES \"Hey DOGE eat s--- buddy :) @elonmusk,\" he wrote. Just weeks ago, Schlossberg posted on X saying there was \"nothing heroic\" about President Donald Trump issuing an executive order to declassify the JFK files. \"The truth is a lot sadder than the myth — a tragedy that didn’t need to happen. Not part of an inevitable grand scheme,\" he wrote. \"Declassification is using JFK as a political prop, when he’s not here to punch back.\" Schlossberg worked on Barack Obama's presidential primary campaign during high school, and later supported Chris Murphy, Hillary Clinton, Joe Biden, and Kamala Harris. The young Kennedy, who holds both Yale and Harvard University degrees, amassed nearly 600,000 followers on Instagram, with much of his content centering around video rants. In subsequent videos, Schlossberg went on to blast cousin \"Kick\" Kennedy and uncle Robert F. Kennedy Jr., who was sworn in as Secretary of Health and Human Services on Thursday. He also attacked cousin Joe Kennedy III for not speaking out against RFK Jr., who he referred to as \"uncle schmuck.\" \"This is my cousin Joe who is happy to do media NOW but cannot find courage to say s--- about RFKJR - classic self promo no spine,\" Schlossberg wrote. \"Grow a pair or sit down.\" Photos he posted Wednesday afternoon featured Schlossberg shirtless, wearing feathers around his neck, alongside scantily clad women. One, featuring two women's bottoms prominently turned toward the camera, was later deleted. \"Making sure I always look professional,\" he wrote alongside one of the pictures. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital's Rachel Wolf contributed to this report.","summary":"JFK&apos;s only grandson posted a series of videos to social media sites on Tuesday and Wednesday, calling out DOGE and other Kennedy family members.","url":"https://www.foxnews.com/politics/under-attack-jfks-only-grandson-rips-doge-family-members-series-vulgar-social-media-rants","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/JackSch1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 22:29:13","author":"Alexandra Koch","authors":["Alexandra Koch"],"language":"en","category":"politics","source_country":"us","sentiment":-0.21},{"id":292304714,"title":"HHS defines sex as ‘immutable biological classification,’ reversing Biden","text":"In line with President Donald Trump’s Day One executive order defining male and female on an individual’s reproductive cells, or gametes, HHS issued guidance defining sex as “a person’s immutable biological classification as either male or female” based upon the respective production of sperm or eggs. \n\nThe measure came as a massive sea change from the leadership of former President Joe Biden, whose administration held that self-defined gender identity was more important, both personally and legally, than biological sex. \n\n“This administration is bringing back common sense and restoring biological truth to the federal government,” newly confirmed HHS Secretary Robert F. Kennedy, Jr. said in a press release Wednesday. “The prior administration’s policy of trying to engineer gender ideology into every aspect of public life is over.” \n\nTransgender matters became a significant part of the 2024 presidential campaign, with Trump highlighting how his opponent, former Vice President Kamala Harris, supported government-funded transgender medical treatments for trans-identified inmates in prisons.\n\nShortly into his current term, Trump signed an executive order federally banning transgender medical procedures for minors, instructing HHS to examine agency and subagency level mechanisms to “end the chemical and surgical mutilation of children,” including potentially changing the conditions of Medicare and Medicaid reimbursement for doctors and hospitals. \n\nIn addition to defining male and female based on reproductive anatomy, the HHS guidance defines “mother” as “a female parent” and father as “a male parent,” as well as “boy” and “girl” as minors of their respective sexes.\n\nThe HHS guidance also defines “woman” as “an adult human female” and “male” as “an adult human male.” \n\nThese definitions are in stark contrast to HHS policy even two years ago, when the Centers for Disease Control and Prevention received blowback from GOP conservatives for its guidance on so-called “chestfeeding,” as opposed to breastfeeding, to be inclusive of trans-identified patients.\n\nThe definitions have clear implications for a host of HHS policies, especially in clinical settings, said Dr. Dorothy Fink, deputy assistant secretary for the Office on Women’s Health.\n\n“In health care, sex distinctions can influence disease presentation, diagnosis, and treatment differently in females and males,” Fink said in Wednesday’s press release. “HHS recognizes that biological differences between females and males require sex-specific practices in medicine and research to ensure optimal health outcomes.” \n\nAs part of the guidance, HHS launched a new website titled “Protecting Women and Children,” which includes information on Trump’s executive order on transgender medical treatments for minors. \n\nThe webpage also includes specific health tips for female athletes, who often deal with different biological challenges compared to males, and women’s health clinical trials.\n\nThe new Trump administration’s efforts to define biological sex have influenced more than just the medical field, sending shockwaves through the scientific community as well.\n\nIn response to Trump’s Day One biological sex executive order, three prominent evolutionary biology organizations sent a public letter to the president saying biological sex “is not a binary trait” but rather a combination of chromosomes, hormones, and a host of other identifying characteristics.\n\nProminent atheist thinkers Richard Dawkins and Jerry Coyne have joined a sizable group of scientists to disagree with the evolutionary science organizations and back the Trump administration’s definition, saying sex is “universally defined by gamete type.”","summary":"Biological sex is the sole basis for defining the words &#8220;male,&#8221; &#8220;female,&#8221; &#8220;father,&#8221; and &#8220;mother,&#8221; according to new guidance published Wednesday afternoon by the Department of Health and Human Services. In line with President Donald Trump’s Day One executive order defining male and female on an individual’s reproductive cells, or gametes, HHS issued guidance defining [&#8230;]","url":"https://www.washingtonexaminer.com/policy/healthcare/3324182/hhs-defines-sex-immutable-biological-classification-reversing-biden/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/AP25044720836868.webp","video":null,"publish_date":"2025-02-19 22:24:41","author":"Gabrielle M. Etzel","authors":["Gabrielle M. Etzel"],"language":"en","source_country":"us","sentiment":0.333},{"id":292316688,"title":"Trump gets near-universal approval from Maine Republicans, poll finds","text":"Maine voters are sharply split on President Donald Trump, according to a new poll that found 98% of Republicans said they support his performance one month into his second administration.\n\nMeanwhile, only 1% of Democrats agreed, according to the survey by researchers at the University of New Hampshire.\n\nAmong unenrolled voters, 36% said they approve of his performance. Trump’s overall approval rating in Maine was 45%.\n\n“Mainers are considerably more likely than before Trump’s inauguration to think the country is headed in the right direction, fueled by extremely high optimism among Republicans,” the study’s authors wrote in their summary.\n\nAmong those who approved of Trump’s job so far, just over one-third cited “reducing spending” as the primary reason. Twenty percent reported “keeping campaign promises” as their primary reason; 12% cited Trump’s “handling of immigration.”\n\nMore than half of those surveyed — 54% — believe Elon Musk’s role in the administration is inappropriate. That includes 98% of Democrats and 73% of independents. On the other hand, 87% of Republicans approve of Musk’s role as leader of the group known as the Department of Government Efficiency, which is working to eliminate agencies and slash the federal workforce.\n\nMore than a quarter of those who expressed disapproval with Trump cited “undermining democracy/Constitution.” The next most common primary reasons were Musk’s role and Trump’s “poor character,” according to the survey.\n\nMainers were also largely split along party lines when asked about Trump’s pardoning of participants in the Jan. 6, 2021, attack on the Capitol.\n\nEighty-four percent of Republicans said they approved of pardoning the Jan. 6 participants, compared to just 38% of independent voters and 2% of Democrats.\n\nAsked about former President Joe Biden’s pardoning of his son Hunter, only 5% of Republicans approved of Biden’s pardon, while 38% of independents and 45% of Democrats approved.\n\nSupport for some of Trump’s more controversial executive orders varied widely.\n\nWhile 62% of respondents supported Trump’s order to release records related to the assassinations of Martin Luther King Jr. and former President John F. Kennedy, only 20% supported his order to rename the Gulf of Mexico to the Gulf of America, according to the survey.\n\nThe survey included responses from 855 total Mainers and was conducted between Feb. 13 and 17. Roughly 44% percent identified as Democrats, 41% Republicans and 16% independent voters. Half of those surveyed voted for Democratic nominee Kamala Harris, who won three of Maine’s four electoral votes.\n\nThe margin of error was plus or minus 3.4 percentage points, the administrators said.","summary":"But more than half of those surveyed in the UNH poll — 54% — believe Elon Musk’s role in the administration is inappropriate.","url":"https://www.centralmaine.com/2025/02/19/trump-gets-near-universal-approval-from-maine-republicans-poll-finds/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2025/02/Trump_46686_a8b94e.jpg?w=1000","video":null,"publish_date":"2025-02-19 22:19:25","author":"Daniel Kool","authors":["Daniel Kool"],"language":"en","category":"politics","source_country":"us","sentiment":-0.246},{"id":292299474,"title":"Is Kamala Harris Running for Governor? California Senators Would Also Like to Know","text":"California senators are taking a wait-and-see approach to whether they’ll back Kamala Harris in a potential run for governor. But Sen. Adam Schiff said he thinks she’d excel at the job.\n\n“I think that is a decision that she will have to make, and I can appreciate her wanting some time to figure it out,” he told NOTUS. “But I think if she decided to do so, she’d be an outstanding governor.”\n\nGov. Gavin Newsom is term-limited, and several high-profile Democrats have already signaled they want to run next year to replace him. Harris has yet to say whether she’d run — but there could be significant momentum behind her.\n\nA majority — 57% — of likely primary voters in California would support Harris for governor, according to a recent Emerson College Polling/Inside California Politics/The Hill poll. Other potential candidates polled far lower: Former Rep. Katie Porter was second with 9% of likely primary voters saying they’d back her.\n\nFormer Senate pro Tem Toni Atkins, from San Diego, Democratic Lt. Gov. Eleni Kounalakis, California Democratic Party Vice Chair Betty Yee and former Los Angeles Mayor Antonio Villaraigosa have announced plans to run, as has the Republican Riverside County sheriff, Chad Bianco.\n\nSchiff told NOTUS he would not run: “I have plenty of work to do here.”\n\nSen. Alex Padilla was less direct, saying only that he would wait to see what Harris decided when it came to both supporting her potential bid and whether he would consider one.\n\n“I will wait for her to make her decision; we’ll go from there,” he told NOTUS.\n\nHarris, who has won statewide races in California three times — once as a U.S. senator and twice as attorney general — is still a strong political figure in the state. She defeated President Donald Trump 58% to 38% in November, although she underperformed compared to former President Joe Biden in most counties.\n\nA spokesperson for Harris directed NOTUS to the former vice president’s recent comments on a potential bid for governor.\n\n“I have been home for two weeks and three days. My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them,” Harris told reporters earlier this month while touring communities affected by the Palisades fires in Los Angeles.\n\n“I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground,” she added.\n\nVariety reported on Tuesday that Harris had signed with Creative Artist Agency, a California firm that will represent her on her post-White House endeavors. CAA previously represented Harris when she was a senator before she joined the Biden administration.\n\nIf Harris does run for governor, she could face off against a Trump loyalist. Richard Grenell, Trump’s envoy for special missions and former acting director of national intelligence, said he would consider running for governor if Harris was a candidate.\n\n“I wouldn’t say no,” Grenell told reporters last week when asked whether he would run for governor.\n\n“If Kamala Harris runs for governor, I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is, that it’s a new day in California, and that the Republican actually has a shot,” Grenell said.\n\nThis story was produced as part of a partnership between NOTUS — a publication from the nonprofit, nonpartisan Allbritton Journalism Institute — and NEWSWELL, home of Times of San Diego, Santa Barbara News-Press and Stocktonia.","summary":"Gov. Gavin Newsom is term-limited, and several high-profile Democrats have already signaled they want to run next year to replace him.","url":"https://timesofsandiego.com/politics/2025/02/19/is-kamala-harris-running-for-governor-california-senators-would-also-like-to-know/","image":"https://timesofsandiego.com/wp-content/uploads/2018/02/State-Democratic-Convention-34.jpg","video":null,"publish_date":"2025-02-19 22:04:23","author":"Chris Stone,Samuel Larreal • NOTUS","authors":["Chris Stone","Samuel Larreal • NOTUS"],"language":"en","category":"politics","source_country":"us","sentiment":-0.052},{"id":292289868,"title":"Former Biden administration advisor slams Netanyahu for obstructing U.S. efforts at Gaza hostage deal","text":"WASHINGTON – Ilan Goldenberg, a top advisor to former U.S. Vice President Kamala Harris, provided the most in-depth accounting of Prime Minister Benjamin Netanyahu's efforts at obstructing U.S. diplomacy over the course of the Gaza war.","summary":"'Netanyahu's behavior was deeply problematic': Ilan Goldenberg's article represents the first real accounting from a senior Biden administration official on what the previous administration could have done differently to secure a cease-fire","url":"https://www.haaretz.com/us-news/2025-02-19/ty-article/.premium/former-biden-admin-advisor-slams-netanyahu-for-obstructing-u-s-efforts-at-hostage-deal/00000195-1ec4-d293-a1d5-fec7899c0000","image":"https://img.haarets.co.il/bs/00000195-1fc8-d27e-a1d7-3ffcdd5b0000/ce/73/a89789df4623876592fb3e6c2b60/603572.jpg?height=630&width=1200","video":null,"publish_date":"2025-02-19 20:08:40","author":"Ben Samuels","authors":["Ben Samuels"],"language":"en","category":"politics","source_country":"il","sentiment":0.413},{"id":292281698,"title":"President Trump, NYC’s Biggest Hater, Says He Is Nixing Congestion Pricing","text":"After going into effect early this year after years of failed starts, New York City’s congestion pricing is under threat once again. President Trump has followed through on a campaign promise to target the program, which aims to reduce congestion, noise, and pollution in Manhattan and fund repairs to the city’s subways by charging drivers entering its busiest corridors.\n\nAccording to a letter sent on Wednesday by Sean Duffy, Trump’s transportation secretary cited the program’s impact on working-class drivers as motivation for the decision, and told Governor Kathy Hochul he would contact the state to “discuss the orderly cessation of toll operations.” Duffy also argued the program is illegal because tolls are being used to fund the subway rather than the roadways. It is unclear whether the federal government has control over NYC’s tolling.\n\nEarly results of congestion pricing show what was to be expected, according to the city and reports from other outlets. An early survey from the New York Times found that many commuters who previously went to work by private car had adapted by switching to other modes of transportation, like commuter buses, and found their transit times had been reduced by minutes or more. And for those who continued to drive, commute times fell noticeably as well—probably explaining why new polling has found frequent commuters into the city support tolling.\n\nUnder congestion pricing, most drivers pay $9 to enter Manhattan below 60th Street. Economists for millennia have used incentives to encourage preferred behavior, and this is nothing different. Manhattan is an island of 22 miles with a population of 1.6 million; it has to push people to the subways. And despite conservative cries that the subway is less safe than ever, the raw data simply shows otherwise.\n\nOther cities around the world have implemented congestion pricing in prior decades with positive results, but NYC is the first city in the United States to do so. In London, which implemented congestion pricing way back in 2003, the program was initially unpopular before approval rose to 59% as locals came to appreciate newly decongested roads. The city saw a 30% decrease in traffic in the first year.\n\nEven though congestion pricing is practical in a city like Manhattan where the subway is materially faster and roadways are constantly gridlocked—and early results show the program is working as intended—it has been turned into a partisan issue, with conservatives using congestion pricing as an opportunity to attack a major liberal city as taking away personal liberties and hurting the working class. Kamala Harris won 68% of the recent presidential vote in New York City.\n\nPresident Trump has railed against NYC for a long time as an offering of red meat for his base. And his Justice Department earlier this week decided to drop corruption charges against Mayor Eric Adams, who has long sided with Trump on removing migrant populations from the city. It has been speculated that Adams will cooperate with ICE on immigration enforcement in return for escaping prosecution.\n\n Eric Adams was always a xenophobic bigot: “[Migrants] will destroy NYC. How many of you are organized to stop what they’re doing to us? It’s going to come to your neighborhoods. All of us are going to be impacted. The city we knew we’re about to lose.” pic.twitter.com/QLF4mJEJUw — Scott Hechinger (@ScottHech) February 18, 2025\n\nThe city’s Metropolitan Transit Authority, which oversees tolling, has already filed a lawsuit challenging the move. The agency said tolling would “continue notwithstanding this baseless effort to snatch those benefits away from the millions of mass transit users, pedestrians and, especially, the drivers who come to the Manhattan Central Business District.”\n\nThe whole thing is ironic because the GOP is supposed to be the party of states’ rights… until it is not. Why should the federal government be able to dictate whether a not a city and its residents can charge tolls to use their roads? These are not federal highways—NYC should be able to continue with its program.\n\n We are a nation of laws, not ruled by a king. pic.twitter.com/PikwB5OwnM — Governor Kathy Hochul (@GovKathyHochul) February 19, 2025","summary":"Early results from congestion pricing have been positive, but President Trump is no fan of the liberal city and attacking congestion pricing is red meat for his base.","url":"https://gizmodo.com/president-trump-nycs-biggest-hater-says-he-is-nixing-congestion-pricing-2000565725","image":"https://gizmodo.com/app/uploads/2024/09/quantum-network-nyc-brooklyn.jpg","video":null,"publish_date":"2025-02-19 20:05:20","author":"Thomas Maxwell","authors":["Thomas Maxwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.063},{"id":292281254,"title":"After kicking out Joe Biden from the presidential ticket in 2024, George Clooney now has a surprising message for Donald Trump; here's what it is","text":"In the CBS late-night talk show, American actor and filmmaker George Clooney shared a surprising message for US president Donald Trump after he played a crucial part in the 2024 presidential election, as per a report.George Clooney's message for Donald TrumpAccording to Daily Mail, Clooney sent an unexpected direct message to Trump, without mentioning his name: Good for you. I hope you do well because our country needs it, and we will meet you in 3.5 years and see where we go next. Reflections on Clooney's political stanceClooney, a long-time vocal Democrat, shared how he had been brought up in Kentucky as a Democrat. As per the report, he even recalled he had first time voted in the 1980 elections when he cast his ballot for Democratic incumbent Jimmy Carter, which Ronald Reagan won. Clooney said I lost with some Bushes and I won with some Clintons and Obamas, adding, You know, this is Democracy, as quoted by Daily Mail.Comment on the Capitol insurrectionAccording to Daily Mail, Clooney did not explicitly name Trump, but he referred to the January 6, 2021, Capitol insurrection with a biting comment: Well, I don't know, what am I supposed to do? Storm the Capitol? Clooney’s view on presidential electionHis comments follow his 2024 op-ed urging former president Joe Biden to step down for a better shot at keeping the White House, George Clooney reflected on the election’s outcome, as per the report. Though disappointed with the election result, Clooney stressed that losing is part of democracy.According to Clooney It's part of democracy. There are people who agree and disagree, and most of us still like each other, we're all gonna get through it, as quoted in the report.Clooney’s op-ed was part of a wider push among Democrats for Biden to step aside, which he did just 11 days later, endorsing former vice president Kamala Harris as his successor. Clooney had praised Biden for the decision, calling it “saving Democracy,” and expressed excitement for Harris’s “historic quest.” According to Daily Mail, he then doubled down on his endorsement of Harris by narrating a campaign advertisement that urged men to consider how voting for Trump would affect the women in their lives.FAQsWhat message did George Clooney send to Donald Trump?Clooney sent a message of good wishes to Trump, saying, “I hope you do well because our country needs it, and we’ll meet you in 3.5 years.”What is Clooney's political background?Clooney has been a vocal Democrat from the beginning. He shared that he was raised in a Democratic household and first voted for Jimmy Carter in 1980.","summary":"George Clooney shared a surprising message for US president Donald Trump. Reflecting on his Democratic background, Clooney acknowledged the ups and downs of election results. Clooney had urged former president Joe Biden to step down for the 2024 election, endorsing Kamala Harris as his successor. He narratively supported Harris's campaign and emphasized democracy's value.","url":"https://economictimes.indiatimes.com/news/international/us/after-kicking-out-joe-biden-from-the-presidential-ticket-in-2024-george-clooney-now-has-a-surprising-message-for-donald-trump-heres-what-it-is/articleshow/118397094.cms","image":"https://img.etimg.com/thumb/msid-118396880,resizemode-4,width-1200,height-900,imgsize-1069791,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-19 20:00:28","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":-0.057},{"id":292274350,"title":"CBS News executive Adrienne Roark leaving embattled network","text":"CBS News president of editorial and newsgathering Adrienne Roark is leaving the embattled network to join local news juggernaut TEGNA, Fox News Digital has confirmed. Roark’s exit was announced internally to CBS News staffers on Wednesday, according to an employee in attendance. Roark will exit CBS News as the network deals with a looming merger and multiple controversies, including President Donald Trump’s $20 billion lawsuit against CBS and parent company Paramount Global over alleged election interference through deceptive editing of a \"60 Minutes\" interview with then-Vice President Kamala Harris one month before they faced off in the presidential election. CBS News executives refused to release an unedited transcript until after the election, when the Federal Communications Commission (FCC) got involved. TRUMP AMPS UP THE PRESSURE ON CBS WITH MASSIVE DISCOVERY DEMAND AS '60 MINUTES' LAWSUIT MOVES FORWARD Roark, who was promoted to the position last August, \"manages teams in the field and across all newsrooms, including correspondents, assignment desks, bureaus, booking teams, standards and practices, the Super Desk and CBS News Radio,\" according to the network. She also \"spearheads developing new newsgathering processes while managing all editorial aspects at CBS News.\" No replacement has been named. CBS News did not immediately respond to a request for comment. Roark has been named chief content officer at TEGNA. \"I’m thrilled to join TEGNA and look forward to working with the talented team to continue innovating and delivering high-quality, audience-driven stories for the tens of millions of community members who come to our platforms daily for their local news,\" Roark said in a statement. Last year, Roark was the subject of media industry chatter when she reprimanded CBS News host Tony Dokoupil over an interview with pro-Palestinian author Ta-Nehisi Coates. Dokoupil, who is Jewish, irked liberal colleagues by bluntly stating that Coates’s book, \"The Message,\" read like something you would find in \"the backpack of an extremist.\" He also pressed Coates on whether he believes Israel has the right to exist. The interview prompted backlash from some CBS News staff, who felt Dokoupil pressed Coates too strongly. CBS News ultimately forced Dokoupil to meet with the network’s in-house Race and Culture Unit following complaints. CBS PARENT COMPANY CEO SAYS NETWORK LEADERSHIP MADE 'MISTAKE' IN RESPONSE TO TONY DOKOUPIL'S INTERVIEW \"We will still ask tough questions. We will still hold people accountable… but we will do so objectively, which means checking our biases and opinions at the door,\" Roark said during an emotional meeting that was leaked to the Free Press. \"We are here to report news without fear or favor,\" Roark added. \"There are times we fail our audiences and each other. We’re in one of those times right now, and it’s been growing. And we’re at a tipping point.\" The head of CBS’ parent company, Paramount CEO Shari Redstone, sided with Dokoupil instead of Roark and other executives. \"I think Tony did a great job with that interview. I think he handled himself and showed the world and modeled what civil discourse is. He showed that there was accountability, that there is a system of checks and balances, and frankly, I was very proud of the work that he did,\" Redstone said during a panel in New York, according to The Washington Post. Redstone said CBS made a mistake in how it handled the aftermath. \"As hard as it was, frankly, for me to go against the company, because I love this company, and I believe in it, and I think we have a great, great executive team, I think they made a mistake here,\" Redstone said. GERMAN PROSECUTORS TELL '60 MINUTES' IT'S A CRIME TO INSULT PEOPLE ONLINE AS GOVERNMENT RAIDS OFFENDERS' HOMES Former CBS anchor Norah O’Donnell left \"CBS Evening News\" last month and the network has seen a ratings dip as it continues to tinker with the program in her absence. The network also faced backlash when \"60 Minutes\" aired a friendly interview this month with local German officials as the country's government initiates a nationwide crackdown on offensive speech. As for Trump’s lawsuit, Redstone is reportedly considering settling the suit ahead of a planned merger with Skydance Media in hopes of preventing potential retribution by Trump's FCC, which has the authority to halt the multibillion-dollar transaction. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital’s Joseph A. Wulfsohn and Hanna Panreck contributed to this report.","summary":"CBS News president of editorial and newsgathering Adrienne Roark is leaving the embattled network as it deals with a looming merger and multiple controversies.","url":"https://www.foxnews.com/media/cbs-news-executive-adrienne-roark-leaving-embattled-network","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/cbsscandals2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 20:00:07","author":"Brian Flood","authors":["Brian Flood"],"language":"en","source_country":"us","sentiment":-0.096},{"id":292280926,"title":"Trump ‘restrained’ towards West European leaders – Putin","text":"US President Donald Trump has shown remarkable restraint in dealing with EU leaders who spoke out against him during the course of the 2024 presidential election, Russian President Vladimir Putin told media on Wednesday.\n\nDuring the campaign last year, a number of EU officials spoke out in favor of Trump’s Democrat rival for the White House, Kamala Harris, although most stopped short of endorsing her outright.\n\nTrump, Putin noted, continues to be polite with his European allies, who were quite rude to him at the time.\n\n“I am surprised by the restraint of newly elected US President Trump towards his allies, who behaved, frankly speaking, in a boorish manner. He still behaves quite courteously towards them,” he said.\n\nLast October, Trump accused British Prime Minister Keir Starmer of election interference after UK Labour party helped recruit and deploy activists to help the Harris campaign in key swing states.\n\nIn August 2024, the Trump campaign accused the EU of interfering in the US presidential election after a senior bloc official warned Elon Musk against amplifying “potentially harmful content” ahead of his interview with Donald Trump.\n\n“All European leaders, all without exception, essentially directly interfered in the election process in the US. It came to direct insults towards one of the candidates,” according to Putin.","summary":"US President Donald Trump has not reacted to EU leaders who maligned him during the election, Russian President Vladimir Putin said \nRead Full Article at RT.com","url":"https://www.rt.com/russia/613033-putin-surprised-by-trumps-restraint/","image":"https://mf.b37mrtl.ru/files/2025.02/article/67b635282030271a44207b62.jpg","video":null,"publish_date":"2025-02-19 19:53:34","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":0.226},{"id":292291198,"title":"“Are We Still Friends?”: How Donald Trump Is Unraveling the Western Alliance","text":"But officials were left reckoning with a United States that appears to be disengaging from the continent—or perhaps, even worse, actively working against Europe in remaking the global order. Aleksandra Uznańska-Wiśniewska, a member of the Polish parliament, and head of its Polish-American group, spoke to me of “a sense that there are some seismic shifts of tectonic plates of the liberal world,” adding how “it actually felt like history is happening in front of our very eyes.”\nJust a year ago, then vice president Kamala Harris went to Munich to reassure allies of the United States’ commitments. At the time, House Republicans were blocking Ukraine aid and Trump had just said at a campaign rally that he’d let Russia “do whatever the hell they want” to NATO members who he believed weren’t spending enough on defense. “In these unsettled times, it is clear America cannot retreat,” Harris said.\nNo one expected similar pronouncements from the US at this year’s conference given the current administration’s perspectives and priorities. Trump had already demanded NATO allies pay more for their defense, threatened a trade war against the continent, and talked up his desire for a deal with Russian president Vladimir Putin to end the war in Ukraine. Following a 90-minute conversation last week with Putin, Trump said the two had agreed to swiftly end the war. The US administration had sent mixed messages on its Ukraine stance, but top European officials largely saw a Trump administration ready to make concessions to Russia before talks even began.\nLeaders descended on Munich seeking clarity about Ukraine, and hoped Vice President JD Vance might offer some in his much-anticipated address. Instead, Vance largely ignored Ukraine, and berated European governments for their free-speech policies, and suggested that German parties should end their firewall against working with the far-right Alternative for Deutschland.\nVance’s speech infuriated European leaders, especially those from Germany, with federal elections this weekend. Those who watched in person told me they noticed the absence of applause. On the big screen in the press center, cameras cut to leaders sitting stone-faced. In giving short shrift to NATO and Ukraine, as well as other topics that might come up at a European security conference ahead of the third anniversary of a war on the continent, Vance delivered a message that the US does not see Europe aligned with its ideological agenda anymore, and that may not be easy to overcome with defense-spending promises. “It was essentially rubbed in our face—the very idea that the sitting US administration lives in a different value set,” said Andreas Goldthau, public policy expert at the University of Erfurt, who attended the conference.\nAfter Vance’s speech, “wake-up call” became the overused phrase, even as many conceded that it had not been the first. “We know there have been several wake-up calls,” said Natalia Pouzyreff, the secretary of the defense committee in France’s National Assembly, of Trump’s defense demands and differing priorities. But officials were still shocked: first, by the Putin call, and then, by the time they’d adapted to that, the “new shock” from Vance.\nBefore Vance spoke, officials mustered some buttoned-up criticisms of Washington—it’s a “new reality” or whatnot. Now, diplomats bargained in real time, shocked and smarting at the hypocrisy of it all. “It’s a bit rich to give us a lecture on freedom of speech,” said Martin Weiss, a former Austrian ambassador to the US, noting, as a few others did, that Russia might have warranted a shout out. “If you talk about freedom of speech in Russia, you fall out of a window. If you talk about freedom of speech in the United States, you work for AP,” Weiss said, in reference to the Trump administration punishing the Associated Press for not referring to the Gulf of Mexico as the Gulf of America.\nAt the conference, European leaders committed to the continent’s defense, and recommitted to Ukraine. Ukrainian president Volodymyr Zelenskyy called for a European army, and Ukrainian politicians I spoke to also said that now was the time for Europe to step up. But a disconnect still prevailed, talk of a new world order forming amid the typical hobnobbing and regularly scheduled panel discussions. At least one European official I spoke to said they felt better about where the US stood after reassurances from American colleagues, offered both in private and in public, though the question is whether Americans were in a position to realistically offer those. “The American Senate is firmly in NATO’s camp,” Republican senator Lindsey Graham said during the conference.\nBut before the weekend was up, General Keith Kellogg, Trump’s special envoy to Ukraine and Russia, told the audience that Ukraine would be at the negotiating table, but Europe would not be, and French president Emmanuel Macron summoned European leaders to Paris for an emergency meeting on Ukraine.\nYet few are willing to say outright that America is no longer a friend, because this really is a marriage, strained and difficult at times, but a nearly 80-year-long one. There will be no clean breaks—for Europe, or the United States. But for Europe it is more urgent, because there isn’t yet a backup plan and no one knows how much time is left to act on one. Aura Salla, a Finnish politician in the European Parliament, told me that the world order is changing, but too fast for Europe to have the capabilities or capacity to go it alone on Ukraine. “Meanwhile, sorry—we need the US.”\nAfter European leaders met in Paris, the United Kingdom proposed leading a European peacekeeping force in Ukraine. But other European countries soon balked, and all concluded it could not work without the United States as the security guarantor. Europe reiterated its demands for a place at the negotiating table. But the US and its Russian counterparts met in Saudi Arabia this week, without them.\nEven in these early days of talks, any progress looks impossibly bleak for Ukraine and Europe. Both the US and Russia have signaled that Moscow’s international isolation may end. Secretary of State Marco Rubio—who not so long ago called Putin a “war criminal” and introduced legislation that would prevent the US government from recognizing Ukranian territory annexed by Russia—told reporters Tuesday of “the incredible opportunities that exist to partner with the Russians” when the war concludes, though he did not expand on what those might be. In Washington, Trump is blaming Ukraine for initiating the war and calling Zelenskyy a dictator in a Truth Social post. “Zelenskyy better move fast or he is not going to have a Country left,\" Trump warned.\nThe scenario many Europeans feared most at Munich is unfolding at a startling velocity. Europe is left with another Macron-led meeting, this time with more European leaders and Canada too. Europe is seeking a way to convince the United States to stay committed to Ukraine and this transatlantic partnership, even as it now urgently grasps for a hedge against Washington.\n“We’re not going to go gently into the good night,” Uznańska-Wiśniewska, the Polish parliamentarian, said after the close of the conference. “We have to really try to fight against the dying of the light.”","summary":"A gathering of diplomats in Europe only heightened fears that the United States is abandoning NATO and siding with Russia over Ukraine—which Trump cemented in his latest attacks on “dictator” Zelenskyy. It feels, says one Polish lawmaker, “like history is happening in front of our very eyes.”","url":"https://www.vanityfair.com/news/story/donald-trump-nato-ukraine","image":"https://media.vanityfair.com/photos/67b4edcc5fe7ad691c4e458a/16:9/w_2000,h_1125,c_limit/JD-Vance-Munich-Security-Conference.jpg","video":null,"publish_date":"2025-02-19 19:26:26","author":"Jen Kirby","authors":["Jen Kirby"],"language":"en","category":"politics","source_country":"US","sentiment":-0.184},{"id":292276522,"title":"Lifelong Democrat George Clooney issues surprising message to Donald Trump","text":"George Clooney has directed a genuine message of hope to Donald Trump, wishing him well over the next few years of his second-term presidency.\n\nThe two-time Oscar winner and lifelong Democrat issued the surprising remark during his Tuesday appearance on The Late Show with Stephen Colbert.\n\n“I was raised a Democrat in Kentucky,” Clooney, 63, told Colbert and the studio audience. “So I’ve had a lot of fun in my life, as you can imagine.”\n\nHe continued: “And you know, I’ve lost a lot of elections. The first time I voted, it was 1980, so I was a Carter guy and Reagan won. And then I lost to some Bushes. And I won with some Clintons and Obamas.\n\n“You know, this is Democracy. And this is how it works,” he conceded.\n\nColbert interjected to joke: “How did it go this time for you? I forgot who you were supporting.”\n\nClooney, who supported Kamala Harris in the 2024 election after urging Joe Biden to exit the race, quipped: “Well, I don't know, what am I supposed to do? Storm the f***ing Capitol?\n\n“It didn’t work out. That’s what happens,” the Oceans Twelve actor said, shrugging. “It’s part of democracy. And there are people who agree and people who disagree and most of us still like each other. And we’ll get through it.”\n\nClooney went on to use his seven-year-old son Alexander’s love of chess as an example of how to lose graciously.\n\n“He plays a lot of older kids. And he’s not winning all the time, as you can imagine. And he gets upset, and I say, ‘Listen, you shake the guy’s hand and you say good game I’ll get you next time,’” the ER alum said, adding that “you’ve gotta live by those rules.”\n\nIndirectly speaking to Trump, Clooney said: “Alright, okay. Good for you. I hope you do well because our country needs it, and we will meet you in 3.5 years and see where we go next.”\n\nColbert immediately knocked on his desk to signify his hopes that “there will be another [election].” \n\n“Let’s not get out over our skis, George,” he teased. “You know you play by the rules, but both sides have to believe there should be rules.”\n\nTrump has repeatedly joked about serving a constitutionally-barred third term as president, leading to concerns that Republicans would push to change the Constitution in his favor.","summary":"Hollywood A-lister, who was raised a Democrat, supported Kamala Harris after urging Joe Biden to drop out of the race","url":"https://www.independent.co.uk/arts-entertainment/tv/news/george-clooney-trump-biden-stephen-colbert-b2701022.html","image":"https://static.independent.co.uk/2025/02/19/18/11/George-Clooney-and-Donald-Trump.png?trim=0,7,0,7&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/o7Kuxqp3-OhrQWqOm.mp4","publish_date":"2025-02-19 19:21:13","author":"Inga Parkel","authors":["Inga Parkel"],"language":"en","category":"politics","source_country":"gb","sentiment":0.152},{"id":292274348,"title":"FLASHBACK: Trump seeks to expand fertility coverage, after Tim Walz once accused him of being ‘anti-IVF’","text":"President Donald Trump signed an executive order Tuesday requesting the Domestic Policy Council examine ways to make in vitro fertilization, known as IVF, more affordable and accessible for Americans – despite the fact Democrats cautioned that Trump would seek to ban the procedure. \"Americans need reliable access to IVF and more affordable treatment options, as the cost per cycle can range from $12,000 to $25,000,\" the executive order said. \"Providing support, awareness, and access to affordable fertility treatments can help these families navigate their path to parenthood with hope and confidence.\" Specifically, the order requires the assistant to the president for domestic policy to provide a list of policy recommendations aimed at \"protecting IVF access and aggressively reducing out-of-pocket and health plan costs for IVF treatment\" within 90 days, according to the order. ‘PROMISES KEPT’: TRUMP SIGNS EXECUTIVE ORDER TO ‘AGGRESSIVELY’ MAKE IVF MORE AFFORDABLE AND ACCESSIBLE The directive comes months after former Vice President Kamala Harris’ running mate in the 2024 election against Trump, Minnesota Gov. Tim Walz, accused the Trump administration of being \"anti-IVF.\" Specifically, Walz singled out Trump’s running mate, then-Sen. JD Vance, a practicing Catholic who voted in June against the Right to IVF Act. The Catholic Church opposes IVF, saying unused embryos pose a moral dilemma. But Vance said in August 2024 he doesn't believe all his religious views should translate to public policy since the U.S. is a \"democratic society,\" he told the New York Post. \"Catholic social teaching is obviously very robust,\" he told the Post. \"I think that no person who, or at least no one I know who’s Catholic, doesn’t accept that just because the Catholic Church teaches something, doesn’t mean you necessarily as a legislator need to affect that to public policy.\" The Right to IVF measure would establish a nationwide right to IVF and other assisted reproductive technology, but it failed to pass in the Senate. CLICK HERE TO GET THE FOX NEWS APP \"JD Vance opposing the miracle of IVF is a direct attack on my family and so many others,\" Walz said in a social media post on X in July 2024. Walz previously claimed that he and his wife, Gwen, struggled to conceive and shared details during the 2024 campaign about the couple’s experience using IVF to become pregnant with their two children. But Gwen Walz later clarified in August 2024 in an interview with Glamour magazine that the couple actually used intrauterine insemination, known as IUI, to conceive. The process involves using a catheter to place the sperm directly into the uterus to increase odds of conception. DOGE SCORES BIG COURT WIN, ALLOWED ACCESS DATA ON 3 FEDERAL AGENCIES In contrast, IVF requires the removal of a woman’s eggs and injecting them with sperm to create embryos, which then are placed back into the woman’s uterus. More than 85,000 babies born in 2021 were from IVF, according to the Department of Health and Human Services. Costly IVF treatments are rarely fully covered by health insurance, and only 25% of employers report providing coverage to their employees, according to the White House. Trump unveiled plans in August 2024 that he’d seek to require insurance companies to cover the cost of IVF, stating he was pushing the policy \"because we want more babies, to put it nicely.\" The Associated Press contributed to this report.","summary":"Minnesota Gov. Tim Walz accused Trump of being &quot;anti-IVF&quot; on the 2024 campaign trail, after Trump&apos;s running mate JD Vance voted against the Right to IVF Act.","url":"https://www.foxnews.com/politics/flashback-trump-seeks-expand-ivf-coverage-after-tim-walz-accused-trump-being-anti-ivf","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/walz-trump-georgia.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 19:07:09","author":"Diana Stancy","authors":["Diana Stancy"],"language":"en","category":"politics","source_country":"us","sentiment":0.018},{"id":292272706,"title":"Newsom proposes $125-million mortgage relief package to help fire, other disaster victims","text":"Gov. Gavin Newsom on Wednesday proposed a multimillion-dollar mortgage relief package for victims of recent natural disasters, including the fires that swept through Los Angeles County last month. Under the plan, which must be approved by a state board, more than $100 million would be available in direct relief for people at risk of foreclosure. Another $25 million would help fund mortgage counseling and help people navigate disaster assistance. The relief package would be funded by a mortgage settlement reached by then-California Atty. Gen. Kamala Harris with big lenders in the wake of the Great Recession, and not from the state budget, according to Newsom's office. The California Housing Finance Agency oversees those funds and its board is scheduled to debate the proposal Thursday. Such money could be critical for many in L.A. County. Last month's fires destroyed or seriously damaged more than 12,000 homes, but didn't wipe away the obligation homeowners have to pay their mortgages. As a result, many people are on the hook for not just a mortgage on a destroyed home, but also rent for temporary housing. Insurance payments can help cover such costs, but there's concern payouts won't be enough, particularly for people who were underinsured. Mortgage relief wouldn't be limited to just the Los Angeles fires. To qualify, homeowners would have to have their property destroyed or substantially damaged by a declared emergency since Jan. 1, 2023. “As survivors heal from the trauma of recent disasters, the threat of foreclosure should be the last thing on their minds,\" Newsom said in a statement. \"This disaster mortgage relief program would help lift this burden and give families more time to focus on recovery.” In the meantime, some temporary help is available. Newsom previously announced agreements with several big banks and hundreds of state-chartered lenders to provide a streamlined process for fire victims to receive a 90-day pause on their mortgage payments. A bill submitted in the state Legislature would also enable people with a fire-related financial hardship to delay up to a year's worth of mortgage payments.","summary":"Gov.Newsom proposed a $125-million mortgage relief fund for the victims of recent natural disasters, including the fires that devastated L.A. County last month.","url":"https://www.latimes.com/california/story/2025-02-19/governor-mortgage-announcement","image":"https://ca-times.brightspotcdn.com/dims4/default/c5658cb/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F56%2Fdb%2Fb6298848461da7afa38d1b0c6f6d%2F1490370-la-me-gavin-","video":null,"publish_date":"2025-02-19 19:06:10","author":"Andrew Khouri","authors":["Andrew Khouri"],"language":"en","category":"politics","source_country":"us","sentiment":-0.353},{"id":292264466,"title":"NBA All-Star Game Ratings Tank, Second-Lowest On Record","text":"The NBA All-Star Game on Sunday averaged just 4.7 million viewers, a 13 percent decline from last season. This year's event was the second-least-watched All-Star Game on record dating back to 1990. Only the 2023 All-Star Game drew fewer viewers, with an average of 4.6 million. The NBA has spent much of the past five seasons tinkering with the All-Star format, but the results remained the same: a bunch of entitled millionaires end up making a mockery of the game by showing minimal effort and interest. The cobalt blue court was nice, but nonetheless, not a solution. No, ESPN, turning the event into a celebration of black history is not the answer. Yes, the network actually suggested that this week. To show how far the All-Star Game has fallen in terms of interest, the event drew 17.45 million viewers 20 years ago--when players took the game seriously and respected their fans. Still, the NBA's ills run much deeper than just the fall of its exhibition All-Star Game. The biggest stars in sports hardly take the regular season seriously, choosing to sit out games due to \"load management\" and \"knee soreness.\" Moreover, the NBA Finals have set record lows in four out of the last five seasons. Sure, the NBA recently signed an 11-year, $76 billion rights agreement with Amazon, Disney, and Comcast. But the product is clearly in decline and, at some point, the league will face the consequences of that. The recommendation here is that the league lean into its foreign superstars more and the previous era of American stars less. The American-born stars have become increasingly political, toxic, and unlikable. They make more headlines for demanding trades and endorsing Kamala Harris than for their play on the court. The opposite is true of international stars like Nikola Jokic, Giannis Antetokounmpo, Shai Gilgeous-Alexander, Luka Doncic, and Victor Wembanyama. These players take no games off, never bail on their franchises, and focus far more on winning basketball games than growing their brands on social media. Notably, no two players took All-Star Weekend more seriously than Gilgeous-Alexander and Wembanyama. \"Just 4.7 million people watched the NBA All Star Game on Sunday. That’s down over 80% from viewership in the past and down 13% over last year. LeBron and Adam Silver have destroyed the NBA’s brand,\" Clay Travis posted on X Wednesday. \"The NBA destroyed its brand by listening to woke sportswriters online. I’ve got a better idea: they should try to appeal to every single basketball fan in America by putting out a great product and respecting their fans.\" The LeBron-BLM era of the NBA didn't put out a great product or respect its fans. As a result, viewers lost interest at a record rate.","summary":"NBA All-Star Game datings: Second-lowest on record.","url":"https://www.outkick.com/sports/nba-all-star-game-ratings-tank-second-lowest-record","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/02/gettyimages-2199463230.jpg","video":null,"publish_date":"2025-02-19 19:05:30","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","source_country":"us","sentiment":-0.055},{"id":292274822,"title":"The Palantir Guide to Saving America’s Soul","text":"In those days, Silicon Valley was perceived as an apolitical place. People in the industry were associated with a naïve techno-utopianism—the belief that problems of governance might be properly demystified as problems of engineering. They might have made libertarian or even anarcho-capitalist noises from time to time, but their underlying commitments were more or less progressive. Peter Thiel espoused the view that freedom and democracy were incompatible, and he likened the most capable founders to dictators, but these ideas seemed idiosyncratic and vain rather than dangerous. The Google engineer’s petition in favor of a Valley-backed coup was taken as a spoof. It wasn’t. A “neoreactionary” vanguard had arisen in the Bay Area. Its objective was not to retreat from the citadels of governance but to place them under siege. The Google engineer had been influenced by an obscure programmer-monarchist named Curtis Yarvin, a.k.a. Mencius Moldbug. America, Yarvin declared, suffered from “chronic kinglessness.” Silicon Valley, where the best companies were run by executive fiat, knew how to make the trains run on time.\nToday Yarvin, whom J. D. Vance has cited as an influence, is practically a household name. Yarvin, in his modesty, only ever called for one king. Now we appear to have two. Donald Trump and Elon Musk seem to share the aim of personal enrichment. Their avowed priorities do not otherwise cohere, at least at first glance. Trump is a nationalist who looks to the past and promises its restoration. He would like to take Greenland. Musk is a free marketeer who looks to the future and promises its realization. He would like to take Mars. Liberals might take solace in their partnership’s apparent fundamental instability. This may be a coping mechanism.\n“The Technological Republic: Hard Power, Soft Belief, and the Future of the West,” a new book by Alexander C. Karp, the C.E.O. of the software company Palantir Technologies, and his aide-de-camp Nicholas W. Zamiska, demonstrates how these attitudes might profitably fit together. Although Karp dislikes Trump, he appeals to a more muscular America. And, although he admires Musk, he would prefer that the government remain intact. The book’s central claim is that the survival of the American experiment depends on the technological revitalization of the military-industrial complex. National pride ought to provide Silicon Valley with a sense of purpose. Silicon Valley’s talents might in turn mend our sense of national competence. From our desire to take Greenland might flow our ability to take Mars.\nPalantir, which was named for the “seeing stones” in “The Lord of the Rings,” had twin inspirations. One was the dot-com collapse, which flattened the bubbly frivolity of early e-commerce. The other was September 11th. Thiel believed that a maturing tech industry needed to put away its eToys.com and devote itself to the serious business of national defense. Palantir’s data-integration platform pledged to discern obscure patterns that might otherwise elude human analysts. The company’s overarching ambition, Karp has said, was “to support the West”—in the local dialect, they were “saving the Shire” from the eye of Sauron. The Thiel-Karp team guaranteed a reasonable calibration of “total information awareness” and the protection of civil liberties. They were criticized from both flanks. Civil libertarians inevitably likened their products to the glittering touch screens in the predictive-policing dystopia of “Minority Report.” Other skeptics accused them of peddling vaporware. Selling infrastructure to the panopticon was not a safe play, and investors were skittish. Employees considered their public reputation unfair and inaccurate, but their communications team recognized that a sinister aura was great marketing. A small raft of contracts, along with support from the C.I.A.’s venture arm, kept them afloat until the world readied itself for their relevance. Today their market capitalization is two hundred and eighty billion dollars.\n“The Technological Republic” is equal parts company lore, jeremiad, and homily. It begins with a bracing precis of the cultural, political, and technological posture of “the West,” a concept that has been lamentably “discarded by many, almost casually.” Our government “has retreated from the pursuit of the kind of large-scale breakthroughs that gave rise to the atomic bomb and the internet.” Silicon Valley has “turned inward, focusing its energy on narrow consumer products,” and abdicating its more profound responsibilities. Only with jointly redoubled efforts will we construct “the technology and artificial intelligence capabilities that will address the most pressing challenges that we collectively face.” Chief among these challenges are the threats posed by an A.I.-enhanced posse of China, Russia, and Iran. The real enemy, however, is already in the house. Our society is rudderless and soft. The book’s diagnosis recalls the “post-liberalism” common to many thinkers on the new right: “The vital yet messy questions of what constitutes a good life, which collective endeavors society should pursue, and what a shared and national identity can make possible have been set aside as the anachronisms of another age.”\nThe book, too, is an anachronism of another age—an age called “last October”—and its vision of a mutually supportive relationship between Washington and Silicon Valley has in the interim been rendered almost quaint. Karp supported the campaigns of Joe Biden and Kamala Harris, and “The Technological Republic” was manifestly intended as an intervention in the status-quo context of a Democratic victory. The book imagines a more active government, not no government at all. Karp’s political aim reflects an attempt to resuscitate what is now frequently disparaged as Cold War liberalism, or the belief that we fought for freedom and comfort on two fronts—that the struggle for equality at home was tied to the struggle against Communism abroad. The atomic program, which was a win-win contribution to both overseas deterrence and domestic progress, is Karp’s model for how we might approach the dual-use technologies of artificial intelligence. The A.I. arms race, like its nuclear precursor, is poised to reshape the global order, and we cede first-mover advantage to China at our peril.\nThe question is how this happened. Many of Karp’s colleagues blame the government for regulating away their ability to do interesting things. Karp has little patience for Washington bureaucracy, but the primary target of “The Technological Republic” is not a nation that has failed Silicon Valley. It is more cogent and original as a story about how Silicon Valley has failed the nation. The employees are spoiled and the investors are cowards. The tech barons are mere clerks and shopkeepers in disguise. Engineers and executives have lost their taste for rockets and spy planes. In the spring of 2018, Google employees protested against the company’s participation in Project Maven, a Department of Defense initiative to better analyze reconnaissance imagery. Their misgivings, Karp and Zamiska write, did not reflect “a principled commitment to pacifism or non-violence,” but “a more fundamental abandonment of belief in anything” other than their own bourgeois comfort. Palantir stepped into the breach and picked up that contract. The company has not only accepted their grave obligations to national defense; it has fought for the right to serve the country. The Defense Department’s byzantine procurement policies had ruled out the use of Palantir’s commercially available software. In 2016, Palantir sued the government and won. Two years later, it was awarded an enormous Army contract.\nUnder a Harris Administration, “The Technological Republic” might have been brushed aside as merely Karp’s attempt to talk his own book—which, for the most part, it is. Harris, in her D.N.C. speech, promised that America would have the “strongest, most lethal fighting force,” and presumably Palantir would have continued to thrive as one of Silicon Valley’s few defense contractors. Harris’s loss, as it turns out, was Karp’s gain. This is true in a banal financial way: compared with its average price during the Biden Administration, Palantir’s stock has appreciated nearly six hundred per cent. It is more interestingly true on the plane of ideas.\nMusk’s response to a coddled rank and file has been a purge. When he took over Twitter, he sent a company-wide e-mail that presented a “fork in the road,” as he put it: serve at his pleasure or find another job. The point was not to improve Twitter’s performance. It was to remind his employees of their fungibility. One of his first acts under the auspices of Trump’s Department of Government Efficiency was a government-wide e-mail with a buyout offer. The subject line, lest there be any doubt as to its authorship, was “Fork in the Road.” Karp has a different attitude. Silicon Valley is not proof of concept for monarchy. It is proof of concept for war.\nThis inspired the invention of actual objects, such as bombs, but it also inspired the invention of new processes—the languages of control theory and cybernetics—that in turn became novel experiments in social organization. Scientists and engineers arranged themselves in nested feedback loops; they were quick to criticize, and even quicker to forgive. They weren’t Randian jerks who believed in domination. They believed in the kind of grace that comes from a shared conviction in the civic purpose of their work. The campuses that came to life between San Francisco and San Jose were “a form of modern-day artistic colony, or technological commune,” Karp and Zamiska write, and these campuses recruited “a generation of talent that wanted to do something other than tinker with financial markets or consult.”\nThe book’s account of tech culture’s origins is rosy and coarse—the ChatGPT version of Fred Turner’s classic “From Counterculture to Cyberculture”—but it’s a useful corrective to the fantasy that Musk sprung fully formed from the head of Zeus. The notion that these companies were sovereign enclaves of pitilessly despotic geniuses is a myth of recent vintage. Even more belated is the idea that Musk might summon an army of coder-ephebes and rescue us from an inertial government. Going around and breaking things, the authors of “The Technological Republic” think, is not going to breathe new life into our collective endeavors. The government must instead be strong enough to identify what it needs, make an unapologetic case for why, and then provide aspiring venders with a normal demand signal—not four thousand pages of arcane pre-specifications. In the absence of organized government demand, companies will turn to the consumer market instead. And the consumer market should not be the arbiter of value. “The grandiose rallying cry of a generation of founders in Silicon Valley was simply to build,” Karp and Zamiska write. “Few asked what needed to be built, and why.” The tech industry must meet the government halfway by reassessing its own priorities. The national interest is a noble pursuit. Games for your phone are not.\nThe book is good as a diagnosis of this phenomenon—the tendency to churn out “derivative and retrograde” products under the guise of innovation. It is even better as an exemplification of it. It reads like an automated Spotify playlist of the greatest hits of national decline. Even its chapter titles (“The Hollowing Out of the American Mind”) have the optimized ring of a recommendation engine: If you liked Allan Bloom and Jonathan Haidt, you’ll like this. The “soul of the country” has been “abandoned in the name of inclusivity,” and “unironic belief in something greater—in many corporate boardrooms and certainly the halls of our most selective colleges and universities—is looked down upon as essentially preindustrial and retrograde.” Karp goes out of his way to identify as a liberal, but the only liberal mentioned in “The Technological Republic” is the communitarian philosopher Michael Sandel. The book’s touchstones are instead an algorithmic procession of disgruntled conservatives: Roger Scruton, Roger Kimball, Irving Kristol, Leo Strauss, Niall Ferguson, and Peggy Noonan.\nThe repackaging of old grievances feels like a missed opportunity. There is a growing bipartisan consensus that American innovation has lost the plot. To blame a lack of ambition, or a culture of decline, is merely to re-state the problem. To attribute the corrosion of institutional trust to such bugbears as relativism or postmodernism is to ignore explanations that are both more concrete and more parsimonious. The military-industrial complex did not lose its lustre because Americans were taught that all cultures are equally valid, or because sincerity as such went out of style. The military-industrial complex lost its lustre when it embarked on a series of pointless and destructive wars. Our institutions were damaged by things that we did. They cannot be repaired with an appeal to remember who we are.\nKarp seems to be operating under the impression that what Americans need is permission to feel patriotic again. His doctoral dissertation—“Aggression in the Life-World: The Expansion of the Parsonian Concept of Aggression Through the Description of the Connection Between Jargon, Aggression, and Culture”—culminates in an interpretation of the German writer Martin Walser’s acceptance speech upon receipt of the Peace Prize of the German Book Trade in 1998. Walser notoriously described Auschwitz as a “moral cudgel” used to enforce a sense of perennial shame. His claims to victimhood, Karp pointed out, were empirically untrue but extraordinarily effective. His lecture recognized and channelled his audience’s feelings of unconscious aggression and resentment. Germans just wanted to feel proud again, and Walser gave them a warrant to do so.\n“The Technological Republic” also invokes this episode, but with Walser now as soothsayer. Germany’s perpetual inability to slough off the sins of its past and simply get on with it, the book stipulates, has had serious repercussions: “An intense skepticism of German identity, of allowing any sense of the nation to take hold in the wreckage of the war, has had significant costs and deprived the continent of a credible deterrent to Russian aggression.”\nKarp identifies his faith in our engineering prowess with the American tradition of pragmatism; in the span of only three pages, “The Technological Republic” calls for a “voracious pragmatism,” a “ruthless pragmatism,” and a “ravenous pragmatism.” The pragmatist tradition does, in fact, have a lot to say about the relationships between loyalty, prosperity, and bloodshed. In 1910, William James, one of the founders of our national philosophy, wrote an essay titled “The Moral Equivalent of War.” Combat, he acknowledged, had long been recognized as “the gory nurse that trained societies to cohesiveness.” It was “a sort of sacrament.” The sacrifices of war were the Nietzschean wages of heroism: “Its ‘horrors’ are a cheap price to pay for rescue from the only alternative supposed, of a world of clerks and teachers, of co-education and zo-ophily, of ‘consumer’s leagues’ and ‘associated charities,’ of industrialism unlimited, and feminism unabashed. No scorn, no hardness, no valor any more!”\nA hearty society, James agreed, could not get along without the martial virtues of discipline, focus, interdependence, and “intrepidity.” Actual war might have been a sufficient condition for the cultivation of these values, but it was not a necessary one. James proposed that the nation’s youths pay their “blood-tax” in the form of a national-service program that would redound to our universal benefit. Rich and poor kids alike would put on hardhats and erect skyscrapers or build dams. The national community could be knit together without indulging the chauvinism of belligerence. This did not immunize his fellow-pragmatists from the seductions of a fight. Only a few years later, John Dewey came out in support of American intervention against Prussian militarism, imagining that, in a two-birds-one-stone way, the war effort could also promote social reform. His former student Randolph Bourne accused him of capitulation to the cheap thrills of nationalist fervor, to the premise that “war is the health of the state.” Karp approvingly quotes a line of Dewey’s from 1922: one must “get down from noble aloofness into the muddy stream of concrete things.”\nYet Dewey, by then, already regretted his enthusiasm for a war that brought only mass suffering and death abroad and the suppression of civil liberties at home. He had belatedly learned Bourne’s lesson about the temptation to kill two birds with one stone: it unleashes forces that do not submit to pragmatic control. Karp maintains his confidence in war as the great dual-use technology, and the book relies on circular logic: national security is supposed to inspire national pride, but national pride is apparently the precondition for national security.\nThe pragmatic strain of “The Technological Republic” raises the genuinely strategic matter of how we might prepare for a battlefield suffused with advanced artificial intelligence: “The broader question we face is not whether a new generation of increasingly autonomous weapons incorporating artificial intelligence will be built. It is who will build them and for what purpose.” This seems like something to be taken seriously, and perhaps Palantir is planning in earnest. The other strain of the book abandons strategic pragmatism in favor of metaphysical grandeur: “The generation that is most capable and best positioned to construct this next wave of offensive capabilities is also the most content to retreat from projects involving national defense or communal purpose.” This task—which involves defining the national purpose—would also seem to be something to be taken seriously, but it’s probably not one we should entrust to Palantir. ♦","summary":"Alexander Karp, Palantir’s philosopher-C.E.O., thinks that a restored military-industrial complex can make our country great again.","url":"https://www.newyorker.com/books/under-review/the-palantir-guide-to-saving-americas-soul","image":"https://media.newyorker.com/photos/67afa0741b890927376af35b/16:9/w_2560,h_1440,c_limit/war_chip_sketch3.jpg","video":null,"publish_date":"2025-02-19 18:39:55","author":"Gideon Lewis-Kraus","authors":["Gideon Lewis-Kraus"],"language":"en","category":"politics","source_country":"us","sentiment":0.044},{"id":292291192,"title":"Donald Trump’s Government Is One Where Congress Isn’t Needed","text":"According to the executive order, this would “rein in” the agencies and “restore a government that answers to the American people.” But what it actually does is create a federal government that is increasingly answerable chiefly to Trump.\nIndeed, the president has moved quickly to consolidate power since returning to office last month, defying the separation of powers at the core of the American system and dismantling the federal government through Elon Musk, who, in a joint Tuesday interview with Trump on Sean Hannity’s Fox News program, essentially framed himself as the president’s enforcer. “What we’re doing here, one of the biggest functions of the [Department of Government Efficiency] team, is just making sure that presidential executive orders are actually carried out,” Musk told the fawning Fox host.\n“If the bureaucracy is fighting the will of the people and preventing the president…from implementing what the people want,” Musk continued, “then what we live in is a bureaucracy and not a democracy.”\nIt’s a slippery rhetorical trick from the DOGE leader: If the people elect the president, then anything that prevents him from doing whatever he wants is an ipso facto violation of the people’s will. But “the people” is a broad group that includes the 48.3 percent of voters who cast ballots for Kamala Harris, the millions who stayed home because they didn’t like either candidate, and more still who voted for Trump but not for his every single policy, prerogative, or political objective, and who perhaps bristle at the idea of, say, a 24-year-old Andrew Tate fan swaggering into IRS headquarters to access their personal financial information and Social Security numbers.\nMusk and Trump’s idea of “efficient” government isn’t a democracy excised of waste; it’s a dictatorship in which the whims of a single executive are cast as the public’s aspirations. And whatever he says goes. “He who saves his Country does not violate any Law,” Trump wrote on social media over the weekend, invoking a sentiment attributed to the French emperor Napoleon.\nIt’s a dangerously expansive vision of executive power—one that Russ Vought, the Project 2025 architect, Christian nationalist, and new Office of Management and Budget director, wants to realize. Under Trump’s new executive order, the once-independent agencies coming under White House purview would be overseen by Vought, a leading proponent of the “unitary” executive theory, a once-fringe legal framework that regards the president as having sole authority of the executive branch.\nIn the Trump budget chief’s argument, bureaucratic agencies have amassed excessive power at the expense of the presidency, injuring the government’s “responsiveness to the American people.” And the system must be righted by what Vought has described as “radical constitutionalism.”\nWill the courts agree? And will Trump honor their decisions if they don’t? He has already openly thumbed his nose at rulings, with his vice president, JD Vance, going as far as suggesting the judicial branch is not “allowed” to check the chief executive’s power. And the Republican-controlled Congress has either looked the other way or cheered him on. “The courts should take a step back,” House Speaker Mike Johnson told reporters last week. “What we’re doing is good and right for the American people.”\nJohnson and his fellow Capitol Hill Republicans, of course, have given up on the separation of powers and ceded much of their authority to Trump—a reflection, as Ezra Klein recently observed, of both their devotion to their leader and the limits of their legislative capacity, mostly thanks to their slim majorities and internal divisions. Why suffer through the messy ordeal of drafting and passing bills—as they’re trying to do now ahead of a March 14 government funding deadline—when Trump can just issue orders and have his plutocrats enforce them?\nThe result of all this has been to give the presidency extraordinary powers. Trump now seems increasingly unaccountable to the courts, the Congress, and certainly to the people. He’s become a demagogic president pushing the limits further and further, daring somebody, anybody in official Washington to check him.","summary":"A Republican-controlled legislature continues to cede power to the president. Why bother legislating your agenda when you can have a demagogue issue orders?","url":"https://www.vanityfair.com/news/story/donald-trump-elon-musk-government-where-congress-isnt-needed","image":"https://media.vanityfair.com/photos/67b617b52ca0e8cb6f41953b/16:9/w_5664,h_3186,c_limit/2199787693","video":null,"publish_date":"2025-02-19 18:31:39","author":"Eric Lutz","authors":["Eric Lutz"],"language":"en","category":"politics","source_country":"US","sentiment":-0.082},{"id":292242712,"title":"Angela Bassett Reflects on Playing a Black Woman President in “Zero Day”: 'I Can’t Believe How Timely It Was' (Exclusive)","text":"Angela Bassett is madame president. \n\n The actress, 66, spoke with PEOPLE about playing a Black female president in the upcoming Netflix political thriller Zero Day at the show’s premiere event on Tuesday, Feb. 18 at The Plaza Hotel in New York City.\n\n \"It's something that we were so close to actually achieving in reality,\" Bassett said in reference to former Vice President Kamala Harris' presidential campaign last year. \"I can't believe how timely it was and that these moments have dovetailed in the way that they have.\"\n\n \"So it was very humbling and very grateful to offer my fictional president,\" she continued. \"But even the representation of it, as a woman, as a Black woman, I think, will have an impact that perhaps we'll see, if not today, if not tomorrow, maybe in a few years.\"\n\n Bassett shared her hopes for future leadership in the United States, saying, \"You never know. Some brilliant woman is coming.\"\n\n Zero Day is a limited series starring Robert De Niro as former U.S. President George Mullen. He leaves retirement to head the Zero Day Commission, dedicated to finding the perpetrators of a dangerous cyberattack that has spread across the country. Bassett joins the cast as Evelyn Mitchell, the steadfast current president who entrusts Mullen with his assignment.\n\n \"As disinformation runs rampant and the personal ambition of power brokers in technology, Wall Street, and government collide, Mullen’s unwavering search for the truth forces him to confront his own dark secrets while risking all he holds dear,\" the synopsis teases. \n\n The cast also stars Jesse Plemons, Lizzy Caplan, Connie Britton, Joan Allen and Matthew Modine. Eric Newman, Noah Oppenheim and Michael S. Schmidt co-created the show and executive produced alongside De Niro and director Lesli Linka Glatter.\n\n Bassett has long been a veteran of the big and small screen, having had her breakthrough as Tina Turner in 1993’s What’s Love Got to Do with It. She went on to star in How Stella Got Her Groove Back and Marvel’s Black Panther, Avengers: Endgame and Black Panther: Wakanda Forever. On television, she has notably worked with Ryan Murphy in multiple seasons of American Horror Story and on the fan-favorite procedural drama 9-1-1. \n\n In 2024, Bassett accepted an honorary Oscar award.\n\n Speaking to PEOPLE that year for the Women Changing the World issue, the actress said, \"I've always been a hard worker. You have to know what to say no to as well as what to say yes to. And during this time, a lot of things have been worthy of me saying yes to.\"\n\n Zero Day premieres on Feb. 20 on Netflix.","summary":"\"It's something that we were so close to actually achieving in reality,\" the actress said","url":"https://people.com/angela-bassett-reflects-on-playing-a-black-woman-president-in-zero-day-exclusive-11682362","image":"https://people.com/thmb/x0gMHzjgjA-UMdqajVW20WhsXR4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x312:736x314)/angela-bassett-021925-8b6fe7da1b734ca0bab5791df8c997ee.jpg","video":null,"publish_date":"2025-02-19 17:58:48","author":"Raven Brunner","authors":["Raven Brunner"],"language":"en","category":"politics","source_country":"US","sentiment":0.378},{"id":292291196,"title":"Trumpworld’s War on Words","text":"It feels ironic to talk about the importance of language in MAGA’s rhetoric when Donald Trump uses so many malapropisms and shorthands to convey his ideas. Think of “the weave,” his tendency to tack back and forth between completely different, ancillary topics when speaking in public.\nBut while Trump may not be particularly careful about every word—or any word, really—his administration and allies are laser-focused on their intrinsic power. They’ve used phrases like “biological reality” and “maiming” to dispute transgender people’s existence and rail against gender reassignment surgery. They’ve disingenuously used words like “energy emergency” to ramp up offshore drilling. One of Trump’s early executive orders combatted nonexistent “censorship”—in actuality, a catchall term for any effort to combat the misinformation and disinformation propagated by Trump and his allies.\nNow the Trump administration has barred the Associated Press from the Oval Office and Air Force One because the esteemed news agency will not follow the president’s executive order and refer to the Gulf of Mexico as the “Gulf of America.” (According to Axios, this is just one of MAGA’s frustrations with the AP stylebook.) And the National Park Service, seemingly at the direction of Trump’s anti-“gender ideology” executive order, has deleted all mentions of “transgender” and “queer” people from the Stonewall National Monument’s websites—a Stalinesque erasure of the T and Q in LGBTQ, despite their crucial role in early queer-rights movements.\nTrump and his allies understand the power of words, and his administration is quickly becoming one that’s obsessed with perverting their meaning. George Orwell reminded us of the political power of language in 1984 by using two different very complementary ideas—“newspeak” a euphemism for the heavily simplified language of propaganda, and “doublethink,” one example of which is “freedom is slavery,” a phrase similar to “arbeit macht frei,” translated to “work makes one free,” infamously used by Nazi Germany. Those concepts ring heavily in Trump’s executive order titled “Prioritizing Military Excellence And Readiness.” The name belies the fact that the order bans trans people from serving in the US military and prohibits the use of identification-based pronouns in the Department of Defense. How does banning trans people prioritize “excellence”? How does abolishing identification-based pronouns figure into “readiness”?\nThe Trump executive order abolishing diversity, equity, and inclusion (DEI) initiatives in the military is called “Restoring America’s Fighting Force.” What exactly is being restored? Does a pre-1960s army somehow fight better than a post-1960s army? None of these questions actually matter to Trumpworld, because precision of language isn’t the point—it’s just overly simplistic propaganda.\nAnd then there’s Trumpworld’s retaking the word “democracy” for their own purposes. Elon Musk told a Pennsylvania town hall crowd in October that the people “who say Trump is a threat to democracy are themselves a threat to democracy.” Musk spends a lot of time tweeting about democracy, but such posts seem to intentionally twist the meaning of the word to fit his own needs. For example, when a judge temporarily blocked his and Trump’s early actions, Musk tweeted last week that “Democracy in America is being destroyed by judicial coup. An activist judge is not a real judge.” Two days later, he tweeted, “If ANY judge ANYWHERE can stop EVERY Presidential action EVERYWHERE, we do NOT live in a democracy.” From a simple Twitter search of Musk’s username and the word “democracy,” it becomes evident that when the world’s richest man says something or someone is threatening democracy, he really just means it’s something he doesn’t like.\nThe Trump administration has also worked hard to replace our traditional political lexicon with contradictory doublethink. As Shawn McCreesh wrote in The New York Times, “An entire lexicon of progressive terminology nurtured by the last administration has been squelched.” Words like patriotism (see: “patriotic education”), freedom, and a favorite of the far right, “anti-American,” are frequently deployed in ways that mean their opposite. (The phrase “un-American” was a key buzzword of McCarthyism, a movement that just like Trumpism targeted intellectuals and academics, including my grandfather Howard Fast. The central premise was that communism was so profoundly corrosive that if communists were allowed to write movies or books or magazine articles, they could have Svengali-like influence over the reading public, forcing them to ditch capitalism. This administration seems to view “DEI” as a similar catchall for ideas they don’t like.)\nWashington Post fact-checker Glenn Kessler wrote about Trumpworld’s dishonest relationship with words and phrases like “transparency” (while firing multiple inspectors general), “free speech” (despite the censorious nature of their edicts), and “deficit” (which Trump’s desired tax cuts would only increase). Kessler also noted how the Trump administration, including Musk’s DOGE, seems to call policies it doesn’t agree with “fraud,” when that is not what the word fraud means.\nEven The Atlantic’s conservative columnist Thomas Chatterton Williams admits that Trumpworld is at war with the English language, utilizing the tools of censorship while somehow also claiming the mantle of free speech warriors. “Most of the banned words related to gender and diversity, and this time the rules had the force of the government behind them,” Williams wrote. “The compelled politesse of the left has been swapped out for the reflexive and gratuitous disrespect of the right.” This checks out when you compare the careful, halting, almost fearful language of many Democratic elected officials versus the strident, giddily hostile language of many Republicans.\nBut anyone who thinks Trump isn’t at war with language, with words and their meanings, should look no further than a world map. There’s reason to think that Trump’s “Gulf of America” name change is about more than just asserting American primacy in the region; it could also speak to his larger ambitions—his quest to rewrite parts of history. After all, Republicans have long been at war with history, trying to mute and soften the teaching of America’s original sin—slavery—and using book bans to prevent certain stories from being told.\nIt may seem odd that language has taken such a central role in an administration that seems so slapdash. But it makes sense. Trump ran an attack ad that used the line, “Kamala is for they/them, Donald Trump is for you.” It was, of course, misleading; prisons, under Trump, offered gender-affirming care, which the campaign was then criticizing Harris for supporting. But it didn’t matter because the language was effective. It was just a few words summing up Trump’s ethos by dumbing it down to: Other people are coming for your stuff.","summary":"The administration’s attack on the AP, along with efforts to rewrite history and reframe reality, only reaffirms the maxim that language is power.","url":"https://www.vanityfair.com/news/story/trumpworlds-war-on-words","image":"https://media.vanityfair.com/photos/67b6163a7f804dbd51718540/16:9/w_2992,h_1683,c_limit/vf224-trump-war-on-words.jpg","video":null,"publish_date":"2025-02-19 17:38:18","author":"Molly Jong-Fast","authors":["Molly Jong-Fast"],"language":"en","category":"politics","source_country":"US","sentiment":-0.237},{"id":292235666,"title":"Yikes: Jailbroken Grok 3 can be made to say and reveal just about anything","text":"Just a day after its release, xAI's latest model, Grok 3, was jailbroken, and the results aren't pretty. \n\nOn Tuesday, Adversa AI, a security and AI safety firm that regularly red-teams AI models, released a report detailing its success in getting the Grok 3 Reasoning beta to share information it shouldn't. Using three methods -- linguistic, adversarial, and programming -- the team got the model to reveal its system prompt, provide instructions for making a bomb, and offer gruesome methods for disposing of a body, among several other responses AI models are trained not to give. \n\nAlso: If Musk wants AI for the world, why not open-source all the Grok models?\n\nDuring the announcement of the new model, xAI CEO Elon Musk claimed it was \"an order of magnitude more capable than Grok 2.\" Adversa concurs in its report that the level of detail in Grok 3's answers is \"unlike in any previous reasoning model\" -- which, in this context, is rather concerning. \n\n\"While no AI system is impervious to adversarial manipulation, this test demonstrates very weak safety and security measures applied to Grok 3,\" the report states. \"Every jailbreak approach and every risk was successful.\"\n\nAdversa admits the test was not \"exhaustive,\" but it does confirm that Grok 3 \"may not yet have undergone the same level of safety refinement as their competitors.\"\n\nAlso: What is Perplexity Deep Research, and how do you use it?\n\nBy design, Grok has fewer guardrails than competitors, a feature Musk himself has reveled in. (Grok's announcement in 2023 noted the chatbot would \"answer spicy questions that are rejected by most other AI systems.\") Pointing to the misinformation Grok spread during the 2024 election -- which xAI then updated the chatbot to account for after being urged by election officials in five states -- Northwestern's Center for Advancing Safety of Machine Intelligence reiterated in a statement that \"unlike Google and OpenAI, which have implemented strong guardrails around political queries, Grok was designed without such constraints.\" \n\nEven Grok's Aurora image generator does not have many guardrails or emphasize safety. Its initial release featured sample generations that were rather dicey, including hyperrealistic photos of former Vice President Kamala Harris that were used as election misinformation, and violent images of Donald Trump. \n\nThe fact that Grok was trained on tweets perhaps exaggerates this lack of guardrails, considering Musk has dramatically reduced and even eliminated content moderation efforts on the platform since he purchased it in 2022. That quality of data combined with loose restrictions can produce much riskier query results. \n\nAlso: US sets AI safety aside in favor of 'AI dominance'\n\nThe report comes amidst a seemingly endless list of safety and security concerns over Chinese startup DeepSeek AI and its models, which have also been easily jailbroken. With the Trump administration steadily removing the little AI regulation already in place in the US, there are fewer external safeguards incentivizing AI companies to make their models as safe and secure as possible.","summary":"A red team got xAI's latest model to reveal its system prompt, provide instructions for making a bomb, and worse. Much worse.","url":"https://www.zdnet.com/article/yikes-jailbroken-grok-3-can-be-made-to-say-and-reveal-just-about-anything/","image":"https://www.zdnet.com/a/img/resize/62124744e82857c6b31605689629158cbb475a6d/2025/02/19/bedbbafb-fcc1-43f7-a9e2-e0ab710f2a45/gettyimages-1741475260.jpg?auto=webp&fit=crop&height=675&width=1200","video":null,"publish_date":"2025-02-19 17:32:06","author":"Radhika Rajkumar","authors":["Radhika Rajkumar"],"language":"en","source_country":"US","sentiment":0.132},{"id":292230114,"title":"George Clooney's surprising message for Donald Trump: '...because our country needs it'","text":"George Clooney who wrote a scathing opinion piece for the New York Times urging Joe Biden to step aside from the presidential election revealing the mood of the Hollywood backers of the Democratic party now has a positive message for President Donald Trump. \"Well, I don't know, what am I supposed to do? Storm the f**ing Capitol,\" Clooney said appearing on The Late Show With Stephen Colbert. He said he now wants the president to do well because \"our country needs it\". \"Good for you. I hope you do well because our country needs it, and we will meet you in 3.5 years and see where we go next,\" George Clooney said without naming Trump. “It’s part of democracy. There are people who agree and disagree, and most of us still like each other, we’re all going to get through it,” he said without criticizing what the Trump administration has done so far or the involvement of Elon Musk in the administration. “I have a son who plays in chess tournaments, loves chess. He’s seven-years-old and he’s playing against a lot of older kids, and he is not winning all the time, as you can imagine,” said Clooney. “He gets upset, and I say, ‘Listen, shake the guy’s hand, you say good game, I’ll get you next time.’ And that’s kind of how you’ve got to live by those rules.”When Trump called George Clooney fake movie starAfter Clooney made a call for Biden to step aside and Kamala Harris to be made the presidential candidate, Donald Trump called him a fake movie actor. “So now fake movie actor George Clooney, who never came close to making a great movie, is getting into the act,” Trump wrote at that time. “He’s turned on Crooked Joe like the rats they both are. What does Clooney know about anything?… Clooney should get out of politics and go back to television. Movies never really worked for him!!!”“I will if he does. That’s a trade-off I’d do,” Clooney said reacting to Trump's criticism.","summary":"“It’s part of democracy. There are people who agree and disagree, and most of us still like each other, we’re all going to get through it,” George Clooney said reacting to the election outcome without criticizing what the Donald Trump administration has done so far or the involvement of Elon Musk in the administration.","url":"https://timesofindia.indiatimes.com/world/us/george-clooneys-surprising-message-for-donald-trump-because-our-country-needs-it/articleshow/118394977.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-118395056/118395056.jpg","video":null,"publish_date":"2025-02-19 17:27:29","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.017},{"id":292218336,"title":"Kamala Harris signs with top Hollywood talent agency as she plots next move","text":"Kamala Harris signs with top Hollywood talent agency as she plots next move\n\nHarris considering running for California governor next year \n\nBy EMILY GOODIN, SENIOR WHITE HOUSE CORRESPONDENT\n\nPublished: 16:40 GMT, 19 February 2025 | Updated: 17:06 GMT, 19 February 2025\n\nKamala Harris has signed with a top Hollywood talent agency as she plots her next move.\n\nThe former vice president has recently been seen taking in Broadway shows, attending a Lakers game, and checking out damage from the Los Angeles wildfires.\n\nNow she has signed on with Creative Artists Agency, which represents top Hollywood stars including Beyoncé, Morgan Freeman, Glen Powell and Nicole Kidman. She also joins former President Joe Biden, who signed the agency last month. \n\nHer agents will focus on getting her speaking gigs and publishing opportunities.\n\n'CAA will work closely with Harris on her post-White House initiatives, creating strategic opportunities that expand her platform in support of the issues she has championed throughout decades-long career in public service,' the agency said.\n\nHarris is weighing her next career move, which include a possible run for governor of California next year.\n\nKamala Harris gives a statement after visiting a fire station in Altadena, California last month\n\nCAA heads Richard Lovett, Bryan Lourd and Kevin Huvane are prominent Democratic fundraisers. \n\nThe agency represented Harris before she became vice president. \n\nCAA helped her land two book deals: 2019’s The Truths We Hold: An American Journey and 2009’s Smart on Crime: A Career Prosecutor’s Plan to Make Us Safer, which served as a launch pad for a book tour and presidential bid. \n\nJoe Biden signs with Hollywood talent agency that also reps Barack and Michelle Obama\n\nFor her next career move, Harris also is considering a 2028 White House bid or a role outside of elective office, a person with knowledge of her deliberations told The New York Times. \n\nSince losing the November election to Donald Trump, Harris has taken a step back from public life.\n\nShe returned to California in January after her tenure as vice president was up. \n\nShe has made a few public appearances. That includes meeting with evacuees at a Red Cross shelter and touring wildfire damage in Pacific Palisades, and she attended an L.A. Lakers and Golden State Warriors basketball game with husband Doug.\n\nThe couple, who are splitting their time between Los Angeles and New York, also took in a few Broadway shows recently: 'A Wonderful World: The Louis Armstrong Musical' and 'Gypsy.' \n\nDuring her visit to wildfire areas, reporters in Los Angeles asked her if she was running for governor of the state. \n\n'I am here, and would be here, regardless of the office I hold, because it is the right thing to do,' she replied.\n\n'I have been home for two weeks and three days. My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them,' she noted. \n\nThe Democratic field is frozen, waiting for her to decide. Current Democratic Gov. Gavin Newsom is term limited.\n\nA poll from Emerson College Polling, Insider California Politics and The Hill earlier this month found that Harris would be the front-runner in a Democratic primary, receiving 57 percent of the vote.\n\nKamala Harris and Doug Emhoff in the audience of 'A Wonderful World: The Louis Armstrong Musical'\n\nKamala Harris and Doug Emhoff attend a basketball game between the Los Angeles Lakers and the Golden State Warriors\n\nIn her November 6 concession speech, Harris signaled she would stay in the public eye. \n\n'This is not a time to throw up our hands. This is a time to roll up our sleeves,' she said. 'This is a time to organize, to mobilize and to stay engaged for the sake of freedom and justice and the future that we all know we can build together.'\n\nSome Republicans are chomping at the bit to take her on.\n\nRichard Grenell, Trump's 'special missions' envoy and interim executive director of the Kennedy Center, said he would challenge her for governor.\n\n'If Kamala Harris runs for governor — I believe that she has such baggage and hundreds of millions of dollars in educating the voters of how terrible she is — that it's a new day in California, and that the Republican actually has a shot,' Grenell told reporters earlier this month. 'And I wouldn't say no.'\n\nMeanwhile, Harris will soon be honored with the Chairman’s Award at the NAACP Image Awards later this month.\n\nIt's given to individuals who 'excel in public service and leverage their unique platforms to ignite and drive meaningful change.' \n\nShe will accept it in her first TV appearance since leaving office on February 22. \n\nPoliticsLos AngelesCaliforniaKamala Harris\n\nShare or comment on this article:\nKamala Harris signs with top Hollywood talent agency as she plots next move\n\nAdd comment","summary":"Kamala Harris signed with a top Hollywood talent agency as she plots her next move. She is considering running for governor in California or making another presidential bid.","url":"https://www.dailymail.co.uk/news/article-14413307/Kamala-Harris-Hollywood-talent-agency.html","image":"https://i.dailymail.co.uk/1s/2025/02/19/13/95367917-0-image-m-11_1739973011702.jpg","video":null,"publish_date":"2025-02-19 17:01:17","author":"Editor,Emily Goodin","authors":["Editor","Emily Goodin"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.582},{"id":292266668,"title":"Ellen DeGeneres and Portia de Rossi are planning to leave their Cotswolds mansion, reports claim","text":"Former talk show host Ellen DeGeneres and her wife Portia de Rossi are reportedly considering moving home, just a couple of months after buying a country mansion in the UK. \n\nThe couple bought the property in the Cotswolds after leaving their home in Montecito, California following Donald Trump’s election victory.\n\nThe luxury farmhouse is set within 43 acres of gardens, paddocks and fields and has six bedrooms, a gym, 55ft indoor pool, separate guest cottage, orchard, wildflower meadow and hundreds of feet of river frontage.\n\nThe couple reportedly told friends that the move was motivated by Donald Trump being re-elected as president. They were big supporters of the Kamala Harris campaign and vowed to “get the hell out” of the US and never return after the Republicans won back the White House.\n\nEllen DeGeneres shared her endorsement for the Democrats in August, writing: “There’s nothing more powerful than a woman whose time has come, I can’t wait for Kamala Harris to be our next president.”\n\nHowever, the move to the UK hasn’t been plain sailing for the celebrity pair. At the beginning of December, DeGeneres was forced to address claims that her new Cotswolds house has been hit by the “worst flooding in years”, after the area was hit by Storm Bert.\n\nOne local, who allegedly lives near the couple in the South West region, told MailOnline that “flood waters are rising by the hour”. They added: “This is the worst I have seen it in years.”\n\nHowever, in a 1 December Instagram post celebrating 20 years together as a couple, the former Ellen Show host denied such claims. “P.S. for those of you concerned, our UK farmhouse did NOT flood,” she wrote. \n\n View this post on Instagram \n\nThen, in February 2025, reports emerged that Ellen DeGeneres had locked horns with some of her wealthy neighbours over building work that was being carried out at her property. \n\nAccording to the New York Post, the couple added a single-story extension to make their home even larger, but local residents weren’t happy, believing it would cause an increased flood risk. There were also fears the extension could have possibly disturbed historic Roman ruins around 200 meters from their property.\n\nThe Oxford Mail reports that councillors at the village parish meeting were unimpressed that the couple’s developers had not sought planning permission for their extension, leading to a ‘technical breach’. Council minutes said that “concern was expressed by residents that the hedge and wire fence could increase flood risk in the village’”if rubbish was swept down and “caught on the fence.”\n\nHeiress Rosie Pearson – the youngest child of Viscount Cowdray – told the Oxford Mail: “I was at the meeting when it was discussed and yes, I contacted the officer because an extension had gone up without permission.”\n\nNow, the Daily Mail are reporting that the DeGeneres and de Rossi are already planning to move, speculating that their decision to buy a different mansion in the Cotswolds is linked to the flooding in December, and the neighbour drama.\n\nThey claim that a source told them: “Ellen and Portia have had several issues with the place they initially moved into. First there was the flooding, of course, then there was an issue with some locals complaining about some building work carried out at the property.”\n\nThe source went on to say that the couple had found another mansion that they prefer: “They looked at it several times. And they liked it more each time they looked.\n\n“So it does look like it’s happening. They’ve been seen around there several times in recent weeks and have even had interactions with neighbours.” \n\nHow much is Ellen DeGeneres worth?\n\nIf you’re as well off as Ellen DeGeneres, it makes sense that, if one UK mansion isn’t quite right, you’d just casually buy another one. \n\nForbes estimated DeGeneres’s 2020 earnings at $84 million and her net worth at $370 million, making her the 12th-highest-paid entertainer in the world. \n\nHowever, her reputation has taken a bit of a hit since then. \n\nIn 2020, several former and current staff members claimed to BuzzFeed News that DeGeneres’ optimistic and happy personality was “bull****” that “only happens when the cameras are on”. There were also allegations of racism, bullying and harassment being rampant behind the scenes of the daytime talk show. The long-running talk show eventually ended in May 2022, almost two years after the BuzzFeed News report was published.","summary":"Former talk show host Ellen DeGeneres and her wife Portia de Rossi are reportedly considering moving home, just a couple of months after buying a country mansion in the UK. The couple bought the property in the Cotswolds after leaving their home in Montecito, California following Donald Trump&#8217;s election victory. The luxury farmhouse is set [&#8230;]\n\n\nThe post Ellen DeGeneres and Portia de Rossi are planning to leave their Cotswolds mansion, reports claim appeared first on PinkNews | Latest lesbian, gay, bi and trans news | LGBTQ+ news.","url":"https://www.thepinknews.com/2025/02/19/ellen-degeneres-uk-mansion-cotswolds/","image":"https://www.thepinknews.com/wp-content/uploads/2025/02/Untitled-design-2024-12-02T154428.961.webp","video":null,"publish_date":"2025-02-19 16:45:10","author":"Hilary Mitchell","authors":["Hilary Mitchell"],"language":"en","source_country":"gb","sentiment":-0.073},{"id":292212388,"title":"'Only takes 3': Dems push personal data protection to turn GOP against Elon Musk's DOGE","text":"House Democrats have a new coordinated pressure campaign aimed at restricting Elon Musk's Department of Government Efficiency (DOGE), based on leveraging the GOP's razor-thin majority. Recent days have seen Democratic lawmakers take to both traditional and social media to publicly urge \"just three House Republicans\" to cross the aisle and vote for a bill designed to stop Musk from accessing U.S. citizens' records in the Department of Treasury. \"I'm supporting the Taxpayer Data Protection Act because it will protect Americans’ private data from Elon Musk and his reckless DOGE employees,\" Rep. Susie Lee, D-Nev., wrote on X. \"Republican leadership has to let us vote. If they don’t, it only takes three lone Republicans to join us and make it happen.\" Generally, legislation needs to have the blessing of majority party leaders to get a House-wide vote. BLACK CAUCUS CHAIR ACCUSES TRUMP OF 'PURGE' OF 'MINORITY' FEDERAL WORKERS But Lee's comments appear to signal that House Democrats are prepared to use a discharge petition to end-run GOP leaders' likely opposition. It's a mechanism to force legislation up for a House-wide vote, provided the petition gets signatures from a majority of House lawmakers. Meanwhile, in an MSNBC interview earlier this week, House Minority Leader Hakeem Jeffries, D-N.Y., suggested Democrats' highlighting of Republicans' thin majority could be a running theme in the 119th Congress. \"What we've been saying to our Republican colleagues is that on any issue that the American people are concerned about, it only takes three Republicans to break with the other side of the aisle, join the 215 Democrats, and we can stop them in their tracks. It only takes three,\" Jeffries said. \"Meanwhile, they're in the witness protection program as it relates to the things that are taking place – don't want to take a stand, don't want to offend Elon Musk, don't want to offend Donald Trump, but they're really offending the people that they were elected to represent.\" SCOOP: KEY CONSERVATIVE CAUCUS DRAWS RED LINE ON HOUSE BUDGET PLAN He stopped short of endorsing any specific legislation, however. Fox News Digital reached out to Jeffries' office to ask if he would be supportive of a discharge petition. Other Democrats were more targeted in their approach, like progressive Rep. Mark Pocan, D-Wis., who wrote on X, \"It’s not rocket science: an unelected billionaire should NOT have access to your personal financial info!\" \"If just three House Republicans join us, we can pass a bill that stops Musk from accessing your private info. But the [House GOP] is siding with their favorite billionaire donor over everyday Americans,\" Pocan wrote on Tuesday. Rep. Sheila Cherfilus-McCormick, D-Fla., said on the site, \"This isn’t complicated: allowing access to these sensitive IRS records by an unelected businessman is dangerous. We can protect your privacy if just three House Republicans join us to pass legislation that stops accessing your private information.\" It will likely be an ongoing theme for the next two years as Republicans navigate a majority of less than a handful of House seats. The number three also coincides with how many House Republicans won districts that former Vice President Kamala Harris prevailed over Trump in last year. CLICK HERE TO GET THE FOX NEWS APP Those Republicans – Reps. Mike Lawler, R-N.Y., Brian Fitzpatrick, R-Pa., and Don Bacon, R-Neb. – are likely to be main targets for Democrats. The vast majority of House Republicans have been supportive of Musk's DOGE efforts, however, even as Democrats sound alarm bells about the billionaire's lack of government experience and accuse him of possible conflicts of interest. Republicans have argued that the $36 trillion national debt amounted to a fiscal crisis that called for extraordinary measures.","summary":"House Democrats have launched a new public pressure campaign against the GOP&apos;s razor-thin majority.","url":"https://www.foxnews.com/politics/only-takes-3-dems-roll-out-anti-doge-pressure-campaign-targeting-slim-gop-majority","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/jeffries-musk-dems.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 16:05:12","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":0.049},{"id":292199740,"title":"Kamala Harris and Joe Biden Reunite at Hollywood Talent Agency","text":"Former Vice President Kamala Harris has joined her chief of state, former President Joe Biden, in signing with Hollywood talent agency Creative Artists Agency (CAA).Why It MattersHarris led a slightly over 100-day campaign with her running mate Minnesota Governor Tim Walz for the 2024 presidential election, following Biden's withdrawal in July. Ultimately, she lost to now President Donald Trump, who was previously in office prior to Harris and Biden. Trump won 312 electoral votes, while Harris received 226. The Republican also won every swing state.CAA represents other political figures such as former President Barack Obama and his wife Michelle Obama, as well as former Texas Representative Beto O'Rourke, a Democrat, and former West Virginia Senator Joe Manchin, a longtime Democrat who registered as an independent in 2024. The company also represents celebrities like Beyoncé, Sabrina Carpenter, Trevor Noah, Ariana Grande, Jeff Goldblum and Lance Bass.What To KnowBreaker Media and Variety were the first to report Harris' partnership with CAA. Harris was represented by the agency while serving as a senator before taking the oath as vice president.Variety reported the agency will be \"creating strategic opportunities\" for Harris \"that expand her platform in support of the issues she has championed throughout decades-long career in public service.\"The news comes two weeks after the agency announced its deal with Biden. The former president was also represented by CAA prior to his term in the White House from 2017 and 2020. During that time, Biden published his number one New York Times bestselling memoir, Promise Me, Dad.Both Biden and Harris have stayed relatively out of the spotlight since their time in office.Biden and his wife, Jill Biden, spent some time in Santa Ynez Valley in California. Meanwhile, Harris and her husband, Doug Emhoff, were spotted at a Los Angeles Lakers game two weeks ago. The couple also attended two Broadway productions over the weekend. They saw A Wonderful World: The Louis Armstrong Musical, after which Harris delivered a speech to the cast and crew.\"Where there's a vacancy, let's fill it. Let us know that the reality is that the progress of our nation has been about the expansion of rights, not the restriction of rights,\" Harris said in the speech, according to a video shared to social media. \"We're seeing a U-turn right now. For those rights to be maintained, which means we have to be vigilant. It's just the nature of it.\"What People Are SayingRichard Lovett, co-chairman of CAA, said in an Instagram post: \"President Biden is one of America's most respected and influential voices in national and global affairs. His lifelong commitment to public service is one of unity, optimism, dignity, and possibility. We are profoundly honored to partner with him again.\"Leon Russell, the chair of the NAACP national board of directors, said in a statement on Friday announcing that Harris will receive the organization's Chairman's Award: \"Vice President Kamala Harris is more than a leader—she is a force of change, driven by an unwavering passion to shape a brighter, more equitable future... Her legacy is built on courage, compassion and a profound commitment to uplifting those who need it most. Her tireless advocacy for the most vulnerable among us has made her a beacon of hope and progress.\"Former Vice President Kamala Harris in her November concession speech: \"In our nation, we owe loyalty not to a president or a party, but to the Constitution of the United States, and loyalty to our conscience and to our God. My allegiance to all three is why I am here to say, while I concede this election, I do not concede the fight that fueled this campaign—the fight: the fight for freedom, for opportunity, for fairness, and the dignity of all people. A fight for the ideals at the heart of our nation, the ideals that reflect America at our best. That is a fight I will never give up.\"What Happens NextCAA is going to work closely with Harris on her post-White House career.Harris will be honored on February 22 with the Chairman's Award at the NACCP Image Awards.","summary":"Former Vice President Kamala Harris and former President Joe Biden are signing to a Hollywood talent agency.","url":"https://www.newsweek.com/kamala-harris-joe-biden-hollywood-talent-agency-caa-2033197","image":"https://d.newsweek.com/en/full/2591361/harris-biden.png","video":null,"publish_date":"2025-02-19 15:48:35","author":"Monica Sager","authors":["Monica Sager"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.12},{"id":292295996,"title":"Hostin Insists Black Women Are a Superior Demographic, 'Voted to Save' America","text":"ABC’s The View\nFebruary 18, 2025\n11:30:07 a.m. Eastern\n\nJOY BEHAR: Why Musk is going into my Social Security and the IRS? Why is he doing that? Why is he doing that? Why is he firing people?\n\nSUNNY HOSTIN: Well, people should be concerned about that but I kind of agree with James Carville because I'm part of the 92 percent of black women that voted to save the rest of the country.\n\nBut the country wanted something else, and the country is getting something else! So, I'm resting.\n\nBEHAR: It's not the whole country.\n\nHOSTIN: I’m resting.\n\nFebruary 19, 2025\n11:17:30 a.m. Eastern\n\nBEHAR: Sometimes you have to hit them in the economy, though. This is an interesting thing. There’s a movement right now on -- for the end of this month, for people to – don't spend any money at the – on one particular day, what day is it?\n\nSUNNY HOSTIN: February 28.\n\nBEHAR: Yes. Because uh – We're not sure all this all started but that's one way for the average person –\n\nHOSTIN: It started in the black community actually because I've been not involved with it but gotten a lot of information on it.\n\nAnd let's face it, black people know how to organize outside of systems because we’ve been excluded form systems for so very long. And that’s why we were behind the Civil Rights movement. And when black people win and get rights like civil right, everybody does better and that's something that the Democrats can take a page out of the book for.\n\nBut, you know, I'm starting to think as I've said before, I'm one of the 92 percent of black women that voted for Kamala Harris and so I'm sort of in a resting place right now because I voted to save the country and the country didn't vote with me. The majority of the country.\n\nSARA HAINES: A lot of the country.\n\nHOSTIN: A lot of the country but the majority didn't. So, I'm kind of in your phase that you described, the turtle phase, I think that the Republicans.\n\nBEHAR: Let them eat each other?\n\nHOSTIN: Yeah.\n\nI think the Republicans and the people that voted for Trump and now they also voted for co-president Musk, now they realize that the forest ranger just got fired. Somebody in the Foreign Service, you know, his wife couldn't get medevacked because they got fired, all the federal workers are getting fired. I think that they will turn on the Republican Party and they will come back to the Democratic Party!","summary":"On multiple days this week, staunchly racist Sunny Hostin put herself on a pedestal above all Americans and proclaimed to be part of the superior racial demographic: black woman. During the Tuesday and Wednesday episodes of ABC’s The View, Hostin repeatedly praised herself and other black woman for how they “voted to save the country” by supporting Vice President Kamala Harris’s backup bid for president.\n\nWhile co-host Joy Behar was falsely whining about Elon Musk personally going through her Social Security records and IRS filings, during Tuesday’s show, Hostin bloviated about how she was “resting” and letting others deal with politics since she and other black woman already tried to save the country:\n\n\nBEHAR: Why Musk is going into my Social Security and the IRS? Why is he doing that? Why is he doing that? Why is he firing people?\n\nHOSTIN: Well, people should be concerned about that but I kind of agree with James Carville because I'm part of the 92 percent of black women that voted to save the rest of the c","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/02/19/hostin-insists-black-women-are-superior-demographic-voted","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-02/2025-02-19-ABC-TV-Sunny-Hostin-Praises-Black-Women-Voted-to-Save-The-Country.jpg?itok=jB2g_r0R","video":null,"publish_date":"2025-02-19 15:38:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","source_country":"US","sentiment":-0.298},{"id":292315468,"title":"Trump’s approval rating slips as Americans worry about the economy","text":"Reading Time: 3 minutes\n\nU.S. President Donald Trump’s approval rating has ticked slightly lower in recent days as more Americans worried about the direction of the U.S. economy as the new leader threatens a host of countries with tariffs, a Reuters/Ipsos poll found.\n\nThe six-day poll, which closed on Tuesday, showed 44% of respondents approved of the job Trump is doing as president, down from 45% in a Reuters/Ipsos poll conducted January 24-26. Trump’s approval rating stood at 47% in a January 20-21 poll conducted in the hours after the Republican’s return to the White House. \n\nThe share of Americans who disapprove of his presidency has risen more substantially, to 51% in the latest poll, compared with 41% right after he took office.\n\nTrump enjoys a relatively high rate of approval on his immigration policy, with 47% of respondents backing his approach that has included promises to ramp up deportations of migrants in the country illegally. The share was little changed from January.\n\nBut the share of Americans who think the economy is on the wrong track rose to 53% in the latest poll from 43% in the January 24-26 poll. Public approval of Trump’s economic stewardship fell to 39% from 43% in the prior poll.\n\nA pillar of Trump’s political strength has been public belief that his policies will be good for the economy, and his rating on the economy remains significantly higher than the final readings of his predecessor in office, Democrat Joe Biden, who ended his term with a 34% approval rating on the economy. But Trump’s rating for the economy is well below the 53% he had in Reuters/Ipsos polling conducted in February 2017, the first full month of his first term as U.S. president. \n\nIn the latest poll, only 32% of respondents approved of Trump’s performance on inflation, a potential early sign of disappointment in the Republican’s performance on a core economic issue after several years of rising prices weakened Biden ahead of last year’s presidential election. Trump defeated Biden’s vice president, Kamala Harris, in the Electoral College and narrowly won the popular vote.\n\nA recent report from the U.S. Labor Department showed consumer prices rose by the most in nearly 1-1/2 years in January, with Americans facing higher costs for a range of goods and services. Other economic data has shown U.S. households expect inflation to pick up following Trump’s February 1 announcements for steep tariffs on imports from China, Mexico and Canada.\n\nWhile the levies on Mexico and Canada were since delayed until March, Trump has set March 12 as the start date for other tariffs on imported steel and aluminum and he has directed his staff to devise global reciprocal tariffs.\n\nFifty-four percent of respondents in the latest Reuters/Ipsos poll said they opposed new tariffs on imported goods from other countries, while 41% were in favor of them. Increasing tariffs on Chinese goods had higher levels of support, with 49% in favor and 47% against.\n\nThe Reuters/Ipsos poll, which was conducted online, surveyed 4,145 U.S. adults nationwide and had a margin of error of about 2 percentage points in either direction.\n\nSource: Reuters","summary":"Trump’s approval rating slips as Americans worry about the economyTrump's approval drops amid economic concerns and rising disapproval.\n\n\nThe post Trump’s approval rating slips as Americans worry about the economy first appeared on The Dispatch.","url":"https://cde.news/trumps-approval-rating-slips-as-americans-worry-about-the-economy/","image":"https://cde.news/wp-content/uploads/2025/02/Screenshot-2025-01-20-at-06-49-46-14-donald-trump-Search-Results.png","video":null,"publish_date":"2025-02-19 15:00:00","author":"Cde,Reuters","authors":["Cde","Reuters"],"language":"en","category":"politics","source_country":"mt","sentiment":-0.161},{"id":292186796,"title":"This Trump Idea Sounds Great. It Would Have Horrible Consequences.","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nWhat happens in Vegas is supposed to stay in Vegas. But that may not be the case with Donald Trump’s suggestion that tips be tax-free. Recently, a line that seemed like a hollow campaign promise—meant to pander to folks in Las Vegas’ service industry—made it into the 2024 Republican Party platform and was endorsed by Kamala Harris; it now looks as if it will end up in the reconciliation bill the Republicans are currently preparing.\n\nThis may sound like a great idea, especially if you work for tips. However, it’s a really bad idea. Depending on how it is implemented, it will do little for—and possibly really hurt—many of those it is ostensibly designed to help. It is unfair, bad policy, and fiscally irresponsible.\n\nMany tipped workers don’t make enough money to be subject to the income tax, or they pay very little. So excluding tips solely for income-tax purposes won’t provide tipped workers much in the way of a benefit. In other words, it’s an empty promise.\n\nHowever, even if some tipped workers don’t pay income taxes, they do pay payroll taxes, which finance Social Security and Medicare; if Congress exempts tips from those taxes, the workers may save some money in the short run, but the plan might actually hurt them down the line. They could lose out on the earned income tax credit, which subsidizes lower-wage workers. And they could eventually lose out on better Social Security benefits. Both EITC and Social Security benefits are based on taxed income.\n\nEither way, people might start tipping less if they know that tips are tax-free, and pressure to increase the minimum wage may lessen. That would also be bad for tipped workers.\n\nNow the policy: Imagine that someone told you we should tax teachers at a higher rate than bartenders. To be clear, bartenders perform a valuable service—who doesn’t like a well-made cocktail?—but most people would say that’s ridiculous. A core Republican talking point is, or at least used to be, that the government is not supposed to interfere with the market or pick winners and losers. Exempting from tax income earned by people in certain professions does just that.\n\nConsider a bartender and a teacher, both of whom earn $50,000. They should be taxed the same. But if $20,000 of the bartender’s $50,000 are in the form of tips, the bartender will pay far less in taxes than the teacher, even though they earn the same amount. Do we really want to create a tax incentive for folks to become bartenders instead of teachers?\n\nBut wait, as they say, there’s more! Raise your hand if you think the post-COVID explosion in tipping opportunities is a good thing. Yeah, I didn’t think so. If the Republicans actually make this happen, hold on to your seats, because it will get a lot worse. We’ll soon be tipping our lawyers, doctors, gardeners, and anyone else who is public facing. Heck, I would gladly agree to a salary reduction if my students would start tipping—in exchange for a tuition reduction, of course.\n\nNow, the skeptic might argue that the tips I would receive under this plan are merely salary in disguise and therefore should be taxed. And that’s the point. Tips are income and should be taxed, no more—and no less—than other kinds of income. If you don’t believe me, check out the federal minimum wage, which is lower for tipped employees.\n\nCongress could try to limit the rule only to those who work in certain industries, but why should folks in some industries pay less in taxes than people who make the same amount in other industries? Or it could restrict the benefit to those who make under a certain amount. But think about the complexity such regulations would add to the tax code as we try to limit the rule to the intended beneficiaries. It was only a few years ago that we had to consider whether baristas “manufactured” lattes for purposes of the tax benefit aimed at domestic manufacturers.\n\nFinally, it is fiscally irresponsible. By one estimate, exempting tips from tax could cost $100 billion over 10 years. If the exemption were limited to those in the leisure industry, the cost might be only $40 billion. Much depends on the details and how people respond to the incentives created. By way of comparison, this lower figure equals the amount the government claims it will save by slashing National Institutes of Health grants.\n\nIf we want to do something for service-industry workers, we should address working conditions, the minimum wage, or the tax rates imposed on all at the lower end of the income spectrum. We shouldn’t be picking winners and losers, distorting the labor markets, or adding complexity to an already messy code. Put differently, this is an idea that really should have stayed in Vegas.","summary":"It debuted in Vegas. It should have stayed there.","url":"https://slate.com/news-and-politics/2025/02/trump-taxes-tips-budget-vegas-workers-unions.html?via=rss","image":"https://compote.slate.com/images/ca8cb2f4-554c-4c5f-bc35-56b1af3c56e4.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-02-19 15:00:00","author":"Adam Chodorow","authors":["Adam Chodorow"],"language":"en","category":"politics","source_country":"US","sentiment":-0.416},{"id":292172186,"title":"CBS News exec Adrienne Roark, who reprimanded anchor over Israel interview, plans to exit network","text":"CBS News editorial executive Adrienne Roark, who made headlines for reprimanding morning anchor Tony Dokoupil over an interview he conducted with an author critical of Israel, is preparing to exit the network, according to a report.\n\nRoark’s departure comes as CBS, led by Wendy McMahon, grapples with legal and political battles involving Trump and its controlling stakeholder, Shari Redstone, who has reportedly signaled her willingness to settle the lawsuit with the president.\n\nRoark, who sources say saw the writing on the wall and decided to leave ahead of an anticipated merger between Paramount Global and Skydance Media, is expected to take on a senior role at TEGNA, according to Breaker and the Status newsletter.\n\nA CBS spokesperson confirmed the report when reached by The Post.\n\nRoark’s departure was announced during the daily 9 a.m. editorial call at CBS headquarters, The Post has learned. There is no word on the date of her last day at the network.\n\nIn October, McMahon and Roark reprimanded Dokoupil for his pointed questioning of author Ta-Nehisi Coates regarding his pro-Palestinian positions on Hamas’ war with Israel, prompting internal backlash over the network’s journalistic integrity.\n\nDuring a staff meeting on the anniversary of the Oct. 7 attack, McMahon and Roark criticized Dokoupil for injecting personal bias into the interview, according to multiple reports.\n\nThey argued the discussion, which also featured co-anchors Gayle King and Nate Burleson, failed to meet CBS News’ impartiality standards, though they did not elaborate on specific concerns.\n\nThe Post has sought comment from CBS.\n\nA source close to the situation told The Post that Roark’s exit can be attributed to the fact that “there’s no job security with the Skydance merger.”\n\n“It’s difficult. Everyone is trying to get out,” the source told The Post.\n\nRoark is “not going to be missed” at the Tiffany Network since there are already a significant number of senior executives at the network, which the source described as “top heavy.”\n\n“Nobody in the news division knew what she did,” the source said.\n\nThe source said that one of Roark’s key mistakes was taking Dokoupil to task for his interview of Coates.\n\nRoark’s exit comes more than a week after The Post reported that Trump is pushing for a substantial financial settlement from CBS over his $10 billion lawsuit alleging election interference. \n\nTrump recently amended the lawsuit and is now seeking $20 billion.\n\nSources familiar with the situation indicate that Trump’s legal team is positioning to demand a nine-figure sum, far exceeding the $16 million recently paid by ABC and the $25 million settlement from Meta.\n\nThe negotiations remain in the early stages. Discussions over a possible settlement began earlier this month.\n\nTrump filed suit against CBS and its parent company Paramount Global after “60 Minutes” aired an October interview with then-Vice President Kamala Harris.\n\nTrump claims the interview was deceptively edited to favor the Democratic ticket.\n\nWhile no formal settlement offer has been presented to Paramount Global, sources close to Trump’s legal team suggest he may demand an amount in the range of $100 million or more.\n\nA legal insider indicated that an opening demand of $100 million to $150 million would not be unexpected, citing Trump’s previous aggressive legal tactics.\n\nThe former president’s team had pursued a similar strategy against ABC, securing a deal where $15 million was earmarked for Trump’s presidential library and an additional $1 million allocated for legal fees.\n\nThe high-stakes negotiations carry significant implications for Paramount Global, which is currently working to finalize its merger with Skydance Media, owned by Larry and David Ellison.\n\nThe $8 billion transaction, valued at $2 billion less than Trump’s lawsuit against CBS, is poised to close within the first quarter of the year.\n\nHowever, the deal is drawing regulatory scrutiny, particularly from the Federal Communications Commission (FCC), which has scheduled a public hearing next month to examine allegations of news distortion at CBS News.\n\nTrump-appointed FCC Commissioner Brendan Carr recently released the full transcript and video footage of Harris’ “60 Minutes” interview, revealing that the program had substantially shortened one of her responses regarding Israel, reducing it to just 20 words.\n\nThe move has further inflamed tensions, with speculation that the FCC may delay its decision on the merger while awaiting a resolution between the parties.\n\nTrump reacted strongly to the release of the transcript, taking to Truth Social to denounce CBS, calling the network’s actions an example of election interference and fraud.\n\nHe went so far as to suggest that CBS should lose its broadcasting license over the matter.\n\nHis legal team reinforced this stance, with attorney Ed Paltzik asserting that CBS and its parent company, Paramount, had misled the public.\n\nHe further stated that any settlement should both compensate Trump for perceived damages and serve as a warning to media organizations against manipulating information for political purposes.\n\nAs the legal battle unfolds, CBS remains silent on the matter. Meanwhile, Paramount faces mounting pressure to navigate both its merger ambitions and the growing controversy surrounding its flagship news division.","summary":"Roark’s departure comes as CBS grapples with legal and political battles involving Trump and its controlling stakeholder, Shari Redstone.","url":"https://nypost.com/2025/02/19/media/cbs-news-exec-adrienne-roark-to-exit-network/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-l461lrsfz-1739973386091.jpg?quality=75&strip=all&1739955405&w=1200","video":null,"publish_date":"2025-02-19 14:34:51","author":"Alexandra Steigrad,Ariel Zilber","authors":["Alexandra Steigrad","Ariel Zilber"],"language":"en","source_country":"us","sentiment":-0.219},{"id":292169340,"title":"Debra Saunders: Live From New York, it’s the liberal media","text":"WASHINGTON — Sunday night’s “SNL50: The Anniversary Special” celebrated the long-running NBC show as you knew it would — with the soothing reassurance to its ostensibly liberal viewers that they own comedy and that, in their world, the right’s only place in their orbit is as the butt of their self-satisfied jokes.\n\nEven though President Donald Trump hosted the show in 2004 and 2015, he was conspicuously absent from the Rockefeller Plaza stage. Because everyone knows that an essential ingredient of any “SNL” episode is to reassure young voters that their politics have a monopoly on virtue and fun.\n\nDays before the November election, during the show’s famed cold open, Democratic presidential candidate Kamala Harris got an assist from cast member Maya Rudolph, who played the vice president talking to herself (Harris) in the looking glass. It was a love fest. I remember watching that skit and thinking it exhibited yet another reason Trump was likely to win the election.\n\nIt’s the smugness, stupid.\n\nNBC has absolutely no problem signaling to the majority of voters who supported Trump that they have no place in the spotlight.\n\nThere was one pro-Trump character during the three-hour-plus TV special. MAGA-hat wearing contestant Tom Hanks at first recoils when “Black Jeopardy” host Kenan Thompson tries to shake his hand. Because, don’t you know, Trump World is racist?\n\nThat’s one reason I rarely watch the show. I am happy to laugh at my politics. I just wish “SNL” comedians could do likewise. The show’s ratings might perk up, too.\n\nBecause, right now, watching “SNL” is sort of like watching a White House Correspondents’ Association dinner. It’s occasionally funny, but you know the comedian’s political leanings will be further left than most voters.\n\nDitto Sunday morning fare on NBC, CBS, ABC and CNN.\n\nOn “Face the Nation” Sunday morning, host Margaret Brennan stepped in it again. As she interviewed Secretary of State Marco Rubio, Brennan engaged in the stalest of Sunday talk show habits: asking a Republican to comment on another Republican’s ill-conceived rhetoric.\n\nExcept this time, the Republican quote-maker in question was highly articulate Vice President JD Vance, who on Friday very deliberately had told the Munich Security Conference that he fears the biggest security threat to Europe is not Russia or China or any external actor. “What I worry about is the threat from within,” Vance told the gathering, “the retreat of Europe from some of its most fundamental values, values shared with the United States of America.” Values like free speech.\n\nYou might expect Brennan to appreciate Vance’s remarks because, well, free speech is sort of important to the news business.\n\nInstead, Brennan went after the “Hillbilly Elegy” author’s remarks, when she argued, “Well, he was standing in a country where free speech was weaponized to conduct a genocide, and he met with the head of a political party that has far-right views and some historic ties to extreme groups.”\n\nI have one question: How is someone as completely out of touch as Brennan still working?\n\nConservative social media had a field day. Once again, the right is shown as the champion of the First Amendment while Big Media are asking what free speech accomplishes. And they have no idea how they look to the audience they are losing.\n\nWho’s going to tell them? It doesn’t matter. They can’t hear it.\n\nThat “Face the Nation” segment is the stuff of a “Saturday Night Live” skit. But do the “SNL” writers see that?\n\nContact Review-Journal Washington columnist Debra J. Saunders at dsaunders@reviewjournal.com. Follow @debrajsaunders on X.","summary":"That \"Face the Nation\" segment is the stuff of a \"Saturday Night Live\" skit. But do the \"SNL\" writers see that?","url":"https://www.ocregister.com/2025/02/19/debra-saunders-live-from-new-york-its-the-liberal-media/","image":"https://www.ocregister.com/wp-content/uploads/2025/02/AP25047852046352.jpg?w=1024&h=682","video":null,"publish_date":"2025-02-19 14:11:42","author":"Debra J. Saunders","authors":["Debra J. Saunders"],"language":"en","category":"politics","source_country":"US","sentiment":0.2},{"id":292169540,"title":"Six wild and troubling things Donald Trump and Elon Musk did in last 24 hours after joint interview","text":"Donald Trump and Elon Musk sat down for a joint interview, broadcast last night - where the Genius Twins put on a united front to dispel rumours of a rift.\n\nDuring the interview, Trump and Musk denied claims nobody was checking whether Elon had any conflicts of interest between his companies and his DOGE work - insisting Elon is marking his own homework.\n\nDespite berating Government workers for working from home, Trump spent Tuesday - a work day - at one of his luxury golf resorts in Florida.\n\nAnd during a press conference he straight up blamed Ukraine for the war, suggesting if they'd just let Putin's tanks roll over them, the war would have been over much sooner.\n\nOh yeah, and he attended a party with several convicted felons.\n\nHere's all that, plus more wild and troubling things Donald Trump and Elon Musk got up to on Tuesday.\n\n1. Trump, again, blamed Vladimir Putin's invasion of Ukraine on... Ukraine\n\nSpeaking from his Florida golf course resort, Mar A Lago, where he is, despite it being a work day, the President went the furthest yet in blaming the Ukraine war on Ukraine - explicitly saying they should have given up territory to Russia when they invaded.\n\nTrump said he was \"disappointed\" to hear Volodymyr Zelensky had complained about being left out of talks in Riyadh, saying: \"Today I heard, 'Oh, well, we weren't invited'. Well, you been there for three years. You should have ended it three years (ago).\n\n\"You should have never started it. You could have made a deal.\"\n\nHe added: \"I could have made a deal for Ukraine that would've given them almost all of the land, everything, almost all of the land and no people would have been killed and no city would have been demolished.\"\n\n 2. Elon Musk gets to mark his own homework \n\nDuring a deeply weird joint sit-down interview with (who else) Fox News - the kind of interview a politician gives alongside his wife when he's got caught having an affair - Elon Musk set everyone's minds at rest. It's not that nobody is keeping an eye on his conflicts of interest. Oh no, no, no.\n\nHe's keeping an eye on them himself.\n\n\"What about his business?\" Fox blowhard Sean Hannity asked. \"What if there is a contract he would otherwise get?\"\n\n\"If he's got a contract,\" Trump began, \"If he's in certain areas. You see this morning - I didn't know, I said do the right thing...where they're cutting back on the electric vehicle subsidies...they're cutting back! He's probably not that happy with it. But that would have been one thing where he would have come to me and said listen, you gotta do me a favour.\"\n\nFor clarity, what he's suggesting would have been a natural response from Musk there, would to most people be considered straight up corruption.\n\n\"I haven't asked the president for anything, ever,\" Musk said - which we'll come back to in a moment.\n\nAnd if something comes up, how will Musk handle it?\n\n\"I'll recuse myself,\" Musk insisted.\n\nAs for whether he's ever asked Trump for anything, maybe not. But he got a sit-down meeting with Indian Prime Minister Narendra Modi last week apparently without even having to ask.\n\nWhen Trump was asked about the meeting he told reporters he didn't know why they met, but said Musk probably \"wants to do business\" in India.\n\n3. Trump admitted inflation is back, but it has nothing to do with him...\n\nDonald Trump admitted \"inflation is back\" in the interview - before going on to complain he'd only been in charge again for two and a half weeks, so it couldn't possibly be his fault.\n\nDuring the same two-and-a-half weeks, Trump has taken credit for improved GDP growth, improved stock market performance, unemployment being low and reduced border crossings - all of which were on a positive trend well before he took office.\n\n4. Musk read the numbers wrong again\n\nElon claimed it was an uphill struggle to get his \"reforms\" through because Washington's government workforce was overwhelmingly Democratic, and therefore \"implacably\" resistant to Trump and republicans in general.\n\nHe gave as evidence a statistic that 92% of voters in Washington DC voted for Kamala Harris.\n\nWhile it's true that DC has always voted heavily Democratic, that's not necessarily evidence that government workers skew Democrat to the same degree.\n\nThe city (the District) itself is one of the most ethnically diverse in the country - and was majority black until 2011. Despite its reputation as a \"company town\" - around three quarters of DC residents work in the private sector - a combination of highly paid law, science and professional jobs and retail, service and construction.\n\nAnd only about a third of government workers in DC actually live in the District, with the remaining two thirds living in nearby Maryland and Virginia.\n\nClayton county voted for Harris by 84.31% - but that's probably not an indication that the supply chain and logistics industry around the world's busiest airport - Hartsfield-Jackson Atlanta International - is implacably skewed to benefit one party and resist another. It's just how people voted.\n\n5. Trump and Musk falsely claimed tens of millions of dead people are claiming pensions\n\nOver the past few days the Genius Twins have said on social media and in press briefings that people who are 100, 200 and even 300 years old are improperly getting benefits — a “HUGE problem,” Musk wrote, as his goon squad half-read yet another spreadsheet and jumped to the least likely conclusion.\n\nIt is true that improper payments have been made, including some to dead people. But the numbers thrown out by Musk and the White House are overstated and misrepresent Social Security data.\n\nYesterday, at his Mar A Lago presser, Trump claimed “we have millions and millions of people over 100 years old” receiving Social Security benefits. “They’re obviously fraudulent or incompetent,” Trump said.\n\n“If you take all of those millions of people off Social Security, all of a sudden we have a very powerful Social Security with people that are 80 and 70 and 90, but not 200 years old,” he said. He also said that there’s one person in the system listed as 360 years old.\n\nLate Monday, Musk posted a slew of posts on his social media platform X, including: “Maybe Twilight is real and there are a lot of vampires collecting Social Security,” and “Having tens of millions of people marked in Social Security as “ALIVE” when they are definitely dead is a HUGE problem. Obviously. Some of these people would have been alive before America existed as a country. Think about that for a second …”\n\nAnd thinking about it for a second would probably have been a good idea.\n\nPart of the confusion comes from Social Security’s software system based on the COBOL programming language which has a lack of date type. Which you'd think Musk's gang of teen tech savants would know.\n\nThis means that some entries with missing or incomplete birthdates will default to a reference point of more than 150 years ago. WIRED magazine first reported on the use of COBOL programming language at the Social Security Administration.\n\nAdditionally, a series of reports from the Social Security Administration’s inspector general in March 2023 and July 2024 state that the agency has not established a new system to properly annotate death information in its database, which included roughly 18.9 million Social Security numbers of people born in 1920 or earlier but were not marked as deceased. This does not mean, however, that these individuals were receiving benefits.\n\nThe agency decided not to update the database because of the cost to do so, which would run upward of $9 million.\n\nA July 2023 Social Security OIG report states that \"almost none of the number holders discussed in the report currently receive SSA payments.” And, as of September 2015, the agency automatically stops payments to people who are older than 115 years old.\n\n6. Stopped by a pool-side awards party with Mike Tyson and Russell Brand\n\nPerhaps explaining why he stayed at his Florida resort instead of heading back to Washington after the President's Day holiday on Monday, Trump paid a visit to an awards bash held by America's Future, the right wing group led by his former national security advisor Mike Flynn - who you'll remember pleaded guilty to \"wilfully and knowingly making materially false statements and omissions to the Federal Bureau of Investigation\" about conversations with the Russian ambassador to the United States, Sergey Kislyak before Trump's first term.\n\nAlso in attendance at the poolside soiree? Convicted rapist Mike Tyson and Russell Brand, who continues to deny serious sexual assault allegations.\n\nAnd Ted Nugent, the southern rock singer who has admitted to several affairs with underage girls, was in a relationship with a 17-year-old Hawaii native in the late 70s - getting round marriage laws by getting her parents to make him her legal guardian, and sang the 1981 song \"Jailbait\". He was also there.\n\nTrump made an appearance at the event, according to video posted on social media Tuesday night, addressing the crowd on the patio as he stood near Tyson, Flynn and Nugent and declaring, “This is very, very friendly territory.”","summary":"As well as a weird joint interview and a deeply troubling press conference - the Donald relaxed at a party attended by several convicted felons - and Russell Brand","url":"https://www.mirror.co.uk/news/politics/six-wild-troubling-things-donald-34709317","image":"https://i2-prod.mirror.co.uk/incoming/article34709370.ece/ALTERNATES/s1200/0_TOPSHOT-US-POLITICS-TRUMP.jpg","video":null,"publish_date":"2025-02-19 14:07:04","author":"Mikey Smith","authors":["Mikey Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.31},{"id":292187224,"title":"Jon Stewart reveals the anti-Trump insult he's sick of liberals using and warns it has lost its power","text":"Jon Stewart reveals the anti-Trump insult he's sick of liberals using and warns it has lost its power\n\nLISTEN: Elon’s baby mama drama, Tom Hank’s SNL backlash, plus more DOGE cuts – on Daily Mail podcast Welcome to MAGALand\n\nBy GERMANIA RODRIGUEZ POLEO, CHIEF U.S. REPORTER\n\nPublished: 13:24 GMT, 19 February 2025 | Updated: 14:04 GMT, 19 February 2025\n\nJon Stewart says he's bored of anti-Trump Democrats calling the president a 'fascist' and says the word is being overused to the point where it's losing its meaning. \n\nThe Daily Show star, 62, said the liberal media has 'numbed' the country to the word as he was speaking off-air to an audience member who accused him of being 'light on the fascist message recently.'\n\n'Oh, well, I'd tell my critics - shut up! You're a fascist! Stewart snapped back, before elaborating on why he has removed the word from his shows since last year's election. \n\n'I think if you cry \"fascism\" at every administrative overreach, even the ones that are constitutionally OK, you will find yourself out of fascism bullets when the time really comes,' Stewart continued as he noted he is 'very big on specificity and nuance.'\n\nHe accused the media over 'crying wolf' over the last ten years - 'to the point where they numbed everybody.'\n\n'It was an anesthetic, and it got to where- what was the thing they litigated throughout this campaign? \"He's a fascist, he's a terrible person, democracy is on the ballot.\"\n\n'Guess what lost at the [ballot box]? If you told us democracy was on the ballot, democracy got its ass kicked by a majority vote. So I am very cautious about when to know, like, yeah- hopefully I won't do it the night after Kristallnacht… but it's like when you put your dog down. It's one of those things, like, you're not quite sure, but I do understand how annoying that is.'\n\nStewart's comments come after Charlamagne Tha God sparked backlash after U-turning on calling Trump a 'fascist' and questioning how much Democrats 'really believed' the argument in the first place.\n\n\"I think what the media has done over the past ten years is cry wolf, to the point where they numbed everybody.\" Jon Stewart explains his POV on whether to call Trump \"fascist.\" #AfterTheCut pic.twitter.com/FWneAS7VbK\n— The Daily Show (@TheDailyShow) February 16, 2025\n\nJon Stewart slammed the media's constant 'fascist' attacks against Donald Trump, saying they've 'numbed' the country and made the term lose its meaning \n\nI think if you cry \"fascism\" at every administrative overreach, even the ones that are constitutionally OK, you will find yourself out of fascism bullets when the time really comes,' Stewart said about the term being used against president Trump\n\nThe radio host, 46, took aim at the liberal meltdown over Trump's victory on his show this week - despite previously telling CNN that Kamala Harris 'should keep calling Trump a fascist.'\n\nBut following Trump's landslide victory Charlamagne changed his tune.\n\n'Do y'all find it strange that now he's won, they're not calling him a threat to democracy, they're not calling him a fascist,' he said on his show. 'It just makes you wonder how much of it did they really believe?'\n\nStewart has recently began using his famously-liberal show to turn his criticism on Democrats. \n\nEarlier this month, Stewart went after Democrats for using Chuck Schumer as their mouthpiece after the New York senator was mocked over his response to Trump's tariffs on Mexico and Canada. \n\n'It's going to affect beer,' Schumer said as he held up a can of Corona Extra. 'Most of it, Corona here, comes from Mexico.\n\n'It's going to affect your guac – because what is guacamole made of? Avocados,' he continued, displaying the fruit in his hand, before adding: 'If you have pizza, it's going to affect the cost of cheese.'\n\nBut Schumer's remarks misfired, prompting ridicule from conservatives and liberals alike, including left-leaning Stewart who blasted the Senator on his Daily Show program.\n\nDemonstrators gather to protest a day after President Donald Trump's 2016 victory\n\nStewart has recently began using his famously-liberal show to turn his criticism on Democrats\n\n'Your response to the trade war is to f***ing tell us guacamole is made of avocados?' the comedian, sporting a dumbfounded expression said, before begging the party to appoint a new spokesperson.\n\n'Democrats, can you please stop f***ing trotting Schumer out there every time Trump traverses into the unreal,' Stewart said, dropping his voice to a whisper: 'He's not good at this.'\n\nStewart, whose remarks prompted the crowd to erupt in applause, further accused Schumer of not being an appropriate opponent to combat 'manipulator' Trump.\n\n'What is the decision making process here?' he asked, before mocking Democratic leadership with a hilarious impersonation.\n\n'\"Hey! Who should we get out there to effectively battle one of the most savvy presidential media manipulators in history?'\"\n\n'\"I don't know, how about Schumer? He's uninteresting but at least he's monotone,\"' he quipped. '\"Oh wait! Chuck, before you go out there, you look too young! Put on these readers and lower them on your nose. Perfect.\"'\n\nDonald TrumpJon StewartDemocratsMexico\n\nShare or comment on this article:\nJon Stewart reveals the anti-Trump insult he's sick of liberals using and warns it has lost its power\n\nAdd comment","summary":"The Daily Show star, 62, said the liberal media has 'numbed' the country to the word.","url":"https://www.dailymail.co.uk/media/article-14413029/jon-stewart-reveals-anti-trump-insult-sick-liberals-lost-power.html","image":"https://i.dailymail.co.uk/1s/2025/02/19/12/95365773-0-image-a-197_1739968418548.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/05/5737406941582506848/1024x576_MP4_5737406941582506848.mp4","publish_date":"2025-02-19 14:04:19","author":"Editor,Germania Rodriguez Poleo","authors":["Editor","Germania Rodriguez Poleo"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.594},{"id":292152508,"title":"Why Dana Carvey skipped the ‘SNL 50’ special after his recent Joe Biden sketches","text":"Where’s Dana?\n\nDana Carvey skipped the “Saturday Night Live” 50th anniversary special that reunited dozens of the show’s current and former stars at Studio 8H on Sunday.\n\nViewers were surprised the 69-year-old comedian missed the event considering he’s made recent appearances on “SNL” to portray Joe Biden. He was a cast member from 1986 to 1993.\n\nBut the reason for Carvey’s absence was finally revealed on Tuesday.\n\nAccording to Variety, Carvey had a “bad flu” and was too sick to attend the special.\n\nThe Post has reached out to Carvey’s rep for comment.\n\nCarvey returned to the sketch comedy series for the Season 50 premiere in September to deliver an impersonation of Biden, 82. He did a sketch with Maya Rudolph as Kamala Harris.\n\nThe “SNL” legend continued appearing on the NBC variety show before and after the 2024 presidential election.\n\nIn addition to Carvey, fellow alums Bill Hader and Dan Aykroyd also missed the special.\n\nHader’s rep said the actor — who was on the show from 2006 to 2013 — didn’t go because he had a “longstanding scheduling conflict.”\n\nAykroyd, one of the show’s original cast members, had to bow out of the special because of “prior commitments,” his rep confirmed, per Variety.\n\nAykroyd posted about the anniversary special on X two days before it took place.\n\n“Cracking a Head with pride at having been a co-founder of SNL along with everyone we were together with in those four years, five decades ago. This telecast is as historical as the next moon landing. Comedy stars of our age all gathered under the aegis of America’s greatest living impresario, my boss Lorne Michaels. People it’s friggin’ Holy!!” he wrote.\n\nColin Quinn and Dennis Miller, both “Weekend Update” alums, were also missing from the special. Quinn, 65, had a standup show in Raleigh, North Carolina on the same night. Bill Murray gave a shout-out to Quinn in a skit Sunday honoring the best “Weekend Update” hosts.\n\nOther notable “SNL” alums who didn’t appear in the special include Joan Cuscak, Robert Downey Jr., Mary Gross and Chris Redd.\n\nBut pretty much every other alum was there including Carvey’s “Fly on the Wall” podcast partner, David Spade, “Wayne’s World” co-star Mike Myers, as well as Aykroyd’s fellow OG surviving cast members Garrett Morris, Laraine Newman, Jane Curtin and Chevy Chase.\n\nAlums Eddie Murphy, Amy Poehler, Tina Fey, Tracy Morgan, Maya Rudolph, Chris Rock, Adam Sandler, Kate McKinnon, Pete Davidson, Kristen Wiig and Fred Armisen also returned to Studio 8H for the star-studded celebration.\n\nOther stars who participated in the special included Sabrina Carpenter, Kim Kardashian, Tom Hanks, Meryl Streep and Paul McCartney.","summary":"The \"SNL\" legend was absent from the star-studded anniversary celebration at Studio 8H.","url":"https://nypost.com/2025/02/19/entertainment/why-dana-carvey-skipped-snl-50-anniversary-special/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/98803287.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/UJ5WfLY3-RyIcpnTz.mp4","publish_date":"2025-02-19 13:31:53","author":"Eric Todisco","authors":["Eric Todisco"],"language":"en","source_country":"us","sentiment":0.19},{"id":292274726,"title":"Kamala Harris Signs with Top Hollywood Talent Agency CAA","text":"Former Vice President Kamala Harris has now signed with the top Hollywood talent broker Creative Artists Agency (CAA).\n\nCAA announced in a statement on Tuesday that it will represent Harris “in all areas, focusing on speaking engagements and publishing.”\n\n“CAA will work closely with Harris on her post-White House initiatives, creating strategic opportunities that expand her platform in support of the issues she has championed throughout her decades-long career in public service,” the company said.\n\nCAA previously represented Harris when she served as U.S. Senator from California prior to former President Joe Biden selecting her as his vice president. Biden also recently signed a similar agreement with CAA, which represents former President Barack Obama and former first lady Michelle Obama.\n\nAside from running for president again in 2026, Harris has been floated as a potential California gubernatorial candidate after Gavin Newsom leaves in 2026. Per Mercury News:\n\nMost failed presidential candidates never seek any office again — but when they do, they often give the presidency one more try. Hello Trump II. \n“It would be rare for Harris to run for an office other than president,” political analyst and USC professor Dan Schnur said, “but being governor of her home state could potentially be very alluring for her.”\nHarris is only 60 — a relative political youngster — with a house in Brentwood she shares with her husband, Doug Emhoff, that escaped the Los Angeles fires. She’s got a nationwide fundraising juggernaut waiting in the wings and the presumed goodwill, tempered by stinging disappointment, of Democrats in California and across the country who had hoped she would be the one placing her hand on the Bible during the presidential inauguration Monday.\n\nEarlier this month, however, Harris appeared to brush those rumors of a gubernatorial bid aside.\n\n“I have been home for two weeks and three days,” she said. “My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them,”\n\nPaul Roland Bois directed the award-winning Christian tech thriller, EXEMPLUM, which has a 100% Rotten Tomatoes critic rating and can be viewed for FREE on YouTube, Tubi, or Fawesome TV. “Better than Killers of the Flower Moon,” wrote Mark Judge. “You haven’t seen a story like this before,” wrote Christian Toto. A high-quality, ad-free rental can also be streamed on Google Play, Vimeo on Demand, or YouTube Movies. Follow him on X @prolandfilms or Instagram @prolandfilms.","summary":"Former Vice President Kamala Harris has now signed with the top Hollywood talent broker Creative Artists Agency (CAA). \n\n\nThe post Kamala Harris Signs with Top Hollywood Talent Agency CAA appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/02/19/kamala-harris-signs-with-top-hollywood-talent-agency-caa/","image":"https://media.breitbart.com/media/2025/02/KamalaHarris-640x335.jpg","video":null,"publish_date":"2025-02-19 13:12:36","author":"Paul Bois","authors":["Paul Bois"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.043},{"id":292145394,"title":"TP O’Mahony: Church's relationship with democracy has always been inconsistent ","text":"Yes, the emphasis on the dignity of the human person, on human rights and on social solidarity, and the centrality of the common good, had begun with Leo XIII whose 1891 encyclical (which came to be known as the “workers’ charter”) was a response to the appalling conditions experienced by the working classes during the Industrial Revolution. But that came over 40 years after the publication of the Communist Manifesto.\n\nCommunism (and socialism, with which it was too readily conflated) was, for Rome, the great fear -— culminating with the publication in 1937 of Divini Redemptoris, an encyclical addressing specifically “the menace of Communism”. That document urged governments to adopt measures to help the poor, but without endorsing any system of government.\n\nThe anti-democratic position finally changed, so far as wider society is concerned, in the 1960s, with Vatican II (1962-65). “It was in the Council that the Church finally made peace with the liberal democratic state,” according to Anthony Annett of Fordham University in New York.\n\nBut prior to that, Americanism — which actually had its roots in France — was growing Catholic support for the agenda of the Democratic Party, which was agitating for a graduated income tax, the setting up of a social security system, and the enactment of federal welfare programmes.\n\nThis would all culminate in the New Deal — a major programme of social and economic reform introduced by President Franklin D Roosevelt in the 1930s with the aim of aiding the USA’s recovery from the Great Depression (beginning with the 1929 Wall Street crash), and improving the welfare of the poor.\n\nGiven the wrecking ball that the Trump Presidency (under the driving force of Elon Musk’s “shock and awe” attack) has taken to a whole range of federal programmes, and cutbacks to social service schemes including education, the irony is that today Pope Francis would undoubtedly be one of the foremost champions of the ‘Americanism’ his forebear condemned.\n\nThere is, however, a double irony here. On the one hand, aspects of Americanism — despite being condemned as a “heresy” — washed back to Europe and fed progressive ideas into that seminal Second Vatican Council (1962-65). Secondly, the Vatican itself became after the Second World War a promoter of ‘Catholic democracy’.\n\nThis would eventually see a Catholic President in the Oval Office for the first time when John F Kennedy won the 1960 race for the White House. Here at home, it could also be argued that ‘Catholic democracy’ had shaped the contents of and won popular endorsement for Bunreacht na hEireann, the 1937 Constitution.\n\nNow there is a Catholic Vice-President in Washington in the person of JD Vance, and the oleaginous Archbishop of New York, Cardinal Timothy Dolan (a “close friend” of Trump), has sought to assure people that the President “takes his faith seriously”.\n\nPope Francis has already taken the very unusual step of issuing a rebuke of the VP, who converted to Catholicism in 2019. Appearing on Fox News to discuss immigration, Vance defended Trump’s America First border-enforcement policy by invoking ‘ordo amoris’, which he characterised as an “old school” Christian concept of social responsibility.\n\nSome Catholic commentators pushed back against Vance’s superficial understanding of the concept, but more extraordinarily, Pope Francis himself took the time to correct Vance's flawed theology in a pointed letter to the American bishops, while offering a powerful defence of migrants and refugees.\n\nAmerican Catholicism\n\nWhether the pope’s letter has any effect on the occupant of the White House and his lieutenants is very doubtful. According to the Washington Post, 56% of Catholics supported Trump in the 2024 election, compared to 41% for Kamala Harris.\n\n“The biggest question now — for Americans as well as the Vatican — is ‘what kind of democracy will the United States of America become?’,” according to Massimo Faggioli, professor of theology at Villanova University. American Catholicism is changing, said Faggioli, and the Trump presidency may end up ideologically dividing the country’s Catholics “even further”.\n\nIn this context, just days before Trump’s inauguration, the pope transferred Cardinal Robert McElroy from San Diego to Washington DC. He is expected to spearhead an attempt by the American Church to represent a “moral counterexample” to the Trump administration. In this he may not have the support of all 273 bishops in the US hierarchy.\n\nBut for this to be effective, American Catholicism — like Irish Catholicism — will have to rediscover the social gospel; the understanding that the New Testament has very real socio-economic implications. \n\nIn the USA one can point, for example, to the 1933-founded Catholic Worker movement, always associated with Dorothy Day, a socialist and pacifist. In Ireland, it is more a matter of discovering this social gospel in the first place, because there has never been a Catholic Left in this country.\n\n But now, with the fresh challenges posed by the second Trump presidency, the very viability of democracy is about to be stress-tested, especially in a country that loved to boast that it was an essential part of its mission to “export democracy”.\n\nThat stress-test of course — given the rise of the far right in parts of Europe — will by no means be limited to the USA. How the Vatican responds is an important element in the unfolding drama that, thanks to the disruptive effects of the second Trump presidency, could transform the Western world.\n\n TP O'Mahony was Religious Affairs Correspondent of the Irish Examiner","summary":"Pope Francis finds himself defending democracy against Vance's style of American Catholicism — a novel role for an absolute monarch ","url":"https://www.irishexaminer.com/opinion/commentanalysis/arid-41577592.html","image":"https://www.irishexaminer.com/cms_media/module_img/9016/4508269_6_seoimage1x1_a842e386af29490d9e053a444312bea9.jpg.jpg","video":null,"publish_date":"2025-02-19 13:08:00","author":"Irishexaminer.com,Tp O’mahony","authors":["Irishexaminer.com","Tp O’mahony"],"language":"en","source_country":"ie","sentiment":0.141},{"id":292155360,"title":"Joy Behar disagrees with James Carville suggesting Democrats play 'possum' in anti-Trump resistance","text":"\"The View\" co-host Joy Behar disagreed with Democratic strategist James Carville's latest advice for Democrats on Tuesday, as well as her fellow co-hosts, over how the party should counter President Donald Trump. \"I disagree with Carville and I disagree with you because, I do, because I have lived long enough to see that people who do nothing empower the enemy,\" Behar said, responding to her co-host, Sara Haines. The co-hosts referred to Carville, who said the best thing for Democrats to do in protest of Trump and Musk, was \"nothing.\" \"And I believe that Americans, first of all, you can multitask. You can march, and you can do whatever and let them do what they’re doing. You can do both, and the main thing you can do is call your Republican senators and congresspeople and tell them that you’re not happy with what’s going on. You did not vote for this, what they’re doing right now,\" Behar said. ‘THE VIEW’ CO-HOST RAGES AT AMERICA'S NAME: ‘WHY IS IT NAMED AFTER A WHITE MAN?’ Co-host Alyssa Farah Griffin suggested the Democrats decide what really matters, and said members of the party shouldn't make everything a \"five-alarm fire.\" \"David Axelrod got a lot of flack for saying let USAID criticisms go,\" Griffin said. \"It’s intangible to voters. It doesn’t really impact American voters’ lives. If DOGE [is] coming into the Social Security administration, that's where you hold your real fight for.\" Sunny Hostin said she agreed with Carville because she voted for former Vice President Kamala Harris. \"I kind of agree with James Carville because I’m part of the 92% of Black women that voted to save the rest of the country,\" she said. \"But the country wanted something else, and the country is getting something else. So I'm resting.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE As Haines tried to reiterate her point about Democrats coming up with a more strategic response to Trump, Behar complained, \"but Sara, there's an overriding thing, it's called democracy, that is slipping away from us.\" During a discussion with MSNBC's Ari Melber, Carville and the MSNBC host talked about the protests against President Donald Trump and his mass firings of federal employees. \"So the question is, how should Democratic politicians respond to this? And what I think they should do is what we call, in rural America, ‘play possum.' Just let it go,\" Carville said. He continued, \"Don’t get in the way of it. Or as we like to say, don’t just stand there, do nothing. Let this germinate. We don’t need to get in front of it. This freight train is moving. Let’s just get out of the way.\" CLICK HERE TO GET THE FOX NEWS APP Behar, who regularly supports liberal arguments on the show, recently took issue with President Donald Trump's renaming of the Gulf of Mexico to the Gulf of America, and expressed some anger over the fact that America was named after a White man.","summary":"Joy Behar disagreed with Democratic strategist James Carville suggestion that Democratic politicians do &quot;nothing&quot; and urged Americans to call GOP lawmakers.","url":"https://www.foxnews.com/media/joy-behar-disagrees-co-hosts-james-carville-suggesting-democrats-play-possum","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/behar-carville.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 13:00:27","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.176},{"id":292174420,"title":"Activists in Mexico report flow of migrants has 'enormously decreased' one month into Trump admin","text":"Less than a month into the new Trump administration, a migrant shelter along the pathway to the U.S. in Northern Mexico is reporting that the flow of immigrants has \"enormously decreased.\" Commenting on the development, White House deputy press secretary Kush Desai told Fox News Digital that Trump’s immigration policies are working and \"put Americans first.\" The Mexican news outlet Milenio reported on Wednesday that the migratory flow running through the Mexican city of Torreón has \"decreased enormously.\" The outlet pointed out that the decrease \"coincides with the threats of the president of the United States.\" Milenio reported that, according to migrant activists, \"after the deportations, migrants have little by little disappeared from the lagoon landscape due to fear of being detained.\" TRUMP ADMIN REVEALS LIST OF CARTELS AND GANGS TO BE DESIGNATED TERRORIST ORGANIZATIONS María Concepción Martínez Rodríguez, a migrant activist and coordinator of the Jesús Torres Fraire Day Center for Migrants in Torreón, told Milenio that with the border \"so militarized, so difficult,\" many migrants \"don't want to try anymore and they are giving up.\" \"The migratory flow is changing,\" said Martinez Rodriguez. \"If we have eight migrants, there are shelters that don't have a single one.\" Since returning to the Oval Office, President Donald Trump has made good on his campaign promise to crack down on illegal immigration and prioritize border security. Among his many actions, he ordered the resumption of border wall construction, deployed active-duty U.S. service members to the border, significantly increased enforcement and removal operations by Immigration and Customs and Enforcement (ICE) and moved to designate several migrant gangs as foreign terrorist organizations. Customs and Border Protection (CBP) apprehended just 29,116 illegal immigrants along the southern border during the month of January, down from 47,000 in December and hitting a low mark not seen since May 2020, when 32,349 arrests were made at ports of entry, according to a White House press release. FIRST 10 ‘HIGH THREAT’ ILLEGALS TO ARRIVE TO GUANTANAMO BAY ARE ALL TREN DE ARAGUA MEMBERS This week, Trump’s border czar Tom Homan touted the administration’s quick success in cracking down on illegal immigration, saying that, in the last 24 hours, Border Patrol agents had only encountered 229 aliens across the entire southwest border. This is down from the over 11,000 a day during the worst period under the Biden administration. CLICK HERE FOR MORE IMMIGRATION COVERAGE \"I started as a Border Patrol Agent in 1984 and I don’t remember the numbers ever being that low,\" Homan said on X. \"President Trump promised a secure border and he is delivering.\" ICE ARRESTS UNDER PRESIDENT TRUMP CONTINUE IN MIGRANT ‘SANCTUARY’ CITIES Desai told Fox News Digital that in the span of just weeks, Trump has stopped the migrant crisis created during the four years under President Joe Biden and Vice President Kamala Harris. CLICK HERE TO GET THE FOX NEWS APP \"In less than a month, President Trump has already put an end to the dumpster fire that was the Biden border crisis,\" he said. \"After four years of a malfeasant Biden administration, Americans finally have a president who will use every lever of executive power to protect our border, enforce our immigration laws and put Americans first.\" Fox News Digital writer Michael Lee contributed to this report.","summary":"Less than a month into the new Trump administration, a migrant shelter along the pathway to the U.S. in Northern Mexico is reporting that the flow of immigrants has “enormously decreased.&quot;","url":"https://www.foxnews.com/politics/activists-mexico-flow-migrants-enormously-decreased-one-month-trump-admin","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/trump-border.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 13:00:23","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.391},{"id":292143440,"title":"771K Ohioans' health care on the chopping block with GOP Medicaid plans: Capitol Letter","text":"Rotunda Rumblings\n\nMedicaid cuts: About 771,000 Ohioans are at risk of losing their health coverage as Republicans at the state and federal level consider policy changes. Jake Zuckerman writes that Gov. Mike DeWine’s proposed state budget would require the state to back out of Medicaid expansion that started more than a decade ago if the federal government reduces the share it reimburses for the program. Congressional Republicans are considering cuts that, paired with the budget proposal, could kick hundreds of thousands of Ohioans off the rolls of the public health insurance program for low-income earners. \n\nUnexpected allies: Gov. Mike DeWine has a new ally in his fight to get a refundable tax credit for parents. Anna Staver reports that the Center for Christian Virtue has thrown its political weight behind the idea, saying it’s good for families. CCV is making the case that the short-term investment will pay long term dividends. Democrats say the credit is “the best part” of DeWine’s budget and will work with anyone to get it passed. \n\nSmoke up: The state of Ohio and several of its biggest cities clashed in a Franklin County courtroom over tobacco policy. As Zuckerman reports, three judges on an appeals court signaled deep skepticism of the constitutionality of a state law that sought to block several cities from banning flavored tobacco and menthol cigarettes. \n\nShifting gears: The Ohio House Finance Committee on Tuesday made nearly 40 changes to the state transportation budget bill, including another attempt to repeal a state requirement to build a controversial highway interchange between Strongsville and Brunswick. Jeremy Pelzer has more on that, as well as other measures that would allow a private company to issue state specialty license plates, end Ohio’s stalled attempt to offer enhanced driver’s licenses, and loosen a rail-safety measure passed after the 2023 East Palestine train derailment. \n\nPayday: Psychiatrists, judges, nurses, troopers and others are among the 400-plus Ohio state employees who made more money than Gov. Mike DeWine in 2024, according to data from the state’s Ohio Checkbook website. Zachary Smith writes that DeWine last year was paid $172,665, and the only elected officials making more than DeWine were in the judicial branch. Ohio Supreme Court Justice Sharon Kennedy was Ohio’s highest-paid elected official in 2024, earning $209,269.\n\nLayering: An Ohio Senate bill would allow parents of children with autism or other disabilities to layer private school vouchers on top of each other, Laura Hancock reports. Senate Bill 44 would allow recipients of the Jon Peterson Special Needs Scholarship or the Autism Scholarship, which offer a maximum reward of $32,445 to also use the Cleveland or EdChoice scholarships, which offer a maximum reward of up to 6,167 or $8,407, depending on grade level. \n\nAgnus DEI: Walsh Jesuit High School in Cuyahoga Falls has launched an internal investigation after Libs of TikTok, a heavily followed right-wing social-media account, posted that an unnamed school employee belligerently defended a supposed homework assignment on “diversity, equity and inclusion.” As Pelzer reports, the flap attracted the notice of soon-to-be Ohio gubernatorial candidate Vivek Ramaswamy, who posted on X that he hopes “whoever wrote that message gets the mental help & guidance they need.”\n\nParker out: U.S. Attorney for the Southern District of Ohio Ken Parker was “terminated” Tuesday, according to a spokeswoman from that office. Parker, a nominee of President Joe Biden, was the third to oversee the prosecution of ex-Ohio House Speaker Larry Householder. He filed the first federal charges against the corporate executives accused of bribing Householder in the final few days of Biden’s tenure. \n\nNursing legislation: U.S. Rep. Dave Joyce, a South Russell Republican whose wife is a nurse, introduced bipartisan legislation last week that would remove federally imposed barriers in the Medicare and Medicaid programs that block Advanced Practice Registered Nurses (APRNs) from using all the skills they’re approved to use in the state where they practice, Sabrina Eaton writes. APRNs are nurses with advanced degrees who are qualified to treat and diagnose illnesses, advise the public on health issues, manage chronic disease, order and interpret diagnostic tests, prescribe medication, and direct non-pharmacologic treatments for their patients. “As our nation faces a nursing shortage, it is only further hurting America’s healthcare system by prohibiting APRNs from providing patient care to the fullest extent of their education,” said a statement from Joyce, who co-chairs the Congressional Nursing Caucus.\n\nMo’ money: A weapons manufacturer building a state-subsidized facility south of Columbus is getting more public money. The Columbus Dispatch’s Jim Weiker writes that the All Ohio Future Fund will give another $70 million to build a taxiway at Rickenbacker International Airport, which sits near the site where Anduril plans to build a 5-milion-square-foot manufacturing facility. The state already has promised tax incentives and millions of dollars to build infrastructure for the project. \n\nLobbying Lineup\n\nFive organizations that lobbied Gov. Mike DeWine and his administration from September to December 2024, seeking information technology state contracts and other IT procurement opportunities, according to the Joint Legislative Ethics Committee: \n\n1. Accenture LLP\n\n2. Amazon.com Services LLC\n\n3. Google LLC and its affiliates\n\n4. Proofpoint Inc.\n\n5. Workday Inc.\n\nOn the Move\n\nMegan Wycuff has been named the new executive director of the Capitol Square Review and Advisory Board, succeeding the now-retired Laura Battocletti. Wycuff previously served as executive director of the Ohio Channel. \n\nFormer Senate President Larry Obhof was also appointed to CSRAB on Tuesday. \n\nVice President JD Vance will address the conservative CPAC convention on Thursday. \n\nKim Miller, Ohio House 12th floor receptionist\n\nFormer Ohio Supreme Court Justice and current Cuyahoga County Board of Elections member Melody Stewart \n\nStraight from the Source \n\n“Since eggs have doubled to $8 a dozen, can we expect another grocery store rant, JD?” \n\n-U.S. Rep. Shontel Brown, a Warrensville Heights Democrat, on X, calling out the vice president for the rising price of eggs. Brown’s post showed an earlier Vance post on X when he and Donald Trump were running that blamed Joe Biden and Kamala Harris for eggs increasing from $1.50 to $4 a carton. \n\nCapitol Letter is a daily briefing providing succinct, timely information for those who care deeply about the decisions made by state government. Subscribe to get Capitol Letter in your email box each weekday for free.","summary":"State and federal Republicans made reduce Medicaid.","url":"https://www.cleveland.com/open/2025/02/771k-ohioans-health-care-on-the-chopping-block-with-gop-medicaid-plans-capitol-letter.html","image":"https://www.cleveland.com/resizer/v2/NU52BP3BBRA6DMJV57DB2IP2HA.jpg?auth=3515f028125a2d00851ac9b24fd065bb0361e46bbe09f3169e863e1a31f9fc90&width=1280&quality=90","video":null,"publish_date":"2025-02-19 13:00:00","author":"Laura Hancock","authors":["Laura Hancock"],"language":"en","source_country":"US","sentiment":0.244},{"id":292117664,"title":"‘Needs to stop’: Musk, Trump speak out","text":"The pair of billionaires spoke to Fox News opinion host Sean Hannity, in their first joint appearance since Mr Musk popped up in the Oval Office for a press conference with one of his children last week.\n\n“All we’re really trying to do here is restore the will of the people, through the President,” Mr Musk argued.\n\n“And what we’re finding is that there’s an unelected bureaucracy, a vast bureaucracy, that is implacably opposed to the President and the cabinet.”\n\nMr Musk went on to cite the voting record of Washington D.C., which like most national capitals leans overwhelmingly to the left. Last year 90 per cent of its voters went for Kamala Harris, and 6 per cent supported Mr Trump.\n\n“Ninety-two per cent. I think about that number a lot,” said Mr Musk. (He got the number he apparently thinks about a lot slightly wrong, but the gist of it was correct.)\n\n“If the will of the President is not implemented, and the President is representative of the people, then that means the will of the people is not being implemented. And that means we don’t live in a democracy. We live in a bureaucracy.”\n\nThe American political system is split into three branches: executive (the President and the departments under him), legislative (Congress) and judicial (the courts). Theoretically the three branches are coequal, which means no one branch is more powerful than the others. They were designed this way so each branch could be a check on its fellows’ power.\n\nThat’s at the heart of the discourse and legal challenges concerning Mr Musk and his DOGE team’s efforts to cut government spending. Does DOGE actually have the power to implement these wide-ranging cuts? Or is it illegally usurping the power of Congress, which has already appropriated the funds in question, and is given the power to set federal spending levels under the US Constitution?\n\nThe courts have yet to deliver anything like a definitive answer.\n\n“The President will make these executive orders, which are very sensible and good for the country, but then they don’t get implemented,” Mr Musk said, voicing his frustration.\n\nHe cited the example of an order intended to end funding for “high-end hotels for illegals”. This is funding Mr Musk had previously characterised as being “meant for American disaster relief”, though that much wasn’t true. He was right about the money being used to house migrants awaiting their immigration hearings.\n\n“We went in there, we said, ‘This is a violation of a presidential order. It needs to stop.’ So what we’re doing here, one of the biggest functions of the DOGE team, is just making sure that the presidential executive orders are actually carried out,” he said.\n\nThis goes back to the same legal question. Congress passed legislation allocating the funds in question. They were used in a way that conformed with the legislation. Mr Musk’s supposition is that he, wielding the authority of the executive branch, can unilaterally withdraw the cash.\n\n“Winning the election is really the opportunity to fix the system,” he told Mr Hannity.\n\n“It’s not fixing the system itself. It’s the opportunity to fix the system, and to restore the power of democracy.\n\n“It’s funny how often, when these attacks occur, the things they’re accusing the administration of are the things they’re guilty of. They are saying that things are unconstitutional, but what they are doing is unconstitutional.”\n\n“It’s always the first thing they do,” Mr Trump agreed.\n\n“It’s just a con job. It’s a big con job.”\n\n“Yeah,” said Mr Hannity.\n\nMusk addresses Twitter’s $10 million payment to Trump\n\nMr Hannity brought up Twitter’s recent announcement of a settlement with Mr Trump, worth a tidy sum of $US10 million.\n\n“He’s working for free with DOGE. He’s kind of put a lot of his life on hold. And you sued Twitter a number of years ago. You just made him pay you $10 million,” Mr Hannity told the President.\n\n“That’s right. That’s right. Well, I sued from long before he had it,” Mr Trump clarified.\n\n“They really did a number on me. I sued, and they had to pay.”\n\nMr Trump sued Twitter for suspending his account after the Capitol riot on January 6, 2021, when a mob of the then-president’s supporters stormed Congress in an effort to stop his defeat to Joe Biden from being certified.\n\nMultiple social media platforms suspended Mr Trump for, in their view, inciting the violence with his lies about voter fraud in the 2020 election, and his months-long attempts to overturn the people’s will.\n\nIn addition to Twitter, the President also sued Facebook, which recently gave him $25 million – even though both lawsuits seemed doomed to fail in court.\n\n“You’re OK with that?” Mr Hannity asked Mr Musk, referring to the Twitter settlement.\n\n“I left it up to the lawyers, and the team running Twitter. I said, ‘You guys do what you think makes sense,’” Mr Musk replied.\n\nMr Trump was full of praise for Mr Musk during the interview.\n\n“I wanted to find somebody smarter than him. I searched all over. I just couldn’t do it,” Mr Trump said.\n\n“I couldn’t find anyone smarter. For the country. So we settled on this guy.”\n\n“Well thanks for having me. I’m just trying to be useful here,” Mr Musk quipped.\n\nAt another point, Mr Hannity brought up a pair of astronauts who remain stranded on the International Space Station. They’re due to be brought back to Earth by a SpaceX capsule either this or next month.\n\n“At the President’s request, or instruction, we are accelerating the return of the astronauts, which was postponed to a ridiculous degree.” Mr Musk said.“They got left in space,” Mr Trump added.\n\n“Yes. They were left up there for political reasons, which is not good,” said Mr Musk.\n\nWe should note that the astronauts themselves, Sunita Williams and Butch Wilmore, have said this is false.\n\n“We don’t feel abandoned. We don’t feel stuck. I understand why others may think that,” Mr Wilmore said recently.\n\nFinally, Mr Trump and Mr Musk repeated their previous suggestion that the latter will be allowed to self-police any conflicts of interest that arise as part of his government work.\n\nMr Musk’s companies have benefited – and continue to benefit – from billions of dollars in government contracts and subsidies, issued by the agencies over which he now wields power. Some of them are also under government investigation.\n\n“What if there is a contract he would otherwise get?” Mr Hannity asked, posing a hypothetical (though plausible) scenario in which Mr Musk would be allowed to choose whether or not to give one of his own companies government money.\n\n“Then we won’t let him do it. We’re not going to let him do it,” said Mr Trump.\n\n“If he’s got a conflict. I mean look, he’s in certain areas.”\n\nHe cited the electric vehicle industry as an example where Mr Musk was acting against his own interests.\n\n“I’ll recuse myself if there is a conflict,” Mr Musk insisted.","summary":"In a joint interview, Elon Musk and Donald Trump were asked to address awkward questions about the billionaire.","url":"https://www.news.com.au/world/north-america/us-politics/needs-to-stop-elon-musk-and-donald-trump-speak-out-in-joint-interview-with-fox-news/news-story/a43b2cf4cb4b3372ef277ab26215bef6?from=rss-basic","image":"https://content.api.news/v3/images/bin/f6a7ec497e48e6e3c6c5dc7299d03b3f","video":null,"publish_date":"2025-02-19 12:06:20","author":"Samuel Clench","authors":["Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.359},{"id":292135730,"title":"Stephen A. Smith denies plans to run for president in 2028 but says 'Kamala Harris better not'","text":"Sports commentator Stephen A. Smith rejected the idea of running for president, arguing the suggestion only took off because Democrats are so desperate to find a new leader to rally around. The ESPN host addressed the chatter on his podcast Monday, declaring, \"I wanted to put this to bed once and for all… I have no intentions of running for the President of the United States of America.\" While he cited multiple reasons he would not run, he nonetheless hedged by saying that if \"I knew that I had a really, really good shot to win, I can’t deny it’s something I would consider.\" \"Let me tell y’all something, if you’re the Democrats,\" he said. \"That is why Stephen A. Smith is in the news – because y’all don’t have anybody. \"Who you got? Who you got? Kamala Harris better not run. She better not run. She’s not going to win the presidency in 2028! Keep in mind- respect for her. I’m not going to disrespect the former Vice President of the United States. I will never do that, but we gotta be real about something here.\" NEW DNC VICE CHAIR SETS SOCIAL MEDIA ABLAZE AFTER 'RADICAL' POSTS EXPOSED: 'LEARNED ABSOLUTELY NOTHING' \"When she ran for election on her own, she couldn’t make it to Iowa in 2020. She ultimately positions herself [and] gets the vice presidency,\" he continued. \"They win the election in 2020. Joe Biden is feeling himself after the liberals won the midterms. And instead of being a transitional president like he promised, the man backstabbed the liberal party and turned around and said, ‘I’m staying.’ They wanted him out.\" Smith then slammed the entire process of the Democratic Party having Biden run again without a primary, and the hasty process by which he was replaced with Harris. \"Who else you got? [House Minority Leader] Hakeem Jeffries?\" he asked. \"I personally support Wes Moore, the governor of Maryland, but I don’t know how much of a national figure he is. I already interviewed [Pennsylvania governor] Josh Shapiro.\" He went on to condemn America’s current political system, where people have to pick between Democrats and Republicans, as a \"joke.\" Smith also specifically noted that he had told Democrats to beat Trump fair and square rather than use legal battles: \"One of the reasons I think he won, because he was saying, ‘You can’t beat me! You’re using this to get help because you can't beat me on your own!’\" The host then spoke about how liberal donors have pulled away from Democrats, either out of fear of retaliation from Trump or frustration with the Democratic Party’s current state of disarray. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Smith offered an olive branch to Republicans, inviting them to appear on his show and declaring, \"I’m not one-sided. See, this is why my name is in the election.\" \"I’m not in the news because I’m here!\" he said while making a gesture with his hand up high. \"I’m in the news because the Democratic Party is here,\" he continued, gesturing down so low his hand went off-camera. \"Dammit, lower than that. Down to the bottom. They suck right now. Horrible. Because they don’t have a voice. Where the hell is the voice?\" \"That’s why Stephen A. Smith is a candidate,\" Smith said as he blasted the Democratic Party for lacking a national messenger. \"Who the hell told y’all I’d wanna be a Democrat? I have conservative ideas. I believe in free market capitalism. I believe in patrolling our borders. I believe in strong national security.\" Nonetheless, he admitted, \"But you are right, I’d probably be a Democrat… a moderate. A centrist leaning left. I’m about that Bill Clinton-Newt Gingrich agreement. I’m about that surplus when Clinton walked out of office. I’m about Obama deporting more than Trump did, but the American public didn’t notice.\" CLICK HERE TO GET THE FOX NEWS APP \"That’s why I’m [considered] a candidate,\" he said. \"The sad part is that I’d still beat any Democrat out there right now, because who the hell is resonating with the American people?\" \"I have no interest in getting involved moreso than punditry and commentary, but you better hope I stay feeling that way.\"","summary":"Sports commentator Stephen A. Smith argued that people are speculating about whether he will run for office because they are desperate for new Democratic Party leader.","url":"https://www.foxnews.com/media/stephen-a-smith-denies-plans-run-president-2028-says-kamala-harris-better-not","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/04/931/523/Stephen-A-Smith.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-19 11:30:05","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.419},{"id":292107128,"title":"Kamala Harris signs with major Hollywood agency months after failed presidential bid: report","text":"Former Vice President Kamala Harris has signed with a Hollywood talent agency, according to reports.\n\nVariety first reported Harris’ alleged partnership with Creative Artists Agency (CAA) on Tuesday.\n\nThe outlet wrote that CAA will “work closely with Harris on her post-White House initiatives, creating strategic opportunities that expand her platform in support of the issues she has championed throughout decades-long career in public service.”\n\nHarris will join former President Joe Biden, whose CAA deal was announced just two weeks ago. Biden was also represented by the agency before entering the White House.\n\nAnnouncing Biden’s re-affiliation with the agency on Feb. 3, CAA co-chairman Richard Lovett called him one of “America’s most respected and influential voices in national and global affairs.”\n\n“His lifelong commitment to public service is one of unity, optimism, dignity, and possibility,” Lovett’s statement read. “We are profoundly honored to partner with him again.”\n\nDuring his partnership with CAA, Biden released his memoir “Promise Me, Dad” in 2017, as well as traveled across the country on his post-vice presidency “American Promise” speaking tour.\n\nIn terms of Harris’s post-vice presidency, she has kept a relatively low profile since leaving office on Jan. 20. Over the weekend, she was spotted in New York City, where she attended Broadway shows.\n\nThe Democrat was recently mocked online for a “word salad” speech she delivered to the performers of “A Wonderful World: The Louis Armstrong Musical” during her trip to the Big Apple.\n\n“Where there’s a vacancy, let’s fill it. Let us know that the reality is that the progress of our nation has been about the expansion of rights, not the restriction of rights,” Harris said. “We’re seeing a U-turn right now. For those rights to be maintained, which means we have to be vigilant. It’s just the nature of it.”\n\nFOX Business reached out to CAA for confirmation.\n\nFox News Digital’s Joseph Wulfsohn and Louis Casiano contributed to this report.","summary":"Harris will join former President Joe Biden, whose CAA deal was announced just two weeks ago. Biden was also represented by the agency before entering the White House.","url":"https://nypost.com/2025/02/19/us-news/harris-signs-with-caa-talent-agency-weeks-after-biden/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/02/newspress-collage-ov3gly5n0-1739960183401.jpg?quality=75&strip=all&1739942225&w=1200","video":"https://cdn.jwplayer.com/videos/lNVlSpiE-RyIcpnTz.mp4","publish_date":"2025-02-19 11:29:59","author":"Fox Business","authors":["Fox Business"],"language":"en","source_country":"us","sentiment":0.392},{"id":292127730,"title":"Trump's approval rating slips as Americans worry about the economy","text":"U.S. President Donald Trump's approval rating has ticked slightly lower in recent days as more Americans worried about the direction of the U.S. economy as the new leader threatens a host of countries with tariffs, a Reuters/Ipsos poll found. The six-day poll, which closed on Tuesday, showed 44% of respondents approved of the job Trump is doing as president, down from 45% in a Reuters/Ipsos poll conducted January 24-26. Trump's approval rating stood at 47% in a January 20-21 poll conducted in the hours after the Republican's return to the White House. The share of Americans who disapprove of his presidency has risen more substantially, to 51% in the latest poll, compared with 41% right after he took office. Trump enjoys a relatively high rate of approval on his immigration policy, with 47% of respondents backing his approach that has included promises to ramp up deportations of migrants in the country illegally. The share was little changed from January. But the share of Americans who think the economy is on the wrong track rose to 53% in the latest poll from 43% in the January 24-26 poll. Public approval of Trump's economic stewardship fell to 39% from 43% in the prior poll. A pillar of Trump's political strength has been public belief that his policies will be good for the economy, and his rating on the economy remains significantly higher than the final readings of his predecessor in office, Democrat Joe Biden, who ended his term with a 34% approval rating on the economy. But Trump's rating for the economy is well below the 53% he had in Reuters/Ipsos polling conducted in February 2017, the first full month of his first term as U.S. president. In the latest poll, only 32% of respondents approved of Trump's performance on inflation, a potential early sign of disappointment in the Republican's performance on a core economic issue after several years of rising prices weakened Biden ahead of last year's presidential election. Trump defeated Biden's vice president, Kamala Harris, in the Electoral College and narrowly won the popular vote. A recent report from the U.S. Labor Department showed consumer prices rose by the most in nearly 1-1/2 years in January, with Americans facing higher costs for a range of goods and services. Other economic data has shown U.S. households expect inflation to pick up following Trump's February 1 announcements for steep tariffs on imports from China, Mexico and Canada. While the levies on Mexico and Canada were since delayed until March, Trump has set March 12 as the start date for other tariffs on imported steel and aluminum and he has directed his staff to devise global reciprocal tariffs. Fifty-four percent of respondents in the latest Reuters/Ipsos poll said they opposed new tariffs on imported goods from other countries, while 41% were in favor of them. Increasing tariffs on Chinese goods had higher levels of support, with 49% in favor and 47% against. The Reuters/Ipsos poll, which was conducted online, surveyed 4,145 U.S. adults nationwide and had a margin of error of about 2 percentage points in either direction.","summary":"President Trump's approval rating has slightly decreased amid rising concerns about the U.S. economy and new tariff threats. His immigration policies maintain stable support, but economic approval has dipped, with 53% of Americans believing the economy is on the wrong track. The recent tariffs and inflation reports have influenced public sentiment.","url":"https://economictimes.indiatimes.com/news/international/world-news/trumps-approval-rating-slips-as-americans-worry-about-the-economy/articleshow/118387453.cms","image":"https://img.etimg.com/thumb/msid-118387500,resizemode-4,width-1200,height-900,imgsize-94334,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-19 11:22:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.159},{"id":292175480,"title":"Trump's approval rating slips as Americans worry about the economy","text":"The share of Americans who disapprove of his presidency has risen more substantially, to 51% in the latest poll, compared with 41% right after he took office.\n\nTrump enjoys a relatively high rate of approval on his immigration policy, with 47% of respondents backing his approach that has included promises to ramp up deportations of migrants in the country illegally. The share was little changed from January.\n\nBut the share of Americans who think the economy is on the wrong track rose to 53% in the latest poll from 43% in the January 24-26 poll. Public approval of Trump's economic stewardship fell to 39% from 43% in the prior poll.\n\nA pillar of Trump's political strength has been public belief that his policies will be good for the economy, and his rating on the economy remains significantly higher than the final readings of his predecessor in office, Democrat Joe Biden, who ended his term with a 34% approval rating on the economy. But Trump's rating for the economy is well below the 53% he had in Reuters/Ipsos polling conducted in February 2017, the first full month of his first term as U.S. president.\n\nIn the latest poll, only 32% of respondents approved of Trump's performance on inflation, a potential early sign of disappointment in the Republican's performance on a core economic issue after several years of rising prices weakened Biden ahead of last year's presidential election. Trump defeated Biden's vice president, Kamala Harris, in the Electoral College and narrowly won the popular vote.\n\nA recent report from the U.S. Labor Department showed consumer prices rose by the most in nearly 1-1/2 years in January, with Americans facing higher costs for a range of goods and services. Other economic data has shown U.S. households expect inflation to pick up following Trump's February 1 announcements for steep tariffs on imports from China, Mexico and Canada.\n\nWhile the levies on Mexico and Canada were since delayed until March, Trump has set March 12 as the start date for other tariffs on imported steel and aluminum and he has directed his staff to devise global reciprocal tariffs.\n\nFifty-four percent of respondents in the latest Reuters/Ipsos poll said they opposed new tariffs on imported goods from other countries, while 41% were in favor of them. Increasing tariffs on Chinese goods had higher levels of support, with 49% in favor and 47% against.\n\nThe Reuters/Ipsos poll, which was conducted online, surveyed 4,145 U.S. adults nationwide and had a margin of error of about 2 percentage points in either direction.\n\n(Reporting by Jason Lange; Editing by Scott Malone and Deepa Babington)","url":"https://www.yahoo.com/news/trumps-approval-rating-slips-americans-110203457.html","image":"https://s.yimg.com/ny/api/res/1.2/lS9alR_39xGsUQfEu2oScw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjk-/https://media.zenfs.com/en/reuters.com/62f68a352c608e52f62dbfb2e97f61b9","video":null,"publish_date":"2025-02-19 11:02:03","author":"Jason Lange","authors":["Jason Lange"],"language":"en","category":"politics","source_country":"us","sentiment":-0.031},{"id":292097072,"title":"Trump Wants Romania To Ease Travel Restrictions On Andrew Tate: Report","text":"Controversial social media personality Andrew Tate appears to have found an unlikely ally, arguably the most powerful man in the world. US President Donald Trump is reportedly pushing Romania to lift travel restrictions on Tate, who is facing charges of human trafficking and sexual harassment from multiple women, Financial Times reported.Tate has been a strong Trump supporter for a while. Before the 2024 US election, he encouraged his followers on X to vote for the 78-year-old Republican. With over 10 million followers, he frequently praised Trump, saying, \"All Trump does is win\" and that those who oppose him should be expelled from the country.Tate has also compared himself to Trump, pointing out that both have faced sex crime accusations and criticism over old recordings. This likely refers to Trump's past sexual misconduct allegations and his controversial leaked Access Hollywood tape.Andrew Tate, who has been charged with rape and human trafficking, has used sexist and offensive language to support the US President. In one post, he said Trump's victory kept \"evil war-mongering she witches\" out of office. He has also used homophobic slurs and insults against former Vice President Kamala Harris's supporters.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Some of Trump's close allies have shown support for Andrew Tate, a world-champion kickboxer and reality television personality. Trump's son, Donald Trump Jr, said that Tate's detention in Romania was \"absolute insanity.\"Tesla CEO Elon Musk also interacted with Tate on X last month. When the influencer talked about wanting to be the Prime Minister of the UK, Musk agreed with his views on UK politics, saying they were \"not wrong,\" as per Forbes.Last week, Vice President JD Vance criticised the Romanian government, accusing them of suppressing free speech by cancelling an election result that was believed to be influenced by Russia.Andrew Tate, who shot to fame from the UK version of 'Big Brother', has since amassed an impressive fan base on YouTube, Instagram, and X.Last month, Tate's house detention order was revoked by a Romanian court and replaced with a less stringent preventative measure while a criminal investigation was underway.","summary":"Controversial social media personality Andrew Tate appears to have found an unlikely ally, arguably the most powerful man in the world.","url":"https://www.ndtv.com/world-news/donald-trump-wants-romania-to-ease-travel-restrictions-on-andrew-tate-report-7744937","image":"https://c.ndtvimg.com/2022-12/jnj4n0ag_andrew-tate_625x300_31_December_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-02-19 11:02:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.106},{"id":292202260,"title":"CNN Lefties Panic Like NATO is Dead, Beware 'Trump Abandoning Europe'","text":"On today's CNN This Morning, there was scant support for President Trump's comments yesterday on Ukraine, in which he arguably blamed Ukraine for Russia's invasion. The leftists are acting stunned that Trump wants Europe to carry more of its own weight on defense....when that's exactly what Trump said in his first term! \n\nNew York Times podcaster Lulu Garcia-Navarro acted like NATO was being dissolved or something. \n\nGARCIA-NAVARRO: Are we looking at a complete change in who our traditional allies are? This is the question that I keep on asking myself. Who are America's allies now? When you are praising Vladimir Putin and you are offending Canada, the European Union, Panama. \n\nJIM SCIUTTO: Denmark over Greenland.\n\nGARCIA-NAVARRO: Yeah. This becomes the broader question of who is the United States actually allying themselves with? And what does that actually mean for our security in the world? \n\nSciutto claimed \"that this was not just Europe worrying about Trump abandoning Ukraine. It's Europe worried about Trump abandoning Europe.\" Lulu and Jim prefer more of a global socialist Davos-buddy alliance, where everyone agrees about climate and wokeness.\n\nJonah Goldberg of The Dispatch said that while Trump has a \"goldfish's memory\" of history, he subscribes to a 19th-century notion of spheres of influence. \"He thinks NATO is basically a protection racket or a country club, and they're not paying enough dues to him. They're not kicking up to the boss enough. But he sees Xi and Putin as basically rival crime families, and they deserve respect because they are equal strongmen.\"\n\nGoldberg even claimed Trump's view is \"They get Taiwan, they get Ukraine, we get Panama.\"\n\nThis was not a new schtick for Jim Sciutto, who's filling in this week for Kasie Hunt. In 2020, he tossed pro-Biden softballs at Gen. Michael Hayden: \"What happens to U.S. Alliances such as the NATO alliance in a second Trump term?\" Hayden argued: “If it's a second term, I think we will be alone. We will not have any friends at all.”\n\nSciutto also leveled a loaded question today at Republican strategist Kristen Soltis Anderson: \"Do Republican voters like to see the U.S. President endorsing Kremlin talking points?\"\n\nAnderson answered with a flat \"no.\" But she went on to make the point that Americans, including even Democrats, are beginning to wonder what the end-game is in Ukraine. Thus Republicans are willing to grant Trump some \"leeway\" in how he handles the matter.\n\nOne thing the panel didn't mention was Zelensky having said that Putin is \"scared' of Trump, and that Trump can thus force him to negotiate.\nIf Kamala Harris had won, odds Zelensky would have said that Putin was scared of her? About the same as Free Lutheran Bible College winning the NCAA basketball championship.\n\nHere's the transcript.\n\nCNN This Morning\n\nLULU GARCIA-NAVARRO: I mean, there's, I think, a wider issue here about what is Donald Trump's foreign policy? What are we looking at here? Are we looking at a complete change in who our traditional allies are? This is the question that I keep on asking myself. Who are America's allies now? When you are praising Vladimir Putin and you are offending Canada, the European Union, Panama. \n\nJIM SCIUTTO: Denmark over Greenland.\n\nGARCIA-NAVARRO: Yeah. This becomes the broader question of who is the United States actually allying themselves with? And what does that actually mean for our security in the world? \n\nSCIUTTO: I mean, that is the thing that, Jonah, that came out of Munich, right, is that this was not just Europe worrying about Trump abandoning Ukraine. It's Europe worried about Trump abandoning Europe. And by the way, saying so, in so many words: Europe, it's up to you right now. Which was the worry prior to the election. I heard it frequently, and now this is the reality they're dealing with. \n\nJONAH GOLDBERG: Yeah, I want to be real clear. I think that Donald Trump has a goldfish's memory of historical, you know, stuff. But he is very similar to a 19th-century imperial leader. That when you talk about his allies, I think he goes from, he subscribes organically, instinctually, to a 19th-century notion of spheres of influence, where we're the boss of the Americas and Western Europe, and we can boss them around, and we can treat our allies as really like underlings, because this is our zone. Putin has his zone. He's another strong man. Xi has his zone. \n\nAnd that's one of the things that helps explain why Trump likes to talk, why he heaps praise on dictators and adversaries while heaping scorn on friends, is that he thinks our friends are actually subordinates.\n\nSCIUTTO: Right.\n\nGOLDBERG: He thinks NATO is basically a protection racket or a country club, and they're not paying enough dues to him. They're not kicking up to the boss enough. \n\nBut he sees Xi and Putin as basically rival crime families, and they deserve respect because they are equal strongmen. \n\nSCIUTTO: And perhaps a recognition of their own spheres of influence and the U.S. then ceding them, which would be --\n\nGOLDBERG: They get Taiwan, they get Ukraine, we get Panama. \n\nSCIUTTO: It would be a dramatic upset of what had been bipartisan U.S. policy and approach to the world for 80 years, right? Going back to World War II.","summary":"On today's CNN This Morning, there was scant support for President Trump's comments yesterday on Ukraine, in which he arguably blamed Ukraine for Russia's invasion. The leftists are acting stunned that Trump wants Europe to carry more of its own weight on defense....when that's exactly what Trump said in his first term! \n\nNew York Times podcaster Lulu Garcia-Navarro acted like NATO was being dissolved or something. \n\n\nGARCIA-NAVARRO: Are we looking at a complete change in who our traditional allies are? This is the question that I keep on asking myself. Who are America's allies now? When you are praising Vladimir Putin and you are offending Canada, the European Union, Panama. \n\nJIM SCIUTTO: Denmark over Greenland.\n\nGARCIA-NAVARRO: Yeah. This becomes the broader question of who is the United States actually allying themselves with? And what does that actually mean for our security in the world? \n\n\nSciutto claimed \"that this was not just Europe worrying about Trump abandoning Ukraine. It's Europe worried about ","url":"https://www.newsbusters.org/blogs/nb/mark-finkelstein/2025/02/19/cnn-lefties-panic-nato-dead-beware-trump-abandoning-europe","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-02/CNN%20This%20Morning-6_20_49%20am-2025-02-19-0.jpg?itok=dk9J_m_F","video":null,"publish_date":"2025-02-19 11:01:00","author":"Mark Finkelstein","authors":["Mark Finkelstein"],"language":"en","source_country":"US","sentiment":-0.311},{"id":292101136,"title":"B.J. Novak Supports Mindy Kaling at Her Hollywood Walk of Fame Ceremony, Plus Brenda Song, Macaulay Culkin & More","text":"Milestone Moment \n\n B.J. Novak supports longtime friend Mindy Kaling at her Hollywood Walk of Fame star ceremony on Feb. 18 in Hollywood.\n\n Star Power \n\n Brenda Song and Macaulay Culkin step out together to support Mindy Kaling at her Hollywood Walk of Fame star ceremony on Tuesday in Hollywood.\n\n In Character \n\n Ethan Slater is on set with Carrie Preston while filming Elsbeth in New York City on Feb. 18.\n\n Race to the Finish \n\n Machine Gun Kelly attends F1 75 Live at The O2 Arena in London on Feb. 18.\n\n Royal Greeting \n\n Queen Camilla chats with Andrew Garfield during a reception for staff, actors and supporters of the National Theatre at Buckingham Palace in London on Feb. 18.\n\n Pedal to the Metal \n\n Sporting his red Scuderia Ferrari uniform, Lewis Hamilton waves to the crowd during F1 75 Live at The O2 Arena in London on Feb. 18.\n\n Power Duo \n\n Sabrina Ionescu and Naomi Osaka attend the Boardroom x Coinbase brunch hosted by Rich Kleiman and Kevin Durant at Terrene at 1 Hotel San Francisco on Feb. 15.\n\n Need for Speed \n\n Patrick Schwarzenegger throws on a pair of Brooks Running shoes for a run in Bangkok, Thailand on Feb. 14.\n\n Rolling Along \n\n Christian Bale hops a ride on a bike in L.A. on Feb. 17.\n\n Puppy Love \n\n Margaret Qualley holds tight to a four-legged companion at the 75th Berlinale on Feb. 18 in Berlin.\n\n Jetsetter \n\n Ariana Grande flashes a smile as she touches down in Tokyo on Feb. 18.\n\n Making the Rounds \n\n Keke Palmer is radiant at the 7th annual American Black Film Festival Honors at the SLS Hotel in L.A on Feb. 17.\n\n Music Man \n\n Shaboozey attends the Jeff Hamilton x Billionaire Boys Club All-Star after party at The Hibernia in San Francisco on Feb. 16.\n\n Surprise Visitor \n\n Kamala Harris poses backstage with Audra McDonald following a performance of Gypsy on Broadway this weekend.\n\n Going Green \n\n Yvette Nicole Brown poses at the 7th annual American Black Film Festival Honors on Feb. 17 at SLS Hotel in L.A.\n\n Under the Sea \n\n Toni Collette wears a pink sea creature themed gown for the premiere of Mickey 17 on Feb. 16 in Paris.\n\n Personal Style \n\n Tika Sumpter opts for a plunging neckline at the 7th annual American Black Film Festival Honors at the SLS Hotel in L.A. on Feb. 17.\n\n By Your Side \n\n Sunrise Coigney and Mark Ruffalo attend the premiere of Mickey 17 hand-in-hand on Feb. 16 in Paris.\n\n Pretty in Pink \n\n Rose Byrne opts for a monochrome look at the photocall for If I Had Legs I'd Kick You photocall at the 75th Berlinale on Feb. 17 in Berlin.\n\n Like Mother, Like Daughter \n\n Marla Gibbs is accompanied by her daughter Angela Elayne Gibbs for the 7th annual American Black Film Festival Honors at the SLS Hotel in L.A. on Feb. 17.\n\n All in the Details \n\n Kelly Rutherford rocks dazzling jewelry at the BAFTA 2025 Don Julio winners party on Feb. 16 in London.\n\n Dapper Dude \n\n Sans his usual facial hair, Aaron Pierre hits the red carpet at the attends the American Black Film Festival Honors at SLS Hotel in L.A. on Feb. 17 in L.A.\n\n To the Nines \n\n Anthony Mackie and Giancarlo Esposito pose together at the American Black Film Festival Honors at the SLS Hotel on Feb. 17 in L.A.\n\n On the Move \n\n Kaia Gerber throws on a cap and a jean jacket while out and about in L.A. on Feb. 16.\n\n Something to Celebrate \n\n Ethan Hawke sports a checkered shirt as he attends the 75th Berlinale on Feb. 18 in Berlin.\n\n On the Town \n\n Camila Cabello steps out for the British Vogue x GQ BAFTA party in London on Feb. 17.\n\n Signature Smile \n\n Andrew Scott smiles during a photocall for Blue Moon during the 75th Berlinale at Grand Hyatt Hotel in Berlin on Feb. 18.\n\n Golden Girl \n\n Keke Palmer tosses her hair for the perfect shot at the SNL50: The Anniversary Special afterparty in New York City on Feb. 17.\n\n Afterparty Vibes \n\n Adam Sandler and Rob Schneider are in their best black tie attire at the SNL50: The Anniversary Special afterparty in New York City on Feb. 17.\n\n What a Jewel \n\n Cynthia Erivo smiles from ear to ear at British Vogue and GQ's Celebration of Fashion and Film with Tiffany & Co. in London on Feb. 16.\n\n Premiere Queen \n\n Glen Powell heads around London in a loose tie and dress shirt after a BAFTAs party on Feb. 16.\n\n Houndstooth and Hats \n\n Jason Momoa wears a quirky hat and an eye-catching trench coat around East Village in New York City on Feb. 17.\n\n Patterns and Plates \n\n Mary Bronstein and Rose Byrne rock their own styles at the If I Had Legs I'd Kick You premiere at the 75th Berlinale International Film Festival in Berlin on Feb. 17.\n\n Pretty in Pink \n\n Jessica Chastain sparkles in a pink gown with feathers around her arms at the Dreams premiere during the 75th Berlinale International Film Festival in Berlin on Feb. 15.\n\n Champion's Mentality \n\n PlayersTV investor Chris Paul honors HCBU students at the inaugural OwnersFest and Honors in San Francisco on Feb. 16.\n\n Beat of His Own Strum \n\n Noah Kahan performs at the NBA on TNT American Express All-Star Celebration at Pier 48 in San Francisco on Feb. 15.\n\n Old Souls \n\n Sabrina Carpenter and Paul Simon sing a special rendition of \"Homeward Bound\" for SNL50 on Feb. 16 in New York City.\n\n Crowd Favorite \n\n Timothée Chalamet holds onto Kylie Jenner's hand at their seats during the 2025 BAFTAs in London on Feb. 16.\n\n Oscar Sandwich \n\n Meryl Streep, Amy Schumer and Emma Stone — who has popcorn in her dress and hands — hang out at SNL50: The Anniversary Special in N.Y.C. on Feb. 16.\n\n Rare Red Carpet \n\n Ryan Reynolds and Blake Lively have a date night at SNL50: The Anniversary Special in New York City on Feb. 16.\n\n Man of the Hour \n\n Prince Harry speaks at the closing ceremony of the 2025 Invictus Games in Vancouver on Feb. 16.\n\n To Another 50 Years! \n\n For the \"Debbie Downer: Bar\" sketch during SNL50 in N.Y.C., Ayo Edebiri, Drew Barrymore, Jimmy Fallon, Robert De Niro and Rachel Dratch raise a glass on Feb. 16.\n\n Serve in Silver \n\n Kim Kardashian shines in a skintight silver gown at SNL50 in New York City on Feb. 16.\n\n Good Romance \n\n Lady Gaga kisses her fiancé Michael Polansky on the red carpet of SNL50 in New York City on Feb. 16.\n\n Year 2025 \n\n Bowen Yang and Nick Jonas look dapper in their suits at SNL50 in New York City on Feb. 16.\n\n Funny Man \n\n Also at SNL50 in New York City, former cast member John Mulaney arrives in a tuxedo on Feb. 16.\n\n Music's Best \n\n Halsey and Bad Bunny are all business in a suit and tie at SNL50 in New York City on Feb. 16.\n\n Hello, Hello \n\n Pedro Pascal waves as he walks the SNL50 red carpet in New York City on Feb. 16.\n\n For Pete's Sake \n\n Pete Davidson wears shades on the red carpet of SNL50: The Anniversary Special in New York City on Feb. 16.\n\n Take a Bow-tie \n\n Lin-Manuel Miranda and Paul Rudd sport a black bowtie at SNL50 in New York City on Feb. 16.\n\n Eyes Only for Her \n\n Colin Jost beams next to his wife Scarlett Johansson at SNL50 in New York City on Feb. 16.\n\n Date Night \n\n Engaged couple Jonathan Scott and Zooey Deschanel have the cutest height difference at SNL50 in New York City on Feb. 16.\n\n Men in Black \n\n Stephen Colbert, Tom Hanks, Kevin Nealon and Chris Parnell buddy up for a photo at SNL50: The Anniversary Special in N.Y.C. on Feb. 16.\n\n Do You Believe in Life with Love \n\n Cher brings her boyfriend Alexander Edwards to SNL50: The Anniversary Special in N.Y.C. on Feb. 16.\n\n Angels Like Them \n\n Miley Cyrus and her boyfriend Maxx Morando are attached at the hip at SNL50: The Anniversary Special in New York City on Feb. 16.\n\n Easy Glamour \n\n Pamela Anderson looks radiant in a white gown at the 2025 BAFTAs in London on Feb. 16.\n\n Ladies of 'Avatar' \n\n Avatar costars Kate Winslet and Zoe Saldaña reunite at the BAFTAs' champagne reception in London on Feb. 16.\n\n Good in Green \n\n Vanessa Williams rocks a green look for the 2025 BAFTAs in London on Feb. 16.\n\n Mother-Daughter Night \n\n Demi Moore and Scout Willis spend quality time together at the Netflix BAFTA afterparty in London on Feb. 16.\n\n Happy Couple \n\n Steph Curry and Ayesha Curry get dressed up for the Toast to Milestones afterparty in San Francisco on Feb. 16.\n\n 'Frozen' Forever \n\n Idina Menzel and Kristen Bell have a Frozen reunion backstage at the new musical Redwood in New York City on Feb. 16.\n\n Master Songwriters \n\n Diane Warren and Richie Sambora attend a screening of Diane Warren: Relentless in North Hollywood, California, on Feb. 16.\n\n Car Connoisseur \n\n Jay Leno hosts his Goats Only Garage Experience in Burbank, California, on Feb. 16.\n\n Show of Support \n\n Coldplay's Chris Martin meets Joey Fatone backstage at & Juliet on Feb. 15 in New York City.\n\n Emerald Earrings! \n\n Cynthia Erivo shows off her white Louis Vuitton statement dress and Tiffany & Co. jewelry at the 2025 BAFTA Awards at the Royal Festival Hall in London on Feb. 16.\n\n Red Carpet Smile \n\n Selena Gomez arrives at the 2025 BAFTAs at the Royal Festival Hall in London on Feb. 16.\n\n 50th Anniversary of ‘SNL’ \n\n Tina Fey attends the live SNL50: The Anniversary Special show at Rockefeller Center in New York City on Feb. 16.\n\n Social Justice Advocates \n\n Scott Budnick, Caron Butler, Common, James Cadogan, Mannone Butler and Lemon Andersen pose backstage at JUMP: A Celebration of Sports, Entertainment and Social Justice in partnership with Larry Miller at the San Francisco Design Center during NBA All-Star weekend on Feb. 15.\n\n Bundled Up \n\n Addison Rae takes a stroll in the East Village neighborhood in New York City on Feb. 15.\n\n Jessica Chastain snaps a selfie with a fan while attending the Dreams premiere at the 75th Berlinale International Film Festival at Berlinale Palast in Berlin on Feb. 15.\n\n All Smiles \n\n Mark Hamill smiles wide as he attends the 2025 EE BAFTA Film Awards Nominees' Party at the National Portrait Gallery in London on Feb. 15.\n\n Jubilant Jeff \n\n Jeff Goldblum looks dapper as he attends the Charles Finch & Chanel Pre-BAFTA Dinner in London on Feb. 15.\n\n Glittery Gal \n\n Marisa Tomei looks elegant in a glittery top as she attends the Charles Finch & Chanel Pre-BAFTA Dinner in London on Feb. 15.\n\n BAFTAs Buddies \n\n Glen Powell, Adrien Brody and Sebastian Stan pal around while attending the Charles Finch & Chanel Pre-BAFTA Dinner in London on Feb. 15.\n\n Diva Moment \n\n Lauryn Hill is seen at a party hosted by Lorne Michaels to celebrate Saturday Night Live's 50th anniversary in New York City on Feb. 15.\n\n Pet Parents \n\n Joe Manganiello and Caitlin O'Connor pose with dog Bubbles while attending the 29th Art Directors Guild Awards in Los Angeles on Feb. 15.\n\n Proud Presenter \n\n Kiernan Shipka speaks onstage during the 2025 Writers Guild Awards at The Beverly Hilton in Los Angeles on Feb. 15.\n\n Strike a Pose \n\n Lisa Ann Walter has fun on the red carpet of the 2025 Writers Guild Awards at The Beverly Hilton in Los Angeles on Feb. 15.\n\n Funny Girl \n\n Rachael Harris gives her best Glinda from Wicked impression as she attends the 29th Art Directors Guild Awards in Los Angeles on Feb. 15.\n\n Sultry Style \n\n Camila Cabello poses for the cameras in a vintage Roberto Cavalli gown while attending the Nominees' Party for the 2025 EE BAFTA Film Awards at the National Gallery in London on Feb. 15.\n\n Cozying Up \n\n Anya Taylor-Joy and husband Malcolm McRae bundle up and display some PDA on a morning stroll in N.Y.C on Feb. 15.\n\n A Family Affair \n\n Scout Willis embraces mom Demi Moore at the Nominees' Party for the 2025 EE BAFTA Film Awards at the National Gallery in London on Feb. 15.\n\n Bottoms Up! \n\n Jeannie Mai celebrates Lunar New Year with Tequila Don Julio 1942 'Year of the Snake Edition' at a private celebration in Los Angeles on Feb. 12.\n\n Sounding Good \n\n Kevin Durant, Carmelo Anthony, Quavo, Boardroom CEO Rich Kleiman and Bose CMO Jim Mollica pose after the Boardroom Talks with Bose event at International Smoke in San Francisco during NBA All-Star weekend on Feb. 14.\n\n Saturday Night Live Celebration \n\n Miley Cyrus belts it out while performing onstage at the SNL 50: The Homecoming Concert at Radio City Music Hall in New York City on Feb. 14.\n\n Fan Favorite \n\n Timothée Chalamet greets fans while attending the 75th Berlin International Film Festival in Germany on Feb. 14.\n\n Special Honor \n\n Oprah Winfrey presents Colman Domingo with the Montecito Award during the 40th Santa Barbara International Film Festival on Feb. 14 in California.\n\n Valentine's Date Night \n\n Kyra Sedgwick and Kevin Bacon put on a loved-up display while attending the SNL 50: The Homecoming Concert at Radio City Music Hall on Feb. 14 n New York City. \n\n Film Discussion \n\n Robert Pattinson attends the Mickey 17 press conference at the Berlin International Film Festival on Feb. 15.\n\n Glamorous Arrival \n\n Anya Taylor-Joy stuns in an all-white look with a furry coat on arrival at the SNL 50: The Homecoming Concert in New York City on Feb. 14.\n\n Dance it Out! \n\n Kylie Minogue takes to the stage for her energetic performance at RAC Arena in Perth, Australia, on Feb. 15.\n\n Day of Love \n\n Rebecca Gayheart beams as she leaves a Valentine's Day lunch with a bunch of roses under her arm on Feb. 14 in Los Angeles.\n\n Looking Strong \n\n Captain America: Brave New World director Julius Onah joins stars Anthony Mackie and Danny Ramirez at the movie’s screening in New York City on Feb. 13.\n\n Sweet Valentine \n\n Adria Arjona and Jason Momoa spend Valentine's Day together having a sweet stroll in New York City on Feb. 14.\n\n Pretty in Pink \n\n Timothée Chalamet wears Valentine’s Day pink and carries a rose at the Berlinale International Film Festival in Berlin on Feb. 14. \n\n Seeing Double \n\n Naomi Ackie looks ready to double up with Robert Pattinson at the Mickey 17 premiere on Feb. 13 in London.\n\n Environmentally Friendly \n\n Pedro Pascal carries a reusable tote bag while leaving a hotel in New York City on Feb. 14. \n\n Fashionable Duo \n\n Evan Ross and Ashlee Simpson attend Gap X Harlem's Fashion Row All-Star Launch event on Feb. 13 in San Fransico.\n\n Chiwetel Ejiofor and Renée Zellweger visit the SiriusXM Studios in New York City on Feb. 14 to talk about the newest Bridget Jones film.\n\n Time for Dinner \n\n Summer House’s Carl Radke joined PEOPLE and Hellmann’s for a special Galentine’s screening of When Harry Met Sally complete with sandwiches from Katz’s deli in New York City on Feb 13.\n\n Rainy Day Fit \n\n Monica Barbaro wears a trench coat while out and about in New York City's Soho neighborhood on Feb. 13.\n\n Lighting Up the Stage \n\n Paramore's Hayley Williams joins FINNEAS for his first tour stop on Feb. 13 in Nashville, Tennessee.\n\n Back in Black \n\n Lady Gaga shows off her gothic aesthetic while arriving at Radio City Music Hall in New York City on Feb. 14.\n\n Memorable Menswear \n\n Joe Alwyn, Rege-Jean Page and Will Sharpe wear their best outfits to the British GQ Excellence in Film event on Feb. 14 in London.\n\n Monochromatic Looks \n\n Nicole Brydon Bloom and Justin Theroux attend the Los Angeles premiere of Netflix's Running Point on Feb. 13.\n\n Staying Poised \n\n Dale Moss attends The Cinema Society and Martini & Rossi Captain America Screening afterparty in New York City on Feb. 13.\n\n Locked Eyes \n\n Bridgerton costars Yerin Ha and Luke Thompson lock eyes on Feb. 14 at the \"Bridgerton: Season Of Love\" Q&A and dinner in London.\n\n Fan Favorite \n\n Steven Yeun takes a selfie with a fan at the Mickey 17 premiere in London on Feb. 13.\n\n Fun in the Snow \n\n Robin Thicke and Roxy Earle attend the Aspen Snow Ball Gala 2025 in Aspen, Colorado on Feb. 8.\n\n Beach Vibes \n\n JT attends Cosmopolitan's inaugural Love Ball in partnership with Bumble and The Standar, High Line on Feb. 13 in New York City.\n\n Royal Greeting \n\n King Charles and Queen Camilla greet the public during a visit to Middlesbrough, England on Feb. 13.\n\n Triple Threat \n\n Max Greenfield, Mindy Kaling and Brenda Song smile together at the premiere of Running Point at The Egyptian Theatre in L.A. on Feb. 13.\n\n Go Birds! \n\n Bradley Cooper reps a brand-new Philadelphia Eagles varsity jacket commemorating their recent Super Bowl win while out in New York City on Feb. 13.\n\n Sweet Embrace \n\n Justin Long, Kate Bosworth and Melanie Lynskey snuggle up at the season 3 premiere of Yellowjackets at Chateau Marmont in L.A. on Feb. 13.\n\n Milestone Moment \n\n On the heels of his Broadway debut, Jimmy Fallon poses with his caricature at Sardi's in New York City on Feb. 13.\n\n Time to Chat \n\n Jon Hamm is all dressed up for his appearance on Late Night with Seth Meyers on Feb. 12 in New York City.\n\n Theater Star \n\n Jackie Sandler, Adam Sandler and Amy Poehler celebrate Idina Menzel backstage at the opening night of Redwood on Broadway in New York City on Feb. 13.\n\n Back in Black \n\n Lady Gaga steps out in a chic winter look in N.Y.C.\n\n Victory Tour \n\n Saquon Barkley signs autographs for Eagles fans following his Super Bowl win at Raising Cane's on Feb. 13 in Trevose, Pennsylvania.\n\n In the Hot Seat \n\n Renée Zellweger makes an appearance on The Tonight Show Starring Jimmy Fallon on Feb. 13 in New York City.","summary":"From Hollywood to New York and everywhere in between, see what your favorite stars are up to","url":"https://people.com/star-tracks-wednesday-february-19-2025-new-celebrity-photos-updated-daily-11682065","image":"https://people.com/thmb/P0hsLo50-DHE3T2GGGXL0u3uufk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(739x182:741x184)/Mindy-Kaling-B.-J.-Novak-021825-d8cb4e8570c244d1a8b78e8862a38034.jpg","video":null,"publish_date":"2025-02-19 11:00:00","author":"Alexandra Schonfeld,Brendan Le,Colson Thayer,Escher Walcott,Justine Fisher,Stephanie Sengwe,Toria Sheffield","authors":["Alexandra Schonfeld","Brendan Le","Colson Thayer","Escher Walcott","Justine Fisher","Stephanie Sengwe","Toria Sheffield"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.725},{"id":292140182,"title":"Column: For California's attorney general, the fight against Trump is personal","text":"In all of California, there may be no better political launching pad than the office of attorney general. As the state's top cop as well as its chief consumer advocate, the attorney general resides in an electoral sweet spot; California voters tend to be tough on crime and jealous of their civil protections. Several who've held the job, including Jerry Brown and his father, Pat, made the leap directly to the governorship. Kamala Harris parlayed the role into a U.S. Senate seat and, eventually, the vice presidency. (Part of the reason she was chosen by Joe Biden was Harris' relationship with his late son, Beau, who overlapped for a time as Delaware attorney general.) The current officeholder, Rob Bonta, appeared well positioned for a 2026 bid for California governor, until he took himself out of the running and announced he would instead seek reelection. Being attorney general, Bonta said recently over breakfast in San Francisco, is \"powerful and ... meaningful on normal days. And in abnormal days, when you have a president who's threatening democracy, the rule of law and the Constitution, it's very important.\" Bonta, who's been a party to several lawsuits seeking to rein in Trump, said the fight against his rogue-elephant administration is, in some ways, personal. He spoke of his father's involvement in the civil rights movement and his parents' life under dictatorship in the Philippines. He mentioned his eldest of two daughters, who married a woman from Brazil, and expressed concern whether same-sex marriage will remain legal in the United States. But first, Bonta talked about his decision to forgo the race for governor after giving the campaign long and careful thought. He began weighing the contest, Bonta said, soon after winning election to a full term as attorney general in November 2022. (Bonta was appointed by Gov. Gavin Newsom in March 2021, to fill the vacancy left when Xavier Becerra become Health and Human Services secretary in the Biden administration.) Birds fly. Fish swim. Politicians, as Bonta put it, \"look downfield, at what's immediately next.\" With Newsom termed out and a rare open-seat race for governor availing itself, Bonta suggested it would have been political malpractice not to consider running. He conducted polls. He discussed staffing and fundraising. He thought about what his message might be and sized up other candidates, and potential candidates. Things changed when Harris lost the White House — and not just because of the possibility she could enter the governor's race and immediately become the heavy favorite to win. If Harris was in the White House, Bonta said, the state would have had \"a great partner who loves California, who knows what our concerns and needs are.\" It would have been, he said, \"very attractive to be a governor working hand-in-hand with a president who works for the success of California to tackle our problems.\" Instead, the country has a would-be autocrat, with a Mt. Whitney-size grudge against California, seeking to establish himself as King Donald the First. Once it was clear \"what his [approach] was and the actions that he would take would be and what my critical role in addressing those is,\" Bonta said, \"I wanted to stay\" as attorney general. A waitress came and went. Bonta, who intermittently fasts and tries not to eat before noon, was sticking to black coffee. There is, he said, a circular nature to his legal battle with Trump and his work to thwart the wayward president's unprecedented power grab. Bonta was born in the Philippines, his mother's country, while she and Bonta's father, a Ventura County native, were serving as missionaries. \"They had to make a very important decision, probably the most important decision ever made in my life,\" said Bonta, who arrived in California as a 2-month-old. \"They asked themselves if they could raise me in the Philippines and guarantee that I had the things that were nonnegotiable for them: freedom, democracy, human rights, civil rights, the rule of law, due process. And their answer was, No.\" (As the child of a U.S. citizen, Bonta was automatically a U.S. citizen, thus he has no personal stake in the effort to block Trump's attempt to overturn birthright citizenship.) Bonta, who was first elected to the Alameda City Council before moving onto the state Assembly and appointment as attorney general, said his political career was inspired by his father's role as a voting rights organizer in the South and his parents' work helping unionize California farmworkers. Funny thing: \"I didn't expect that decades later I'd be in public office, fighting the rise of a dictator in a country that I came to to flee a dictator,\" Bonta said. Two other issues strike home. Bonta's daughter Reina is a soccer pro who met her wife when they played together in Brazil. Two months after a proposal, they had a hurry-up ceremony in Alameda, wanting to ensure they were wed before Trump took office. \"Who knows the future of marriage equality?\" Bonta said. He also wonders whether his daughter-in-law might someday be excluded from the United States. Trump \"is willing to keep people out who used to be part of a very lawful asylum program. Some who worked side-by-side with American forces in other countries,\" Bonta said. \"It's an attack, seemingly, on 'others,' however that's defined .... It's often, unfortunately, defined as if you're Black or brown or you're not of European descent.\" From breakfast, Bonta headed to the California State Building in San Francisco, for a hearing on judicial appointees. Apart from burying the Trump administration in litigation, there's plenty to keep Bonta busy on top of his regular workload. He also has a reelection campaign to run; while a second full term seems likely, it's not guaranteed. And he didn't foreclose a future bid for governor, keeping the possibility propped open with this rhetorical doorstop: \"Never say never.\" At age 52, Bonta has plenty of opportunity ahead of him. And in Trump he has, for now, the perfect foil to pad his political resume.","summary":"Rob Bonta's parents fled a dictatorship and now he fears one is coming to America. He says battling the Trump administration in court is more important than running for governor in 2026.","url":"https://www.latimes.com/politics/story/2025-02-19/trump-bonta-california-2026-governors-race-attorney-general","image":"https://ca-times.brightspotcdn.com/dims4/default/f77e523/2147483647/strip/true/crop/2984x1567+0+390/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6d%2F2e%2F24e3dc304d44a2f7afae5165496a%2F1162432-me-rob-bonta","video":null,"publish_date":"2025-02-19 11:00:00","author":"Mark Z. Barabak","authors":["Mark Z. Barabak"],"language":"en","category":"politics","source_country":"us","sentiment":0.079}]}