{"offset":0,"number":50,"available":515,"news":[{"id":303750204,"title":"Democrats fight to gain footholds in Florida as GOP concerns rise over fundraising","text":"However, a surge in fundraising from the two Democrats seeking to fill seats left vacant by House Republicans is an early sign that the GOP may have a difficult time holding on to its razor-thin majority heading into the next two years of elections — even in red states such as Florida.\n\nNext Tuesday, special elections will be held to fill the seats of former Rep. Matt Gaetz (R-FL) in the 1st District and national security adviser Mike Waltz in the 6th District. Though projected to remain in GOP hands, the seats are becoming increasingly competitive thanks to Democrats outraising Republicans by several million dollars.\n\nJosh Weil, a teacher and the Democratic nominee for Waltz’s district, has raised at least $9.5 million. Gay Valimont, the Democratic candidate to succeed Gaetz, disclosed raising $6.5 million total in Federal Election Commission filings last week.\n\nComparatively, 1st District GOP nominee Jimmy Patronis, the chief financial officer of Florida, and 6th District GOP nominee Randy Fine, a state senator, have raised a combined $3.1 million.\n\nThe level of GOP fundraising, or lack thereof, is catching the attention of Republican congressional campaign leaders.\n\nNational Republican Congressional Committee Chairman Richard Hudson (R-NC) admitted to reporters that the numbers were not looking good for Fine on Monday but insisted the seat would stay in GOP hands.\n\n“He needs to do better,” Hudson said. “But we’re going to win that seat. I would have preferred if our candidate had raised money at a faster rate and gotten on TV quicker. But he’s doing what he needs to do.”\n\nHouse Democrats are also taking note of the fundraising levels. House Minority Leader Hakeem Jeffries (D-NY), who contributed to Weil and Valimont’s campaigns, said the large expenditures for the Democrats in Florida’s 1st and 6th districts prove Americans are turning away from the Republican agenda.\n\n“These are races that should not, under ordinary circumstances, be on anyone’s political radar,” Jeffries said at his weekly press conference on Monday. “They are safe Republican seats…[but] the American people are not buying what the Republicans are selling. That is why they are on the run.”\n\nJeffries pointed to Democrats overperforming in several special elections since President Donald Trump took office on Jan. 20, including flipping a state Senate seat in Iowa that voted for Trump by 21 points in 2024.\n\nCompared to other battleground states, Florida was not a significant electoral target in the 2024 election. Trump beat Democratic former Vice President Kamala Harris by 13 percentage points, and Waltz and Gaetz won their reelection races by more than 30 percentage points each. At the state level, every legislative race was targeted by Democrats except for one captured by Republicans last November. \n\nThe last time Democrats experienced a chance to keep Florida purple was in 2018 when Nelson sought to keep his seat. He ultimately lost to now-Sen. Rick Scott (R-FL). Democrat Andrew Gillum also narrowly lost to Gov. Ron DeSantis (R-FL) that year. DeSantis soundly defeated former Gov. Charlie Crist in 2022 — largely thanks to Latinos trending more Republican and allowing him to flip Miami-Dade County for the first time in years.\n\nBoth Republicans in the special election have Trump’s endorsement, which carries weight in the deep-red districts. However, in Patronis’s case, he has had to do something Gaetz rarely needed to do — pay for advertising in a general election, according to the Pensacola News Journal. Early turnout data for the 1st District show Republicans with only a 4.9-point advantage in the race as of last week.\n\nPatronis traveled to the White House on Monday for Greek Independence Day celebrations, and Trump offered words of support for the Republican candidate. \n\n“You got to win that one, but they got to get out and vote, right, Jimmy? But you’re doing great,” the president said.\n\nRepublicans are particularly concerned with the state of things in the 6th District. Trump reminded voters of his support for Fine on social media last week. Fine amplified the post and reminded followers they “need to make sure no one takes this for granted.”\n\nDefend American Jobs, a cryptocurrency-aligned super PAC, is spending $1.5 million boosting the two Republican candidates. Most of the ad spending, around $1.2 million, is supporting Fine, according to the Washington Post.\n\nTrump and Republicans are counting on wins from Fine and Patronis as they navigate a small majority and, particularly, as they seek to codify the president’s agenda through a process called budget reconciliation. Due to vacancies and recent deaths, House Speaker Mike Johnson (R-LA) cannot afford to lose more than two Republicans as he tries to pass contentious legislation along party lines. \n\nRep. Elise Stefanik’s (R-NY) nomination as U.N. ambassador is finally set to move forward on April 2 after months of delay due to the small House margins, one day after the special elections in Florida. The special election to fill Stefanik’s seat will come after she resigns her seat, though the exact date is unclear amid concerns that Gov. Kathy Hochul (D-NY) would seek to delay the contest. Her 21st District is reliably red and expected to stay in GOP hands.","summary":"Two Florida congressional races once considered unworthy of national attention are turning heads as Democrats pour millions of dollars into the contests in hopes of establishing purple footholds in the Sunshine State for the first time in years. Florida, once a purple state, has trended Republican in recent years. Though the state voted for former [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3357631/democrats-footholds-florida-special-congressional-elections/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/MixCollage-28-Jan-2025-08-22-PM-4145.webp","video":null,"publish_date":"2025-03-24 23:46:33","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.185},{"id":303723940,"title":"Alleged Snowflake hacker agrees to be extradited to the US","text":"Connor Moucka, accused of stealing large amounts of customer data from companies that used Snowflake’s cloud storage services, has agreed to be extradited to the US to face charges, Cyberscoop reports. Around 165 companies were affected by the Snowflake breaches, including AT&T and Ticketmaster.\nAlexander “Connor” Moucka, who was arrested in Canada on October 30th at the request of the US government, agreed to the extradition in writing before a judge in the Superior Court of Justice in Kitchener last Friday, waiving Canada’s requirement for a 30-day waiting period.\nMoucka is facing 20 federal charges that include violations of the Computer Fraud and Abuse Act. He and his alleged co-conspirator, John Binns, are accused of collecting around $2.5 million worth of ransom from victims.\nA US soldier was previously arrested in December in connection with the Snowflake breaches, and was reported by KrebsOnSecurity to have seemingly posted hacked call logs for both Kamala Harris and Donald Trump, who were presidential candidates at the time.\nLast May, Ticketmaster’s parent company Live Nation, which used Snowflake’s services, confirmed that the data of 560 million users were being sold on hacking websites. AT&T, Santander Bank, Advanced Auto Parts, and Lending Tree subsidiary Quote Wizard later also confirmed that millions of customers were affected by these breaches.","summary":"Connor Moucka, accused of stealing large amounts of customer data from companies that used Snowflake’s cloud storage services, has agreed to be extradited to the US to face charges, Cyberscoop reports. Around 165 companies were affected by the Snowflake breaches, including AT&#38;T and Ticketmaster. Alexander “Connor” Moucka, who was arrested in Canada on October 30th [&#8230;]","url":"https://www.theverge.com/news/635044/conner-moucka-snowflake-breach-us-extradition","image":"https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/VRG_Illo_STK001_B_Sala_Hacker.jpg.webp?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200","video":null,"publish_date":"2025-03-24 21:39:05","author":"Umar Shakir","authors":["Umar Shakir"],"language":"en","source_country":"us","sentiment":-0.32},{"id":303727422,"title":"George Clooney, Donald Trump and Press Freedom: All you may want to know","text":"George Clooney spoke about government interference in journalism during a ‘60 Minutes’ interview. He warned about efforts to limit press freedom and emphasized the role of journalists in holding power accountable. Clooney also defended his public statements on Joe Biden’s leadership. Donald Trump criticized Clooney’s remarks on social media.Clooney’s Warning on Press FreedomClooney discussed his role in Broadway's ‘Good Night and Good Luck.’ The play is based on a film he directed in 2005, which depicts journalist Edward R. Murrow’s conflict with Senator Joseph McCarthy in the 1950s. Clooney said that when other branches of government fail, the press must take responsibility.He stated that governments have always opposed press freedom. He said that this applies to both conservative and liberal administrations. Clooney pointed out recent lawsuits by Donald Trump against major news outlets. He said these actions are part of a pattern to limit journalism.Also Read: Trump administration’s shocking blunder: Secret war plans against Houthis accidentally leaked in unprecedented security breach raising alarmClooney Highlights Challenges for JournalistsClooney explained that journalism requires active effort to challenge those in power. He mentioned struggles at The Los Angeles Times and The Washington Post as examples of current pressures on the media. He compared journalistic integrity to a battle that requires dedication.He emphasized that reporters must be willing to face opposition. Clooney said that efforts to silence journalists through legal and financial means must be resisted.Trump Criticizes Clooney’s StatementsTrump responded to Clooney’s interview on Truth Social. He dismissed the segment as biased and attacked Clooney’s career. He accused Clooney of failing as a political analyst and criticized his support for Joe Biden.Trump referenced Clooney’s past endorsement of Biden. He claimed that Clooney later abandoned Biden after a debate performance. Trump also suggested that Clooney had pushed for Kamala Harris to take Biden’s place but later changed his stance.Also Read: Donald Trump fires fresh tariff salvo, targets countries that purchase oil, gas from VenezuelaClooney Stands by His Opinion on BidenClooney has supported the Democratic Party for years. He previously wrote an open letter urging Biden to step aside. During the interview, he stood by his statements. He said he felt an obligation to be honest about Biden’s capabilities.Clooney recalled seeing Biden at a fundraiser and said he was concerned about his mental sharpness. He expressed disappointment in some members of his party for avoiding the issue. He stated that he believed in telling the truth, regardless of political consequences.FAQsWhy did George Clooney criticize government interference in journalism?Clooney believes governments try to control the press. He pointed out lawsuits against news organizations and pressures on journalists as examples of efforts to restrict media freedom.How did Donald Trump react to George Clooney’s interview?Trump dismissed Clooney’s interview as biased. He criticized Clooney’s political involvement and accused him of switching support from Joe Biden to Kamala Harris.","summary":"George Clooney discussed government interference in journalism during a ‘60 Minutes’ interview. He highlighted the importance of the press and criticized actions restricting media freedom. He also defended his stance on Joe Biden’s leadership. Donald Trump reacted negatively, calling the interview biased and attacking Clooney’s political involvement.","url":"https://economictimes.indiatimes.com/news/international/us/george-clooney-donald-trump-and-press-freedom-all-you-may-want-to-know/articleshow/119443250.cms","image":"https://img.etimg.com/thumb/msid-119443302,resizemode-4,width-1200,height-900,imgsize-80260,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-24 21:25:35","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":0.006},{"id":303720950,"title":"White House investigating after U.S. officials text war plans to journalist","text":"Top national security officials for U.S. President Donald Trump, including his defense secretary, texted war plans for upcoming military strikes in Yemen to a group chat in a secure messaging app that included the editor-in-chief for The Atlantic, the magazine reported in a story posted online Monday. The National Security Council said the text chain “appears to be authentic.”\n\nTrump told reporters he was not aware that the sensitive information had been shared, 2 1/2 hours after it was reported.\n\nThe material in the text chain “contained operational details of forthcoming strikes on Iran-backed Houthi-rebels in Yemen, including information about targets, weapons the U.S. would be deploying, and attack sequencing,” editor-in-chief Jeffrey Goldberg reported.\n\nIt was not immediately clear if the specifics of the military operation were classified, but they often are and at the least are kept secure to protect service members and operational security. The U.S. has conducted airstrikes against the Houthis since the militant group began targeting commercial and military vessels in the Red Sea in November 2023.\n\nJust two hours after Goldberg received the details of the attack on March 15, the U.S. began launching a series of airstrikes against Houthi targets in Yemen.\n\nThe National Security Council said in a statement that it was looking into how a journalist’s number was added to the chain in the Signal group chat.\n\nTrump told reporters, “I don’t know anything about it. You’re telling me about it for the first time.” He added that The Atlantic was “not much of a magazine.”\n\nGovernment officials have used Signal for organizational correspondence, but it is not classified and can be hacked. Privacy and tech experts say the popular end-to-end encrypted messaging and voice call app is more secure than conventional texting.\n\nThe sharing of sensitive information comes as Defense Secretary Pete Hegseth’s office has just announced a crackdown on leaks of sensitive information, including the potential use of polygraphs on defense personnel to determine how reporters have received information.\n\nSean Parnell, a spokesman for Hegseth, did not immediately respond to requests for comment on why the defense secretary posted war operational plans on an unclassified app.\n\nThe breach in protocol was swiftly condemned by Democratic lawmakers. Senate Democratic leader Chuck Schumer called for a full investigation.\n\n“This is one of the most stunning breaches of military intelligence I have read about in a very, very long time,” Schumer, a New York Democrat, said in a floor speech Monday afternoon.\n\n“If true, this story represents one of the most egregious failures of operational security and common sense I have ever seen,” said Sen. Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, in a statement.\n\nHe said American lives are “on the line. The carelessness shown by Trump’s Cabinet is stunning and dangerous. I will be seeking answers from the Administration immediately.”\n\nRep. Jim Himes of Connecticut, the top Democrat on the House Intelligence Committee, said in a statement that he was “horrified” by the reports.\n\nHimes said if a lower-ranking official “did what is described here, they would likely lose their clearance and be subject to criminal investigation. The American people deserve answers,” which he said he planned to get at Wednesday’s previously scheduled committee hearing.\n\nSenate Majority Leader John Thune said he wants to learn more about what happened.\n\n“Obviously, we’ve got to run it to the ground, figure out what went on there,” said Thune, a South Dakota Republican.\n\nThe handling of national defense information is strictly governed by law under the century-old Espionage Act, including provisions that make it a crime to remove such information from its “proper place of custody” even through an act of gross negligence.\n\nThe Justice Department in 2015 and 2016 investigated whether former Secretary of State Hillary Clinton broke the law by communicating about classified information with her aides on a private email server she set up, though the FBI ultimately recommended against charges and none were brought.\n\nIn the Biden administration, some officials were given permission to download Signal on their White House-issued phones, but were instructed to use the app sparingly, according to a former national security official who served in the Democratic administration.\n\nThe official, who requested anonymity to speak about methods used to share sensitive information, said Signal was most commonly used to communicate what they internally referred to as “tippers” to notify someone when they were away from the office or traveling overseas that they should check their “high side” inbox for a classified message.\n\nThe app was sometimes also used by officials during the Biden administration to communicate about scheduling of sensitive meetings or classified phone calls when they were outside the office, the official said.\n\nThe use of Signal became more prevalent during the last year of the Biden administration after federal law enforcement officials warned that China and Iran were hacking the White House as well as officials in the first Trump administration, according to the official.\n\nThe official was unaware of top Biden administration officials — such as Vice President Kamala Harris, Defense Secretary Lloyd Austin and national security adviser Jake Sullivan — using Signal to discuss sensitive plans as the Trump administration officials did.\n\nSome of the toughest criticism targeted Hegseth, a former Fox News Channel weekend host. Sen. Tammy Duckworth, an Iraq War veteran, said on social media that Hegseth, “the most unqualified Secretary of Defense in history, is demonstrating his incompetence by literally leaking classified war plans in the group chat.”\n\nAP writers Stephen Groves and Lisa Mascaro contributed reporting.","summary":"The Atlantic's editor-in chief said he was texted war plans for upcoming military strikes in Yemen in a secure Signal group chat that included the U.S. defense secretary.","url":"https://globalnews.ca/news/11095887/trump-war-plans-text-journalist-hegseth-yemen/","image":"https://globalnews.ca/wp-content/uploads/2025/03/CP174325946-e1742850489194.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-03-24 21:18:12","author":"Globalnews Digital,The Associated Press","authors":["Globalnews Digital","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.293},{"id":303723944,"title":"Trump officials texted war plans to a group chat in a secure app that included journalist","text":"Top national security officials for US President Donald Trump, including his defence secretary, texted war plans for coming military strikes in Yemen to a group chat in a secure messaging app that included the editor-in-chief for The Atlantic, the magazine reported in a story posted online on Monday.\nThe National Security Council said the text chain “appears to be authentic”.\nThe material in the text chain “contained operational details of forthcoming strikes on Iran-backed Houthi-rebels in Yemen, including information about targets, weapons the US would be deploying, and attack sequencing”, editor-in-chief Jeffrey Goldberg reported.\nIt was not immediately clear if the specifics of the military operation were classified, but they often are and at the very least are kept secure to protect service members and operational security.\nThe National Security Council said in a statement that it was looking into how a journalist’s number was added to the chain in the Signal chain, which included Tulsi Gabbard, Trump’s director of national intelligence, and Secretary of State Marco Rubio. Goldberg said he received the Signal invitation from Mike Waltz, Trump’s national security adviser, who was also in the group chat.\nThe US has conducted air strikes against the Houthis since the militant group began targeting commercial and military vessels in the Red Sea in November 2023.\nJust two hours after Goldberg received the details of the attack on March 15, the US began launching a series of air strikes against Houthi targets in Yemen.\n\nTrump told reporters he was not aware of the apparent breach in protocol.\n“I know nothing about it,” Trump said, adding that The Atlantic was “not much of a magazine”. He went on to say: “I don’t know anything about it. You’re telling me about it for the first time.”\n“President Trump continues to have the utmost confidence in his national security team, including National Security Adviser Mike Waltz,” White House spokeswoman Karoline Leavitt said in a statement on Monday.\nGovernment officials have used Signal for organisational correspondence, but it is not classified and can be hacked.\nThe sharing of sensitive information comes as Defence Secretary Pete Hegseth’s office has just announced a crackdown on leaks of sensitive information, including the potential use of polygraphs on defence staff to determine how reporters have received information.\nSean Parnell, a spokesman for Hegseth, did not immediately respond to requests for comment on why the defence secretary posted war operational plans on an unclassified app.\nThe breach in protocol was swiftly condemned by Democratic lawmakers. Senate Democratic leader Chuck Schumer called for a full investigation.\n“This is one of the most stunning breaches of military intelligence I have read about in a very, very long time,” Schumer, a New York Democrat, said in a floor speech on Monday afternoon.\n\n“If true, this story represents one of the most egregious failures of operational security and common sense I have ever seen,” said Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, in a statement.\nHe said American lives are “on the line. The carelessness shown by Trump’s Cabinet is stunning and dangerous. I will be seeking answers from the Administration immediately”.\nJim Himes of Connecticut, the top Democrat on the House Intelligence Committee, said in a statement that he was “horrified” by the reports.\nHimes said if a lower-ranking official “did what is described here, they would likely lose their clearance and be subject to criminal investigation. The American people deserve answers”, which he said he planned to get at Wednesday’s previously scheduled committee hearing.\nThe handling of national defence information is strictly governed by law under the century-old Espionage Act, including provisions that make it a crime to remove such information from its “proper place of custody” even through an act of gross negligence.\nThe Justice Department in 2015 and 2016 investigated whether Hillary Clinton, when secretary of state from 2009 to 2013, broke the law by communicating about classified information with her aides on a private email server she set up, though the FBI (Federal Bureau of Investigation) ultimately recommended against charges and none were brought.\nIn the Biden administration, some officials were given permission to download Signal on their White House-issued phones, but were instructed to use the app sparingly, according to a former national security official who served in the Democratic administration.\nThe official, who requested anonymity to speak about methods used to share sensitive information, said Signal was most commonly used to communicate what they internally referred to as “tippers” to notify someone when they were away from the office or travelling overseas that they should check their “high side” inbox for a classified message.\n\nThe app was sometimes also used by officials during the Biden administration to communicate about scheduling of sensitive meetings or classified phone calls when they were outside the office, the official said.\nThe use of Signal became more prevalent during the last year of the Biden administration after federal police officials warned that China and Iran were hacking the White House as well as officials in the first Trump administration, according to the official.\nThe official was unaware of top Biden administration officials such as Kamala Harris, Lloyd Austin and Jake Sullivan – the former vice-president, defence secretary and national security adviser, respectively – using Signal to discuss sensitive plans as the Trump administration officials did.\nSome of the toughest criticism targeted Hegseth, a former Fox News Channel weekend host. Senator Tammy Duckworth, an Iraq War veteran, said on social media that Hegseth, “the most unqualified Secretary of Defence in history, is demonstrating his incompetence by literally leaking classified war plans in the group chat”.\nAdditional reporting by Agence France-Presse","summary":"Recipients of text about ‘forthcoming strikes on Iran-backed Houthi-rebels in Yemen’, included editor of The Atlantic, the magazine reported.","url":"https://www.scmp.com/news/world/united-states-canada/article/3303702/trump-officials-texted-war-plans-secure-app-group-chat-included-journalist","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/25/a5027ce2-0e9a-4f69-bd80-f827b8ec5b41_b50fd966.jpg","video":null,"publish_date":"2025-03-24 21:09:07","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"cn","sentiment":-0.218},{"id":303722458,"title":"Democratic fundraising keeps pace with GOP, despite internal divisions","text":"“This is worse than 2016,” one major Democratic donor who spoke to The Hill anonymously said in February. “Our party is so weak and so diminished.” \n\n“They want us to spend money, and for what? For no message, no organization, no forward thinking,” another donor said. “The thing that’s clear to a lot of us is that the party never really learned its lesson in 2016. They worked off the same playbook and the same ineffective strategies and to what end?”\n\nWhile protests following Trump’s 2024 electoral victory were notably muted compared to those at the start of his first presidency, Democratic donors, specifically small-dollar donors, didn’t appear to share that demoralization. ActBlue, the primary payment platform used by Democratic political campaigns and liberal activist organizations, processed nearly three times more donations following Trump’s 2024 election as it did following his 2016 victory, records show.\n\nActBlue’s 2024 year-end report shows that it had an intake of roughly $42 million in donations between November 26 and December 31 of that year, according to the FEC. During the same period after the 2016 election, ActBlue processed just $14.6 million in contributions. \n\nDemocratic donors and fundraisers told CNN in mid-March that they were backing off supporting the party’s bid to win the Senate during the next election cycle, partially over discontent with Senate Minority Leader Chuck Schumer (D-NY)’s leadership and partially because of the opportunities for pickups in 2026 are so slim. While it may be true that some prominent left-of-center donors are pivoting away from the upper chamber, campaign finance records show that Democrats are continuing to rake in cash.\n\nThe Democratic Senatorial Campaign Committee, the primary PAC responsible for assisting Democratic Senate candidates, pulled in $6.9 million in February, according to records released on March 20. Its Republican counterpart, the National Republican Senatorial Committee, secured $7.9 million in contributions. The DSCC had a nearly $10 million advantage in cash on hand but was carrying about $2.5 million more in debt than its Republican rival. \n\nThings are looking slightly better for Democrats on the House side. The Democratic Congressional Campaign Committee, which handles lower chamber races for the party, raised $11.1 million in February — almost $2 million more than what the National Republican Congressional Committee secured. House Democrats also had a cash on hand advantage, boasting $26.7 million in the bank compared to the $15 million held by the NRCC. Republicans maintain control of the House by a margin of 218 to 213, with four vacant seats. The slim margin in the chamber has many Democrats optimistic about flipping it in 2026.\n\nWhile money may be flowing their way, Democrats lack a sense of direction. Fifty Democratic leaders interviewed by the New York Times gave varying accounts of what policies the party should prioritize, why it was defeated by Trump, and how it should tailor its messaging going into 2026.\n\n“We’re not going to go after every single issue,” Schumer told the New York Times. “We are picking the most important fights and lying down on the train tracks on those fights.”\n\nOthers in the party, however, are reluctant to abandon their principles on abortion or LGBT issues and fear that the progressive base may revolt if they do so.\n\nDemocratic National Committee Chairman Ken Martin, meanwhile, contends that Democrats don’t have a policy problem — rather, they simply need to improve their messaging. \n\n“The policies that we support and the message that we have [are] not wrong,” he said. “It is a messaging problem and a brand problem. Those voters are not connecting our policies with their lives.”\n\nSome are not so optimistic. \n\n“We have no coherent message,” Rep. Jasmine Crockett (D-TX) told the New York Times. \n\nJust because Democratic donors remain engaged, however, doesn’t mean that the party is on track for an electoral resurgence in 2026. Former Vice President Kamala Harris and Former Secretary of State Hillary Clinton both significantly outraised Trump in their races against him, only for Republicans to secure wins on election nights. Individuals donating through ActBlue are typically committed partisans, and their enthusiasm is not always reflected in the general electorate. Cash can, however, be a deciding factor in razor-thin elections.\n\nSpending wars over tight off-year elections this spring have already begun. Liberals including George Soros and billionaire Gov. JB Pritzker (D-IL) are pumping tens of millions of dollars into a Wisconsin special election to fill a seat on the state’s supreme court with a liberal judge. Right-wing donors such as Elon Musk and Diane Hendricks are pouring in comparable amounts of cash to support the conservative candidate. In Florida, meanwhile, Democratic candidates contesting vacant House seats in an upcoming special election have raised millions more than their Republican competitors. The cash advantage, however, could mean little, as both districts have a strongly Republican partisan tilt.\n\nAs special elections pass and midterm season begins, Republicans have a handful of not-so-secret weapons at their disposal. \n\nThe Republican National Committee, for instance, holds $55.8 million in its reserves compared to the $16.7 million held by the Democratic National Committee. Trump has also assured congressional Republicans that he intends to tap into his leftover campaign fund, which he claims is valued at over half a billion dollars, to assist them, according to CNN. Musk reportedly is expected to dip into his considerable wealth to help Republicans in 2026 as well. \n\nWhile campaign finance filings provide some insight into the resources available to both parties, many of the operations typically associated with political campaigns happen outside the purview of the FEC. Much of the political machinery of the Left and Right is housed within 501(c)(4) dark money groups that have anonymous donors, don’t necessarily need to file campaign finance reports, and engage in traditional campaign activities such as get-out-the-vote efforts and advertising. \n\nSome of the largest left-of-center dark money networks, such as those controlled by Tides and Arabella Advisors, command billions of dollars in assets. The public, however, often isn’t privy to how these assets are deployed until well after elections are decided since 501(c)(4) groups operate on a delayed reporting schedule. The most recent information for many of these groups is from 2023. \n\nIndeed, some Democratic donors told CNN that they plan to route their contributions toward activist groups rather than political campaigns, setting the groundwork for a potential flood of dark money into the 2026 elections.","summary":"As Democrats struggle to chart their party&#8217;s future amid competing visions for countering President Donald Trump, recently released campaign finance filings show that Democratic fundraising is more or less keeping pace with Republicans. Multiple people familiar with Democratic fundraising have complained to the press both on and off the record that donors are frustrated with the [&#8230;]","url":"https://www.washingtonexaminer.com/news/3357208/democratic-fundraising-keeps-pace-with-gop/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/laken-riley-.webp","video":null,"publish_date":"2025-03-24 21:00:44","author":"Robert Schmad","authors":["Robert Schmad"],"language":"en","source_country":"US","sentiment":-0.332},{"id":303726286,"title":"Inside Trump's Latest Rampage — Including Rant at 'Second Rate' Actor George Clooney, Demand to Rip Down Portrait After Comparing it to Obama… And ID'ing 'JFK Assassin'","text":"Donald Trump has unleashed yet another series of bizarre rants – and this time he raged about everything from George Clooney to what he believed to be an unflattering portrait of himself, RadarOnline.com can reveal. \n\nWhile citizens protested his recent executive order aimed at dismantling the Department of Education last week – and subsequent proposals to state funding cuts on education – the president flew into a frenzy online about a much different issue at the Colorado state capitol.Thousands of educators in Colorado flocked to the state capitol to protest funding cuts amid Trump's executive order on the DOE, citing concerns including increased classroom sizes, special education and teacher retention. \n\nBut Trump, 78, appeared to be less concerned with the mass crowds outside the capitol and more about a portrait of himself hanging inside. \n\nThe president even went as far as smearing Colorado's \"radical left\" governor and demanded the portrait be taken down in a Truth Social post.The 78-year-old alleged his portrait was \"purposefully distorted\" and insisted he would rather have no photo hanging than the current one. \n\nHe wrote on Truth Social: \"Nobody likes a bad picture or painting of themselves, but the one in Colorado, in the State Capitol, put up by the Governor, along with all other Presidents, was purposefully distorted to a level that even I, perhaps, have never seen before.\"\n\nTrump also attacked the artist, Sarah Boardman, claiming \"she lost her talent\" due to his \"distorted\" portrait.He continued: \"The artist also did President Obama, and he looks wonderful, but the one on me is truly the worst. She must have lost her talent as she got older.\"\n\n\"In any event, I would much prefer not having a picture than having this one, but many people from Colorado have called and written to complain.\"\n\nNext, he insulted Colorado Governor Jared Polis, whom he branded \"weak\" and \"radical,\" as he called for the portrait to be removed.\n\nHe said: \"In fact, they are actually angry about it! I am speaking on their behalf to the Radical Left Governor, Jared Polis, who is extremely weak on Crime, in particular with respect to Tren de Aragua, which practically took over Aurora (Don't worry, we saved it!), to take it down.\n\n\"Jared should be ashamed of himself!\"In addition to ranting about his portrait, Trump also revealed his thoughts on John F. Kennedy's assassin during an interview with Clay Travis onboard Air Force One.\n\nTrump said he believes Lee Harvey Oswald killed JFK, but appeared to fuel conspiracy theories surrounding the assassination by adding, \"And I've always felt that, but of course, was he helped?\"\n\nMany conspiracy theories alleged the CIA and even the mafia were behind Kennedy's murder. \n\nThe president noted the declassification of over 2,000 documents related to the investigation into Kennedy's assassination \"has turned out to be somewhat unspectacular,\" before adding, \"'I don't think there's any that earth-shattering.\"\n\nHe also said the public could make their own \"determination\" on what happened.It was a busy weekend for Trump, who capped off his multi-day rants by slamming Clooney's recent 60 Minutes interview. \n\nThe president called Clooney, a longtime outspoken Democratic party supporter, a \"second-rate movie star\" as he branded his chat a \"total puff piece.\"\n\nHe wrote on Truth Social: \"Why would the now highly-discredited 60 Minutes be doing a total 'puff piece' on George Clooney, a second-rate movie 'star' and failed political pundit. \n\n\"He fought hard for Sleepy Joe's election, and then, right after the Debate, dumped him like a dog. Later, I assume under orders from the Obama camp, pushed all out for 'Kamala,' only to soon realize that this was not going to work out too well.\"The president further claimed 60 Minutes \"fraudulently inserted Fake answers\" into Harris' \"disastrous interview,\" which she gave just prior to the 2024 election. \n\nTrump claimed Harris' interview as \"one of the most embarrassing and dishonest events in broadcast history.\"\n\nHe added: \"…And now George Clooney again? His press agent should be making a fortune!!!\"","summary":"The president branded the actor a 'second-rate movie star' in addition to demanding the Colorado governor take down his 'distorted' portrait.","url":"https://radaronline.com/p/donald-trump-colorado-capitol-portrait-george-clooney-60-minutes-interview-jfk-files/","image":"https://media.radaronline.com/brand-img/0acj6F8aM/0x0/donald-trump-drone-war-drug-cartels-1741709452848.jpg","video":null,"publish_date":"2025-03-24 21:00:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.162},{"id":303710936,"title":"Which stars will want to be seen at Jeff Bezos and Lauren Sanchez’s wedding?","text":"After Jeff Bezos and Lauren Sanchez announced their engagement in 2023, they were feted at two glitzy celebrations by some of the biggest names in celebrity world: Oprah Winfrey, Barbra Streisand, Leonardo DiCaprio, Robert Pattinson and Kris Jenner.\n\nBut now that the Amazon founder and his attention-seeking fiancée are reportedly sending out invitations to their wedding, set to take place this summer in Venice, they must realize that a lot has changed in America and that some of those stars could — or should — have issues with being seen with them.\n\nBefore and after Donald Trump was elected president, Bezos notoriously “bent the knee” to America’s polarizing leader, as multiple news organizations said. The second-richest man in the world, and owner of the Washington Post, began his public surrender to Trump with his “11th-hour decision” to kill the newspaper’s endorsement of Kamala Harris, as longtime columnist Ruth Marcus wrote in the New Yorker, explaining her decision in March to resign from the paper.\n\nIn the aftermath of Trump’s election, Bezos said he was “optimistic” about Trump’s second term after his combative relationship with him during his first term. He and Sanchez joined Musk for dinner with Donald and Melania Trump at Mar-a-Lago, with Trump boasting, “In this term, everybody wants to be my friend.” The couple also listened to Melania “regale” them with details of her planned documentary — for which Bezos’ Amazon paid the first lady a reported $40 million.\n\nBezos and Sanchez effectively embraced Trump’s leadership by participating in a pretty stunning bit of stagecraft at Trump’s inauguration, which arguably served both Trump’s interests and their own. They stood in an honored position in the U.S. Capitol with other global tech titans, including Elon Musk, Mark Zuckerberg and Tim Cook, in what The Guardian called a display of “oligarchy” and the powerful influence they expect “to wield” in Trump’s America.\n\nThe night before Trump’s inauguration, Bezos and Sanchez also attended what Sanchez hailed as “a magical evening” — a candlelight dinner honoring Trump, where they got to schmooze with such MAGA figures as Musk, Ivanka Trump and Jared Kushner.\n\nSome of Bezos and Sanchez’s famous liberal friends were very outspoken in their opposition to Trump getting a second term — and the danger they said he posed to American democracy. While speaking at a campaign rally on behalf of Kamala Harris, Winfrey warned that the country stood on “precipice of danger,” with Trump poised to usher in an authoritarian regime if elected.\n\nAs DiCaprio also endorsed Harris, he blasted Trump for denying “the facts” and “science” on climate change. Meanwhile, Streisand called Trump a “travesty” and a “sloppy, sleepy … serial liar (who) can’t face the truth” and who lacks “shame or dignity” or “common decency.”\n\nEva Longoria and Katy Perry also campaigned for Harris, with Longoria saying that America would become such a “scary place” under Trump that she was happy to be living outside the United States.\n\nBut will these celebrities’ opposition to Trump stop them from attending what could be the wedding of the year — if not the decade?\n\nOver the weekend, the New York Post reported that Bezos and Sánchez are set to tie the knot on their $500 million mega-yacht, Koru, off the coast of Italy in June. Puck News also first reported that formal invitations, which could be seen as highly coveted, had hit the mail.\n\nAfter Bezos and Sanchez first announced their engagement in 2023, they hosted a party on their yacht near Positano, Italy with a lineup of A-star guests who included DiCaprio, Tobey Maguire, Bill Gates, Ari Emanuel, Andrew Garfield, Queen of Jordan Rania Al Abdullah and Kris Jenner.\n\nAnother engagement celebration took place several months later at the Beverly Hills home of fashion designer Diana von Furstenberg and husband Barry Diller. The guests at that part included Winfrey, Streisand, Jenner, Pattinson, Suki Waterhouse, Salma Hayek and Miranda Kerr.\n\nNow, with the wedding in the works, people will be wondering which of these A-listers will receive invitations. And, which ones will attend what could be seen as a prime public-relations opportunity for Bezos and Sanchez? Or, more to the point, which ones will be OK with letting the world that they are there? But will some take a stand against Bezos and Sanchez’s friendly relationship with Trump, if only to not aggravate their liberal fan base?\n\nMeanwhile, could Ivanka Trump and Jared Kushner be on the guest list? Speaking of Ivanka Trump, it’s easy to imagine Jenner and her daughters, Kim, Khloe Kardashian or Kourtney Kardashian, attending the wedding, given that the clan has been happy in recent years to flaunt their social connections to both Ivanka Trump as well as to Sanchez.\n\nIt also wouldn’t be surprise to see Longoria, Perry or Gayle King attend the wedding, if Longoria and Perry were staunchly pro-Harris.\n\nAs much as Longoria called Trump “a convicted criminal who spews so much hate,” the “Desperate Housewives” star has shown an ability to turn a blind eye when it comes to her friends, Bezos and Sanchez, cozying up to Trump.\n\nEarlier this month, Longoria included Sanchez in the “badass” women she celebrated in an Instagram post for International Women’s Day. The longtime activist also praised Bezos and Sanchez for their “courage and civility” after she received a $50 million prize from them last year to be shared with nonprofits of her choice.\n\nMeanwhile, King and Perry are set to join Sanchez on an upcoming all-female trip to space on one of Bezos’s Blue Origin rockets.\n\nPerry has a problematic social history with Bezos and Sanchez, in that the couple were attending Perry’s lavish 40th birthday party in Europe on the same weekend that Bezos plunged the Washington Post into crisis by killing the newspaper’s endorsement of Harris. But this social history also suggests Perry will most definitely try to be at the wedding, with her husband Orlando Bloom.\n\nMeanwhile, the response to King’s Instagram announcement that she would be joining Sanchez on the Blue Origin flight shows the backlash that she and other celebrities could face by aligning themselves with Sanchez and Bezos, including by attending their wedding.\n\nMany of the comments on King’s announcement were critical of her for associating with the couple, even for what’s been billed as a “historic” Blue Origin flight.\n\n“Sometimes you gotta say no,” one person said. “You know what (Bezos) stands for. That you are willingly participating is mind boggling and deeply disappointing,” said another.\n\n“I am so disappointed that you’re participating in this PR stunt by an oligarch,” a third person said. “Where’s your integrity? How are we the public to trust you or CBS to report on Bezos’ gutting WaPo knowing he gave you a million dollar ride to space?”\n\n“Very disappointed in you @gayleking aligning with oligarchs while America crashes and burns,” said a fourth.","summary":"After Bezos and Sanchez put on a show of welcoming Trump's leadership at his inauguration, will such famous liberal friends as Oprah Winfrey, Leonardo DiCaprio, Eva Longoria and Katy Perry happily attend their wedding?","url":"https://www.mercurynews.com/2025/03/24/which-stars-will-be-seen-at-jeff-bezos-and-lauren-sanchez-wedding/","image":"https://www.mercurynews.com/wp-content/uploads/2024/10/Sanchez-Bezos-.jpg?w=1024&h=653","video":null,"publish_date":"2025-03-24 20:27:13","author":"Martha Ross","authors":["Martha Ross"],"language":"en","source_country":"us","sentiment":0.124},{"id":303709544,"title":"Who Is Chuck Schumer’s Wife? All About Iris Weinshall","text":"Chuck Schumer and his wife, Iris Weinshall, have dedicated their lives to public service.\n\n The United States senator and the Democratic senate minority leader has spent his career serving his country in politics. Likewise, Weinshall has held different roles across New York City, including as the chief operating officer of the New York Public Library.\n\n Both Brooklyn natives, Schumer and Weinshall met in the late 1970s when he was an assemblyman, and she was a lobbyist. They married in 1980 and welcomed two children: their daughters Alison and Jessica Schumer. In recent years, Jessica and Alison have welcomed kids of their own, making Schumer and Weinshall three-time grandparents.\n\n Today, Schumer and Weinshall continue to pursue their careers, and Schumer has said that Weinshall’s “wit and grit” are an “inspiration” to him every day, he wrote in a 2018 Facebook post.\n\n So who is Chuck Schumer’s wife? Here’s everything to know about Iris Weinshall and her relationship with the United States senator.\n\n They met at a Brooklyn Democrats meeting \n\n In the 1970s, Schumer met Weinshall when he was 24 and a New York state assemblyman while she was 21 and working as a lobbyist for the Citizens Union in Albany.\n\n The two crossed paths when they attended a meeting for the Mid-Bay Independent Democrats in Midwood, Brooklyn, where Weinshall was attempting to garner endorsement for one of the group’s causes.\n\n “I had waited to speak and he showed up and he came over to me and said, ‘You don’t mind if I go ahead of you, because I have to go to some other meetings,’ ” Weinshall told Crain’s New York Business in 2016.\n\n She continued, “And I said, ‘Yes, I do mind.’ But then he charmed me, so I let him do it.”\n\n They married in 1980 \n\n Schumer and Weinshall wed on Sept. 21, 1980.\n\n The same year Schumer was first elected to Congress, and two weeks after he won the Democratic Party nomination for his district, he and Weinshall married, according to a newspaper announcement of their marriage.\n\n At the time of their wedding, Weinshall was serving as the assistant vice president of the Urban Development Corporation.\n\n Weinshall is a lifelong public servant \n\n Weinshall has held various public office positions throughout her career, including deputy commissioner for the New York City Department of Citywide Administrative Services and the New York City Department of Environmental Protection.\n\n From 2000 to 2007, Weinshall served as commissioner of the city’s Department of Transportation before moving to the City University of New York (CUNY) as vice chancellor of facilities planning, management and construction. (She previously graduated from CUNY's Brooklyn College and earned a master's degree in public administration from New York University.)\n\n Weinshall held her role with CUNY until September 2014, when she began her tenure as the chief operating officer of the New York Public Library — a position that she still holds today.\n\n At the NYPL, she oversees all operational departments of the library across its 92 locations, its construction operations and its $1 billion endowment, according to her bio on the NYPL website.\n\n They share two children and three grandchildren \n\n Schumer and Weinshall welcomed their older daughter, Jessica, in 1984 and their younger daughter, Alison, in 1989.\n\n After being raised in Brooklyn, Schumer and Weinshall's daughters did not follow them into public service and instead pursued careers in the tech industry — Jessica with Amazon and Alison with Facebook, per the New York Post.\n\n Jessica met her husband, Michael Shapiro, in 2011 when they both worked as policy advisors at the White House for the National Economic Council, but didn’t begin dating until three years later, per The New York Times. The pair married on Apr. 17, 2016.\n\n In November 2018, Jessica and Shapiro welcomed a son, Noah Melvin Schumer-Shapiro — named in honor of Weinshall’s father, Schumer wrote in a Facebook post announcing the birth. In June 2022, they welcomed their second child, daughter Eleanor Alys, named after Schumer’s mother.\n\n Alison met her wife, Elizabeth Weiland, in 2015 after being introduced online, and they married on Nov. 18, 2018, per The New York Times. Schumer became a grandfather for a third time in February 2023, when Alison and Weiland welcomed their son, Henry, Schumer shared in a post on Instagram.\n\n They support each others’ careers \n\n Schumer and Weinshall show up for each other in the professional sense — attending events, ceremonies and career milestones together.\n\n In 1998, after Schumer defeated Republican incumbent Alphonse D’Amato in the New York senatorial race, Weinshall and his daughters were there to support him — standing beside Schumer after he gave his acceptance speech and flashing thumbs-ups to the cameras.\n\n She has also attended all of Schumer’s swearing-in ceremonies, including his first in 1999; when he was sworn into the Senate by Vice President Joe Biden in 2017; and when he was sworn in by Vice President Kamala Harris in 2023.\n\n Nearly two decades, while still serving in the senate, Weinshall and their children attended his first speech as Democratic minority leader in 2017.\n\n As for Weinshall’s career, Schumer is often in attendance at the New York Public Library’s annual Library Lions gala, even giving a speech at the November 2024 event and also two years prior.","summary":"Chuck Schumer and his wife, Iris Weinshall, married in 1980","url":"https://people.com/who-is-iris-weinshall-chuck-schumer-wife-11699220","image":"https://people.com/thmb/E1Hou0pqpwwg3sD1cJklCm9HoxQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(971x191:973x193)/chuck-schumer-wife-iris-weinshall-schumer-main-032125-030952a5701546dca81f3a2d13c52e04.jpg","video":null,"publish_date":"2025-03-24 20:26:42","author":"Makena Gera","authors":["Makena Gera"],"language":"en","source_country":"US","sentiment":0.403},{"id":303702114,"title":"Comedian Nikki Glaser Admits ‘Real Fear’ of Roasting Trump","text":"Comedian Nikki Glaser revealed that “real fear” is what keeps her from turning her roasting skills to Donald Trump and his MAGA base.\n\nSpeaking on the red carpet Sunday for the Kennedy Center’s Mark Twain Prize for American Humor, which this year went to Conan O’Brien (selected before Trump’s overhaul of the center), Glaser told The Hill that she used to steer clear of politics in her comedy because “I don’t want to alienate anyone.” But that’s changed, she said. “I’m at the point now that if I don’t say something political, it’s because I’m scared to.” \n\nAs for what she thinks could happen if she made politicians the butt of her jokes, Glaser explained, “You just are scared that you’re going to get doxxed and death threats or who knows where this leads—like, detained.” The roast comedian emphasized that she wasn’t being dramatic as she joked about ending up “on the gallows.” \n\n“It’s a real fear,” she explained. “It’s unfortunate that that’s true, but I’m not going to lie and say I don’t think about that sometimes and go, ‘Oh, god.’ Can I just say, I hope they all know, I can be up on the gallows and say, ‘I was just joking. I’m a comedian.’ I hope that that’s a defense.”\n\nGlaser hasn’t always steered clear of making aggressive jokes about Trump and politics. In 2022, when she guest-hosted Jimmy Kimmel Live, Glaser’s remarks about politicians on both sides of the aisle were brutal. \n\nShe referred to Trump as a “bloated factory-farm pig corpse” and opined that Georgia Rep. Marjorie Taylor-Greene’s mom was “anti-abortion.” Though she had jokes for the likes of Kamala Harris and Pete Buttigieg too, they were less visceral than her Republican takedowns. \n\nNow though, Glaser said she feels she’s “too angry,” but also “too uninformed” to comment on politics. \n\n“I’m uninformed on purpose because I just get too upset,” she said in another red carpet interview Sunday, without detailing which headlines she found upsetting. “When I’m depressed, I can’t be funny,” she went on, but “recently I’ve been so upset and in disbelief” that politics has “become funny again.”\n\nGlaser was in the right place for that sentiment at Sunday’s Kennedy Center event for O’Brien, which featured several savage jokes about the president, who was never named but at one point referred to as an “orange a--hole” by Sarah Silverman. \n\nGlaser got in the action at the event during a bit where she was interrupted by a recurring Conan character “The Interruptor,” per Deadline, in which they joked that the character was chosen as Trump’s Secretary of Housing and Urban Development because he was a “registered sex offender.” \n\n“Which this administration considers…” Glaser replied, as The Interrupter cut in, “A massive plus!”\n\nFor more, listen to Nikki Glaser talk about roasting Tom Brady and trying not to get “canceled” on The Last Laugh podcast.","summary":"Paul Morigi / Getty ImagesComedian Nikki Glaser revealed that “real fear” is what keeps her from turning her roasting skills to Donald Trump and his MAGA base.\n\nSpeaking on the red carpet Sunday for the Kennedy Center’s Mark Twain Prize for American Humor, which this year went to Conan O’Brien (selected before Trump’s overhaul of the center), Glaser told The Hill that she used to steer clear of politics in her comedy because “I don’t want to alienate anyone.” But that’s changed, she said. “I’m at the point now that if I don’t say something political, it’s because I’m scared to.” \n\nAs for what she thinks could happen if she made politicians the butt of her jokes, Glaser explained, “You just are scared that you’re going to get doxxed and death threats or who knows where this leads—like, detained.” The roast comedian emphasized that she wasn’t being dramatic as she joked about ending up “on the gallows.” \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/comedian-nikki-glaser-admits-real-fear-of-roasting-trump/","image":"https://www.thedailybeast.com/resizer/v2/I2MU66U4ZFE6RPQWBQPPYDL7DI.jpg?smart=true&auth=a27560ee3c89b0a3624114bf2434acf97319ad37853c71ede005ea2d483f8b0a&width=1440&height=1080","video":null,"publish_date":"2025-03-24 20:11:01","author":"Eboni Boykin-Patterson","authors":["Eboni Boykin-Patterson"],"language":"en","source_country":"us","sentiment":-0.226},{"id":303714178,"title":"Trump officials texted war plans to group chat that included journalist","text":"Top national security officials for US President Donald Trump, including his defence secretary, texted war plans for upcoming military strikes in Yemen to a group chat in a secure messaging app that included the editor-in-chief for The Atlantic, the magazine reported.\n\nThe National Security Council said the text chain “appears to be authentic”.\n\nThe material in the text chain “contained operational details of forthcoming strikes on Iran-backed Houthi-rebels in Yemen, including information about targets, weapons the US would be deploying, and attack sequencing”, editor-in-chief Jeffrey Goldberg reported.\n\nIt was not immediately clear if the specifics of the military operation were classified, but they often are and at the least are kept secure to protect service members and operational security.\n\nThe US has conducted air strikes against the Houthis since the militant group began targeting commercial and military vessels in the Red Sea in November 2023.\n\nJust two hours after Mr Goldberg received the details of the attack on March 15, the US began launching a series of air strikes against Houthi targets in Yemen.\n\nThe National Security Council said in a statement that it was looking into how a journalist’s number was added to the chain in the Signal group chat.\n\nMr Trump told reporters he was not aware of the apparent breach in protocol.\n\n“I know nothing about it,” Mr Trump said, adding that The Atlantic was “not much of a magazine”.\n\nHe went on to say: “I don’t know anything about it. You’re telling me about it for the first time.”\n\nGovernment officials have used Signal for organisational correspondence, but it is not classified and can be hacked.\n\nPrivacy and tech experts say the popular end-to-end encrypted messaging and voice call app is more secure than conventional texting.\n\nThe sharing of sensitive information comes as defence secretary Pete Hegseth’s office has just announced a crackdown on leaks of sensitive information, including the potential use of polygraphs on defence personnel to determine how reporters have received information.\n\nSean Parnell, a spokesman for Mr Hegseth, did not immediately respond to requests for comment on why the defence secretary posted war operational plans on an unclassified app.\n\nThe breach in protocol was swiftly condemned by Democratic legislators.\n\nSenate Democratic leader Chuck Schumer called for a full investigation.\n\n“This is one of the most stunning breaches of military intelligence I have read about in a very, very long time,” Mr Schumer, a New York Democrat, said in a floor speech on Monday afternoon.\n\n“If true, this story represents one of the most egregious failures of operational security and common sense I have ever seen,” said Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, in a statement.\n\nHe said American lives are “on the line. The carelessness shown by Trump’s Cabinet is stunning and dangerous. I will be seeking answers from the Administration immediately”.\n\nRepresentative Jim Himes of Connecticut, the top Democrat on the House Intelligence Committee, said in a statement that he was “horrified” by the reports.\n\nMr Himes said if a lower-ranking official “did what is described here, they would likely lose their clearance and be subject to criminal investigation. The American people deserve answers”, which he said he planned to get at Wednesday’s previously scheduled committee hearing.\n\nSenate Majority Leader John Thune said he wants to learn more about what happened.\n\n“Obviously, we got to run it to the ground, figure out what went on there,” said Mr Thune, a South Dakota Republican.\n\nThe handling of national defence information is strictly governed by law under the century-old Espionage Act, including provisions that make it a crime to remove such information from its “proper place of custody” even through an act of gross negligence.\n\nThe Justice Department in 2015 and 2016 investigated whether former secretary of state Hillary Clinton broke the law by communicating about classified information with her aides on a private email server she set up, though the FBI ultimately recommended against charges and none were brought.\n\nIn the Biden administration, some officials were given permission to download Signal on their White House-issued phones, but were instructed to use the app sparingly, according to a former national security official who served in the Democratic administration.\n\nThe official said Signal was most commonly used to communicate what they internally referred to as “tippers” to notify someone when they were away from the office or travelling overseas that they should check their “high side” inbox for a classified message.\n\nThe app was sometimes also used by officials during the Biden administration to communicate about scheduling of sensitive meetings or classified phone calls when they were outside the office, the official said.\n\nThe use of Signal became more prevalent during the last year of the Biden administration after federal law enforcement officials warned that China and Iran were hacking the White House as well as officials in the first Trump administration, according to the official.\n\nThe official was unaware of top Biden administration officials – such as vice president Kamala Harris, defence secretary Lloyd Austin and national security adviser Jake Sullivan – using Signal to discuss sensitive plans as the Trump administration officials did.\n\nSome of the toughest criticism targeted Mr Hegseth, a former Fox News Channel weekend host.\n\nSenator Tammy Duckworth, an Iraq War veteran, said on social media that Mr Hegseth, “the most unqualified Secretary of Defense in history, is demonstrating his incompetence by literally leaking classified war plans in the group chat”.","summary":"Top national security officials for US President Donald Trump, including his defence secretary, texted war plans for upcoming military strikes in Yemen to a group chat in a secure messaging app that included the editor-in-chief for The Atlantic, the magazine reported. The National Security Council said the text chain “appears to be authentic”. The material [&#8230;]\n\n\nThe post Trump officials texted war plans to group chat that included journalist appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/worldnews/2025/03/24/trump-officials-texted-war-plans-to-group-chat-that-included-journalist/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/5e4aaf97e7b44786926056dd786c3367-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-24 20:05:51","author":"Newsdesk","authors":["Newsdesk"],"language":"en","source_country":"gb","sentiment":-0.217},{"id":303714842,"title":"Trump officials texted war plans to group chat that included journalist","text":"Top national security officials for US President Donald Trump, including his defence secretary, texted war plans for upcoming military strikes in Yemen to a group chat in a secure messaging app that included the editor-in-chief for The Atlantic, the magazine reported.\n\nThe National Security Council said the text chain “appears to be authentic”.\n\nThe material in the text chain “contained operational details of forthcoming strikes on Iran-backed Houthi-rebels in Yemen, including information about targets, weapons the US would be deploying, and attack sequencing”, editor-in-chief Jeffrey Goldberg reported.\n\nIt was not immediately clear if the specifics of the military operation were classified, but they often are and at the least are kept secure to protect service members and operational security.\n\nThe US has conducted air strikes against the Houthis since the militant group began targeting commercial and military vessels in the Red Sea in November 2023.\n\nJust two hours after Mr Goldberg received the details of the attack on March 15, the US began launching a series of air strikes against Houthi targets in Yemen.\n\nThe National Security Council said in a statement that it was looking into how a journalist’s number was added to the chain in the Signal group chat.\n\nMr Trump told reporters he was not aware of the apparent breach in protocol.\n\n“I know nothing about it,” Mr Trump said, adding that The Atlantic was “not much of a magazine”.\n\nHe went on to say: “I don’t know anything about it. You’re telling me about it for the first time.”\n\nGovernment officials have used Signal for organisational correspondence, but it is not classified and can be hacked.\n\nPrivacy and tech experts say the popular end-to-end encrypted messaging and voice call app is more secure than conventional texting.\n\nThe sharing of sensitive information comes as defence secretary Pete Hegseth’s office has just announced a crackdown on leaks of sensitive information, including the potential use of polygraphs on defence personnel to determine how reporters have received information.\n\nSean Parnell, a spokesman for Mr Hegseth, did not immediately respond to requests for comment on why the defence secretary posted war operational plans on an unclassified app.\n\nThe breach in protocol was swiftly condemned by Democratic legislators.\n\nSenate Democratic leader Chuck Schumer called for a full investigation.\n\n“This is one of the most stunning breaches of military intelligence I have read about in a very, very long time,” Mr Schumer, a New York Democrat, said in a floor speech on Monday afternoon.\n\n“If true, this story represents one of the most egregious failures of operational security and common sense I have ever seen,” said Senator Jack Reed of Rhode Island, the top Democrat on the Senate Armed Services Committee, in a statement.\n\nHe said American lives are “on the line. The carelessness shown by Trump’s Cabinet is stunning and dangerous. I will be seeking answers from the Administration immediately”.\n\nRepresentative Jim Himes of Connecticut, the top Democrat on the House Intelligence Committee, said in a statement that he was “horrified” by the reports.\n\nMr Himes said if a lower-ranking official “did what is described here, they would likely lose their clearance and be subject to criminal investigation. The American people deserve answers”, which he said he planned to get at Wednesday’s previously scheduled committee hearing.\n\nSenate Majority Leader John Thune said he wants to learn more about what happened.\n\n“Obviously, we got to run it to the ground, figure out what went on there,” said Mr Thune, a South Dakota Republican.\n\nThe handling of national defence information is strictly governed by law under the century-old Espionage Act, including provisions that make it a crime to remove such information from its “proper place of custody” even through an act of gross negligence.\n\nThe Justice Department in 2015 and 2016 investigated whether former secretary of state Hillary Clinton broke the law by communicating about classified information with her aides on a private email server she set up, though the FBI ultimately recommended against charges and none were brought.\n\nIn the Biden administration, some officials were given permission to download Signal on their White House-issued phones, but were instructed to use the app sparingly, according to a former national security official who served in the Democratic administration.\n\nThe official said Signal was most commonly used to communicate what they internally referred to as “tippers” to notify someone when they were away from the office or travelling overseas that they should check their “high side” inbox for a classified message.\n\nThe app was sometimes also used by officials during the Biden administration to communicate about scheduling of sensitive meetings or classified phone calls when they were outside the office, the official said.\n\nThe use of Signal became more prevalent during the last year of the Biden administration after federal law enforcement officials warned that China and Iran were hacking the White House as well as officials in the first Trump administration, according to the official.\n\nThe official was unaware of top Biden administration officials – such as vice president Kamala Harris, defence secretary Lloyd Austin and national security adviser Jake Sullivan – using Signal to discuss sensitive plans as the Trump administration officials did.\n\nSome of the toughest criticism targeted Mr Hegseth, a former Fox News Channel weekend host.\n\nSenator Tammy Duckworth, an Iraq War veteran, said on social media that Mr Hegseth, “the most unqualified Secretary of Defense in history, is demonstrating his incompetence by literally leaking classified war plans in the group chat”.","summary":"The National Security Council said it was looking into how a journalist’s number was added to the chain in the Signal group chat.","url":"https://www.breakingnews.ie/world/trump-officials-texted-war-plans-to-group-chat-that-included-journalist-1744029.html","image":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDNcXFwvMjQyMDU0MDZcXFwvNWU0YWFmOTdlN2I0NDc4NjkyNjA1NmRkNzg2YzMzNjctMS5qcGdcIixcIndpZHRoXCI6NzAwLFwiaG","video":null,"publish_date":"2025-03-24 20:05:51","author":"BreakingNews.ie,Press Association","authors":["BreakingNews.ie","Press Association"],"language":"en","source_country":"ie","sentiment":-0.217},{"id":303707754,"title":"Donald Trump responds to slam George Clooney for speaking out against him in recent interview","text":"President Donald Trump isn't very happy with George Clooney after the actor touched on the 'fake news' narrative pedalled by the Republican.\n\nThe 63-year-old has been a vocal supporter of the Democratic party. In July last year, he wrote an 870-word op-ed for The New York Times, describing himself as a 'lifelong Democrat' and calling for then-President Joe Biden to opt out of running for a second term to give the Democratic Party a better chance at beating Trump.\n\nOf course, that never materialized as the 78-year-old won against Biden's replacement, and vice-president at the time, Kamala Harris at the polls.\n\nNow, after sitting down with CBS' 60 Minutes to talk about his Broadway debut Good Night, and Good Luck, he spoke of the chilling times ahead for the media under the Trump administration.\n\n\"We're seeing this idea of using government to scare or fine or use corporations to make journalists smaller,\" Clooney explained to the news station.\n\n\"Governments don't like the freedom of the press they never have and that goes for whether you are a conservative or a liberal or whatever side you're on they don't like the press.\"\n\nHe referred to Trump's prior lawsuits last year against media publications like ABC News, with the outlet agreeing to pay the POTUS $15 million in a defamation suit after ABC's news anchor, George Stephanopoulos, made the false claim that Trump had been found 'liable for rape' in an interview, the BBC reports.\n\nThe businessman also filed a $20 billion lawsuit against CBS on the unfounded allegation that 60 Minutes had engaged in 'election and voter interference' by editing an interview with Harris to supposedly make him look bad.\n\nIn response, CBS said the plantiff's 'seek to punish a news organization for constitutionally protected editorial judgments they do not like' and lodged a motion to dismiss the lawsuit, all while Paramount - the owner of CBS - attempts to close a merger deal which requires approval from the Trump appointed chair of the Federal Communications Commission.\n\nHitting back at the 60-minute segment on Clooney, Trump took to his social media account on Truth Social, writing: \"Why would the now highly discredited 60 Minutes be doing a total 'puff piece' on George Clooney, a second rate movie 'star,' and failed political pundit. \n\n\"He fought hard for Sleepy Joe’s election and then, right after the Debate, dumped him like a dog.\n\n\"Later, I assume under orders from the Obama camp, pushed all out for 'Kamala,' only to soon realize that that was not going to work out to well.\n\n\"60 Minutes even fraudulently inserted Fake answers into her disastrous interview, aired just before Election Day, in one of the most embarrassing and dishonest events in broadcast history… And now George Clooney again? His press agent should be making a fortune!!!\"\n\nClooney's Broadway production is an adaption of his 2005 drama of the same name, which follows how Senator Joseph McCarthy sensationalized the threat of communism and attempted to fear-monger the public - but for pioneering reporter Edward R. Murrow who exposed him.\n\nSpeaking on to 60 Minutes, he compared how occurs in the play differs to current events, saying: \"Here's where I would tell you where we differ from what Murrow was doing, although McCarthy would try to pose things that he'd show up a blank piece of paper and say I've got a list of names, okay so it was that was his version of fake news.\n\n\"We now are at a place where we found that it's harder, and harder, and harder to discern the truth - facts are now negotiated.\"","summary":"![CDATA[The actor was interviewed by CBS News' 60 Minutes for his Broadway adaptation of his 2005 drama 'Good Night, and Good Luck']]","url":"https://www.unilad.com/news/politics/donald-trump-responds-george-clooney-60-minutes-833306-20250324","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blta493d4aae1575e32/67e1a22076dda65b41515811/donald-trump-george-clooney.jpg","video":null,"publish_date":"2025-03-24 19:49:00","author":"Joe Yates","authors":["Joe Yates"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.175},{"id":303711502,"title":"Trump spoke ‘at length’ with Jeff Bezos about changes to the Washington Post","text":"“I think it’s great. … He’s really trying to be more fair,” Trump said of changes at the outlet.\n\nBezos, who also owns Amazon, announced last month that the outlet’s opinion section would write daily pieces defending “personal liberties and free markets.” He said editorials “opposing those pillars” would prohibited under the new policy for opinion pages.\n\n“At length, I talked to him about it,” Trump said, also acknowledging Democratic backlash against Bezos’s decision to overhaul the opinion section. “He’s a good guy. I didn’t really know him in the first term. … They actually did a couple of bad articles [about him]. He said, ‘This is crazy. I lose my fortune running this thing, and they … you know, they’re out of control.'”\n\nThe two men had dinner together the same night Bezos announced the changes to the opinion pages, Trump revealed, signaling a profound shift in their relationship. Bezos also attended Trump’s inauguration in January and previously dined with the president at his Mar-a-Lago estate in December 2024.\n\nWASHINGTON POST OP-ED EDITOR EXITS AS JEFF BEZOS UNVEILS ‘FREE MARKET’ FOCUS\n\nDuring his recent interview with Travis, Trump also referenced critics of Bezos and touted the shift of support he has witnessed from Big Tech since 2017. “He’s actually a very good guy, I got to know the second time. … If you look at the inauguration at the people that were up on that stage, there was a who’s who of a world that was totally against me the first time. So much different presidency, much more support.”\n\nUnder Bezos’s leadership, the Washington Post also announced in October 2024 that it would not endorse a presidential candidate for the first time since 1988. The outlet had previously typically backed Democrats and had reportedly drafted an endorsement for former Vice President Kamala Harris before scrapping the practice altogether.","summary":"President Donald Trump revealed a conversation he had with&#160;Washington Post owner Jeff Bezos after the latter instituted sweeping changes to the outlet’s opinion pages. During an interview with OutKick radio host Clay Travis over the weekend, the president talked about his relationship with Bezos, one of the richest men in the world, calling him “a [&#8230;]","url":"https://www.washingtonexaminer.com/news/3357319/trump-spoke-jeff-bezos-changes-the-washington-post/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/03/Jeff-Bezos-Trump.webp","video":null,"publish_date":"2025-03-24 19:39:02","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","category":"politics","source_country":"US","sentiment":-0.007},{"id":303711506,"title":"DOGE findings put Democrats in minority of  ‘a 90/10 issue’: Joe Concha","text":"“I had to write this down: menstrual cycles for transgender men, $600,000,” Concha stated on Fox News’s America Reports. “You say, ‘Well, it’s a drop in the bucket when it comes to the federal budget,’ but at the same time, shavings make a pile, and as long as they keep finding these things, they should share it every time, be as transparent as possible because what it does is it puts Democrats on the 10 side of a 90/10 issue.”\n\nAmid DOGE’s cuts, Sen. Rand Paul (R-KY) said he proposed a plan to Elon Musk, who played an influential role in DOGE’s origin, to get back $500 billion that Congress had already passed. Musk expressed enthusiasm for the idea.\n\nConcha also addressed the attacks on Tesla dealerships that are taking place across the country, which many have done to protest Musk’s work with the Trump administration. The senior writer compared those carrying out these attacks to those publicly supporting Luigi Mangione, the 26-year-old accused of killing United Healthcare CEO Brian Thompson, and that the United States is “a sick place” at the moment.\n\nSTAGFLATION CHATTER DOGS TRUMP AGENDA\n\nAdditionally, Concha was confused as to why Gov. Tim Walz (D-MN) was cheering on Tesla’s stock tanking, specifically since the state of Minnesota has invested millions in said stock. He noted, however, that Tesla’s stock is “up 50 points” since Walz’s jab.\n\nThe Minnesota governor attempted to walk back his remark, claiming he was being “a smarta**” and his comment was in jest. White House press secretary Karoline Leavitt dismissed Walz’s initial comment on Tesla, suggesting the governor is living “a sad existence after his devastating defeat on Nov. 5,” referring to how Walz was former Vice President Kamala Harris’s 2024 running mate.","summary":"The Washington Examiner’s Joe Concha assessed how the Trump administration’s continued findings of government waste ought to be continued, as it puts the Democratic Party within “the 10 side” against the majority of the public in support of these cuts. President Donald Trump and his administration unveiled further findings the Department of Government Efficiency has [&#8230;]","url":"https://www.washingtonexaminer.com/news/3357271/doge-findings-put-democrats-in-minority-of-a-90-10-issue-joe-concha/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/03/Trump-DOGE-findings-324-scaled.webp","video":null,"publish_date":"2025-03-24 19:33:21","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.388},{"id":303697546,"title":"Democrats have a new socialist rising star","text":"Like Bernie, Mamdani is a socialist. One of his grand affordability proposals is government-run grocery stores. Instead of decreasing taxes for residents, Mamdani would rather get an inefficient government bureaucracy into an industry with already slim profit margins, where all the losses will be thrown onto taxpayers. Mamdani also wants to increase the corporate tax rate, yet another cost that will be passed on to city residents.\n\nMamdani is a top promoter of the antisemitic “pro-Palestine” movement, including being arrested at a protest outside Senate Minority Leader Chuck Schumer’s (D-NY) home shortly after the Oct. 7 attacks, where Mamdani and others were calling for Israel not to respond to Palestinian terrorists murdering 1,200 civilians. Mamdani peddles claims about a fictional “genocide” against the Palestinians, opposed former President Joe Biden for not being tough enough on Israel, and is backed by antisemitic activist Linda Sarsour.\n\nCUOMO DOMINATES NYC MAYORAL OPPONENTS WITH $3 MILLION HAUL\n\nThis is all part of the appeal. Mamdani is as unapologetically left-wing as they come, but he has fun doing it. Politico’s gushing profile details the “humor” and entertainment factor of Mamdani’s campaign, juxtaposing the scolding progressivism of former Vice President Kamala Harris and the mainstream Democratic Party’s attitude of constant misery. As such, Mamdani offers “another path” where Democrats don’t have to move to the center to meet voters where they are. Why wouldn’t Democrats and liberal media love a campaign they can use to pretend their far-left politics weren’t a driving factor in Democrats’ terrible election performance?\n\nMamdani is an antisemite and an adherent to a failed economic ideology that wants to bring that ideology to a city that has been in constant decline thanks to repeated left-wing failures. He is also the model that many in the Democratic Party and liberal media want to replicate at the national level, with Democrats rejecting moderation and instead masking their loony progressivism with positivity rather than the smarmy lectures that have become the core messaging of the party.","summary":"While Democrats are in the midst of an identity crisis with no real leader for the party, the first new “rising star” of the second Trump era is hitting the stage in New York City. Zohran Mamdani, a New York assemblyman running for mayor of New York City, is the subject of the newest Democratic [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/beltway-confidential/3357123/democrats-have-a-new-socialist-rising-star-zohran-mamdani/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2023/10/istock-974693994.jpg","video":null,"publish_date":"2025-03-24 19:21:38","author":"Zachary Faria","authors":["Zachary Faria"],"language":"en","category":"politics","source_country":"US","sentiment":-0.365},{"id":303686722,"title":"Lobbyist And Government Contractor Bought JD Vance’s Home For $170,000 Over Asking Price","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nA government contractor and lobbyist who served in President Donald Trump’s first administration bought Vice President JD Vance’s Virginia home in an above-market deal, a sale his spokesperson says was based on the market.\n\nVice President JD Vance introduces President Donald Trump's nominee to be under secretary of defense ... More for policy, Elbridge Colby, during his confirmation hearing in March. (Photo by Chip Somodevilla/Getty Images)\nGetty Images\n\nA company registered in Nevada named 9 EDR LLC, with Christopher Garcia listed as its managing member, purchased Vance’s home in Alexandria, Virginia on March 14 for $1.9 million—about $170,000 over the asking price, according to government records and real estate listings.\n\nGarcia served as a political appointee in Trump’s Commerce Department from 2017 to 2018—The Washington Post reported at the time that he left after being denied a permanent security clearance, a report a spokesperson for Garcia told Forbes was “categorically false.”\n\nGarcia is now the CEO of Health Supply US, which has received $179 million in government contracts, primarily from the Departments of Defense and Homeland Security for personal protective equipment.\n\nGarcia is also a consultant for the Livingston Group, a government relations firm, where he helps “clients in navigating complex domestic and international business and policy arenas,” although Senate records show he has not registered as a lobbyist since 2021.\n\nA spokesperson for Garcia told Forbes that the purchase was an arm’s-length transaction and the offer was based solely on market factors, adding that Garcia has no relationship with the seller and there was never any direct communication between the two.\n\nA spokesperson for Vance did not respond to a request for comment.\n\nWhy Did Garcia Buy Vance’s House?\n\nGarcia’s spokesperson said the purchase had no connection to his government work or political ties, and called any suggestion otherwise incorrect. Vance’s home went on the market in February, shortly after he was sworn in as vice president and moved into the official residence at the U.S. Naval Observatory.\n\nKey Background\n\nWhile Vance lived there, the home was owned by a shell company called Del Ray Farmhouse LLC. That company was formed in Delaware in January 2023 and registered to do business in Virginia weeks later, just before buying the property. On its business registration in Virginia, the LLC’s principal office address is listed as the home’s address. Government documents from the business’s registrations and the real estate transactions do not associate any individuals with the LLC, but neighbors confirmed to Forbes that Vance lived there and believe he is the beneficial owner.\n\nDespite the sale price being $170,000 over asking, Garcia did not appear to pay more than the market price for the home. The $1.9 million purchase price works out to $642 per square foot—below the $741 per square foot average of 10 comparable Alexandria homes sold in 2024, according to city data.\n\n$1.3 million: The amount Health Supply US has spent lobbying the federal government since 2021, according to disclosures filed with the Senate.\n\nForbes Valuation\n\nVance was worth an estimated $10 million as of November 2024, according to Forbes calculations.\n\nSurprising Fact\n\nAlexandria is a liberal city, with then-Vice President Kamala Harris capturing 77% of the vote in 2024. When Forbes asked a neighbor in 2024 if Vance had friends in the area, they replied, “No, God, no, no.”\n\nEarlier this month, Trump ordered the Minority Business Development Agency—the office Garcia briefly led during his Commerce Department tenure—to be eliminated to the fullest extent allowed by law.\n\nFurther Viewing\n\nFurther Reading\n\nJD Vance Posts Meme Of Himself—As Largely Unflattering Vance Memes Flood Social Media (Forbes)\n\nThiel Was Good For $10 Million, But J.D. Vance’s Other Billionaire Backers Were Good For Nothing (Forbes)\n\nHere Are J.D. Vance’s Biggest Billionaire Donors (Forbes)\n\nJD Vance Says It’s Time For Government And Tech Interests To Align (Forbes)\n\nGreenland Leader Says Upcoming Visit By Trump Officials And Usha Vance Is ‘Clear Provocation’ (Forbes)\n\nAn Arms Dealer, an Ex-N.F.L. Player and Huge Federal Contracts for Medical Gowns (New York Times)\n\nFollow me on LinkedIn. Check out my website. Send me a secure tip. \n\nZach Everson\n\nEditorial Standards\n\nForbes Accolades","summary":"The buyer, a Trump appointee during his first term, denies any political motive—calling the $1.9 million deal purely market-driven.","url":"https://www.forbes.com/sites/zacheverson/2025/03/24/jd-vance-house-sale-government-contractor-lobbyist-trump/","image":"https://imageio.forbes.com/specials-images/imageserve/67e1a5c564937928140af27a/0x0.jpg?format=jpg&crop=1323,882,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-03-24 19:11:50","author":"Forbes Staff,Zach Everson","authors":["Forbes Staff","Zach Everson"],"language":"en","source_country":"US","sentiment":-0.139},{"id":303701572,"title":"Vulnerable Democrat Representative’s New Rhetoric On Gender Ideology Doesn’t Match Left-Wing Voting Record","text":"Democratic Maine Rep. Jared Golden’s new rhetoric opposing efforts in his home state pushing extreme gender ideology notably departs from his left-wing voting record.\n\nGolden, a vulnerable Democratic incumbent, told the Daily Caller News Foundation in a statement that he opposes a legislative effort from Maine State Democratic lawmakers to provide free menstrual products in boys’ middle school and high school bathrooms among the state’s public schools. He also told the DCNF that boys should not compete in girls’ sports despite previously voting against legislation seeking to bar transgender athletes from girls and women’s sports as recently as February. (RELATED: Florida Governor Ron DeSantis Returns Nearly $1 Billion In ‘Unused’ Federal Funds After Meeting With Elon Musk)\n\n“Although some in the news business fail to understand the difference between Capitol Hill and Augusta (Maine’s State Capital), Congressman Golden is of the opinion that boys shouldn’t compete in girls’ sports, menstrual products shouldn’t be in boys’ bathrooms, and members of Congress shouldn’t stick their noses into state legislative debates,” a spokesperson for Golden told the Daily Caller News Foundation.\n\nGolden’s answer came in response to a DCNF inquiry about whether the Congressman supported a bill from Democratic Maine state lawmakers to require free menstrual products in all school bathrooms from grades 6 to 12, impacting boys as young as 11 years-old.\n\nA similar bill that failed to advance out of Maine’s state legislature during the previous session would have cost Maine taxpayers $273,000 annually to fund the free tampon measure.\n\nDemocrats’ support for menstrual products in boys’ bathrooms became an issue during the 2024 presidential campaign when Republicans criticized Democratic Minnesota Gov. Tim Walz for signing a bill in 2023 to require tampons be provided in school bathrooms to students in grades four through 12 regardless of biological sex.\n\nThough Golden said he did not support providing tampons in boys’ bathrooms, the Maine Democrat previously voted for legislation that would have opened the door to policies funding menstrual products in all school bathrooms regardless of biological sex.\n\nThe Maine Democrat has been largely silent on his state’s leftward drift on transgender issues despite President Donald Trump’s executive orders on protecting women’s sports and rolling back the federal government’s recognition of gender identity. Maine Democratic Gov. Janet Mills notably caved to pressure from the Trump administration to comply with Title IX and bar transgender athletes from women’s sports or lose federal funding following a heated exchange at the White House in February.\n\nGolden voted in support of the Equality Act in 2019 and 2021 when Democrats controlled the House and cosponsored the left-wing bill during the 118th Congress after it was reintroduced in June 2023. The Equality Act would have expanded civil rights protections to include nondiscrimination on the basis of gender identity and sexual orientation, giving biological males access to female-only spaces such as locker rooms and bathrooms.\n\nThe vulnerable congressman has been a member of the Congressional Equality Caucus (CEC) since his election to Congress in 2019. Though the CEC has not released its policy priorities for the 119th Congress thus far, the caucus has a long record of pushing far-left gender ideology and has fiercely criticized the Trump administration’s efforts to uphold women’s Title IX rights and protect their access to female-only spaces. He notably rejoined the equality caucus for the 119th Congress that began in January, according to a CEC press release.\n\nThe Maine Democrat told the DCNF that biological males should not participate in girls sports despite previously voting twice against the Protection of Women and Girls in Sports Act.\n\nThe bill would have interpreted Title IX to impose a categorical ban on biological males from competing in girls and women’s sports at scholastic events and would have withheld federal funds from schools that refuse to comply.\n\nGolden also appears to have walked back a previous statement advocating for exceptions to allow transgender athletes’ participation in girls’ and women’s sports.\n\n“It would also be wrong to exclude trans kids from sports entirely,” Golden wrote in a Substack blog post describing his views on transgender athletes and Title IX protections in women’s sports Feb. 25. “But the current system of letting kids change teams based simply on gender self-identification sets the bar too low to justify infringing on girls’ Title IX rights. A better balance is needed.”\n\nGolden did not add any nuance to his statement to the DCNF attempting to carve out exceptions to a categorical ban on biological males’ participation in girls and women’s sports.\n\n“[B]oys should not compete in girls’ sports,” Golden’s statement said in part.\n\nGolden’s voting history to oppose legislation seeking to protect women’s sports is out of step with a majority of Americans’ beliefs on transgender issues.\n\nApproximately 79% of Americans oppose biological males competing in women’s sports, according to a New York Times-Ipsos survey conducted between Jan. 2 and Jan. 10.\n\nNearly 70% of Democrats or participants who “lean Democrat” told the Times they opposed transgender athletes competing in women’s sports.\n\n“Parents overwhelmingly agree that forcing gender ideology on kids is unacceptable and they’re fed up with activists who pretend biology isn’t real,” Alleigh Marré, executive director of American Parents Coalition, told the DCNF. “From boys in girls’ sports and locker rooms to tampons in boys’ bathrooms — families have had enough.”\n\n“Out of touch doesn’t begin to describe their [Maine Democratic lawmakers’] continued actions,” Marré continued. “It is time for our leaders to listen to parents and families.”\n\nHouse Republicans’ campaign arm hit Golden for appearing to moderate his views on transgender policies despite his left-wing voting record opposing efforts to protect women’s sports.\n\n“Serial flip-flopper Jared Golden has voted time and again to push radical gender ideology on kids,” National Republican Congressional Committee (NRCC) spokeswoman Maureen O’Toole told the DCNF. “Now, he’s shamelessly trying to change his tune to score political points. If he really cared about Maine’s kids and keeping far-left policies out of their bathrooms, he’d be fighting like hell to reverse his state’s policy allowing men in girls’ sports.”\n\nGolden is one of 13 House Democrats representing districts Trump won in November. The president beat former Vice President Kamala Harris by roughly nine points in Golden’s district while he bested his Republican challenger by less than a percentage point. The president also won Golden’s district in 2016 and 2020.\n\nThe NRCC listed Golden as one of 26 Democratic incumbents the House GOP’s campaign arm is looking to defeat during the midterms.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Time and again to push radical gender ideology on kids'","url":"https://dailycaller.com/2025/03/24/vulnerable-democrat-representatives-new-rhetoric-on-gender-ideology-doesnt-match-left-wing-voting-record/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/03/Jared-Golden-e1742823782738.jpg","video":null,"publish_date":"2025-03-24 18:58:47","author":"Adam Pack","authors":["Adam Pack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.358},{"id":303697552,"title":"The hypocrisy of the Louisiana gerrymandering case","text":"The new congressional delegation is actually a fair representation of the statewide popular vote, with Republicans getting 65.5% of the congressional vote and 66.67% of the seats. The new district, however, may conflict with the equal protection clause of the 14th Amendment, which limits the use of race as a factor in redistricting.\n\nRather than gerrymander based on race, Louisiana should look to draw a map that best reflects the state’s voting patterns as a whole.\n\nDemocrats are quick to complain about Republican instances of gerrymandering, such as in the recent cases of Alabama and North Carolina. Democrat-controlled states, however, also have district lines that put their party at an advantage. Republicans won 39% of the congressional popular vote in California but only nine out of 52 available seats, or 17% of the congressional delegation. Under ideal circumstances, Republicans should have won around 20 seats. An 11-seat difference in California seems like it should be a greater cause for concern than a one-seat difference in Louisiana.\n\nIllinois was even worse, percentage-wise, with 47% of the vote translating to 18% of House seats for Republicans. New York, which had 43% of the vote translate to 42% of seats in 2022, redrew its district map to give Republicans 27% of the seats for a 42% share of the vote in 2024. House seats don’t need to reflect the state’s popular vote exactly, but they should be closer.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nIn some states, it is nearly impossible to give the minority party a seat. For example, every county in Oklahoma voted for President Donald Trump, and every county in Massachusetts voted for former Vice President Kamala Harris. Although Massachusetts is the more populous state, the effects essentially cancel each other out.\n\nWith the close balance of power in recent elections, congressional district maps become even more important. A handful of gerrymandered districts can easily shift control of the House to a different party. If Democrats want to complain about gerrymandered districts, they should fix their own states first.","summary":"The Supreme Court heard the case of Louisiana v. Callais, which deals with alleged racial gerrymandering in Louisiana. Louisiana has six congressional districts, four of which are Republican-controlled and two of which are Democrat-controlled. For the 2024 election, Democrats sued to redraw the district map, claiming racial gerrymandering. The U.S. Court of Appeals for the [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/beltway-confidential/3356685/hypocrisy-louisiana-gerrymandering-case/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/02/Screenshot-2024-02-02-at-9.27.36 PM-e1706927520453.png","video":null,"publish_date":"2025-03-24 18:38:16","author":"Christian Papillon","authors":["Christian Papillon"],"language":"en","category":"politics","source_country":"US","sentiment":-0.127},{"id":303690830,"title":"LIVE | US President Donald Trump delivers remarks with Louisiana Governor Jeff Landry","text":"LIVE | US President Donald Trump delivers remarks with Louisiana Governor Jeff Landry\n\nET Online | 24 Mar 2025, 11:52 PM IST\n\nU.S. President Donald Trump and the Governor of Louisiana, Jeff Landry, deliver remarks.\n\nPost a Comment\n\nRead more on\n\ndonald trump\n\nus president\n\nlouisiana governor\n\njeff landry\n\nRelated Videos\n\nWho is Badar Khan Suri, Indian student accused of having Palestinian ties?\n\nTerror attack in Israel: Gunman rams bus stop, open fire on cars in Haifa; 1 killed\n\nCanada Elections LIVE | Pierre Poilievre kicks off Conservative poll campaign, vows to fight Trump\n\n‘He should be disbarred…’: Trump's fierce attack on Judge Boasberg over Venezuelan deportation order\n\n‘Provocation’: Greenland slams US ahead of Usha Vance’s 'uninvited' visit amid Trump’s takeover push\n\n'Until Hamas returns our hostages…': Israel issues fierce warning at United Nations Security Council\n\nTrump dominates Canada election campaign; Carney & Poilievre clash over US tariffs in fiery showdown\n\nTrump-brokered peace by Easter in Russia-Ukraine? Moscow, Kyiv hold parallel talks with US in Saudi\n\n‘Jared should be ashamed’: Trump slams Gov Polis over ‘worst’ portrait in Colorado state Capitol\n\nKunal Kamra row: Mumbai Police Arrests 11 people in connection with vandalism of Habitat Studio\n\nVenezuelan deportation flights resume as first plane arrives under new US-Venezuela agreement\n\n‘Will bring home the Canadian promise’, says Pierre Poilievre as he kicks off his PM campaign\n\nIsraeli airstrike kills Hamas' political bureau member 'Ismail Barhoum' in Gaza's Nasser hospital\n\nTrump's fresh advice to Kamala Harris ahead of potential California Governor run: 'Start doing interviews'\nViews: 1679\n\nUS VP's wife Usha Vance set to visit Greenland amid tensions over Donald Trump's annexation plans\n\nUS airstrike in Sanaa kills 1, injures 13; destroys building in retaliation to Houthi Red Sea threat\n\nLIVE | Venezuela resumes US deportation flights after Trump’s Alien Enemies Act triggers transfers\n\nHomeland Security Secy Kristi Noem to visit El Salvador prison that took in hundreds of deported criminals\n\nCanadian PM Mark Carney calls snap election for April 28 amid Trump’s annexation threats\n\nIDF strike in south Gaza kills senior Hamas leader Salah al-Bardawil\n\nPope making first public appearance before hospital discharge, return to Vatican\n\nIsrael claims to intercept missile from Yemen amid regional tension over Gaza war\n\nPope Francis to be discharged from hospital after five weeks battling Pneumonia\n\nUkraine’s Capital Kyiv hit by Russian drone attack; two dead, dozens evacuated\n\nHamas claims Israeli airstrike killed its political leader Salah Al-Bardaweel in Gaza’s Khan Younis\n\nJessica Aber: Biden appointee former US attorney, who resigned when Trump took office, found dead at 43\nViews: 6044\n\nTrump, Musk attend NCAA wrestling championships in Philadelphia\n\nTurkey on boil: President Erdogan calls protestors 'street terrorists' as massive protests continue for 4th day\n\nElon Musk visits Pentagon; President Trump calls secret US-China war plan report 'Fake News'\n\n‘Make a deal or else…’: Trump threatens Iran with military action over nuclear deal standoff\nViews: 1440\n\nUS immigration crackdown | Trump ends legal status for 530,000+ migrants from Cuba, Haiti, Venezuela\nViews: 17427\n\nRussian drone attack in Ukraine: Zelenskiy visits troops in Donetsk, praises their efforts\n\nTrump pulls security clearances for Biden, Harris & Clinton, denies access to classified information\n\n'I'm not going to speak': State Dept spokesperson grilled as Trump deports hundreds to El Salvador\n\nTrump breaks silence on Russia-Ukraine war: ‘Putin wouldn't be worried without...’ | Full speech\n\nIsrael launches strikes on Lebanon after rocket attack, threatens fragile ceasefire with Hezbollah\n\nChina ready to invade Taiwan? Taipei warns: 47 Chinese jets, 7 warships spotted near island’s shores\nViews: 2555\n\nWho killed Kennedy? Donald Trump reacts to reporter’s question on JFK assassination files\n\nRussia claims to shoot down Ukraine’s warplane, 1100 Ukrainian drones downed\n\nKim Jong Un says North Korea will keep supporting Russia, state media reports","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/live-us-president-donald-trump-delivers-remarks-with-louisiana-governor-jeff-landry/videoshow/119438971.cms","image":"https://img.etimg.com/thumb/msid-119438971,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-119438971,imgsize-97080.cms","publish_date":"2025-03-24 18:22:45","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.188},{"id":303672576,"title":"LIVE | US State Department spokesperson Tammy Bruce holds press briefing","text":"LIVE | US State Department spokesperson Tammy Bruce holds press briefing\n\nET Online | 24 Mar 2025, 11:37 PM IST\n\nUS State Department spokesperson Tammy Bruce holds a press briefing.\n\nPost a Comment\n\nRead more on\n\nus state department\n\ntammy bruce\n\nstate department\n\nRelated Videos\n\nWho is Badar Khan Suri, Indian student accused of having Palestinian ties?\n\nTerror attack in Israel: Gunman rams bus stop, open fire on cars in Haifa; 1 killed\n\nCanada Elections LIVE | Pierre Poilievre kicks off Conservative poll campaign, vows to fight Trump\n\n‘He should be disbarred…’: Trump's fierce attack on Judge Boasberg over Venezuelan deportation order\n\n‘Provocation’: Greenland slams US ahead of Usha Vance’s 'uninvited' visit amid Trump’s takeover push\n\n'Until Hamas returns our hostages…': Israel issues fierce warning at United Nations Security Council\n\nTrump dominates Canada election campaign; Carney & Poilievre clash over US tariffs in fiery showdown\n\nTrump-brokered peace by Easter in Russia-Ukraine? Moscow, Kyiv hold parallel talks with US in Saudi\n\n‘Jared should be ashamed’: Trump slams Gov Polis over ‘worst’ portrait in Colorado state Capitol\n\nKunal Kamra row: Mumbai Police Arrests 11 people in connection with vandalism of Habitat Studio\n\nVenezuelan deportation flights resume as first plane arrives under new US-Venezuela agreement\n\n‘Will bring home the Canadian promise’, says Pierre Poilievre as he kicks off his PM campaign\n\nIsraeli airstrike kills Hamas' political bureau member 'Ismail Barhoum' in Gaza's Nasser hospital\n\nTrump's fresh advice to Kamala Harris ahead of potential California Governor run: 'Start doing interviews'\nViews: 1679\n\nUS VP's wife Usha Vance set to visit Greenland amid tensions over Donald Trump's annexation plans\n\nUS airstrike in Sanaa kills 1, injures 13; destroys building in retaliation to Houthi Red Sea threat\n\nLIVE | Venezuela resumes US deportation flights after Trump’s Alien Enemies Act triggers transfers\n\nHomeland Security Secy Kristi Noem to visit El Salvador prison that took in hundreds of deported criminals\n\nCanadian PM Mark Carney calls snap election for April 28 amid Trump’s annexation threats\n\nIDF strike in south Gaza kills senior Hamas leader Salah al-Bardawil\n\nPope making first public appearance before hospital discharge, return to Vatican\n\nIsrael claims to intercept missile from Yemen amid regional tension over Gaza war\n\nPope Francis to be discharged from hospital after five weeks battling Pneumonia\n\nUkraine’s Capital Kyiv hit by Russian drone attack; two dead, dozens evacuated\n\nHamas claims Israeli airstrike killed its political leader Salah Al-Bardaweel in Gaza’s Khan Younis\n\nJessica Aber: Biden appointee former US attorney, who resigned when Trump took office, found dead at 43\nViews: 6044\n\nTrump, Musk attend NCAA wrestling championships in Philadelphia\n\nTurkey on boil: President Erdogan calls protestors 'street terrorists' as massive protests continue for 4th day\n\nElon Musk visits Pentagon; President Trump calls secret US-China war plan report 'Fake News'\n\n‘Make a deal or else…’: Trump threatens Iran with military action over nuclear deal standoff\nViews: 1440\n\nUS immigration crackdown | Trump ends legal status for 530,000+ migrants from Cuba, Haiti, Venezuela\nViews: 17427\n\nRussian drone attack in Ukraine: Zelenskiy visits troops in Donetsk, praises their efforts\n\nTrump pulls security clearances for Biden, Harris & Clinton, denies access to classified information\n\n'I'm not going to speak': State Dept spokesperson grilled as Trump deports hundreds to El Salvador\n\nTrump breaks silence on Russia-Ukraine war: ‘Putin wouldn't be worried without...’ | Full speech\n\nIsrael launches strikes on Lebanon after rocket attack, threatens fragile ceasefire with Hezbollah\n\nChina ready to invade Taiwan? Taipei warns: 47 Chinese jets, 7 warships spotted near island’s shores\nViews: 2555\n\nWho killed Kennedy? Donald Trump reacts to reporter’s question on JFK assassination files\n\nRussia claims to shoot down Ukraine’s warplane, 1100 Ukrainian drones downed\n\nKim Jong Un says North Korea will keep supporting Russia, state media reports","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/live-us-state-department-spokesperson-tammy-bruce-holds-press-briefing/videoshow/119438466.cms","image":"https://img.etimg.com/thumb/msid-119438466,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-119438466,imgsize-63890.cms","publish_date":"2025-03-24 18:07:26","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.13},{"id":303692986,"title":"EXCLUSIVE: Did Tiffany Trump Plump Her Lips While PREGNANT? Top Doc Tells All on Her 'Unrecognizable' Look... And Reveals the TRUTH About Those Plastic Surgery Rumors","text":"Tiffany Trump's lips have created buzz surrounding a possible pout upgrade – but the recent change may just be \"au naturale\" after all.\n\nAfter critics suggested Donald Trump's 31-year-old daughter had gotten lip fillers last week, a plastic surgery expert exclusively told RadarOnline.com her fuller lips were most likely a result of pregnancy swelling.On Friday, Tiffany set her comments section ablaze with an \"unrecognizable\" Instagram selfie, leaving some critics slamming her for getting \"too much lip filler.\"\n\nDespite rumors of a \"whole new face,\" plastic surgery expert Dr. Giselle Prado-Wright has dismissed the idea that the politician's daughter has undergone any cosmetic procedures recently.The driving force behind Prado-Wright's comments? Tiffany is currently pregnant with her and husband Michael Boulos' first child – and some swelling is to be expected.\n\nShe told us: \"As a cosmetic surgeon with a busy injectables practice, I can confidently say that the fullness in Tiffany Trump’s lips is almost certainly due to pregnancy-related swelling.\"It's extremely unlikely that any reputable injector would administer lip filler to someone who is pregnant, as it’s generally considered unsafe and unethical.\"\n\nPrado-Wright continued: \"Hormonal changes and fluid retention are very real and very visible during this time, and I believe that’s what we’re seeing in her recent photos.\"While Tiffany was bashed in her comments section, some fans also came to her rescue with similar beliefs as Dr. Prado-Wright.\n\nOne said: \"Sometimes during pregnancy women’s lips get fuller. Nothing to do with surgery. Legit called pregnancy lips.\"At a campaign event in Detroit on October 10, President Trump, 78, first announced his youngest daughter was expecting a baby.\n\nDuring his speech, Trump acknowledged several people in the crowd – including his daughter’s father-in-law, Dr. Massad Boulos.The president said: \"He happens to be the father of Tiffany's husband, Michael, who's a very exceptional young guy. And she's an exceptional young woman. \n\n\"And she's going to have a baby. So that's nice.\"Tiffany and Michael, who tied the knot in November 2022, originally met in the summer of 2018 at Lindsay Lohan's beach club in Mykonos, Greece.\n\nBy January 2019, they had gone public with their relationship.While Tiffany herself has not yet responded to the plastic surgery speculation, RadarOnline.com revealed earlier this year the Trump dynasty is rumored to have spent $1million on cosmetic procedures over the years.\n\nCelebrity plastic surgeon Dr. Gary Motykie, who clarified he has never treated anyone in the Trump family, explained how once one family member undergoes plastic surgery, others are likely to follow.Dr. Motykie speculated Tiffany may have undergone a nose job, lip and cheek fillers, and veneers – potentially totaling up to $100,000.\n\nHe also noted her facial changes could have been due to subtle enhancements for shaping and balance.In November, plastic surgery expert Mark Solomos drew comparisons between Tiffany's current appearance and her look when she first gained attention.\n\nHe said: \"Tiffany has always had quite full cheeks so it’s tricky to say if she’s used any form of filler, but I do suspect she’s had some Botox around the forehead, eyes and around the nose area.\"A the time, Dr. Solomos also speculated Tiffany may have undergone a \"lip flip\" – a procedure where a small amount of Botox is injected into the muscles around the upper lip.\n\nHe noted: \"This relaxes said muscles causing the lip to flip and appear fuller.\"Tiffany, who stayed largely out of the public eye until her father's first presidential campaign, gained attention amid rumors of a strained relationship with him. \n\nDespite this, she maintained they were close. \n\nTiffany later gained prominence supporting his campaigns, including his 2024 victory over VP Kamala Harris.","summary":"Plastic surgery experts have weighed in on Tiffany Trump's 'whole new face' after some critics called her for getting 'too much lip filler' in a recent selfie.","url":"https://radaronline.com/p/tiffany-trump-pregnant-lip-filler-plastic-surgery-rumors-experts/","image":"https://media.radaronline.com/brand-img/MqikqYyrd/0x0/tiffany-trump-pregnant-lip-filler-plastic-surgery-rumors-experts-pp-1742826828700.jpg","video":null,"publish_date":"2025-03-24 18:00:00","author":"Juliane Pettorossi","authors":["Juliane Pettorossi"],"language":"en","source_country":"us","sentiment":0.076},{"id":303672580,"title":"LIVE | US President Donald Trump holds cabinet meeting","text":"LIVE | US President Donald Trump holds cabinet meeting\n\nET Online | 24 Mar 2025, 11:05 PM IST\n\nUS President Donald Trump speaks during a Cabinet meeting.\n\nPost a Comment\n\nRead more on\n\ntrump cabinet\n\ndonald tump\n\nus president\n\nRelated Videos\n\nWho is Badar Khan Suri, Indian student accused of having Palestinian ties?\n\nTerror attack in Israel: Gunman rams bus stop, open fire on cars in Haifa; 1 killed\n\nCanada Elections LIVE | Pierre Poilievre kicks off Conservative poll campaign, vows to fight Trump\n\n‘He should be disbarred…’: Trump's fierce attack on Judge Boasberg over Venezuelan deportation order\n\n‘Provocation’: Greenland slams US ahead of Usha Vance’s 'uninvited' visit amid Trump’s takeover push\n\n'Until Hamas returns our hostages…': Israel issues fierce warning at United Nations Security Council\n\nTrump dominates Canada election campaign; Carney & Poilievre clash over US tariffs in fiery showdown\n\nTrump-brokered peace by Easter in Russia-Ukraine? Moscow, Kyiv hold parallel talks with US in Saudi\n\n‘Jared should be ashamed’: Trump slams Gov Polis over ‘worst’ portrait in Colorado state Capitol\n\nKunal Kamra row: Mumbai Police Arrests 11 people in connection with vandalism of Habitat Studio\n\nVenezuelan deportation flights resume as first plane arrives under new US-Venezuela agreement\n\n‘Will bring home the Canadian promise’, says Pierre Poilievre as he kicks off his PM campaign\n\nIsraeli airstrike kills Hamas' political bureau member 'Ismail Barhoum' in Gaza's Nasser hospital\n\nTrump's fresh advice to Kamala Harris ahead of potential California Governor run: 'Start doing interviews'\nViews: 1679\n\nUS VP's wife Usha Vance set to visit Greenland amid tensions over Donald Trump's annexation plans\n\nUS airstrike in Sanaa kills 1, injures 13; destroys building in retaliation to Houthi Red Sea threat\n\nLIVE | Venezuela resumes US deportation flights after Trump’s Alien Enemies Act triggers transfers\n\nHomeland Security Secy Kristi Noem to visit El Salvador prison that took in hundreds of deported criminals\n\nCanadian PM Mark Carney calls snap election for April 28 amid Trump’s annexation threats\n\nIDF strike in south Gaza kills senior Hamas leader Salah al-Bardawil\n\nPope making first public appearance before hospital discharge, return to Vatican\n\nIsrael claims to intercept missile from Yemen amid regional tension over Gaza war\n\nPope Francis to be discharged from hospital after five weeks battling Pneumonia\n\nUkraine’s Capital Kyiv hit by Russian drone attack; two dead, dozens evacuated\n\nHamas claims Israeli airstrike killed its political leader Salah Al-Bardaweel in Gaza’s Khan Younis\n\nJessica Aber: Biden appointee former US attorney, who resigned when Trump took office, found dead at 43\nViews: 6044\n\nTrump, Musk attend NCAA wrestling championships in Philadelphia\n\nTurkey on boil: President Erdogan calls protestors 'street terrorists' as massive protests continue for 4th day\n\nElon Musk visits Pentagon; President Trump calls secret US-China war plan report 'Fake News'\n\n‘Make a deal or else…’: Trump threatens Iran with military action over nuclear deal standoff\nViews: 1440\n\nUS immigration crackdown | Trump ends legal status for 530,000+ migrants from Cuba, Haiti, Venezuela\nViews: 17427\n\nRussian drone attack in Ukraine: Zelenskiy visits troops in Donetsk, praises their efforts\n\nTrump pulls security clearances for Biden, Harris & Clinton, denies access to classified information\n\n'I'm not going to speak': State Dept spokesperson grilled as Trump deports hundreds to El Salvador\n\nTrump breaks silence on Russia-Ukraine war: ‘Putin wouldn't be worried without...’ | Full speech\n\nIsrael launches strikes on Lebanon after rocket attack, threatens fragile ceasefire with Hezbollah\n\nChina ready to invade Taiwan? Taipei warns: 47 Chinese jets, 7 warships spotted near island’s shores\nViews: 2555\n\nWho killed Kennedy? Donald Trump reacts to reporter’s question on JFK assassination files\n\nRussia claims to shoot down Ukraine’s warplane, 1100 Ukrainian drones downed\n\nKim Jong Un says North Korea will keep supporting Russia, state media reports","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/live-us-president-donald-trump-holds-cabinet-meeting/videoshow/119437359.cms","image":"https://img.etimg.com/thumb/msid-119437359,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-119437359,imgsize-47222.cms","publish_date":"2025-03-24 17:35:38","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.171},{"id":303656696,"title":"Donald Trump calls George Clooney a 'second-rate movie star' and 'failed political pundit' after the actor defends free press","text":"Donald Trump lashed out at George Clooney's comments about free press in the latest episode of 60 Minutes.\n\n The president called the Academy Award winner a \"second-rate movie star\" and \"failed political pundit\" after Clooney, who will portray pioneering broadcast journalist Edward R. Murrow in his Broadway debut, paralleled the themes of the upcoming stage production to the state of press today.\n\n In a post shared on Truth Social after the segment aired on Sunday, Trump questioned why the \"highly discredited\" 60 Minutes would do a \"total puff piece\" on the \"second-rate movie star\" and \"failed political pundit.\"\n\n \"He fought hard for Sleepy Joe’s election and then, right after the debate, dumped him like a dog,\" he continued. \"Later, I assume under orders from the Obama camp, pushed all out for Kamala, only to soon realize that that was not going to work out [too] well.\"\n\n Trump then claimed 60 Minutes \"fraudulently inserted fake answers into\" Kamala Harris' \"disastrous interview, aired just before Election Day, in one of the most embarrassing and dishonest events in broadcast history. And now George Clooney again? His press agent should be making a fortune!!!\"\n\n Clooney's reps didn't immediately respond to Entertainment Weekly's request for comment about the Truth Social post.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n The 60 Minutes segment featured Clooney at a table read in downtown Manhattan with cast and crew, where he addressed the show's parallels to the state of media today. \"When the other three estates fail, when the judiciary and the executive and the legislative branches fail us, the fourth estate has to succeed,\" Clooney said. \"Has to succeed, as 60 Minutes is here right now on our first day.\"\n\n These are chilling times for the media, said Clooney, whose father, Nick Clooney, was a longtime journalist and anchorman for WKRC in Cincinnati. He made note of the fact that ABC just settled a lawsuit with the Trump administration and CBS News is in the middle of a similar process, referencing Trump's $20 billion lawsuit against the latter news organization that accuses CBS of election interference. CBS has since filed a motion to dismiss the lawsuit.\n\n \"We're seeing this idea of using government to scare or fine or use corporations to make journalists smaller,\" Clooney told journalist Jon Wertheim on 60 Minutes. \"Governments don't like the freedom of the press. They never have. And that goes for whether you are a conservative or a liberal or whatever side you're on. They don't like the press.\"\n\n The actor added, \"Journalism and telling truth to power has to be waged like war is waged. It doesn't just happen accidentally. You know, it takes people saying, we're gonna do these stories and you're gonna have to come after us. And that's the way it is.\"\n\n Elsewhere, Clooney, a longtime Democrat who has backed the likes of Barack Obama and Joe Biden, said he had no regrets about his headline-making essay that called for Biden to drop out of the race for re-election last year. \"I was raised to tell the truth,\" Clooney said. \"I had seen the president up close for this fundraiser, and I was surprised. And so I feel as if there was a lot of profiles in cowardice in my party through all of that. And I was not proud of that. And I also believed I had to tell the truth.\"","summary":"\"We're seeing this idea of using government to scare or fine or use corporations to make journalists smaller,\" the actor, who plays pioneering journalist Edward R. Murrow on Broadway, said on \"60 Minutes.\"","url":"https://ew.com/donald-trump-responds-george-clooney-60-minutes-interview-free-press-11702167","image":"https://ew.com/thmb/eY1c1v49QMrvuhBeF0HUMrLM8Vc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/george-clooney-donald-trump-60-minutes-032425-ba6e6332fe804cf8a4bad5038a0922ea.jpg","video":null,"publish_date":"2025-03-24 17:20:08","author":"Jessica Wang","authors":["Jessica Wang"],"language":"en","category":"politics","source_country":"US","sentiment":-0.097},{"id":303681046,"title":"RFK Jr.'s former running mate rules out 2026 CA governor run, hints at activism: 'Watching closely'","text":"Nicole Shanahan, Silicon Valley philanthropist and Robert F. Kennedy's running mate during his 2024 presidential race, has ruled out a gubernatorial run in California for the 2026 election to replace the termed-out liberal Democratic Gov. Gavin Newsom. Shannahan made the announcement Friday on Steve Hilton's podcast when asked about her priorities in the Golden State. \"My priorities are and, you know, Steve, I'm just gonna share with you now; I'm giving you the exclusive. I'm not running for governor in 2026,\" Shanahan told Hilton, a Fox News contributor. SCORCHED-EARTH SHANAHAN: RFK JR'S FORMER RUNNING MATE THREATENS POLITICAL WAR AGAINST CONFIRMATION OPPONENTS \"I believe that my job in 2026 is to get people to break out of their political orthodoxy, to think about what is really in the best interest of California,\" she said. \"I am not a Democrat, I am not a Republican, I am an independent, and I'm here to support the revival of California.\" She continued, saying \"now is the time for people to step up\" and that she will be \"watching closely\" and \"supporting\" individuals who \"continue to be brave enough to stand up against harmful political ideology to do what is right for the people.\" Shanahan has been involved in several political efforts in California, including being a major donor in the effort to recall Los Angeles Mayor Karen Bass. TRUMP SURROGATE CORRIN RANKIN PICKED TO LEAD BLUE STATE'S GOP: 'MAKE CALIFORNIA GREAT AGAIN' As Kennedy faced high-stakes congressional confirmation hearings to lead the Health and Human Services (HHS) Department, Shanahan singled out several senators, warning that she would financially support primary challengers if they voted against his confirmation as secretary. \"Dear U.S. Senators, Bobby may play nice; I won’t,\" she wrote in a post on X. WHO IS NICOLE SHANAHAN? MEET THE WEALTHY ENTREPRENEUR RFK JR SELECTED AS HIS VP RUNNING MATE CLICK HERE TO GET THE FOX NEWS APP Several candidates have announced their intentions to run for governor of California in the 2026 election, while others are still considering their options. Katie Porter, the former liberal congresswoman, has launched her bid, focusing on advocating for working families and opposing former President Trump's policies. Eleni Kounalakis, California’s lieutenant governor, has officially entered the race, seeking to continue Newsom's policies. Other candidates include Chad Bianco, the Riverside County sheriff who is running on the Republican ticket. Bianco’s platform centerson law enforcement issues and border security. Former Vice President Kamala Harris is also rumored to be considering a 2026 run, and her decision could have a major impact on the race, particularly among Democratic voters.","summary":"Nicole Shanahan, Silicon Valley philanthropist and RFK Jr.&apos;s former running mate, ruled out running for California governor in 2026.","url":"https://www.foxnews.com/politics/rfk-jr-s-former-running-mate-rules-out-2026-ca-governor-run-hints-activism-watching-closely","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/GettyImages-2107864394.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-24 17:16:09","author":"Jamie Joseph","authors":["Jamie Joseph"],"language":"en","category":"politics","source_country":"us","sentiment":0.203},{"id":303650498,"title":"Gawker Founder Reveals the Elitist Reason He ‘Hated Gawker’","text":"Nick Denton turned Gawker into the king of digital media at a time when publishers were still figuring out the internet. But he came to loathe it.\n\n“I hated Gawker,” Denton told New York magazine in an interview published on Monday. Denton founded the company in 2002 and led it through more than a decade of gossipy rabble-rousing before a lawsuit over a Hulk Hogan sex tape killed it in 2016.\n\nDenton, who said he planned to leave New York for Budapest, told the magazine he despised how intellectually “homogenous” the website’s writers had become between 2012 and 2015. \n\n“They seemed somehow lobotomized,“ he said. ”I would get frustrated, not able to understand where they were coming from. What motivates you? Seriously, what drives you, what motivates you, what are you passionate about? And it was like talking to a bunch of robots. And these are smart people.\"\n\nDenton said he ended up being unable to read the website and was grateful when he “fired half the staff in an afternoon.”\n\nDenton offered a buyout to employees in 2015 after some objected to his decision to remove a post about a married media executive who hired a male escort.\n\n“Thank God, thank God,” he said of the exodus. “Because I was ashamed. I was just ashamed.”\n\nIn discussing Gawker’s short-lived relaunch in 2021, Denton offered some praise for Gawker’s grim reaper, Peter Thiel, the Palantir billionaire who paid $10 million to finance Hogan’s lawsuit against the outlet, which ultimately brought about its demise. Thiel bankrolled the suit years after Gawker reported he was gay.\n\n“It did come back in some bastard form,” he said. “But I think it was a sufficient interval that that was clearly another thing. But yeah, I agreed with Peter Thiel’s criticisms.”\n\nDenton also wrote on X last week that Thiel was “right, as usual” that Democratic politicians were less smart than Republicans after Thiel said Kamala Harris, who attended Howard University, received an inferior education than Trump, who went to the University of Pennsylvania, and JD Vance, who attended Yale Law School. \n\nDenton told New York he was interested in Thiel’s views on foreign policy as Trump upends America’s traditional alliances.\n\n“I want to know why he’s so quiet when he ought to be at his point of maximum power,” he said. “I’m super-curious about his attitude towards Vance, while Vance is busy destroying the Atlantic alliance, and Palantir depends on the Atlantic alliance for a large portion of its contracts. I’m very curious as to how Peter Thiel thinks about the abuse of America’s most loyal allies in Europe.”","summary":"Fred Lee / Fred Lee/Disney General Entertainment Content via GettyNick Denton turned Gawker into the king of digital media at a time when publishers were still figuring out the internet. But he came to loathe it.\n\n“I hated Gawker,” Denton told New York magazine in an interview published on Monday. Denton founded the company in 2002 and led it through more than a decade of gossipy rabble-rousing before a lawsuit over a Hulk Hogan sex tape killed it in 2016.\n\nDenton, who said he planned to leave New York for Budapest, told the magazine he despised how intellectually “homogenous” the website’s writers had become between 2012 and 2015. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/gawker-founder-says-he-eventually-hated-site-before-shutdown/","image":"https://www.thedailybeast.com/resizer/v2/6MYXIEHYS5DORBZJBXFLML5ASE.jpg?smart=true&auth=45121837325ee13749db0e9533f3cf6d3b27b2d1a4a8aaefddc13ce9b706cb34&width=1440&height=1080","video":null,"publish_date":"2025-03-24 17:02:22","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","source_country":"us","sentiment":-0.201},{"id":303650492,"title":"Trump’s Firebrand Press Sec Karoline Leavitt Doesn’t Believe Main MAGA Myth","text":"President Donald Trump’s firebrand press secretary Karoline Leavitt doesn’t believe the president’s discredited conspiracy theories about the 2020 election, according to sources. \n\nIn addition to his unprecedented effort to overturn the 2020 election results, which culminated in an attack on the U.S. Capitol by his supporters, Trump has repeatedly made false claims that the election was stolen from him. \n\nAnd despite her fervent public support of Trump, 27-year-old Leavitt privately contradicted his ramblings about the election—won by Joe Biden and Kamala Harris, sources have told the Washington Post.\n\nThe paper, undergoing its own MAGA makeover, reported Monday that two people who spoke to Leavitt about the subject said she believes Trump lost fair and square. “[She] disagreed with his claims of a stolen election,“ the Post reported.\n\nLeavitt, however, claims she doesn’t recall the conversations, the paper added. She also reportedly put on record her public rebuttal of apparent election interference. \n\nLeavitt denied that Trump lost the 2020 election during 2021 interviews with OANN, and New Hampshire talk radio.\n\nLast year, however, Leavitt moved quickly to delete X posts that seemed to contradict her election denial stance. In one, she criticized the Capitol insurrection, and in another, praised former Vice President Mike Pence for certifying the 2020 presidential election. Trump to this day rails against Pence’s decision to green-light the results, falsely claiming rampant voter fraud.\n\nAt the time of the attack on the Capitol, Leavitt had just left Trump’s White House press office and began working for Republican Representative Elise Stefanik.\n\n“Karoline learned from Elise that voters in the MAGA movement will reward and support you when you take tough positions to fight for the cause,” Alex deGrasse, Stefanik’s top political adviser, told the Post. He called Leavitt an “unwavering” MAGA believer. \n\nAfter working for Stefanik, Leavitt unsuccessfully ran for Congress in New Hampshire in 2022 with an election-denying stance. She then went on to work for Trump’s PAC and later his presidential campaign.\n\nAnd, Trump advisor Chris LaCivita, said she had by this point honed the skills to become the president’s youngest ever press secretary. \n\n“I never gave it a second thought,” LaCivita said of putting Leavitt forward for the job. “It was always going to be Karoline.”\n\nThe Daily Beast has reached out to the White House for comment.","summary":"Chip Somodevilla / Getty ImagesPresident Donald Trump’s firebrand press secretary Karoline Leavitt doesn’t believe the president’s discredited conspiracy theories about the 2020 election, according to sources. \n\nIn addition to his unprecedented effort to overturn the 2020 election results, which culminated in an attack on the U.S. Capitol by his supporters, Trump has repeatedly made false claims that the election was stolen from him. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trumps-firebrand-press-sec-karoline-leavitt-doesnt-believe-main-maga-myth/","image":"https://www.thedailybeast.com/resizer/v2/S45U27ILO5AWNB67A4LTNQ2EKA.jpg?smart=true&auth=3a013b442c886d9fb46d3f93ace1c275d227c3a9b476798d8abbd3396526f58f&width=1440&height=1080","video":null,"publish_date":"2025-03-24 16:40:39","author":"Leigh Kimmins","authors":["Leigh Kimmins"],"language":"en","source_country":"us","sentiment":-0.265},{"id":303642428,"title":"Democrats on possible Biden political reemergence: 'his time has passed'","text":"Former President Joe Biden may want to be back in the political arena to try and help the Democratic Party emerge from the wilderness. However, it does not appear that many Democrats are overly receptive to the offer from the 82-year-old former president, whom many blame for last November's stinging election setbacks, when the party lost control of the White House and Senate and fell short in winning back the House majority from the GOP. \"As far as Biden’s position within the current state of the Democratic Party, I think his time is over. I think his time has passed. The train has sort of moved on,\" a Democrat strategist who asked for anonymity to speak more freely told Fox News. Biden met last month with Ken Martin, the newly elected chair of the Democratic National Committee, to offer his help, a source with knowledge confirmed to Fox News last week. Word of the meeting and Biden's offer to help fundraise or campaign for the party was first reported by NBC News. POLL POSITION: DEMOCRATIC PARTY'S NUMBERS PLUNGE TO ALL-TIME LOWS The offer of assistance by the former president comes as recent polling indicates the Democratic Party brand is in desperate need of repair. The party's favorable rating sank to all-time lows in separate national polls conducted this month by CNN and NBC News. Those numbers followed a record low for Democrats in a Quinnipiac University survey in the field in February. Additionally, the latest Fox News National poll, which was released last week, indicated Congressional Democrats' approval rating at 30%, near an all-time low. CLICK HERE FOR THE LATEST FOX NEWS REPORTING, ANALYSIS, AND OPINION ON FORMER PRESIDENT BIDEN While some Democrats praise Biden for his past accomplishments, including during his single term in the White House, many say it is time to move on as the party aims to rebound. \"President Biden did a lot of remarkably great things for this country,\" longtime Democratic consultant John MacNeil told Fox News. \"I’m sure there is still some love left for him.\" However, MacNeil, who was part of the leadership of Unite the Country, a pro-Biden super PAC that helped boost the then-former vice president to victory in the 2020 Democratic presidential primaries, pointed to the 2024 election and noted that Biden \"is unfortunately and unfairly the guy who’s going to get pegged for the loses.\" Joe Caiazzo, a veteran Democratic strategist who served on the 2016 and 2020 presidential campaigns of Sen. Bernie Sanders, told Fox News that \"there is an appetite for a message anchored in economic populism wrapped in a desire for broad system change. Following November's results, it is more than fair to say that folks are looking towards the future.\" WHAT THE LATEST FOX NEWS NATIONAL POLL SAYS ABOUT CONGRESSIONAL DEMOCRATS Others, who asked to remain anonymous, were more blunt. A longtime Democratic Party bundler and fundraiser argued that \"Biden was never a very good fundraiser. Never. He always had difficulty raising money and really didn’t like doing it.\" There is still plenty of anger directed at Biden, who dropped his 2024 re-election bid last July, a couple of weeks after a disastrous debate performance against then-former President Donald Trump reignited serious questions and deep concerns over Biden's physical and mental stamina to handle another four years in the White House. Biden was succeeded at the top of the Democrats' 2024 ticket by then-Vice President Kamala Harris, with less than four months until Election Day. A national Democrat strategist who was close to the 2024 Biden campaign told Fox News that \"it defies belief that the man who cost the Democratic Party the White House, the Senate and the House, believes that he is going to be the Democratic Party savior, but this is also the same person who tried to convince America that he wasn’t too old to continue as President of the United States.\" One person who appears enthusiastic about the potential prospect of Biden re-entering the political arena is Trump, who has repeatedly blasted the former president in speeches, interviews and on social media in the two months since returning to power. CLICK HERE TO GET THE FOX NEWS APP \"I hope so,\" Trump told reporters on Friday when asked about the possibility of a more visible political role for his predecessor.","summary":"Democrats appear far from excited over possibility of former President Joe Biden re-entering the political arena, after Fox News confirmed the former president offered party leaders his help.","url":"https://www.foxnews.com/politics/democrats-possible-biden-political-reemergence-his-time-has-passed","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/joe-biden-state-department-jan.13-2025-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-24 16:30:51","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":0.125},{"id":303647944,"title":"Gen Z influencer uncovers the truth about young Americans' views on Trump","text":"President Donald Trump&apos;s approval rating among young Americans is on the rise, sitting higher than any Republican presidential candidate since 2008. Two months into his second term, conservative Gen Z influencer Bo Loudon says he&apos;s \"100%\" getting what he campaigned for. \"We have President Trump out here being the most transparent president we&apos;ve ever had,\" he said on FOX Business Monday. GEN Z INFLUENCER THANK PRESIDENT-ELECT TRUMP FOR SAVING TIKTOK \"Gen Z could not be happier. He&apos;s lowering the cost of things. Homes are more affordable. Prices of eggs are dropping. People are getting deported. Our country is being saved, and we couldn&apos;t be happier.\" Loudon helped kick off young conservatives week on \"Mornings with Maria,\" where he reacted to Fox News polling that indicates Trump&apos;s approval rating among Americans under 30 has climbed to 48%, an increase from when he assumed office on Jan. 20. NYT WRITER SAYS DEMS ARE ‘GETTING DESTROYED’ AS DATA SHOWS GEN Z ‘MOST CONSERVATIVE’ GENERATION IN DECADES He credited that rising support to Trump delivering on his campaign promises and the Democratic Party&apos;s alleged rhetoric of \"hatred.\" The youngest voting bloc helped secure Trump&apos;s victory over former Vice President Kamala Harris last November. Data from The Center for Information & Research on Civic Learning and Engagement (CIRCLE) indicates young voters were more likely to identify as conservative in 2024 than in 2020. Youths aged 18-29 were the only age group in the last election whose moderate voters preferred Trump to Harris, the data revealed. CLICK HERE TO GET FOX BUSINESS ON THE GO Fox News Digital&apos;s Alexander Hall contributed to this report.","summary":"Gen Z conservative influencer Bo Loudon said young voters under 30 are supporting President Donald Trump in growing numbers because he is fulfilling campaign promises.","url":"https://www.foxbusiness.com/media/gen-z-influencer-uncovers-truth-about-young-americans-views-trump","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/03/donald-trump.jpg","video":null,"publish_date":"2025-03-24 16:23:50","author":"Taylor Penley","authors":["Taylor Penley"],"language":"en","category":"politics","source_country":"us","sentiment":-0.352},{"id":303642458,"title":"Trump-district Democrat warns party 'in trouble' ahead of 2026 midterms","text":"A House Democrat who represents a district that former Vice President Kamala Harris lost to now-President Donald Trump in 2024 is sounding the alarm about public perceptions of his party. \"I think the Democratic brand is really in trouble, and it's been portrayed as this crazy-left, you know, out-of-touch thing,\" Rep. Tom Suozzi, D-N.Y., told Fox News Digital in an interview. \"They couldn't paint me with that brand because people know me.\" Suozzi is well-known in his suburban Long Island district, having been a longtime local official before first coming to Congress in 2017. He did not run for re-election in 2022 but later won a special election to replace expelled former Rep. George Santos, R-N.Y., and has remained ever since. During that time, he forged a reputation as a moderate Democrat willing to find bipartisan consensus on issues like government waste and border security – themes he wished his party would take the lead on. THESE ARE THE JUDGES GOING TOE TO TOE AGAINST TRUMP'S AGENDA \"When I first started talking about immigration, the need to secure the border, a lot of consultants were like, 'Well, that's a Republican issue. I don't know if you should talk about that.' But I said, 'That's what the people are talking about in my district,'\" Suozzi recalled. \"I'm a first-generation American. My father was born in Italy, so immigration is a really important issue to me. When it became such a negative, it was actually painful for me, because I define my whole life through immigration.\" He said people in his district were also concerned about the cost of living, which he suggested was a universal concern. \"We don't, as Democrats, focus enough on the basics,\" Suozzi said. \"It can't just be choice and LGBT – important issues, but that you can't build a party around that – so I'm trying to encourage Democrats to talk about things like, how do we rebuild the middle class?\" INJUNCTION LIFTED ON TRUMP EXECUTIVE ORDERS SLASHING FEDERAL DEI SUPPORT Additionally, like House Democratic leaders in more recent election cycles, Suozzi also denounced progressive calls to \"defund the police\" – which he called \"the stupidest three words ever said in the history of politics.\" He even argued Democrats were on board with cutting government waste, the stated mission of the Department of Government Efficiency (DOGE), though Suozzi disagreed with how it was being carried out. \"I want to set up a competition between the Democrats and the Republicans. Let's see who can root out more waste, fraud and abuse,\" he said. \"I don't think anybody's against rooting out waste, fraud, and abuse. We just don't think that when you're doing it through DOGE, that you should be eliminating the people that oversee the nuclear stockpile, like they did and then reversed,\" Suozzi continued. \"We don't think that you should be eliminating the people that are responsible for preventing the avian flu. Which they did and then tried to reverse. We don't think you should be eliminating the people that are overseeing the outbreak of measles in Texas. That's not a good idea. But they did. So let's be smart about these things and let's, you know, figure out ways that we can actually save money.\" He also called on Democrats to focus more on outreach outside \"traditional media,\" noting Trump's embrace of podcasts and social media to reach young male voters. Suozzi, in particular, singled out Trump and Elon Musk's appearances on \"The Joe Rogan Experience,\" one of the most-listened-to podcasts in the world. \"We have to figure out how we can get the truth out there to people. When Elon Musk or the president or somebody says something and there's nobody to check it, and there's no way to push back because nobody– I can't get on Joe Rogan. I'd love to go on Joe Rogan. I can't get on,\" he said. Sen. John Fetterman, D-Pa., was the only prominent Democrat to appear on Rogan's podcast during the 2024 election cycle. Tentative plans for Harris to appear fell through, though she did appear on the \"Call Her Daddy\" podcast. Overall, however, the New York Democrat signaled he was confident Democrats could take back the House of Representatives in 2026, given the historic electoral backlash to a sitting president during the midterm elections. It is worth noting, however, that Democrats will be defending more vulnerable members in 2026 than Republicans. \"I mean, you look at history and when a president of one party gets in power – usually that party usually loses elections the year and two years afterward. So, like, even in the local elections this year, I think you're going to see a much higher Democratic vote because the Democrats are going to be energized, because they're all so upset,\" Suozzi said. \"I think that the midterms will be the same thing.\" CLICK HERE TO GET THE FOX NEWS APP Suozzi warned, however, that Democrats' message \"can't just be about why we disagree with Trump and, you know, hair on fire and everybody freaking out.\" \"There are a lot of causes for concern,\" he conceded, but added, \"We have to also talk about what we stand for. And I think, again, this whole idea of rebuilding the middle class and public safety and strong defense and securing the border – we have to also talk about those things as well.\"","summary":"Rep. Tom Suozzi urged his party to focus on the &quot;basics&quot; during an interview with Fox News Digital.","url":"https://www.foxnews.com/politics/trump-district-democrat-warns-party-in-trouble-ahead-2026-midterms","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/suozzi-jeffries.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-24 16:00:07","author":"Elizabeth Elkind,Emma Woodhead","authors":["Elizabeth Elkind","Emma Woodhead"],"language":"en","category":"politics","source_country":"us","sentiment":-0.288},{"id":303633054,"title":"ROOKE: JD Vance Explains MAGA’s Appeal In A Way Liberals May Finally Understand","text":"The D.C. establishment seems confused about why President Donald Trump and his administration are doing so well with American voters. Still, if they had been paying attention, Vice President JD Vance explained this months ago.\n\nA post from a left-wing account came across my X feed over the weekend. It included a screenshot of an interview with Vance discussing how older Ohio voters understand national conservatism even if they don’t follow along online.\n\nThe post said, “Fascinating Vance quote. It really sums up the whole thing.”\n\n Fascinating Vance quote. It really sums up the whole thing pic.twitter.com/OvpzXhF46X — LowρUF👁️ 🇵🇦🇬🇱🇨🇦🇲🇽 (@LowRhoUfo) March 23, 2025\n\nOf course, the anonymous poster was being sarcastic in the sense that he didn’t actually believe what Vance said was “fantastic.” Instead, it was an attempt to attack Vance for his views on the American electorate. But if the left were smart, they’d read Vance’s entire interview because he perfectly encapsulated why Trump won in November and why the American people are giving his administration a glowing review.\n\nThe interview with Vance occurred at a conservative conference in 2021, three years before he knew he’d be running as Trump’s vice president. Still, what he said was as accurate back then as it is today. (Sign up for Mary Rooke’s weekly newsletter here!)\n\n“The left is committed to brain-dead Bidenism,” Vance said. “Biden’s entire political project is harmonizing various parts of the American left that don’t make any sense. And the American right, at the establishment level, is a series of dogmas that existed 40 years ago and are totally exhausted. And then there’s this thing called national conservatism,” he continued, “and it is vibrant and young people are excited about it.”\n\n Drinking With J.D. Vance: ‘Israel is a country and a nation that doesn’t hate its own fucking people’https://t.co/DfflWVuhiU — Tablet Magazine (@tabletmag) July 16, 2024\n\nThis idea that Republicans have to reach out to the “vibrant and young people” excited about national conservatism to remake the party in their image got Trump over the line in November. Trump did historically well among young voters.\n\nDemocratic firm Blue Rose Research recently released voter data from the 2024 election showing just how bad former Vice President Kamala Harris faired with voters under the age of 25.\n\n“[I]f you look at people under the age of 25, every single group — white, nonwhite, male or female — is considerably more conservative than their millennial counterparts. And it even seems that Donald Trump narrowly won nonwhite 18-year-old men, which is not something that has ever happened in Democratic politics before,” said David Shor, head of data science with Blue Rose Research.\n\nStill, Trump needed more than just young voters to win back the White House. His populist movement would have to translate on the ground with all Americans. Vance read the writing on the wall and felt they did.\n\n“Does a normal Ohio voter read Yoram Hazony and Mencius Moldbug? No. They’re old people. They live their lives, they support their family, they want jobs,” Vance said. “But do they agree with the broad thrust of where we think American public policy should go? Absolutely.”\n\n“Translating the impulse of the multiracial, multicultural middle class turned working class—there’s a lot of work to do,” he continued. “But the instincts of the middle-class Black voter, the middle-class white voter, the middle-class Latino voter, are the same.” (Republicans Face First Test To Determine If They Can Keep Trumpmentum Going)\n\n“We love our country, but we don’t want to live in a sh*thole,” Vance added.\n\nShor admitted that Blue Rose Research found that “40 percent of the country identifies as conservative.” That’s across racial lines. This likely stems from the complete neglect of our middle class by our elected officials (both Republican and Democrat). For decades, Americans have watched their towns decimated by the ever-encroaching death march of globalism that stripped them of good-paying manufacturing jobs and placated their lack of purpose with pills and social media.\n\n “The reality is if all registered voters had turned out, then Donald Trump would’ve won the popular vote by 5 points [instead of 1.7 points].” https://t.co/R8wt1nXEfj pic.twitter.com/7lBTdFmiUr — Andy Kaczynski (@KFILE) March 18, 2025\n\nVance talked about this during his recent address at the 2025 American Dynamism Summit, where he detailed a conversation he had with a tech CEO who said he wasn’t worried about the middle class losing their jobs and, with it, their purpose due to globalism because they would replace it with “digital, fully immersive gaming.”\n\nHis wife, Second Lady Usha Vance, apparently texted him from underneath the table, saying, “We have to get the hell out of here. These people are effing crazy.”\n\n “For far too long, we got addicted to cheap labor—both overseas and by importing it into our own country—and we got lazy.” Read more from VP @JDVance‘s remarks at @a16z‘s American Dynamism Summit in Commonplace: pic.twitter.com/HWxQ4afn5Z — Commonplace (@commonplc) March 20, 2025\n\nWhile the Vances have been very successful, they still seem to understand the plight of regular Americans who long for purpose and to see American Exceptionalism as the official policy of the federal government. A majority of Americans believe the country is headed in the right direction, and Trump’s approval rating equals his best-ever mark.\n\nWhile it seems the left is overwhelmed by the national conservative uprising from the American electorate. If they want to understand why Trump’s populist movement resonates with so many Americans, all they have to do is read Vance’s 2021 interview.\n\nFollow Mary Rooke on X: @MaryRooke","summary":"'We love our country, but we don't want to live in a sh*thole'","url":"https://dailycaller.com/2025/03/24/rooke-jd-vance-trump-voters-democrats-republicans/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/03/GettyImages-2202534417-e1742830826583.jpg","video":null,"publish_date":"2025-03-24 15:55:22","author":"Mary Rooke","authors":["Mary Rooke"],"language":"en","source_country":"us","sentiment":-0.403},{"id":303625768,"title":"Supreme Court declines Trump ally’s challenge to landmark press freedoms","text":"The Supreme Court will not take up a case from a billionaire real estate developer who called on the court to overturn a landmark ruling that has protected journalists from libel lawsuits for decades.\n\nDonald Trump-supporting Republican megadonor Steve Wynn urged the court to revisit the precedent established by 1964’s New York Times v Sullivan, which determined that public figures must prove “actual malice” from a news organization’s reporting to successfully sue them for defamation.\n\n“Sullivan is not equipped to handle the world as it is today — media is no longer controlled by companies that employ legions of factcheckers before publishing an article,” attorneys for Wynn wrote in a recent petition to the court. “Instead, everyone in the world has the ability to publish any statement with a few keystrokes. And in this age of clickbait journalism, even those members of the legacy media have resorted to libelous headlines and false reports to generate views.”\n\nThe justices denied his petition Monday.\n\nWynn brought his case to the Supreme Court after lower courts rejected his 2018 lawsuit against the Associated Press, which published information from police reports detailing allegations of sexual misconduct against him in the 1970s. Wynn has denied the allegations. \n\nTrump and his allies have repeatedly argued that news outlets and journalists should be punished, even criminally, for adversarial reporting. Trump himself has pushed the courts to challenge Sullivan in his lawsuits against media outlets, with his attorneys stating in a failed lawsuit against CNN that the precedent “no longer merely provides ‘breathing space’ for the occasional misstatement, but rather, offers a nearly impenetrable shield to the media, allowing it to publish defamatory statements targeting political enemies, without fear of consequence.”\n\nThe Supreme Court’s conservative justices have also signaled their willingness to revisit Sullivan. In his dissent in a similar case in 2022, Justice Clarence Thomas claimed that the precedent “and its progeny have allowed media organizations and interest groups ‘to cast false aspersions on public figures with near impunity.’”\n\nSince returning to the presidency, Trump has blocked the Associated Press from covering White House events, promoted misleading claims about Reuters, removed space for journalists at the Pentagon, and launched investigations into media organizations the president routinely attacks.\n\nThe president — who recently lambasted “illegal” news organizations — spent his three presidential campaigns and first four years in office raging against a free press he calls “fake news” and the “enemy of the people” while waging a legal war against the media in courtrooms across the country.\n\nHe repeatedly threatened to revoke broadcast licenses for news networks over critical coverage or stories he didn’t like and then sued top networks for defamation. He is currently trying to force CBS to pay him $10 billion over a 60 Minutes interview with Kamala Harris he claims was edited to illegally influence the outcome of the 2024 presidential election.\n\nIn office, Trump’s Federal Communications Commission’s chair Brendan Carr has launched probes into public broadcasting services NPR and PBS and revived complaints into CBS, ABC, and NBC, but has not touched any explicitly right-wing news outlets.","summary":"GOP megadonor Steve Wynn had urged the court to revisit the precedent established by 1964’s New York Times v Sullivan","url":"https://www.independent.co.uk/news/world/americas/us-politics/steve-wynn-trump-supreme-court-sullivan-b2720648.html","image":"https://static.independent.co.uk/2025/03/24/15/10/FILE-PHOTO-Trump-speaks-with-Steve-Wynn-in-Las-Vegas-55l2orfc.jpeg?trim=0,97,0,96&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/dkExW67N-OhrQWqOm.mp4","publish_date":"2025-03-24 15:48:09","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.332},{"id":303642446,"title":"Bill Maher reveals his plans for his upcoming meeting with Trump at the White House – and what he’ll wear","text":"Bill Maher revealed how he plans to behave when he meets with President Donald Trump at the White House – and joked about which outfit he’ll avoid wearing. \"I’m not going to dress like Zelenskyy,\" Maher quipped during his Club Random podcast interview with comedian Andrew Schulz, referring to Ukrainian President Volodymyr Zelenskyy's casual attire during a contentious Oval Office meeting with Trump last month. \"Not a f--king lululemon outfit… Zelenskyy pulled up looking like a yoga instructor,\" Schulz shot back. BILL MAHER WARNS THAT DEMOCRATS ARE 'GONNA BE THE WHIGS' IF THEY DON'T FIX THIS BIG PROBLEM Schulz, a comedian and host of the Flagrant podcast, said that Trump’s willingness to sit down and talk with anyone was part of the 47th president’s appeal, and that former Vice President Kamala Harris’ seeming reluctance to do so contributed to her election defeat. The two comics agreed that dialogue, and being willing to speak to people with whom you disagree, are core components of the American character. Maher commended Trump for being willing to speak with a long-time critic such as himself. \"Who’s been meaner than me?\" Maher asked. \"J.D. Vance,\" Schulz rejoined. COMEDIAN ANDREW SCHULZ SAYS THE SECRET TO TRUMP'S SUCCESS IS THAT HE 'DOESN'T SOUND RICH' The \"Real Time\" host said he had his staff compile a dossier of all the insults Trump has leveled at him over the years – accusing the comic of being \"crazy\" and his show of being a \"ratings disaster\" – and that it amounted to five pages. He brushed off the criticisms though, saying they were \"performative\" and didn’t matter. \"I don’t care, and he doesn’t care,\" Maher said. The comic said that criticism of his meeting with a Republican president doesn't phase him, saying that sitting out the event would be \"mean girl\" behavior that he's sick of from the left. \"I’m not playing this game that you mean girls play, where they’re like, ‘Oh, you know what? You can’t sit at my lunch table because I’m just not talking to you,\" Maher said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE He likened his upcoming rendezvous with Trump to meeting an ex-girlfriend’s military veteran father. Though the two disagreed politically, Maher said he won the father's respect because he wasn’t a \"p---y.\" The comedian said that his experience would serve as a \"model\" for how he behaves at his dinner with Trump and that he will be \"respectful\" when he meets the president in the White House. CLICK HERE TO GET THE FOX NEWS APP \"You have to respect that, the guy did win. It's more than half the country… you can not like Trump, you can hate him, but you can’t hate everybody who voted for him… I don’t hate half the country and I don’t want to hate half the country,\" Maher said. \"It’s an honor to be invited to the White House under any circumstances.\"","summary":"Bill Maher discussed his upcoming White House meeting with President Donald Trump during his &quot;Club Random&quot; podcast with comedian Andrew Schulz.","url":"https://www.foxnews.com/media/bill-maher-reveals-plans-upcoming-meeting-trump-white-house-what-hell-wear","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/mahertrump.png?ve=1&tl=1","video":null,"publish_date":"2025-03-24 15:40:06","author":"David Spector","authors":["David Spector"],"language":"en","category":"politics","source_country":"us","sentiment":-0.169},{"id":303720796,"title":"George Clooney says he dropped support for Biden after seeing him up close, condemns Democratic 'cowardice'","text":"Actor George Clooney opened up about his decision to drop his support for former President Joe Biden in a new interview, saying seeing him \"up close\" last year was enough to dissuade him.\n\nClooney, a lifelong Democrat, defended his decision to pen a New York Times opinion piece calling for Biden to leave the presidential race just weeks after the A-lister and other Hollywood stars helped garner $30 million in donations for Biden at a Los Angeles fundraiser.\n\n\"I was raised to tell the truth,\" Clooney, the son of a journalist, said when asked about the essay on \"60 Minutes\" Sunday. \"I had seen the president up close for his fundraiser, and I was surprised, and so I feel as if there were a lot of profiles in cowardice in my party through all of that. And I was not proud of that, and I also believed I had to tell the truth.\"\n\nClooney's essay came on the heels of Biden's dismal debate showing that sent shockwaves through the party last June.\n\n\"I've always liked Joe Biden and I like him still,\" Clooney later added, revealing that he was \"surprised\" by Biden when he saw the former president in person.\n\n\"It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe ‘big F-ing deal’ Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate,\" Clooney wrote last July.\n\nLess than two weeks later, Biden bowed out of the race under intense party pressure, endorsing Vice President Kamala Harris for the Democratic nomination. She went on to lose to Trump.\n\nClooney appeared on the CBS News program on Sunday to promote \"Good Night, and Good Luck,\" which marks his Broadway debut playing renowned journalist Edward R. Murrow.\n\nThe play focuses on Murrow's conflict with anti-Communist Wisconsin Sen. Joseph McCarthy, a theme that Clooney argued mirrored what journalists are facing under Trump's second term.\n\n\"ABC has just settled a lawsuit with the Trump administration. And CBS News is in the process … We're seeing this idea of using government to scare or fine or use corporations — to make journalists smaller,\" Clooney told \"60 Minutes.\"\n\n\"Governments don't like the freedom of the press. They never have. And that goes for whether you are a conservative or a liberal or whatever side you're on. They don't like the press,\" he added.\n\nThe defamation suit against ABC was formally dismissed in December after Trump reached a settlement worth $15 million with the network and its top anchor, George Stephanopoulos.\n\nTrump filed the defamation suit against Stephanopoulos after he asserted that Trump was found \"liable for rape\" in a civil case during a contentious interview with Rep. Nancy Mace, R-S.C., last year.\n\nThe president is also seeking $20 billion in damages from \"60 Minutes\" and CBS' parent company, Paramount Global, over an interview in October with Harris leading up to the 2024 presidential election.\n\nThe lawsuit, initially filed in October shortly before Trump won a second term and later expanded last month, accuses the program of \"partisan and unlawful acts of election and voter interference\" for the way it edited the interview and aired different clips of Harris' responses.\n\n\"When the other three estates fail, when the judiciary and the executive and the legislative branches fail us, the fourth estate has to succeed,\" Clooney said, referencing the lawsuits and the importance of journalism.\n\nFollowing the interview, Trump dismissed Clooney's \"60 Minutes\" appearance as a \"puff piece\" after the actor lodged criticisms at the commander-in-chief in between discussing his debut on Broadway.\n\nOriginal article source: George Clooney says he dropped support for Biden after seeing him up close, condemns Democratic 'cowardice","url":"https://www.yahoo.com/news/george-clooney-says-dropped-support-151852088.html","image":"https://s.yimg.com/ny/api/res/1.2/WMB.zAAujEWujvi.H8KQng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MA--/https://media.zenfs.com/en/fox_news_text_979/511e13b6ca3e11477fa62e6b20c66acf","video":null,"publish_date":"2025-03-24 15:18:52","author":"Nikolas Lanum","authors":["Nikolas Lanum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.096},{"id":303642442,"title":"George Clooney says he dropped support for Biden after seeing him up close, condemns Democratic 'cowardice'","text":"Actor George Clooney opened up about his decision to drop his support for former President Joe Biden in a new interview, saying seeing him \"up close\" last year was enough to dissuade him. Clooney, a lifelong Democrat, defended his decision to pen a New York Times opinion piece calling for Biden to leave the presidential race just weeks after the A-lister and other Hollywood stars helped garner $30 million in donations for Biden at a Los Angeles fundraiser. \"I was raised to tell the truth,\" Clooney, the son of a journalist, said when asked about the essay on \"60 Minutes\" Sunday. \"I had seen the president up close for his fundraiser, and I was surprised, and so I feel as if there were a lot of profiles in cowardice in my party through all of that. And I was not proud of that, and I also believed I had to tell the truth.\" Clooney's essay came on the heels of Biden's dismal debate showing that sent shockwaves through the party last June. JD VANCE SCOLDS CBS FOR 'HARASSING' HIS MOTHER-IN-LAW OVER DEI DIFFERENCES 'IN ORDER TO ATTACK' TRUMP \"I've always liked Joe Biden and I like him still,\" Clooney later added, revealing that he was \"surprised\" by Biden when he saw the former president in person. \"It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe ‘big F-ing deal’ Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate,\" Clooney wrote last July. Less than two weeks later, Biden bowed out of the race under intense party pressure, endorsing Vice President Kamala Harris for the Democratic nomination. She went on to lose to Trump. Clooney appeared on the CBS News program on Sunday to promote \"Good Night, and Good Luck,\" which marks his Broadway debut playing renowned journalist Edward R. Murrow. The play focuses on Murrow's conflict with anti-Communist Wisconsin Sen. Joseph McCarthy, a theme that Clooney argued mirrored what journalists are facing under Trump's second term. \"ABC has just settled a lawsuit with the Trump administration. And CBS News is in the process … We're seeing this idea of using government to scare or fine or use corporations — to make journalists smaller,\" Clooney told \"60 Minutes.\" \"Governments don't like the freedom of the press. They never have. And that goes for whether you are a conservative or a liberal or whatever side you're on. They don't like the press,\" he added. TRUMP CALLS '60 MINUTES' GEORGE CLOONEY SEGMENT A 'PUFF PIECE' The defamation suit against ABC was formally dismissed in December after Trump reached a settlement worth $15 million with the network and its top anchor, George Stephanopoulos. Trump filed the defamation suit against Stephanopoulos after he asserted that Trump was found \"liable for rape\" in a civil case during a contentious interview with Rep. Nancy Mace, R-S.C., last year. The president is also seeking $20 billion in damages from \"60 Minutes\" and CBS' parent company, Paramount Global, over an interview in October with Harris leading up to the 2024 presidential election. The lawsuit, initially filed in October shortly before Trump won a second term and later expanded last month, accuses the program of \"partisan and unlawful acts of election and voter interference\" for the way it edited the interview and aired different clips of Harris' responses. GEORGE CLOONEY CHEERS ‘COURAGE’ OF JOURNALISTS WHO STAND ‘ON RIGHT SIDE OF HISTORY’ AGAINST HATERS \"When the other three estates fail, when the judiciary and the executive and the legislative branches fail us, the fourth estate has to succeed,\" Clooney said, referencing the lawsuits and the importance of journalism. CLICK HERE TO GET THE FOX NEWS APP Following the interview, Trump dismissed Clooney's \"60 Minutes\" appearance as a \"puff piece\" after the actor lodged criticisms at the commander-in-chief in between discussing his debut on Broadway.","summary":"Actor George Clooney, while promoting his Broadway debut on &quot;60 Minutes,&quot; discussed pushing President Joe Biden out of the 2024 presidential race.","url":"https://www.foxnews.com/media/george-clooney-says-he-dropped-support-biden-after-seeing-him-up-close-condemns-democratic-cowardice","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/Biden-Clooney.png?ve=1&tl=1","video":null,"publish_date":"2025-03-24 15:18:52","author":"Nikolas Lanum","authors":["Nikolas Lanum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":303677978,"title":"Donald Trump Did Not Like Watching George Clooney on ’60 Minutes’","text":"George Clooney appeared on 60 Minutes Sunday night (March 23) to promote his upcoming Broadway debut: An adaptation of Good Night, and Good Luck, which tells the story of journalist Edward R. Murrow, who overcame immense political and corporate pressure to report on Joseph McCarthy and his anti-communist witch hunts in the 1950s. \n\n It was a relevant story when Clooney co-wrote and starred in the original Oscar-winning film in 2005, at the height of the Iraq War. And it obviously remains a relevant story 20 years later as Donald Trump returns to the White House with his usual verbal attacks against the press, combined with new ones in the courts (including one lawsuit against CBS News and 60 Minutes). \n\n Part of the 60 Minutes segment included footage from a first table read for the Broadway production, where Clooney addressed the cast, crew, and also the news cameras: “When the other three estates fail, when the judiciary and the executive and the legislative branches fail us, the fourth estate has to succeed,” Clooney said. \n\n He then referred to ABC News’ decision to settle a defamation lawsuit with the Trump administration, as well as the 60 Minutes complaint. Trump is suing CBS News for $20 billion, alleging that 60 Minutes engaged in election interference by editing an interview with Kamala Harris to make her look good. (CBS has denied the claim and asked a judge to dismiss the suit. The litigation also comes as CBS’ parent company Paramount tries to close a merger — which would require approval from the Trump-appointed chair of the FCC.) \n\n “We’re seeing this idea of using government to scare or, fine, or use corporations to make journalists smaller,” Clooney said. “Governments don’t like the freedom of the press. They never have. And that goes for whether you are a conservative or a liberal or whatever side you’re on. They don’t like the press.”\n\n Clooney’s entire point was then, unsurprisingly, bolstered by Trump himself, who got on Truth Social and wrote, “Why would the now highly discredited 60 Minutes be doing a total ‘puff piece’ on George Clooney, a second rate movie ‘star,’ and failed political pundit.”\n\n Calling Clooney a “second rate movie ‘star’” was just one of several dubious claims Trump made as he regurgitated his accusations against 60 Minutes and suggested that Clooney only stumped for Harris during the 2024 election “under orders from the Obama camp” (not because Clooney’s a prominent, lifelong Democrat).\n\n “60 Minutes even fraudulently inserted Fake answers into her disastrous interview, aired just before Election Day, in one of the most embarrassing and dishonest events in broadcast history,” Trump wrote. “And now George Clooney again? His press agent should be making a fortune!!!”\n\n Clooney, for his part, described the relationship between governments and a free press as “a fight that is for the ages.” He added: “Journalism, and telling truth to power, has to be waged like war is waged. It doesn’t just happen accidentally. It takes people saying, ‘We’re going to do these stories, and you’re going to have to come after us.’”","summary":"The actor earned the president's ire for speaking out against government intimidation of the press as he brings Good Night, and Good Luck to Broadway","url":"https://www.rollingstone.com/tv-movies/tv-movie-news/donald-trump-attack-george-clooney-60-minutes-1235301948/","image":"https://www.rollingstone.com/wp-content/uploads/2025/03/GettyImages-2198172444.jpg","video":null,"publish_date":"2025-03-24 14:28:23","author":"Jon Blistein","authors":["Jon Blistein"],"language":"en","category":"politics","source_country":"us","sentiment":-0.115},{"id":303602132,"title":"Trump demands his portrait be taken down","text":"US President Donald Trump has demanded the immediate removal of his portrait from the Capitol building in the state of Colorado, describing the painting as “truly the worst.” The criticism comes amid broader tensions between the White House and the leadership of the Democratic-leaning state. \n\nIn a post on Truth Social on Monday, Trump said that Colorado Governor Jared Polis should “be ashamed of himself” for putting up a portrait that was “purposefully distorted to a level that” he has “never seen before.” \n\n“I would much prefer not having a picture than having this one,” Trump wrote, claiming that many residents in the state have complained about the artwork.\n\nPainted by the British-born and Colorado-based portrait artist Sarah A. Boardman, the work has been on display in the Capitol since 2019, during Trump’s first presidential term. Boardman also painted the portrait of US President Barack Obama for the Colorado State Capitol, which Trump described as “wonderful.” The portraits are based on photographs rather than live sittings. \n\nIn his post, Trump also criticized “Radical Left” Governor Polis for being “extremely weak” on crime, citing his handling of Tren de Aragua, a Venezuelan criminal gang that has expanded into the US. According to the president, the gang “practically took over” Colorado’s third-largest city, Aurora, last year. \n\nIn February, the US government designated Tren de Aragua a foreign terrorist organization. Earlier this month, Trump invoked the Alien Enemies Act to deport nearly 300 alleged gang members to El Salvador, where they were placed in high-security detention facilities.\n\nThe governor’s office responded by saying that Polis “was surprised” to learn that the US president was “an aficionado of our Colorado state capitol and its artwork.” The statement, cited by multiple media outlets, went on to say that the state government was “always looking for any opportunity to improve our visitor experience.” It did not specify however whether the portrait was going to be removed. \n\nColorado has voted for Democratic candidates in five consecutive presidential elections, including for Kamala Harris in 2024.\n\nTrump’s policies on issues ranging from education and healthcare to immigration and gun safety have faced state-level opposition in Colorado, with Attorney General Phil Weiser having filed a series of lawsuits against them.","summary":"The artwork displayed at the State Capitol in Colorado is “truly the worst,” according to the US president \nRead Full Article at RT.com","url":"https://www.rt.com/news/614708-trump-demands-portrait-removed-colorado/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67e1682985f54072280d25fb.jpg","video":null,"publish_date":"2025-03-24 14:20:23","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.023},{"id":303612802,"title":"New Jersey Democrats latch on to abortion rights in governor’s race despite state protections","text":"“I strongly support enshrining the right to an abortion in New Jersey’s state constitution to permanently protect reproductive freedom,” Sherill shared on her campaign website. “Despite laws in place to protect access to care, too often women in New Jersey face additional barriers in getting care. New Jersey must take action to require comprehensive insurance coverage for all reproductive health care services, including abortion.”\n\nMeanwhile, Sweeney touted his sponsorship of the “Freedom of Reproductive Choice Act” on his campaign website. The bill “guaranteed all New Jerseyans the right to make their own decisions about birth control, abortion, and prenatal care.” \n\n“I support a constitutional amendment to protect a woman’s reproductive freedom in New Jersey because a woman should have the right to make her own decisions about her body,” Sweeney wrote.\n\nHowever, abortion rights groups such as ACLU New Jersey and Planned Parenthood Action Fund of New Jersey don’t share the same enthusiasm for this initiative, given the precedent set by the state’s Supreme Court that already protects abortion access in the state. Instead, the abortion-rights groups are hoping Democratic leadership will support legislation that will make abortion access more equitable for lower-income New Jersey residents. \n\n“A state constitutional amendment that only maintains the status quo is unnecessary, and without a careful, deliberative process, a ballot measure risks creating uncertainty in the legal landscape and undermining existing rights,” ACLU-NJ Deputy Policy Director Jim Sullivan said in a statement to Politico.\n\nThe entire state Senate and Assembly were up for reelection in 2023, during which Democrats were considering including a constitutional amendment for abortion on the ballot. However, Democrats failed to receive strong backing from abortion advocates.\n\nThe governor doesn’t have much influence on ballot initiatives that would enshrine abortion rights in the constitution. The state legislature must pass a resolution two years in a row with a simple majority or in one year with a supermajority. After this, the proposal must be voted on by constituents.\n\nUltimately, the race for governor would serve as a litmus test in determining how important abortion is to New Jersey residents. Since the overhaul of Roe v. Wade, which ended federal protection of abortion, Democrats have latched on to abortion rights measures as a way of motivating constituents to make it to the polls.\n\nDuring the 2024 election, then-Vice President Kamala Harris leaned heavily on abortion rights, according to Dan Cassino, a professor of government and law at Fairleigh Dickinson University.\n\n“At the top of the ticket, abortion is a major issue that leaks down to the rest of the ticket. It is mobilizing voters who otherwise wouldn’t have come out to vote,” Cassino told the New Jersey Monitor in September 2024. “\n\nMeanwhile, Republican gubernatorial candidate Bill Spadea isn’t making rolling back abortion rights a part of his campaign, saying in a radio interview that he doesn’t “see any foreseeable change in the future of taking away a woman’s right to choose.”\n\nHowever, there is concern that creating an abortion rights measure in New Jersey may attract the attention of major conservative donors.\n\n“Honestly, I think it’s a little performative. … The last thing we need is Elon Musk pumping $100 million in a ballot issue in New Jersey,” civil rights attorney Nancy Erika Smith told Politico.\n\nIn conservative states like Missouri and Montana, abortion rights amendments passed, possibly indicating that New Jersey would also see success in enshrining abortion rights in the state constitution.","summary":"Democratic gubernatorial candidates in New Jersey are aiming to run on a platform that would enshrine abortion rights in the state&#8217;s constitution despite facing limited backing from prominent abortion-rights advocates. Rep. Mikie Sherrill (D-NJ), the front-runner, and former state Senate President Steve Sweeney are both making promises to enshrine abortion rights in the state constitution.  [&#8230;]","url":"https://www.washingtonexaminer.com/news/3356607/new-jersey-democrats-abortion-rights-governor-race-state-protections/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/12/Planned-Parenthood-abortion-pro-life-roe-wade-hhw3.webp","video":null,"publish_date":"2025-03-24 14:12:03","author":"Elaine Mallon","authors":["Elaine Mallon"],"language":"en","category":"politics","source_country":"US","sentiment":-0.182},{"id":303595944,"title":"Trump blasts ‘second-rate movie star’ George Clooney over critical ‘60 Minutes’ interview","text":"President Trump is taking aim at George Clooney.\n\nAfter the actor’s “60 Minutes” interview aired Sunday night, the commander-in-chief took to his Truth Social platform to blast the “puff piece.”\n\nTrump, 78, began his scathing post by calling Clooney, 63, a “second rate movie star” and “failed political pundit.”\n\nHe continued, “He fought hard for Sleepy Joe [Biden]’s election, and then, right after the Debate, dumped him like a dog. Later, I assume under orders from the Obama camp, pushed all out for ‘Kamala’ [Harris], only to soon realize that this was not going to work out too well.”\n\nThe politician went on to repeat his claim that CBS “fraudulently inserted Fake answers” into Harris’ “disastrous interview” before Election Day last year, calling it “embarrassing and dishonest.”\n\nHe then returned to Clooney, concluding, “And now George Clooney again? His press agent should be making a fortune!!!”\n\nClooney’s rep has yet to respond to Page Six’s request for comment.\n\nThe Oscar winner mentioned Trump by name while speaking about ABC News’ settled lawsuit with the president’s administration.\n\n“CBS News is in the process [of doing the same],” he said. “We’re seeing this idea of using government to scare or fine or use corporations — to make journalists smaller.”\n\nThe “Gravity” star added, “Governments don’t like the freedom of the press. They never have. And that goes for whether you are a conservative or a liberal or whatever side you’re on. They don’t like the press.”\n\nElsewhere in the interview, Clooney defended his decision to request — via a viral New York Times op-ed — that Biden, 82, drop out of the race, shortly after co-hosting a fundraiser for the then-president’s re-election with Barbra Streisand, Julia Roberts and Jimmy Kimmel.\n\nHarris was named the Democratic presidential nominee in August 2024, with Clooney subsequently endorsing the 60-year-old candidate.\n\nThe filmmaker insisted Sunday that he stands behind his choice, explaining that he was “raised to tell the truth.”\n\nTrump, notably, blasted the Golden Globe winner’s essay when it was published in July 2024 and labeled him a “fake movie actor.”\n\nAt the time, the “Apprentice” alum wrote, “What does Clooney know about anything? Clooney should get out of politics and go back to television. Movies never really worked for him!!!”","summary":"The actor spoke on Sunday about ABC News' settled lawsuit with Trump's administration, saying the government is trying \"to make journalists smaller.\"","url":"https://pagesix.com/2025/03/24/celebrity-news/trump-blasts-george-clooney-over-60-minutes-interview/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/03/george-clooney-donald-trump-94.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-24 14:08:36","author":"Riley Cardoza","authors":["Riley Cardoza"],"language":"en","category":"politics","source_country":"us","sentiment":-0.097},{"id":303611066,"title":"Trump slams 'unflattering' portrait and urges its immediate take-down","text":"Donald Trump criticised an \"unflattering\" portrait of himself displayed in the Colorado State Capitol, calling for its removal by Governor Jared PolisThe artwork, created by Sarah Boardman and unveiled in 2019, has sparked complaints from Trump and some Colorado residentsThe US Presidnt also used the opportunity to criticise Polis's handling of crime and other state issues\n\nWashington, D.C. – Former President Donald Trump has publicly criticised an artist for painting what he described as an “unflattering” portrait of him, currently displayed in the Colorado State Capitol.\n\nTrump took to TruthSocial on March 23, 2025, to demand that Democrat Governor Jared Polis remove the artwork, which hangs alongside portraits of other U.S. presidents.\n\nThe portrait, created by artist Sarah Boardman, was unveiled in 2019 during Trump’s presidency. Trump claimed the painting was “purposefully distorted” and expressed dissatisfaction with its depiction, stating, “Nobody likes a bad picture or painting of themselves.”\n\nArtist’s work and public reaction\n\nSarah Boardman, who has previously painted portraits of former presidents Barack Obama and George W. Bush, was commissioned to create Trump’s portrait during his first term in office.\n\nWhile Boardman’s earlier works received praise, Trump alleged that her portrayal of him lacked the same quality.\n\nHe further claimed that “many people from Colorado” had complained about the artwork, adding that he was speaking on their behalf to Governor Polis.\n\nThe artist, however, had shared her gratitude for the opportunity when the portrait was unveiled, urging viewers to focus on the art rather than politics.\n\nGovernor Polis and Trump’s broader criticism\n\nGovernor Jared Polis, who has served as Colorado’s governor since 2019, was also targeted in Trump’s remarks.\n\nTrump accused Polis of being “weak on crime,” referencing issues such as the infiltration of Aurora by the Tren de Aragua criminal group.\n\nTrump highlighted his administration’s efforts to combat organised crime, including the recent deportation of over 200 suspected gang members under the Alien Enemies Act of 1798.\n\nPolis, known for his bipartisan approach, has previously supported some of Trump’s initiatives but recently criticised federal immigration enforcement actions in Colorado.\n\nColorado governor\n\nJared Polis is the 43rd Governor of Colorado, serving since January 2019. A member of the Democratic Party, he is known for his entrepreneurial background and his focus on education, renewable energy, and healthcare affordability. \n\nPolis made history as the first openly gay man elected governor in the United States and has been a strong advocate for inclusivity and progressive policies throughout his career.\n\nTrump revokes security clearance of Joe Biden\n\nLegit.ng earlier repored that Former President Donald Trump issued a presidential memo on March 21, 2025, revoking security clearances for President Joe Biden, Vice President Kamala Harris, and several other prominent Democrats and political adversaries.\n\nThe revocations also extended to former Secretary of State Antony Blinken, former Representatives Liz Cheney and Adam Kinzinger, and New York Attorney General Letitia James, among others.\n\nAccording to Guardian UK, Trump stated that the decision was made in the \"national interest\" and directed executive departments to revoke unescorted access to secure government facilities for the individuals named.\n\nSource: Legit.ng","summary":"President Donald Trump criticised an \"unflattering\" portrait of himself displayed in the Colorado State Capitol and demanded its immediate removal.","url":"https://www.legit.ng/world/us/1646799-trump-demands-presidential-portrait-immediately-observing-how-looked/","image":"https://cdn.legit.ng/images/1200x675/53191394b607de16.jpeg?v=1","video":null,"publish_date":"2025-03-24 13:56:34","author":"Basit Jamiu,Bayo Olupohunda","authors":["Basit Jamiu","Bayo Olupohunda"],"language":"en","category":"politics","source_country":"ng","sentiment":0.227},{"id":303592152,"title":"From 'out of pocket' to 'no cap' – these are the Gen Z slang terms and the meanings behind them","text":"From “No cap” to “period”, the list of slang terms and social media abbreviations used among Gen Z, especially those still in their teenage years, only appears to be growing longer by the day.\n\nThese words, now firmly tied into younger people’s vocabulary, have swept social media in recent years, leaving older generations mystified. \n\nSome of these words have recently even become valid answers to earn you some points in a game of Scrabble, including nibling, a gender-neutral term for nieces and nephews (a blend of niece or nephew with sibling).\n\n• Read more: Why is Gen Z suddenly jealous of millennials?\n\nSo what are some of the popular slang terms used by the young cohort who have literally grown up in the digital age? Here’s a list of Gen Z terms and their meanings.\n\nWhile Millennials, Gen X and Boomers believe this term simply means broke or being left with less money, or even just plain unavailable, it takes on a whole new meaning for Gen Z. Out of Pocket translates to “out of character” or “wild and unhinged”.\n\nThe term ‘period’ is also likely to be misinterpreted. Despite those in the US using it to reference a full stop, younger individuals, particularly Americans, now take it to also mean something is final or non-negotiable. \n\nThe period \"has lost its original purpose because, rather than needing a symbol to indicate the end of a sentence, you can simply hit send on your message,\" Gretchen McCulloch, linguist and author of the book Because Internet: Understanding the New Rules of Language, told NPR. Using it can now therefore “indicate seriousness or a sense of finality”.\n\nAnother term that has gained notable popularity online in recent years is ‘touch grass’ – ironically, the expression advises that someone should spend time outdoors, disconnect from technology, and engage more with the physical world. This can be achieved by connecting with nature.\n\nThe term is commonly used as an insult to those attached to their devices. \n\nEra is at least a Gen Z term not so far removed from its popular definition – though, of course teens have taken a step further when using it. It refers to a period of time in a person's life, no matter how short, that is characterised by something distinctive, such as a particular emotional state, relationship, achievement, or interest.\n\nDictionary.com has used the example: “She’s started wearing all black now that she’s in her sad girl era.”\n\nThe brat concept first became tied to Kamala Harris after English singer Charli XCX declared “Kamala IS Brat”, in an X post shortly after then-president Joe Biden announced he would be stepping down from the presidential campaign last year. \n\nBut the most commonly thought of definition when ‘brat’ is used, referring to someone defiant and spoilt, has been flipped on its head for much of Gen Z. For many teens, the word has now come to mean icon, celebrating someone embracing authenticity and confidence.\n\nThe term has become far bigger than even Charlie XCX might have imagined and is used in various forms, including Brat Winter, Brat summer, Brat era. \n\nGoat is an abbreviation for Greatest Of All Time, a term predominantly used in reference to sports stars.\n\nThe Cambridge dictionary says it describes the person who has performed better than anyone else ever and used the example, “Hamilton may end up being the GOAT as far as I can see.”\n\nThough No Cap has attracted popularity just recently, it was in use by at least the 2010s in the lyrics of hiphop artists from Atlanta, Georgia, according to the Merriam Webster dictionary. Its site states: “No cap is a slang expression meaning ‘genuinely; truthfully,’ used to emphasise the sincerity or seriousness of a statement.”\n\nTo be a Stan is to be a zealous fan of a celebrity, musician or public figure. It is thought that stans tend to exhibit their admiration to an excessive degree, though the term has more recently often been bandied about. \n\nThe verb can therefore also imply engaging in any degree of fandom.\n\nThe term, that stormed TikTok in 2023, seems to have stuck around. \n\nRizz, which some people have speculated is short for charisma, was credited as being popularised by Twitch streamer Kai Cenat, and is one’s ability to attract a romantic interest.\n\nOne Urban Dictionary definition previously claimed that, “Rizz actually comes from the word charisma where, in southern Baltimore, they’ve started to shorten it to ‘rizzma’ (the noun replacing charisma) and to ‘rizz’ (the action of showing charisma)”.","summary":"Some Gen Z slang terms can now even earn you points in a game of Scrabble","url":"https://www.standard.co.uk/lifestyle/gen-z-slang-terms-meanings-out-of-pocket-no-cap-b1218463.html","image":"https://static.standard.co.uk/2024/12/11/16/11153810-8657fe4a-cca9-4916-9272-2d0b6784103c.jpg?width=1200","video":null,"publish_date":"2025-03-24 13:56:20","author":"Maryam Kara","authors":["Maryam Kara"],"language":"en","source_country":"GB","sentiment":-0.037},{"id":303589256,"title":"Blue state turning Red? Bad news for Kamala Harris as poll shows nearly 50% of voters may back a Republican for governor in 2026","text":"A new poll suggests nearly half of California’s likely voters are open to electing a Republican governor in 2026, signaling potential challenges for Democrats after years of dominance. Conducted by pollster David Wolfson for 790 KABC radio, the survey highlights growing voter frustration with issues like soaring gas prices, unchecked homelessness, and rising living costs. Key issues driving voter sentimentAccording to a Breitbart report, the poll reveals widespread dissatisfaction: 83% of voters called gas prices too high, 73% want full funding for anti-crime Proposition 36 (blocked by Democratic leaders), and 72% believe homelessness remains a crisis under Democratic governance. Additionally, 71% feel the state’s cost of living hasn’t been addressed, 69% criticize inadequate action on energy costs, and 62% demand an independent probe into recent Los Angeles wildfires. Social issues also split voters, with only 24% supporting transgender athletes in female sports. On the Democratic side, former Vice President Kamala Harris leads primary polls with 57% support, while ex-Rep. Katie Porter entered the race pledging “fresh blood” to tackle challenges. Analysts note these dynamics could reshape California’s political landscape as Republicans capitalize on voter fatigue. FAQs:Why are more California voters considering Republicans?Voters cite currently unmet challenges like high living costs, energy prices, and homelessness under Democratic leadership, driving interest in alternatives. Who are the top Democratic candidates for governor?Kamala Harris leads polls, while Katie Porter emphasizes new ideas. Both aim to address voter concerns ahead of the 2026 race.","summary":"A new poll shows 48% of California voters may back a GOP governor in 2026 amid frustration over gas prices, homelessness, and living costs. Explore key issues and Democratic contenders like Kamala Harris.","url":"https://economictimes.indiatimes.com/news/international/us/blue-state-turning-red-bad-news-for-kamala-harris-as-poll-shows-nearly-50-of-voters-may-back-a-republican-for-governor-in-2026/articleshow/119429768.cms","image":"https://img.etimg.com/thumb/msid-119429807,resizemode-4,width-1200,height-900,imgsize-1135803,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-24 13:55:12","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":0.11},{"id":303589260,"title":"US Prez Donald Trump miffed over George Clooney’s comments on press freedom; dubs interview as ‘puff piece’","text":"US President Donald Trump has lashed out at George Clooney after the latter’s appearance on 60 Minutes, where the actor discussed politics and his upcoming Broadway debut. Trump, in a social media post, called the interview a ‘total puff piece’ and criticised Clooney’s political stance as well as the show.Trump, in his post, wrote that why would the highly ‘discredited’ show do a total ‘puff piece’ on Clooney. He called the Batman actor a ‘second-rate movie star’ and failed political pundit.The president, as per reports, accused Clooney of betraying former president Joe Biden. The actor withdrew his support for Biden after a debate. Trump claimed that Clooney had dumped Biden like a dog and added that he was now being used to promote Kamala Harris, only to realise that it won’t work out too well.What did George Clooney say?As per an NY Post report, during the interview, Clooney spoke about his Broadway role as iconic journalist Edward R Murrow in Good Night and Good Luck. He drew parallels between the journalist’s fight for press freedom and modern media challenges. The 63-year-old actor was particularly referencing Trump’s legal battles with major news networks.Clooney, during the interview, said that when the judiciary, executive and legislative branches fail the public, the fourth estate (journalism) must succeed. Clooney expressed concerns about government efforts to intimidate journalists, the report stated.Also Read : 'So happy for you both': Ivanka Trump gushes over Tiger Woods-Vanessa’s romanceGeorge Clooney on Joe BidenThe actor reportedly also addressed his controversial New York Times op-ed in which he had urged Joe Biden to withdraw from the 2024 Presidential election race. He had argued that “an incumbent person” could not win.According to the NY Post report, Clooney explained that he saw Biden at a fundraiser and was “surprised” by his condition.Clooney, reflecting on his upbringing as the son of a journalist, said that he was raised to tell the truth. He added that he felt there were many profiles of cowardice in his party and that he wasn’t proud of it. Although he withdrew his support, Clooney said he respected Biden and still likes him.Donald Trump enraged with Clooney’s remarksThe NY Post report stated that Trump in a previous social media post called Clooney a fake movie actor who never came close to making a great movie. Trump stated that Clooney does not know anything and that he should get out of politics.Trump, as per the report, added that Clooney should return to television as movies never really worked for him.FAQsWhy did Donald Trump criticize George Clooney?Trump complained about Clooney's 60 Minutes interview, calling it a puff piece and attacking the actor's politics, especially his withdrawing endorsement of Joe Biden's re-election bid, because the actor talked about limited press freedom. 2. What did George Clooney say about Joe Biden?Clooney made the case in a New York Times editorial that Biden ought to leave the 2024 race, citing that he cannot win. He did this after having attended a fundraiser in person and had seen Biden himself, but restated his respect for the president personally.","summary":"US President Donald Trump took a swipe at George Clooney’s recent interview on 60 Minutes, dismissing it as a “puff piece” and branding the Oscar-winning actor a “second-rate movie star.” During the interview, Clooney, who was promoting his Broadway debut, voiced his worries about press freedom and revealed his choice to pull back his support for President Joe Biden’s re-election bid.","url":"https://economictimes.indiatimes.com/news/international/us/us-prez-donald-trump-miffed-over-george-clooneys-comments-on-press-freedom-dubs-interview-as-puff-piece/articleshow/119428165.cms","image":"https://img.etimg.com/thumb/msid-119428617,resizemode-4,width-1200,height-900,imgsize-1069791,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-24 13:19:13","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":-0.067},{"id":303566854,"title":"Orban makes a daring bet as the West weakens","text":"The winds of change in the United States could give a significant boost to Hungarian Prime Minister Viktor Orban, who was the first European Union leader to openly support Donald Trump in his long-running fight against the bloc’s liberal mainstream. Orban’s political instincts have often helped him stay ahead of the curve, and this moment may be no different. But his ability to capitalize on shifting geopolitical currents depends heavily on winning reelection in 2026.\n\nOrban threw his lot in with Trump long before it was fashionable in Europe. At a time when much of the Western political class was distancing itself from the former US president, Orban took a calculated risk. He likely reasoned that even a victory by Kamala Harris would not make the pressure from Washington any worse than it already was under the Biden administration. But with Trump surging back, the payoff for that gamble is becoming clear.\n\nTrump’s return to power would likely mean an end to direct US efforts to undermine Hungary’s domestic politics. More broadly, the victory of a Republican leader who shares Orban’s civilization-based worldview would provide a new layer of legitimacy for the Hungarian government’s unconventional foreign policy. Trump’s promises to resolve the Ukraine conflict also align closely with Orban’s longstanding calls for peace, potentially elevating his position in European debates.\n\nHungarian foreign policy has always been dismissed by critics as “unorthodox,” but that only applies if one assumes the current liberal global order is still dominant. In truth, that order is fraying. What Orban offers is a realist-nationalist approach that places sovereignty and national interest above ideological dogma. As he has said: foreign policy rooted in the national interest combines idealism (the idea of the nation) and realism (what is necessary and useful).\n\nHungary is not a great power. But under Orban, it acts like a country determined to chart its own course. This has meant rejecting both the soft and hard pressures that aim to dictate foreign policy from outside. Rather than aligning fully with the West, Budapest seeks relationships with the East and South. The logic is simple: Hungary should be present in all regions of the global economy, not confined to a single bloc. This is a kind of “national realism” that adapts to global realities but remains firmly committed to the Hungarian national interest.\n\nThis strategy gains greater urgency as the world shifts. The so-called Global South is rising, US foreign policy is evolving, and the EU is losing influence. In this environment, Hungary must balance its Western ties with expanded outreach to the Global South, Turkic states, and China’s Belt and Road Initiative. The goal is to strengthen Hungary’s position while maintaining autonomy within the EU.\n\nThis policy dates back at least 15 years, but it is gaining traction as the Western world drifts into stagnation and internal crisis. The future, Orban seems to believe, lies not in Brussels or Berlin, but increasingly in the East – from Central Asia to China and the Arab world. Hungary cannot afford to be trapped in an EU that no longer understands the nature of global transformation and insists on an outdated bloc mentality.\n\n“The path is risky,” Orban admits, “but if our calculations are correct, Hungary could gain more space to maneuver in a multipolar world than its size would normally allow.”\n\nIn the short term, this requires enduring the intensifying pressure from Brussels. With Trump back in the game, the progressive center of gravity in the West is shifting toward Europe, raising the stakes for sovereigntist governments like Hungary’s. But the upside is clear: a sympathetic White House could relieve pressure and offer vital support.\n\nFor Orban, the most immediate benefit of Trump’s return is that US pressure has stopped. The American ambassador seen as working to undermine the Hungarian government has been removed. That leaves Brussels as the main adversary, along with Hungary’s own economic struggles. With no EU funds flowing and limited room to borrow from China, Trump’s backing – perhaps in the form of loans or major investment – could be a crucial lifeline.\n\nEnding the Ukraine conflict would also be a major victory for Orban. It would vindicate his long-standing peace position and help stabilize the Hungarian economy. Meanwhile, removing key Orban allies such as Antal Rogan from US sanctions lists would help restore the ruling party’s image at home. Early signs suggest Trump may also move to reinstate the double taxation treaty revoked in 2022.\n\nA White House visit would further boost Orban’s prestige. His absence from Trump’s inauguration raised eyebrows, but it is likely that Foreign Minister Peter Szijjarto’s recent visit to the US was designed to pave the way.\n\nTrump’s renewed presence on the global stage has given Orban a surge in confidence. As the prime minister himself recently said: “We are no longer fighting to survive. Now we are fighting to win.”\n\nThis shift was evident at the most recent EU summit. French President Emmanuel Macron tried to persuade Orban to soften his stance by inviting him to Paris in advance. But this time, Orban not only threatened to veto the EU’s Ukraine support package – he used the veto. As a result, the EU had to seek ways to bypass him, a move that lays bare the bloc’s internal divisions.\n\nOrban’s political clout could grow if Trump gives him a formal role in his ideological battle against globalist elites. This is likely. The US wants to keep Western Europe on a tight leash, and leaders like Orban, Italy’s Giorgia Meloni, Austria’s Herbert Kickl, France’s Marine Le Pen, Germany’s Alice Weidel, and Slovakia’s Robert Fico could all serve as useful allies.\n\nIn return, Trump will demand loyalty – but he will also reward it with real political leverage. Sovereigntist parties in the European Parliament stand to benefit from this dynamic as well.\n\nTrump’s aim is simple: bring the West into line or keep the establishment off balance. Either outcome strengthens leaders like Orban, who have long fought against the liberal consensus.\n\nYet nothing is guaranteed. European progressive forces are still strong, and the sovereigntists have yet to achieve a true breakthrough. Ironically, Orban could lose power at home just as his broader vision begins to take shape across Europe.\n\nFor now, Orban’s top priority is winning the 2026 election. If he succeeds, he will continue to challenge the European mainstream from Brussels, backed by a more favorable international climate – and a friend in the White House.\n\nThis article was first published by Valdai Discussion Club, and edited by the RT team.","summary":"With Trump back, the Hungarian PM’s vision for Europe may finally get its moment \nRead Full Article at RT.com","url":"https://www.rt.com/news/614696-as-west-weakens-orban-makes-bet/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67e155cd20302745bb65c346.jpg","video":null,"publish_date":"2025-03-24 13:05:38","author":null,"language":"en","source_country":"ru","sentiment":0.101},{"id":303597678,"title":"Trump calls '60 Minutes' George Clooney segment a 'puff piece'","text":"President Donald Trump dismissed George Clooney's interview with CBS’ \"60 Minutes\" as a \"puff piece\" after the actor-director lodged criticisms at the commander-in-chief in between discussing his debut on Broadway. \"Why would the now highly discredited 60 Minutes be doing a total ‘puff piece’ on George Clooney, a second rate movie ‘star,’ and failed political pundit,\" Trump wrote on TRUTH Social. \"He fought hard for Sleepy Joe’s election and then, right after the Debate, dumped him like a dog. Later, I assume under orders from the Obama camp, pushed all out for ‘Kamala,’ only to soon realize that that was not going to work out to well.\" Trump continued, \"60 Minutes even fraudulently inserted Fake answers into her disastrous interview, aired just before Election Day, in one of the most embarrassing and dishonest events in broadcast history.\" \"And now George Clooney again?\" Trump asked. \"His press agent should be making a fortune!!!\" TRUMP MAKES ENDORSEMENT IN 'IMPORTANT' WISCONSIN SUPREME COURT RACE Clooney, a lifelong Democrat who joined the chorus of those calling for former President Joe Biden to end his re-election campaign last summer, sat down with \"60 Minutes\" to talk about his debut on Broadway playing American journalist Edward R. Murrow in an adaptation of his 2005 film \"Good Night, and Good Luck.\" The play focuses on Murrow's challenge to the McCarthy administration, a theme that Clooney argued mirrored what journalists are facing under Trump's second term. \"Here’s where I would tell you where we differ from what Murrow was doing. Although McCarthy would try to pose things, show up a blank piece of paper and say ‘I got a list of names.’ That was his version of fake news,\" Clooney told \"60 Minutes.\" \"We are now at a place now where we’ve found that it’s harder and harder and harder to discern the truth. Facts are now negotiated.\" Clooney also defended his decision to pen a New York Times opinion piece calling for Biden's ouster from the race just weeks after the A-lister and other Hollywood stars helped garner $30 million in donations for Biden at a Los Angeles fundraiser. \"I was raised to tell the truth,\" Clooney said when asked about the essay. \"I had seen the president up close for his fundraiser and I was surprised, and so I feel as if there were a lot of profiles in cowardice in my party through all of that. And I was not proud of that, and I also believed I had to tell the truth.\" Trump is seeking $20 billion in damages from \"60 Minutes\" and CBS' parent company, Paramount Global, over an Oct. 7, 2024, interview with former Vice President Kamala Harris leading up to the 2024 presidential election. The lawsuit, initially filed in October shortly before Trump won a second term, and later expanded last month, accuses the program of \"partisan and unlawful acts of election and voter interference\" for the way it edited the interview and aired different clips of Harris' responses. MUSK THREATENS TO SUE AFTER DEMOCRAT EX-REP JAMAAL BOWMAN CALLS HIM A 'NAZI' AND 'THIEF' DURING TV APPEARANCE An unedited transcript and raw footage were released in February amid an investigation by the Federal Communications Commission. Different answers from Harris about Israel were aired on \"60 Minutes\" and CBS' \"Face the Nation,\" but the network claimed the discrepancy was \"not doctored or deceitful.\" Despite asking the court to dismiss the case, corporate leaders are considering whether to settle. The \"60 Minutes\" segment also showed Clooney leading a Broadway table read with the play's cast. \"ABC has just settled a lawsuit with the Trump administration and CBS News is in the process,\" Clooney is heard telling the table read at Winter Garden Theater in the heart of Broadway, before the reporter's voice-over cuts him off. The reporter, Jon Wertheim, then categorizes Trump’s lawsuit against CBS as making the \"unfounded allegation\" of election interference. In December, Disney agreed to pay $16 million to settle Trump’s lawsuit against ABC News’ George Stephanopoulos. \"We’re seeing this idea of using government to scare or fine or use corporations to make journalists smaller,\" Clooney also told \"60 Minutes.\" \"Governments don’t like the freedom of the press. They never have, and that goes for whether you are a conservative or a liberal or whatever side you’re on, they don’t like the press.\" CLICK HERE TO GET THE FOX NEWS APP \"It’s a fight that is for the ages,\" the actor-director said. \"Journalism and telling truth to power has to be waged like war is waged. It doesn’t just happen accidentally. You know, it takes people saying we’re going to do these stories, and you’re going to have to come after us. And that’s the way it is.\"","summary":"President Donald Trump dubbed George Clooney&apos;s CBS&apos; &quot;60 Minutes&quot; interview a &quot;puff piece,&quot; criticizing the actor-director for his about-face on Joe Biden.","url":"https://www.foxnews.com/politics/trump-calls-60-minutes-george-clooney-segment-puff-piece","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/trump-clooney.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-24 12:55:09","author":"Danielle Wallace","authors":["Danielle Wallace"],"language":"en","category":"politics","source_country":"us","sentiment":-0.222},{"id":303562000,"title":"Trump renews spat with 60 Minutes over episode with ‘failed political pundit’ George Clooney","text":"“Why would the now highly discredited 60 Minutes be doing a total ‘puff piece’ on George Clooney, a second rate movie ‘star,’ and failed political pundit,” Trump wrote on Truth Social on Sunday. “He fought hard for Sleepy Joe’s election and then, right after the Debate, dumped him like a dog. Later, I assume under orders from the Obama camp, pushed all out for ‘Kamala,’ only to soon realize that that was not going to work out [too] well.”\n\nThe actor defended his call for Biden to step down during the interview, saying he was “raised to tell the truth.”\n\n“I had seen the president up close for this fundraiser, and I was surprised. And so I feel as if there was a lot of profiles in cowardice in my party through all of that,” Clooney explained. “And I was not proud of that. And I also believed I had to tell the truth.”\n\nClooney’s participation in the fundraiser came after reports that he called the White House after Biden condemned the international warrants issued to Israeli Prime Minister Benjamin Netanyahu. Clooney’s wife, Amal Clooney, is a prosecutor working with the International Criminal Court, at which she has offered her legal expertise since 2005. \n\nThe actor helped host a fundraiser for Biden ahead of the 2020 election, which earned him $7 million. Clooney also donated $500,000 to the Biden-Harris campaign.\n\nMeanwhile, Trump is in the middle of a lawsuit against CBS News. Trump’s grievances came after the program hosted his then-opponent Harris for an interview a month before the election. Trump claimed the edits made to Harris’s interview were “the biggest scandal in broadcast history: they actually took her answer out and gave her a different answer after it was shot.” The president is suing the network for $20 million over the dispute.\n\n“60 Minutes even fraudulently inserted Fake answers into [Harris’s] disastrous interview, aired just before Election Day, in one of the most embarrassing and dishonest events in broadcast history. … And now George Clooney again? His press agent should be making a fortune!!!” Trump wrote.\n\n60 Minutes aired the interview with Harris in full as part of the Federal Communications Commission’s investigation. After the release, CBS published a statement defending any editing, saying, “As the full transcript shows, we edited the interview to ensure that as much of the vice president’s answers to 60 Minutes’ many questions were included in our original broadcast while fairly representing those answers.”\n\nWhile CBS News’s Scott Pelley said he had plans to sit down with Trump for an interview before the election, Trump’s campaign denied that any appointment was ever settled on. At the time, the campaign also took issue with “jump cuts” that the network could make to Trump’s answers.","summary":"President Donald Trump blasted CBS News&#8217;s 60 Minutes for airing what he called a &#8220;puff piece&#8221; on actor George Clooney. Clooney was behind a fundraising effort for then-President Joe Biden that raised about $28 million, resulting in the largest Democratic haul in history. However, the actor flipped against Biden over age concerns and called for [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3356575/trump-spat-60-minutes-george-clooney/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/12/George-Clooney.webp","video":null,"publish_date":"2025-03-24 12:45:29","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","category":"politics","source_country":"US","sentiment":-0.303},{"id":303569078,"title":"‘He dumped Biden like a dog’: Trump fumes over George Clooney’s 60 Minutes interview","text":"Donald Trump fumed over George Clooney’s 60 Minutes interview and claimed that the “failed political pundit” dumped former President Joe Biden “like a dog.” \n\nClooney, a longtime Democratic Party member and fundraiser, appeared on the CBS program on Sunday to promote his Broadway debut in Good Night and Good Luck, where he stars as pioneering journalist Edward R. Murrow. \n\nThe two-time Academy Award winner told correspondent Jon Wertheim about his decision to pen a scathing New York Times op-ed calling on Biden to step aside from the 2024 race last summer before discussing press freedom and the Trump administration. \n\nIn a late-night Truth Social tirade, the president rekindled his feud with Clooney, once again criticizing his politics and acting prowess. \n\n“Why would the now highly discredited 60 Minutes be doing a total ‘puff piece’ on George Clooney, a second-rate movie ‘star,’ and failed political pundit,” Trump said. “He fought hard for Sleepy Joe’s election and then, right after the Debate, dumped him like a dog.” \n\nTrump turned his attention to his former Harris, whom he beat at the ballot box in November, reviving claims that answers in her 60 Minutes interview in October were doctored. \n\n“Later, I assume under orders from the Obama camp, pushed all out for ‘Kamala,’ only to soon realize that that was not going to work out to well,” he continued. “60 Minutes even fraudulently inserted Fake answers into her disastrous interview, aired just before Election Day, in one of the most embarrassing and dishonest events in broadcast history…”\n\n“And now George Clooney again? His press agent should be making a fortune!!!,” he concluded. \n\nTrump’s comments came after Clooney claimed that governments “don’t like” press freedom, stating there were parallels between what was happening in real life and the play. He also pointed to the president’s ongoing lawsuit with CBS and settlement with ABC News. \n\n“When the other three estates fail, when the judiciary and the executive and the legislative branches fail us, the fourth estate has to succeed,” he said. “ABC has just settled a lawsuit with the Trump administration. And CBS News is in the process… We’re seeing this idea of using government to scare or fine or use corporations to make journalists smaller.”\n\n“Governments don’t like the freedom of the press. They never have. And that goes for whether you are a conservative or a liberal or whatever side you're on,” Clooney added. \n\nThe actor also reflected on his decision to endorse Harris’s 2024 run after Biden stumbled over his words during a debate against Trump just weeks earlier. Clooney’s comments came just weeks after he headlined a star-studded fundraiser that raked in $28 million for Biden’s reelection campaign. \n\n“I was raised to tell the truth,” Clooney, whose father was a veteran journalist and anchorman, said. “I had seen the president up close for this fundraiser, and I was surprised. And so I feel as if there was a lot of profiles in cowardice in my party through all of that. And I was not proud of that.” \n\n“And I also believed I had to tell the truth,” he concluded. \n\nIn response to the essay in June, Trump declared Clooney was a “fake movie actor” and urged him to “get out of politics and go back to television.”","summary":"President branded Clooney as a ‘second rate movie star’ and dismissed his appearance as a ‘total puff piece’","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-george-clooney-60-minutes-b2720489.html","image":"https://static.independent.co.uk/2024/07/11/08/TRUMPCLOONEYBIDENSPLIT.jpg?width=1200&auto=webp&quality=75","video":"https://cdn.jwplayer.com/videos/C0bKpGS2-4VHSaSK0.mp4","publish_date":"2025-03-24 12:44:04","author":"James Liddell","authors":["James Liddell"],"language":"en","source_country":"gb","sentiment":-0.185},{"id":303567398,"title":"Will California Democrats defer to former VP Kamala Harris if she runs for governor?","text":"Former Rep. Katie Porter certainly didn’t wait for former Vice President Kamala Harris to decide whether she, too, wants to run for California governor in 2026.\n\nBut Porter, in recently declaring her candidacy to replace term-limited Gov. Gavin Newsom, has put a bit of an asterisk next to her campaign.\n\nShould Harris decide to enter the race, Porter would bow out, her spokesperson has said.\n\nRELATED: California has never elected a female governor, but Katie Porter’s entry to 2026 race raises the odds\n\nPorter is laying out her cards.\n\n“If Kamala comes into this race — especially if she comes in tomorrow, she comes in now — it’s going to have a near field-clearing effect,” Porter said on a recent episode of the “Pod Save America” podcast.\n\nIt would be “disrespectful,” Porter said when pressed on why she’s willing to defer to Harris rather than run a campaign regardless, not to acknowledge that the 2024 Democratic presidential nominee “would be an incredibly strong candidate.”\n\nMeanwhile, other candidates are ignoring the Harris-of-it-all shadow cast on the already-crowded field for governor.\n\nFormer Assembly Speaker and Los Angeles Mayor Antonio Villaraigosa, for instance, said a theoretical Harris entry doesn’t matter. He’s in it to win it, he said during a recent event at the UC Student and Policy Center in Sacramento.\n\nSo what’s the better campaign strategy for the field of Democrats, a group that, as of now, includes legislative leaders, members of the state’s executive branch and a former congressional representative?\n\nDefer to the person who led your party in the recent presential election?\n\nOr fight for pole position, convince voters that no matter who else runs, you’re the best one for the job?\n\nIt’s politics, so predicting just which approach is the most politically savvy strategy may be a fool’s errand this early in the race.\n\nStill, it could prove to be a defining moment for Democrats, said Matt Lesenyie, who teaches political science at Cal State Long Beach, with a focus on political psychology and messaging.\n\nLikening it to an actual horse race, Lesenyie said the Democratic Party — and to some extent, Republicans, too — have struggled because they have not had their top candidates really go toe-to-toe with one another.\n\n“Their thoroughbreds haven’t actually had to run a race until it was too late,” he said. “(Former President) Joe Biden is a quality candidate but probably should have had another runner-up against him in the primary to show he still has it or he doesn’t.”\n\nBut certainly when you have a race oversaturated with quality candidates, most of them are going to take a foreseeable loss, Lesenyie said.\n\nSo some candidates may need to decide if they’d gain more by going up against a candidate like Harris — or if they can afford another loss on their record.\n\n“There’s an unwritten rule: You can only lose two races and continue on with your political career,” Lesenyie said. “Voters can sour on you because you’re a two-time loser. You may be a winner other times, but you’ve picked the wrong fights.”\n\nAnd then there’s the fundraising aspect. Lose too many races and donors may keep their wallets closed.\n\nIn that sense, “it may end up looking like either getting all the way in or staying out until Harris should decide might have been more plausible strategies,” said Dan Schnur, who teaches political messaging at USC and UC Berkeley.\n\nSchnur said a defer-to-Harris strategy is “a puzzling approach.”\n\n“The message is essentially, ‘I’m the second-best person in California to be governor. Give me money just in case the person who is better than me doesn’t run.’ It’s hard to see how a lot of donors would contribute to a candidate who might not be in the race later this year,” Schnur said.\n\nHarris reportedly said she would decide by the end of summer whether she’s entering the race.\n\nIn the meantime, other Democratic candidates have been a bit less vocal about their plans.\n\nA spokesperson for Lt. Gov. Eleni Kounalakis has said she remains committed on her gubernatorial bid. But Politico reported that Kounalakis, who is close to Harris, is also quietly considering running for state treasurer instead.\n\nState Superintendent Tony Thurmond told Politico “we’ll see” about his campaign’s future should Harris run, but also said he was not running for anything else.\n\nBusinessman Stephen Cloobeck is not one of those candidates. He unequivocally said he does not care who else is running; he’s in the race because he believes “California is worth fighting for.” He accused the other Democratic candidates of being too focused on their own resumes and wanting to “force each other into the race” to see if they’d have a better chance of running elsewhere.\n\n“Those in office now have failed us,” he said. “They have not done the job or the work.”\n\nWhile Porter has taken that defer-to-Harris approach, she’s balancing it with still casting herself as the No. 1 person for the job.\n\nPorter’s campaign, in a recent fundraising email, of course, makes no mention of Harris. Instead, it acknowledged “this race won’t be a walk in the park” with so many contenders and propped the former congresswoman up as “a leader who is ready to go toe to toe with extremists.”\n\nAnd when pressed on the “Pod Save America” podcast if she thought she’d be a better chief executive for California than Harris, Porter said, “If I didn’t think I would be the best governor that California could have, I wouldn’t be in this race.”\n\nBut Schnur, at least, isn’t necessarily convinced it’s the right approach.\n\n“‘I’m in the race for now,’ is not a particularly compelling bumper sticker,” he said.","summary":"Former Rep. Katie Porter's spokesperson says she'll bow out if the former vice president jumps into the race.","url":"https://www.mercurynews.com/2025/03/24/will-california-democrats-defer-to-former-vp-kamala-harris-if-she-runs-for-governor/","image":"https://www.mercurynews.com/wp-content/uploads/2025/03/OCR-L-HARRISEFFECT-0320-04.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-24 12:32:07","author":"Kaitlyn Schallhorn","authors":["Kaitlyn Schallhorn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.038},{"id":303562004,"title":"F-bombs away: Democrats unleash profanity and vulgarity in war with Trump","text":"The profanity-laced comments brought a loud round of applause from the Trump-averse audience. \n\nYet the remarks were just the latest instance of lawmakers’ jarring choice of words, representing a changing communication style among the broader Democratic Party, which is increasingly turning to profanity in its fractured resistance to the GOP.\n\nIt’s a notable turn for a party that has long touted itself as the adult in the room in comparison to the freewheeling Trump and his MAGA acolytes.\n\nDemocratic Party approval rating hits record low: Poll\n\nWhile the X-rated comments that Democratic lawmakers and organizations have lobbed against Trump and the GOP are likely playing to their base, it’s unclear how it could translate to winning back key constituents who defected from the party during the 2024 election.\n\n“I don’t think it works necessarily, but I think they’re in a tough spot. I think that there is a cadre in the Democratic Party from good primary voters up through good donors who wants to do something, anything, and they’re struggling,” said Jacob Neiheisel, an expert on political communication and campaigns at the University at Buffalo. “They’re really struggling with what a response looks like. And when you don’t have any of the levers of power, there’s not a lot you can do.” \n\nIn recent weeks, multiple Democrats have stepped up their profanity-laced comments that, in some ways, mimic Trump’s own hostile attitude since he stormed the political world during the 2016 election.\n\nGov. Tim Walz (D-MN), who served as former Vice President Kamala Harris’s running mate, claimed he could “kick most of their ass” when discussing the MAGA movement. Trump, in return, called Walz a “loser” on Friday.\n\nSen. Tina Smith (D-MN) called Department of Government Efficiency chief Elon Musk “a d***” and “billionaire a**hole boss” after the agency sent out an email requiring federal workers to list five achievements they had done for the week.\n\nSimilarly, Rep. Jasmine Crockett (D-TX) said her message to Musk was to “f*** off” when asked by a reporter last month.\n\nSen. Chris Murphy (D-CT) said he had a “tough f***ing day” after 10 Democrats, led by Senate Minority Leader Chuck Schumer (D-NY), voted to allow the GOP-led government funding bill to advance in the Senate before it was ultimately passed by the upper chamber last week to avoid a shutdown.\n\nSchumer’s approval of the funding bill was a severe blow to Democrats’ flailing efforts to resist the Trump administration.\n\nMurphy did not vote for the bill but cautiously embraced Schumer, who is under growing calls to step down as minority leader.\n\nThe Democratic National Committee’s X feed has become punchier in slamming Trump after it was widely panned for graphic posts explaining what Democrats were doing to resist the president.\n\nIt shared a graphic of Gov. Tony Evers (D-WI) calling “bulls***” on Trump’s efforts to dismantle the Department of Education.\n\nWhen Trump and Musk attempted to boost support for Tesla at the White House after its stock market value plummeted, the DNC called one of the vehicles an “ugly ass truck.”\n\nThe DNC X account also reshared another Smith post using profanity against Trump’s efforts to dismantle the Education Department. \n\n“More bulls***,” Smith said. “[Trump] can’t shut down the Department of Education — and you know it. Fox News even knows it. So stop it.”\n\nNot to be outdone, the Democratic Congressional Campaign Committee shot back against Rep. Harriet Hageman’s (R-WY) comments defending DOGE during a recent town hall meeting that prompted boos from the audience.\n\n“Who the f*** talks to their constituents this way? These people pay your salary!” the DCCC X account wrote Friday morning. “Shame on you.”\n\nSome Democrats stressed that as the party plots to retake power from the GOP in 2026, there needs to be a balance between showing a willingness to fight back and appealing to constituents who drifted away during the elections.\n\n“We are seeing in real time that there is just rising angst and anger among sort of the Democratic base, and so that kind of language sort of matches the moment with the emotions,” said Kate deGruyter, senior director of communications of the centrist group Third Way.\n\n“You can absolutely take it too far or apply it in ways that … are cringe, and that’s something that we’ve got to be thoughtful about how to avoid,” deGruyter added. But “I think that it is appropriate to recognize that the moment, the means of communication, the style of communication, has shifted from a different era.” \n\nFifteen years ago, then-Vice President Joe Biden caused a media brouhaha when he whispered into then-President Barack Obama’s ear, “This is a big f***ing deal!” just before Obamacare was signed into law.\n\nAlmost two decades later, Democrats have ripped the Band-Aid off of public swearing.\n\nDNC Vice Chairman Malcolm Kenyatta bemoaned rulings from the Supreme Court in favor of Trump after the president called to impeach a federal judge who ruled against him.\n\n“John Roberts could have sent a message to Trump by not giving him f***ing immunity when he was charged with a bunch of crimes,” he wrote on X on Wednesday in response to the chief justice criticizing Trump’s calls for judicial impeachments.\n\nFellow DNC Vice Chairman David Hogg posted “What the f***” after reports surfaced that the Native American Code Talkers were removed from some military websites.\n\nTrump regularly used “bulls***” on the campaign trail, and Vice President JD Vance claimed on the trail that his predecessor, Harris, should “go to hell.”\n\nOther Republican lawmakers, including firebrand Rep. Marjorie Taylor Greene (R-GA), have echoed the president’s penchant for colorful language.\n\n“I’m not a doctor, but I have a PhD in recognizing bulls*** when I hear it,” Greene said last year when experts said the COVID-19 vaccine saved 14 million lives globally.\n\nSome Democrats denounced Greene’s comments at the time.\n\nAnother GOP firebrand, Rep. Chip Roy (R-TX), used the curse word during an interview with Texas Monthly.\n\n“If political bulls*** is what’s thrown my way, then that political bulls*** will be thrown back if necessary. But I don’t want it to be necessary,” he said after flying to Mar-a-Lago to meet with Trump.\n\nSome political studies have shown that swearing in the political discourse can positively affect political candidates or lawmakers, especially if the candidate is a man.\n\n“I think that [swearing] has the effect of bringing a lot of attention to political speech,” Neiheisel said. “I think it does have the effect of mobilizing to some extent and making people excited along those same lines.”\n\n“For Democrats right now, at least among a slice of the base, it has become important to look like they’re really fighting,” Neiheisel continued. “The Democratic donor class, the people who vote in primaries, those who are really plugged in, want Democrats to do something, anything. I think this might be pitched as part of a mobilization strategy, saying we’re taking the gloves off.”\n\nYet, other Democratic strategists were less than impressed with the turn toward cursing, stressing a need to focus on economic troubles to improve the Democratic brand.\n\n“Nothing either party is saying is as bad as what they are not doing,” said Erick Sanchez, a Democratic strategist. “The congressional approval rating is at 29%, and the current cost of a dozen eggs is $5. Talk is cheap. Omelets are not.”\n\n“I don’t think it’s courageous to be cursing up a storm on social media. I think it’s more courageous to be doing that in places, not cussing, but showing up and doing the work,” added Michael Ceraso, another Democratic strategist. “And getting offline and getting in the faces of legislators that are causing havoc for folks that are trying to do good in the local communities, more so than anything else.”\n\nDemocrats have repeatedly pressed lawmakers at town halls to increase the intensity of their fight against Trump.\n\n“I am so angry. I am so scared. I feel our democracy is in danger. … I wish you’d be angry,” Melissa Morgan told Rep. Gil Cisneros (D-CA) during a town hall last week. “I just wish that the Democrats would match my anger and my fear.”\n\nAt a separate town hall, Rep. Glenn Ivey (D-MD) was told he was “too calm” as Trump furiously works to slash the federal workforce and transform Washington.\n\nMarva Diaz, a political strategist and California Target Book publisher, told the Washington Examiner that Democrats are still trying to learn lessons from 2024 and why more of their traditional Democratic base voted for Trump.\n\nTrump’s ability to connect with working-class, male, and minority voters through plainspoken word choices could be one indication of why Democrats are turning to cursing in public. \n\n“What we’re seeing out in the world are people trying to figure it out. Well, if it worked for this guy, can I get away with that, too?” Diaz said.\n\nHowever, she cautioned that the antics seemed “a little bit clumsy” and stressed that Democrats need to connect with voters in real life.\n\n“The more logical way to me is to get off of Twitter and X, or whatever it’s called … and go out and talk to people,” Diaz said. “Get off your computer screen, get off of your phone, and go talk to voters; go see what’s happening.”\n\nBut, deGruyter, with Third Way, claimed Democrats could step up their sharp attacks on Trump while also working on ways to reengage voters.\n\n“It is not accurate to pretend that what the Trump administration is doing isn’t a massive departure from every standard we’ve ever had about how a president should behave,” deGruyter said. “And so we do a disservice to normalize that. And yet we have to be strategic in our answer.” \n\n“We need to be thinking about how we drive a coherent message to the American people,” she said.","summary":"During a recent late-night TV appearance, Sen. Adam Schiff (D-CA) bluntly responded to President Donald Trump&#8216;s frequent attacks on his physical appearance. &#8220;I&#8217;m a good Democrat. So my view, of course, is when they go low, we go high, he can go f*** himself,&#8221; Schiff told Jimmy Kimmel Thursday evening, making a sharp twist on [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3352606/democrats-profanity-vulgarity-swearing-trump/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/Schumer-Democrats-scaled.webp","video":null,"publish_date":"2025-03-24 12:00:00","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.096},{"id":303548436,"title":"Trump Slams Obama’s Nobel Prize—‘If My Name Was Obama, I’d Have One Too!’","text":"President Donald Trump had once claimed that he would have received a Nobel Prize as well if he had ‘Obama’ in his name. Trump did not shy away from dismissing the Nobel Peace Prize won by his predecessor former President Barack Obama in 2010.\n\nDuring Donald Trump’s address in Detroit, he said that there was “unfairness” in this world and that if Trump were a liberal democrat he would have received the Nobel prize as well for signing the Abraham Accords. “And I’m not saying want or not. I’m not saying, I’m just saying if it was anybody else, liberal Democrat, they would have had it before the damn thing was even signed,” Trump said.\n\n🚨🇺🇸TRUMP claims Obama’s Nobel Prize was undeserved, stating he won but didn’t do anything. Trump thought his administration would earn similar recognition for achievements like the Abraham Accords. (Source: Outkick) pic.twitter.com/vhj9PQHQfz\n— Anti-Woke Warrior (@AntiWokeWar_) March 23, 2025\n\nThe Abraham Accords are all bilateral agreements that normalise relations between Israel and the United Arab Emirates, and between Bahrain and Israel, which were signed on September 15, 2020. The UAE agreement was mediated by the United States and announced on August 13, followed by Bahrain’s agreement on September 11. The signing of the agreement took place on the White House balcony and was hosted by President Trump.\n\nFormer President Barack Obama received the Nobel Peace Prize for “extraordinary efforts to strengthen international diplomacy” and also “for his vision of a nuclear-free world”, awarded just months into his first term. Trump’s remarks come as he continues to seek support in Michigan, a critical battleground state.\n\nDuring his speech, Donald Trump even made some controversial comments about Detroit, and suggested that the entire country would resemble the city if former Vice President Kamala Harris is elected President. “Our whole country will end up being like Detroit,” he stated, drawing immediate backlash from local leaders.\n\nMike Duggan, the Mayor of Detroit countered Donald Trump’s remarks and highlighted the city’s recent achievements in population growth and crime reduction. “Lots of cities should be like Detroit. And we did it all without Trump’s help,” Duggan noted on social media. US Representative Shri Thanedar also criticized Trump, urging him to “keep Detroit and our people out of your mouth.”\n\nMichigan Attorney General Dana Nessel remarked on X, “This guy is calling us ugly and then asking us out on a date.” Governor Gretchen Whitmer also asserted that the people of Detroit would remember Donald Trump’s comments in the upcoming election. Trump’s campaign later defended his statements that attributed Detroit’s challenges to “globalist policies championed by Kamala Harris” and “promising a new era of economic success if he were re-elected.”\n\nHowever, Donald Trump has had a history of making inappropriate comments on the Democrats. Recently too Trump took a dig at Barack Obama and described him as “terrific” who has a “great sense of humor.” President Donald Trump also said that they did not talk about the bitterness about the elections.\n\nTrump: If I were named Obama, I would’ve had the Nobel Prize. He got the prize, he didn’t know what he got it for. He got elected. So did I… I got elected too. There’s a lot unfairness in this world pic.twitter.com/ioR06AxlBr\n— Acyn (@Acyn) October 10, 2024\n\n“I found him to be terrific. I found him to be very smart and very nice. Great sense of humor, as much as you can have a sense of humor talking about tough subjects, but we were talking about some pretty tough subjects. We were talking about some victories, also. Some things that he feels very good about,” Trump told CBS’s ’60 Minute’ program.\n\nA day after the general election Trump and Obama met in the Oval Office of the White House. A meeting that was scheduled for 15 minutes, surprisingly went on for 90 minutes.\n\n“This was just going to be a quick little chat and it lasted close to an hour and a half. It could have gone on for four hours. I mean, it was in fact, it was almost hard breaking it up because we had so many things to say. He told me the good things and the bad things,” he said, adding that among the bad things is the situation in the Middle East.\n\n“I wanted to get his full view. I got a good part of his view. And I like having that because I’m going to be inheriting that in a short period of time,” he said.","summary":"Donald Trump takes a dig at Barack Obama for receiving Nobel Peace Prize, calls him 'undeserving'","url":"https://www.inquisitr.com/trump-slams-obamas-nobel-prize-if-my-name-was-obama-id-have-one-too","image":"https://www.inquisitr.com/wp-content/uploads/2025/03/Trump-Slams-Obamas-Nobel-Prize-1.jpg","video":null,"publish_date":"2025-03-24 11:39:04","author":"Shrobana Rakshit","authors":["Shrobana Rakshit"],"language":"en","source_country":"us","sentiment":-0.47}]}