{"offset":0,"number":50,"available":357,"news":[{"id":326894446,"title":"MAGA Accuses Democratic Senator Cory Booker of Doing 'Nazi Salute'","text":"Senator Cory Booker of New Jersey, a Democrat, has drawn criticism from right-wing commentators and social media after making a gesture that bears similarity to the controversial one previously made by Elon Musk and Steve Bannon, for which they faced heavy backlash.Newsweek reached out to Booker's office and Elon Musk by email outside of normal business hours on Saturday evening for comment.Why It MattersMusk during President Donald Trump's second inauguration in January made a gesture that many claimed was a Nazi salute, while the tech mogul and his allies defended it as a harmless and well-intentioned gesture meaning \"my heart goes out to you.\" Musk made the gesture twice.Musk responded at the time to the criticism with a message on X, saying: \"Frankly, they need better dirty tricks. The 'everyone is Hitler' attack is sooo tired.\"Bannon, host of the influential War Room podcast and former White House strategist, then made a similar gesture during a speech at the Conservative Political Action Conference (CPAC) in February and saying, \"fight, fight, fight.\"Supporters of Musk and Bannon have also claimed that the pair have made a \"Roman salute,\" which was depicted in 18th and 19th-century art, but there is no historical evidence from ancient Rome that it was a common practice.What To KnowBooker spoke at a Democratic convention in California on Saturday, ending his speech with a gesture where he put his hand over his heart, then extended his hand out to the crowd – much in the way Musk and Bannon did, though not as forcefully as Musk did it.The video was first posted by Richie Greenberg, a San Francisco-based political commentator and former GOP mayoral candidate for the city, and quickly spread among MAGA-social media.Greenberg posted the video with the caption: \"Moments ago, Cory Booker salutes 4,000 CA Democrat Party delegates.\"Collin Rugg, co-owner of conservative news site Trending Politics, reposted the video, adding that he is \"looking forward to the wall to wall coverage from the \"honest\" and totally not biased media.\"Social media influencer Gunther Eagleman wrote that Booker was a \"straight up NAZI,\" adding \"WOW\" and \"HOLY S***!\"Right-wing journalist Nick Sortor similarly piled in with the video, writing that Booker made a \"Nazi salute\" and calling him \"literally Hitler\" for doing so.Booker has garnered much attention since his record-setting speech, remaining on the Senate floor and continuing to speak for 25 hours and five minutes, surpassing the previous record held by Senator Strom Thurmond in 1957.Booker used his time to protest Trump and Republican policies, invoking the late Representative John Lewis of Georgia and the need for \"good trouble\" in times of crisis.The speech earned Booker some goodwill, which was reflected in a recent poll released by AtlasIntel, which found him the fourth-leading candidate among Democratic voters for a potential 2028 presidential nominee, ranking just behind Pete Buttigieg, Representative Alexandria Ocasio-Cortez of New York, and Kamala Harris.","summary":"Senator Cory Booker made the gesture at the end of a speech he gave during a Democratic convention in California on Saturday.","url":"https://www.newsweek.com/maga-accuses-democratic-senator-cory-booker-doing-nazi-salute-2079436","image":"https://d.newsweek.com/en/full/2654667/senator-cory-booker-new-jersey.jpg","video":null,"publish_date":"2025-06-01 01:29:56","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.194},{"id":326894952,"title":"Gov. Tim Walz calls on Democrats to be ‘meaner’ and ‘bully the s–t’ out of President Trump","text":"Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s–t’ our of President Donald Trump during a speech in South Carolina.\n\nThe failed 2024 vice presidential candidate was the keynote speaker at the Democratic organized event in the Palmetto State on Saturday where he delivered a profanity-laced speech that called on his party members to toughen up in their resistance measures against President Trump.\n\n“Maybe it’s time for us to be a little meaner, a little bit more fierce,” Walz said to raucous applause from the crowd.\n\n“The thing that bothers a teacher more than anything is to watch a bully,” the governor said. “And when its a child you talk to them and you tell them why bullying is wrong.”\n\n“But when its an adult like Donald Trump, you bully the s–t out of him back,” Walz intoned.\n\nHe further characterized the president a “wannabe dictator”\n\n“Donald is the existential threat we knew was coming,” Walz said at another point during the Saturday morning remarks, adding that, for Democrats, “it is going to be a challenging few years here.”\n\n“We’ve got the guts and we need to have it to push back on the bullies and the greed,” Walz said during his remarks.\n\nDespite the tough talk and foul language directed at the commander and chief, Walz also encouraged South Carolina Democrats to keep things light.\n\n“Damnit, we should be able to have some fun and be joyful,” the former public school teacher said. \n\nDuring the remarks which repeatedly took aim across the political aisle, Walz made fun of the President Trump branded “big, beautiful bill.”\n\n“I used to teach Fourth Grade and I was gonna say it sounded like something like a Fourth Grader came up with it but that would be insulting to my Fourth Graders,” Walz said to chuckles from the crowd.\n\nThe Minnesotan also took the opportunity to heap praise on his ex-running mate former Vice President Kamala Harris.“Damnit, I would love to turn on the TV and see her instead of what we see every day,” Walz said to applause, further characterizing Harris as “well-accomplished.”\n\nWalz’s glib and blue-collar manner during public speeches has previously ended up with him in hot water when he took aim at carmaker Tesla and its CEO Elon Musk.\n\nThe governor celebrated a drop in the stock price for the electric car company saying it gave him “a little boost during the day.”\n\nWalz later called himself a “knucklehead” when it was revealed that the state of Minnesota’s pension fund owns shares of Tesla.","summary":"Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s–t’ our of President Donald Trump during a speech in South Carolina. The failed 2024 vice presidential candidate was the keynote speaker at the Democratic organized event in the Palmetto State on Saturday where he delivered a profanity-laced speech that called on...","url":"https://nypost.com/2025/05/31/us-news/gov-tim-walz-calls-on-democrats-to-be-meaner-and-bully-the-s-t-out-of-wannabe-dictator-president-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105657745.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-01 01:28:52","author":"Shane Galvin","authors":["Shane Galvin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.144},{"id":326879816,"title":"AOC Viewed Positively by More Americans Than Trump and Harris—Poll","text":"More Americans have a positive image of progressive Representative Alexandria Ocasio-Cortez, a New York Democrat, than they do of President Donald Trump and former Vice President Kamala Harris, according to new polling data.Why It MattersOcasio-Cortez has been seen as a polarizing figure in politics and within the Democratic Party. She has drawn backlash from moderate Democrats and Republicans alike since she surged onto the national stage after an upset primary victory against a powerful incumbent Democrat in 2018.The New York progressive has embraced the Democratic socialist label, despite pushback from within her own party. Recently, she has traveled around the country holding massive rallies with progressive Senator Bernie Sanders, a Vermont independent, with the duo turning out thousands—including in conservative districts and states.What to KnowNew polling released Friday by AtlasIntel—which has been described by election analyst Nate Silver as \"top-rated,\" and was described as the most accurate pollster of the 2024 and 2020 elections—showed Ocasio-Cortez ranked third among politicians included in the survey, in terms of Americans who had a positive view of her. The congresswoman was also one of just three political leaders with an overall net positive image.The New York Democrat was viewed positively by 46 percent of respondents, compared to 44 percent that viewed her negatively—meaning her net positive rating was above water by 2 points. An additional 10 percent of respondents said they didn't know.Only former President Barack Obama and former first lady Michelle Obama ranked higher than the congresswoman. Barack Obama was viewed positively by 53 percent compared to 43 percent who viewed him negatively. Michelle Obama was 49 percent positive and 45 percent negative.Meanwhile, Ocasio-Cortez was ahead of Trump and Harris, as well as Vice President JD Vance and former President Joe Biden. Trump was viewed positively by 44 percent, Vance by 42 percent, Harris by 42 percent and Biden by 37 percent. Respectively the politicians were viewed negatively by 55 percent, 56 percent, 52 percent and 55 percent.The poll included 3,469 respondents and had a margin of error of plus or minus 2 percentage points at a 95 percent confidence level. It was carried out from May 21 through May 27.Speculation has swirled in recent months about Ocasio-Cortez's political future, especially as she has rallied with Sanders across the country. Many have urged her to consider challenging Senator Chuck Schumer, a New York Democrat, in the 2028 primary, while others see her as a strong Democratic presidential contender.What People Are SayingRepresentative Alexandria Ocasio-Cortez to Fox News in April when asked about her future plans: \"This moment isn't about campaigns, or elections, or about politics. It's about making sure people are protected, and we've got people that are getting locked up for exercising their First Amendment rights. We're getting 2-year-olds that are getting deported into cells in Honduras. We're getting people that are about to get kicked off of Medicaid. That, to me, is most important.\"D. Stephen Voss, political science professor at the University of Kentucky, previously told Newsweek via email: \"AOC serves as the face of the Democratic Party for many Trump supporters who dislike national Democrats. They like to pillory her as ignorant and irresponsible.\"Voss continued: \"At the same time, many Democrats embrace AOC as a worthy young successor to Bernie, someone who can play the role of progressive challenger in a Democratic nomination battle.\"Monica Crowley, a former official in the Treasury Department during the first Trump administration, told Fox News last November: \"Just a word of warning to the Republicans, to my party: Do not underestimate AOC. She's young, she's vibrant, she's attractive.\"What Happens Next?Ocasio-Cortez's future political moves remain to be seen. For the time being, she has said she aims to focus on fighting back against the Trump administration.","summary":"The New York progressive ranked third among politicians included in the survey, just behind the Obamas.","url":"https://www.newsweek.com/aoc-viewed-positively-more-americans-trump-harris-poll-2079414","image":"https://d.newsweek.com/en/full/2654651/alexandria-ocasio-cortez.jpg","video":null,"publish_date":"2025-05-31 22:31:49","author":"Jason Lemon","authors":["Jason Lemon"],"language":"en","category":"politics","source_country":"US","sentiment":0.224},{"id":326882802,"title":"Left-leaning influencers embrace Bluesky without abandoning X, Pew says","text":"It’s no surprise that many big, left-leaning social media accounts have recently joined Bluesky — but a new analysis from the Pew Research Center attempts to quantify that shift.\n\nThis comes as an update to Pew’s news influencer report released in November 2024, which did not include Bluesky in its numbers. The report focused on a relatively small group of 500 influencers, all of whom have more than 100,000 followers on at least one major platform and post regularly about current events.\n\nFor this Bluesky-centric update, Pew looked at those same influencers (as opposed to accounts that may have found a big audience on Bluesky exclusively) and saw that in February/March, 43% of them had an account on Bluesky. Just over half (51%) of those accounts were created after the 2024 presidential election.\n\nThere’s a big divide between influencers on the right and the left, with 69% of the left-leaning accounts (the ones that explicitly identified as liberals or Democrats and expressed support for Kamala Harris or Joe Biden before the presidential election) making the jump to Bluesky, while only 15% of the conservative ones did the same.\n\nThis movement wasn’t necessarily at the expense of X (formerly Twitter). While X owner Elon Musk’s alliance with now-President Donald Trump seemed to drive new users to Bluesky, 82% of the influencers tracked by Pew still had an account on X, down only slightly from 85% in summer 2025.\n\nIn other words, even if left-leaning influencers are dipping their toes into Bluesky, most of them (87%) haven’t abandoned X. Pew also says most influencers continue to post more regularly on X than on Bluesky.\n\nHowever, Bluesky activity does appear to be picking up — the number of influencers on Bluesky who are actually posting grew from 54% in the first week of January to 66% in the last full week of March.","summary":"It’s no surprise that many big, left-leaning social media accounts have recently joined Bluesky — but a new analysis from the Pew Research Center attempts to quantify that shift. This comes as an update to Pew’s news influencer report released in November 2024, which did not include Bluesky in its numbers. The report focused on [&#8230;]","url":"https://techcrunch.com/2025/05/31/left-leaning-influencers-embrace-bluesky-without-abandoning-x-pew-says/","image":"https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2185895875.jpg?resize=1200,800","video":null,"publish_date":"2025-05-31 21:01:57","author":"Anthony Ha","authors":["Anthony Ha"],"language":"en","source_country":"us","sentiment":-0.206},{"id":326872786,"title":"Republicans won’t stop beating up on Biden because it’s all they have","text":"President Donald Trump hasn’t even been back in office for 200 days, and already, his second term is a full-blown disaster.\n\nHe’s sort of breaking up with his tech billionaire co-President Elon Musk. His so-called “One Big Beautiful Bill,” pitched as the cornerstone of his legislative revival, is tearing the GOP apart. His power grabs are being dragged through the courts. And his tariff plan—if it survives—could drive up prices and tip the economy toward a recession.\n\nWith all that chaos on their plate, Republicans should be laser-focused on solving problems. Instead, they’re still obsessed with former President Joe Biden.\n\nTwo recent stories gave them just enough cover. First, a Beltway tell-all claimed Biden’s team downplayed his health issues when he launched his reelection bid. Then came news of his metastatic prostate cancer diagnosis—and Republicans immediately, and without evidence, cried “cover-up.” \n\nRep. James Comer, after leading a failed 15-month impeachment investigation, even suggested that Biden should testify before Congress over his use of an autopen, as if that somehow proves cognitive decline. For the record: Autopens are legal. Presidents, including Barack Obama, have used them, despite MAGA’s ongoing paranoia.\n\nTo be clear, Republicans aren’t the only ones who raised questions about Biden’s mental and physical fitness. Democrats did too. So did the media. His age and decline weren’t hidden—they were headline news. Voters knew what they were signing up for.\n\nAnd sure, it’s possible this issue could resurface in 2026 or 2028. But if it does, it won’t be because MAGA world kept doomposting about Biden’s brain scans; It’ll be because Democrats failed to give voters anything else to care about.\n\nLet’s be real. The defining story of the next election won’t be Biden’s prostate. It’ll be Trump—his chaos, his legacy, and the wreckage he’s already leaving behind.\n\nTo name just a few lowlights: He’s nuked the economy with asinine tariffs. He’s gutted the federal workforce, undermining basic services like Social Security and weather forecasting. He’s threatened law firms to scare them away from challenging his illegal moves—or defending his political enemies. He’s openly ignoring court orders, plunging the country into a full-blown constitutional crisis.\n\nAnd that’s just the tip of the iceberg.\n\nVoters won’t forget. Republican lawmakers are already getting grilled by angry constituents at town halls. The idea that Biden’s medical chart will outweigh Trump’s reign of chaos is laughable.\n\nBut that’s the GOP’s bet because they need Biden in the narrative. They need a scapegoat, a boogeyman, a distraction. They can’t run on their record, so they run on fiction.\n\nJust look at how Democrats have responded to the Biden book: no freakouts, no backstabbing. Most agree he shouldn’t have run again—but they aren’t re-litigating 2024 or knifing one another over 2028. That unity says more than any hot take. Republicans need Biden in the story. Democrats have already moved on.\n\nOf course, in MAGA-land, Biden’s name will never die. His health, his staff, his supposed “cover-up”—all filed under the same deranged umbrella as Benghazi, birth certificates, George Soros, and Kamala Harris’ laugh. None of it’s real. It’s just Republican fan fiction. And when the headlines dry up, the fever swamp always circles back to its favorite fantasy villains.\n\nStill, if swing voters are actually talking about Biden in 2028, Democrats will only have themselves to blame for failing to give the country something better to talk about.","summary":"President Donald Trump hasn’t even been back in office for 200 days, and already, his second term is a full-blown disaster.\n\n\n\nHe’s sort of breaking up with his tech billionaire co-President Elon Musk. His so-called “One Big Beautiful Bill,” pitched as the cornerstone of his legislative revival, is tearing the GOP apart. His power grabs are being dragged through the courts. And his tariff plan—if it survives—could drive up prices and tip the economy toward a recession.\n\n\n\nWith all that chaos on their plate, Republicans should be laser-focused on solving problems. Instead, they’re still obsessed with former President Joe Biden.\n\n\n\nTwo recent stories gave them just enough cover. First, a Beltway tell-all claimed Biden’s team downplayed his health issues when he launched his reelection bid. Then came news of his metastatic prostate cancer diagnosis—and Republicans immediately, and without evidence, cried “cover-up.” \n\n\n\nRep. James Comer, after leading a failed 15-month impeachment investigation, even suggested t","url":"https://www.dailykos.com/story/2025/5/31/2325119/-Republicans-won-t-stop-beating-up-on-Biden-because-it-s-all-they-have?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1435932/story_image/AP25138794570159.jpg?1748030048","video":null,"publish_date":"2025-05-31 21:00:04","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":-0.3},{"id":326862766,"title":"Tim Walz Tells Democrats to 'Bully the S***' Out of Donald Trump","text":"Minnesota Governor Tim Walz urged his Democratic colleagues to \"change the attitude\" of the party and \"bully the s***\" out of President Donald Trump in an effort to pass long-standing left-wing goals and policies.Newsweek reached out by email outside of normal business hours on Saturday to the Democratic National Committee (DNC) for comment.Why It MattersThe Democrats have offered competing visions for the future of the party after then-Vice President Kamala Harris lost to President Donald Trump in the 2024 presidential election, in which the Republicans retained control of the House of Representatives and took control of the Senate, both of which they hold by slim margins.Leadership, such as House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer, both of New York, have urged patience as the Republicans roll out their agenda, which Jeffries and Schumer believe will prove unpopular with the public and damage Trump and the GOP going into the 2026 midterm elections.However, some Democrats, such as Representative Alexandria Ocasio-Cortez of New York and Senator Bernie Sanders of Vermont, an independent who twice ran to be the Democratic nominee for president, have urged more action from their party and colleagues.What To KnowWalz, who was Harris' vice presidential running mate and a former public school teacher, spoke at Representative Jim Clyburn of South Carolina's Friday night fish fry and delivered a serious message to those in attendance, including many of his Democratic colleagues.Walz spoke of \"wannabe dictators and despots\" and slammed Trump for \"corruption\" and \"cruelty\" in his second administration. He told those gathered that the Democratic Party needs to \"change the attitude, compete in every district, compete for every school board seat.\"On Saturday, Walz spoke at the state's Democratic Party convention where he gave a keynote speech, calling on his party to change its thinking.\"Maybe it's time for us to be a little meaner, maybe it's time for us to be a little more fierce because we have to ferociously push back on this,\" he said, to applause from the crowd.\"And again, I'll speak to my teacher colleagues in here. The thing that bothers a teacher more than anything is to watch a bully...and when it's a child you talk to him and you tell him why bullying's wrong, but when it's an adult like Donald Trump you bully the s*** out of him back,\" Walz said. \"You push back, you make sure they know it's not there, because at heart—at heart, this is a weak, cruel man that takes it out and punches down on people.\"The governor added: \"What they don't want to do is stand toe-to-toe and punch back with someone who's calling him out for what they do who's being there.\"Walz also called Trump \"the existential threat that we knew was coming,\" adding that Trump is a \"cruel man\" and warning that the remainder of his second term will \"be a challenging few years.\"\"Damnit, we should be able to have some fun and be joyful,\" Walz said. \"We've got the guts, and we need to have it to push back on the bullies and the greed.\"Walz has not indicated if he intends to head up his own bid for president in 2028, in which he may run against Harris, former Transportation Secretary Pete Buttigieg, California Governor Gavin Newsom, and a host of other Democrats as the party remains largely rudderless seven months after the loss to Trump.Walz, while lacking the same national exposure that some of his potential rivals have commanded this year, remains actively engaged across the country.He has headlined a DNC series called \"the People's Town Halls\" around the country, speaking to crowds in Republican districts that had thin margins in the 2024 elections and have a potential to flip back to Democrats in 2026.\"For the past few weeks, I've been showing up where Republicans won't,\" Walz wrote in a recent message, a theme he echoed on Saturday in South Carolina. \"I've hosted town halls in Iowa, Nebraska, Wisconsin, Minnesota, and Texas to hear from people the GOP is neglecting.\"AtlasIntel, touted by some, such as veteran pollster Nate Silver, as the most accurate polling firm in the U.S., released data on Friday indicating that Buttigieg has a commanding lead as the likely candidate for Democrats in 2028 if voters picked today.In their polling, Walz did not feature at all, but the pollster may not have included him in their options, as the question was posed as \"provided these were the candidates.\"Newsweek reached out to AtlasIntel outside of normal business hours by email on Saturday for clarification and comment.What People Are SayingMinnesota Governor Tim Walz wrote on X, formerly Twitter, on January 1: \"Happy New Year, Minnesota! More grateful than ever to have the privilege of serving this great state. Looking forward to the work ahead in making Minnesota the best place to live, work, and raise a family.\"Representative Alexandria Ocasio-Cortez of New York at a Las Vegas rally in March: \"This isn't just about Republicans. We need a Democratic Party that fights harder for us, too. But what that means is that we as a community must choose and vote for Democrats and elected officials who know how to stand up for the working class.\"Mary Ann Bennett, who attended Ocasio-Cortez's Denver rally with Sanders, previously told Newsweek: \"The Democratic Party has not been taking strong actions for the working class. Bernie and AOC acknowledged this, which is step one, and then laid out their plans for action which were met with strong cheers from the 30,000 people who showed up. Those moments were when I felt the most empowered and ready to fight for my neighbors.\"Former Vice President Kamala Harris, speaking about her plans earlier this year while visiting sites impacted by the Los Angeles wildfires, said: \"My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them...I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground.\"What Happens Next?Candidates are likely to wait until after the 2026 midterm elections to declare their intention to run for president, but speculation about the field of candidates will remain—and most likely ramp up—in the months ahead.This article includes reporting by the Associated Press.","summary":"The Minnesota governor ran in 2024 as the Democrats' vice presidential candidate and has led a series of town halls in Republican districts this year.","url":"https://www.newsweek.com/tim-walz-democrats-bully-donald-trump-2079385","image":"https://d.newsweek.com/en/full/2654629/tim-walz-democrat-convention-trump.jpg","video":null,"publish_date":"2025-05-31 20:47:02","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.202},{"id":326853242,"title":"‘60 Minutes’ has history of cozy interviews and self-promotion","text":"Beware of those who publicly declare that their stuff doesn’t stink.\n\nRecently, CBS newsman and “60 Minutes” regular Scott Pelley made news and noise when he seized the close of the venerable program to deliver an appeal, threat or whatever, depending on how one heard it, to CBS News parent Paramount, as it was reportedly preparing to settle a lawsuit brought last year by President Trump over the show’s very cozy interview with VP Kamala Harris during last year’s presidential campaign.\n\nPelley cited the week’s resignation of “60 Minutes” executive producer, Bill Owens, adding, “Paramount began to supervise our content in new ways. None of our stories has been blocked, but Bill felt he lost the independence that honest journalism requires. … Bill made sure they were accurate and fair.\n\n“He was tough that way, but our parent company Paramount is trying to complete a merger. The Trump administration must approve it.”","summary":"Beware of those who publicly declare that their stuff doesn’t stink.","url":"https://nypost.com/2025/05/31/sports/60-minutes-has-history-of-cozy-interviews-and-self-promotion/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-3b2xuynyp-1748713476772.jpg?quality=75&strip=all&1748699158&w=1200","video":null,"publish_date":"2025-05-31 19:19:00","author":"Phil Mushnick","authors":["Phil Mushnick"],"language":"en","source_country":"us","sentiment":0.001},{"id":326872788,"title":"Trump throws a $20 billion tantrum, and meet more dodgy judicial nominees","text":"Injustice for All is a weekly series about how the Trump administration is trying to weaponize the justice system—and the people who are fighting back.\n\nTrump is a snowflake, and his sad feelings are worth $20 billion\n\nIn what is now apparently a trend, Paramount has offered Donald Trump millions of dollars to settle a lawsuit that has no merit. But Paramount’s proposed bribe of $15 million to a sitting president just wasn’t enough for Trump, who wants $25 million and an apology from CBS for the imagined slights he suffered\n\nHere’s the thing: At the very best, all Trump can point to is that “60 Minutes” may have engaged in some light editing of an interview with Kamala Harris, which, last time we looked, was neither a crime nor worth $25 million. But media companies have learned that they have to bribe Trump or they’ll face harassing investigations by the Federal Communications Commission or see their mergers blocked. And Paramount just happens to have a merger pending that requires approval. \n\nWhile Paramount is trying to come up with a number big enough to satisfy Trump, the lawsuit is proceeding. Part of Trump’s argument in opposition to Paramount’s motion to dismiss the lawsuit is that he suffered “mental anguish” and his role as a “content creator” was damaged. Oh, and that’s worth $20 billion. \n\nYes, the big tough president, king of the “Fuck your feelings” crowd, essentially brought a participation trophy lawsuit. He wants money from Paramount because CBS made him sad. It’s exactly the type of lawsuit conservatives pretend to abhor. But when it comes to Trump, no amount of tenderness—or cash—is enough. \n\nDOJ’s Civil Rights Division will make sure racist Christian nationalists can thrive\n\nWell, at least we know which civil rights the administration is interested in fighting for. \n\nAt the request of dedicated Christian nationalist Matt Meyer, the federal government has sued the city of Troy, Idaho, in order to force the city to let Meyer open a church in its downtown business district, even though Troy’s ordinance prohibits all churches in that district, not just Meyer’s Christ Church. Nonetheless, the administration’s lawsuit alleges Troy violated the Religious Land Use and Institutionalized Persons Act of 2000 by not waiving its zoning requirements for the church.\n\nRelated | Rubio tells his staff to snitch on ‘anti-Christian’ colleagues\n\nSo, what type of church is Christ Church? Regrettably, just the kind this administration would adore. It’s led by Doug Wilson, who loves Christian nationalism and has outright said that Moscow, Idaho, is a good place for a biblical takeover because “We should want America to be a Christian nation.” Wilson is pretty adamant he’s neither racist nor sexist, a claim that is undercut by his actions. He wrote a book defending slavery and he speaks at Confederate “heritage” conferences. He thinks women need to surrender to men and be “led with a firm hand.”\n\nDunno, buddy. That sounds a lot like racism and sexism. \n\nThe administration’s suit against Troy makes no mention of the church’s beliefs but does have a long section of quotes from random people who said mean things about the church. Totally normal filing, yesiree. \n\nGet to know a low-profile scumbag: Judd Stone\n\nWell, you actually probably do know who Judd Stone is now, though probably not for the reasons he wishes.\n\nNews broke earlier this week that in 2023, Stone had had resigned his gig as solicitor general of Texas after multiple sexual harassment complaints from colleagues because Stone would not stop talking about his fantasy of … an asteroid raping his colleague?\n\nWe learned about this only because one of the women he allegedly harassed filed a lawsuit with all the details you wish you never knew about Stone’s extremely odd and highly specific brand of sexual harassment. It also alleges that Texas Attorney General Ken Paxton let Stone resign after he learned of the misconduct allegations, as did Sen. Ted Cruz over similar allegations when Stone worked in Cruz’s office.\n\nStone’s name might not have rung a bell before this, but he was the Lone Star State’s top appellate lawyer. He’s argued before the Supreme Court eight times, including defending the state’s abortion ban that allows private citizens to sue over someone else’s abortion. Stone’s argument? That just being aware of someone else’s abortion could cause them “psychological harm” from their “extreme outrage” over abortion. \n\nYou know what actually causes psychological harm? Graphically describing your anal rape fantasies to your subordinates at work. \n\nStone has been in private practice now for a couple of years, where he has chosen to represent exactly the type of person you think he would: He’s the lawyer for X in Elon Musk’s vendetta against Media Matters.\n\nIn a normal world, the allegations against Stone would mean his high-flying legal career was over. In the Trump era, he’ll probably get a judgeship instead.\n\nSpeaking of judges\n\nTrump’s first slate of judicial nominees is out and, as per usual, he’s picked some real winners. \n\nWe already knew that Trump was nominating Emil Bove, his former criminal defense attorney and current high-level bully at the DOJ, for a seat on the Third Circuit Court of Appeals. But what about some of the lesser lights Trump wants to put on the bench? Here are a couple. \n\nYou might not have heard of Joshua Divine, the current solicitor general for Missouri, but given his views, you’re probably going to hear a lot from him if he gets a lifetime seat on the federal court in the Show Me State. In 2010, Divine wrote a college op-ed arguing that people should be required to pass literacy tests before they could vote. \n\nYou do not need to be a legal scholar or a Trump judicial nominee to see that this is straight-up racist Jim Crow stuff. It’s the reason we have a Voting Rights Act! \n\nOne of Divine’s colleagues, Maria Lanahan, has also been nominated for a seat on the Missouri federal bench. As the principal deputy solicitor general in the Missouri Attorney General’s Office, Lanahan co-authored Missouri’s unhinged complaint that is part of an overall conservative strategy to get the abortion pill, mifepristone, banned entirely. \n\nSome of Lanahan and Divine’s top-notch and totally true arguments? That the abortion pill “starves the baby in the womb” and that access to abortion creates “diminishment of political representation,” which can lead to “loss of federal funds.”\n\nIn case you don’t speak fluent anti-choice, here’s a translation: Their argument is that the state is harmed by not forcing more people to have children, because the state wants a higher population to increase its political might and federal funding. \n\nCan’t wait to see great arguments like this in judicial opinions. \n\nTrump’s Office of Special Counsel appointee has no idea what that office is, but will be terrible regardless\n\nThe Office of Special Counsel is one of those tiny federal agencies that is very important, but one you likely have never heard of unless you’re a federal employee or a whistleblower. However, we now live in a world where Trump and fellow megalomaniac Elon Musk let untamed children run amok through the federal government, so we’re all now deeply aware of these sorts of things. \n\nThe OSC protects federal employees from reprisal, particularly for whistleblowing, and serves as a secure channel for federal whistleblowers to report wrongdoing. Trump illegally pushed out the previous head, Hampton Dellinger, without cause, but the courts didn’t stop him, so here we are. \n\nLet’s take a quick detour here to talk about why Dellinger got that job. Before being appointed head of the OSC, Dellinger represented whistleblowers, served as deputy attorney general in North Carolina, and was chief legal counsel to the North Carolina governor, where he investigated Medicaid fraud and political corruption.\n\nNow, let’s talk about the credentials of Trump’s pick Paul Ingrassia, who seems to think his new job in the OSC is about “eliminating waste, fraud, and abuse in the federal workforce and revitalize the Rule of Law and Fairness in Hatch Act enforcement.”\n\nIt’s not surprising Ingrassia wouldn’t know anything about the job he’s getting, because his previous legal work includes representing notorious professional misogynist Andrew Tate, with kind of an oopsie where he said he was an attorney more than a year before he was admitted to the bar. This might tip you off that Ingrassia has not exactly had a long legal career, having graduated law school in 2022. \n\nIn his role as White House liaison official for the Department of Justice, he was instrumental in getting the travel ban against Tate and his brother, Tristan, lifted. He’s also a big fan of professional racist Nick Fuentes. \n\nIngrassia’s other work includes writing for the Gateway Pundit and hosting a far-right podcast, which are definitely things that qualify you to run a federal agency specializing in whistleblowing and the protection of federal employees. \n\nTrump described him as a “highly respected attorney, writer, and Constitutional Scholar,” but he is objectively none of those things. Even if you think Trump is great and Ingrassia is terrific, nothing about his meager experience adds up to “highly respected attorney” or “Constitutional Scholar.” But hey! At least the “writer” part is correct—if you count stanning for Trump on the worst blog imaginable.","summary":"Injustice for All is a weekly series about how the Trump administration is trying to weaponize the justice system—and the people who are fighting back.\n\n\n\n\nTrump is a snowflake, and his sad feelings are worth $20 billion\n\n\n\nIn what is now apparently a trend, Paramount has offered Donald Trump millions of dollars to settle a lawsuit that has no merit. But Paramount’s proposed bribe of $15 million to a sitting president just wasn’t enough for Trump, who wants $25 million and an apology from CBS for the imagined slights he suffered\n\n\n\nHere’s the thing: At the very best, all Trump can point to is that “60 Minutes” may have engaged in some light editing of an interview with Kamala Harris, which, last time we looked, was neither a crime nor worth $25 million. But media companies have learned that they have to bribe Trump or they’ll face harassing investigations by the Federal Communications Commission or see their mergers blocked. And Paramount just happens to have a merger pending that requires approval. \n\n\n\n\n\n\n\nW","url":"https://www.dailykos.com/story/2025/5/31/2325066/-Trump-throws-a-20-billion-tantrum-and-meet-more-dodgy-judicial-nominees?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1438430/story_image/Injustice_5.30.png?1748642816","video":null,"publish_date":"2025-05-31 19:00:05","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","category":"politics","source_country":"US","sentiment":0.034},{"id":326848936,"title":"Germany’s Merz secures long-awaited Trump meeting on June 5","text":"By Arne Delfs | Bloomberg News\n\nGerman Chancellor Friedrich Merz will travel to Washington for his inaugural meeting with U.S. President Donald Trump next week, almost a month after starting his term leading Europe’s largest economy.\n\nThe 69-year-old conservative, who became Germany’s chancellor on May 6, will meet the U.S. leader at the White House on June 5, government spokesman Stefan Kornelius said in an emailed statement on Saturday.\n\nThe topics will include Russia’s war in Ukraine, the situation in the Middle East and trade policy, Kornelius said.\n\nThe date and format of Merz’s visit are the result of weeks of negotiations between the White House and the chancellery. Merz will stay overnight in Blair House, the president’s guest house. On Thursday after a joint lunch, the two leaders plan to hold a press conference in the White House before Merz flies back to Berlin, according to a senior official.\n\nCrisscrossed\n\nSince taking charge of Germany’s government, Merz has crisscrossed Europe to meet with allies in France, Poland, the Nordics and Ukraine. But he hasn’t made it across the Atlantic, despite promising to improve ties with the Trump administration.\n\nRelations between Washington and Berlin are tense amid issues ranging from trade imbalances to support for Kyiv. European leaders fear that the U.S. president will abandon efforts to end Russia’s war in Ukraine and dial back military support for the region.\n\nDespite the delay in securing the meeting, Merz is getting his chance to make his case to Trump, unlike his predecessor Olaf Scholz. The Social Democrat never received an invitation to the White House after showing support for former U.S. President Joe Biden and Democratic candidate Kamala Harris.\n\nMerz’s meeting will come a week after Foreign Minister Johann Wadephul traveled to Washington for talks with U.S. counterpart Marco Rubio. During the 45-minute meeting, both sides stressed their common position on Ukraine and trade, Wadephul told reporters. Rubio didn’t participate in a press conference.\n\nAntagonized\n\nAfter Trump publicly antagonized Ukraine President Volodymyr Zelenskyy and South African President Cyril Ramaphosa during visits to the Oval Office, German officials are wary that similar treatment might be in store for Merz.\n\nIn addition to tensions over Germany’s trade surplus with the U.S., Trump allies have taken issue with the country’s treatment of the far-right Alternative for Germany. Rubio called a move to classify the second-largest party in the Bundestag as right-wing extremist as “tyranny in disguise.”\n\nMerz has sharply rejected these allegations and called on U.S. politicians to stay out of domestic German politics.\n\nThe chancellor has also suggested that the European Union could retaliate against U.S. technology companies if the trade conflict escalates. A junior member of Merz’s Cabinet proposed a 10% tax on U.S. tech companies, just as the White House pushes for powers to hit back against such levies.\n\nTo soften areas of contention, Merz has been eager to show he’s prepared to fulfill some of Trump’s demands. Most notably, he’s committed to putting Germany on a path to more than double defense-related spending to 5% of national output in the coming years.\n\nWith assistance from Kevin Whitelaw.\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.","summary":"The 69-year-old conservative, who became Germany’s chancellor on May 6, will meet the U.S. leader at the White House on June 5.","url":"https://www.mercurynews.com/2025/05/31/germanys-merz-secures-long-awaited-trump-meeting-on-june-5/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/Germany_New_Chancellor_72596.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-31 18:29:27","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","category":"politics","source_country":"us","sentiment":-0.086},{"id":326844234,"title":"Trump reignites feud with CBS over ‘deleted’ Colbert interview - years after his claim was debunked","text":"President Donald Trump posted a video claiming that CBS “deleted” his 2015 interview with Stephen Colbert, resurfacing a debunked claim against one of his favorite recent rivals.\n\nLate on Friday, the president reposted a Facebook video on his Truth Social account containing heavily edited clips of his September 2015 interview on The Late Show with Stephen Colbert. A message next to the video states: “You are not supposed to see this video. CBS DELETED this entire episode from their official website. You will not find these segments on YouTube either.”\n\nHowever, a quick search on YouTube showed otherwise. Clips from the Trump-Colbert interview are still available to be watched on the official Late Show account. One video has 17 million views. \n\nThe Independent has reached out to the White House and CBS for comment.\n\nBoth the YouTube video and Trump’s post include a portion of the interview in which Trump, then a candidate, touts his plans to build a wall, prompting the audience to cheer. “Oh, listen to this, even with your crowd –” Trump begins. Colbert interjects: “They love the wall. People love the wall.”\n\nStrangely, this isn’t the first time that Trump has made this claim.\n\nThe president appears to have reposted that same video in his first term in October 2018. Hours later, Colbert posted on X: “I don't know why the president would take time on a National Day of Mourning to retweet something weird like this, but the original clips have always been online. 16 million views.” The comedian attached two links to YouTube clips from the episode in question.\n\nA CBS spokesperson at the time told the Associated Press that full episodes of The Late Show are only available to stream online 30 days after the initial airing.\n\nTrump’s Friday Truth Social post marked the latest move in his feud with CBS. \n\nThe president has repeatedly expressed his ire at CBS’ 60 Minutes interview with Kamala Harris. He has sued the network for $20 million, claiming it used “deceitful editing” to advantage the then-vice president. \n\nCBS filed a motion to dismiss the case earlier this month, arguing: “This lawsuit is an affront to the First Amendment and is without basis in law or fact.”\n\nIn response, this week Trump’s lawyers claimed he suffered “mental anguish” as a result of the interview. His legal team also accused to the network of seeking “to wield the First Amendment as a sword, arguing that they cannot be held responsible for illegal conduct, intended to mislead the masses and undertaken in the pursuit of profit, because such conduct was the result of ‘editorial judgment.'”","summary":"Trump appears to have reposted the same clip in October 2018 — and the claims were swiftly debunked at the time","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-cbs-feud-colbert-interview-b2761320.html","image":"https://static.independent.co.uk/2024/10/30/19/Untitled-design.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/EAIBv0Ef-4VHSaSK0.mp4","publish_date":"2025-05-31 17:41:40","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.303},{"id":326857534,"title":"Marlow Reviews 'Original Sin,' Reveals Tapper's Agenda: No Major Revelations, Scapegoats Irrelevant Democrats for Biden Loss","text":"On Friday’s “Alex Marlow Show,” host and Breitbart Editor-in-Chief Alex Marlow discussed the book “Original Sin.”\n\nMarlow stated, “[T]hey have a[n] agenda, and that agenda is to point the blame and scapegoat what is known as the politburo, which is Joe Biden’s inner circle” and the Biden family itself, “none of which are relevant right now and many of which will never be relevant again. … And everyone else comes out looking good” including former Vice President Kamala Harris.\n\n“The Alex Marlow Show,” hosted by Breitbart Editor-in-Chief Alex Marlow, is a weekday podcast produced by Breitbart News and Salem Podcast Network. You can subscribe to the podcast on YouTube, Rumble, Apple Podcasts, and Spotify.\n\nFollow Breitbart.tv on Twitter @BreitbartVideo","summary":"On Friday&#8217;s &#8220;Alex Marlow Show,&#8221; host and Breitbart Editor-in-Chief Alex Marlow discussed the book &#8220;Original Sin.&#8221; Marlow stated, &#8220;[T]hey have a[n] agenda, and that agenda is to point the blame and scapegoat what is known as the politburo, which is\n\n\nThe post Marlow Reviews &#8216;Original Sin,&#8217; Reveals Tapper&#8217;s Agenda: No Major Revelations, Scapegoats Irrelevant Democrats for Biden Loss appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/05/31/marlow-reviews-original-sin-reveals-tappers-agenda-no-major-revelations-scapegoats-irrelevant-democrats-for-biden-loss/","image":"https://media.breitbart.com/media/2025/01/120-Thumbnail-2-640x335.jpg","video":null,"publish_date":"2025-05-31 17:26:57","author":"Breitbart Editor,Breitbart TV","authors":["Breitbart Editor","Breitbart TV"],"language":"en","category":"politics","source_country":"US","sentiment":0.263},{"id":326837926,"title":"Surprise 2028 pick? Democrats back unexpected candidate — and it’s not Kamala Harris","text":"A new poll came out on May 30 by Atlas Intel. The poll asked Democratic voters who they want to support in the 2028 presidential primary. Ex - Vice President and Democratic candidate in 2024 Kamala Harris wasn't the top pick. Pete Buttigieg was the most popular pick among Democrats, as per reports. He’s the former mayor of South Bend, Indiana and was also transportation secretary under Biden. 31.5% of Democrats in the poll said they would vote for him. Alexandria Ocasio-Cortez was the second choice. 19.4% of Democrats picked her, as per MassLive report. Kamala Harris came in third, with 16.6% support. This result is different from other polls done in May by Echelon Insights and McLaughlin & Associates, which had Harris in first place. That’s why the Atlas Intel poll stands out., as per reports. None of the top 3, Buttigieg, Ocasio-Cortez, or Harris, have officially said they are running for president yet. According to the CBS News report, Harris is thinking about running for California governor or trying again for president. Cory Booker, U.S. Senator from New Jersey, was fourth in the poll. He got 10.4% support. California Governor Gavin Newsom came next with 7.1%. Then came Pennsylvania Governor Josh Shapiro with 4.8%, as stated in the MassLive report. After that, Michigan Governor Gretchen Whitmer got 3.7%. 3.6% of Democrats said “none of the above.” 1.4% chose Senator Raphael Warnock from Georgia. The poll was done from May 21 to May 27, and it included 3,469 U.S. adults. The margin of error is plus minus 2.2%, as mentioned in the MassLive report. FAQsQ1. Who is leading in the 2028 Democratic poll?The go-to choice in the latest round of Atlas Intel poll seems to be Pete Buttigieg Q2. Is Kamala Harris in the run for being one of the presidential candidates in 2028?She could make a run for the white House or for a governor's office.","summary":"A new poll shows many Democrats prefer Pete Buttigieg over Kamala Harris for the 2028 race. AOC is second, while Harris is third. This poll is different from others where Harris led. None of them have confirmed running yet.","url":"https://economictimes.indiatimes.com/news/international/us/surprise-2028-pick-democrats-back-unexpected-candidate-and-its-not-kamala-harris/articleshow/121539007.cms","image":"https://img.etimg.com/thumb/msid-121539044,resizemode-4,width-1200,height-900,imgsize-82607,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-31 17:15:38","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":-0.106},{"id":326833414,"title":"Lester Holt gets emotional in final sign-off from “NBC Nightly News” after 10 years: 'It has been quite a ride'","text":"Lester Holt's time at NBC Nightly News has come to an end.\n\n Its lead anchor signed off for the last time on Friday with a thoughtful speech to commemorate his time on the show.\n\n \"After 10 years, this is my last Nightly News broadcast,\" Holt said. \"As anchor, it has been an honor to lead this program, and an honor to be welcomed into your homes. I'm so grateful for your trust. Around here, facts matter. Words matter. Journalism matters. And you matter.\"\n\n Holt went on to briefly recall some of the biggest stories from his tenure at Nightly News. \"Over the last decade, we have shared some dark and harrowing days and nights in our country: the pandemic, mass shootings, natural disasters,\" he said. \"Each testing our resilience and our compassion. It's why I often like to leave you with something to smile about, moments that reassure and connect us.\"\n\n The anchor emphasized his gratitude toward his staff, family, and viewers. \"I'll miss our evenings together, and I'll miss the team that puts it all together: my dear friends and my colleagues,\" he said. \"But for now, I just want to say thank you to my incredibly supportive and patient family and all of you.\"\n\n Holt also expressed support for his successor at Nightly News, Tom Llamas, who steps into the role on Monday. He ended his remarks with a modified version of his signature sign-off: \"Please continue to take care of yourself and each other, and I'll do the same.\"\n\n The show then cut to a montage of some of Holt's most memorable stories, including reporting from Puerto Rico, Iran, Ukraine, Israel, and France, as well as interviews with Donald Trump, Joe Biden, Barack Obama, and Kamala Harris.\n\n Holt slipped in a few more words after the montage. \"Oh my goodness,\" he said, getting emotional. \"It has been quite a ride. Thanks, everybody.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n The broadcaster began his career at CBS stations in New York, Chicago, and Los Angeles, reporting from 1981 until 2000. He moved to MSNBC in 2000 and became a substitute anchor for both NBC Nightly News and Today in 2003. Holt then anchored the weekend edition of Nightly News from 2007 to 2015, before replacing Brian Williams as the show's weekday host.\n\n Holt announced his departure from Nightly News in February amid internal shakeups at NBC. However, he will remain on the network following his exit, pivoting into a full-time role as the lead presenter of Dateline NBC. \n\n Watch Holt's final sign-off from Nightly News above.","summary":"\"Around here, facts matter,\" the show's lead anchor said in his farewell speech on Friday. \"Words matter. Journalism matters. And you matter.\"","url":"https://ew.com/lester-holt-gives-final-sign-off-nbc-nightly-news-11745968","image":"https://ew.com/thmb/oDcPh2LR4kf9xrnaW0SrOOjCgeM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Lester-Holt-signs-off-nightly-news-053125-0a9c79ebd07541a685727fd9ef9bbf8a.jpg","video":null,"publish_date":"2025-05-31 16:56:20","author":"Wesley Stenzel","authors":["Wesley Stenzel"],"language":"en","source_country":"US","sentiment":0.361},{"id":326809206,"title":"Spirit of Harriet Tubman coming to life on stage","text":"In January, Willie Phillips of the Laguna Woods African American Heritage Club bought 104 tickets to the play “The Spirit of Harriet Tubman” and chartered two buses to take residents to the one-night presentation in Cerritos.\n\nWritten by and starring Leslie McCurdy, “The Spirit of Harriet Tubman” is a one-woman play based on the life of the abolitionist and “conductor” of the Underground Railroad who freed hundreds of slaves in the 1800s.\n\nNow, thanks to a collaboration between the AAHC and the Community Bridge Builders, McCurdy will present her award-winning creation at the Performing Arts Center this Saturday, May 31, at 4 p.m.\n\n“Harriet Tubman was a genius; she was spiritual, she had visions. Yet genius gets lost,” McCurdy said. “Now we need to use our intellect to push our history forward again.”\n\nFrom 1850 to 1860, Tubman was estimated to have freed at least 70 slaves by taking them north to Maryland from the South via the Underground Railroad – not a literal railroad but a network of secret routes, hiding places and safe houses.\n\nWith the assistance of other abolitionists, she also helped fugitive slaves find routes to safety and freedom and, during the Civil War, led a raid that freed more than 700 slaves.\n\nTubman claimed no casualties for her group.\n\n“I never ran my train off the track, and I never lost a passenger,” she reportedly said of her mission.\n\nMcCurdy will embody Tubman as she has done for 20 years: on a bare stage with only a trunk filled with costumes to help her recreate the tumultuous stages of the activist’s life, starting as an abused young slave and ending as a 90-year-old legend and symbol of freedom.\n\nMcCurdy recently spoke by phone of her transition from aspiring dancer to actor to Tubman performer after fracturing a hip in a fall as she was on her way to join a dance company in New York.\n\n“I started writing after I tripped, and fell into acting when a friend took me to audition for a one-woman play,” she recalled.\n\nHaving made the cut, she started embodying Tubman from a script by Karen Meadow Jones in 1992 and 1993.\n\nWhen her run ended, McCurdy decided to tour the play on her own. But after she also edited the script into a version for school audiences at the producer’s behest, she received a cease-and-desist order from the playwright’s attorney.\n\n“I was not to utter another word about Harriet Tubman,” she recalled.\n\nTurning her initial “now what?” into inspiration, McCurdy wrote her own one-woman play in three weeks, memorized it in days and took the show on the road.\n\n“That play was coming right from the inside of me,” she recalled. “Now, when I perform, I channel Harriet by asking her spirit to help me use her words – note the title of the play.”\n\nMcCurdy first heard about Tubman when she was in the fifth grade in Ontario, Canada\n\n“I was a tomboy and liked to play a lot of boys’ games. To me, Harriet was a woman who did men’s things better than men,” she said.\n\nIn Canada, she said, “there was not a lot of talk of Black people, and some still believed that slaves were heathens who had needed to be civilized.”\n\nMcCurdy also wrote “Harriet is My Hero” as an accompaniment to be performed for K-2 students.\n\n“That play shows kids the characteristics that made Harriet a good hero and which they might want to emulate if they want to be heroes as well,” she said. “Ragdolls and marionettes help tell the story and illustrate the skills that Harriet had to learn from childhood into old age.”\n\nAmong her female heroes, McCurdy cites her mother and her aunt, former Vice President Kamala Harris, Los Angeles Mayor Karen Black, and Netumbo Nandi-Ndaitwah, the newly elected president of Namibia.\n\n“Black women will save the world,” McCurdy said. “As an energy force, they are an impetus for a new age.”\n\nShe plans to perform “The Spirit of Harriet Tubman” until 2027 and then perhaps substitute another actor into her role.\n\n“The thought of not doing the show breaks my heart, so it’s still perhaps a no,” she said.\n\nMeanwhile, McCurdy has portrayed Billie Holiday in “Lady Ain’t Singing No Blues,” a play that gives insight into the singer’s turbulent life. She pays tribute to African American women whose visions bring change in “Things My Foresisters Saw,” and she produced “The Darktown Strutters Ball,” a documentary focused on the contributions of Black performers throughout history.\n\nPhillips, the vice president of the African American Heritage Club, hopes for more culture- and history-infused productions at the PAC like “The Spirit of Harriet Tubman.”\n\n“There’s nothing wrong with music, concerts, bands, comics and parties,” he said. “However, we would like to see other types of entertainment – plays, ballets, documentaries. History in motion, if you will, real shows about the lives and contributions of real people that have been and are making real positive contributions to our society at large.”\n\n“The Spirit of Harriet Tubman” will be staged at the Performing Arts Center on Saturday, May 31, at 4 p.m. Tickets are $20, $30 and $40, available at the box office or online at tickets.lagunawoodsvillage.com. For more information, email Community Bridge Builders at lwcommunitybrigebuilders@gmail.com.","summary":"One-woman show about Underground Railroad 'conductor' to be staged in Laguna Woods","url":"https://www.ocregister.com/2025/05/31/spirit-of-harriet-tubman-coming-to-life-on-stage/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/LWG-L-TUBMAN-0529-02-1.jpg?w=1024&h=717","video":null,"publish_date":"2025-05-31 14:56:58","author":"Daniella Walsh","authors":["Daniella Walsh"],"language":"en","source_country":"US","sentiment":0.193},{"id":326799270,"title":"Video of People 'Leaving Early' From Trump Rally Questioned","text":"A viral video claiming to show attendees leaving early at a President Donald Trump rally in Pennsylvania on Friday has sparked debate online.Why It MattersOn multiple occasions in the past, people have posted videos to X, formerly Twitter, claiming to show people leaving Trump rallies early. But the latest video has come under scrutiny, even from the president's critics.Trump has long been known for his tendency to exaggerate crowd sizes at his rallies and public events, a pattern that dates back to his very first days in office.What To KnowThe video, shared by the left-leaning account Patriot Takes, shows a group of four people appearing to exit Trump's rally in Pennsylvania on Friday before it had concluded.However, viewers and commenters on social media quickly pointed out that the footage captures only a tiny fraction of the audience.\"I can't stand him, but come on, it was like four people,\" X user Rick Dorris wrote.Several other observers suggested that the individuals might simply be stepping out for a restroom break or refreshments rather than leaving altogether.Other images and videos from the same rally depict large crowds, reinforcing the notion that the majority of attendees stayed throughout the event.There have, however, been instances of larger numbers of people leaving early from Trump rallies in the past. Last year, there were multiple reports and videos of noticeable early exits at various Trump events.In one instance, a video posted to X appeared to show a small group of people leaving a Trump rally in November 2024.Washington Examiner reporter Samantha-Jo Roth, who posted the video, wrote, \"In case anyone is wondering, there are in fact people leaving Trump's rally early. To be fair, many of them have been here since the AM.\" The post accumulated over 22,000 views.The host of ABC News' If You're Listening show Matt Bevan also shared videos from a Trump rally in Detroit, which he posted on November 1.He wrote, \"Went to a little event in Detroit. Despite Trump's claim that nobody leaves early, many people left early. From about 25 minutes into his speech, there was a steady stream.\"In the comments, he added, \"I should note, everyone in the room had been there for two hours before he came on.\"He also wrote that Trump was scheduled to come on at 4:30 and came on at around 4:45, and \"people started leaving about 5:10-5:15.\"Meanwhile, in October 2024, former Vice President Kamala Harris' campaign shared a video on Truth Social of a Trump rally in Michigan, showing one crowded section and a larger empty area, mocking him over crowd size.\"Trump: No one else can fill this place up (The room is mostly empty),\" the Harris campaign wrote.Throughout the 2024 presidential campaign, rally crowd sizes and attendance were a point of contention between Trump and Harris, with the Republican frequently boasting about his turnout and jabbing Harris' while the then vice president countered by highlighting people leaving his rallies or empty sections. In September, The New York Times analyzed six rallies in August, finding that both candidates drew similar audience sizes.The Times analysis also found that of those six rallies, Trump spoke four times as long as Harris, writing that the longer duration of his rallies could contribute to the higher number of people leaving early, as based on photographs.The former president previously addressed the comments that supporters were appearing to leave his rallies early.At an event with broadcaster Tucker Carlson in Glendale, Arizona, in October, Trump said, \"They don't leave and they're really well-attended, we can't get places big enough.\"In September, Trump also said to a rally crowd in Walker, Michigan, \"The people that you see leaving—because nobody ever leaves, and when they do, I finish up quick, believe me.\"What People Are SayingOne X user commented: \"Even as a Trump hater, I think these kinds of posts are useless, as evidenced in Nov. 24. You couldn't find him filling any arena, yet he won. Focus on the issues themselves and don't let the chuds pretend they care about working class.\"What Happens NextThe White House has not yet commented on the video.","summary":"On multiple occasions in the past, people have posted videos on social media claiming to show people leaving Trump rallies early.","url":"https://www.newsweek.com/donald-trump-rally-pennsylvania-crowd-sizes-2079310","image":"https://d.newsweek.com/en/full/2654549/trump.jpg","video":null,"publish_date":"2025-05-31 14:46:21","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","source_country":"us","sentiment":-0.357},{"id":326798830,"title":"Why American celebrities ‘escaping’ Trump by fleeting to Britain may be in for a big surprise","text":"Since Trump began his second term, Britain has become a political escape hatch for American celebrities and wealthy Democrats. \n\nIt’s so popular that last week, the British Home Office released data showing that in the 12 months leading up to March, almost 7,000 US citizens applied to become British subjects or live here indefinitely — the highest number since such records began in 2004. \n\nA third of those applications have been received since Trump took office at the start of 2025.\n\nThere are the famous emigres. Kamala Harris supporters Ellen DeGeneres and wife Portia de Rossi have taken up residence in the bucolic Cotswolds, selling their Montecito homes after becoming “very disillusioned” when Trump won, according to TMZ. “English country life” runs the caption on Ellen’s latest Instagram reel showing her luxurious home and grounds, complete with chicken and gambolling rabbit.\n\nFellow comedian Rosie O’Donnell has moved to UK-adjacent Ireland and will only “consider coming back” when it is “safe for all citizens to have equal rights there in America,” as she said on a Tik Tok video in March. \n\nBrit Minnie Driver left LA to return to the motherland prompted by Trump’s win. Others considering a move to the UK include Barbra Streisand, who has said she “can’t live in this country if [Trump] becomes president,” as well as Cher and America Ferrera. \n\n“Girls” creator Lena Dunham — along with Ryan Gosling and Eva Mendes — traded the US for London before Trump’s inauguration. \n\nBut the glitzy progressives falling for Britain may find they are in for a shock: This is not the liberal paradise they imagined, despite our Labour prime minister. In fact, Britain’s next leader could be a lot like Donald Trump. \n\nThe populist Reform party is surging in the polls, threatening to explode Britain’s political landscape. It is built around Brexit architect Nigel Farage, an anti-immigration figure with similar cult-like status to Trump and the president’s erstwhile close friend. \n\nReform is no fringe party: 40% of Brits think Farage will be the next Prime Minister.\n\nTrump’s followers remain steadfast despite all; as the president himself noted, he could shoot someone in Times Square and “not lose any voters.” Farage, our possible future prime minister, confers a similar blind devotion on his own party supporters. When a Reform candidate from Yorkshire, selected to run for a seat in Parliament, was revealed to have said, “Black people should get off their lazy arses and stop acting like savages,” voters didn’t care; he still came second.\n\nLast week, a frenzy erupted over a “racist” advert for Reform which bashed the Scottish Labour leader Anas Sarwar by saying he will “prioritize the Pakistani community.” Not a peep of contrition. \n\nDo those trading Trump’s America for Britain fully understand what has been going on in our less glamorous areas? \n\nThis week saw a car-ramming in Liverpool, injuring scores who were out celebrating a soccer triumph.\n\nDo they know what happened last summer, following the massacre by Axel Rudakubana, the son of Sudanese immigrants, of three little girls at a Taylor Swift dance class in the peaceful northern town Southport? \n\nThere were mass riots as thugs stormed mosques and lit them on fire — plus a groundswell of rage at how the Islamist ambitions and sympathies of Britain’s unassimilated immigrants and asylum-seekers are covered up. \n\nFrom the British perspective, of course, the arrival of wealthy and famous American Dems-in-exile has shone an interesting light on our own debates about immigration. Though few admit it, least of all those in power, there are Good Migrants and there are Bad Migrants. \n\nIt is generally agreed now by all the parties that Something Must Be Done about the Bad Ones. In 2024, 694 boats carrying 53 illegal immigrants apiece seeking asylum arrived on British shores, costing taxpayers £6 million a day on hotel bills alone. But the good ones like Ellen with her $18 million farmhouse? We can’t get enough.\n\nIronically echoing Trump’s idea of a “gold card” for desirable immigrants, the UK’s home secretary said earlier this month that Britain would be introducing “provisions to qualify more swiftly that take account of the contribution people have made.” This should ease the way for more Ellens, Evas and Lenas.\n\nOf course, it’s hardly a surprise that most people will take an American celebrity over a trafficked Syrian any day, and their arrival is certainly a bonus for us. But when they discover how far short of a liberal paradise Britain is becoming, their stays on this sceptred isle might be shorter than anticipated.","summary":"The glitzy progressives falling for Britain may find they are in for a shock: This is not the liberal paradise they imagined. ","url":"https://nypost.com/2025/05/31/opinion/american-celebs-escaping-trump-by-feeling-to-britain-may-be-surprised/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-bb5fgi9x4-1748697686808.jpg?quality=75&strip=all&1748684456&w=1200","video":"https://cdn.jwplayer.com/videos/1Wn1TvwB-RyIcpnTz.mp4","publish_date":"2025-05-31 14:30:00","author":"Zoe Strimpel","authors":["Zoe Strimpel"],"language":"en","source_country":"us","sentiment":0.055},{"id":326792484,"title":"Bono Sparks MAGA Backlash After Joe Rogan Appearance","text":"Irish rock star Bono has come under fire from supporters of President Donald Trump's Make America Great Again (MAGA) movement after citing an academic who said the administration's cuts to the U.S. Agency for International Development (USAID) may have been a factor in 300,000 deaths.Bono made the claim during an appearance on Joe Rogan's popular podcast which was released on Friday, after which he was branded \"a liar/idiot\" by former Department of Government Efficiency (DOGE) chief Elon Musk.Newsweek contacted USAID for comment on Saturday via email outside of regular office hours.Why It MattersAfter coming to power in January the second Trump administration ordered a halt to most foreign aid funding and attempted to shut down USAID, though this was blocked in court.Supporters argued cuts saved American taxpayers money that was being used ineffectively, while critics said it would hit some of the most vulnerable around the world.What To KnowDuring his appearance on the Joe Rogan Experience Bono, a founding member of U2, said: \"Just recent report, it's not proven, but there's surveillance enough [to] suggest 300,000 people have already died from just this cut off, this hard cut, of USAID so there's food rotting in boats, in warehouses, this will f*** you off.\"Bono appeared to be referencing research conducted by Boston University infectious disease mathematical modeler Brooke Nichols who concluded USAID cuts could have resulted in 300,000 otherwise preventable deaths, including 200,000 children.Bono's claim sparked a furious response from Trump supporters on social media including Elon Musk, who on Friday was given a large key by the president as thanks after stepping down from the day-to-day management of the Department of Government Efficiency (DOGE).In a post on his X, formerly Twitter, website, referring to Bono, Musk said: \"He's such a liar/idiot. Zero people have died!\"The tech billionaire was responding to Mike Benz, executive director of the Foundation For Freedom Online campaign group, who shared a clip of Bono's remarks adding: \"These USAID numbers are f***** faker than their COVID numbers.\"Popular conservative X commentator Catturd added: \"Elon Musk calls out low IQ moron Bono for being an idiot and a liar.\"However, Bono's comment was welcomed by the Protect Kamala Harris X account, which has over 90,000 followers and posts in support of the former presidential hopeful.The account shared a photograph on Bono, captioned: \"RETWEET if you stand with Bono against Donald Trump!\"What People Are SayingDuring his podcast appearance Bono said: \"There is 50,000 tons of food that are stored in Djibouti, South Africa, Dubai, and wait for it Houston, Texas, that is rotting rather than going to Gaza, rather than going to Sudan, because the people who know the codes for the warehouse are fired, they're done.\"In response, Joe Rogan said: \"They're throwing the baby out with the bathwater, this is the problem, the problem is for sure there have been a lot of organizations that do tremendous good all throughout the world. Also, for sure it was a money-laundering operation, for sure there was no oversight, for sure billions of dollars are missing, in fact trillions, that are unaccounted for.\"What Happens NextIt remains to be seen whether the Trump administration will succeed in its bid to close down USAID entirely or whether this will continue to be blocked in the courts.","summary":"Bono repeated a claim that President Donald Trump's USAID cuts may have been a factor in 300,000 deaths.","url":"https://www.newsweek.com/bono-sparks-maga-backlash-during-joe-rogan-appearance-2079295","image":"https://d.newsweek.com/en/full/2654544/bono-usaid-maga.jpg","video":null,"publish_date":"2025-05-31 13:42:26","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.437},{"id":326790510,"title":"In key 2028 state, Tim Walz says Democrats need to ‘beat the hell out of these dictators’","text":"Minnesota Gov. Tim Walz, wearing a blue suit, calmly explained his vision of a more united country to a roomful of South Carolina Democrats on Friday night, only mildly barbing Republicans in a nine-minute speech.\n\nThen, an hour or two later, the suit was gone and a more fiery, populist and T-shirt-clad Walz took the stage. The venue was a fish fry thrown by longtime Rep. Jim Clyburn, a powerful Congressional Democrat.\n\nWalz called tech billionaire Elon Musk a “dipshit” again. He spoke of rigged systems, “wannabe dictators and despots,” and slammed the “corruption and the cruelty that’s happening under Donald Trump’s watch.” \n\n“But do you know what terrifies them? What terrifies them is about a thousand people in South Carolina coming out on a Friday night and saying ‘enough,’ ” Walz said.\n\nThe underlying message of the two speeches, despite their diverging styles, was the same. Democrats in 2024 focused too closely on seven swing states, Walz said in both speeches, and ignored conservative strongholds like South Carolina, Texas and Florida. Republican rule has hurt people in those states and Democrats need to take their message — and their policies — to them, he argued.\n\n“We need to change the attitude, compete in every district, compete for every school board seat,” he said. “And come out to this damn fish fry with the attitude that we’re going to fill up on some fish and then we’re going to go beat the hell out of these dictators.”\n\nWalz’s Friday night fastball was just a warmup; he will also deliver the keynote address for the South Carolina Democratic Party’s “Dem Weekend 2025” convention on Saturday and will speak at the California Democratic Party’s annual state convention in Anaheim later that day.\n\nThe governor’s brief adventure outside of the North Star State will help him keep his national profile up after his unsuccessful White House bid last year with then-Vice President Kamala Harris. He’s expected to seek a third term for governor and has said that he would “certainly consider” a run for president.","summary":"The Minnnesota governor, who says he’s open to a presidential run, also slammed the “corruption and the cruelty that’s happening under Donald Trump’s watch.”","url":"https://www.startribune.com/in-key-2028-state-tim-walz-says-democrats-need-to-beat-the-hell-out-of-these-dictators/601364648","image":"https://arc.stimg.co/startribunemedia/NEQGYERDAVFGJAAI6YUQZEFW6M.JPG?&w=1200&ar=1.91:1&fit=crop","video":null,"publish_date":"2025-05-31 13:34:23","author":"Nathaniel Minor","authors":["Nathaniel Minor"],"language":"en","source_country":"US","sentiment":-0.355},{"id":326792118,"title":"The most glaring examples of Joe Biden's decline, even as the White House covered it up","text":"The truth about President Joe Biden's physical and mental decline is getting more coverage thanks to Democrats finally conceding it was a mistake for him to run again in 2024. \n\nMost of them blame Biden's family and closest aides for hiding the truth about the president's condition despite obvious signs that he was suffering the effects of old age.\n\nHowever, in truth, concerns about Biden's age and glaring examples of its effects were apparent as early as his 2020 campaign at the age of 77.\n\nAt the time, the most favorable interpretation was that it was just 'Biden being Biden' - he was the affable gaffe-ridden politician who struggled from early youth with a stutter.\n\nBiden won the presidency in 2020, but he was protected in a closely watched cocoon of staff as the coronavirus pandemic raged and his public and media appearances were limited and carefully scripted.\n\nHis isolation only added to his disoriented demeanor when he forgot to wear his coronavirus mask at times, leaving it behind or fumbling for the right words during a press conference.\n\nHere are some of the biggest moments that show the former president's decline had been apparent for some time:\n\nMarch 18, 2021: Biden falls on the stairs of Air Force One\n\nThe president fell repeatedly on the stairs while boarding Air Force One, on a trip to Atlanta, Georgia, despite trying and failing to stand up and regain his balance.\n\nWhite House deputy press secretary Karine Jean-Pierre insisted the president was doing '100 percent fine' and blamed the wind for his stumbles.\n\nAugust 19, 2021: Biden makes multiple errors in interview about Afghanistan\n\nDuring the botched exit from Afghanistan, President Biden continued keeping his remarks closely scripted for days, refusing to respond to shouted questions from reporters and staying on script with his talking points.\n\nThe country was not satisfied with his responses, prompting staff to schedule an interview with ABC's George Stephanopoulos to allow the president to defend his decision to pull U.S. troops from Afghanistan\n\nBiden made multiple errors and gaffes throughout the interview that aired on August 19, 2021 and they had to be clarified and corrected by the White House.\n\nThe terrorist suicide bombing that killed 13 American warfighters and more than 170 Afghan civilians shook Biden as he struggled to defend the botched exit from the country.\n\nAugust 26, 2021: Joe Biden's botched press conference\n\nWhen he finally took questions from the press at a news conference on Afghanistan, Biden found himself frustrated, struggling to finish sentences and recall basic facts and talking points.\n\nAt one moment he bowed his head with frustration and anger, clenching his briefing book of talking points as Fox News reporter Peter Doocy asked him a question.\n\nEven many who voted for Biden questioned the president's ability to handle the chaotic events, and the decisions he made about the way to withdraw forces from Afghanistan.\n\nJanuary 2022: White House clarifies Biden's remarks on Russia\n\nBiden held an extended press conference after a long drought in communications with the White House press but staff rushed to clarify his remarks about Russia making a 'minor incursion' into Ukraine that might not trigger a response from the United States and NATO allies.\n\nA National Security Council spokeswoman immediately said that Biden was only speaking about possible non-military, paramilitary, or cyber attacks.\n\nThe president had not even finished speaking when the clarifications began.\n\nMarch 2022: White House rushes to correct Biden's comment about Putin\n\nWhite House staff scrambled to correct Biden after he delivered a speech in Poland to confront Russian President Vladimir Putin's aggression in Ukraine.\n\n'For God's sake, this man cannot remain in power,' Biden declared forcefully, suggesting he was supportive of regime change in Russia.\n\nThe White House immediately said that Biden's comments were not about regime change and that it was not in his prepared remarks.\n\nBiden himself was frustrated by his staff's corrections, wondering if they would have done the same for former presidents who routinely went off script like Ronald Reagan.\n\nJune 2022: Biden tips over on his bike\n\nWhile riding his bicycle on his beach vacation, Biden stopped to talk to a group of people and tripped over when he came to a stop.\n\nHe later explained his spill was the result of his feet getting clipped into the pedals. \n\nThat summer, Biden's coughing was no longer smothered by the occasional cough drop, his voice grew thinner and weaker, and his gait grew more stiff, prompting additional questions about his abilities.\n\nWhite House press secretary Karine Jean-Pierre repeatedly defended Biden's acuity.\n\n'Oh, my gosh, he's the President of the United States, you know, he – I can't even keep up with him,' she told CNN's Don Lemon in an interview, urging skeptics to look at the work he was achieving.\n\nAugust 2022: Joe Biden struggles with his jacket\n\nPresident Biden traveled for a visit in Kentucky but found himself lost on the tarmac as he struggled to put on his suit jacket for about 15 agonizing seconds.\n\nFirst Lady Jill Biden ultimately assisted him and started walking off but the president's sunglasses then fell off his face, prompting him to stop down and pick them back up.\n\nSeptember 2022: Where's Jackie?\n\nPresident Biden sparked more concern after he arrived at an event with members of Congress and called out to Rep. Jackie Walorski, who had passed away more than a month earlier in a car crash.\n\n'Jackie are you here? Where's Jackie?' Biden said, appearing unaware of her passing.\n\nThe White House defended Biden's question and would only say that the deceased congresswoman was 'top of mind,' during his remarks.\n\nJune 2023: Joe Biden trips on stage\n\nPresident Biden tripped over a sandbag and fell sprawling on stage at the Air Force Academy’s commencement ceremony. White House aides responded that the president was 'fine' after the undignified incident.\n\n'Calm down you nervous nellies,' wrote Biden's former chief of staff Ron Klain on social media, scolding Democrats for questioning the president's health.\n\nOctober 2023: Special Counsel Robert Hurr sounds a warning\n\nPresident Biden struggled during his interview with Special counsel Robert Hur about classified documents found in his possession.\n\nHur's report revealed his honest assessment that Biden was a 'sympathetic, well-meaning elderly man with a poor memory.'\n\nBiden struggled to remember key details about his life after his vice presidency. Hur wrote that he couldn’t recall the date when his son Beau died. \n\nWhen the details were released in early January, Biden was furious about the accusation.\n\nHe was running for reelection and already fighting off suggestions that he was too old to be seeking a second term.\n\nBiden held a press conference defending his abilities, but after insisting 'my memory is fine,' he mistakenly referred to the president of Egypt, Abdel Fattah El-Sisi, as 'the president of Mexico' without correcting himself.\n\nApril, 2024: Joe Biden reads the word 'pause' off of the teleprompter\n\nPresident Biden visited union members in Washington, DC where he appeared to read the world 'pause' off of his teleprompter instructions.\n\n'Four more years. Pause,' he said, as members of the Members of North America’s Building Trades Unions ultimately chanted 'Four more years!' after the president's mistake.\n\nJune 11, 2024: Joe Biden freezes at White House concert\n\nPresident Biden attended a White House concert to celebrate the Juneteenth holiday, but observers expressed alarm as the president froze for a solid minute as people around him danced and sang.\n\nAt one point, he appeared to forget where he was, looking around confused prompting others around him to reach out and engage with him.\n\nJune 14, 2024: Joe Biden wanders off at the G7 summit \n\nAfter President Joe Biden and other world leaders watched a parachute jump, the president slowly stated walking away. \n\nItalian Prime Minister Giorgia Meloni walked over to guide him back to the group for a photo opportunity with the other world leaders. \n\nThe embarrassing video went viral but the White House repeatedly dismissed it as a 'cheap-fake,' asserting that the video failed to show the paratrooper that Biden was trying to walk over and talk to. \n\nJune 16, 2024: Barack Obama guides Biden off stage\n\nThroughout the 2024 campaign, Biden's staff repeatedly defended the president's mental and physical abilities.\n\nBut behind the scenes donors attending fundraising events were incredibly alarmed as he often trailed off during speeches and struggled to remember who he was talking to.\n\nAfter a fundraiser with President Obama, George Clooney, Julia Roberts, and Jimmy Kimmel, Biden paused and gazed out at the crowd appearing confused when he was supposed to be exiting the stage.\n\nFormer President Barack Obama paused and reached back to help guide Biden off of the stage.\n\nIt was not an isolated event. Biden appeared at times to be lost on stage, looking to staff to point him in the proper direction.\n\nBiden's public demeanor was so bad by the summer of 2024 that donors were openly questioning the president's decision to run for reelection.\n\nJune 27, 2024: President Joe Biden participates in the CNN Presidential Debate\n\nIn the presidential debate in June 2024, Biden struggled to finish his sentences and mixed up his prepared talking points as he tried to compete with Trump.\n\nBiden's frail, hoarse and raspy voice alarmed debate viewers as he claimed there were 'a thousand trillionaires' in the United States who needed to be taxed more.\n\nLater in the debate he declared that 'we finally beat Medicare' and struggled to deliver his prepared attacks on Trump.\n\n'I really don't know what he said at the end of that sentence. I don't think he knows what he said either,' Trump quipped.\n\nThe botched debate performance prompted a host of Democrats to publicly call for Biden to exit the race.\n\nBut Biden refused.\n\nPresident Biden visited union members in Washington, DC where he appeared to read the world 'pause' off of his teleprompter instructions.\n\n'Four more years. Pause,' he said, as members of the Members of North America’s Building Trades Unions ultimately chanted 'Four more years!' after the president's mistake.\n\nJuly 11, 2024: NATO Summit\n\nBiden introduced Ukrainian President Volodymyr Zelensky as 'President Putin' before correcting himself.\n\nThe president also referred to his vice president as 'Trump' instead of Kamala Harris during a press conference at the summit.\n\n'Look, I wouldn't have picked Vice President Trump to be vice president if I didn't think she was qualified to be president,' he said.\n\nBiden continued insisting he was 'fine' and fit for reelection.\n\n'If I slow down, I can't get the job done. That's a sign that I shouldn't be doing it. But there's no indication of that yet, none,' he said.\n\nJuly 21, 2024: Biden withdraws from the presidential election\n\nAmid intense pressure, Biden announced his decision to exit the race in a 1:46 pm post on X. \n\nHe later detailed his decision in an Oval Office address:\n\n'I believe my record as president, my leadership in the world, my vision for America's future all merited a second term, but nothing - nothing - can come in the way of saving our democracy. That includes personal ambition,' he said. 'So, I've decided the best way forward is to pass the torch to a new generation. That's the best way to unite our nation.","summary":"The truth about President Joe Biden's physical and mental decline is getting more coverage, thanks to Democrats finally conceding it was a mistake for him to run again.","url":"https://www.dailymail.co.uk/news/article-14766551/joe-biden-mental-decline-white-house-cover-up.html","image":"https://i.dailymail.co.uk/1s/2025/05/31/14/98921105-0-image-m-9_1748697536852.jpg","video":"https://videos.dailymail.co.uk/video/mol/2022/09/28/4740570231995416292/1024x576_MP4_4740570231995416292.mp4","publish_date":"2025-05-31 13:21:59","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.402},{"id":326792112,"title":"It's a property trick surrounded by stigma. But this expert reveals why it's the 'best way' for young Aussies to buy their first home","text":"EXCLUSIVEIt's a property trick surrounded by stigma. But this expert reveals why it's the 'best way' for young Aussies to buy their first home\n\nREAD MORE: Kamala Harris baffles audience at real estate conference\n\nBy CHARLOTTE MCINTYRE FOR DAILY MAIL AUSTRALIA\n\nPublished: 13:10 BST, 31 May 2025 | Updated: 13:10 BST, 31 May 2025\n\nA buyer's agent has revealed the clever way young Australians can get into the property market without having to save a cent for a deposit. \n\nMelbourne-based Ella Cas, 24, admitted her biggest mistake when buying her first home was not using a guarantor loan. \n\nA guarantor is someone, usually a close family member, who helps you secure a home loan by agreeing to use their property as security for your mortgage.\n\nMs Cas, who works for Mecca Property Group, used the entirety of her $80,000 savings as a deposit to purchase her first property, but now advises her clients to consider guarantor loans instead. \n\n'If I could do it again I would hold onto my cash,' she told Daily Mail Australia. \n\n'That was my life savings and instead I could have used my mum's house for the guarantor loan and held onto the money to invest in shares or buy a second property.'\n\nMs Cas said there was stigma around guarantor loans due to the risks involved.\n\n'With your parents as guarantor their house is the security for the loan so there is some stigma around it as people think it's slightly unsafe due to that risk,' she said. \n\nBuyers agent Ella Cas says her biggest mistake when buying her first home was not using a guarantor loan\n\n'However, in my opinion, it is simply the best way to get into the market as a young person and the best way to help your son or daughter to get into the market. \n\n'I have clients that are in their twenties, they've got a full-time job, they're earning $100,000 and they have a borrowing capacity of $500,000, which is a good borrowing power. \n\n'But, the majority of 25-year-olds, with the cost of living can't save a 20 per cent deposit. Who is saving that money these days? No one.'\n\nFor a $500,000 property, a buyer would need $100,000 for a 20 per cent deposit.\n\nMs Cas explained buyers who take out guarantor loans are able to refinance and release their parents as guarantors when the value of their property increases. \n\nShe said it's 'very important' to choose a location with a strong rental yield and a focus on capital growth for a first time investor. \n\nThe buyer's agent pointed out that although buyers don't need a deposit for a guarantor loan, they do need to be mindful of upfront costs such as stamp duty, and be sure they can service the loan.\n\nAlthough this is a popular option for younger buyers, Ms Cas said she has a client in his 50s who recently used his mum as a guarantor.\n\nMs Cas said it's 'very important' for first time investors to choose a location with a strong rental yield and a focus on capital growth\n\nWhy young Aussie broker, 28, with eight-property portfolio prefers to live in his dad's granny flat\n\nThe divorcee sold his properties and wanted to get back into the market while still holding onto his cash. \n\n'If you do it right it's the best way to do it,' she said. \n\nMortgage broker Bill Childs, 28, who now owns eight properties across two states, also wishes he had used a guarantor loan for his first property at the age of 21.\n\n'When I started buying properties myself I saved for deposits and used equity on my own properties to buy more,' he told Daily Mail Australia. \n\n'But, if I look back my dad had property with equity so I could have used him as a guarantor and I wish I had because it would have helped me. A lot of people are worried some will say you've had a handout if you do it this way but people say that anyway if you're successful.\n\n'Parents want to help their children into the property market and I do see parents give their children cash but that takes away from their retirement so this is a better option.'\n\nMr Childs said using a guarantor loan is a great way to start a property portfolio as you can save a potential deposit for your second investment property.\n\nMortgage broker Bill Childs (pictured with his girlfriend) also wished he had used a guarantor loan for his first property at the age of 21\n\nBe the first to commentBe one of the first to commentComments\n\nNow have YOUR say!\n\nShare your thoughts in the comments.\n\nComment now\n\n'If you've borrowed the maximum that you can, make sure you're not in a situation where you're stressed on repayments, which are going to be higher because your loan is higher,' he warned.\n\nHe also warned that buyers can get into 'trouble' if they buy in a 'risky market'.\n\n'If you buy somewhere risky like a mining town and your property goes down in value, you're stuck and that's where it can go wrong,' he said.\n\nShare or comment on this article:\nIt's a property trick surrounded by stigma. But this expert reveals why it's the 'best way' for young Aussies to buy their first home\n\nAdd comment","summary":"A buyer's agent has revealed how Aussies can become property investors without putting down a single dollar for a deposit.","url":"https://www.dailymail.co.uk/news/article-14755673/property-zero-deposit-guarantor-loan.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/05/98778277-0-image-m-6_1748578157335.jpg","video":null,"publish_date":"2025-05-31 12:10:09","author":"Charlotte McIntyre,Editor","authors":["Charlotte McIntyre","Editor"],"language":"en","source_country":"gb","sentiment":0.048},{"id":326789578,"title":"CBS Is Tortured by Trump, Puts Rage Into ‘60 Minutes’","text":"CBS News thinks the crown jewel of its news division is “60 Minutes,” the alleged gold standard of investigative journalism on television. But when it comes to politics, their coverage isn’t just slanted. It’s more like a wrecked bus laying on its side, wheels spinning in the air.\n\nTheir stilted editing of a Kamala Harris interview weeks before the election caused Donald Trump to sue last year over the potential harm to his candidacy. By that standard, Trump could sue lots of newscasters and documentarians who slice and dice presidential contenders to try and persuade voters.\n\nThe Wall Street Journal reported the owners of CBS at Paramount Global in recent days offered $15 million to settle the suit, but Team Trump wants more than $25 million and is also seeking an apology from CBS News.\n\nYou can laugh when the Journal added CBS has said the broadcast was “not doctored or deceitful.” When the full interview was released, you could see it was carefully cooked and sliced like lamb chops. Every segment “60 Minutes” has done on Joe Biden or Kamala Harris can be presumed to be doctored for maximum positive impact.\n\nPartisanship is the real sticking point in these lawsuits, and needling the partisans is clearly a Trump strategy. The die-hard Democrats at CBS don’t want to apologize to Trump because that looks like surrender in the 10-year war they have been waging on him.\n\nThe Left was furious at ABC News for settling with Trump for $15 million so the rest of us couldn’t read internal ABC emails. George Stephanopoulos was clearly wrong to assert Trump was “found liable for rape” in the E. Jean Carroll suit, but the truth is no priority when the objective is to Get Trump.\n\nIn the midst of this lawsuit, the partisans of “60 Minutes” have gone on an anti-conservative tear this year:\n\nOn Feb. 16, mere days after Vice President JD Vance went into the Munich Security Conference and denounced European censorship regimes, Sharyn Alfonsi produced a report bizarrely extolling the virtues of German censorship.\n\nOn the same show, Scott Pelley aired a self-righteous attack on Trump and Elon Musk upending the U.S. Agency for International Development. “It’s too soon to tell how serious President Trump is in defiance of the Constitution,” he lectured.\n\nOn Feb. 23, Bill Whitaker puffed up leftist comedian John Oliver, who raged that Supreme Court Justice Clarence Thomas is being bribed by his friends when they have taken him on vacations: “I can prove that to you by offering this guy a million dollars a year to get the (bleep) off the Supreme Court. That should be a crime.”\n\nOn April 27, Pelley closed the program with an impassioned editorial defending his boss Bill Evans, who resigned because according to Pelley, in the midst of the Trump lawsuit, “Bill felt he lost the independence that honest journalism requires.”\n\nOn May 4, Pelley played up the bravery of Marc Elias, the partisan Democrat lawyer who worked for Hillary Clinton’s campaign in 2016 and spread all the unsubstantiated conspiracy theories about Trump being in collusion with the Russian government to steal the election. Lawyers like Elias were being persecuted by a vengeful Trump, and you can’t paint Team Hillary as being vengeful with all their phony Russiagate attacks.\n\nAt “60 Minutes,” it never mattered how many perfumed valentines they offered to help Barack Obama. They consider themselves the embodiment of journalistic “independence.” They think “honest journalism” is defined by ferociously attacking Trump and other people who are impeding progress by preventing the Democrats from running everything.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"CBS News thinks the crown jewel of its news division is “60 Minutes,” the alleged gold standard of investigative journalism on television. But when it... Read More\n\n\nThe post CBS Is Tortured by Trump, Puts Rage Into ‘60 Minutes’ appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/31/cbs-is-tortured-by-trump-puts-rage-into-60-minutes/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/053025-Donald-Trump-Smiling.jpg","video":null,"publish_date":"2025-05-31 12:00:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"us","sentiment":-0.315},{"id":326769040,"title":"The Trajectory Of Unique Relationship Between Donald Trump And Elon Musk","text":"By T N Ashok\n\nNEW YORK: Elon Musk, the $250 million funder of Donald Trump’s election campaign in 2024 that brought the Republican maverick back into the White House for a 2nd non-consecutive term, bid adieu to the White House, leaving as a bruised administrator who could not achieve the “Mission Impossible” unlike Ethan Hunt , the protagonist of the film of the same name.\n\nHe stood next to Trump at the Oval office of the White House said he was leaving the White House having completed the task as the DOGE administrator that saw tens of thousands of government employees lose their jobs that the GOP led regime of Trump considered redundant and was a drain on the exchequer causing a deficit in the budget.\n\nMusk achieved what he wanted, sacked thousands of employees. Saved billions in government expenditure by eliminating jobs, but still nowhere near the $3 trillion target , and in tandem Trump did not achieve the revenues to be earned in the budget to capitalize or consolidate on the gains achieved by Musk.\n\nSteve Bannon, a close advisor of Trump, said thus “He came, He saw, and he folded up”. That’s an apt description of the abrupt departure of Musk, who wanted to decimate the bureaucracy in Washington DC.\n\nHe stood next to Trump at the Oval office. His son nose picking son was not there this time. Nor was his son seated on the top of Musk’s shoulders. Musk was alone and the physical proximity was also not the same but more distant. The body language said it all, Musk was leaving as a dissatisfied man.\n\nThe popular adage that even the best of friends has to part sometime or the other was very much in evidence. The time had come for Musk to part with Trump as his bromance or money-romance-honeymoon with the US President was over.\n\nSo, What is next: Musk said he will remain a “friend and adviser” to the president, whose campaign he supported with more than $250 million. It’s unclear whether Musk’s foray into politics will have staying power — but for now, he’s left a polarizing mark that has impacted his net worth by tens of billions and one that’s unlikely to fade quietly.\n\nMusk’s net worth soared to $400 billion from some $250 billion since his association with Trump began in 2024 when he emerged as the single largest donor to Trump, who was badly bruised by the litany of court cases against him which put a massive hole in his wallet as also the GOPs campaign funds. While Kamala Harris raised $950 million in campaign donations and yet lost the race to the white house, Trump with just $350 million won a 2nd term, thanks to Musk’s additions and a vigorous campaign.\n\nA bruised Elon Musk thus departed Washington. Musk left as a “special government employee” with his goals in flux and a more negative public image, as Trump bid farewell in an Oval Office event.\n\nElon Musk stood next to President Donald Trump in the Oval Office on Friday, but the physical proximity belied a growing philosophical divide between two of the world’s most powerful men, resulting in the tech mogul’s abrupt announcement that he is departing Washington — without having achieved his goal of decimating the federal government.\n\n“He came, he saw, he folded up,” Steve Bannon, a senior White House adviser during Trump’s first term who is influential with the working-class wing of Trump’s MAGA base, said in a text exchange with NBC News.\n\nMusk, who stood with his arms folded across his chest as he and Trump took questions, sported a bruise near his right eye — an unmistakable metaphor for his tumultuous government service — that he said he incurred while playing with his 5-year-old son, X.\n\nTrump took a more charitable view of Musk’s tenure during a sprawling news conference in which he also declined to rule out pardoning Sean “Diddy” Combs, who is on trial on charges of sex trafficking and other alleged crimes; Trump said he dislikes “the concept” of former first lady Jill Biden being forced to testify before Congress about her husband’s mental fitness; and predicted again that Iran is on the cusp of making a deal that would suspend its pursuit of nuclear weapons.\n\n“He had to go through the slings and the arrows, which is a shame because he’s an incredible patriot,” Trump said of Musk. Trump was recalling the Shakespearean quote from Hamlet: To be or not to be, whether it’s nobler in the mind to suffer the slings and arrows of misfortune or to take up arms against a sea of trouble.\n\nMusk literally took up a job where he had to swim against the tide of 100s of years of a tightly controlled bureaucracy in DC, whether Republican or Democrat, to singlehandedly try to unwind it, or decimate its influence. Trump had done it in part in appointing non bureaucrats in key government positions, most of them were from the communications field and others from the business world.\n\nIn a battle of plutocrats against populists, Bannon, a longtime advocate for reducing the size and scope of government, found Musk’s methods and policy preferences to be sharply at odds with those of the MAGA movement.\n\nSo, ultimately, did Musk, who broke with Trump repeatedly on agenda items as narrow as limiting visas for foreign workers and as broad as Trump’s signature “big beautiful” budget bill — which Musk belittled for threatening to add trillions of dollars to the national debt, succeed in his mission.\n\n“I was, like, disappointed to see the massive spending bill, frankly, which increases the budget deficit, not just decreases it, and undermines the work that the DOGE team is doing,” Musk said in an interview with CBS’ “Sunday Morning,” which will air this weekend.\n\nThe tech billionaire also disagreed with Trump’s imposition of sweeping tariffs on U.S. trading partners last month, pointing to the trade relationship with Europe as one where he would like to see a “zero-tariff situation.“ Musk has factories set up for TESLA outside the US and he was one of the victims of the Tariffs which made his cars costlier giving a competitive edge to others making EVs including China’s BYD that cost less, which ultimately saw his last quarter of earnings shrink by a whopping 71%.\n\nBut what Musk will most be remembered for in Washington is an approach to slashing the government that critics described as haphazard, inhumane and counterproductive. His Department of Government Efficiency, DOGE, a project conceived as he poured more than $250 million into electing Trump in 2024, shuttered government agencies, fired federal workers — some of whom had to be rehired — and cancelled federal contracts.\n\nAt the end of the day, despite all of the upheaval, Musk fell far short of his announced goal of saving $2 trillion. By his own agency’s account — which has been found to contain errors that inflate the numbers — the figure stood at $175 billion Friday. An analysis by the nonpartisan Partnership for Public Service, which has been a vocal critic of DOGE, said that its actions have cost taxpayers $135 billion.\n\nTrump and Musk both contended that DOGE would continue to wring savings by rooting out waste and fraud without the tech billionaire as its face.\n\n“This is not the end of DOGE, but really the beginning,” Musk said, vowing to reach the trillion-dollar mark in cuts by the middle of next year. At the same time, he spoke of cutting government spending, Musk lauded Trump’s remodelling of the Oval Office. I love the gold on the ceiling, Musk said\n\nMusk has argued that inertia throttled his efforts to reduce government spending — a conclusion that raises questions about whether he was naive about the challenge of the mission he undertook, US media critics observed.\n\n“The federal bureaucracy situation is much worse than I realized,” he told The Washington Post this week. “I thought there were problems, but it sure is an uphill battle trying to improve things in D.C., to say the least.”\n\nOn Friday, he drew an implicit parallel between American government and the Nazi regime that committed a genocide, invoking the “banality of evil” that Hannah Arendt used to describe the atrocities in Germany. It is the banal evil of bureaucracy, Musk said of profligate spending. The 130 day relationship ended for the time being but Musk is unpredictable and Trump finds in him a maverick like him, . So the relationship will continue and there is every possibility of Musk’s return to the Trump administration in another form in near future. (IPA Service)","summary":"By T N Ashok NEW YORK: Elon Musk, the $250 million funder of Donald Trump&#x2019;s election campaign in 2024 that brought the Republican maverick back into the White House for a 2nd non-consecutive term, bid adieu to the White House, leaving as a bruised administrator who could not achieve the &#x201C;Mission Impossible&#x201D; unlike Ethan Hunt [&#8230;]","url":"https://ipanewspack.com/the-trajectory-of-unique-relationship-between-donald-trump-and-elon-musk/","image":"https://ipanewspack.com/whoaftuf/2025/05/the-trajectory-of-unique-relationship-between-donald-trump-and-elon-musk.jpg","video":null,"publish_date":"2025-05-31 11:06:39","author":"IPA Staff","authors":["IPA Staff"],"language":"en","category":"politics","source_country":"in","sentiment":-0.101},{"id":326747704,"title":"175 wildfires rage in Canada, 21,000 evacuees, and things will get worse","text":"Ninety of the 175 massive fires that have erupted across Canada, forcing 21,000 evacuations and killing at least two people, have prompted Canadian Prime Minister Mark Carney to send in the military to help move residents and fight the blazes.\n\nThe fires are located in the Canadian provinces of Manitoba and Saskatchewan, which share a border with the United States. The enormity of the blazes has forced provincial authorities to declare a state of emergency, ordering tens of thousands of people ot flee their homes.\n\nSaskatchewan Premier Scott Moe on Thursday said the situation was unlikely to improve soon. Over 4,000 people have fled their homes across this province due to “the most severe conditions we have faced for quite some time, if not ever,” Moe said.\n\n‘Largest evacuation in living memory’\n\nIn Manitoba, Premier Wab Kinew said, “The evacuation of 17,000 residents is the largest evacuation the province will have seen in most people’s living memory.”\n\nCanadian news outlet CBC wrote, “As wildfires burn across northern Saskatchewan, the community of La Ronge is blanketed in smoke — and grappling with fear and uncertainty.”\n\nThe area has been under an air quality alert for several days, and while no evacuation orders have been issued, smoke and shifting winds have residents anxious and on alert.\n\n“There’s a lot of smoke,” said Tammy Cook-Searson, chief of the Lac La Ronge Indian Band. “It is starting to impact, especially children who are asthmatic, or anybody with any compromised health issues.”\n\nFires and evacuations ongoing\n\nThe CBC also explained that in Saskatchewan, the wildfire situation remains serious, with dozens of fires still burning and new evacuations underway. It said that the fire in the Shoe Fire area is the largest, covering more than 300,000 hectares.\n\nCook-Searson said the fires have trapped people in some areas due to highway closures. “The only way out is by boat or by plane,” Cook-Searson said. “We need help and more resources to be able to put those contingency plans in place.”\n\n‘Things will get worse’\n\nWith no rain in the forecast and a hot and dry summer on the horizon, the blazes are expected to balloon. Mr Moe said he thinks “there’s an admission here that things are going to get worse before they get better.”\n\nCanadian fires have billowed dirty smoke across North America in recent years, famously spreading ominous, orange-tinted skies and filthy air across New York in 2023.\n\nDaniel Swain, a climate scientist and meteorologist at the University of California, Los Angeles (UCLA), stated that smoke from Canada was already visible in the western U.S. state of Colorado.\n\nThe massive fires this early in the year will likely “have knock-on effects in the US later this fire season,” Swain added.\n\nThe fires have spread into politics, as Swain suggested that dealing with the consequences of the Canadian blazes in the US will be “compounded by recent severe cuts to emergency response, wildland firefighting, and weather prediction by the Trump administration.”\n\nPolitics and climate change. Why not?\n\nThe White House immediately responded. Spokeswoman Abigail Jackson described Swain as a “longtime Democrat donor who has spent hundreds of dollars supporting liberal politicians, including loser Kamala Harris, with radical climate policies that the American people have repeatedly rejected.”\n\nHowever, Sky News fact-checked the comment and found that according to “Federal Election Commission figures, Swain’s contributions since 2018 add up to less than $1,000.”\n\nAnd, of course, climate change cannot be ignored. Justin Murgai, CEO of WaterAid Canada, told Sky News: “The growing scale and severity of wildfires in Canada are a stark reminder of our changing climate.”","summary":"Ninety of the 175 massive fires that have erupted across Canada, forcing 21,000 evacuations and killing at least two people, [&#8230;]","url":"https://euroweeklynews.com/2025/05/31/175-wildfires-rage-in-canada-21000-evacuees-and-things-will-get-worse/","image":"https://cdn.euroweeklynews.com/wp-content/uploads/2025/05/At-least-90-of-the-175-wildfires-in-Canada-rage-out-of-control-Credits-Manitoba-Government-Reuters.avif","video":null,"publish_date":"2025-05-31 10:41:58","author":"Olivier Acuña Barba","authors":["Olivier Acuña Barba"],"language":"en","source_country":"es","sentiment":0.1},{"id":326749970,"title":"Panera And Cava Made Him A Billionaire. Here’s What He’s Cooking Up Now.","text":"Courtesy Act III\n\nRon Shaich opened his first bakery at 26 years old. In the decades since, he’s made a killing as a food fortune teller, discovering and bringing to market some of America’s biggest restaurant brands. Here’s what he thinks is next.\n\nRon Shaich looks relaxed. It’s partly due to his surroundings—the billionaire restaurateur is reclining in the home office of his vacation pad in Jumby Bay, a private island off the coast of Antigua. The 71-year-old Shaich is also in his element because he’s discussing his favorite subject: the “winner takes all” world of American dining. “The restaurant business is dirt farming,” he declares. It’s mostly muck, but every now and again you can strike gold – if you can dig up something special. “What I love is when I figure it out before anybody else.”\n\nFor more than four decades, Shaich has notched a string of huge wins doing just that. In 1981, he bought a majority stake in a small, three-location bakery cafe chain named Au Bon Pain. Twelve years later, he merged it with a slightly larger (20-store) chain called Saint Louis Bread Co., now known as Panera Bread. Shaich ran Panera as CEO until 2017, when he oversaw its $7.5 billion sale to German conglomerate JAB Holdings, pocketing $300 million after taxes from the transaction. Then he set up Miami-based Act III Holdings (named to represent the third act in his career) and invested around $175 million into the fast-casual Mediterranean chain, Cava.\n\nThe gamble on Cava is Shaich’s most lucrative to date. The company went public in 2023 at a valuation of nearly $5 billion. Its market cap is now $9.4 billion, making it more valuable than Panera at the time of its sale to JAB, despite Cava having a fifth as many locations. Shaich, who was Cava’s largest shareholder when it went public and currently serves as the brand’s chairman, became a billionaire in the IPO. Forbes estimates the mogul is now worth $1.3 billion, after selling $640 million worth of stock (pretax) since the public offering and retaining a 4% stake in the fast-growing company.\n\nThat type of success may be enough to prompt some people to call for the check. Not Shaich. He says he cashed out a majority of his Cava stake because his position was too concentrated, or as he put it, continuing the “farmer” analogy: “I want to harvest my crop when people fall in love with it and the valuations are way up.” (Shaich had good timing, selling more than 60% of his 11.7 million Cava shares in 2024 before the stock fell 30% this year. Analysts blame broader market concerns rather than the company’s individual performance.) Now he’s now looking to deploy his warchest to back the next winning restaurant concept – and he has a few ideas of what that might be.\n\nA Cava restaurant in the Brooklyn borough of New York, US, on Monday, May 6, 2024.\n© 2024 Bloomberg Finance LP\n\nShaich got his start in the restaurant business when he was 26. Born into an upper middle class family in Newark, New Jersey, he learned entrepreneurship from his father, an accountant who ran his own firm. (His mother, Pearl, stayed home to raise Shaich and his sister.) After studying politics at Clark University in Worcester, Massachusetts, Shaich, who was divided about whether to go into politics or business, opted for business. He got an MBA from Harvard in 1978 and took a job as a regional manager at The Original Cookie Company, a chain of gourmet cookie shops. He says he was drawn to the restaurant industry because it “lends itself to entrepreneurs,” in part because of low barriers to entry and the room for creativity.\n\nTwo years later, Shaich used $25,000 of personal savings and $75,000 from his father (“an advance” on his $250,000 inheritance) to open The Cookie Jar, a small cookie shop in Cambridge, Massachusetts. To expand his menu he began buying croissants and other baked goods from a local bakery, Au Bon Pain. That’s when he spotted an interesting opportunity.\n\nAu Bon Pain had a great product but was poorly managed, often failing to make deliveries on time, according to Shaich. He decided to merge the Cookie Jar, which was generating cash, with the three money-losing Au Bon Pain locations, paying nothing in the merger except agreeing to pick up Au Bon Pain’s $3.5 million of debt. He overhauled the company’s operations, grew it to around 50 stores, then took the fast-growing chain public in 1991.\n\nIt wasn’t long after the IPO when Shaich spotted his next target. St. Louis Bread Co., founded by entrepreneur Ken Rosenthal in 1987 in the St. Louis suburb of Kirkwood, was a thriving group of 20 bakery cafes across the Midwest. Shaich liked the selection of breads, homely feel and suburban popularity of the restaurants, which he viewed as a strong complement to Au Bon Pain, a bigger hit in cities. Au Bon Pain acquired the chain for $24 million and renamed it Panera Bread. (Shaich sold off Au Bon Pain in 1999 to focus fully on Panera, though Panera later bought it back then sold it again.) Over the next two decades, Shaich grew Panera at an incredible pace, expanding the soup, salad and sandwich chain to $5 billion in systemwide sales and over 2,000 units by 2017.\n\n“[Ron] had the idea early on of a more relaxed environment where you would gather, where the book club would meet,” recalls Bill Moreton, who joined Panera in 1998 and later became its executive vice chairman. Moreton also served on Cava’s board of directors until 2022, when he retired, and occasionally advises Act III. “He has an incredible natural sense, an innate sense of the consumer and what they’re looking for,” Moreton says of Shaich.\n\nThrough Panera, Shaich has been credited with pioneering the “fast casual” model of American dining, which combines elements of fast food (quick service) and finer dining establishments (higher quality food and slightly higher prices). The category, which is echoed by the likes of Chipotle, Shake Shack and Cava, “didn’t exist before,” says Danilo Gargiulo, a senior restaurant analyst at Bernstein. “I personally think he’s done something exceptional [with Panera].”\n\nShaich says his two children used to joke that \"the third child was Mother Bread,\" referencing the Panera logo.\nBoston Globe via Getty Images\n\nHis tenure wasn’t without some controversy, though. In 2017, with Shaich citing the short-term pessimism of public markets and a personal desire to move on to other ventures, he inked the deal to sell publicly traded Panera for $7.5 billion, a 30% premium to its market capitalization. A few months after the sale, a group of Panera investors challenged the sale price in Delaware Chancery Court, arguing Shaich and other Panera leaders had rushed through the deal at a too-low valuation. In 2020, a judge ruled that shareholders had been fairly compensated. Shaich and Panera also traded lawsuits after Shaich scooped up three of the company’s technology employees to work for Act III. Panera accused Shaich of trying to steal trade secrets while Shaich argued the company lacked the basis to enforce non-competes against these employees. The parties agreed to drop the battle, per a November 2021 filing. According to Shaich, the cases were settled “very satisfactorily,” though he said he cannot disclose details because of a non-disclosure agreement. A spokesperson for Panera did not respond to Forbes’ request for comment.\n\nThere were already a couple of ideas brewing in Shaich’s head when he left Panera. The first was to invest in Mediterranean food, which he has described – anecdotally – as “the number one diet in America.” “Every time you go to a doctor they’re saying Mediterranean. Every time you pick up a magazine it says Mediterranean,\" he says. “I didn’t know how far it was going to go but I knew Mediterranean had the potential to be as Mexican came before; as soup, salad, sandwich came before; as pizza came before.” That led him to Cava, started in 2006 as a standalone restaurant in Rockville, Maryland by a trio of three childhood friends. Shaich took a small personal stake in the chain in 2015 when he was still leading Panera; Cava had just two restaurants at the time. He set up Act III in 2018, the year after selling Panera, funding it with around $250 million of his own capital. He quickly put about 70% of it into merging the small but promising Cava with Zoe’s Kitchen, a rival about five times Cava’s size that had fallen on tough times.\n\nOvernight, the business went from 66 locations to more than 260. It’s since grown to nearly 400 across the U.S. and plans to reach 1,000 by 2032, all company-owned. Cava—a Chipotle-style, fast-casual chain where customers can build their own custom Mediterranean bowls—has doubled revenue from $470 million in 2022 to $954 million last year, and it became profitable in 2023. It seems to be particularly well insulated against the impacts of Donald Trump’s proposed tariffs because it imports only limited ingredients and materials from abroad, including avocados from Mexico and kalamata olives from Greece.\n\nShaich says he’s still bullish on Cava, despite dumping more than seven million shares over the past 21 months. Freeing up the capital has allowed Act III to invest more aggressively in its other businesses, he says. The most promising among them, Tatte, also dates back to Shaich’s time at Panera, when he acquired a majority stake in the business on behalf of Panera; Shaich ended up negotiating to take over ownership of Tatte as part of his exit package.\n\nOriginally started by the Israeli-born pastry chef Tzurit Or in Boston, Tatte sells a wide-ranging menu of pastries, breakfast and lunch dishes, and artisanal coffees inspired by Israeli, North African and Lebanese cuisine. There are currently 46 Tatte locations, mostly in Massachusetts, and the business is on track to do around $250 million in revenue this year, according to Act III partner and CFO Noah Elbogen, who first met Shaich when he was working for Panera activist investor Luxor Capital Group (the pair started off as adversaries but later became friends). That puts Tatte’s per-store sales at about $5 million – nearly double the sales volume of the average franchisee-owned Panera. Act III is pumping a “meaningful chunk” of its fresh cash into funding the opening of nine new Tatte locations across the Northeast this year, says Elbogen, including its first location in New York City, and ten more next year. The company also recently opened a 20,000-square-foot “central bakery” in New York, where its artisanal bakers will prepare Tatte’s fresh pastries and breads.\n\nTatte started as a stand at the Copley Square Farmer's Market in Boston, where Or began selling baked goods in 2007. \"I was new to the country and Tatte was and is my home and my community as for many others,\" Or tells Forbes.\nBoston Globe via Getty Images\n\nAnother big Act III investment is Level 99, which operates two interactive playgrounds for adults that challenges visitors to compete in 50 “physical and mental challenges set in artistic environments” such as a Ninja Dojo, an Aztec Temple and a Museum Heist. The company is set to open two more locations this year, as well as one in Disney Springs, a shopping mall in Walt Disney World Resort in Orlando, Florida, though it hasn’t revealed the timeline for this opening. In January, Act III also made its first investment in a new restaurant business since the firm was founded. After a year of discussions, the company picked up a stake in Honest Greens, a Barcelona-based eatery selling “loaded avocado toast,” “blueberry chia-pudding” and other healthy meals sourced locally to its nine European restaurants. The Act III team views this as an opportunity to grow in the more nascent European fast-casual market.\n\n“Ron is doing four or five things right now but we follow a very similar format,” says Elbogen. “Each is in its own category, each has the highest sales volume in its category and each one has a competitive landscape we think is very favorable.” It’s a playbook that’s “arguably worked now three out of three times,” adds the Act III partner.\n\nShaich won’t say how much he’s invested in each of these businesses or how much they’re currently worth. However, he notes that Act III does not function as a traditional venture capital firm. “We’re business builders, not investors,” he says, explaining that his fund – which employs around 25 people – typically takes over near total ownership of its portfolio companies after becoming their exclusive backers. Shaich owns 97% of the overall business, which he funds almost exclusively. “What we say is when we get involved with you, we’re going to be the last capital you need… We’re the bank.”\n\nShaich describes the firm as extremely selective about its investments, in part because it’s in the rare position of having more money than it knows what to do with. ‘“The issue for us is using this capital,” he says. “We only want to do things that are great.”\n\nThe Cava chairman insists he’s motivated to keep investing not by cash, but by the satisfaction from acting as a “sherpa” to growing businesses, referring to the skilled Nepalese guides who often help climbers scale Mount Everest. “I’m maybe not the right person to be saying this but I’m not sure all this income inequality in our country has helped us and I’m not sure it’s built a better country,” says Shaich, who in 2010 helped launch No Labels, a centrist political advocacy group focused on ending political extremism. The group tried – and failed – to come up with an alternative candidate for the 2024 election beyond Donald Trump and Kamala Harris.\n\nShaich’s personal theory is that those who focus on making money never do. “The people that actually do well actually do something better,” says the man behind some of America’s most successful restaurants, “they figure out a better way to do it for some target customer and that’s the way the system rewards you.”\n\nMore from Forbes\nForbesPokemon Go Made Niantic Billions. Now It’s Ditching Gaming For AI.By Richard NievaForbesThis Billionaire Immigrant Is Racing Elon Musk To Connect Your Phone From SpaceBy Alex KnappForbesHow Private Equity-Owned Companies Quietly Pocket Class Action PayoutsBy Jeff KauflinForbesTrump’s Small Business Administration Is Making It Harder To Ditch The Corporate GrindBy Brandon KochkodinForbesHired-Hand Billionaires 2025: These 48 Executives Got Rich Working For OthersBy Matt Durot\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Ron Shaich opened his first bakery at 26 years old. In the decades since, he’s made a killing as a food fortune teller, discovering and bringing to market some of America’s biggest restaurant brands. Here’s what he thinks is next.","url":"https://www.forbes.com/sites/jemimamcevoy/2025/05/31/panera-and-cava-made-him-a-billionaire-heres-what-hes-cooking-up-now/","image":"https://imageio.forbes.com/specials-images/imageserve/68388b17bdb26043712a5184/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-05-31 10:30:00","author":"Forbes Staff,Jemima McEvoy,Richard Nieva","authors":["Forbes Staff","Jemima McEvoy","Richard Nieva"],"language":"en","source_country":"US","sentiment":0.097},{"id":326796236,"title":"Weiner Pokes Soft Spot, Calls Out The View Sinking Kamala’s Campaign!","text":"ABC’s The View\nMay 30, 2025\n11:23:23 a.m. Eastern\n\nJOY BEHAR: Now, he's hoping to return to politics in the same office he started his political career: New York City Council. So, please welcome the very contrite Anthony Weiner.\n\nANTHONY WEINER: (D-NY): Thank you.\n\nBEHAR: Am I right when I say contrite?\n\nWEINER: Yes. By the way, was this where Kamala Harris was sitting when she blew up her campaign? Was this the spot?\n\nBEHAR: It was right there.\n\nWEINER: I hope I don't have the same fate.\n\nBEHAR: Yeah.\n\n11:32:35 AM EST\n\nBEHAR: But, you know, I'm listening to you now and thinking what do these people have in common: Cuomo, Clinton, Trump, Weiner, Spitzer? They're all men.\n\nWEINER: Yeah–\n\nBEHAR: They're all men. You talk about– we were talking about this before, about trying to appeal to these men out there. Why is it that two qualified women could not beat all of you guys? Could never– These women can never beat you. They're more qualified than almost anybody on that list, including you– I'm sorry.\n\nALYSSA FARRAH GRIFFITH: Well, New York has a female governor.\n\nWEINER: Well, by happenstance.\n\nFARRAH GRIFFITH: Yeah.\n\nWEINER: I mean, look, I've given this a lot of thought. As you know, I was married for a long time for Huma Abedin who, by the way, sat in– I think she sat in this chair.\n\nBEHAR: Yes.\n\nSARA HAINES: She’s brilliant.\n\nWEINER: She’s amazing.\n\nHAINES: Yes.\n\nWEINER: She's amazing, and I would watch the standard and she -- we had our courtship during the 2008 campaign, so I was right there up close to watch. The standards that women have to live up to in everything from what they wear, to how they talk, to the intonation, to the inflection. The number of times I heard someone comment about Hillary Clinton's laugh and I have heard Chuck Schumer's laugh–\n\nBEHAR: But her email! Her email–\n\nWEINER: – Oh, the email, I think there is something to that, the problem is it's a little bit too easy an answer, though. Because, also, there were things that Kamala Harris– I made a joking reference to the answer she gave on this show, “Is there anything you would do different?” That is the softest of softball– every politician dreams that have question. You still have to be a good candidate.\n\nBEHAR: Yeah, but almost all of these people on this list got away with something and she lost. That's all I'm saying.\n\nWEINER: Well–\n\nBEHAR: One misstep and she was out.\n\nWEINER: Yeah, I mean, I hate to correct you–\n\nBEHAR: Oh, go right ahead.\n\nWEINER: Bill Clinton was impeached, Eliot Spitzer was thrown out of office, I was thrown out of office, Andrew Cuomo was thrown out of office, so we do pay a price. The question is if you were going to say to those people, how do you judge their record in totality? I do believe that women get judged much more harshly than men do. I do believe that.\n\nBEHAR: That’s right.","summary":"On the Friday edition of ABC’s The View, former Congressman Anthony Weiner seemed to have hit a soft spot with the hosts when he made a joke regarding Kamala Harris’s disaster of an appearance on the show last year while she was on the campaign trail. In the opening moments of the interview, Weiner quipped: “By the way, was this where Kamala Harris was sitting when she blew up her campaign? Was this the spot?” followed with clearly uncomfortable chuckles from the panel and crowd alike. \n\nThe faux pas Weiner was referring to was Harris’ terrible answer to, what he termed, “the softest of softball questions.” As a guest on the show in October 2024, the former Vice President was asked by co-host Sunny Hostin if there was anything she would have done differently than Joe Biden. Her answer was a solid and resounding “no,” something that contributed to her eventual loss later that year in November.\n\n \n\n\n\n\n\n \n\nIn an obvious attempt to save face over the Harris incident, Joy Behar made a point to play the sexism card","url":"https://www.newsbusters.org/blogs/nb/ashley-taylor/2025/05/31/weiner-pokes-soft-spot-calls-out-view-sinking-kamalas-campaign","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/The%20View-11_33_57%20am-2025-05-30.jpg?itok=NicklxdQ","video":null,"publish_date":"2025-05-31 10:20:00","author":"Ashley Taylor","authors":["Ashley Taylor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.055},{"id":326740672,"title":"FBI Deputy Director Dan Bongino claims bureau ‘closing in’ on suspects who planted Jan. 6 DC pipe bombs","text":"FBI Deputy Director Dan Bongino made headlines this week when he revealed the bureau was \"closing in\" on suspects involved in planting two pipe bombs near the U.S. Capitol on Jan. 6, 2021, a sign that the bureau may soon solve the nagging, four-year mystery. \"The second we got in, I put a team on it and I said, ‘I want answers on this,’\" Bongino told \"Fox & Friends.\" \"And I'm pretty confident that we're closing in on some suspects.\" Law enforcement discovered the two pipe bombs near the Republican and Democratic National Committees' headquarters around the same time that thousands of rioters a few blocks away began to descend on the Capitol in protest of the 2020 election results. A faction of President Donald Trump's base has since raised questions about the timing of the pipe bomb incident and security failures surrounding it and speculated that the Biden administration was not forthright to the public about the facts of the case. Prior to being sworn in, Bongino was a leading voice perpetuating that notion. FBI 'CLOSING IN' ON SUSPECTS IN CASE OF DC PIPE BOMBS PLACED ON EVE OF JAN 6 A former Secret Service agent and podcast host, Bongino told listeners of his popular right-wing show that the FBI lied about the pipe bomb incident because the bureau did not want people to know it was an \"inside job.\" Now as deputy director, Bongino is facing pressure from supporters and critics alike to release new details about the case. What do we know about the suspect? Video footage released by the FBI shows an unidentified person placing the pipe bombs near the two headquarters more than 16 hours before law enforcement found them. The suspect is seen wearing a gray hoodie, Nike Air Max Speed Turf sneakers, a face mask, glasses, and gloves. FBI REOPENING INVESTIGATION INTO COCAINE FOUND AT BIDEN WHITE HOUSE Prior to the administration change in January, the FBI also unveiled a minor last-minute detail that the suspect's height was about 5-foot-7. Who found the pipe bombs? A woman who is a Capitol Hill resident alerted a security guard that she spotted the first pipe bomb in an alley behind the RNC headquarters while she was out retrieving her laundry around 1 p.m. Security footage showed her running from the area of the washer and dryer and notifying the guard. That set off a furious search that led officers at the DNC headquarters to discover a second pipe bomb there. Were the pipe bombs active? A Department of Homeland Security (DHS) inspector general report published last year revealed the two explosive devices were \"viable\" and \"could have detonated, causing innocent bystanders to be seriously injured or killed.\" FBI RELEASES VIDEO SHOWING JANUARY 2021 PIPE BOMB SUSPECT PLANTING DEVICE OUTSIDE DNC, RNC OFFICES IN DC The bombs included one-hour timers. An FBI official said they did not believe the timers could have detonated the bombs since the time had already elapsed when the bombs were found, according to the DHS report. That report and an investigative report released by House Republicans revealed that then-Vice President-elect Kamala Harris and former House Speaker Nancy Pelosi at one point came within feet of the pipe bomb by the DNC. What leads has the FBI received? The FBI has said it has received more than 600 tips, and it continues to offer a $500,000 reward for any successful leads. The House Republicans' report noted the FBI initially investigated a person who searched on the internet for \"pipe bomb DC\" and a person who had recently purchased the Nike shoes seen in the surveillance footage. CLICK HERE TO GET THE FOX NEWS APP The report noted, however, that the pace of the FBI's inquiry dropped off after about a month as a result of leads drying up.","summary":"The FBI could soon solve the case of the pipe bombs found near the U.S. Capitol, according to bureau Deputy Director Dan Bongino.","url":"https://www.foxnews.com/politics/fbi-deputy-director-dan-bongino-claims-bureau-closing-suspects-planted-jan-6-pipe-bombs","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/bongino-pipe-bomb-suspect.png?ve=1&tl=1","video":null,"publish_date":"2025-05-31 10:00:07","author":"Ashley Oliver","authors":["Ashley Oliver"],"language":"en","category":"politics","source_country":"us","sentiment":-0.042},{"id":326788892,"title":"Censorship is making a comeback just about everywhere","text":"Jorge Luis Borges thought censorship did have a positive side because, despite being very bad on principle, it obliged writers to express themselves in more subtle ways than they would if they did not have to worry about what people in power would think about them. Before he was murdered by the thuggish Soviet regime, Osip Mandelstam used to say he was pleased that the Communist authorities took poetry so terribly seriously that they were more than willing to persecute practitioners who preferred unproletarian genres such as symbolism to the officially approved socialist realism.\n\nUntil fairly recently, those living in Western democracies had no need to take comfort in such arcane considerations because, within limits which most regarded as reasonable, they were free to write or say pretty well what they liked, but there are signs that a period that was characterised by an unusual degree of tolerance is fast coming to an end. Technological progress is providing the powerful with tools that help them control what goes on in the minds of the rest of the population. In Europe, especially the United Kingdom, people are getting clapped in jail for saying nasty things on the “social media” and even expressing a mild criticism of something that happens to be fashionable in elite circles can get you into trouble with the cops who will put a “non-crime incident” on your record that could cause you much grief.\n\nMeanwhile, in the United States, Donald Trump’s government has ordered public servants to explore remote regions of cyberspace in search of dangerous thoughts so foreign students who have been guilty of expressing anti-American or pro-terrorist views can be denied entry to US universities even if they committed their mental crimes before emerging from adolescence. \n\nIs censorship returning to Argentina? There are ominous signs that, once again, it is knocking at the door. According to a much respected journalist, La Nación’s Hugo Alconada Mon, Javier Milei’s government wants the country’s well-funded intelligence agencies to keep a close eye on the miscreants who “manipulate public opinion” and are wicked enough to cast doubts on the efficacy and wisdom of its economic programme by, among other things, undermining trust in officialdom. Are they plotting to overthrow the government? It seems there are people in high places who think there are subversives and that they deserve to be treated accordingly.\n\nTo justify what they are up to, those behind it allude to the danger they see posed by unscrupulous foreign regimes that spread “disinformation” in an attempt to affect elections in those parts of the world in which they still mean something. This has been a hot issue for at least a decade. It may be nonsensical to think that it was thanks entirely to some incredibly clever Russian cyberwarriors that Trump beat Hillary Clinton in the 2016 presidential elections and Kamala Harris a year ago, but it would appear that some North Americans and their friends elsewhere genuinely believe that this was the case. In any event, fears that the dissemination of “fake news” by malignant actors in Moscow, Beijing and other such places can have dire political consequences in democratic countries have provided would-be censors everywhere with plenty of plausible excuses. They are making the most of them.\n\nLike previous generations of Argentine “liberals,” Milei and those surrounding him want to unshackle the economy but are rather less keen on letting their critics speak their minds. So far, the President and his propagandists have limited themselves to insulting those they regard as dissidents, bombarding them with an imaginative variety of opprobrious epithets, but it would seem they feel frustrated by their failure to reduce them all to silence.\n\nSo far, the main targets of their picturesque wrath have been moderates who on the whole support the government’s economic policies, but are sceptical about some of the measures it is taking. However, with the battle for Buenos Aires Province looming, this could be about to change. After having dealt with that doddering old fool (or words to that effect) Mauricio Macri and his friends, Milei’s libertarians – also known as “The Forces of Heaven” – are training their guns on Cristina Fernandez de Kirchner and her former protégé Axel Kiciloff. Will their diatribes be accompanied by a judicial onslaught? It would appear that, up to now, Milei likes having Cristina around, which is why his allies in the Senate blocked a bill that would have made it far harder for her to run for office, even in the Buenos Aires Province legislature, but if she starts causing him serious difficulties, he could add his weight to those who want to see her put behind bars for stealing a huge amount of money when in power.\n\nIs Milei’s evident unwillingness to allow anyone who does not idolise him to express his or her thoughts putting a damper on public discourse? It is hard to say, but would be strange if it had no effect. Argentina has a long tradition of self-censorship and it has always been easy for people to find good reasons for refusing to get involved in anything that, by becoming controversial, could cause them serious difficulties in the future.\n\nThere is also a growing awareness that what goes online will remain there for decades to come, so it would be better to be careful. This is true not only here but also in countries, among them the US, the UK and those of continental Europe, where freedom of speech is being whittled away by censorious activists or the left, the right and newish combinations of the two such as the “woke” fraternity and sisterhood. As a result, prospects everywhere look increasingly gloomy.\n\nMilei has a habit of shouting “Freedom, damn it!” whenever the opportunity arises, but he is clearly an authoritarian at heart who does not take kindly to criticism. He is certainly not a person who would resist the temptation to follow the example that is being given by the rulers of countries which have long been seen as stalwart defenders of democratic freedoms. Unless he does, however, Argentina could once again become a land in which it would be far riskier to express even minor discrepancies with what the government wants you to think than it has been since that day in December 1983 when, to general relief, a discredited military dictatorship finally called it quits.","summary":"Milei has a habit of shouting “Freedom, damn it!” whenever the opportunity arises, but he is clearly an authoritarian at heart who does not take kindly to criticism.\n Leer más","url":"https://www.batimes.com.ar/news/opinion-and-analysis/censorship-is-making-a-comeback-just-about-everywhere.phtml","image":"https://fotos.perfil.com/2025/05/30/cropped/696/696/center/targeting-art-2033616.jpg","video":null,"publish_date":"2025-05-31 09:28:00","author":"James Neilson","authors":["James Neilson"],"language":"en","category":"entertainment","source_country":"ar","sentiment":-0.008},{"id":326856264,"title":"‘So polarised’: Bruce Springsteen’s anti-Trump comments divide US fans","text":"As the lead singer of a Bruce Springsteen cover band, Brad Hobicorn had been looking forward to performing at Riv’s Toms River Hub in New Jersey on Friday. Then came a text message from the bar’s owner, saying the gig was cancelled. Why? Because the real Bruce Springsteen had lambasted Donald Trump.\n\n“He said to me his customer base is redder than red and he wishes Springsteen would just shut his mouth,” Hobicorn recalls by phone. “It was clear that this guy was getting caught up in that and didn’t want to lose business. The reality is we would have brought a huge crowd out there: new customers that are Springsteen fans that want to see a band locally.”\n\nThe culture wars have arrived in New Jersey, the state of Frank Sinatra, Jon Bon Jovi, Whitney Houston, comedian Jon Stewart and TV hit The Sopranos. Springsteen – revered for songs such as Born In The USA, Glory Days, Dancing In The Dark and Born To Run – has long been a balladeer of the state’s blue-collar workers. But last year, many of those same workers voted for the president.\n\nNow their split loyalties are being put to the test. Opening a recent tour in Manchester in Britain, Springsteen told his audience: “The America I love, the America I’ve written about that has been a beacon of hope and liberty for 250 years is currently in the hands of a corrupt, incompetent and treasonous administration.” He repeated the criticisms at later concerts and released them on a surprise EP.\n\nTrump responded by calling Springsteen highly overrated. “Never liked him, never liked his music or his Radical Left Politics and, importantly, he’s not a talented guy — just a pushy, obnoxious JERK,” he wrote on social media. “This dried out prune of a rocker (his skin is all atrophied) ought to KEEP HIS MOUTH SHUT until he gets back in the Country.”\n\nTrump, 78, also posted a video edited to make it seem as if he had hit 75-year-old Springsteen with a golf drive. Trump called for a “major investigation” into Springsteen, Beyoncé and other celebrities, alleging that they had been paid millions of dollars to endorse his Democratic opponent in the 2024 election, Kamala Harris.\n\nHarris beat Trump by six percentage points in New Jersey, significantly less than Joe Biden’s 16-point winning margin in 2020. In Toms River, a township along the Jersey Shore, Trump received twice as many votes as Harris, helping explain why Riv’s Toms River Hub got cold feet about hosting a Springsteen cover band.\n\nThe bar and restaurant cancelled the 30 May gig by No Surrender, a nine-person band that has played Springsteen songs for more than two decades, despite it being scheduled months in advance. Contacted by the Guardian, owner Tony Rivoli declined to comment.\n\nHobicorn, 59, from Livingston, New Jersey, says the band suggested a compromise of playing classic rock other than Springsteen’s but Rivoli rejected the idea. Hobicorn also received some criticism from Springsteen fans for offering the partial climbdown.\n\nBut he explains: “That’s where I made the point that not everybody in the band is aligned with Bruce Springsteen’s politics. Everybody’s got a different point of view but that’s OK. You can still be in a Springsteen cover band and not 100% agree with everything he says.”\n\nHe adds: “My band is split. We’re half red, half blue. We have civilised conversations and then we go and play the music and it’s never been about politics. This thing got made into a political situation.”\n\nSpringsteen is not new to the political arena. When former president Ronald Reagan referenced the singer’s “message of hope” at a campaign stop, Springsteen wondered if Reagan had listened to his music and its references to those left behind in the 1980s economy. Later, he was a regular presence on Barack Obama’s presidential election campaign.\n\nHe has also challenged his audience politically beyond presidential endorsements. Born in the USA told of a Vietnam war veteran who lost his brother in the war and came home to no job prospects and a bleak future. My Hometown described the kind of economic decline and discontent that Trump has exploited: “Now Main Street’s whitewashed windows and vacant stores / Seems like there ain’t nobody wants to come down here no more.”\n\nSpringsteen’s 1995 album The Ghost of Tom Joad bluntly documented the lives of struggling immigrants, including those from Mexico and Vietnam. His 2001 song American Skin (41 Shots), criticised the shooting by New York City police officers of an unarmed Guinean immigrant named Amadou Diallo, angering some of the blue-collar segments of his fanbase.\n\nBut taking on Trump is a cause of a different magnitude. His “Make America great again” (Maga) movement has proved uniquely polarising in US culture, forcing many people to choose whether they are on the blue team or red team. The clothes people wear, the food they eat and the music they listen to have become signifiers of Maga. Even some in New Jersey, where Springsteen grew up and now lives in the town of Colts Neck, are having doubts.\n\nHobicorn reflects: “As the country has become more and more divided, there’s certainly a real disdain for Springsteen and his politics in New Jersey. Most New Jerseyans are supportive of who he is, what he’s done for the state, what he’s done for our culture, what he’s done for music.\n\n“I feel like it’s not a lot of stuff in the middle like, yeah, he’s OK. It’s one way or the other. In New Jersey it’s mostly in a positive way: people love and respect Bruce for everything. But some are going to paint the picture of him: he’s a billionaire and he doesn’t give a crap about anybody but himself. That’s what they do.”\n\nNo Surrender has found an alternative venue. After the cancellation of its Toms River gig, Randy Now’s Man Cave, a record shop in Hightstown, New Jersey, stepped in and will host the band on 20 June. The shop will producers flyers and T-shirts that say: “Free speech is live at Randy Now’s Man Cave.”\n\nOwner Randy Ellis, 68, says: “The state is proud of Bruce Springsteen. He should become the state bird for all I know.”\n\nBut he admits: “In the last election, Harris won the state but there were many more people for Trump than I ever expected in New Jersey. It’s so polarised now. We may have people in front of my store saying Springsteen sucks and all that. Who knows?”\n\nAt a time when many of Trump’s critics have kept quiet, Springsteen is arguably his leading cultural foe. In 2020 he said: “a good portion of our fine country, to my eye, has been thoroughly hypnotised, brainwashed by a conman from Queens” – knowing the outer-borough reference still stung a man who built his own tower in Manhattan.\n\nDan DeLuca, who grew up in Ventnor, New Jersey, and is now a popular music critic at the Philadelphia Inquirer newspaper, says: “The thing about Bruce that people love is this idea of being a truth teller. You see what you see and you need to speak on it. There’s a lot of people who are muttering things or speaking in private about what’s going on in America who are not speaking out for whatever reason. Maybe they don’t believe that politics and art should mix. Maybe they’re worried about their fanbase or something.\n\n“As he said, there’s a lot of crazy shit going on and it’s happened since he was last on the road. It’s good that he’s speaking his mind and he’s speaking what a lot of people want to hear but maybe are afraid to hear and it’s maybe giving some people courage.”\n\nBut as the case of No Surrender demonstrated, there is a significant minority in New Jersey who see things differently in this hyper-partisan era. DeLuca reflects: “I grew up in south Jersey, which is less densely populated, less urban, and it’s Trump country now.\n\n“Springsteen has been true to what he sings about and the people he sings about and the blue collar concerns but then he’s open to target because he’s rich or hangs out with Obama. They probably think that Bruce has turned into a knucklehead socialist or something. I’m sure there are plenty of people who probably do have some divided loyalties.”","summary":"Tensions among the rock icon’s fanbase have spread to his home state of New Jersey\n\nAs the lead singer of a Bruce Springsteen cover band, Brad Hobicorn had been looking forward to performing at Riv’s Toms River Hub in New Jersey on Friday. Then came a text message from the bar’s owner, saying the gig was cancelled. Why? Because the real Bruce Springsteen had lambasted Donald Trump.\n\n“He said to me his customer base is redder than red and he wishes Springsteen would just shut his mouth,” Hobicorn recalls by phone. “It was clear that this guy was getting caught up in that and didn’t want to lose business. The reality is we would have brought a huge crowd out there: new customers that are Springsteen fans that want to see a band locally.”\n\n Continue reading...","url":"https://www.theguardian.com/music/2025/may/31/bruce-springsteen-fans-trump","image":"https://i.guim.co.uk/img/media/714d0bff314f4f011b172575fa2edb1bbc9e1cec/235_230_2510_2008/master/2510.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZ","video":null,"publish_date":"2025-05-31 09:20:39","author":"David Smith","authors":["David Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.404},{"id":326758774,"title":"Democrats ponder the 'manosphere'","text":"Democrats know they have a problem with men, particularly the young men who have drifted away from them in recent years. But six months after the gender gap contributed to the party’s disappointing showing in last year’s election, top Democrats are still throwing spaghetti at the wall, lacking a unified theory on how to win these voters back. Some are trying to break into the culturally conservative podcasts that have thrived at building big audiences of Gen Z men. Some are ceding ground on issues Democrats have long seen as sacred in the culture war, while others insist that the party’s current message will work. Some are pitching grand plans about funding a new influencer ecosystem that subtly boosts the left. At the center of all of this is an acknowledgement that public opinion on the Democratic Party has dipped to an all-time low, men are souring on the party especially quickly, and losing ground with about half the voting population isn’t a recipe for success. It’s weighing heavily on the minds of Democrats while making Republicans giddy: On Friday, President Donald Trump needled Democrats for wanting to “spend money to learn how to talk” to men. Jeff Horwitt, a Democratic pollster with Hart Research Associates (who conducts the NBC News poll with a Republican counterpart), told NBC News that a look at recent presidential exit poll results shows that “when Democrats do well broadly with men, they are competitive. When Democrats are not competitive with men, Democrats lose.” And while Horwitt doesn’t believe Republicans “have a lock on young men,” the GOP spoke to their economic anxiety in 2024 in a way that loomed large in 2024. “There was one party that was really addressing that and feeding that anger — I would argue in an unproductive but, unfortunately, ultimately more compelling way,” Horwitt said, “while the Democratic Party was focusing more on other issues and not addressing some of the uncomfortable reality of what was going on.” The state of play Much of the attention of Democrats in the aftermath of the 2024 election has centered on young men. While younger voters lean more liberal, the recent NBC News Stay Tuned Poll powered by SurveyMonkey found the largest gender gap of any generation was among Gen Z, with the largest gaps in that cohort on Trump’s approval rating and key cultural issues. The poll also included one potential partial explanation for why: differences in how men and women consume news. Younger women were more likely to turn to TikTok. Younger men were more likely to say YouTube and X were their favorite news sources. The YouTube, social media and podcasting universe exploding in popularity with young men has been nicknamed the “manosphere” — a spectrum of podcasts hosted by men that generally cover sports, internet culture, dating and sometimes politics. “The Joe Rogan Experience” has become the exemplar of the genre. The freewheeling three-hour podcast features interviews with a variety of guests. It doesn’t structure the unscripted conversations around politics, even if an often right-leaning worldview sometimes colors the conversation. Other shows in this space also garner hundreds of thousands to millions of views per episode, ranging from shows focused on comedy (like the “Flagrant” podcast hosted by comedians Andrew Schulz and Akaash Singh and “This Past Weekend” hosted by comedian Theo Von) to shows focused on military veterans and strength (like the “Shawn Ryan Show”) to those focused on sports (like Barstool Sports’ “Pardon My Take”). The lengthy-yet-revealing Rogan-style interviews are a popular feature on these shows, often covering new ground about a celebrity or a taboo topic. Some of these podcasts have also faced accusations of misogyny and racism, while other, more controversial figures on the fringes of the “manosphere” have been accused of sexual harassment or rape. Jackson Katz, a gender violence prevention activist and educator, said that young men aren’t necessarily drawn to the podcasts because of their perceived politics, but for the other topics they discuss. “They don’t see themselves as political actors, if you will. A lot of these hosts, they see themselves as … guys just hanging out with the guys, you know, talking about sports, talking about relationships, talking about working out, eating, eating healthy, you know, things like that, and throwing in some politics,” Katz told NBC News. Engaging on these platforms was part of the Trump campaign’s strategy last year, with Trump appearing on more than a dozen “manosphere” podcasts during his 2024 campaign. His October appearance on “The Joe Rogan Experience” alone generated almost 60 million views. Trump and his closest allies have also flirted with the darker corners of the “manosphere.” Trump appeared on a livestream with controversial influencer Adin Ross. Trump’s two eldest sons, Donald Trump Jr. and Eric Trump, spoke on social media with Andrew Tate and Russell Brand, respectively, in 2024. At that time, Tate had been charged with human trafficking in Romania and Brand had been facing allegations of sexual assault for which he has since been charged. Both men deny the allegations against them. Trump talked not only about politics but also about football, drugs, aliens and UFOs on the shows — conversations Katz said were “about proving that he could be relatable and could hang with the guys.” And the conversations reverberated across social media, reaching a wider audience than just regular listeners. Trump thanked some of those podcasts and hosts by name during his victory speech. Some Democrats were quick to blame Vice President Kamala Harris’ comparative lack of appearances on podcasts and unscripted platforms as part of the reason why she lost, and some have argued that engaging on these platforms is part of the pathway back. “A lot of young men were attracted to spaces that weren’t as buttoned up, were more free-flowing and open to unstructured conversations,” Rotimi Adeoye, a political writer and Democratic strategist who used to work on Capitol Hill and for the ACLU, told NBC News. “People like Theo Von and Joe Rogan came up through a culture that prioritizes detours over script and emotional honesty over polish. But Democrats have, at times, leaned on polish because it does well with constituencies like college-educated liberals,” Adeoye continued. Democrats debate: Engage, or push opponents ‘under a rock’ It’s one reason why a flood of Democrats are starting their own podcasts or are putting themselves through the wringer in hour-plus interviews with these popular personalities. But even those conversations illustrate how the party is grappling with bigger questions on its communication and outreach strategies. One example is California Gov. Gavin Newsom, who started his own podcast in the wake of Democrats’ loss in 2024. Newsom promised listeners that the show would feature conversations with “voices from across the political spectrum, including those I fundamentally disagree with.” The deep divisions among Democrats about how to engage men, how to juggle that outreach with more controversial pieces of the “manosphere,” and even the definition of masculinity itself were all on display during Newsom’s recent chat with Minnesota Gov. Tim Walz — a discussion between two men weighing bids for higher office. Questioning Newsom’s decision to invite Trump allies like Charlie Kirk and Steve Bannon onto his podcast, Walz told Newsom, “I can’t message to misogynists.” The 2024 vice presidential candidate later asked, “How do we push some of those guys back under a rock?” Newsom replied that he wants to “understand what their motivations are” and pushed back on the idea they were solely motivated by racism and misogyny, calling back to earlier in the podcast when he told Walz that “not everybody that disagrees with us is a misogynist.” “I think there’s a lot of that, but I don’t think it’s exclusively that,” Newsom said, adding that Bannon’s talk about the working class reminds him of his grandfather. Shortly before that exchange, Walz lamented how during his time on the 2024 presidential ticket, conservative media would do segments like one that mocked him for drinking a milkshake with a straw. “How do you fight it? I think I can kick most of their ass[es]. I do think that, if they want to, I know I can outrun them,” Walz said shortly afterward, questioning the wisdom of getting into a “WWE fight” with conservatives. Walz, a Midwestern governor who was tapped for the presidential ticket after gaining prominence among Democrats for his straight talk on the stump, did make attempts to reach out to men during the campaign. He appeared at the national convention with his former football team, he played Madden on a Twitch stream and went hunting with influencers as part of a charm offensive toward men. But during a recent interview with the Harvard University Institute of Politics, he admitted the efforts came up short, even as he said a lesson from Trump’s win is “if you leave a void, Donald Trump will fill it.” “I also was on the ticket, quite honestly, because I could code talk to white guys watching football, fixing their truck, doing that, that I could put them at ease. I was the permission structure to say: Look, you can do this and vote for this. And you look across those swing states, with the exception of Minnesota, we didn’t get enough of those votes,” he said. Katz, the researcher who also appeared on a later episode of Newsom’s podcast, told NBC News he understood Walz’ hesitance to appear on “manosphere” podcasts, but he argued Democrats should be entering these spaces. “I think some Democrats have been reluctant, because you can’t control the message coming from the other side. In other words, you don’t know what the podcasters are going to say,” Katz said. “They might say things that wouldn’t pass muster on the ... progressive, liberal side of the house. But if you want to engage people, you have to engage people, and you have to have dialogue with people.” “If we truly believe our own ideas, why are we afraid to be challenged on them?” he added. Plunging in Some prominent politicians are already bringing their message to these spaces, like former Transportation Secretary Pete Buttigieg and Sen. Bernie Sanders, I-Vt., who each recently appeared on “Flagrant,” which Trump also joined last year. While the 83-year-old Sanders, a two-time runner-up for the Democratic presidential nomination, isn’t likely to run for the White House again, the 43-year-old Buttigieg is clearly eyeing higher office. Buttigieg and Sanders embraced the wide-ranging, off-the-cuff nature of “Flagrant,” with Buttigieg sharing his opinions about the finale of HBO’s “White Lotus” and discussing his journey toward coming out as gay, while Sanders mused about his childhood love of the Brooklyn Dodgers. Both politicians offered sharp critiques of Trump but also of the Democratic Party, with Sanders drawing the ire of some Democrats for agreeing with the hosts when they argued the Democratic Party hasn’t run a “fair primary” since 2008. Buttigieg lamented Democrats’ reticence to appear on podcasts and other nontraditional forms of media, arguing Democrats have rested on their laurels after being early adopters of social media. “We have to be encountering people who don’t think like us and don’t view the world the way we do, both in order to actually legitimately become smarter and better and make better choices and have better positions, and just in order to persuade. There’s no persuasion now, or there’s not enough persuasion,” he added. While Buttigieg and Sanders recently traveled to appear on one of the more popular shows in this space, some want Democrats to bankroll their own media ecosystem. They hope to poach male listeners and viewers from these podcasts and build their own space that’s friendlier to liberal voices and perspectives while maintaining some of the trappings and attraction of shows like Rogan’s. The New York Times recently reported on one such pitch, a $20 million plan called “Speaking with American Men: A Strategic Plan” that aims to “study the syntax, language and content that gains attention and virality in these spaces.” Adeoye, the Democratic strategist, said he fears Democratic donors trying to take their ball and go home won’t ultimately be successful because that lacks the authenticity that drew men to these spaces in the first place. “They have good intentions, but if they just want to throw money at the problem and create new podcasts instead of engaging with people where they already exist, they are breaking the core rule of politics: meeting people where they are,” Adeoye said.","summary":"Democrats know they have a problem with men, particularly the young men who have drifted away from them in recent years.","url":"https://www.nbcnews.com/politics/elections/democrats-ponder-manosphere-rcna209806","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-05/250529-split-Joe-Rogan-Pete-Buttigieg-Gavin-Newsom-ch-1441-4e848d.jpg","video":null,"publish_date":"2025-05-31 09:00:00","author":"Alexandra Marquez,Ben Kamisar","authors":["Alexandra Marquez","Ben Kamisar"],"language":"en","category":"politics","source_country":"us","sentiment":-0.21},{"id":326701560,"title":"The Biden cover-up: a 'near-treasonous' conspiracy","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\nTalking Point\n\nThe Biden cover-up: a 'near-treasonous' conspiracy\n\nUsing 'Trumpian' tactics, the former president's inner circle maintained a conspiracy of silence around his cognitive and physical decline\n\nNewsletter sign up\n\n'Vain effort' to disguise issues that were 'evident to anyone'\n\n(Image credit: Allison Robbert /AFP / Getty Images)\n\nThe Week UK \n\n31 May 2025\n\nIs it possible to stage a political cover-up over something that's obvious to everyone? Weirdly, it is, said Alex Shephard in The New Republic. If you don't believe it, just read \"Original Sin\", the new book by journalists Jake Tapper and Alex Thompson about how Joe Biden's family and colleagues conspired to hide his growing frailty and confusion during his time in the White House.\n\nIt was a vain effort in some respects, as Biden's decline was evident to anyone who saw him walk or talk. Poll after poll showed that voters were all too aware of the issue. Yet the White House succeeded in suppressing talk about it, at least until Biden's disastrous TV debate with Donald Trump. It used \"tactics that can only be described as Trumpian – denying any and all accusations\", and attacking the credibility of any reporter or politician who raised legitimate questions about the president's fitness.\nWe can't let sympathy with Biden over his recent cancer diagnosis stand in the way of a \"reckoning\" for this cover-up, said Megan McArdle in The Washington Post. Thanks to \"Original Sin\", we now know that \"the most powerful nation in the world and its nuclear arsenal were left in the hands of a man who could not reliably recognise people he'd known for years, maintain his train of thought or speak in coherent sentences\". By late 2023, Biden's staff were apparently pushing as much of his schedule as possible to midday, when he was at his sharpest. Even for small meetings, he often relied on a teleprompter. The hiding of Biden's decline represents a \"near-treasonous dereliction of duty\" by his staff. Democrats and the liberal press have a lot to answer for, too.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nBiden and his backers were lying to themselves as much as to others, said Carlos Lozada in The New York Times. They were in thrall to the \"Biden mythology\" of the scrappy leader beating the odds. Because of their misgivings about Kamala Harris, and their hatred of Trump, they felt justified in concealing the truth.\n\nBut Democrats now need to resist the temptation to pin the whole election debacle on Biden. If he'd dropped out of the race earlier, it's not clear that any other nominee would have done better than Harris. For too long, the Democrats have acted as the anti-Trump party, offering no positive sense of what they believe in. History won't be kind to Biden, but Democrats should be mindful that \"it's easier to find a scapegoat than an identity\".\n\nExplore More\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nThe Week UK\n\nSocial Links Navigation\n\nCrossword: May 31, 2025\n\nThe Week's daily crossword puzzle\n\nSudoku medium: May 31, 2025\n\nThe Week's daily medium sudoku puzzle\n\nCodeword: May 31, 2025\n\nThe Week's daily codeword puzzle\n\nYou might also like\n\nDeportations: Miller's threat to the courts\n\nThe Trump administration is considering suspending habeas corpus to speed up deportations without due process\n\nAsylum: Only white Afrikaners need apply\n\nTrump welcomes white Afrikaner farmers while shutting down the asylum program for non-white refugees\n\nLaw: The battle over birthright citizenship\n\nTrump shifts his focus to nationwide injunctions after federal judges block his attempt to end birthright citizenship\n\nThe threat to the NIH\n\nThe Trump administration plans drastic cuts to medical research. What are the ramifications?\n\nCourts try to check administration on deportations\n\nThe Supreme Court will allow the Trump administration to end protected status for Venezuelans, but blocks deportations under the Alien Enemies Act\n\nHouse GOP pushes ahead on deficit-boosting tax bill\n\nRepublicans push a bill that will lock in Trump's tax cuts, cut Medicaid and add trillions to the national debt\n\nHow the civil service works – and why critics say it needs reform\n\nThe Explainer\nKeir Starmer wants to 'rewire' Whitehall, which he has claimed is too 'comfortable in the tepid bath of managed decline'\n\nBrexit 'reset' deal: how will it work?\n\nKeir Stamer says the deal is a 'win-win', but he faces claims that he has 'surrendered' to Brussels on fishing rights\n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"Using 'Trumpian' tactics, the former president's inner circle maintained a conspiracy of silence around his cognitive and physical decline","url":"https://theweek.com/politics/the-biden-cover-up-a-near-treasonous-conspiracy","image":"https://cdn.mos.cms.futurecdn.net/pzkuQYcZfKS6v2Gx327h7m.jpg","video":null,"publish_date":"2025-05-31 06:21:00","author":"The Week UK","authors":["The Week UK"],"language":"en","source_country":"gb","sentiment":0.169},{"id":326856356,"title":"Worried about weed: should London follow New York and decriminalise cannabis?","text":"The last time London dabbled in decriminalising cannabis, it brought one part of the capital to a brief but giddy high. In 2001, an enterprising Scotland Yard borough commander empowered his officers in Lambeth to caution rather than arrest those carrying small amounts of the drug for personal use – freeing them, according to the scheme’s proponents, to concentrate on more serious crimes.\n\nThe softly-softly approach was controversial in some political and policing quarters, but wildly popular in the borough – and some of its results were dramatic. Over six months, more than 2,500 hours of police officers’ time were saved on processing cannabis arrests, while arrests for dealing class A drugs rose by almost a fifth.\n\nNon-drug crime fell by 9% overall, with sharp declines in burglaries and street robberies. Almost two-thirds thought it had improved relations between the police and the community.\n\nThe Lambeth experiment would end after a year, however, after the man behind it, Brian Paddick, was transferred following newspaper allegations about his private life – later acknowledged to be false. Lambeth’s residents may have been dismayed, organising public meetings and petitions to call for Paddick’s reinstatement (“He’s not a very naughty boy, he’s the Messiah,” read one poster) but Metropolitan police plans to introduce the measures across the capital were quietly shelved.\n\nAlmost a quarter of a century on, could decriminalisation be back on the cards for London?\n\nSadiq Khan this week indicated his support, after an independent commission into cannabis regulation, promised by the mayor in his 2021 election manifesto, published its findings.\n\nClassifying cannabis as a class B drug was disproportionate to its harms, it said, and the sanctions users were subject to for personal possession “cannot be justified”.\n\nInstead, the panel recommended, “natural” (but not synthetic) forms of the drug should be re-classified, allowing Londoners to use small quantities without penalty. They did not, however, call for full legalisation: those producing or supplying the drug would still be breaking the law.\n\nThe move, the report said, would have the important added benefit of addressing racial inequalities in the way the Met polices cannabis possession by stop and search.\n\nBlack people are nine times more likely to be stopped and searched by the police, according to 2021 figures – but are no more likely to be carrying cannabis.\n\n“It is clear a fundamental reset is required,” said the commission’s chair, Lord Falconer, and Khan agreed: “I’ve long been clear that we need fresh thinking on how to reduce the substantial harms associated with drug-related crime in our communities.”\n\nAs both men know, however, the mayor has no power to change drugs laws in the capital, and the government was quick to slap down any such suggestion. “We have no intention of reclassifying cannabis from a class B substance under the Misuse of Drugs Act,” the Home Office said in a statement.\n\nThe fact that, 24 years after the Lambeth experiment, the debate over cannabis feels so familiar may be a feature of the drug’s ambivalent place in British consciousness. Legislators may be immovable on the issue today, but cannabis was briefly reclassified as a less harmful class C drug in 2004, only to be moved back to class B five years later – arguably, the report suggests, for political reasons.\n\nThe British public are broadly in favour of loosening restrictions – but not overwhelmingly so. A YouGov poll this week found 54% supported decriminalising cannabis possession for personal use, with 34% opposed and 13% unsure. Asked if decriminalisation would lead to more drug use, almost exactly the same proportion (42%) said yes as those who said it would make no difference (43%).\n\nWhile almost a third of people have tried it at some point, cannabis use is actually falling across England and Wales – particularly sharply in London, where the proportion of those aged 16-59 who had used the drug in the past year was 6.2% in 2022-3, compared with 14.3% in 2001-2.\n\n‘The vast majority … have not come to any real harm’\n\nFrom a health point of view, discussion of the harms of cannabis is nuanced. “If you’re looking at harm at a population level, the vast majority of the millions of people who’ve ever smoked cannabis in this country since the Beatles have not come to any real harm,” noted Harry Shapiro, director of the drug information service DrugWise.\n\nBut while most health professionals agree that a low or moderate use of the drug is likely to be minimally harmful for most people, others are anxious to emphasise the risk to a minority, especially from the much stronger forms of the drug that increasingly dominate the market.\n\nDr Emily Finch, chair of the addictions faculty at the Royal College of Psychiatrists (RCPsych), said: “It’s obvious to say that many people with cannabis have no problems at all, but there are several circumstances where it can be incredibly dangerous.” Most seriously, for a small proportion, she continued, cannabis greatly increases the risks of developing psychosis, but even among other users, there can be other risks.\n\n“People say – would tell you – that cannabis isn’t addictive. There’s really good evidence that that isn’t true, and that there is a significant group, maybe 5% of cannabis users, who do become dependent on cannabis use.” In addition, she said: “We need to understand that it’s not helpful for 11- to 15-year-olds to use large amounts of cannabis.”\n\nAbout a third of people who use cannabis develop a problem with the drug at some point in their lives, according to the RCPsych.\n\nThe drug’s increasing potency in the market has significantly increased the risk of it causing psychosis and other harms, agrees Sir Robin Murray, professor of psychiatric research at King’s College London.\n\n“People need to know that cannabis, particularly modern cannabis, is a risky drug to take every day … Probably a couple of joints at the weekend is not going to do you much harm, but certainly daily cannabis carries an increased risk. If you take skunk-like cannabis every day, you’re about nine or 10 times more likely to go psychotic.”\n\nFinch broadly rejects the suggestion that cannabis is a gateway drug to stronger substances, however: “For some people, it might be part of a pattern of overall illicit drug use but I don’t think that’s necessarily the case. For many people, it isn’t.”\n\nThe UK is increasingly an outlier\n\nPerhaps the most striking thing about Britain’s agonised discussions of its drug laws is the degree to which the country is increasingly an international outlier.\n\nIn recent years, Portugal, South Africa, and Luxembourg, the Australian Capital Territory and many states in the US are among places to have partially decriminalised or fully legalised recreational cannabis use and, in some cases, permitted the development of a new, entirely legal market.\n\n“Cannabis is a commodity, it is circulated in markets and has a supply chain,” said Toby Seddon, professor of social science at University College London, who has researched international models of regulation and advised Khan’s commission.\n\n“The question we have as societies is: how do you want to regulate this? For the last 100 years, we’ve regulated it through using the criminal law. And we’ve observed how that’s worked and not worked.\n\n“If you prohibit something, you’re trying to reduce it to as close to zero as possible. And that manifestly hasn’t worked because it’s still really easy under prohibition to get hold of cannabis.”\n\nWhich has led many other countries to try another way. Non-medical cannabis is legal in Canada, where the federal government controls production licences but each territory can decide how it manages its sale.\n\nIn Uruguay, the first country to legalise cannabis sales in 2013 to counter drug-related crime, there is a state-run, not-for-profit model, in which the government issues licences, sets prices and oversees the potency of products.\n\nGermany legislated last year to permit individual consumption and cultivation, though critics say its implementation has been hampered by red tape. A similar critique has also been levelled in New York, where recreational marijuana use was legalised in 2021.\n\nFor a measure of how far apart the UK and US are on this issue, it is striking to recall that Kamala Harris, three weeks before last year’s presidential election, pledged to fully legalise recreational marijuana at the federal level if elected; Donald Trump too has said he would support the measure in Florida.\n\nAny move towards that position in Britain, let alone Seddon’s suggestion that the UK should nationalise cannabis production and control its sale as a state-run enterprise, seems inconceivable at present, as he acknowledged. As a result of that, he said, “you might think, this [report] is just a waste of time.\n\n“But you could also make a case that these things, in the long run, contribute to turning the dial a little bit,” he added.\n\nA similar critique, Seddon pointed out, was made of a major study in Canada in the 1970s that recommended legalising personal use and was largely ignored by the then prime minister, Pierre Trudeau. Decades later, his son Justin steered a similar measure into law.","summary":"Almost 25 years after an experiment was ditched to caution rather than arrest those carrying small amounts of the drug, a rethink is on the cards – but the British government remains cautious\n\nThe last time London dabbled in decriminalising cannabis, it brought one part of the capital to a brief but giddy high. In 2001, an enterprising Scotland Yard borough commander empowered his officers in Lambeth to caution rather than arrest those carrying small amounts of the drug for personal use – freeing them, according to the scheme’s proponents, to concentrate on more serious crimes.\n\nThe softly-softly approach was controversial in some political and policing quarters, but wildly popular in the borough – and some of its results were dramatic. Over six months, more than 2,500 hours of police officers’ time were saved on processing cannabis arrests, while arrests for dealing class A drugs rose by almost a fifth.\n\n Continue reading...","url":"https://www.theguardian.com/news/ng-interactive/2025/may/31/worried-about-weed-should-london-follow-new-york-and-decriminalise-cannabis","image":"https://i.guim.co.uk/img/media/032c2ab1779ff94e21206294dc8b239e8cb9e5df/3_739_1961_1568/master/1961.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-05-31 05:00:39","author":"Esther Addley","authors":["Esther Addley"],"language":"en","category":"politics","source_country":"gb","sentiment":0.092},{"id":326644010,"title":"K-pop and breakdance power South Korea’s high-stakes presidential race","text":"In South Korea’s high-stakes presidential campaign, K-pop isn’t just a cultural backdrop — it’s a political strategy.Both major parties are leaning on Korean pop hits to energize voters, blending choreography and catchy lyrics with political messaging. Among the favorites at campaign rallies: Kim Jong-kook’s Lovable and Young Tak’s Next Door Oppa, are now fixtures in events across the country.But unlike the last U.S. presidential election, where Kamala Harris secured endorsements from Beyonce and Taylor Swift, South Korean artists have shied away from direct campaigning, which risks alienating fans.","summary":"Both major parties are leaning on Korean pop hits to energize voters, blending choreography and catchy lyrics with political messaging.","url":"https://www.japantimes.co.jp/news/2025/05/31/asia-pacific/politics/south-korea-kpop-political-strategy/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/05/31/472498.jpg?v=3.1","video":null,"publish_date":"2025-05-31 01:44:00","author":"Sohee Kim,Web Master","authors":["Sohee Kim","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":0.518},{"id":326643808,"title":"Most Accurate Pollster Finds New Lead 2028 Democratic Candidate","text":"American pollster AtlasIntel found in its most recent survey that former Secretary of Transportation Pete Buttigieg is leading the pack for the 2028 Democratic presidential nomination.Newsweek reached out to Buttigieg's talent agency via email outside normal business hours and to former vice president Kamala Harris via online form.Why It MattersThe veteran pollster and election analyst Nate Silver touted AtlasIntel as \"top-rated\" and the most accurate pollster of the 2024 presidential election.This month's survey from AtlasIntel comes as the Democratic Party has drawn criticism for lacking a clear message following Harris's loss to President Donald Trump in November.The party's lack of direction has led to a number of high-profile clashes between its more progressive members and establishment leaders heading into the 2026 midterm elections.What To KnowThe AtlasIntel poll surveyed a total of 3,469 U.S. adults and was conducted from May 21 to May 27 and had a margin or error of plus or minus 2 percentage points.Among those who identified as Democrats, 31.5 percent ranked Buttigieg as their top choice for the 2028 Democratic presidential nomination.New York Representative Alexandria Ocasio-Cortez, one of the most progressive members of the party, came in second place with 19.4 percent and Harris ranked third with 16.6 percent of the vote.Other top candidates included Senator Cory Booker of New Jersey (10.4 percent), California Governor Gavin Newsom (7.1 percent), Pennsylvania Governor Josh Shapiro (4.8 percent) and Michigan Governor Gretchen Whitmer (3.7 percent).Among Republican voters, 37.3 percent said they would want Vice President JD Vance to be the party's 2028 presidential nominee, followed by State Secretary Marco Rubio at 18.7 percent.Donald Trump Jr. secured 8.8 percent of the vote and Florida Governor snagged 7 percent. But 15.6 percent of Republican voters said they would choose \"none of the above,\" according to the poll.When respondents were asked which party they would most likely vote for if the midterm elections were held today, 50.9 percent said they would pick a Democratic candidate and 41.7 percent said they would choose a Republican.Around 7.1 percent of respondents said they didn't know how they would vote, and 0.4 percent said they would not vote at all.What People Are SayingDuring a Substack Live Interview published on May 13, Pete Buttigieg said of a potential presidential bid: \"There are times I follow that process and decided to run, and there are times I followed that process and decided not to run — and the process can lead you to surprising places,\" adding that \"any kind of decision process there is a long way off.\"Harris, speaking about her plans earlier this year while visiting sites impacted by the Los Angeles wildfires, said: \"My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them...I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground.\"What Happens NextCandidates are likely to wait until after the 2026 midterm elections to declare their intention to run, but speculation about the field of candidates will remain—and most likely ramp up—in the months ahead.","summary":"AtlasIntel was the most accurate pollster in the 2024 election, according to veteran pollster Nate Silver.","url":"https://www.newsweek.com/most-accurate-pollster-atlantisintel-democratic-leader-2028-2079264","image":"https://d.newsweek.com/en/full/2654501/pete-buttigieg-kamala-harris-democrats.jpg","video":null,"publish_date":"2025-05-31 01:39:26","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.139},{"id":326743050,"title":"Does Kamala Harris care enough about Californias problems to run for governor&quest;","text":"The polls show Kamala Harris holds the approval of about 50 percent of California voters as she heads into a self-assigned summer of decision making about her political future.\n\nDoes the former vice president who lost last year’s election by just 1.6 percent of the popular vote want to give up on the possibility of succeeding Donald Trump as president? Is she ready to deal with all the detailed and complex issues that constantly confront any California governor? Can she raise the $100 million or so minimum needed to be a credible candidate for governor?\n\nThese are just some of the items on Harris’ mind as she disapprovingly watches Trump run the government in a confrontational manner completely foreign to her.\n\nBut she knows that if she does not run for president in 2028, she will forfeit any advantage she would possess as a barely beaten candidate last time out, one whose defeat now has many 2024 Trump voters feeling a bit of buyer’s remorse.\n\nShe also knows that if she goes for governor, she will have to promise to serve out a full term in that office should she win. Reneging on that pledge would likely doom her in any presidential primary election, tagging her as a non-promise keeper. But keeping such a pledge also takes her out of the 2028 presidential running.\n\nIt’s a rare quandary no previous California Democrat has faced. The huge question for Harris: Does she care enough about the details of California issues from electric vehicle mandates to Medi-Cal for the undocumented to give up on her national ambitions, at least for most of her 60s? (Harris will be 63 on Election Day 2026.)\n\nFor sure, Harris bears the image of a surfacy politician. Rivals also blame her for failing to disclose just how disabled ex-President Joe Biden became. Few can name salient achievements of either her six years as state attorney general or her four years as Biden’s No. 2.\n\nSome of those are substantial: During the fiscal crisis of 2009-2012, when many thousands of mortgages were threatened with foreclosure, she leveraged California’s sheer size to jump the state’s share of a 2012 national mortgage settlement up from an initial top offer of $4 billion to $18 billion, helping an unknown but large number of Californians evade foreclosure.\n\nBetween 2013 and 2015, her office recouped more than $1 billion for the state’s major public employee retirement funds after banks and rating agencies lied to greatly overvalue mortgage-backed securities.\n\nShe also secured a 2012 agreement with Apple, Google, Microsoft, Amazon and HP to require all apps they sell to display clear new privacy policies – and then she created a state privacy enforcement unit to seal that deal.\n\nHer record was less noteworthy as vice president, partly because Biden assigned her impossible tasks, like fixing conditions in Latin America that encourage illegal immigration. That assignment did not come with the power to make any improvements.\n\nSo the Harris image as a lightweight, promoted in part by her cackling responses in some interviews, can be misleading and other candidates for governor would be wise not to underestimate her.\n\nNo one really knows, perhaps not even Harris. That’s what makes this question so vital in a campaign where other candidates like former Los Angeles Mayor Antonio Villaraigosa and former state Atty. Gen. and federal Health Secretary Xavier Becerra are known for their strong interest in taking on major issues. Candidates like former state Senate President Toni Atkins and former state Controller Betty Yee are similarly known for strong focus.\n\nIf Harris runs and debates them all, plus Republicans Steve Hilton and Chad Bianco, they will surely be trying to paint her as the lightweight of her reputation and not the accomplished politician of her reality.\n\nWhich makes running a big risk for Harris, who could lose out as a major national player if she enters this race, regardless of whether she wins or loses.\n\nEmail Thomas Elias at tdelias@aol.com.","summary":"Does Kamala Harris care enough about Californias problems to run for governor&quest;","url":"https://www.presstelegram.com/2025/05/30/does-kamala-harris-care-enough-about-californias-problems-to-run-for-governor/","image":"https://www.presstelegram.com/wp-content/uploads/2024/11/AP24311777031117-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-31 00:32:05","author":"Thomas D. Elias","authors":["Thomas D. Elias"],"language":"en","category":"politics","source_country":"au","sentiment":-0.028},{"id":326653982,"title":"We don’t win when we are seen as the elite","text":"When I wrote “Yes, progressive buzzwords are killing us,” I expected to get nuked. I pictured myself donning a metaphorical hazmat suit before readers blasted me to kingdom come. And yes, some people took their shots.\n\nBut surprisingly, the response was productive, with more than 1,000 comments—and counting. Most practical progressives instinctively understand that language matters in politics. And we suck at it.\n\nThe data confirms what our ears are already telling us: We’ve become the party of the elite, and the 2024 exit polls make that clear. Democratic nominee Kamala Harris won wealthier voters who make $100,000 and above by 51-47%, but lost those earning less than that by the exact same margin. She won college grads 56-42%, but lost non-college-educated voters 56-43%. And of course, income and education are tightly correlated.\n\nBeing the elite, we speak like elites—using abstract language, lofty ideas, and big words that don’t land outside our bubble.\n\nRelated| Yes, progressive buzzwords are killing us\n\nHistorically, civilizations have created art, culture, and philosophy after they achieved safety, peace, and prosperity. No one paints oil portraits or writes treatises when they’re starving or dodging bullets.\n\nRepublicans understand this instinctively. That’s why Donald Trump ditched Ronald Reagan’s “shining city upon a hill” optimism and replaced it with doom and fear. Trump’s message: America is collapsing. Immigrants want to murder you. Liberals want to destroy your family. The world is cheating you. And trans people are endangering your kids.\n\nJust look at Trump’s unhinged Memorial Day message: “JUDGES WHO ARE ON A MISSION TO KEEP MURDERERS, DRUG DEALERS, RAPISTS, GANG MEMBERS, AND RELEASED PRISONERS FROM ALL OVER THE WORLD, IN OUR COUNTRY SO THEY CAN ROB, MURDER, AND RAPE AGAIN.”\n\nSubtlety isn’t his thing.\n\nTrump’s message is all about danger. You’re physically in danger—because Black and brown people are going to kill you. You’re economically in danger—because “globalists” (i.e. Jews) and immigrants are cheating you. You’re culturally in danger—because trans people are coming for your children.\n\nSecurity isn’t a luxury: It’s as fundamental as food, water, and shelter. And Trump taps into that primal fear so effectively that he’s peeled off major parts of our traditional base: lower-income voters of color and the organized labor movement.\n\nIn an excellent comment on that last piece of mine, qazplm wrote:\n\nWhy are we wasting time trying to get people to learn new words?\nFor fucks sake, the average voter turns their attention span our way for an infinitesimal span of time, we don't have time to waste on acronyms or words that get activists excited but no one else.\n\nAnd we also don't have time to waste on fringe issues that affect a percent of a percent of the population. How we got so associated with trans-athletes as some sort of critical part of our identity I have no idea.\n\nWe are so afraid to offend, or in the slightest way signal negatively to so many disparate groups that we stopped being the party of the poor and middle class in the minds of voters.\n\nTalk about the economy, and ONLY the economy going forward. Hispanics voters, Black voters, LGBTQ voters, women, young people, they ALREADY know we are better on those various social issues.\n\nWe need to keep redirecting the conversation to jobs, wages, healthcare, housing, all the things that cut across every demographic.\n\nTrump’s most effective ad during the 2024 presidential race was simple: It showed Harris talking about access to gender-affirming surgery for prison inmates. \n\nYet the ad wasn’t effective because of transphobia, as polling shows that Americans are generally supportive of the trans community. A 2022 Pew poll found that 64% of those surveyed supported protecting trans people from discrimination, with just 10% opposing. \n\nThe problem with the ad was the perception it created—real or not—that Democrats care more about niche issues than the average American’s economic situation. \n\nWhile inflation crushed voters and grocery prices spiked, Republicans painted Harris as someone more concerned about trans prisoners than working families. When Harris affirmed her support, voters didn’t hear nuance. They heard: “Democrats want to use your tax dollars for sex-change operations for criminals—and you can’t even afford eggs.”\n\nAnd the damage wasn’t just electoral. Instead of having a champion in the White House, trans Americans are now grappling with a dangerously hostile second Trump presidency.\n\nAccording to the exit polls, Trump won those who said that inflation had caused them “severe hardship” by a whopping 76-23% margin. He also won those suffering “moderate hardship” 52-46%. Being the party of the elite, Harris won those suffering “no hardship” 78-21%. As former Daily Kos writer Kerry Eleveld once said during a podcast, “Democrats are the party of people who don’t have to look at grocery prices while shopping.” \n\nThat’s a branding problem.\n\nMore voters of color voted Republican in 2024 not because they’ve abandoned progressive values, but because they’re getting crushed economically—and Trump, speaking at a fourth-grade level, told them what they wanted to hear: “I’ll make stuff cheaper.” It was a lie. But it was simple, and they understood it. Meanwhile, our side was telling the truth in activist-speak.\n\nIt was the same with young voters, who went from 60-36% Democratic in 2020 to 54-43% in 2024. And can you blame them?\n\nCollege is unaffordable. Student loans are suffocating. Owning a home is now an out-of-reach fantasy for most. According to Bankrate, you need to earn $117,000 to afford the average American home. Young people with lower earnings and no assets feel the weight of inflation more than anyone.\n\nThe most successful Democrats have always understood this dynamic—and distanced themselves from political silo issues.\n\nRelated | This group of Trump voters will piss you off—and give you hope\n\nPresident Bill Clinton had his “Sister Souljah moment.” Then-Illinois-state Sen. Barack Obama built his 2004 Democratic convention speech around unity with this memorable declaration: “There’s not a liberal America and a conservative America; there’s the United States of America. There’s not a black America and white America and Latino America and Asian America; there’s the United States of America.” \n\nBeloved former first lady Michelle Obama carefully avoids culture war flashpoints. Former President Joe Biden built his brand on foreign policy and working-class relatability—not progressive campus discourse.\n\nAs a party, we need to stop running campaigns that win over the local Democratic committee potluck and start running campaigns that win a national electorate.\n\nBecause no one will care about our most important causes—whether it’s trans rights, climate change, racial justice, or reproductive freedom—if we can’t get into power in the first place.\n\nTalk about lower prices. Talk about good jobs. Talk about housing, health care, and education. Talk about the economy working for everyone—not just a few billionaires.\n\nAnd then say it in plain English.","summary":"When I wrote “Yes, progressive buzzwords are killing us,” I expected to get nuked. I pictured myself donning a metaphorical hazmat suit before readers blasted me to kingdom come. And yes, some people took their shots.\n\n\n\nBut surprisingly, the response was productive, with more than 1,000 comments—and counting. Most practical progressives instinctively understand that language matters in politics. And we suck at it.\n\n\n\nThe data confirms what our ears are already telling us: We’ve become the party of the elite, and the 2024 exit polls make that clear. Democratic nominee Kamala Harris won wealthier voters who make $100,000 and above by 51-47%, but lost those earning less than that by the exact same margin. She won college grads 56-42%, but lost non-college-educated voters 56-43%. And of course, income and education are tightly correlated.\n\n\n\nBeing the elite, we speak like elites—using abstract language, lofty ideas, and big words that don’t land outside our bubble.\n\n\n\n\nRelated| Yes, progressive buzzwords are kil","url":"https://www.dailykos.com/story/2025/5/30/2325102/-We-don-t-win-when-we-are-seen-as-the-elite?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1438411/story_image/AP24210091567028.jpg?1748639059","video":null,"publish_date":"2025-05-31 00:01:06","author":"kos","authors":["kos"],"language":"en","source_country":"US","sentiment":-0.223},{"id":326631728,"title":"Disgraced Democrat Anthony Weiner roasts Kamala Harris for blowing up her campaign on ‘The View’","text":"Despite going to prison for a sex scandal involving minors, disgraced former congressman and former New York mayoral candidate Anthony Weiner said on Friday he can still do a better job than his Democratic colleagues did in the 2024 election. During an appearance on ABC's \"The View,\" Weiner explained that he is attempting to get back into politics by running for New York City Council because he believes, despite his baggage, that he’s a better politician than current Democratic figures. He also mocked former Vice President Kamala Harris, accusing her of ruining her 2024 presidential campaign while appearing on the same show. \"By the way, was this where Kamala Harris was sitting when she blew up her campaign?\" he asked as soon as he took his seat between the four co-hosts. ANTHONY WEINER SAYS VOTERS DON'T WANT WHAT 'DEMOCRATS ARE SELLING,' TALKS ABOUT COMEBACK AS FIERY CENTRIST \"Is this the spot?\" Weiner asked, gesturing to his chair. \"I hope I don’t have the same fate.\" Harris told \"The View\" last year that there \"is not a thing that comes to mind\" when asked what she would have done differently than then-President Biden. The moment was widely seen as a turning point that led to the downfall of her campaign. Later in the interview, Weiner hit Harris again. He responded to co-host Joy Behar’s suggestion that even though men like Weiner and President Donald Trump have problematic pasts, a woman like the former vice president still can’t make it to the highest office. Though the aspiring city council member admitted female politicians are often judged harshly, he maintained that Harris made an obvious blunder in response to \"The View’s\" \"softball\" question last year. \"The problem is, it’s a little bit too easy an answer, though, because also there were things that Kamala Harris – I made a joking reference to the answer she gave on this show: ‘Is there anything you would do different?’ That is the softest of softball that – every politician dreams to have that question,\" Weiner replied. \"You still have to be a good candidate.\" Harris did not immediately respond to a request for comment from Fox News Digital. TAPPER ADMITS FEELING 'HUMILITY' ABOUT PAST BIDEN COVERAGE AS LIBERALS DISPARAGE NEW BOOK Weiner left Congress in 2011 following a photo of the married then-congressman leaking on one of his social media accounts. Additional sex scandals mounted in the following years, culminating in an FBI investigation that led to Weiner serving 21 months in prison and registering as a sex offender after sending sexually explicit images to a minor. After his dig toward Harris at the top of the segment, Behar pressed Weiner on why he believes he can get back into politics considering his scandal-plagued background. The aspiring city councilman said it’s because he believes he’s a better politician than many current Democratic lawmakers. \"I think what I said at the time was I couldn’t imagine there would ever be a chance that either people would want me back or that I would want to get back into that again,\" he replied. \"But when I woke up in November of ’24 and saw the election results, but more than who won, I looked around New York City and saw how many fewer Democrats even turned out to vote. And I started to say to myself, ‘Something is seriously wrong here.’\" Weiner said too many Democratic candidates were running \"frictionless\" campaigns and playing it too safe. He told the co-hosts that he felt compelled to jump back into politics because his contemporaries were not answering the public’s \"cry that they wanted things to change.\" He added that his past was not a \"good enough reason… not to get off the couch and try.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Co-host Ana Navarro pressed him on his specific scandals, asking, \"Why should New Yorkers give you a chance at a political comeback?\" He replied, \"I’m doing the opposite of what a lot of politicians do in my position – ignore that problem, pretend it didn’t happen, blame someone else. I am saying, yes, I did these things. I got into recovery. I tried to make my life better. And now, if I can be of service – and I’m a damn good politician. I come up with answers, I talk to people directly, I don’t try to butter over things, I try to be direct.\" CLICK HERE TO GET THE FOX NEWS APP \"Look, all I can ever be is who I am right now and that brought me to this space,\" Weiner added.","summary":"During &quot;The View&quot; on Friday, disgraced former Congressman Anthony Weiner argued he can do a better job than current Democratic politicians, despite his scandalous history.","url":"https://www.foxnews.com/media/disgraced-democrat-anthony-weiner-roasts-kamala-harris-blowing-up-her-campaign-the-view","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/anthony-weiner-kamala-harris-split.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-31 00:00:37","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","category":"politics","source_country":"US","sentiment":-0.35},{"id":326642154,"title":"U.S. Steel Is a Major Source of Pollution in Pennsylvania. Will Its Sale Lock in Emissions for Another Generation?","text":"President Donald Trump returned to western Pennsylvania Friday to announce an ending to the months-long saga to decide who would own the Pittsburgh-based steelmaking company U.S. Steel. \n\nBut even as the deal moves toward a resolution, questions about what it will mean for public health, local economies and climate change linger. U.S. Steel’s coal-based steelmaking facilities are a major source of air pollution and greenhouse gas emissions in Pennsylvania.\n\nNippon Steel of Japan agreed to buy the iconic American company for $15 billion in 2023. In 2024, the sale was opposed by former President Joe Biden and by Trump. Trump said that he was “totally against” the sale and vowed to “block this deal from happening” as president.\n\nNow, Trump has changed his mind. \n\nSpeaking at U.S. Steel’s Irvin Works in West Mifflin, Trump said he was there to celebrate a “blockbuster agreement” with Nippon. He added that he will double tariffs on steel imports from 25 percent to 50 percent. The increase would “further secure the steel industry in the United States,” he said. “Nobody is going to get around that.”\n\n“We saved the company,” Trump added. His speech was short on details about the structure of the deal or Nippon’s investments in U.S. Steel’s facilities, and much remains unknown.\n\nOn May 23, Trump announced on Truth Social that he had approved the sale, calling it a “planned partnership” between U.S. Steel and Nippon that would add “$14 billion to the U.S. economy.” The deal had been held up by a national security review carried out by the Committee on Foreign Investment in the U.S. \n\nU.S. Steel praised Trump and said the company will “remain American” and “will grow bigger and stronger through a partnership with Nippon Steel that brings massive investment, new technologies and thousands of jobs over the next four years.” \n\nIn an interview with CNBC, U.S. Sen. Dave McCormick (R-Pa.) said the U.S. government would have a “golden share” that “will essentially require U.S. government approval of a number of the board members” and that $2.4 billion would be invested in the Mon Valley Works, U.S. Steel’s four facilities in western Pennsylvania. \n\nTrump’s reversal comes at the same time that his administration is pushing for more coal power, and after he signed an executive order called “Reinvigorating America’s Beautiful Clean Coal Industry.” The Department of Energy recently designated coal used in steelmaking as a “critical material.” Energy Secretary Chris Wright said coal is “a cornerstone of our industrial base” and a “key input for steel production.”\n\nBut that’s at odds with the current reality of American steel manufacturing. Less than a third of steel in the U.S. is still made using coal. The majority of American steel is made in electric arc furnaces using recycled scrap steel and natural gas. \n\nOn Friday, Trump said U.S. Steel will “maintain all of its current operating blast furnaces at full capacity for a minimum of the next 10 years.” \n\n“We have that as a commitment,” he said.\n\nOlder blast furnaces, like those at the U.S. Steel-owned Edgar Thomson steel mill in western Pennsylvania, are powered by coke, a concentrated and highly polluting form of coal. The Mon Valley Works plants, the oldest of which opened in 1875, include the Clairton Coke Works, which makes coke from coal.\n\n“Most of the new mills, including U.S. Steel’s new mill in Arkansas, they’re not dependent upon coal, and that’s the worldwide trend,” said Matt Mehalik, the executive director at the Pennsylvania-based environmental nonprofit Breathe Project. “So a coal-based manufacturing policy is really a backwards-looking one. It’s sort of like saying, in 1903, ‘Steam engines are important, too. Why would we switch to a gasoline engine?’” \n\nIf Nippon spends money to keep U.S. Steel’s aging facilities in Pennsylvania and Indiana dependent on coal for another generation, that decision could have long-term negative consequences for workers and residents.\n\nCoal-based steelmaking is linked to serious health problems like cancer for people living nearby. In Pennsylvania, residents living in the shadow of U.S. Steel’s plants have contended with air pollution caused by their operations for generations. The company also has a long history of permit violations and financial penalties. In 2024, U.S. Steel agreed to a $42 million settlement related to faulty pollution control systems at the Clairton Coke Works. \n\nU.S. Steel did not respond to a request for comment for this story but has maintained that it is committed to “safe and environmentally responsible steelmaking.”\n\nThe deal also has significant climate implications, said Mike Williams, a senior fellow at the Center for American Progress who works on climate policy and labor issues. Steel manufacturing is a substantial contributor to the climate crisis globally. “It’s really, really, really important that we get this right,” he said, of the need to decarbonize the industry.\n\nNeither company has a good track record on climate, he said. And the involvement of the Trump administration in U.S. Steel’s decision-making could “portend very poorly” when it comes to modernizing the American steel industry.\n\n“This administration has such an animus towards anything that fights climate change,” he said. “That’s terrible for the future competitiveness of our industries.” \n\nIf Nippon commits to coal, Williams said, it may save some jobs in the short term. But “there’s a strong chance they’re going to be just outstripped in terms of competitiveness” in the global market. Doubling down on coal in steelmaking “doesn’t particularly make sense” economically or environmentally, he said.\n\nA website Nippon created to highlight the benefits of the U.S. Steel deal says the sale will drive the “global steel industry toward carbon neutrality and our shared commitment of decarbonization by 2050.”\n\nThe Mon Valley is familiar with promises to invest in its declining steelmaking infrastructure. Those promises have rarely panned out.\n\n“This timeline goes all the way back to the 1970s,” Mehalik said, of a Breathe Project initiative to chronicle each of U.S. Steel’s pledges that failed to materialize. “It’s almost like every five years they promise to do something, and then they don’t.” In 2019, U.S. Steel said it would spend more than $1 billion to upgrade the Mon Valley Works. Two years later, the project was canceled.\n\nU.S. Steel’s workers have similar fears about Nippon’s and the administration’s promises of more investment and jobs. The United Steelworkers union endorsed Kamala Harris for president and has long opposed the sale of U.S. Steel to Nippon. \n\nIn his speech on Friday, Trump said “there will be no layoffs and no outsourcing” and said workers would each receive a $5,000 bonus. The deal “includes vital protections to ensure that all steelworkers will keep their jobs at all facilities in the United States,” he said. \n\nThe union continued to express opposition to the deal this week. “Our concern remains that Nippon, a foreign corporation with a long and proven track record of violating our trade laws, will further erode domestic steelmaking capacity and jeopardize thousands of good, union jobs,” said David McCall, the president of USW, in a statement on Tuesday.\n\nU.S. Steel’s workforce has shrunk from hundreds of thousands of workers in its 20th-century heyday to around 22,000 today.\n\nRoger Smith, Asia lead at SteelWatch, a nonprofit focused on the decarbonization of the steel industry, said that Nippon could choose to invest in cutting-edge green steelmaking technology to dramatically lower pollution and cut emissions. “Nippon Steel could bring U.S. Steel workers certainty and hope for the future,” he said.\n\nSmith said the global trend away from coal-based steelmaking will ultimately override the Trump administration’s “protectionist agenda for coal and its anti-renewable energy actions.”\n\n“The question is really not whether the steel industry will decarbonize but how quickly,” he said. \n\nBut the Trump administration and Nippon could slow down that transition in the U.S. at a critical time. Nippon “has a paper commitment to achieve net zero emissions, but remains committed to existing coal-based blast furnaces in Japan, building new ones through its joint venture in India and continues to acquire shares in coal mines,” Smith said. “If Nippon Steel extends this thinking to U.S. Steel, it could entrench coal for another generation.”","summary":"President Donald Trump returned to western Pennsylvania Friday to announce an ending to the months-long saga to decide who would own the Pittsburgh-based steelmaking company U.S. Steel.&#160; But even as the deal moves toward a resolution, questions about what it will mean for public health, local economies and climate change linger. U.S. Steel’s coal-based steelmaking [&#8230;]","url":"https://insideclimatenews.org/news/30052025/trump-celebrates-japan-nippon-us-steel-deal-pennsylvania-pollution/","image":"https://insideclimatenews.org/wp-content/uploads/2025/05/GettyImages-2217152392-1024x683.jpg","video":null,"publish_date":"2025-05-30 23:30:58","author":"By Kiley Bense,Lisa Sorg","authors":["By Kiley Bense","Lisa Sorg"],"language":"en","source_country":"us","sentiment":-0.024},{"id":326629702,"title":"California Senate Launches Paramount-Trump Settlement Talks Investigation, Invites Bill Owens and Wendy McMahon to Testify","text":"The California State Senate has launched an investigation into Paramount Global’s ongoing discussions with President Donald Trump to settle his $20 billion lawsuit against CBS.\n\nIn a Friday letter, the state’s lawmakers invited former “60 Minutes” executive producer Bill Owens and former CBS News president Wendy McMahon to testify as part of an investigation into Paramount’s settlement discussions with President Donald Trump over his $20 billion lawsuit against the program’s Oct. 7 interview with former vice president Kamala Harris.\n\n“Your recent resignations from CBS’s leadership, amid public reports of internal concern about the editorial and ethical implications of the proposed settlement, suggest that you may possess important, first-hand knowledge relevant to our legislative oversight responsibilities,” the joint letter from its Energy, Utilities & Communications committee chair Josh Becker and Judiciary committee chair Thomas Umberg states. “If Paramount is entertaining a settlement primarily to secure favorable regulatory treatment, this raises deeply troubling implications not just for journalism, but for the rule of law and the integrity of corporate governance.”\n\nThe committees are seeking information from the pair on whether newsroom staff raised internal objections to the settlement or its motivations, whether any editorial decisions were impacted or overridden, whether internal counsel or leadership acknowledged the weakness of the lawsuit’s claims and whether anyone within the company indicated that the settlement may be “advantageous or necessary” in order to influence the regulatory review of the pending $8 billion Skydance merger.\n\nThe lawmakers argue that a settlement to clear regulatory approval of the Skydance deal could constitute a violation of federal anti-bribery laws, an infraction of California’s unfair competition law, a breach of fiduciary duties owed by Paramount board members to shareholders and the misuse of corporate funds vulnerable to shareholder derivative litigation.\n\n“These issues go beyond internal policy,” the letter states. “They have real legal exposure for Paramount and its board of directors, including Ms. Shari Redstone, Ms. Barbara Byrne, Ms. Judith McHale, Ms. Linda Griego, and Ms. Susan Schuman.”\n\nThey also said it could have a “potential chilling effect” on investigative and political journalism, signaling “politically motivated lawsuits can succeed when paired with regulatory threats.”\n\n“It would damage public trust in CBS News and other California-based outlets, diminishing the state’s stature as a national leader in ethical journalism. Paramount’s capitulation would also undermine two essential pillars of a liberal democracy: a free press and an impartial, rule-of-law regulatory system,” the letter continues.\n\nThe California State Senate noted that while the invite is a voluntary request, they retain full subpoena authority under California law should additional testimony or documentation become necessary during its investigation.\n\n“We respectfully encourage you to participate in this important hearing,” the letter concluded. “Your cooperation will help safeguard the values you have each worked to uphold in your distinguished careers.”\n\nRepresentatives for Paramount declined to comment on the letter. \n\nOwens resigned from “60 Minutes” in April, telling staff in a memo that he lost the ability to make independent decisions as the network. Meanwhile, McMahon resigned earlier this month, saying in a memo to staff that “it’s become clear the company and I do not agree on the path forward.” She described the tension between herself and Paramount as “challenging.” \n\nThough neither referenced the Trump lawsuit directly, both executives had previously expressed opposition to a settlement. \n\nThe lawsuit takes aim at the news program’s Oct. 7 interview with former Vice President Kamala Harris, which Trump has said was deceptively edited to make her look good. \n\nCBS News has maintained that Trump’s accusations of deceitful editing were false, explaining that the promo shown on “Face the Nation” used a longer section of Harris’ answer. It also turned over the transcript and camera footage from the interview to the FCC as part of the agency’s investigation into allegations of “news distortion.” In a March filing to dismiss the Trump suit, CBS called it “an affront to the First Amendment” and “without basis in law or fact.”\n\nIn a Wednesday legal filing asking the court to deny Paramount’s motion to dismiss, Trump’s attorneys claimed that the interview caused him “mental anguish and confusion.” They also said that “viewers withheld attention from President Trump and Truth Social,” his social media platform, due to the “false advertising and tampering” tied to the Harris interview, resulting in a decrease in value for Trump Media and Technology Group and his other media holdings.\n\nThe Wall Street Journal reported that Trump recently shot down Paramount’s offer to settle the lawsuit for $15 million, with the president aiming to get at least $25 million and an apology.\n\nThe Paramount-Skydance merger, which is subject to regulatory approval from the FCC due to a required transfer of broadcast licenses of Paramount’s 28 owned-and-operated local TV stations, recently triggered its first automatic 90-day extension after failing to close by April 7.\n\nFCC chairman Brendan Carr has argued that the settlement talks with Trump are unrelated to the agency’s review of the Skydance deal. But he has warned that “all options remain on the table” in the agency’s ongoing investigation into alleged “news distortion,” including potentially revoking CBS’ broadcast license if the network is found to have violated the agency’s public interest standard. \n\nHe has also previously threatened to block M&A for companies who embrace diversity, equity and inclusion (DEI) policies and is reportedly seeking concessions in the Paramount-Skydance deal.\n\nParamount’s settlement talks come as Disney previously paid $15 million to settle a defamation lawsuit Donald Trump brought against ABC News and star anchor George Stephanopoulos. Meta also paid $25 million to settle Trump’s lawsuit about being kicked off Facebook and Instagram after the attack on the Capitol on Jan. 6, 2021.","summary":"The lawmakers argue settling the $20 billion lawsuit to clear regulatory approval of the pending $8 billion Skydance merger could violate federal anti-bribery laws and the state's unfair competition law \n\n\nThe post California Senate Launches Paramount-Trump Settlement Talks Investigation, Invites Bill Owens and Wendy McMahon to Testify appeared first on TheWrap.","url":"https://www.thewrap.com/california-state-senate-bill-owens-wendy-mcmahon-paramount-trump-settlement-talk-investigation/","image":"https://www.thewrap.com/wp-content/uploads/2025/05/Owens-McMahon.png","video":null,"publish_date":"2025-05-30 23:06:10","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","source_country":"US","sentiment":0.346},{"id":326622690,"title":"The corrupt coverup of Biden’s decline: Letters to the Editor — May 31, 2025","text":"The Issue: The media and President Joe Biden’s handlers’ role in the coverup of his mental decline.\n\nSome White House reporters still do not get it (“The Biggest Biden-Coverup Question,” Editorial, May 28).\n\nThe policies of former President Joe Biden are not the issue; it’s whether he gave the orders or we had unelected people running the country.\n\nYou do not have to be a reporter to think: Hey, this is a big deal. \n\nMaybe I should find out who the real president is.\n\nFrank Barnett\n\nThe liberal networks continue to lie and make stories up even after being caught over and over again.\n\nThey are part of the Democratic Party and will do or say anything to protect them.\n\nI believe most people would quit their jobs if they were told to keep lying, so what kind of people are working for left-leaning media?\n\nRemember, reporters and newscasters: The truth will set you free.\n\nCharlie Yannelli\n\nBarnegat, NJ\n\nThe fact that the media helped hide the truth about Biden should surprise no one.\n\nThe same crowd pushed the liberal agenda and talking points about COVID. \n\nWe were bombarded with ads urging us to get vaccinated, and those who did not get it were deemed evil.\n\nThen, after helping hide Biden during his basement campaign, co-conspirators tried to hide him during his presidency.\n\nTo top it all off, they tried to push Kamala Harris through as a worthy presidential candidate. \n\nIf she had won, none of this would have come out.\n\nRecent reporting, including Jake Tapper and Alex Thompson’s new book, “Original Sin,” reveals serious concerns about Biden’s cognitive decline and a deliberate effort to conceal it. But this isn’t just a Democratic issue.\n\nPresident Trump has repeatedly refused to release results from his medical exams, raising red flags of his own. \n\nUnder his administration, there have been clear signs of deep-seated corruption.\n\nThe absence of age and health standards for our highest offices is a larger, bipartisan problem.\n\nLeadership should serve the country’s future — not cling to the past.\n\nJagjit Singh\n\nLos Altos, Calif.\n\nWe are now discovering from a variety of sources that Biden was being manipulated by a group of unelected officials.\n\nThis demands an immediate congressional hearing and creating laws to prevent it from happening again.\n\nEd Houlihan\n\nRidgewood, NJ\n\nDemocrats and the media both lied to cover up Biden’s obvious medical problems. \n\nThey created the current “credibility crisis” by lying instead of using common sense.\n\nDaniel Robinowitz\n\nDallas, Texas\n\nThe Issue: President Trump’s pardon of reality stars and convicted tax-evaders Todd and Julie Chrisley.\n\nPresident Trump abuses his pardon power (“Reality TV ‘crooks’ walk free,” May 29).\n\nWhether you are a reality-show tax cheat, a crooked law-enforcement officer or a violent Proud Boy, you are eligible for a pardon — as long as you are white and have money to pay Trump.\n\nThe Republican Party just sits quietly, and publications like the New York Post continue to praise this convicted felon.\n\nKreg Ramone\n\nAs a faithful Trump supporter, I am curious as to why Todd and Julie Chrisley were pardoned after being accused of tax evasion and bank fraud.\n\nLeopards don’t change their spots, but I hope the Chrisleys have mended their ways.\n\nHowever, I see they are coming out with another reality program; that didn’t take long. \n\nWho are these folks?\n\nDonna Goddard\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss the media and President Joe Biden’s handlers’ role in the coverup of his mental decline.","url":"https://nypost.com/2025/05/30/opinion/the-corrupt-coverup-of-bidens-decline-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/RC2GSEAGTDU4-803767361-3-e1748635035115.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-30 23:04:53","author":"Post Readers","authors":["Post Readers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.341},{"id":326622776,"title":"Defence Secretary announces money to upgrade housing for military families","text":"Hereford TimesFive helicopters spotted flying near SAS campFive helicopters have been spotted over a Herefordshire village, which is home to an SAS base.\n\nBirmingham LiveKeir Starmer makes huge winter fuel payment statement – have your sayThe controversial cuts to energy payments for pensioners is set to be softened\n\n Why this ad?Go ad-free* \n\nThe Daily BeastTrump Biographer: This Is the ‘Real Reason’ He Hates HarvardThere’s a running joke going around the White House that President Donald Trump is out for Harvard’s blood because his son Barron didn’t get in—one scotched by first lady Melania Trump in an unprecedented piercing of her veil of privacy. But presidential biographer Michael Wolff has suggested a very different explanation for Trump’s vendetta: that he’s the one that couldn’t attend the prestigious Ivy League school. Wolff, author of bestsellers Fire & Fury and this year’s All or Nothing, advanced\n\nHuffPostFormer Trump Lawyer Rips Karoline Leavitt With A New Nickname After She Lashed Out At Judges”I don’t think anybody in America really takes her seriously on a matter of substance,” former White House lawyer Ty Cobb said.\n\nPeopleDonald Trump Was Asked About Potentially Pardoning Diddy: Here's What He SaidThe president was asked during a White House press briefing\n\n Why this ad?Go ad-free* \n\nHuffPostDonald Trump’s Answer To Question About Elon Musk Has Everyone Pointing Out Same ThingThe president’s waffle missed one key ingredient.\n\nHuffPostLawrence O'Donnell Makes Bold Prediction For 'Irreversibly Stupid' Trump's Next Big LossThe MSNBC host warned the president that the next major court decision won't go his way.\n\nThe TelegraphRachel Reeves on course for £24bn tax raid, warns JP MorganRachel Reeves is on course to raise taxes by £24bn this autumn as she launches a fresh raid on working people to fund higher welfare spending.\n\n Why this ad?Go ad-free* \n\nThe Telegraph‘I feel like a stranger in my own town’A burly young man with blond hair and an Eastern European accent is towering over me and yelling with incandescent rage. Expletives are raining down on to my upturned face. I am a f---ing fascist. I am twisting the f---ing truth. He hopes something f---ing awful happens to me.\n\nHuffPostFox Host Hits Back At Trump Adviser's 'Rogue' Talk With Ice-Cold Reality CheckLiz Claman wasn't having it with Peter Navarro as he tried to dismiss a court's ruling on the president's trade policy.\n\nThe IndependentTaurus cruise missiles: Weapons Germany could be sending Ukraine to strike deep into RussiaGerman chancellor Friedrich Merz says it is possible Berlin will send the longe-range cruise missiles to Kyiv\n\n Why this ad?Go ad-free* \n\nYahoo News UKThe health conditions most at risk from the DWP's controversial PIP changesWith ministers reportedly looking at softening PIP benefits cuts, we take a look at what conditions are most likely to be affected.\n\nThe Daily BeastFed Chair Slaps Down Trump’s Demands to His FaceFederal Reserve Chair Jerome Powell threw cold water on President Donald Trump’s attempt to sway the Fed into cutting interest rates during a rare face-to-face meeting Thursday. Trump invited the Fed chair to the White House for their first meeting of his second term to ramp up the pressure on Powell to slash rates. But Powell—whom Trump has called a “major loser” for refusing to bend to his will—rebuffed him. According to a Fed statement, Powell told Trump that he will make monetary policy deci\n\nThe IndependentStarmer’s extraordinary attack on Farage shows what Labour is really worried aboutNEWS ANALYSIS : It is extraordinary that Keir Starmer, with a majority of 174, felt the need to attack the leader of a party with just five MPs less than a year after the general election, Political Editor David Maddox writes\n\n Why this ad?Go ad-free* \n\nVarietyTrump Lawyers Claim ‘60 Minutes’ Harris Interview Caused Him ‘Mental Anguish,’ Argue That the ‘First Amendment Is No Shield to News Distortion’ in Motion to Deny Paramount Bid to Dismiss LawsuitPresident Trump’s legal team filed an objection to Paramount Global’s move to dismiss his $20 billion lawsuit against CBS over a “60 Minutes” segment, arguing that the TV newsmagazine’s alleged deceptive editing of an interview with Kamala Harris is not protected by the First Amendment. Trump filed the lawsuit against CBS just days before the …\n\nHuffPostTrump’s Air Force One Debacle Leaves The U.S. With A Weaker Wartime Command PostBy inserting himself into the contracting process, Trump is saddling future presidents with a command platform lacking the ability to refuel in midair, a key feature.\n\nCNNTransgender athlete says adults going to her track competitions to heckle her ‘shows how you are as a person’If high school track standout A.B. Hernandez competes at the state championship, California’s federal funding may be in doubt. President Donald Trump has promised to cut the funds if the transgender teen is allowed to compete.\n\n Why this ad?Go ad-free* \n\nAFPFrance gives air base $1.7 billion nuclear faceliftIn a sign of the growing security nerves in Europe, France has embarked on a $1.7 billion renovation of an air base in remote hills in the east of the country so it can handle nuclear-armed bombers. Macron has also said that with the Russian invasion of Ukraine raging and heightening worries in the rest of Europe, France is ready to start discussing with other European countries the possible deployment of French nuclear-armed jets.\n\nReutersRussia tells UN West must stop arming Ukraine during any ceasefireUNITED NATIONS (Reuters) -Russia is prepared to consider a ceasefire in Ukraine to pave the way for a lasting settlement, but during any truce Moscow wants Western states to stop arming Kyiv and for Ukraine to stop mobilising troops, Russia's U.N. ambassador said on Friday. However, Vassily Nebenzia told the U.N. Security Council that a simple ceasefire was not enough to end Moscow's more than three-year war in Ukraine.\n\nRolling StoneSenator Dismisses Medicaid Cuts Killing People: ‘Well, We’re All Going to Die’Iowa Republican Joni Ernst got existential when constituents at a town hall confronted her about the cuts in the GOP’s tax bill","url":"https://uk.news.yahoo.com/defence-secretary-announces-money-upgrade-230130954.html","image":"https://s.yimg.com/ny/api/res/1.2/vozDmUz823KLMML2hQPwhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/video.thepressassociation.com/9dc452d9d11ceb482e7afeb044078ac4","video":"","publish_date":"2025-05-30 23:01:30","author":"Pa Media: Video","authors":["Pa Media: Video"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.152},{"id":326624730,"title":"Justin Bieber seeks VERY unlikely source of comfort amid marriage woes with Hailey... as he tries to heal huge childhood wound","text":"EXCLUSIVEJustin Bieber seeks VERY unlikely source of comfort amid marriage woes with Hailey... as he tries to heal huge childhood wound\n\nREAD MORE: Hailey and Justin Bieber are 'at each other's throats'\n\nBy STEVE HELLING FOR DAILYMAIL.COM\n\nPublished: 21:21 BST, 30 May 2025 | Updated: 23:37 BST, 30 May 2025\n\nJustin Bieber's increasingly bizarre and erratic behavior has sparked concerns not only for his marriage, but also his mental wellbeing.\n\nDespite the turbulence - from seemingly dissing his wife Hailey Bieber to apparent public drug use - the troubled singer has reportedly found himself leaning on an unlikely source of stability... his parents.\n\nFor years, the hitmaker has struggled in his relationships with his mother, Pattie Mallette, and father, Jeremy Bieber, who has been described as being largely absent throughout much of Justin's adolescence.\n\nBut now, the Daily Mail can reveal Justin, 31, is focusing on healing those complicated relationships - something his wife Hailey, 28, is slower to achieve with her own parents Stephen and Kennya Baldwin. \n\n'Justin loves his parents very much,' said a source close to Justin. 'He has a complex relationship with them, but there's still a lot of love there.'\n\nJustin Bieber is focusing on healing his complicated relationship with his parents (pictured playing golf with dad Jeremy last week)\n\nJeremy Bieber was just 18 when Justin, now 31, was born, and struggled with becoming a father so young\n\nThe Canadian star, who went golfing with his father Jeremy last week, has been open about his struggles with his dad, who reportedly battled with addiction and allegedly was in county jail on the day Justin was born.\n\nSpeaking to Billboard in 2015, Justin said that Jeremy, who was just 18 when he became a parent, wasn't ready for fatherhood. \n\n'He was immature,' the singer said. 'He left for like a year when I was about four, went to British Columbia, came back on Father's Day. I remember my mom said, \"If you're going to be here, you have to be here.\" There's a misconception that he's this deadbeat dad, but he has been in my life since. I was with him on weekends and Wednesdays.'\n\nJeremy is said to have introduced Justin to music and taught him how to drive, but was reportedly not always the perfect role model for the rising star. \n\nWhen Justin was arrested in Miami and charged with a DUI while street racing in 2014, it was allegedly Jeremy who had blocked off the streets for his son's joyride.\n\nBut according to our insider, Justin is finally at peace with his father, now 49. \n\n'He's worked through all the absenteeism and he now respects his father for the man who he is,' they said. 'They are good.'\n\nIt is understood that Justin also maintains relationships with his three half-siblings and one stepsister.\n\nAfter Justin was born, Jeremy fathered two children with his then-girlfriend Erin Wagner: daughter, Jazmyn, 16, and son, Jaxon, 14.\n\nWhy Justin Bieber keeps humiliating his wife Hailey with brutal public betrayals: CAROLINE BULLOCK\n\nAfter they split in 2014, Jeremy went on to date Chelsey Bieber and the pair tying the knot in 2018. Chelsey was already a mom to daughter, Allie, now 18, but she and Jeremy welcomed their only child together, daughter Bay, in August 2018. \n\n'Justin loves them all, and they love him,' said our insider. 'They've got a good sibling relationship.'\n\nIt has clearly been a restorative time for Justin who is also healing wounds with his mother, Pattie Mallette, 50. The mother-son pair were estranged from 2013 to 2015, during which time Justin was arrested, dealt with drug use and faced a string of scandals.\n\n'I was distant because I was ashamed,' Justin told Billboard in 2015. 'I never wanted my mom to be disappointed in me and I knew she was. We spent some time not talking, so it takes time to rebuild that trust.'\n\nIn 2016, the singer revealed he hadn't been seeing his mom as much as he would have liked, admitting at the time, 'I’m a lot closer to my dad than I am to my mom.'\n\nNow, they are said to be tentatively back in contact. \n\n'He has his moments with Pattie, but right now, she's the one he talks to less frequently,' our insider said.\n\n'He's worked through all the absenteeism and he now respects his father for the man who he is,' said a source. 'They are good' (pictured in Paris in 2016)\n\nJustin and his mom Pattie Mallette have had an on-again, off-again relationship in recent years, but are tentatively in contact: 'He has his moments with Pattie'\n\nJustin and Hailey Bieber pictured with his three half-siblings, one stepsister, dad Jeremy and stepmom Chelsey \n\nBut it is not such a harmonious story for Hailey, who has kept her distance from her famous father, Stephen. The father-daughter duo have reportedly gone months without speaking, and are only just now beginning to send each other occasional texts and messages. \n\nThe model touched on her familial relations last year, revealing she was focused on her independence.\n\n'I'm not super close with my family at this point in my life,' she told W Magazine. 'Because I feel like I'm very independent. I'm my own individual now, and I've built my own family. But when I look back on my childhood and how I grew up, I have very fond, beautiful memories.'\n\nIt is understood that Hailey was left furious in February last year when her father Stephen took to Instagram to ask people to 'pray' for his daughter's marriage.\n\n'Hailey had a blowout with her family when her dad asked for prayers for Hailey and Justin,' an insider said at the time. 'She told him that she did not want him meddling in her life.' \n\nMeanwhile, a seperate insider claimed that even Hailey’s relationship with her mother, Kennya, was suffering and had 'started to break down when [Hailey] fell pregnant because she didn’t want to tell her family for months.' \n\nHailey and Justin welcome son Jack Blues in August last year.\n\nIn September, Stephen spoke briefly about being in 'grandpa mode' - this time being more careful with his words.\n\n'And of course, here comes Jack Blues Bieber,' he told People magazine. 'And yeah, he's just… I don't want to say too much. He's unbelievably cute.'\n\n'I'm not super close with my family at this point in my life,' she previously told W Magazine\n\nMeanwhile, Justin's wife Hailey is struggling to achieve the same with her parents Stephen and Kennya Baldwin (pictured in 2011 with her sister Alaia) \n\nHailey Bieber has a closer relationship with mom Kennya than father Stephen Baldwin, with the family growing apart when the model was pregnant with her son Jack \n\nAnd, as for Justin, relations are said to be showing signs of warming for the Baldwins and Hailey, who just announced she is selling her make-up brand Rhode in a deal worth up to $1 billion.\n\n'She's talking to them a bit more, nothing deep or serious,' said our source. 'She doesn't hate her parents by any means, but she doesn't always see eye to eye with them, and she's asserting her independence. She's 28 now.\n\n'Hailey's parents gave her a great childhood, better than what Justin had, and she appreciates that. They just are a lot for her to take sometimes, they give unwanted opinions, stick their nose in, and say things they shouldn't say publicly. It happens; they're parents.'\n\nHailey is said to have clashed with her parents over religion and politics. In 2017, the model, who threw her support behind former Vice President Kamala Harris, admitted her father's political leanings had been a 'big issue.' She claimed 'his opinions have [since] changed' but did not elaborate further.\n\nStephen and Kennya are die-hard evangelicals who are very open about their beliefs online.\n\n'These relationships are evolving, as always,' our source said. 'They'll continue to evolve. All four parents love Justin and Hailey, and they love Jack. Relationships are just complex sometimes.'\n\nShare or comment on this article:\nJustin Bieber seeks VERY unlikely source of comfort amid marriage woes with Hailey... as he tries to heal huge childhood wound\n\nAdd comment","summary":"Justin Bieber's increasingly bizarre and erratic behavior has sparked concerns not only for his marriage, but also his mental wellbeing.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14744041/Justin-Bieber-leans-unlikely-people-marriage-woes-rekindles-relationship.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/18/98867435-0-image-m-12_1748626609339.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/20/2300718579337285057/1024x576_MP4_2300718579337285057.mp4","publish_date":"2025-05-30 22:37:13","author":"Editor,Steve Helling","authors":["Editor","Steve Helling"],"language":"en","source_country":"gb","sentiment":0.604},{"id":326625054,"title":"EXCLUSIVE: Trump FBI 'Murder' Files Exposed As Ex Chief Caught in 'Plot to Kill The Don'","text":"FBI \"murder\" files have exposed an ex-director being caught in a plot to \"kill President Donald Trump.\"\n\nRadarOnline.com can reveal the commander-in-chief has found himself in yet another assassination plot — which was \"triggered\" by former FBI Director James Comey.The Chilling Instagram ThreatThe former FBI member, who was let go in 2017 amid his investigation of then-president Trump's alleged ties to Russia, is the subject of a Secret Service and FBI investigation following a suspected threat.\n\nThe former FBI director allegedly set the plan into motion with a coded message spelled out on a beach in seashells.\n\nAccording to sources, Comey posted a cryptic Instagram photo on May 15 that read \"86 47,\" with the message: \"Cool shell formation on my beach walk.\"\n\nThe message has been interpreted by some as a secret message suggesting to kill the 47th president.'Lock Him Up!'After the Instagram post was shared, Comey was brutally slammed on social media as Republicans insisted he was threatening President Trump's life and urged for him to be \"locked up.\"\n\nFBI Deputy Director Dan Bongino has ripped Comey and said he \"brought shame to the FBI badge — yet again.\"\n\nDirector of National Intelligence Tulsi Gabbard called for Comey to be \"put behind bars\" for \"issuing a hit\" on the president. \n\nThe president's son, Donald Trump Jr., also ripped on Comey over the call for his father \"to be murdered.\"Trump even had a few words for the ex-FBI director and said: \"He knew exactly what that meant. A child knows what that meant. If you’re the FBI director and you don’t know what that meant, that meant assassination. And it says it loud and clear.\"\n\nHowever, Comey, who deleted the message amid the brutal backlash, quickly claimed the shells were simply a \"political message.\"\n\n\"I didn’t realize some folks associate those numbers with violence,” he claimed, referring to \"86,\" which means to eliminate. \n\nComey once again claimed the message urging his followers to \"assassinate\" the president \"never\" occurred to him when he posted the photo.\n\nHomeland Security Secretary Kristi Noem revealed her department and the Secret Service are \"investigating this threat and will respond appropriately.\"Due to Comey's previous title and power in the FBI, intelligence experts have called the threat alarming.\n\nAn intelligence insider added: \"The fear is this message set the wheels in motion of something hatched long ago, probably in the run-up to the 2024 election. That’s how spooks operate, and Comey — for all his flaws and insufferable self-righteousness— is a professional.\"Trump's Previous Assassination AttemptsBefore President Trump returned to the Oval Office, he survived two prior attempts on his life before winning the 2024 presidential election against former Vice President Kamala Harris.\n\nIn July 2024, at one of his rallies in Butler, Pennsylvania, Trump was shot at by 20-year-old Thomas Matthew Crooks of Bethel Park, Pennsylvania.\n\nAfter the assassination attempt, Trump fell to the ground and was quickly surrounded by secret service agents before he stood up and threw his fist up in the air, shouting, \"Fight!\"\n\nJust months later in September, while he was golfing in West Palm Beach, Florida, the Secret Service caught an armed suspect outside the property.","summary":"FBI \"murder' files have exposed an ex-chief being caught in a plot to \"kill President Donald Trump.\"","url":"https://radaronline.com/p/trump-fbi-murder-files-exposed-ex-director-caught-plot-kill-president/","image":"https://media.radaronline.com/brand-img/oL0lRxJL9/0x0/hero-saved-life-attendee-donald-trump-assassination-aftermath-4-1720921930237.jpg","video":null,"publish_date":"2025-05-30 21:56:40","author":"Lauren McIver","authors":["Lauren McIver"],"language":"en","category":"politics","source_country":"us","sentiment":-0.243},{"id":326610386,"title":"Donald Trump fires National Portrait Gallery director for being ‘strong supporter’ of DEI","text":"President Donald Trump fired the director of the National Portrait Gallery, Kim Sajet, for being a “strong supporter” of diversity, equity and inclusion (DEI).\n\nTrump announced the termination in a post on Truth Social on Friday afternoon.\n\n“Upon the request and recommendation of many people, I am hereby terminating the employment of Kim Sajet as Director of the National Portrait Gallery,” the president wrote. “She is a highly partisan person, and a strong supporter of DEI, which is totally inappropriate for her position. Her replacement will be named shortly. Thank you for your attention to this matter!”\n\nA White House official told Fox News Digital that Sajet had donated $3,982 to Democrats, including presidential campaigns for former President Joe Biden and Hillary Clinton. Sajet also reportedly donated to other Democrats, including former Vice President Kamala Harris.\n\nThe White House also pointed to the gallery’s photo of Trump, which was curated by Sajet. The caption of the photo reads, “Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the US Capitol on January 6, 2021, he was acquitted by the Senate in both trials. After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837-1908) to have won a nonconsecutive second term.”\n\nThe White House official also said it was ironic that Sajet said, “We try very much not to editorialise. I don’t want by reading the label to get a sense of what the curator’s opinion is about that person. I want someone reading the label to understand that it’s based on historical fact.”\n\nThe National Portrait Gallery did not immediately respond to Fox News Digital’s request for comment on the matter.\n\nAccording to the National Portrait Gallery website, Sajet was the first woman to serve as the director of the National Portrait Gallery, and she spent time in the role looking for ways to put her experience and creativity at the center of learning and civic awareness.\n\nPrior to taking the position, Sajet was the president and CEO of the Historical Society of Pennsylvania, and held other positions at the Pennsylvania Academy of the Fine Arts and at the Philadelphia Museum of Art.\n\nHer biography notes that she was born in Nigeria, was raised in Australia and is a citizen of the Netherlands. She came to the U.S. with her family in 1997.\n\nHours after taking the Oath of Office on Inauguration Day on Jan. 20, Trump signed an executive order to eliminate all DEI programs from the federal government.\n\nA day later, the president directed the Office of Personnel Management to notify heads of agencies and departments to close all DEI offices and place those government workers in those offices on paid leave.\n\nEarlier this month, Trump fired Shira Perlmutter, who was in charge of the U.S. Copyright Office, which came just days after terminating the Librarian of Congress, Carla Hayden. The termination was part of the administration’s ongoing purge of government officials who are perceived to be opposed to Trump and his agenda.\n\nBoth women were notified of their termination by email, The Associated Press previously reported.\n\nHayden tapped Perlmutter to lead the Copyright Office in October 2020.","summary":"Firing follows executive orders halting federal diversity and inclusion efforts under Trump administration.","url":"https://nypost.com/2025/05/30/us-news/donald-trump-fires-national-portrait-gallery-director/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/2025-washington-dc-musk-served-105590925.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/1IcSd2j3-RyIcpnTz.mp4","publish_date":"2025-05-30 21:36:02","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.069},{"id":326622536,"title":"The Stain of George Floyd Riots on America, 5 Years Later","text":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see more of his videos.\n\nHello, this is Victor Davis Hanson for The Daily Signal. This week was the fifth anniversary, May 25, of the tragic death of George Floyd. \n\nIt seems that it just happened but it was actually five years ago. And almost everything that has transpired after that in terms of racial relations has been disastrous. And now, maybe at the end of five years, we can look back with a little bit more circumspection and see what actually happened. \n\nGeorge Floyd was a career felon. He was in the process of trying to pass off counterfeit bills. He was reportedly under the influence of severe, powerful drugs, perhaps fentanyl, in addition. He may have been suffering from post-COVID-19 syndromes. He had a heart condition. One of his prior felonies was putting a gun to a woman’s belly in a home invasion.\n\nNevertheless, when he tried to pass this counterfeit bill, the store owner called the Minneapolis police. They tried to arrest him. He resisted arrest. He was a very big man. And then Officer Derek Chauvin, who was supposedly an expert in techniques that were institutionalized by the Minneapolis Police Department, unfortunately, put his knee on George Floyd’s neck. And there were varying autopsies. One said that killed him. Another one, perhaps, said it didn’t.\n\nBut nevertheless, the expression on Officer Chauvin’s face was frozen into eternity. And that sparked the idea that he was a white policeman conducting a typical murder of an unarmed black suspect. And what followed was near mayhem.\n\nOfficer Chauvin, remember, was convicted of second- or third-degree murder. He was sentenced to 20 years. His appeals have run out with the Supreme Court. He’ll be in prison probably for much of his life. George Floyd, of course, died at the hospital or on the way to the hospital.\n\nAnd what happened immediately was this huge riot, five years ago. Unlike the Jan. 6 riot, this thing went on for the end of May, June, July, August, September. Remember, former Vice President Kamala Harris said it wasn’t going to stop, nor should it stop. It’s going to keep going to Election Day. She said that, of course. Then later, when called on it, she said she didn’t mean the violent aspect.\n\nBut violent aspects there were. There was $2 billion in damage. There was a police precinct burned to the ground in Minneapolis. There was a federal courthouse that was burned. There was a historic St. John’s Church—across from the White House—that was torched. A mob tried to go into the White House grounds and reach the president. \n\nBut even more serious than all of that, we were coming off COVID-19. People had been in a lockdown. There had been a national quarantine. And their news was from the television in an isolated situation in their own home with no human interaction.\n\nSo, these riots were kind of an expression of breaking out. And more importantly, they were subject to rumor, suspicion, lies. And one of the great lies was that George Floyd was iconic or emblematic of young black men, middle-aged black men that were systematically being killed while unarmed by the police. That was not true. The Washington Post even said it wasn’t. \n\nThat year there were only 18 black males who were stopped by the police in the entire population of 340 million people. This year there were only 10. It was proportionate to the number of people by race who were stopped by the police, 11 million or 12 million each year. \n\nProfessor Ibram X. Kendi and professor Robin DiAngelo, or journalist DiAngelo, they created this idea of systemic racism. And you had to be racist in an anti-racist fashion. In other words, the only way to deal with this systemic racism was to be pro-black. \n\nAnd what followed then was a defunding of the police. It caused a huge spike in crime. I think 20,000 murders in 2020. The Black Lives Matter group was energized. And now as we look back at it, the architects of that movement have ensconced with the money. It has collapsed. The women that were in charge have, apparently, embezzled the money or taken it. They have nice homes. But it’s an inert group.\n\nIt had a lot of other deleterious effects. Universities trying to get in on the virtue signaling and performance-art caring dropped the SAT. They dropped the comparative ranking of high school GPA. They dropped meritocracy. They started really enforcing DEI, in the sense of loyalty owes—you have to show us that you’re loyal to the concept of DEI, that you’ve done something for it, or we’re not going to hire you. And the universities then went into something that we could call repertory admissions.\n\nFast forward five years, looking back, and looking at all the damage of the downtowns in America—many of them that were destroyed. Today they have not recovered, in many cases. Look at the intense dissension and acrimony and racial relations that related to it. Look at the universities who were chastised by the Supreme Court for using race in a racist fashion in admissions. They’ve been discredited. And the people who capitalize on the death of George Floyd are, for the most part, discredited.\n\nAnd the country now is learning its lessons. It’s trying to find a sober solution, a reaction. I think they’re trying—we’re trying to come to a conclusion. Why in the world did we go completely collectively insane? And the result of that is we don’t think the quarantines were a good idea. They were more injurious to the country than was COVID-19 itself.\n\nWe don’t think and we know that the police should be defunded. Much less are they attacking black unarmed males. Just the opposite is happening.\n\nWe look at the career of professor Kendi, he went through $45 million at Boston University for an anti-racism center. And apparently, the money was squandered. I mentioned the BLM squandering.\n\nSo, we’re getting back to the idea that, when you use race in any fashion, for bias or preference, it’s racist. It doesn’t matter what professor Kendi says or it doesn’t matter about the reactions to the death of George Floyd, it’s racist.\n\nAs far as George Floyd is concerned, had Officer Chauvin not had that expression on his face and had he lifted his knee up when George Floyd said he couldn’t breathe, this entire catastrophe probably could have been avoided—or maybe not because there were people who were looking for an occasion like this to spread mayhem and to recalibrate race relations in the United States into what they would call anti-racism. Which means it’s permissible for someone who considers themself a victim to be a victimizer. If you think you’re a victim of racism, then you can use racial preferences yourself with impunity. \n\nIn any case, it was a sad chapter in American history.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\n\n\nThe post The Stain of George Floyd Riots on America, 5 Years Later appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/30/the-stain-of-george-floyd-riots-on-america-5-years-later/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/GettyImages-1249837634.jpg","video":null,"publish_date":"2025-05-30 21:19:28","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.337},{"id":326605804,"title":"Kamala Harris' 2028 Chances Drop in New Poll","text":"Former Vice President Kamala Harris' polling numbers dropped in the latest AtlasIntel poll of the potential 2028 Democratic primary field.Newsweek reached out to Harris' political team for comment via her contact form.Why It MattersHarris is viewed as a potential 2028 presidential candidate despite her loss to President Donald Trump in last year's election, as many Democrats feel she ran a solid campaign despite being weighed down by inflation and former President Joe Biden's unpopularity. Others, however, are backing other candidates and view her campaign as flawed, pointing to her embrace of Republicans like former Representative Liz Cheney and her approach to voters who disapproved of the Biden administration's approach to the conflict between Israel and Hamas.Although the primary is still years away, Democrats are already debating who would make their strongest candidate and who is best poised to win back voter groups that shifted toward Republicans last November, including Latino voters and young voters.One political scientist told Newsweek her polling slump could be tied to new revelations about Biden's health—a question that could follow Democrats into the midterms and 2028 race.What to KnowThe new poll found that two potential presidential candidates—former Transportation Secretary Pete Buttigieg and Representative Alexandria Ocasio-Cortez of New York—are ahead of Harris.Nearly 32 percent of Democrats said they are leaning toward Buttigieg, while about 19 percent said they are planning to vote for Ocasio-Cortez. Only 17 percent said they are planning to cast their ballot for Harris in 2028 if she runs.That's down from the April AtlasIntel poll when 24 percent said they planned to back Harris. That poll found that 28 percent of respondents were planning to vote for Buttigieg, while 16 percent leaned toward Ocasio-Cortez.In the latest poll, New Jersey Senator Cory Booker placed fourth with 10 percent support, while California Governor Gavin Newsom followed with 7 percent.Grant Davis Reeher, professor of political science at Syracuse University, told Newsweek it's unsurprising her polling has dropped.\"I'd attribute it to the recent further revelations about Biden and the effort to hide his actual condition,\" he said. \"This will taint her, unless she wants to claim she was so irrelevant in the Biden administration that she was completely out of the inner loop.\"Reeher said he is \"stunned\" she is still being discussed and that Democrats need to nominate someone who is \"more mainstream\" and \"not from the most liberal part of the country.\"The latest poll surveyed 3,469 adults from May 21 to May 27, compared with the other poll that surveyed 2,347 adults from April 10 to April 14. Both had a margin of error of plus or minus 2 percentage points.Is Kamala Harris Running for President Again? What We KnowHarris is speculated to be eyeing a presidential bid or a possible campaign for governor of California, where she served as attorney general and senator. However, she has not said for sure what her next step is.Harris could make a decision about whether to run in California by the end of the summer. Polls suggest she'd be the favorite in the race in the solidly Democratic state. However, she has faced attacks from candidate Antonio Villaraigosa, the former Democratic mayor of Los Angeles, over an alleged \"cover up\" of Biden's health.What Do Other Polls Say About Harris' 2028 Chances?Other recent polls show Harris with a lead over other potential Democrats. A McLaughlin poll, for instance, showed her with 29 percent support. Buttigieg followed with 10 percent, and 9 percent backed Ocasio-Cortez. It surveyed 1,000 registered voters from May 21 to May 26.An Echelon Insights poll from earlier in May showed her with a similar lead with 32 percent compared to Buttigieg's 10 percent. It surveyed 1,000 voters from May 8 to May 12, 2025, and had a margin of error of plus or minus 3.8 percentage points.An April Data for Progress poll, on the other hand, showed a closer race between Harris, Buttigieg and Ocasio-Cortez.What People Are SayingReeher told Newsweek that Democratic hopefuls are \"in a quandary.\"\"The party's brand is not strong, so how much should they be putting themselves out there trying to grab attention? The best play might be to wait for the midterms and then start advertising themselves. Unless the strategy is to separate in important respects from the Democratic mainstream, and in that case articulating that difference early might help. But that's not her campaign, I don't think.\"Harris, speaking about her plans earlier this year while visiting sites impacted by the Los Angeles-area wildfires: \"My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them...I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground.\"What Happens NextMost candidates are unlikely to jump into the race until after the 2026 midterms, but speculation will continue about who is likely to run. Buttigieg opted not to run for office in Michigan, fueling speculation he could be gearing up for another presidential run. Ocasio-Cortez has not commented on speculation that she could run, but others have also floated her as a potential Senate candidate in 2028.","summary":"Two Democrats held a lead over Harris in the latest 2028 Democratic primary poll.","url":"https://www.newsweek.com/kamala-harris-2028-chances-drop-new-poll-2079234","image":"https://d.newsweek.com/en/full/2654450/kamala-harris-2028-poll.jpg","video":null,"publish_date":"2025-05-30 21:10:31","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.145},{"id":326627642,"title":"New poll shows who Dems want in 2028 — and it’s not Kamala Harris","text":"A new poll reveals that Kamala Harris is not the number one choice for Democrats in the 2028 presidential primary.\n\nThe poll, released on May 30 by Atlas Intel, found Pete Buttigieg, the former mayor of South Bend, Indiana, and former transportation secretary in the Biden administration, to be the top pick among Democrats who responded to the survey.\n\nA total of 31.5% of self-identified Democrats who responded to the poll said they would vote for Buttigieg for president in four years, according to the poll.\n\nOther surveys in May from firms such as Echelon Insights and McLaughlin & Associates have found Harris in first place in the hypothetical primary, making Atlas Intel’s poll stand out among the rest.\n\nHarris is the third most popular pick among Democrats in the poll, falling behind U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y.\n\nAmong Democrats, 19.4% said they would vote for Ocasio-Cortez, while 16.6% said they would vote for Harris.\n\nWhile Buttigieg, Ocasio-Cortez and Harris are the top three picks for Democrats, none of them have made explicit statements saying they will run for president.\n\nHarris herself has been weighing a run for governor in California or another run for president, according to CBS News.\n\nU.S. Sen. Cory Booker, D-N.J., was the fourth most popular pick for presidential candidate among Democrats, with 10.4% saying they would vote for him. Behind Booker is California Gov. Gavin Newsom with 7.1%, followed by Pennsylvania Gov. Josh Shapiro at 4.8% and Michigan Gov. Gretchen Whitmer with 3.7%, according to the poll.\n\nA total of 3.6% of the Democrats surveyed replied “none of the above,” and 1.4% said they would vote for U.S. Sen. Raphael Warnock, D-Ga.\n\nThe Atlas Intel poll was conducted between May 21 and May 27 with a sample size of 3,469 U.S. adults and a margin of error of plus or minus 2.2%.\n\nMore on Politics\n\nRead the original article on MassLive.","url":"https://www.yahoo.com/news/poll-shows-dems-want-2028-203419834.html","image":"https://s.yimg.com/ny/api/res/1.2/RBgQ57Lh69cvfgvx6b8eow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjg-/https://media.zenfs.com/en/masslive_articles_390/0e32a5c21bd3824543e5d1f2dd213410","video":null,"publish_date":"2025-05-30 20:34:19","author":"Adam Bass","authors":["Adam Bass"],"language":"en","source_country":"us","sentiment":0.131},{"id":326620730,"title":"Guest Opinion: Waving the flag could turn the tables on Trump and the GOP, by Laura Washington","text":"Waving the flag is as American as apple pie. For years, Republicans have painted Democrats as far-left extremists and America haters, to disastrous effect. It’s time to turn the tables.\n\nFlag-shagging, as it’s known in the United Kingdom, is the “uncouth vernacular for overt displays of patriotism,” according to a recent essay in The Economist. Last year, it helped the British Labour Party regain a majority in Parliament.\n\nPresident Donald Trump’s caterwauling about the Democrats’ hatred of the military and the nation is epic. He has called Democrats “treasonous” and “un-American.” Trump’s rants have no basis in fact, but if you bellow loud enough and often enough, it sinks in.\n\n“They certainly didn’t seem to love our country very much. It’s very sad,” Trump said. Such accusations are echoed up and down the ranks of the Republican leadership, running wild and freely.\n\nAt a campaign rally in his Ohio hometown, then-Republican vice presidential nominee JD Vance attacked prospective Democratic presidential nominee Kamala Harris by questioning her patriotism. When Harris gives a speech, Vance claimed, “she talks about the history of this country not with appreciation but with condemnation.”\n\nHe piled on: “Not everything’s perfect. It’s never going to be. But you, if you want to lead this country, you should feel grateful for it. You should feel a sense of gratitude. And I never hear that gratitude come through when I listen to Kamala Harris.”\n\nIt was an echo of attacks leveled at former first lady Michelle Obama during her husband’s 2008 presidential campaign.\n\nThe Republicans are particularly good at this trope.\n\nBack in 2020, a first-term congressman from Texas targeted U.S. Sen. Tammy Duckworth. U.S. Rep. Dan Crenshaw criticized Duckworth for suggesting that the issue of removal of statues and monuments of controversial Founding Fathers should be debated.\n\nCrenshaw, a former Navy SEAL, said Duckworth was supporting the “destruction of America.”\n\n“I think a general message that the left stands for the destruction of America and the right doesn’t probably works pretty well with veterans, even liberal ones, because even liberal veterans probably don’t agree with that, unless you’re Tammy Duckworth,” he declared.\n\nDuckworth is a retired Army National Guard lieutenant colonel. She lost her legs serving in combat in the Iraq War.\n\nDemocrats have work to do. According to a 2024 Gallup poll, 41 percent of adults said they were “extremely proud” to be American, and another 26 percent said they were “very proud.”\n\nOver the years, patriotic pride among Republicans “has consistently outpaced that of Democrats,” according to Gallup. In 2024, 59 percent of Republicans, 34 percent of Democrats and 36 percent of independents said they were “extremely proud” to be American.\n\nFlag-shagging, by wrapping yourself snugly in the American flag, is what the Democrats should do. There is no downside.\n\nThey need to stop being the party that stands up for the protester who burns our flag. Let the U.S. Supreme Court deal with the free speech issues. Flag burning cannot be the Democrats’ epithet. They don’t have to support massive military budgets, but they should staunchly support our troops and veterans.\n\nDemocrats might consider the example of Rahm Emanuel, the prominent Democrat, former U.S. ambassador to Japan and former Chicago mayor. He is back in town and on a political redemption tour.\n\nThis month, Emanuel held an event to showcase a program he is spearheading to support Chicago Public Schools students who are enrolled in ROTC. He announced that he and his wife, Amy Rule, are establishing an ROTC scholarship and naming it after Adm. Lisa Franchetti, who was the first woman to serve as chief of naval operations and the first woman to serve on the Joint Chiefs of Staff, until she was inexplicably fired by the Trump administration.\n\nTwelve graduates of the CPS Junior ROTC received a scholarship check from Emanuel to fund $10,000 a year toward their college education. Franchetti appeared with Emanuel to congratulate the students.\n\nI’m no Rahm fan, but that’s savvy politics.\n\nLast August, the politicians were falling all over themselves with patriotism at the 2024 Democratic National Convention. Their floor speeches were laced with odes to America. “USA” signs flooded the zone at Chicago’s United Center.\n\nIn return, the Democrats enjoyed a post-convention bump in the polls. Their flag-shagging had Trump on the run.\n\nSince then, not so much. The Democrats must overcome their natural inclination to duck.\n\nErring on the side of patriotism is not a political sin. It’s a virtue. It’s sort of like being in favor of motherhood. Who’s against that?\n\nRailing against the oligarchy will get the Democrats only so far. Instead, go full tilt into waving the flag.","summary":"Waving the flag is as American as apple pie. For years, Republicans have painted Democrats as far-left extremists and America haters, to disastrous effect. It’s time to turn the tables.","url":"https://www.keenesentinel.com/opinion/op-ed/guest-opinion-waving-the-flag-could-turn-the-tables-on-trump-and-the-gop-by/article_acd7e981-f6b1-4fa7-86fc-c5bc000567d7.html","image":"https://bloximages.chicago2.vip.townnews.com/keenesentinel.com/content/tncms/custom/image/6260defe-c779-11ef-bd8a-c733c01e3345.jpg?resize=600%2C315","video":null,"publish_date":"2025-05-30 20:30:00","author":"Laura Washington","authors":["Laura Washington"],"language":"en","category":"politics","source_country":"us","sentiment":-0.071},{"id":326600802,"title":"EXCLUSIVE: Why Trump Fired the Director of the National Portrait Gallery","text":"FIRST ON THE DAILY SIGNAL—President Donald Trump has fired the director of the National Portrait Gallery because of her history of pushing woke ideology, donating to Democrats, and denigrating Republicans, a White House official told The Daily Signal.\n\nKim Sajet has donated $3,982.40 to Democrats, including Joe Biden’s presidential campaign, Hillary Clinton’s 2016 presidential campaign, the DCCC, and EMILY’s List, an organization that helps pro-abortion Democratic candidates win elections.\n\nSajet has also donated to Democrats, including Sen. Kirsten Gillibrand of New York, former Vice President Kamala Harris, and former Rep. Colin Allred of Texas, among others, through ActBlue.\n\nTrump announced he fired Sajet on TruthSocial on Friday. Her ouster closely follows the firings of the Librarian of Congress, the chairman of the Joint Chiefs of Staff, and the U.S. Coast Guard commandant over similar concerns of wokeness.\n\n“She is a highly partisan person, and a strong supporter of [diversity, equity, and inclusion], which is totally inappropriate for her position. Her replacement will be named shortly,” the president said of the Nigeria-born Australian native, who is a citizen of the Netherlands.\n\nThe photo of Trump in the Portrait Gallery in Washington, D.C., curated by Sajet, has the following caption: “Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the U.S. Capitol on January 6, 2021, he was acquitted by the Senate in both trials. After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837-1908) to have won a nonconsecutive second term.”\n\nYet Sajet told The Washingtonian magazine the gallery tries not to editorialize in captions.\n\n“We try very much not to editorialize,” Sajet said. “I don’t want, by reading the label, to get a sense of what the curator’s opinion is about that person. I want someone reading the label to understand that it’s based on historical fact.”\n\nIn 2018, Sajet wrote an editorial in The Atlantic revealing her support for critical race theory.\n\n“To step outside of comfort zones and be confronted and uncomfortably reminded—that the ‘portrait of America’ has never been only about meritocracy, but also social access, racial inequality, gender difference, religious preference, and political power,” Sajet wrote. \n\n“As we approach Columbus Day, increasingly being recognized as a day of Indigenous lamentation that prophetically coincides with the 50th anniversary of this museum’s opening in 1968; we need to remember that we did not ‘find’ a ‘New World’ but invaded an old one,” she continued, “We aren’t just a world leader, but a global participant, and in the end as we enter this world with nothing, and leave this world with nothing—it’s what we do in the middle that counts.”\n\nWhen Sajet joined the Portrait Gallery in 2013, she made it her mission to spend 50% of all money spent on art to support diverse artists and portrait subjects, USA Today wrote in 2019.\n\n“Sajet says white men dominated famous portraits because they owned land, and art was historically reserved for the rich and elite,” the reporter, Nicquel Terry Ellis, said.\n\nIn an article in The New Yorker, Sajet sought to gloss over the dark past of Planned Parenthood founder and known eugenics enthusiast, Margaret Sanger.\n\nWhen Sen. Ted Cruz, R-Texas, attempted to get Sanger’s portrait removed from the Portrait Gallery, Sajet said: “There are bad guys; we know what they’ve done,” Sajet said. “Margaret Sanger is being demonized for a lot of things she didn’t do.”\n\nSajet said Sanger was “not perfect,” nor was she a “eugenicist leader.”\n\nThe now former Portrait Gallery director wrote a blog post in 2018 “explaining why traditional portraiture has been so non-diverse.”\n\nShe tweeted about “opening a dialogue about culturally constructed racism” at the Portrait Gallery.","summary":"FIRST ON THE DAILY SIGNAL—President Donald Trump has fired the&#160;director of the National&#160;Portrait Gallery because of her history of pushing woke ideology, donating to Democrats,... Read More\n\n\nThe post EXCLUSIVE: Why Trump Fired the Director of the National Portrait Gallery appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/30/exclusive-why-trump-fired-director-national-portrait-gallery/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/portrait.jpg","video":null,"publish_date":"2025-05-30 20:22:34","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","source_country":"us","sentiment":-0.088},{"id":326761710,"title":"McTEAGUE: Canada’s EV house of cards is close to collapsing","text":"Dan McTeague is President of Canadians for Affordable EnergyWell, Canada’s electric vehicle policies are playing out exactly as I predicted. Which is to say, they’re a disaster.Back in November, in the immediate aftermath of Donald Trump’s re-election, I wrote in these pages that, whatever else that election might mean for Canada, it would prove big trouble for the Justin Trudeau/Doug Ford EV scam.The substance of their plot works like so: first, the federal and provincial governments threw mountains of taxpayer dollars in subsidies at automakers so that they’d come to Canada to manufacture EVs. Then Ottawa mandated that Canadians must buy those EVs — exclusively — by the year 2035. That way Ford and Trudeau could pat themselves on the back for “creating jobs,” while EV manufacturers could help themselves to the contents of our wallets twice over..But the one variable they didn’t account for was a return of Donald Trump to the White House.Trump had run on a promise to save America from their own back-door EV mandates. Though Kamala Harris had denied that any such mandates existed, they did, and they were founded on two acts of the Biden-Harris administration. First, they issued an Executive Order setting significantly more onerous tailpipe regulations on all internal combustion engine (ICE) vehicles, with the explicit goal of ensuring that 50 percent of all new vehicles sold in America be electric by 2030.Second, they granted California a waiver to make those regulations more burdensome still, so that only EVs could realistically be in compliance with them. Since no automaker would want to be locked out of the market of the most populous state, nor could they afford to build one set of cars for California (plus the handful of states which have — idiotically — chosen to align their regulations with California’s) and another set for the rest of the country, they would be forced to increase their manufacture and sale of EVs and decrease their output of ICE vehicles..Trump’s victory took Canada’s political class completely by surprise, and it threw a spanner into the workings of the Liberals’ plan.That’s because there just aren’t enough Canadians, or Canadian tax dollars, to make their EV scheme even kinda' work. Canada’s unique access to the world’s biggest market — America — was a key component of the plan. After all, vehicles are “the second largest Canadian export by value, at $51 billion in 2023, of which 93 percent was exported to the US,” according to the Canadian Vehicle Manufacturers Association, and “Auto is Ontario’s top export at 28.9 percent of all exports (2023.)”It further depended on Americans buying more and more EVs every year. But since, when given a choice, most people prefer the cost and convenience of ICE vehicles, this would only work if Americans were pushed into buying EVs, even if in a more roundabout way than they’re being forced on Canadians..Which is why the plan all began to unravel on January 20, the day of Trump’s inauguration, when he signed Executive Order 14154, “Unleashing American Energy,” which, among other things, rescinded Joe Biden’s pro-EV tailpipe regulations. And it has continued downhill from there.Just last week, the US Senate voted to repeal the Biden EPA’s waiver for California. Not that that’s the end of the story — in the aftermath of the vote, California governor Gavin Newsom vowed “to fight this unconstitutional attack on California in court.” (Though don’t be surprised if that fight is brief and half-hearted — Newsom has been trying to leave his lifelong leftism behind recently and rebrand as a moderate Democrat in time for his own run at the White House in 2028. Consequently, being saved from his own EV policy might only help his career prospects going forward.)But it’s worth noting the language used by the Alliance for Automotive Innovation, which represents car companies like Toyota, GM, Volkswagen and Stellantis (several of whom, it should be noted, have received significant subsidies from the Liberal and Ford governments to manufacture EVs), which said in a statement, “The fact is these EV sales mandates were never achievable.”.That’s worth repeating: these EV sales mandates were never achievable!That’s true in California, and it’s true in Canada as well.And yet, our political class has refused to accept this reality. Doug Ford actually doubled down on his commitment to heavily subsidizing the EV industry in his recent campaign, saying “I want to make it clear… a re-elected PC government will honour our commitment to invest in the sector,” no matter what Donald Trump does. Except, as noted above, Donald Trump represents the customers Doug Ford needs!.Meanwhile, our environmentalist-in-chief, Mark Carney, has maintained the Liberal Party’s commitment to the EV mandates, arguing that EVs are essential for his vacuous plan of transforming Canada into a “clean energy superpower.” How exactly? That’s never said.These are the words of con artists, not men who we should be trusting with the financial wellbeing of our country. Unfortunately, in our recent federal election — and the one in Ontario — this issue was barely discussed, beyond an 11th-hour attempted buzzer-beater from Pierre Poilievre and a feeble talking point from Bonnie Crombie about her concern “that the premier has put all our eggs in the EV basket.”Meanwhile, 2035 is just around the corner.So we can’t stop calling attention to this issue. In fact, we’re going to shout about our mindless EV subsidies and mandates from the rooftops until our fellow Canadians wake up to the predicament we’re in. It took some time, but we made them notice the carbon tax (even if the policy change we got from Carbon Tax Carney wasn’t any better.) And we can do it with electric vehicles, too.Because we don’t have the money, either as a nation or as individuals, to prop this thing up forever.Dan McTeague is President of Canadians for Affordable Energy.","summary":"Well, Canada’s electric vehicle policies are playing out exactly as I predicted. Which is to say, they’re a disaster.","url":"https://www.westernstandard.news/opinion/mcteague-canadas-ev-house-of-cards-is-close-to-collapsing/65126","image":"https://media.assettype.com/westernstandard/2024-04/2fbb1842-8e67-4bc2-b9b1-d33025e17f8e/IMG_3102.jpeg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-05-30 20:15:00","author":"Western Standard Guest Columnist","authors":["Western Standard Guest Columnist"],"language":"en","source_country":"ca","sentiment":-0.219},{"id":326594838,"title":"Donald Trump fires National Portrait Gallery director for being 'strong supporter' of DEI","text":"President Donald Trump fired the director of the National Portrait Gallery, Kim Sajet, for being a \"strong supporter\" of diversity, equity and inclusion (DEI). Trump announced the termination in a post on Truth Social on Friday afternoon. \"Upon the request and recommendation of many people, I am hereby terminating the employment of Kim Sajet as Director of the National Portrait Gallery,\" the president wrote. \"She is a highly partisan person, and a strong supporter of DEI, which is totally inappropriate for her position. Her replacement will be named shortly. Thank you for your attention to this matter!\" A White House official told Fox News Digital that Sajet had donated $3,982 to Democrats, including presidential campaigns for former President Joe Biden and Hillary Clinton. Sajet also reportedly donated to other Democrats, including former Vice President Kamala Harris. DEMS ERUPT AFTER REPORT OF TRUMP FIRING LIBRARIAN OF CONGRESS: ‘A DISGRACE’ The White House also pointed to the gallery's photo of Trump, which was curated by Sajet. The caption of the photo reads, \"Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the US Capitol on January 6, 2021, he was acquitted by the Senate in both trials. After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837-1908) to have won a nonconsecutive second term.\" The White House official also said it was ironic that Sajet said, \"We try very much not to editorialise. I don’t want by reading the label to get a sense of what the curator’s opinion is about that person. I want someone reading the label to understand that it’s based on historical fact.\" The National Portrait Gallery did not immediately respond to Fox News Digital’s request for comment on the matter. WHITE HOUSE VOWS TO IMPLEMENT 'SYSTEM OF MERIT' IN US, DISMANTLE DEI 'STRANGULATION' According to the National Portrait Gallery website, Sajet was the first woman to serve as the director of the National Portrait Gallery, and she spent time in the role looking for ways to put her experience and creativity at the center of learning and civic awareness. Prior to taking the position, Sajet was the president and CEO of the Historical Society of Pennsylvania, and held other positions at the Pennsylvania Academy of the Fine Arts and at the Philadelphia Museum of Art. Her biography notes that she was born in Nigeria, was raised in Australia and is a citizen of the Netherlands. She came to the U.S. with her family in 1997. DEFUNDING DEI: HERE’S HOW THE TRUMP ADMINISTRATION HAS UNDONE BIDEN’S VERY PRIZED PROGRAMS Hours after taking the Oath of Office on Inauguration Day on Jan. 20, Trump signed an executive order to eliminate all DEI programs from the federal government. A day later, the president directed the Office of Personnel Management to notify heads of agencies and departments to close all DEI offices and place those government workers in those offices on paid leave. Earlier this month, Trump fired Shira Perlmutter, who was in charge of the U.S. Copyright Office, which came just days after terminating the Librarian of Congress, Carla Hayden. The termination was part of the administration’s ongoing purge of government officials who are perceived to be opposed to Trump and his agenda. CLICK HERE TO GET THE FOX NEWS APP Both women were notified of their termination by email, The Associated Press previously reported. Hayden tapped Perlmutter to lead the Copyright Office in October 2020. Fox News Digital's Brooke Singman and The Associated Press contributed to this report.","summary":"President Donald Trump dismisses Kim Sajet from the National Portrait Gallery, citing her support for DEI as inappropriate, amid a broader purge of officials opposing his agenda.","url":"https://www.foxnews.com/politics/donald-trump-fires-national-portrait-gallery-director-strong-supporter-dei","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-sajet.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-30 20:02:23","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"US","sentiment":0.011}]}