{"offset":0,"number":50,"available":509,"news":[{"id":311924764,"title":"Democrats find their lost unity around fighting a ‘constitutional crisis’. So where is Kamala Harris?","text":"Congressional Democrats are finding a fighting spirit as Donald Trump and his administration defy court orders to return a wrongfully-deported man.\n\nKilmar Abrego Garcia’s deportation to El Salvador, which the Department of Homeland Security and Justice Department have admitted was an error, remains one of the biggest issues in Washington. \n\nA growing number of Democrats and legal experts now have the same prognosis: America is in a “constitutional crisis”, as the White House and broader federal government ignore court orders to facilitate the return of a man officials have now spent days accusing, without a shred of real evidence, of being a gang member.\n\nAnd for the most part, the Democratic Party is unified — and finally finding a voice.\n\nLeaders of the opposition party came out this week with forceful statements demanding the Trump administration comply with the courts. Senate Majority Leader Chuck Schumer, on Wednesday, joined a handful of other Democratic senators in announcing that he’d place a hold on the administration’s nominees for two key US attorney positions.\n\nHouse Minority Leader Hakeem Jeffries, whose chamber is not involved in the nomination process, took his own stand at a press conference in Brooklyn.\n\n\"The Trump administration has acknowledged [that Garcia’s deportation was committed in error] and so they need to comply with the Supreme Court's directive or the Supreme Court needs to enforce its order aggressively, which should include contempt,” said the House Democratic leader.\n\nAn official Twitter account for the House Democratic caucus and a whole host of other Democratic lawmakers have now released statements on the issue of Abrego Garcia’s deportation as well — a moment of (mostly) unity for the party which fractured in January with the passage of the Laken Riley Act and again in March in the face of a battle over a government shutdown.\n\n“Ask yourself—what’s going to stop the government from deporting you to a prison in El Salvador?” wrote Jim McGovern, the senior Democrat on the powerful Rules committee. “The people get it. Either everyone has due process—or nobody does.”\n\nEven John Fetterman, an outlier in his party after breaking with Democrats — hard — on both support for the scale and ferocity of the Israeli assault on Gaza as well as the Laken Riley Act, found that elusive cohesion with his caucus.\n\n“The Supreme Court made a unanimous decision, saying the lower Court’s order “properly requires the Government to ‘facilitate’ Abrego Garcia’s release,” wrote the Pennsylvania senator. “Calling on the White House to follow this directive.”\n\nChris Van Hollen, of Garcia’s home state, apparently understood the assignment. He reportedly drew a standing ovation at his own town hall Tuesday evening by announcing a visit to El Salvador to attempt to speak with Abrego Garcia, then did so the very next day. Other Democrats are seeking a full congressional delegation from the House. They may push ahead with a visit even if Speaker Mike Johnson doesn’t approve it.\n\nThe party’s unification around Abrego Garcia’s case has pushed any dissenting voices underground. \n\nOne of them, identified only as a centrist House Democrat, aired a very dismissive complaint to Axios on Wednesday, while referring to yet another wrongful deportation case: \"Rather than talking about the tariff policy and the economy ... the thing where his numbers are tanking, we're going to go take the bait for one hairdresser.”\n\nWith those few exceptions in mind, Democrats seem to be meeting the moment, spurred by enraged activist groups and voters alike.\n\nBut there’s one big question on the minds of those who are looking to see who emerges as the party’s next standard bearer. Two, actually: Where is Joe? Where is Kamala?\n\nBoth Democrats who ran for president in 2024 have largely dropped off the face of the earth since that disastrous November drubbing at the hands of Donald Trump. Joe Biden gave his first big speech since leaving office on Tuesday — he appeared tired, and stumbled through his speech at times, and couldn’t attack Trump by name. His address did not touch on the administration’s deportations. \n\nWith his political career behind him, however, few are expecting a fiery Biden to emerge to rally the troops.\n\nIt’s Kamala Harris whose silence is more surprising. Despite her well-reported future political ambitions, the ex-vice president has not said a word about Abrego Garcia on social media, has largely ceased holding public events for the time being, and has had nothing to say about the “constitutional crisis” which her former peers in Congress now say the US faces. Once again, Harris finds herself at the center of accusations that her party’s sense of urgency does not meet its own rhetoric.\n\nWith Democratic groups pressing ahead full-steam in the effort to build “the Resistance” 2.0 and fight the shocking scale of changes Donald Trump is seeking to make to the federal government, Harris could find herself left behind and accused of checking out if she seeks to rebuild a brand as a leader of her party if she’s eyeing 2028 — or if she runs for governor of California next year.","summary":"ANALYSIS: Congressional Democrats are, for the most part, in lockstep over Kilmar Abrego Garcia’s deportation. A former party standard-bearer risks being left in the dust, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrats-find-their-lost-unity-around-fighting-a-constitutional-crisis-b2734744.html","image":"https://static.independent.co.uk/2025/03/22/19/44/56th-NAACP-Image-Awards-Show-c94ewmmg.jpeg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/Zvk5XHCN-OhrQWqOm.mp4","publish_date":"2025-04-17 00:14:22","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.081},{"id":311926632,"title":"Democrats find their lost unity around fighting a ‘constitutional crisis’. So where is Kamala Harris?","text":"Congressional Democrats are finding a fighting spirit as Donald Trump and his administration defy court orders to return a wrongfully-deported man.\n\nKilmar Abrego Garcia’s deportation to El Salvador, which the Department of Homeland Security and Justice Department have admitted was an error, remains one of the biggest issues in Washington.\n\nA growing number of Democrats and legal experts now have the same prognosis: America is in a “constitutional crisis”, as the White House and broader federal government ignore court orders to facilitate the return of a man officials have now spent days accusing, without a shred of real evidence, of being a gang member.\n\nAnd for the most part, the Democratic Party is unified — and finally finding a voice.\n\nLeaders of the opposition party came out this week with forceful statements demanding the Trump administration comply with the courts. Senate Majority Leader Chuck Schumer, on Wednesday, joined a handful of other Democratic senators in announcing that he’d place a hold on the administration’s nominees for two key US attorney positions.\n\nHouse Minority Leader Hakeem Jeffries, whose chamber is not involved in the nomination process, took his own stand at a press conference in Brooklyn.\n\n\"The Trump administration has acknowledged [that Garcia’s deportation was committed in error] and so they need to comply with the Supreme Court's directive or the Supreme Court needs to enforce its order aggressively, which should include contempt,” said the House Democratic leader.\n\nAn official Twitter account for the House Democratic caucus and a whole host of other Democratic lawmakers have now released statements on the issue of Abrego Garcia’s deportation as well — a moment of (mostly) unity for the party which fractured in January with the passage of the Laken Riley Act and again in March in the face of a battle over a government shutdown.\n\n“Ask yourself—what’s going to stop the government from deporting you to a prison in El Salvador?” wrote Jim McGovern, the senior Democrat on the powerful Rules committee. “The people get it. Either everyone has due process—or nobody does.”\n\nEven John Fetterman, an outlier in his party after breaking with Democrats — hard — on both support for the scale and ferocity of the Israeli assault on Gaza as well as the Laken Riley Act, found that elusive cohesion with his caucus.\n\n“The Supreme Court made a unanimous decision, saying the lower Court’s order “properly requires the Government to ‘facilitate’ Abrego Garcia’s release,” wrote the Pennsylvania senator. “Calling on the White House to follow this directive.”\n\nChris Van Hollen, of Garcia’s home state, apparently understood the assignment. He reportedly drew a standing ovation at his own town hall Tuesday evening by announcing a visit to El Salvador to attempt to speak with Abrego Garcia, then did so the very next day. Other Democrats are seeking a full congressional delegation from the House. They may push ahead with a visit even if Speaker Mike Johnson doesn’t approve it.\n\nThe party’s unification around Abrego Garcia’s case has pushed any dissenting voices underground.\n\nOne of them, identified only as a centrist House Democrat, aired a very dismissive complaint to Axios on Wednesday, while referring to yet another wrongful deportation case: \"Rather than talking about the tariff policy and the economy ... the thing where his numbers are tanking, we're going to go take the bait for one hairdresser.”\n\nWith those few exceptions in mind, Democrats seem to be meeting the moment, spurred by enraged activist groups and voters alike.\n\nBut there’s one big question on the minds of those who are looking to see who emerges as the party’s next standard bearer. Two, actually: Where is Joe? Where is Kamala?\n\nBoth Democrats who ran for president in 2024 have largely dropped off the face of the earth since that disastrous November drubbing at the hands of Donald Trump. Joe Biden gave his first big speech since leaving office on Tuesday — he appeared tired, and stumbled through his speech at times, and couldn’t attack Trump by name. His address did not touch on the administration’s deportations.\n\nWith his political career behind him, however, few are expecting a fiery Biden to emerge to rally the troops.\n\nIt’s Kamala Harris whose silence is more surprising. Despite her well-reported future political ambitions, the ex-vice president has not said a word about Abrego Garcia on social media, has largely ceased holding public events for the time being, and has had nothing to say about the “constitutional crisis” which her former peers in Congress now say the US faces. Once again, Harris finds herself at the center of accusations that her party’s sense of urgency does not meet its own rhetoric.\n\nWith Democratic groups pressing ahead full-steam in the effort to build “the Resistance” 2.0 and fight the shocking scale of changes Donald Trump is seeking to make to the federal government, Harris could find herself left behind and accused of checking out if she seeks to rebuild a brand as a leader of her party if she’s eyeing 2028 — or if she runs for governor of California next year.","url":"https://uk.news.yahoo.com/democrats-lost-unity-around-fighting-001422195.html","image":"https://media.zenfs.com/en/the_independent_577/27c75981ad5c211f434fa7b144c9be57","video":null,"publish_date":"2025-04-17 00:14:22","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.081},{"id":311928830,"title":"ABC, NBC, CBS Won't Mention Rachel Morin Case But Spent Segment After Segment On Abrego Garcia","text":"Two Maryland stories involving illegal immigration made national news this week. On Monday, a Maryland jury found Salvadoran illegal immigrant Victor Antonio Martinez-Hernandez guilty of the rape and murder of Rachel Morin, a 37-year-old mother of five from Bel Air. The other story involves Kilmar Abrego Garcia, an illegal immigrant who a U.S. district judge ruled the Trump administration deported illegally to El Salvador. However, viewers of ABC, NBC, and CBS are likely only aware of the second story. According to a new NewsBusters study, the three broadcast networks have spent zero – zero! – seconds covering the Morin case. Meanwhile, over the past two weeks, they have spent more than 64 minutes covering Garcia, whom they largely refer to as a \"Maryland man.\" \"Disgusting,\" Donald Trump Jr. called the disparity in coverage. And we all know the reason why. The heinous killing of Morin emphasizes the danger in which Joe Biden's mindless open-border policy put Americans. In fact, Morin's family and family attorney both called out the Biden administration this week for its negligence. \"They caught him… three times at the border,\" the attorney said. \"I'm very angry, I'm actually outraged ... There was no action on the Democrat Party in any way. From Joe Biden, Kamala Harris, Mayorkas…none of the [Maryland] Senators did anything to help search for the murderer of my daughter,\" Morin's mother told Fox News. Apparently, the broadcast networks didn't find the mother's comments worthy of a mention. Conversely, the networks see Garcia's deportation as an opportunity to frame Trump as evil and inhumane. The report also noted the networks neglected to focus on several details related to Garcia – such as his suspected gang affiliations, the details of his 2019 arrest, and the credible evidence linking him to MS-13. Put simply, the networks are not trying to report on illegal immigration honestly or even accurately. They have an agenda. Mentioning Rachel Morin makes Trump's border policy look good. Framing the Garcia story the way the networks have makes Trump look bad. And thus, expect the disparate coverage of the two Maryland illegal immigration cases to continue.","summary":"ABC, NBC, CBS won&apos;t mention Rachel Morin case but spend segment after segment on Abrego Garcia.","url":"https://www.outkick.com/analysis/abc-nbc-cbs-wont-mention-rachel-morin-case-spent-segment-after-segment-kilmar-garcia","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/04/gettyimages-2210617513.jpg","video":null,"publish_date":"2025-04-17 00:00:45","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.478},{"id":311930674,"title":"Former FAA contractor pleads guilty to spying for Iran, sharing private info on US airports, energy industry","text":"A naturalized U.S. citizen living in Great Falls, Virginia, pleaded guilty on Wednesday to working with Iranian government and intelligence officials on their behalf in the U.S. as a contractor for the Federal Aviation Administration (FAA) between 2017 and 2024. The Department of Justice (DOJ) said 42-year-old Abouzar Rahmati pleaded guilty in federal court to conspiring to act and acting as an agent of the Iranian government in the U.S. without prior notification to the Attorney General. Rahmati previously was an Islamic Revolutionary Guard Corps (IRGC) 1st Lt., a branch of the Iranian Armed Forces, from June 2009 to May 2010. The IRGC is a designated terrorist group by the U.S. government. Court documents show that from at least December 2017 through June 2024, Rahmati worked with Iranian intelligence operatives and government officials on their behalf in the U.S. VIRGINIA FAA CONTRACTOR ALLEGEDLY SPIED FOR IRAN, SHARED PRIVATE INFO ON US AIRPORTS, ENERGY INDUSTRY: DOJ During that period, Rahmati met with Iranian intelligence in Iran, communicated with Iranian authorities using a cover story to hide his conduct, obtained employment with an FAA contractor with access to sensitive, non-public information about the U.S. aviation sector, and obtained and provided open-source and non-public materials about the solar energy industry in the U.S. to intelligence officers. The DOJ said Rahmati offered his services to Iran in August 2017 through a former colleague who was a senior Iranian government official who previously worked at the country’s Ministry of Intelligence and Security. Rahmati traveled to Iran four months later and met with intelligence operatives and government officials, the DOJ said. He also agreed to gather and provide Iranian officials with information about the solar industry in the U.S. 3 HACKERS WITH TIES TO IRAN INDICTED IN PLOT AGAINST TRUMP CAMPAIGN: DOJ When he returned to the U.S. in early 2018, Rahmati obtained private and open-source materials related to the U.S. solar industry, then provided them to the office of Iran’s Vice President for Science and Technology. While working as an FAA contractor in the U.S., Rahmati downloaded at least 175 GB of files, including sensitive access-controlled FAA documents relating to the National Aerospace System (NAS), NAS Airport Surveillance Radar systems and radio frequency data, the DOJ said. DOES IRAN'S HACKING OF THE TRUMP CAMPAIGN PROVE THEY WANT KAMALA HARRIS TO WIN THE ELECTION? EXPERTS WEIGH IN Rahmati stored the files on removable media, which he took to Iran in April 2022 and provided to government officials, according to the DOJ. He also provided additional information about solar energy, solar panels, the FAA, U.S. airports, and U.S. air traffic control towers to his brother living in Iran in April 2022, the DOJ added, so his brother could provide the files to intelligence officials on Rahmati’s behalf. CLICK HERE TO GET THE FOX NEWS APP Rahmati is scheduled to be sentenced on Aug. 26, and he faces a maximum of 10 years in prison for acting as an agent of a foreign government, and up to five years in prison for conspiracy. Fox News Digital’s Sarah Rumpf-Whitten contributed to this report.","summary":"A naturalized U.S. citizen working as an FAA contractor pleaded guilty this week to spying in the U.S. on behalf of Iran, while providing them with information on U.S. airports.","url":"https://www.foxnews.com/us/former-faa-contractor-pleads-guilty-spying-iran-sharing-private-info-us-airports-energy-industry","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/suspect-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-16 23:43:41","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"us","sentiment":0.182},{"id":311929574,"title":"George Clooney reveals his surprising choice on who should lead the Democrats after shaking up party","text":"George Clooney believes Maryland Governor Wes Moore is a 'proper leader' who he sees as the next Democrat standard-bearer after he led the movement to push Joe Biden out in 2024. \n\nThe actor, a longtime Democrat supporter and fundraiser, wrote an op-ed in the New York Times July 10 of last year titled 'I Love Joe Biden. But We Need a New Nominee.' \n\nClooney, who in June last year raised $30million at a fundraiser for Biden's 2024 campaign, is largely credited as being the nail in the coffin to Biden dropping his re-election bid.\n\nAs part of the promotion for his new Broadway staging of Good Night and Good Luck, CNN asked the Oscar-winner who he thought should lead the Democrats going forward.\n\n'There's one person in particular I think is spectacular,' he said, before singling out Maryland Governor Moore, who he says is 'levitating above' the rest.\n\n'I think he is a guy that handled this tragedy in Baltimore beautifully. He's two tours of active duty in Afghanistan. He speaks sort of beautifully, he's smart. He's a proper leader.'\n\nClooney is referring to Baltimore's Key Bridge collapse in early 2024 which killed six maintenance workers. \n\n'I like him a lot, I think he's someone we could all fall in behind,' Clooney added. \n\nHe also cited Kentucky Governor Andy Beshear - Clooney is a native of the state - and Michigan Governor Gretchen Whitmer as two possible contenders. \n\n'We have to find somebody rather soon,' Clooney warned Jake Tapper. \n\nMoore has been seen as a potential standard-bearer, with some even referring to him as the 'next Obama.' \n\nJohn Ronquillo, the director of the Institute for Public Leadership and a professor at the University of Maryland, said Moore could be on the same path as Barack Obama - rising rapidly through the political ranks to ascend to the White House.\n\n'While I want to be careful with comparisons — Barack Obama is Barack Obama and Wes Moore is Wes Moore — there's no denying that they've both had a meteoric ascent to political prominence,' Ronquillo told The Hill newspaper.\n\nObama endorsed Moore's bid for governor and cut a campaign ad for him. \n\nMoore's ascendency comes as polls show voters are infuriated with the current Democratic leadership. Recent polls from NBC News and CNN showed the party is at its lowest approval rating ever: 27 percent and 29 percent, respectively.\n\nThis is Clooney's first thoughts on the future of the Democrat Party after he pushed its past out the door last year. \n\nBack in early July - just over a month before the 2024 Democratic National Convention - Clooney penned the New York Times op-ed weeks after Biden's troubling performance in the June Presidential debate.\n\n'I love Joe Biden. As a senator. As a vice president and as president. I consider him a friend, and I believe in him. Believe in his character. Believe in his morals. In the last four years, he's won many of the battles he's faced,' Clooney said in the op-ed, just weeks after he hosted a fund-raiser for Biden himself. \n\n'But the one battle he cannot win is the fight against time. None of us can. It's devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe 'big f***ng deal' Biden of 2010. He wasn't even the Joe Biden of 2020. He was the same man we all witnessed at the debate,' Clooney opined.\n\nHe also plainly stated, 'We are not going to win in November with this president. On top of that, we won't win the House, and we're going to lose the Senate.'\n\n'This isn't only my opinion; this is the opinion of every senator and Congress member and governor who I've spoken with in private. Every single one, irrespective of what he or she is saying publicly,' Clooney continued.\n\nThe actor thought removing Biden from the ticket would, 'enliven our party' and 'wake up voters' who had 'checked out' even before the debate.\n\nThe op-ed was just part of a growing chorus among Democrats for Biden to step down, which he ultimately did just 11 days later on July 21, officially endorsing his Vice President Kamala Harris to run in his stead.\n\nClooney was quick to thank Biden for stepping out of the way, likening the move he helped foist on the commander in chief as 'saving Democracy' - and said he was excited for Harris and her 'historic quest'. \n\nHe then doubled down on his endorsement of Harris by narrating a campaign advertisement that urged men to consider how voting for Trump would affect the women in their lives. \n\nClooney reaffirmed that seeing Biden at a Hollywood fundraiser being led off the stage by Barack Obama in June last year triggered him to write the piece. \n\nHe said he'd met with Biden and spoke to him for hours just a year before at the Kennedy Center and on that night in Hollywood, he 'saw someone much less sharp.'\n\nThe actor then took a shot at the press, saying: 'The media, in many ways, dropped the ball.'\n\nClooney reaffirmed that 'I've always liked Joe Biden and I like him still' but said that his obvious incapacities made it impossible to defend his record. \n\n'The Biden administration was terrible at explaining that we're a world economy, where we were actually doing better than all the other G7 countries.' \n\n'They were bad at telling the story because their messenger was not working at his best, to say the least,' Clooney told NYT this week.","summary":"George Clooney said who he sees as the next Democrat standard-bearer after he led the movement to push Joe Biden out in 2024.","url":"https://www.dailymail.co.uk/news/article-14620177/george-clooney-reveals-choice-democrat-party-leader.html","image":"https://i.dailymail.co.uk/1s/2025/04/17/00/97366601-0-image-a-17_1744844960440.jpg","video":null,"publish_date":"2025-04-16 23:37:31","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":0.005},{"id":311917482,"title":"AOC has made herself a legit White House contender — and a GOP threat","text":"Alexandria Ocasio-Cortez has come a long way since 2018.\n\nWhen she first arrived on the political scene by beating out not just an incumbent, but a member of her party’s leadership in a Democratic primary contest, she was a rebel — an avatar of insurgent impulses within her coalition.\n\nAnd, among Republicans, something of a joke.\n\nNow, she’s the Democratic Party’s most popular elected official.\n\nA Yale University poll released this week found that among Democrats, Ocasio-Cortez boasts the single highest net favorability rating of all the party’s many potential 2028 presidential candidates — a sky-high 62%.\n\nIn addition, 41% of the same cohort said they have a “strongly favorable” opinion of the progressive congresswoman — again, the largest proportion to say as much about any Democrat.\n\nAnd when asked who they would support if the 2028 Democratic presidential primaries were held today, AOC finished a very strong second.\n\nFormer vice president Kamala Harris, at 28%, was the only prospective candidate to edge her out.\n\nOcasio-Cortez’s 21% placed her well ahead of bronze medalist Pete Buttigieg, at 14%.\n\nIt’s hard to overstate just how impressive a feat this is, especially considering the 35-year-old New Yorker also had the second-highest name recognition in the poll, behind only Harris.\n\nJust 11.7% of the poll’s Democrats said they haven’t heard of or have no opinion of her, which makes her superb favorability rating all the more breathtaking.\n\nBut wait, there’s more.\n\nHarris is a very, very soft front-runner, if she can even be called that.\n\nThe 2024 Democratic presidential nominee lost every single battleground state to Donald Trump last fall.\n\nAs Trump continues to facilitate liberal teeth-gnashing through his second term, anger at Harris over her dismal performance will only grow.\n\nAnd so will Democrats’ appetite for a fire-breather like AOC, who can count on Sen. Bernie Sanders to throw his full weight behind her.\n\nWhen one of Harris’ opponents on a primary debate stage asks her why voters should trust her to win this time around, what satisfying answer could she possibly produce?\n\nShe’s already 0-for-2 on the presidential campaign trail, since when Harris first ran for the presidency back in 2020, she flamed out spectacularly.\n\nWith AOC well-positioned to make a run at the Democratic nomination in 2028, no doubt some Republicans will be giddy at the prospect of facing down this self-described socialist with demonstrated champagne tastes.\n\nNational Review’s Rich Lowry has gone so far as to submit that if she’s the party’s future, Democrats stand no chance.\n\nIt’s true that any competent GOP campaign will make significant hay of AOC’s glaring vulnerabilities.\n\nThe Boston University economics and international relations major has regularly embarrassed herself on both topics.\n\nHer Green New Deal package was so unpopular that it was mocked out of existence.\n\nShe lacks any of the executive or managerial experience that persuadable voters claim to value in a candidate.\n\nAnd although she has a talent for stealing headlines, they’re often the wrong ones.\n\nHer taste for the good life — glamming it up at the Met Gala (then stiffing designers on the bill) and taking first-class flights on her way to an anti-oligarchy rally — undermines her message to the working class.\n\nAs does her weepy open-borders advocacy.\n\nBut her potential opponents would be unwise to underestimate her.\n\nShe’s only just become constitutionally eligible for the Oval Office, but already has an adoring national following that hangs on her every word, as her cross-country tour with Sanders this month demonstrates.\n\nThe enthusiasm she inspires on the left is matched only by that which Trump evokes on the right.\n\n“She is a rockstar, AOC,” one fan told The Post’s Kirsten Fleming at a rally in Idaho this week. “It’s like, Madonna and AOC.”\n\nThat’s not the only similarity between the current president and the woman who might very well be vying to succeed him.\n\nWhile some of Ocasio-Cortez’s far-left positions — including her anti-fossil fuel crusade and support for punitive tax rates — would likely hurt her in the polls, it’s more important that she would offer Americans a bold vision.\n\nAfter all, not every policy Trump campaigned on has been popular on its own.\n\nYet he’s overcome voters’ reservations about them because they come as part of a larger, coherent program that’s anything but timid.\n\nAs Ronald Reagan put it, the American electorate rewards those who bear banners of “bold unmistakable colors” rather than “pale pastels.”\n\nAOC waves just such a banner — and has more raw political talent in her pinky than the last three Democratic nominees combined.\n\nSeven years ago, she was a punchline. \n\nBut right now, she has as good a chance as anyone of becoming our next president\n\nIsaac Schorr is a staff writer at Mediaite.","summary":"As Ronald Reagan put it, the American electorate rewards those who bear banners of “bold unmistakable colors” rather than “pale pastels.”","url":"https://nypost.com/2025/04/16/opinion/aoc-has-made-herself-a-legit-white-house-contender-and-a-gop-threat/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/congresswoman-alexandria-ocasio-cortez-speaks-102807943.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-04-16 23:22:23","author":"Isaac Schorr","authors":["Isaac Schorr"],"language":"en","category":"politics","source_country":"zm","sentiment":0.081},{"id":311915306,"title":"George Clooney Says One Democrat is 'Levitating' Above Others","text":"In an exclusive interview with CNN's Jake Tapper that aired Wednesday night, actor George Clooney said that Maryland Gov. Wes Moore is \"levitating\" above other rising stars in the Democratic party.When asked by Tapper, \"who do you have your eye on?\" Clooney also noted Kentucky Gov. Andy Beshear, from his home state, and Michigan Gov. Gretchen Whitmer.However, he told Tapper that Moore was \"levitating\" above them. He said that he believes Moore handled \"tragedy beautifully\" last year after Baltimore's Francis Scott Key bridge collapsed.\"He was active-duty military. He speaks well, he's smart. He's a proper leader ... I like him a lot. He could be someone we all join in behind, and we have to find somebody rather soon. It's our job now to put together a proper team to stand up,\" Clooney told Tapper in the sit-down interview.Clooney is widely regarded by many Democratic supporters in Hollywood as a guiding voice, thanks to his longstanding activism and political engagement. His New York Times op-ed last summer, urging then-President Joe Biden not to seek reelection, was seen as a turning point—galvanizing a broader movement that ultimately culminated in Biden's decision to withdraw from the race.Clooney told Tapper that rather than automatically handing the nomination to then-Vice President Kamala Harris, the Democratic Party should have held an open \"quick\" primary contest.\"I think we have some really good governors,\" Clooney said.This is a developing news story and will be updated with additional information.Update: 4/16/25, 7:07 p.m. ET: This article has been updated with additional information and remarks.","summary":"Clooney also addressed the fallout from his New York Times op-ed calling for then-President Biden to exit the presidential race.","url":"https://www.newsweek.com/clooney-2060768","image":"https://d.newsweek.com/en/full/2628700/clooney-broadway.jpg","video":null,"publish_date":"2025-04-16 22:52:54","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"us","sentiment":0.644},{"id":311913658,"title":"George Clooney dropping support from Biden was his ‘civic duty’","text":"“Are people still mad at you for that?” Tapper asked the Hollywood star.\n\n“Some people, sure,” Clooney replied.\n\nFollowing Biden’s poor debate performance on June 27, many Democrats urged their party members not to overreact. There were others, however, who pleaded with the incumbent president to step aside and let a new, younger face carry the party forward. Clooney was one of them, writing a July 10 op-ed in the New York Times titled “I Love Joe Biden. But We Need a New Nominee.”\n\n“Was he tired? Yes. A cold? Maybe. But our party leaders need to stop telling us that 51 million people didn’t see what we just saw,” Clooney wrote at the time. “We’re all so terrified by the prospect of a second Trump term that we’ve opted to ignore every warning sign.”\n\nClooney is one of Hollywood’s most famous Democratic supporters and even hosted a fundraiser for Biden weeks before the debate.\n\nFewer than two weeks after Clooney’s op-ed was published, Biden dropped out of the presidential race on July 21, endorsing his then-vice president, Kamala Harris, to take his place. She would go on to win the Democratic nomination but lose the general election to President Donald Trump.\n\nOther Democrats, many of whom had much more sway in Washington, D.C., than Clooney, such as former House Speaker Nancy Pelosi (D-CA), were seen as having privately pushed Biden to drop out of the race.","summary":"Actor George Clooney said that his decision calling for then-President Joe Biden to drop out of the 2024 presidential campaign was based on his sense of “civic duty.” “I don’t know if it was brave,” Clooney told CNN&#8217;s Jake Tapper in a preview of his The Lead interview airing Wednesday. “It was a civic duty. [&#8230;]","url":"https://www.washingtonexaminer.com/news/3382763/george-clooney-drop-support-biden-2024-civic-duty/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/12/George-Clooney.webp","video":null,"publish_date":"2025-04-16 22:17:05","author":"Elaine Mallon","authors":["Elaine Mallon"],"language":"en","source_country":"US","sentiment":-0.247},{"id":311909842,"title":"Why David Muir left his World News Tonight predecessor 'miffed'","text":"David Muir was named as one of the 100 figures honored by TIME in their annual TIME 100 issue, as an \"Icon\" over the past year for his reporting and contributing to World News Tonight's sky high ratings.\n\nThe 51-year-old journalist had several highlights over the past year, most notably serving as one of the moderators for the presidential debate between Donald Trump and Kamala Harris with weekend World News Tonight anchor Linsey Davis.\n\nHis tribute this year was penned by none other than Diane Sawyer, a close friend of David's, veteran ABC News journalist, and his predecessor on World News Tonight, hosting the show from 2009-2014.\n\nDiane's tribute to David\n\n\"At 6:28 p.m. in New York City, a man lopes up two flights of stairs, speeds down the hall, and slides into the anchor chair. At 6:30 p.m., the camera goes live,\" she wrote of his fast-paced life behind the scenes.\n\n\"David Muir anchors the nation's most-watched television news program, ABC World News Tonight,\" Diane, 79, continued. \"Every night more than 8 million Americans trust him to make sense of the day.\" \n\nShe compared him to the legendary Peter Jennings, the sole anchor of the primetime news program from 1983 until his death in 2005, admiring his tenacity and desire to be on the ground for the best story.\n\n\"Like Peter Jennings before him, David is authoritative and dynamic – the first out the door to the story,\" Diane added. \"Iraq's hunt for ISIS. Hurricanes, fires. He traveled days to hold the hands of starving children in Madagascar and South Sudan, leading to millions of dollars in donations to the World Food Programme.\"\n\nDavid began his career in journalism when he was just a teenager, finding an internship with a local newsroom in Syracuse thanks to the efforts of his parents. \"I think I know what destiny looks like because I've seen a photo of a serious 13-year-old boy, talking his way into an internship at the local TV station,\" Diane referenced. \n\n\"Now he's the anchor chosen for interviews by Popes and Presidents. He shows up calm, respectful, and fearless.\" Take a look at his early days as a journalist in the video below...\n\nTouching more on his personality off-camera, she added: \"I am lucky that my successor is also the irreverent friend I want to hang out with when the camera shuts down,\" ending on a comedic note with: \"Though I am also miffed that he's the guy who can leap two flights of stairs, vault into the anchor chair, and never lose focus – or his breath.\"\n\nDavid shared Diane's tribute on his personal Instagram page, adding a simple heart emoji. He then also included the portrait used for his profile and wrote: \"Thank you @time. A true honor.\"\n\nFive of this year's honorees were spotlighted with a set of TIME covers, including tennis legend Serena Williams, recent Academy Award nominee Demi Moore, singer-songwriter Ed Sheeran, rapper and recent Summer Olympics correspondent Snoop Dogg, and DeepMind Technologies CEO Demis Hassabis.","summary":"David Muir's predecessor on World News Tonight, Diane Sawyer, shared her thoughts on the ABC News anchor in a recent tribute, read…","url":"https://www.hellomagazine.com/film/826961/david-muir-world-news-tonight-predecessor-diane-sawyer-reaction/","image":"https://images.hellomagazine.com/horizon/landscape/e0f7ec3d0c9e-david-muir-speaking.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-04-16 22:00:00","author":"Ahad Sanwari","authors":["Ahad Sanwari"],"language":"en","source_country":"gb","sentiment":0.353},{"id":311922906,"title":"CNN’s Enten: Regretful Trump Voters Do 'Not Exist'","text":"CNN senior data reporter Harry Enten said Wednesday on CNN’s “News Central” that media reports about President Donald Trump’s voters regretting their choice was “fanciful.”\n\nEnten said, “I hear all these stories, all these articles, all the Trump voters, they regret what they did back in 2024. I’m here to tell you, uh-uh. Very few of them regret what they did back in 2024. What are we talking about? Trump voters, looking back at 2024, we got a new poll out. The poll was conducted this month. What percentage would change their vote to a different candidate? We’re talking just 2%, just 2%. That’s not even a wide spot on the road.”\n\nHe continued, “Then you ask, okay, the same question that Kamala Harris voters and it turns out the numbers are rather similar. If folks got to be able to redo their vote that they had back in 2024, would the result be any different? I doubt it would be. I doubt if it would be or if it would still be extremely close. The bottom line is for all this talk of Trump voters regretting their vote in the numbers, it really just doesn’t show up.”\n\nEnten added, “The bottom line is this, if there’s some idea out there that Trump voters are going around, ‘Man, I wish I had voted for Kamala Harris instead of Donald Trump.’ The numbers say that it is a fanciful universe. It really, for the most part, does not exist.”\n\nFollow Pam Key on X @pamkeyNEN","summary":"CNN senior data reporter Harry Enten said Wednesday on CNN's \"News Central\" that media reports about President Donald Trump's voters regretting their choice was \"fanciful.\"\n\n\nThe post CNN’s Enten: Regretful Trump Voters Do &#8216;Not Exist&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/04/16/cnns-enten-regretful-trump-voters-do-not-exist/","image":"https://media.breitbart.com/media/2024/10/eton-640x335.jpg","video":null,"publish_date":"2025-04-16 21:45:31","author":"Pam Key","authors":["Pam Key"],"language":"en","category":"politics","source_country":"US","sentiment":-0.196},{"id":311904664,"title":"Trump tariffs’ squeeze on small businesses: Letters to the Editor — April 17, 2025","text":"The Issue: The negative effect of President Trump’s tariffs on small-business owners around the country.\n\nThe Editorial Board could not be more spot-on that “the little folks” are getting slammed by these tariffs (“Mom-&-pops are the ones paying the price,” April 15).\n\nAs a small-business owner, I was stunned by President Trump’s initial 25% tariffs. But I never passed those new costs onto my customers. Why? Because the minute prices increase, people look elsewhere.\n\nThis new 145% tariff on China, however, has really rocked my world.\n\nI voted for Trump because I thought he would have the best interests of small businesses in mind, and the thought of counting on Kamala Harris to bring America to the status it once enjoyed sent shivers up my spine.\n\nPlease, Mr. President, if you or your staff are reading this: Let’s make America affordable again. Let us exhale.\n\nCatherine Kropf Harris\n\nWhy is The Post pandering to the left with this editorial on how tariffs are going to crush small businesses?\n\nIf you’re a business owner who’s getting products from China, I suggest you find another country for production — because if you’re just using their labor and selling your merchandise here, you’re part of the problem.\n\nIt’s time for everyone to tighten their belts a bit, so we can deal with this crushing debt that will bankrupt the country. The can has been kicked down the road for generations, and we’re at the tipping point. This is pathetic. \n\nJames Schwartz\n\nTrump’s new tariff policy and ensuing trade war have achieved only one thing — re-energizing the Democrats.\n\nTrump-policy supporters are trying to put a smiley face on this disaster, reminding people that a little pain in the short term will lead to big rewards in the long term. But what’s their definition of “long term”? One year, three years, 10 years? Trump promised to repair the Biden economic damage on Day 1.\n\nAs your editorial pointed out, it’s the little folks who are getting slammed — the very people who voted for Trump and make up the backbone of the country and his base. \n\nJ.J. Crovatto\n\nThese small companies should never have sold their souls to China.\n\nThere are much friendlier countries that pay lower wages and aren’t looking to destroy us whose people would have gladly performed this work — if it’s that important for these businesses to pay slave-like labor rates to maximize their profits. \n\nJoseph J. Grassi\n\nPort St. Lucie, Fla.\n\nThe Issue: Widespread tolerance among Democrats for arson, vandalism, and worse by extreme leftists.\n\nWhile nonviolent protests should, in my opinion, be allowed, violent tactics are evil and should be condemned (“Bust in GOP, Tesla arsons,” April 15).\n\nIt would seem that those who use violence in order to achieve their goals believe it is justified because they feel that only their way of seeing the world should be permitted.\n\nBut this violence is a threat to those who hold differing views.\n\nPeople who use violence as a means to achieve their goals must be severely punished. \n\nDemocrats are notorious for condemning violence, except when it is directed at their political foes.\n\nTheir silence in the face of violent rhetoric, people setting fire to Tesla vehicles and dealerships and the gleeful support for cold-blooded alleged assassin Luigi Mangione is sinking them deeper in moral decay. \n\nJoAnn Frank\n\nClearwater, Fla.\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"Post readers discuss the negative effect of President Trump’s tariffs on small-business owners around the country.","url":"https://nypost.com/2025/04/16/opinion/trump-tariffs-squeeze-on-small-businesses-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/04/newspress-collage-4ebyc4n6g-1744836384693.jpg?quality=75&strip=all&1744822045&w=1200","video":null,"publish_date":"2025-04-16 21:38:38","author":"Post Readers","authors":["Post Readers"],"language":"en","source_country":"zm","sentiment":-0.444},{"id":311897134,"title":"Melinda French Gates Met Trump During His First Term. Would She Meet with Him Again Now?","text":"Melinda French Gates has strong feelings about President Donald Trump. \n\n In a recent interview with The Sunday Times, the 60-year-old philanthropist, who is currently promoting her new book The Next Day, was asked about Trump — and whether she would be willing to meet with him again, like she did during his first term.\n\n \"I don’t think there’s any reason to right now,\" French Gates, who has committed billions to help women and girls, told the outlet.\n\n \"I meet with people where I feel like we can make progress on issues,\" she added.\n\n French Gates said that she did meet with Trump during his first term in order to \"try and keep the US funding up for contraceptives, because they make such a difference in women’s lives.\" As for the result of that conversation, French Gates took a lengthy pause before answering, \"I didn't get anywhere. We'll just say that.\"\n\n French Gates also took aim at the Trump administration's sudden cuts to the U.S. Agency for International Development. (PEOPLE previously reported that USAID workers have been reduced from over 10,000 to 290, according to a former senior official for the organization.)\n\n “I do think leadership matters. You look at the leaders who are in place right now and it’s devastating, but it’s not a surprise,\" she said.\n\n \"Look at USAID,\" French Gates added. \"Republican and Democratic administrations had supported it. Now we have an administration, because of their values and the hubris, we will have 17 million women next year who do not have access to maternal mortality services.\"\n\n French Gates’ ex-husband Bill Gates has met with Trump after the 2025 presidential election, previously telling The Wall Street Journal that they had a three-hour-long dinner.\n\n The Microsoft co-founder, who reportedly donated $50 million to Kamala Harris' presidential campaign and did not attend Trump's inauguration, said he was \"impressed\" by Trump's interests and called their conversation \"quite wide-ranging.\"\n\n The following month, Gates told Today's Savannah Guthrie that he met with Trump again in order to advocate for USAID. \"I'm doing my best to make sure we keep the things that I think are very value-based.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n In a recent cover story, French Gates opened up to PEOPLE about her commitment to philanthropy through Pivotal Ventures, which she founded in 2015.\n\n “The organizations we support have removed so many barriers holding back women and families,” she says. “They’re making caregivers’ lives easier. They’re helping young people find mental health services that work for them. They’re getting more women into positions of power.” \n\n In her new book, she also wrote about the impact the changing political climate had on her decision to leave the Gates Foundation, which she founded with her ex-husband.\n\n “I am simply not willing to accept the idea that my granddaughters could grow up with less freedom than I had,” she wrote. “And I knew that by leaving the foundation, I would have more time and resources to devote to this fight–as well as, for the first time in my philanthropic career, full control over how those resources were used.”","summary":"\"I meet with people where I feel like we can make progress on issues,\" the philanthropist said","url":"https://people.com/melinda-french-gates-reveals-whether-she-would-meet-with-trump-now-11715764","image":"https://people.com/thmb/re8q6pmWQGfKBQwkc9FxSCms5nA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Melinda-French-Gates-trump-041525-d90cc87df306472eb90d2c10baf64a30.jpg","video":null,"publish_date":"2025-04-16 21:34:37","author":"Raven Brunner","authors":["Raven Brunner"],"language":"en","category":"politics","source_country":"US","sentiment":-0.072},{"id":311927332,"title":"Vote Palestine platform aims to put Gaza on the ballot","text":"A grassroots campaign to put Palestine on the ballot has garnered support from 181 candidates running for a seat in the House of Commons. According to a post from the “Vote Palestine” campaign’s Instagram, 124 candidates from the NDP, 44 Green Party candidates and 13 Liberal Party candidates have provided full platform endorsement as of April 11. \n\nThe platform’s organizers say their calls are guided by Canada’s obligations under international law. The platform has five key demands, including a two-way arms embargo, the end of Canadian involvement in illegal Israeli settlements, a plan to address anti-Palestinian racism, the recognition of the state of Palestine and proper funding of relief efforts in Gaza. \n\nCanada is heading towards a federal election on April 28, and Canadians have a multitude of demands amidst economic instability exacerbated in part by a trade war with the U.S. Ahead of the debate taking place this week, Abacus data showed that Canadians most want to hear politicians’ plans for handling U.S. relations and the country’s administration headed by Donal​​d Trump. Other top concerns are housing affordability and healthcare access. \n\nREAD MORE: Worker’s agenda for the federal election\n\nWhile international conflicts like the violence in Gaza are not top of mind for voters, Vote Palestine organizers maintain that this issue should remain in Canadians’ consciousness. In fact, how the government reacts to attacks on Gaza is related to those top–of-mind issues Canadians are concerned about. \n\nHassan Husseini, a member of Unifor and an activist on the national steering committee of Labour for Palestine, said working people should support efforts for justice in Palestine because it aligns with their class interests. \n\n“I​​ work in the labor movement and I negotiate collective agreements for workers across the country,” Husseini said. “Often when we get to the bargaining table, they tell us there is no money, even when you bargain with governments. Yet we turn around and see that they are giving money to regimes that do nothing but violate their own people’s rights.” \n\nThis money should be going to essential public and social services, Husseini said. This could address the need for housing and health care. Money divested from arms could also fund protections for laid-off workers amidst Donald Trump’s tariffs. \n\nPolling from the Angus Reid Institute shows the Liberals are currently leading the polls closely followed by the Conservatives. How parties handle the issue of violence in Gaza could affect voter intentions from progressives. \n\nA Leger poll done for the National Post shows 45 per cent of Canadians agree that Israel is committing genocide in the Gaza Strip, while 23 per cent disagree, and 32 per cent don’t know.\n\nSome concerned voters are looking at the mistakes of the Democrats’ campaign in the 2024 US presidential election as an example of why candidates should take a clear stance on Palestine. \n\nAn article by Mohammed Sinan Siyech, a researcher with a PhD in Islamic and Middle East Studies from Edinburgh University, argues that the Democrats, led by Kamala Harris, lost votes in part because of their lukewarm support of Palestine. \n\nSinan Siyech pointed to polling which showed that in three of the seven swing states, between 30 to 39 per cent of voters were more likely to vote Democrat if the US were to withhold aid to Israel as a result of the genocide in Gaza.","summary":"Vote Palestine has issued a platform for the 2025 election which are guided by Canada's obligations under international law.\n\n\nThe post Vote Palestine platform aims to put Gaza on the ballot appeared first on rabble.ca.","url":"https://rabble.ca/politics/canadian-politics/vote-palestine-platform-aims-to-put-gaza-on-the-ballot/","image":"https://rabble.ca/wp-content/uploads/2024/12/14535201589_30d3c039a4_o-e1733860164331.jpg","video":null,"publish_date":"2025-04-16 21:07:15","author":"Gabriela Calugay-Casuga","authors":["Gabriela Calugay-Casuga"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.195},{"id":311909534,"title":"RFK Jr. links autism rise to ‘environmental toxins,' contradicting CDC findings","text":"IE 11 is not supported. For an optimal experience visit our site on another browser.\n\nRFK Jr. links autism rise to ‘environmental toxins,' contradicting CDC findingsApril 16, 202504:17‘I’ll do it for them’: House Democrat says she’ll hold town halls when GOP colleagues won’t07:18Two judges consider holding Trump admin in contempt for defying court orders09:32Now PlayingRFK Jr. links autism rise to ‘environmental toxins,' contradicting CDC findings04:17UP NEXTDemocratic ads highlight Elon Musk’s role within the Trump administration01:29Kornacki: Kamala Harris could face 'hiccups' if she enters California gubernatorial race03:28Trump suggests deporting U.S. citizens who commit crimes: Is it legal?04:26Pres. Trump signals new tariffs and exemptions amid trade confusion09:18Sen. Booker says ‘there’s no wisdom’ in tariffs as other Democrats walk tightrope: Full interview09:21Sen. Cory Booker: Mistaken deportations threaten ‘due process rights of everyone’01:32There’s ‘enough smoke’ for Congress to investigate possible insider trading on tariffs, Booker says01:54Billionaire investor Ray Dalio is worried about 'something worse than recession’: Full interview09:09Peter Navarro says U.S. ‘has no defense other than tariffs’: Full interview12:08Peter Navarro says ‘Elon and I are great’ after Musk calls him ‘dumber than a sack of bricks’01:26New book reveals Biden campaign discussion, as 2024 campaign unraveled06:48Louisiana shrimpers hope for jumbo benefits from Trump tariffs02:35Lawyer: Government playing a ‘game’ by not providing information on mistakenly deported Maryland man04:38'Massive game of chicken' between U.S. and China on trade10:14‘Still way too much chaos in economy’ despite Trump’s pause on some tariffs: Democratic senator07:57Trump’s tariffs on China could be felt by consumers ‘within weeks’11:16Trump ‘caved today’ after pausing tariff hikes on most countries, House Democrat says07:35Meet the PressRFK Jr. links autism rise to ‘environmental toxins,' contradicting CDC findings04:17CopiedNBC News Health and Medical Reporter Berkeley Lovelace Jr. joins Meet the Press NOW to discuss HHS Sec. Robert F. Kennedy Jr.’s claims that rising rates of autism are \"preventable,\" contradicting expert opinion.April 16, 2025Get more newsLiveon‘I’ll do it for them’: House Democrat says she’ll hold town halls when GOP colleagues won’t07:18Two judges consider holding Trump admin in contempt for defying court orders09:32Now PlayingRFK Jr. links autism rise to ‘environmental toxins,' contradicting CDC findings04:17UP NEXTDemocratic ads highlight Elon Musk’s role within the Trump administration01:29Kornacki: Kamala Harris could face 'hiccups' if she enters California gubernatorial race03:28Trump suggests deporting U.S. citizens who commit crimes: Is it legal?04:26Get more newsLiveonBest of NBC NewsPlay AllNew allegations made against coach accused of murderNBC News NOWFyre Fest 2 postponed, date dependent on location NBC News NOWActress Michelle Trachtenberg died of diabetes complicationsICE agents smash car window during arrestTrump's funding cuts may lead to euthanized primatesTrump admin pushes self-deportations as numbers lagPlay All","summary":"NBC News Health and Medical Reporter Berkeley Lovelace Jr. joins Meet the Press NOW to discuss HHS Sec. Robert F. Kennedy Jr.’s claims that rising rates of autism are \"preventable,\" contradicting expert opinion.","url":"https://www.nbcnews.com/meet-the-press/video/rfk-jr-links-autism-rise-to-environmental-toxins-contradicting-cdc-findings-237611077603","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_04/1744837375707_now_mtp_clip_rfkautism_250416_1920x1080-mn3kdp.jpg","video":null,"publish_date":"2025-04-16 21:03:03","author":null,"language":"en","source_country":"us","sentiment":-0.293},{"id":311890368,"title":"Here’s the ‘Green’ Fuel the Left Refuses to Celebrate This Earth Day","text":"As Earth Day approaches on Tuesday, climate activists remind us of the importance of cutting carbon emissions. Yet, one inconvenient truth escapes their green-tinged talking points: The rise of natural gas in our power sector is the No. 1 driver of the reduction of emissions in the United States—not wind or solar.\n\nIf we want affordable and reliable power while being responsible stewards of the environment, natural gas is our most significant comparative advantage in the United States.\n\nBetween 2005 and 2019, the U.S. reduced carbon dioxide emissions by more than 800 million metric tons. The U.S. Energy Information Administration credits nearly two-thirds of that reduction to natural gas.\n\nZoom in more closely, and you’ll find the same trend in Pennsylvania. The Keystone State—a powerhouse of energy production thanks to the development of the Marcellus Shale, and the second largest producer of natural gas in the nation—reduced its power-sector carbon emissions by nearly 11% in one year—the most significant year-over-year drop in decades.\n\nIts emissions success story also comes from a market transition from coal to natural gas. Natural gas comprises 60% of Pennsylvania’s power generation, while 31% comes from nuclear, 5% from coal, and 4% from renewables (wind and solar). With this resource mix, Pennsylvania is one of only three states in the region that have successfully reduced emissions while increasing energy production.\n\nNatural gas production in the Marcellus Shale region propelled the United States from being a net importer to the world’s largest exporter of natural gas. Today, Pennsylvania is the country’s top exporter of electricity.\n\nYet top Democrats—and some Republicans—remain duty-bound to the climate agenda and green energy donors. Instead of celebrating natural gas as a boon to both our energy independence and the environment, climate alarmists continue to vilify the industry. And by doing so, Pennsylvania Democrats continue to lash out against the sector that’s been giving Pennsylvania a competitive advantage.\n\nFor starters, former Gov. Tom Wolf entered Pennsylvania into the Regional Greenhouse Gas Initiative through an unconstitutional executive order in 2019. The initiative is a multistate cap-and-trade program intended to force states to lower their carbon emissions through a carbon tax placed on energy producers and, ultimately, consumers through increased energy prices. Some estimates suggest the initiative will cost the commonwealth up to 22,000 energy jobs and raise consumers’ electricity bills by a whopping 30%.\n\nFortunately, good constitutional governance intervened. The Commonwealth Court ruled that Wolf’s actions were illegal, stating clearly that a governor has no authority to unilaterally levy taxes without legislative approval. Gov. Josh Shapiro, Wolf’s successor, took up the torch and appealed the decision. The Pennsylvania Supreme Court will hear oral arguments about the legality of Pennsylvania’s entry into the initiative on May 13. The initiative remains dormant while litigation is ongoing.\n\nAll litigation aside, the fact remains that Pennsylvania’s participation in a scheme like the Regional Greenhouse Gas Initiative is completely unnecessary. The Keystone State already has a proven track record of reducing emissions without causing energy scarcity simply by following the market-led push for natural gas. Greater natural gas development has brought the state greater energy independence, more reliable electricity, stable jobs, and—much to the chagrin of climate activists—fewer carbon emissions.\n\nIn fact, Pennsylvania has reduced its emissions more efficiently than states that are already participating in the initiative. Between 2018 and 2023, Pennsylvania’s emissions dropped nine million metric tons. Meanwhile, New York—a member of the initiative and a state with about 6 million more people than Pennsylvania—dropped only 1 million metric tons.\n\nMoreover, states participating in the Regional Greenhouse Gas Initiative are struggling to contain costs. The Department of Environmental Protection in New Jersey, a state that is one of the initiative’s original charter members, noted that “participating RGGI states already have some of the highest retail electricity rates in the nation, with six of the nine states in the top 10, and increased energy costs should be of major concern.” Carbon taxes touch every corner of the economy and raise costs for families and businesses.\n\nTo avoid the initiative’s inevitable fallout, some Democrats have tried to cleverly rebrand the scheme. For example, Shapiro rebranded the Democrat’s climate agenda through a series of new green-energy efforts known as the Lightning Plan. Layered inside this plan is the Pennsylvania Climate Emissions Reduction Act, Shapiro’s homegrown, state-specific version of the initiative. His new agenda diminishes the natural gas industry’s role that led the commonwealth toward cleaner, more reliable energy.\n\nBut just like every Green New Deal knockoff, Shapiro’s policy package lacks political acumen. All these proposals—which prop up less-reliable energy sources by setting mandates for renewable energy usage and enact burdensome red tape that slows down permitting and production for fuels like oil and natural gas—put energy security at risk and cost Americans in terms of jobs and energy prices.\n\nOn Election Day 2024, voters rejected the Left’s climate alarmist agenda in Pennsylvania and elsewhere. Those who remained skeptical of former Vice President Kamala Harris’ flip-flop on fracking for oil and natural gas instead embraced President Donald Trump’s “drill, baby, drill” strategy.\n\nNatural gas will help usher in a new era of American energy dominance—one that’s more reliable, secure, affordable, and—despite what the alarmists claim—cleaner.\n\nSo, if there’s one thing that environmentalists should celebrate this Earth Day, it’s natural gas.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"As Earth Day approaches on Tuesday, climate activists remind us of the importance of cutting carbon emissions. Yet, one inconvenient truth escapes their green-tinged talking... Read More\n\n\nThe post Here’s the ‘Green’ Fuel the Left Refuses to Celebrate This Earth Day appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/04/16/heres-green-fuel-left-refuses-celebrate-earth-day/","image":"https://www.dailysignal.com/wp-content/uploads/2025/04/gas-2.jpg","video":null,"publish_date":"2025-04-16 20:25:28","author":"Andre Beliveau","authors":["Andre Beliveau"],"language":"en","source_country":"us","sentiment":-0.105},{"id":311889676,"title":"DNC vice chairman announces primary challenges for 20 House Democrats","text":"April 16 (UPI) -- The Leaders We Deserve political organization led by Democratic National Committee Vice Chairman David Hogg will oppose 20 House Democrats during the 2026 primaries.\n\nLeaders We Deserve supports \"young progressive candidates\" who \"face systemic barriers\" to winning House elections and will spend $20 million to challenge older Democratic Party candidates in districts deemed safe for Democrats, Hogg announced Wednesday.\n\n\"While [President Donald] Trump creates new existential crises every day, too many elected leaders in the Democratic Party are either unwilling or unable to meet the moment,\" Hogg said in a prepared statement.\n\n\"We need a stronger Democratic Party that is ready to fight back\" by \"replacing ineffective, asleep-at-the-wheel members with Democrats who have the energy, passion and vision to meet this moment with the urgency our country deserves,\" he added.\n\nHogg, 25, attended Marjory Stoneman Douglas High School in Parkland, Fla., when mass shooter Nikolas Cruz shot and killed 14 students and three staff members and injured 17 others on Feb. 14, 2018.\n\nHe won election to the DNC as a vice chairman on Feb. 1 and told Politico he is opposing a \"culture of seniority politics\" within the Democratic Party while also leading Leaders We Deserve as its president.\n\n\"We need people, regardless of their age, that are here to fight,\" Hogg said.\n\nHogg's announcement will anger many people, he told an interviewer, adding that a \"smear campaign\" against him is likely to force him to stop the primary challenges.\n\nDNC officials during a March meeting distributed a \"neutrality policy\" requiring its leaders to remain impartial in party activities and their personal lives, but Hogg did not sign it, Politico reported.\n\n\"It is the DNC's longstanding position that primary voters -- not the national party -- determine their Democratic candidates for the general election,\" DNC Chairman Ken Martin said in a statement.\n\nHogg acknowledged he and Martin have \"different views\" regarding challenging incumbent Democratic Party lawmakers.\n\n\"There are disagreements in our party about the right way to approach this moment,\" Hogg told Politico.\n\nHe said his position within the DNC includes supporting primary challengers to incumbent lawmakers and \"our base is craving dramatic change\" by having \"younger faces stepping up.\"\n\nHogg did not cite specific House districts targeted for primary challenges but said Rep. Nancy Pelosi, D-Calif., and Rep. Jan Schakowsky, D-Ill., won't face primary challenges because they are \"fighters who are delivering.\"\n\nPrimary challenges are anticipated in New York, Maryland and Massachusetts, Politico reported.\n\nHogg co-founded the gun-safety group March for Our Lives and in July endorsed former Vice President Kamala Harris' presidential election run.","summary":"The Leaders We Deserve political organization led by Democratic National Committee Vice Chairman David Hogg will oppose 20 House Democrats during the 2026 primaries.","url":"https://www.upi.com/Top_News/US/2025/04/16/dnc-hogg-primary-challenges/5551744832877/","image":"https://cdnph.upi.com/ph/st/th/5551744832877/2025/upi/7c36c360898e90c0ba4066b74a1b9a70/v1.2/DNC-vice-chairman-announces-primary-challenges-for-20-House-Democrats.jpg","video":null,"publish_date":"2025-04-16 20:22:42","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":0.107},{"id":311883258,"title":"Senate incumbents haul in millions ahead of marquee 2026 races","text":"The campaign finance reports from the first three months of the year come as Democrats are facing a challenging map with open Senate seats in Michigan, Minnesota, and New Hampshire while defending Sen. Jon Ossoff in Georgia. The GOP is hoping to hang on to key Senate seats in North Carolina and Maine.\n\nIncumbents build campaign war chests\n\nOssoff, a first-term Democrat elected in a 2021 runoff election, raised $11 million in the first quarter of 2025, according to federal campaign finance reports. The Georgia Democrat is facing a tough reelection in the battleground, and his campaign said the haul is the most ever raised by an incumbent in the first quarter of an off-year. Ossoff faces no strong GOP challenger yet, as the field remains stalled while Georgia Gov. Brian Kemp considers entering the race.\n\nSen. Thom Tillis (R-NC) brought in $2.3 million last quarter, finishing with $4 million in the bank. With a possibly competitive primary ahead, and a tough general election if he advances, he’ll likely need every dollar. Democrats have placed a bullseye on his seat and are expected to pour millions into flipping it. \n\nSen. Susan Collins (R-ME) starts the cycle with $842,000 and $3.2 million in the bank, figures that fall short of her early fundraising from the 2020 race, when she brought in $1.5 million and ended Q1 with $3.8 million on hand. Her seat is a high priority for Republicans, especially given that Maine backed Kamala Harris in 2024. Despite the stakes, Democrats have yet to recruit a candidate to take her on.\n\nCompetitive Republican primaries on the horizon\n\nTexas is shaping up to host what’s likely to be the costliest Republican primary of the cycle, as Attorney General Ken Paxton mounts a challenge against incumbent Sen. John Cornyn (R-TX). On Tuesday, Cornyn reported a $2.5 million haul for the first quarter, but that topline number includes more than just his campaign funds. About $1.6 million went directly to his campaign, which now has $5.6 million on hand. The rest was split between his leadership PAC, which received $431,000, and a super PAC backing his reelection, which pulled in $254,000. Paxton announced his candidacy earlier this month, so figures for his fundraising are not out quite yet.\n\nIn Louisiana, Republican Sen. Bill Cassidy is also gearing up for a primary fight. He reported raising $1.36 million during the first quarter of 2025 with $7.5 million cash on hand, which his campaign said is the most ever by an incumbent Louisiana senator at this point in the campaign.\n\nCassidy was outraised by more than $1 million by state Treasurer John Fleming, who reported $2.2 million cash on hand, raising $263,194 in the first quarter and loaning his campaign $2 million.\n\nSen. Lindsey Graham (R-SC) fell far behind in fundraising this quarter, bringing in just over $1 million. In contrast, his Democratic challenger, businessman Mark Lynch, jumpstarted his campaign with a hefty $5 million personal investment. Despite the early gap, Graham enters the race with a sizable advantage: nearly $16 million already in the bank, while Lynch still faces a steep climb to catch up.\n\nIn the race to replace retiring Sen. Mitch McConnell (R-KY), Daniel Cameron, Kentucky’s former attorney general and the only declared candidate in the race so far, raised a modest $508,000. Rep. Andy Barr (R-KY) posted a strong fundraising performance, pulling in $1.8 million and closing the quarter with $5.3 million in cash.\n\nAfter losing to Sen. Elissa Slotkin (D-MI) in the November Senate race, former Republican Rep. Mike Rogers entered the Michigan Senate race this week. He may also face a primary challenge from Rep. Bill Huizinga (R-MI), who raised $857,000 in his latest filing.\n\nDemocrats gain an early advantage for open seats\n\nDemocrats are facing a setback as senators retire in Michigan, Minnesota, and New Hampshire, forcing the party to spend precious financial resources in key battlegrounds. However, early support from members of the House could help to bridge this funding gap.\n\nIn Michigan, Democratic Rep. Haley Stevens, who is considering a Senate bid, raised nearly $1.2 million by the end of March and currently holds over $1.6 million in her campaign account. \n\nIn New Hampshire, where Sen. Jeanne Shaheen (D-NH) is retiring, a primary showdown is simmering. Democratic Reps. Chris Pappas and Maggie Goodlander are attracting significant contributions. Pappas has already raised $655,500 after declaring his candidacy in the race. Goodlander, who is still weighing her own Senate run, brought in $532,600. On the Republican side, former Gov. Chris Sununu has decided not to run, while former Sen. Scott Brown (R-MA) has suggested he could enter the race.\n\nIn Minnesota, Democratic Rep. Angie Craig, who has yet to announce a Senate bid but is strongly considering it, raised $1.2 million, leaving her with $1 million in available funds. Meanwhile, Lt. Gov. Peggy Flanagan, who entered the race in mid-February, has already raised close to $452,000.\n\nSen. Dick Durbin (D-IL), 80, brought in only $43,000 during the first quarter of the year, fueling speculation that he may soon announce his retirement. Possible successors include three members of the House delegation, as well as Democratic Illinois Lt. Gov. Juliana Stratton.\n\nVULNERABLE REPUBLICANS POST STRONG FUNDRAISING QUARTER IN FIGHT TO KEEP HOUSE\n\nProgressive Democrats pick up traction\n\nAs Democrats face challenges countering President Donald Trump’s agenda in Washington, progressive members are capitalizing on their base’s frustration with both the president and the party, raking in substantial donations.\n\nSen. Bernie Sanders (I-VT), who is not up for reelection until 2031, raised $11.4 million in the first quarter and has over $19 million in available funds. This haul showcases the 83-year-old’s continued fundraising strength as he teams up with Rep. Alexandria Ocasio-Cortez (D-NY), holding town halls across the country. Ocasio-Cortez raised $9.6 million in the first three months of the year.","summary":"Democrats are off to an early fundraising advantage in major Senate battlegrounds, with progressive members in safe seats also pulling in substantial sums. Meanwhile, several Republican incumbents are ramping up for possibly tough primary fights. The 2026 midterm elections are already in full swing as fundraising reports filed Tuesday with the Federal Election Commission offer [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3382497/senate-incumbents-millions-marquee-2026-races/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/AP25091688221650-scaled-1024x683.webp","video":null,"publish_date":"2025-04-16 20:03:07","author":"Samantha-Jo Roth","authors":["Samantha-Jo Roth"],"language":"en","category":"politics","source_country":"US","sentiment":-0.069},{"id":311872066,"title":"Who wants to be a billionaire? Opinion","text":"THREE KEY FACTS\n\nAmerican comedian Bill Burr has made a career out of cutting social commentary.\n\nRecently, he turned his attention to billionaires.\n\nTo borrow a well-used Burr line, it was brutal.\n\n“These f***ing billionaires, they should be put down like f***ing rabid dogs,” he said, making headlines around the world in the process.\n\n Once what a celebrity said about the super-rich wouldn’t have made the news. But the re-election of American \n title=\"https://www.nzherald.co.nz/topic/donald-trump/\">President Donald Trump has placed them in the spotlight. First, he appointed fat-cat cronies to positions of power, then his sweeping tariffs had billionaires passing judgement on Trump’s policies and commentators speculating on the damage done to personal fortunes.\n\nBurr was more interested in Americans struggling from day to day.\n\nAnyone familiar with his comedy will know the swearing isn’t unusual and that, while he doesn’t expect such comments to be taken literally, he doesn’t hold back. Men, women, the left, the right, few topics are off-limits. He once said people who go barefoot to the toilet in a plane should be eliminated.\n\nSpeaking on an episode of his Monday Morning podcast, he wasn’t looking for laughs. Nor was he criticising the super-rich for their wealth alone. He felt they were causing other people’s suffering and playing politics in the process. Responding to a letter from a fan who said she was a mum who was struggling financially, Burr said, “The amount of people struggling out there because of these f***ing billionaires, and they got us all arguing liberal and conservative.”\n\nCould it be that billionaires are getting a bad name?\n\nThere are a record number of them in the world - 3028 US-dollar globally and four in New Zealand this year according to Forbes — and whether or not you celebrate such levels of wealth, they are definitely playing a more prominent role in world politics, and many would say for the wrong reasons.\n\nTrump has made much of his own worth and has surrounded himself by the super-rich.\n\nBut it is his embrace of Elon Musk, the Tesla-building, tunnel-digging Mars-obsessed owner of the social media company X (formerly Twitter), that stands out as an example of a new ruling class, where political clout is predicated on one’s personal fortune.\n\nMusk, who reportedly spent US$277 million ($482m) on propping up Trump and groups that supported him in the lead-up to last year’s election, has become the face of widespread federal cost-cutting at the newly created Department of Government Efficiency (Doge), and seems to be a casual presence at the White House, in his T-shirt, trench coat and trucker cap, often with his young son in tow.\n\nMusk was long seen as an eccentric innovator, a sort of tech-world maverick who was so prepared to push boundaries that he could be forgiven for his unorthodox behaviour and occasional outbursts. But his support of Trump, promotion of conspiracy theories, and right-wing antics — notably Nazi-style salutes — have made him a target of protest and ridicule.\n\nTesla cars have been vandalised in New Zealand and overseas, often with graffiti featuring swastikas or references to fascism.\n\nMusk’s views don’t represent those of all billionaires, of course. In fact, researchers say most are so private it’s hard to know what they think.\n\nInstead, Musk has become a sort of figurehead for a new breed of super-rich, often referred to as the “tech bros”. A play on the term “Bernie bros”, used as a derogatory way of describing the male supporters of the 2016 and 2020 US presidential candidate Bernie Sanders, the tech bros are super-rich, powerful men who have made their money in the tech sector and were seen as supportive of Trump’s 2024 presidential campaign.\n\nThe image of Musk, Amazon founder and Washington Post owner Jeff Bezos, Google CEO Sundar Pichai and Facebook founder Mark Zuckerberg standing together at Trump’s inauguration in January captured the collective power of such men.\n\nAnd with great power comes great freedom to act in ways that are seen to influence public opinion and online discourse.\n\nGoogle can track people’s online activities, Facebook has helped decide what content its users consume, and after Musk took over Twitter in 2022, the site eliminated rules banning hate speech and disinformation, and alienated users and advertisers in the process.\n\nBezos, meanwhile, has sought to influence what opinions Washington Post readers will be exposed to.\n\nIn an evolving environment, news organisations around the world often defend the independence of their operations, saying corporate ownership has little to no impact on how they cover news and events.\n\nBut Bezos has shown he’s not happy to take a hands-off approach. In what was interpreted as a nod to Trump’s 2024 campaign, the Post announced in October that it wouldn’t endorse a candidate in November’s election. The move led to a mass of subscription cancellations but Bezos defended the move in an opinion piece on the Post’s website, saying endorsements just “create a perception of bias”.\n\nThen in February, he limited the range of voices in the Post’s opinion section to those that defend personal liberties and the free market.\n\nMore readers cancelled their subscriptions and the Post’s opinion editor, David Shipley, joined others in resigning. Columnist of four decades Ruth Marcus did the same in March after the paper refused to publish a piece critical of Bezos’ intervention. That followed the resignation in January of long-time editorial cartoonist Ann Telnaes, who quit after the Post refused to run her illustration of Bezos and other billionaires kneeling with bags of money before a statue of Trump.\n\nExplaining her decision to resign, Telnaes wrote that owners of press organisations “are responsible for safeguarding” the free press and that “trying to get in the good graces of an autocrat-in-waiting will only result in undermining that free press”.\n\nThe developments have led to an online free-for-all, with people poking fun at the paper’s official slogan, “Democracy Dies In Darkness”, launched in 2017 after Trump took office the first time, a phrase the Post said was coined by legendary investigative journalist Bob Woodward in a 2007 piece he wrote about government secrecy.\n\nIt is arguable whether democracy is dying, but could it be morphing into something different?\n\nAmerican political theorist Sheldon Wolin suggested in his 2003 book Democracy Inc that the US was sliding “imperceptibly” towards a hybrid political system he called “inverted totalitarianism”, in which a disengaged public went about their lives as corporate powers increasingly took a greater role in political decision-making. Wolin, who was a professor of politics at Princeton University, was careful to point out he was not describing the rise of a typical totalitarian state such as Nazi Germany, but one in which “economic and state powers are conjoined and virtually unbridled”.\n\nWolin wrote that “the United States has become the showcase of how democracy can be managed without appearing to be suppressed”.\n\nTrump might deserve a chapter all of his own, although leading economists doubt he understands what he is doing.\n\nIf he does, economic upheaval would appear to be part of the plan.\n\nIn the lead-up to last year’s US election, Pulitzer Prize-winning journalist Chris Hedges pointed out that both the Deomcrats and Republicans had billionaire backers - Kamala Harris more than Trump — but that what set the parties apart was the type of power they espoused. The Democrats was the party of corporate power, he wrote, and that required stability, predictability and a technocratic government. Trump’s Republicans, on the other hand, we’re all about oligarchic power, an opportunistic monster that creates and feeds on chaos.\n\nUnder this interpretation, chaos isn’t the unforeseen consequence of bad decision-making but, as George Monbiot and Peter Hutchison write in their book The Invisible Doctrine, “the profit multiplier for the disaster capitalism on which the billionaires thrive”.\n\nIn his farewell speech to the American people in January, President Joe Biden, who had his fair share of big-time backers, warned, “Today, an oligarchy is taking shape in America of extreme wealth, power and influence that really threatens our entire democracy, our basic rights and freedom.”\n\nThat may be so. Or is it just that the way extreme wealth, power and influence are being used is becoming more obvious?\n\nPolitical scientists Martin Gilens and Benjamin Page argued in 2014 that the US was already an oligarchy, citing the influence on policy of large businesses and a small group of wealthy citizens.\n\nBut that influence has generally operated in the shadows.\n\nIn the 2019 book Billionaires and Stealth Politics, Page and fellow academics Jason Seawright and Matthew Lacombe set out to understand as much as they could about the ways the 100 wealthiest billionaires influenced American politics over a 10-year period. They used what they refer to as a “web-scraping and public records” approach to analyse publicly available data on contributions to campaigns and causes and coined the term “stealth politics” to describe what they discovered.\n\nThe overall picture the authors paint is of a largely secretive group who often operate out of the spotlight. In general, they are economically conservative — in favour of lower taxes and reduced social spending — and often socially liberal — in favour of causes such as same-sex marriage and abortion rights.\n\nBezos, for example, donated US$2.5 million ($4.37m) to same-sex marriage supporters in 2012, and in 2017 received the Human Rights Campaign National Equality Award, the same year Amazon was reported to have paid nothing in federal taxes while facing scrutiny over worker conditions.\n\nOne of the most common arguments in favour of billionaire business owners like Bezos and Musk is that they take risks and drive economic growth. That without them, progress would grind to a standstill and that their wealth is dependent on the success of their companies.\n\nIndeed, the world’s 20 richest individuals saw their net worth take a hit in the first few months of the year, some reportedly falling by tens of billions of dollars, and the pain has continued with the introduction of Trump’s tariffs.\n\nStill, online news outlets are discussing who is likely to be the planet’s first trillionaire, expected to be named as soon as 2027. Top of the list? Elon Musk.\n\nDuncan Gillies is a news editor at NZME.","summary":"Opinion: Donald Trump's re-election shining a light on role of billionaires in politics.","url":"https://www.nzherald.co.nz/nz/who-wants-to-be-a-billionaire-opinion/WWPAETORBJH3BO3IPY3INIX22Y/","image":"https://www.nzherald.co.nz/resizer/v2/V7CLIQAD2RGYDDXVHHNY7YVGPM.jpg?auth=c8e0847ebd4fb5bacdebe6571c862d4fa6ab33814912aa3088202280d948056d&width=1200&height=675&quality=70&smart=true","video":null,"publish_date":"2025-04-16 19:38:15","author":"Duncan Gillies","authors":["Duncan Gillies"],"language":"en","category":"politics","source_country":"nz","sentiment":-0.012},{"id":311866486,"title":"The Democratic Civil War Is Escalating","text":"The civil war in the Democratic Party ratcheted up another notch as a group founded by Democratic National Committee (DNC) Vice Chair David Hogg said it plans to spend millions to unseat Democratic incumbents it believes aren't pushing back hard enough on President Donald Trump.Why It MattersDemocrats have been bitterly divided in the wake of then-Democratic nominee and Vice President Kamala Harris' decisive loss to Trump in the 2024 election.While some Democrats said the party had moved too far to the left and alienated moderate voters, many in the progressive wing argued the party had become too pro-corporation and abandoned the working class.The divide isn't just ideological but generational as well.There have been growing calls for new leadership in recent years, with critics arguing that the party's current standard bearers, many of whom are in their 70s and 80s, need to pass the torch to the next generation for the Democratic Party to remain competitive.That divide has been exacerbated by what younger and more progressive Democrats view as a feeble response to the Trump administration and has led to speculation that the party could be due for its own version of a \"Tea Party\" revolt from its base.What to KnowHogg, a survivor of the 2018 Parkland school shooting, is among the most prominent young voices in the Democratic party and became its vice chair this year.Now, the 25-year-old is leaping into the intra-party fray by spending $20 million to oust Democratic incumbents in safe seats, Leaders We Deserve, the grassroots organization Hogg co-founded, confirmed in a statement to Newsweek on Wednesday.Hogg said in the statement that he ran for his DNC position \"to help make the party better,\" which includes \"electing better people.\"\"While Trump creates new existential crises every day, too many elected leaders in the Democratic Party are either unwilling or unable to meet the moment,\" he said. \"We need a stronger Democratic Party that is ready to fight back. Part of making that a reality is replacing ineffective, asleep-at-the-wheel members with Democrats who have the energy, passion, and vision to meet this moment with the urgency our country deserves.\"Leaders We Deserve won't be targeting Democrats representing competitive districts and not all older Democratic leaders will be challenged, the statement said.For instance, former House Speaker Nancy Pelosi, for instance, who is being challenged by Representative Alexandria Ocasio-Cortez's former chief of staff Saikat Chakrabarti, won't be targeted because she \"continues to prove that she is ready and willing to take on Trump and congressional Republicans,\" the statement said.The move reflects one of the most significant efforts yet to shake up Democratic leadership, which in recent years moved to protect incumbents, particularly after Ocasio-Cortez and Representative Ayanna Pressley of Massachusetts ousted long-time incumbents in safe Democrat districts in 2018.In recent years, the party's support for incumbents has sparked growing criticism from more progressive Democrats who have been vocal about the need for the party to embrace new leadership. For instance, the Democratic Congressional Campaign Committee (DCCC) once faced scrutiny over a \"blacklist\" targeting groups that worked with candidates challenging incumbents.How Democratic Party institutions will respond to Hogg's move remains unclear. Newsweek reached out to the DNC, Democratic Congressional Campaign Committee and the Democratic Senatorial Campaign Committee for comment via email.Hogg hasn't said which specific Democrats he plans to spend against ahead of the midterms, but several longtime members are already facing challenges.In Illinois, Democratic Representative Jan Schakowsky is facing a primary challenge from TikTok contributor Kat Abughazaleh. Punchbowl News reported that Hogg does not plan to target Schakowsky.In California, Representative Brad Sherman is being challenged by his former aide Jake Rakkov. Georgia state senator Emanuel Jones has also filed paperwork to run against longtime Atlanta-area Representative David Scott.What People Are SayingDNC Chair Ken Martin told Politico: \"In order to ensure we are as effective as possible at electing Democrats to office, it is the DNC's longstanding position that primary voters — not the national party — determine their Democratic candidates for the general election.\"Hogg told Politico: \"We have a culture of seniority politics that has created a litmus test of who deserves to be here. We need people, regardless of their age, that are here to fight.\"Democratic strategist Matt Bennett wrote on X: \"When @davidhogg111 became Vice-Chair, I was quoted worrying he would not make the switch from activist to his new role. And he didn't. This is insane behavior from a DNC official, especially as Trump takes a chainsaw to our democracy.\"Democratic strategist Max Burns wrote on X: \"David Hogg is one of the rare people who runs for a DNC role because they actually want to make a difference in the party. Good on him.\"What Happens NextCongressional candidates will likely announce campaigns over the coming months. How successful these primary challenges are going to be remains to be seen, as the midterms aren't until November 2026.","summary":"David Hogg, the vice chair of the Democratic National Committee, plans to spend $20 million to oust Democratic incumbents.","url":"https://www.newsweek.com/democratic-civil-war-david-hogg-incumbent-primaries-2060649","image":"https://d.newsweek.com/en/full/2628574/david-hogg-democratic-civil-war.jpg","video":null,"publish_date":"2025-04-16 19:16:35","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.211},{"id":311927398,"title":"George Clooney Calls Urging Joe Biden To Step Down Was 'Civic Duty', Reacts To Backlash","text":"Hollywood star and activist George Clooney recently opened up about why he publicly urged President Joe Biden to step down from the 2024 election race. He felt that it wasn’t about being brave; it was simply his civic duty. George Clooney on Joe Biden criticism In a recent interaction, the actor acknowledged that some Democrats were upset by his decision, but emphasised that speaking the truth outweighed concerns about popularity. He told CNN's Jake Tapper, \"I found that people on my side of the street. I’m a Democrat in Kentucky, so I get it, when I saw people on my side of the street not telling the truth, I thought that was time to… some people [are mad], sure. That’s OK, you know, listen to the idea of freedom of speech is you can’t demand freedom of speech and then say, ‘But don’t say bad things about me.'\" ALSO READ: George Clooney Bids Goodbye To Romantic Films, Here's Why He Won't Return To Genre The Oscar-winning actor is no stranger to political controversy. He recalled facing backlash for his stance against the Iraq war over 20 years ago, saying, “People picketed my movies, I was even put on a deck of cards. I had to deal with that then, and I can deal with it now.” \"That’s the deal, you have to take your stand if you believe in it. Take a stand, stand for it and then deal with the consequences. I’m OK with criticism for where I stand. I defend their right to criticise me as much as I defend my right to criticise them,\" he added. For the unversed, George Clooney sparked national debate when he penned an op-ed in The New York Times on July 10, urging Biden to drop out of the race following his lacklustre performance during a televised debate against Donald Trump. This came just weeks after the actor helped host a high-profile Hollywood fundraiser that raised $28 million for Biden’s campaign. In the article, George stated that the Joe Biden he met at the fundraiser was not the same energetic leader from previous years. “This is about age. Nothing more. But also nothing that can be reversed,” he wrote. Clooney warned that keeping Biden in the race would risk losing not just the presidency, but also control of Congress. Biden eventually did step down, a move Clooney hailed as “the most selfless act” by a U.S. president since George Washington. Speaking later at the Venice Film Festival, he praised Biden’s decision to prioritise the country over personal ambition. On George Clooney's professional front Following Biden’s exit, Clooney supported Vice President Kamala Harris as the Democratic nominee. While politics continues to be part of his public life, the actor is also currently starring in the Broadway production of Good Night and Good Luck. Get Latest News Live on Times Now along with Breaking News and Top Headlines from Hollywood, Entertainment News and around the world.","summary":"George Clooney said asking Joe Biden to step down from the 2024 race wasn’t bravery but his 'civic duty'. He faced backlash, but stood by his words, saying the truth matters more than popularity. Read on!","url":"https://www.timesnownews.com/entertainment-news/hollywood/george-clooney-calls-urging-joe-biden-to-step-down-was-civic-duty-reacts-to-backlash-article-151439063","image":"https://images.timesnownews.com/thumb/msid-151439118,thumbsize-66646,width-1280,height-720,resizemode-75/151439118.jpg","video":null,"publish_date":"2025-04-16 19:04:32","author":"Sushmita Dey","authors":["Sushmita Dey"],"language":"en","category":"politics","source_country":"in","sentiment":-0.031},{"id":311874242,"title":"Obama calls Trump’s freeze of Harvard funding ‘unlawful’","text":"Former President Barack Obama is applauding Harvard University's decision to refuse the White House's demands that it change its policies or lose federal money, in his first social media post to criticise the Trump administration since at least Inauguration Day.\n\nPresident Donald Trump is freezing more than $2bn (£1.5bn) in federal funds for Harvard because it would not make changes to its hiring, admissions and teaching practices that his administration said were key to fighting antisemitism on campus.\n\nObama, a Harvard alum, described the freeze as \"unlawful and ham-handed\".\n\nHe called on other institutions to follow Harvard's lead in not conceding to Trump's demands.\n\n\"Harvard has set an example for other higher-ed institutions – rejecting an unlawful and ham-handed attempt to stifle academic freedom, while taking concrete steps to make sure all students at Harvard can benefit from an environment of intellectual inquiry, rigorous debate and mutual respect,\" Obama wrote on social media.\n\nThe former president, who graduated from Harvard Law School in 1991, has rarely criticised or rebuked government officials or government policies on social media since leaving the White House almost a decade ago. His posts during the election typically extolled Trump's challenger, then-Vice-President Kamala Harris, and since Inauguration Day, he has mainly posted tributes, personal messages and thoughts on sports.\n\nObama is one of a handful of US political figures and university officials now speaking out against the Trump administration's attempts to reshape the country's top universities, through pressure to change what they teach and who they hire and threats to cut research funding.\n\nHundreds of faculty members at Yale University published a letter expressing their support for Harvard's decision to reject the Trump administration's demands.\n\n\"We stand together at a crossroads,\" the letter read. \"American universities are facing extraordinary attacks that threaten the bedrock principles of a democratic society, including rights of free expression, association, and academic freedom. We write as one faculty, to ask you to stand with us now.\"\n\nMany US universities receive some type of federal funding which is mostly designated for scientific research in areas such as drug development.\n\nSince Trump returned to office in January, elite institutions such as Stanford University have had to freeze hiring and cut budgets in the face of shrinking federal funds.\n\nSome of the funding has been paused to press universities to take steps that the Trump administration says will fight antisemitism. Trump has accused them of failing to protect Jewish students during last year's campus protests against the war in Gaza and US support for Israel.\n\nStanford President Jonathan Levin and Provost Jenny Martinez on Tuesday said in a statement praising Harvard that \"universities need to address legitimate criticisms with humility and openness\".\n\n\"But the way to bring about constructive change is not by destroying the nation's capacity for scientific research, or through the government taking command of a private institution,\" they wrote.\n\nWhile Columbia University ceded to some of Trump's demands earlier this month, Harvard became the first major US university to take the opposite approach.\n\n\"No government – regardless of which party is in power – should dictate what private universities can teach, whom they can admit and hire, and which areas of study and inquiry they can pursue,\" Harvard's president, Alan Garber, said in a statement on Monday.\n\nMassachusetts Institute of Technology (MIT) followed Harvard's lead on Monday and also rejected the Trump administration's demands.\n\nDespite the criticism, Trump is standing fast. On Tuesday he took another strike against Harvard, threatening to revoke its tax-exempt status.\n\nUniversities, as well as many charities and religious groups, are exempted from paying federal income taxes. This valuable tax break, though, can be removed if the groups become involved in political activities or move away from their stated purposes.","summary":"Former President Barack Obama is applauding Harvard University's decision to refuse the White House's demands that it change its policies or lose federal money, in his first social media post to criticise the Trump administration since at least Inauguration Day.","url":"https://www.myjoyonline.com/obama-calls-trumps-freeze-of-harvard-funding-unlawful-2/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/04/image-941.png","video":null,"publish_date":"2025-04-16 19:03:22","author":"Bbc 03pm,Myjoyonline NSS","authors":["Bbc 03pm","Myjoyonline NSS"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.174},{"id":311861932,"title":"Stephen A. For President Talks Are Entirely Media Driven, Voters Don't Want Him.","text":"Nearly every major news network on television has discussed over the past week the possibility of sports commentator Stephen A. Smith running for president in 2028. On Sunday, Smith told ABC News he \"has no choice\" but to consider a run because unnamed billionaires continue to contact him, urging him to save the directionless Democratic Party. Steve Bannon, the former chief strategist for Donald Trump's first administration, told Bill Maher last Friday that Smith is the strongest option among the potential candidates for the party. Skip Bayless, Smith's former debate partner, predicted this week that Smith could actually win a general election, no matter who his opponent is. That's a lot of buzz. Yet that's all it is. At this point, Smith's potential candidacy remains entirely media-driven. There is no actual demand from Democratic primary voters to turn the party over to the former 76ers beat writer. An Echelon Insights poll earlier this week found Smith polling at only 1%, trailing pipedream candidates like \"Daily Show\" host Jon Stewart. Likewise, a new Zeteo study found Smith with the least amount of support from \"likely primary\" voters of 19 potential candidates. In terms of whether a voter would consider or not consider Smith, he received a net rating of -18, well below any other name on the list. \"— considering vs not considering tells you way more than an early ballot test: cory booker currently leads at +68. stephen a smith finishes last at -18,\" said Data for Progress director Ryan O'Donnell. There are valid comparisons between the current coverage of Smith and how networks covered Donald Trump in 2015. In fact, CNN helped legitimize Trump as a candidate with its excessive coverage of the then-still celebrity, albeit the coverage was mostly negative. But as Semafor reporter David Weigel observes, Democratic voters don't want outsiders to run for office on their side of the ticket. \"The Stephen A. Smith boomlet feels 99.8% media-driven, no actual demand from Dem voters,\" Weigel posted on X. There was a version of this in 2017, when there was a lot of media chatter about whether Dems wanted their own celebrity (Oprah?) - no, Dems love government and experience!\" And that's just that. Talk shows billing Stephen A. as a departure from the establishment doesn't impress Democratic voters. They prefer an establishment candidate – just one who is more impressive than Kamala Harris. Further, Trump had experience running large organizations and negotiating high-stakes agreements before running for office. Smith doesn't. He spent his entire career reporting on and shouting about basketball. Trump also established a winning message to restore America, rebuild the middle class, fix immigration, and put America first. What's Smith's message? What does he actually believe? Put simply, all we know about his politics is that he supports DEI. Culture war topics don't win Democrats elections. In November, the internal polling firm Blueprint found that Harris's focus on culture war topics was among the top three reasons swing voters rejected her, along with the economy and the border. Talk shows will continue to discuss Stephen A.'s potential run for president because he is good for business. However, those segments have not yet translated into support from likely primary voters. And we don't expect that to change.","summary":"","url":"https://www.outkick.com/analysis/stephen-a-president-talks-entirely-media-drive-voters-dont-want-him","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/03/stephen-a.-smith.jpg","video":null,"publish_date":"2025-04-16 18:42:01","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.001},{"id":311874382,"title":"13 potential 2028 presidential candidates for both major parties","text":"SUBSCRIBE & SAVE\n\nLess than $3 per week\n\nView Profile\n\nThe Explainer\n\nTalking Points\n\nThe Week Recommends\n\nNewsletters\n\nFrom the Magazine\n\nThe Week Junior\n\nFood & Drink\n\nPersonal Finance\n\nAll Categories \n\nNewsletter sign up\n\n13 potential 2028 presidential candidates for both major parties \n\nA rare open primary for both parties has a large number of people considering a run for president\n\nNewsletter sign up\n\nPete Buttigieg is being discussed as one of the potential frontrunners for the 2028 Democratic presidential nomination\n\n(Image credit: Drew Angerer / Getty Images)\n\nDavid Faris \n\n16 April 2025\n\nSince the post-1968 reforms that opened presidential nominations to binding primaries and caucuses, there have only been four cycles that didn't feature an incumbent or former president. But assuming that President Donald Trump doesn't seek an unconstitutional third term, 2028 will be one of them. These are some of the names being bandied about by political insiders looking ahead to the next election.\n\nThe Democrats already jockeying for position\nPete Buttigieg \n\nButtigieg served as Secretary of Transportation from 2021 to 2025, and his frequent appearances on right-wing outlets like Fox News \"have been master classes in poise and articulation,\" said Advocate. He recently decided not to seek a Senate seat in Michigan, a \"decision framed by several allies and people in his inner circle as putting him in the strongest possible position to seek the presidency,\" said Politico.\n\nSubscribe to The Week\n\nEscape your echo chamber. Get the facts behind the news, plus analysis from multiple perspectives.\n\nSUBSCRIBE & SAVE\n\nSign up for The Week's Free Newsletters\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.\n\nGavin Newsom\n\nNewsom has been governor of California since 2019. He \"built his national profile opposing the Republican president during his first term,\" said Los Angeles Times. But in March Newsom caused a stir by inviting far-right operative Charlie Kirk onto his podcast, \"angering many of the liberal activists whom Newsom would need to clinch the Democratic presidential nomination in 2028,\" said The Washington Post.\n\nAlexandria Ocasio-Cortez\nThe New York Democrat has taken on a leading role opposing the Trump administration's policies, including barnstorming the country with Sen. Bernie Sanders (I-N.Y.). Ocasio-Cortez is \"positioning herself well for a run,\" and the 35-year-old \"would bring much-needed youthful vigour to a decaying party,\" said UnHerd.\nJB Pritzker\nThe governor of Illinois since 2019, Pritzker has chosen a very different lane from Newsom, standing up for communities under fire from the Trump administration. He has distinguished himself by \"pitching his potent combination of working-class issues, sharp business sense and reputation as a good-natured brawler,\" said Bloomberg. But Pritzker, who is not subject to term limits, \"has yet to say whether he will seek a rare but not unprecedented third term as governor,\" said the Chicago Tribune.\nJosh Shapiro\nShortlisted as Kamala Harris' running mate in 2024, Pennsylvania's governor is still in his first term. Shapiro has been \"performing a balancing act in approaching the Trump administration,\" said NBC News. He has \"cemented his image as a moderate willing to work across the aisle,\" said The Philadelphia Inquirer but remains \"largely untested on the national stage.\"\n\nThe 2024 Democratic vice presidential nominee remains Minnesota's governor until 2027 and said he would \"rather fight Trump from his position as governor\" than seek the state's open U.S. Senate seat next year, said The New Yorker. That decision means that Walz may throw his hat in for the 2028 nomination. Walz \"launched a national tour of town halls in Republican House districts, traveling the country,\" said Axios, further fueling speculation about 2028.\nGretchen Whitmer\nThe two-term Michigan governor was one of the many names discussed to replace former President Joe Biden during the summer of 2024. Her double-digit reelection in a down year for Democrats in 2022 combined with her popularity in the purple state of Michigan turned her into a national figure. In terms of 2028 contenders, \"there are few politicians talked about more than\" Whitmer, said The New York Times.\nOther names\nFormer vice president and 2024 Democratic nominee Kamala Harris is \"expected to make a decision by the end of the summer\" about running for governor of California, said the Los Angeles Times, and could still run for president again. Popular Democratic governors like Jared Polis of Colorado could join the fray, as could prominent Trump critics in the Senate like Chris Murphy (D-Conn.) and Cory Booker (D-N.J.), whose day-long filibuster in April means that he is \"most likely going to run again,\" said The Conversation. Celebrities like businessman Mark Cuban and ESPN commentator Stephen A. Smith are also in the mix.\nA shorter list of Republicans in the shadow of J.D. Vance\n\nCan Trump run for a third term in 2028?\nTrump 'not joking' about unconstitutional third term\nGavin Newsom's podcast debut is not going over well with some liberals\nNikki Haley\nIn the past, the runner-up in the GOP primary often had the inside track on the next open nomination. It is not clear whether this rule will apply to former UN Ambassador and 2024 GOP runner-up Nikki Haley, who at this point represents a defeated faction in the party. It is also \"not likely she would have\" President Trump's backing \"if she runs in 2028,\" said Fox News, which could cripple her chances.\nRon DeSantis\nLike Haley, the Florida governor's biggest challenge as he prepares a 2028 presidential bid is to \"win back supporters of the Republican leader whom he dared to challenge in the last election,\" said The Associated Press. DeSantis, who ended his 2024 campaign after a disappointing showing in the Iowa GOP caucus, remains popular in Florida and was reelected by nearly 20 points in 2022 in what was once a swing state.\nKristi Noem\nNoem, now the Secretary of Homeland Security, was \"floated as a potential running mate for Trump last year\" before he picked J.D. Vance and \"has since become a loyal and vocal supporter of the president, said The Hill. She seems to have survived the scandal from her memoir, in which she found herself \"under fire for killing her family's 14-month-old dog and boasting about it,\" said The New York Times.\nMarco Rubio\nRubio ran unsuccessfully for president in 2016, losing the nomination to Trump. Now, the former Florida senator is the Secretary of State in the second Trump administration and \"needs to decide how much he wants to go along with things that clearly run counter to his previous principles,\" such as siding with Russia in the Ukraine conflict, said The Washington Post.\n\nThe sitting vice president is just 40 years old and will benefit from having a \"group of younger, more populist Republicans who are vocally advocating\" for him as Trump's successor, said Semafor. No incumbent vice president in the modern period who has sought his or her party's nomination has failed to get it. Even better, \"Trump's longtime aides and allies have begun throwing their support behind Vance,\" said The Independent.\nGlenn Youngkin\nRumored as a more mainstream alternative to President Trump for the 2024 GOP nomination, Youngkin never ended up throwing his hat in the ring. Virginia's popular GOP governor is subject to the state's unusual one-term-at-a-time limit and cannot seek re-election in 2025. He is \"seen as staunchly conservative but has a broad appeal, stretching outside of the MAGA movement,\" said The Hill.\nOther names\nVance's presumed dominance of the field makes the GOP's long-list considerably shorter than those of the Democrats. But those who received support in a recent Yougov poll include the president's son Donald Trump, Jr., Texas Sen. Ted Cruz, businessman Vivek Ramaswamy, CIA Director Tulsi Gabbard, Sen. Tim Scott (R-S.C.) and Health and Human Services Secretary Robert F. Kennedy, Jr.\n\nExplore More\n\nPete Buttigieg\nGavin Newsom\nAlexandria Ocasio-Cortez\nRon DeSantis\n\nKamala Harris\nDonald Trump Jr.\n\nRepublicans\n\nSign up for Today's Best Articles in your inbox\nA free daily email with the biggest news stories of the day – and the best features from TheWeek.com\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nDavid Faris\n\nSocial Links Navigation\n\nDavid Faris is an associate professor of political science at Roosevelt University and the author of It's Time to Fight Dirty: How Democrats Can Build a Lasting Majority in American Politics. He is a frequent contributor to Informed Comment, and his work has appeared in the Chicago Sun-Times, The Christian Science Monitor, and Indy Week.\n\nMusic reviews: Perfume Genius, Momma, Elton John & Brandi Carlile\n\n\"Glory,\" \"Welcome to My Blue Sky,\" and \"Who Believes in Angels?\"\n\nByThe Week US \n\nMyth and Marble: Ancient Roman Sculpture From the Torlonia Collection\n\nThe private collection is being revealed to the public for the first time in decades\n\nByThe Week US \n\nHow might Trump's tariffs affect the luxury goods market?\n\nToday's Big Question\nLuxury clothes, cars and watches could be in the crosshairs\n\nByJustin Klawans, The Week US \n\nYou might also like\n\nDOGE: Have we passed 'peak Musk'?\n\nThe tech billionaire suffered a costly week after a $25 million election loss in Wisconsin and Tesla's largest sale drop on record\n\nByThe Week US \n\nA running list of Trump's second-term national security controversies\n\nSeveral scandals surrounding national security have rocked the Trump administration\n\nByJustin Klawans, The Week US \n\nWhy the GOP is nervous about Ken Paxton's Senate run\n\nToday's Big Question\nA MAGA-establishment battle with John Cornyn will be costly\n\nByJoel Mathis, The Week US \n\nMan charged in arson attack on Pennsylvania's Shapiro\n\nGovernor Josh Shapiro and his family were sleeping when someone set fire to his Harrisburg mansion\n\nByPeter Weber, The Week US \n\nTwo judges bar war-powers deportations\n\nThe Trump administration was blocked from using the Alien Enemies Act to deport more alleged Venezuelan gang members\n\nByPeter Weber, The Week US \n\nCould Trump's tariff war be his undoing with the GOP?\n\nTODAY'S BIG QUESTION\nThe catastrophic effects of the president's 'Liberation Day' tariffs might create a serious wedge between him and the rest of the Republican party\n\nByRafi Schwartz, The Week US \n\nKennedy: Cutting to the bone at HHS\n\nThe Health and Human Services Secretary has laid off 10,000 HHS employees\n\nByThe Week US \n\n'Newsom has effectively assumed the presidency'\n\nInstant Opinion\nOpinion, comment and editorials of the day\n\nByJustin Klawans, The Week US \n\nView More ▸\n\nContact Future's experts\n\nTerms and Conditions\n\nPrivacy Policy\n\nCookie Policy\n\nAdvertise With Us\n\nThe Week is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street","summary":"A rare open primary for both parties has a large number of people considering a run for president","url":"https://theweek.com/politics/2028-presidential-candidates-democrat-republican","image":"https://cdn.mos.cms.futurecdn.net/3hD7V2jQSvutXNv6YewSuF.jpg","video":null,"publish_date":"2025-04-16 18:36:20","author":"David Faris","authors":["David Faris"],"language":"en","category":"politics","source_country":"US","sentiment":0.492},{"id":311873170,"title":"Powerful House leadership chair, Stefanik poised to take on Hochul for NY Governor","text":"Rep. Elise Stefanik, R-N.Y., is considering a 2026 bid for governor in her home state, multiple sources close to her confirmed to Fox News Digital. Stefanik was withdrawn from consideration as President Donald Trump’s United Nations Ambassador to shore up numbers of the House Republicans' narrow majority. She is now the chairwoman of House Republican Leadership. Sources tell Fox News Digital that she is being encouraged to run by allies of Trump and longtime friends. Stefanik outperformed the president in her congressional district in 2016, 2020 and 2024, which one source says could be an indicator that she could do well with New York's swing voters. The Republican won with 62% of the vote in her strongly conservative district in November. On Wednesday, Stefanik made the case for a GOP win in New York this year when she commented on a new poll by Marist which is the latest to indicate that Democratic Gov. Kathy Hochul's approval ratings are underwater with New York State voters. \"This latest bombshell polling proves what every New Yorker already knows: that we must FIRE Kathy Hochul in 2026 to SAVE NEW YORK. Hochul is the Worst Governor in America and it’s not even close,\" Stefanik argued in a statement. HARVARD IS 'ACTING MORE ENTITLED THAN EVER,' SAYS GOP CONGRESSWOMAN Stefanik is a top Trump ally in the House and the president posted on social media Wednesday morning that \"Congresswoman Elise Stefanik is GREAT!!!\" The six-term lawmaker has $10 million cash-on-hand through her fundraising entities, and is considered popular among Republican voters in the state. Stefanik was the keynote speaker at a New York GOP event on Tuesday night. At the time of her nomination's withdrawal, Hochul said it was a matter of holding the line in Congress. \"I have been proud to be a team player. The president knows that. He and I had multiple conversations today, and we are committed to delivering results on behalf of the American people. And as always, I'm committed to delivering results on behalf of my constituents,\" Stefanik said on Fox News' \"Hannity\" last month. REP. ELISE STEFANIK EXPLAINS HER 'TEAM PLAYER' DECISION TO STAY IN CONGRESS Trump said he would work on finding a replacement pick, which has not been announced yet. \"As we advance our America First Agenda, it is essential that we maintain EVERY Republican Seat in Congress. We must be unified to accomplish our Mission, and Elise Stefanik has been a vital part of our efforts from the very beginning,\" the president posted to Truth Social at the time. \"I have asked Elise, as one of my biggest Allies, to remain in Congress to help me deliver Historic Tax Cuts, GREAT Jobs, Record Economic Growth, a Secure Border, Energy Dominance, Peace Through Strength, and much more, so we can MAKE AMERICA GREAT AGAIN. With a very tight Majority, I don’t want to take a chance on anyone else running for Elise’s seat. The people love Elise and, with her, we have nothing to worry about come Election Day. There are others that can do a good job at the United Nations,.\" Whoever wins the primary could be running in the general election against Hochul, who had a tough fight against now-Environmental Protection Agency Administrator Lee Zeldin in 2022, when he was in Congress at the time. SANCTUARY GOVERNORS WALZ, PRITZKER, HOCHUL CALLED TO TESTIFY BEFORE CONGRESS Stefanik is far from the only well-known Republican in New York State considering a 2026 run for governor. Rep. Mike Lawler, who's in his second term representing the state's 17th Congressional District, which covers a large swath of New York City's northern suburbs, is mulling a bid. \"I'll make a decision at some point – middle of the year. Obviously, you know if we're going to do it, you got to get out there, and you got to campaign hard,\" Lawler said last week in an interview with Fox News Digital. He added, \"I haven't made a decision yet. I think, obviously, there's a number of factors in play, but you know, we're working through that right now.\" Among the other Republicans weighing a gubernatorial run are Nassau County executive Bruce Blakeman, who like Stefanik is a major Trump. Longtime Bethany town supervisor Carl Hyde Jr. is also considering a run. Democrats are salivating over a potential GOP gubernatorial primary in the Empire State. \"New York’s Republican primary is set to be a nasty and vicious race to see who can be the Trumpiest – and most out of touch with New Yorkers,\" Democratic Governors Association spokesperson Kevin Donohoe aruged in a statement. \"All three potential candidates in this race are running to bring Donald Trump’s extreme agenda of raising costs and taking away fundamental freedoms to Albany – and could not be more out of step with New York.\" It's been 23 years since a Republican won a gubernatorial election in heavily blue New York State. You have to go all the way back to former Gov. George Pataki's second re-election victory in 2002. But with Hochul's approval ratings and favorable ratings remaining in negative territory, Republicans are optimistic their losing streak will come to an end next year. The governor also faces potential, longshot Democratic primary challenges from her lieutenant governor, Antonio Delgado, as well as Rep. Ritchie Torres. In 2022, Zeldin had the best performance by a GOP gubernatorial candidate in New York since Pataki's 2002 victory. Zeldin lost to Hochul by less than six and a half points. And Trump lost the state to then-Vice President Kamala Harris by 13 points in last November's presidential election, but that was a 10-point improvement from his loss margin to Joe Biden in the 2020 election. \"What is really telling is that you have three, at least, very qualified Republican candidates looking at it,\" a veteran Republican strategist who works on New York State races told Fox News. \"I think it shows her [Hochul's] vulnerability.\" Stefanik's departure could still have an impact on House Republicans' razor-thin three-seat majority, but GOP leaders hope to be done with their plans for a massive conservative policy overhaul via the budget reconciliation process by the end of this year. If elected governor, Stefanik would not have to leave the House until the end of December 2025. Her vote was critical to advancing President Trump's budget framework legislation earlier this month. The bill appeared at risk of failing during a tense procedural vote last week, but Stefanik – who was among the last to cast her vote – carried it over the top, 216 to 215. Fox News' Madeline Coggins contributed to this report.","summary":"New York Rep. Elise Stefanik is considering a bid for governor in 2026, multiple sources close to her confirmed to Fox News Digital following a Wall Street Journal report.","url":"https://www.foxnews.com/politics/powerful-house-leadership-chair-stefanik-poised-take-hochul-ny-governor","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/d3030387-stefanikhochul.png?ve=1&tl=1","video":null,"publish_date":"2025-04-16 18:27:27","author":"Cameron Arcand,Elizabeth Elkind,Paul Steinhauser","authors":["Cameron Arcand","Elizabeth Elkind","Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":-0.214},{"id":311854806,"title":"George Clooney calls breaking with Biden in 2024 his ‘civic duty,’ says Democrats weren't telling truth","text":"Actor and longtime Democratic supporter George Clooney is standing by his decision to call for a change in the party’s 2024 presidential nominee. In a new interview with CNN’s Jake Tapper, Clooney described his break with President Joe Biden as a matter of principle. \"It was a civic duty,\" Clooney said in a preview of the full interview airing later on Wednesday. He explained that his decision was prompted by what he saw as dishonesty from his own political allies. \"I’m a Democrat in Kentucky so I get it. When I saw people on my side of the street not telling the truth, I thought that was time,\" he added. Clooney, who hosted a high-profile fundraiser last year that brought in over $30 million for Biden’s 2024 campaign, surprised many when he published a New York Times guest essay just weeks later urging Biden to step aside. GEORGE CLOONEY SAYS HE DROPPED SUPPORT FOR BIDEN AFTER SEEING HIM UP CLOSE, CONDEMNS DEMOCRATIC 'COWARDICE' The Times essay praised Biden’s record but warned about the limits of age. \"In the last four years, he’s won many of the battles he’s faced,\" Clooney wrote. \"But the one battle he cannot win is the fight against time.\" The essay came on the heels of Biden's brutal debate performance against Donald Trump that set off a panic within the Democratic Party. Less than a month later, Biden bowed out of the race and endorsed Vice President Kamala Harris for the party's nomination. Clooney also reflected on the former president's declining presence, noting a stark contrast between Biden towards the end of his term and the energetic figure he once knew. GEORGE CLOONEY ADMITS MEDIA 'DROPPED THE BALL' ON COVERING BIDEN'S INCAPACITIES \"It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe ‘big F-ing deal’ Biden of 2010. He wasn’t even the Joe Biden of 2020,\" he wrote. \"He was the same man we all witnessed at the debate.\" BIDEN ENDS 2024 CAMPAIGN: GEORGE CLOONEY, ASHLEY JUDD AMONG STARS WHO CALLED FOR PRESIDENT TO STEP DOWN In his CNN interview, Tapper praised Clooney’s candor, calling it \"brave,\" a sentiment not universally shared within the Democratic Party. Clooney acknowledged the backlash he’s faced since the essay was published but remained resolute. \"The idea of freedom of speech, the specific idea of it is, you know you can’t demand freedom of speech and then say, ‘But don’t say bad things about me.’ That’s the deal, you have to take a stand if you believe in it,\" he said. \"Take a stance, stand for it, and then deal with the consequences. That’s the rules.\" Clooney backed Harris, the party’s eventual nominee, and praised Biden’s decision to step aside as \"saving democracy once again.\" Biden gave one of his first public speeches since leaving office on Tuesday, condemning recent policy changes under a second Trump administration. Biden's keynote address ran less than an hour. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE A new book, \"Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History,\" released earlier this month, offers new insights into the final months of Biden’s presidency. Author Chris Whipple, a former \"60 Minutes\" producer, writes that Biden’s inner circle increasingly limited his contact with longtime friends and allies to hide his alleged decline. CLICK HERE TO GET THE FOX NEWS APP According to the book, Clooney was particularly angered by an MSNBC segment that suggested his essay may have been influenced by former President Barack Obama. Whipple writes that Clooney \"went absolutely ballistic\" over the implication.","summary":"George Clooney defends calling for Biden to step aside in 2024, calling it his &quot;civic duty&quot; and accusing Democrats of not being honest about the president’s decline.","url":"https://www.foxnews.com/media/george-clooney-calls-breaking-biden-2024-his-civic-duty-says-democrats-werent-telling-truth","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/clooney-biden.png?ve=1&tl=1","video":null,"publish_date":"2025-04-16 18:24:26","author":"Madison Colombo","authors":["Madison Colombo"],"language":"en","category":"politics","source_country":"us","sentiment":0.035},{"id":311873174,"title":"Triple H, Michelle McCool lead WWE's Hall of Fame class of 2025","text":"WWE will induct several new members into its Hall of Fame on Friday night as well as some familiar faces. Paul Levesque, Lex Luger and Michelle McCool will go into the Hall of Fame as individual members, The Natural Disasters tag team will go in as a group and an immortal moment will be enshrined for the first time. Former WWE stars Dory Funk Sr., Ivan Koloff and Kamala will also be enshrined as legacy inductees. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Levesque will go into the WWE Hall of Fame as Triple H – the famed character he morphed into one of the most-hated heels and the most-loved babyfaces when he was a member of the D-Generation X stable. The faction was inducted into the Hall of Fame as a group in 2019. Shawn Michaels, who is the senior vice president of talent development, creative and leads the NXT brand, helped surprise Levesque at WWE headquarters as the first member of the 2025 class. Nick Khan, the president of WWE, lent Michaels a helping hand as well. Triple H was a 14-time WWE champion, five-time WWE Intercontinental champion, two-time European champion, three-time tag-team champion, a two-time Royal Rumble winner and the 1997 King of the Ring winner. The class will feature the first Immortal Moment – one of the best matches of all-time in Bret Hart’s match against \"Stone Cold\" Steve Austin in a no-disqualification submission match with Ken Shamrock as the special guest referee. WRESTLEMANIA 41 NIGHT 1 WILL FEATURE THE END OF SEVERAL EPIC FEUDS The match took place at WrestleMania 13. Austin was bloodied in the ring and eventually Hart put him into the Sharpshooter. Shamrock stopped the match as Austin passed out. Hart continued the beatdown and caused a double turn as fans booed Hart and began to cheer for Austin. WWE named it the second-greatest WrestleMania match of all time. Luger plays a major role in the history of the \"Monday Night Wars\" between WWE and World Championship Wrestling (WCW). He came to the then-World Wrestling Federation as The Narcissist at WrestleMania IX and then was repackaged as \"The All-American: in an effort to build a new superstar to fill the hole left by Hulk Hogan. He was with the WWF until 1995 before he returned to WCW, making his return on the first \"Monday Nitro\" shows. He would be among the pro wrestlers to join the New World Order faction and also rival the faction. WRESTLEMANIA 41 NIGHT 2 WILL SEE JOHN CENA TRYING TO MAKE HISTORY AGAINST CODY RHODES Injuries and a spinal stroke eventually took a toll on Luger. He’s been in wheelchair with limited mobility. Luger had been working with Diamond Dallas Page’s yoga rehabilitation program and was able to stand from his wheelchair on his own. Page is set to be the one to induct him. McCool, whose real name is Michelle Calaway, is the only woman in the class this year. She participated in the 2004 WWE Diva Search and later became the first Divas champion. She was with WWE from 2004 to 2011 and made occasional appearances after that. She was a four-time women’s champion. McCool is married to the WWE legend known as The Undertaker. He will be inducting her into the Hall of Fame. The Natural Disasters are the lone tag team to be inducted this season. The group made up of Earthquake and Typhoon worked in the WWE from 1991 to 1993 before the team split up. John Tenta, the man known as Earthquake, died in 2006. Fred Ottman, the man known as Typhoon, is the uncle of Cody and Dustin Rhodes. He is the brother-in-law of Dusty Rhodes. The group were tag-team champions one time. CELEBRITIES AND ATHLETES YOU DIDN'T KNOW APPEARED AT WRESTLEMANIA WWE announced a new set of Legacy inductees, featuring Funk, Koloff and Kamala. Each wrestler had an impact on the business in different ways. Funk was a World War II veteran who served in the U.S. Navy before he wrestled in Texas and the central U.S. He then served as promoter in Western States Sports. He died in 1973 but was posthumously inducted into the Pro Wrestling Hall of Fame and the National Wrestling Alliance Hall of Fame. Koloff, who was from Canada, was billed from Moscow amid the Cold War. Koloff had rivalries with Bruno Sammartino, Pedro Morales, \"Superstar\" Billy Graham and Bob Backlund. He also took part in the first-ever steel cage match against Sammartino in 1975. He was a one-time World Wide Wrestling Federation champion. He died in 2017. Kamala, whose real name is James Harris and was nicknamed the \"Ugandan Giant,\" was a part of WWE at various times from the 1ate 1980s and the 1990s. He never won a championship in WWE, but his character was world famous. CLICK HERE TO GET THE FOX NEWS APP The WWE Hall of Fame ceremony will take place at the Fontainebleau Las Vegas on Friday. The ceremony can be seen on Peacock starting at 1 a.m. ET and 10 p.m. PT. Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"The WWE will induct several new members into its Hall of Fame on Friday night as the ceremony will jumpstart WrestleMania 41 weekend in Las Vegas.","url":"https://www.foxnews.com/sports/triple-h-michelle-mccool-lead-wwes-hall-fame-class-2025","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/triple-h.jpg?ve=1&tl=1","video":null,"publish_date":"2025-04-16 18:21:22","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.436},{"id":311862604,"title":"Melinda French Gates slams billionaires for showing ‘true personalities’ with Trump in White House","text":"Her ex-husband, Microsoft founder Bill Gates, recently met with Trump at Mar-a-Lago. She also referenced Elon Musk and how the Department of Government Efficiency has gutted the federal government.\n\n“All I can say is that a good manager doesn’t just immediately cut something off. They go out. They understand the work. They see what differences have been made. And then you might say, ‘ok, maybe 10% of it wasn’t being spent well. Or this 5% over here was wasted in some way.’ None of us want that with our taxpayer dollars. But good management doesn’t say you just cut something immediately… and then even all these U.S. employees are gone. That’s just something I don’t understand,” she said on CNN’s NewsNight with Abby Phillip.\n\nFrench Gates, who is worth an estimated $30 billion, made a substantial donation to the campaign of Kamala Harris and Tim Walz. The exact amount has not been made public. She also offered to host events for the failed campaign’s bid for the White House.\n\nIn further reflecting on the election, Gates suggested that the donations made by billionaires to both the Republican and Democratic parties did not sway the vote, as this “power” was with the voters. She also said it is likely that voters “wanted a change” and were not content with the status quo of the nation.\n\nNow, French Gates, who exited the Gates Foundation last year after receiving $12.5 billion, is urging people in the highest tax brackets to be more philanthropic, saying they have a “moral responsibility” to donate at least half of their wealth to causes. \n\n“And so the other thing I’ve done with my ex-husband, and also Warren Buffett, is we’ve started something called the Giving Pledge, because I think if you have a billion dollars, that’s an absurd amount of wealth,” French Gates said. “You have a moral responsibility to give away at least half of it, and in my case, I’m trying to spend my energy and my time and my resources doing exactly that.”\n\nLast year, French Gates also committed to donating $1 billion to her organization, Pivotal Ventures, through 2026 in a bid to advance “women’s power globally.”\n\nFrench Gates claimed that one of the things that spurred her to pursue her own ventures post-divorce is how her two granddaughters “don’t have as many rights right now as I did growing up.” She did not specify what rights her granddaughters currently lack, but did state that there are some issues she would like to see advanced in the United States, mentioning paid family medical leave as an example.\n\nDEMOCRATIC PARTY TROUBLES MOUNT AS MORE VOTERS TURN RIGHT, GIVE GOP EDGE\n\nThe Washington Examiner’s Tiana Lowe Doescher shared Gates’s comment on X, noting that when the billionaire, 60, was born, a woman who was unmarried could not get a credit card “without her dad co-signing it.” She also pointed to how insurers that are legally required to provide birth control at no cost “did not exist” at the time.\n\nWhen Melinda was born, unwed women weren’t allowed to get a CREDIT CARD without her dad co-signing it. To include a wife’s income in a mortgage application, her doctor had to prove she was sterilized. The birth control that insurers are legally required to provide for women at… https://t.co/AbhTQjSInV— Tiana Lowe Doescher (@TianaTheFirst) April 16, 2025\n\n“Spare me this drivel,” Doescher wrote. “There is no better time or place in human history to be a woman than the USA, today.”","summary":"Billionaire philanthropist Melinda French Gates admits she has &#8220;become more political&#8221; in recent years while also slamming other billionaires who are supporting President Donald Trump. French Gates, who was promoting her new memoir, The Next Day, made the statement when asked about the political donations of other billionaires and the influence they have within the [&#8230;]","url":"https://www.washingtonexaminer.com/news/3381891/melinda-french-gates-slams-billionaires-showing-true-personalities-trump/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/Melinda-French-Gates-scaled-1024x683.webp","video":null,"publish_date":"2025-04-16 17:56:17","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.356},{"id":311886632,"title":"Nolte: Police Say Man Accused of Firebombing Gov. Shapiro Is Pro-Palestinian","text":"Cody Balmer, the 38-year-old man arrested for allegedly firebombing the home of Gov. Josh Shapiro (D-PA) over the weekend, hates Jews.\n\n“Balmer called 911 following the attack early Sunday,” reports PennLive, “identified himself by name and told operators Shapiro needs to know he ‘will not take part in his plans for what he wants to do to the Palestinian people.”’\n\nThis is per the search warrant obtained by PennLive.\n\nDuring the call, Balmer allegedly added that he needed to “stop having my friends killed” and that “our people have been put through too much by that monster.”\n\n“You all know where to find me,” Balmer allegedly continued. “I’m not hiding, and I will confess to everything that I had done.” Police said it sounded like Balmer was reading a script.\n\nAnd what Balmer allegedly did was this.\n\nAt two o’clock on Sunday morning, the Sunday after Passover when Shapiro would be sleeping — as would his wife, four children, and guests — the Governor’s Residence in Harrisburg, Pennsylvania, was literally firebombed.\n\nBalmer is accused of scaling the residence’s iron security fence, breaking into the residence, setting the fire, and then planning to beat the governor to death with a hammer. Balmer was arrested later on Sunday and faces charges of attempted homicide, terrorism, aggravated arson, and aggravated assault.\n\nAttacks on elected officials are attacks on everyone. For better or for worse, these are the people We The People have chosen to represent us. Murdering or attempting to murder our representatives is truly an attack on democracy and the will of the people — in this case, the will of the entire state of Pennsylvania.\n\nThis is the second time Shapiro has been targeted for being Jewish. During the 2024 presidential campaign, there is little doubt Shapiro was passed over (pun intended) as Kamala Harris’s vice presidential pick because he is Jewish. Nothing else makes sense. Shapiro is the popular governor of one of the key swing states. Harris, however, chose goofy Minnesota Gov. Tim Walz—a state she already had in her pocket.\n\nDemocrats have become the party of anti-Jewish hate and discrimination. Harris knew choosing Shapiro would cost her a key part of the Democrat Party’s sick base: the pro-Hamas Jew haters who have stormed our campuses and rampaged through our streets calling for the extermination of Israel.\n\nIf Balmer is guilty, he must go away forever. There were four kids in that house. Kids.\n\nThe political left can no longer be appeased or negotiated with. Had this Sunday attack been on Republican, Democrats would be treating Balmer like they are accused murderer Luigi Mangione and deported terrorists such as Kilmar Abrego Garcia—as martyrs and folk heroes.\n\nJohn Nolte’s first and last novel, Borrowed Time, is winning five-star raves from everyday readers. You can read an excerpt here and an in-depth review here. Also available in hardcover and on Kindle and Audiobook.","summary":"Cody Balmer, the 38-year-old man arrested for allegedly firebombing the home of Gov. Josh Shapiro (D-PA) over the weekend, hates Jews.\n\n\nThe post Nolte: Police Say Man Accused of Firebombing Gov. Shapiro Is Pro-Palestinian appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/04/16/nolte-police-say-man-accused-firebombing-gov-shapiro-is-pro-palestinian/","image":"https://media.breitbart.com/media/2025/04/Arson-at-Gov.-Shapiros-official-residence-640x335.jpg","video":null,"publish_date":"2025-04-16 17:54:46","author":"John Nolte","authors":["John Nolte"],"language":"en","category":"politics","source_country":"US","sentiment":-0.17},{"id":311862992,"title":"CNN’s Data Guru Reveals How Many Trump Supporters Regret Their Vote","text":"CNN’s data guru Harry Enten has broken down the numbers on the level “regretful” Donald Trump voters who claim to no longer support the president—and it doesn’t look good for the Democrats.\n\nAccording to Enten, just two percent of Republican voters say they would change their vote if a hypothetical rematch between Trump and Kamala Harris were to happen tomorrow, with just one percent saying they would rather not vote at all.\n\n“I mean this is the big question, right? I hear all these stories, all these articles, all the Trump voters, saying they regret what they did back in 2024.” Enten remarked. “I’m here to tell you, very few of them regret what they did back in 2024.”\n\nThe data guru, citing a new poll from YouGov, said that for all the talk about buyer’s remorse, a repeat of last November’s election would likely end up with the exact same result.\n\n“We’re talking just 2%. That’s not even a wide spot on the road. And then there’s this additional 1% who say they would rather not vote.” Overall, less than 5% of Trump voters would even consider changing their vote, he explained.\n\nThe poll, conducted this month, also found near-identical levels of loyalty among Harris voters, suggesting there hasn’t been a serious swing in public opinion in either direction.\n\n”The bottom line is for all this talk of Trump voters regretting their vote in the numbers, it really just doesn’t show up,” said Enten. “If there’s some idea out there that Trump voters are going around, man, I wish I had voted for Kamala Harris instead of Donald Trump, the numbers say that is a fanciful universe. It really for the most part does not exist.”\n\nWhen asked about the “stickiness” of Trump voters compared to his first presidency by co-host John Berman, Enten revealed that more Republican voters held a more negative view of the president at this point in 2017 than they do in 2025.\n\n“In February 2017, four percent of Trump voters said they’d shift their vote—that’s actually slightly more than this time around. “So you know, you look back, you say, OK, there’s these Trump voters who really regret their vote. Historically speaking, they really don’t regret their vote,” he said. “And if anything, the number this time around is actually smaller than it was the first time around and it’s certainly smaller than the number we saw coming out of 2020, of course, after the events of January 6th.”\n\nA similar poll conducted by CBS earlier this month saw Trump’s popularity plummet following his disastrous tariff policies, which Enten said at the time was “the worst poll that Donald Trump has received in his second term.” 54 percent of voters said Trump is responsible for the current economic downturn, and the president’s approval ratings are currently “underwater.”\n\nBut Enten was keen to point out that pitting two people’s popularity against each other produces a different result than asking to judge them in isolation—and that the president’s current unpopularity does not translate into electoral gains for the Democrats.\n\nHe also highlighted the fact that Republicans are currently enjoying a rare lead over Democrats in terms of party recognition, with a recent poll putting them at +2% satisfaction.\n\n“If anything, the Republican brand has actually perhaps gotten a smidgen stronger, though these are within the margin of error, very different from 2017 when Democrats held a 5 point advantage,” he explained. “And I’ll finally note this looks very much like the generic ballot trend, which in 2025 looks an awful bit like November of 2024 when Republicans, of course won and held the House.”","summary":"Win McNamee / Getty ImagesCNN’s data guru Harry Enten has broken down the numbers on the level “regretful” Donald Trump voters who claim to no longer support the president—and it doesn’t look good for the Democrats.\n\nAccording to Enten, just two percent of Republican voters say they would change their vote if a hypothetical rematch between Trump and Kamala Harris were to happen tomorrow, with just one percent saying they would rather not vote at all.\n\n“I mean this is the big question, right? I hear all these stories, all these articles, all the Trump voters, saying they regret what they did back in 2024.” Enten remarked. “I’m here to tell you, very few of them regret what they did back in 2024.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/cnns-data-guru-reveals-how-many-trump-supporters-regret-their-vote/","image":"https://www.thedailybeast.com/resizer/v2/BEKHHFODCZDD7PT26G5HBHOCDY.jpg?smart=true&auth=0ebe88b7e9358230a92756cc6063c313906e7189edd7a9888f8b82a27356f7f7&width=1440&height=1080","video":null,"publish_date":"2025-04-16 17:45:59","author":"Tom Sanders","authors":["Tom Sanders"],"language":"en","category":"politics","source_country":"us","sentiment":-0.447},{"id":311864732,"title":"Trump Voters Are Sharing If He's Lost Their Support, And There's One Friendship Of His That They're Verrrrry Upset About","text":"Several people are going viral for admitting they regret voting for Donald Trump, so we asked people in the BuzzFeed Community who voted for him to share what he could do to lose their support.\n\nIn reaction to that post, several more people were inspired to share how the president could also lose their support in light of an international trade war and cuts to the federal workforce.\n\nThe responses were eye-opening. Here are a few of them:\n\n1.\"I have to give him a year before I’ll have regrets. He needs to follow through, or at least make headway with his campaign promises.\"\n\n\"But think of this: A lot of corruption has been exposed in a short time. The depth of it sickens me, and he’s not done. But we need indictments, or it’s all for nothing. Liberals hate everything he does. I really like that. It tells me he’s doing the opposite of the last four years.\n\nThe United States can’t breastfeed the world forever, and we’re trillions in debt. If Harris/Biden/Obama were in office now, it would be corruption as usual. Sorry, I mean business as usual. Remember, Trump is not a politician, he’s a businessman, and that’s why I voted for him.\"\n\n2.\"I am embarrassed that I voted/believed in him. He should be impeached. How did our Republican Party get so low? How can we treat our neighbor like Canada with so much disrespect? And Elon is a joke! We are the laughingstock of the world!\"\n\n3.\"If he does not charge 5,000% tariffs on anything and everything to those Canadian fucks we subsidize. They STEAL from us Americans and should either pay a 5,000% tariff or become the 51st state, the same goes for Greenland. They can be the 52nd state.\"\n\n4.\"Already has. Pardoned Jan. 6 criminals, threw Ukraine under the bus, crashed the stock market, spit in the face of most of our allies, and took a chainsaw to the federal government when he should’ve used a scalpel. I voted Republican, but that wasn’t a vote for Trump. It was a vote against Biden.\"\n\nEditor's Note: The phrase \"crashed the stock market\" is being used as hyperbole here. The stock market did not crash.\n\n5.\"Nothing, honestly. The tariffs could become problematic, but he really hasn’t done anything that bad yet.\"\n\n—cornytable97\n\n6.\"He lost it!!! I was a Marine for 30 years. The biggest reason I’ve voted Republican is because I want a strong defense, but I’m still a Black man. To remove the history of the Tuskegee Airmen, Montford Point Marines from military academy teaching just to benefit his white racist base is highly offensive. Heroism and patriotism don’t have a skin color. No more Trump and no more Republican Party for me. Ever.\"\n\n7.\"He will lose it if he keeps putting these unreasonable tariffs on our allies.\"\n\n8.\"The president's policies have caused quite a bit of chaos in my industry, but I support him. We will have some pain righting the ship and having a stable future. This is the price we have to pay for past bad decisions.\"\n\n9.\"Already lost it, acting like a clown in a circus, backed out of every promise made in the election, tearing our economy apart, going against the Constitution, acting like a foolish king in his kingdom, never should have been elected.\"\n\n10.\"Fail on the number one reason he got elected, the ECONOMY! So far, he's done everything to skirt around the issue. He should think about what the tariffs will do to the price of avocados!\"\n\n\"One more thing. GOP supporters don't like politics, so we just hear shit going on with Trump and think everything he does must be legal and constitutional. Ignorance is bliss. I wish I could take back my vote.\"\n\n11.\"I'm a Democrat who voted for Trump. Why, you ask? Because I'm smart enough to take the long view. After Trump is done, middle America ain't gonna vote GOP for decades.\"\n\n12.\"He promised on day one he’d bring down prices on everything. Exactly the opposite is happening with the tariffs he has enacted. I did agree with securing the borders and removing illegals along with doing away with supporting them when they have not contributed anything to social security.\"\n\n\"I do wish the administration would take a pause and not eliminate jobs so haphazardly. There are very important jobs/positions that need to be continued, such as research in cancer, science, medicine, etc. There needs to be a step back to reevaluate at a cautious speed.\n\nHe needs to help people, not put them in positions where they can't support themselves and their families. I am sorry I voted for him and have less faith in politicians than I ever thought possible.\"\n\nFact-check: During his campaign, Trump promised to bring prices down on food, but not everything.\n\nFact-check: Immigrants who are not in the US legally typically pay taxes and often contribute to social security.\n\n13.\"I voted for him three times, and now he really fucked me up. I lost my federal job with the VA, my 401(k) was reduced to about $85K from $125K in a week, and I am not sure when I turn 62 in 2035 that there will be any money in Social Security left for me.\"\n\n\"And even worse, I’d spent most of my savings (in tens of thousands) buying his stuff like shoes, coins, cards, and DJT stocks. My wife and my two daughters have left me because they couldn’t stand my MAGA attitude for all these years. I do not regret being a MAGA, but now I wonder if I am really not too smart like people said.\"\n\n14.\"He can’t. Love our president. 🇺🇸\"\n\n15.\"I voted for President Trump in 2024, really, for one main reason. I knew that our country was $35 trillion in debt, and this could not continue, so some significant change is required to reduce our debt.\"\n\n\"I am not, however, happy about the way that Elon Musk has gone around eliminating so many positions at different federal agencies, only to find out later that people who shouldn't have been, who were terminated, have been hired back. During this past week, Trump announced the tariffs for 180 countries, and I have seen my IRA balances drop dramatically due to the softness in the stock market. Significant change is needed, but I am concerned about the process being used to clearly think through the decisions being made.\"\n\n16.\"He already has with the ridiculous tariffs. I do not need or ever want again to feel the stress of watching my retirement accounts go down the drain. Even if they recover, I never should have been put in this position. This will not be forgotten.\"\n\n17.\"Nothing will cause him to lose my support. He is the only person with the guts and ability to stand up to the long-standing government corruption. The angry, hostile, and childish behavior of his enemies in the opposing party only encourages increased support and proves he is on the right path!\"\n\n18.\"He’s lost it. The list is so long. Being Putin’s lapdog. Being Elon’s lapdog. Trying to replace the Constitution in his own image. The oath he took was to preserve, protect, and defend the Constitution.\"\n\n\"All his actions and some of the responses to this survey by still fervent supporters are all for replacing the Constitution instead of preserving, protecting, and defending it. If he can take that oath, which is the foundation of the job, and do what he is doing, he is one of the most severe threats to our liberty and our country.\"\n\n19.\"Lose 20% of market value.\"\n\n20.\"If he stops deportations.\"\n\n21.\"If he doesn’t 'fight, fight, fight!'\"\n\n22.\"He's already lost my support. He's a liar. Blatant lies that no one has the guts to call him on. And cozying up to Russia is such a huge mistake. We have an opportunity of a lifetime to stick it to Russia and possibly cause change, and he's squandering it. Tariffs rarely work. Geez, I could go on for hours. I have many overseas friends, and for the first time ever, I'm embarrassed to be an American.\"\n\n23.\"I’m a veteran, and I am extremely upset Trump/Musk have zero empathy for us. We fight for this country and are treated like crap from them. An un-elected billionaire from South Africa gets to determine what happens, though. Disgusting.\"\n\n24.\"If he touches Social Security or Medicare or student loans.\"\n\n25.\"By being as ignorant as Joe Biden, and Kamala Harris.\"\n\n26.\"Removing the income-based repayment options for repaying federal student loans.\"\n\n27.\"If he doesn’t keep doing what he is doing! Plain and simple!\"\n\n28.\"He already has. He and Musk are hurting our country. I even changed my political party because of this. I did not know that when I voted for Trump, I was voting for Musk, too.\"\n\n29.\"He has already lost my support because he is the biggest liar I've ever come across.\"\n\n30.\"I THINK HE IS DOING GREAT!! ANYONE WHO QUESTIONS WHAT PRESIDENT TRUMP AND MUSK ARE DOING ARE OUT OF THEIR MINDS. ANYONE WHO IS AGAINST SAVING MONEY, ESPECIALLY OUR TAX MONEY, MUST BE FROM A DIFFERENT PLANET!!!\"\n\n31.\"Investments in the toilet, silly name changes, higher prices on everything, countries around the world hating us, TARIFFS! IGNORING the Constitution, getting advice from people who don’t know jacksh*t about the departments they are heading, divisiveness around the country, misinformation, misogynistic, and lying all the damned time!\"\n\n—sportyking33\n\n32.\"He campaigned on the promise of removing dangerous, violent, criminal, illegal immigrants from our country, and I was all for that. That is what I voted for. After Election Day, that changed.\"\n\n\"When asked about why the administration is deporting all illegal immigrants, even with zero criminal convictions, people with families, they simply replied, if they're here without documentation, they are criminals. When I first heard this at a press conference by the Leavitt lady, I immediately knew I had been a sucker and felt completely stupid.\"\n\n33.\"He’s already lost it. He wants any opposition removed, any guard rail removed; he’s targeting people and stripping their constitutional rights! This isn’t conservative in the slightest.\"\n\n34.\"Already has. Allowing Musk to control and access the government, pardoning Jan. 6 convicts. I agree with cutting waste, but not how he allows Musk to dictate what elected officials are doing. And Trump endorsing Tesla as our president is wrong.\"\n\n35.\"By continuing the clown show. Also, the White House is NOT an Apprentice stage show.\"\n\n36.\"He's already lost it. He has totally shocked me with all the things he's doing that I would have never guessed, e.g., firing people en masse without checking them out individually. I'm sure glad I'm retired.\"\n\n37.\"Stop eliminating federal agencies. Restructure but do not destroy. And please, please stop the rhetoric about Canada, Greenland, and the Panama Canal. There is no reason to bully friends of the US. His arrogance is getting offensive!\"\n\n38.\"He lost it on day one in pardoning the Jan. 6 participants. Everyone who lost their job because of DOGE is another vote lost.\"\n\n39.\"By not staying honest to the core of all his promises. I know (and I hope any halfway intelligent person also knows) that you can't always please everyone. However, I will gladly stick by my decision to vote for him as long as he sticks to doing absolutely everything he can and in his power to follow through with all the promises made.\"\n\n\"No one can clean up a disaster area overnight and have the patience to stay out of the way while the waters are being navigated. Mistakes are accepted as long as there is a plan B for each problem faced. No human can get everything right the first time, guaranteed.\n\nI only ask for honest admission if trying a different way to fix the problems failed the first time, that everyone is treated with respect and dignity and not made to beg for what has already been worked for and possibly sacrificed for, and to graciously get rid of the wrong-doers in power (they know who they are), and replace them with honest God-fearing leaders who will not jump ship.\"\n\n40.\"He has, showing who he is, and that’s enough for me.\"\n\n41.\"The minute he sided with Putin.\"\n\n42.\"He already has. His stance on Palestine is deplorable. A country should belong to its people, and we have NO right to dictate where or what the people should do with it. The US shouldn’t be fighting forever wars in the Middle East either.\"\n\n43.\"He lost my support when he threatened tariffs against Canada and Mexico using the excuse of drug trafficking, then he pardoned a notorious online drug dealer.\"\n\n\"Also, when he allowed Elon Musk to put over 50,000 American workers out of jobs. He launched a domestic attack on the American workforce and American businesses. He never gave a damn about the people who will lose their homes, their health insurance, and struggle to feed their kids. HE DOES NOT CARE.\"\n\n44.\"If he supports killing babies, aka abortion.\"\n\n45.\"He already did when he separated us from Canada. What a backstabbing son of a gun, ALWAYS pointing his finger at everyone else but himself. And when he allowed Musk and his crew to get into the system with all of our personal information.\"\n\nIf you voted for Trump in the 2024 election but there is something he could do to lose your support, we want to hear about it. Share your response below, or fill out this Google form to remain anonymous. Your response could be featured in an upcoming post.\n\nResponses have been edited for length/clarity.","url":"https://www.yahoo.com/news/trump-voters-sharing-hes-lost-172603524.html","image":"https://s.yimg.com/ny/api/res/1.2/zqHKF8L2fSwmEthXnz6juw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://media.zenfs.com/en/buzzfeed_articles_778/355f89b4c8992d1d5b5f0dbc3424d22f","video":null,"publish_date":"2025-04-16 17:26:03","author":"Ashley Holt","authors":["Ashley Holt"],"language":"en","category":"politics","source_country":"us","sentiment":-0.365},{"id":311835172,"title":"Older Arizona voters are closely watching Trump’s tariffs — and their retirement accounts","text":"By JONATHAN J. COOPER\n\nSUN CITY, Ariz. (AP) — Susan Hemphill said she’s always been frugal with her spending. But the recent volatility in the stock market caused by President Donald Trump’s on-again, off-again tariffs and an escalating trade war with China have made her even more cautious.\n\nThese days, Hemphill is staying closer to home in Sun City, Arizona, a 55-and-older community near Phoenix. No more day trips to Sedona, the retired union organizer said, fighting tears as she wondered aloud whether she could run out of money.\n\n“I’m so tired of Trump playing with our lives,” said Hemphill, who voted for Democrat Kamala Harris in November. “I’m too old for this. I just really want to be retired. I want to enjoy — I don’t want to worry.”\n\nTrump was elected with a promise to improve the economy, lower taxes and control inflation, addressing voters who said overwhelmingly that the economy was the top issue facing the country. But for retirees like Hemphill, the Republican president’s economic stewardship has been defined by the roller coaster of the stock market and fears his tariffs will lead to higher inflation.\n\n“Some are considering curtailing their spending, such as saving their tax refunds instead of spending them, while others are adjusting their investment strategies by moving money into more conservative allocations like bonds and gold,” said Prudence Zhu, a Phoenix-area financial adviser, in an email. “While this is often an emotional response, it’s not necessarily the optimal strategy in most cases.”\n\nHow all of those issues shake out could have a notable impact on the 2026 midterms and the 2028 presidential election, as the center of political gravity shifts increasingly toward battleground states in the South and the West, places like Arizona that are popular with retirees.\n\nLike other emerging political battlegrounds Nevada, Georgia and North Carolina, Arizona’s population has exploded over the past half-century, welcoming newcomers who have transformed its politics.\n\nThough Arizona has moved from reliably Republican to a battleground, Trump enjoys overwhelming support in Sun City, where Hemphill is among the 40,000 residents in a community that sprouted from the desert in the 1960s. Trump won every precinct in Sun City, most of them by double digits.\n\nTrump supporters like Paul Estok said they’re confident that the president has a handle on the situation and that things will stabilize with time.\n\n“I’m real happy about what’s going on,” said Estok, who gets three pensions from the various government agencies where he worked as a union stationary engineer in the Chicago area. He’s confident the pensions are secure.\n\nThe tariffs Trump announced on much of the world sparked turmoil in the stock market earlier this month, before the president abruptly hit pause on most of them. But the drama isn’t over. Trump said the 90-day pause would be used to negotiate over tariffs with other countries, but he increased the tax rate on Chinese imports to 145%.\n\nEstok said he’s thrilled to see a president tough enough to impose tariffs despite the economic consequences. Echoing Trump, he said other countries “have been taking so much advantage of us.”\n\n“No one’s ever stepped up and said, ‘Hey, enough’s enough,’” Estok said, climbing into his truck after stopping at a grocery store on his way home from the golf course.\n\nDon Welling, an 82-year-old Trump voter, said those alarmed by the tariffs are misguided. He didn’t enjoy seeing his portfolio take a dip, but he wasn’t worried.\n\n“If people would pay attention to what he said when he was campaigning, things would be better,” Welling said as he loaded groceries into his golf cart.\n\nSome retirees said they’re worried about the effect Trump’s federal cost-cutting is having on Social Security. While Trump insists he will not cut benefits, his administration has eliminated thousands of jobs at the Social Security Administration, leading to complaints about long call wait times.\n\nKarl Feiste winced to see his investments fall 20% in the days after Trump announced his tariffs, but he said, so far, his losses are only on paper.\n\n“If that turns around, then I can still continue to do what I’ve been doing,” said Feiste, a Vietnam War veteran who voted for Harris. “But I’m not planning on buying a car. I’m not planning on moving. I’m not planning on taking extravagant vacations. I’m wondering what’s going to happen to the market because that basically dictates what leisure money I have.”\n\nHe worries his Social Security checks, which make up half his income, could eventually fall victim to Trump’s aggressive government cost-cutting.\n\n“That smarts,” Feiste said. “Because I can’t live if he takes my Social Security.”\n\nTrump carried Arizona voters who were age 65 or older, winning 52% of this group compared with Harris’ 47%, broadly in line with his national margin among seniors, according to AP VoteCast, an extensive survey of voters and nonvoters that aims to tell the story behind election results.\n\nOlder Arizona voters were less likely than voters overall to consider “the economy and jobs” the most important issue facing the country, and they were more likely to consider immigration the top problem. About 3 in 10 seniors said the economy was the biggest problem, compared with about 4 in 10 Arizona voters overall.\n\nHans Vinge, 62, took a prime golf cart parking spot during a grocery store run one recent morning. A former Republican disillusioned by the party’s ideological shift under Trump, he thinks the president is doing too much, too fast, with unrealistic expectations for what his tariffs can accomplish.\n\n“We’re not ready right now. These companies aren’t going to come from offshore into America,” Vinge said. “It’s going to take 10, 15 years to get these companies in to Americanize everything, which is great. But it’s just it’s too disruptive right now.”\n\nVinge, who is retired from the Air Force and splits his time between North Dakota and Arizona, said it’s too stressful to follow the news day to day, but it’s hard to avoid. When he last peeked at the balance of his retirement account, it had fallen $23,000 in one week, he said.\n\n“It’s disappointing to see something that’s been doing well for you,” Vinge said. “I wish I would’ve invested more in gold.”\n\nAssociated Press writer Linley Sanders in Washington contributed.","summary":"How tariffs and the stock market shake out could affect the 2026 midterms.","url":"https://www.ocregister.com/2025/04/16/tariffs-retirees/","image":"https://www.ocregister.com/wp-content/uploads/2025/04/Trump_06644_bee34c-1-1.jpg?w=1024&h=685","video":null,"publish_date":"2025-04-16 17:10:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.233},{"id":311840518,"title":"Older Arizona voters are closely watching Trump’s tariffs — and their retirement accounts","text":"By JONATHAN J. COOPER\n\nSUN CITY, Ariz. (AP) — Susan Hemphill said she’s always been frugal with her spending. But the recent volatility in the stock market caused by President Donald Trump’s on-again, off-again tariffs and an escalating trade war with China have made her even more cautious.\n\nThese days, Hemphill is staying closer to home in Sun City, Arizona, a 55-and-older community near Phoenix. No more day trips to Sedona, the retired union organizer said, fighting tears as she wondered aloud whether she could run out of money.\n\n“I’m so tired of Trump playing with our lives,” said Hemphill, who voted for Democrat Kamala Harris in November. “I’m too old for this. I just really want to be retired. I want to enjoy — I don’t want to worry.”\n\nTrump was elected with a promise to improve the economy, lower taxes and control inflation, addressing voters who said overwhelmingly that the economy was the top issue facing the country. But for retirees like Hemphill, the Republican president’s economic stewardship has been defined by the roller coaster of the stock market and fears his tariffs will lead to higher inflation.\n\n“Some are considering curtailing their spending, such as saving their tax refunds instead of spending them, while others are adjusting their investment strategies by moving money into more conservative allocations like bonds and gold,” said Prudence Zhu, a Phoenix-area financial adviser, in an email. “While this is often an emotional response, it’s not necessarily the optimal strategy in most cases.”\n\nHow all of those issues shake out could have a notable impact on the 2026 midterms and the 2028 presidential election, as the center of political gravity shifts increasingly toward battleground states in the South and the West, places like Arizona that are popular with retirees.\n\nLike other emerging political battlegrounds Nevada, Georgia and North Carolina, Arizona’s population has exploded over the past half-century, welcoming newcomers who have transformed its politics.\n\nThough Arizona has moved from reliably Republican to a battleground, Trump enjoys overwhelming support in Sun City, where Hemphill is among the 40,000 residents in a community that sprouted from the desert in the 1960s. Trump won every precinct in Sun City, most of them by double digits.\n\nTrump supporters like Paul Estok said they’re confident that the president has a handle on the situation and that things will stabilize with time.\n\n“I’m real happy about what’s going on,” said Estok, who gets three pensions from the various government agencies where he worked as a union stationary engineer in the Chicago area. He’s confident the pensions are secure.\n\nThe tariffs Trump announced on much of the world sparked turmoil in the stock market earlier this month, before the president abruptly hit pause on most of them. But the drama isn’t over. Trump said the 90-day pause would be used to negotiate over tariffs with other countries, but he increased the tax rate on Chinese imports to 145%.\n\nEstok said he’s thrilled to see a president tough enough to impose tariffs despite the economic consequences. Echoing Trump, he said other countries “have been taking so much advantage of us.”\n\n“No one’s ever stepped up and said, ‘Hey, enough’s enough,’” Estok said, climbing into his truck after stopping at a grocery store on his way home from the golf course.\n\nDon Welling, an 82-year-old Trump voter, said those alarmed by the tariffs are misguided. He didn’t enjoy seeing his portfolio take a dip, but he wasn’t worried.\n\n“If people would pay attention to what he said when he was campaigning, things would be better,” Welling said as he loaded groceries into his golf cart.\n\nSome retirees said they’re worried about the effect Trump’s federal cost-cutting is having on Social Security. While Trump insists he will not cut benefits, his administration has eliminated thousands of jobs at the Social Security Administration, leading to complaints about long call wait times.\n\nKarl Feiste winced to see his investments fall 20% in the days after Trump announced his tariffs, but he said, so far, his losses are only on paper.\n\n“If that turns around, then I can still continue to do what I’ve been doing,” said Feiste, a Vietnam War veteran who voted for Harris. “But I’m not planning on buying a car. I’m not planning on moving. I’m not planning on taking extravagant vacations. I’m wondering what’s going to happen to the market because that basically dictates what leisure money I have.”\n\nHe worries his Social Security checks, which make up half his income, could eventually fall victim to Trump’s aggressive government cost-cutting.\n\n“That smarts,” Feiste said. “Because I can’t live if he takes my Social Security.”\n\nTrump carried Arizona voters who were age 65 or older, winning 52% of this group compared with Harris’ 47%, broadly in line with his national margin among seniors, according to AP VoteCast, an extensive survey of voters and nonvoters that aims to tell the story behind election results.\n\nOlder Arizona voters were less likely than voters overall to consider “the economy and jobs” the most important issue facing the country, and they were more likely to consider immigration the top problem. About 3 in 10 seniors said the economy was the biggest problem, compared with about 4 in 10 Arizona voters overall.\n\nHans Vinge, 62, took a prime golf cart parking spot during a grocery store run one recent morning. A former Republican disillusioned by the party’s ideological shift under Trump, he thinks the president is doing too much, too fast, with unrealistic expectations for what his tariffs can accomplish.\n\n“We’re not ready right now. These companies aren’t going to come from offshore into America,” Vinge said. “It’s going to take 10, 15 years to get these companies in to Americanize everything, which is great. But it’s just it’s too disruptive right now.”\n\nVinge, who is retired from the Air Force and splits his time between North Dakota and Arizona, said it’s too stressful to follow the news day to day, but it’s hard to avoid. When he last peeked at the balance of his retirement account, it had fallen $23,000 in one week, he said.\n\n“It’s disappointing to see something that’s been doing well for you,” Vinge said. “I wish I would’ve invested more in gold.”\n\nAssociated Press writer Linley Sanders in Washington contributed.","summary":"How tariffs and the stock market shake out could affect the 2026 midterms.","url":"https://www.sandiegouniontribune.com/2025/04/16/tariffs-retirees/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/04/Trump_06644_bee34c-1-1.jpg?w=1024&h=685","video":null,"publish_date":"2025-04-16 17:10:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.233},{"id":311842154,"title":"Older Arizona voters are closely watching Trump’s tariffs — and their retirement accounts","text":"By JONATHAN J. COOPER\n\nSUN CITY, Ariz. (AP) — Susan Hemphill said she’s always been frugal with her spending. But the recent volatility in the stock market caused by President Donald Trump’s on-again, off-again tariffs and an escalating trade war with China have made her even more cautious.\n\nThese days, Hemphill is staying closer to home in Sun City, Arizona, a 55-and-older community near Phoenix. No more day trips to Sedona, the retired union organizer said, fighting tears as she wondered aloud whether she could run out of money.\n\n“I’m so tired of Trump playing with our lives,” said Hemphill, who voted for Democrat Kamala Harris in November. “I’m too old for this. I just really want to be retired. I want to enjoy — I don’t want to worry.”\n\nTrump was elected with a promise to improve the economy, lower taxes and control inflation, addressing voters who said overwhelmingly that the economy was the top issue facing the country. But for retirees like Hemphill, the Republican president’s economic stewardship has been defined by the roller coaster of the stock market and fears his tariffs will lead to higher inflation.\n\n“Some are considering curtailing their spending, such as saving their tax refunds instead of spending them, while others are adjusting their investment strategies by moving money into more conservative allocations like bonds and gold,” said Prudence Zhu, a Phoenix-area financial adviser, in an email. “While this is often an emotional response, it’s not necessarily the optimal strategy in most cases.”\n\nHow all of those issues shake out could have a notable impact on the 2026 midterms and the 2028 presidential election, as the center of political gravity shifts increasingly toward battleground states in the South and the West, places like Arizona that are popular with retirees.\n\nLike other emerging political battlegrounds Nevada, Georgia and North Carolina, Arizona’s population has exploded over the past half-century, welcoming newcomers who have transformed its politics.\n\nThough Arizona has moved from reliably Republican to a battleground, Trump enjoys overwhelming support in Sun City, where Hemphill is among the 40,000 residents in a community that sprouted from the desert in the 1960s. Trump won every precinct in Sun City, most of them by double digits.\n\nTrump supporters like Paul Estok said they’re confident that the president has a handle on the situation and that things will stabilize with time.\n\n“I’m real happy about what’s going on,” said Estok, who gets three pensions from the various government agencies where he worked as a union stationary engineer in the Chicago area. He’s confident the pensions are secure.\n\nThe tariffs Trump announced on much of the world sparked turmoil in the stock market earlier this month, before the president abruptly hit pause on most of them. But the drama isn’t over. Trump said the 90-day pause would be used to negotiate over tariffs with other countries, but he increased the tax rate on Chinese imports to 145%.\n\nEstok said he’s thrilled to see a president tough enough to impose tariffs despite the economic consequences. Echoing Trump, he said other countries “have been taking so much advantage of us.”\n\n“No one’s ever stepped up and said, ‘Hey, enough’s enough,’” Estok said, climbing into his truck after stopping at a grocery store on his way home from the golf course.\n\nDon Welling, an 82-year-old Trump voter, said those alarmed by the tariffs are misguided. He didn’t enjoy seeing his portfolio take a dip, but he wasn’t worried.\n\n“If people would pay attention to what he said when he was campaigning, things would be better,” Welling said as he loaded groceries into his golf cart.\n\nSome retirees said they’re worried about the effect Trump’s federal cost-cutting is having on Social Security. While Trump insists he will not cut benefits, his administration has eliminated thousands of jobs at the Social Security Administration, leading to complaints about long call wait times.\n\nKarl Feiste winced to see his investments fall 20% in the days after Trump announced his tariffs, but he said, so far, his losses are only on paper.\n\n“If that turns around, then I can still continue to do what I’ve been doing,” said Feiste, a Vietnam War veteran who voted for Harris. “But I’m not planning on buying a car. I’m not planning on moving. I’m not planning on taking extravagant vacations. I’m wondering what’s going to happen to the market because that basically dictates what leisure money I have.”\n\nHe worries his Social Security checks, which make up half his income, could eventually fall victim to Trump’s aggressive government cost-cutting.\n\n“That smarts,” Feiste said. “Because I can’t live if he takes my Social Security.”\n\nTrump carried Arizona voters who were age 65 or older, winning 52% of this group compared with Harris’ 47%, broadly in line with his national margin among seniors, according to AP VoteCast, an extensive survey of voters and nonvoters that aims to tell the story behind election results.\n\nOlder Arizona voters were less likely than voters overall to consider “the economy and jobs” the most important issue facing the country, and they were more likely to consider immigration the top problem. About 3 in 10 seniors said the economy was the biggest problem, compared with about 4 in 10 Arizona voters overall.\n\nHans Vinge, 62, took a prime golf cart parking spot during a grocery store run one recent morning. A former Republican disillusioned by the party’s ideological shift under Trump, he thinks the president is doing too much, too fast, with unrealistic expectations for what his tariffs can accomplish.\n\n“We’re not ready right now. These companies aren’t going to come from offshore into America,” Vinge said. “It’s going to take 10, 15 years to get these companies in to Americanize everything, which is great. But it’s just it’s too disruptive right now.”\n\nVinge, who is retired from the Air Force and splits his time between North Dakota and Arizona, said it’s too stressful to follow the news day to day, but it’s hard to avoid. When he last peeked at the balance of his retirement account, it had fallen $23,000 in one week, he said.\n\n“It’s disappointing to see something that’s been doing well for you,” Vinge said. “I wish I would’ve invested more in gold.”\n\nAssociated Press writer Linley Sanders in Washington contributed.","summary":"How tariffs and the stock market shake out could affect the 2026 midterms.","url":"https://www.twincities.com/2025/04/16/tariffs-retirees/","image":"https://www.twincities.com/wp-content/uploads/2025/04/Trump_06644_bee34c-1-1.jpg?w=1024&h=685","video":null,"publish_date":"2025-04-16 17:10:31","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.233},{"id":311840866,"title":"How many MAGA would change their Trump vote? Poll number is shocking","text":"Are MAGA voters regretting casting their vote for President Donald Trump amid the tariff turmoil?\n\nNew polling shows an overwhelming majority of Trump voters stand by their 2024 vote, according to CNN polling guru Harry Enten. He said that a new poll showed that just 2% of those who voted for Trump said that they’d vote for a different candidate now, with just 1% saying that would rather not vote.\n\n“I mean, this is the big question, right? I hear all these stories, all these articles, all the Trump voters, they regret what they did back in 2024. I’m here to tell you, very few of them regret what they did back in 2024,” Enten said on Wednesday.\n\n“The poll was conducted this month. What percentage would change their vote to a different candidate? We’re talking just 2%. Just 2%. That’s not even a wide spot on the road. And then there’s this additional 1% who say they would rather not vote. We’re talking overall under 5% might or would have changed their vote,” he added. \n\nEnten noted that most voters who supported former Vice President Kamala Harris also do not regret casting their vote. He said that the idea that some Trump voters wished they voted for Harris is a “fanciful universe” that “does not exist.”\n\n\"So if there was a repeat, if folks got to be able to redo their vote that they had back in 2024, would the result be any different? I doubt it would be. I doubt it would be, or it would still be extremely close. The bottom line is, for all this talk of Trump voters regarding their vote and the numbers, it really just doesn’t show up,\" Enten said. \n\nHe also said that more Americans are self-identifying themselves as Republicans than they are Democrats.\n\n“And on this particular measure, which I think is so important, because what we saw in 2024 was Republicans getting a rare lead on party identification. It was a one point lead, according to Gallup,\" he said. \n\n“Look at where it was in an average of Gallup polls so far this year, plus two points for Republicans. If anything, the Republican brand has actually perhaps gotten a smidgen stronger, though these are within the margin of error. Very different from 2017, when Democrats held a five point advantage,\" Enten said.\n\nThis comes after a separate poll showed that more Americans are identifying with the MAGA movement now than in recent years.\n\nThe NBC News poll found 36% of registered voters identified themselves as MAGA supporters in March, which NBC noted is a “significant increase” from its previous polling. Previous NBC News surveys showed that just 23% of respondents in 2023 and 27% of respondents in 2024 identified themselves as MAGA supporters.\n\nThe poll also showed that 71% of registered Republicans said they identified with the MAGA movement.\n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"How many GOP voters would change their vote?","url":"https://www.nj.com/politics/2025/04/how-many-maga-would-change-their-trump-vote-poll-number-is-shocking.html","image":"https://www.nj.com/resizer/v2/VYU2OEPJJVDMTLBXN5KNPBQCZM.jpg?auth=27b9e83aaa0be90cd631c8918db7fb51c5070383e131bb80a17ebcf018ea2a63&width=1280&quality=90","video":null,"publish_date":"2025-04-16 17:04:52","author":"Lauren Sforza","authors":["Lauren Sforza"],"language":"en","source_country":"us","sentiment":-0.257},{"id":311858696,"title":"College-Aged Americans Now Favor GOP Over Dems, Yale Youth Poll Shows","text":"DAILY CALLER NEWS FOUNDATION—Many college-aged Americans are now supporting the Republican Party over the Democratic Party, according to the Spring 2025 Yale Youth Poll released Tuesday.\n\nThe student-led survey found that when asked whether they would vote for the Democrat or Republican candidate in the 2026 congressional elections in their district, voters aged 18 to 21 favored the Republican candidate by a margin of 11.7 percentage points. Meanwhile, voters aged 22 to 29 favored the Democrat candidate by a margin of 6.4 points.\n\nWhile the survey showed young voters gravitating toward the Republican Party, many respondents under 30 expressed an unfavorable view of both President Donald Trump and key Democratic Party figures. Among voters under 30, Trump’s net favorability rating was -17.9 while failed 2024 Democrat presidential nominee Kamala Harris’ favorability was -1. However, former President Joe Biden’s favorability rating among these voters was even worse than Trump’s at -19.5.\n\n“Politicians often promise things to young voters and reach out to young voters, but they can’t do that if they don’t have an understanding of what young voters believe and where young voters are,” Arjun Warrior, a data scientist for the Yale Youth Poll, told the Yale Daily News on Wednesday. “That’s why polls like this are really important, because they provide insight—albeit imperfect insight, but insight nonetheless—into what young voters believe.”\n\nComparatively, Harris led Trump by 21 points among young voters ahead of the November 2024 presidential election, according to a Yale Youth Poll released in October 2024.\n\nThe Democratic Party has reportedly been struggling with developing clear messaging and communicating with working class voters following the party’s losses in the 2024 election cycle. Democratic National Committee Chairman Ken Martin wrote in a February memo that “for the first time in modern history, Americans now see the Republicans as the party of the working class and Democrats as the party of the elites.”\n\nDemocrats have also been grappling with a string of recent polls showing record-low approval ratings among voters. The party is also facing several retirements ahead of the 2026 midterms, including Democrat Michigan Sen. Gary Peters and Democrat Minnesota Sen. Tina Smith and Democrat New Hampshire Sen. Jeanne Shaheen.\n\nNotably, some young voters shifted toward Trump in the 2024 presidential election cycle. According to AP VoteCast, over half of male voters under 30 supported Trump in the November 2024 presidential election, a shift from 2020, when Biden had won a similar share.\n\nTrump notably targeted young male voters during his 2024 presidential campaign, including by making appearances on several podcasts popular with male audiences, such as “The Joe Rogan Experience” and “This Past Weekend w/ Theo Von.”\n\nThe Yale Youth Poll sampled 4,100 self-reported registered voters, including 2,025 voters aged 18-29, enabling a comparison of young voters to the electorate as a whole. The survey was conducted between April 1 and 3.\n\nThis article originally appeared at The Daily Caller News Foundation.","summary":"DAILY CALLER NEWS FOUNDATION—Many college-aged Americans are now supporting the Republican Party over the Democratic Party, according to the Spring 2025 Yale Youth Poll released... Read More\n\n\nThe post College-Aged Americans Now Favor GOP Over Dems, Yale Youth Poll Shows appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/04/16/college-aged-americans-now-favor-gop-dems-yale-youth-poll-shows/","image":"https://www.dailysignal.com/wp-content/uploads/2025/04/young.jpg","video":null,"publish_date":"2025-04-16 16:49:02","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"us","sentiment":-0.103},{"id":311822788,"title":"US Vice President Vance's India visit an opportunity to review progress in bilateral relations: MEA ","text":"US Vice President J.D. Vances India visit from April 21 to 24 will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of the outcomes of the India-US Joint Statement issued in February during Prime Minister Narendra Modis visit to Washington the Ministry of External Affairs MEA said on Wednesday.\nVance will pay an official visit to India from April 21 to 24 and will be accompanied by Second Lady Usha Vance their children and senior members of the US Administration.\nThis will be Vice President Vances first visit to India. During the visit he will be meeting with Prime Minister Modi on April 21. The US Vice President and his delegation will have other engagements in Delhi and are also scheduled to visit Jaipur and Agra before departing for Washington on April 24.\nquotThe visit will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of the outcomes of the India-US Joint Statement issued on 13 February 2025 during the visit of the Prime Minister to the US. The two sides will also exchange views on regional and global developments of mutual interestquot read a statement issued by the MEA late Wednesday evening.\nEarlier in the day the White House also announced the US Vice Presidents forthcoming visit to Italy and India.\nIndia is second on the Vances two-nation tour with Italy being their first stop.\nThis would be the first visit to India by an American Vice-President in 13 years. The last was Joe Biden who travelled to India in 2013 as Vice-President to President Barack Obama.\nquotIn India the Vice President will visit New Delhi Jaipur and Agraquot Vances office said in a statement. quotThe Vice President will hold meetings with Prime Minister Narendra Modi. The Vice President and Second Family will also participate in engagements at cultural sitesquot it added.\nThere was no mention of Mike Waltz the National Security Advisor in the White House statement and it was not immediately clear if and when he is scheduled to travel to India. His visit when it happens will be the third by a senior member of the Trump administration to India following Tulsi Gabbard the Director of National Intelligence and Vice-President Vance.\nThe Vice-President first met PM Modi in Paris on the sidelines of the AI summit in February. The Second Lady and the second couples two sons also met the Prime Minister.\nVance has emerged as an important member of the Trump cabinet and an advocate of President Donald Trumps agenda. The President often calls him for remarks during publicly-aired meetings with visiting foreign dignitaries. His most significant Oval Office intervention so far came in the meeting with Ukraines Volodymyr Zelensky.\nUsha Vances parents came to the US from Andhra Pradesh and she was born in San Diego. Her birth name is Usha Bala Chilukuri.\nVances predecessor in the White House Vice-President Kamala Harris never visited India during her tenure although she is also of Indian-descent like Usha Vance mdash her mothers family was based in Tamil Nadu. Mike Pence who was Vice-President in President Trumps first term also could not make it although he had expressed a desire to undertake a tour of India.","summary":"US Vice President J.D. Vance visits India from April 21-24, marking the first such visit in 13 years. He will meet PM Modi to review bilateral ties and visit cultural sites.","url":"https://odishatv.in/news/national/us-vice-president-vance-s-india-visit-an-opportunity-to-review-progress-260543","image":"https://images.odishatv.in/uploadimage/library/16_9/16_9_5/recent_photo_1744820890.webp","video":null,"publish_date":"2025-04-16 16:28:20","author":"Odishatv Bureau","authors":["Odishatv Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":0.216},{"id":311821812,"title":"‘Democrats Lost Them’: Here’s Why 2020 Biden Voters Sat Out The 2024 Election","text":"If you, like a lot of us, spend your days confronting each fresh horror this administration manufactures and marveling, “How the fuck did Americans let this happen again?” — well, we can help you with the ‘how’ part, at least. Data from the 2024 voter file is finally coming in, and a picture of the American electorate that ushered in a second Donald Trump term is starting to emerge. \n\n There are two categories of voters whose decisions in November helped bring about our present and ongoing nightmare: swing voters who flipped from Joe Biden to Trump, and 2020 Biden voters who sat the last election out entirely. The progressive donor network Way to Win worked with the Democratic data firm Catalist and pollster Lake Research Partners in an effort to get a better handle on the second group, Biden voters in battleground states who opted out in 2024, the results of which the group has shared exclusively with Rolling Stone.\n\n Across the four Sunbelt battleground states — Nevada, Arizona, Georgia, and North Carolina — there were more than 2.1 million voters who supported the Democratic ticket in 2020, but didn’t show up for Vice President Kamala Harris four years later. That’s a meaningful drop, and one that was large enough on its own to swing the election: Trump only won those states by a combined 531,539 votes. \n\n Analysis of Catalist data showed that Democrats (both registered and modeled) sat out of the 2024 election at a higher rate than their Republican counterparts. Across every state and almost every demographic group analyzed, Democrats’ vote share declined compared to 2020 — and left-leaning voters removing themselves from the voting pool meant that the electorate was redder than it would have been had they participated. \n\n Some pundits and Democratic operatives have interpreted the election results as an emphatic endorsement for Trump’s message. But in focus groups, these voters paint a very different picture. \n\n “If you listen to them you really understand that, on the whole, these voters didn’t skip voting because they viewed Kamala as too liberal or too woke, and the vast majority of them, if they had shown up, would not have voted for Trump. They are not swinging to the right, it’s more that the Democrats lost them,” Jenifer Fernandez Ancona, the co-founder of Way to Win explains. “They’re deeply disappointed with the Democratic Party. They’re skeptical of government. They’re skeptical of politics in general — but they are gettable. They’re persuadable.”\n\n The focus groups included Biden voters who didn’t vote in 2024 across those four Sunbelt states as well the same voters in Michigan, Wisconsin and Pennsylvania, with a particular emphasis on groups that constituted the Democrats’ largest losses in 2024: voters of all races and genders under 35, Latino men and women under 65, and Black men under 65.\n\n The data collected in these groups helps dispel some of the misconceptions people have about why those voters stayed home in November. For one thing, they are not politically apathetic — the voters interviewed reported they were engaged with politics, but unhappy with their choices and unconvinced that either candidate could make a positive change in their lives. But they are open to persuasion — one woman shared a story about attending Harris rally, which she left early after Harris failed to address the issues that mattered most to her. \n\n Non-voters had other gripes with the Harris-Walz campaign too: “A surprisingly common frame was that the campaign ‘wasn’t serious,’ with many citing the Haris’s celebrity endorsements and event appearances and framing them negatively.” Voters across groups indicated a belief that Democrats were focused on the “wrong things,” with Black men in particular expressing their feeling “that Dems cared more about immigrants, trans people, and waging war in Ukraine and Gaza than domestic priorities or their daily economic realities.” (Young voters, on the other hand, took issue with Harris’ perceived silence on Gaza, with a majority of voters in that focus group saying her unwillingness to take a stand affected their decision not to vote.)\n\n It’s also worth noting that the word “woke” didn’t come up in any of the focus groups, but there was an overwhelming feeling expressed across all of the groups that the Democratic Party is “weak,” that Democrats “need to grow a backbone,” and “stand up, and not just talk” — and that the party, and its candidates, are not concerned enough with the realities of voters’ day-to-day lives.\n\n “It’s not a question of left versus center, which is the question that has dominated the discourse. It really is a question of, ‘Are you going to fight for me, or are you going to fold and capitulate?’ And, the economic element of: ‘Are you for the oligarchs and the status quo? Or are you for disrupting these systems that have not worked for me, and helping me to get a better life?’” Ancona says. “That is the crux.”\n\n There was a note of hope: The same voters that sat out last November have been horrified by what they’ve watched Trump and Elon Musk do since January — and most of the focus group participants reported that they are feeling strongly motivated to vote in 2026. The groups also offer some insight into what kind of leader might be able to draw these voters back to the Democrat party. Hint: That person is more in the mold of Rep. Alexandria Ocasio-Cortez than Senate Majority Leader Chuck Schumer, who infuriated the Democratic base when he helped advance the GOP’s partisan spending bill. \n\n “There’s such a disgust for the business-as-usual mentality, and I think it really sticks with people,” Ancona says. “When they see what’s happening, they feel what’s happening, and they just don’t understand why some of the Democrats they see seem so stuck in sort of civility politics — they’re just they’re just going along with it. These voters are like: This isn’t a game. My life sucks! Fix this stuff!”","summary":"New data reveals how millions of Democrats staying home threw the election to Donald Trump — and why they didn’t vote for Kamala Harris","url":"https://www.rollingstone.com/politics/politics-features/why-2020-biden-voters-sat-out-2024-1235318121/","image":"https://www.rollingstone.com/wp-content/uploads/2025/04/dems-stayed-home.jpg","video":null,"publish_date":"2025-04-16 16:15:04","author":"Tessa Stuart,Tessa Suart","authors":["Tessa Stuart","Tessa Suart"],"language":"en","category":"politics","source_country":"us","sentiment":-0.375},{"id":311890988,"title":"Biden says Trump is ‘breaking things,’ including Social Security","text":"Joe Biden forcefully defended Social Security in a speech to disability advocates in Chicago on Tuesday, condemning the Trump administration for “taking a hatchet” to the Social Security Administration.\n\nIn his first expansive public comments since leaving the White House, Biden said President Donald Trump had taken aim at Social Security, doing “damage and destruction” to a program that millions of Americans depend on.\n\n“Social Security deserves to be protected for the good of the nation as a whole,” Biden said, adding that Trump officials are applying a Silicon Valley mantra of “move fast and break things” to the government. “Well, they’re certainly breaking things. They’re shooting first and aiming later.”\n\nTrump has promised not to cut Social Security benefits for the 73 million Americans enrolled, but offices around the country have been flooded with calls and questions from Americans worried that changes in their benefits and in their local Social Security offices may be imminent.\n\nAt local offices, many staff members have taken buyouts or early retirements promoted by the Trump administration’s cost-cutting efforts, leading to longer phone waits and lines. The Social Security Administration has said it wants to shed thousands of jobs at its headquarters.\n\nBiden said that during his administration, the Social Security Administration cut wait times, improved anti-fraud measures and made the appeals system for benefits more uniform.\n\n“It all became more efficient and more effective,” he said, drawing applause from the audience, a group of hundreds of lawyers and other professionals who advocate on behalf of people with disabilities.\n\nBiden, 82, has kept a relatively low profile since he left the White House in January. He was seen attending the opening night of “Othello” on Broadway. He has popped into a diner in Delaware and an Italian restaurant in Georgetown, and regularly ridden the Amtrak between his home in Delaware and a post-presidential office in Washington.\n\nOver the weekend, Biden attended a Seder with Gov. Matt Meyer of Delaware, a fellow Democrat who wrote on social media that they had “prayed for Gov. Josh Shapiro and his family” after the arson attack on the Pennsylvania governor’s home.\n\nBiden has been in touch with a number of former top advisers and former senior administration officials, including Bruce Reed, Steve Ricchetti, Jake Sullivan, Jeff Zients and Antony Blinken, according to two people close to him.\n\nThe same top aides are surrounding him in his post-presidential life, including Annie Tomasini, who was a deputy chief of staff in the White House, and Anthony Bernal, who was a senior adviser for Jill Biden.\n\nBehind the scenes, Biden has been in touch with some lawmakers and the new head of the Democratic National Committee, Ken Martin. Martin met with Biden at the former president’s offices in Washington after Martin won the chairmanship, and the former president offered to be supportive, two people briefed on the meeting said.\n\nBiden has begun work on a memoir about his time in office, after signing on with the Creative Arts Agency, which represented him from 2017-20. He declined to participate in the many books by journalists about the 2024 campaign and the end of his White House tenure.\n\nThe Chicago speech marks the beginning of what could be a stretch on the speaker circuit for Biden. It was a paid address and, according to two people familiar with the matter, he is expected to participate in further more speaking engagements.\n\nBiden has made other low-profile appearances since leaving office, accepting an award this month from the International Brotherhood of Electrical Workers in Washington and speaking last month at the National High School Model United Nations in New York.\n\nDuring his 2020 presidential campaign, Biden often warned of the threats he believed a second Trump administration would pose to the country.\n\n“We can survive four years of Donald Trump,” he said at the time. “But if we give him eight years in the White House, he will forever alter the character of our nation.”\n\nNow, many in Biden’s party fault him for helping to usher in a second Trump term.\n\nBy insisting on seeking reelection, then abruptly bowing out under pressure from his party amid alarm over signs of aging and frailty, there was little time for a robust Democratic primary that could have stress-tested the party’s deep bench.\n\nFormer Vice President Kamala Harris, who eventually became her party’s nominee with Biden’s quick endorsement, still thinks she would have beaten Trump if she had more time to campaign, according to friends, former aides and advisers.\n\nHarris has made a few public appearances since her November defeat, while her running mate, Gov. Tim Walz of Minnesota, has held town halls in Republican-leaning states. He is one of many ambitious Democrats plunging back into the fight to reconstitute a demoralized party.\n\nBut Biden, once one of his party’s most in-demand surrogates, is unlikely to be summoned back to the campaign trail by Democratic candidates hoping to appear with him anytime soon: At the end of his term, his approval rating was in the 30s.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"Joe Biden forcefully defended Social Security in a speech to disability advocates in Chicago on Tuesday, condemning the Trump administration for &#8220;taking a hatchet&#8221; to the Social Security Administration.","url":"https://www.staradvertiser.com/2025/04/16/breaking-news/biden-says-trump-is-breaking-things-including-social-security/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/04/web1_20250416_brk_jbi01.jpg","video":null,"publish_date":"2025-04-16 16:15:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":0.089},{"id":311812956,"title":"US Vice President Vance’s India visit an opportunity to review progress in bilateral relations: MEA (Lead)","text":"New Delhi/Washington, April 16 (IANS) US Vice President J.D. Vance’s India visit from April 21 to 24 will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of the outcomes of the India-US Joint Statement issued in February during Prime Minister Narendra Modi’s visit to Washington, the Ministry of External Affairs (MEA) said on Wednesday.\n\nVance will pay an official visit to India from April 21 to 24 and will be accompanied by Second Lady Usha Vance, their children, and senior members of the US Administration.\n\nThis will be Vice President Vance’s first visit to India. During the visit, he will be meeting with Prime Minister Modi on April 21. The US Vice President and his delegation will have other engagements in Delhi and are also scheduled to visit Jaipur and Agra before departing for Washington on April 24.\n\n“The visit will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of the outcomes of the India-US Joint Statement issued on 13 February 2025 during the visit of the Prime Minister to the US. The two sides will also exchange views on regional and global developments of mutual interest,” read a statement issued by the MEA late Wednesday evening.\n\nEarlier in the day, the White House also announced the US Vice President’s forthcoming visit to Italy and India.\n\nIndia is second on the Vances’ two-nation tour with Italy being their first stop.\n\nThis would be the first visit to India by an American Vice-President in 13 years. The last was Joe Biden, who travelled to India in 2013 as Vice-President to President Barack Obama.\n\n“In India, the Vice President will visit New Delhi, Jaipur, and Agra,” Vance’s office said in a statement. “The Vice President will hold meetings with Prime Minister Narendra Modi. The Vice President and Second Family will also participate in engagements at cultural sites,” it added.\n\nThere was no mention of Mike Waltz, the National Security Advisor, in the White House statement and it was not immediately clear if and when he is scheduled to travel to India. His visit, when it happens, will be the third by a senior member of the Trump administration to India, following Tulsi Gabbard, the Director of National Intelligence, and Vice-President Vance.\n\nThe Vice-President first met PM Modi in Paris on the sidelines of the AI summit in February. The Second Lady and the second couple’s two sons also met the Prime Minister.\n\nVance has emerged as an important member of the Trump cabinet, and an advocate of President Donald Trump’s agenda. The President often calls him for remarks during publicly-aired meetings with visiting foreign dignitaries. His most significant Oval Office intervention so far came in the meeting with Ukraine’s Volodymyr Zelensky.\n\nUsha Vance’s parents came to the US from Andhra Pradesh and she was born in San Diego. Her birth name is Usha Bala Chilukuri.\n\nVance’s predecessor in the White House, Vice-President Kamala Harris, never visited India during her tenure although she is also of Indian-descent like Usha Vance — her mother’s family was based in Tamil Nadu. Mike Pence, who was Vice-President in President Trump’s first term also could not make it although he had expressed a desire to undertake a tour of India.","summary":"New Delhi/Washington, April 16 (IANS) US Vice President J.D. Vance&#8217;s India visit from April 21 to 24 will provide an opportunity for both sides to review the progress in bilateral&#8230; Continue reading US Vice President Vance&#8217;s India visit an opportunity to review progress in bilateral relations: MEA (Lead)\n\n\nThe post US Vice President Vance’s India visit an opportunity to review progress in bilateral relations: MEA (Lead) first appeared on Australia India News.","url":"https://indianews.com.au/us-vice-president-vances-india-visit-an-opportunity-to-review-progress-in-bilateral-relations-mea-lead/","image":"https://iansportalimages.s3.amazonaws.com/thumbnails/202504163379519.jpg","video":null,"publish_date":"2025-04-16 16:04:31","author":"India News Newsdesk","authors":["India News Newsdesk"],"language":"en","category":"politics","source_country":"AU","sentiment":0.134},{"id":311853028,"title":"Hostage survivor Noa Argamani named to Time’s 100 most influential people","text":"Noa Argamani, a Hamas captivity survivor who was abducted from the Nova music festival and rescued in a daring operation that claimed the life of commando Arnon Zmora, after 245 days held by Hamas, was selected on Wednesday for Time magazine's list of the 100 most influential people in the world. Argamani was chosen alongside figures such as U.S. President Donald Trump and Vice President JD Vance, tech mogul Elon Musk and celebrities such as Tennis icon Serena Williams, actress Blake Lively and many others. Doug Emhoff, husband of former U.S. vice president Kamala Harris, wrote about Argamani. \"The video of Noa Argamani on Oct. 7, 2023, is forever seared into my soul. She was joyfully dancing with so many others at the Nova music festival when Hamas launched its brutal terrorist attack. As she was kidnapped into Gaza on a motorcycle, her harrowing expression became a symbol of the pain and trauma Jews worldwide, myself included, continue to feel.\" \"Noa was held hostage for 245 days, a period she called “a pure hell.” Since her rescue, she has shown extraordinary courage and humanity in speaking out for the remaining hostages, including her -partner Avinatan Or. My wife Kamala Harris and I stand with Noa in fighting for the release of all the hostages. We cannot give up until every one of them is home.\" Emhoff added that Argamani's actions \"-illuminated Hamas’ extreme brutality, but more importantly, her bravery has embodied Jewish resilience and strength even in the worst moments. She is living proof to the world that, despite everything, 'we will dance again.'\" Get the Ynetnews app on your smartphone: Google Play: https://bit.ly/4eJ37pE | Apple App Store: https://bit.ly/3ZL7iNv Other prominent figures mentioned in the ranking include Syrian interim President Ahmad al-Sharaa, with former U.S. Ambassador to Syria Robert Ford writing about him. The former ambassador noted his past affiliations with al-Qaeda and ISIS and the fact that under his leadership, Syrian rebels managed to overthrow the previous president, Bashar Assad. Ford also mentioned that \"to beat Assad, the ambitious al-Sharaa understood he had to become a political leader as well as a military force.\" Other notables features include pop star Ed Sheeran, movie stars such as Scarlett Johansson, Kristen Bell, Demi Moore and Adrien Brody Frenchwoman Gisèle Plicque, whose husband recruited 72 men to assault her additional leaders such as British Prime Minister Keir Starmer and Jewish Mexican President Claudia Sheinbaum journalist and presenter Megyn Kelly Trump administration Health Secretary Robert Kennedy Jr. the greatest gymnast in history, American Simone Biles Bangladeshi economist and entrepreneur Muhammad Yunus Facebook founder and Meta owner Mark Zuckerberg American entrepreneur Jonathan Greenblatt, and more. Follow Ynetnews on Facebook | Twitter | Instagram | Telegram","summary":"Noa Argamani, freed after 245 days in Hamas captivity, honored by Time for her courage and advocacy for hostage release","url":"https://www.ynetnews.com/article/b1jh5epr1x","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/04/16/SJIXkVpCkg/SJIXkVpCkg_0_0_1280_853_0_large.jpg","video":null,"publish_date":"2025-04-16 15:52:17","author":"Ynet","authors":["Ynet"],"language":"en","category":"politics","source_country":"il","sentiment":0.299},{"id":311816290,"title":"Do Donald Trump Supporters Regret Their Vote? What Poll Shows","text":"Nearly one in four voters who supported President Donald Trump in the 2024 presidential race have questions about whether they made the right decision, according to a new poll.Newsweek reached out to the White House for comment via email.Why It MattersTrump became the first Republican to win the popular vote in 20 years in last year's presidential race, but his approval rating has quickly tumbled over the past few months as he faces backlash over some of his administration's deportations, tariffs and the cuts recommended by the Department of Government Efficiency (DOGE).How Americans feel about Trump will be a key factor in the Virginia and New Jersey gubernatorial races later this year, as well as the 2026 midterm elections. Historically, the president's party loses seats during the midterms—and Democrats are hoping for a 2018-esque \"blue wave\" if Trump's approval continues to drop.What to KnowThe new poll from the University of Massachusetts Amherst showed that 26 percent of Trump's 2024 voters have at least some concerns about their choice, though notably the majority, 74 percent, still are confident in their vote.Only two percent said they wish they could have voted differently, and an additional one percent said they \"might\" have voted differently. Four percent said they have mixed feelings about their vote, while 19 percent said they feel confident about their vote but do have \"some concerns.\" An additional one percent of Trump voters said they would have rather not voted at all.Among those who backed Vice President Kamala Harris, 78 percent said they are confident they made the right decision. Four percent said they are confident about their vote but have some concerns, while 3 percent said they have mixed feelings about their vote. One percent said they would have changed their vote if they could do so.Still, 14 percent of Harris voters said they would rather have not voted.Ray La Raja, co-director of the UMass poll, told Newsweek the poll shows that Trump has enjoyed a short honeymoon due to the uncertainty his policies have caused, even among his own voters.\"I think he's shortened the honeymoon because he's done so much so fast, so he's sped the process up. He's created a great deal of uncertainty. That's how I read many of these results. The Democrats are totally against him, obviously, but it's even created uncertainty among Republicans. They're giving him a lot of slack, but the uncertainty is making them a little nervous,\" he said.He noted that most of these voters would still probably vote for Trump if the election were held today, but that may change in the coming months if the state of the economy does not improve.\"If he thinks this is working, he needs to demonstrate in the next few months how it's working,\" he said.What People Are SayingMeredith Poll Director David McLennan, in a poll report of North Carolina voters released Tuesday: \"Our survey was in the field as President Trump implemented the nearly universal tariffs and the stock market dropped significantly. It is hard for people to be optimistic about the economy's future when they are worried about the price of goods and their retirement funds.\"Trump said on Truth Social, in response to an NBC poll suggesting a growing number of voters identify as MAGA supporters: \"A just out NBC Poll says that MAGA is gaining tremendous support. I am not, at all, surprised!!!\"What Happens NextLa Raja said these poll results could have implications for Republicans in the gubernatorial races later this year.\"Usually, the outparty is very mobilized, angry, and ready to go to the polls. That's definitely the case in both New Jersey and Virginia. It's going to be a pattern of backlash against the incumbent party,\" he said.","summary":"A new poll revealed how many Trump voters have \"concerns\" about their vote in the 2024 presidential race.","url":"https://www.newsweek.com/donald-trump-supporters-regret-vote-poll-2060498","image":"https://d.newsweek.com/en/full/2628377/donald-trump-voter-regret-poll-republicans-election.jpg","video":null,"publish_date":"2025-04-16 15:39:48","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.178},{"id":311812566,"title":"Over 99% of political donations from top Harvard officials went to Democrats","text":"Over 99% of political contributions larger than $100 made by Harvard administrators, executives, deans, provosts, and others in leadership positions since 2015 went to Democratic candidates or liberal organizations, a Washington Examiner analysis of Federal Election Commission records found. Of the roughly 3,000 political donations the Washington Examiner identified, just over 20 were earmarked for Republicans or conservative committees. These donations only accounted for about $10,000 of the roughly $1.3 million documented in the records. \n\nFormer Vice President Kamala Harris, former President Joe Biden, former Secretary of State Hillary Clinton, Sen. Elizabeth Warren (D-MA), and Rep. Ayanna Pressley (D-MA) were some of the most popular Democratic candidates among Harvard’s administrators and leaders. EMILY’s List, a pro-abortion political committee, and the Democratic National Committee were also popular among the Harvard employees.\n\nCounted among the donors are multiple deans, the university’s chief of staff, executive directors of numerous departments and programs, and a bundle of C-level executives.\n\nA significant portion of the Republican donations made by Harvard administrators and leadership went to candidates who challenged President Donald Trump in primary elections, including Nikki Haley and Bill Weld. Trump himself received less than $500 in contributions from top Harvard employees across the three elections covered by the FEC dataset.\n\nHarvard, in its response to the Trump administration’s demands, specifically took issue with the White House’s efforts to promote ideological diversity and combat alleged antisemitism at the institution, accusing the president of attempting to violate its First Amendment rights.\n\n“No government — regardless of which party is in power — should dictate what private universities can teach, whom they can admit and hire, and which areas of study and inquiry they can pursue,” Harvard President Alan M. Garber wrote. “Freedom of thought and inquiry, along with the government’s longstanding commitment to respect and protect it, has enabled universities to contribute in vital ways to a free society and to healthier, more prosperous lives for people everywhere. All of us share a stake in safeguarding that freedom.”\n\nThe Trump administration responded to Harvard’s defiance by freezing over $2 billion in grant funding earmarked for it. The president went on to threaten Harvard’s tax-exempt status in a statement posted to Truth Social on Tuesday.\n\n“Perhaps Harvard should lose its Tax Exempt Status and be Taxed as a Political Entity if it keeps pushing political, ideological, and terrorist inspired/supporting ‘Sickness?’” Trump wrote. “Remember, Tax Exempt Status is totally contingent on acting in the PUBLIC INTEREST!”\n\nIn addition to the overwhelming support for the Democratic Party by the people running Harvard, the university is also bankrolled by large liberal donors — a group whose influence will only grow if federal dollars dry up.\n\nPhilanthropies with links to the Democratic Party pour millions of dollars into Harvard annually. Among them are big names such as anti-Trump billionaire Pierre Omidyar’s Democracy Fund, Arabella Advisor’s dark money network, the Soros family’s Open Society Foundations, the New America Foundation, and Pew Charitable Trusts. \n\nMany individual liberal philanthropists have also made massive contributions to the university. Bill Gates, who reportedly donated $50 million to support Harris’s 2024 presidential bid, has given tens of millions of dollars to the university. Mike Bloomberg, a Democrat who ran one of the most expensive presidential campaigns in history, likewise has donated tens of millions. Hansjörg Wyss, a Swiss philanthropist who made his fortune manufacturing medical devices and spends millions supporting liberal causes in the United States, had given Harvard $350 million as of 2022.\n\nGenerally, gifts from these large-dollar donors fund specific programs at Harvard and don’t simply go to the general treasury. Wyss’ donations, for example, fund the Wyss Institute for Biologically Inspired Engineering, which exists to “transform healthcare and the environment by developing innovative technologies that emulate the way Nature builds, and accelerate their translation into commercial products through the formation of startups and corporate partnerships to bring about positive near-term impact in the world.”\n\nWealthy donors have recently attempted to use their financial contributions as leverage to influence higher education, with many having threatened to cut funding to elite universities following the October 7th terrorist attacks in Israel unless they clamped down on pro-Palestinian demonstrations. \n\nHarvard did not respond to a request for comment.","summary":"When Harvard University made headlines for refusing to comply with the Trump administration’s proposed terms for federal grant funding, it explained its decision was based on its “independence” and stressed its commitment to “broaden[ing] the intellectual and viewpoint diversity” at the institution. While Harvard pays lip service to ideological diversity, the university is overwhelmingly led [&#8230;]","url":"https://www.washingtonexaminer.com/news/3381457/political-donations-from-top-harvard-officials-democrats/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/Trump-inaugura.webp","video":null,"publish_date":"2025-04-16 15:25:35","author":"Robert Schmad","authors":["Robert Schmad"],"language":"en","category":"politics","source_country":"US","sentiment":0.203},{"id":311812564,"title":"Chris Van Hollen attempts to meet Kilmar Abrego Garcia as Rachel Morin’s mother slams senator","text":"However, Van Hollen appeared alone in a video he recorded at a gate in Baltimore/Washington International Airport before boarding a plane to El Salvador’s capital, San Salvador.\n\n“The goal of this mission is to let the Trump administration … to let the government of El Salvador know that we are going to keep fighting to bring Abrego Garcia home until he returns to his family,” Van Hollen said. “I hope to meet with representatives of the government. I hope to have the chance to actually see Kilmar and see what his condition is, but we are going to keep fighting because this is a miscarriage of justice.”\n\nVan Hollen said the Supreme Court “ruled 9 to 0” on Abrego Garcia’s case, but the decision was “per curiam,” which does not necessarily mean it was unanimous. Per curiam decisions are made without rendering written opinions, as Justice Sonia Sotomayor offered merely a statement with Justices Elena Kagan and Kentanji Brown Jackson.\n\n“This is about due process. This is about the rule of law,” Van Hollen continued. “This is what bullies do is they begin by picking on the most vulnerable, but if we get rid of the rule of lot to process the United States, it’s a short road from there to tyranny.”\n\nMeanwhile, in Van Hollen’s home state, Rachel Morin had her day in court posthumously. On Monday, a jury convicted Victor Antonio Martinez Hernandez, an illegal immigrant, of her murder. Her mother, Patty Morin, said Van Hollen hadn’t bothered to call her since the death of her daughter last year.\n\n“There was no action on the Democratic Party in any way from Joe Biden, Kamala Harris, [Alejandro] Mayorkas, anyone here in Maryland, none of the senators, did anything to help search for the murderer of my daughter,” Morrin said on Fox News’s Hannity on Tuesday.\n\nThe White House has condemned media reports referring to Abrego Garcia as a “Maryland man” because he illegally immigrated to the U.S. in 2011.\n\n“Chris and his bedwetting friends have shown more concern and sympathy for an illegal MS-13 gang member than victims of horrific migrant crimes,” Steven Cheung, White House communications director, told the Washington Examiner. “He is a complete disgrace to his office and should be thoroughly shamed for his disgusting actions.”Attorney General Pam Bondi said this week that Democrats who visit Abrego Garcia are “detached from reality.”\n\nThe DOJ classified Abrego Garcia as an MS-13 member and deported him to El Salvador, his home country. Democrats have pointed to a lack of paperwork as evidence that he was mistakenly deported.\n\nBukele said he has no plans to return Abrego Garcia to the U.S., meaning he will remain in CECOT.","summary":"Sen. Chris Van Hollen (D-MD) announced he was leaving for El Salvador on Wednesday after a man accused of having ties to the MS-13 gang was mistakenly deported there. While a district judge ruled in favor of bringing Kilmar Abrego Garcia back to the United States, the Department of Justice said the ruling did not dictate whether [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3381814/chris-van-hollen-visit-el-salvador-kilmar-abrego-garcia-rachel-morin-murder-trial-illegal-immigrant/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/USAID-LAWMAKERS-scaled-1024x683.webp","video":null,"publish_date":"2025-04-16 15:12:25","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","source_country":"US","sentiment":-0.227},{"id":311812556,"title":"Arson suspect targeted Josh Shapiro over governor’s views on Israel-Hamas war: Warrant","text":"Cpl. Benjamin Forsythe of the Pennsylvania State Police wrote in the affidavit that Balmer targeted Shapiro “based upon perceived injustices to the people of Palestine,” the outlet reported.\n\nFOR JOSH SHAPIRO, THE ARSON ATTACK WAS PERSONAL \n\nThe Washington Examiner reached out to the Pennsylvania State Police.\n\nBalmer is alleged to have smashed the windows of the governor’s mansion and hurled Molotov cocktails inside. The blaze destroyed much of the interior, though police evacuated Shapiro and his family before anyone was hurt.\n\n“Balmer admitted to harboring hatred towards Governor Shapiro,” another police affidavit said.\n\nShapiro’s stance on Israel has made him the subject of controversy over the past year, particularly after he was eyed as a possible running mate for former Vice President Kamala Harris. In an opinion article written as a college student, the governor said he volunteered for the Israel Defense Forces and that Palestinians were “too battle-minded” to coexist with Israel. He backtracked on the comments in a press conference last year, saying his opinions on the topic had evolved since he was 20.\n\n“I have said for years, years before Oct. 7, that I favor a two-state solution — Israelis and Palestinians living peacefully side by side, being able to determine their own futures and their own destiny,” he told reporters.\n\nAfter the arson attack, Shapiro released a statement referencing his Jewish faith.\n\n“When we were in the state dining room last night, we told the story of Passover and the exodus of the Jews from slavery in Egypt to freedom,” Shapiro said. “I refuse to be trapped by the bondage that someone attempts to put on me by attacking us as they did here last night. I refuse to let anyone who had evil intentions like that stop me from doing the work that I love.”\n\nHe also hosted a second Passover Seder following the attack. \n\nTRUMP CALLS ARSON SUSPECT IN SHAPIRO HOME FIRE A ‘WHACK JOB’\n\nThe attack against Shapiro drew condemnations across the political spectrum. President Donald Trump called the attacker a “whack job.”\n\n“But the attacker was not a fan of Trump. I understand just from what I read and from what I’ve been told,” Trump told reporters Monday in the Oval Office. “The attacker basically wasn’t a fan of anybody. It’s probably just a whack job. And certainly, a thing like that cannot be allowed to happen.”","summary":"Cody Balmer, the suspect charged with setting fire to the Pennsylvania governor&#8217;s mansion, was allegedly motivated by anger at Gov. Josh Shapiro&#8216;s (D-PA) position on the Israel-Hamas war in Gaza. Balmer, 38, allegedly had plans to beat the governor with a sledgehammer if he found him. He called 911 shortly after the arson attack, telling [&#8230;]","url":"https://www.washingtonexaminer.com/news/crime/3381815/cody-balmer-suspect-shapiro-arson-attack-israel-gaza-conflict/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/Shapiro-arson.webp","video":null,"publish_date":"2025-04-16 15:10:37","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.312},{"id":311861422,"title":"Poll: Americans Reject Taxpayer-Funded Trans Sex Change Drugs, Surgeries","text":"Americans are overwhelmingly opposed to their federal tax dollars funding transgender sex change drugs and surgeries, a new poll shows.\n\nA Cygnal poll from the American Principles Project and first obtained by the The Daily Wire found that 66 percent of Americans say federal tax dollars should not go toward sex change measures like surgeries, puberty blockers, and cross-sex hormones.\n\nThe survey additionally found that the issue is a losing one for Democrats. The poll revealed that 52 percent of American voters would vote for a Republican over a Democrat candidate if they found out that Democrat candidate supports taxpayer funded sex changes.\n\n“Democrats initially held a one-point lead in the poll on a 2026 congressional midterm ballot, but when the poll-takers were informed the Democrat supports using tax dollars to pay for ‘gender transition’ procedures, the electorate moved a net 14 points toward the Republican candidate,” according to the poll report.\n\nA strong number of Democrats (42 percent) and Kamala Harris voters (43 percent) agree that tax dollars should not go toward sex changes, as do 66 percent of swing voters, the survey found.\n\nWhile women tend to lean Democrat, 6o percent say they do not want taxpayer funded sex changes. That sentiment is shared by majorities of black and Hispanic Americans, parents, unmarried Americans, and urban and suburban voters.\n\n“This poll is proof of what we’ve known for a long time — the majority of Americans do not want their tax dollars being spent on gender transitions,” APP President Terry Schilling told the outlet in a statement.\n\n“I am glad that President Trump has already begun to take action on this popular, commonsense policy, but now it’s time for Congress to make the ban on federal funding for gender transitions permanent,” Schilling added.","summary":"Americans are overwhelmingly opposed to their federal tax dollars funding transgender sex change drugs and surgeries, a new poll shows. \n\n\nThe post Poll: Americans Reject Taxpayer-Funded Trans Sex Change Drugs, Surgeries appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/04/16/poll-americans-reject-taxpayer-funded-trans-sex-change-drugs-surgeries/","image":"https://media.breitbart.com/media/2025/04/AP25090840556447-640x335.jpg","video":null,"publish_date":"2025-04-16 15:06:00","author":"Katherine Hamilton","authors":["Katherine Hamilton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.57},{"id":311812568,"title":"Former Trump voter pushing to unseat Tuberville appeals to Alabama: ‘It’s OK to be a Democrat’","text":"Sweetser, who came into the public spotlight as a former Trump voter speaking at the 2024 Democratic National Convention, is starting his campaign by telling Alabama voters it’s OK to vote blue.\n\n“We talk to people here, and some of them are afraid to vote Democrat, because they’re afraid they’ll be put on a list,” Sweetser told the Washington Examiner in a phone interview.\n\nThe Alabama Democrat said political rhetoric has made people afraid to vote blue, but he hopes to change that. Despite the state’s red leanings, it elected former Democratic Sen. Doug Jones in a 2017 special election. Jones benefited from running against the controversial Alabama Supreme Court Justice Roy Moore, who was accused of several instances of sexual misconduct and didn’t have Trump’s support until late in the cycle. He also benefited from Democrats’ long history of over-performing in off-year elections.\n\nJones was later defeated by Tuberville in the 2020 election, losing by about 20 points. Sen. Katie Britt (R-AL) won her 2022 midterm election by a 35-point margin.\n\n“We got to get more people leading by example, to stand up and start speaking out and say, ‘Hey, I’m a Democrat, it’s OK to be a Democrat.’ This is what I stand for,” Sweetser said.\n\nSweetser, who announced his bid in a campaign video on Tuesday, took his opening salvos at Tuberville, accusing him of living in Florida.\n\n“You can’t expect somebody who lives in another state to care about our state like someone that lives in our state and cares about our state and wants their kids to stay in our state,” Sweetser said.\n\nI'm Kyle Sweetser, and I'm running for the U.S. SenateIt's time to send Tommy Tuberville back to Florida and send someone to Washington who will actually fight for Alabama. pic.twitter.com/OKXn2N02fB— Kyle Sweetser (@kyleforalabama) April 15, 2025\n\nTuberville has owned a 4,000 square-foot home in Santa Rosa Beach, Florida, for 20 years, which is longer than his wife has owned their 1,500 square-foot home in Auburn, Alabama, purchased in 2017.\n\nSweetser is also targeting Tuberville over his 2023 block of hundreds of military promotions and claims the incumbent senator is “not standing up for our state.”\n\nSweetser said Trump’s sweeping tariffs pushed him to run for Senate in 2026 and that he’s anticipating a decline in Alabama’s economy as a result. Mobile, where Sweetser is from, is a major shipping port for the state and has an economic impact of about $100 billion per year, he said.\n\nHe claimed that Airbus, Mercedes-Benz, Hyundai, and Toyota all manufacture in the state and “are under attack by the Republican Party.”\n\nHe cited the Jan. 6 Capitol riot as a reason why he no longer supported Trump, saying that the “Republican Party is no longer the party of law and order.”\n\nDespite his opposition to Trump and leaving the Republican Party after the 2020 election, Sweetser backed Nikki Haley during the Republican presidential primary.\n\n“It’s time to right the ship. Vote for Nikki Haley on Super Tuesday,” he said in a February 2024 post.\n\nSweetser explained, “Haley was a way to stop Trump,” and said that he crossed over to vote for her in the Republican primary. \n\nHe said he was a “Haley Voter, and a Republican” in a July 2024 video on his X account and that Trump’s decision to choose Vice President JD Vance “really, really solidifies my decision to vote against Trump.” Sweetser backed former President Joe Biden before switching to Harris.\n\nI’m a Haley Voter, and a Republican…and I’m supporting Kamala Harris for President. @HaleyVte4Harris https://t.co/zpf0XnLEJz pic.twitter.com/q3gDeQxXyX— Kyle Sweetser (@kyleforalabama) July 25, 2024\n\nThe Alabama Democrat did not mention any policy specifics but is running on an economic platform as a small business owner and said he will “defend people’s rights.” He said in his August 2024 DNC speech that he’s “not left-wing, period.”\n\nSweetser said he wants to change Alabama’s status as a “one-party state” belonging to Republicans.\n\nSweetser has no prior political history and has never been elected to public office. The Cook Political Report lists Alabama as a “Solid Red” state for the 2026 Senate election.\n\nThe Washington Examiner contacted Tuberville for comment but did not receive a response.","summary":"Kyle Sweetser is a Democrat in deep red Alabama, after voting for President Donald Trump in 2016 and 2020 before switching to former Vice President Kamala Harris in the 2024 election. The Trump-voter-turned-critic said he was pushed by the president&#8217;s tariffs to launch his bid to unseat Sen. Tommy Tuberville (R-AL) in 2026. It&#8217;s a [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3381451/former-trump-voter-kyle-sweetser-tuberville-alabama/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/04/KS-Real-Headshot-1024x908.webp","video":null,"publish_date":"2025-04-16 15:04:48","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","category":"politics","source_country":"US","sentiment":-0.348},{"id":311826608,"title":"US Vice President Vance’s India visit an opportunity to review progress in bilateral relations: MEA (Lead)","text":"New Delhi/Washington, April 16 (SocialNews.XYZ) US Vice President J.D. Vance's India visit from April 21 to 24 will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of the outcomes of the India-US Joint Statement issued in February during Prime Minister Narendra Modi's visit to Washington, the Ministry of External Affairs (MEA) said on Wednesday.\n\nVance will pay an official visit to India from April 21 to 24 and will be accompanied by Second Lady Usha Vance, their children, and senior members of the US Administration.\n\nThis will be Vice President Vance's first visit to India. During the visit, he will be meeting with Prime Minister Modi on April 21. The US Vice President and his delegation will have other engagements in Delhi and are also scheduled to visit Jaipur and Agra before departing for Washington on April 24.\n\n\"The visit will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of the outcomes of the India-US Joint Statement issued on 13 February 2025 during the visit of the Prime Minister to the US. The two sides will also exchange views on regional and global developments of mutual interest,\" read a statement issued by the MEA late Wednesday evening.\n\nEarlier in the day, the White House also announced the US Vice President's forthcoming visit to Italy and India.\n\nIndia is second on the Vances' two-nation tour with Italy being their first stop.\n\nThis would be the first visit to India by an American Vice-President in 13 years. The last was Joe Biden, who travelled to India in 2013 as Vice-President to President Barack Obama.\n\n\"In India, the Vice President will visit New Delhi, Jaipur, and Agra,\" Vance's office said in a statement. \"The Vice President will hold meetings with Prime Minister Narendra Modi. The Vice President and Second Family will also participate in engagements at cultural sites,\" it added.\n\nThere was no mention of Mike Waltz, the National Security Advisor, in the White House statement and it was not immediately clear if and when he is scheduled to travel to India. His visit, when it happens, will be the third by a senior member of the Trump administration to India, following Tulsi Gabbard, the Director of National Intelligence, and Vice-President Vance.\n\nThe Vice-President first met PM Modi in Paris on the sidelines of the AI summit in February. The Second Lady and the second couple's two sons also met the Prime Minister.\n\nVance has emerged as an important member of the Trump cabinet, and an advocate of President Donald Trump's agenda. The President often calls him for remarks during publicly-aired meetings with visiting foreign dignitaries. His most significant Oval Office intervention so far came in the meeting with Ukraine's Volodymyr Zelensky.\n\nUsha Vance's parents came to the US from Andhra Pradesh and she was born in San Diego. Her birth name is Usha Bala Chilukuri.\n\nVance's predecessor in the White House, Vice-President Kamala Harris, never visited India during her tenure although she is also of Indian-descent like Usha Vance — her mother's family was based in Tamil Nadu. Mike Pence, who was Vice-President in President Trump's first term also could not make it although he had expressed a desire to undertake a tour of India.\n\nSource: IANS","summary":"New Delhi/Washington, April 16 (SocialNews.XYZ) US Vice President J.D. Vance's India visit from April 21 to 24 will provide an opportunity for both sides to review the progress in bilateral relations and the implementation of...\n\n\nThe post US Vice President Vance&#8217;s India visit an opportunity to review progress in bilateral relations: MEA (Lead) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/04/16/us-vice-president-vances-india-visit-an-opportunity-to-review-progress-in-bilateral-relations-mea-lead/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/04/16/202504163379519.jpg?fit=1600%2C1432&quality=80&zoom=1&ssl=1?v=1744819845","video":null,"publish_date":"2025-04-16 14:57:09","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":0.136},{"id":311896958,"title":"How the Establishment Is Helping Trump’s Revenge-a-thon","text":"The below article first appeared in David Corn’s newsletter, Our Land. The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a month—but you can sign up for a free 30-day trial.\n\nLet’s go back to June 2, 2024. That morning, Fox & Friends Weekend aired an interview with Donald Trump conducted by the show’s hosts—Pete Hegseth, Rachel Campos-Duffy, and Will Cain. Three days earlier, Trump was found guilty in his porn-star/hush-money case. (Remember, he’s a convicted felon!) And Campos-Duffy brought up a subject that’s long been of great interest to Trump: revenge. As I’ve written many times, Trump’s three most powerful psychological motivations are revenge, revenge, and revenge. (Last month in this newsletter, I traced some of his history as a “revenge junkie.”) In the aftermath of the verdict that found Trump guilty of 34 counts of falsifying business records to hide his $130,000 payment to Stormy Daniels, Campos-Duffy gently prodded him: “You [previously] said, ‘My revenge will be success for America.’ You just had this verdict. Do you still feel the same?”\n\n“It’s a really tough question in one way because these are bad people,” Trump replied, referring to his critics and those who had brought criminal cases against him. “These people are sick.” He rambled about how tough he was and bragged about how during his first term he had fired FBI Director Jim Comey. He then returned to the issue of retribution: “Look it’s a very interesting question. I say it, and it sounds beautiful: ‘My revenge will be success.’ I mean that. But it’s awfully hard when you see what they’ve done. These people are so evil.”\n\nA far-too-sympathetic Cain tried to push Trump toward a clearer answer. “I hear you struggling with it. I hear you say it’s a tough question—a bit unsure. You famously said, regarding Hillary Clinton, ‘Lock her up.’ You declined to do that as president.”\n\nTrump responded: “I beat her. It’s easier when you win. They all said lock her up and I could’ve done it. But I thought that would have been a terrible thing. And then this [verdict] happened to me. So, I may feel differently about it. I can’t tell you. I’m not sure I can answer the question.”\n\nHere was a more interesting and revealing exchange than most of Trump’s softball sessions with Fox sycophants. He was still tethered to his lifelong obsession with revenge—if they screw you, screw ’em back 10 times worse, he often said when asked to describe his key to business success—but he knew it was unwise to vow vengeance during his comeback campaign. Yet he could not promise to abandon revenge altogether, as if he realized it was impossible for him to pass up an opportunity for retribution. In a rare (for him) moment, he said he could not provide a firm answer. He seemed to be saying, It would be great to promise I won’t be fixated on vengeance if I’m elected president, but I know me—and that ain’t me.\n\nIt sure isn’t. Trump cannot escape his compulsions, and perhaps his most powerful one is to get even. It was always obvious that score-settling would be job No. 1, should he return to the White House. An insecure man who’s always had a chip on his shoulder the size of a mountain, he’s defined his life by his relentless accounting and pursuit of grudges. The only surprise has been that his revenge-a-thon has been so extensive, so vicious, and that it has been so successful and generated such little pushback.\n\nTrump has abused the power of the presidency to go after his enemies in ways Richard Nixon could never have imagined. He has pulled security details and/or security clearances from his political opponents and critics, such as John Bolton, Mike Pompeo, Joe Biden, Kamala Harris, and others. He has extorted law firms that employed lawyers who previously challenged him politically or legally, and in mob-boss fashion he has forced them to pledge hundreds of millions of dollars in free legal services to his favorite causes (other than himself).\n\nThis past week, Trump signed executive orders targeting two officials who served in his first administration: Chris Krebs, who was then the nation’s cybersecurity chief, and Miles Taylor, a Department of Homeland Security official who anonymously wrote an op-ed and then a book criticizing Trump. The president called Taylor a traitor and instructed the Justice Department to investigate him. Krebs’ sin was having declared the 2020 election, which Trump lost, free of fraud. Trump went so far as to revoke security clearances for employees of SentinelOne, a cybersecurity firm where Krebs now works. Trump has also trained his ire on universities (including Columbia University, Brown University, Harvard University, Princeton University, and the University of Pennsylvania, his alma mater), cultural institutions (the Kennedy Center and the Smithsonian Institution), and assorted news organizations.\n\nIn any previous era, this orgy of vengeance would be the top political story. Yet with the flood of Trump-spurred outrages underway since January 20, it does not dominate the headlines. Moreover, the surrender of many of his targets undermines criticism of Trump’s revenge frenzy. Trump has used the capitulation of these law firms as proof that he is right to assail them as hotbeds of evil scheming that threatens the nation. On Wednesday, he claimed that the settlements signed by these firms—some previously associated with Democratic causes—was proof the 2020 election was stolen from him: “The election was rigged. It’s been proven…When you look at all these lawyers and law firms that are signing, giving us hundreds of millions of dollars. It was proven by so many different ways…It was a very corrupt election.”\n\nOf course, Trump was lying about that. But embedded in that lie was an important point. By yielding and offering Trump hundreds of millions of dollars in pro bono work, these firms were indeed bolstering the notion they had done something wrong—whatever that may have been—when they had not. Each white flag waved in the face of a Trump attack strengthens him and his authoritarian bullying.\n\nWhen Trump first targeted Paul, Weiss, that law firm explored joining with other firms to mount a united front against Trump’s assault. But it quickly folded, and that effort evaporated. Reuters reported on Thursday that the cybersecurity industry was declining to rally behind SentinelOne and Krebs. Columbia University complied with Trump strong-arming last month by agreeing to a list of onerous demands from Trump to regain the $400 million in federal funding he suspended. Was that sufficient? Absolutely not. In response, the Trump White House did not resume the funding and raised the prospect of slapping a consent decree on Columbia that would place the school even more so under the thumb of the administration. Feed the leopard, and the leopard wants more. (Brown, Princeton, and Harvard have told Trump to get lost.)\n\nABC News settled with Trump ($15 million); Meta settled with Trump ($25 million). CBS has been considering settling a case that Trump filed against its news division. It’s all encouragement for worse and more dangerous conduct. On Sunday night, after 60 Minutes aired two stories about Trump, he called on Brendan Carr, his loyalist running the Federal Communications Commission, to revoke CBS’ broadcast license. (In his first days as FCC chief, Carr ordered investigations of NPR and PBS.)\n\nWhat the last few weeks have taught Trump is not only that revenge is sweet; it’s also so easy! Why cease? Many of his foes fold, and there’s been no political cost for his perversions of power. Republicans and conservatives once were eager to decry excessive presidential flexing. They screamed about Presidents Barack Obama and Joe Biden issuing too many executive orders and governing through these directives. Remember the outrage when Biden tried to wipe out some student debt through an executive order? Now these fretters about presidential abuses are silent. As are those Republicans and right-wingers who in the past railed about the so-called “weaponization” of government, such as, notably, Rep. Jim Jordan (R-Ohio). Trump is literally exploiting his position to demean and destroy his detractors and his perceived enemies, even ordering the Justice Department to investigate a critic. Yet…crickets.\n\nI know: You are stunned by the hypocrisy.\n\nI don’t expect these careerist MAGA cultists to make a peep. But I confess I am disappointed in the Establishment: those law firms, universities, media organizations, and corporate leaders who are either bending the knee or not protesting Trump’s arguably illegal blackmail operation. With their silence, they are all complicit in Trump’s war on America and enabling his march toward autocracy. “This is the Vichy moment. It’s a classic collaborationist dilemma,” says Michael Roth, the president of Wesleyan University, which has not yet been assaulted by Trump. “You can have preserved your school, but you live in a sea of authoritarianism.”\n\nTrump’s latest attack on a law firm (as of this writing) demonstrated how absurd and dangerous is the mad king. His target was Susman Godfrey, and the executive order he signed denounced the firm for alleged efforts to “weaponize the American legal system and degrade the quality of American elections.” Like similar directives, it did not specify the firm’s supposed misdeeds. But we know why Trump is after it. Susman Godfrey successfully represented Dominion Voting Systems against Fox News in the defamation case that accused the right-wing network of knowingly spreading Trump’s lies about the 2020 election and won the company a $787 million settlement from Fox. It also has represented Dominion in lawsuits against Rudy Giuliani, former Trump campaign lawyer Sidney Powell, and others who peddled pro-Trump conspiracy theories about the 2020 election. And it has handled Dominion’s similar lawsuit against Newsmax.\n\nHere’s another way for Trump to keep fighting for his Big Lie—and to punish those who have helped expose it as utter bullcrap. (The executive order also excoriates Susman Godfrey for offering financial awards and employment opportunities to “students of color.”) As with the other firms on his hit list, Trump ordered the suspension of security clearances held by its attorneys, limited government interactions with the firm, and barred its lawyers’ access to federal buildings.\n\nSusman, to its credit, is fighting back, as are Perkins Coie, WilmerHale, and Jenner & Block. These other law firms, each a target of a similar executive order, have sued Trump and won preliminary rulings that found Trumps’ directives violated the Constitution. In the lawsuit Susman filed against the Trump administration on Friday, it summarized the emergency at hand:\n\nIn America we have, in the words of John Adams, a government of laws and not men. President Trump’s campaign of Executive Orders against law firms and others, including the Executive Order he signed on April 9, 2025 against Susman Godfrey, is a grave threat to this foundational premise of our Republic. The President is abusing the powers of his office to wield the might of the Executive Branch in retaliation against organizations and people that he dislikes. Nothing in our Constitution or laws grants a President such power; to the contrary, the specific provisions and overall design of our Constitution were adopted in large measure to ensure that presidents cannot exercise arbitrary, absolute power in the way that the President seeks to do in these Executive Orders.”\n\nThe firm added: “If President Trump’s Executive Orders are allowed to stand, future presidents will face no constraint when they seek to retaliate against a different set of perceived foes. What for two centuries has been beyond the pale will become the new normal. Put simply, this could be any of us.”\n\nMore than 500 law firms and hundreds of law professors and former judges have filed amicus briefs to support the law firms Trump has attacked. Still, many leaders in the legal world and elsewhere have stayed mum, cowed by Trump. It ought to be a point of widespread consensus: A president should not use the authority of the federal government to pursue his personal vendettas. In fact, Trump’s flagrant abuse of power might constitute an impeachable offense.\n\nSo far, Trump has (mostly) gotten away with it. Even if he loses in court, he has blackballed law firms, and potential clients with interests before the federal government have been sent a signal: Don’t hire these guys. The acquiescence and silence, no doubt, emboldens Trump. Who know who he’ll come after next? Corporations, nonprofits, Hollywood studios, think tanks? With many in the powers-that-be class yielding to Trump’s revenge-palooza or declining to protest it, there’s likely no end in sight. After all, a junkie is always looking for the next fix.","summary":"The below article&#160;first appeared&#160;in David Corn’s newsletter,&#160;Our Land.&#160;The newsletter&#160;comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture. Subscribing costs just $5 a month—but you can&#160;sign up for a free 30-day trial. Let’s go back to June 2, 2024. That morning,&#160;Fox &#38; Friends Weekend&#160;aired an&#160;interview&#160;with [&#8230;]","url":"https://www.motherjones.com/politics/2025/04/trump-revenge-establishment-law-firms-universities-republicans/","image":"https://www.motherjones.com/wp-content/uploads/2025/04/20250416_trump-revenge_2000.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-04-16 14:34:51","author":"David Corn","authors":["David Corn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.24},{"id":311785926,"title":"The end of the op-ed: LA Times uses AI to counteract its own views","text":"Want to read a contrasting view on the insightful opinion piece you just found? Traditionally, you would have had to find another publication with a different political slant and search for an op-ed on the same topic. Those days might be numbered as a new feature on the Los Angeles Times website offers an immediate rebuttal to their journalists’ work through an AI assistant. Is this the future of opinion journalism, or have we entered into a parallel universe where even rhetoric is fully supplanted by the machines?In the LA Times opinion section is an article by Joan C. Williams, a law professor at University of California College of the Law in San Francisco. In the piece, Williams argues that Democrats need to understand the cultural angle of politics if they are ever to understand Donald Trump’s 2024 presidential election victory. “Democrats need to rival Trump’s cultural competence at connecting with the working class, which will require changes from progressives,” she writes, as she explains that the left is failing to see the human side of the right’s arguments to a broad span of American voters. It’s an insightful and well researched piece that speaks from Williams’ academic perspective. Exactly the sort you’d expect from an opinion section. What’s new is a little button labelled “Insights”. Click that and you’re whisked to the bottom of the page where the LA Times gives you an “AI-generated analysis on Voices content to offer all points of view”. In the Insights, you are told that Williams’ piece “generally aligns with a centre left point of view” as well as a summary of her points. Most intriguingly, there’s a section that gives you opposing views. There it points out that while Williams thinks Democrats should focusing on uniting cultural theories, strategists like James Carville “urge Democrats to avoid cultural distractions and concentrate exclusively on economic messaging while others reject the premise that cultural issues are irreconcilable, pointing to Biden-era successes in manufacturing and wage growth”. On that last point, the AI argues that “conceding on issues like climate action or LGBTQ+ rights risks demoralizing the Democratic base and ceding ground to far-right narratives”. This sounds like an interesting point but it’s directly contrasted by Williams’ own writing where she notes that on inclusive messaging, Democrats “didn’t abandon their vision of full LGBTQ+ rights, but they did shift tactics to engage a wider range of people.” Whether the AI has fully grasped Williams’ argument or not is up for debate, but most significant is the shift away from giving opinion writers a sense of authority on their topic. For many, this is part of a move to placate Trump’s administration by LA Times owner Patrick Soon-Shiong. Soon-Shiong bought the paper in 2018 and last year decided it would not officially endorse Kamala Harris for president. “If you just have the one side, it's just going to be an echo chamber,” the medical investor said. Going through the paper’s opinion pieces today, the AI provides more opposing views. LA Times opinion columnist Jackie Calmes has a piece on the parallels between Hannah Arendt’s view on Nazi Germany and the current Trump administration. AI Insights suggests Calmes’ piece is “centre left” and notes that “Trump’s actions, while norm-breaking, lack the systemic violence and ideological coherence of Hitler’s regime”.Similarly, LA Times journalist LZ Granderson has a “centre left” piece that criticised the Trump administration’s removal of LGBTQ+ iconography and education from government bodies as a worrying shift towards un-American ideals of inclusion and openness. Contrasting this view, the AI suggests: “Conservative advocates, including groups behind Project 2025, contend that LGBTQ+ visibility policies promote “toxic normalization” and conflict with traditional family values.” While the opinion writers of the LA Times are still largely left leaning, the new AI feature is designed to platform both sides of an argument. Exactly as Soon-Shiong wanted. Back when the owner blocked the Harris endorsement, three of the six people who researched and wrote their editorials, including editorials editor Mariel Garza, resigned in protest. The other three have since left, with the last holdout, Carla Hall, exiting after writing a last column that ran on 30 March about homeless people she met while covering the issue. Soon-Shiong’s decision was mirrored by Washington Post owner Jeff Bezos, who decided the newspaper would not back a presidential candidate.Last month, Ruth Marcus, who worked for the Washington Post since 1984, stood down after a row over the paper refusing to run an opinion piece that was critical of Bezos.She was the latest to leave the Post after Bezos announced that the paper’s opinion columns would no longer be a free-for-all for individual author’s thoughts. Instead, it would focus on two specific themes: “personal liberties and free markets”.Between Soon-Shiong and Bezos, there is a clear move from the billionaire-owned US media landscape to cosy up to the Trump administration. It continues a pattern seen by the major tech and social media owners, including the Bezos-founded Amazon. Concerningly, it also highlights AI-obsessed owners' cynical attitude towards the work of journalists. “I think it could be offensive both to readers ... and the writers themselves who object to being categorized in simple and not necessarily helpful terms,” Garza, the ex-editorials editor said. “The idea of having a bias meter just in and of itself is kind of an insult to intelligence and I've always thought that the readers of the opinion page were really smart.\"","summary":"As the LA Times unveils its AI Insights function on their opinion pieces, we look at how the feature undermines opinion journalism.","url":"https://www.euronews.com/culture/2025/04/16/the-end-of-the-op-ed-la-times-uses-ai-to-counteract-its-own-views","image":"https://static.euronews.com/articles/stories/09/20/69/94/1440x810_cmsv2_26fa364f-892b-5436-a402-f133d8c4450b-9206994.jpg","video":null,"publish_date":"2025-04-16 14:33:11","author":"Jonny Walfisz","authors":["Jonny Walfisz"],"language":"en","source_country":"fr","sentiment":0.016},{"id":311789572,"title":"Republican Candidate Proposes Forcing Migrant Women to Marry American Men","text":"A Republican candidate for governor of California has proposed forcing immigrant women living in the country illegally to marry American \"incels\" to avoid deportation.During an appearance on The Lilly Show with host Lilly Gaddis, Kyle Langford made the proposal in a clip that has since gone viral.\"We know where you are. If you marry one of our Californian incels, then you can stay. But if you don't, then, well, they're getting sent back across,\" he said.\"It is an initiative that will encourage family formation in the State of California; fostering healthy, stable young families is my #1 priority,\" Langford told Newsweek in an emailed statement.Why It MattersImmigration was seen as a winning issue for President Donald Trump during the campaign and candidates at the state level politics have picked up the mantle.Trump has pledged to conduct the largest deportation operation in American history as his administration looks to remove millions of immigrants lacking permanent legal status. The White House has said anyone living in the country unlawfully is considered a \"criminal\" by the federal government. Since the beginning of Trump's second term, thousands of migrants have been arrested.What To KnowThe podcast clip, which was released on April 8, has gone viral on X, formerly Twitter, and has amassed 1.6 million views as of Wednesday, April 16.Langford said he backs deporting all male immigrants without legal status in the state of California. The GOP candidate for governor added he wants to give women one year to get married or face deportation.Langford was born in San Jose, California, and graduated from Lake Oswego High School. His professional background includes serving as a construction manager and as the executive director of the California First PAC.Kyle Langford is among several Republicans vying for the governorship, including Riverside County Sheriff Chad Bianco, business consultant Sharifah Hardie, marketing agency founder Brandon Jones and Zacky Farms Vice President Leo Zacky.​Across the aisle, Democrats are waiting to see if former Vice President Kamala Harris will join the fray.A poll conducted by Emerson College Polling, Inside California Politics, and The Hill between February 10-11, surveying 1,000 registered voters, found that nearly 57 percent of Democratic primary voters in California would vote for Harris as governor.During a pre-Oscars party in Los Angeles, Harris said that she plans to decide on whether to run in the 2026 California gubernatorial election by the end of the summer, according to a Politico report citing two anonymous sources familiar with the conversation.Harris, who remains the favorite in the California gubernatorial election if she decides to run, is reportedly still \"mulling\" another bid for the presidency.If elected as California governor it would \"almost certainly\" eliminate the possibility of seeking the Democratic nomination in 2028.Incumbent Governor Gavin Newsom, who is expected to launch his own 2028 presidential bid, cannot run for reelection due to state term limits.What People Are SayingLangford said: \"I am pro-deportation. I was thinking to first off deport all the men and then for the women, like maybe you'll have a one-year time to like marry.\"Enough people have told me that I should consider that...I'm just saying I would give them a one-year timeline. We know who you are, we know where you are. If you marry one of our Californian incels, then you can stay. But if you don't, then, well, they're getting sent back across.\"Matt Loesby, chair of the Libertarian Party of Idaho, wrote on X: \"If you actually knew anything about the right wing, you would know that this is quite the moderate position.What Happens NextThe California gubernatorial election will take place on November 3, 2026.","summary":"GOP candidate for California governor Kyle Langford said he wants to give female illegal immigrants one year to get married.","url":"https://www.newsweek.com/republican-kyle-langford-proposes-forcing-migrant-woman-marry-2060334","image":"https://d.newsweek.com/en/full/2628086/gop-sign.jpg","video":null,"publish_date":"2025-04-16 14:15:20","author":"Billal Rahman","authors":["Billal Rahman"],"language":"en","category":"politics","source_country":"US","sentiment":0.13}]}