{"offset":0,"number":50,"available":324,"news":[{"id":336008174,"title":"Biden pays respects as former Minnesota House Speaker Hortman, killed in shooting, lies in state","text":"ST. PAUL, Minn. -- Former President Joe Biden joined thousands of mourners Friday as former Minnesota House Speaker Melissa Hortman lay in state in the Minnesota Capitol rotunda while the man charged with killing her and her husband, and wounding a state senator and his wife, made a brief court appearance in a suicide prevention suit.\n\nHortman, a Democrat, is the first woman and one of fewer than 20 Minnesotans accorded the honor. She lay in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized. It was the first time a couple has lain in state at the Capitol, and the first time for a dog.\n\nThe scene at the Capitol\n\nThe Hortmans' caskets and the dog's urn were arranged in the center of the rotunda, under the Capitol dome, with law enforcement officers keeping watch on either side as thousands of people who lined up filed by. Many fought back tears as they left.\n\nAmong the first to pay their respects were Gov. Tim Walz, who has called Hortman his closest political ally, and his wife, Gwen. Biden, a Catholic, visited later in the afternoon, walking up to the velvet rope in front of the caskets, making the sign of the cross, and spending a few moments by himself in silence. He then took a knee briefly, got up, made the sign of the cross again, and walked off to greet people waiting in the wings of the rotunda.\n\nThe Capitol was open for the public from noon to 5 p.m. Friday, but officials said anyone waiting in line at 5 would be let in. House TV livestreamed the viewing. A private funeral is set for 10:30 a.m. Saturday and will be livestreamed on the Department of Public Safety's YouTube channel.\n\nSEE ALSO: 'Completely blindsided': Wife of Minnesota lawmaker shooting suspect Vance Boelter speaks out\n\nBiden will attend the funeral, a spokesperson said. So will former Vice President Kamala Harris, though neither is expected to speak. Harris expressed her condolences earlier this week to Hortman's adult children, and spoke with Walz, her running mate on the 2024 Democratic presidential ticket, who extended an invitation on behalf of the Hortman family, her office said.\n\nLisa Greene, who lives in Brooklyn Park like Hortman did, but in a different House district, said she came to the Capitol because she had so much respect for the former speaker.\n\n\"She was just amazing. Amazing woman. \"And I was just so proud that she represented the city that I lived in,\" Greene said in a voice choked with emotion. \"She was such a leader. She could bring people together. She was so accessible. I mean, she was friendly, you could talk to her.\" But, she went on to say admiringly, Hortman was also \"a boss. She just knew what she was doing and she could just make things happen.\"\n\nA hearing takes a twist\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife made a short court appearance Friday to face charges for what the chief federal prosecutor for Minnesota has called \"a political assassination.\" Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nAn unshaven Boelter was brought in wearing just a green padded suicide prevention suit and orange slippers. Federal defender Manny Atwal asked Magistrate Judge Douglas Micko to continue the hearing until Thursday. She said Boelter has been sleep deprived while on suicide watch in the Sherburne County Jail, and that it has been difficult to communicate with him as a result.\n\n\"Your honor, I haven't really slept in about 12 to 14 days,\" Boelter told the judge. And he denied being suicidal. \"I've never been suicidal and I am not suicidal now.\"\n\nAtwal told the court that Boelter had been in what's known as a \"Gumby suit,\" without undergarments, ever since his transfer to the jail after his first court appearance on June 16. She said the lights are on in his area 24 hours a day, doors slam frequently, the inmate in the next cell spreads feces on the walls, and the smell drifts to Boelter's cell.\n\nThe attorney said transferring him to segregation instead, and giving him a normal jail uniform, would let him get some sleep, restore some dignity, and let him communicate better. The judge agreed.\n\nProsecutors did not object to the delay and said they also had concerns about the jail conditions.\n\nThe acting U.S. attorney for Minnesota, Joseph Thompson, told reporters afterward that he did not think Boelter had attempted to kill himself.\n\nThe case continues\n\nBoelter did not enter a plea. Prosecutors need to secure a grand jury indictment first, before his arraignment, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans' home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers' homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. Thompson said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn't been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nOther victims and alleged targets\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.","summary":"Former President Joe Biden joined thousands of mourners Friday as former Minnesota House Speaker Melissa Hortman lay in state in the Minnesota Capitol rotunda.","url":"https://abc7.com/post/minnesota-lawmakers-shot-former-president-joe-biden-pays-respects-melissa-mark-hortman-dog-lying-state-boelter-court/16866209/","image":"https://cdn.abcotvs.com/dip/images/16866278_062725-wls-mn-lawmaker-hardtop-4pvo-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/wls/062725-wls-mn-lawmaker-hardtop-4pvo-vid.mp4","publish_date":"2025-06-28 00:28:09","author":"Steve Karnowski","authors":["Steve Karnowski"],"language":"en","category":"politics","source_country":"us","sentiment":0.077},{"id":336006900,"title":"Eye-popping analysis of Trump’s win shows Democrats are in serious trouble","text":"Democrats are right to be worried about the party’s shift to the left that Zohran Mamdani’s surprise victory in New York City’s mayoral primary implies. \n\nThat’s because the party was already on the outs with a majority of American voters, according to newly released data from the Pew Research Institute.\n\nPew conducts a biennial poll known as the Validated Voter Survey — considered one of the best ways to understand what happened in the prior election, because its survey results are cross-indexed with each state’s voter files. \n\nOnly respondents who are shown to have actually voted are counted.\n\nThe headline results getting most of the media attention largely support prior findings from the 2024 exit polls and from Catalist, another gold-standard post-election analysis.\n\nPew, like the other sources, finds Democrats hemorrhaged voter support among men, Hispanics and other non-white voters, costing Kamala Harris the presidency.\n\nThe party’s loss of support among men is especially sharp among non-white men, according to Pew.\n\nPresident Trump’s victory margin among white men improved by 3 percentage points, from 17% to 20%, between 2020 and 2024.\n\nThat is a strong improvement, but far from enough to explain why he went from losing by 4.5% in 2020 to winning by 1.5% in 2024.\n\nRather, it was Trump’s gains among non-white men that were truly game-changing.\n\nHe lost black men by only 54 points, a 21-point improvement from his 75-point defeat in 2020.\n\nHe carried Hispanic men by 2 points, a 20-point improvement from his 18-point 2020 loss.\n\nHe also gained 23 points among Asians and 29 points among voters of other races, gains that could not have occurred without huge increases with male voters.\n\nProgressives might point to Mamdani’s strong showing in Hispanic and Asian neighborhoods and argue that it shows his economic populism can win many of those voters back.\n\nBut it’s worth noting that this showing comes among Democratic primary voters, a group well to the left of most Americans.\n\nWe should recall that progressive Sen. Bernie Sanders easily won among Hispanics, according to exit polls in the 2020 Democratic Super Tuesday primaries.\n\nThat didn’t prevent Hispanics overall from shifting significantly to the right in that November’s general election.\n\nBut even these stark figures understate the Democrats’ challenge. \n\nThe Pew results show that there was little change in voting by partisans between 2020 and 2024.\n\nHarris beat Trump by 89 points among Democrats and Democratic-leaning independents, just one point less than Biden’s 90-point win in 2020.\n\nTrump won Republicans and GOP-leaning indies by 86 points, a point less than his 87-point advantage four years ago.\n\nThese groups comprised 99% of the electorate in 2024 and 97% in 2020. \n\nThus, Harris should have easily won — if the electorate’s partisan composition mirrored 2020’s.\n\nIt did not, however.\n\nRepublicans and GOP-leaning independents were 51% of the total electorate in 2024, up from 47% in 2020. \n\nDemocrats and their affiliated indies dropped from 50% in 2020 to 48% in 2024.\n\nThat 6-point shift in the partisan balance precisely mirrors Trump’s 6-point improvement in his popular vote margin.\n\nIn other words, Trump didn’t win because he got disaffected Democrats and independents to vote for him; he won because he got those people to switch parties entirely.\n\nThat is an historic achievement. \n\nNo electorate in the 50-plus-year history of exit polling has ever favored the GOP.\n\nGoing back by extension to the 1930s, partisan identification polls always showed Democrats with significant margins going into a general election.\n\nIt’s likely, then, that 2024 was the first presidential election since at least 1932 where more voters were Republicans than Democrats.\n\nDemocrats simply do not know how to campaign in this type of environment.\n\nFor nearly 100 years, all they had to do to win was rally the base and split independents.\n\nHarris did that, and lost anyway — because that equation no longer produces an electoral majority.\n\nIn previous elections, Republicans adapted to their unfavorable terrain by running campaigns on Democratic turf. \n\nThey had to prove they were no threat to the welfare state or to the other popular Democratic achievements.\n\nThat infuriated hardline conservatives who want to roll back those big government expansions, but wiser heads knew it would be a fatal error.\n\nDemocrats now face the challenge of showing they support Republican themes, like race-neutral policies and prioritizing economic growth over the Green New Deal.\n\nHarris couldn’t pull it off, and Democrats like Mamdani will essentially charge right into that headwind by doubling down on policies that former Democratic voters reject.\n\nPresidential success or failure always matters, and perhaps Trump’s term will end up going badly. \n\nThat could save Democrats.\n\nWithout that, however, they should understand that the political environment is moving sharply away from what their base wants.\n\nViewed through that lens, the leftward lurch Mamdani’s win implies shouldn’t just scare Democrats: It should terrify them.\n\nHenry Olsen, a political analyst and commentator, is a senior fellow at the Ethics and Public Policy Center.","summary":"Democrats are right to be worried about the party’s shift to the left that Zohran Mamdani’s surprise victory in New York City’s mayoral primary implies.","url":"https://nypost.com/2025/06/27/opinion/eye-popping-analysis-of-trumps-win-shows-democrats-are-in-serious-trouble/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-ap4orzvti-1751065341263.jpg?quality=75&strip=all&1751050963&w=1200","video":null,"publish_date":"2025-06-27 23:49:40","author":"Henry Olsen","authors":["Henry Olsen"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.285},{"id":336006054,"title":"Here's How Much The Bezos-Sánchez Wedding Extravaganza Really Cost","text":"The lavish, celebrity-packed affair in Venice, replete with private water-taxis, three-Michelin-star catering and Murano glass gifts for guests, is over the top, but far from the most expensive billionaire wedding on record.\n\nLove is lavish-er the second time around. Amazon billionaire Jeff Bezos and Lauren Sánchez are celebrating their nuptials in a star-studded, and controversial, three-day celebration in Venice—and most of the focus has been on how much the affair cost.\n\nMore than six months ago, rumors started circulating that the Bezos-Sánchez wedding (the second time each has said, “I do.”) would be held in Aspen and cost $600 million.\n\n“Unless you are buying each of your guests a house, you can’t spend this much money,” hedge fund billionaire Bill Ackman joked on X in December. Bezos himself reposted the comment, stating “this whole thing is completely false—none of this is happening.”\n\nInstead, the happy couple opted for what is reportedly an “intimate” 200-person ceremony presumed to be much less expensive than the rumored Rocky Mountain hijinks. And that doesn’t include a pre-wedding foam party the 61-year-old groom and 55-year-old bride reportedly threw for one of her son’s last weekend aboard Bezos’ superyacht, Koru.\n\nBased on conversations with a dozen sources, including Venetian wedding industry insiders and multiple local vendors involved in or with knowledge of the event, Forbes estimates that the Bezos-Sánchez wedding will cost at least $20 million - but could be closer to $25 million or even more, depending on what surprises the hosts have in store for their guests. (A representative for Bezos has not yet replied to a request for comment.)\n\nThis week, a handful of media outlets cited Luca Zaia, president of the Veneto region (which includes Venice), saying that the wedding would cost upwards of 40 million euros, or $46 million. But that number looks like a wild guess. A member of Zaia’s press office says that Zaia was using “online sources” and does not have any insider information from the Amazon cofounder or his representatives. Another number that’s been cited is the wedding’s economic impact on the Queen of the Adriatic. According to Italy’s Ministry of Tourism, the wedding could generate an economic impact of more than $1 billion, equivalent to some two-thirds of the city’s annual tourism number. How that is calculated is unclear, but there is no doubt officials are hoping for a boost after a nearly 7% decline in overnight stays so far in 2025.\n\nThe $20-plus million Forbes estimates for the celebration, based on confirmed costs, is more than 600 times the cost of an average American wedding—which the wedding site The Knot puts at $33,000 or about $284 a guest—but won’t exactly make a dent in Bezos’ estimated $237 billion fortune.\n\nBezos and Sánchez’s multi-day affair kicked off with a welcome party held near the Madonna dell'Orto church on Thursday night; it was reportedly cut short due to a thunder storm. The actual ceremony was held at the 16th century San Giorgio Maggiore Basilica on one of Venice’s islands on Friday night, though the couple don’t appear to be getting legally married—they never applied for the necessary license from the city, suggesting they may have wed ahead of the very public celebration.\n\nMatteo Bocelli, son of Italian tenor Andrea Bocelli, reportedly performed at the ceremony, followed by a reception on the island. On Saturday, another party is planned at Arsenale, a massive complex of former armories and shipyards first built in the 12th century. The party was supposed to be held at the Scuola Grande Della Misericordia, in the center of Venice, but was moved on Tuesday for security concerns—a last-minute inconvenience that likely added significantly to the weekend’s costs.\n\nThe couple’s A-plus guest list—which ranged from billionaires Bill Gates and Oprah Winfrey to Leonardo DiCaprio and Tom Brady, as well as a vaporetto-load of the requisite Kardashians—have been spotted at five-star hotels across Venice in recent days, including at the Gritti Palace, the St. Regis and the Aman, where the bride and groom are staying. (The couple reportedly bought out the entire hotel for the three nights, which required relocating guests who had coincidentally booked the Aman to other luxury properties in the city at the Bezos’ expense.) The average cost of a room at the luxury hotels in June, based on the rack rate on several hotel sites, is about $2,000 per night. That adds up to some $900,000 for three nights, assuming around 150 rooms were booked. It’s not clear whether the couple are paying for guests’ rooms, but two wedding planners say it’s standard for ultra-luxe events like this.\n\nBillionaire Sam Altman, the CEO of Chat GPT maker OpenAI, is one of a handful of billionaire guests at the Bezos-Sanchez wedding. Others included Bill Gates, Oprah Winfrey and Kim Kardashian.\nMARCO BERTORELLO/AFP via Getty Images\n\nThe couple’s wedding planners also commissioned about 30 private water taxis to escort guests around the city, according to a source in Venice. Each taxi costs between $210 and $290 per hour, according to the Venice consortium of water taxis, the largest in the city. All told, assuming 12-hour days, the cost would be at least $270,000 spent on water transport alone.\n\nThe wedding was catered by three-Michelin-star chef Fabrizio Mellino of Quattro Passi, a restaurant in Nerano—near Naples–which Bezos has been known to frequent, according to Italian newspaper Corriere della Serra. The restaurant charges around $1,800 per person, including staff and food transport, to cater weddings of this level, according to former clients. That’s at least $360,000 in food-and-beverage costs for the one night—but it is likely a three-day contract, adding up closer to $1.1 million. Quattro Passi is reportedly closed for four days.\n\nThe floral arrangements were provided by Munaretto Flowers, according to a source within Venice’s luxury wedding planning industry, who estimates the cost to be hundreds of thousands of dollars. Munaretto did not reply to a request for comment.\n\nIn addition, the couple is giving each guest an arrangement of local goods and pastries, including hand-blown Murano glass from Laguna B–a Venice luxury staple, and fresh-baked treats from Rosa Salva, one of the oldest bakeries in the city. A simple Murano wine goblet starts at around $220, making the estimated cost per box hundreds of dollars.\n\nAntonio Rosa Salva, owner of the Rosa Salva bakery, was commissioned to produce “about 200” small assortments of the bakery’s products, which is known for its typical Venetian cookies, including buranelli and zaleti. Rosa Salva tells Forbes the level of secrecy surrounding the nuptials has been such that he himself didn’t know the order was intended for Bezos until two weeks ago, and that it was placed through a third-party agency. \"We make our product with love,” he says. “The real satisfaction comes from receiving recognition in that regard—from a financial standpoint as well, but it's much more important to be recognized for the quality.”\n\nThe ceremony was moved to the island of San Giorgio Maggiore in Venice, and held on Friday, June 27, for security reasons.\nSTEFANO RELLANDINI/AFP via Getty Images\n\nGiven the number of high-profile and ultra-wealthy guests, security has been paramount all week. “The security posture there must be massive,” says Kenneth Bombace, CEO of Global Threat Solutions, who has provided private security for multiple events that Bezos attended in the past. Bombace says that for an event of this caliber, he would have hired 40 to 50 agents, including members of the local police force, and would have begun preparations months in advance. Bombace estimates the total security cost for the event, including travel and preparations, at “a few million dollars.”\n\nA source with knowledge of the events confirmed that at least 30 members of the Italian police have surveyed the island of San Giorgio Maggiore with a canine unit and other security forces have swept the hotels.\n\nTo spread good will in Venice—which has not exactly returned the kindness to the couple, including dumping a dummy of the groom clinging to an Amazon delivery box in the canal—Bezos has donated nearly $3.6 million to three organizations in the city: $1.2 million (or 1 million Euro) to Corila, an agency that coordinates research for the care of the Venetian lagoon; $1.2 million to UNESCO’s Venice office, which promotes culture and the natural sciences; and an estimated $1.2 million to Venice International University.\n\n“They did a blood test and an X-ray on us,” joked Pierpaolo Campostrini, general director of Corila, who says he was pleasantly surprised to receive the donation. Bezos had been struck by the beauty of Venice’s lagoon during a previous visit and asked about its management, he tells Forbes. “We didn’t fill out an application or do anything of the kind.”\n\nCampostrini says he was first contacted by representatives for Bezos in April, before protests denouncing the lavishness of the event picked up, adding, “It wasn’t greenwashing.”\n\nA spokesperson for UNESCO Venice confirmed the group plans to use the funds to “support UNESCO’s activities in managing and preserving the cultural heritage of Venice and its lagoon.” A representative of Venice International University did not respond to a request for comment.\n\nDespite the media frenzy and lavish details, the weekend extravaganza is hardly the most expensive recent wedding among the billionaire set. In 2004, Indian steel tycoon Lakshmi Mittal, then the country’s second richest person, sprang for an opulent six-day wedding celebration in Paris for his daughter Vanisha. Mittal spared no expense on the nuptials, flying 1,000 guests by private jets to France, where festivities included fireworks at the Eiffel Tower, a performance by Kylie Minogue and an engagement ceremony at the Palace of Versailles. The estimated tab for the week was around $60 million.\n\nThat amount was modest compared to the 2024 marriage celebration of Anant Ambani, the son of India’s richest person, Mukesh Ambani. Believed to be the most expensive of all-time—costing between $400 million and $500 million—it included multiple events stretching over several months, including a Mediterranean cruise and performances by Rihanna and Justin Bieber. One event alone had more than 10,000 guests.\n\nNot all billionaires or their heirs want such spectacles when they walk down the aisle. Alex Soros, son of hedge fund billionaire George Soros, recently tied the knot with Huma Abedin, a longtime advisor to Hillary Clinton, at a private ceremony “at home” in their Water Mill, New York mansion. Still even a low-key billionaire wedding brings out a roster of A-list guests, this one including everyone from Clinton and Kamala Harris to Jennifer Lawrence and Mariska Hargitay. Plus there was a performance by Boyz 2 Men, a band well past their heyday and with a price tag that could have been as little as a few hundred thousand. Bezos and Sánchez are reportedly going for much bigger pop stars for their Saturday bash-–Lady Gaga and Elton John, according to several media outlets. And if those two don’t show, Usher and Elie Goulding have already joined the Venetian party.\n\nThe joy rushing through the canals has been palpable. From Bezos and Sánchez waving at crowds to the new bride already posting a glamorous photo of her in a Sophia Loren-inspired Dolce & Gabbana gown and changing her name to Lauren Sánchez Bezos on Instagram, there is no doubt they want to shout the news from the gondolas. Here’s hoping it lasts longer than the marriage of Bezos’ ex-wife MacKenzie Scott and her second husband, who divorced after less than two years — and that in this case, the second time is really the charm.\n\nMore from Forbes\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"The lavish, celebrity-packed affair in Venice, replete with private water-taxis, three-Michelin-star catering and Murano glass gifts for guests, is over the top, but far from the most expensive billionaire wedding on record.","url":"https://www.forbes.com/sites/martinadilicosa/2025/06/27/heres-how-much-the-bezos-snchez-wedding-extravaganza-really-cost/","image":"https://imageio.forbes.com/specials-images/imageserve/685f1b6fd616b1d3156b9baf/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-27 23:44:56","author":"Forbes Staff,Martina Di Licosa","authors":["Forbes Staff","Martina Di Licosa"],"language":"en","source_country":"US","sentiment":-0.283},{"id":336005828,"title":"Texans’ Approval Ratings for Trump and Abbott Drop: Poll Reveals","text":"TEXAS (KXAN) On Wednesday, The Texas Politics Project, or TPP, released its latest poll results about Texans’ attitudes toward state and federal leaders, as well as their thoughts on public policy.\n\nThe poll was conducted between June 6 and 16, and had 1,200 respondents. It is conducted every other month.\n\nWho responded?\n\nThe average respondent of the survey is white (58%), was born in Texas (66%), lived in the suburbs (52%), had no children (65%), said religion was important to them (68%) but seldom attended services (58% attended two or fewer in a year), was married or in a domestic partnership (54%), owned their home (73%), had an interest in politics (84%), and were not veterans nor had an immediate family member who served (75%).\n\nThe survey had a fairly balanced mix of men (46%) and women (54%). The 45-64 age group had the largest share of respondents at 35%, followed by 30-44 at 25%, 65+ at 23% and 18-29 at 17%.\n\nEducational attainment covered a range: 45% had a high school diploma or GED, 12% had a two-year degree, 27% had a four-year degree, and 13% had a post-graduate degree. For annual household income, 18% of respondents said they earned less than $30,000, while 46% were between $30,000 and $100,000. Twenty-six percent earned more than $100,000.\n\nOnly 9% of respondents lived in the Austin metro, 10% lived in San Antonio, 24% in Dallas-Fort Worth, 23% in Houston.\n\nParty affiliation of respondents broke down into 42% identified as Democrats and 47% identified as Republicans. But most said they didn’t like the Democratic (58%) or Republican (52%) parties.\n\nWhat are the biggest problems?\n\nRespondents’ top issue facing Texas and the nation? Political corruption/leadership. \n\nMore than half of respondents said they felt the country was on the wrong track (54%). The TPP’s high-water mark for this data point came in February, when 48% of respondents said the country was on the right track. \n\nThey also said inflation and immigration were their second and third most important problems of the day. Nationally, respondents said they didn’t feel that drug abuse, the Middle East, Russia, energy or gas prices were problems.\n\nSimilarly, 51% said the economy was worse than a year ago. Thirty-eight percent also said they expect the economy to worsen over the next year, but 35% said it would get better. Respondent’s biggest points of economic concern include the cost of healthcare, food, consumer goods, and housing.\n\nFeelings about Trump’s 2nd term\n\nPresident Donald Trump’s approval hit its first majority disapproval (51%) on a TPP poll since the start of his latest term. He’s actually doing the same as he was in June 2017, six months into his first term.\n\nIn the February 2025 poll, 52% said they approved of the returning President.\n\nBorder security was the President’s only policy that respondents said they approved of, at 51%. Respondents also said they heard a lot (72%) or some (21%) about deportations by the federal government. \n\nWhen asked about legal immigration, a plurality of respondents consistently say that too many people immigrate to the US. Typically, a million people legally immigrate into the US each year, which is around 0.29% of the US population.\n\nA majority (51%) said that undocumented immigrants should be “deported immediately.” However, they also said that authorities shouldn’t target immigrants at hospitals (63%), at immigration status hearings (59%), at church (62%), at school (69%), or who were allowed into the US as asylum seekers (62%). \n\nTrump’s policies that a slight majority of respondents disapproved of include economic policy, inflation and government spending. Most respondents said they worried tariffs would cause prices to increase, and hurt their families and the economy.\n\nIn the 2024 presidential election, 47% of respondents said they’d voted for Trump. Thirty-eight percent had voted for Kamala Harris, and 13% didn’t vote. All respondents said they were registered to vote.\n\nThoughts on Texas leaders\n\nApproval of Gov. Greg Abbott has been positive since August 2022. However, the June poll saw him only reach a 41% approval with a 45% disapproval; 12% landed in the middle. \n\nLt. Gov. Dan Patrick has always seen a roughly 10 point lag behind Abbott on the TPP polls. In the June results, only 30% approved of him.\n\nTexas House of Representatives Speaker Dustin Burrows, who was elected to the seat in January, has his first post-legislative session scores. Most (31%) disapproved, but 29% said they didn’t know and 25% said they neither approved nor disapproved. Only 16% said they approved of his work.\n\nTexas’ legislators saw a 26% approval rate and 45% disapproval. These scores are worse than they were following the state’s 2023 legislative session: 33% approved and 40% disapproved. Most respondents said they either weren’t following the 2025 session closely (38%) or at all (16%). As for the session’s impact, 37% said they felt their lives would be worse because of their state lawmakers.\n\nStill, most respondents feel that Texas’ government is a model that others should follow.\n\nThe poll also asked about Texas Attorney General Ken Paxton. Forty-three percent of respondents said they didn’t approve of him. Less than a third of respondents approved (29%) of his work.\n\nUS Senator John Cornyn, who will face a primary challenge from Paxton, has slightly worse rates than the AG. Cornyn’s approval sits at 24% and disapproval at 46%. His approval has been falling since 2024, when it hovered around a third of respondents.\n\nTexas’ other Senator, Ted Cruz, has better name recognition than Cornyn. Nearly half (49%) disapprove of him while 38% approve.\n\nAll of the leaders named above are Republicans. Republican respondents said that their party’s elected officials were conservative enough (37%), not enough (35%), or too conservative (17%).\n\nRespondents answered if they felt Texas was going in the right direction similarly to how they felt about the nation — 50% said Texas was heading in the wrong direction. October 2018 was the last time 50% of respondents said their state was headed in a good direction.\n\nNone of the respondents felt that redistricting, electoral fraud, gas prices were problems for Texas. \n\nOther issues\n\nThe US Supreme Court’s approval rate ebbs and flows across the polls. But on this most recent survey — conducted prior to its June rulings — 45% disapproved and 28% approved.\n\nAs for the US Congress, its ratings were typical across the years of data: Most respondents don’t approve. But, a typically sized group were ambivalent (19%) or didn’t know (3%). Just 23% of June respondents said they approve of Congress.\n\nThe pollsters asked about Elon Musk. His net favorability fell 20 points since April 2025 to hit 53% unfavorable — in December 2024, he had 54% favorability. The recent results could reflect his recent work for the Trump Administration and subsequent fall from grace.\n\nThese results also include TPP’s first data about AI; 72% said they were concerned about the new technology’s impact in the economy. Only 25% said they weren’t concerned.\n\nOn abortion access, 46% said they supported access, while 38% said they did not. Around 16% said they didn’t know or didn’t support either position. \n\nThe survey also included a question about biblical literalism; 29% said the Bible should be taken literally, 41% said it was the word of God but not taken literally, and 24% said it was the work of men and shouldn’t be read literally.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTEXAS (KXAN) On Wednesday, The Texas Politics Project, or TPP, released its&#8230;\n\n\nThis Post: Texans&#8217; Approval Ratings for Trump and Abbott Drop: Poll Reveals first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/texans-approval-ratings-for-trump-and-abbott-drop-poll-reveals/","image":"https://internewscast.com/wp-content/uploads/2025/06/rewrite-this-title-Trump-Abbott-approval-ratings-among-Texans-sours.png","video":null,"publish_date":"2025-06-27 23:44:48","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.297},{"id":335999858,"title":"There was a time when I would have hated to see Anna Wintour leave Vogue — but she ruined her legacy in one crucial way","text":"The glossy page is being turned — sort of.\n\nAnna Wintour, the supreme leader of Vogue, is stepping down after 37 years at the fashion bible.\n\nLong dubbed “nuclear Wintour” for her icy nature, the 75-year-old is leaving her role as editor-in-chief, but still retaining her cold death grip on it from above as the global chief content officer at publisher Condé Nast. Plus, she’ll still lord over the Met Gala — ensuring celebrities will continue to bow to her in a bid to score invites.\n\nPart of me is sad to see Wintour go, albeit out of pure nostalgia. Her departure signals an official end to the golden age of glossies, when magazine editors ruled the New York City media landscape with impossibly glamorous designer wardrobes and their noses in the air.\n\nShe represents a bygone era of black cars, expense accounts, standing lunch reservations at Michael’s and sanctioned imperious behavior in the corner offices.\n\nBefore the digital revolution and social media influencers upended traditional gatekeepers, magazine editors were rock stars with a near monopoly on cultural influence.\n\nAnd bold characters with the strongest points of view — and, sometimes, unsparing management styles — were usually rewarded with top jobs.\n\nWintour not only epitomized this, she was the complicated empress of it in the ’90s and aughts.\n\nStories abound about her alleged treatment of peasant underlings. Eye contact with her was reportedly forbidden, as was hopping into the elevator with her. A creature of continuity, she hasn’t changed her signature bob, her dark sunglasses or, reportedly, her lunch order of rare steaks in decades.\n\nHer legacy was mythologized in “The Devil Wears Prada,” a roman à clef written by a former Wintour assistant, as well as its 2006 movie. \n\nThey don’t make those creative bullies like they used to. Now, executives have to sanitize their behavior through HR compliance and lead with kindness and compassion.\n\nIt’s good for office morale, but not for media gossip pages. How boring. Imagine a “The Devil Wears Prada” reboot where everyone is sitting around completing anti-harassment training videos and pitching SEO-driven stories about TikTok fashion trends. No cerulean blue monologue. No speech like, “I said to myself, go ahead. Take a chance. Hire the smart, fat girl.” \n\nWhere have all the characters gone?\n\nThings changed at Vogue in 2020 when Wintour had to shake the lily-white elitism from her ranks. \n\n“I want to start by acknowledging your feelings and expressing my empathy towards what so many of you are going through: sadness, hurt, and anger too,” she wrote in a note to staff, participating in the mass white atonement of the moment.\n\n“It can’t be easy to be a Black employee at Vogue, and there are too few of you. I know that it is not enough to say we will do better, but we will … ” \n\nAbsolutely, hiring a more diverse staff was probably a good thing. But the arbiter of privilege turned her fashion bible and its digital site into a place for progressive politics, identitarianism and intersectionality. It became laughably woke. \n\nVogue also became increasingly partisan — a tool of the resistance.\n\nWhile Republican first ladies Laura Bush, Barbara Bush and Nancy Reagan weren’t given covers like their Dem counterparts, they were at least given the scraps of an inside spread. Then came Trump — and all that stopped.\n\nAfter dishing out tongue baths and multiple covers to Michelle Obama, Hillary Clinton and Jill Biden (including last summer while her husband’s campaign imploded), Vogue not only snubbed Melania — who was good enough for a cover in 2005. Earlier this year, a story ripped her official portrait, comparing her to a “freelance magician.”\n\nWintour, long a champion of Dem politicians, has channeled her snobbery against the right and anyone who wasn’t a card-carrying Dem. She fully turned her magazine into an arm of the DNC.\n\nIt became obvious that Vogue was not about American fashion, celebrity or culture — only left-wing figures. People like Stacey Abrams, a two-time loser for the Georgia governor’s mansion, and Sarah McBride, the first trans member of Congress, along with Kamala Harris. \n\nFunnily enough, Second Lady Usha Vance — a first-generation American and accomplished attorney — is someone Vogue would bend over backward to shoot … if only she was married to a Dem.\n\nSo the time is right for Wintour to go. Her magazine could use a makeover to shake off the ingrained partisanship of the last 15 years. \n\nBut since Wintour is still hanging on to some power, I’m guessing we’ll just see last season’s collection again.","summary":"It's the right time to go — because Vogue could use a makeover.","url":"https://nypost.com/2025/06/27/opinion/there-was-a-time-when-i-would-have-hated-to-see-anna-wintour-leave-vogue-but-she-ruined-her-legacy-in-one-crucial-way/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-1y5zzyvm5-1751043461630_720.jpg?quality=75&strip=all&w=720","video":"https://cdn.jwplayer.com/videos/1kwB00kv-RyIcpnTz.mp4","publish_date":"2025-06-27 22:53:49","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","source_country":"us","sentiment":0.021},{"id":335991692,"title":"Bruce Springsteen vs Donald Trump: All recent controversial statements where musician criticizes US President","text":"Donald Trump and Bruce Springsteen\n\nVeteran musician Bruce Springsteen has continued his criticism of Donald Trump’s leadership. In recent interviews and concerts, Springsteen addressed political concerns, including immigration and democratic values. His remarks have sparked a response from Trump, who also attacked Springsteen on social media.Springsteen Speaks Out During InterviewIn an interview with The New York Times published on June 18, Springsteen shared his views on the political state of the United States. He spoke about his ongoing “Land of Hope & Dreams Tour,” during which he includes songs and speeches that reflect the current social and political situation.Springsteen described the present US condition as an “American tragedy.” He blamed industrial decline and income inequality for leaving many people behind. He said these conditions created space for a political figure like Trump to gain support.Comments on Trump’s Second TermSpringsteen said that the events of the recent months under Trump’s second term were once thought to be impossible in the US. He said Americans used to believe these events “can’t happen here,” but now they are happening.Also Read: Supreme Court Key Rulings: All details about birthright citizenship, Obamacare task force, LGBTQ school booksLive EventsOngoing Public Criticism by SpringsteenSpringsteen has been a critic of Trump for years. He supported Kamala Harris during the 2024 election. In a past interview with The Atlantic, he called Trump a threat to democracy.During a May concert in Manchester, Springsteen described Trump’s government as “corrupt, incompetent and treasonous.” Trump responded on Truth Social, calling Springsteen “overrated” and saying he “never liked his music.” Trump also insulted Springsteen personally and told him to “keep his mouth shut.”Concert Speeches and EP ReleaseSpringsteen was not affected by the insults. He continued to speak out during his shows. In late May, he released an EP with a recording of the Manchester speech that upset Trump.At his concerts, Springsteen addresses current events between songs. He mentions immigration raids, policy decisions and public health topics. These speeches are captioned in local languages during international shows.Views on Immigration PoliciesIn his NYT interview, Springsteen criticized recent immigration raids by ICE. He pointed to Freehold, New Jersey, his hometown, where a large migrant population lives. He said migrant communities have changed towns across the US. He called the current immigration actions a tragedy and said they are harmful to the country.Also Read: Squid Game Season 3 Ending: Who is Front Man and who wins the game? Here’s new twist in last episodeStatements in Berlin ConcertDuring a concert in Berlin, Springsteen spoke to thousands of fans at a historic stadium. He asked the audience to support democracy and resist authoritarianism. The speech followed a similar tone as his earlier statements.Springsteen said the US is being led by a government that does not understand what it means to be truly American. He urged Americans to speak out and defend the country’s democratic foundation.Trump’s Online Response and AllegationsTrump posted a video on social media that appeared to show him hitting Springsteen with a golf ball. He also called for an investigation into Springsteen, Beyoncé, and other celebrities. Trump claimed they were paid to support Kamala Harris in the 2024 election.FAQsWhy did Bruce Springsteen criticize Donald Trump?Springsteen criticized Trump over his leadership, immigration policies, and threats to democratic values, expressing these concerns in public speeches and interviews during his ongoing tour.How did Donald Trump respond to Bruce Springsteen’s comments?Trump insulted Springsteen on social media, calling him overrated and demanding an investigation into his political support for Kamala Harris, media reports said.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onspringsteen trump criticismbruce springsteendonald trumptrump administrationimmigration raidstrump golf videospringsteen berlin concertdemocracy in americaice raidsspringsteen ep\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onspringsteen trump criticismbruce springsteendonald trumptrump administrationimmigration raidstrump golf videospringsteen berlin concertdemocracy in americaice raidsspringsteen ep(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Bruce Springsteen has openly criticized President Donald Trump in interviews and during concerts on his current tour. He described Trump’s administration as corrupt and accused it of harming democracy. Springsteen addressed immigration issues, social division and called on Americans to stand against authoritarianism through music and public statements.","url":"https://economictimes.indiatimes.com/news/international/us/bruce-springsteen-vs-donald-trump-all-recent-controversial-statements-where-musician-criticizes-us-president/articleshow/122120371.cms","image":"https://img.etimg.com/thumb/msid-122120385,width-1200,height-630,imgsize-68810,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-27 22:14:13","author":"Ctionsbruce Springsteen","authors":["Ctionsbruce Springsteen"],"language":"en","category":"politics","source_country":"in","sentiment":0.17},{"id":335997940,"title":"California Governor Newsom sues Fox News over alleged defamation","text":"California Governor Gavin Newsom has filed a $787m defamation lawsuit against Fox News, accusing the network of misrepresenting a phone call between him and US President Donald Trump earlier this month amid immigration arrests and the subsequent protests in Los Angeles.\n\nThe complaint was filed on Friday in Delaware Superior Court, the state in which Fox Corp is incorporated.\n\nNewsom spoke by phone with Trump late on June 6 – early June 7 on the East Coast, soon after protests broke out in Los Angeles following federal immigration raids.\n\nLess than 24 hours later, the president sent National Guard troops and 700 Marines to the state, bypassing the governor’s office.\n\nIn an interview with NBC News on June 8, Newsom said that he had a civil conversation with the president, but he never brought up sending the National Guard.\n\n“I tried to talk about LA, he wanted to talk about all these other issues,” Newsom said.\n\n“He never once brought up the National Guard,” he added.\n\nNewsom said he did not speak with Trump again, and confirmed this after Trump falsely told reporters on June 10 that he had spoken with the governor “a day ago”.\n\nThe suit alleged that the network had a “willingness to protect President Trump from his own false statements by smearing his political opponent Governor Newsom in a dispute over when the two last spoke during a period of national strife”.\n\nThe complaint said Fox nonetheless made a misleading video clip and multiple false statements about the timing of the last call, acting with actual malice in an effort to brand Newsom a liar and curry favour with Trump.\n\n“Why would Newsom lie and claim Trump never called him?” Watters said on June 10 on his show, Jesse Watters Primetime, according to the complaint.\n\nWatters’s report was accompanied by a chyron, a banner caption along the bottom of a TV screen, that said “Gavin Lied About Trump’s Call,” the complaint added.\n\nAccording to the complaint, Fox’s claim that Newsom lied was “calculated to provoke outrage and cause Governor Newsom significant harm” by making people less likely to support his causes, donate to his campaigns, or vote for him in elections.\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed,” a spokesperson for Fox News told Al Jazeera in an email.\n\nIn a follow-up, Al Jazeera asked Fox if Watters and his production team fact-checked claims about the phone call before speaking about it – which is industry standard – but the network did not provide clarification.\n\nNewsom’s punitive damages request is nearly identical to the $787.5m that Fox paid in 2023 to settle Dominion Voting Systems’ lawsuit over alleged vote-rigging in the 2020 US presidential election.\n\nTo prevail in his lawsuit, Newsom would have to show Fox acted with actual malice, meaning it knew its statements were false or had reckless disregard for their truth.\n\nAccording to the New York Times, Newsom would drop the lawsuit if Fox issued a retraction and host Jesse Watters apologised on-air for saying the governor lied about his call with Trump.\n\nThe governor’s office told Al Jazeera that it would not comment because Newsom is pursuing the lawsuit in a personal capacity and not through the office.\n\nIn an emailed statement, Newsom said, “If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences – just like it did in the Dominion case. I believe the American people should be able to trust the information they receive from a major news outlet. Until Fox is willing to be truthful, I will keep fighting against their propaganda machine.”\n\nOut of Trump’s playbook\n\nNewsom’s lawsuit comes as Trump has gone after news organisations that have been critical of him. He reached a $15m settlement with ABC News after the network made in an inaccurate claim that a jury found Trump liable for rape in the civil case involving E Jean Carroll, rather than sexual assault.\n\nThe White House also recently went after the network when former White House correspondent Terry Moran called White House Deputy Chief of Staff Stephen Miller a “world-class hater”. Moran was later suspended and subsequently dismissed from the network.\n\nTrump also sued CBS News for $20bn for the editing of a 60 Minutes interview with his Democratic rival Kamala Harris, which was reportedly mediated into a settlement agreement of $20m with parent company Paramount Global, causing concern in the news division. Paramount has a pending merger with Skydance.\n\nTrump has also slashed funding for public media, which the White House alleged was “radical, woke propaganda disguised as ‘news’”.","summary":"Fox said the $7878m suit over its story about phone call with Trump ‘frivolous’ and a ‘publicity stunt’.","url":"https://www.aljazeera.com/economy/2025/6/27/california-governor-newsom-sues-fox-news-over-alleged-defamation?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/06/AP23233797905461-1751048207.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-06-27 21:58:12","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.462},{"id":335987986,"title":"California's Newsom sues Fox News for $787 million for defamation over Trump call","text":"California governor Gavin Newsom filed a $787 million (€672 million) defamation lawsuit against Fox News on Friday, saying the network defamed him in covering his phone call with Donald Trump related to the president's immigration crackdown.\n\nThe complaint filed in Delaware Superior Court accused Fox of demonstrating \"willingness to protect President Trump from his own false statements by smearing his political opponent Governor Newsom in a dispute over when the two last spoke during a period of national strife\".\n\nMr Newsom's punitive damages request is nearly identical to the $787.5 million that Fox paid in 2023 to settle Dominion Voting Systems' lawsuit over alleged vote-rigging in the 2020 US presidential election.\n\nThe governor is also seeking compensatory damages for harm to his reputation, saying Fox acted with actual malice.\n\nAccording to The New York Times, Mr Newsom would drop the lawsuit if Fox issued a retraction and host Jesse Watters apologised on-air for saying the governor lied about his call with Mr Trump.\n\nFox said in a statement: \"Governor Newsom's transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed.\"\n\nThe governor's office did not immediately respond to requests for additional comment. Mr Newsom is a Democrat and potential presidential contender in 2028, and has made several appearances on Fox News.\n\nThe network is a favorite of conservatives, and its on-air talent includes many supporters of Mr Trump, a Republican. Its parent, Fox Corp, is incorporated in Delaware.\n\nLA immigration protests\n\nAccording to the complaint, Mr Newsom spoke by phone with Mr Trump late on June 6th - early June 7th, Eastern Daylight Time - soon after protests broke out in Los Angeles following federal immigration raids.\n\nMr Trump later sent National Guard troops and 700 Marines to the state, bypassing the governor.\n\nMr Newsom said he did not speak again with Mr Trump, and confirmed this after Mr Trump falsely told reporters on June 10th he had spoken with the governor \"a day ago\".\n\nThe complaint said Fox nonetheless intentionally distorted the facts by making a misleading video clip and multiple false statements about the timing of the last call, in an effort to brand Mr Newsom a liar and curry favor with Mr Trump.\n\n\"Why would Newsom lie and claim Trump never called him?\" Mr Watters said on June 10th on his show \"Jesse Watters Primetime,\" according to the complaint.\n\nMr Watters' report was accompanied by a chyron, a banner caption along the bottom of a TV screen, that said \"Gavin Lied About Trump's Call,\" the complaint added.\n\nAccording to the complaint, Fox's claim that Mr Newsom lied was \"calculated to provoke outrage and cause Governor Newsom significant harm,\" by making people less likely to support his causes, donate to his campaigns, or vote for him in elections.\n\nTrump's defamation lawsuits\n\nTo prevail in the lawsuit, Mr Newsom would have to show Fox acted with actual malice, meaning it knew its statements were false or had reckless disregard for their truth.\n\nThe standard comes from New York Times v Sullivan, a landmark 1964 US Supreme Court decision.\n\nMr Trump has also turned to the courts to address perceived defamation by news networks. He reached a $15 million settlement with Walt Disney-owned ABC last December after suing over an inaccurate claim that a jury found him liable for rape, rather than sexual assault, in a civil lawsuit.\n\nMr Trump also sued CBS for $20 billion over its editing of a \"60 Minutes\" interview with 2024 Democratic presidential candidate Kamala Harris. A mediator has reportedly proposed a $20 million settlement with CBS' parent Paramount Global.","summary":"California's Newsom sues Fox News for $787 million for defamation over Trump call","url":"https://www.breakingnews.ie/world/update-2-californias-newsom-sues-fox-news-for-787-million-for-defamation-over-trump-call-1778167.html","image":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDZcXFwvMjcyMTE5MDVcXFwvR2V0dHlJbWFnZXMtMjIwMjE2MDg2OC1lMTc1MTA1NTYwMTgyNS5qcGdcIixcIndpZHRoXCI6NzAwLF","video":null,"publish_date":"2025-06-27 21:20:24","author":"BreakingNews.ie,Reuters","authors":["BreakingNews.ie","Reuters"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.443},{"id":335986594,"title":"The 25 Best Documentaries on Netflix Right Now","text":"The streaming landscape can feel endless. It’s not and we’re here to help. Netflix has hundreds of documentaries in its streaming library, but they’re not all created equal, and we’ve narrowed down the options for you with 25 of our top picks for the best documentary movies currently available to watch on the streaming platform. If you’re looking for something light and visually stunning, you’ve come to the right place. If you’re looking for something gruesome yet fascinating, there are options for you below. If you only have half an hour or 40 minutes to kill, Netflix has something for you. \n\nSo peruse our list below, and get watching!\n\n“American Nightmare”\n\nThe three-episode “American Nightmare” is a fascinating chronicle the spins the true crime genre on its head. It follows the 2015 kidnapping of Denise Huskins, who was labeled “the real ‘Gone Girl’” after she was found and brought home. As investigators immediately suspect the kidnapping was staged, what if their biases are letting a violent criminal roam free?\n\n“Athlete A”\n\nOne of the best documentaries in recent years, “Athlete A” works on multiple fronts: First, it effectively chronicles the abuse perpetrated by Larry Nassar, a former sports medicine physician who used his position at USA Gymnastics to sexually abuse hundreds of children and young women. Second, it contextualizes how the elite gymnastics culture and the leadership of USA Gymnastics, including former CEO Steve Penny, allowed the abuse to continue for years. Finally, it shows the vital importance of investigative journalism, as it follows the team of Indianapolis Star journalists who broke and continued to cover the story. \n\n“The Great Hack”\n\nWith how quickly the age of information and technology is moving, the Facebook-Cambridge Analytica scandal, which broke in 2018, may seem like ancient history, but it is not. In this 2019 film, directors Jehane Noujaim and Karim Amer use interviews with former Cambridge Analytica employee Brittany Kaiser, investigative journalist Carole Cadwalladr, and Professor David Carroll to explain how British consulting firm Cambridge Analytica used personal data collected from tens of millions of Facebook users for political advertising, including in the 2016 presidential campaigns of Ted Cruz and Donald Trump.\n\n“Blackpink: Light Up the Sky”\n\nIf you’re interested in learning more about the global cultural phenomenon that is K-pop, Netflix has a documentary for you. In this 79-minute film, “Salt Fat Acid Heat” director Caroline Suh gets incredible access to the four members of Blackpink to tell the behind-the-scenes story of one of the most popular music groups of all time. The documentary doesn’t get too deep (like Morgan Spurlock’s “One Direction: This Is Us,” there are often limits to music documentaries produced at the height of a group’s active fame), but features moments of vulnerability with Jisoo, Jennie, Rosé, and Lisa that get to some of the joys and pressures of life as a K-pop idol.\n\n“The Speed Cubers”\n\nClocking in at only 40 minutes, “The Speed Cubers” is a great watch option if you’re looking for something quick and uplifting. In this 2020 documentary, director Sue Kim delves into the world of competitive Rubik’s Cube speed solving, following two of the leading solvers in the world: 21-year-old Max Park and 27-year-old Feliks Zemdegs. While the two young men are rivals, they are also friends, and this documentary’s focus on the latter makes it a heartwarming watch.\n\n“The Black Godfather”\n\nClarence “The Black Godfather” Avant is a music executive, film producer, and businessman who has had a hand in many of the Black American musician success stories of the last 50 years. This 2019 documentary, directed by Reginald Hudlin, interviews dozens of the people Avant has worked with over the years—including Barack Obama, Snoop Dogg, Kamala Harris, Hank Aaron, and Jamie Foxx—to tell his story in just under two hours.\n\n“A Secret Love”\n\nWhen director Chris Bolan went to visit his two great aunts, Terry and Pat, he didn’t expect to hear a story that would be the start of his next documentary film project. In this 2020 film, Bolan tells the story of former All-American Girls Professional Baseball League player Terry Donahue and Pat Henschel, partners who have been together for over 70 years but kept the romantic nature of their relationship secret from their family until 2009. “A Secret Love” uses archival home videos and All-American Girls League newsreels to illustrate the story of Pat and Terry’s loving lesbian relationship through the years. The 83-minute film is a testament to love, but it’s also an infuriating history of American homophobia.\n\n“American Factory”\n\nAn Academy Award winner for Best Documentary Feature, this 2019 film is set in Moraine, Ohio, a working class town not far from Dayton where a General Motors plant once thrived, then shuttered. When a Chinese company run by billionaire Cao Dewang decides to open a facility in the abandoned factory, it seems like a win for everyone. The new glass manufacturing company brings 2,000 American jobs to the depressed region, along with the opportunity for 200 Chinese workers to move to America to work in the factory. What follows is a story of a culture clash between working-class America and high-tech China that, thanks to directors Steven Bognar and Julia Reichert, never loses its empathy or complexity.\n\n“Crip Camp”\n\n“Crip Camp: A Disability Revolution” is a story about a community of teens with disabilities who meet at Upstate New York’s Camp Jened in the summer of 1971, and it’s also a story about the power of solidarity in political organizing. The 2020 documentary, directed by James Lebrecht and Nicole Newnham, chronicles the development of the disabilities rights movement in the 20th century, from the sweaty joy and acceptance of the Camp Jened community to the signing of the Section 504, an American law that guarantees a public education to children with disabilities.\n\n“Homecoming”\n\nA 2019 concert film about the superstar’s iconic 2018 Coachella performance, “Homecoming” isn’t just about Beyoncé, it is by Beyoncé. Queen Bey wrote, directed and produced the 137-minute film that takes viewers behind the scenes of “Beychella,” from the performance’s conception to its coming together to its execution. Like “Lemonade” before it, “Homecoming” proved that Beyoncé isn’t just a singer, performer, and businesswoman—she’s also a filmmaker.\n\n“Period. End of Sentence”\n\nA documentary short clocking it at only 26 minutes, “Period. End of the Sentence” is a quick yet impactful glimpse into a vital topic: period poverty, aka a lack of access to menstrual products. In this 2018 doc, director Rayka Zehtabchi follows a group of local women living in a Kathikera village in the Hapur district of India, as they learn how to work a machine designed to make low-cost, biodegradable sanitary pads. The short is about the implementation of this machine, but it is also about the cultural taboo around menstruation—a taboo that exists in some form in most cultures around the world.\n\n“Is That Black Enough For You?”\n\nIt can be difficult to make a good documentary on a broad subject, but director and culture critic Elvis Mitchell does it with “Is That Black Enough For You?,” which tells the history of Black American cinema in a cool 135 minutes. The 2022 documentary spends much of its time focusing on the “Blaxploitation” films of the 1970s, but puts the period in a larger context of how Black Americans have been depicted throughout the history of cinema—mostly by White directors and writers. Featuring talking head interviews with people like Laurence Fishburne, Samuel L. Jackson, and Whoopi Goldberg, “Is That Black Enough For You?” is a must-watch for any cinephile.\n\n“White Hot: The Rise of Abercrombie & Fitch”\n\nMillennials who were alive and shopping during the 90s or naughts might find particular nostalgia interest in “White Hot: The Rise of Abercrombie & Fitch,” but this documentary is a must-watch for anyone who is interested in the cycles of systemic discrimination that plague American culture. Alison Klayman’s 2022 doc breaks down the successes and failures of the retail brand, and how its commitment to white, rich, thin beauty standards not only in its advertisements but in its hiring policies led to its fall from cool-kid grace. While the talking head interviews with former A&F employees and journalists are insightful, the film may be most effective in its soundtrack, which conjures up turn-of-the-millennials vibes with hits like Lit’s “My Own Worst Enemy” and The Offspring’s “Self Esteem.”\n\n“Pray Away”\n\nDirected by Kristine Stolakis, “Pray Away” is a bold and vital film about conversion therapy, the pseudo-scientific practice embraced by some conservative Christian communities under the false belief that it is possible to “cure” someone’s queerness. The film employs interviews with survivors of conversion therapy, as well as former leaders in the evangelical conversion therapy communities to explore the damage these camps have done—and continue to do. The documentary won the 2022 GLAAD Media Award for “Outstanding Documentary.”\n\n“Descendant”\n\nIn 2019, the wreckage of the Clotilda, the last known U.S. slave ship to bring captives from Africa to America (40 years after slavery had been deemed a capital offense), was found in Alabama’s Mobile River. In “Descendant,” director Margaret Brown uses that moment as a jumping off point to tell the thoroughly American story of Africatown, a community three miles from Mobile that was formed by 32 of the West Africans who were on the Clotilda. Many of their descendants still live in Africatown today. Brown tells their story, as well as the story of other people in the community, stitching together an oral history of systemic racism and collective resilience.\n\n“The Elephant Whisperers”\n\nDirector Kartiki Gonsalves spent five years following an indigenous couple named Bomman and Bellie, as they cared for elephants in the Mudumalai National Park in the mountains of southern India. While Bomman, Bellie, and elephants Raghu and Ammukutty are the character foci of this 40-minute feature, “The Elephant Whisperers” is as interested in communicating a sense of place as much as plot. Gorgeous shots of the countryside, as well as other animals (including leopards, tigers and monkeys) living in the reserve, make “The Elephant Whisperers” a lush, immersive experience.\n\n“Circus of Books”\n\nIn 1982, Rachel Mason’s parents took over ownership of Circus of Books, a gay porn bookshop in West Hollywood, without telling their children exactly what it is they did for a living. In 2019, Rachel Mason released the documentary “Circus of Books,” a story about the bookshop, what it meant to the local gay community, and how the family secret was eventually revealed. “Circus of Books” is both a deeply personal meditation on family and a snapshot of a gay community during the 1980s and beyond.\n\n“Coded Bias”\n\nArtificial intelligence is becoming an increasing factor in our daily lives, which makes “Coded Bias,” a 2020 documentary about the biases that can be embedded into advanced technology, a must-watch. Directed by filmmaker and environmental activist Shalini Kantayya, “Coded Bias” follows Joy Buolamwini, a computer scientist and digital activist whose MIT research into the limitations of facial-recognition technology brought public attention to the biases that are often built into decision-making software.\n\n“Money Shot: The Porn Hub Story”\n\nOne of the most recent documentaries on this list, “Money Shot: The Porn Hub Story” is exactly what it says on the tin: the tale of the Canadian-owned internet porn site, which is the 13th most-trafficked website in the world. Director Suzanne Hilliger uses interviews with sex workers, ex-Pornhub employees, journalists, and anti-sex-trafficking activists to discuss a 2020 Pornhub scandal involving non-consensual pornography on the site, and its aftermath. Rather than taking a “pro” or “con” stance on the website and industry, Hilliger lets her variety of subjects give their opinions and perspective, which makes for a broad, albeit sometimes frustrating watch.\n\nWith “13th,” Ava DuVernay set out to answer the question of how the United States became the country with the highest rates of incarceration in the world. The 2016 documentary answers that question by drawing a line from the end of slavery in America (enacted with the 13th Amendment, which is where the film gets its name) to our modern carceral system, where Black Americans are incarcerated at nearly five times the rate of white Americans. The 100-minute documentary does this with a mix of archival footage and interviews with activists, politicians, and historians, including Angela Davis, Cory Booker, and Henry Louis Gates Jr. \n\n“Knock Down the House”\n\nIf you’re looking for some hope heading in the American democratic system, look no further than “Knock Down the House,” a 2019 documentary that follows four women Democrats running for Congress in the 2018 elections. In the election, Alexandria Ocasio-Cortez of New York, Amy Vilela of Nevada, Cori Bush of Missouri, and Paula Jean Swearengin of West Virginia all ran grassroots campaigns against long-time incumbents. If you follow U.S. politics at all, you know the outcome of each race, but that doesn’t take away from the energy of Rachel Lears’ 86-minute film. \n\n“My Octopus Teacher”\n\nCome for the breathtaking underwater shots of an underwater kelp forest in a remote bay off the coast of South Africa, stay for the story of an octopus and a human becoming best friends. The human in question is Craig Foster, a filmmaker “My Octopus Teacher” directors Pippa Ehrlich and James Reed spent a year following around in the water (and occasionally on shore). Did they expect for Craig to become best friends with a mollusk? Unclear, and it is only so helpful to project a human relationship context onto their interactions, but you will probably find far more plot and character in this 85-minute documentary than you might expect from a film that is mainly about bopping around in the ocean.\n\n“Fantastic Fungi”\n\nSpeaking of natural wonders, “Fantastic Fungi” is a deep dive into the mysterious world of the mycelium network. As you may have heard before, there is so much humans still don’t know or understand about mushrooms, but this 80-minute documentary doesn’t let that stop it. Interviews with American mycologist Paul Stamets walking around the forest are a highlight of this 2019 documentary, but it’s the combination of time-lapse cinematography and CGI used by director Louie Schwartzberg that truly makes this film a must-watch.\n\nWe’re still not so good at talking about mental health, but Jonah Hill’s documentary about how much he loves his therapist might be helping. The 2022 documentary could have felt like a trash-grab gimmick, if not for the sincerity and vulnerability of both Hill, who shares some of his own mental health struggles, and Stutz, who offers tips and strategies to viewers who might not have their own therapist. The 96-minute film is by no means a substitute for actual mental health access and support, but does perhaps represent a further erosion of the stigma so many people still have against seeking help.","summary":"From light and pleasant to dark and fascinating\n\n\nThe post The 25 Best Documentaries on Netflix Right Now appeared first on TheWrap.","url":"https://www.thewrap.com/best-documentaries-on-netflix/","image":"https://www.thewrap.com/wp-content/uploads/2023/06/coded-bias.jpg","video":null,"publish_date":"2025-06-27 21:19:00","author":"Kayti Burt,Larry Nassar","authors":["Kayti Burt","Larry Nassar"],"language":"en","source_country":"US","sentiment":0.586},{"id":335982366,"title":"Kamala Harris’ potential gubernatorial run isn’t exciting anyone, California donors say","text":"Former Vice President Kamala Harris’ prospective gubernatorial bid is not striking up much excitement among Democratic fundraisers in California, Politico reported Friday.\n\nThe outlet spoke to multiple Democratic Party donors in California to see how they felt about Harris possibly running for governor. So far, her interest in exploring a gubernatorial run in the state following her 2024 presidential election loss hasn’t enthused many.\n\n“She still would probably lead, but honestly, no one is incredibly pumped,” one Southern California fundraiser told Politico.\n\nHarris, who lost November’s election to President Donald Trump, is seriously considering a 2026 bid to succeed term-limited Gov. Gavin Newsom, D-Calif. A source close to Harris told Fox News Digital in March that she has told allies she will decide by the end of summer on whether to launch a gubernatorial campaign.\n\nThe two potential options for Harris are launching a gubernatorial run next year in her home state or seeking the presidency again in 2028. Extremely early polls in the next Democratic Party presidential nomination race — which are heavily reliant on name recognition at this point — indicate that the former vice president holds a significant lead over other potential White House contenders.\n\n“In interviews, several major donors in the state told POLITICO they fear her reemergence as a candidate would re-open still-fresh wounds from her defeat in 2024,” the outlet reported. “Some harbor lingering frustration about how her billion-dollar campaign juggernaut ended in debt and want assurances she would have a clear plan to win the governor’s mansion.”\n\nMather Martin, a party fundraiser from San Francisco who worked for multiple Harris campaigns, told Politico, “There was more enthusiasm at first” for Harris’ run. However, he added, “I think it waned a bit.”\n\nAnother donor who gave a six-figure donation to Harris’ presidential campaign last year told the outlet they had found the implosion of her White House bid “traumatizing” and seemed reluctant to support her in the state.\n\n“Kamala just reminds you we are in this complete s— storm. With Biden, we got bamboozled… I think she did the best she could in that situation, but obviously she knew about the cognitive decline too. I’ve written so many checks because I knew the Trump administration would be horrible, but we’re living in a nightmare because of the Democrats. I’m furious at them, truly.”\n\nThe donor who declared that “no one is incredibly pumped” about Harris’ run also shared that donors “realize it’s just going to bring up the whole pathetic last presidential, which no one wants to hear about again. And then it’s the whole ‘Did you know Joe Biden?’ thing.”\n\nScott Drexel, a donor-adviser based in the San Francisco Bay Area, noted, “It’s very fair to say there’s not an overwhelming clamor” for Harris’ gubernatorial run.\n\nHe also pointed out, “It’s very hard for there to be one if it’s not 100 percent clear if she really wants to do it.”\n\n“She’s going to have to work for the nomination. Every day that passes, there’s less of a sense of inevitability about her candidacy,” Drexel said.\n\nDemocratic donor and San Francisco trial lawyer Joe Cotchett told Politico, “She is talking to people around the state about whether she is going to run. If she does, she’s going to have very difficult problems.”\n\nHarris’ team did not immediately reply to Fox News Digital’s request for comment.","summary":"Major fundraisers cite 'traumatizing' presidential campaign collapse as reason for waning enthusiasm.","url":"https://nypost.com/2025/06/27/media/no-one-excited-about-kamala-harris-potential-gubernatorial-run-say-california-donors/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/107274213.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2025-06-27 21:16:46","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.307},{"id":336007122,"title":"2028 Dem frontrunner beating Kamala Harris has 0% Black support, poll finds","text":"It’s still years away from the 2028 Democratic presidential primary but a new poll finds that voters don’t see Former Vice President Kamala Harris as their top pick.\n\nA poll from Emerson College released Friday found that former South Bend Mayor and Transportation Secretary Pete Buttigieg is the number one choice for Democratic primary voters in a hypothetical race.\n\nAmong respondents who identify as Democratic primary voters, 16% said that they would support Buttigieg, while 13% said they would choose Harris as the nominee.\n\nBut the poll identified a potential problem for Buttigeig when Primary time comes around: he had 0% support from Black voters.\n\nThis isn’t the first time Buttigieg has led a 2028 poll of Democratic candidates. A poll released by Atlas Intel on May 30 found Buttigieg as the top candidate among Democratic primary voters.\n\nThe third most popular pick for Democrats is Gov. Gavin Newsom of California, at 12%, followed by Rep. Alexandria Ocasio-Cortez, D-NY, and Gov. Josh Shapiro of Pennsylvania, at 7% each, according to the poll. Sen. Bernie Sanders, I-VT, who ran and lost in both the 2016 and 2020 Democratic primaries for president ranked fifth, with 5% of voters saying they would support the 83-year-old senator.\n\nWhile the Emerson poll finds Buttigieg as the front-runner in a hypothetical matchup, the largest group of Democrats polled — 23% — were undecided about who they would choose to run for president.\n\nBlack, high school-educated voters back Harris\n\nThe candidate who polled best among Black voters is Kamala Harris, with 30.1% of respondents indicating their support for her, according to the poll\n\nHarris also performed well among voters with a high school education or less, with 23.9% of voters in that category backing her — more than any other Democratic candidate.\n\nButtigieg, meanwhile, performed best among white voters (22.1%) and college graduates (20.1%). He also led among voters who have a vocational/technical school education (12.7%), among those with an associate degree (18.5%), and among those with a postgraduate education or higher (12.7%)\n\nIn terms of Black voters, the poll found Buttigieg earning 0% support.\n\nNewsom, the third most popular pick among Democrats, did best among Latino voters (21.1%) and Asian voters (13.4%), according to the poll.\n\nMiddle-aged voters like Buttigieg, younger voters like Ocasio-Cortez\n\nButtigieg also performed best among middle-aged voters. He was the favorite among voters aged 40-49 years old (15.2%) and those aged 50-59 years old (21.2%). He was also popular among voters aged 70 and older (20%). Among voters aged 60-69, Newsom was the leader, with 18.3% of respondents in that age range supporting the California governor.\n\nAmong voters aged 18-29, Ocasio-Cortez was the most popular choice, with 22.7% of voters backing the New York congresswoman. Harris was the most popular among those aged 30-39, with 18.7% saying they would back her in a presidential campaign.\n\nThe Emerson College poll was conducted from June 24 to 25, 2025. There were 404 people who answered the questions about Democratic candidates.\n\nMore on Politics\n\nRead the original article on MassLive.","url":"https://www.yahoo.com/news/2028-dem-frontrunner-beating-kamala-210005196.html","image":"https://s.yimg.com/ny/api/res/1.2/m6eBxc_bdOsh_AlECkKLWA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjg7Y2Y9d2VicA--/https://media.zenfs.com/en/masslive_articles_390/0de7a3ac0dc241779b930a9dde0e76d4","video":null,"publish_date":"2025-06-27 21:00:05","author":"Adam Bass","authors":["Adam Bass"],"language":"en","source_country":"us","sentiment":-0.05},{"id":335972512,"title":"Republicans' Chances of Flipping New Hampshire's Democratic Senate Seat","text":"Democratic Congressman Chris Pappas is viewed more favorably than former Senator Scott Brown, a Republican, among New Hampshire voters ahead of the state's 2026 Senate election, according to a new poll released this week.Newsweek reached out to the Brown and Pappas campaigns for comment via email.Why It MattersBrown, a former Massachusetts senator, announced he is running for Senate in New Hampshire this week in what Republicans are hoping to make a competitive race. New Hampshire has generally tilted toward Democrats in recent federal elections, though Republicans have performed well in gubernatorial races.Still, former Vice President Kamala Harris won the Granite State by fewer than 3 percentage points in 2024—an indicator of how competitive it could still be for Republicans.Historically, the party in the White House loses seats in their midterms, so Democrats are optimistic about what the national environment will be next November. Republican incumbents are finding themselves on the defense in states like Maine and North Carolina, and Democrats are hoping to expand the map to more solidly conservative territory to flip the majority.What to KnowA poll conducted by the University of New Hampshire revealed how New Hampshire voters feel about leading candidates, Pappas and Brown. Although the primary is months away and more candidates could enter the race, at this point, they are the only prominent politicians to make a run for the Senate in their respective parties.The poll found that voters are split in how they view Pappas, who has represented New Hampshire's First Congressional District since 2019. Thirty-six percent of respondents each said they view him favorably and unfavorably, while 17 percent are neutral about him.Brown, meanwhile, is viewed more unfavorably, according to the poll.Thirty-eight percent said they viewed him unfavorably, while 12 percent viewed him favorably and 19 percent were neutral about him, according to the poll.The poll surveyed 1,320 New Hampshire residents from June 19 to June 23, 2025, and had a margin of error of plus or minus 2.7 percentage points. While it measured favorability, it did not include a head-to-head polling question for the Senate race. No head-to-heads have been conducted between Brown and Pappas so far.Brown has been viewed as a solid recruit for Republicans after former Governor Chris Sununu, who enjoyed positive approvals during his tenure, declined to run. Brown served as a senator representing Massachusetts from 2010 to 2013 after the death of Senator Ted Kennedy. He lost to Democratic Senator Elizabeth Warren in 2012. In 2014, he ran in the New Hampshire Senate race but lost to Shaheen.Meanwhile, incumbent Democratic Senator Jeanne Shaheen also decided to retire at the end of her term, leaving an open contest.Former President Joe Biden won New Hampshire by a larger margin than Harris in 2020, carrying the state by about seven percentage points. It backed former Secretary of State Hillary Clinton over Trump by less than half a percentage point in 2016.Republicans last won a New Hampshire Senate race in 2010, when now-Governor Kelly Ayotte pulled off a 23-point win against former Democratic Representative Paul Hodes. Ayotte lost reelection in 2016 to Democrat Maggie Hassan, who at the time was the governor. Democrats haven't won the governorship since Hassan's tenure.What People Are SayingNick Puglia, NRSC regional press secretary, told Newsweek: \"Chris Pappas voted for the largest working-class tax hike in history, supports dangerous sanctuary city policies that protect violent illegal immigrants, and wants to force women to compete against males. Pappas' out-of-touch agenda represents the opposite of commonsense, and voters will reject him for it in 2026.\"The DSCC reacted to Brown's announcement in a statement this week: \"After their embarrassing recruitment failure in New Hampshire, Republicans are resorting to a candidate Granite Staters have already rejected. Scott Brown is a die-hard Trump loyalist who puts Wall Street ahead of working people, supports chaotic tariffs and Medicaid cuts, and has an extreme anti-abortion agenda. Republicans have not won a Senate seat in New Hampshire in more than a decade and 2026 will be no different.\"Brown said in a video announcing his campaign: \"NH is an amazing place to live, work and raise a family. We've been blessed by two great governors, Chris Sununu and Kelly Ayotte, but in Washington, we haven't been represented by the right people. For four years, Chris Pappas has stood with Joe Biden as he opened the border, drove up the cost of everything and made just life just simply unaffordable.\"What Happens NextThe Cook Political Report currently classifies New Hampshire's Senate race as leaning Democratic, meaning it is \"considered competitive races,\" but \"one party has an advantage.\"","summary":"Former GOP Senator Scott Brown announced his campaign this week—a new poll compared his favorability to Democratic Rep. Chris Pappas.","url":"https://www.newsweek.com/scott-brown-chances-flipping-democratic-senate-seat-new-hampshire-2091867","image":"https://d.newsweek.com/en/full/2673158/scott-brown-chances-nh-senate-race.jpg","video":null,"publish_date":"2025-06-27 20:42:27","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.07},{"id":335964080,"title":"Ella Emhoff says it was traumatic to vote in NYC mayoral primary after stepmom Kamala's election loss","text":"Ella Emhoff said it was traumatic to vote in the New York City Democrat mayoral primary as she had to use the same polling station where she had cast her vote for stepmom Kamala Harris. \n\nOn Tuesday, Emhoff, 26, took to her Instagram stories to encourage her Big Apple fanbase to get out and vote for Democrat Socialist, Zohran Mamdani, despite the incredibly hot temperatures. \n\nWhile encouraging civic duty, she revealed she had strong feelings heading to the polls as it was the first time she had done so since Harris lost to President Donald Trump in November. \n\n'Feeling so many emotions voting again,' she wrote while wearing a Zohran for NYC bandana and an I Voted sticker. 'It was a little traumatic walking into the same voting place as I did in November.\n\n'But I feel so much hope for New York and what @zohrankmamdani will bring.' \n\nShe said in a video that she was happy to see the 'support around Zohran.' \n\n'Let's f**king do this, guys!' she said as she walked home to her Brooklyn apartment. \n\nEmhoff would get her way on Tuesday evening after Mamdani unofficially won the Democrat primary, garnering 43.5 percent of the first-round votes. \n\nHis competition, former New York Governor Andrew Cuomo, conceded on Tuesday evening after only getting 36.4 percent of the vote. \n\nMamdani has not officially won the primary, as he would have needed to get more than 50 percent of the first-rank votes to officially win. \n\nNew York City uses ranked-choice voting, allowing voters to list up to five candidates on their ballots. Final results for rounds two to five are expected to come in on Tuesday. \n\nCuomo may still run in November's election as an independent, although sources claim he knows he's beaten and plans to take a dignified step back.\n\nMamdani will face incumbent Mayor Eric Adams for the final race in November. \n\nEmhoff will face a similar anxiety leading up to this November as to last when she held onto hope Harris would prevail. \n\nThe young New Yorker was seen in tears after her 'Mamala' conceded to Trump the day after the election. \n\nThen-Second Gentleman, Doug Emhoff, was seen keeping a close arm around his daughter and embracing his son, Cole.\n\nAt the time, Emhoff took to Instagram to write: 'Truly no words. We are all gonna get through this. It just f**king hurts like a b**ch right now and that's ok. The fight doesn't stop now.' \n\nDaily Mail has reached out to Emhoff for comment. \n\nMamdani ran on a platform that promises affordability to the second most expensive city in the world. He plans to provide free public buses, city-owned grocery stores that will offer cheaper prices, and free universal childcare, among others. \n\nSince his win, President Donald Trump has branded Mamdani as a '100 percent Communist lunatic' and criticized his fellow Democratic socialist endorsers, Representative Alexandria Ocasio-Cortez and Vermont Senator Bernie Sanders. \n\nDuring a debate, Mamdani promised to be Trump's 'worst nightmare.","summary":"Ella Emhoff said it was traumatic to vote in the New York City Democrat primary as she had to use the same polling station where she had cast her vote for stepmom Kamala Harris.","url":"https://www.dailymail.co.uk/news/article-14854963/Ella-Emhoff-says-traumatic-vote-NYC-mayoral-primary-stepmom-Kamalas-election-loss.html","image":"https://i.dailymail.co.uk/1s/2025/06/27/19/99800521-0-image-m-119_1751050615245.jpg","video":null,"publish_date":"2025-06-27 20:04:20","author":"Alyssa Guzman,Editor","authors":["Alyssa Guzman","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.023},{"id":336004620,"title":"Kamala Harris plots her next political move after US election loss","text":"Kamala Harris is exploring a gubernatorial bid in California, with a self-imposed decision deadline set for late summer. \n\nMany Democratic donors are hesitant about her potential candidacy, still affected by her 2024 presidential election defeat by Donald Trump. \n\nConcerns among some donors include reopening traumatizing memories of the 2024 election and questions regarding President Joe Biden's health. \n\nDespite donor ambivalence, Harris's allies believe her strong fundraising network and name recognition would secure support for a gubernatorial run. \n\nRepublicans are eager for Harris to enter the race, viewing it as an opportunity to highlight perceived issues with the Biden administration and President Joe Biden's health.","summary":"","url":"https://www.independent.co.uk/bulletin/news/kamala-harris-california-governor-president-b2778563.html","image":"https://static.independent.co.uk/2025/05/30/8/08/BESTPIX-Kamala-Harris-Speaks-At-The-Emerge-Gala-In-San-Francisco-hngnm6wh.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/nmZsSqln-4VHSaSK0.mp4","publish_date":"2025-06-27 19:53:09","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","category":"politics","source_country":"gb","sentiment":0.118},{"id":335960342,"title":"How Creators Turned Political Campaigns Into The Ultimate Battleground","text":"The 2024 U.S. Presidential election, apart from being a seismic result in favor of former and current President Trump, marked a major change in the business of campaigns.\n\nThe first time utilization and mobilization of major content creators by both party machines was immortalized at Trump’s election victory party at Mar a-Lago by the UFC Founder Dana White in his deep praise of the prominent Podcasters instrumental in tipping the scales and delivering the winning campaign when she stated: ‘I want to thank the NELK Boys, Adin Ross, Theo Von, Bussin’ With The Boys. And last but not least, the mighty and powerful Joe Rogan’.\n\nThe business of politics and campaigns - like a number of legacy industries, is now played out on the distribution platform that is relevant: social media. People under 40 years of age rush away from linear television, newspapers and radio airwaves that once defined media consumption. Online streaming grew to account for 40% of U.S. TV usage – in comparison to cable television sitting at an anemic 27%. Newspaper circulation dropped by 12.7% in 2024\n\nAudio numbers have grown with the rise of Spotify and Apple Music and those consuming podcasts through video (like on Youtube). Seventy percent of Americans above the age of 12 have listened to a podcast, and 73% above the age of12 have consumed a podcast in audio form or video — underscoring the growth of the medium as a means of messaging and entertainment.\n\nThe relatively nascent Twitter app was used during Obama's first run for the presidency to acquire new audiences and disseminate new messaging. Now, it’s owned by the world’s wealthiest man: Elon Musk. His change of heart around President Trump aside, the election result remains the same. and now along with Truth Social are the preeminent presidential mouthpieces and appear set to be the main standards of announcement around the office of the White House throughout this presidential term.\n\nWhile so many people became obsessed over the first presidential race to be set in the heart of the AI revolution – it was audio and YouTube that created the intimate bond to voters. Over the course of 2024, both Trump and Democratic candidate Kamala Harris traded podcast and YouTube appearances on the aforementioned NELK Boys, Adin Ross, Theo Von and perhaps most prominently the world’s biggest podcaster Joe Rogan where he preferred a more ‘unscripted’ style approach to win voters.\n\nMORE FOR YOU\n\nHarris, on the other hand, sat down with Call Her Daddy host Alex Cooper and reportedly turned down an appearance on Rogan wanting the Texas based podcaster to come to Washington. She also appeared on “All the Smoke” with former NBA players Matt Barnes and Stephen Jackson while completing interviews with Howard Stern and Charlamagne tha God.\n\nThe contrasting publicity choices seems to tell a very clear story. The Joe Rogan and Trump podcast amassed 59 million views on YouTube and his sit-down with Theo Von amassed another 16 million views. By comparison, Kamala Harris’s effort with Cooper contrastingly didn’t crack 1 million views and sits, at the time of publication, at a comparatively meagre 992,000.\n\nThese YouTube view counts don’t even factor in the many ‘cut downs’ versions of the films that were distributed as bite sized pieces on platforms like Tik Tok, Instagram and YouTube shorts.\n\nBeyond the presidential race, the hotly contested New York democratic primary race between former governor Andrew Cuomo and the fast-rising underdog Assembly member Zohran Mamdani has seen one candidate embrace both Instagram and Tik Tok for his campaign messaging. Delivering made-for-platform short form clips of the 33-year-old interviewing regular people on the street and speaking in Hindi with smash cuts of Bollywood films as well as collaborations with pages like the Gaydar Show humorously talking about LGBTQI specific issues and popular creators like Hasan Piker to illustrate relatability and authenticity over more scripted and polished fair which traditional politicians tend to embrace. Mamdani counts over 600,000 followers on Instagram and 275,000 on Tik Tok whilst his chief opposition Cuomo held a relatively meagre 196,000 on Instagram and 2600 on Tik Tok,\n\nWith a victory in the democratic primary, Mamdani’s embracing of social, short form and creators surged past the more well established and better funded Cuomo. The unapologetic embracing of social platforms and creators has also resulted in a record $8 Million raised from donors to help continue the slick social messaging push to November’s General Mayoral election.\n\nThe US election cycle is now fully embracing this new standard of message distribution as each Party battles to get its propaganda in front of new and ever evolving audiences. Mark my words, as more and more content creators develop into the podcast world, YouTube and Live Streaming – it’s clear that they hold more sway than ever before.\n\nMultiple talent managers who represent talent that have completed content partnerships with both sides of the political aisle reinforced the sentiment that the growth of political spending on creators represents the most tangible way to access younger voters who have long since tuned out of legacy media.\n\nAs you would expect, campaign finances are also being distributed very differently today as well. $5.5 billion was spent on the Presidential campaign in 2024 and that number trebled to $15.9 billion with congressional races factored in too.\n\nDaniel Bee, a Publicist and Communications expert in Los Angeles said: “It’s pretty safe to say we should anticipate continued growth in political spending in the USA and that a huge chunk of that money will be spent working closer with content creators and their huge and growing audiences. You have to meet the audiences where they are”.\n\nThe mass spending begs the question where future campaign dollars will be funneled off the back of the growth of Podcast and social media appearances for candidates. Paid ads on social media are nothing new but it opens up the high likelihood of more and more money being spent on Podcast appearances, sponsored creator content, political rallies featuring more creators and livestreams are set to become part of the fabric of campaigning for years to come.\n\nWill 2028 bring the first Presidential Mr. Beast games…only time will tell\n\nEditorial StandardsReprints & Permissions","summary":"When the Creator Economy and Politics intersect","url":"https://www.forbes.com/sites/jasondavis/2025/06/27/how-creators-turned-political-campaigns-into-the-ultimate-battleground/","image":"https://imageio.forbes.com/specials-images/imageserve/685eea4166d81a6ce1109803/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-27 19:04:00","author":"Contributor,Jason Davis","authors":["Contributor","Jason Davis"],"language":"en","category":"politics","source_country":"US","sentiment":0.163},{"id":335960572,"title":"Scramble Begins for Control of Former Dem Congressman’s Seat as Virginia Heads to Special Election","text":"The death of longtime U.S. Rep. Gerry Connolly, D-Va., has triggered a high-stakes political scramble in Northern Virginia, as both parties prepare to nominate candidates Saturday ahead of a rare special election Sept. 9.\n\nVirginia Republicans and Democrats will hold “firehouse primaries”—primary elections run by the political parties instead of the state—to determine their candidates. \n\nVirginia’s 11th district, centered around Fairfax, has been a reliable Democrat stronghold since the early 2000s. In the 2024 general election, Connolly beat his Republican opponent, Mike Van Meter, with twice as many votes. The district also leaned heavily Democrat in the presidential race, favoring former Vice President Kamala Harris over President Donald Trump by a similar margin.\n\nChair of the Fairfax County Democratic Committee Aaron Yohai told The Daily Signal, “Democrats in Virginia’s 11th Congressional District should vote for the future they want for our country.”\n\nDespite the district’s blue lean, Republicans see the open seat as an opportunity to regain control in the U.S. House. Eleventh Congressional District Republican Committee Chair Rosie Oakley told The Daily Signal, “The margin in the House of Representatives is very narrow, favors Republicans, but by a very narrow margin, so it’s an opportunity for us to increase that margin by adding that seat.”\n\nOakley said that Republicans are “super excited” for the special election because it will be the first time since 2009 that a Republican candidate has not been up against a Democrat incumbent.\n\nDemocrat candidates include a Virginia state senator, a former Venezuelan congressman, and Connolly’s former chief of staff.\n\nRepublican candidates include Van Meter, a taxpayer advocate, and several military veterans.\n\nThe parties will announce their nominees after this weekend’s voting. Candidates will then have just over two months to campaign before the September special election, which could serve as a barometer of voter turnout and party strength ahead of the 2026 congressional midterm elections.","summary":"The death of longtime U.S. Rep. Gerry Connolly, D-Va., has triggered a high-stakes political scramble in Northern Virginia, as both parties prepare to nominate candidates... Read More\n\n\nThe post Scramble Begins for Control of Former Dem Congressman’s Seat as Virginia Heads to Special Election appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/27/scramble-begins-control-democrat-congressmans-former-seat-virginia-heads-special-election/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/Connolly.jpg","video":null,"publish_date":"2025-06-27 18:55:00","author":"Christina Lewis,Senate Parliamenta","authors":["Christina Lewis","Senate Parliamenta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":335944890,"title":"Newsom sues Fox News over alleged defamation in story about call with Trump","text":"California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false information about a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles.\n\nThe lawsuit alleges Fox News anchor Jesse Watters edited out key information from a clip of Trump talking about calling Newsom, then used the edited video to assert that Newsom had lied about the two talking.\n\nNewsom is asking for $787 million in punitive damages in his lawsuit filed in Delaware court where Fox is incorporated. That’s the same amount Fox agreed to pay in 2023 to settle a defamation lawsuit by Dominion Voting Systems. The company said Fox had repeatedly aired false allegations that its equipment had switched votes from Donald Trump to Joe Biden during the 2020 election, and the discovery process of the lawsuit revealed Fox’s efforts not to alienate conservatives in the network’s audience in the wake of Biden’s victory.\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences — just like it did in the Dominion case,” Newsom said in a statement. “I believe the American people should be able to trust the information they receive from a major news outlet.”\n\nHe asked a judge to order Fox News to stop broadcasting “the false, deceptive, and fraudulent video and accompanying statements” that Newsom said falsely say he lied about when he had spoken to Trump regarding the situation in Los Angeles, where protests erupted on June 6 over Trump’s immigration crackdown.\n\nFox News called the lawsuit “frivolous.”\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed,” the company said in a statement.\n\nThe law makes it difficult to prove defamation, but some cases result in settlements and, no matter the disposition, can tie up news outlets in expensive legal fights.\n\nParticularly since taking office a second time, Trump has been aggressive in going after news organizations he feels has wronged him. He’s involved in settlement talks over his lawsuit against CBS News about a “60 Minutes” interview last fall with Democratic opponent Kamala Harris. This week, Trump’s lawyers threatened a lawsuit against CNN and The New York Times over their reporting of an initial assessment of damage to Iran’s nuclear program from a U.S. bombing.\n\nNewsom’s lawsuit centers on the details of a phone call with the president.\n\nBoth Newsom and the White House have said the two spoke late at night on June 6 in California, which was already June 7 on the East Coast. Though the content of the call is not part of the lawsuit, Newsom has said the two never discussed Trump’s plan to deploy the National Guard, which he announced the next day. Trump said the deployment was necessary to protect federal buildings from people protesting increased immigration arrests.\n\nTrump later announced he would also deploy Marines to the area.\n\nOn June 10, when 700 Marines arrived in the Los Angeles area, Trump told reporters he had spoken to Newsom “a day ago” about his decision to send troops. That day, Newsom posted on X that there had been no call.\n\n“There was no call. Not even a voicemail,” Newsom wrote.\n\nOn the evening of June 10, the Watters Primetime show played a clip of Trump’s statement about his call with Newsom but removed Trump’s comment that the call was “a day ago,” the lawsuit said. Watters also referred to call logs another Fox News reporter had posted online showing the phone call the two had on June 6.\n\n“Why would Newsom lie and claim Trump never called him? Why would he do that?” Watters asked on air, according to the lawsuit. The segment included text across the bottom of the screen that said “Gavin Lied About Trump’s Call.”\n\nNewsom’s suit argues that by editing the material, Fox “maliciously lied as a means to sabotage informed national discussion.”\n\nPrecise details about when the call happened are important because the days when Trump deployed the Guard to Los Angeles despite Newsom’s opposition “represented an unprecedented moment,” Newsom’s lawyers wrote in a letter to Fox demanding a retraction and on-air apology.\n\n“History was occurring in real time. It is precisely why reporters asked President Trump the very question that prompted this matter: when did he last speak with Governor Newsom,” the letter said.","summary":"California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false information about a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles.","url":"https://timesofsandiego.com/politics/2025/06/27/newsom-sues-fox-over-trump-call-story/","image":"https://timesofsandiego.com/wp-content/uploads/2025/06/AP25178606552177-scaled.jpg","video":null,"publish_date":"2025-06-27 18:31:24","author":"Associated Press,Dominion Voting Systems","authors":["Associated Press","Dominion Voting Systems"],"language":"en","category":"politics","source_country":"us","sentiment":-0.427},{"id":335963684,"title":"‘No one’ excited about Kamala Harris’ potential gubernatorial run, say California donors","text":"Former Vice President Kamala Harris’ prospective gubernatorial bid is not striking up much excitement among Democratic fundraisers in California, Politico reported Friday. The outlet spoke to multiple Democratic Party donors in California to see how they felt about Harris possibly running for governor. So far, her interest in exploring a gubernatorial run in the state following her 2024 presidential election loss hasn’t enthused many. \"She still would probably lead, but honestly, no one is incredibly pumped,\" one Southern California fundraiser told Politico. REPUBLICANS USE MAMDANI BOMBSHELL VICTORY OVER CUOMO AS AMMUNITION TO BLAST DEMOCRATS AS EXTREMISTS Harris, who lost November's election to President Donald Trump, is seriously considering a 2026 bid to succeed term-limited Gov. Gavin Newsom, D-Calif. A source close to Harris told Fox News Digital in March that she has told allies she will decide by the end of summer on whether to launch a gubernatorial campaign. The two potential options for Harris are launching a gubernatorial run next year in her home state or seeking the presidency again in 2028. Extremely early polls in the next Democratic Party presidential nomination race — which are heavily reliant on name recognition at this point — indicate that the former vice president holds a significant lead over other potential White House contenders. \"In interviews, several major donors in the state told POLITICO they fear her reemergence as a candidate would re-open still-fresh wounds from her defeat in 2024,\" the outlet reported. \"Some harbor lingering frustration about how her billion-dollar campaign juggernaut ended in debt and want assurances she would have a clear plan to win the governor’s mansion.\" TOP TRUMP ALLY TEASES BID FOR CALIFORNIA GOVERNOR IF HARRIS RUNS Mather Martin, a party fundraiser from San Francisco who worked for multiple Harris campaigns, told Politico, \"There was more enthusiasm at first\" for Harris’ run. However, he added, \"I think it waned a bit.\" Another donor who gave a six-figure donation to Harris’ presidential campaign last year told the outlet they had found the implosion of her White House bid \"traumatizing\" and seemed reluctant to support her in the state. \"Kamala just reminds you we are in this complete s--- storm. With Biden, we got bamboozled… I think she did the best she could in that situation, but obviously she knew about the cognitive decline too. I’ve written so many checks because I knew the Trump administration would be horrible, but we’re living in a nightmare because of the Democrats. I’m furious at them, truly.\" The donor who declared that \"no one is incredibly pumped\" about Harris’ run also shared that donors \"realize it’s just going to bring up the whole pathetic last presidential, which no one wants to hear about again. And then it’s the whole ‘Did you know Joe Biden?’ thing.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Scott Drexel, a donor-adviser based in the San Francisco Bay Area, noted, \"It’s very fair to say there’s not an overwhelming clamor\" for Harris’ gubernatorial run. He also pointed out, \"It’s very hard for there to be one if it’s not 100 percent clear if she really wants to do it.\" \"She’s going to have to work for the nomination. Every day that passes, there’s less of a sense of inevitability about her candidacy,\" Drexel said. Democratic donor and San Francisco trial lawyer Joe Cotchett told Politico, \"She is talking to people around the state about whether she is going to run. If she does, she’s going to have very difficult problems.\" CLICK HERE TO GET THE FOX NEWS APP Harris’ team did not immediately reply to Fox News Digital’s request for comment. Fox News Digital’s Paul Steinhauser contributed to this report.","summary":"According to Politico, California Democratic donors are showing limited enthusiasm for former Vice President Kamala Harris&apos; possible 2026 gubernatorial run.","url":"https://www.foxnews.com/media/no-one-excited-kamala-harris-potential-gubernatorial-run-california-donors","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Harris.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-27 18:28:52","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":-0.311},{"id":336004682,"title":"Kamala Harris is trying to gain momentum for a California governor run — but ‘no one is incredibly pumped,’ report says","text":"Kamala Harris is ramping up efforts to connect with long-term supporters as she considers a gubernatorial run in California to replace term-limited Democratic Governor Gavin Newsom. \n\nHowever, as Politico reports, many Democratic donors remain hesitant, still reeling from the disappointment of her defeat in the 2024 presidential election by Donald Trump.\n\nAmbivalence about Harris’s return to public life has been shared privately among certain donors as she considers her options, which include more than just running for political office, according to the outlet. Aides have also been tasked with exploring a philanthropic venture.\n\nSeveral major donors in the state told Politico that they fear her reemergence as a candidate would reopen still-fresh wounds from her 2024 defeat.\n\nOne California Democrat who contributed six figures to her presidential campaign said a gubernatorial candidacy would only serve as a reminder of how “traumatizing” the 2024 election was.\n\n“Kamala just reminds you we are in this complete s*** storm. With Biden, we got bamboozled…I think she did the best she could in that situation, but obviously she knew about the cognitive decline too,” they said.\n\n“I’ve written so many checks because I knew the Trump administration would be horrible, but we’re living in a nightmare because of the Democrats. I’m furious at them, truly.”\n\nOthers are eager for Harris to begin publicly explaining her case for why she should lead the state, the world’s fourth-largest economy, during an extremely difficult period, which is recovering from devastating wildfires, preparing for economic effects from Trump’s tariffs, and still dealing with immigration raids and military deployments ordered by the president.\n\nSome donors also have lingering frustration about how the billion-dollar campaign juggernaut to put her in the White House ended in defeat and debt. They want assurances that she would have a clear plan to win the governor’s mansion.\n\nHarris allies acknowledge the lingering frustrations from the 2024 campaign but still feel confident that donors would rally behind the former vice president should she enter the California governor’s race.\n\nThey note that candidates who have already declared their intention to run for the Democratic Party ticket have struggled to raise significant sums, arguing that it is a sign donors are waiting for a decision from Harris.\n\nThe former vice president has been consulting with her closest backers in private meetings, notably in the Bay Area, where she began her political life 20 years ago. \n\nThe results of these discussions could significantly change California’s stagnant gubernatorial race. With widespread name recognition and a robust fundraising infrastructure, Harris would likely emerge as a leading candidate, possibly causing many, though not necessarily all, Democratic opponents to withdraw.\n\nShe also benefits from a long-standing fundraising network in the state, an impressive small-donor email list, and a national network of Black women ready to support her in another historic campaign.\n\nWhile there may be hesitance from the Democrat donor class, conversely, Republicans are eager for Harris to join the race. She could put a fire under the campaign of any GOP candidate looking to capitalize on the perceived failings of the Biden administration, as well as whether the vice president misled Americans about President Joe Biden’s health and mental acuity before he had to exit the 2024 race.\n\nOne Democratic fundraiser who was granted anonymity to speak to Politico about sensitive conversations, said that donors “realize it’s just going to bring up the whole pathetic last presidential campaign, which no one wants to hear about again. And then it’s the whole ‘Did you know Joe Biden?’ thing.”\n\nThey added: “She still would probably lead, but honestly, no one is incredibly pumped.”\n\nQuestions about any cover-up regarding Biden’s health have arisen within Harris’s own party, with Antonio Villaraigosa, who is also running for governor, accusing her of being complicit. Supporters believe she must address the issue directly early in any campaign to move on to other topics quickly.\n\nHowever, Harris should expect to work hard for the nomination and not assume the party will automatically line up behind her on day one, as a donor adviser told Politico. \n\nGiven the filing deadlines and the need to build a statewide campaign infrastructure, the 2026 governor’s race is the most urgent option facing Harris — she has set her own deadline of late summer to decide. \n\nRunning for president again in 2028 is also an option.","summary":"Former vice president set self-imposed deadline of late summer on whether she will run to lead world’s fourth-largest economy at challenging time","url":"https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-california-governor-campaign-b2778490.html","image":"https://static.independent.co.uk/2025/06/27/16/45/GettyImages-2218984974.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/nmZsSqln-4VHSaSK0.mp4","publish_date":"2025-06-27 18:18:07","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.021},{"id":335948932,"title":"NEW 2028 POLL: Shock Bad News For Kamala Harris, But Very Good News For JD Vance","text":"On \"Forbes Newsroom,\" Matt Taglia, Senior Director of Emerson College Polling, discussed a new Emerson poll showing the top candidates in the 2028 presidential election.\n\nWatch the full interview above.\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"On \"Forbes Newsroom,\" Matt Taglia, Senior Director of Emerson College Polling, discussed a new Emerson poll showing the top candidates in the 2028 presidential election.","url":"https://www.forbes.com/sites/forbestv/2025/06/27/new-2028-poll-shock-bad-news-for-kamala-harris-but-very-good-news-for-jd-vance/","image":"https://imageio.forbes.com/specials-images/imageserve/685ede91236d01154c279f46/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-27 18:11:51","author":"Forbes Staff,ForbesTV","authors":["Forbes Staff","ForbesTV"],"language":"en","source_country":"US","sentiment":0.089},{"id":335951948,"title":"California governor sues Fox News over alleged defamation in story about call with Trump","text":"By OLGA R. RODRIGUEZ, Associated Press\n\nSAN FRANCISCO (AP) — California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false information about a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles.\n\nThe lawsuit alleges Fox News anchor Jesse Watters edited out key information from a clip of Trump talking about calling Newsom, then used the edited video to assert that Newsom had lied about the two talking.\n\nNewsom is asking for $787 million in punitive damages in his lawsuit filed in Delaware court where Fox is incorporated. That’s the same amount Fox agreed to pay in 2023 to settle a defamation lawsuit by Dominion Voting Systems. The company said Fox had repeatedly aired false allegations that its equipment had switched votes from Donald Trump to Joe Biden during the 2020 election, and the discovery process of the lawsuit revealed Fox’s efforts not to alienate conservatives in the network’s audience in the wake of Biden’s victory.\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences — just like it did in the Dominion case,” Newsom said in a statement. “I believe the American people should be able to trust the information they receive from a major news outlet.”\n\nHe asked a judge to order Fox News to stop broadcasting “the false, deceptive, and fraudulent video and accompanying statements” that Newsom said falsely say he lied about when he had spoken to Trump regarding the situation in Los Angeles, where protests erupted on June 6 over Trump’s immigration crackdown.\n\nFox News called the lawsuit “frivolous.”\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed,” the company said in a statement.\n\nThe law makes it difficult to prove defamation, but some cases result in settlements and, no matter the disposition, can tie up news outlets in expensive legal fights.\n\nParticularly since taking office a second time, Trump has been aggressive in going after news organizations he feels has wronged him. He’s involved in settlement talks over his lawsuit against CBS News about a “60 Minutes” interview last fall with Democratic opponent Kamala Harris. This week, Trump’s lawyers threatened a lawsuit against CNN and The New York Times over their reporting of an initial assessment of damage to Iran’s nuclear program from a U.S. bombing.\n\nNewsom’s lawsuit centers on the details of a phone call with the president.\n\nBoth Newsom and the White House have said the two spoke late at night on June 6 in California, which was already June 7 on the East Coast. Though the content of the call is not part of the lawsuit, Newsom has said the two never discussed Trump’s plan to deploy the National Guard, which he announced the next day. Trump said the deployment was necessary to protect federal buildings from people protesting increased immigration arrests.\n\nTrump later announced he would also deploy Marines to the area.\n\nOn June 10, when 700 Marines arrived in the Los Angeles area, Trump told reporters he had spoken to Newsom “a day ago” about his decision to send troops. That day, Newsom posted on X that there had been no call.\n\n“There was no call. Not even a voicemail,” Newsom wrote.\n\nOn the evening of June 10, the Watters Primetime show played a clip of Trump’s statement about his call with Newsom but removed Trump’s comment that the call was “a day ago,” the lawsuit said. Watters also referred to call logs another Fox News reporter had posted online showing the phone call the two had on June 6.\n\n“Why would Newsom lie and claim Trump never called him? Why would he do that?” Watters asked on air, according to the lawsuit. The segment included text across the bottom of the screen that said “Gavin Lied About Trump’s Call.”\n\nNewsom’s suit argues that by editing the material, Fox “maliciously lied as a means to sabotage informed national discussion.”\n\nPrecise details about when the call happened are important because the days when Trump deployed the Guard to Los Angeles despite Newsom’s opposition “represented an unprecedented moment,” Newsom’s lawyers wrote in a letter to Fox demanding a retraction and on-air apology.\n\n“History was occurring in real time. It is precisely why reporters asked President Trump the very question that prompted this matter: when did he last speak with Governor Newsom,” the letter said.\n\nAssociated Press journalist David Bauder contributed to this report.","summary":"Gov. Gavin Newsom is asking for $787 million in punitive damages.","url":"https://www.sandiegouniontribune.com/2025/06/27/newsom-fox-news-lawsuit/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Newsom-Fox_News_Lawsuit_52177.jpg?w=150&strip=all","video":null,"publish_date":"2025-06-27 17:59:21","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.396},{"id":335944466,"title":"California governor sues Fox News over alleged defamation in story about call with Trump","text":"By OLGA R. RODRIGUEZ, Associated Press\n\nSAN FRANCISCO (AP) — California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false information about a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles.\n\nThe lawsuit alleges Fox News anchor Jesse Watters edited out key information from a clip of Trump talking about calling Newsom, then used the edited video to assert that Newsom had lied about the two talking.\n\nNewsom is asking for $787 million in punitive damages in his lawsuit filed in Delaware court where Fox is incorporated. That’s the same amount Fox agreed to pay in 2023 to settle a defamation lawsuit by Dominion Voting Systems. The company said Fox had repeatedly aired false allegations that its equipment had switched votes from Donald Trump to Joe Biden during the 2020 election, and the discovery process of the lawsuit revealed Fox’s efforts not to alienate conservatives in the network’s audience in the wake of Biden’s victory.\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences — just like it did in the Dominion case,” Newsom said in a statement. “I believe the American people should be able to trust the information they receive from a major news outlet.”\n\nHe asked a judge to order Fox News to stop broadcasting “the false, deceptive, and fraudulent video and accompanying statements” that Newsom said falsely say he lied about when he had spoken to Trump regarding the situation in Los Angeles, where protests erupted on June 6 over Trump’s immigration crackdown.\n\nFox News called the lawsuit “frivolous.”\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed,” the company said in a statement.\n\nThe law makes it difficult to prove defamation, but some cases result in settlements and, no matter the disposition, can tie up news outlets in expensive legal fights.\n\nParticularly since taking office a second time, Trump has been aggressive in going after news organizations he feels has wronged him. He’s involved in settlement talks over his lawsuit against CBS News about a “60 Minutes” interview last fall with Democratic opponent Kamala Harris. This week, Trump’s lawyers threatened a lawsuit against CNN and The New York Times over their reporting of an initial assessment of damage to Iran’s nuclear program from a U.S. bombing.\n\nNewsom’s lawsuit centers on the details of a phone call with the president.\n\nBoth Newsom and the White House have said the two spoke late at night on June 6 in California, which was already June 7 on the East Coast. Though the content of the call is not part of the lawsuit, Newsom has said the two never discussed Trump’s plan to deploy the National Guard, which he announced the next day. Trump said the deployment was necessary to protect federal buildings from people protesting increased immigration arrests.\n\nTrump later announced he would also deploy Marines to the area.\n\nOn June 10, when 700 Marines arrived in the Los Angeles area, Trump told reporters he had spoken to Newsom “a day ago” about his decision to send troops. That day, Newsom posted on X that there had been no call.\n\n“There was no call. Not even a voicemail,” Newsom wrote.\n\nOn the evening of June 10, the Watters Primetime show played a clip of Trump’s statement about his call with Newsom but removed Trump’s comment that the call was “a day ago,” the lawsuit said. Watters also referred to call logs another Fox News reporter had posted online showing the phone call the two had on June 6.\n\n“Why would Newsom lie and claim Trump never called him? Why would he do that?” Watters asked on air, according to the lawsuit. The segment included text across the bottom of the screen that said “Gavin Lied About Trump’s Call.”\n\nNewsom’s suit argues that by editing the material, Fox “maliciously lied as a means to sabotage informed national discussion.”\n\nPrecise details about when the call happened are important because the days when Trump deployed the Guard to Los Angeles despite Newsom’s opposition “represented an unprecedented moment,” Newsom’s lawyers wrote in a letter to Fox demanding a retraction and on-air apology.\n\n“History was occurring in real time. It is precisely why reporters asked President Trump the very question that prompted this matter: when did he last speak with Governor Newsom,” the letter said.\n\nAssociated Press journalist David Bauder contributed to this report.","summary":"Gov. Gavin Newsom is asking for $787 million in punitive damages.","url":"https://www.twincities.com/2025/06/27/newsom-fox-news-lawsuit/","image":"https://www.twincities.com/wp-content/uploads/2025/06/Newsom-Fox_News_Lawsuit_52177.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-27 17:59:21","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.396},{"id":335945128,"title":"California governor sues Fox News over alleged defamation in story about call with Trump","text":"By OLGA R. RODRIGUEZ, Associated Press\n\nSAN FRANCISCO (AP) — California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false information about a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles.\n\nThe lawsuit alleges Fox News anchor Jesse Watters edited out key information from a clip of Trump talking about calling Newsom, then used the edited video to assert that Newsom had lied about the two talking.\n\nNewsom is asking for $787 million in punitive damages in his lawsuit filed in Delaware court where Fox is incorporated. That’s the same amount Fox agreed to pay in 2023 to settle a defamation lawsuit by Dominion Voting Systems. The company said Fox had repeatedly aired false allegations that its equipment had switched votes from Donald Trump to Joe Biden during the 2020 election, and the discovery process of the lawsuit revealed Fox’s efforts not to alienate conservatives in the network’s audience in the wake of Biden’s victory.\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences — just like it did in the Dominion case,” Newsom said in a statement. “I believe the American people should be able to trust the information they receive from a major news outlet.”\n\nHe asked a judge to order Fox News to stop broadcasting “the false, deceptive, and fraudulent video and accompanying statements” that Newsom said falsely say he lied about when he had spoken to Trump regarding the situation in Los Angeles, where protests erupted on June 6 over Trump’s immigration crackdown.\n\nFox News called the lawsuit “frivolous.”\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed,” the company said in a statement.\n\nThe law makes it difficult to prove defamation, but some cases result in settlements and, no matter the disposition, can tie up news outlets in expensive legal fights.\n\nParticularly since taking office a second time, Trump has been aggressive in going after news organizations he feels has wronged him. He’s involved in settlement talks over his lawsuit against CBS News about a “60 Minutes” interview last fall with Democratic opponent Kamala Harris. This week, Trump’s lawyers threatened a lawsuit against CNN and The New York Times over their reporting of an initial assessment of damage to Iran’s nuclear program from a U.S. bombing.\n\nNewsom’s lawsuit centers on the details of a phone call with the president.\n\nBoth Newsom and the White House have said the two spoke late at night on June 6 in California, which was already June 7 on the East Coast. Though the content of the call is not part of the lawsuit, Newsom has said the two never discussed Trump’s plan to deploy the National Guard, which he announced the next day. Trump said the deployment was necessary to protect federal buildings from people protesting increased immigration arrests.\n\nTrump later announced he would also deploy Marines to the area.\n\nOn June 10, when 700 Marines arrived in the Los Angeles area, Trump told reporters he had spoken to Newsom “a day ago” about his decision to send troops. That day, Newsom posted on X that there had been no call.\n\n“There was no call. Not even a voicemail,” Newsom wrote.\n\nOn the evening of June 10, the Watters Primetime show played a clip of Trump’s statement about his call with Newsom but removed Trump’s comment that the call was “a day ago,” the lawsuit said. Watters also referred to call logs another Fox News reporter had posted online showing the phone call the two had on June 6.\n\n“Why would Newsom lie and claim Trump never called him? Why would he do that?” Watters asked on air, according to the lawsuit. The segment included text across the bottom of the screen that said “Gavin Lied About Trump’s Call.”\n\nNewsom’s suit argues that by editing the material, Fox “maliciously lied as a means to sabotage informed national discussion.”\n\nPrecise details about when the call happened are important because the days when Trump deployed the Guard to Los Angeles despite Newsom’s opposition “represented an unprecedented moment,” Newsom’s lawyers wrote in a letter to Fox demanding a retraction and on-air apology.\n\n“History was occurring in real time. It is precisely why reporters asked President Trump the very question that prompted this matter: when did he last speak with Governor Newsom,” the letter said.\n\nAssociated Press journalist David Bauder contributed to this report.","summary":"Gov. Gavin Newsom is asking for $787 million in punitive damages.","url":"https://www.bostonherald.com/2025/06/27/newsom-fox-news-lawsuit/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Newsom-Fox_News_Lawsuit_52177.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-27 17:59:21","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.396},{"id":335941110,"title":"California governor sues Fox News over alleged defamation in story about call with Trump","text":"By OLGA R. RODRIGUEZ, Associated Press\n\nSAN FRANCISCO (AP) — California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false information about a phone call he had with President Donald Trump around the time the National Guard was sent Los Angeles.\n\nThe lawsuit alleges Fox News anchor Jesse Watters edited out key information from a clip of Trump talking about calling Newsom, then used the edited video to assert that Newsom had lied about the two talking.\n\nNewsom is asking for $787 million in punitive damages in his lawsuit filed in Delaware court where Fox is incorporated. That’s the same amount Fox agreed to pay in 2023 to settle a defamation lawsuit by Dominion Voting Systems. The company said Fox had repeatedly aired false allegations that its equipment had switched votes from Donald Trump to Joe Biden during the 2020 election, and the discovery process of the lawsuit revealed Fox’s efforts not to alienate conservatives in the network’s audience in the wake of Biden’s victory.\n\n“If Fox News wants to lie to the American people on Donald Trump’s behalf, it should face consequences — just like it did in the Dominion case,” Newsom said in a statement. “I believe the American people should be able to trust the information they receive from a major news outlet.”\n\nHe asked a judge to order Fox News to stop broadcasting “the false, deceptive, and fraudulent video and accompanying statements” that Newsom said falsely say he lied about when he had spoken to Trump regarding the situation in Los Angeles, where protests erupted on June 6 over Trump’s immigration crackdown.\n\nFox News called the lawsuit “frivolous.”\n\n“Gov. Newsom’s transparent publicity stunt is frivolous and designed to chill free speech critical of him. We will defend this case vigorously and look forward to it being dismissed,” the company said in a statement.\n\nThe law makes it difficult to prove defamation, but some cases result in settlements and, no matter the disposition, can tie up news outlets in expensive legal fights.\n\nParticularly since taking office a second time, Trump has been aggressive in going after news organizations he feels has wronged him. He’s involved in settlement talks over his lawsuit against CBS News about a “60 Minutes” interview last fall with Democratic opponent Kamala Harris. This week, Trump’s lawyers threatened a lawsuit against CNN and The New York Times over their reporting of an initial assessment of damage to Iran’s nuclear program from a U.S. bombing.\n\nNewsom’s lawsuit centers on the details of a phone call with the president.\n\nBoth Newsom and the White House have said the two spoke late at night on June 6 in California, which was already June 7 on the East Coast. Though the content of the call is not part of the lawsuit, Newsom has said the two never discussed Trump’s plan to deploy the National Guard, which he announced the next day. Trump said the deployment was necessary to protect federal buildings from people protesting increased immigration arrests.\n\nTrump later announced he would also deploy Marines to the area.\n\nOn June 10, when 700 Marines arrived in the Los Angeles area, Trump told reporters he had spoken to Newsom “a day ago” about his decision to send troops. That day, Newsom posted on X that there had been no call.\n\n“There was no call. Not even a voicemail,” Newsom wrote.\n\nOn the evening of June 10, the Watters Primetime show played a clip of Trump’s statement about his call with Newsom but removed Trump’s comment that the call was “a day ago,” the lawsuit said. Watters also referred to call logs another Fox News reporter had posted online showing the phone call the two had on June 6.\n\n“Why would Newsom lie and claim Trump never called him? Why would he do that?” Watters asked on air, according to the lawsuit. The segment included text across the bottom of the screen that said “Gavin Lied About Trump’s Call.”\n\nNewsom’s suit argues that by editing the material, Fox “maliciously lied as a means to sabotage informed national discussion.”\n\nPrecise details about when the call happened are important because the days when Trump deployed the Guard to Los Angeles despite Newsom’s opposition “represented an unprecedented moment,” Newsom’s lawyers wrote in a letter to Fox demanding a retraction and on-air apology.\n\n“History was occurring in real time. It is precisely why reporters asked President Trump the very question that prompted this matter: when did he last speak with Governor Newsom,” the letter said.\n\nAssociated Press journalist David Bauder contributed to this report.","summary":"Gov. Gavin Newsom is asking for $787 million in punitive damages.","url":"https://www.ocregister.com/2025/06/27/newsom-fox-news-lawsuit/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Newsom-Fox_News_Lawsuit_52177.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-27 17:59:21","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.396},{"id":335938782,"title":"Vance, Buttigieg would be 2028 presidential contenders, according to new poll","text":"WASHINGTON — GOP Vice President JD Vance and Dem ex-Transportation Secretary Pete Buttigieg are the leading candidates for their parties’ primary nods in the 2028 presidential race, a new poll shows.\n\nIn a hypothetical Republican presidential primary fight, Vance leads the pack with 46% support, followed by Secretary of State Marco Rubio at 12%, Florida Gov. Ron DeSantis at 9% and Health and Human Services Secretary Robert F. Kennedy Jr. at 5%, according to the Emerson College survey.\n\nButtigieg is meanwhile narrowly leading former Vice President Kamala Harris, 16% to 13%, in a hypothetical Democratic presidential primary, with California Gov. Gavin Newsom (12%), Pennsylvania Gov. Josh Shapiro (7%) and “Squad” Rep. Alexandria Ocasio-Cortez (7%) close behind, the poll says.\n\nAt least 23% of Democratic primary voters surveyed said they were still undecided.\n\nWhile there’s still plenty of jockeying for position possible in the Dem primary contest, Vance has “solidified” his position as the GOP presidential frontrunner, according to Emerson College Polling Executive Director Spencer Kimball.\n\nSince the last Emerson survey in November, Vance surged in favorability among GOP primary voters.\n\nBut Harris has bled support after registering 37% backing from Dem primary voters in that post-election Emerson poll.\n\nIt’s unclear whether the former California Democratic senator is eyeing a run for governor of the Golden State in 2026 — before making a final decision on a second run for the presidency.\n\nAfter her landslide defeat to Trump in November, Harris declared that it was “not in my nature to go quietly into the night” but has yet to publicly indicate whether she’ll run for either office.\n\nThe survey also revealed that President Trump’s approval rating just dipped underwater, with 46% disapproving of the job he’s doing and 45% supporting him.\n\nThe president has stopped short of calling Vance, 40, his successor since announcing the “Hillbilly Elegy” author and US senator from Ohio as his running mate at the 2024 Republican National Convention. \n\nTrump instead still reserved some praise for Rubio, 53, last month.\n\n“You look at Marco, you look at JD Vance, who’s fantastic,” he told NBC News’ Kristin Welker during an interview on “Meet the Press” after being asked about what the future of his Make America Great Again movement would be.\n\nA JL Partners poll in May also found Vance out in front in the Republican presidential primary race with 46% support from registered voters.\n\nThe latest Emerson College survey further showed Republicans and Democrats equally split at 42% support among US voters on the generic congressional ballot.\n\nIt was conducted from June 24-25 with 1,000 registered voters surveyed. The margin of error was plus-or-minus 3 percentage points.","summary":"GOP Vice President JD Vance and Dem ex-Transportation Secretary Pete Buttigieg are the leading candidates for their parties’ primary nods in the 2028 presidential race, a new poll shows.","url":"https://nypost.com/2025/06/27/us-news/vance-buttigieg-would-be-2028-presidential-contenders-according-to-new-poll/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/107258303.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/h6KrSDtv-RyIcpnTz.mp4","publish_date":"2025-06-27 17:58:07","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.344},{"id":335935766,"title":"Celebrities Gather for Jeff Bezos and Lauren Sanchez’s $20 Million Wedding Celebration","text":"The most extravagant celebrity wedding of the generation has commenced, with famous personalities arriving to witness Lauren Sanchez tie the knot with Jeff Bezos. The ceremony and celebration are projected to set the Amazon billionaire back over $20 million.\n\nIn Venice, a city synonymous with romance, royalty, dignitaries, and Hollywood elite have come together for the Bezos-Sanchez wedding, an unparalleled event.\n\nLauren made a breathtaking appearance as she was transported by speedboat to San Giorgio Maggiore, overlooking a Venetian lagoon, where she would walk down the aisle in front of 200 esteemed guests.\n\nShe wore a classic white suit and headscarf to land on the island where she changed into her handmade, one of a kind Dolce & Gabbana gown.\n\nAmid local protests, the globe’s richest and most powerful people have descended on La Serenissima, the Most Serene Republic of Venice, to pay homage to the Amazon billionaire and his blushing 55-year-old bride.\n\nBezos and Sanchez will now say their vows in the restored amphitheatre on the island while Matteo Bocelli, the son of tenor Andrea, sings.\n\nAlthough one slight wrinkle is that impeccable sources revealed to the Mail’s Alison Boshoff last night that the Amazon founder and journalist-turned-philanthropist Lauren Sanchez are already married with a pre-nuptial agreement to protect his $244billion (£177billion) fortune signed and sealed.\n\nBut whether they knew already or not, the world’s most rich and powerful were not going to miss the nuptials of a lifetime.\n\nAfter the couple walk down the aisle, a budget of 1,000 Euros a head has been set for the wedding breakfast and according to local reports it will include the local Venetian delicacy of cuttlefish stew washed down with fine wines.\n\nIt is thought that singer-songwriter Usher, who also arrived yesterday, may be performing. Reports that Sir Elton John and Lady Gaga will sing have been denied by representatives for both. \n\nBut the aspirational couple’s wedding celebrations, pencilled in to last three days with the wedding ceremony ongoing and ‘grand ball’ on Saturday night, have already been branded ‘more Vegas than Versailles’.\n\nFive of the city’s most luxurious hotels have been booked out to host an estimated 250 influential guests. Make up tycoon Kylie Jenner needed a separate water taxi to carry her 25 pieces of monogrammed luggage to her Venetian home for the weekend.\n\nSome of the world’s most eligible bachelors are in Venice for the wedding – Orlando Bloom, freshly split from fiancée Katy Perry.\n\nDivorced sporting superstar Tom Brady, and divorced talent agent and billionaire music executive Scooter Braun, were on a lads’ night out with him.\n\nFormer US President Barack Obama is among guests – he and Bezos have been on warm terms for years, and Bezos donated $100million (£72million) to the Obama Foundation in 2021.\n\nThe event has also attracted a near-quorum of Kardashians. \n\nMatriarch Kris Jenner is close friends with Lauren Sanchez, while daughters Kim and Khloe were also in attendance. \n\nKylie Jenner, her daughter by Olympic athlete Caitlin, arrived at the Gritti Palace hotel on Thursday afternoon.\n\nOthers at today’s ceremony include former chat show host Oprah Winfrey and her best friend, TV presenter and author Gayle King, who went on the much-mocked space ‘flight’ on Bezos Blue Origin rocket last month with Sanchez and an all-female team.\n\nDonald Trump’s daughter Ivanka is there along with husband Jared Kushner, but the President himself – reportedly invited – will not come to Venice.\n\nBoth Bezos and Sanchez were there for Trump’s inauguration earlier this year and Bezos attracted much criticism when his Washington Post newspaper declined to endorse Democratic candidate Kamala Harris in the US election last year.\n\nQueen Rania of Jordan has also been seen, as have fashion duo Domenico Dolce and Stefano Gabbana.\n\nProtests by disgruntled locals continue, and are planned for during the ceremony and throughout the wedding celebrations.\n\nSources says that Mayor Luigi Brugnaro has assured the couple that he can guarantee their safety in the middle of the city.\n\nThe Bezos wedding began on Thursday with the first of three days of parties in Venice.\n\nA source closely connected to the organisation of the week’s events said: ‘They have been married for at least a month, more than a month.\n\n‘The marriage is fully legal and took place in America under American law.’\n\nThe source adds: ‘When they were planning the wedding, they were clear about the fact that they were already secretly married.\n\n‘There is no application for a wedding licence from the couple because it was not required.\n\n‘Whatever happens at the wedding on Friday, it will not be a wedding. Under Italian law, it will not be a wedding celebration, any vows said or rings exchanged will have no legal meaning.’\n\nThe source added that Bezos had personally confirmed that he and Sanchez – who met when both were married to other people – are already legally married, and that they had also signed a pre-nuptial agreement to protect his $244 billion (£177 billion) fortune. \n\nAs the eyes of the world focused on the event, staff at the privately owned Madonna dell Orto cloisters – where the couple held their ‘eve of’ reception on Thursday night with finger food and pizza – erected tents to stop overflying drones from picturing the guests. \n\nIt’s thought that the event included speeches from the bride to the groom and vice versa. \n\nPolicemen on jetskis meanwhile patrolled the entrance to the nearest canal.\n\nThe two three star hotels neighbouring the cloister were booked up to house the 150 staff who are working on the wedding. \n\nThe guests are staying rather more comfortably at the five star Aman, The Gritti Palace and the Cipriani.\n\nThe build-up has not gone smoothly, however. Plans were ripped up and remade over the past week as the bride and groom reeled from public hostility to their descent on Venice, and responded to global political turbulence following US airstrikes in Iran.\n\nThey have now left their $500 million (£363 million) yacht, the Koru, off the coast of Croatia, although it was initially intended to be moored in Venice.\n\nThe venues for the various celebrations have changed, too, with plans for Saturday’s party now moved to Arsenale, the shipbuilding yards, which are easier to make secure. \n\n‘The feeling was that the protests started to die down on Monday, so this was possible,’ said one.\n\nForty people were held by police after Extinction Rebellion held a small protest in St Mark’s Square on Thursday morning.\n\nOn Thursday lunchtime, the couple and a few of their guests enjoyed a private lunch in the gardens of the Villa Baslini on the tiny island of San Giovanni Evangelista.\n\nThe island offers perfect privacy and the couple were able to totally evade the army of paparazzo who have descended on Venice.\n\nMeanwhile preparations also continued at the Arsenale – in warehouse 91 to be specific – which was the last-minute switch of venue for Saturday night’s grand ball, from Scuola della Misericordia, after protesters said they would dive into the bordering canal.\n\nOne staff member said: ‘I can tell you that [warehouse 91 is] a beautiful location. All the tables have a wonderful flower display, and they are putting up large chandeliers in the ceiling – it’s going to have a Venetian masked ball theme is what I have heard but we’ve been told no photos, and we have to leave our phones with security.’\n\nThe celebrations began on Wednesday evening with a drinks reception in the ballroom of the stunning 16th century Aman hotel, in one of Venice’s most venerable palazzos, which overlooks the Grand Canal.\n\nThen the wedding guests including Bezos and Sanchez made their way to a private dinner party at the Palazzo Brandolini, hosted by Diane von Furstenberg.\n\nThe designer, 77, is close to the bride and groom to be, with her husband, the mogul Barry Diller, serving as a mentor and inspiration to Jeff Bezos for the past decade. Diller said in an interview that Bezos is a ‘very dear, very loving friend’ and has also been vocal in his admiration for Sanchez, a former local TV anchor and helicopter pilot.\n\nThe party was in Diane’s Venetian home, which occupies the second floor of the spectacular 15th century palazzo, filled with mirrors, gilding and frescoes. The magazine Architectural Digest visited last year and described it as ‘stupendous’ – and they are not easily impressed.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe most extravagant celebrity wedding of the generation has commenced, with famous&#8230;\n\n\nThis Post: Celebrities Gather for Jeff Bezos and Lauren Sanchez&#8217;s $20 Million Wedding Celebration first appeared on Internewscast Journal","url":"https://internewscast.com/news/celebrities-gather-for-jeff-bezos-and-lauren-sanchezs-20-million-wedding-celebration/","image":"https://internewscast.com/wp-content/uploads/2025/06/Stars-arrive-to-see-Jeff-Bezos-and-Lauren-Sanchezs-20m.jpg","video":null,"publish_date":"2025-06-27 17:40:17","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.722},{"id":335939262,"title":"Move to Bar Medicaid Funding of Trans Surgeries Nixed by Senate Parliamentarian, Drawing GOP Wrath","text":"The One Big Beautiful Bill Act—the main legislative vehicle for fulfilling President Donald Trump’s campaign promises—would not prevent taxpayer funds from going to transgender surgeries, unless Senate Republicans take action.\n\nDemocrats on the Senate Committee on the Budget announced Thursday that Senate Parliamentarian Elizabeth MacDonough—essentially, the chamber’s rules referee—had tossed out a provision that “prohibits federal Medicaid and CHIP funding for gender-affirming medical care.”\n\nMacDonough did so under the Byrd Rule, a Senate rule meant to block provisions in 10-year budget packages that are more policy-oriented than budgetary. The rule is named for then-Sen. Robert Byrd, D-W.Va., who was the rule’s main sponsor when it was adopted in 1985. \n\nThat has outraged Rep. Dan Crenshaw, R-Texas, who has accused MacDonough of inconsistency and called for her dismissal.\n\n“She allowed a $50 million grant program for environmental justice, whatever that means … but denied my prohibition on Medicaid funds for transgender surgeries, because it didn’t have a direct enough budget impact. Of course that’s not true, it had a $2.5 billion budget impact.”\n\nBut like all rules in the Senate, the Byrd Rule is not self-enforcing. MacDonough’s ruling is essentially an advisory that the Senate ought to reach a 60-vote threshold in order to waive her recommendation against the provision.\n\nThat’s exceedingly unlikely given the Senate’s sharply partisan divide, so Republicans are now broadly calling to push back on MacDonough’s rulings.\n\n“It’s time to fight,” Rep. Ralph Norman, R-S.C., who is closely watching the Senate’s deliberations, told The Daily Signal on Thursday, adding:\n\nIf we have to sit up here through July 4 and have to sit up here in all of August on our break, we need to do it. This bill is that important.\n\nMacDonough has drawn the wrath of prominent Senate Republicans, such as Sen. Tommy Tuberville, R-Ala.\n\n“Her job is not to push a woke agenda,” Tuberville wrote Thursday after she nixed a provision that was meant to prevent illegal immigrants from receiving Medicaid benefits.\n\n“THE SENATE PARLIAMENTARIAN SHOULD BE FIRED ASAP,” he added, in all-uppercase letters for emphasis.\n\nFiring the parliamentarian is a rather extreme measure, but it would not be unprecedented. \n\nThen-Senate Majority Leader Trent Lott, R-Miss., did so with then-Parliamentarian Robert Dove in 2001 over his frequent overruling of Senate budgetary proposals.\n\nThere is also the option of amending the provision and resubmitting it to MacDonough in the hope that she would approve it. \n\nAn important fact is that the Senate parliamentarian is not enforcing law, but rather the generally agreed-upon rules of the chamber.\n\nVice President JD Vance could technically overrule her as presiding officer of the Senate, although that would break with precedent. \n\nSome Democrats urged just such an action during President Joe Biden’s administration, when MacDonough struck down items on their progressive wish list.\n\nIn 2021, Rep. Ro Khanna, D-Calif., urged then-Vice President Kamala Harris to overrule MacDonough striking a $15 minimum wage provision from the American Rescue Act, a budget reconciliation package during the Biden administration.\n\n“I’m sorry—an unelected parliamentarian does not get to deprive 32 million Americans the raise they deserve,” Khanna said at the time. “This is an advisory, not a ruling. VP Harris needs to disregard and rule a $15 minimum wage in order.” Harris ultimately did not do so.\n\nRep. Ilhan Omar, D-Minn., called for MacDonough’s firing at the time.\n\n“Abolish the filibuster. Replace the parliamentarian,” she said on social media. “What’s a Democratic majority if we can’t pass our priority bills? This is unacceptable.”\n\nRep. Chip Roy, R-Texas, however, says that the parliamentarians’ rulings are no excuse for backsliding on conservative priorities.\n\n“Look, maybe the parliamentarian isn’t doing exactly what she should do, but stop hiding there,” Roy said Thursday. “Go make the right arguments and go do what you need to do to get the bill delivered.”","summary":"The One Big Beautiful Bill Act—the main legislative vehicle for fulfilling President Donald Trump’s campaign promises—would not prevent taxpayer funds from going to transgender surgeries,... Read More\n\n\nThe post Move to Bar Medicaid Funding of Trans Surgeries Nixed by Senate Parliamentarian, Drawing GOP Wrath appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/27/move-defund-trans-surgeries-medicaid-nixed-parliamentarian-infuriating-gop-sponsor/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/capitoltrans.jpg","video":null,"publish_date":"2025-06-27 16:55:10","author":"George Caldwell,Senate Parliamenta","authors":["George Caldwell","Senate Parliamenta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.272},{"id":335929164,"title":"Gavin Newsom demanded $787M from Fox News in his defamation lawsuit. The number isn't a coincidence.","text":"California Gov. Gavin Newsom sued Fox News on Friday, accusing the media company of defaming him by misrepresenting his interactions with President Donald Trump.The figure Newsom demanded in damages might sound familiar: $787 million.That's nearly identical to the $787.5 million that Fox News and its parent company, Fox Corporation, agreed to pay Dominion Voting Systems in 2023 after the media company promoted falsehoods that the election technology company rigged the 2020 presidential election.Dominion's lawsuit was filed in Delaware Superior Court, the same venue where Newsom filed his lawsuit on Friday.Newsom's private lawyers, Michael Teter and Mark Bankston, worked with the same Wilmington-based law firm that Dominion used, Farnan LLP, to file their suit in the Delaware court.Newsom alleges Fox News defamed him by calling him a liar when he denied speaking with President Donald Trump on June 9.Around that time, Trump had sent National Guard troops to Los Angeles over Newsom's objections. Demonstrators had held protests around the city in opposition to the president's immigration policies.At a press conference on June 10, Trump said he spoke to Newsom \"a day ago.\"In fact, Newsom says, they spoke for 16 minutes around midnight on June 7 Eastern time (or June 6 Pacific time), the day Trump first sent the troops.Newsom posted phone records on social media showing the timing of their call. But his lawsuit says Fox News host John Roberts misled readers about the timing in his own social media posts, anyway. The lawsuit also says Jesse Watters, a Fox opinion host, falsely called him a liar.\"Why would Newsom lie and claim Trump never called him? Why would he do that?\" Watters said, according to the suit.The chyron on the screen at the time read \"Gavin lied about Trump's call,\" the lawsuit says.Newsom's lawsuit says Fox News hasn't learned the lessons of the Dominion lawsuit, and that it misled its viewers for political reasons.\"Unfortunately, the past two years have shown that the Dominion settlement did not serve as the deterrent many had predicted, as Fox has continued to launder the stream of false information flowing out of the White House,\" the lawsuit says.\"Gov. Newsom's transparent publicity stunt is frivolous and designed to chill free speech critical of him,\" Fox News said in a statement. \"We will defend this case vigorously and look forward to it being dismissed.\"Dominion's lawsuit proved embarrassing for Fox News. Depositions and emails obtained by the election technology company during the litigation process showed that then-host Tucker Carlson said he \"passionately\" hated Trump and that Rupert Murdoch wanted to make the now-president a \"non-person\" after the 2020 election.The company is also defending a separate pending lawsuit from Smartmatic, another election technology company that says it was defamed, in a New York court. Fox News has denied the allegations in Smartmatic's case, which remains ongoing.The First Amendment makes it difficult for public figures, like Newsom, to succeed in defamation lawsuits. They must prove in court that the defendant acted with \"actual malice,\" meaning the company or person knew they were lying or recklessly disregarded the truth.In a demand letter to Fox News, Newsom's lawyers said he would voluntarily dismiss the lawsuit if the outlet \"retracts the claim that he lied when speaking about President Trump not calling him on June 9,\" and Watters issues an on-air apology.\"If Fox News wants to lie to the American people on Donald Trump's behalf, it should face consequences — just like it did in the Dominion case,\" Newsom said in a statement. \"I believe the American people should be able to trust the information they receive from a major news outlet. Until Fox is willing to be truthful, I will keep fighting against their propaganda machine.\"Trump himself has sued numerous media outlets, many having been dismissed. Disney settled a lawsuit with him earlier this year, and he is in ongoing settlement discussions with Paramount over a \"60 Minutes\" episode on CBS News that he says misleadingly edited an interview with Kamala Harris.Trump sued CBS in Texas, alleging it violated the state's consumer protection laws by editing an interview with Kamala Harris in a way he says is misleading.Newsom sued Fox on Friday under a similar California law. He said Fox \"intentionally misled the public by purposefully broadcasting a deceptively edited video.\"\"As President Trump has stated in his own complaint, 'News organizations…are responsible for accurately reporting the truth of events, not distorting an interview to try and falsely make their preferred candidate appear coherent and decisive,'\" Newsom's lawsuit says, quoting from Trump's.","summary":"The California governor's lawsuit against Fox News cites its settlement with Dominion, as well as Donald Trump's case against CBS.","url":"https://www.businessinsider.com/gavin-newsom-lawsuit-fox-news-cites-dominion-trump-2025-6","image":"https://i.insider.com/685ebadaf748d8c055f484ad?width=1200&format=jpeg","video":null,"publish_date":"2025-06-27 16:51:55","author":"Bryan Metzger,Jacob Shamsian","authors":["Bryan Metzger","Jacob Shamsian"],"language":"en","source_country":"US","sentiment":-0.646},{"id":335921052,"title":"Former Minnesota House Speaker Melissa Hortman to lie in state as suspect faces court date","text":"By STEVE KARNOWSKI\n\nMINNEAPOLIS (AP) — Former Minnesota House Speaker Melissa Hortman will lie in state in the Minnesota Capitol rotunda on Friday while the man charged with killing her and her husband, and wounding a state senator and his wife, is due in court.\n\nHortman, a Democrat, will be the first woman and one of fewer than 20 Minnesotans accorded the honor. She will lie in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized.\n\nThe public can pay their respects from noon to 5 p.m. Friday. House TV will livestream the viewing. A private funeral is set for 10:30 a.m. Saturday. The service will be livestreamed on the Department of Public Safety’s YouTube channel.\n\nFormer Vice President Kamala Harris will fly to Minnesota for the funeral but won’t have a speaking role, according to her personal office. Harris expressed her condolences this past week to Hortman’s adult children, and spoke with Gov. Tim Walz, her 2024 running mate, who extended an invitation on behalf of the Hortman family, her office said.\n\nThe criminal case proceeds\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges for what the chief federal prosecutor for Minnesota has called “a political assassination.” Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nThe hearing, before Magistrate Judge Douglas Micko, is expected to address whether Boelter should remain in custody without bail and affirm that there is probable cause to proceed. He is not expected to enter a plea. Prosecutors need to secure a grand jury indictment before he’s arraigned later, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans’ home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers’ homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. The acting U.S. attorney for Minnesota, Joseph Thompson, said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn’t been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nOther victims and alleged targets\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nBoelter’s wife speaks out\n\nBoelter’s wife, Jenny, issued a statement through her own lawyers Thursday saying she and her children are “absolutely shocked, heartbroken and completely blindsided,” and expressing sympathy for the Hortman and Hoffman families. She is not in custody and has not been charged.\n\n“This violence does not align at all with our beliefs as a family,” her statement said. “It is a betrayal of everything we hold true as tenets of our Christian faith. We are appalled and horrified by what occurred and our hearts are incredibly heavy for the victims of this unfathomable tragedy.”\n\nAn FBI agent’s affidavit described the Boelters as “preppers,” people who prepare for major or catastrophic incidents. Investigators seized 48 guns from his home, according to search warrant documents.\n\nWhile the FBI agent’s affidavit said law enforcement stopped Boelter’s wife as she traveled with her four children north of the Twin Cities in Onamia on the day of the shootings, she said in her statement that she was not pulled over. She said that after she got a call from authorities, she immediately drove to meet them at a nearby gas station and has fully cooperated with investigators.\n\n“We thank law enforcement for apprehending Vance and protecting others from further harm,” she said.","summary":"Hortman is the first woman and one of fewer than 20 Minnesotans accorded the honor.","url":"https://www.ocregister.com/2025/06/27/minnesota-melissa-hortman-lie-in-state/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Minnesota_Lawmaker_Shot_98972_438437-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-06-27 16:39:17","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":0.025},{"id":335933546,"title":"Former Minnesota House Speaker Melissa Hortman to lie in state as suspect faces court date","text":"By STEVE KARNOWSKI\n\nMINNEAPOLIS (AP) — Former Minnesota House Speaker Melissa Hortman will lie in state in the Minnesota Capitol rotunda on Friday while the man charged with killing her and her husband, and wounding a state senator and his wife, is due in court.\n\nHortman, a Democrat, will be the first woman and one of fewer than 20 Minnesotans accorded the honor. She will lie in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized.\n\nThe public can pay their respects from noon to 5 p.m. Friday. House TV will livestream the viewing. A private funeral is set for 10:30 a.m. Saturday. The service will be livestreamed on the Department of Public Safety’s YouTube channel.\n\nFormer Vice President Kamala Harris will fly to Minnesota for the funeral but won’t have a speaking role, according to her personal office. Harris expressed her condolences this past week to Hortman’s adult children, and spoke with Gov. Tim Walz, her 2024 running mate, who extended an invitation on behalf of the Hortman family, her office said.\n\nThe criminal case proceeds\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges for what the chief federal prosecutor for Minnesota has called “a political assassination.” Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nThe hearing, before Magistrate Judge Douglas Micko, is expected to address whether Boelter should remain in custody without bail and affirm that there is probable cause to proceed. He is not expected to enter a plea. Prosecutors need to secure a grand jury indictment before he’s arraigned later, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans’ home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers’ homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. The acting U.S. attorney for Minnesota, Joseph Thompson, said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn’t been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nOther victims and alleged targets\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nBoelter’s wife speaks out\n\nBoelter’s wife, Jenny, issued a statement through her own lawyers Thursday saying she and her children are “absolutely shocked, heartbroken and completely blindsided,” and expressing sympathy for the Hortman and Hoffman families. She is not in custody and has not been charged.\n\n“This violence does not align at all with our beliefs as a family,” her statement said. “It is a betrayal of everything we hold true as tenets of our Christian faith. We are appalled and horrified by what occurred and our hearts are incredibly heavy for the victims of this unfathomable tragedy.”\n\nAn FBI agent’s affidavit described the Boelters as “preppers,” people who prepare for major or catastrophic incidents. Investigators seized 48 guns from his home, according to search warrant documents.\n\nWhile the FBI agent’s affidavit said law enforcement stopped Boelter’s wife as she traveled with her four children north of the Twin Cities in Onamia on the day of the shootings, she said in her statement that she was not pulled over. She said that after she got a call from authorities, she immediately drove to meet them at a nearby gas station and has fully cooperated with investigators.\n\n“We thank law enforcement for apprehending Vance and protecting others from further harm,” she said.","summary":"Hortman is the first woman and one of fewer than 20 Minnesotans accorded the honor.","url":"https://www.sandiegouniontribune.com/2025/06/27/minnesota-melissa-hortman-lie-in-state/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Minnesota_Lawmaker_Shot_98972_438437-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-06-27 16:39:17","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":0.025},{"id":335917142,"title":"Former Minnesota House Speaker Melissa Hortman to lie in state as suspect faces court date","text":"By STEVE KARNOWSKI\n\nMINNEAPOLIS (AP) — Former Minnesota House Speaker Melissa Hortman will lie in state in the Minnesota Capitol rotunda on Friday while the man charged with killing her and her husband, and wounding a state senator and his wife, is due in court.\n\nHortman, a Democrat, will be the first woman and one of fewer than 20 Minnesotans accorded the honor. She will lie in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized.\n\nThe public can pay their respects from noon to 5 p.m. Friday. House TV will livestream the viewing. A private funeral is set for 10:30 a.m. Saturday. The service will be livestreamed on the Department of Public Safety’s YouTube channel.\n\nFormer Vice President Kamala Harris will fly to Minnesota for the funeral but won’t have a speaking role, according to her personal office. Harris expressed her condolences this past week to Hortman’s adult children, and spoke with Gov. Tim Walz, her 2024 running mate, who extended an invitation on behalf of the Hortman family, her office said.\n\nThe criminal case proceeds\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges for what the chief federal prosecutor for Minnesota has called “a political assassination.” Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nThe hearing, before Magistrate Judge Douglas Micko, is expected to address whether Boelter should remain in custody without bail and affirm that there is probable cause to proceed. He is not expected to enter a plea. Prosecutors need to secure a grand jury indictment before he’s arraigned later, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans’ home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers’ homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. The acting U.S. attorney for Minnesota, Joseph Thompson, said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn’t been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nOther victims and alleged targets\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nBoelter’s wife speaks out\n\nBoelter’s wife, Jenny, issued a statement through her own lawyers Thursday saying she and her children are “absolutely shocked, heartbroken and completely blindsided,” and expressing sympathy for the Hortman and Hoffman families. She is not in custody and has not been charged.\n\n“This violence does not align at all with our beliefs as a family,” her statement said. “It is a betrayal of everything we hold true as tenets of our Christian faith. We are appalled and horrified by what occurred and our hearts are incredibly heavy for the victims of this unfathomable tragedy.”\n\nAn FBI agent’s affidavit described the Boelters as “preppers,” people who prepare for major or catastrophic incidents. Investigators seized 48 guns from his home, according to search warrant documents.\n\nWhile the FBI agent’s affidavit said law enforcement stopped Boelter’s wife as she traveled with her four children north of the Twin Cities in Onamia on the day of the shootings, she said in her statement that she was not pulled over. She said that after she got a call from authorities, she immediately drove to meet them at a nearby gas station and has fully cooperated with investigators.\n\n“We thank law enforcement for apprehending Vance and protecting others from further harm,” she said.","summary":"Hortman is the first woman and one of fewer than 20 Minnesotans accorded the honor.","url":"https://www.bostonherald.com/2025/06/27/minnesota-melissa-hortman-lie-in-state/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Minnesota_Lawmaker_Shot_98972_438437-1.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-27 16:39:17","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.025},{"id":335911000,"title":"The A-list wedding of the year begins! Billionaire Jeff Bezos and Lauren Sanchez prepare to exchange vows as they are joined by star-studded guest list at lavish $20million celebration in Venice","text":"The most lavish celebrity wedding for a generation has begun with stars arriving to see Lauren Sanchez marry Jeff Bezos at a ceremony and reception set to cost the Amazon billionaire upwards of $20million.\n\nRoyals, statesmen and Hollywood glitterati have gathered together in Venice for the Bezos-Sanchez nuptials as one of the world's great cities of love plays host to an event like no other.\n\nLauren looked stunning as she was whisked by speedboat to San Giorgio Maggiore, which overlooks a Venice lagoon, to walk down the aisle in front of 200 VIP guests.\n\nShe wore a classic white suit and headscarf to land on the island where she changed into her handmade, one of a kind Dolce & Gabbana gown.\n\nAmid local protests, the globe's richest and most powerful people have descended on La Serenissima, the Most Serene Republic of Venice, to pay homage to the Amazon billionaire and his blushing 55-year-old bride.\n\nBezos and Sanchez will now say their vows in the restored amphitheatre on the island while Matteo Bocelli, the son of tenor Andrea, sings.\n\nAlthough one slight wrinkle is that impeccable sources revealed to the Mail's Alison Boshoff last night that the Amazon founder and journalist-turned-philanthropist Lauren Sanchez are already married with a pre-nuptial agreement to protect his $244billion (£177billion) fortune signed and sealed.\n\nBut whether they knew already or not, the world's most rich and powerful were not going to miss the nuptials of a lifetime.\n\nAfter the couple walk down the aisle, a budget of 1,000 Euros a head has been set for the wedding breakfast and according to local reports it will include the local Venetian delicacy of cuttlefish stew washed down with fine wines.\n\nIt is thought that singer-songwriter Usher, who also arrived yesterday, may be performing. Reports that Sir Elton John and Lady Gaga will sing have been denied by representatives for both. \n\nBut the aspirational couple's wedding celebrations, pencilled in to last three days with the wedding ceremony ongoing and 'grand ball' on Saturday night, have already been branded 'more Vegas than Versailles'.\n\nFive of the city's most luxurious hotels have been booked out to host an estimated 250 influential guests. Make up tycoon Kylie Jenner needed a separate water taxi to carry her 25 pieces of monogrammed luggage to her Venetian home for the weekend.\n\nSome of the world's most eligible bachelors are in Venice for the wedding – Orlando Bloom, freshly split from fiancée Katy Perry.\n\nDivorced sporting superstar Tom Brady, and divorced talent agent and billionaire music executive Scooter Braun, were on a lads' night out with him.\n\nFormer US President Barack Obama is among guests – he and Bezos have been on warm terms for years, and Bezos donated $100million (£72million) to the Obama Foundation in 2021.\n\nThe event has also attracted a near-quorum of Kardashians. \n\nMatriarch Kris Jenner is close friends with Lauren Sanchez, while daughters Kim and Khloe were also in attendance. \n\nKylie Jenner, her daughter by Olympic athlete Caitlin, arrived at the Gritti Palace hotel on Thursday afternoon.\n\nOthers at today's ceremony include former chat show host Oprah Winfrey and her best friend, TV presenter and author Gayle King, who went on the much-mocked space 'flight' on Bezos Blue Origin rocket last month with Sanchez and an all-female team.\n\nDonald Trump's daughter Ivanka is there along with husband Jared Kushner, but the President himself – reportedly invited – will not come to Venice.\n\nBoth Bezos and Sanchez were there for Trump's inauguration earlier this year and Bezos attracted much criticism when his Washington Post newspaper declined to endorse Democratic candidate Kamala Harris in the US election last year.\n\nQueen Rania of Jordan has also been seen, as have fashion duo Domenico Dolce and Stefano Gabbana.\n\nProtests by disgruntled locals continue, and are planned for during the ceremony and throughout the wedding celebrations.\n\nSources says that Mayor Luigi Brugnaro has assured the couple that he can guarantee their safety in the middle of the city.\n\nThe Bezos wedding began on Thursday with the first of three days of parties in Venice.\n\nA source closely connected to the organisation of the week's events said: 'They have been married for at least a month, more than a month.\n\n'The marriage is fully legal and took place in America under American law.'\n\nThe source adds: 'When they were planning the wedding, they were clear about the fact that they were already secretly married.\n\n'There is no application for a wedding licence from the couple because it was not required.\n\n'Whatever happens at the wedding on Friday, it will not be a wedding. Under Italian law, it will not be a wedding celebration, any vows said or rings exchanged will have no legal meaning.'\n\nThe source added that Bezos had personally confirmed that he and Sanchez – who met when both were married to other people – are already legally married, and that they had also signed a pre-nuptial agreement to protect his $244 billion (£177 billion) fortune. \n\nAs the eyes of the world focused on the event, staff at the privately owned Madonna dell Orto cloisters - where the couple held their 'eve of' reception on Thursday night with finger food and pizza - erected tents to stop overflying drones from picturing the guests. \n\nIt's thought that the event included speeches from the bride to the groom and vice versa. \n\nPolicemen on jetskis meanwhile patrolled the entrance to the nearest canal.\n\nThe two three star hotels neighbouring the cloister were booked up to house the 150 staff who are working on the wedding. \n\nThe guests are staying rather more comfortably at the five star Aman, The Gritti Palace and the Cipriani.\n\nThe build-up has not gone smoothly, however. Plans were ripped up and remade over the past week as the bride and groom reeled from public hostility to their descent on Venice, and responded to global political turbulence following US airstrikes in Iran.\n\nThey have now left their $500 million (£363 million) yacht, the Koru, off the coast of Croatia, although it was initially intended to be moored in Venice.\n\nThe venues for the various celebrations have changed, too, with plans for Saturday's party now moved to Arsenale, the shipbuilding yards, which are easier to make secure. \n\n'The feeling was that the protests started to die down on Monday, so this was possible,' said one.\n\nForty people were held by police after Extinction Rebellion held a small protest in St Mark's Square on Thursday morning.\n\nOn Thursday lunchtime, the couple and a few of their guests enjoyed a private lunch in the gardens of the Villa Baslini on the tiny island of San Giovanni Evangelista.\n\nThe island offers perfect privacy and the couple were able to totally evade the army of paparazzo who have descended on Venice.\n\nMeanwhile preparations also continued at the Arsenale – in warehouse 91 to be specific - which was the last-minute switch of venue for Saturday night's grand ball, from Scuola della Misericordia, after protesters said they would dive into the bordering canal.\n\nOne staff member said: 'I can tell you that [warehouse 91 is] a beautiful location. All the tables have a wonderful flower display, and they are putting up large chandeliers in the ceiling – it's going to have a Venetian masked ball theme is what I have heard but we've been told no photos, and we have to leave our phones with security.'\n\nThe celebrations began on Wednesday evening with a drinks reception in the ballroom of the stunning 16th century Aman hotel, in one of Venice's most venerable palazzos, which overlooks the Grand Canal.\n\nThen the wedding guests including Bezos and Sanchez made their way to a private dinner party at the Palazzo Brandolini, hosted by Diane von Furstenberg.\n\nThe designer, 77, is close to the bride and groom to be, with her husband, the mogul Barry Diller, serving as a mentor and inspiration to Jeff Bezos for the past decade. Diller said in an interview that Bezos is a 'very dear, very loving friend' and has also been vocal in his admiration for Sanchez, a former local TV anchor and helicopter pilot.\n\nThe party was in Diane's Venetian home, which occupies the second floor of the spectacular 15th century palazzo, filled with mirrors, gilding and frescoes. The magazine Architectural Digest visited last year and described it as 'stupendous' – and they are not easily impressed.","summary":"Royals, statesmen and celebrities have gathered together in Venice for the Bezos-Sanchez nuptials as one of the world's great cities of love plays host to an event like no other.","url":"https://www.dailymail.co.uk/news/article-14852877/Jeff-Bezos-Lauren-Sanchez-wedding-Venice-celebrities.html","image":"https://i.dailymail.co.uk/1s/2025/06/27/17/99795837-0-image-a-75_1751040580737.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/27/8844778505344892557/1024x576_MP4_8844778505344892557.mp4","publish_date":"2025-06-27 16:28:49","author":"Editor,Martin Robinson","authors":["Editor","Martin Robinson"],"language":"en","source_country":"gb","sentiment":0.758},{"id":335904088,"title":"Can Zohran Mamdani’s win help the beleaguered Democratic Party find a new roadmap?","text":"Shortly after midnight on June 25, New York mayoral candidate Zohran Mamdani appeared before his supporters at a rooftop brewery to greet the crowd of supporters chanting his name.\n\nHis main rival for the Democratic Party nomination, Andrew Cuomo, had just conceded defeat on television and the mood was delirious. Said Mamdani, quoting Nelson Mandela, “It always seems impossible until it is done.”\n\nHours later, as the magnitude of his upset became clear, the 33-year-old Mamdani found himself fielding questions about what his victory might mean for the floundering Democratic Party in the United States.\n\nSince losing to Donald Trump in November’s presidential election, the Democratic Party has faced intense criticism from its own supporters who believe their leaders have been too passive in opposing Trump’s agenda and failed to present voters with compelling alternatives.\n\nThe party hit historic lows in public approval in April, with merely a quarter of voters holding positive views about the Democrats – the worst showing since tracking began in 1990.\n\nMamdani’s win has given the party cause to cheer – and perhaps a new roadmap. The result is a “larger referendum about where our party goes”, Mamdani told MSNBC, contending that the Democrats must “move our political instinct from lecturing to listening”.\n\nThe victory for Mamdani in Tuesday’s Democratic primary makes him the party’s nominee for New York mayor in November’s general election. A self-avowed democratic socialist, his campaign has advocated policies such as free public transit and rent freezes. He defeated Cuomo – a former state governor with strong establishment backing – despite starting the race with little name recognition.\n\nFor the Democratic Party, it may be difficult to seek definitive pointers from the primary election in one city – particularly when that city is overwhelmingly Democratic and the establishment candidate was as flawed as Cuomo, who previously resigned over sexual harassment allegations.\n\nYet Mamdani’s success provides evidence that the brand of democratic socialism advanced by his wing of the party can attract diverse voters. He received endorsements from Bernie Sanders and Alexandria Ocasio-Cortez, two other prominent politicians who describe themselves as democratic socialists.\n\nMamdani seems to have been buoyed by the frustration many feel with the old Democratic machine and strategies. His campaign managed to mobilise voters who had previously stayed away from mayoral elections in New York.\n\nNearly a quarter of early voters were casting ballots in a Democratic primary for the first time since 2012 – a jump from 2021, when only 3% were new to Democratic primaries.\n\n“Mamdani’s focus on concrete economic issues such as free buses, rent freezes, and universal childcare clearly resonated with a wide range of voters,” said Na’ilah Amaru, a policy advocate who works with Democratic politicians. “Campaigns that rely too heavily on past voting patterns miss entire groups of emerging voters who are ready to engage when offered something real.”\n\nMamdani’s campaign released a statement to journalists on Thursday that he had won working-class neighborhoods that Mayor Eric Adams had carried in 2021, and captured areas that swung toward Trump in 2024.\n\nThe campaign’s scale was also unprecedented for a municipal race, deploying over 50,000 volunteers who knocked on 1.5 million doors –in a city with 4.7 million Democrat voters and a population of 8 million.\n\nMamdani also benefitted from New York City’s public financing system, which is designed to level the playing field and reduce the influence of wealthy donors. Under this system, for every dollar up to $250 that a city resident contributes to a campaign, the city government adds another $8 from public funds.\n\nIn March, Mamdani became the first candidate in the election to reach the $8 million spending cap for the primary. He did so with donations from a far more diverse sources than Cuomo: while Cuomo’s campaign had 5,730 donors giving an average of $700 each, Mamdani was backed by 20,720 donors averaging $82.\n\nAnother source of disappointment among the Democratic base that Mamdani tapped into was the party’s messaging around the violence in Palestine. Many voters have criticised Democratic leaders, including presidential candidate Kamala Harris, for remaining largely silent as tens of thousands of Palestinians were killed.\n\nMamdani is a rare US politician who has openly declared his support for Palestine, even as he runs to be mayor of a city in which estimated 11.6% of the population is Jewish.\n\nRaza G, who worked with a South Asian collective canvassing voters for Mamdani’s campaign, contended that the results demonstrated “a breakdown of the centre” in Democratic party politics.\n\n“The election was between a candidate who was pro-Palestine and another who was backed by pro-Israel groups,” he said. “Voters saw that in the silence of Kamala Harris, the Democratic Party did not have a plan to address the question of Palestine and at the same time saw in Mamdani someone who has consistently spoken up about Palestinian rights.’\n\nRaza added that unlike Harris, Mamdani did not disengage from voters who disagreed with him. “People may have moved to the right but Mamdani understood that these people wanted an end to the violence and wanted inflation to reduce,” he said.\n\nWhile Mamdani worked to mobilise the South Asian and Muslim communities that had a historically low turnout in mayoral elections, his campaign also made an effort to engage with Jewish voters.\n\nDaniel Aldana Cohen, an assistant professor of sociology at UC Berkeley, suggested that Mamdani’s campaign could be used across the US.\n\n“When Mamdani talks about the cost of living, he’s talking about solutions,” Cohen said. “He’s emphasising tangible benefits for ordinary people while keeping economic issues front and centre – but not at the exclusion of everything else like opposing bigotry…This is certainly a national model.”","summary":"His success provides evidence that the brand of democratic socialism advanced by his wing of the party can attract diverse voters.","url":"https://scroll.in/article/1083968/can-zohran-mamdanis-win-help-the-beleaguered-democratic-party-find-a-new-roadmap","image":"https://sc0.blr1.cdn.digitaloceanspaces.com/article/208049-vpiajcjolz-1751034599.jpg","video":null,"publish_date":"2025-06-27 16:00:00","author":"Prajwal Bhat","authors":["Prajwal Bhat"],"language":"en","category":"politics","source_country":"IN","sentiment":-0.179},{"id":335909318,"title":"New 2028 Democratic Front-Runner Surges Ahead of Kamala Harris—Poll","text":"Former Transportation Secretary Pete Buttigieg surged past former Vice President Kamala Harris in a new poll of the potential 2028 Democratic presidential primary field released on Friday.Newsweek reached out to Buttigieg and Harris' teams for comment via email and press contact form.Why It MattersThe 2028 presidential primary is still about three years away, but pollsters are already asking voters about which potential candidates they are leaning toward supporting. A new Emerson College poll reveals how Democrats view high-profile candidates like Buttigieg and Harris as they may be considering whether to jump into the race.Meanwhile, Democrats remain divided about the best direction to move in following losses in the 2024 elections. Some Democrats believe a more progressive candidate like Representative Alexandria Ocasio-Cortez would reenergize the base, but others believe a more moderate Democrat, such as Buttigieg, would help the party win back ground among independents.What to KnowThe Emerson poll found that Buttigieg is candidate most favored by Democrats at this point, though nearly a quarter of respondents said they are undecided about who they would support in 2028.Sixteen percent said they would cast their ballot for Buttigieg in the primary, compared to 13 percent who said they plan to support Harris. This is a contrast from Emerson's November 2024 poll, when 37 percent said they leaned toward Harris and only 4 percent planned to back Buttigieg in the weeks after the election.California Governor Gavin Newsom, whose polling numbers also increased after his handling of protests in Los Angeles, placed third with 12 percent, while Ocasio-Cortez and Pennsylvania Governor Josh Shapiro each received 7 percent support.Senator Bernie Sanders, a Vermont independent, was the preferred candidate of 5 percent of voters. New Jersey Senator Cory Booker and Michigan Governor Gretchen Whitmer each received 3 percent support.Twenty-three percent of respondents said they were undecided.The poll surveyed 1,000 registered voters from June 24 to June 25 and had a margin of error of plus or minus 3 percentage points.No major candidates have made a formal entrance into the 2028 primary so far. Harris has also been floated as a candidate for California governor, and polls suggest she would be a major front-runner in that race if she chooses to run.A Morning Consult poll released last week showed Harris maintaining a stronger lead, with 34 percent saying they planned to support her. Seven percent said they would vote for Buttigieg, while 11 percent said they leaned toward Newsom.That poll surveyed 1,000 Democrats and Democratic-leaning independents from June 13 to June 15.A McLaughlin poll from May showed that 29 percent of Democrats planned to back Harris, 10 percent leaned toward Buttigieg and 9 percent were supporting Ocasio-Cortez. That poll surveyed 1,000 voters from May 21 to May 26, 2025.What People Are SayingHarris, speaking about her plans earlier this year while visiting Los Angeles-area sites impacted by wildfires: \"My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them...I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground.\"Former Transportation Secretary Pete Buttigieg said in Cedar Rapids, Iowa, in May: \"Democrats do not have the best brand around here or in a lot of places. There's a lot of reasons for that. Some fair, and some not fair.\"What Happens NextTypically, most candidates do not begin announcing presidential runs until after the midterm elections. Harris said during a pre-Oscars party earlier this year she plans to make a decision about whether to run for governor by the end of the summer.","summary":"Harris' support among Democrats dropped from November in the latest Emerson College poll on the potential 2028 primary field.","url":"https://www.newsweek.com/pete-buttigieg-surges-ahead-kamala-harris-2028-primary-poll-2091665","image":"https://d.newsweek.com/en/full/2672806/vice-president-kamala-harris-2028-poll.jpg","video":null,"publish_date":"2025-06-27 15:59:49","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":0.038},{"id":335928640,"title":"Comedian Andrew Schulz Accuses Kamala Harris of Lying About Podcast Invite, Called Him 'Sexist and Racist'","text":"Comedian Andrew Schulz is claiming that Kamala Harris and her team “blatantly lied” when they claimed he did not reach out to them to get Harris on his podcast, and added that they told him they weren’t interested in his show because he is “sexist, bigoted and racist.”\n\nSchulz, who said he voted for Trump in 2024 — not because he likes Trump, but because he was opposing the Democrat agenda — says that he and his team absolutely did reach out to Harris to get the Democrat nominee on his popular “Flagrant” podcast. He also says he tried to get Minnesota Democrat Governor Tim Walz and Biden Transportation Secretary Pete Buttigieg to appear, as well. He was rebuffed by them all, he says.\n\nHe revealed all this on a recent New York Times “The Interview” podcast.\n\nHe added that he was told by operatives for Harris that his offer was rejected because he is a “podcast bro,” and that he is “sexist, bigoted and racist.”\n\n“It’s wild to blatantly lie when not only did I reach out — Charlamagne, who’s working with them, reached out. Mark Cuban, who’s a surrogate, reached out, and we reached out, and they blatantly lie,” Schulz told the Times.\n\n“Then when people write articles about it, they’ll say, ‘Andrew says he reached out to Kamala, but we reached out to the Kamala people, and they said that never happened.’ So what is the reader supposed to interpret that as?” he continued.\n\n“I think it’s an indictment on me, because it’s almost like calling me a liar,” he added.\n\nSchulz also explained that he considers himself a life-long Democrat, but that he voted for Trump because the Democrat Party has gone off the rails.\n\n“I voted against a Democratic institution that I feel was stripping the democratic process from its constituents. I didn’t like the way things were going, and Kamala was saying, Yeah, we’re going to keep doing that,” he said.\n\nHarris was made the Democrat nominee by the Democrat National Committee despite never having won or even competed in any Democrat primary. Many Democrats felt that the party anointed Harris from on high after Joe Biden announced that he was not going to run for a second term and that the DNC did an end run around the democratic process.\n\nThe 2024 election cycle was not the first time Democrat powerbrokers were accused of rigging the party’s selection process. Supporters of Bernie Sanders also accused the Democrats of rigging the system to push Hillary Clinton into the party’s nomination in 2016.\n\nFollow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, X at WTHuston, or Truth Social at @WarnerToddHuston.","summary":"Comedian Andrew Schulz is claiming that Kamala Harris and her team \"blatantly lied\" when they claimed he did not reach out to them to get Harris on his podcast, and added that they told him they weren't interested in his show because he is \"sexist, bigoted, and racist.\"\n\n\nThe post Comedian Andrew Schulz Accuses Kamala Harris of Lying About Podcast Invite, Called Him &#8216;Sexist and Racist&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/06/27/comedian-andrew-schulz-accuses-kamala-harris-of-lying-about-podcast-invite-called-him-sexist-and-racist/","image":"https://media.breitbart.com/media/2025/06/AndrewSchulz-640x335.jpg","video":null,"publish_date":"2025-06-27 15:49:38","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","source_country":"US","sentiment":-0.423},{"id":335893534,"title":"JD Vance is Crushing the 2028 Election Competition Right Now: Survey","text":"Vice President J.D. Vance is by a significant margin the most popular potential 2028 Republican presidential candidate among GOP primary voters, according to a new survey conducted by Emerson College Polling.\nBut one expert told Newsweek, \"...his fate is tied to the success of Trump's second term, and if that fails to deliver, JD's star will wane.\"Newsweek contacted the office of Vice President Vance for comment on Friday via email outside of regular office hours.Why It MattersWhilst he's occasionally toyed with running for a third term, President Trump is constitutionally limited to two terms in the White House, meaning the Republican Party will need a new candidate for the 2028 presidential election.Over the past decade, Trump has redefined the Republican Party, moving it to more nativist, protectionist, and anti-immigration positions, and the 2028 GOP presidential primary could see a contest between those who want it to continue with this direction and their rivals.What To KnowEmerson College Polling surveyed 416 likely Republican primary voters about their preferred 2028 presidential candidate between June 24 and 25, with the data having a plus or minus 4.8 percentage point margin of error.The poll found that Vance had a strong lead, with 46 percent saying he was their preferred candidate, ahead of Secretary of State Marco Rubio at 12 percent and Florida Governor Ron DeSantis at 9 percent.They were followed by Health Secretary Robert F. Kennedy Jr. at 5 percent and Homeland Security Secretary Kristi Noem and former South Carolina Governor Nikki Haley each at 2 percent.Director of National Intelligence Tulsi Gabbard, business tycoon Vivek Ramaswamy and Virginia Governor Glenn Youngkin all had 1 percent support. Another 17 percent of those polled said they were \"undecided.\"Vance shared Trump's more nationalistic view of what the Republican Party should be, but also has close ties to figures on the tech right, including billionaire businessman Peter Thiel.Emerson College Polling also surveyed 404 likely Democratic primary voters over the same period, which produced a much tighter result.When asked about their preferred 2028 Democratic presidential candidate, 16 percent chose former transportation secretary Pete Buttigieg, 13 percent supported a second run by Kamala Harris, and 12 percent endorsed California Governor Gavin Newsom.Representative Alexandria Ocasio-Cortez and Pennsylvania Governor Tim Waltz came in joint fourth with 7 percent support each, followed by left-wing Senate veteran Bernie Sanders at 5 percent.Recently, Newsom challenged Vance to a debate after the vice president accused him of \"egging on\" violent disorder in Los Angeles during anti-immigration enforcement demonstrations.Overall, Emerson College Polling surveyed 1,000 U.S. voters, with 42 percent saying they would vote for each of the Democratic and Republican nominees on a generic 2028 presidential ballot, with another 16 percent undecided. On Trump, 45 percent approved of his performance as president, whilst 46 percent disapproved.What People Are SayingSpeaking to Newsweek Mark Shanahan, an expert in American politics who teaches at the University of Surrey in the UK, said: \"It's very early days yet in picking the runners and riders for the 2028 GOP Presidential Primary and at the moment, it's hard for anyone to see past the vast shadow cast by the incumbent. It's no surprise that Vance is leading the field. He has high visibility and name recognition.\"However, his fate is tied to the success of Trump's second term, and if that fails to deliver, JD's star will wane. Rubio, DeSantis and RFK Junior are tarnished by failed previous runs for the White House, and realistically, Vance is most likely to face a successful Governor - Youngkin or Abbott perhaps, or a member of Congress who gains momentum from the midterms and can challenge the Vance continuity candidacy.\"Emerson College Polling executive director Spencer Kimball said: \"Vice President Vance has solidified himself as the frontrunner in the 2028 nomination contest, backed by 52% of male Republican primary voters and voters over 60.\"Looking ahead to next year's Midterm Election, the Democrats have a slight edge over the Republicans, with independents breaking for the Democratic candidate 37% to 27%. However, a significant 36% of independents are undecided, so this number is expected to shift.\"What Happens NextVance has not announced that he is running in the 2028 Republican presidential primary contest, nor would he be expected to do so until much nearer the time. The first GOP presidential primary elections are expected to be held in early 2028.","summary":"President Trump is currently constitutionally ineligible to run for a third White House term.","url":"https://www.newsweek.com/jd-vance-crushing-2028-election-competition-right-now-2091689","image":"https://d.newsweek.com/en/full/2672868/jd-vance.jpg","video":null,"publish_date":"2025-06-27 15:30:57","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.129},{"id":335926180,"title":"News outlets tell Trump to pound sand over his latest lawsuit threats","text":"The New York Times and CNN both immediately shut down President Donald Trump’s attempt on Thursday to intimidate them over their reporting on his strike against Iran.\n\nAn early assessment from the Department of Defense’s Defense Intelligence Agency has indicated that the Iran strikes have not completely destroyed Iran’s nuclear program, as Trump has repeatedly claimed. CNN and The New York Times, along with other news outlets—even Fox News—have reported on the issue.\n\nTrump threatened to sue the Times and CNN for reporting the news on this issue. His personal lawyer sent a letter demanding that the media “retract and apologize for” their reporting. The letter also argued that accurately reporting on the agency’s findings was “false,” “defamatory,” and “unpatriotic.”\n\nThe letter, however, failed to get the result Trump wanted.\n\nA spokesperson for CNN told Deadline, “We can confirm we received a letter and responded to it, rejecting the claims in the letter.”\n\nThe Times’ lawyer David McCraw responded to Trump in a letter writing, “No retraction is needed. No apology will be forthcoming.”\n\nMcCraw further noted that the “American public has a right to know whether the attack on Iran—funded by the tax dollars and of enormous consequence to every citizen—was a success.”\n\nAddressing Trump’s threat, the lawyer said it was “irresponsible” for Trump to threaten a libel suit for reporting “that the trained, professional and patriotic intelligence experts employed by the U.S. government thought that the president may have gotten it wrong in his initial remarks to the country.”\n\nSince the strike, both Trump and Secretary of Defense Pete Hegseth have spent days complaining and attacking the media for reporting on this issue and not merely regurgitating the administration’s positive spin.\n\nTrump said news outlets like CNN and MSNBC were “scum” for reporting the story. Hegseth told reporters “it’s in your DNA and your blood to cheer against Trump” in an unhinged rant at the Pentagon on Thursday.\n\nRelated | Hegseth is pissed you might read the news about Trump's Iran bombings\n\nFollowing a Pentagon briefing of senators on the strike on Thursday, the Trump version of events was called further into question.\n\n“There’s no doubt there was damage done to the program. But the allegations that we have obliterated their program just don’t seem to stand up to reason,” Sen. Chris Murphy of Connecticut told reporters.\n\nTrump and his team have a significant credibility problem. Trump has spent decades lying about issues big and small—from his loss in the 2020 election to his net worth.\n\nThe lawsuit threat has become a reliable weapon in his arsenal in response to factual reporting that makes him look bad. He is even suing an Iowa pollster and the Des Moines Register for publishing her findings because her poll showed Trump behind Vice President Kamala Harris in the 2024 election.\n\nOutlets like ABC News have caved to Trump’s threats and Paramount, CBS News’ parent company, is reportedly considering paying off Trump for a frivolous lawsuit so their proposed merger receives federal support.\n\nWhen he isn’t suing the media, Trump has been using his power within the federal government to try and defund news outlets like PBS and NPR that report negative news about him and other Republicans.\n\nThose efforts are being opposed by public media, and in this instance, at least, CNN and the Times aren’t bowing to Trump’s dictatorial demands.","summary":"The New York Times and CNN both immediately shut down President Donald Trump’s attempt on Thursday to intimidate them over their reporting on his strike against Iran.\n\n\n\nAn early assessment from the Department of Defense’s Defense Intelligence Agency has indicated that the Iran strikes have not completely destroyed Iran’s nuclear program, as Trump has repeatedly claimed. CNN and The New York Times, along with other news outlets—even Fox News—have reported on the issue.\n\n\n\nTrump threatened to sue the Times and CNN for reporting the news on this issue. His personal lawyer sent a letter demanding that the media “retract and apologize for” their reporting. The letter also argued that accurately reporting on the agency’s findings was “false,” “defamatory,” and “unpatriotic.”\n\n\n\nThe letter, however, failed to get the result Trump wanted.\n\n\n\n\n\n\n\nA spokesperson for CNN told Deadline, “We can confirm we received a letter and responded to it, rejecting the claims in the letter.”\n\n\n\nThe Times’ lawyer David McCraw respon","url":"https://www.dailykos.com/story/2025/6/27/2330398/-News-outlets-tell-Trump-to-pound-sand-over-his-latest-lawsuit-threats?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1449660/story_image/AP25175391513381.jpg?1750949695","video":null,"publish_date":"2025-06-27 15:30:13","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.618},{"id":335893532,"title":"Susan Collins' Chances of Winning Re-election in Maine, According to Polls","text":"Republican Senator Susan Collins is facing an uphill battle as she prepares to seek a sixth term in 2026, with new polling suggesting she remains deeply unpopular among Maine voters.The poll, conducted by the University of New Hampshire between June 19-23 among 846 voters, also shows that Democratic Governor Janet Mills is considerably more popular than Collins, with speculation mounting that she may challenge Collins in 2026.Newsweek reached out to Collins for comment.Why It MattersWhile Mills has not announced any plans to run for Senate, speculation about a possible challenge is growing, particularly as Collins' approval continues to lag. If the governor were to enter the race, she could present one of the strongest threats yet to Collins' decades-long hold on her Senate seat.What To KnowDespite her long tenure and national profile, only 14 percent of Mainers have a favorable opinion of Collins, compared to 57 percent who view her unfavorably, according to the poll.Another 26 percent are neutral, while 2 percent say they don't know enough about her to say. That gives her a net favorability rating of –42, which is virtually unchanged from June 2022, when her rating stood at –40.Notably, Collins' support appears weak even within her own party. Just 29 percent of Republicans have a favorable opinion of her, along with only 8 percent of independents and a mere 3 percent of Democrats.In contrast, Democratic Governor Janet Mills remains significantly more popular and is increasingly seen as a potential challenger in 2026. Mills holds a net favorability rating of +10, with 51 percent of Mainers viewing her favorably and 41 percent unfavorably. Seven percent are neutral on Mills, and 1 percent say they don't know enough about her.Mills' support is strongest among Democrats, 90 percent of whom view her favorably. However, her popularity is sharply divided along party lines: 91 percent of Republicans and 48 percent of Independents have an unfavorable opinion of her.The poll had a margin of error of +/-3.4 percent.Historically, the party in the White House loses seats in the midterms. Collins is viewed as one of the Democrats' top targets, as former Vice President Kamala Harris carried the state by about seven points last November.Collins has been one of Donald Trump's most frequent critics in the Republican Party. She opposed Defense Secretary Pete Hegseth's nomination, writing that he does not have the \"experience and perspective necessary to succeed in the job.\"In April, Collins joined a resolution to repeal Trump's tariffs on Canadian goods, arguing that the levies would hit Maine families and industries with higher costs for food, gasoline, and heating oil.More recently, during a June 25 Senate Appropriations hearing, Collins pushed back against Trump's plan to rescind $9.4 billion in foreign aid and public broadcasting funds, arguing that the cuts would harm emergency communication and local media. She also raised concerns about the administration's \"Big Beautiful Bill\" to overhaul healthcare and taxes. Collins said she objects to deep Medicaid cuts and advocated for protections for rural hospitals and more modest tax increases on the ultra-wealthy.Collins has not said if she will vote for the bill. However, Governor Mills urged Maine's congressional delegation to reject the budget reconciliation bill, citing \"profoundly harmful consequences\" for Mainers.\"States like Maine do not have the financial resources to absorb cuts of this magnitude,\" Mills wrote to Sens. Susan Collins and Angus King, and Reps. Chellie Pingree and Jared Golden. \"Slashing essential services in this manner will only do the opposite of lowering taxes and fostering economic growth.\"The New Hampshire poll shows that \"Big Beautiful Bill\" is unpopular among Mainers, only 30 percent of whom support its passage. Fifty-eight percent, on the other hand, say they do not want to see it become law.Trump is also increasingly unpopular in the Pine Tree State, according to the poll. Sixty percent of respondents disapproved of him, while 40 percent approved of his job performance. In April, he was viewed positively by 42 percent of Mainers, according to UNH.What Happens NextCollins had not made a formal announcement about her reelection but told CNN in May it is her \"inclination to run\" and that she is \"preparing to do so.\"On the Democratic side, two candidates have declared their intent to run. David Costello, who ran in 2024 and held several different positions in Maryland, including acting secretary of the state's Department of the Environment, is running again. Jordan Wood, who served as chief of staff to former Representative Katie Porter, a California Democrat, is also running.Governor Janet Mills has also not ruled out running, and some Democrats view her as a stronger candidate than those already in the race with deep ties to the state and having already won statewide.","summary":"Republican Senator Susan Collins is facing an uphill battle as she prepares to seek a sixth term in 2026.","url":"https://www.newsweek.com/susan-collins-maine-senate-2026-poll-2091638","image":"https://d.newsweek.com/en/full/2672800/susan-collins.jpg","video":null,"publish_date":"2025-06-27 15:24:45","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","category":"politics","source_country":"US","sentiment":0.061},{"id":335915066,"title":"Former Minnesota House Speaker Melissa Hortman to lie in state as suspect faces court date","text":"Former Minnesota House Speaker Melissa Hortman will lie in state in the Minnesota Capitol rotunda on Friday while the man charged with killing her and her husband, and wounding a state senator and his wife, is due in court.\n\nHortman, a Democrat, will be the first woman and one of fewer than 20 Minnesotans accorded the honor. She will lie in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized.\n\nRelated: Minnesota likely knew nothing of Boelter’s gun arsenal, and that’s the law\n\nThe public can pay their respects from noon to 5 p.m. Friday. House TV will livestream the viewing. A private funeral is set for 10:30 a.m. Saturday. The service will be livestreamed on the Department of Public Safety’s YouTube channel.\n\nFormer Vice President Kamala Harris will fly to Minnesota for the funeral but won’t have a speaking role, according to her personal office. Harris expressed her condolences this past week to Hortman’s adult children, and spoke with Gov. Tim Walz, her 2024 running mate, who extended an invitation on behalf of the Hortman family, her office said.\n\nThe criminal case proceeds\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges for what the chief federal prosecutor for Minnesota has called “a political assassination.” Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nThe hearing, before Magistrate Judge Douglas Micko, is expected to address whether Boelter should remain in custody without bail and affirm that there is probable cause to proceed. He is not expected to enter a plea. Prosecutors need to secure a grand jury indictment before he’s arraigned later, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans’ home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers’ homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. The acting U.S. attorney for Minnesota, Joseph Thompson, said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn’t been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nOther victims and alleged targets\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nBoelter’s wife speaks out\n\nBoelter’s wife, Jenny, issued a statement through her own lawyers Thursday saying she and her children are “absolutely shocked, heartbroken and completely blindsided,” and expressing sympathy for the Hortman and Hoffman families. She is not in custody and has not been charged.\n\n“This violence does not align at all with our beliefs as a family,” her statement said. “It is a betrayal of everything we hold true as tenets of our Christian faith. We are appalled and horrified by what occurred and our hearts are incredibly heavy for the victims of this unfathomable tragedy.”\n\nAn FBI agent’s affidavit described the Boelters as “preppers,” people who prepare for major or catastrophic incidents. Investigators seized 48 guns from his home, according to search warrant documents.\n\nWhile the FBI agent’s affidavit said law enforcement stopped Boelter’s wife as she traveled with her four children north of the Twin Cities in Onamia on the day of the shootings, she said in her statement that she was not pulled over. She said that after she got a call from authorities, she immediately drove to meet them at a nearby gas station and has fully cooperated with investigators.\n\n“We thank law enforcement for apprehending Vance and protecting others from further harm,” she said.","summary":"She will lie in state with her husband, Mark, and their golden retriever, Gilbert.\n\n\nThe post Former Minnesota House Speaker Melissa Hortman to lie in state as suspect faces court date appeared first on MinnPost.","url":"https://www.minnpost.com/news/2025/06/rep-hortman-to-lie-in-state-as-suspect-faces-court-date/","image":"https://www.minnpost.com/wp-content/uploads/2025/06/VMH_035-scaled-e1750350065526.jpg","video":null,"publish_date":"2025-06-27 15:20:09","author":"Associated Press,Kabedi Mutamba,Steve Karnowski","authors":["Associated Press","Kabedi Mutamba","Steve Karnowski"],"language":"en","category":"politics","source_country":"us","sentiment":0.026},{"id":335877420,"title":"‘60 Minutes’ correspondents demand CBS News make Tanya Simon executive producer — or face ‘revolt’: report","text":"Correspondents at “60 Minutes” are pressuring CBS News parent Paramount Global to hand the reins of the iconic show to a longtime insider — or risk a revolt from the tight-knit newsroom, according to a report.\n\nAll seven of the current correspondents at “60 Minutes” — Lesley Stahl, Scott Pelley, Bill Whitaker, Anderson Cooper, Sharyn Alfonsi, Jon Wertheim and Cecilia Vega — signed a letter last month urging Paramount co-CEO George Cheeks to officially name Tanya Simon as the show’s executive producer, the Status newsletter reported on Friday.\n\nSimon — the daughter of late “60 Minutes” correspondent Bill Simon who has been serving as interim executive producer since April — is widely seen by staff as the natural successor to Bill Owens, who resigned this spring over what he described as editorial meddling by the network’s parent company.\n\nWeeks after Owens stepped down in April, the president and CEO of the news division, Wendy McMahon, also announced she was resigning, stating: “It’s become clear that the company and I do not agree on the path forward.”\n\nSimon, whose history with the show runs deep, joined the program in 1999 as an associate producer and has steadily risen through the ranks over the past 26 years, earning the trust and admiration of the veteran reporting team, according to the Status report.\n\n“The next EP has to be Tanya,” one staffer told Status. “There will be a revolt if it’s not her.”\n\nDespite the internal show of solidarity, the correspondents’ appeal reportedly appears to have hit a wall. Weeks after the letter was sent, Cheeks has not responded, and it’s unclear whether CBS News president Tom Cibrowski — who stepped into the role earlier this year — has the authority to make the decision without his boss’s blessing, Status reported.\n\nThat decision may ultimately rest with Shari Redstone, the Paramount chairwoman and controlling shareholder, who has reportedly taken issue with the show’s coverage of the Israel-Gaza conflict and President Donald Trump.\n\nA spokesperson for Paramount Global declined to comment.\n\nTrump has filed a $20 billion lawsuit against CBS News and Paramount Global, alleging the deceptive editing of a “60 Minutes” interview with then-Vice President Kamala Harris misled voters and harmed his media ventures. \n\nCBS has denied wrongdoing, citing First Amendment protections, while settlement talks have included a $20 million mediator proposal and a $15 million offer from Paramount, which Trump rejected. \n\nThe lawsuit — still active in Texas federal court — could complicate Paramount’s pending $8.4 billion merger with Skydance Media.\n\nIn light of these developments, insiders speculated to Status that Redstone may not be eager to promote someone so closely associated with the current editorial team such as Simon to the top post at “60 Minutes.”\n\nMore likely, though, is that the executive suite is simply waiting. \n\nWith Paramount’s merger with David Ellison’s Skydance Media expected to close soon, company leaders may be delaying any major personnel moves until the dust settles — particularly one involving “60 Minutes,” long considered the crown jewel of CBS News.\n\nBut that wait-and-see approach is fueling anxiety inside the program, Status reported. \n\nSome at “60 Minutes” fear that Ellison, who is expected to reshape the news division with his own editorial vision, could look outside the storied broadcast for fresh leadership — bypassing Simon and disregarding the decades of institutional knowledge she represents, according to the report.\n\nEllison has already raised eyebrows by reportedly reaching out to former New York Times editor Bari Weiss, offering a hint of his ideological leanings.\n\nWeiss, who gained notoriety after leaving the Times and launching her own platform, has become a major figure in conservative and anti-establishment media circles.\n\nShe frequently criticizes legacy outlets — including CBS — as captured by a progressive elite. \n\nThat Ellison would consider bringing her into the fold suggests a willingness to challenge institutional norms and possibly reorient CBS News toward a more ideologically diverse, or even right-leaning, editorial direction.\n\nIf he chooses to overhaul “60 Minutes” — or install an executive producer who isn’t trusted by the core team — the fallout could be significant.\n\nVeteran correspondents like Stahl and Pelley are said to be weighing whether to stick around for another season, according to Status.\n\n“If Simon is appointed,” one source said, “they may be persuaded to stay.”\n\nBut if the job goes to an outsider, “their exits would appear far more likely.”\n\nThe Post has sought comment from CBS News, Redstone, Ellison and Weiss.","summary":"All seven of the show’s correspondents reportedly urged Paramount co-CEO George Cheeks to officially name Tanya Simon as executive producer.","url":"https://nypost.com/2025/06/27/media/60-minutes-team-demands-cbs-news-names-tanya-simon-executive-producer/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/107247492.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-27 14:44:42","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","category":"politics","source_country":"us","sentiment":-0.24},{"id":335877798,"title":"'We’d lose everything': Voters in Trump states fear financial devastation from Medicaid cuts","text":"President Donald Trump and many of his loyalists are insisting that the draconian Medicaid cuts in his \"big, beautiful bill\" are strictly designed to combat \"waste, fraud and abuse\" and won't hurt Americans who genuinely need help paying for health care. But according to analysis from the Congressional Budget Office (CBO), roughly 16 million people would lose their health coverage and become uninsured by 2034 if the megabill, in its current form, becomes law. \n\nMedicaid cuts would affect not only blue states, but also, red states that Trump won in 2024 — including Missouri, where he defeated Democratic nominee Kamala Harris by 18 percent.\n\nCNN's Jeff Zeleny, in an article published on June 27, takes a look at Medicaid users in red states who are worried about losing their access to health care. \n\nREAD MORE: 'Cruelty and criminality': Experts say Trump 'incapable of grasping how despised he is'\n\nOne of them is 36-year-old Missouri resident Courtney Leader, who told CNN, \"This is not a luxury. I do not have my daughter enrolled on Medicaid so we can have fancy things. I have my daughter enrolled in Medicaid so we can keep her alive and keep her at home, which I think is the best option for her.\"\n\nLeader sent a letter to Sen. Josh Hawley (R-Missouri), telling the MAGA Republican and Trump ally, \"Without Medicaid, we would lose everything — our home, our vehicles and, eventually, our daughter.\"\n\nIn Missouri, Zeleny notes, \"at least one in five residents depend on Medicaid for health coverage.\"\n\nLeader told CNN, \"I know that they’re saying they're not planning to cut Medicaid, right? But I reached out, concerned that if any changes are made, there will be this trickle-down effect that will impact families like mine.\"\n\nREAD MORE:'He. Is. Lying.' Republican blasted for spinning Medicaid cuts as 'transitioning\n\nLeader described her daughter Cyrina's health problems, telling CNN, \"The formula that is delivered through a tube in her stomach costs more than my mortgage. It costs more than my entire food budget for our family and in that alone, there is no way that we could come up with that $1500 to be able to feed her…. Who's going to protect us when they can’t get paperwork done in time and we lose coverage for a month or two? I'm worried that the red tape is going to affect our Medicaid because of just the oversight burdens and that as a result, I’m going to lose my daughter, because she’s lost coverage before.”\n\nREAD MORE: The truth behind Trump's 'Big Beautiful Bill' — and its impact on Obamacare\n\nRead the full CNN article at this link.","summary":"President Donald Trump and many of his loyalists are insisting that the draconian Medicaid cuts in his \"big, beautiful bill\" are strictly designed to combat \"waste, fraud and abuse\" and won't hurt Americans who genuinely need help paying for health care. But according to analysis from the Congressional Budget Office (CBO), roughly 16 million people would lose their health coverage and become uninsured by 2034 if the megabill, in its current form, becomes law. \n\nMedicaid cuts would affect not only blue states, but also, red states that Trump won in 2024 — including Missouri, where he defeated Democratic nominee Kamala Harris by 18 percent.\n\nCNN's Jeff Zeleny, in an article published on June 27, takes a look at Medicaid users in red states who are worried about losing their access to health care. \n\nREAD MORE: 'Cruelty and criminality': Experts say Trump 'incapable of grasping how despised he is'\n\nOne of them is 36-year-old Missouri resident Courtney Leader, who told CNN, \"This is not a luxury. I do not have my ","url":"https://www.alternet.org/medicaid-trump-missouri-mom-cnn/","image":"https://www.alternet.org/media-library/image.jpg?id=61113773&width=1200&height=600&coordinates=0%2C205%2C0%2C206","video":null,"publish_date":"2025-06-27 14:24:55","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":0.1},{"id":335876322,"title":"Mamdani’s NYC primary win sparks surge in anti-Muslim posts, advocates say","text":"NEW YORK: Anti-Muslim online posts targeting New York City mayoral candidate Zohran Mamdani have surged since his Democratic primary upset this week, including death threats and comments comparing his candidacy to the September 11, 2001 attacks, advocates said on Friday.\n\nThere were at least 127 violent hate-related reports mentioning Mamdani or his campaign in the day after polls closed, said CAIR Action, an arm of the Council on American Islamic Relations advocacy group, which logs such incidents.\n\nThat marks a five-fold increase over a daily average of such reports tracked earlier this month, CAIR Action said in a statement.\n\nOverall, it noted about 6,200 online posts that mentioned some form of Islamophobic slur or hostility in that day long time-frame.\n\nMamdani, a self-described democratic socialist and a 33-year-old state lawmaker, declared victory in Tuesday’s primary after former New York Governor Andrew Cuomo conceded defeat.\n\nBorn in Uganda to Indian parents, Mamdani would be the city’s first Muslim and Indian American mayor if he wins the November general election.\n\n“We call on public officials of every party — including those whose allies are amplifying these smears — to unequivocally condemn Islamophobia,” said Basim Elkarra, executive director of CAIR Action.\n\nThe advocacy group said its hate monitoring system includes its own scraping and analysis of posts, online submissions by the public and notifications from law enforcement. About 62 per cent of the anti-Muslim posts against Mamdani originated on X, CAIR Action said.\n\nPeople close to Republican President Donald Trump, including one of his sons, are among those spreading anti-Muslim rhetoric, advocates said.\n\nDonald Trump Jr, the president’s son, wrote on X on Wednesday that “New York City has fallen” while sharing a post that said New Yorkers had “voted for” 9/11.\n\nAlso on Wednesday, Republican US Representative Marjorie Taylor Greene posted an AI-generated picture of the Statue of Liberty draped in a burqa.\n\nPresident Trump has pursued domestic policies that rights advocates have described as anti-Muslim, including banning travel from some predominantly Muslim or Arab countries in his first term and attempting to deport pro-Palestinian students in his current term.\n\nThe White House, which did not respond to a request for comment, has denied claims of discrimination against Muslims. Trump and his allies have said they oppose Mamdani and others due to what they call the Democrats’ “radical left” ideology.\n\nThe New York City Police Department said earlier this month its hate crime unit was probing anti-Muslim threats against Mamdani.\n\nManjusha Kulkarni, co-founder of Stop AAPI Hate, which documents hate against Asian Americans, and CAIR said attacks against Mamdani mirrored those endured by other South Asian and Muslim political figures, including former Vice President Kamala Harris and Representatives Ilhan Omar and Rashida Tlaib.\n\nRepublicans have called Mamdani antisemitic, citing his pro-Palestinian advocacy and his criticism of Israel’s military assault on Gaza after an attack by Hamas militants in October 2023.\n\nMamdani has condemned antisemitism and has the backing of New York City Comptroller Brad Lander, who is Jewish. Lander also ran in the Democratic primary.\n\nRights advocates have noted rising antisemitism and Islamophobia since the start of the Israel-Gaza war, with fatal US incidents including the shooting of two Israeli embassy staff in Washington and the stabbing of a Muslim child in Illinois.\n\nMamdani and other pro-Palestinian advocates, including some Jewish groups, said their criticism of Israel is wrongly conflated with antisemitism.","summary":"NEW YORK: Anti-Muslim online posts targeting New York City mayoral candidate Zohran Mamdani have surged since his Democratic primary upset this week, including death threats and comments comparing his candidacy to the September 11, 2001 attacks, advocates said on Friday. There were at least 127 violent hate-related reports mentioning Mamdani or his campaign in the day after polls [&#8230;]","url":"https://www.pakistantoday.com.pk/2025/06/27/mamdanis-nyc-primary-win-sparks-surge-in-anti-muslim-posts-advocates-say/","image":"https://www.pakistantoday.com.pk/wp-content/uploads/2025/06/271529437669d3e.png","video":null,"publish_date":"2025-06-27 13:53:27","author":"Agencies","authors":["Agencies"],"language":"en","category":"politics","source_country":"pk","sentiment":0.035},{"id":335922856,"title":"Former Minnesota House Speaker Hortman to lie in state as suspect heads to court","text":"MINNEAPOLIS -- Former Minnesota House Speaker Melissa Hortman will lie in state in the Minnesota Capitol rotunda on Friday while the man charged with killing her and her husband, and wounding a state senator and his wife, is due in court.\n\nHortman, a Democrat, will be the first woman and one of fewer than 20 Minnesotans accorded the honor. She will lie in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized.\n\nThe public can pay their respects from noon to 5 p.m. Friday. House TV will livestream the viewing. A private funeral is set for 10:30 a.m. Saturday. The service will be livestreamed on the Department of Public Safety’s YouTube channel.\n\nFormer Vice President Kamala Harris will fly to Minnesota for the funeral but won’t have a speaking role, according to her personal office. Harris expressed her condolences this past week to Hortman’s adult children, and spoke with Gov. Tim Walz, her 2024 running mate, who extended an invitation on behalf of the Hortman family, her office said.\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges for what the chief federal prosecutor for Minnesota has called “a political assassination.” Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nThe hearing, before Magistrate Judge Douglas Micko, is expected to address whether Boelter should remain in custody without bail and affirm that there is probable cause to proceed. He is not expected to enter a plea. Prosecutors need to secure a grand jury indictment before he's arraigned later, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans’ home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers’ homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. The acting U.S. attorney for Minnesota, Joseph Thompson, said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn't been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nBoelter's wife, Jenny, issued a statement through her own lawyers Thursday saying she and her children are “absolutely shocked, heartbroken and completely blindsided,” and expressing sympathy for the Hortman and Hoffman families. She is not in custody and has not been charged.\n\n“This violence does not align at all with our beliefs as a family,\" her statement said. \"It is a betrayal of everything we hold true as tenets of our Christian faith. We are appalled and horrified by what occurred and our hearts are incredibly heavy for the victims of this unfathomable tragedy.”\n\nAn FBI agent’s affidavit described the Boelters as “preppers,” people who prepare for major or catastrophic incidents. Investigators seized 48 guns from his home, according to search warrant documents.\n\nWhile the FBI agent’s affidavit said law enforcement stopped Boelter’s wife as she traveled with her four children north of the Twin Cities in Onamia on the day of the shootings, she said in her statement that she was not pulled over. She said that after she got a call from authorities, she immediately drove to meet them at a nearby gas station and has fully cooperated with investigators.\n\n“We thank law enforcement for apprehending Vance and protecting others from further harm,\" she said.","summary":"Former Minnesota House Speaker Melissa Hortman will lie in state at the Minnesota Capitol rotunda","url":"https://abcnews.go.com/US/wireStory/former-minnesota-house-speaker-melissa-hortman-lie-state-123259199","image":"https://i.abcnewsfe.com/a/d62f9a10-d893-4079-941a-6597d5bbbf63/wirestory_3ec7d63b0137dbfd59a008a259f49903_16x9.jpg?w=1600","video":null,"publish_date":"2025-06-27 13:34:38","author":"Steve Karnowski Associated Press","authors":["Steve Karnowski Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.048},{"id":335886402,"title":"MAGA weirdos have an embarrassing new nickname for Trump","text":"Remember when Minnesota Gov. Tim Walz called Republicans “weird people” while campaigning with Vice President Kamala Harris last year? Well, they certainly seem to be living up to that reputation these days.\n\nNATO Secretary General Mark Rutte called President Donald Trump “daddy” on Wednesday, which quickly ballooned into a right-wing obsession.\n\nThe official White House X account shared a video shortly after Rutte’s comment, showing Trump arriving at the 2025 NATO summit set to the song “Hey Daddy (Daddy’s Home)” by Usher. \n\n“🎶Daddy’s home… Hey, hey, hey, Daddy,” the caption said.\n\nMeanwhile, Michigan state Sen. Jonathan Lindsey said that his fellow Republicans are referring to the president as “Daddy Trump” because they see him as a “father figure.”\n\nHilariously, fellow Michigan state Sen. Jeremy Moss, a Democrat who is openly gay, fired back: “You don’t want to know what daddy means in my community.”\n\nBut this isn’t the first time that Trump’s been referred to as “daddy.” During a 2024 rally, former Fox News host Tucker Carlson said that “there has to be a point at which dad comes home.”\n\n“Dad is pissed. And when dad gets home, you know what he says? ‘You’ve been a bad girl. You’ve been a bad little girl and you’re getting a vigorous spanking right now,” he added.\n\nNow, we can’t say for sure whether there’s any subtext behind the right’s use of the word “daddy” when referring to Trump. But regardless, they’ve successfully held onto their “weird” badge for a little while longer.","summary":"Remember when Minnesota Gov. Tim Walz called Republicans “weird people” while campaigning with Vice President Kamala Harris last year? Well, they certainly seem to be living up to that reputation these days.\n\n\n\nNATO Secretary General Mark Rutte called President Donald Trump “daddy” on Wednesday, which quickly ballooned into a right-wing obsession.\n\n\n\nThe official White House X account shared a video shortly after Rutte’s comment, showing Trump arriving at the 2025 NATO summit set to the song “Hey Daddy (Daddy’s Home)” by Usher. \n\n\n\n“&#x1f3b6;Daddy’s home… Hey, hey, hey, Daddy,” the caption said.\n\n\n\n\n\n\n\n\n\nMeanwhile, Michigan state Sen. Jonathan Lindsey said that his fellow Republicans are referring to the president as “Daddy Trump” because they see him as a “father figure.”\n\n\n\nHilariously, fellow Michigan state Sen. Jeremy Moss, a Democrat who is openly gay, fired back: “You don’t want to know what daddy means in my community.”\n\n\n\nBut this isn’t the first time that Trump’s been referred to as “daddy.” During a","url":"https://www.dailykos.com/story/2025/6/27/2330288/-MAGA-weirdos-have-an-embarrassing-new-nickname-for-Trump?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1449831/story_image/AP931836977439.jpg?1750974197","video":null,"publish_date":"2025-06-27 13:30:04","author":"Alix Breeden","authors":["Alix Breeden"],"language":"en","category":"politics","source_country":"US","sentiment":-0.273},{"id":335837350,"title":"How Zohran Mamdani’s win in the New York City mayoral primary could ripple across the country","text":"Top Republicans and Democrats alike are talking about the sudden rise of 33-year-old Zohran Mamdani, a state representative who won the Democratic mayoral primary in New York on June 24, 2025, in a surprising victory over more established politicians. \n\nWhile President Donald Trump quickly came out swinging with personal attacks against Mamdani, some establishment Democratic politicians say they are concerned about how the democratic socialist’s progressive politics could harm the broader Democratic Party and cause it to lose more centrist voters. \n\nNew York is a unique American city, with a diverse population and historically liberal politics. So, does a primary mayoral election in New York serve as any kind of harbinger of what could come in the rest of the country?\n\nAmy Lieberman, a politics and society editor at The Conversation U.S., spoke with Lincoln Mitchell, a political strategy and campaign specialist who lectures at Columbia University, to understand what Mamdani’s primary win might indicate about the direction of national politics. \n\nDoes Mamdani’s primary win offer any indication of how the Democratic Party might be transforming on a national level? \n\nMamdani’s win is clearly a rebuke of the more corporate wing of the Democratic Party. I know there are people who say that New York is different from the rest of the country. But from a political perspective, Democrats in New York are less different from Democrats in the rest of country than they used to be.\n\nThat’s because the rest of America is so much more diverse than it used to be. But if you look at progressive politicians now in the House of Representatives and state legislatures, they are being elected from all over – not just in big cities like New York anymore. \n\nAndrew Cuomo, the former governor of New York, ran an absolutely terrible mayoral campaign. He tried to build a political coalition that is no longer a winning one, which was made up of majorities of African Americans, outer-borough white New Yorkers and orthodox and conservative Jews. Thirty or 40 years ago, that was a powerful coalition. Today, it could not make up a majority.\n\nMamdani visualized and created what a 2025 progressive coalition looks like in New York and recognized that it is going to look different than the past. Mamdani’s coalition was based around young, white people – many of them with college degrees who are worried about affordability – ideological lefties and immigrants from parts of the Global South, including the Caribbean and parts of Africa, South Asia and South America. \n\nWhen you say a new kind of political coalition, what policy priorities bring Mamdani’s supporters together?\n\nMamdani reframed what I would call redistributive economic policies that have long been central to the progressive agenda. A pillar of his campaign is affordability – a brilliant piece of political marketing because who is against affordability? He came up with some affordability-related policies that got enough buzz, like promising free buses. Free buses are great, but it won’t help most working and poor New Yorkers get to work – they take the subway. \n\nHe has been very critical of Israel and has weathered charges of antisemitism. \n\nIn the older New York, progressive politicians such as the late Congressman Charlie Rangel were very hawkish on Israel. \n\nWhat Mamdani understood is that in today’s America, the progressive wing of the Democratic Party does not care if somebody is, sounds like or comes close to being antisemitic. For those people, calling someone antisemitic sounds Trumpy, and they understand it as a right-wing hit, rather than the legitimate expression of concerns from Jewish people. Some liberals think that claims of antisemitism are simply something done just by those on the right to damage or discredit progressive politicians, but antisemitism is real. \n\nTherefore, Mamdani’s record on the Jewish issue did not hurt him in the campaign, but he needs to build bridges to Jewish voters, or he will not be able to govern New York City.\n\nHow else did Mamdani appeal to a base of supporters? \n\nHe got the support of “limousine liberals” – including rich, high-profile, progressive people. His supporters include Ella Emhoff, a model and the stepdaughter of Kamala Harris, and the actress Cynthia Nixon, but there were many others. Supporting Mamdani became stylish – almost de rigueur – among certain segments of affluent New York. \n\nMamdani is also a true New Yorker and the voice of a new kind of immigrant. His parents are from Uganda and India. But he is also the child of extreme privilege – his mother, Mira Nair, is a well-known filmmaker, and his father is an accomplished professor. Mamdani went to top schools in New York and knows how to play in elite circles, and with white people. He is a Muslim man whose roots are in the Global South, not threatening because he knows how to speak their language. \n\nBut to people of color and immigrants, Mamdani is also one of them. Because of Mamdani’s interesting background, he brought the limousine liberals together with the aunties from Bangladesh. \n\nFinally, on the charisma scale, Mamdani was so far ahead of other Democratic candidates. Who is going to make better TikTok videos – the good-looking, young man whose mother is a world-famous movie producer, or the older guy who is a loving father and husband but gives off dependable dad, rather than hip young guy, vibes? \n\nIs New York City so distinct that you cannot compare politics there to what happens nationwide?\n\nI think that nationwide or at the state level there is a potential for something similar to a Mamdani coalition, but not a Mamdani coalition exactly. But in a place like Oklahoma, there are people who are in bad economic shape and who will also respond positively to an affordability-focused, Democratic political campaign. Mamdani remade a progressive New York coalition for this moment. Other progressives politicians should copy the spirit of that and reimagine a winning coalition in their city, state or district.\n\nWhen Trump was campaigning, he focused at least on making groceries cheaper. Mamdani is one of the few Democrats who took the affordability issue back from Trump and addressed it head on and in a much more honest and relevant way. Trump has the phrase, “Make America Great Again!” That’s a popular slogan on baseball caps for Trump supporters. \n\nIf Mamdani wanted to make a baseball cap, he could just print “Affordability” on it. Boom.\n\nOther Democratic politicians can take that approach of affordability and reframe it in a way that works in Kansas City or elsewhere.","summary":"Zohran Mamdani is one of the first Democratic candidates to successfully leverage Donald Trump’s focus on cost of living, explains a political strategist.","url":"https://theconversation.com/how-zohran-mamdanis-win-in-the-new-york-city-mayoral-primary-could-ripple-across-the-country-259951","image":"https://images.theconversation.com/files/676895/original/file-20250626-62-gd0efn.jpg?ixlib=rb-4.1.0&rect=0%2C65%2C5000%2C2500&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-06-27 12:31:42","author":"Columbia University,Lecturer,Lincoln Mitchell,School of International and Public Affairs","authors":["Columbia University","Lecturer","Lincoln Mitchell","School of International and Public Affairs"],"language":"en","category":"politics","source_country":"AU","sentiment":0.001},{"id":335835000,"title":"Flashback: The debate night against Trump that threw Biden's reelection campaign into a free fall","text":"A year ago Friday, President Joe Biden took the debate stage against then-Republican presidential candidate Donald Trump and drove one of the final nails in his reelection campaign's coffin as traditional allies turned their backs on the 46th president and subsequently rallied to replace him as the frontrunner against Trump. Biden entered the reelection cycle already racked by claims and concerns that his mental acuity had slipped and he was not mentally fit to continue serving as president, which was underscored by special counsel Robert Hur's report in February 2024 that rejected criminal charges against Biden for possessing classified materials, citing he was \"a sympathetic, well-meaning, elderly man with a poor memory.\" The then-president spent days preparing for the debate from Camp David in Maryland, as videos of his recent public gaffes and missteps haunted the campaign in the days leading up to the debate. Trump, meanwhile, led the charge in demanding Biden take a drug test to prove he was not taking performance-enhancing supplements ahead of the highly anticipated event. Biden brushed off accusations he was using any performance-enhancing supplements, including mocking Trump's challenge that he take a drug test in an X post showing him drinking a can of water. NEW BOOK REVEALS BIDEN'S INNER CIRCLE WORRIED ABOUT HIS AGE YEARS BEFORE BOTCHED DEBATE PERFORMANCE \"I don't know what they've got in these performance enhancers, but I'm feeling pretty jacked up. Try it yourselves, folks. See you in a bit,\" the X post read, accompanied by a photo of Biden drinking a can of water that read \"Get real, Jack. It's just water.\" Just minutes later, Biden would deliver a failing debate performance that unleashed panic among the Democratic Party, as some rushed to defend Biden, and others broke with the man who had served in public office for more than 50 years to demand fresh leadership at the 11th hour of the campaign cycle. FORMER NBC HOST CHUCK TODD ADMITS MEDIA FEARED THAT COVERING BIDEN'S DECLINE WOULD HELP TRUMP \"I really don't know what he said at the end of that sentence, I don't think he knows what he said either,\" Trump shot at Biden at one point during the debate. The viral moment followed Biden attempting to tout Congress' bipartisan border package that lawmakers had bucked earlier in 2023. Biden said, \"We find ourselves in a situation where when he was president, he was separating babies from their mothers put them in cages, making sure that the families were separated.\" \"That's not the right way to go. What I've done since I've changed the law, what's happened? I've changed it in a way that now you're in a situation where there are 40% fewer people coming across the border illegally, that's better than when he left office. And I'm going to continue to move until we get the total ban on the total initiative relative to what we can do with more Border Patrol and more asylum officers,\" Biden said, appearing to trail off. DEMOCRATIC PRESIDENTIAL HOPEFULS GRAPPLE WITH BIDEN'S LEGACY AS 2028 RACE BEGINS Overall, Biden's 90-minute performance was riddled with him tripping over his words, speaking in a far more subdued tenor than during his vice presidency, having a raspy and unsure voice, and losing his train of thought at times. Biden and Trump also were both confronted over their ages during the debate, with the moderator saying Biden would be 86 by the end of a potential second term, and Trump 82. Biden defended his age, saying he \"spent half my career being criticized about being the youngest person in politics. I was the second-youngest person ever elected to the United States Senate, and now I’m the oldest. This guy is three years younger and a lot less competent.\" DEMOCRATS FRETTED BEHIND THE SCENES ABOUT BIDEN'S DECLINE DESPITE PUBLIC CONFIDENCE, NEW BOOK CLAIMS Trump, meanwhile, said he had taken cognitive tests and \"aced them.\" The debate unleashed panic among Democrat allies of the president and members of the media, as they remarked his performance was a failure that added fuel to the fire surrounding concerns over his mental acuity and age. \"My phone really never stopped buzzing throughout. And the universal reaction was somewhere approaching panic,\" then-MSNBC host Joy Reid, for example, said. \"My job now is to be really honest,\" former Missouri Sen. Claire McCaskill, a Democrat, said during an appearance on MSNBC after the debate. \"Joe Biden had one thing he had to do tonight, and he didn't do it. He had one thing he had to accomplish and that was reassure America that he was up to the job at his age. And he failed at that tonight.\" \"I think the emotions of the night were basically disappointment, anger, and then, by the end, it was panic,\" one House Democrat who was granted anonymity to speak freely, told Fox News Digital following the debate. FIRST 2024 TRUMP-BIDEN PRESIDENTIAL DEBATE: TOP CLASHES OVER ISSUES FROM THE BORDER TO UKRAINE Legacy media outlets such as the New York Times and the Chicago Tribune called on Biden to map out an exit plan – with the Times describing Biden as a \"shadow of a great public servant\" – while Biden allies such as former President Barack Obama and first lady Jill Biden reiterated their support for the 46th president’s re-election. \"Bad debate nights happen. Trust me, I know,\" Obama said the day after the debate. \"But this election is still a choice between someone who has fought for ordinary folks his entire life and someone who only cares about himself. Between someone who tells the truth; who knows right from wrong and will give it to the American people straight – and someone who lies through his teeth for his own benefit.\" CRITICISMS MOUNT THAT BIDEN IS A 'SHADOW' OF HIMSELF AFTER DISASTROUS DEBATE: 'NOT THE SAME MAN' FROM VP ERA Soon after the debate, however, reports spread that Obama was working behind the scenes to rally that Biden drop out of the race, so a new generation of Democrats could take the reins of the party. The White House, meanwhile, forcefully defended the president following the debate. \"Absolutely not,\" then-White House press secretary Karine Jean-Pierre declared in a media briefing July 3, 2024, when asked if Biden had any plans to exit the 2024 race. CLICK HERE TO GET THE FOX NEWS APP Biden ultimately did drop out of the race on July 21, 2024, less than a month following the debate, as pressure from traditional allies grew. The president announced his departure in a Sunday afternoon message posted to his X account. The announcement was soon followed by him endorsing Vice President Kamala Harris to take up the mantle, leaving her with just more than 100 days to launch her own presidential campaign against Trump.","summary":"A year ago Friday, President Joe Biden took the debate stage against then-Republican presidential candidate Donald Trump and drove one of the final nails in his reelection campaign&apos;s coffin.","url":"https://www.foxnews.com/politics/flashback-debate-night-against-trump-threw-bidens-reelection-campaign-free-fall","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/06/931/523/BIDEN-DEBATE-SPLIT.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-27 12:00:43","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.207},{"id":335804302,"title":"Minnesota lawmaker lies in state as suspect in killing due in court","text":"Former Minnesota House Speaker Melissa Hortman will lie in state in the Minnesota Capitol rotunda on Friday while the man charged with killing her and her husband, and wounding a state senator and his wife, is due in court.\n\nHortman, a Democrat, will be the first woman and one of fewer than 20 Minnesotans accorded the honor. She will lie in state with her husband, Mark, and their golden retriever, Gilbert. Her husband was also killed in the June 14 attack, and Gilbert was seriously wounded and had to be euthanized.\n\nThe public can pay their respects from noon to 5 p.m. Friday. House TV will livestream the viewing. A private funeral is set for 10:30 a.m. Saturday. The service will be livestreamed on the Department of Public Safety’s YouTube channel.\n\nFormer Vice President Kamala Harris will fly to Minnesota for the funeral but won’t have a speaking role, according to her personal office. Harris expressed her condolences this past week to Hortman’s adult children, and spoke with Gov. Tim Walz, her 2024 running mate, who extended an invitation on behalf of the Hortman family, her office said.\n\nThe man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges for what the chief federal prosecutor for Minnesota has called “a political assassination.” Vance Boelter, 57, of Green Isle, surrendered near his home the night of June 15 after what authorities have called the largest search in Minnesota history.\n\nThe hearing, before Magistrate Judge Douglas Micko, is expected to address whether Boelter should remain in custody without bail and affirm that there is probable cause to proceed. He is not expected to enter a plea. Prosecutors need to secure a grand jury indictment before he’s arraigned later, which is when a plea is normally entered.\n\nAccording to the federal complaint, police video shows Boelter outside the Hortmans’ home and captures the sound of gunfire. And it says security video shows Boelter approaching the front doors of two other lawmakers’ homes dressed as a police officer.\n\nHis lawyers have declined to comment on the charges, which could carry the federal death penalty. The acting U.S. attorney for Minnesota, Joseph Thompson, said last week that no decision has been made. Minnesota abolished its death penalty in 1911. The Death Penalty Information Center says a federal death penalty case hasn’t been prosecuted in Minnesota in the modern era, as best as it can tell.\n\nBoelter also faces separate murder and attempted murder charges in state court that could carry life without parole, assuming that county prosecutors get their own indictment for first-degree murder. But federal authorities intend to use their power to try Boelter first.\n\nAuthorities say Boelter shot and wounded Democratic state Sen. John Hoffman, and his wife, Yvette, at their home in Champlin before shooting and killing the Hortmans in their home in the northern Minneapolis suburb of Brooklyn Park, a few miles away.\n\nFederal prosecutors allege Boelter also stopped at the homes of two other Democratic lawmakers. Prosecutors also say he listed dozens of other Democrats as potential targets, including officials in other states. Friends described Boelter as an evangelical Christian with politically conservative views. But prosecutors have declined so far to speculate on a motive.\n\nBoelter’s wife speaks out\n\nBoelter’s wife, Jenny, issued a statement through her own lawyers Thursday saying she and her children are “absolutely shocked, heartbroken and completely blindsided,” and expressing sympathy for the Hortman and Hoffman families. She is not in custody and has not been charged.\n\n“This violence does not align at all with our beliefs as a family,” her statement said. “It is a betrayal of everything we hold true as tenets of our Christian faith. We are appalled and horrified by what occurred and our hearts are incredibly heavy for the victims of this unfathomable tragedy.”\n\nAn FBI agent’s affidavit described the Boelters as “preppers,” people who prepare for major or catastrophic incidents. Investigators seized 48 guns from his home, according to search warrant documents.\n\nWhile the FBI agent’s affidavit said law enforcement stopped Boelter’s wife as she traveled with her four children north of the Twin Cities in Onamia on the day of the shootings, she said in her statement that she was not pulled over. She said that after she got a call from authorities, she immediately drove to meet them at a nearby gas station and has fully cooperated with investigators.\n\n“We thank law enforcement for apprehending Vance and protecting others from further harm,” she said.","summary":"The man accused of killing the Hortmans and wounding another Democratic lawmaker and his wife is due in court Friday to face charges.","url":"https://globalnews.ca/news/11263843/minnesota-lawmaker-melissa-hortman-lies-in-state-suspect-in-court/","image":"https://globalnews.ca/wp-content/uploads/2025/06/melissa-hortman-memorial.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-06-27 11:09:21","author":"Globalnews Digital,The Associated Press","authors":["Globalnews Digital","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.053},{"id":335981114,"title":"Mamdani’s NYC primary win sparks surge in anti-Muslim posts","text":"Zohran Mamdani declared victory in Tuesday’s primary after former New York governor Andrew Cuomo conceded defeat. (AFP pic)WASHINGTON: Anti-Muslim online posts targeting New York City mayoral candidate Zohran Mamdani have surged since his Democratic primary upset this week, including death threats and comments comparing his candidacy to the Sept 11 2001 attacks, advocates said today.There were at least 127 violent hate-related reports mentioning Mamdani or his campaign in the day after polls closed, said Council on American Islamic Relations (CAIR) Action, an arm of the CAIR advocacy group, which logs such incidents.“That marks a five-fold increase over a daily average of such reports tracked earlier this month,” CAIR Action said in a statement.Overall, it noted about 6,200 online posts that mentioned some form of Islamophobic slur or hostility in that day long time-frame.Mamdani, a self-described democratic socialist and a 33-year-old state lawmaker, declared victory in Tuesday’s primary after former New York governor Andrew Cuomo conceded defeat.Born in Uganda to Indian parents, Mamdani would be the city’s first Muslim and Indian American mayor if he wins the November general election.“We call on public officials of every party – including those whose allies are amplifying these smears – to unequivocally condemn Islamophobia,” said Basim Elkarra, executive director of CAIR Action.The advocacy group said its hate monitoring system includes its own scraping and analysis of posts, online submissions by the public and notifications from law enforcement.“About 62% of the anti-Muslim posts against Mamdani originated on X,” CAIR Action said.People close to Republican President Donald Trump, including one of his sons, are among those spreading anti-Muslim rhetoric, advocates said.Donald Trump Jr, the president’s son, wrote on X on Wednesday that “New York City has fallen” while sharing a post that said New Yorkers had “voted for” 9/11.Also on Wednesday, Republican US Representative Marjorie Taylor Greene posted an AI-generated picture of the Statue of Liberty draped in a burqa.President Trump has pursued domestic policies that rights advocates have described as anti-Muslim, including banning travel from some predominantly Muslim or Arab countries in his first term and attempting to deport pro-Palestinian students in his current term.The White House, which did not respond to a request for comment, has denied claims of discrimination against Muslims.Trump and his allies have said they oppose Mamdani and others due to what they call the Democrats’ “radical left” ideology.ThreatsThe New York City Police Department said earlier this month its hate crime unit was probing anti-Muslim threats against Mamdani.Manjusha Kulkarni, co-founder of Stop AAPI Hate, which documents hate against Asian Americans, and CAIR said attacks against Mamdani mirrored those endured by other South Asian and Muslim political figures, including former vice-president Kamala Harris and representatives Ilhan Omar and Rashida Tlaib.Republicans have called Mamdani antisemitic, citing his pro-Palestinian advocacy and his criticism of Israel’s military assault on Gaza after an attack by Hamas militants in October 2023.Mamdani has condemned antisemitism and has the backing of New York City comptroller Brad Lander, who is Jewish. Lander also ran in the Democratic primary.Rights advocates have noted rising antisemitism and Islamophobia since the start of the Israel-Gaza war, with fatal US incidents including the shooting of two Israeli embassy staff in Washington and the stabbing of a Muslim child in Illinois.Mamdani and other Pro-Palestinian advocates, including some Jewish groups, said their criticism of Israel is wrongly conflated with antisemitism.","summary":"People close to Republican President Donald Trump, including one of his sons, are among those spreading anti-Muslim rhetoric, say advocates.","url":"https://www.freemalaysiatoday.com/category/world/2025/06/27/mamdanis-nyc-primary-win-sparks-surge-in-anti-muslim-posts/","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/06/3e9e77fc-afp__20250626__2221992567__v3__highres__mayoralcandidatefornewyorkzohranmamdaniholds_1600x1000_1.webp","video":null,"publish_date":"2025-06-27 11:08:50","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":0.039},{"id":335799120,"title":"Mamdani’s NYC primary win sparks surge in anti-Muslim posts, advocates say","text":"Anti-Muslim online posts targeting New York City mayoral candidate Zohran Mamdani have surged since his Democratic primary upset this week, including death threats and comments comparing his candidacy to the September 11, 2001 attacks, advocates said on Friday.\n\nThere were at least 127 violent hate-related reports mentioning Mamdani or his campaign in the day after polls closed, said CAIR Action, an arm of the Council on American Islamic Relations advocacy group, which logs such incidents.\n\nThat marks a five-fold increase over a daily average of such reports tracked earlier this month, CAIR Action said in a statement.\n\nOverall, it noted about 6,200 online posts that mentioned some form of Islamophobic slur or hostility in that day long time-frame.\n\nMamdani, a self-described democratic socialist and a 33-year-old state lawmaker, declared victory in Tuesday’s primary after former New York Governor Andrew Cuomo conceded defeat.\n\nBorn in Uganda to Indian parents, Mamdani would be the city’s first Muslim and Indian American mayor if he wins the November general election.\n\n“We call on public officials of every party — including those whose allies are amplifying these smears — to unequivocally condemn Islamophobia,” said Basim Elkarra, executive director of CAIR Action.\n\nThe advocacy group said its hate monitoring system includes its own scraping and analysis of posts, online submissions by the public and notifications from law enforcement. About 62 per cent of the anti-Muslim posts against Mamdani originated on X, CAIR Action said.\n\nPeople close to Republican President Donald Trump, including one of his sons, are among those spreading anti-Muslim rhetoric, advocates said.\n\nDonald Trump Jr, the president’s son, wrote on X on Wednesday that “New York City has fallen” while sharing a post that said New Yorkers had “voted for” 9/11.\n\nAlso on Wednesday, Republican US Representative Marjorie Taylor Greene posted an AI-generated picture of the Statue of Liberty draped in a burqa.\n\nPresident Trump has pursued domestic policies that rights advocates have described as anti-Muslim, including banning travel from some predominantly Muslim or Arab countries in his first term and attempting to deport pro-Palestinian students in his current term.\n\nThe White House, which did not respond to a request for comment, has denied claims of discrimination against Muslims. Trump and his allies have said they oppose Mamdani and others due to what they call the Democrats’ “radical left” ideology.\n\nThe New York City Police Department said earlier this month its hate crime unit was probing anti-Muslim threats against Mamdani.\n\nManjusha Kulkarni, co-founder of Stop AAPI Hate, which documents hate against Asian Americans, and CAIR said attacks against Mamdani mirrored those endured by other South Asian and Muslim political figures, including former Vice President Kamala Harris and Representatives Ilhan Omar and Rashida Tlaib.\n\nRepublicans have called Mamdani antisemitic, citing his pro-Palestinian advocacy and his criticism of Israel’s military assault on Gaza after an attack by Hamas militants in October 2023.\n\nMamdani has condemned antisemitism and has the backing of New York City Comptroller Brad Lander, who is Jewish. Lander also ran in the Democratic primary.\n\nRights advocates have noted rising antisemitism and Islamophobia since the start of the Israel-Gaza war, with fatal US incidents including the shooting of two Israeli embassy staff in Washington and the stabbing of a Muslim child in Illinois.\n\nMamdani and other pro-Palestinian advocates, including some Jewish groups, said their criticism of Israel is wrongly conflated with antisemitism.","summary":"Anti-Muslim online posts targeting New York City mayoral candidate Zohran Mamdani have surged since his Democratic primary upset this week, including death threats and comments comparing his candidacy to the September 11, 2001 attacks, advocates said on Friday.\n\n\nThere were at least 127 violent hate-related reports mentioning Mamdani or his campaign in the day after polls closed, said CAIR Action, an arm of the Council on American Islamic Relations advocacy group, which logs such incidents.\n\n\nThat marks a five-fold increase over a daily average of such reports tracked earlier this month, CAIR Action said in a statement.\n\n\nOverall, it noted about 6,200 online posts that mentioned some form of Islamophobic slur or hostility in that day long time-frame.\n\n\nMamdani, a self-described democratic socialist and a 33-year-old state lawmaker, declared victory in Tuesday’s primary after former New York Governor Andrew Cuomo conceded defeat.\n\n\nBorn in Uganda to Indian parents, Mamdani would be the city’s first Muslim and ","url":"https://www.dawn.com/news/1920579/mamdanis-nyc-primary-win-sparks-surge-in-anti-muslim-posts-advocates-say","image":"https://i.dawn.com/large/2025/06/271529437669d3e.png?r=152949","video":null,"publish_date":"2025-06-27 10:45:23","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.035},{"id":335822624,"title":"Chabria: Zohran Mamdani and Donald Trump have a lot in common. California should pay attention","text":"Zohran Mamdani is a stylish, millennial, African-born Muslim with a Hollywood pedigree who just won the Democratic primary in the New York City mayor's race. If he sounds like Donald Trump's worst nightmare, he just might be. But he's also a lot like him. They're both charismatic leaders who have bucked their parties, tapped into the current political ethos that eschews traditional loyalties and by doing so, made themselves popular enough with fed-up voters to win elections when — to many in the political elite — they seem exactly like the kind of candidate who shouldn't be able to get their grandmother's vote. \"Working-class people want somebody who really takes on the status quo, who pushes an economic populist agenda and convinces them that something's going to change,\" Lorena Gonzalez told me. She's the head of the California Labor Federation, which represents unions, and even she's fed up with Democrats. \"There are days that I'm like, why am I still in this party?\" she said. \"When I see them cozy up to tech, when I see this abundance issue that streamlines worker protections, when I see this fascination with billionaires and this acquiescing to not taxing billionaires and not doing anything about rent control, you know, there's a point where I'm like, come on, grow some balls, go decide who you're for.\" Or, as Trump put it in a social media post after Mamdani's win, \"Yes, this is a big moment in the History of our Country!\" Trump is right, words that I don't often say — Mamdani's victory may signal something deeper than a lone mayor's race on the East Coast. People — both on the left and the right — crave authenticity, and want someone to believe in, be it an orange-hued boomer or a brown-skinned hipster. The Democrats, as political strategist Mike Madrid put it, are having their own Tea Party moment, when populist anger eats the old guard, as it did beginning in 2007 when the far-right of the Republican party began its now-successful takeover. Trump was never the impetus of the party's swing to the fringe, he just capitalized on it. \"This is just a populist revolt of the Democratic Party against the establishment base,\" Madrid said. There's been ad nauseam amounts of pontificating about the current state of the Democratic party. Should it go more centrist? Should it embrace the progressive end? But the truth is the voters have already decided. They do indeed want lower grocery prices, as Trump promised but failed to deliver. But they also want democracy to not crumble. And they want to buy a house, and maybe not have their neighbors deported. But really, in that order. And they don't trust many, if not most, of the current Democrats in office to deliver. Like Republicans before them, they want outsiders (Mamdani, 33, is serving in the state Assembly), or at least someone who can sound like one. Gonzalez spends a lot of time talking to voters and she said left and right, Democrat and Republican, they see few differences remaining between the two parties, and are tired of voting for career politicians who haven't delivered on economic issues. Mamdani, whose mother is the film director Mira Nair (and who once rapped under the name Young Cardamom), campaigned on \"a New York you can afford.\" That included freezing payments on rent-controlled apartments, building new affordable housing with union labor, making both transit and child care free and — you guessed it — cheaper groceries. Whether he delivers or not, those were messages that a broad swath of New Yorkers, struggling like all of us with the cost of living, wanted to hear. And he delivered them not just with credibility, but with an entertainment value that nods to his mom's influence: hamming it up Bollywood style for the South Asian aunties, walking the length of Manhattan to talk with people, jumping in the Atlantic ocean in a suit with a skinny tie. Charisma and chutzpah. Which, of course, is how Trump made his own rise, promising, with showman verve, to be the voice of the toiling voiceless who increasingly are in danger of becoming the working poor. Yes, he is a con man who is clearly for the rich. But still, he knows how to deliver a line to his base: \"They're eating the cats. They're eating the dogs.\" That may be the biggest lesson for California, where we will soon be voting for a new governor from a crowded field — of establishment candidates. Even Kamala Harris, maybe especially Harris, fits that insider image, and certainly Gavin Newsom, despite zigzagging from centrist to pugilist, can't forward his presidential ambitions as anything but old-guard. \"What makes someone like Zohran so compelling, is even if you don't agree with him on everything, which few voters do, you understand that he believes it and that you know where he's coming from,\" said Amanda Litman, the co-founder and executive director of Run for Something, a PAC that recruits young progressives to run for office. \"I think that's the distinction between him and say someone like Gavin Newsom, which is, like, does Gavin believe what he says? Does he buy his own bull—? It's sort of unclear,\" Litman added. The anger of voters is strikingly clear, though, especially for ones who have for so long been loyal to Democrats. A new Pew analysis out this week found that about 20% of the Republican base is now nonwhite, nearly doubling what it was in 2016. Republicans have made gains with Black voters, Asian voters and Trump drew nearly half of Latino voters. Ouch. \"One of the real challenges for the Democrats is two central pieces of the orthodoxy has been that they are the party of the working class and that they are the party of nonwhite voters,\" Madrid said. \"Both of those are increasingly proving untrue, and the question then becomes, well, how do you get them back? The way you get them back is by having some sort of economic populist policy framework.\" Litman said that the way to capture voters is by running new candidates, the kind who don't come with history — and baggage. In the 36 hours after Mamdani was elected, her organization had 1,100 people sign up to learn more about how to run for office themselves, she said. It's the biggest spike since the inauguration, and it shows that voters aren't disinterested in democracy, but alienated from the existing options. \"The establishment is not unbeatable. They're only unchallenged,\" Litman said. \"And I think the more that the Democratic Party establishment, as much as it exists, can understand that the people and the playbooks that got us here will not be the people and playbooks that get us out of it, the better off we'll be.\" So maybe there are more Mamdani's out there, waiting to lead the way. If Democrats are looking for advice, Trump may have offered the best I've seen in a while — highlighting the insider/outsider Democrats who have, like Mamdani, made their name by rattling the establishment. \"I have an idea for the Democrats to bring them back into 'play,'\" he wrote on social media. \"After years of being left out in the cold, including suffering one of the Greatest Losses in History, the 2024 Presidential Election, the Democrats should nominate Low IQ Candidate, Jasmine Crockett, for President, and AOC+3 should be, respectively, Vice President, and three High Level Members of the Cabinet — Added together with our future Communist Mayor of New York City, Zohran Mamdani and our Country is really SCREWED!\" Or not. Wouldn't that be a slate?","summary":"Trump and Mamdani are both charismatic leaders who have bucked their parties and tapped into the current political ethos that eschews traditional loyalties.","url":"https://www.latimes.com/california/story/2025-06-27/chabria-column-zohran-mamdani-lessons-for-california","image":"https://ca-times.brightspotcdn.com/dims4/default/d819b89/2147483647/strip/true/crop/4800x2520+0+342/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F60%2Fa8%2Ffde0817443189e60aeadb8e4bde7%2Felection-2025-nyc-ma","video":null,"publish_date":"2025-06-27 10:00:00","author":"Anita Chabria","authors":["Anita Chabria"],"language":"en","category":"politics","source_country":"us","sentiment":-0.152}]}