{"offset":0,"number":50,"available":351,"news":[{"id":326631728,"title":"Disgraced Democrat Anthony Weiner roasts Kamala Harris for blowing up her campaign on ‘The View’","text":"Despite going to prison for a sex scandal involving minors, disgraced former congressman and former New York mayoral candidate Anthony Weiner said on Friday he can still do a better job than his Democratic colleagues did in the 2024 election. During an appearance on ABC's \"The View,\" Weiner explained that he is attempting to get back into politics by running for New York City Council because he believes, despite his baggage, that he’s a better politician than current Democratic figures. He also mocked former Vice President Kamala Harris, accusing her of ruining her 2024 presidential campaign while appearing on the same show. \"By the way, was this where Kamala Harris was sitting when she blew up her campaign?\" he asked as soon as he took his seat between the four co-hosts. ANTHONY WEINER SAYS VOTERS DON'T WANT WHAT 'DEMOCRATS ARE SELLING,' TALKS ABOUT COMEBACK AS FIERY CENTRIST \"Is this the spot?\" Weiner asked, gesturing to his chair. \"I hope I don’t have the same fate.\" Harris told \"The View\" last year that there \"is not a thing that comes to mind\" when asked what she would have done differently than then-President Biden. The moment was widely seen as a turning point that led to the downfall of her campaign. Later in the interview, Weiner hit Harris again. He responded to co-host Joy Behar’s suggestion that even though men like Weiner and President Donald Trump have problematic pasts, a woman like the former vice president still can’t make it to the highest office. Though the aspiring city council member admitted female politicians are often judged harshly, he maintained that Harris made an obvious blunder in response to \"The View’s\" \"softball\" question last year. \"The problem is, it’s a little bit too easy an answer, though, because also there were things that Kamala Harris – I made a joking reference to the answer she gave on this show: ‘Is there anything you would do different?’ That is the softest of softball that – every politician dreams to have that question,\" Weiner replied. \"You still have to be a good candidate.\" Harris did not immediately respond to a request for comment from Fox News Digital. TAPPER ADMITS FEELING 'HUMILITY' ABOUT PAST BIDEN COVERAGE AS LIBERALS DISPARAGE NEW BOOK Weiner left Congress in 2011 following a photo of the married then-congressman leaking on one of his social media accounts. Additional sex scandals mounted in the following years, culminating in an FBI investigation that led to Weiner serving 21 months in prison and registering as a sex offender after sending sexually explicit images to a minor. After his dig toward Harris at the top of the segment, Behar pressed Weiner on why he believes he can get back into politics considering his scandal-plagued background. The aspiring city councilman said it’s because he believes he’s a better politician than many current Democratic lawmakers. \"I think what I said at the time was I couldn’t imagine there would ever be a chance that either people would want me back or that I would want to get back into that again,\" he replied. \"But when I woke up in November of ’24 and saw the election results, but more than who won, I looked around New York City and saw how many fewer Democrats even turned out to vote. And I started to say to myself, ‘Something is seriously wrong here.’\" Weiner said too many Democratic candidates were running \"frictionless\" campaigns and playing it too safe. He told the co-hosts that he felt compelled to jump back into politics because his contemporaries were not answering the public’s \"cry that they wanted things to change.\" He added that his past was not a \"good enough reason… not to get off the couch and try.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Co-host Ana Navarro pressed him on his specific scandals, asking, \"Why should New Yorkers give you a chance at a political comeback?\" He replied, \"I’m doing the opposite of what a lot of politicians do in my position – ignore that problem, pretend it didn’t happen, blame someone else. I am saying, yes, I did these things. I got into recovery. I tried to make my life better. And now, if I can be of service – and I’m a damn good politician. I come up with answers, I talk to people directly, I don’t try to butter over things, I try to be direct.\" CLICK HERE TO GET THE FOX NEWS APP \"Look, all I can ever be is who I am right now and that brought me to this space,\" Weiner added.","summary":"During &quot;The View&quot; on Friday, disgraced former Congressman Anthony Weiner argued he can do a better job than current Democratic politicians, despite his scandalous history.","url":"https://www.foxnews.com/media/disgraced-democrat-anthony-weiner-roasts-kamala-harris-blowing-up-her-campaign-the-view","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/anthony-weiner-kamala-harris-split.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-31 00:00:37","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","category":"politics","source_country":"US","sentiment":-0.35},{"id":326629702,"title":"California Senate Launches Paramount-Trump Settlement Talks Investigation, Invites Bill Owens and Wendy McMahon to Testify","text":"The California State Senate has launched an investigation into Paramount Global’s ongoing discussions with President Donald Trump to settle his $20 billion lawsuit against CBS.\n\nIn a Friday letter, the state’s lawmakers invited former “60 Minutes” executive producer Bill Owens and former CBS News president Wendy McMahon to testify as part of an investigation into Paramount’s settlement discussions with President Donald Trump over his $20 billion lawsuit against the program’s Oct. 7 interview with former vice president Kamala Harris.\n\n“Your recent resignations from CBS’s leadership, amid public reports of internal concern about the editorial and ethical implications of the proposed settlement, suggest that you may possess important, first-hand knowledge relevant to our legislative oversight responsibilities,” the joint letter from its Energy, Utilities & Communications committee chair Josh Becker and Judiciary committee chair Thomas Umberg states. “If Paramount is entertaining a settlement primarily to secure favorable regulatory treatment, this raises deeply troubling implications not just for journalism, but for the rule of law and the integrity of corporate governance.”\n\nThe committees are seeking information from the pair on whether newsroom staff raised internal objections to the settlement or its motivations, whether any editorial decisions were impacted or overridden, whether internal counsel or leadership acknowledged the weakness of the lawsuit’s claims and whether anyone within the company indicated that the settlement may be “advantageous or necessary” in order to influence the regulatory review of the pending $8 billion Skydance merger.\n\nThe lawmakers argue that a settlement to clear regulatory approval of the Skydance deal could constitute a violation of federal anti-bribery laws, an infraction of California’s unfair competition law, a breach of fiduciary duties owed by Paramount board members to shareholders and the misuse of corporate funds vulnerable to shareholder derivative litigation.\n\n“These issues go beyond internal policy,” the letter states. “They have real legal exposure for Paramount and its board of directors, including Ms. Shari Redstone, Ms. Barbara Byrne, Ms. Judith McHale, Ms. Linda Griego, and Ms. Susan Schuman.”\n\nThey also said it could have a “potential chilling effect” on investigative and political journalism, signaling “politically motivated lawsuits can succeed when paired with regulatory threats.”\n\n“It would damage public trust in CBS News and other California-based outlets, diminishing the state’s stature as a national leader in ethical journalism. Paramount’s capitulation would also undermine two essential pillars of a liberal democracy: a free press and an impartial, rule-of-law regulatory system,” the letter continues.\n\nThe California State Senate noted that while the invite is a voluntary request, they retain full subpoena authority under California law should additional testimony or documentation become necessary during its investigation.\n\n“We respectfully encourage you to participate in this important hearing,” the letter concluded. “Your cooperation will help safeguard the values you have each worked to uphold in your distinguished careers.”\n\nRepresentatives for Paramount declined to comment on the letter. \n\nOwens resigned from “60 Minutes” in April, telling staff in a memo that he lost the ability to make independent decisions as the network. Meanwhile, McMahon resigned earlier this month, saying in a memo to staff that “it’s become clear the company and I do not agree on the path forward.” She described the tension between herself and Paramount as “challenging.” \n\nThough neither referenced the Trump lawsuit directly, both executives had previously expressed opposition to a settlement. \n\nThe lawsuit takes aim at the news program’s Oct. 7 interview with former Vice President Kamala Harris, which Trump has said was deceptively edited to make her look good. \n\nCBS News has maintained that Trump’s accusations of deceitful editing were false, explaining that the promo shown on “Face the Nation” used a longer section of Harris’ answer. It also turned over the transcript and camera footage from the interview to the FCC as part of the agency’s investigation into allegations of “news distortion.” In a March filing to dismiss the Trump suit, CBS called it “an affront to the First Amendment” and “without basis in law or fact.”\n\nIn a Wednesday legal filing asking the court to deny Paramount’s motion to dismiss, Trump’s attorneys claimed that the interview caused him “mental anguish and confusion.” They also said that “viewers withheld attention from President Trump and Truth Social,” his social media platform, due to the “false advertising and tampering” tied to the Harris interview, resulting in a decrease in value for Trump Media and Technology Group and his other media holdings.\n\nThe Wall Street Journal reported that Trump recently shot down Paramount’s offer to settle the lawsuit for $15 million, with the president aiming to get at least $25 million and an apology.\n\nThe Paramount-Skydance merger, which is subject to regulatory approval from the FCC due to a required transfer of broadcast licenses of Paramount’s 28 owned-and-operated local TV stations, recently triggered its first automatic 90-day extension after failing to close by April 7.\n\nFCC chairman Brendan Carr has argued that the settlement talks with Trump are unrelated to the agency’s review of the Skydance deal. But he has warned that “all options remain on the table” in the agency’s ongoing investigation into alleged “news distortion,” including potentially revoking CBS’ broadcast license if the network is found to have violated the agency’s public interest standard. \n\nHe has also previously threatened to block M&A for companies who embrace diversity, equity and inclusion (DEI) policies and is reportedly seeking concessions in the Paramount-Skydance deal.\n\nParamount’s settlement talks come as Disney previously paid $15 million to settle a defamation lawsuit Donald Trump brought against ABC News and star anchor George Stephanopoulos. Meta also paid $25 million to settle Trump’s lawsuit about being kicked off Facebook and Instagram after the attack on the Capitol on Jan. 6, 2021.","summary":"The lawmakers argue settling the $20 billion lawsuit to clear regulatory approval of the pending $8 billion Skydance merger could violate federal anti-bribery laws and the state's unfair competition law \n\n\nThe post California Senate Launches Paramount-Trump Settlement Talks Investigation, Invites Bill Owens and Wendy McMahon to Testify appeared first on TheWrap.","url":"https://www.thewrap.com/california-state-senate-bill-owens-wendy-mcmahon-paramount-trump-settlement-talk-investigation/","image":"https://www.thewrap.com/wp-content/uploads/2025/05/Owens-McMahon.png","video":null,"publish_date":"2025-05-30 23:06:10","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","source_country":"US","sentiment":0.346},{"id":326622690,"title":"The corrupt coverup of Biden’s decline: Letters to the Editor — May 31, 2025","text":"The Issue: The media and President Joe Biden’s handlers’ role in the coverup of his mental decline.\n\nSome White House reporters still do not get it (“The Biggest Biden-Coverup Question,” Editorial, May 28).\n\nThe policies of former President Joe Biden are not the issue; it’s whether he gave the orders or we had unelected people running the country.\n\nYou do not have to be a reporter to think: Hey, this is a big deal. \n\nMaybe I should find out who the real president is.\n\nFrank Barnett\n\nThe liberal networks continue to lie and make stories up even after being caught over and over again.\n\nThey are part of the Democratic Party and will do or say anything to protect them.\n\nI believe most people would quit their jobs if they were told to keep lying, so what kind of people are working for left-leaning media?\n\nRemember, reporters and newscasters: The truth will set you free.\n\nCharlie Yannelli\n\nBarnegat, NJ\n\nThe fact that the media helped hide the truth about Biden should surprise no one.\n\nThe same crowd pushed the liberal agenda and talking points about COVID. \n\nWe were bombarded with ads urging us to get vaccinated, and those who did not get it were deemed evil.\n\nThen, after helping hide Biden during his basement campaign, co-conspirators tried to hide him during his presidency.\n\nTo top it all off, they tried to push Kamala Harris through as a worthy presidential candidate. \n\nIf she had won, none of this would have come out.\n\nRecent reporting, including Jake Tapper and Alex Thompson’s new book, “Original Sin,” reveals serious concerns about Biden’s cognitive decline and a deliberate effort to conceal it. But this isn’t just a Democratic issue.\n\nPresident Trump has repeatedly refused to release results from his medical exams, raising red flags of his own. \n\nUnder his administration, there have been clear signs of deep-seated corruption.\n\nThe absence of age and health standards for our highest offices is a larger, bipartisan problem.\n\nLeadership should serve the country’s future — not cling to the past.\n\nJagjit Singh\n\nLos Altos, Calif.\n\nWe are now discovering from a variety of sources that Biden was being manipulated by a group of unelected officials.\n\nThis demands an immediate congressional hearing and creating laws to prevent it from happening again.\n\nEd Houlihan\n\nRidgewood, NJ\n\nDemocrats and the media both lied to cover up Biden’s obvious medical problems. \n\nThey created the current “credibility crisis” by lying instead of using common sense.\n\nDaniel Robinowitz\n\nDallas, Texas\n\nThe Issue: President Trump’s pardon of reality stars and convicted tax-evaders Todd and Julie Chrisley.\n\nPresident Trump abuses his pardon power (“Reality TV ‘crooks’ walk free,” May 29).\n\nWhether you are a reality-show tax cheat, a crooked law-enforcement officer or a violent Proud Boy, you are eligible for a pardon — as long as you are white and have money to pay Trump.\n\nThe Republican Party just sits quietly, and publications like the New York Post continue to praise this convicted felon.\n\nKreg Ramone\n\nAs a faithful Trump supporter, I am curious as to why Todd and Julie Chrisley were pardoned after being accused of tax evasion and bank fraud.\n\nLeopards don’t change their spots, but I hope the Chrisleys have mended their ways.\n\nHowever, I see they are coming out with another reality program; that didn’t take long. \n\nWho are these folks?\n\nDonna Goddard\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss the media and President Joe Biden’s handlers’ role in the coverup of his mental decline.","url":"https://nypost.com/2025/05/30/opinion/the-corrupt-coverup-of-bidens-decline-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/RC2GSEAGTDU4-803767361-3-e1748635035115.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-30 23:04:53","author":"Post Readers","authors":["Post Readers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.341},{"id":326622776,"title":"Defence Secretary announces money to upgrade housing for military families","text":"Hereford TimesFive helicopters spotted flying near SAS campFive helicopters have been spotted over a Herefordshire village, which is home to an SAS base.\n\nBirmingham LiveKeir Starmer makes huge winter fuel payment statement – have your sayThe controversial cuts to energy payments for pensioners is set to be softened\n\n Why this ad?Go ad-free* \n\nThe Daily BeastTrump Biographer: This Is the ‘Real Reason’ He Hates HarvardThere’s a running joke going around the White House that President Donald Trump is out for Harvard’s blood because his son Barron didn’t get in—one scotched by first lady Melania Trump in an unprecedented piercing of her veil of privacy. But presidential biographer Michael Wolff has suggested a very different explanation for Trump’s vendetta: that he’s the one that couldn’t attend the prestigious Ivy League school. Wolff, author of bestsellers Fire & Fury and this year’s All or Nothing, advanced\n\nHuffPostFormer Trump Lawyer Rips Karoline Leavitt With A New Nickname After She Lashed Out At Judges”I don’t think anybody in America really takes her seriously on a matter of substance,” former White House lawyer Ty Cobb said.\n\nPeopleDonald Trump Was Asked About Potentially Pardoning Diddy: Here's What He SaidThe president was asked during a White House press briefing\n\n Why this ad?Go ad-free* \n\nHuffPostDonald Trump’s Answer To Question About Elon Musk Has Everyone Pointing Out Same ThingThe president’s waffle missed one key ingredient.\n\nHuffPostLawrence O'Donnell Makes Bold Prediction For 'Irreversibly Stupid' Trump's Next Big LossThe MSNBC host warned the president that the next major court decision won't go his way.\n\nThe TelegraphRachel Reeves on course for £24bn tax raid, warns JP MorganRachel Reeves is on course to raise taxes by £24bn this autumn as she launches a fresh raid on working people to fund higher welfare spending.\n\n Why this ad?Go ad-free* \n\nThe Telegraph‘I feel like a stranger in my own town’A burly young man with blond hair and an Eastern European accent is towering over me and yelling with incandescent rage. Expletives are raining down on to my upturned face. I am a f---ing fascist. I am twisting the f---ing truth. He hopes something f---ing awful happens to me.\n\nHuffPostFox Host Hits Back At Trump Adviser's 'Rogue' Talk With Ice-Cold Reality CheckLiz Claman wasn't having it with Peter Navarro as he tried to dismiss a court's ruling on the president's trade policy.\n\nThe IndependentTaurus cruise missiles: Weapons Germany could be sending Ukraine to strike deep into RussiaGerman chancellor Friedrich Merz says it is possible Berlin will send the longe-range cruise missiles to Kyiv\n\n Why this ad?Go ad-free* \n\nYahoo News UKThe health conditions most at risk from the DWP's controversial PIP changesWith ministers reportedly looking at softening PIP benefits cuts, we take a look at what conditions are most likely to be affected.\n\nThe Daily BeastFed Chair Slaps Down Trump’s Demands to His FaceFederal Reserve Chair Jerome Powell threw cold water on President Donald Trump’s attempt to sway the Fed into cutting interest rates during a rare face-to-face meeting Thursday. Trump invited the Fed chair to the White House for their first meeting of his second term to ramp up the pressure on Powell to slash rates. But Powell—whom Trump has called a “major loser” for refusing to bend to his will—rebuffed him. According to a Fed statement, Powell told Trump that he will make monetary policy deci\n\nThe IndependentStarmer’s extraordinary attack on Farage shows what Labour is really worried aboutNEWS ANALYSIS : It is extraordinary that Keir Starmer, with a majority of 174, felt the need to attack the leader of a party with just five MPs less than a year after the general election, Political Editor David Maddox writes\n\n Why this ad?Go ad-free* \n\nVarietyTrump Lawyers Claim ‘60 Minutes’ Harris Interview Caused Him ‘Mental Anguish,’ Argue That the ‘First Amendment Is No Shield to News Distortion’ in Motion to Deny Paramount Bid to Dismiss LawsuitPresident Trump’s legal team filed an objection to Paramount Global’s move to dismiss his $20 billion lawsuit against CBS over a “60 Minutes” segment, arguing that the TV newsmagazine’s alleged deceptive editing of an interview with Kamala Harris is not protected by the First Amendment. Trump filed the lawsuit against CBS just days before the …\n\nHuffPostTrump’s Air Force One Debacle Leaves The U.S. With A Weaker Wartime Command PostBy inserting himself into the contracting process, Trump is saddling future presidents with a command platform lacking the ability to refuel in midair, a key feature.\n\nCNNTransgender athlete says adults going to her track competitions to heckle her ‘shows how you are as a person’If high school track standout A.B. Hernandez competes at the state championship, California’s federal funding may be in doubt. President Donald Trump has promised to cut the funds if the transgender teen is allowed to compete.\n\n Why this ad?Go ad-free* \n\nAFPFrance gives air base $1.7 billion nuclear faceliftIn a sign of the growing security nerves in Europe, France has embarked on a $1.7 billion renovation of an air base in remote hills in the east of the country so it can handle nuclear-armed bombers. Macron has also said that with the Russian invasion of Ukraine raging and heightening worries in the rest of Europe, France is ready to start discussing with other European countries the possible deployment of French nuclear-armed jets.\n\nReutersRussia tells UN West must stop arming Ukraine during any ceasefireUNITED NATIONS (Reuters) -Russia is prepared to consider a ceasefire in Ukraine to pave the way for a lasting settlement, but during any truce Moscow wants Western states to stop arming Kyiv and for Ukraine to stop mobilising troops, Russia's U.N. ambassador said on Friday. However, Vassily Nebenzia told the U.N. Security Council that a simple ceasefire was not enough to end Moscow's more than three-year war in Ukraine.\n\nRolling StoneSenator Dismisses Medicaid Cuts Killing People: ‘Well, We’re All Going to Die’Iowa Republican Joni Ernst got existential when constituents at a town hall confronted her about the cuts in the GOP’s tax bill","url":"https://uk.news.yahoo.com/defence-secretary-announces-money-upgrade-230130954.html","image":"https://s.yimg.com/ny/api/res/1.2/vozDmUz823KLMML2hQPwhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/video.thepressassociation.com/9dc452d9d11ceb482e7afeb044078ac4","video":"","publish_date":"2025-05-30 23:01:30","author":"Pa Media: Video","authors":["Pa Media: Video"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.152},{"id":326624730,"title":"Justin Bieber seeks VERY unlikely source of comfort amid marriage woes with Hailey... as he tries to heal huge childhood wound","text":"EXCLUSIVEJustin Bieber seeks VERY unlikely source of comfort amid marriage woes with Hailey... as he tries to heal huge childhood wound\n\nREAD MORE: Hailey and Justin Bieber are 'at each other's throats'\n\nBy STEVE HELLING FOR DAILYMAIL.COM\n\nPublished: 21:21 BST, 30 May 2025 | Updated: 23:37 BST, 30 May 2025\n\nJustin Bieber's increasingly bizarre and erratic behavior has sparked concerns not only for his marriage, but also his mental wellbeing.\n\nDespite the turbulence - from seemingly dissing his wife Hailey Bieber to apparent public drug use - the troubled singer has reportedly found himself leaning on an unlikely source of stability... his parents.\n\nFor years, the hitmaker has struggled in his relationships with his mother, Pattie Mallette, and father, Jeremy Bieber, who has been described as being largely absent throughout much of Justin's adolescence.\n\nBut now, the Daily Mail can reveal Justin, 31, is focusing on healing those complicated relationships - something his wife Hailey, 28, is slower to achieve with her own parents Stephen and Kennya Baldwin. \n\n'Justin loves his parents very much,' said a source close to Justin. 'He has a complex relationship with them, but there's still a lot of love there.'\n\nJustin Bieber is focusing on healing his complicated relationship with his parents (pictured playing golf with dad Jeremy last week)\n\nJeremy Bieber was just 18 when Justin, now 31, was born, and struggled with becoming a father so young\n\nThe Canadian star, who went golfing with his father Jeremy last week, has been open about his struggles with his dad, who reportedly battled with addiction and allegedly was in county jail on the day Justin was born.\n\nSpeaking to Billboard in 2015, Justin said that Jeremy, who was just 18 when he became a parent, wasn't ready for fatherhood. \n\n'He was immature,' the singer said. 'He left for like a year when I was about four, went to British Columbia, came back on Father's Day. I remember my mom said, \"If you're going to be here, you have to be here.\" There's a misconception that he's this deadbeat dad, but he has been in my life since. I was with him on weekends and Wednesdays.'\n\nJeremy is said to have introduced Justin to music and taught him how to drive, but was reportedly not always the perfect role model for the rising star. \n\nWhen Justin was arrested in Miami and charged with a DUI while street racing in 2014, it was allegedly Jeremy who had blocked off the streets for his son's joyride.\n\nBut according to our insider, Justin is finally at peace with his father, now 49. \n\n'He's worked through all the absenteeism and he now respects his father for the man who he is,' they said. 'They are good.'\n\nIt is understood that Justin also maintains relationships with his three half-siblings and one stepsister.\n\nAfter Justin was born, Jeremy fathered two children with his then-girlfriend Erin Wagner: daughter, Jazmyn, 16, and son, Jaxon, 14.\n\nWhy Justin Bieber keeps humiliating his wife Hailey with brutal public betrayals: CAROLINE BULLOCK\n\nAfter they split in 2014, Jeremy went on to date Chelsey Bieber and the pair tying the knot in 2018. Chelsey was already a mom to daughter, Allie, now 18, but she and Jeremy welcomed their only child together, daughter Bay, in August 2018. \n\n'Justin loves them all, and they love him,' said our insider. 'They've got a good sibling relationship.'\n\nIt has clearly been a restorative time for Justin who is also healing wounds with his mother, Pattie Mallette, 50. The mother-son pair were estranged from 2013 to 2015, during which time Justin was arrested, dealt with drug use and faced a string of scandals.\n\n'I was distant because I was ashamed,' Justin told Billboard in 2015. 'I never wanted my mom to be disappointed in me and I knew she was. We spent some time not talking, so it takes time to rebuild that trust.'\n\nIn 2016, the singer revealed he hadn't been seeing his mom as much as he would have liked, admitting at the time, 'I’m a lot closer to my dad than I am to my mom.'\n\nNow, they are said to be tentatively back in contact. \n\n'He has his moments with Pattie, but right now, she's the one he talks to less frequently,' our insider said.\n\n'He's worked through all the absenteeism and he now respects his father for the man who he is,' said a source. 'They are good' (pictured in Paris in 2016)\n\nJustin and his mom Pattie Mallette have had an on-again, off-again relationship in recent years, but are tentatively in contact: 'He has his moments with Pattie'\n\nJustin and Hailey Bieber pictured with his three half-siblings, one stepsister, dad Jeremy and stepmom Chelsey \n\nBut it is not such a harmonious story for Hailey, who has kept her distance from her famous father, Stephen. The father-daughter duo have reportedly gone months without speaking, and are only just now beginning to send each other occasional texts and messages. \n\nThe model touched on her familial relations last year, revealing she was focused on her independence.\n\n'I'm not super close with my family at this point in my life,' she told W Magazine. 'Because I feel like I'm very independent. I'm my own individual now, and I've built my own family. But when I look back on my childhood and how I grew up, I have very fond, beautiful memories.'\n\nIt is understood that Hailey was left furious in February last year when her father Stephen took to Instagram to ask people to 'pray' for his daughter's marriage.\n\n'Hailey had a blowout with her family when her dad asked for prayers for Hailey and Justin,' an insider said at the time. 'She told him that she did not want him meddling in her life.' \n\nMeanwhile, a seperate insider claimed that even Hailey’s relationship with her mother, Kennya, was suffering and had 'started to break down when [Hailey] fell pregnant because she didn’t want to tell her family for months.' \n\nHailey and Justin welcome son Jack Blues in August last year.\n\nIn September, Stephen spoke briefly about being in 'grandpa mode' - this time being more careful with his words.\n\n'And of course, here comes Jack Blues Bieber,' he told People magazine. 'And yeah, he's just… I don't want to say too much. He's unbelievably cute.'\n\n'I'm not super close with my family at this point in my life,' she previously told W Magazine\n\nMeanwhile, Justin's wife Hailey is struggling to achieve the same with her parents Stephen and Kennya Baldwin (pictured in 2011 with her sister Alaia) \n\nHailey Bieber has a closer relationship with mom Kennya than father Stephen Baldwin, with the family growing apart when the model was pregnant with her son Jack \n\nAnd, as for Justin, relations are said to be showing signs of warming for the Baldwins and Hailey, who just announced she is selling her make-up brand Rhode in a deal worth up to $1 billion.\n\n'She's talking to them a bit more, nothing deep or serious,' said our source. 'She doesn't hate her parents by any means, but she doesn't always see eye to eye with them, and she's asserting her independence. She's 28 now.\n\n'Hailey's parents gave her a great childhood, better than what Justin had, and she appreciates that. They just are a lot for her to take sometimes, they give unwanted opinions, stick their nose in, and say things they shouldn't say publicly. It happens; they're parents.'\n\nHailey is said to have clashed with her parents over religion and politics. In 2017, the model, who threw her support behind former Vice President Kamala Harris, admitted her father's political leanings had been a 'big issue.' She claimed 'his opinions have [since] changed' but did not elaborate further.\n\nStephen and Kennya are die-hard evangelicals who are very open about their beliefs online.\n\n'These relationships are evolving, as always,' our source said. 'They'll continue to evolve. All four parents love Justin and Hailey, and they love Jack. Relationships are just complex sometimes.'\n\nShare or comment on this article:\nJustin Bieber seeks VERY unlikely source of comfort amid marriage woes with Hailey... as he tries to heal huge childhood wound\n\nAdd comment","summary":"Justin Bieber's increasingly bizarre and erratic behavior has sparked concerns not only for his marriage, but also his mental wellbeing.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14744041/Justin-Bieber-leans-unlikely-people-marriage-woes-rekindles-relationship.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/18/98867435-0-image-m-12_1748626609339.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/20/2300718579337285057/1024x576_MP4_2300718579337285057.mp4","publish_date":"2025-05-30 22:37:13","author":"Editor,Steve Helling","authors":["Editor","Steve Helling"],"language":"en","source_country":"gb","sentiment":0.604},{"id":326625054,"title":"EXCLUSIVE: Trump FBI 'Murder' Files Exposed As Ex Chief Caught in 'Plot to Kill The Don'","text":"FBI \"murder\" files have exposed an ex-director being caught in a plot to \"kill President Donald Trump.\"\n\nRadarOnline.com can reveal the commander-in-chief has found himself in yet another assassination plot — which was \"triggered\" by former FBI Director James Comey.The Chilling Instagram ThreatThe former FBI member, who was let go in 2017 amid his investigation of then-president Trump's alleged ties to Russia, is the subject of a Secret Service and FBI investigation following a suspected threat.\n\nThe former FBI director allegedly set the plan into motion with a coded message spelled out on a beach in seashells.\n\nAccording to sources, Comey posted a cryptic Instagram photo on May 15 that read \"86 47,\" with the message: \"Cool shell formation on my beach walk.\"\n\nThe message has been interpreted by some as a secret message suggesting to kill the 47th president.'Lock Him Up!'After the Instagram post was shared, Comey was brutally slammed on social media as Republicans insisted he was threatening President Trump's life and urged for him to be \"locked up.\"\n\nFBI Deputy Director Dan Bongino has ripped Comey and said he \"brought shame to the FBI badge — yet again.\"\n\nDirector of National Intelligence Tulsi Gabbard called for Comey to be \"put behind bars\" for \"issuing a hit\" on the president. \n\nThe president's son, Donald Trump Jr., also ripped on Comey over the call for his father \"to be murdered.\"Trump even had a few words for the ex-FBI director and said: \"He knew exactly what that meant. A child knows what that meant. If you’re the FBI director and you don’t know what that meant, that meant assassination. And it says it loud and clear.\"\n\nHowever, Comey, who deleted the message amid the brutal backlash, quickly claimed the shells were simply a \"political message.\"\n\n\"I didn’t realize some folks associate those numbers with violence,” he claimed, referring to \"86,\" which means to eliminate. \n\nComey once again claimed the message urging his followers to \"assassinate\" the president \"never\" occurred to him when he posted the photo.\n\nHomeland Security Secretary Kristi Noem revealed her department and the Secret Service are \"investigating this threat and will respond appropriately.\"Due to Comey's previous title and power in the FBI, intelligence experts have called the threat alarming.\n\nAn intelligence insider added: \"The fear is this message set the wheels in motion of something hatched long ago, probably in the run-up to the 2024 election. That’s how spooks operate, and Comey — for all his flaws and insufferable self-righteousness— is a professional.\"Trump's Previous Assassination AttemptsBefore President Trump returned to the Oval Office, he survived two prior attempts on his life before winning the 2024 presidential election against former Vice President Kamala Harris.\n\nIn July 2024, at one of his rallies in Butler, Pennsylvania, Trump was shot at by 20-year-old Thomas Matthew Crooks of Bethel Park, Pennsylvania.\n\nAfter the assassination attempt, Trump fell to the ground and was quickly surrounded by secret service agents before he stood up and threw his fist up in the air, shouting, \"Fight!\"\n\nJust months later in September, while he was golfing in West Palm Beach, Florida, the Secret Service caught an armed suspect outside the property.","summary":"FBI \"murder' files have exposed an ex-chief being caught in a plot to \"kill President Donald Trump.\"","url":"https://radaronline.com/p/trump-fbi-murder-files-exposed-ex-director-caught-plot-kill-president/","image":"https://media.radaronline.com/brand-img/oL0lRxJL9/0x0/hero-saved-life-attendee-donald-trump-assassination-aftermath-4-1720921930237.jpg","video":null,"publish_date":"2025-05-30 21:56:40","author":"Lauren McIver","authors":["Lauren McIver"],"language":"en","category":"politics","source_country":"us","sentiment":-0.243},{"id":326610386,"title":"Donald Trump fires National Portrait Gallery director for being ‘strong supporter’ of DEI","text":"President Donald Trump fired the director of the National Portrait Gallery, Kim Sajet, for being a “strong supporter” of diversity, equity and inclusion (DEI).\n\nTrump announced the termination in a post on Truth Social on Friday afternoon.\n\n“Upon the request and recommendation of many people, I am hereby terminating the employment of Kim Sajet as Director of the National Portrait Gallery,” the president wrote. “She is a highly partisan person, and a strong supporter of DEI, which is totally inappropriate for her position. Her replacement will be named shortly. Thank you for your attention to this matter!”\n\nA White House official told Fox News Digital that Sajet had donated $3,982 to Democrats, including presidential campaigns for former President Joe Biden and Hillary Clinton. Sajet also reportedly donated to other Democrats, including former Vice President Kamala Harris.\n\nThe White House also pointed to the gallery’s photo of Trump, which was curated by Sajet. The caption of the photo reads, “Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the US Capitol on January 6, 2021, he was acquitted by the Senate in both trials. After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837-1908) to have won a nonconsecutive second term.”\n\nThe White House official also said it was ironic that Sajet said, “We try very much not to editorialise. I don’t want by reading the label to get a sense of what the curator’s opinion is about that person. I want someone reading the label to understand that it’s based on historical fact.”\n\nThe National Portrait Gallery did not immediately respond to Fox News Digital’s request for comment on the matter.\n\nAccording to the National Portrait Gallery website, Sajet was the first woman to serve as the director of the National Portrait Gallery, and she spent time in the role looking for ways to put her experience and creativity at the center of learning and civic awareness.\n\nPrior to taking the position, Sajet was the president and CEO of the Historical Society of Pennsylvania, and held other positions at the Pennsylvania Academy of the Fine Arts and at the Philadelphia Museum of Art.\n\nHer biography notes that she was born in Nigeria, was raised in Australia and is a citizen of the Netherlands. She came to the U.S. with her family in 1997.\n\nHours after taking the Oath of Office on Inauguration Day on Jan. 20, Trump signed an executive order to eliminate all DEI programs from the federal government.\n\nA day later, the president directed the Office of Personnel Management to notify heads of agencies and departments to close all DEI offices and place those government workers in those offices on paid leave.\n\nEarlier this month, Trump fired Shira Perlmutter, who was in charge of the U.S. Copyright Office, which came just days after terminating the Librarian of Congress, Carla Hayden. The termination was part of the administration’s ongoing purge of government officials who are perceived to be opposed to Trump and his agenda.\n\nBoth women were notified of their termination by email, The Associated Press previously reported.\n\nHayden tapped Perlmutter to lead the Copyright Office in October 2020.","summary":"Firing follows executive orders halting federal diversity and inclusion efforts under Trump administration.","url":"https://nypost.com/2025/05/30/us-news/donald-trump-fires-national-portrait-gallery-director/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/2025-washington-dc-musk-served-105590925.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/1IcSd2j3-RyIcpnTz.mp4","publish_date":"2025-05-30 21:36:02","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.069},{"id":326622536,"title":"The Stain of George Floyd Riots on America, 5 Years Later","text":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see more of his videos.\n\nHello, this is Victor Davis Hanson for The Daily Signal. This week was the fifth anniversary, May 25, of the tragic death of George Floyd. \n\nIt seems that it just happened but it was actually five years ago. And almost everything that has transpired after that in terms of racial relations has been disastrous. And now, maybe at the end of five years, we can look back with a little bit more circumspection and see what actually happened. \n\nGeorge Floyd was a career felon. He was in the process of trying to pass off counterfeit bills. He was reportedly under the influence of severe, powerful drugs, perhaps fentanyl, in addition. He may have been suffering from post-COVID-19 syndromes. He had a heart condition. One of his prior felonies was putting a gun to a woman’s belly in a home invasion.\n\nNevertheless, when he tried to pass this counterfeit bill, the store owner called the Minneapolis police. They tried to arrest him. He resisted arrest. He was a very big man. And then Officer Derek Chauvin, who was supposedly an expert in techniques that were institutionalized by the Minneapolis Police Department, unfortunately, put his knee on George Floyd’s neck. And there were varying autopsies. One said that killed him. Another one, perhaps, said it didn’t.\n\nBut nevertheless, the expression on Officer Chauvin’s face was frozen into eternity. And that sparked the idea that he was a white policeman conducting a typical murder of an unarmed black suspect. And what followed was near mayhem.\n\nOfficer Chauvin, remember, was convicted of second- or third-degree murder. He was sentenced to 20 years. His appeals have run out with the Supreme Court. He’ll be in prison probably for much of his life. George Floyd, of course, died at the hospital or on the way to the hospital.\n\nAnd what happened immediately was this huge riot, five years ago. Unlike the Jan. 6 riot, this thing went on for the end of May, June, July, August, September. Remember, former Vice President Kamala Harris said it wasn’t going to stop, nor should it stop. It’s going to keep going to Election Day. She said that, of course. Then later, when called on it, she said she didn’t mean the violent aspect.\n\nBut violent aspects there were. There was $2 billion in damage. There was a police precinct burned to the ground in Minneapolis. There was a federal courthouse that was burned. There was a historic St. John’s Church—across from the White House—that was torched. A mob tried to go into the White House grounds and reach the president. \n\nBut even more serious than all of that, we were coming off COVID-19. People had been in a lockdown. There had been a national quarantine. And their news was from the television in an isolated situation in their own home with no human interaction.\n\nSo, these riots were kind of an expression of breaking out. And more importantly, they were subject to rumor, suspicion, lies. And one of the great lies was that George Floyd was iconic or emblematic of young black men, middle-aged black men that were systematically being killed while unarmed by the police. That was not true. The Washington Post even said it wasn’t. \n\nThat year there were only 18 black males who were stopped by the police in the entire population of 340 million people. This year there were only 10. It was proportionate to the number of people by race who were stopped by the police, 11 million or 12 million each year. \n\nProfessor Ibram X. Kendi and professor Robin DiAngelo, or journalist DiAngelo, they created this idea of systemic racism. And you had to be racist in an anti-racist fashion. In other words, the only way to deal with this systemic racism was to be pro-black. \n\nAnd what followed then was a defunding of the police. It caused a huge spike in crime. I think 20,000 murders in 2020. The Black Lives Matter group was energized. And now as we look back at it, the architects of that movement have ensconced with the money. It has collapsed. The women that were in charge have, apparently, embezzled the money or taken it. They have nice homes. But it’s an inert group.\n\nIt had a lot of other deleterious effects. Universities trying to get in on the virtue signaling and performance-art caring dropped the SAT. They dropped the comparative ranking of high school GPA. They dropped meritocracy. They started really enforcing DEI, in the sense of loyalty owes—you have to show us that you’re loyal to the concept of DEI, that you’ve done something for it, or we’re not going to hire you. And the universities then went into something that we could call repertory admissions.\n\nFast forward five years, looking back, and looking at all the damage of the downtowns in America—many of them that were destroyed. Today they have not recovered, in many cases. Look at the intense dissension and acrimony and racial relations that related to it. Look at the universities who were chastised by the Supreme Court for using race in a racist fashion in admissions. They’ve been discredited. And the people who capitalize on the death of George Floyd are, for the most part, discredited.\n\nAnd the country now is learning its lessons. It’s trying to find a sober solution, a reaction. I think they’re trying—we’re trying to come to a conclusion. Why in the world did we go completely collectively insane? And the result of that is we don’t think the quarantines were a good idea. They were more injurious to the country than was COVID-19 itself.\n\nWe don’t think and we know that the police should be defunded. Much less are they attacking black unarmed males. Just the opposite is happening.\n\nWe look at the career of professor Kendi, he went through $45 million at Boston University for an anti-racism center. And apparently, the money was squandered. I mentioned the BLM squandering.\n\nSo, we’re getting back to the idea that, when you use race in any fashion, for bias or preference, it’s racist. It doesn’t matter what professor Kendi says or it doesn’t matter about the reactions to the death of George Floyd, it’s racist.\n\nAs far as George Floyd is concerned, had Officer Chauvin not had that expression on his face and had he lifted his knee up when George Floyd said he couldn’t breathe, this entire catastrophe probably could have been avoided—or maybe not because there were people who were looking for an occasion like this to spread mayhem and to recalibrate race relations in the United States into what they would call anti-racism. Which means it’s permissible for someone who considers themself a victim to be a victimizer. If you think you’re a victim of racism, then you can use racial preferences yourself with impunity. \n\nIn any case, it was a sad chapter in American history.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\n\n\nThe post The Stain of George Floyd Riots on America, 5 Years Later appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/30/the-stain-of-george-floyd-riots-on-america-5-years-later/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/GettyImages-1249837634.jpg","video":null,"publish_date":"2025-05-30 21:19:28","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.337},{"id":326605804,"title":"Kamala Harris' 2028 Chances Drop in New Poll","text":"Former Vice President Kamala Harris' polling numbers dropped in the latest AtlasIntel poll of the potential 2028 Democratic primary field.Newsweek reached out to Harris' political team for comment via her contact form.Why It MattersHarris is viewed as a potential 2028 presidential candidate despite her loss to President Donald Trump in last year's election, as many Democrats feel she ran a solid campaign despite being weighed down by inflation and former President Joe Biden's unpopularity. Others, however, are backing other candidates and view her campaign as flawed, pointing to her embrace of Republicans like former Representative Liz Cheney and her approach to voters who disapproved of the Biden administration's approach to the conflict between Israel and Hamas.Although the primary is still years away, Democrats are already debating who would make their strongest candidate and who is best poised to win back voter groups that shifted toward Republicans last November, including Latino voters and young voters.One political scientist told Newsweek her polling slump could be tied to new revelations about Biden's health—a question that could follow Democrats into the midterms and 2028 race.What to KnowThe new poll found that two potential presidential candidates—former Transportation Secretary Pete Buttigieg and Representative Alexandria Ocasio-Cortez of New York—are ahead of Harris.Nearly 32 percent of Democrats said they are leaning toward Buttigieg, while about 19 percent said they are planning to vote for Ocasio-Cortez. Only 17 percent said they are planning to cast their ballot for Harris in 2028 if she runs.That's down from the April AtlasIntel poll when 24 percent said they planned to back Harris. That poll found that 28 percent of respondents were planning to vote for Buttigieg, while 16 percent leaned toward Ocasio-Cortez.In the latest poll, New Jersey Senator Cory Booker placed fourth with 10 percent support, while California Governor Gavin Newsom followed with 7 percent.Grant Davis Reeher, professor of political science at Syracuse University, told Newsweek it's unsurprising her polling has dropped.\"I'd attribute it to the recent further revelations about Biden and the effort to hide his actual condition,\" he said. \"This will taint her, unless she wants to claim she was so irrelevant in the Biden administration that she was completely out of the inner loop.\"Reeher said he is \"stunned\" she is still being discussed and that Democrats need to nominate someone who is \"more mainstream\" and \"not from the most liberal part of the country.\"The latest poll surveyed 3,469 adults from May 21 to May 27, compared with the other poll that surveyed 2,347 adults from April 10 to April 14. Both had a margin of error of plus or minus 2 percentage points.Is Kamala Harris Running for President Again? What We KnowHarris is speculated to be eyeing a presidential bid or a possible campaign for governor of California, where she served as attorney general and senator. However, she has not said for sure what her next step is.Harris could make a decision about whether to run in California by the end of the summer. Polls suggest she'd be the favorite in the race in the solidly Democratic state. However, she has faced attacks from candidate Antonio Villaraigosa, the former Democratic mayor of Los Angeles, over an alleged \"cover up\" of Biden's health.What Do Other Polls Say About Harris' 2028 Chances?Other recent polls show Harris with a lead over other potential Democrats. A McLaughlin poll, for instance, showed her with 29 percent support. Buttigieg followed with 10 percent, and 9 percent backed Ocasio-Cortez. It surveyed 1,000 registered voters from May 21 to May 26.An Echelon Insights poll from earlier in May showed her with a similar lead with 32 percent compared to Buttigieg's 10 percent. It surveyed 1,000 voters from May 8 to May 12, 2025, and had a margin of error of plus or minus 3.8 percentage points.An April Data for Progress poll, on the other hand, showed a closer race between Harris, Buttigieg and Ocasio-Cortez.What People Are SayingReeher told Newsweek that Democratic hopefuls are \"in a quandary.\"\"The party's brand is not strong, so how much should they be putting themselves out there trying to grab attention? The best play might be to wait for the midterms and then start advertising themselves. Unless the strategy is to separate in important respects from the Democratic mainstream, and in that case articulating that difference early might help. But that's not her campaign, I don't think.\"Harris, speaking about her plans earlier this year while visiting sites impacted by the Los Angeles-area wildfires: \"My plans are to be in touch with my community, to be in touch with the leaders and figure out what I can do to support them...I am here and would be here regardless of the office I hold, because it is the right thing to do, which is to show up in your community and thank the folks who are on the ground.\"What Happens NextMost candidates are unlikely to jump into the race until after the 2026 midterms, but speculation will continue about who is likely to run. Buttigieg opted not to run for office in Michigan, fueling speculation he could be gearing up for another presidential run. Ocasio-Cortez has not commented on speculation that she could run, but others have also floated her as a potential Senate candidate in 2028.","summary":"Two Democrats held a lead over Harris in the latest 2028 Democratic primary poll.","url":"https://www.newsweek.com/kamala-harris-2028-chances-drop-new-poll-2079234","image":"https://d.newsweek.com/en/full/2654450/kamala-harris-2028-poll.jpg","video":null,"publish_date":"2025-05-30 21:10:31","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.145},{"id":326627642,"title":"New poll shows who Dems want in 2028 — and it’s not Kamala Harris","text":"A new poll reveals that Kamala Harris is not the number one choice for Democrats in the 2028 presidential primary.\n\nThe poll, released on May 30 by Atlas Intel, found Pete Buttigieg, the former mayor of South Bend, Indiana, and former transportation secretary in the Biden administration, to be the top pick among Democrats who responded to the survey.\n\nA total of 31.5% of self-identified Democrats who responded to the poll said they would vote for Buttigieg for president in four years, according to the poll.\n\nOther surveys in May from firms such as Echelon Insights and McLaughlin & Associates have found Harris in first place in the hypothetical primary, making Atlas Intel’s poll stand out among the rest.\n\nHarris is the third most popular pick among Democrats in the poll, falling behind U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y.\n\nAmong Democrats, 19.4% said they would vote for Ocasio-Cortez, while 16.6% said they would vote for Harris.\n\nWhile Buttigieg, Ocasio-Cortez and Harris are the top three picks for Democrats, none of them have made explicit statements saying they will run for president.\n\nHarris herself has been weighing a run for governor in California or another run for president, according to CBS News.\n\nU.S. Sen. Cory Booker, D-N.J., was the fourth most popular pick for presidential candidate among Democrats, with 10.4% saying they would vote for him. Behind Booker is California Gov. Gavin Newsom with 7.1%, followed by Pennsylvania Gov. Josh Shapiro at 4.8% and Michigan Gov. Gretchen Whitmer with 3.7%, according to the poll.\n\nA total of 3.6% of the Democrats surveyed replied “none of the above,” and 1.4% said they would vote for U.S. Sen. Raphael Warnock, D-Ga.\n\nThe Atlas Intel poll was conducted between May 21 and May 27 with a sample size of 3,469 U.S. adults and a margin of error of plus or minus 2.2%.\n\nMore on Politics\n\nRead the original article on MassLive.","url":"https://www.yahoo.com/news/poll-shows-dems-want-2028-203419834.html","image":"https://s.yimg.com/ny/api/res/1.2/RBgQ57Lh69cvfgvx6b8eow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjg-/https://media.zenfs.com/en/masslive_articles_390/0e32a5c21bd3824543e5d1f2dd213410","video":null,"publish_date":"2025-05-30 20:34:19","author":"Adam Bass","authors":["Adam Bass"],"language":"en","source_country":"us","sentiment":0.131},{"id":326620730,"title":"Guest Opinion: Waving the flag could turn the tables on Trump and the GOP, by Laura Washington","text":"Waving the flag is as American as apple pie. For years, Republicans have painted Democrats as far-left extremists and America haters, to disastrous effect. It’s time to turn the tables.\n\nFlag-shagging, as it’s known in the United Kingdom, is the “uncouth vernacular for overt displays of patriotism,” according to a recent essay in The Economist. Last year, it helped the British Labour Party regain a majority in Parliament.\n\nPresident Donald Trump’s caterwauling about the Democrats’ hatred of the military and the nation is epic. He has called Democrats “treasonous” and “un-American.” Trump’s rants have no basis in fact, but if you bellow loud enough and often enough, it sinks in.\n\n“They certainly didn’t seem to love our country very much. It’s very sad,” Trump said. Such accusations are echoed up and down the ranks of the Republican leadership, running wild and freely.\n\nAt a campaign rally in his Ohio hometown, then-Republican vice presidential nominee JD Vance attacked prospective Democratic presidential nominee Kamala Harris by questioning her patriotism. When Harris gives a speech, Vance claimed, “she talks about the history of this country not with appreciation but with condemnation.”\n\nHe piled on: “Not everything’s perfect. It’s never going to be. But you, if you want to lead this country, you should feel grateful for it. You should feel a sense of gratitude. And I never hear that gratitude come through when I listen to Kamala Harris.”\n\nIt was an echo of attacks leveled at former first lady Michelle Obama during her husband’s 2008 presidential campaign.\n\nThe Republicans are particularly good at this trope.\n\nBack in 2020, a first-term congressman from Texas targeted U.S. Sen. Tammy Duckworth. U.S. Rep. Dan Crenshaw criticized Duckworth for suggesting that the issue of removal of statues and monuments of controversial Founding Fathers should be debated.\n\nCrenshaw, a former Navy SEAL, said Duckworth was supporting the “destruction of America.”\n\n“I think a general message that the left stands for the destruction of America and the right doesn’t probably works pretty well with veterans, even liberal ones, because even liberal veterans probably don’t agree with that, unless you’re Tammy Duckworth,” he declared.\n\nDuckworth is a retired Army National Guard lieutenant colonel. She lost her legs serving in combat in the Iraq War.\n\nDemocrats have work to do. According to a 2024 Gallup poll, 41 percent of adults said they were “extremely proud” to be American, and another 26 percent said they were “very proud.”\n\nOver the years, patriotic pride among Republicans “has consistently outpaced that of Democrats,” according to Gallup. In 2024, 59 percent of Republicans, 34 percent of Democrats and 36 percent of independents said they were “extremely proud” to be American.\n\nFlag-shagging, by wrapping yourself snugly in the American flag, is what the Democrats should do. There is no downside.\n\nThey need to stop being the party that stands up for the protester who burns our flag. Let the U.S. Supreme Court deal with the free speech issues. Flag burning cannot be the Democrats’ epithet. They don’t have to support massive military budgets, but they should staunchly support our troops and veterans.\n\nDemocrats might consider the example of Rahm Emanuel, the prominent Democrat, former U.S. ambassador to Japan and former Chicago mayor. He is back in town and on a political redemption tour.\n\nThis month, Emanuel held an event to showcase a program he is spearheading to support Chicago Public Schools students who are enrolled in ROTC. He announced that he and his wife, Amy Rule, are establishing an ROTC scholarship and naming it after Adm. Lisa Franchetti, who was the first woman to serve as chief of naval operations and the first woman to serve on the Joint Chiefs of Staff, until she was inexplicably fired by the Trump administration.\n\nTwelve graduates of the CPS Junior ROTC received a scholarship check from Emanuel to fund $10,000 a year toward their college education. Franchetti appeared with Emanuel to congratulate the students.\n\nI’m no Rahm fan, but that’s savvy politics.\n\nLast August, the politicians were falling all over themselves with patriotism at the 2024 Democratic National Convention. Their floor speeches were laced with odes to America. “USA” signs flooded the zone at Chicago’s United Center.\n\nIn return, the Democrats enjoyed a post-convention bump in the polls. Their flag-shagging had Trump on the run.\n\nSince then, not so much. The Democrats must overcome their natural inclination to duck.\n\nErring on the side of patriotism is not a political sin. It’s a virtue. It’s sort of like being in favor of motherhood. Who’s against that?\n\nRailing against the oligarchy will get the Democrats only so far. Instead, go full tilt into waving the flag.","summary":"Waving the flag is as American as apple pie. For years, Republicans have painted Democrats as far-left extremists and America haters, to disastrous effect. It’s time to turn the tables.","url":"https://www.keenesentinel.com/opinion/op-ed/guest-opinion-waving-the-flag-could-turn-the-tables-on-trump-and-the-gop-by/article_acd7e981-f6b1-4fa7-86fc-c5bc000567d7.html","image":"https://bloximages.chicago2.vip.townnews.com/keenesentinel.com/content/tncms/custom/image/6260defe-c779-11ef-bd8a-c733c01e3345.jpg?resize=600%2C315","video":null,"publish_date":"2025-05-30 20:30:00","author":"Laura Washington","authors":["Laura Washington"],"language":"en","category":"politics","source_country":"us","sentiment":-0.071},{"id":326600802,"title":"EXCLUSIVE: Why Trump Fired the Director of the National Portrait Gallery","text":"FIRST ON THE DAILY SIGNAL—President Donald Trump has fired the director of the National Portrait Gallery because of her history of pushing woke ideology, donating to Democrats, and denigrating Republicans, a White House official told The Daily Signal.\n\nKim Sajet has donated $3,982.40 to Democrats, including Joe Biden’s presidential campaign, Hillary Clinton’s 2016 presidential campaign, the DCCC, and EMILY’s List, an organization that helps pro-abortion Democratic candidates win elections.\n\nSajet has also donated to Democrats, including Sen. Kirsten Gillibrand of New York, former Vice President Kamala Harris, and former Rep. Colin Allred of Texas, among others, through ActBlue.\n\nTrump announced he fired Sajet on TruthSocial on Friday. Her ouster closely follows the firings of the Librarian of Congress, the chairman of the Joint Chiefs of Staff, and the U.S. Coast Guard commandant over similar concerns of wokeness.\n\n“She is a highly partisan person, and a strong supporter of [diversity, equity, and inclusion], which is totally inappropriate for her position. Her replacement will be named shortly,” the president said of the Nigeria-born Australian native, who is a citizen of the Netherlands.\n\nThe photo of Trump in the Portrait Gallery in Washington, D.C., curated by Sajet, has the following caption: “Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the U.S. Capitol on January 6, 2021, he was acquitted by the Senate in both trials. After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837-1908) to have won a nonconsecutive second term.”\n\nYet Sajet told The Washingtonian magazine the gallery tries not to editorialize in captions.\n\n“We try very much not to editorialize,” Sajet said. “I don’t want, by reading the label, to get a sense of what the curator’s opinion is about that person. I want someone reading the label to understand that it’s based on historical fact.”\n\nIn 2018, Sajet wrote an editorial in The Atlantic revealing her support for critical race theory.\n\n“To step outside of comfort zones and be confronted and uncomfortably reminded—that the ‘portrait of America’ has never been only about meritocracy, but also social access, racial inequality, gender difference, religious preference, and political power,” Sajet wrote. \n\n“As we approach Columbus Day, increasingly being recognized as a day of Indigenous lamentation that prophetically coincides with the 50th anniversary of this museum’s opening in 1968; we need to remember that we did not ‘find’ a ‘New World’ but invaded an old one,” she continued, “We aren’t just a world leader, but a global participant, and in the end as we enter this world with nothing, and leave this world with nothing—it’s what we do in the middle that counts.”\n\nWhen Sajet joined the Portrait Gallery in 2013, she made it her mission to spend 50% of all money spent on art to support diverse artists and portrait subjects, USA Today wrote in 2019.\n\n“Sajet says white men dominated famous portraits because they owned land, and art was historically reserved for the rich and elite,” the reporter, Nicquel Terry Ellis, said.\n\nIn an article in The New Yorker, Sajet sought to gloss over the dark past of Planned Parenthood founder and known eugenics enthusiast, Margaret Sanger.\n\nWhen Sen. Ted Cruz, R-Texas, attempted to get Sanger’s portrait removed from the Portrait Gallery, Sajet said: “There are bad guys; we know what they’ve done,” Sajet said. “Margaret Sanger is being demonized for a lot of things she didn’t do.”\n\nSajet said Sanger was “not perfect,” nor was she a “eugenicist leader.”\n\nThe now former Portrait Gallery director wrote a blog post in 2018 “explaining why traditional portraiture has been so non-diverse.”\n\nShe tweeted about “opening a dialogue about culturally constructed racism” at the Portrait Gallery.","summary":"FIRST ON THE DAILY SIGNAL—President Donald Trump has fired the&#160;director of the National&#160;Portrait Gallery because of her history of pushing woke ideology, donating to Democrats,... Read More\n\n\nThe post EXCLUSIVE: Why Trump Fired the Director of the National Portrait Gallery appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/30/exclusive-why-trump-fired-director-national-portrait-gallery/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/portrait.jpg","video":null,"publish_date":"2025-05-30 20:22:34","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","source_country":"us","sentiment":-0.088},{"id":326594838,"title":"Donald Trump fires National Portrait Gallery director for being 'strong supporter' of DEI","text":"President Donald Trump fired the director of the National Portrait Gallery, Kim Sajet, for being a \"strong supporter\" of diversity, equity and inclusion (DEI). Trump announced the termination in a post on Truth Social on Friday afternoon. \"Upon the request and recommendation of many people, I am hereby terminating the employment of Kim Sajet as Director of the National Portrait Gallery,\" the president wrote. \"She is a highly partisan person, and a strong supporter of DEI, which is totally inappropriate for her position. Her replacement will be named shortly. Thank you for your attention to this matter!\" A White House official told Fox News Digital that Sajet had donated $3,982 to Democrats, including presidential campaigns for former President Joe Biden and Hillary Clinton. Sajet also reportedly donated to other Democrats, including former Vice President Kamala Harris. DEMS ERUPT AFTER REPORT OF TRUMP FIRING LIBRARIAN OF CONGRESS: ‘A DISGRACE’ The White House also pointed to the gallery's photo of Trump, which was curated by Sajet. The caption of the photo reads, \"Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the US Capitol on January 6, 2021, he was acquitted by the Senate in both trials. After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837-1908) to have won a nonconsecutive second term.\" The White House official also said it was ironic that Sajet said, \"We try very much not to editorialise. I don’t want by reading the label to get a sense of what the curator’s opinion is about that person. I want someone reading the label to understand that it’s based on historical fact.\" The National Portrait Gallery did not immediately respond to Fox News Digital’s request for comment on the matter. WHITE HOUSE VOWS TO IMPLEMENT 'SYSTEM OF MERIT' IN US, DISMANTLE DEI 'STRANGULATION' According to the National Portrait Gallery website, Sajet was the first woman to serve as the director of the National Portrait Gallery, and she spent time in the role looking for ways to put her experience and creativity at the center of learning and civic awareness. Prior to taking the position, Sajet was the president and CEO of the Historical Society of Pennsylvania, and held other positions at the Pennsylvania Academy of the Fine Arts and at the Philadelphia Museum of Art. Her biography notes that she was born in Nigeria, was raised in Australia and is a citizen of the Netherlands. She came to the U.S. with her family in 1997. DEFUNDING DEI: HERE’S HOW THE TRUMP ADMINISTRATION HAS UNDONE BIDEN’S VERY PRIZED PROGRAMS Hours after taking the Oath of Office on Inauguration Day on Jan. 20, Trump signed an executive order to eliminate all DEI programs from the federal government. A day later, the president directed the Office of Personnel Management to notify heads of agencies and departments to close all DEI offices and place those government workers in those offices on paid leave. Earlier this month, Trump fired Shira Perlmutter, who was in charge of the U.S. Copyright Office, which came just days after terminating the Librarian of Congress, Carla Hayden. The termination was part of the administration’s ongoing purge of government officials who are perceived to be opposed to Trump and his agenda. CLICK HERE TO GET THE FOX NEWS APP Both women were notified of their termination by email, The Associated Press previously reported. Hayden tapped Perlmutter to lead the Copyright Office in October 2020. Fox News Digital's Brooke Singman and The Associated Press contributed to this report.","summary":"President Donald Trump dismisses Kim Sajet from the National Portrait Gallery, citing her support for DEI as inappropriate, amid a broader purge of officials opposing his agenda.","url":"https://www.foxnews.com/politics/donald-trump-fires-national-portrait-gallery-director-strong-supporter-dei","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-sajet.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-30 20:02:23","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","category":"politics","source_country":"US","sentiment":0.011},{"id":326578876,"title":"Rep. Alexandria Ocasio-Cortez Praises Bad Bunny for ‘Political’ Album ‘Debí Tirar Más Fotos’","text":"What does Alexandria Ocasio-Cortez listen to when she’s fighting for change or passing legislation on Capitol Hill? A lot of Bad Bunny, as it turns out.\n\n In a new interview with Rolling Stone published Friday (May 30), the politician opened up about policy, the Donald Trump administration and, of course, her favorite tunes. “I have had the Bad Bunny album on repeat,” she told the publication, referencing 2025’s four-week Billboard 200 chart-topper Debi Tirar Mas Fotos.\n\n “As a Puerto Rican, the album is very cathartic, and it’s very political,” AOC continued. “It speaks to a lot of what’s happening to us and our people right now.”\n\n The New York native added that she loves how the rapper is “bringing salsa back.” “Rauw Alejandro is doing that, too,” she noted. “I’m a big salsa person. It’s such a nice outlet. I like it because the lyricism is so dramatic. Everyone’s breaking up, everyone’s got the love of their life. It’s so funny.”\n\n AOC’s praise of the “Titi Me Pregunto” artist comes as he’s touring the globe in support of his new album, traveling around Latin America, Asia, Australia and Europe. He’s also been breaking numerous records while he’s at it, from becoming the first Latin act to ever sell out a stadium concert in Australia to selling all-time high amounts of tickets in France, Italy, Poland, Portugal and Sweden for a Latin artist.\n\n Other than his upcoming residency in Puerto Rico, however, Bunny is notably skipping the United States on his tour. When asked for her thoughts, Ocasio-Cortez told RS, “We just don’t have figures like that anymore.” \n\n “I think about the Civil Rights Movement, and I think about people like Harry Belafonte and all of these artists who really did risk everything, risk their careers and their popularity in order to support and take part in people’s movements, and to use their art … it’s more rare now, or at least it feels that way,” she continued. “I wasn’t around then. The pressures of the industry are to be as broad as possible. When you have someone who does something gutsy like that, first of all, people come through for it, and it’s super compelling.”\n\n To the representative’s point about Bunny being political, the three-time Grammy winner is also active in politics outside of his music. In the 2024 U.S. election, he supported Kamala Harris’ campaign for president, boosting her messaging about what was at stake for Puerto Rican voters. \n\n Several other Latin stars — including Luis Fonsi, Marc Anthony and Ricky Martin — also expressed support for Harris, though others backed Trump. In September, AOC dissed Nicky Jam and Anuel AA for endorsing the twice-impeached PTOUS during a congressional hearing. \n\n “I suppose that puts you and Nicky Jam and Anuel in the same boat,” she told Mark Krikorian, the executive director of the far-right Center for Immigration Studies, after he claimed not to remember Trump saying he wanted to “sell” Puerto Rico.","summary":"The politician also lauded the rapper and Rauw Alejandro for \"bringing salsa back.\"","url":"https://www.billboard.com/music/music-news/alexandria-ocasio-cortez-praises-bad-bunny-political-music-1235986181/","image":"https://www.billboard.com/wp-content/uploads/2025/05/Alexandria-Ocasio-Cortez-april-2025-billboard-1548.jpg","video":null,"publish_date":"2025-05-30 19:19:36","author":"Hannah Dailey","authors":["Hannah Dailey"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.058},{"id":326565200,"title":"‘I’d Have Beaten Them’: Biden Dismisses Dems Who Say He Shouldn’t Have Run For Reelection","text":"Former President Joe Biden on Friday fired back at Democrats who have come out against his 2024 reelection bid in Delaware on Friday after delivering remarks at a Memorial Day event.\n\nSince reporting has come out about Biden’s decline, Democrats have questioned whether the former president should have run for a second term in office. When a reporter pressed him on it, Biden asked why the Democrats critical of him did not challenge him, answering his own question by asserting they would have lost if they had. (RELATED: Doocy Asks Karoline Leavitt If Trump Is ‘Worried’ About Quality Of White House Medical Care After Biden Diagnosis)\n\n“Why didn’t they run against me then? Because I’d have beaten them,” Biden asserted.\n\nThe reporter followed up by asking if he had “any regrets.”\n\n“No, I don’t have any regrets,” the former president said.\n\n“There’s a lot going on and I think we’re at a really difficult moment. Not only in American history, but in world history. I think we’re at one of those inflection points in history where the decisions we make in the next little bit are going to determine what things look like in the next 20 years,” he added. “I’ve been talking about that for a long time. And I’m very proud. I put my record as president against any president at all.”\n\nThe former president was diagnosed with an “aggressive form” of prostate cancer that has metastasized to the bones on May 16, his personal office announced on May 18. Biden also updated reporters about his cancer treatment after his speech.\n\n“It’s all a matter of taking a pill, one particular pill. And for the next six weeks, and then another one,” he said. “And the expectation is we’re gonna be able to beat this. It’s not in any organ. My bones are strong. It hasn’t penetrated. So I’m feeling good.”\n\nDuring the speech, Biden couldn’t quite finish reciting the most famous line in the Declaration of Independence.\n\n“We hold these truths to be self-evident, that all men and women are created equal, endowed by their Creator, with certain unalienable rights, life, liberty, pursuit of ha — we made it!” he yelled. “That’s who we are! That’s what makes America the most unique nation in the world. Literally, not figuratively.”\n\nThe announcement of Biden’s diagnosis came just two days before the release of a book titled “Original Sin” about his physical and mental decline — and its cover-up — while in office.\n\nBiden had a disastrous debate performance against President Donald Trump on June 27. He dropped out of the race on July 21 and endorsed former Vice President Kamala Harris, who lost all seven swing states and the popular vote to Trump in November.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'I'd have beaten them'","url":"https://dailycaller.com/2025/05/30/biden-fires-back-dem-critics-running-reelection/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/Screenshot-2025-05-30-2.03.58-PM-e1748628286628.png","video":null,"publish_date":"2025-05-30 18:21:38","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.251},{"id":326568904,"title":"Homeland Security Calls Out These Municipalities for Refusing to Comply With Immigration Enforcement","text":"Is your community on “the list”?\n\nThe Department of Homeland Security has published a list designed to put 500 municipalities on notice for their continued refusal to comply with federal law when it comes to immigration enforcement.\n\n“These sanctuary city politicians are endangering Americans and our law enforcement in order to protect violent criminal illegal aliens,” said DHS Secretary Kristi Noem.\n\nDHS said that the leadership of each municipality will receive formal notification that the federal government has deemed them noncompliant and whether the locality is believed to be in violation of any federal criminal statutes.\n\nThe complete list was published Thursday on the department’s website: https://www.dhs.gov/sanctuary-jurisdictions.\n\nVirginia’s list offers a few surprises, like Augusta County, which is seen as more conservative than the cities of Staunton or Waynesboro located within it, which were not on the list. In 2024, Donald Trump carried Augusta 73% to 25% (Kamala Harris won Staunton and lost by a much closer margin in Waynesboro).\n\nThe Daily Signal reached out to Sheriff Donald Smith of Augusta for comment, but as of publication, he had not responded.\n\nAlbemarle County, also on the list along with the city of Charlottesville, issued a statement saying, “The enforcement of federal law is the responsibility of the federal government, and Albemarle County complies with those laws.”\n\nA former commonwealth’s attorney for Albemarle County, Robert Tracci, told The Daily Signal that during his 2016 to 2019 tenure, he “led successful efforts with [then-]Sheriff Chip Harding to maintain pre-release [criminal detainers] to Immigration and Customs Enforcement.”\n\nThe Virginia counties on the DHS list are Albemarle, Amherst, Arlington, Augusta, Brunswick, Charlotte, Chesterfield, Dinwiddie, Fairfax, Gloucester, Halifax, Hanover, Henrico, Martinsville, Middlesex, Prince William, Rappahannock, Richmond, Tazewell, and Warren.\n\nThe cities on the list are Abingdon, Alexandria, Charlottesville, Duffield, Hampton, Lynchburg, Manassas, Martinsville, Newport News, Portsmouth, Richmond, Tazewell, and Virginia Beach.","summary":"Is your community on “the list”? The Department of Homeland Security has published a list designed to put 500 municipalities on notice for their continued... Read More\n\n\nThe post Homeland Security Calls Out These Municipalities for Refusing to Comply With Immigration Enforcement appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/30/homeland-security-calls-these-municipalities-refusing-comply-immigration-enforcement/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/sanctuary-2.jpg","video":null,"publish_date":"2025-05-30 18:10:00","author":"Joe Thomas","authors":["Joe Thomas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.091},{"id":326559382,"title":"Democrats and Their DEI Albatrosses","text":"A few Democrat officeholders, activists, and pundits are finally coming to their senses that their brand is toxic to a majority of the American people.The Biden administration killed what was left of it in a number of ways.First, it serially lied to Americans about the cognitive decline and cancerous condition of President Joe Biden, both while in and after office.Only when caught did the complicit media fess up that the Biden inner circle serially misled the American people about Biden’s inability to fulfill the duties of the presidency.Second, left-wing politicos used Biden as a waxen effigy. His job was to pose as a “moderate” cover to push through the most radical and unpopular agenda in the last half century.Only that way could “Old Joe Biden from Scranton” and his backroom handlers ram down the throat of the American people unpopular policies that nearly wrecked the country: hyperinflation and $7 trillion in new debt, weaponization of the government, and partisan lawfare, an open border and 12 million illegal aliens, a racialist DEI commissariat, a crackpot Green New Deal, defunding the police, biological men competing in girls’ sports, and two theater-wide wars abroad.Third, without either a functional president or viable initiatives, the new hard-left Democrats sought to brand Donald Trump as “Hitler” and half the country who supported him as “fascists.”For nearly nine years, the Democrats launched one failed hoax after another on the American people: “Russian collusion,” “laptop disinformation,” and the lying so-called 51 intelligence authorities. They proved quite willing to undermine the rule of law by manipulating the court system in efforts to destroy their bogeyman, Trump.\n\nNever had the American people seen a political party engineer 93 bogus indictments of a rival candidate and ex-president. Two dozen states tried to take Trump off their presidential ballots. And the Biden Department of Justice sicced an FBI SWAT team to barge into Trump’s home.The people finally got tired of all the potty-mouthed Democrat videos, the congressional stunts and meltdowns, the pampered rich kids rioting on elite campuses, the knee-jerk obsessions with racial slurs, the firebombing of Tesla dealerships, the romanticization of left-wing political murderers—and always the adolescent tantrums over Trump.The Democrats had mostly given up on democracy some 13 years ago. That was the last time they transparently and democratically nominated Barack Obama a second time as their presidential candidate.Ever since, their nominations have been rigged.In 2020, party insiders—terrified of the left-wing crazy primary field—forced out all the leading contenders.Then they coronated the debilitated but still supposedly useful moderate Biden as their COVID-era candidate. Biden then bragged that he would pick his vice president on the basis of race and gender.What followed was the most bizarre campaign in history.Biden stayed put in his basement and outsourced his candidacy to the partisan media.Party activists changed long-standing voting laws in the key swing states. For the first time in American history, 70% of Americans did not vote in person on Election Day—the majority of them by design Democrats.\n\nNext, in 2024, they forced the now no longer useful Biden off the ticket, nullifying his 14 million primary voters.Then, without a vote, they rammed in inept Vice President Kamala Harris as the nominee. As a failed candidate in 2020, she had never won a single delegate.Some in the party now concede it must roust out its radicals.But Democrats will not.AOC and her Squad, the unhinged Jasmine Crocketts of the party, and the ossified socialist Bernie Bros would demonize any Democrat who offered a sane reboot.A few fossils in the party may think they know how to save it. But they are terrified that the medicine would be considered far worse than the illness that prompted it.Would Democrats consider embracing measured and legal-only immigration?No—the crazy base would scream “xenophobe!”A return to meritocracy and the Martin Luther King notion of race as incidental, not essential, to who we are?\n\nAgain, that would be called “racist!”Maybe reforms to fix failed schools with vouchers, school choice, and charter schools?Again, “racist!”How about developing gas and oil reserves and nuclear power to lower energy costs for the struggling middle class?That would be condemned as “destroying the planet!”Restore police forces, end critical race and legal theory, and deter criminals with tough sentencing?Again, “racist!”How about ceasing the whiny fixations with “white privilege” and “white rage?” Or quit seeing a “white supremacist” under every bed?Again, “racist!”The Left created DEI—the use of race to adjudicate every political issue.And like any addictive, toxic drug, they now can neither survive with DEI—nor without it.\n\n(C)2025 Tribune Content Agency, LLC.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"A few Democrat officeholders, activists, and pundits are finally coming to their senses that their brand is toxic to a majority of the American people.... Read More\n\n\nThe post Democrats and Their DEI Albatrosses appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/30/democrats-their-dei-albatrosses/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/GettyImages-2166824832.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-05-30 18:00:28","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.449},{"id":326568738,"title":"Trump Wants $25 Million To Settle His Meritless 60 Minutes Lawsuit","text":"President Donald Trump is currently suing one of the largest media companies in the country because one of its subsidiaries lightly edited an interview with his political opponent. This week, he apparently declined a settlement offer, even though the lawsuit itself is completely frivolous and arguably an abuse of his power as president.\n\n\"Paramount Global in recent days has offered $15 million to settle,\" The Wall Street Journal reported this week. \"Trump's team wants more than $25 million and is also seeking an apology from CBS News.\"\n\nThe whole affair stems from an October 2024 interview that 60 Minutes conducted with then-Vice President Kamala Harris, the Democratic candidate for president. (Trump declined the chance to sit for a 60 Minutes interview of his own.)\n\nIn the interview, correspondent Bill Whitaker asked about Israel's war in Gaza. CBS—the broadcast network owned by Paramount—aired separate portions of Harris' answer, one on the 60 Minutes broadcast and a longer snippet on its Sunday morning show Face the Nation.\n\nTrump seized on the different clips and accused CBS of doctoring Harris' answer to make her look better. \"Her REAL ANSWER WAS CRAZY, OR DUMB, so they actually REPLACED it with another answer,\" he wrote on X.\n\n\"They took the answer out in its entirety, threw it away, and they put another answer in,\" he later said at a campaign rally. \"And I think it's the biggest scandal in broadcasting history.\"\n\nTrump sued CBS for $10 billion in \"compensatory damages\"—amended to $20 billion after he won the election and reassumed the presidency—under a Texas law against deceptive consumer practices. The lawsuit accused CBS of \"unlawful acts of election and voter interference.\"\n\nThe lawsuit was flawed from the start: Journalists editing interviewees' answers for time or clarity is both routine and protected by the First Amendment.\n\nAnd Harris' answer in either clip is not exactly Churchillian: \"Harris did not come across as especially forthright, articulate, or intelligent in either version, although the one that 60 Minutes showed was a little more concise,\" Reason's Jacob Sullum observed. If CBS were trying to do her a favor by swapping out her answer, one imagines they could have done a better job.\n\nBesides, Trump won the election; it's hard to believe he suffered any damages, much less millions of dollars worth. But in a filing this week, Trump's lawyers argued the interview \"led to widespread confusion and mental anguish of consumers, including [Trump].\"\n\nCBS released the full unedited video and transcript of Whitaker's interview with Harris in February, conclusively demonstrating the scandal was bullshit all along: CBS aired one part of Harris' response on 60 Minutes and another part on Face the Nation. Despite Trump's insistence, nobody \"replaced\" any part of her answer with another, separate answer.\n\nBut instead of defending its journalists by pressing on and letting a judge laugh the lawsuit out of court, Paramount has been negotiating a settlement. CBS News staffers opposed a settlement, fearing the precedent of a journalistic outlet caving to pressure from the powerful interests it covers. Since negotiations began last month, the producer of 60 Minutes and the executive in charge of CBS News each resigned.\n\nBut Paramount is in the process of being acquired by Skydance Media, and the transaction requires approval from the Federal Communications Commission (FCC). Around the same time as Trump's lawsuit, the Center for American Rights, a conservative nonprofit, also filed an FCC complaint for \"news distortion\" over the interview. And FCC Chair Brendan Carr, whom Trump elevated to the job and who has demonstrated unabashed loyalty to the president, has indicated that approval depends upon the resolution of the complaint, which he is in no hurry to get through.\n\n\"It would be entirely inappropriate to consider the complaint against the '60 Minutes' segment as part of a transaction review,\" FCC Commissioner Anna Gomez told the Los Angeles Times.\n\nIndeed, the lawsuit—especially when paired with the FCC merger approval—smacks of corruption, with Trump trying to cow a disfavored media outlet into silence. Trump's effort is so blatant that Paramount executives reportedly worried they could be prosecuted for bribery of a public official if they settled the lawsuit.\n\nOf course, this puts Paramount, CBS, and 60 Minutes in a perilous position: If Paramount—which has been struggling for years—hopes to save itself through a merger with Skydance, it must win over the FCC, whose current head apparently delights in being referred to as \"Trump's media pit bull.\" Doing so will apparently require bending the knee and paying a fee for hurting Trump's feelings, even though by all accounts, 60 Minutes violated neither the law nor journalistic ethics.\n\nAnd if Paramount does cave and pay $25 million or more—worse still, if it apologizes for the sin of doing basic journalism—it will set a dangerous precedent that powerful people can openly and unabashedly bully the journalists who cover them into silence.","summary":"In a legal filing this week, Trump argued that routine edits to a CBS News interview he did not participate in caused him \"confusion and mental anguish.\"","url":"https://reason.com/2025/05/30/trump-wants-25-million-to-settle-his-meritless-60-minutes-lawsuit/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/05/trump-paramount.jpg","video":null,"publish_date":"2025-05-30 17:45:51","author":"Joe Lancaster,Peter Suderman","authors":["Joe Lancaster","Peter Suderman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.399},{"id":326576290,"title":"Trump’s Proposal for Office of Remigration Evokes Ethnic Cleansing, Critics Say","text":"Eight months after U.S. President Donald Trump publicly called for a policy of “remigration” — a term that’s become a rallying cry among far-right groups in Europe and sparked comparisons to ethnic cleansing — the U.S. State Department said Thursday that it plans to create an office devoted to the project, with refugee aid resources diverted to Trump’s rapidly accelerating mass deportation campaign.\n\nA State Department official told Axios that the proposed creation of the Office of Remigration would be part of a broad reorganization of the agency, with a division that resettled Afghan people who supported the U.S. during the 20-year occupation of Afghanistan eliminated.\n\nA proposal sent to Congress detailed how the Bureau of Population, Refugees, and Migration’s immigration work would be consolidated into three offices, including the Office of Remigration, to shift the bureau’s focus “towards supporting the administration’s efforts to return illegal aliens to their country of origin or legal status.”\n\nThe office would be a “hub for immigration issues and repatriation tracking,” according to the proposal.\n\nTrump first called for a “remigration” program in September 2024 ahead of the presidential election, saying he would “return Kamala [Harris]’s illegal migrants to their home countries” in a post on his social media platform Truth Social.\n\nThe comment came amid his attacks on Haitian legal residents in Springfield, Ohio and Venezuelan migrants, claiming the U.S. was under an “invasion” and saying he would “ship them back to their country.”\n\nHis use of the term remigration went largely unremarked on by the corporate media, said the news analysis group Media Matters at the time, but Zeteo founder Mehdi Hasan noted that Trump was “calling for the ethnic cleansing of legal immigrants in the United States.”\n\nThe term has been embraced by far-right groups in Europe including Alternative for Germany and Austria’s Freedom Party, which called for the European Union to appoint a remigration commissioner last year.\n\nRemigration policy has long been promoted by Austrian far-right activist Martin Sellner, who had communications with the white supremacist who killed 51 Muslim worshippers at two mosques in Christchurch, New Zealand in 2019. Sellner has denied involvement in the attacks.\n\nOn his website, Wired reported on Thursday, Sellner “lays out a three-phase plan to implement remigration” that includes “striking similarities to Trump’s current immigration policies”:\n\nThe primary aim of this phase is “stopping the invasion.” The Trump administration, invoking the Alien Enemies Act in March, cited an alleged “invasion” by a Venezuelan gang as a source of authority to take unprecedented steps to remove migrants from the U.S.\n\nSellner’s website also lists a number of “tools” that can be used to achieve remigration, which includes “stop family reunification” — something Trump was doing even in his first term in office. In the first phase, Sellner also encourages governments to “create an ultimatum and economic incentives to self-deport.” The Trump administration is already purportedly offering undocumented immigrants a stipend of $1,000 if they use the CBP Home App to self deport.\n\nSellner adds that governments should “cut humanitarian aid” to force immigrants to stop entering the country. Last month, the Trump administration attempted to cut legal aid to unaccompanied migrant children, only for a court to temporarily block its efforts.\n\nJulia Ebner, a researcher with the Institute for Strategic Dialogue and the University of Oxford, told The Guardian last year that the term “sounds a lot more benign than what it actually stands for. Because, particularly in the context of Germany and Austria, there is still a very strong association of the term mass deportation with the Holocaust.”\n\nFar-right lawmakers and activists from the U.S., Germany, Ireland, and France were among more than 400 attendees at the first-ever Remigration Summit near Milan earlier this month. Jacky Eubanks, who was endorsed by Trump during her 2022 run for the Michigan House of Representatives, claimed in a speech at the summit that Europeans were the “founding stock” of the U.S., disregarding the existence of indigenous people across the continent.\n\nThe State Department is planning to open the Office of Remigration as the administration ramps up its mass deportation operations, with Secretary of Homeland Security Kristi Noem and White House Deputy Chief of Staff Stephen Miller informing immigration officials last week that federal agents should begin arresting 3,000 immigrants per day — tripling numbers from earlier this year.\n\nThe push has coincided with mandates for federal law enforcement agents to assist in raids and arrests and the targeting of people at formerly protected locations like courthouses.\n\n“We’re seeing the Trump administration take the unprecedented step of arresting non-citizens who are following the government’s rules and procedures, and showing up for their court hearings,” Nayna Gupta, the policy director for the American Immigration Council, told The Guardian on Thursday. “They are desperate to reach a certain number of arrests per day. And the only way they can find non-citizens easily and quickly is to go to the courthouses, where [immigrants] are doing exactly what they’re supposed to do.”\n\nThe Washington Post reported that Immigration and Customs Enforcement in more than 20 states have been directed to arrest people at courthouses during court proceedings.\n\n“The Trump administration is pressuring judges in immigration courtrooms to function more like cogs in the mass deportation machinery rather than as fair and balanced arbiters of the law,” Greg Chen, senior director of government relations for the American Immigration Lawyers Association, told the Post. “That is not the way Americans want and understand our judicial system to work. Immigration judges should be worried about this.”\n\nGupta said the administration is “doubling down” on its “illusion that they had been given a broad mandate to effectuate an aggressive immigration enforcement agenda.”\n\nLess than a third of Americans in a March Gallup poll agreed with Trump’s stated goal of removing all undocumented immigrants from the United States; those who said “some” undocumented immigrants should be deported said that committing violent crimes should be a prerequisite for removal.\n\n“Public polling is showing decreasing support for Trump’s immigration agenda,” said Gupta, “as Americans wake up to the reality that mass deportation means arrests of our neighbors and friends, masked agents in our communities, and people afraid to go to work and show up to school, in ways that undermine our local economies.”","summary":"The president's call for a policy of &ldquo;remigration&rdquo; has been embraced by far right groups in Europe.","url":"https://truthout.org/articles/trumps-proposal-for-office-of-remigration-evokes-ethnic-cleansing-critics-say/","image":"https://truthout.org/app/uploads/2025/05/2025_0530-tr-scaled.jpg","video":null,"publish_date":"2025-05-30 17:32:56","author":"Julia Conley","authors":["Julia Conley"],"language":"en","category":"politics","source_country":"US","sentiment":-0.182},{"id":326578126,"title":"The Worrying Backstory of Trump’s Proposed “Office of Remigration”","text":"On Thursday, Secretary of State Marco Rubio announced that the Trump administration had taken new steps towards “building an America First State Department” by notifying Congress of a “reorganization plan.” The massive overhaul, first proposed in April, will reportedly downsize or eliminate hundreds of bureaus and offices; cut thousands of domestic civil service and foreign service jobs; and redirect the Bureau of Democracy, Human Rights and Labor to focus on “Democracy and Western Values.”\n\nA small but noteworthy part of this shake-up at the State Department should raise particular alarm: a plan to create an “Office of Remigration.”\n\nAs Mother Jones reported previously, the term “remigration” is rooted in the debunked Great Replacement theory and favored by the European far-right and White nationalist extremists. It calls for the forcible repatriation or mass expulsion of non-ethnically European immigrants and their descendants, regardless of immigration status or citizenship, and an end to multiculturalism. In 2019, the Associated Press described remigration as the “chilling notion of returning immigrants to their native lands in what amounts to a soft-style ethnic cleansing.”\n\nThe proposed establishment of an “Office of Remigration” is the latest push by the Trump administration to curb most, if not all, immigration to the United States (with the notable exception of South Africa’s white Afrikaners and investors willing to buy a $5 million gold card). This includes ideologically purging students and lawful residents, on top of trying to rid the country of all undocumented immigrants and summoning wartime powers to expel hundreds of noncitizens to a foreign prison without due process. \n\nThe anti-immigrant buzzword “remigration” was made popular by Austrian identitarian activist Martin Sellner. It has since become a policy platform embraced by Germany’s Alternative for Germany (AfD) party and far-right politicians across Europe. Earlier this month, a “remigration” summit in Italy reportedly gathered hundreds of lawmakers and activists—including a former Trump-endorsed candidate for the Michigan House of Representatives—in support of repatriating “non-assimilated” immigrants and European-born citizens alike. The Global Project Against Hate and Extremism called it an “ethnic cleansing summit.” \n\nTrump’s “Office of Remigration” would fall under the Bureau of Population, Refugees, and Migration, one State Department official told Axios. “The Office of Remigration will serve as the [Bureau of Population, Refugees, and Migration]’s hub for immigration issues and repatriation tracking,” according to a copy of the 136-page plan shared with six Congressional committees to be approved before July 1 and reviewed by Wired. “It will provide a policy platform for interagency coordination with DHS and other agencies on removals/repatriations, and for intra-agency policy work to advance the President’s immigration agenda.”\n\nThe move would effectively undercut the bureau’s original stated mission to “provide protection, ease suffering, and resolve the plight of persecuted and uprooted people around the world.” Instead, according to the document submitted to Congress, the bureau’s functions will be consolidated into three offices under the Deputy Assistant Secretary for Migration Matters and “substantially reorganized” to deliver on the administration’s policy priorities.\n\nOne of such offices, the “Office of Remigration,” would “actively facilitate the voluntary return of migrants to their country of origin or legal status.” Earlier this month, the Department of Homeland Security announced that it would offer a stipend and financial travel assistance to immigrants who decided to use the CBP Home mobile app to self-deport. Recently, immigration lawyers have also seen “notices to self-deport” posted in immigration courts, warning that they’re misleading and intended to scare people.\n\nIn a recent post on an apparent State Department Substack, Samuel Samson, a senior adviser for the Bureau for Democracy, Human Rights, and Labor singled out “mass migration” and the replacement of “spiritual and cultural roots” as threats to “democratic self-governance.” He further called for a partnership focused on the United States and Europe’s “shared Western civilizational heritage.”\n\nLast September, in the lead up to the presidential elections, Donald Trump invoked “remigration” in a Truth Social post stating his plans to “return Kamala [Harris]’s illegal migrants to their home countries (also known as remigration).” At the time, Trump’s nod to the European far right’s policy caught Sellner’s attention and was celebrated as another step towards taking remigration global and mainstream. Now, it might be policy. When asked by Wired about the incursion of remigration in the United States, Sellner said Trump “ticks many of the boxes. The “common line” between America and Europe, he added, is “preserving the cultural continuity by stopping replacement migration.”\n\nSellner, who was barred from entering Germany and the United Kingdom and had his US travel authorization canceled in 2019 because of his suspected links to the Christchurch shooter, told Wired he might try to get a new visa, saying “I hope I will touch American soil again soon.” One of the organizers and speakers at this month’s remigration summit in Italy, Sellner reportedly advertised the event by lauding the United States as an example, saying “Remigration is on everyone’s lips.”","summary":"On Thursday, Secretary of State Marco Rubio announced that the Trump administration had taken new steps towards &#8220;building an America First State Department&#8221; by notifying Congress of a &#8220;reorganization plan.&#8221; The massive overhaul, first proposed in April, will reportedly downsize or eliminate hundreds of bureaus and offices; cut thousands of domestic civil service and foreign [&#8230;]","url":"https://www.motherjones.com/politics/2025/05/remigration-trump-state-department-removal-ethnic-cleansing/","image":"https://www.motherjones.com/wp-content/uploads/2025/05/AP_20250530_MarcoRubio.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-05-30 17:10:42","author":"Isabela Dias","authors":["Isabela Dias"],"language":"en","category":"politics","source_country":"US","sentiment":-0.173},{"id":326559124,"title":"‘The View’ Hosts Bluntly Ask About – and Poke Fun at – Anthony Weiner’s Sex Scandals Directly to Him | Video","text":"Former congressman and convicted sex offender Anthony Weiner stopped by “The View” on Friday morning, and while he was there, the ABC hosts pulled no punches when it came to addressing his past scandals.\n\nTo introduce the man, moderator Joy Behar (Whoopi Goldberg does not appear on the show on Fridays) reminded the audience of his “series of, shall we say, sexting scandals” and then wryly asked the audience to “please welcome the very contrite Anthony Weiner.” When Behar asked if “contrite” was the right adjective, Weiner agreed but immediately took the opportunity to swipe at a past political interview on the show.\n\n“Yeah. By the way, was this where Kamala Harris was sitting when she blew up her campaign?” Weiner quipped. “Was this the spot? I hope I don’t have the same fate.”\n\nThe hosts laughed and conceded that it was indeed where the former vice president was sitting, before launching properly into the interview. But, as she started her question, Behar trailed off, chuckling at the circumstances.\n\n“So Anthony, when you got out of the hoosegow, um — ” she said\n\n“Yeah, great, just make fun of that,” he said with a smile.\n\nWeiner willingly talked of his scandals though, eventually prompting Behar to note that he’s a good politician and has a knack for talking to people, and admitting that “I was very unhappy that you got yourself into hot water.”\n\nThe former congressman argued that his success came from talking to a wide swath of voters, and not just sticking to media appearances where he knew he would have friendly journalists. But he also took the opportunity to point out that he never came on “The View.”\n\n“I would go on Fox News, I would go on ‘The View’ and take tough questions — I mean, I didn’t, I never got invited to ‘The View.’ I had to have a giant scandal to get invited to ‘The View,’” Weiner joked.\n\nThe women didn’t let him off the hook though. When it came time for her question, host Ana Navarro teed things up bluntly, saying “Let’s talk about some of these giant scandals. You’ve had numerous of them.”\n\nShe then proceeded to list each one, which included sending nude photos via social media and sexting multiple women while he was married, including one minor.\n\n“So with all that said, why do you think, or why should New Yorkers give you a chance at a political comeback?” Navarro asked.\n\nWeiner argued that people should not vote for him in spite of what he’s done, but rather consider it in the whole picture, and remember that he owned up to each of his scandals and served his time. Eventually, host Sara Haines asked if voters would even be able to trust that, if he were to have a sex scandal again — Weiner says he is an addict — he would be able to “own up to it without having to be ‘caught.’”\n\nFinally, Behar admitted that while Weiner is charismatic and makes good points, she couldn’t help but wonder why he and other disgraced male politicians remain frontrunners.\n\n“Why is it that two qualified women could not beat all of you guys?” she asked. “These women can never beat you. They’re more qualified that almost anybody on that list, including you, I’m sorry.”\n\nTo that, Weiner conceded that women are judged more harshly than men.\n\nYou can watch part of Anthony Weiner’s appearance on “The View” in the video above.","summary":"\"Yeah, great, just make fun of that,\" the former congressman says with a laugh\n\n\nThe post &#8216;The View&#8217; Hosts Bluntly Ask About – and Poke Fun at – Anthony Weiner&#8217;s Sex Scandals Directly to Him | Video appeared first on TheWrap.","url":"https://www.thewrap.com/anthony-weiner-scandals-the-view/","image":"https://www.thewrap.com/wp-content/uploads/2025/05/anthony-weiner-the-view.jpg","video":null,"publish_date":"2025-05-30 16:55:51","author":"Andi Ortiz","authors":["Andi Ortiz"],"language":"en","source_country":"US","sentiment":-0.16},{"id":326610294,"title":"NBC’s Today Bids Farewell to Lester Holt, Omits Aversion to Fairness in Journalism","text":"Ahead of anchor Lester Holt’s final sign off from NBC Nightly News later that evening, NBC’s Today put on a special segment to bid their friend farewell as he left to host Dateline full time. But amid all their gooey praise and tribute video showing highlights of his career from presidential debates to mass shooting to the COVID pandemic, Holt’s more infamous moments where obviously omitted.\n\nThe segment had solemn intro as co-hosts Craig Melvin and Savannah Guthrie mourned Holt’s leaving:\n\nMELVIN: And welcome back. Well, tonight Lester Holt will anchor his final broadcast of NBC Nightly News, stepping away from the daily grind of the evening to for more full time focus on Dateline.\n\nGUTHRIE: But before he passes the baton to Tom Llamas, we wanted to do a little look back at our dear friend and proud Today show alum.\n\n“You are just a class act and so unflappable and such a leader for this news division,” Guthrie gushed following a sappy tribute video. “And we're just going to miss you at Nightly News so much. But this is a wonderful new chapter that you're opening.”\n\nDuring said tribute video, NBC tried to portray Holt as a fair journalist who held both sides to account equally and yet trusted to host a Republican presidential debate (Click \"expand\"):\n\nHOLT: You haven’t been to the border?\n\nVP KAMALA HARRIS: And I haven't been to Europe.\n\nGUTHRIE: But won't let answers go unchallenged.\n\nPRESIDENT DONALD TRUMP: I was going to fire Comey. There’s no good time to do it, by the way.\n\nHOLT: Because in your letter you said ‘I accepted their recommendation.’ You had already made the decision.\n\nTRUMP: Oh, I was going to fire regardless.\n\nGUTHRIE: A voice trusted on the biggest night.\n\nHOLT: Good evening everyone! I’m Lester Holt. We welcome you to the Republican presidential debate.\n\nBut in reality, Holt despised fairness as a journalist virtue.\n\nWhile accepting a Murrow Award in 2021, Holt came out against being fair. “The unprecedented attacks on the press in this period I’m sure will fill plenty of books....But I have a few early observations I’ll share about where this moment brings us and what we can learn…Number one is, I think it’s become clearer that fairness is overrated,” he proclaimed.\n\nWhen asked about his pandemic-era sign off “Please take care of yourself and each other,” Holt explained that it came from a place of trying to reassure the audience with a positive message:\n\nGUTHRIE: Well, you are such a voice of calm and reason. You never let anybody see you sweat. And you started kind of having this tag line at the end. I thought it really -- it just goes with your personality. How does that come to be?\n\nHOLT: You know, it – Again, I was anchoring from home during the pandemic. And these were dark days. We're telling stories of freezer trucks on the streets of New York, you know, with the remains of people. And I thought, ‘you know, I need to have some kind of a signal or some message to the audience that, hey, I get it. We're all in this together and this is tough.’ And so I started saying, “take care of yourself and each other.”\n\nBut not so fast.\n\nAs NewsBusters had previously documented, NBC Nightly News under Holt was despair porn. They would constantly push for ineffective lockdowns while also lamenting and gawking at their harmful effects. Even as late as February 2022, Holt was fearful that for many people the pandemic “feels like it’s over.”","summary":"Ahead of anchor Lester Holt’s final sign off from NBC Nightly News later that evening, NBC’s Today put on a special segment to bid their friend farewell as he left to host Dateline full time. But amid all their gooey praise and tribute video showing highlights of his career from presidential debates to mass shooting to the COVID pandemic, Holt’s more infamous moments where obviously omitted.\n\nThe segment had solemn intro as co-hosts Craig Melvin and Savannah Guthrie mourned Holt’s leaving:\n\n\nMELVIN: And welcome back. Well, tonight Lester Holt will anchor his final broadcast of NBC Nightly News, stepping away from the daily grind of the evening to for more full time focus on Dateline.\n\nGUTHRIE: But before he passes the baton to Tom Llamas, we wanted to do a little look back at our dear friend and proud Today show alum.\n\n\n“You are just a class act and so unflappable and such a leader for this news division,” Guthrie gushed following a sappy tribute video. “And we're just going to miss you at Nightly News so muc","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/05/30/nbcs-today-bids-farewell-lester-holt-omits-aversion-fairness","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/2025-05-30-NBC-Today-Celebrate-Lester-Holt-Omit-Controversies.jpg?itok=YWISucoB","video":null,"publish_date":"2025-05-30 16:53:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","source_country":"US","sentiment":0.315},{"id":326539624,"title":"Michael Jordan's ex-teammate Etan Thomas doesn't flinch over backlash after claiming Angel Reese was 'bashed' by Donald Trump's black male supporters","text":"Michael Jordan’s ex-teammate, Etan Thomas, didn’t backtrack after claiming that U.S. President Donald Trump’s black male supporters are ‘bashing’ Angel Reese. On Tuesday, Thomas made a post on X suggesting that the same demographic of black men who criticize Reese also opposed former Vice President Kamala Harris:“It’s interesting how a lot of the same demographic of Black men who go out of their way to bash Angel Reese even as she sets WNBA records are same group of Black men who were bashing Kamala Harris.”Thomas’ view on the matter led to him being criticized. However, he is not ready to stand down and clapped back at his haters on Instagram. He posted a message that read:“So now Black Male Trump Supporters are mad at me because I said they’re the same ones who bash Angel Reese? Well if the shoe fits &#129335;&#127998;‍♂️.” View this post on Instagram Instagram PostThomas has easily been one of Reese’s biggest supporters and often speaks out against the alleged racist treatment she has been subjected to. He has also previously said that Caitlin Clark’s fans have weaponized her to push their racist agendas and drag Reese down.Etan Thomas calls out Bleacher Report for criticizing Angel ReeseEtan Thomas’ criticism isn’t limited to Black supporters of President Trump, as he also called out Bleacher Report for allegedly spreading hate against the Chicago Sky star. Bleacher Report published an article on May 11 whose title read:“Angel Reese disappoints WNBA Fans as Van Lith, Sky lose to Collier, Lynx in Preseason.”Thomas took issue with the headline and posted this on X:“Dear Bleacher Report 1. It’s a little early to return back to the demonization of Angel Reese isn’t it ? 2. We’re talking about Pre Season (Allen Iverson Voice) 3. Pre season is mostly utilized so teams can assess their cuts, it’s not about wins and losses but y’all know that.”Thomas makes it a point to defend Reese against what he deems unfair treatment. He is also not scared to go up against one of the most hostile fan bases on social media, Caitlin Clark's fans. Not everyone, though, agrees with his takes. But he isn't worried about courting controversy.","summary":"Michael Jordan’s ex-teammate, Etan Thomas, didn’t backtrack after claiming that U.S. President Donald Trump’s black male supporters are ‘bashing’ Angel Reese.","url":"https://www.sportskeeda.com/us/wnba/news-michael-jordan-s-ex-teammate-etan-thomas-flinch-backlash-claiming-angel-reese-bashed-donald-trump-s-black-male-supporters","image":"https://staticg.sportskeeda.com/editor/2025/05/bc6ca-17486204211319-1920.jpg","video":null,"publish_date":"2025-05-30 16:46:40","author":"Sameer Khan","authors":["Sameer Khan"],"language":"en","source_country":"in","sentiment":-0.041},{"id":326540924,"title":"Some question Pritzker’s tax ‘veto’ pledge, say Trump should cut funding","text":"“I’ve been opposed to any taxes. They’re broad based, or that would affect working families in this budget,” Pritzker told reporters.\n\nThursday, state Sen. Andrew Chesney, R-Freeport, said the governor isn’t being genuine.\n\n“Well, is that the same governor that said he was not going to support a gerrymandered map? I think that’s the same, governor,” Chesney said during a news conference. “So I think the governor has a political interest in trying to fight for the taxpayers because his interest is in presidential politics, not state politics.”\n\nIt’s been speculated for years Pritzker is aiming for higher office, including efforts to vie to be former Vice President Kamala Harris’ vice presidential candidate during the 2024 election cycle.\n\nWhile Illinois could approve a $54 billion spending plan as the governor proposed in February, that’s just state taxpayer money. The state could get an additional $75.5 billion in federal tax funds.\n\nBut, that could change with the Trump administration possibly freezing funds for states, including spending for non-citizen health care. Gov. J.B. Pritzker criticized that and other potential funding freezes.\n\n“[President] Donald Trump, frankly, doesn’t give a darn about working people, about folks who are vulnerable in our society and only wants to give a massive tax cut to the wealthiest people in the country,” Pritzker said Wednesday.\n\nState Rep. Adam Niemerg, R-Dieterich, said Trump is trying to reign in what he called bad policy of higher ed indoctrination, men in women’s sports and poor spending decisions by Illinois Democrats.\n\n“You think Trump’s going to sit there and say, well, yeah, you guys keep, you know, invading girls safe spaces and running all these boys in these track meets and keep pushing this woke radical agenda, keep putting [diversity, equity and inclusion] in every, every bill that we see and also support illegal immigrants over the citizens of this great state of Illinois,” he said. “Of course, if I’m him, I’m going to cut that federal funding and he should cut that funding.”\n\nILLINOIS LEGISLATURE POISED TO PASS PHYSICIAN-ASSISTED SUICIDE\n\nSome speculate the state legislature could approve a budget before Saturday’s deadline, but will have to come back this summer to react to any moves from the Trump administration.\n\nLegislators are set to adjourn May 31.","summary":"(The Center Square) – Illinois taxpayers still don’t know how much of their money will be spent by the state of Illinois next fiscal year or whether they’ll be charged higher taxes to pay for it. Saturday is the deadline for legislators to approve the annual spending plan that begins July 1. Wednesday, Gov. J.B. [&#8230;]","url":"https://www.washingtonexaminer.com/news/3426800/some-question-pritzkers-tax-veto-pledge-say-trump-should-cut-funding/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/jb-pritzker-chicago-public-schools-2024-scaled-1024x683.webp","video":null,"publish_date":"2025-05-30 16:18:29","author":"Greg Bishop | The Center Square","authors":["Greg Bishop | The Center Square"],"language":"en","category":"politics","source_country":"US","sentiment":-0.465},{"id":326564452,"title":"“The View”'s Alyssa Farah Griffin slams liberals during tense debate: 'You guys just defend the status quo to death'","text":"The View's resident conservative panelist — and former Donald Trump staffer — has once again taken a firm stand against contemporary liberal ideologies following Vice President Kamala Harris' loss to Donald Trump in the November 2024 presidential election.\n\n The tense exchange came Friday morning after Joy Behar introduced a Hot Topic about Democrats investing in communications with young male voters after Trump over performed with the demographic when Americans headed to the polls last year.\n\n \"I think it's a waste of money,\" Behar said, minutes into the conversation. \"Maybe these guys should spend their money on teaching men to not be such sexists.\"\n\n Griffin, whom has long clashed with her fellow cohosts at The View over their speculation that racism and misogyny played a significant role in Harris' loss, quickly pushed back.\n\n \"But the stats don't bear that out, now. Now that we've seen the election results, Donald Trump performed better than the previous several Republicans with most every people group,\" the 35-year-old said. \"He did better with Black men, better with Latino men, better with white men and white women. It's just a fact that he has tapped into something.\"\n\n Behar, 82, replied by stressing that \"he was running against a woman,\" and that should be factored into the discussion, too.\n\n \"So you think Democrats who were with Biden in 2020 left to be with Trump because they're sexist?\" Griffin clapped back. \"I don't know the reason, but it's very suspicious,\" Behar said.\n\n \"Donald Trump has made himself the anti-establishment despite being the entire political establishment,\" Griffin countered. \"What I used to like about liberals is they were the anti-establishment. You protested Vietnam, [fought for] civil rights, now you guys just defend the status quo to death.\"\n\n Griffin doubled down, telling Behar that \"nobody likes the federal government, nobody thinks it works well, no one's like this is the solution, let's not try to improve anything,\" before urging that the Democratic party should instead \"ask how you can solve people's day-to-day problems.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n While Griffin has sparred with her cohosts about the election results many times in recent months, President Joe Biden also admitted during a recent live interview on the show that he \"wasn't surprised\" that Harris lost after he dropped out of the race and endorsed her.\n\n One day earlier, Griffin appeared on CNN and slammed Biden as a \"messenger no Democrat wants to see\" on the circuit.\n\n The View airs weekdays at 11 a.m. ET/10 a.m. PT on ABC.","summary":"Griffin, who previously worked for Donald Trump and Mike Pence, told Joy Behar she \"used to like\" certain things about liberals — but not anymore.","url":"https://ew.com/the-view-alyssa-farah-griffin-slams-liberals-tense-debate-joy-behar-11745273","image":"https://ew.com/thmb/i_B7tKIQyTNnRbR6x72ipwK-y2k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/joy-behar-alyssa-farah-griffin-the-view-053025-1ac9dbf2b2c047628872611edffdae0f.jpg","video":null,"publish_date":"2025-05-30 16:01:05","author":"Joey Nolfi","authors":["Joey Nolfi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.133},{"id":326526768,"title":"Republicans' Chances of Beating Dan McKee for Rhode Island Governor—Poll","text":"A new poll delivered red flags for Rhode Island Governor Dan McKee, a Democrat, ahead of his reelection bid next year.Why It MattersThe poll, conducted by the University of New Hampshire, suggests that a majority of Rhode Islanders are unhappy with McKee's leadership ahead of the 2026 midterms, when Republicans could be eyeing the race as a potential opportunity to flip, despite the state's long-standing record of being solidly Democratic.Although the poll did not ask about specific head-to-head matchups for the election, the results could be troubling for Democrats in the state.The state has not elected a Republican governor since 2006, though it did support independent former Governor Lincoln Chafee in 2011.Newsweek reached out to McKee's campaign via email for comment.What to KnowOnly 19 percent of Rhode Islanders approve of McKee's job performance, while 71 percent disapprove of him, according to the survey of 653 Rhode Island residents from May 22 to May 26, 2025. The poll had a margin of plus or minus 3.8 percentage points.It found that 74 percent of all Rhode Island voters—including 60 percent of Democrats—do not believe McKee deserves to be reelected; only 11 percent said they think he deserves to be reelected.Thirty-two percent of respondents said they want to see Democrat Helena Foulkes, a businesswoman who challenged McKee in 2022, to run again, while 23 percent said they want Republican Ashley Kalus to jump into the race. Only 19 percent said they want to see former Governor Gina Raimondo, who served as Commerce secretary under former President Joe Biden, run.At the same time, the poll found that President Donald Trump is also unpopular in the state. Only 37 percent of respondents gave him positive marks, compared to 61 percent who disapproved of his performance during his first few months back in the Oval Office.Joe Powers, chairman of the Rhode Island Republican Party, described the poll as a \"glaring reflection of the Governor's failed leadership and the growing dissatisfaction among Rhode Islanders\" in a statement to Newsweek, pointing to the closure of the Washington Bridge, pay raises for the governor's cabinet and the sanctuary state designation as key issues the state is facing.\"The upcoming 2026 gubernatorial race, while traditionally leaning Democratic, is poised to be highly competitive. The Republican Party of Rhode Island is committed to presenting a viable alternative—one that prioritizes transparency, fiscal responsibility, and the genuine needs of our citizens,\" he said.While McKee remains unpopular, according to the poll, a Republican victory in the state may not be an easy feat, given the state's Democratic lean. It backed Vice President Kamala Harris by nearly 14 points in 2024 and voted for Biden by more than 20 points in 2020.On the presidential level, Rhode Island has not voted for a Republican since 1984.McKee, who assumed office after Raimondo resigned to join the Biden administration, won his first full term in office in 2022, defeating Kalus by nearly 20 points.What People Are SayingWPRI political analyst Joe Fleming told the Providence-based news station: \"The governor has some serious work to do over the next six months or so to show voters that he's doing a good job and deserves reelection. If he can't do that, I think you'll see Democrats lining up to run for the office.\"McKee told WJAR in March: \"I think that we've made a great deal of progress, keeping people safe during the COVID certainly was important, opening the businesses at that time. Keeping people safe when I shut down the bridge, the Washington Bridge, and now we're actually in the process of rebuilding that bridge and have the money in place.\"What Happens NextIt remains to be seen whether McKee will face a primary challenge from fellow Democrats or which Republicans may enter the race. The primary is still more than a year away on September 8, 2026. The Cook Political Report currently classifies the race as being Solid Democratic, though Sabato's Crystal Ball classifies it as Likely Democratic.","summary":"A new survey has raised red flags about McKee's popularity ahead of the 2026 midterms.","url":"https://www.newsweek.com/republicans-chances-beating-dan-mckee-rhode-island-governor-poll-2079034","image":"https://d.newsweek.com/en/full/2654191/rhode-island-governor-dan-mckee-poll.jpg","video":null,"publish_date":"2025-05-30 15:56:16","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.066},{"id":326529826,"title":"Trump heads to Rust Belt to tout his big beautiful 'steel deal'...but a major player is staying away","text":"President Donald Trump heads to Pittsburgh on Friday to tout a steel deal that he says will bring unprecedented job growth in the industry to Pennsylvania.\n\nTrump has boasted about a 'planned partnership' between the Pittsburgh-based U.S. Steel and Japan-based Nippon Steel, who originally had wanted to acquire the American firm. \n\n'This will be a planned partnership between United States Steel and Nippon Steel, which will create at least 70,000 jobs, and add $14 Billion Dollars to the U.S. Economy,' Trump wrote on Truth Social. 'The bulk of that Investment will occur in the next 14 months. This is the largest Investment in the History of the Commonwealth of Pennsylvania.' \n\nWhile Trump initially said he'd hold a 'BIG rally' Friday in Pittsburgh, he's now delivering remarks at the Irvin Works, a U.S. Steel plant located outside the city limits, hugging the Monongahela River in West Mifflin, Pennsylvania. \n\nPennsylvania's Democratic Sen. John Fetterman, who live steps away from U.S. Steel's Edgar Thomson plant in Braddock, initially applauded to deal in an X post on the heels of Trump's announcement.\n\n'Vowed to jam that up almost a year and a half ago and we did. The original deal was a death sentence for Mon Valley steel. Nippon coughed up an extra $14B. This is why we fight for the union way of life, and I will continue to support @steelworkers no matter the cause,' Fetterman posted, tagging the United Steelworkers in the post.\n\nBut it's the United Steelworkers who've remained the most skeptical of the deal. \n\nA spokesperson for the USW told the Daily Mail that the union 'does not currently plan to participate in any of the events on Friday.' \n\nLate Wednesday, a letter from USW President David McCall and Mike Millsap, the chairman of the negotiating committee, went out to the membership and noted that the Pittsburgh-headquartered union wasn't 'involved in the closed-door discussions.' \n\n'We also cannot confirm how much of the publicly claimed $14 billion in proposed investment would be directed to our union-represented plants, or how much of that sum would go toward genuinely new capital improvements as opposed to routine repair and maintenance,' they said. \n\nThe union heads warned that Nippon didn't dispute that $4 billion of the investment would go toward 'greenfield operations' - new business - 'and our members already know that our plants are not \"greenfields,\" and generally that means non-union.'\n\nThe three plants in the Mon Valley are those in Braddock, West Mifflin, where Trump will speak, and the Clairton Mill Works in Clairton. \n\n'Nippon has maintained consistently that it would only invest in U.S. Steel's facilities if it owned the company outright. We've seen nothing in the reporting over the past few days suggesting that Nippon has walked back from this position,' McCall and Millsap also said. \n\nRepublican Sen. Dave McCormick on Tuesday attempted to fill in some of the blanks, describing the deal as 'an investment' and called Nippon's role 'partial ownership, but it will be controlled by the U.S.' \n\nU.S. Steel's board will remain U.S. citizens, as will key management positions, including the company's CEO. \n\nMcCormick also said that the U.S. government would get a 'golden share,' which would allow it to outvote shareholders on certain key decisions. \n\nTrump, as well as former President Joe Biden, had opposed Nippon buying U.S. Steel outright. \n\nAhead of Trump's trip, local leadership and workers were more keen on the deal. \n\nWest Mifflin Mayor Chris Kelly, a Democrat, told the Daily Mail via email that local unions 'are largely in favor of moving forward with the proposed deal.' \n\nHe said his own experience has 'reinforced my optimism for its prompt finalization,' adding that the 'investment in the Mon-Valley is unprecedented, representing more funding for new technology than we've seen in many years.'\n\n'Additionally, I have had the privilege of communicating with workers from Nippon's other American plants, all of whom have shared positive feedback regarding safety, contract negotiations, and management relations,' the mayor added. \n\nGlenn Thomas, who's worked at the Braddock U.S. Steel plant for 44 years, told WTAE that he was 'elated' and 'overjoyed' by the news. \n\n'I'm happy for all the families that are going to be able to keep sending their kids to college, paying their mortgages and feeding their families,' Thomas said. 'It means a lot for Pittsburgh. Not only is it the steelworkers' jobs that it saves, it's the contractors' jobs, it's the local communities' tax base.' \n\nAs White House press secretary Karoline Leavitt was leaving the podium Thursday, she said that Trump had been on the phone with Japanese Prime Minister Shigeru Ishiba earlier that morning. \n\nShe gave few details on what the president's visit would entail. \n\n'I can tell you that the president greatly looks forward to going to Pittsburgh, Pennsylvania where he will discuss this historic deal and discuss American jobs and American steel and we hope to see you all there,' Leavitt said. \n\nThe White House wouldn't divulge to the Daily Mail whether Fetterman or Pennsylvania's Democratic Gov. Josh Shapiro would be on hand, nor would their offices. \n\nShapiro had said last Friday the deal would 'deliver historic investments' to the state. \n\nWhile Trump won Pennsylvania in 2024 in part due to his strength from white working class voters, union households tilted in favor of his opponent, Democratic Vice President Kamala Harris.\n\nExit polling found that union households made up 18 percent of the Keystone State's electorate - and they voted for Harris 52 percent to Trump's 47 percent - an improvement over Biden's 49 percent to Trump's 50 percent four years before.","summary":"President Donald Trump heads to Pittsburgh later Friday to tout a steel deal that he says will bring unprecedented job growth in the industry to Pennsylvania.","url":"https://www.dailymail.co.uk/news/article-14763163/donald-trump-pittsburgh-steel-deal-union.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/15/98898693-0-image-a-33_1748614661959.jpg","video":null,"publish_date":"2025-05-30 15:49:25","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.142},{"id":326550314,"title":"EXCLUSIVE: The Truth About Dying Joe Biden's Cancer Cover-Up Revealed — Including 'Deep State Conspiracy' to Protect Ailing Democrat","text":"The truth about dying Joe Biden's cancer cover-up has been revealed.\n\nThe ex-president's prostate cancer diagnosis has left many Americans questioning how much his administration knew regarding his health condition during his term and when he was running in the 2024 presidential election, RadarOnline.com can report.What Did They Know?In May, Biden's office issued a statement, declaring: \"While this represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive, which allows for effective management. The president and his family are reviewing treatment options with his physicians.\"\n\nProstate cancers are graded using the Gleason score, a scale ranging from 1 to 10 that assesses how closely the cancer cells resemble healthy cells.\n\nBiden's score was an alarming 9, which is one of the most aggressive types.\n\nFollowing the bombshell announcement and reports claiming he only has six months left to live, many Americans were left with one question —how long did they know about Biden's diagnosis?President Donald Trump even questioned his administration due to the cancer spreading to Biden's bones, which allegedly can take years to do, and said: \"I'm surprised the public wasn’t notified a long time ago.\"\n\nDuring Biden's presidency and when he was running in the election against Trump — his health condition was a hot topic among voters.\n\nFollowing a painful debate against Trump, Biden eventually stepped down, and former Vice President Kamala Harris ran as the Democratic nominee — and ended up losing.Calls To TesifyAfter Biden's announcement, the ex-president's wife, Jill Biden, 74, as well as his long-term physician, Kevin O'Connor, have since faced mounting calls to testify under oath to tell the truth about the diagnosis.\n\nMany Americans believe Jill was the one pushing her husband to run for president once again, despite knowing his health was seriously declining.\n\nIn a social media post, senior counsel with the Department of Justice’s civil rights division, Leo Terrell, slammed the former First Lady and accused her of \"elder abuse.\"\n\nHe added: \"She knew about President Biden’s health problems. But still wanted him to run for President. Evil. Dr. Biden has a lot of explaining to do about her part in defrauding the American people and taxpayers.\"Joe 'The Puppet'According to sources — keeping Biden's failing health a secret was part of a carefully orchestrated plan within the White House to maintain power.\n\n An insider explained: \"The goal of the Deep State is to install a puppet leader that they could manipulate. And Joe Biden was clearly that puppet because he could not make decisions on his own.\"\n\nAccording to reports, Biden displayed symptoms possibly linked to cancer — including dementia-like behavior, dilated pupils, a stiff gait, mood swings, irritability and jumbled speech.Dr. Stuart Fischer, who has not treated Biden, suggested the ex-president had cancer before his condition was announced and claimed he possibly has \"six months\" left to live.\n\nAnother medical expert, Dr. Steven Quay, who also has not treated the ex-president, explained it takes around five to seven years for prostate cancer to spread to the bones — which could indicate Biden was ill when he was running the country.","summary":"The truth about dying Joe Biden's cancer cover-up has been revealed just weeks after the bombshell news left many Americans questioning his administration.","url":"https://radaronline.com/p/joe-biden-dying-cancer-cover-up-revealed-deep-state-conspiracy-protect-ailing-democrat/","image":"https://media.radaronline.com/brand-img/L1hqURenA/0x0/joe-biden-cancer-2-1747767007685.jpg","video":null,"publish_date":"2025-05-30 15:23:11","author":"Lauren McIver","authors":["Lauren McIver"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129},{"id":326535160,"title":"Rob Reiner: ‘Bruce Springsteen Is 100 Percent Right’ About Trump","text":"For legendary director and outspoken Democratic donor Rob Reiner, choosing sides between Bruce Springsteen and Donald Trump in their current war of words didn’t require much deliberation. “Bruce Springsteen is a hundred percent right,” he says, in an interview for an upcoming print issue of Rolling Stone. “I mean, you have to be a moron to not think that everything that Bruce Springsteen said is true. And there’s nothing that Donald Trump can do to him unless he’s able to turn this country into a full-blown autocracy, which he’s trying to do. And because he’s so dumb and he’s such an incompetent person, he’ll fail, just like he’s failed with everything he’s ever done in his life.”\n\n But Reiner says that Americans still need to fight against what he sees as an effort to “take a 250-year democracy and turn it into an autocracy. We’re gonna have to fight like crazy to preserve this… Millions of people died so that fascism wouldn’t come to our shores, so that we’d preserve our democracy, and 80 years later, we’re faced with a possible fascist takeover. We’re gonna fight hard to make sure that that doesn’t happen… We have to keep Trump’s feet to the fire, because for the countries that have become autocracies, for the most part, it takes years to start changing the constitution, to start changing the electorate, to make the disinformation take hold.”\n\n Meanwhile, Reiner says he’s “really mad” at Jake Tapper for Original Sin, his new book with Alex Thompson about Joe Biden’s decline. The book features a dramatic scene during a star-studded Los Angeles debate party as Biden implodes: In its telling, Reiner begins yelling “We’re fucked! We’re going to lose our fucking democracy because of you,” directing the latter remark at another VIP guest: Doug Emhoff, Kamala Harris’ husband, who is said to be taken aback. \n\n Reiner says it’s absolutely true that he was yelling “we’re fucked” — “I did say that. There’s no question about it.” But he says he was “yelling at the wind,” not at Emhoff, and didn’t say “because of you.” A spokesperson for the book responds: “Jake and Alex stand by the reporting that has been confirmed by numerous sources in the room.” Representatives for the book also shared a screenshot from what they said was one of the sources, who wrote, “from what I remember, he did say, ‘because of you.'”\n\n “I wasn’t yelling at Doug Emhoff,” Reiner insists. “What am I gonna do? I’m gonna yell at Doug Emhoff and say ‘it’s all your fault?’ What does that mean, even? It makes me look like an idiot. Yes, I was so frustrated. That part is true. I was frustrated and I did yell, and I was talking to J.B. Pritzker afterwards [too], and I said, ‘we’re really fucked.’  There’s a lot of blame to go around, but I certainly would not blame Doug Emhoff for the fact that Joe Biden had a crappy debate.”Reiner recently finished a sequel to 1984’s classic Spinal Tap, reuniting the original cast — it’s due in theaters Sept. 12. A 4k restoration of the original film is also set for a limited run in theaters this summer, from July 5 to 7.","summary":"The legendary director also denies that he yelled at Doug Emhoff for Biden’s debate performance, a widely publicized anecdote in Jake Tapper and Alex Thompson’s Original Sin","url":"https://www.rollingstone.com/tv-movies/tv-movie-features/rob-reiner-springsteen-trump-doug-emhoff-debate-biden-1235351244/","image":"https://www.rollingstone.com/wp-content/uploads/2025/05/rob-reiner-disputes-tapper-supports-bruce.jpg","video":null,"publish_date":"2025-05-30 15:01:39","author":"Brian Hiatt,Brian Hiattt","authors":["Brian Hiatt","Brian Hiattt"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":326549278,"title":"The Only “Judicial Coup” in This Country Is by Trump Against Judges","text":"They both shoulder some blame, but neither of those is really the answer. Every time I ask myself how he gets away with this, I remember: Oh, right. It’s the right-wing media. Duh.\n\nAfter the election, I wrote a column that went viral about how the right-wing media made Trump’s election possible. Fox News, most conspicuously, but also Newsmax, One America News Network, Sinclair, and the rest, along with the swarm of right-wing podcasters and TikTokers, created a media environment in which Trump could do no wrong and Kamala Harris no right. \n\nThink back—I know you’ve repressed it—to that horror-clown-show Madison Square Garden rally Trump held the week before the election. It was, as the Times put it, a “carnival of grievances, misogyny, and racism.” A generation or two ago, that would have finished off his campaign. Last year? It made no difference. No—it helped. And it helped because a vast propaganda network—armed with press passes and First Amendment protections—spent a week gabbing about how cool and manly it was.","summary":"So Donald Trump got a temporary win Thursday when a federal appeals courts stayed the decision from the International Court of Trade, which ruled that his tariffs were illegal. Trump aides went on Fox News to crow about their big victory, but they may be back to eating crow soon: The stay was granted on an administrative basis only. In addition, a second federal court has also issued a ruling blocking the tariffs. \n\nMeanwhile, the administration suffered another huge legal setback this week when a different federal judge ruled that Harvard University can keep admitting foreign students for the time being, overruling the administration’s efforts to derail the university. Naturally, the attack on Harvard is just phase one in Trump’s attempt to Orbánize, if I may put it that way, American higher education. It’s a nakedly ideological and authoritarian attack, for which the administration—while asking to see the coursework of every international student—is presenting to the courts no actual evidence of wrongdoing,","url":"https://newrepublic.com/post/195906/judicial-coup-miller-trump-judges","image":"https://images.newrepublic.com/13c8795bb1f58679f1dc5c2e53b250617ce533bc.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-05-30 14:48:52","author":"Michael Tomasky,Trump Against Judges","authors":["Michael Tomasky","Trump Against Judges"],"language":"en","category":"politics","source_country":"US","sentiment":-0.193},{"id":326603642,"title":"More than 90 wildfires are out of control in Canada","text":"Dozens of enormous wildfires have erupted across Canada, already forcing 21,000 evacuations and spewing toxic smoke into the air. The provinces of Manitoba and Saskatchewan have both declared a state of emergency, as several separate blazes raged out of control. Canada's Prime Minister Mark Carney is sending in the military to help move residents and fight fires in Manitoba, where 17,000 people have been forced to evacuate. Manitoba Premier Wab Kinew called it the province's largest such exodus in living memory. In Saskatchewan, where 4,000 people have fled their homes, the conditions are \"as severe\" as \"anything that we have faced for quite some period of time, if not ever\", premier Scott Moe said. With no rain in the forecast, and a hot and dry summer on the horizon, the blazes are expected to balloon. Mr Moe added: \"I think there's an admission here that things are going to get worse before they get better.\" Much of the country is currently exceptionally dry and warm. On Friday, 175 active fires were burning, of which 95 were out of control, according to the Canadian Interagency Forest Fire Centre. In recent years, Canadian fires have billowed dirty smoke across North America, famously spreading ominous, orange-tinted skies and filthy air across New York in 2023. Air quality in Arrowhead, Minnesota, is deemed unhealthy for people and animals sensitive to pollution and other airborne particles, according to the Environmental Protection Agency's AirNow page. Daniel Swain, climate scientist and meteorologist at University of California, Los Angeles (UCLA), said smoke from Canada was already visible in the western US state of Colorado today, carried by favourable winds. The intense fires early in the year will likely \"have knock-on effects in the US later this fire season\", he warned. The countries share firefighting resources and will likely have to battle strong wildfire seasons at the same time later this year, creating competition for supplies. This challenge will be \"compounded by recent severe cuts to emergency response, wildland firefighting, and weather prediction\" by the Trump administration, added Dr Swain. In response, White House spokeswoman Abigail Jackson described Mr Swain as a \"longtime Democrat donor who has spent hundreds of dollars supporting liberal politicians, including loser Kamala Harris, with radical climate policies that the American people have repeatedly rejected\". \"President Trump is remaking our disaster response to keep all Americans safe by ending the ineffective ways of the past and working with state and local governments to invest in their own resilience before disaster strikes.\" Figures from the Federal Election Commission show Dr Swain's contributions since 2018 add up to less than $1,000. What causes Canada's wildfires? Canada is no stranger to wildfires, which can be sparked by human or natural causes like lightning, and are also influenced by the way the land is managed. But climate change is creating more fuel for them, as hotter air dries out the land. Fire-friendly weather that created exceptional blazes in eastern Canada in 2023 was made at least seven times more likely by climate change, scientists at World Weather Attribution found. Justin Murgai, CEO of WaterAid Canada, told Sky News: \"The growing scale and severity of wildfires in Canada are a stark reminder of our changing climate.\" He said the fires \"threaten air quality, displace families, and stretch essential services to breaking point, often contaminating water sources and cutting off communities from safe water\".","summary":"Dozens of enormous wildfires have erupted across Canada, already forcing 21,000 evacuations and spewing toxic smoke into the air.","url":"https://news.sky.com/story/more-than-90-wildfires-are-out-of-control-in-canada-13377002","image":"https://e3.365dm.com/25/05/2048x1152/skynews-wildfire-caribou-lake_6931306.jpg","video":null,"publish_date":"2025-05-30 14:37:00","author":"Victoria Seabrook","authors":["Victoria Seabrook"],"language":"en","source_country":"gb","sentiment":-0.013},{"id":326513908,"title":"Women’s rights group launches ad campaign against Spanberger in Virginia: ‘She’s an extremist’","text":"In her latest campaign ad, Spanberger claims to have stood up to both parties while in Congress, and she touts how she was once labeled the most bipartisan member of Congress from Virginia. \n\nThe Sunlight Campaign, which challenges that narrative, features several radio ads airing across Virginia via iHeartRadio. The ads call Spanberger an “Anti-Woman Candidate.”\n\nCarrie Sheffield, a senior policy analyst at Independent Women’s Voice, spoke exclusively to the Washington Examiner about why starting this campaign was so important to her as a Virginia voter, resident, and homeowner. \n\n“She’s trying to portray herself as pro-woman,” Sheffield said. \n\nBut Sheffield noted that Spanberger’s time in Congress does not align with the record of a feminist. “She voted against protecting women’s sports. This is dangerous. It creates serious physical injuries. It creates situations in locker rooms that invade privacy, and she’s on the wrong side of this.”\n\nA Wick Insights poll found 83% of the public said it is wrong to have men in women’s sports. This includes 76% of Democratic voters and 78% of female voters, who agree it is important to separate the sexes when it comes to athletics.\n\n“She, overall, has an extremist voting record,” Sheffield said. “When you look at her time in Congress, she had only a 5% voting record, according to Heritage Action.”\n\nHeritage Action scorecards rank the conservatism of Congress members based on their votes in the House and Senate. The average House Democrat has a score of 10%. Spanberger scored half the average at 5%. She left Congress to run for governor after serving two terms representing her swing district in northern Virginia.\n\n“She’s an extremist,” Sheffield said. “If Abigail Spanberger does claim to be a moderate, she’s lying.”\n\nSpanberger also failed the Riley Gaines Stand with Women Scorecard, which scores Congress members on whether they support legislation preserving female opportunities and private spaces. Former collegiate swimmer Riley Gaines, who had to compete against transgender woman Lia Thomas and rose to national prominence through her public speaking on the experience, started the grading system. IWF calls it “a first-of-its-kind resource that tells every American who Stands with Women and who does not.”\n\nSheffield highlighted examples of Spanberger’s positions on gender. \n\n“Even during Women’s History Month, she supported Trans Visibility Day, which, in many ways, is an assault on the rights of women,” she said. “Title IX was a legendary piece of legislation. It allowed access to sports and equal opportunity for girls and women. Everything Abigail Spanberger stands for would erode this.”\n\nConservative critics are concerned about more than Spanberger’s record on gender. During her time in Congress, she also voted in line with former President Joe Biden on the economy, energy, and immigration.\n\n“She voted against the Laken Riley Act, which would protect and make sure illegal aliens are being deported,” Sheffield noted. “When you’re talking about economics, she did all of the bills that Joe Biden wanted that increased inflation that was so painful for families in Virginia and all over the country. You had record inflation under Joe Biden, 20% cumulative, hadn’t been seen in a generation. Abigail Spanberger is pro-inflation. Abigail Spanberger is pro-hurting families at the kitchen table.”\n\nSpanberger became the Democratic nominee for the off-year gubernatorial race in April. She is set to face off against Lt. Gov. Winsome Earle-Sears in the Nov. 4 Virginia gubernatorial election. \n\nEarle-Sears is the first black woman to be elected to a Virginia statewide office and the commonwealth’s first female lieutenant governor. Still, the race has been an uphill battle for Earle-Sears, even with Youngkin’s endorsement. She was on her way to winning her party’s nomination when her momentum was blunted by two MAGA Republicans who jumped into the race, and she is getting outraised by her Democratic opponent by more than double. \n\nWhat’s more, former Vice President Kamala Harris won Virginia last year by more than 200,000 votes. And while that result was closer than expected, it still revealed the advantage Democrats have due to the high concentration of Democratic voters in the heavily populated areas outside Washington, D.C.\n\nSpanberger reported raising $6.7 million during the first three months of 2025, more than double the $3.1 million raised by Earle-Sears, according to an analysis by the Virginia Public Access Project. \n\nWhile the Sunlight Campaign is not supporting a specific Republican gubernatorial candidate, Sheffield said Virginia cannot go back to Democratic rule.\n\n“We believe [Spanberger’s] policies would be dangerous for Virginians,” Sheffield said. “I’m also the chapter president for Independent Women’s Network here in Virginia. [Our members] have been so excited to see what’s happened under Gov. Youngkin. We have a lot of mothers, people who have children in public schools in Virginia, and Youngkin has been able to remediate some of that, which is great. We just can’t go back.”\n\nSheffield said the Sunlight Campaign also plans to hold events with Gaines and Youngkin before the election to educate voters on Spanberger’s policies.\n\nThe Washington Examiner reached out to Spanberger’s campaign for comment.\n\nBarnini Chakraborty and Mabinty Quarshie contributed to this report.","summary":"Former Rep. Abigail Spanberger, the Democratic gubernatorial candidate in Virginia, is portraying herself as a centrist ahead of a competitive race to replace Gov. Glenn Youngkin (R-VA) in November. But one women’s rights group believes the former representative&#8217;s voting record during her time in Congress reflects an “extreme, anti-woman” agenda. Independent Women’s Voice launched a [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3426166/independent-womens-voice-sunlight-campaign-abigail-spanberger/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/AP24044810688295-scaled-1024x683.webp","video":null,"publish_date":"2025-05-30 14:32:25","author":"Amy DeLaura","authors":["Amy DeLaura"],"language":"en","category":"politics","source_country":"US","sentiment":0.137},{"id":326507000,"title":"Does Kamala Harris care enough about California’s problems to run for governor?","text":"The polls show Kamala Harris holds the approval of about 50 percent of California voters as she heads into a self-assigned summer of decision making about her political future.\n\nDoes the former vice president who lost last year’s election by just 1.6 percent of the popular vote want to give up on the possibility of succeeding Donald Trump as president? Is she ready to deal with all the detailed and complex issues that constantly confront any California governor? Can she raise the $100 million or so minimum needed to be a credible candidate for governor?\n\nThese are just some of the items on Harris’ mind as she disapprovingly watches Trump run the government in a confrontational manner completely foreign to her.\n\nBut she knows that if she does not run for president in 2028, she will forfeit any advantage she would possess as a barely beaten candidate last time out, one whose defeat now has many 2024 Trump voters feeling a bit of buyer’s remorse.\n\nShe also knows that if she goes for governor, she will have to promise to serve out a full term in that office should she win. Reneging on that pledge would likely doom her in any presidential primary election, tagging her as a non-promise keeper. But keeping such a pledge also takes her out of the 2028 presidential running.\n\nIt’s a rare quandary no previous California Democrat has faced. The huge question for Harris: Does she care enough about the details of California issues from electric vehicle mandates to Medi-Cal for the undocumented to give up on her national ambitions, at least for most of her 60s? (Harris will be 63 on Election Day 2026.)\n\nFor sure, Harris bears the image of a surfacy politician. Rivals also blame her for failing to disclose just how disabled ex-President Joe Biden became. Few can name salient achievements of either her six years as state attorney general or her four years as Biden’s No. 2.\n\nSome of those are substantial: During the fiscal crisis of 2009-2012, when many thousands of mortgages were threatened with foreclosure, she leveraged California’s sheer size to jump the state’s share of a 2012 national mortgage settlement up from an initial top offer of $4 billion to $18 billion, helping an unknown but large number of Californians evade foreclosure.\n\nBetween 2013 and 2015, her office recouped more than $1 billion for the state’s major public employee retirement funds after banks and rating agencies lied to greatly overvalue mortgage-backed securities.\n\nShe also secured a 2012 agreement with Apple, Google, Microsoft, Amazon and HP to require all apps they sell to display clear new privacy policies – and then she created a state privacy enforcement unit to seal that deal.\n\nHer record was less noteworthy as vice president, partly because Biden assigned her impossible tasks, like fixing conditions in Latin America that encourage illegal immigration. That assignment did not come with the power to make any improvements.\n\nSo the Harris image as a lightweight, promoted in part by her cackling responses in some interviews, can be misleading and other candidates for governor would be wise not to underestimate her.\n\nNo one really knows, perhaps not even Harris. That’s what makes this question so vital in a campaign where other candidates like former Los Angeles Mayor Antonio Villaraigosa and former state Atty. Gen. and federal Health Secretary Xavier Becerra are known for their strong interest in taking on major issues. Candidates like former state Senate President Toni Atkins and former state Controller Betty Yee are similarly known for strong focus.\n\nIf Harris runs and debates them all, plus Republicans Steve Hilton and Chad Bianco, they will surely be trying to paint her as the lightweight of her reputation and not the accomplished politician of her reality.\n\nWhich makes running a big risk for Harris, who could lose out as a major national player if she enters this race, regardless of whether she wins or loses.\n\nEmail Thomas Elias at tdelias@aol.com.","summary":"The polls show Kamala Harris holds the approval of about 50 percent of California voters as she heads into a self-assigned summer of decision making about her political future.","url":"https://www.ocregister.com/2025/05/30/does-kamala-harris-care-enough-about-californias-problems-to-run-for-governor/","image":"https://www.ocregister.com/wp-content/uploads/2024/11/AP24311777031117-2.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-30 14:00:51","author":"Thomas D. Elias","authors":["Thomas D. Elias"],"language":"en","category":"politics","source_country":"us","sentiment":-0.028},{"id":326495984,"title":"Gavin Newsom Can’t Run Away From His Biggest Liability","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nWill Gavin Newsom run for president? It’s the million-dollar question. Throughout his political career, there has been a sense that the California governor has been setting himself up for a potential presidential campaign.\n\nMost recently, he’s been signaling his higher ambition in a new way: through a podcast. It has been a controversial venture, namely because of Newsom’s choices of guest. So far, they’ve included former White House chief strategist Steve Bannon and right-wing provocateur Charlie Kirk. Marisa Lagos, a political correspondent at KQED who has covered Newsom for two decades, sees it as a national reset.\n\n“I gather that this might be an attempt to paint his way out of the corner of being a California liberal,” she says.\n\nOn a recent episode of What Next, host Mary Harris spoke to Lagos about what Newsom has been up to and whether it has been working. This transcript has been edited and condensed for clarity.\n\nMary Harris: How would you explain how Gavin Newsom has landed where he is now, like, at the tippy-top of the Democratic Party? \n\nMarisa Lagos: You can start, honestly, with aesthetics. The guy looks like a politician. He’s got that sort of Kennedy vibe. He’s Irish Catholic. He was raised in this interesting mix of a world: He had a single mom who fostered kids and struggled financially, but he would spend weekends and summer trips with his dad, who was very close with the wealthy Getty family.\n\nWhen he entered politics—his first appointment was on the Parking and Traffic Commission—he was very ambitious. He has always had his eye on the next thing, the next prize. His election and beating a recall have been relatively easy, and that speaks to the way that he’s been able to position himself in California politics.\n\nNewsom rose to prominence as mayor of San Francisco, mostly because he allowed same-sex marriages to move forward. For a lot of people, part of the reason why this podcast turn from Newsom has been so surprising is because of that. Do you notice the disconnect too? \n\nI see a disconnect. He might argue that there’s a connection in that he’s “willing to stand up even to the people closest to him.” That certainly was the case in 2004, with gay marriage. You had people like Dianne Feinstein, one of his mentors, warning against this just broadly for the Democratic Party and saying that it was going to hurt them. He stood up for what he saw was right, and it was politically brave. That could have been the end of his political career, you know?\n\nAt the end of the day, if he is going to lead on something, it’s a lot braver to do something like that, that really has that impact and that he can show leadership with.\n\nNewsom was governor the previous time Donald Trump was in office as president. How did he approach the Trump administration then? And how does it look different this time?\n\nIn 2017 Newsom really was the leader of the resistance, or one of them. He came out swinging very hard.\n\nThis time around, it’s been different. When Trump came into office, Los Angeles was on fire. The state was grappling with one of its worst urban disasters in history. You could argue that Newsom walked a fine line of not wanting to alienate Trump. He greeted him on the Tarmac when Trump came to visit L.A. He has definitely been careful in the way that he is critical of the president.\n\nWhen Newsom rolled out his budget recently, he was railing against tariffs. He spent the top 30 minutes of the news conference talking about how that was affecting the economy and caused this budget deficit. And then, when he was asked if he was blaming Trump, Newsom said no.\n\nMany Democrats are trying to figure out how to push back against what feels like a stronger, more organized Trump administration. Newsom has been maybe the best example of that.\n\nSome have focused on policy announcements from Newsom and looked at those as indications of a shift in tone from him. There’s been a lot of attention to the fact that he has said he wants local communities to start to push to get rid of homeless encampments. I’m wondering if you see this as a shift.\n\nI don’t see it as a huge shift. Homelessness has been an issue that he’s struggled with and tried to really tackle aggressively since he was mayor. At the time, he got a lot of blowback for initiating a program that a lot of people on the left saw as overly aggressive. I mean, essentially, he told people on the streets, “You are not going to get your welfare payments directly. You’re going to have to engage in services if you want this money.”\n\nI think what he and a lot of other people in the Democratic Party here would say is that it’s not progressive to let people sleep and die outside, right? They’re trying to get their arms around a problem that has been difficult to solve. I don’t think you can view the way he is positioning himself as inconsistent with the way he’s approached this problem his whole career.\n\nAnd if you look at polling, it’s not as if homelessness is a left–right issue. People want this solved. They do not want encampments in their neighborhoods, and they feel that the state needs to step up and do something, especially given the amount of money we spend.\n\nNewsom also announced that he wants to roll back medical coverage for people who lack permanent legal status. And this did seem like a big change to me, because when the program launched, California proudly said it was going to move forward with health insurance for this group. How do you see this? \n\nThis one’s a little more complicated. If Trump were not in the White House, if Kamala Harris were president but the budget were similarly hurting and he had proposed this, we would not be talking about it, right?\n\nThere’s an expectation that folks on the Democratic side are going to dig in and protect immigrants who lack permanent legal status. But there are a lot of people looking over their shoulder, going, “Wait, did we miscalculate? Are we on the wrong side of things?”\n\nIf you look at the details of what Newsom has proposed, the way they want to do it is to stop enrolling people come next January. So that’s a pretty long runway—create a copay for adults who are undocumented in 2027. They’re not proposing to cut off aid to kids, for example. This was not a full-throated walking away from this policy. It’s sort of nibbling around the edges.\n\nIt seems to me that if you’re a Democratic politician right now, it would be easy to say something like, “Our state budget is just going to get slammed because of everything that’s happening in Washington. And, frankly, we are getting a ton of pressure to reduce aid to this population, and I have to make some adjustments here. My hand is really being forced, and I don’t want to do this, but I’m going to do it this way, and the children will still be covered.” But those aren’t the headlines I’m seeing. \n\nIn a way, maybe that’s what Newsom wants. He wants that headline as a virtue signal to somebody in another state. But at the same time, he can turn around at home and say, “You didn’t lose your health care.” It gave him a little bit of credibility on both sides.\n\nThat is his biggest problem. A recent poll found that most Californians, even Democrats who have supported him, feel that he’s operating more with an eye toward his political future than what’s best for the state.\n\nThere’s the benefit of looking the way he does, and he seems like a natural politician. There’s the sort of double-edged sword of that. A lot of people see you as a natural politician, but people don’t really like politicians, and they don’t like people that they think are acting with their political survival in mind. He has always had that kind of problem politically.\n\nAnother problem that I think Newsom will face if he does launch a national campaign is that he was a massive Joe Biden stan. He was at the debate where Biden flopped. He was claiming, in the aftermath, that Biden won that debate. Has he dealt with that at all? \n\nYeah, he really went hard for Biden. He continued to. This is something that will be a huge question for him.\n\nWe’ve really explored Newsom’s trouble spots. But he’s proved so durable in the past. He literally survived a recall election not that long ago. What do you think he has learned from his experiences? \n\nI don’t know if the recall is the best sort of learning experience. California is such a different state. We have everything nationally that you would have in a national race. You have deep-red areas; you have rural, urban, mountains, and desert. But the registration here is just so heavily Democratic that it’s a fully different conversation if you’re running statewide here than if you’re running nationally.\n\nI think why we’re seeing him a little lost right now, perhaps with this podcast, is because it would be such a different calculation to run nationally. Even if you’ve spent so much time on cable news, preparing for that moment, it’s going to look really different when you’re actually campaigning in primaries.\n\nHow do you think you’re going to know that Newsom’s made his choice, that he’s entering the race or not? Is there going to be a tell? \n\nI don’t think anything will be definitive, because what we’ve seen in the past is that he’s always setting himself up for the next run. I think he’ll do everything he can to do that, whether or not he’s decided 100 percent if he’s going to run.\n\nDo you think he’s got a shot? \n\nI don’t know. I find it hard to believe that there’s a lane for a California Democrat, but never say never. Politics feels very unpredictable these days. I would hate to count him out entirely. I think, in some ways, the folks in California are more skeptical of his national aspirations than people nationally are, even though people nationally seem to dislike him more. There’s a lot of skepticism here that the rest of the country wants a Californian in the White House.","summary":"Why the California Democrat is fraternizing with right-wingers.","url":"https://slate.com/news-and-politics/2025/05/gavin-newsom-running-president-california-democrat-liabilities-podcast.html?via=rss","image":"https://compote.slate.com/images/a881f481-5112-4b20-bd8f-8097437bb4f3.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-05-30 14:00:00","author":"Mary Harris","authors":["Mary Harris"],"language":"en","category":"politics","source_country":"US","sentiment":-0.061},{"id":326497298,"title":"Gayle King not leaving CBS just yet, despite confusion at network: ‘Wait and see what happens’","text":"Gayle King isn’t going anywhere at CBS – for now – as she wants to see what the new owners of Paramount have up their sleeves, sources tell Page Six.\n\nThe 70-year-old host of ‘CBS Mornings’ has signed a contract extension that runs through next summer, we can confirm.\n\nShe has already taken a pay cut down from $13 million to $10 million, as The Post previously reported, but an industry insider said she King will not leave before parent company Paramount’s planned $8.4 billion merger with Skydance Media goes through, even though things at CBS are “sh—y.”\n\n“It’s a very useful platform for Gayle,” said the insider, “[I think] she would certainly want to continue through the midterm [elections in November 2026].”\n\nEarlier this month, News boss Wendy McMahon at the network stepped down amid steep ratings declines at “CBS Mornings” and “CBS Evening News,” which she had tried to overhaul with a new format and anchor lineup.\n\n“It’s become clear that the company and I do not agree on the path forward,” she wrote in a memo to staff.\n\nCBS News president Tom Cibrowski has been left trying to keep things afloat.\n\n“As much as it’s still sh—y over there, it’s good for her to wait and see what happens with the merger, with new people, if they can get their act together,” said the industry insider of King.\n\n“The folks at the Skydance have very specific ideas about how they can revitalize the news side of things, so there is reason for Gayle to hang around.”\n\nIndeed, King looked in good spirits Wednesday night as she joined her pal Hoda Kotb at the launch of her new wellness brand, Joy 101, at Chelsea Piers in NYC, alongside ‘Today’ hosts Savannah Guthrie, Jenna Bush Hager, Craig Melvin and Dylan Dreyer.\n\n“I bet she stays, even if she gets a pay cut,” said another TV source, “People assume incorrectly that the money is the deciding factor. When in reality a pay cut doesn’t mean that much when you are making that kind of money.”\n\nA CBS spokesperson told The Post: “Gayle is an incredibly valuable member of the CBS News family. She has no plans to go anywhere and we couldn’t be happier about that.”\n\nInsiders previously told The Post that King’s salary is far too high to justify her show’s plummeting ratings.\n\nKing, who has been at the Tiffany network for 13 years, hosts ‘CBS Mornings’ with Tony Dokoupil and Nate Burleson. The show is firmly in third place behind ABCs ‘Good Morning America’ and NBC’s ‘Today’.\n\nFor the week of May 19 ‘GMA’ had 2.6 million viewers, followed by ‘Today’ with 2.5 million, and ‘CBS Mornings’ lagged behind at two million viewers. Compared to 2024, CBS’ morning show has dropped nine percent in total viewers and 30 percent in the crucial 25-54 demo — the steepest drop in the demo among the three morning broadcasts, according to Ad Week.\n\nThe industry insider insisted things really started to freefall for CBS News when Jeff Glor left the Evening News in 2019 and the ratings went down.\n\nParamount is currently in mediation with lawyers for President Trump after he filed a $20 billion lawsuit against “60 Minutes,” in which he alleged the show “deceptively edited” its sitdown with then-Vice President Kamala Harris, who was running for president at the time, to make her look better.\n\nOn Thursday, it was reported Paramount had offered $15 million to settle the suit.\n\nFederal Communications Commission (FCC) chief Brandon Carr, who is charged with greenlighting Paramount’s merger with Skydance, has also launched a probe into the interview over claims of “news distortion.”\n\n“60 Minutes” has claimed no wrongdoing and released the unedited interview and transcript of the interview, but the episode has rankled journalists inside of the network.","summary":"\"As much as  it's still s––--y over there, it's good for her to wait and see what happens with the merger, with new people, if they can get their act together,\" an industry insider said about Gayle King at CBS.","url":"https://pagesix.com/2025/05/30/celebrity-news/gayle-king-signs-extension-to-stay-at-cbs-until-summer-2026/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/05/newspress-collage-ovirica6z-1748554213403.jpg?quality=75&strip=all&1748539882&w=1200","video":null,"publish_date":"2025-05-30 13:32:21","author":"Ian Mohr,Sara Nathan","authors":["Ian Mohr","Sara Nathan"],"language":"en","source_country":"us","sentiment":-0.057},{"id":326482940,"title":"Democrats need to embrace males with affection, not political strategy, NYT columnist argues","text":"New York Times opinion columnist David French suggested the Democratic Party's $20 million effort to address their fallout with male voters might be the wrong approach, arguing that men needed to be embraced with \"sincere affection.\" \"Speaking with American Men: A Strategic Plan\" is Democrats' $20 million project to \"study the syntax, language and content that gains attention and virality in these spaces\" of male voters, the Times reported Sunday. Known as \"SAM,\" the study will specifically examine young male voters and how the party can connect with the demographic. Additionally, the study advised rolling out pro-Democrat ads in video games. French acknowledged the Democratic Party's fallout with young male voters, as the voting bloc was instrumental in re-electing President Donald Trump, but argued the party was \"getting the challenge of reaching young men backward,\" because the \"manosphere is not about politics.\" \"You can’t write a history of the manosphere without acknowledging that it was a response to a genuine crisis,\" French added. \"Slogans like 'the future is female' created the impression that the sexes were in competition, and for women to win, men had to lose.\" FETTERMAN HITS PARTY'S LOSSES AMONG YOUNG MALE VOTERS: ‘ITS UNDENIABLE THAT DEMOCRATS HAVE LOST A LOT’ The headline for French’s column read, \"The Democrats’ 20-Million-Dollar-Man Problem.\" The term \"manosphere\" has been used to describe podcasters or online personalities that appeal to male listeners and viewers. French also pointed to the American Psychological Association's study from 2019, which deemed traditional masculinity as \"harmful.\" The study described it as being \"marked by stoicism, competitiveness, dominance and aggression.\" The NYT columnist wrote, \"The message seemed clear. Men, you don’t have a problem; you are the problem.\" The 2024 election cycle included a push from both Kamala Harris and Donald Trump's campaigns to speak to podcasters and other non-traditional media voices. ‘THE VIEW’ HOSTS CLASH OVER WHETHER RACISM, SEXISM PLAYED ROLE IN TRUMP ELECTION VICTORY The NYT reported that part of the Democrats' push to regain support from young male voters is to \"shift from a moralizing tone.\" \"The manosphere succeeded not by refusing to condemn men and not by avoiding a moralizing tone, but by choosing to love them and by choosing to help them,\" French wrote. French also argued that the \"manosphere\" has been planting \"seeds for its own failure,\" and Trump’s involvement with it means that many men are \"doubling down on the worst versions of themselves.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE French said men needed to be embraced with \"sincere affection.\" \"The answer to the manosphere’s dark turn is rooted in embracing men with sincere affection, shunning the zero-sum calculus of the gender wars and offering a vision of masculine virtue that inspires men to heroic acts of compassion rather than vicious acts of aggression,\" French added. CLICK HERE TO GET THE FOX NEWS APP \"America doesn’t need a left-wing version of Joe Rogan. What it needs is our parents, pastors, teachers and coaches to fill the void in young men’s hearts. Our sons should not have to turn to books or podcasts or social media to hear this simple and powerful message: I like you. I want you to live a good life. Let me show you how,\" the New York Times columnist concluded. Fox News' Emma Colton contributed to this report.","summary":"David French, a columnist for the NYT, suggested Democrats should embrace young male voters with affection, critiquing their $20 million plan to win back the key voting bloc.","url":"https://www.foxnews.com/media/democrats-need-embrace-males-affection-not-political-strategy-nyt-columnist-argues","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/harris-rally-french-healdine.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-30 13:19:41","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.123},{"id":326506948,"title":"Alexandria Ocasio-Cortez: ‘The People Will Show Me the Way’","text":"t’s an early May afternoon in Washington, D.C., and as a group of demonstrators gather outside of the Capitol protesting cuts to Medicaid, Rep. Alexandria Ocasio-Cortez is in her congressional office, excitedly pulling bright pink, blue, and yellow yarns out of her purse. \n\n “I am knitting a cardigan; I call it my Fruity Pebble sweater,” says Ocasio-Cortez, holding the colorful jumble against her black dress. The congresswoman has recently started knitting as an alternative to doomscrolling. “This is a practice that forces me to slow down. In a moment like this, when there’s so much chaos, it is designed to basically just wear our nervous system down raw, so we are then overwhelmed, paralyzed, and have to accept whatever new development there is going on that day.” \n\n Ocasio-Cortez is no stranger to existing in chaos — she was thrust into the national spotlight in June 2018 when she upset House Democratic Caucus chair Joe Crowley in New York’s 14th congressional district primary election. The attention has brought Ocasio-Cortez her fair share of both recognition and abuse, which we talked about when we met last year at a diner in Queens to discuss her legislation to end nonconsensual, sexually explicit deepfakes online. A lot has changed since then, especially politically. President Joe Biden withdrew from the 2024 race, Vice President Kamala Harris replaced him on the top of the ticket, and Donald Trump was elected for a second time. \n\n Trump’s whirlwind first 100 days in office steadily chipped away at democracy as we know it, with free speech, due process, and the balance of power in the crosshairs. In that time, the Democratic Party has come under fire, accused of not being ready to meet the moment that is demanded of party leadership. But a notable exception to this narrative has been Ocasio-Cortez, whose “Fighting Oligarchy” rallies with Sen. Bernie Sanders have drawn tens of thousands of people in states like California, Utah, and Colorado.\n\n Ocasio-Cortez brings up this “moment in history” throughout our conversation this spring. She talks about how this is a time when communities need to come together with courage rather than fear, how Democrats need to chart a path for a more inclusive future rather than constantly play defense, and how, above all, connectivity helps to avoid despair.\n\n The congresswoman has a background of community organizing, and there’s evidence of that throughout her D.C. space. A gallery wall in her office features posters of political calls to action — End Evictions! Climate Justice for All! — alongside photos of rallies and protests. “It’s a way for me to bring home here,” she says. As we speak, people line up outside of her office to write on the neon Post-it notes covering her door. There are handwritten messages from people from the U.S. and abroad, thanking her, telling her different versions of “never stop fighting” or, as it’s written in Spanish, “nunca dejas de luchar.” \n\n “I feel very indebted to people for how powerfully people are choosing to show up, when everything about this moment would support tuning out,” Ocasio-Cortez says. “We need Democrats that are willing to stand up and brawl and not be afraid to fight on these issues, and we need mass collectives of people organizing in the streets,” she says. “I believe it’s always been that combination that is able to stop the encroachment of authoritarianism and fascism.”\n\n The last time we met, we talked about the Defiance Act, the bill you are co-sponsoring that would give survivors of sexually explicit deepfake AI abuse recourse to sue. Why is it more important now than ever?We saw Trump’s announcement at the State of the Union for the Take It Down Act [legislation requiring platforms to remove nonconsensual deepfake porn], which passed through. But what we are still missing is victim-centered legislation that actually gives victims the power and the ability to advocate for themselves and to fight for themselves and have their day in court, and that’s what Defiance does. It gives people who have been subject to nonconsensual, deepfake pornography the civil right of action so that they can pursue justice for themselves and to seek damages for this kind of sexual abuse and harm. Defiance is tremendously important, because Take It Down centers other people, right? But Defiance is about helping the disproportionately, and overwhelmingly, women and children who are affected by this.\n\n So much has changed in the world of AI even since last year. Since we last met, the outsize influence of tech billionaires in politics and on democracy itself has only grown. How does that affect the average person in America?There is almost no area of our lives that has not been affected by this tech-billionaire class because they’re buying elections. The balance of the Senate has been shifted because of the crypto lobby dumping millions of dollars into right-wing authoritarian candidates. And it’s important to note that this money is not going into just issue-lobbying alone. This isn’t about crypto billionaires trying to buy favors for the crypto industry. This is about crypto billionaires trying to install and support authoritarians and fascists, because they believe that if those fascists are personally close to them, then they can control far beyond the regulation of financial instruments. They think they can really start imposing this dystopian worldview that includes everything from the subjugation of women to democracy itself. And we’re seeing this play out right now in the fight over Medicaid. Beyond the Senate, Elon Musk dumped hundreds of millions of dollars into trying to buy the U.S. presidential election, and he is trying to recoup that investment by getting one of the largest tax cuts for billionaires in American history — which the Republican Party is trying to pay for through massive cuts to Medicaid, for Americans with disabilities, health care for the poor. They’re trying to cut Medicaid and SNAP food assistance to pay for additional tax cuts for Elon Musk and his industries, as well. And so it’s really important for people to understand that this goes beyond tech. This is about the extreme concentration of money and power.\n\n What did you think when you watched President Trump’s inauguration and powerful tech CEOs Jeff Bezos, Mark Zuckerberg, Elon Musk, and Sundar Pichai were sitting so close to him? This is a moment in history personified. This is not just people buying favors. This is about who controls this country, and everyone else is just a formality, and that is the worldview that we are up against right now. This is the stakes of the present moment. And when Sen. Sanders and I talk about oligarchy, this really is what this is. It is beyond partisan as well. It is concentrated. It is most concentrated in the Republican Party. But it’s also the power that controls our politics writ large. \n\n Your Fighting Oligarchy rallies with Sen. Sanders have drawn enormous crowds. What are you tapping into that other politicians haven’t been able to access?We are willing to name the problem in a way that has been challenging for [others] in the Democratic Party to confront. There’s been this debate about “Do Americans understand oligarchy or not?” And I think that’s a farce. I think that’s a cover for the fact that a lot of Democrats don’t want to talk about oligarchy. There’s a lot of Democrats that are uncomfortable with the fact that Americans feel this way, that Americans see the extreme concen-tration of wealth, they recognize viscerally that it is untenable and, frankly, un-American. I think a lot of folks are uncomfortable squaring that with the fact that they’re having dinner parties with the very people that are — and trying to court and curry favor with — the very individuals who hold power in a way that is unsustainable in this country. And so I think it’s less about the fact that Americans don’t understand oligarchy, and I think it’s more about the fact that people in power are uncomfortable with the degree that Americans do actually see it.\n\n Some people online joked that the Fighting Oligarchy name was the FO in “fuck around and find out.” Was that intentional?[Laughs.] I can’t say that it was intentional, but I do think that hindsight is twenty-twenty. We should — I will unofficially adopt it as a part of the slogan, because we are in the “find out” part now for sure.\n\n What does being on this tour with Sen. Sanders mean to you?It means a lot to me, personally, and also in this moment. I would not be in Congress were it not for Sen. Sanders, in a very literal way and in a figurative way. I never, ever, ever thought that someone like me could be in politics, and it wasn’t until Sen. Sanders ran [for president] in 2016 and showed that grassroots, small-dollar fundraising can actually help working people and unlikely candidates run for office. Even just from his literal example and how he structured his campaign; if it weren’t for that, I wouldn’t have ever even considered running for office. But then, of course, in a deeper and more meaningful way, his commitment, his values, that someone who shares my beliefs can make it in American politics, can even exist in American politics is — he is a huge inspiration for why I ran in the first place. He has continued to be a friend and provided a lot of guidance and counsel on my loneliest days here, and so to be able to do this with him is something I will cherish forever.\n\n “We need Democrats that are willing to stand up and brawl.”\n\n And also zooming out for the country, I think it’s been tremendously important, too. It’s not only that I’m doing this with Bernie, but that I’m doing this with every American who shows up. I had this moment on the rope line in Denver — when I first got elected, the crush of media and attention was very, very overwhelming. It was genuinely overnight. It’s kind of funny, sometimes I talk to my colleagues, or sometimes I’ll talk to other members, and they’ll be like, “Yeah, like the waitressing thing that’s just a story, right? Like you waitressed once, right? But what were you really doing?” But it’s real. \n\n I was literally bartending while I was running for office. And so it was an overnight, light-switch kind of situation. I wasn’t steadily building a career or anything like that. And so overnight, I win this primary, and because of the nature of that victory, it was just this massive crush of media and attention. Of course, a lot of hate, but also a lot of support. But all of it was very overwhelming. I don’t think I was able to really allow it to sink in, and, on a personal level, I wasn’t really able to feel it all, because it was so overwhelming.\n\n What happened at the rally in Denver?On this tour and especially after all of these years, duking it out here in Congress, and being subject to a lot of … whatever, even within my own party — this tour has been very healing for me, personally. It is tens of thousands of people who, despite everything falling apart around us, still want to work for something. On a personal level, I’m more of a low-key person, and so sometimes [with] all the people, it can feel like a lot. But I was on this rope line in Denver, it really started to feel like — I am feeling trans-formed by this, and I feel like people are feeling transformed by this. It is a collective experience. And so to me, it’s just to be able to do this, to do it with Bernie, to do it with people, it has been so powerful, and it has been the privilege of my life.\n\n Switching to immigration, I’ve been reporting on U.S.-citizen children who are being illegally removed from the country, one of whom was a four-year-old boy in active treatment for metastatic cancer. He’s the second U.S.-citizen child with cancer that President Trump has deported. How do you think the public should be responding to this?Listen, I come from a background of organizing. If this president is breaking the Constitution and if he’s starting to deport and force out U.S. citizens from this country, that, to me, is shut-it-down territory. We’ve seen collective action happen before, and mass civil resistance is one of the critical pieces that we have, and it requires both, right? We need Democrats that are willing to stand up and brawl and not be afraid to fight on these issues, and we need mass collectives of people organizing in the streets. I believe that it’s always been that combination that is able to stop the encroachment of authoritarianism and fascism.\n\n President Trump recently implied he’s not sure he has to uphold the Constitution, and many of the actions of his administration involve denying people due process. Beyond kids, we’ve also seen this in the cases of people deported to El Salvador, including Bronx resident Merwil Gutiérrez, who you’ve spoken about. What do we risk when we don’t have proper due process for everyone in the country, U.S. citizens or not?The Constitution is the only thing that really defines us as Americans. Despite the right wing’s attempts, we are not a country that is ethnically defined. We are not a country that is defined by any one person, ideology, etc., except for the Constitution. What makes America America is enshrined in that document, our freedoms. People need to understand that when the president attacks the Constitution, he is attacking our country. We all swear an oath to the Constitution. As federally elected officials, we swear an oath to uphold, to defend, to protect the Constitution of the United States. First and foremost, if the president is in any way confused about his responsibility, he should resign. Any president should resign if they don’t understand that, at the core, that’s what his job is. Trump knows exactly what he’s doing. He wants to transform the definition of what it means to be an American — from upholding the Constitution and our freedoms — to a pledge of loyalty to him. That is what a cult of personality and authoritarian regimes are all about.\n\n While on the subject of deportations, I want to talk about the students who are losing their visas and being detained in detention centers because they’ve been outspoken on Palestine. What does this mean for free speech in America?\n\n This has been our concern even before this moment. I have a history and a record of opposing a lot of the slush-fund dollars that Congress was approving into ICE [Immi-gration and Customs Enforcement] and CBP [Customs and Border Protection], because I felt like we could see the risk of this moment happening. When you funnel tons of money and no strings and exert little to no oversight or authority into ICE and CBP, you can set up the breaking of the Constitution, using ICE and CBP as the mechanism for violating our civil and constitutional rights. And it’s the same thing when it comes to Palestine.\n\n In the United States, everyone can talk about free speech as much as they want. The right wing can, as they have been, play this victim card around free speech all they want. And it’s not just Republicans. In both parties, everyone was talking about cancel-culture fears. Social repercussions for saying hurtful things [were] treated as though [they were] a constitutional crisis. When the fact of the matter is the most heavily policed speech in America, no matter who is in charge, has always been the advocacy and the recognition of the humanity of Palestinians.\n\n “When the president attacks the Constitution, he is attacking our country.”\n\n For a very long time, this groundwork has been laid and enforced. This idea conflating that recognizing the human rights of Palestinians is somehow equal to antisemitism, those bricks and those dangerous foundations have been laid for a very long time, especially since Oct. 7, 2023. It should not come as a surprise when we also see organizations like AIPAC [pro-Israel lobbying group American Israel Public Affairs Committee] and the crypto lobby going after and attacking human rights advocates and trying to unseat those in Congress, conflating antisemitism with people who just want to see Palestinian kids have their human rights protected. It all lays groundwork for this moment, because this administration has seized on that predicate. They have seized on all of those pretenses that have been laid before and say, “OK, well, if you believe that recognizing the plight of Palestinians is antisemitic, then it shouldn’t be that much more of a step further to revoke people’s green cards, accuse them of terrorism, accuse them of working with Hamas,” because that is some of the discourse that has been allowed in the Democratic Party as well. \n\n You can take on that mantle, you can pretend that it’s bipartisan, and what’s important for people to understand is that that then becomes the predicate for attacking our Constitution. An authoritarian regime, or the Trump administration, is never going to use politically popular or overwhelmingly sympathetic targets to dismantle the Constitution. They are always going to use the people most maligned and most marginalized in order to attack and erode the rights of every American, precisely because they know that not everyone will come to their defense.\n\n After the election, you reached out to people in your district who voted for you and also voted for Trump. What did you learn about these voters?I know it’s a hard pill for some people to swallow. But at the end of the day, if you are interested in the psychology of people who overlap between throwing a vote to Trump and throwing a vote to me on the same ballot, no matter what you think about it, those people believe he and I to be honest, to be direct. Honest about what we think, right? I say what I believe. They don’t think I’m bullshitting them. They know that I’m fighting for them. And it’s true, in terms of my relationship to these folks: You send me to Congress, and I’m going to fight for you, and I’m going to put your interests first. It’s strength, too. \n\n It’s also [about] where people get their information. I tend to be in the places where sometimes Trump is in terms of where they get their news.\n\n In national conversations, people see one thing, but at home, what people experience is my presence. I’m very present in New York. It’s not unusual for me to be walking down the street in Jackson Heights or in the South Bronx or in Astoria, and people see me and they have eyes on me. Trump did that, too, in this last election — he had [hundreds of] rallies in the last cycle. It’s something that I think sometimes gets overlooked.\n\n Polling indicates that while President Trump’s approval rating has fallen substantially, Democrats aren’t necessarily gaining. What should the party’s leaders be doing differently? And what can voters do to influence how Democratic leaders handle Trump? It’s sometimes less about party leadership and more about the party, because this is a party that selects its leaders. The Democratic Party selects its leaders, and its leaders act at the behest of the party members in the caucus. In a moment where we see Trump losing but you don’t see Democrats gaining in that loss, first and foremost, it cuts directly against a lot of assumptions here about politics being zero-sum. Politics are not zero-sum. \n\n And I think one of the things that people can see, if they want to see it, in November, is that this isn’t just this binary spectrum where one person’s gain is another person’s loss and vice versa, and also moving to the quote-unquote right, or picking up moderates, doesn’t necessarily mean that you’re going to keep your base. We run real risks in collapsed turnout, and the trick is not necessarily always in choosing one or the other, but we actually need all of it in order to win. One of the struggles that the party has is in deciding what the party itself stands for and who it wants to be. In fact, one of the most uniting principles, which is economic populism and genuinely fighting the oligarchy in this country, is also a political third rail inside the beltway of Washington, D.C. \n\n What do you mean by political third rail? It’s something that is tremendously popular with people, but a lot of our electoral system is based on appealing to the one percent.\n\n So it’s a political movement that’s being missed because of how the electoral system works?Right. If you depend on big money to win, it’s hard to get in front of a crowd and talk about the problems with big money.\n\n Trump says he’s using tariffs to try and bring manufacturing back for the American worker. Is there any part of this idea that you support?The way that they’ve gone about this tariff business is insane. The Biden administration used targeted tariffs. The existence and presence of tariffs, in and of itself, is not this explosive Chicken Little the-sky-is-falling kind of thing. Sometimes people have this blanket reaction, and it’s like they have amnesia over the fact that President Biden did institute 100 percent tariffs on certain Chinese energy exports. So you can’t look the other way when Biden does it and then act like every single tariff is bad when Trump does it. However, what Trump is doing is blowing a hole in not just the U.S. economy. The blanket nature of this — as though we’re somehow going to start manufacturing mangoes in the United States of America — I mean, give me a fucking break.\n\n “I say what I believe. [Voters] don’t think I’m bullshitting.”\n\n You have been fighting against Republican cuts to Medicaid. Can you talk about how these cuts will affect people?Medicaid is one of the largest insurers in the United States of America. One in five people get their insurance in whole or part or in part from Medicaid, and that’s before we even talk about Medicare. \n\n If you buy your insurance off of a health exchange, even if you’re buying a private health insurance plan off of an Obamacare or state exchange, you will be affected, because Medicaid expansion affects ACA coverage. \n\n Medicaid expansion affects people with disabilities, people who are looking for work, whose job doesn’t cover health insurance, whose job doesn’t pay enough for them to have health insurance. Out of every 10 babies born today, four of [those births] will be covered by Medicaid. \n\n We are talking about a massive devastation of our social safety net. And for all of this conversation that Republicans talk about with [Medicaid work requirements for] quote-unquote, able-bodied men — they are very literal in that —people with mental health issues, I think they would consider them able-bodied. We are talking about one of the biggest revocations of health insurance and health care in the United States of America. It is tremendously dangerous. \n\n Why do you think Republicans are pushing for this? Who benefits from it? The whole reason we’re here is [because] they’re talking about waste, fraud, and abuse. I’ve been sitting through a lot of these debates. The only time the Republicans brought up a number of alleged waste, fraud, and abuse is $50 billion. Even if you believe them, then why did they put $850 billion as the number for their cuts? Where’s that other $800 billion coming from if you said the waste-fraud-abuse number was $50 billion? And the reason for that is because this is not a health-care-cut bill. This is a bill where they have an assignment — they are trying to give trillions of dollars in collective tax cuts to billionaires, and they have to pay for it. And so the thing that they have identified to pay for it is one of the largest areas of expenditures in the United States, which is health care.\n\n Elon Musk’s so-called Department of Government Efficiency has made significant, broad sweeping cuts to federal agencies, and the destruction of the social safety net has been a long-term goal of Republicans. How can Democrats rebuild it after this assault has caused so much harm, and are you scared of what you’re seeing happen to democracy?When it comes to social safety net, I am very concerned, because one thing we see in terms of patterns is that Republicans will gut something, and then when Democrats are in the majority, we’re not able to get the votes to bring it back at one hundred percent. For the last 30 years, we’ve experienced death by a thousand cuts — the slow erosion of our everyday quality of life. \n\n I genuinely do believe that an important response to all of this stuff getting decimated is rethinking our social safety net entirely. Making it more inclusive, making the middle class not feel cut out from these kinds of supports, saying, instead of how do we just try to climb our way back to what was, what if we just expand Medicare? What if we either lower the age of Medicare to include everybody, let everyone buy into it, or if the party is not there yet, what if we lower the age of qualifying for Medicare to 50, or even lower? So that people can understand that we’re not just constantly trying to stop bleeding, but that we actually have an ambitious vision for this country. \n\n That kind of offense is the only thing that’s going to get us back to the place that we need to be.\n\n Do you listen to music or watch any TV shows to wind down?I have had the Bad Bunny album on repeat. I love that he’s bringing salsa back. Rauw Alejandro is doing that, too. I’m a big salsa person. It’s such a nice outlet. I like it because the lyricism is so dramatic. Everyone’s breaking up, everyone’s got the love of their life. It’s so funny.\n\n As a Puerto Rican, the album is very cathartic, and it’s very political. It speaks to a lot of what’s happening to us and our people right now.\n\n Did you see that this morning Bad Bunny announced that he’s going on a world tour and he’s not going anywhere in the United States, other than his residency in Puerto Rico?We just don’t have figures like that anymore. I think about the Civil Rights Movement, and I think about people like Harry Belafonte and all of these artists who really did risk everything, risk their careers and their popularity in order to support and take part in people’s movements, and to use their art, a whole album about that. It’s more rare now, or at least it feels that way; I wasn’t around then. The pressures of the industry are to be as broad as possible. When you have someone who does something gutsy like that, first of all, people come through for it, and it’s super compelling. \n\n Speaking of tours, do you know what you want to do with the momentum from your Fighting Oligarchy rallies? I think there are different ways of looking at politics. Some politicians look at voters and electorates and try to make predictions. I really do believe, even despite all of this, I really do believe in people. I believe in our collective conscience. So, I don’t have any master plan, but I believe that the people will show me the way.","summary":"The New York Congresswoman talks about her Fighting Oligarchy tour, artificial intelligence, cuts to Medicaid, and taking on Trump","url":"https://www.rollingstone.com/politics/politics-features/alexandria-ocasio-cortez-fighting-oligarchy-interview-1235349605/","image":"https://www.rollingstone.com/wp-content/uploads/2025/05/PLACEHOLDERTraff_AOC_Final-04.jpg","video":null,"publish_date":"2025-05-30 13:00:00","author":"Lorena O'neil,Steven Pearl","authors":["Lorena O'neil","Steven Pearl"],"language":"en","source_country":"us","sentiment":0.023},{"id":326499746,"title":"VICTOR DAVIS HANSON: Democrats And Their DEI Albatrosses","text":"A few Democratic officeholders, activists, and pundits are finally coming to their senses that their brand is toxic to a majority of the American people.\n\nThe Biden administration killed what was left of it in a number of ways.\n\nFirst, it serially lied to Americans about the cognitive decline and cancerous condition of President Joe Biden, both while in and after office.\n\nOnly when caught did the complicit media fess up that the Biden inner circle serially misled the American people about Biden’s inability to fulfill the duties of the presidency.\n\nSecond, left-wing politicos used Biden as a waxen effigy. His job was to pose as a “moderate” cover to push through the most radical and unpopular agenda in the last half century.\n\nOnly that way could “Old Joe Biden from Scranton” and his backroom handlers ram down the throat of the American people unpopular policies that nearly wrecked the country: hyperinflation and $7 trillion in new debt, weaponization of the government, and partisan lawfare, an open border and 12 million illegal aliens, a racialist DEI commissariat, a crackpot Green New Deal, defunding the police, biological men competing in girls’ sports, and two theater-wide wars abroad.\n\nThird, without either a functional president or viable initiatives, the new hard-left Democrats sought to brand Donald Trump as “Hitler” and half the country who supported him as “fascists.”\n\nFor nearly nine years, the Democrats launched one failed hoax after another on the American people: “Russian collusion,” “laptop disinformation,” and the lying so-called “51 intelligence authorities.” They proved quite willing to undermine the rule of law by manipulating the court system in efforts to destroy their bogeyman, Trump.\n\nNever had the American people seen a political party engineer 93 bogus indictments of a rival candidate and ex-president. Two dozen states tried to take Trump off their presidential ballots. And the Biden Department of Justice sicced an FBI SWAT team to barge into Trump’s home.\n\nThe people finally got tired of all the potty-mouthed Democrat videos, the congressional stunts and meltdowns, the pampered rich kids rioting on elite campuses, the knee-jerk obsessions with racial slurs, the firebombing of Tesla dealerships, the romanticization of left-wing political murderers — and always the adolescent tantrums over Trump. (RELATED: VICTOR DAVIS HANSON: Are Some Racist Slurs OK?)\n\nThe Democrats had mostly given up on democracy some 13 years ago. That was the last time they transparently and democratically nominated Barack Obama a second time as their presidential candidate.\n\nEver since, their nominations have been rigged.\n\nIn 2020, party insiders — terrified of the left-wing crazy primary field — forced out all the leading contenders.\n\nThen they coronated the debilitated but still supposedly useful moderate Biden as their COVID-era candidate. Biden then bragged that he would pick his vice president on the basis of race and gender.\n\nWhat followed was the most bizarre campaign in history.\n\nBiden stayed put in his basement and outsourced his candidacy to the partisan media.\n\nParty activists changed long-standing voting laws in the key swing states. For the first time in American history, 70 percent of Americans did not vote in person on Election Day — the majority of them by design Democrats.\n\nNext, in 2024, they forced the now no longer useful Biden off the ticket, nullifying his 14 million primary voters.\n\nThen, without a vote, they rammed in inept Vice President Kamala Harris as the nominee. As a failed candidate in 2020, she had never won a single delegate. (RELATED: Young Men Are Officially Ready To Be ‘Unburdened’ By Kamala Harris)\n\nSome in the party now concede it must roust out its radicals.\n\nBut Democrats will not.\n\nAOC and her Squad, the unhinged Jasmine Crockets of the party, and the ossified socialist Bernie Bros would demonize any Democrat who offered a sane reboot.\n\nA few fossils in the party may think they know how to save it. But they are terrified that the medicine would be considered far worse than the illness that prompted it. (RELATED: VICTOR DAVIS HANSON: Would The Left Finally Explain The Inexplicable?)\n\nWould Democrats consider embracing measured and legal-only immigration?\n\nNo — the crazy base would scream “xenophobe!”\n\nA return to meritocracy and the Martin Luther King notion of race as incidental, not essential, to who we are?\n\nAgain, that would be called “racist!”\n\nMaybe reforms to fix failed schools with vouchers, school choice, and charter schools?\n\nAgain, “racist!”\n\nHow about developing gas and oil reserves and nuclear power to lower energy costs for the struggling middle class?\n\nThat would be condemned as “destroying the planet!”\n\nRestore police forces, end critical race and legal theory, and deter criminals with tough sentencing?\n\nAgain, “racist!”\n\nHow about ceasing the whiny fixations with “white privilege” and “white rage?” Or quit seeing a “white supremacist” under every bed?\n\nAgain, “racist!”\n\nThe left created DEI — the use of race to adjudicate every political issue.\n\nAnd like any addictive, toxic drug, they now can neither survive with DEI — nor without it.\n\nABOUT THE WRITER\n\n(Victor Davis Hanson is a distinguished fellow of the Center for American Greatness. He is a classicist and historian at the Hoover Institution, Stanford University, and the author of “The Second World Wars: How the First Global Conflict Was Fought and Won,” from Basic Books. You can reach him by e-mailing authorvdh@gmail.com.)","summary":"'They now can neither survive with DEI — nor without it.'","url":"https://dailycaller.com/2025/05/30/victor-davis-hanson-democrats-dei-albatrosses-biden-left/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/OPED-hanson-GET-4-e1748607212226.jpg","video":null,"publish_date":"2025-05-30 12:39:50","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.423},{"id":326461900,"title":"Polling guru identifies 'low energy' Trump supporters as the key group that will decide future U.S. elections","text":"New polling shows that a key group of voters who helped propel President Donald Trump to victory 2024 are not as enthusiastic about supporting Republicans in the 2026 midterm elections.\n\nThe polling group J.L. Partners sounded the alarm, outlining the mood of 'mid-propensity voters' (MPVs) in a political analysis memo shared with the Daily Mail.\n\nThese are people who supported Trump in 2024 but are considered 'low energy;' voters who are not fully committed to voting in the midterm elections.\n\nPolitically unaligned, 42 percent of these voters identify as Independent or unaffiliated, but supported Trump over Vice President Kamala Harris in 2024.\n\nThirty-six percent of them backed Trump while 32 percent chose Harris and 29 percent did not even vote.\n\nThe mid-propensity voters make up 20 percent of the electorate in the United States, and ranked their likelihood of voting between 4 and 7 out of ten, the memo revealed.\n\nThe mid-propensity voters who supported Trump are mostly younger, 18-29 and likely to be black, according to the memo.\n\nWhen asked to choose the most important convincing argument for voting in the midterms, the Trump MPVs cited the importance of Republicans keeping their majorities in Congress to help a Republican presidential candidate win in 2028.\n\n'It might seem odd, but it is intuitive when you think about it – these are presidential elections and they are thinking through a presidential election prism,' James Johnson, Co-Founder of J.L. Partners said.\n\nJ.L. Partners collected a nationally representative sample of 3,041 registered voters across several polls that fielded throughout April and May 2025 reaching 564 MPVs and 229 MPVs who voted for Trump.\n\n'If you are a Republican operative, the best way to get the message across is to make these elections about putting the GOP in the best position to carry the agenda that Trump has championed forward into years to come,' Johnson said.\n\nThe party in power has historically struggled to keep voters in the presidential election motivated, as the opposition party tends to enjoy a boost in support. \n\nAs Trump is technically prevented from running for a third term, positioning his successor to the MAGA movement appears paramount for the Republican Party if they want to achieve majorities in 2026.\n\nThe president's team is already preparing for a likely attempt by Democrats to impeach him, if they win the House majority in 2026.\n\nThey are also keenly aware that Trump has to deliver on many of his campaign promises to keep his supporters positive.\n\n'We need to pass the tax cuts and avoid a recession,' Trump's longtime pollster, John McLaughlin said to Axios. 'That's the high stakes here. We cannot lose the midterms.","summary":"New polling shows that a key group of voters who helped propel President Donald Trump to victory 2024 are not as enthusiastic.","url":"https://www.dailymail.co.uk/news/article-14763663/poll-trump-supporters-independents-midterm-elections.html","image":"https://i.dailymail.co.uk/1s/2025/05/30/03/98882957-0-image-a-25_1748571125798.jpg","video":null,"publish_date":"2025-05-30 12:19:39","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.203},{"id":326457352,"title":"Wes Moore in prime time: Rising star to speak at South Carolina Democrats’ dinner","text":"Democrats are desperate for fresh blood and new leaders following President Donald Trump’s victory in the 2024 presidential election. Many have turned to Moore, 46, the first black governor of Maryland following his win in 2022, as an answer to their prayers. \n\nMoore said on ABC’s The View that he is not planning a presidential run in 2028, insisting his focus is on doing what is best for the state of Maryland in the present day. \n\n“I think that anyone who is, you know, focusing their time and their efforts trying to audition for 2028, to me, what it says is, you’re not taking 2025 very seriously,” he told Politico, adding that his focus is on winning a second term in Maryland in the 2026 midterm elections.\n\nBut strategists say Moore’s prime-time slot at a Democratic event in a state indicative of how Democrats will perform across the country says more about Moore’s plans than the governor’s own remarks.\n\n“I always say, ‘Watch what they do, not what they say.’ If you are headlining a major event in South Carolina, Nevada, Iowa, New Hampshire, down the line, it probably means that you’re running for president,” Democratic strategist Jon Reinish said.\n\nThe Blue Palmetto Dinner, the biggest event of the year for South Carolina Democrats, gives Moore a chance to energize and mobilize the party in a state that Reinish said is “very representative of the Democratic base.” \n\nIn a statement to the Washington Examiner, South Carolina Democratic Party Chairwoman Christale Spain said Moore has exemplified “bold” and “visionary” leadership.\n\n“His message of building a state that leaves no one behind has resonated with communities across the nation and continues to inspire Democrats here in South Carolina, and we’re expecting a packed house,” Spain said. “We are honored to have him join us and look forward to the powerful insight he will bring to this important event.”\n\nOf the early primary states, South Carolina boasts the largest population of black voters — a historically blue voting bloc that shifted toward Trump in the 2024 election over concerns related to the economy.\n\n“South Carolina has played a major role in picking the president over the last couple of cycles,” said one South Carolina Democratic strategist and consultant, who was granted anonymity to speak about campaign dynamics.\n\nThe strategist said Moore, who is one of the few black governors, can bring “hope” to South Carolina and energize the Democratic voting base, something Rep. Jim Clyburn (D-SC) has done for decades as the state’s only Democratic representative.\n\n“I think his energy, his optimism, is going to be huge for just energizing our base and remind folks to stay the course,” the strategist added.\n\nStrategists all agreed that Moore fits an ideal profile of what Democrats are looking for: he’s young, he’s eloquent, and he has “no Washington baggage.”\n\n“The rule in presidential politics, which I guess he just broke, is to never say never,” Democratic strategist Brad Bannon said. “Whether he left the door open or not, a little bit, I don’t know, but he’s got all the assets that Democrats could use in a presidential candidate.”\n\nMoore catapulted into the national spotlight in early 2024 due to an infrastructure tragedy in his state. In March that year, the Francis Scott Key Bridge collapsed after being struck by a cargo ship, and lawmakers from both sides of the aisle praised Moore for his swift and immediate response in the days after the tragedy and months after as the Port of Baltimore reopened.\n\nMany congressional leaders told the Washington Examiner in the aftermath of the collapse that the tragedy, while heartbreaking, would serve a personal and professional purpose to “elevate him” on the national stage.\n\nSince then, Moore has been one of several Democrats eyed for a 2028 presidential run. In the first election in which Trump will not be on the ballot since 2016, Republicans will be tasked with finding a candidate who can rally not just the Trump base but the broader GOP base as well. \n\nDemocrats have a more complicated task, as they must find a unifying candidate who can bring back the voting blocs lost to Trump and fight for social justice issues, while also prioritizing kitchen-table issues that helped Republicans secure a trifecta last November.\n\nIf Moore does run, he could face a strong challenger in former Vice President Kamala Harris, though she has stoked speculation she may run for governor of California. But Bannon and Reinish both think Moore could face an advantage over any candidate tied to former President Joe Biden due to the last election and subsequent scrutiny over his health.\n\n“Considering the fact that [Harris] was the most recent nominee and vice president for four years under Biden, that’s not terribly impressive,” Bannon said. “It will encourage a whole bunch of Democrats to get in the race. … In my opinion, we need someone outside of Washington, and we need someone young.”\n\nElder Democrats are facing a generational shift within the party as younger candidates and members who are displeased with the status quo are challenging incumbents or seeking high-profile leadership positions in droves. \n\nDemocratic strategist Hank Sheinkopf, who was a former consultant to President Bill Clinton, said he thinks Moore represents the centrist model to which Democrats should shift despite calls from the left flank to be more progressive.\n\n“He’s in the Bill Clinton centrist mode, and the Democrats have to figure a way, not so much to get back to the center, but to find people like Wes Moore, who can identify with people who work for a living and done the things that should be done,” Sheinkopf said.\n\nSheinkopf added that he thinks Moore would be a more successful candidate than the likes of Rep. Alexandria Ocasio-Cortez (D-NY), whose hefty fundraising totals have raised speculation she may seek a Senate or presidential run.\n\nJust because Moore said he isn’t running, however, doesn’t mean he isn’t playing the game by doing media appearances and attending dinners as the headliner. Sheinkopf said all presidential candidates have to start at the beginning, and most of that is creating relationships.\n\nALABAMA AG STEVE MARSHALL LAUNCHES RUN FOR TUBERVILLE SENATE SEAT\n\n“People who run for president have worked the country from end to end,” Sheinkopf said. “You raise money all over the country, have great relationships all over the country, so that people in power, or people who are decision-makers in campaigns and presidential campaigns, see with somebody that they can work with and who’s not distant.”\n\n“It’s a great opportunity [for him], and I doubt he will fumble it,” Bannon said of Friday’s dinner. “I think he will take great advantage of it. It really is a showpiece for the start of the Democratic presidential campaign, and anybody who does well in South Carolina early ahead of 2028 will get a big boost.”","summary":"The early primary state of South Carolina will have a prominent figure headlining the Democrats’ 2025 Blue Palmetto Dinner on Friday: Gov. Wes Moore (D-MD). Moore is a rising star of the Democratic Party, and his appearances across the country have stoked speculation that, despite his dismissal, he has an eye on the Oval Office. [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3426065/wes-moore-rising-star-speak-south-carolina-democrats-dinner/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/AP25136846149596.webp","video":null,"publish_date":"2025-05-30 11:30:00","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","source_country":"US","sentiment":-0.034},{"id":326443568,"title":"Never mind winning NYC’s mayoral race — here’s what sources believe Andrew Cuomo really wants","text":"Andrew Cuomo is leading the Democratic primary race for mayor of New York City — but he may just be angling for a way to get back into politics so he can run for national office, analysts and political rivals say.\n\n“I did hear that he is running for mayor so that he can run for president in 2028,” a former politician from Queens, who knows Cuomo well, told The Post.\n\nPolitical strategist Hank Sheinkopf believes Cuomo likely has presidential ambitions, but was not sure that a mayoral win in New York would help the former governor.\n\n“He’s always been ambitious so it wouldn’t surprise me,” Sheinkopf told The Post this week. “But what mayor of New York has ever been elected president of the United States?”\n\nRival candidate Scott Stringer, a former Manhattan borough president and New York City comptroller, speculated that Cuomo likely has an ulterior motive.\n\n“Nobody really thinks he wants to … be mayor,” Stringer’s campaign said Wednesday.\n\nBut Cuomo’s campaign told The Post he is committed to the job he doesn’t yet have.\n\n“Andrew Cuomo is fully focused on the mayor’s race and getting the city he loves back on the right track after 12 years of mismanagement,” said Cuomo rep Rich Azzopardi. “There’s much work to be done and New Yorkers know he has the experience and the record of results to do it.”\n\nDuring a candidates’ forum organized by civil rights leader Al Sharpton last month, Cuomo brushed aside a question about whether he would promise to serve a full term if elected mayor.\n\n“No. What if I die?” the 67-year-old replied. “Short of death, I commit.”\n\nBut it wouldn’t be the first time that Cuomo had changed his mind. \n\nThis week he rolled out a proposal to boost the city’s minimum wage to $20 by 2027 — after having struck down the move when he was governor of New York. \n\nAnd after dismissing a proposal by former Mayor Bill de Blasio to institute a universal “pre-K” program in city schools in 2014, Cuomo has now promised to make the program “truly universal” if he is elected mayor.\n\nSuch measures are likely efforts to counter the rising poll numbers of socialist candidate Zohran Mamdani, Cuomo’s closest rival, Sheinkopf said.\n\nThe latest PIX 11/ Emerson College poll has Mamdani, a Queens state Assemblyman, trailing Cuomo for 10 rounds of ranked-choice voting before being eliminated with a nine-point spread, 54.4% to 45.6%.\n\n“Mamdani has fresher ideas, and this may be a close race,” Sheinkopf said.\n\nPolitical strategist Jamal Simmons said he doesn’t know if Cuomo would run for president, but it’s conceivable that the mayor’s office could be a stepping stone to a national run.\n\n“In 2020, Cuomo was Donald Trump’s chief antagonist,” Simmons, a former communications director for Kamala Harris, said. “I imagine a lot of people will like the idea of him running for president because he’s a tough guy who might prevail against Trump.”\n\n“In some ways, I didn’t need to do this at this point in my life,” Cuomo said at a candidate screening in March for the 504 Democratic Club, in audio obtained by Politico. “I don’t need a title. I don’t need any of this stuff. Matter of fact, governor versus mayor, I think governor’s a better title. But anyway, I want to make a difference.” \n\nThe 504 Democratic Club, which represents the disabled, ended up endorsing New York City Comptroller Brad Lander for mayor.\n\n“Andrew Cuomo has proven time and time again he’s only in this for himself — he has zero interest in fighting for New York City’s working people or actually doing the job of mayor,” said Dora Pekec, a spokeswoman for Lander’s campaign. “New Yorkers won’t be fooled by his pathetic efforts at redemption — which will fail miserably, just like his entire life’s sad attempts to live up to his father’s legacy.”\n\nBut it’s his father’s legacy that is helping him with some constituencies. Former New York Governor Mario Cuomo is still remembered fondly among Democratic organizations in Queens where the Cuomo family is from.\n\nAnd at a recent Democratic County luncheon in the borough, candidate Cuomo was apparently greeted like a rock star.\n\n“When he came into that room you’d think that Jesus had arrived,” said the former pol, who was at the event. “People were hugging and kissing him, and taking his picture. There must have been more than 500 people there.”\n\nCuomo resigned from the governor’s job in 2021 following numerous allegations of sexual harassment as well as criticisms that his administration had hidden thousands of COVID-19 deaths among nursing home patients.","summary":"\"He's always been ambitious so it wouldn't surprise me,\" one political strategist said of Andrew Cuomo's possible longterm motive.","url":"https://nypost.com/2025/05/30/us-news/cuomo-angling-for-president-in-2028-rivals-say/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/cuomo_720.jpg?quality=75&strip=all&w=720","video":"https://cdn.jwplayer.com/videos/79Caldev-RyIcpnTz.mp4","publish_date":"2025-05-30 11:00:00","author":"Isabel Vincent","authors":["Isabel Vincent"],"language":"en","source_country":"zm","sentiment":-0.033},{"id":326457356,"title":"One year after his hush money conviction in New York, Trump battles lawfare","text":"It has also helped inspire Trump’s campaign against so-called lawfare now that he is president again.\n\nThe first anniversary of Trump’s conviction on May 30, 2024, will be remembered differently by “insiders and outsiders,” according to Ronald Reagan biographer Craig Shirley.\n\n“The insiders will say that Trump spit the hook and justice was not served, but the outsiders will say the whole thing was a scam and the insiders cannot be trusted and Trump beat the corrupt establishment,” Shirley told the Washington Examiner. \n\nNew York-based Republican strategist Evan Siegfried agreed, contending that not only did Bragg’s criminal case help Trump with his base but so did New York Attorney General Letitia James‘s civil fraud lawsuit against him — not to mention former special counsel Jack Smith‘s federal election interference and classified documents investigations into the president, including the FBI‘s raid of Mar-a-Lago, in addition to Fulton County District Attorney Fani Willis‘s racketeering prosecution in Georgia.\n\nIn fact, Bragg’s case was considered the weakest of the indictments Trump faced, and experts had criticized the Democratic district attorney for not demonstrating deference to Smith before his trial became the only one to reach a verdict before Trump’s election win effectively put an end to the rest.\n\n“Bragg, himself, he appeared to drop the case a few years earlier and then he picked it back up because he got criticism from the Left,” Siegfried told the Washington Examiner. “I don’t think if the defendant or the target of the investigation had been somebody other than Donald Trump, that there would have even been an indictment.”\n\nBut he added of the president: “It was, at the end of the day, a massive boon to him.” \n\nFor Siegfried, that was because Trump “standing up to the establishment” appealed to his supporters, who believed he would stand up for them, too. Regarding swing or independent voters, the president was advantaged because “we had been litigating him and what he did or didn’t do for the four years that he had been out of office,” according to the strategist.\n\n“It took away a vital attack line from [replacement 2024 Democratic nominee former Vice President Kamala] Harris that would have been effective if we had waited to start the conversation until, you know, say beginning of the fall last year as opposed to January 2021,” he said.\n\nThe White House connects the actions by Bragg and New York Judge Juan Merchan, who presided over the hush money case, with present-day rulings by district court judges to thwart Trump’s executive agenda.\n\n“The American people overwhelmingly voted against lawfare and the politicization of the justice system when they re-elected President Trump,” White House spokesman Harrison Fields said. “The actions of the corrupt and malign judge, attorney general, and radical attorneys who attempted to imprison President Trump for life mark a dark day in history that must never be repeated.”\n\n“Unfortunately, radical leftist judges continue their lawfare insanity with unconstitutional nationwide injunctions and ongoing efforts to obstruct the President’s agenda, perpetuating the constitutional crisis the President endured during the campaign,” Fields added.\n\nPublic polling captures a range of opinions concerning Bragg’s case. \n\nA Politico poll conducted last year after Trump’s conviction found that about one-fifth of respondents told pollsters the guilty verdict was important to how they would vote in November’s election and that it made them less likely to support the president, in comparison to 6% of respondents who said it was important but that it made them more likely to cast a ballot for him.\n\nSimultaneously, the same poll found that about one-third of respondents disagreed that the conviction was the result of “a fair and impartial judicial process.” Another 29% told pollsters former President Joe Biden was “directly involved” in Bragg’s decision to bring the case against Trump, while 36% thought that it was the Justice Department. Forty-three percent agreed it was brought to boost Biden.\n\nRegardless of public sentiment related to Bragg’s case, Trump’s feelings are well known.\n\nShortly after returning to power in January, Trump delivered an address in the DOJ’s Great Hall in March, the first time a commander in chief has done so since former President Barack Obama in 2014.\n\n“As we begin a proud new chapter in the chronicles of American justice, we’re turning the page on four long years of corruption, weaponization, and surrender to violent criminals,” Trump said at the time. “We’re restoring fair, equal, and impartial justice under the constitution rule of law.”\n\nDuring his hourlong remarks, Trump underscored how the 2024 election was a mandate for him to embark on a “far-reaching investigation into the corruption of our system” to “expose their egregious crimes and severe misconduct” after promising during the campaign to be his supporters’ “retribution.”\n\nTo that end, Trump has directed the Justice Department to rid itself of any prosecutors who brought charges with respect to him, with a “special project” to investigate attorneys who had worked on cases involving Jan. 6 and a “weaponization working group,” spearheaded by Ed Martin, to probe state and federal officials who had looked into Trump, among other issues.\n\nTrump has issued a presidential memorandum revoking the security clearances of lawyers at the firm Covington & Burlington who were part of Smith’s cases against Trump. He has also signed an executive order directing the same for those at Perkins Coie and Paul, Weiss, Rifkind, Wharton & Garrison who represented 2016 Democratic nominee Hillary Clinton and opposed those accused of Jan. 6 crimes, respectively.\n\nThe executive actions additionally ordered the federal government to terminate any contracts with the firms and prohibit employees from entering federal buildings. \n\nOther firms targeted include Jenner & Block and Wilmer Cutler Pickering Hale and Dorr for their connections to another former special counsel, Robert Mueller, as well as Elias Law Group for its advocacy of Democratic causes, such as the Trump-Russia dossier, and Susman Godfrey for defending Dominion Voting Systems. Targeted people include Bragg and James.\n\nTrump later rescinded an order against Paul Weiss after the firm offered $40 million in free legal services and to end its diversity programs, one of nine firms that have made similar agreements with the president, amounting to almost $1 billion in pro bono legal services.\n\nPerkins Coie, Jenner & Block, WilmerHale, the Elias Law Group, and Susman Godfrey are challenging their actions in court.\n\n“This Order must be struck down in its entirety as unconstitutional,” U.S. District Court Judge Richard Leon wrote this week in WilmerHale’s case. “Indeed, to rule otherwise would be unfaithful to the judgment and vision of the Founding Fathers!”\n\nTrump supporters, including former White House chief political strategist Steve Bannon and Judicial Watch President Tom Fitton, have implored Trump to take his campaign against lawfare even further by appointing a special prosecutor to investigate any wrongdoing.\n\nThere is also support in Congress, including from the likes of Rep. Russell Fry (R-SC), who has been leading the charge against lawfare on Capitol Hill.\n\n“We’ve seen rogue prosecutors weaponize the legal system to target Presidents, Vice Presidents, and public officials for political gain,” Fry told the Washington Examiner. “This kind of lawfare doesn’t just hurt individuals — it undermines our democracy by deterring leaders from making challenging decisions and discouraging qualified Americans from serving in public office.”\n\nHe continued: “The Promptly Ending Political Prosecutions and Executive Retaliation Act of 2025 would get us one step closer to ensuring those who have served our country at the highest levels have the ability to move politically motivated cases out of biased state courts and into a fairer federal justice system.”\n\nBut Bud Cummins, a former U.S. attorney for the Eastern District of Arkansas, the Arkansas chairman of Trump’s 2016 campaign, a whip for the president at that election’s Republican National Convention, and a member of his transition team that cycle, advised caution as he proceeds with his vendetta.\n\n“He must ensure that his personal feelings do not influence charging decisions at the DOJ,” Cummins told the Washington Examiner. “Prosecutors should focus on real criminal violations instead of targeting individuals.”\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nMeanwhile, Bragg has not encountered many political consequences for his case against Trump other than having his security clearance pulled. Since his prosecution of Trump, he has tried to distance himself from his progressive record and, instead, has focused on his “tough on crime” bona fides. He is likely to be reelected later this year after a primary next month.\n\nTrump was sentenced with an unconditional discharge in Bragg’s case last July. The president is expected to appeal that decision despite it amounting to a dismissal of the matter.","summary":"President Donald Trump became the first former commander in chief to be convicted of a crime a year ago, and that guilty verdict has shaped policy in his second administration and anchors a GOP campaign against &#8220;lawfare&#8221; to prevent future prosecutions. A New York jury&#8217;s guilty verdict on all 34 felony counts of falsifying business [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3423898/one-year-after-hush-money-conviction-trump-battles-lawfare/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/Gaetz_Trump_Gurdon112024.webp","video":null,"publish_date":"2025-05-30 10:45:00","author":"Naomi Lim","authors":["Naomi Lim"],"language":"en","category":"politics","source_country":"US","sentiment":-0.346},{"id":326422680,"title":"Trump celebrates Nippon Steel 'deal' with rally at Pennsylvania plant","text":"WASHINGTON :U.S. President Donald Trump heads to Pittsburgh, Pennsylvania on Friday to headline a rally to celebrate Nippon Steel's \"planned partnership\" with U.S. Steel, signaling final approval for the deal could be on the horizon. \n\nProponents of the transaction are hoping his visit to the state where U.S. Steel is headquartered will cap a tumultuous 18-month effort by Nippon Steel to buy the iconic American company, beset by union opposition and two national security reviews.\n\nBut the deal is possibly not entirely done. Following Trump's post on Truth Social last Friday announcing the rally and appearing to endorse the merger, he sowed doubt on Sunday, describing the deal to reporters as an investment with \"partial ownership,\" with control residing with the U.S.\n\nTrump will deliver remarks at a U.S. Steel plant at 5 p.m. ET (2100 GMT) on Friday in the political swing state, which he won in the 2024 election. The White House described his remarks as being about the \"U.S. Steel Deal.\"\n\nTrump technically has until next Thursday to decide whether to approve or scuttle the deal, after the Committee on Foreign Investment in the U.S. last week completed a second review of the merger. But the timeline could slip. \n\nThe road to Friday's rally has been a bumpy one. \n\nNippon Steel offered $14.9 billion for U.S. Steel in December 2023, seeking to capitalize on an expected ramp up in steel purchases, thanks to the bipartisan infrastructure law.\n\nBut the tie-up faced headwinds from the start, with both then-President Joe Biden and Trump asserting U.S. Steel should remain American-owned as they sought to woo voters in Pennsylvania ahead of the November presidential elections. Former Vice President Kamala Harris, who became the Democratic nominee in 2024 after Biden stepped aside, also said U.S. Steel should remain domestically owned. \n\nFollowing a previous CFIUS-led review, Biden blocked the deal in January on national security grounds.\n\nThe companies sued, arguing they did not receive a fair review process, a charge the Biden White House disputed.\n\nThe steel giants saw a new opportunity in the Trump administration, which opened a fresh 45-day national security review into the proposed merger last month.\n\nBut Trump's public comments, ranging from welcoming a simple \"investment\" in U.S. Steel by the Japanese firm to suggesting a minority stake for Nippon Steel, did little to shore up investor confidence in an eventual green light. \n\nReuters reported last week that Nippon Steel had floated plans to invest $14 billion in U.S. Steel's operations including up to $4 billion in a new steel mill if the Trump administration green lights its merger bid, in response to requests from the government for more investment.\n\n\"This will be a planned partnership between United States Steel and Nippon Steel, which will create at least 70,000 jobs, and add $14 Billion Dollars to the U.S. Economy,\" Trump posted last Friday, breathing new hope into prospects for the tie-up. \"I will see you all at US Steel, in Pittsburgh, on Friday, May 30th, for a BIG Rally. CONGRATULATIONS TO ALL!\"","summary":"","url":"https://www.channelnewsasia.com/business/trump-celebrates-nippon-steel-deal-rally-pennsylvania-plant-5160211","image":"https://dam.mediacorp.sg/image/upload/s--rP_tWVjd--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-05-30t100250z_1_lynxnpel4t0et_rtroptp_3_nippon-steel-strategy.jpg?i","video":null,"publish_date":"2025-05-30 10:02:50","author":null,"language":"en","source_country":"sg","sentiment":-0.338},{"id":326462040,"title":"The California Democratic Party's premiere event will have two notable no-shows","text":"Thousands of California Democrats will gather this weekend to be courted by gubernatorial and potential presidential candidates, rage against the Trump administration and organize for the 2026 election. However, the state’s two most prominent Democrats — former Vice President Kamala Harris and Gov. Gavin Newson — will not be attending the multiday gathering of roughly 4,000 party delegates, activists, donors, labor leaders and other powerful voices in the largest Democratic state in the nation, according to a source familiar with the event’s planning. Their absences are notable given speculation about their political futures. Newsom and Harris are both viewed as potential 2028 presidential candidates. Harris also may jump into California's 2026 race for governor, and is expected to make a decision by the end of the summer. Both were invited to the state party convention in Anaheim, according to the source. Harris is expected to send a video greeting attendees. Harris representatives did not respond to multiple requests for comment. Newsom is scheduled to participate in a Democratic Governors’ Assn.’ gathering in Portland to coordinate efforts to fight Trump's tariffs, a spokesperson said. But the gathering doesn’t begin until Sunday, the final day of the state party convention. A letter from the governor to delegates is included in the convention program. Darry Sragow, a veteran Democratic strategist, said there was little benefit to either one attending the gathering. \"There's no question that well-known, well-defined political figures like the governor and former vice president could be met with mixed reactions,\" he said. \"If I was advising them, I'm honestly not sure I could come up with a justification for their going. What's the upside?\" Prominent California Democrats have routinely faced backlash from liberal delegates at the party's annual conventions. Anti-fracking advocates interrupted a speech by former Gov. Jerry Brown over his support for the controversial oil extraction practice and the late Sen. Dianne Feinstein was booed during her 1990 speech supporting the death penalty. Her then-gubernatorial campaign turned the latter into a television advertisement aimed at that era’s more moderate electorate. Newsom, once a darling at such conventions, could possibly face similar fallout among party loyalists because of recent statements about opposing transgender athletes being allowed to compete in women’s sports as well as bantering with conservative heroes such as Steve Bannon and Charlie Kirk on his podcast. If she attended, Harris could be criticized for complicity in hiding former President Biden’s alleged cognitive decline while in office, an allegation lodged in a recent book that argues that deception led to Trump’s 2024 victory. However, Harris has the luxury of time as she decides what to do next in her political career. Harris’ delay in making a decision about the gubernatorial contest, however, has drawn scorn from some Democrats who have announced their candidacies. Every prominent Democrat who has announced a gubernatorial run is expected to attend the convention. Lt. Gov. Eleni Kounalakis and state Supt. of Public Instruction Tony Thurmond have official speaking roles because they currently serve in elected office, as does former state Controller Betty Yee because she is the party's vice chair. Former state Senate President Pro Tem Toni Atkins, former U.S. Secretary of Health and Human Services Xavier Becerra, businessman Stephen J. Cloobeck, former Rep. Katie Porter and former Los Angeles Mayor Antonio Villaraigosa will also be wooing attendees. Potential 2028 presidential candidates Minnesota Gov. Tim Walz and N.J. Sen. Cory Booker are also scheduled to speak to California Democratic Party delegates at the Anaheim Convention Center. In addition to addressing delegates at caucus meetings, such as labor, environmental, Latino and women voters, candidates will meet with donors and court activists throughout the weekend. Social gatherings include a Friday night fireworks show, an ice cream social and a party titled “Punk the System” hosted by state Democrats as well as the powerful nurses’ and teachers’ lobbies. “Dance. Drink. Rage for Democracy,” reads the invite to the gathering. Candidates are also hosting events — Yee is offering “healthy breakfast bites” and coffee on Saturday morning. Cloobeck, a billionaire who made his fortune in real estate and hospitality, is planning a reception that night with the theme “Fight for California, Celebrate CA Dems!” The longtime donor and fundraiser for Democrats and philanthropic causes has never previously run for elected office. In his first introduction to state party activists, Cloobeck said he plans to focus on lessons from the 2024 election and urging Democrats not to be tone deaf to the electorate’s needs. “The party should work for everyone,” Cloobeck said. “It can’t cater to only special interests or well-connected individuals.” State party chairman Rusty Hicks, who is widely expected to win reelection at the convention, said California Democrats have reflected and reckoned with last year’s election results, “some good and some bad and some ugly.” While the party bucked national trends by performing strongly in congressional races, it also unexpectedly lost legislative seats and saw a decline in voter turnout among Latinos, Asian Americans and young people, Hicks said. \"We can’t just compete in targeted seats,\" he said. \"We have to compete everywhere in a different way. What happened in ‘24 — the good and the bad — informs what our work is in ‘26.” Times staff writer Taryn Luna in Sacramento contributed to this report.","summary":"Gov. Gavin Newsom and former Vice President Kamala Harris, California's two most prominent Democrats, are skipping the state party's convention this weekend in Anaheim.","url":"https://www.latimes.com/politics/story/2025-05-30/cadem-advance-gavin-newsom-kamala-harris-walz-booker","image":"https://ca-times.brightspotcdn.com/dims4/default/0e9f21f/2147483647/strip/true/crop/840x441+0+47/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa1%2Fa8%2Fd9d8aad8405485f170172ed68e6e%2Fgavin-newsom-and-kamala","video":null,"publish_date":"2025-05-30 10:00:00","author":"Seema Mehta","authors":["Seema Mehta"],"language":"en","category":"politics","source_country":"us","sentiment":0.084},{"id":326461708,"title":"Bernie Sanders blames election loss on Kamala Harris listening to billionaires over the working class","text":"Bernie Sanders has blamed Kamala Harris for her election loss to Donald Trump, saying she chose to cosy up to billionaires instead of addressing the issues faced by working-class Americans.\n\nThe 83-year-old independent senator and former Democratic presidential candidate said while Joe Biden has faced plenty of criticism for the election loss, it was ultimately Harris’s fault.\n\n“A lot of the people are saying it was Joe Biden's fault that Kamala Harris lost the election … not true. It was the fault of Kamala Harris and her consultants,” he said in an interview on BBC Radio 4’s Today program.\n\n“They did not run a campaign designed to speak to the American working class.”\n\nSanders said he “absolutely” believed Harris could have won, but she did not talk about the needs of working-class Americans.\n\n“I ran all over the country trying to elect Kamala Harris and beg them talk to the needs of the working class, talk about raising the minimum wage to a living wage, talk about real health care reform, talk about building the kinds of massive amounts of housing that we need, putting checks on landlords,” Sanders said. “But they used their billionaire friends.”\n\nHe said Harris spent more time with Republican conservative Liz Cheney “almost than with anybody else”, and billionaire businessman and “Shark Tank” shark Mark Cuban was a vocal supporter and spokesperson.\n\n“What is that message out to working class people?” Sanders said. \n\n“To my mind, that was a campaign that absolutely should have been winnable. But it gets back to the fundamental issue that that campaign was also run by consultants and billionaires.”\n\nHe continued: “And bottom line here is the Democrats have to answer a very simple question: which side are you on? And that answer has not yet been made.”\n\nSanders, who has been running a “Fighting oligarchy tour” with popular Democrat Alexandria Ocasio-Cortez that has drawn huge crowds across the United States, said the core issue in America today is that there was more income and wealth inequality in the country than ever before.\n\nHe said the reason that Trump won the election was because the Democratic Party had not responded to that economic crisis.\n\n“The average person out there who is working very long hours has less holiday time than many Europeans has, can’t afford healthcare, can't afford to send their kids to college, childcare is a disaster in the United States,” he said.\n\n“That person looks to Washington D.C. and says, ‘hey what are you doing for me, I’m suffering, I’m hurting, and everything being equal … my kid is going to do worse than me’.”","summary":"Sanders said while Joe Biden has been blamed election loss, it was ultimately Harris’s fault for cosying up to billionaires","url":"https://www.independent.co.uk/news/world/americas/us-politics/bernie-sanders-kamala-harris-us-election-loss-b2760587.html","image":"https://static.independent.co.uk/2025/05/12/11/00/US-POLITICS-MAY-DAY-SANDERS-p6avilen.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/nmZsSqln-4VHSaSK0.mp4","publish_date":"2025-05-30 09:51:06","author":"Rachel Clun","authors":["Rachel Clun"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.554},{"id":326502752,"title":"Huh? Kimmel Claims Harris's '60 Minutes' Interview Wasn't Deceptively Edited","text":"ABC’s Jimmy Kimmel announced himself on Thursday as not be a fan of President Trump’s lawsuit against 60 Minutes, but whatever one thinks of the suit’s legal merits, Kimmel’s claim that the network did not deceptively edit the interview with Kamala Harris to make her look better fell flat.\n\nKimmel began by dreaming about using Trump’s legal arguments against him, “Trump right now is reportedly one step closer to settling the lawsuit he filed against 60 Minutes. Trump's suing CBS for $20 billion because an interview they aired with Kamala Harris caused him ‘mental anguish.’ He can sue them for mental anguish; imagine how much we could sue him for. We're going to be rich.\n\nMoving on to the actual controversy, Kimmel recalled, “Paramount, which is CBS's parent company, reportedly offered Trump $15 million to settle the case. He said no. His lawyers want at least $25 million, and even worse, they want an apology for not doing anything wrong. If you haven't been following this, during the election, 60 Minutes did a segment with Kamala Harris, and because 60 Minutes is only 60 minutes, they edited the interview, just like they always do.”\n\nKimmel further explained, “But Trump, who never misses an opportunity to, A, whine and, B, abuse the legal system, claimed, based on no evidence, that 60 Minutes edited the interview deceptively to make his opponent look better.”\n\nThat’s just not true. In the original video, Harris was pressed from the left by Bill Whitaker on why Israeli Prime Minister Benjamin Netanyahu did not appear to be listening to the Biden administration. She gave a typical Harris word salad of an answer, “Well Bill, the work that we have done has resulted in a number of movements in that region by Israel that were very much prompted by, or a result of, many things, including our advocacy for what needs to happen in the region.”\n\nRemember Kamala’s word salad answer about Israel on 60 Minutes? It’s gone.\nThis is what many Americans will now see. pic.twitter.com/H4w7btDv6x\n— MAZE (@mazemoore) October 8, 2024\n\nIn the version that aired on 60 Minutes, Harris came across as more competently, “We are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.”\n\nAs for Kimmel, he concluded, “He sued them for $10 billion. And then, even though he won the election, he raised it to $20 billion. Which, the whole company isn't even worth $20 billion. They're selling it for 8 right now. It's a plainly frivolous lawsuit, but Shari Redstone, who inherited Paramount from her horrible father, is trying to sell her company, and she knows Trump will vindictively use his power as president to block that from happening through the FCC. Now she's trying to pay him off, and she's going to pay him off. This is how it works now. It's just like the Mafia but with cheeseburgers instead of gabagool.”\n\nHarris’s actual answer took about 20 seconds, so Kimmel’s argument that 60 Minutes just needed to edit it down for time doesn’t pass the laugh test.\n\nHere is a transcript for the May 29 show:\n\nABC Jimmy Kimmel Live!\n\n11:39 PM ET\n\nJIMMY KIMMEL: Trump right now is reportedly one step closer to settling the lawsuit he filed against 60 Minutes. Trump's suing CBS for $20 billion because an interview they aired with Kamala Harris caused him \"mental anguish.\" \n\nHe can sue them for mental anguish; imagine how much we could sue him for. We're going to be rich. Paramount, which is CBS's parent company, reportedly offered Trump $15 million to settle the case. He said no. His lawyers want at least $25 million, and even worse, they want an apology for not doing anything wrong. If you haven't been following this, during the election, 60 Minutes did a segment with Kamala Harris, and because 60 Minutes is only 60 minutes, they edited the interview, just like they always do. \n\nBut Trump, who never misses an opportunity to, A, whine and, B, abuse the legal system, claimed, based on no evidence, that 60 Minutes edited the interview deceptively to make his opponent look better. He sued them for $10 billion. And then, even though he won the election, he raised it to $20 billion. Which, the whole company isn't even worth $20 billion. They're selling it for 8 right now. \n\nIt's a plainly frivolous lawsuit, but Shari Redstone, who inherited Paramount from her horrible father, is trying to sell her company, and she knows Trump will vindictively use his power as president to block that from happening through the FCC. Now she's trying to pay him off, and she's going to pay him off. This is how it works now. It's just like the Mafia but with cheeseburgers instead of gabagool.","summary":"ABC’s Jimmy Kimmel announced himself on Thursday as not be a fan of President Trump’s lawsuit against 60 Minutes, but whatever one thinks of the suit’s legal merits, Kimmel’s claim that the network did not deceptively edit the interview with Kamala Harris to make her look better fell flat.\n\nKimmel began by dreaming about using Trump’s legal arguments against him, “Trump right now is reportedly one step closer to settling the lawsuit he filed against 60 Minutes. Trump's suing CBS for $20 billion because an interview they aired with Kamala Harris caused him ‘mental anguish.’ He can sue them for mental anguish; imagine how much we could sue him for. We're going to be rich.\n\n \n\n\n\n\n\n \n\nMoving on to the actual controversy, Kimmel recalled, “Paramount, which is CBS's parent company, reportedly offered Trump $15 million to settle the case. He said no. His lawyers want at least $25 million, and even worse, they want an apology for not doing anything wrong. If you haven't been following this, during the election, 60 Mi","url":"https://www.newsbusters.org/blogs/nb/alex-christy/2025/05/30/huh-kimmel-claims-harriss-60-minutes-interview-wasnt-deceptively","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/2025-05-29-ABC-Jimmy%20Kimmel%20Live-Kimmel.jpg?itok=F06UWf2B","video":null,"publish_date":"2025-05-30 09:44:00","author":"Alex Christy","authors":["Alex Christy"],"language":"en","source_country":"US","sentiment":-0.547},{"id":326423744,"title":"Biden cover-up scandal could usher in new era of Republican dominance","text":"This is the season of President Donald Trump, the Republican Party, conservatism and the MAGA movement. The Democratic Party is in dire straits. They sit at 21% approval in some polls. They have reduced themselves to defending illegals, gang members and other forms of criminality and corruption. They present no new ideas, just obstructionism. DEM STRATEGY SESSION TO STOP HEMORRHAGING OF MALE VOTERS RIDICULED And with each issue they embrace, such as opposing cuts in federal spending or defending the waste, fraud and abuse of USAID or other federal agencies, for that matter, only drives them further down in the polls. They are also the party of antisemitism, repellent to most Americans who cherish our longtime friendship with the Jewish state. They have no answers to the ills afflicting Americans. DEMOCRATIC PARTY'S IMAGE IN WEAKEST POSITION SINCE REAGAN-BUSH ERA, CNN POLITICAL ANALYST SAYS Meanwhile, Trump and his Republican Party have a corner on the marketplace of ideas. From the border to inflation, the GOP has it all over the Sad Sack Democrats. Democrats must hate getting up in the morning. The newspapers and cable television only bring them more bad news, from the new charges against Andrew Cuomo, former Democrat governor of New York, to fresh revelations about the scandal of COVID-19 and the alleged criminality of Dr. Anthony Fauci, former chief medical advisor to the president, to Minnesota Democrat Rep. Ilhan Omar’s complete indifference to the murder of two young Israelis in Washington at the Israeli Embassy. Democrats must be asking themselves, \"What fresh hell is this?\" Of course, the story with the most damaging, long-term effect is the cover-up of former President Joe Biden’s incipient mental state. Were we a constitutional republic during his time? Or were we governed by a devious cabal armed with an autopen? MELISSA DEROSA: DEMOCRATS FACE A PAINFUL QUESTION: WHAT WENT WRONG? Even worse, the entire Democratic Party establishment was in on the cover-up and conspiracy of defending an emperor that not only had no clothes, but apparently wasn’t even governing in the first place. The GOP is on offense, a good place to be in politics. Meanwhile, the Democrats are in a fox hole, fighting off incoming, completely on the defense. This all has long-term consequences. Just as President Abraham Lincoln kicked off a long period of Republican governance beginning in 1860, just as FDR and the Democrats initiated a long period of Democratic governance beginning in 1932, Trump could be kicking off a long period of Republican governance. Republicans are in motion. Trump is in motion. He knows politics is motion. DAVID MARCUS: TRUMP'S BIG WIN MEANS REPUBLICANS HAVE A REAL SHOT AT GENERATIONAL POWER. DON’T SCREW IT UP During the Lincoln era, Republicans reminded voters of the \"bloody shirt\" to drive home to them it was Democrats, the party of slavery, who instigated the Civil War. Republicans will, in the future remind voters of the Biden cover-up by yelling, \"Deceitful Democrats!\" Watergate was indeed just a \"third-rate burglary\" compared to this culture wide scheme to deceive. The tea leaves were already appearing before this earthshaking scandal surrounding Biden. Look at the facts: Hispanic men shifted in large numbers toward the Republicans in the last election. So too did African American males. So too did young voters. White Americans held firm in almost all categories. Democrats often delude themselves. Case in point is the growing vegetative state of Biden. And I am sorry, Minnesota’s Caspar Milquetoast governor Tim Waltz is not the answer to recapturing the male vote. TRUMP VICTORY SLAMS DEMOCRATS' WOKE WORLD VIEW. HERE'S WHAT'S NEXT The irony is that the insider establishment told themselves an old, old, old man, who was on the wrong side of all the issues, could win until it became screamingly obvious he could not. They then told themselves a lightweight do-nothing vice president, chosen for her race and sex and not for her intellect, could win. Ironically, she was chosen as Biden’s insurance plan meaning there would be no way anyone would turn to Kamala Harris if and when Biden faltered. Everybody knew she was completely unqualified to be president. Lord Acton once cynically said, \"The danger is not that a particular class is unfit to govern. Every class is unfit to govern.\" Maybe so, but the Democrats, as decided by the voters, are indeed unfit to govern. The GOP controls the majority of governorships. The GOP controls the majority of state legislatures. And, in 23 states, the GOP has total control. The other states are at best mixed. Conservatives control the Supreme Court. KEY BIDEN STAFFERS ASKED TO TESTIFY ON ALLEGED ROLE IN MENTAL DECLINE ‘COVER-UP’ Beyond the growing powers of Trump are the issues that favor the GOP, abortion is now off the table as conservatives acted on their federalism instincts and the Supreme Court sent the matter back to the states where behavioral issues like marriage, adoption and the death penalty belong. CLICK HERE FOR MORE FOX NEWS OPINION Anybody who looks beyond the point of their own nose has to see this massive Biden cover-up is not only the greatest scandal in American history, but it will have significant ramifications for our future. Liberal historians’ credibility is shot. Jon Meacham, Michael Beschloss and others like them have no more authority. This has a significant impact on the future. True journalists will not be turning to them for comment as they are seen simply as liberal lackeys, especially Meacham who authored Biden’s \"Nuremberg Speech,\" denouncing half of America, one of the two worst speeches in presidential history, ranking with President Jimmy Carter’s now notorious \"Malaise\" speech. The liberal media, too, is headed for the ash heap of history. Where will CNN’s and MSNBC’s ratings be in a year? Their viewership may be higher in Beijing than in Peoria. And, ironically, CNN anchor Jake Tapper, just as his book is topping the charts, has destroyed his credibility by being part of the original cover-up as a Biden apologist. Of course, the story with the most damaging, long-term effect is the cover-up of former President Joe Biden’s incipient mental state. Were we a constitutional republic during his time? Or were we governed by a devious cabal armed with an autopen? Vindicated are the very few reporters who asked tough questions about Biden’s mental competency. CLICK HERE TO GET THE FOX NEWS APP No longer does two plus two equal five. Which means the future is very bleak for the Democratic Party. They are a pariah party for now and the foreseeable future. They have reaped the whirlwind. CLICK HERE TO READ MORE FROM CRAIG SHIRLEY","summary":"Trump could be ushering in an era of GOP power. Republican momentum is strong while voters are questioning the Democratic Party&apos;s future amid scandals.","url":"https://www.foxnews.com/opinion/biden-cover-up-scandal-could-usher-new-era-republican-dominance","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/931/523/trump-after-winning-iowa-caucuses.png?ve=1&tl=1","video":null,"publish_date":"2025-05-30 09:00:25","author":"Craig Shirley","authors":["Craig Shirley"],"language":"en","category":"politics","source_country":"US","sentiment":-0.286},{"id":326568656,"title":"A Very Bailey Farewell","text":"This article appears in the June 2025 issue of The American Prospect magazine. Subscribe here.\n\nFor decades, Senate minority leader Chuck Schumer has openly spoken about an imaginary couple named the Baileys who are supposed to be some kind of personal bellwether for middle and moderate America. Yes, somehow this is true.\n\nBut never have the Baileys spoken for themselves. That is, until now.\n\nFrom: joe.bailey59@hotmail.com\n\nTo: chuck@schumer.senate.gov\n\nSubject: We need to talk\n\nHiya Chuck,\n\nIt’s Joe Bailey. Eileen and I watched your video the other day about a Trump car tax and you seemed … unsteady. Hope you’re doing OK.\n\nLook, we have to come clean. Eileen and I would really rather you not mention us anymore, to the media or anyone else. I mean, if we’re being honest it’s always been kind of weird. But right now, we don’t feel like you really understand where we’re coming from.\n\nThings have shifted for us. After Kamala Harris lost the election, we were sure that Democrats or the courts would put a stop to Trump somehow. Hell, the guy had 34 felony counts and Project 2025 was a clear-as-day blueprint for what was going to happen. His first week in office, planes were falling out of the sky, and our son Zane’s wife lost her job at USAID. It’s all been too much. But when Elon and his little team of hacker boys locked you and other Democrats outside of the federal buildings, you were on national television saying that “people are aroused.” Come on, man. Aroused? Even when you are aroused, don’t put it that way.\n\nEileen and I started going to the Tesla Takedown protests. We’re not usually the protesting type, but we started to get a taste for it during the pandemic and all the BLM stuff. Not sure if you knew this, but we believe in defunding the police. Then Eileen found out about the Socialist Rifle Association, and it turns out they have a meetup nearby. We’ve been going for a couple months now. I fancy myself a peaceful guy, but as Huey Newton once said: “If you want to get rid of the gun, you have to pick the gun up.” We’re also learning how to block highways, build barricades, make Molotovs, and scrub our biometrics.\n\nAll this is to say, Chuck, we’ve changed. We’ve changed ’cause America has changed. We feel like it’s no longer moderate to be moderate. It’s complicity. We’re radicals now, Chuck. And you, Chuck, at best you’re a coward.\n\nDon’t think we didn’t watch you and nine other Democratic senators vote to advance Trump’s budget, refusing to use the power of the filibuster. What did Trump say to you? Did he pull some Upper West Side tough-guy talk and promise you dinner at Cipriani’s? I mean, if you can’t wield power, the least you can do is gum up the works. That’s what Republicans do every time they’re in the minority. Not you, Chuck. You seem to enjoy being useless. You’ve let Eileen and me down.\n\nI can’t figure out why you’re so weak. You’re old and tired—hell, so am I. But I think you don’t understand regular people’s concerns the way the rest of us do. Which is ironic because the whole reason you created us was to keep in touch with regular folk. Of course you had to invent us because heaven forbid you actually talk to real people. You’ve lost touch with us, your imaginary friends.\n\nSee, you might be doing fine on a senator’s salary, but Eileen and I depend on Social Security. If those checks are interrupted because of what Elon and Big Balls are doing, there’s going to be hell to pay. And we’re tired of paying it! The 2008 recession cost us a third of our savings, and if there’s another recession and my cancer comes back, well, we’ll have to sell the house. Of course, as anarchist thinker Proudhon said, property is theft. Maybe we should just live communally and give our lives to the revolution.\n\nFascism is real, Chuck. And the Democratic Party under your leadership has been asleep at the wheel. It’s time you hand over the keys like Biden should have sooner. That AOC is polling 19 points ahead of you for your own seat, and she isn’t even running. Your time’s up. If you leave now, we might still invite you over for Thanksgiving dinner. Of course, it’ll be tofurkey, on account of us being vegan now.\n\nAll the best,\n\nJoe and Eileen Bailey","summary":"Chuck Schumer’s imaginary friends come back to haunt him.","url":"https://prospect.org/politics/2025-05-30-a-very-bailey-farewell/","image":"https://prospect.org/downloads/22963/download/JUN25%20Parting%20Shot.jpg?cb=a453a3095c8dc48c13aa23a042bcb4d4&w=1024","video":null,"publish_date":"2025-05-30 08:55:00","author":"Francesca Fiorentini","authors":["Francesca Fiorentini"],"language":"en","category":"politics","source_country":"us","sentiment":-0.412},{"id":326391702,"title":"Trump’s Legal Team Criticizes Effort to Throw Out ’60 Minutes’ Lawsuit","text":"Attorneys representing President Donald Trump have responded against Paramount Global and CBS after they sought to dismiss the $20 billion lawsuit he initiated last year concerning a “60 Minutes” segment with Kamala Harris. Trump’s team criticized the move as a superficial effort to misuse the First Amendment as a “weapon.”\n\nThe lawsuit, backed by Texas Representative Ronny Jackson— a Republican from Amarillo and former White House physician under Trump— met opposition from Trump’s legal representatives on Wednesday. This followed Paramount and CBS’s March motion to dismiss, citing issues such as lack of personal jurisdiction, incorrect venue, failure to state a claim, and lack of subject matter jurisdiction.\n\nThe companies filed two separate motions to dismiss on March 6; one for personal jurisdiction and improper venue, another for failure to state a claim and lack of subject matter jurisdiction. They had previously filed dismissal motions in December, but were required to refile after Trump amended his complaint in February to add Jackson and double the damages sought from $10 billion to $20 billion.\n\nIn trying to get the cases kicked out of the Lone Star State, Paramount and CBS argued that they did not aim the broadcast at Texas residents.\n\nThe media defendants also say that Trump’s lawsuit is an attempt to punish defendants for editorial judgment, which they claim is barred by the First Amendment.\n\nTrump’s lawyers disagree.\n\n“The fact that such commercial speech was issued by a news organization does not insulate Defendants from liability under the First Amendment,” wrote Trump’s legal team on Wednesday. “The First Amendment is no shield to news distortion.”\n\nTrump’s allegations stem from two clips of Harris answering a question about the ongoing Israel-Hamas war in the Middle East. His lawsuit claims the network edited the vice president’s response to make her more appealing to voters and to avoid “one of Harris’ most embarrassing weaknesses,” which it claims was “her habit of uttering ‘word salads’ — i.e., jumbles of exceptionally incoherent speech that drew disapproval even from dyed-in-the-wool Democratic commentators.” The suit says CBS was “looking to profit from manufactured enthusiasm for Harris” by using allegedly “doctored” footage, which they claim was an “unethical and unlawful” attempt to “sabotage a Republican presidential candidate.”\n\nIn their filings opposing the dismissal motions, Trump’s lawyers said that “to support their shallow argument” to dismiss for lack of personal jurisdiction and improper venue, Paramount and CBS “unconvincingly attempt” to show that Trump engaged in “naked forum-shopping.” His lawyers maintained that Trump and Jackson have “sufficient minimum contacts” in Texas and that their claims “arise out of those contacts.”\n\nFor the failure to state a claim and lack of subject matter jurisdiction motion to dismiss, Trump’s team said Paramount and CBS “seek to wield the First Amendment as a sword, arguing that they cannot be held responsible for illegal conduct, intended to mislead the masses and undertaken in the pursuit of profit, because such conduct was the result of ‘editorial judgment.””\n\n“No matter how many times they claim the conduct at issue was editorial speech, that ipse dixit does not make it so,” they said.\n\nTrump alleges that CBS’s editing of the “60 Minutes” interview with Harris caused “widespread confusion and mental anguish of consumers, including plaintiffs, regarding a household name of the legacy media apparently deceptively distorting its broadcasts, and then resisting attempts to clear the public record.” His lawyers describe him as a “prolific content creator who directly communicates with his tens of millions of followers on social media, a media brand in his own right which competes with defendants.”\n\nTrump has reportedly been negotiating a settlement with Paramount, which offered $15 million to end things — an offer Trump declined, according to a report by The Wall Street Journal, citing people familiar with the matter. The parties have reportedly discussed a tentative mediation session scheduled for Thursday.\n\nTrump’s amended complaint, which was filed on Feb. 7, condemns the Harris interview as “an act of unfair competition” and “unfair advantage” against his Truth Social network under the federal Lanham Act, in addition to unlawful “election and voter interference.” Trump is also claiming that CBS falsely advertised with a preview for it during an episode of “Face the Nation.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: President-elect Donald Trump featured on “Meet the Press” Sunday, Dec. 8,&#8230;\n\n\nThis Post: Trump&#8217;s Legal Team Criticizes Effort to Throw Out &#8217;60 Minutes&#8217; Lawsuit first appeared on Internewscast Journal","url":"https://internewscast.com/crime/trumps-legal-team-criticizes-effort-to-throw-out-60-minutes-lawsuit/","image":"https://internewscast.com/wp-content/uploads/2025/02/Trump-wants-20-billion-now-in-CBS-Harris-60-Minutes.jpg","video":null,"publish_date":"2025-05-30 08:14:27","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.585},{"id":326437058,"title":"Column: CBS Is Tortured by Trump, Put Their Rage Into '60 Minutes'","text":"CBS News thinks the crown jewel of its news division is 60 Minutes, the alleged gold standard of investigative journalism on television. But when it comes to politics, their coverage isn’t just slanted. It’s more like a wrecked bus laying on its side, wheels spinning in the air.\n\nTheir stilted editing of a Kamala Harris interview weeks before the election caused Donald Trump to sue last year over the potential harm to his candidacy. By that standard, Trump could sue lots of newscasters and documentarians who slice and dice presidential contenders to try and persuade voters.\n\nThe Wall Street Journal reported the owners of CBS at Paramount Global in recent days offered $15 million to settle the suit, but Team Trump wants more than $25 million and is also seeking an apology from CBS News.\n\nYou can laugh when the Journal added CBS has said the broadcast was “not doctored or deceitful.” When the full interview was released, you could see it was carefully cooked and sliced like lamb chops. Every segment 60 Minutes has done on Joe Biden or Kamala Harris can be presumed to be doctored for maximum positive impact.\n\nPartisanship is the real sticking point in these lawsuits, and needling the partisans is clearly a Trump strategy. The die-hard Democrats at CBS don’t want to apologize to Trump because that looks like surrender in the ten-year war they have been waging on him.\n\nThe Left was furious at ABC News for settling with Trump for $15 million so the rest of us couldn’t read internal ABC emails. George Stephanopoulos was clearly wrong to assert Trump was “found liable for rape” in the E. Jean Carroll suit, but the truth is no priority when the objective is to Get Trump. \n\nIn the midst of this lawsuit, the partisans of 60 Minutes have gone on an anti-conservative tear this year:\n\nOn February 16, mere days after Vice President J.D. Vance went into the Munich Security Conference and denounced European censorship regimes, Sharyn Alfonsi produced a report bizarrely extolling the virtues of German censorship.\n\nOn the same show, Scott Pelley aired a self-righteous attack on Trump and Elon Musk upending the U.S. Agency for International Development. “It’s too soon to tell how serious President Trump is in defiance of the Constitution,” he lectured.\n\nOn February 23, Bill Whitaker puffed up leftist comedian John Oliver, who raged that Supreme Court Justice Clarence Thomas is being bribed by his friends, when they have taken him on vacations. ”I can prove that to you by offering this guy a million dollars a year to get the [bleep] off the Supreme Court. That should be a crime.”\n\nOn April 27, Pelley closed the program with an impassioned editorial defending his boss Bill Evans, who resigned because according to Pelley, in the midst of the Trump lawsuit, “Bill felt he lost the independence that honest journalism requires.”\n\nOn May 4, Pelley played up the bravery of Marc Elias, the partisan Democrat lawyer who worked for Hillary Clinton’s campaign in 2016 and spread all the unsubstantiated conspiracy theories about Trump being in collusion with the Russian government to steal the election. Lawyers like Elias were being persecuted by a vengeful Trump, and you can't paint Team Hillary as being vengeful with all their phony Russiagate attacks.\n\nAt 60 Minutes, it never mattered how many perfumed valentines they offered to help Barack Obama, they still consider themselves the embodiment of journalistic “independence.” They think “honest journalism” is defined by ferociously attacking Trump and other people who are impeding progress by preventing the Democrats from running everything.","summary":"CBS News thinks the crown jewel of its news division is 60 Minutes, the alleged gold standard of investigative journalism on television. But when it comes to politics, their coverage isn’t just slanted. It’s more like a wrecked bus laying on its side, wheels spinning in the air.\n\nTheir stilted editing of a Kamala Harris interview weeks before the election caused Donald Trump to sue last year over the potential harm to his candidacy. By that standard, Trump could sue lots of newscasters and documentarians who slice and dice presidential contenders to try and persuade voters.\n\nThe Wall Street Journal reported the owners of CBS at Paramount Global in recent days offered $15 million to settle the suit, but Team Trump wants more than $25 million and is also seeking an apology from CBS News.\n\nYou can laugh when the Journal added CBS has said the broadcast was “not doctored or deceitful.” When the full interview was released, you could see it was carefully cooked and sliced like lamb chops. Every segment 60 Minutes ","url":"https://www.newsbusters.org/blogs/nb/tim-graham/2025/05/30/column-cbs-tortured-trump-put-their-rage-60-minutes","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/60%2520Minutes-The%2520Rule%2520of%2520Law%3B%2520Freezing%2520the%2520Biological%2520Clock-7_05_33%2520pm-2025-05-04-0%5B1%5D.jpg?itok=_u_D1uI7","video":null,"publish_date":"2025-05-30 06:05:00","author":"Tim Graham","authors":["Tim Graham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.297}]}