{"offset":0,"number":50,"available":423,"news":[{"id":329759364,"title":"How to watch podcast star Alex Cooper in ‘Call Her Alex’ docuseries for free","text":"“Daddy gang,” you’re going to want to watch this. \n\nJust two days after premiering at the Tribeca Festival, podcaster Alex Cooper’s two-part documentary “Call Her Alex” is hitting Hulu. \n\nRELATED: Podcast star Alex Cooper accuses her Boston University soccer coach of sexual harassment in new doc\n\nDocumentary cameras followed the host of the “Call Her Daddy” podcast as she prepared for her first tour last fall, while offering “an intimate, behind-the-scenes look at the life-defining events that shaped Cooper’s journey as she grew from a 24-year-old woman with a sex and dating podcast to the CEO of a media empire in just six years,” per Hulu’s synopsis. \n\nOver the past year, Cooper has made headlines for featuring guests like Gayle King, Kamala Harris, and Chappell Roan on her podcast. \n\nWhen does ‘Call Her Alex’ come out on Hulu? \n\nBoth parts of the “Call Her Alex” documentary drop on Hulu at 12 a.m. ET on June 10 (9 p.m. PT on June 9). \n\nHow to watch ‘Call Her Alex’ for free:\n\nIf you want to watch “Call Her Alex,” you’ll need a Hulu subscription. Don’t have one? No worries, you can get started for free right now. \n\nIf you’re new to Hulu, you can take advantage of a 30-day free trial on the streamer’s basic (with ads) plan. After the trial period, you’ll pay $9.99/month. If you want to upgrade to Hulu ad-free, it costs $18.99/month.\n\nIf you want to stream even more and save a few bucks a month while you’re at it, we recommend subscribing to one of the Disney+ Bundles, all of which include Hulu. These bundles start at $10.99/month for ad-supported Disney+ and Hulu and go up to $29.99/month for Disney+, Hulu, and Max, all ad-free.\n\n‘Call Her Alex’ trailer:\n\nWhy Trust Post Wanted by the New York Post\n\nThis article was written by Angela Tricarico, Commerce Writer/Reporter for Post Wanted Shopping and New York Post’s streaming property, Decider. Angela keeps readers up to date with cord-cutter-friendly deals, and information on how to watch your favorite sports teams, TV shows, and movies on every streaming service. Not only does Angela test and compare the streaming services she writes about to ensure readers are getting the best prices, but she’s also a superfan specializing in the intersection of shopping, tech, sports, and pop culture. Prior to joining Decider and The New York Post in 2023, she wrote about streaming and consumer tech at Insider Reviews","summary":"The doc charts, among other things, Cooper's rise from podcast host to CEO.","url":"https://nypost.com/2025/06/09/entertainment/how-to-watch-alex-coopers-call-her-alex-docuseries-for-free/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/call-her-alex.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-10 01:00:00","author":"Angela Tricarico","authors":["Angela Tricarico"],"language":"en","source_country":"us","sentiment":0.24},{"id":329759366,"title":"How to watch Alex Cooper documentary ‘Call Her Alex’: Release time, trailer","text":"Listen up, “daddy gang.” \n\n“Call Her Daddy” host Alex Cooper is taking fans behind the scenes with her new documentary, “Call Her Alex.”\n\nWhile the two-part series premiered on Sunday at the Tribeca Film Festival — followed by a talk with the media mogul herself — it will finally hit streaming services on June 10. Read on for everything you need to know to watch for free.\n\nWhen does ‘Call her Alex’ air?\n\n“Call her Alex” drops at midnight ET on June 10, 2025.\n\nHow to watch ‘Call her Alex’\n\n“Call Her Alex” is streaming on both Disney+ and Hulu, the latter of which offers a month-long free trial (afterwards the price increases to $9.99/month with ads or $18.99/month ad-free.)\n\nYou can also bundle the two services starting at $10.99/month, a savings of 44% per month. \n\nWhat is ‘Call her Alex’ about?\n\nWhile Cooper’s interviewed everyone from Kamala Harris to Khloé Kardashian, her new docu-series puts her on the other side of the microphone for an intimate look at her own life and rise to fame.\n\n“I wanted you guys to see where I came from,” the media mogul told audiences at the premiere, per a press release. “I think this was really a way for you to get to know me as Alex Cooper from Pennsylvania.”\n\nWhile filming began two years ago during Cooper’s first “Call Her Daddy” tour, the intimate episodes also touch on her upbringing and her experiences as a D1 soccer player, as she re-visits the Boston University field and emotionally accuses her college coach of sexual harassment. (Page Six has reached out to Boston University for comment, but did not immediately hear back.)\n\n“It’s really opened my eyes to how difficult the system is, and it’s so built against us as women,” Cooper said at the film festival, per People. \n\n‘Call her Alex’ trailer\n\nWhy Trust Page Six Style Shopping\n\nThis article was written by Hannah Southwick, Commerce Writer/Reporter for Page Six Style. Hannah spies deals on actually affordable celebrity-worn styles, puts Hollywood’s favorite labels to the test and finds the beauty products that keep stars red carpet-ready. She consults stylists and industry pros — including celebs themselves — for firsthand product recommendations, trend predictions and more. In addition to writing for Page Six since 2020, her work has been featured in USA Today and Parade.","summary":"The new series puts the famed interviewer on the other side of the microphone for an intimate look at her own rise to fame.","url":"https://pagesix.com/2025/06/09/entertainment/how-to-watch-new-alex-cooper-documentary-call-her-alex/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/06/106176756.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-10 01:00:00","author":"Hannah Southwick,mliss1578","authors":["Hannah Southwick","mliss1578"],"language":"en","source_country":"us","sentiment":0.613},{"id":329758878,"title":"Trump Sends Marines to Support California's National Guard During Riots","text":"The Trump administration is sending hundreds of U.S. Marines to Los Angeles to support California’s National Guard as anti-ICE, foreign-flag waving riots continue.\n\n“Defense and congressional officials” told the Wall Street Journal that “roughly 500” U.S Marines would be deployed to the area “to protect federal buildings and personnel” after riots broke out over the weekend against immigration officials.\n\nThe officials added that the Marines “won’t engage” with the rioters, according to the outlet.\n\nIn a press release from the U.S. Northern Command, it was revealed that 700 Marines from the 2nd Battalion, 7th Marines, 1st Division would “seamlessly integrate with the Title 10 forces under Task Force 51 who are protecting federal personnel and federal property” in Los Angeles.\n\nCNN also reported that “three people familiar with the matter” said 700 Marines from the Marine Corps Air Ground Combat Center would be deployed to Los Angeles.\n\nPer CNN, one of the sources told the outlet that the Marines would “be augmenting the Guard presence on the ground.” While Trump federalized 2,000 National Guardsmen, “only about 300 have been deployed to the streets of LA so far”:\n\nOne of the people familiar with the Marine mobilization said they will be augmenting the Guard presence on the ground in LA. Over 2,000 members of the California National Guard have been activated by the president, but only about 300 have been deployed to the streets of LA so far. Those initial 300 people were on a routine National Guard drill weekend when they were mobilized, which is why they were able to arrive so quickly, the person familiar said; it can take up to 72 hours for other Guardsmen to be mobilized. The Marines are expected to bolster some of the Guard members who have been deployed to LA in the last two days, this person said.\n\nA U.S. official told Reuters that roughly 700 Marines would be “temporarily” deployed to Los Angeles.\n\nThe reports of the Trump administration deploying hundreds of U.S. Marines comes as President Donald Trump signed a Presidential Memorandum over the weekend, federalizing 2,000 National Guardsmen.\n\nSecretary of Defense Pete Hegseth revealed in a post on X that “due to increased threats to federal law enforcement officers and federal buildings, approximately 700 active-duty U.S. Marines from Camp Pendleton” were being deployed to Los Angeles.\n\nVideos and photos posted to social media have shown rioters throwing rocks at law enforcement officials and Border Patrol vehicles, looting businesses, burning vehicles and the American flag, and shooting fireworks at police officers on horseback, among other actions. Democrats have criticized Trump for federalizing the National Guard.\n\nIn a statement issued Sunday, former Vice President Kamala Harris said deploying the National Guard to address the violence from the riots was a “dangerous escalation.” California Gov. Gavin Newsom (D) has also criticized Trump for deploying the National Guard, calling the move “purposefully inflammatory.”\n\nNewsom also revealed that he is suing the Trump administration for having “illegally acted to federalize the National Guard.”","summary":"The Trump administration is sending hundreds of U.S. Marines to Los Angeles to support California's National Guard as anti-ICE, foreign-flag waving riots continue.\n\n\nThe post Trump Sends Marines to Support California&#8217;s National Guard During Riots appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/06/09/trump-sends-marines-to-support-californias-national-guard-during-riots/","image":"https://media.breitbart.com/media/2025/06/GettyImages-2219268737-640x335.jpg","video":null,"publish_date":"2025-06-10 00:04:20","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","source_country":"US","sentiment":-0.089},{"id":329746536,"title":"How Democrats defend the WORST migrants and blame Trump for riots ordered up by the left","text":"Democrats don’t seem to care about the criminal rap sheets of the illegal migrants ICE has been rounding up in Los Angeles. Apparently, convicted sex abusers, drug dealers and gang members all still somehow have a sacrosanct right to stay in the United States.\n\nAnd ICE efforts to take them into custody, per Mayor Karen Bass on Friday, “sow terror in our communities and disrupt basic principles of safety in our city.”\n\n(Funny: Andrew Cuomo’s statement the same day here in NYC also complained that ICE’s “sow terror in neighborhoods” and “erode the sense of safety for all residents.” Maybe they’ve hired the same consultants?)\n\nThing is, criminals sow terror every day, and ICE’s LA targets had done hard time for crimes like cocaine trafficking, willful cruelty to a child and sexual battery.\n\nMany of the detainees also had gang affiliations and/or convictions for assault.\n\nAnd, again, none were in this country legally; they’re the kind of menaces Americans most have in mind when they tell pollsters they support Team Trump’s deportation efforts.\n\nYet Bass says enforcing the law is too dangerous: “If you dial back time and go to Friday, if immigration raids had not happened here, we would not have the disorder that went on,” she blathered Monday on CNN.\n\n“People in the city have a rapid-response network,” she explained. “If they see ICE, they go out and they protest” — though most people wouldn’t use “protest” to describe lighting cars on fire, shooting commercial fireworks at cops or throwing Molotov cocktails at federal agents.\n\nAs for that “rapid-response network”: Much of it consists of “activist” groups like the Party for Socialism and Liberation, which has also been organizing anti-Israel violence of late and has received major funding from socialist billionaire Neville Singham, who has well-documented ties to the Chinese Communist Party.\n\nIt’s not so strange that the rioters have been waving Mexican and Palestinian flags, after all.\n\nThen again, another major protest-pusher is funded by US governments: CHIRLA, the Coalition for Humane Immigrant Rights/Los Angeles, has gotten tens of millions from the state of California, as well as smaller grants from the Biden Department of Homeland Security.\n\nIndeed, a Friday presser by CHIRLA honcho Angelica Salas calling for broad demonstrations against ICE may have been the main signal for the weekend riots to begin.\n\nBut California Democrats would much rather pretend it’s all Trump’s fault for sending in the National Guard: Gov. Gavin Newsom tweeted, “The federal government is sowing chaos so they can have an excuse to escalate.”\n\nEx-Veep Kamala Harris agreed, calling the president’s actions a “dangerous escalation meant to provoke chaos.”\n\nAgain with the shared scripts.\n\nAmericans have every right to expect their safety to be the top for their elected officials, but that’s not how California politicians (nor all too many in New York) see their jobs.\n\nForget about coordinating with the feds to protect the innocent: Far more important to answer to the far-left professional “activists” and coordinate your anti-Trump talking points while you protect violent criminals from the awful injustice of being sent back to their home countries.","summary":"Democrats don’t seem to care about the criminal rap sheets of the illegal migrants ICE has been rounding up in Los Angeles. A","url":"https://nypost.com/2025/06/09/opinion/how-democrats-defend-the-worst-migrants-and-blame-trump-for-riots-ordered-up-by-the-left/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-zw2cfhr9q-1749506892008.jpg?quality=75&strip=all&1749492599&w=1200","video":null,"publish_date":"2025-06-09 23:31:45","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.255},{"id":329743248,"title":"Rep. Mark Green announces retirement from Congress for ‘private sector opportunity’ before end of term","text":"House Homeland Security Committee Chairman Mark Green, R-Tenn., is departing Capitol Hill early, he announced on Monday.\n\nGreen said he is leaving Congress for the private sector after the House votes again on President Donald Trump’s “big, beautiful bill” in the coming weeks, in a statement first obtained by Fox News Digital.\n\n“It is with a heavy heart that I announce my retirement from Congress. Recently, I was offered an opportunity in the private sector that was too exciting to pass up. As a result, today I notified the Speaker and the House of Representatives that I will resign from Congress as soon as the House votes once again on the reconciliation package,” Green said.\n\nHe called serving Tennessee’s 7th Congressional District “the honor of a lifetime.”\n\n“They asked me to deliver on the conservative values and principles we all hold dear, and I did my level best to do so. Along the way, we passed historic tax cuts, worked with President Trump to secure the border, and defended innocent life. I am extremely proud of my work as Chairman of the Homeland Security Committee, and want to thank my staff, both in my seventh district office, as well as the professional staff on that committee,” Green said.\n\nGreen acknowledged in his statement that he had previously geared up to retire in the last Congress, but reversed course.\n\n“Though I planned to retire at the end of the previous Congress, I stayed to ensure that President Trump’s border security measures and priorities make it through Congress,” he said.\n\n“By overseeing the border security portion of the reconciliation package, I have done that. After that, I will retire, and there will be a special election to replace me.”\n\nGreen is an Army veteran who has served in Congress since 2019.\n\nAs House Homeland Security Committee chairman, he oversaw Republicans’ impeachment of former Biden administration DHS Secretary Alejandro Mayorkas.\n\nIt’s not clear where in the private sector Green will go, but it’s a safe bet to assume his House seat will stay in Republican hands.\n\nThe district voted for President Donald Trump by more than 20 percentage points over former Vice President Kamala Harris last year.\n\nRepublican leaders are hoping to complete consideration of Trump’s massive agenda bill by the Fourth of July or shortly thereafter.\n\nThe bill passed the House in a narrow 215-214 vote, and it is now being considered by the Senate. If the Senate changes the bill, as expected, the House will have to approve that version before it hits Trump’s desk.","summary":"Rep. Mark Green said he is leaving Congress for the private sector after the House votes again on President Donald Trump's \"big, beautiful bill\" in the coming weeks","url":"https://nypost.com/2025/06/09/us-news/rep-mark-green-announces-retirement-from-congress-for-private-sector-opportunity-before-end-of-term/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-qy10txmk5-1749509988515.jpg?quality=75&strip=all&1749495606&w=1200","video":"https://cdn.jwplayer.com/videos/afm8cI0d-RyIcpnTz.mp4","publish_date":"2025-06-09 23:04:41","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"zm","sentiment":-0.008},{"id":329751892,"title":"Partisan Division Deepens Over Handling of LA Riots","text":"As the National Guard seeks to quell riots against enforcement of federal immigration law in Los Angeles, Republicans and Democrats are finding themselves in fierce debate, with Democrats contending that President Donald Trump is addressing a “manufactured crisis,” but with Republicans calling for immediate order in the streets.\n\nAfter protests began Friday against U.S. Immigration and Customs Enforcement officers, Trump called out the California National Guard to quash the riots.\n\nCalifornia Gov. Gavin Newsom has since called the deployment an “illegal order” and on Monday, California state Attorney General Rob Bonta moved to sue the White House. Bonta called Trump’s move “unnecessary, counterproductive, and unlawful.”\n\nNewsom reposted an X post from Hillary Clinton on Monday, saying, “Donald Trump has manufactured a crisis and is inflaming conditions.” \n\nNewsom had previously written on X on Sunday, “Trump’s goal isn’t to keep Californians safe. His goal is to cause chaos, because chaos is good for Trump.”\n\n“I totally disagree,” Rep. Jim Jordan, R-Ohio, told The Daily Signal in response to Newsom and Clinton’s statements. Jordan chairs the House Judiciary Committee.\n\nRep. Tim Burchett, R-Tenn., similarly considered the situation grave, criticizing the California state government for rejecting federal assistance to calm the anti-ICE agitation.\n\n“It’s lawlessness that’s being endorsed by the government, and I don’t care who’s in the White House or who’s in office. Any time you send that message out, it puts a target on the head of a lot of people, and I think it’s a very dangerous precedent to be set,” Burchett told The Daily Signal.\n\nAs tensions and violent confrontations continue in Los Angeles, there is a risk that similar events could erupt in other cities where the local government does not cooperate with federal immigration law enforcement.\n\nJordan told The Daily Signal, “I hope it doesn’t happen anywhere else. I hope it stops in LA.”\n\nBut other Republicans fear this may be just the beginning.\n\nWhen asked whether similar deployments of National Guard could happen elsewhere, Burchett told The Daily Signal, “I think so.”\n\nHe added that he thought it was important to restore order quickly, in order to send a message that rioting would not be tolerated.\n\n“I think you’d better take care of it early. If it’s endorsed, and the message is sent that it’s OK, and that we’re going to turn the other way, look the other way, then … they’re going to scale it up, and it’s going to get a lot worse,” said Burchett.\n\nIn this incendiary manifestation of disagreements between Democrat states and the White House, Democrats are holding their ground on the deportation issue, which played a major role in the last presidential election.\n\n“This Administration’s actions are not about public safety—they’re about stoking fear,” former Vice President Kamala Harris said in a statement. “Fear of a community demanding dignity and due process.”\n\nIn a statement to The Daily Signal, Rep. Eli Crane, R-Ariz., who is on the opposite side of the issue, backed Trump’s actions in deploying the National Guard.\n\n“How many times does Los Angeles need to descend into fiery chaos before folks come to terms with the fact that their progressive politicians are lunatics?” he said. “Secure the border. Deport illegals. Make communities safe again.”","summary":"As the National Guard seeks to quell riots against enforcement of federal immigration law in Los Angeles, Republicans and Democrats are finding themselves in fierce... Read More\n\n\nThe post Partisan Division Deepens Over Handling of LA Riots appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/09/partisan-conflict-erupts-handling-l-a-riots/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/gavinnewsom.jpg","video":null,"publish_date":"2025-06-09 22:43:03","author":"George Caldwell","authors":["George Caldwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.272},{"id":329738340,"title":"FBI will investigate 'any evidence of a criminal conspiracy' in LA riots","text":"The Federal Bureau of Investigation said on Monday that it will look into any organized effort to create chaos in Los Angeles, as anti-ICE riots occurred over the weekend. \"We're investigating anyone who crosses the line from first-amendment protected activity to violence and are prepared to prosecute anyone who assaults a federal officer or causes damage to government property,\" Laura Eimiller, media coordinator for the FBI’s Los Angeles Field Office, told Fox News Digital in an email. \"LAPD, as you know, is also making arrests for unlawful assembly. Obviously, any evidence of a criminal conspiracy will be investigated,\" she continued. HOUSE DEMS TRY TO BLAME TRUMP FOR LOS ANGELES VIOLENCE DESPITE MONTHS OF ANTI-ICE RHETORIC Dozens have been arrested in Los Angeles as cars have been burned and tensions between rioters and law enforcement tended to escalate later in the day over the weekend, and more unrest could occur on Monday night. President Donald Trump has sent in National Guard troops to reign in the riots, which the state of California is suing over, as Democratic leaders argue it's only instigating. Andy Ngo of The Post Millennial reported that Antifa and others are likely playing a role in the riots, as Rep. Anna Paulina Luna, R-Fla., said that she’ll be introducing legislation to \"designated ANTIFA as a terrorist organization.\" FBI SEARCHING FOR SUSPECT WHO ALLEGEDLY ASSAULTED FEDERAL OFFICER DURING ANTI-ICE RIOTS IN LOS ANGELES On Monday during a press conference announcing a lawsuit against the Trump administration for deploying the National Guard to Los Angeles, California Attorney General Rob Bonta told Fox News Digital acknowledged that \"outside folks\" will \"sometimes embed themselves or use the protest as cover.\" \"If you don't follow the law, we will find you, and we will come for you, and we will hold you accountable,\" Bonta said. CLICK HERE FOR MORE IMMIGRATION COVERAGE As for non-violent protests, many of the demonstrations stem from left-wing groups, including the Service Employees International Union, the Coalition for Humane Immigrant Rights of Los Angeles, and the Party for Socialism and Liberation. The SEIU has organized anti-ICE rallies across the country following the arrest of the union’s California president, David Huerta, as he is facing federal charges for allegedly getting in the way of an ICE crackdown. Huerta was released Monday from federal custody. \"ICE’s brutal, military-style tactics have no place in our communities. We demand safety. We demand respect. We demand David’s release,\" SEIU posted to X on Monday. FEDERAL OFFICIALS SLAM DEMOCRATS FOR 'DANGEROUS' RHETORIC AS ICE AGENTS FACE VIOLENT MOBS IN LA, NYC The group had a public plan to pour $200 million to support candidates across the country in 2024, including Vice President Kamala Harris in her presidential bid. CHRILA told the New York Post that they have \"not participated, coordinated, or been part of the protests being registered in Los Angeles other than the press conference and rally.\" CLICK HERE TO GET THE FOX NEWS APP The Post reported that CHIRLA won $450,000 in grants from the Biden-era DHS, but $100,936 of \"remaining, unobligated federal funding\" for the award given to the group was scrapped by the Trump administration in March, DHS Assistant Secretary Tricia McLaughlin posted to X on Sunday. The organization received millions in grants while President Joe Biden was in office, according to the outlet. The Post further reported that the PSL has ties to the Chinese Communist Party because of its backing from tech billionaire Neville Singham. Fox News Digital has reached out to SEIU, the PSL, and CHIRLA for comment.","summary":"The FBI says they&apos;ll investigate &quot;any evidence of a criminal conspiracy&quot; as the anti-ICE riots in Los Angeles continue to rage amid a federal response including National Guard.","url":"https://www.foxnews.com/politics/fbi-investigate-any-evidence-criminal-conspiracy-la-riots","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/fbi.png?ve=1&tl=1","video":null,"publish_date":"2025-06-09 22:15:52","author":"Cameron Arcand","authors":["Cameron Arcand"],"language":"en","category":"politics","source_country":"US","sentiment":-0.034},{"id":329735708,"title":"Los Angeles ignited over weekend ICE raids. Then the National Guard arrived","text":"Los Angeles remains on high alert, after a series of immigration raids triggered mass protests and rioting, and a similarly massive police and law enforcement response.\n\nProtests and rallies are set to continue through Monday. The Trump administration has deployed 700 Marines to join the 2,000 National Guard troops who have been authorized to join the response.\n\nHere is a timeline of the fiery protests and a preview of what may come next.\n\nFriday, June 6\n\nThe roots of the crisis can be traced to Friday, when immigration officials conducted a series of four operations around the Los Angeles area, including a raid at a warehouse in the Fashion District, where crowds tried to stop government vehicles from driving away, and another at a Home Depot store near downtown.\n\nLater that afternoon, hundreds gathered around a complex of federal buildings near downtown where some of the arrested migrants were being detained, and Homeland Security officers fired pepper balls at protesters to disperse the crowd.\n\nThe Department of Homeland Security said over 1,000 had surrounded the complex, and “assaulted ICE law enforcement officers, slashed tires, defaced buildings, and taxpayer funded property.”\n\nAll told, more than 100 people were arrested on Friday, federal officials said, including David Huerta, leader of the Service Employees International Union California, who federal officials accuse of impeding a government officer.\n\nSaturday, June 7\n\nThe situation escalated again the following day, as rumors spread that ICE agents were massing in the city of Paramount, which has a large Latino population, for another Home Depot raid.\n\nProtesters were seen kicking vehicles and throwing objects at law enforcement vehicles throughout the day, while riot police dispersed crowds with tear gas.\n\nPolice said about 350 to 400 people were gathered in the area, and protesters were seen blocking a bus identified as a U.S. Marshals vehicle.\n\nBy Saturday afternoon, the Los Angeles County Sheriff’s Office ordered protesters there to disperse, again using tear gas to break up retreating crowds.\n\nThat evening, around 6pm, Donald Trump ordered the deployment of up to federalized 2,000 National Guard troops to Los Angeles, over the objection of Los Angeles Mayor Karen Bass and California Governor Gavin Newsom, who blasted the move, saying it was “purposefully inflammatory and will only escalate tensions.”\n\nFormer Vice President Kamala Harris, who lives in Los Angeles, joined in, calling the step “a dangerous escalation meant to provoke chaos.”\n\nTrump’s order left open the possibility of an even more dramatic escalation, authorizing regular members of the armed forces to join in the operation, an abandonment of the military’s typical non-domestic role usually only contemplated if the U.S. is under invasion.\n\nClashes continued throughout the night in Compton, where officers used flash-bang grenades and rubber bullets on protesters, who threw rocks, bottles, and fireworks at police. A car was also set on fire.\n\nAcross the city, officers formed a wall around the federal complex and declared the crowds there part of an unlawful assembly.\n\nAt least 29 were arrested by the end of the day.\n\nSunday, June 8\n\nEarly Sunday morning, the first of the National Guard troopers began arriving in the city, and 300 troops took up positions across the greater Los Angeles area, including at the federal complex that has become a hub for the clashes.\n\nCommunity members expressed alarm at the massing federal and local law enforcement.\n\n“Send in the National Guard — for what?” Gabby Buenrostro, 46, told The Washington Post as they set off for the federal complex on Sunday morning. “We have a right to protest.”\n\nBy the afternoon, hundreds of protesters had gathered there, and California National Guardsmen, DHS agents, ICE officers, and police formed a line, attempting to clear out protesters using pepper balls, tear gas, and crowd-control munitions.\n\nWhile many of the demonstrators there were peaceful, some threw objects at the riot police.\n\nHundreds of protesters also spilled out onto the 101 freeway, where activists temporarily blocked traffic.\n\nThe California Highway Patrol used tear gas to clear the road itself, arresting 17, but crowds remained on nearby walkways, jeering at officers below as some demonstrators threw concrete, scooters, and other objects at police.\n\nThough protests were not geographically widespread, clashes continued through the night, and Waymo self-driving taxis were vandalized, with many set on fire.\n\nAll told, a combined 42 arrests were made on Sunday by the Los Angeles Police Department, California Highway Patrol, and Los Angeles County Sheriff’s Department, according to the LAPD.\n\n\"This violence that I've seen is disgusting,\" Chief Jim McDonnell told NBC Los Angeles of the weekend’s confrontations. \"It's escalated now. What we saw the first night was bad. What we've seen subsequent to that is getting increasingly worse and more violent.\"\n\nMcDonell said the violence had overwhelmed local police, who had been attacked with commercial fireworks, Molotov cocktails, and broken cinderblocks.\n\nWhat happens next?\n\nThe tension looks set to continue into this week, as more events are planned around Los Angeles on Monday, though much of downtown remains blocked off to demonstrations. The Trump administration has ordered 700 Marines to join in the federal response.\n\nThe state of California has also sued over Trump’s use of the state’s National Guard, which California officials say went forward despite their objections.\n\nThe political sparring over the protests shows no sign of abating either, as supporters of the president blame California leaders for the chaos in L.A.\n\n“President Trump didn’t start these riots,” Riverside County Sheriff Chad Bianco wrote on X on Sunday. “He’s not out there lighting cars on fire, hurling projectiles at law enforcement or blocking freeways. This statement is an embarrassment and does nothing to diffuse the violent riots taking place across the city. The Democrats and their ‘leaders’ own this.”","url":"https://uk.news.yahoo.com/los-angeles-ignited-over-weekend-220101035.html","image":"https://media.zenfs.com/en/the_independent_577/5b1102c6c8c268a82a6c2a0aa88703a9","video":null,"publish_date":"2025-06-09 22:01:01","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":-0.421},{"id":329738262,"title":"Los Angeles ignited over weekend ICE raids. Then the National Guard arrived","text":"Los Angeles remains on high alert, after a series of immigration raids triggered mass protests and rioting, and a similarly massive police and law enforcement response. \n\nProtests and rallies are set to continue through Monday. The Trump administration has deployed 700 Marines to join the 2,000 National Guard troops who have been authorized to join the response. \n\nHere is a timeline of the fiery protests and a preview of what may come next.\n\nThe roots of the crisis can be traced to Friday, when immigration officials conducted a series of four operations around the Los Angeles area, including a raid at a warehouse in the Fashion District, where crowds tried to stop government vehicles from driving away, and another at a Home Depot store near downtown.\n\nLater that afternoon, hundreds gathered around a complex of federal buildings near downtown where some of the arrested migrants were being detained, and Homeland Security officers fired pepper balls at protesters to disperse the crowd.\n\nThe Department of Homeland Security said over 1,000 had surrounded the complex, and “assaulted ICE law enforcement officers, slashed tires, defaced buildings, and taxpayer funded property.”\n\nAll told, more than 100 people were arrested on Friday, federal officials said, including David Huerta, leader of the Service Employees International Union California, who federal officials accuse of impeding a government officer.\n\nThe situation escalated again the following day, as rumors spread that ICE agents were massing in the city of Paramount, which has a large Latino population, for another Home Depot raid.\n\nProtesters were seen kicking vehicles and throwing objects at law enforcement vehicles throughout the day, while riot police dispersed crowds with tear gas.\n\nPolice said about 350 to 400 people were gathered in the area, and protesters were seen blocking a bus identified as a U.S. Marshals vehicle. \n\nBy Saturday afternoon, the Los Angeles County Sheriff’s Office ordered protesters there to disperse, again using tear gas to break up retreating crowds.\n\nThat evening, around 6pm, Donald Trump ordered the deployment of up to federalized 2,000 National Guard troops to Los Angeles, over the objection of Los Angeles Mayor Karen Bass and California Governor Gavin Newsom, who blasted the move, saying it was “purposefully inflammatory and will only escalate tensions.” \n\nFormer Vice President Kamala Harris, who lives in Los Angeles, joined in, calling the step “a dangerous escalation meant to provoke chaos.”\n\nTrump’s order left open the possibility of an even more dramatic escalation, authorizing regular members of the armed forces to join in the operation, an abandonment of the military’s typical non-domestic role usually only contemplated if the U.S. is under invasion. \n\nClashes continued throughout the night in Compton, where officers used flash-bang grenades and rubber bullets on protesters, who threw rocks, bottles, and fireworks at police. A car was also set on fire.\n\nAcross the city, officers formed a wall around the federal complex and declared the crowds there part of an unlawful assembly. \n\nAt least 29 were arrested by the end of the day. \n\nEarly Sunday morning, the first of the National Guard troopers began arriving in the city, and 300 troops took up positions across the greater Los Angeles area, including at the federal complex that has become a hub for the clashes.\n\nCommunity members expressed alarm at the massing federal and local law enforcement.\n\n“Send in the National Guard — for what?” Gabby Buenrostro, 46, told The Washington Post as they set off for the federal complex on Sunday morning. “We have a right to protest.”\n\nBy the afternoon, hundreds of protesters had gathered there, and California National Guardsmen, DHS agents, ICE officers, and police formed a line, attempting to clear out protesters using pepper balls, tear gas, and crowd-control munitions.\n\nWhile many of the demonstrators there were peaceful, some threw objects at the riot police.\n\nHundreds of protesters also spilled out onto the 101 freeway, where activists temporarily blocked traffic. \n\nThe California Highway Patrol used tear gas to clear the road itself, arresting 17, but crowds remained on nearby walkways, jeering at officers below as some demonstrators threw concrete, scooters, and other objects at police.\n\nThough protests were not geographically widespread, clashes continued through the night, and Waymo self-driving taxis were vandalized, with many set on fire.\n\nAll told, a combined 42 arrests were made on Sunday by the Los Angeles Police Department, California Highway Patrol, and Los Angeles County Sheriff’s Department, according to the LAPD.\n\n\"This violence that I've seen is disgusting,\" Chief Jim McDonnell told NBC Los Angeles of the weekend’s confrontations. \"It's escalated now. What we saw the first night was bad. What we've seen subsequent to that is getting increasingly worse and more violent.\"\n\nMcDonell said the violence had overwhelmed local police, who had been attacked with commercial fireworks, Molotov cocktails, and broken cinderblocks.\n\nThe tension looks set to continue into this week, as more events are planned around Los Angeles on Monday, though much of downtown remains blocked off to demonstrations. The Trump administration has ordered 700 Marines to join in the federal response.\n\nThe state of California has also sued over Trump’s use of the state’s National Guard, which California officials say went forward despite their objections.\n\nThe political sparring over the protests shows no sign of abating either, as supporters of the president blame California leaders for the chaos in L.A.\n\n“President Trump didn’t start these riots,” Riverside County Sheriff Chad Bianco wrote on X on Sunday. “He’s not out there lighting cars on fire, hurling projectiles at law enforcement or blocking freeways. This statement is an embarrassment and does nothing to diffuse the violent riots taking place across the city. The Democrats and their ‘leaders’ own this.”","summary":"A series of immigration raids across Los Angeles on Friday kicked off weekend protests, rioting, and a mass response from police, soldiers, and federal agents.","url":"https://www.independent.co.uk/news/world/americas/us-politics/la-protests-ice-national-guard-timeline-b2766793.html","image":"https://static.independent.co.uk/2025/06/09/20/51/GettyImages-2218667456.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/2WdTTACx-4VHSaSK0.mp4","publish_date":"2025-06-09 22:01:01","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":-0.423},{"id":329738330,"title":"Mark Green announces retirement from Congress before end of term","text":"House Homeland Security Committee Chairman Mark Green, R-Tenn., is departing Capitol Hill early, he announced on Monday. Green said he is leaving Congress for the private sector after the House votes again on President Donald Trump's \"big, beautiful bill\" in the coming weeks, in a statement first obtained by Fox News Digital. \"It is with a heavy heart that I announce my retirement from Congress. Recently, I was offered an opportunity in the private sector that was too exciting to pass up. As a result, today I notified the Speaker and the House of Representatives that I will resign from Congress as soon as the House votes once again on the reconciliation package,\" Green said. He called serving Tennessee's 7th Congressional District \"the honor of a lifetime.\" \"They asked me to deliver on the conservative values and principles we all hold dear, and I did my level best to do so. Along the way, we passed historic tax cuts, worked with President Trump to secure the border, and defended innocent life. I am extremely proud of my work as Chairman of the Homeland Security Committee, and want to thank my staff, both in my seventh district office, as well as the professional staff on that committee,\" Green said. Green acknowledged in his statement that he had previously geared up to retire in the previous Congress, but reversed course. \"Though I planned to retire at the end of the previous Congress, I stayed to ensure that President Trump’s border security measures and priorities make it through Congress,\" he said. \"By overseeing the border security portion of the reconciliation package, I have done that. After that, I will retire, and there will be a special election to replace me.\" Green is an Army veteran who has served in Congress since 2019. As House Homeland Security Committee chairman, he oversaw Republicans' impeachment of former Biden administration Homeland Security Secretary Alejandro Mayorkas. It's not clear where in the private sector Green will go next, but it's a safe bet to assume his seat will stay in Republican hands. The district voted for President Donald Trump by more than 20% over former Vice President Kamala Harris last year.","summary":"House Homeland Security Committee Chairman Mark Green announced he is resigning from Congress to join the private sector.","url":"https://www.foxnews.com/politics/mark-green-announces-retirement-from-congress-before-end-term","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/931/523/AP24045821027172.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-09 21:58:35","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","source_country":"US","sentiment":-0.063},{"id":329728062,"title":"Where to Stream Alex Cooper’s First Documentary, ‘Call Her Alex,’ Online","text":"If you purchase an independently reviewed product or service through a link on our website, The Hollywood Reporter may receive an affiliate commission.\n\n Six years after launching Call Her Daddy, podcast host Alex Cooper is giving the Daddygang a glimpse into how her media empire was born in a new documentary.\n\n Fresh off premiering at Tribeca Festival, Call Her Alex begins streaming Tuesday, June 10, exclusively on Hulu. The two-part doc follows the Unwell Network founder as she prepares for her first tour and “offers an intimate, behind-the-scenes look at the life-defining events” of the former college soccer player-turned-media mogul, including sexual harassment allegations against her Boston University coach.\n\n At a Glance: How to watch Call Her Daddy online\n\n “I was fortunate to grow up in a household where it was normalized to speak your mind. Playing sports and making videos in my basement, those were the two things I really loved,” the Gen Z podcast superstar reveals in the trailer.\n\n In 2019, Cooper took her sex and relationships podcast from Barstool Sports to Spotify after inking a $60 million deal. Last year, she became the highest-paid female podcaster in the world when she moved Call Her Daddy to SiriusXM for $125 million.\n\n Kamala Harris, Miley Cyrus, RuPaul, Chelsea Handler and Jane Fonda are just a handful of stars who’ve made guest appearances on Call Her Daddy, with Hollywood icon and fitness superstar Fonda being seen in the documentary telling Cooper, “I’ve been at this for 60 years. You’re one of the best interviewers I’ve ever had.”\n\n In an interview with The Hollywood Reporter, Cooper revealed that she has even turned down potential guests who weren’t willing to open up.\n\n “Everyone’s promoting something, and I respect it. I’m promoting Call Her Daddy. But I always say, ‘I know you are promoting this, but we’ve got to talk about your personal life.’ I tell them, ‘If [listeners] care about you, they’ll care more about your product.’ My audience holds me to a certain standard that I need to ask certain questions. How am I not going to ask Gwyneth Paltrow [who’s better in bed], Brad or Ben? This is a fun relationship and sex podcast. We’ve got to go there,” she revealed.\n\n “We’re trying to make women feel liberated. We want them to feel like they’re respected, and seen and heard. … I’m just getting started,” Cooper says in the official trailer. Watch it below and keep reading for more details on when to stream Call Her Alex online, including for free.\n\n How to Stream Call Her Alex Online: Premiere Date, Episodes, Watch for Free \n\n Call Her Alex premieres exclusively on Hulu on June 10. The documentary spans two episodes, both dropping simultaneously on the streaming service.\n\n Eligible subscribers can stream Call Her Alex online for free with a 30-day trial to Hulu‘s ad-supported plan, which auto-renews at $9.99 per month. Hulu also offers an ad-free plan for $18.99 monthly, but without a free trial.\n\n One of the best deals on Hulu is through the Disney Duo bundle that includes Disney+ and Hulu starting at $10.99 per month, or a 40 percent savings compared to individual subscriptions. Learn more about Hulu and Disney+’s bundle options here.\n\n Can You Watch Call Her Alex on Cable TV? \n\n The short answer is no, you cannot watch Call Her Alex on traditional cable. The only way to access Alex Cooper’s documentary is by streaming it on Hulu with a subscription.","summary":"After premiering at Tribeca on Sunday, the 'Call Her Daddy' podcast host gives the Daddygang a glimpse behind the microphone.","url":"https://www.hollywoodreporter.com/tv/tv-news/watch-stream-alex-cooper-call-her-alex-documentary-online-free-1236260368/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/06/alex-cooper-call-her-alex-hulu-PUBLICITY-177550_0018-MAIN-2025.jpg","video":null,"publish_date":"2025-06-09 21:32:28","author":"Danielle Directo-Meston","authors":["Danielle Directo-Meston"],"language":"en","source_country":"us","sentiment":0.563},{"id":329732144,"title":"ABC News’s ‘activism’ could continue until leadership changes: Joe Concha","text":"“And here’s the thing: Until leadership changes at ABC News, this could continue to go on because the person who runs ABC News, Sandra, her name is Dana Walden,” Concha explained on Fox News’s America Reports. “She has contributed to Kamala Harris’s campaigns in the past, she has hosted parties for Kamala Harris at her house, and she’s running the news division when, clearly, she is a Democrat.”\n\nConcha also pointed to the presidential debate that ABC News hosted in September 2024, in which President Donald Trump was asked five follow-up questions and given six fact-checks, whereas former Vice President Kamala Harris, the Democratic presidential candidate, did not receive either. Nine months later, Moran’s comments against Miller mark “Exhibit A” in why trust in the media is so low, Concha said.\n\nMoran has been suspended in the wake of his viral X post, with ABC News issuing a statement claiming the network stands for “objectivity and impartiality.” Concha, however, pointed to data indicating that 92% of Trump administration coverage from ABC News, CNN, and CBS News has been negative, despite Trump’s net-positive favorability among the public.\n\n2026 CALIFORNIA CANDIDATES TAKE SIDES IN TRUMP-NEWSOM FEUD OVER LA RIOTS\n\nTrump’s administration has taken multiple steps to change its press access since he returned to the White House, including inviting podcast hosts to these briefings. Concha predicted that more changes will come, suggesting that more reporters with different viewpoints are “always a good thing.”\n\nIn December 2024, ABC News reached a $15 million settlement with Trump to drop his defamation suit. Trump filed the suit after anchor George Stephanopoulos claimed in an interview with Rep. Nancy Mace (R-SC) that the president had been found liable for rape, rather than sexual abuse.","summary":"Washington Examiner columnist Joe Concha condemned ABC News’s “activism” against the Trump administration but predicted that it will continue. ABC News received major backlash after senior national correspondent Terry Moran claimed in a deleted X post that White House deputy chief of staff Stephen Miller is “a man who is richly endowed with the capacity [&#8230;]","url":"https://www.washingtonexaminer.com/news/3435803/abc-news-activism-continue-joe-concha/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/Stephen-Miller-vs-Terry-Moran-scaled-1024x683.webp","video":null,"publish_date":"2025-06-09 21:32:13","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","source_country":"US","sentiment":-0.375},{"id":329728574,"title":"Gavin Newsom’s ‘Reckless’ Surrender of LA to Foreign National Riots","text":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see more of his videos.\n\nHello, this is Victor Davis Hanson for The Daily Signal. This weekend we saw rioting in Los Angeles against Immigration and Customs Enforcement for its efforts to apprehend illegal aliens and employers who were hiring illegal aliens. \n\nAnd the riots started out initially without very many numbers but then they turned violent. And by violence, I would define that as throwing rocks at cars, torching cars, defacing government buildings, and attacking law enforcement.\n\nBut here’s what’s interesting. The mayor, Karen Bass, came down, in her public comments, on the side of the protesters who were protesting the idea of deportation at all. Kind of like former Vice President Kamala Harris used to march against deportation. \n\nAnd California Gov. Gavin Newsom then gave a series of editorializations that I think have ruined his chances ever to be a serious national candidate. He said this was “chaotic,” this was “reckless.” And he said that they were just trying to have “an arbitrary” deportation “quota.”\n\nGavin, 12 million people came into the country illegally. That was 3 million a year. That was 250,000 per month. That was over 8,000 a day. They have not been able to deport more than a thousand on most days—sometimes 500. They would have to deport 8,000 people every single day for four years to get back where we were with 20 million illegal aliens when President Joe Biden entered office. So, it’s not a quota, it’s an effort to stop an invasion.\n\nAnd it’s a very funny invasion because now Gavin is mad that they nationalized the California guard. President Donald Trump has that ability. And people said, “No. No president—they have to request it.” No, they don’t. You think that JFK said to George Wallace, when he nationalized the Alabama National Guard, said, “Would you please let us nationalize your guard so you can be removed from stopping African American people going to the University of Alabama?” No.\n\nSo, what I’m getting at is, on one side of these violent acts, you have these protesters. And I’ll just give a word of advice. You’re going to lose the optics—Democrats, the Left, and immigration protesters—if you have a lot of people here illegally and they’re waving, not the American flag, but the Mexican flag, as they’re committing acts of violence. \n\nThink of the logic: “I am waving the flag of the country under no circumstances I want to return, but I am attacking the officers and the infrastructure of the country that under every circumstance I want to stay in.”\n\nThat might explain why, in the midst of all of this negative publicity, a CBS poll taken to show that people were outraged showed that just the opposite: 54% of the American people are for continued deportations. \n\nSo, you know what is really “reckless,” Gavin? You know what is “chaotic?” It’s you. You. You. You. You did not intervene to stop the violence.\n\nDonald Trump does not want to see a May, June, July, August, September 2020 $2 billion in property damage, 35 people killed, 1,500 officers assaulted, $14,000 in arrests, precinct burned, courthouse burned, historic church burned. He doesn’t want to see that. \n\nAnd you’re egging this on. And you think it’s going to be peaceful when people throw rocks at cars, innocent bystanders and people wave the flag as they burn things—the Mexican flag of a foreign country. You are undermining your own argument.\n\nAnd what is your argument? I don’t know what it is. What is your argument, Karen Bass, the mayor—now that you’re not in Ghana and you’re here in the United States during a burning? Is it burning is OK, whether it’s burning a car or burning a whole neighborhood down? And you don’t act. \n\nIt was pathetic, the chief of police of Los Angeles, I felt like it was some Soviet apparatchik, he was saying, ”There is no violence. We are very proud of First Amendment.” And it’s like, I was given a text that my job is in danger, probably, if I say the truth because meanwhile, the LA County sheriff was saying, “We’re going to warn you that we will stop this. And we will make arrests. And we will use tear gas.”\n\nAnd apparently, they saw a different riot. And they were more in charge of that area of the rioting than the Los Angeles Police Department. \n\nBut I guess Mayor Bass—they’re scared, the LA police chief and the police hierarchy. Because they see that when the fire chief objected to Mayor Bass being on—I don’t know—a junket, or the deputy mayor being arrested for phoning in a bomb threat, or the water and power director leaving a reservoir that was critical to the survival of Pacific Palisades empty and unattended for months and fire hydrants not working and she voiced—they fired her.\n\nSo, I guess this police chief says, “If I tell the truth that these people are violent and they are assaulting officers and the mayor is doing nothing and the governor is doing nothing, I will be fired. So, I will lie and say it’s mostly—I am really impressed by the restraint of the protesters.”\n\nFinal bottom line: If you take an oath to enforce the laws of your state or the country and you see people swarming detention centers, swarming the streets, obstructing traffic, burning cars, trying to injure people with rocks, and you do nothing, then you are forsaking your oath of office. \n\nAnd secondly: Mayor Bass, Gov. Newsom, would you please tell us what is your position on 12 million people who entered the United States illegally, who are residing illegally at a time when the country is running a $2 trillion deficit and your state, at one point, recently owed $75 billion that it did not have?\n\nWhat is your solution? Is it to let one more million in? Three more million in? Five more million in? What is it? What is your solution to find the 300,000 to 500,000 people believed to have criminal records? Just tell us, what is your solution? \n\nWhat is your solution when you have, apparently, violent protesters waving the flag of a foreign national country as a way of persuading us that we should not deport them when they are burning things and committing violence about the country they want to stay in but waving the flag of the country they do not want to return to? \n\nWhat is the position of the Mexican government? Because I can tell you that there is a bill right now—the big, beautiful bill—that will tax remittances, the $63 billion. \n\nAnd all this is going to do is give rise to voices who will say, “I think we need a higher percentage to tax these remittances because they’re not getting the message. The people who are demonstrating and violent apparently think that we are going to subsidize them with social services, to free up money so they can send to Mexico, on tax, $63 billion—their greatest source of foreign exchange—while they run $170 billion trade surplus, while the cartels kill between 60,000 and 80,000 Americans.” That’s an unsustainable situation, as are these riots.\n\nBottom line: I think, Gavin Newsom, you took your recent effort to be moderate, centrist, your podcast, and you lit a fuse and you blew it up. Nobody in their right mind would ever vote for you for anything after you went into a volatile, dangerous situation and tried to pour gasoline on it by essentially saying you, the governor, will not do anything to restore order or quiet. And you sided with people committing violence against their fellow residents of Los Angeles.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\n\n\nThe post Gavin Newsom’s ‘Reckless’ Surrender of LA to Foreign National Riots appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/09/gavin-newsoms-reckless-surrender-of-la-to-foreign-national-riots/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/GettyImages-2210604626.jpg","video":null,"publish_date":"2025-06-09 21:25:39","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":-0.518},{"id":329729092,"title":"Newsom’s political future 'practically nonexistent' as LA devolves into riots, social media critics predict","text":"Democratic Gov. Gavin Newsom's floated potential run for the White House in 2028 was likely thwarted by his handling of the anti-ICE riots gripping Los Angeles, conservative social media critics predict. Newsom has been floated as a likely 2028 Democratic contender for the White House as he wraps up his second term as governor in 2026. Riots plaguing the city in response to the Trump administration's efforts to remove illegal immigrants residing in Los Angeles, which come on the heels of massive wildfires that rocked southern California this winter, have left Newsom on precarious political ground, according to conservatives who are balking at his response to the LA chaos. \"Gavin Newsom’s odds of clinching the 2028 presidential race are practically nonexistent,\" X user Angela Belcamino posted Monday. \"Across the country, Americans are eyeing California’s struggles under his watch, convinced he’d unleash the same chaos nationwide if he ever won the White House.\" \"Gavin Newsom’s handling of the LA riots should be considered an in-kind contribution to the @JDVance2028 presidential campaign. Newsom is providing a lot of ad material for free,\" one social media account posted on Sunday. JONATHAN TURLEY: DEMOCRATS' RABID ANTI-ICE RESISTANCE IN LA AGAINST TRUMP COULD BACKFIRE \"Notice how Newsom has no adverse commentary about the rioters – he saves all his venom for American authorities,\" author and retired Army Col. James Hutton posted to X Sunday. \"This is why he has no chance to be president one day. Most Americans tend to believe in this country.\" Many critics of the riots unfolding in Los Angeles argued that photos of the scene would live in infamy and dash any hopes Newsom may hold on running for president. Some users remarked that the photos depicting rioters surrounded by flames and smoke while waving a Mexican flag \"will cost Newsom his 2028 presidential run,\" and that the Trump administration \"couldn't have asked for better\" representation of California politics captured in photos. \"Gavin Newsom is refusing to help stop the riots AND denying their existence because he bows to open borders donors... hoping they'll fund his 2028 Presidential run. Do not forget this!,\" Club for Growth senior analyst Andrew Follett posted to X, accompanied by a photo showing a rioter with a Mexican flag on a motorbike as smoke billowed behind him. CALIFORNIA LT. GOVERNOR SAYS LOS ANGELES RIOTS ARE 'GENERATED BY DONALD TRUMP' \"Newsom 2028 off to a 🔥 start,\" editor-in-chief of the DC Report Matt Foldi posted, accompanied by a similar photo showing a rioter waving what appeared to be the Mexican flag as a fire raged in front of him. \"Gavin Newsom 2028,\" DC Draino, a popular conservative X account, posted accompanied by a photo of a pair of masked rioters standing on a destroyed car waving the Mexican flag. Newsom is viewed as a potential leader of the Democratic Party as it navigates its future following the disastrous 2024 election cycle that saw President Joe Biden exit the race just over 100 days from Election Day and former Vice President Kamala Harris fail to rally support against now-President Donald Trump. The Democratic governor has not yet said whether he would launch a presidential run in 2028. NY TIMES SAYS 'REAL EMERGENCY' IS TRUMP SENDING TROOPS TO LOS ANGELES Riots broke out in the left-wing city Friday evening after federal law enforcement officials converged on Los Angeles to carry out immigration raids as part of Trump's vow to deport illegal aliens who flooded the nation under the Biden administration. Local leaders such as Los Angeles Mayor Karen Bass and Newsom, however, quickly denounced the raids in public statements while offering words of support for illegal immigrants in the state. Protests over the raids soon devolved into violence as rioters targeted federal law enforcement officials, including launching rocks at officials, as well as videos showing people looting local stores, setting cars on fire and taking over a freeway. Trump announced Saturday that he was deploying 2,000 National Guard members to help quell the violence, bypassing the governor, who typically activates the National Guard and sparking Newsom to file a lawsuit against the Trump administration for efforts to allegedly \"federalize the California National Guard.\" Trump and Newsom have long sparred, stretching back to the first Trump administration, including when Newsom installed coronavirus restrictions in the state during the pandemic, such as mask and vaccine mandates and social distancing rules, as well as Trump slamming Newsom for California's spiraling crime rate as a national crime wave spiked in 2020. Trump also frequently refers to the California Democrat as \"Newscum\" as an ongoing jab at the governor. The pair, however, have most frequently and recently traded barbs over California's fire response, which came under fierce scrutiny in January when wildfires plagued the Los Angeles area and Trump pinned blame on Newsom. \"Governor Gavin Newscum refused to sign the water restoration declaration put before him that would have allowed millions of gallons of water, from excess rain and snow melt from the North, to flow daily into many parts of California, including the areas that are currently burning in a virtually apocalyptic way,\" Trump posted to Truth Social as the fires raged just weeks ahead of Trump's inauguration. NEWSOM'S OFFICE COMPARES LA RIOTS AGAINST FEDERAL AGENTS TO SPORTS CELEBRATIONS \"He wanted to protect an essentially worthless fish called a smelt, by giving it less water (it didn’t work!), but didn’t care about the people of California. Now the ultimate price is being paid. I will demand that this incompetent governor allow beautiful, clean, fresh water to FLOW INTO CALIFORNIA! He is the blame for this. On top of it all, no water for fire hydrants, not firefighting planes. A true disaster!\" Newsom's office shot back that \"there is no such document as the water restoration declaration – that is pure fiction. The Governor is focused on protecting people, not playing politics, and making sure firefighters have all the resources they need.\" Trump has a long history of putting Newsom’s handling of wildfires under the microscope across his first four years in the White House, including in January 2019 when he threatened to cut off federal funds to California if reforms were not made to the state’s forest management services. CALIFORNIA REPUBLICANS SLAM NEWSOM, BASS FOR LETTING LA BURN WITH RIOTS AMID TRUMP IMMIGRATION BLITZ \"Billions of dollars are sent to the State of California for Forest fires that, with proper Forest Management, would never happen,\" he posted to X that year. \"Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives & money!\" Newsom and other Democrats have historically pushed back that wildfires in the state are due to climate change and global warming. \"You don’t believe in climate change,\" Newsom shot back at Trump in 2019, for example, after the president slammed him for his wildfire leadership. \"You are excused from this conversation.\" LOS ANGELES WILDFIRES: CALIFORNIA GOV. NEWSOM SLAMMED FOR 'SIDESHOW' AS HE DEFENDS STATE'S RESPONSE The riots gripping LA following the massive Palisades wildfires in January stack the odds against a potential Newsom presidential run, other commenters argued on social media. \"Let's evaluate this, Gav. First... devastating fires due to you and your state's negligence. Second, riots... once again due to your love for illegals, sanctuary cities, etc. Your aspirations for 2028 have gone up in the flames you are responsible for,\" one social media commented posted to X on Monday. CLICK HERE TO GET THE FOX NEWS APP \"The LA fires and the LA riots have burned Newsom's chances of a successful presidential run to the ground,\" another X user posted.","summary":"Democratic Gov. Gavin Newsom&apos;s potential run for the White House in 2028 was likely thwarted by his handling of the anti-ICE riots gripping LA, conservative social media critics predict.","url":"https://www.foxnews.com/politics/newsoms-political-future-practically-nonexistent-la-devolves-riots-social-media-critics-predict","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/caliriot.png?ve=1&tl=1","video":null,"publish_date":"2025-06-09 21:09:19","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.043},{"id":329740848,"title":"Humiliation for Kamala Harris after 'fake' California governor dropout post drives 2028 rumors amid LA riots","text":"A new image of a statement from Vice President Kamala Harris announcing she would not run for governor of California was denounced by her team as a fake after it went viral on social media on Monday.\n\nThe image had a similar template as a statement Harris earlier used to condemn President Donald Trump’s decision to send in the National Guard to combat rioting protesters in California.\n\nBut the fake statement from Harris featured three separate typos as it purported to announce that she had decided not to enter the race for Governor of California. \n\nEric Katz, a Senior Correspondent for GovExec shared the post on X, noting it was sent to him by a source who said it would be made public shortly.\n\n‘Source sent it before it went public. Not usually what I cover but wanted to share. I expect it will be up soon,’ he wrote.\n\nBut Harris’ spokesperson Kristen Allen moved quickly to denounce the post as ‘fake’ after it started gaining traction.\n\nKatz later deleted his post, apologizing for posting what appeared to be a false statement\n\n‘I’ve deleted a previous tweet reposting something sent to me that now appears inauthentic. Apologies for sharing too quickly,’ he wrote.\n\nHarris remains unclear about her plans to run for governor in California, despite frustrations from her fellow Democrats who believe she needs to get in the race or officially rule out a run for office. \n\nThe former vice president joined many California Democrats on Sunday denouncing President Trump's decision to deploy the National Guard to Los Angeles to help quell violent protests in the city.\n\nShe was ridiculed for describing the protests as 'overwhelmingly peaceful,' even as protesters burned vehicles, threw rocks, and blocked freeways.\n\nHarris condemned Trump for his 'cruel, calculated agenda to spread panic and division' in the city.\n\nEarlier this month Harris further triggered speculation that she was not running for governor of California after she delivered a lackluster three-minute virtual address to the Democratic state political convention\n\nIn a steady, monotone voice, she spoke about the Trump administration's recent actions against universities and praised activists' efforts to fight the president's agenda.\n\n'While this administration in Washington tries to divide us, we hear know that we are stronger when we stand together,' she said, a flashback to her 2024 campaign slogan.\n\nHarris' failure to appear at the convention in person suggested she was not interested in running for governor of California, and instead may be pursuing a return to presidential politics. \n\nThe Democratic primary for the governor race is scheduled for June 2, 2026, with the general election scheduled for November.\n\nHarris has always been popular in California, easily beating Democratic challengers in her races for Attorney General and Senator.\n\nHer 2020 race for president, however, failed spectacularly as she ended her campaign before the Iowa caucuses and the California primary.\n\nSince her loss, Harris has vowed to 'stay in the fight' and organized some of her trusted aides into the organization Pioneer49, while she explores her political future.\n\nIf Harris runs for governor, she will likely forego another run for president in 2028, which Democratic strategists in Washington, DC fully expect her to explore.\n\nShe continues to delay any decisions about running for governor or diving into presidential politics again, telling advisors she will made a decision in late summer. \n\nA third option remains, that she will forego a political career entirely and remain a paid speaker and inspirational figure for activists with the option of publishing a book of her memoirs. \n\nIn the meantime, Harris continues to take the stage to protest the Trump administration and rally activists. \n\nLast week, she appeared at an event in Australia where she shared a bizarre story about her mother and spiraled into word salads when asked to speak about the importance of humility. \n\nHarris also appeared at the lavish Met Gala last month wearing a custom look from Off-White, designed by creative director IB Kamara, but skipped the red carpet. \n\nThe failed presidential candidate also took the stage at the Emerge 20th anniversary gala at the Palace Hotel in San Francisco to deliver the keynote speech that began late in the evening. \n\n'It's good to be home!' Harris laughed as she took the stage, criticizing Trump for his agenda, particularly his tariffs.\n\n'Instead of the administration working to advance America's highest ideals, we are witnessing a wholesale abandonment of those ideals,' she said.","summary":"A new image of a statement from Vice President Kamala Harris announcing she would not run for governor of California was denounced by her team as a fake.","url":"https://www.dailymail.co.uk/news/article-14795713/kamala-harris-california-governor-2028.html","image":"https://i.dailymail.co.uk/1s/2025/06/09/21/99166267-0-image-a-37_1749501291664.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/09/5353412079138026532/1024x576_MP4_5353412079138026532.mp4","publish_date":"2025-06-09 21:02:34","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.193},{"id":329723976,"title":"Republicans focus on trans athletes in their early attacks against Jon Ossoff in Georgia","text":"Republicans seeking to unseat Georgia Sen. Jon Ossoff in one of the key races of the 2026 midterm elections are leaning heavily into attacks over transgender athletes in women’s sports in the early stages of the campaign. In recent weeks, two GOP-aligned outside groups have launched ads on the issue. And GOP Rep. Buddy Carter hit the airwaves with an ad prodding Ossoff on the issue soon after launching his campaign. Republican candidates and campaigns have frequently leaned on culture war issues in recent years as a way to excite the base and frame Democrats as out of touch, particularly in red-leaning states. And they’re even more emboldened after President Donald Trump bombarded then-Vice President Kamala Harris with an onslaught of ads that attacked her support for transgender people during the 2024 election. But while Democrats are gearing up for a difficult re-election fight for Ossoff in a state Trump won narrowly in 2024, they think the issue will be drowned out by voters’ concerns about the economy, particularly Trump’s handling of it. Even so, it's an issue for which Democrats lack a consensus about how to respond to GOP broadsides, as prominent members of the party grapple with whether to embrace protecting the transgender community as part of their values, deflect the question or come out against including transgender athletes in women's sports. Ossoff is the only Democratic incumbent defending a seat in a state Trump won last year, making him far-and-away the top target for Senate Republicans. Still, some Republicans admit that Ossoff will be difficult to beat, particularly now that Gov. Brian Kemp decided not to seek the seat. The early Republican criticism of Ossoff points to the Democratic senator's vote on legislation in February that would make it a Title IX violation (jeopardizing federal education funding) for states to allow transgender women and girls to participate in female sports. The bill failed to get the 60 votes it needed to advance in the Senate. One Nation, the nonprofit aligned with Senate Republicans' main super PAC, has spent at least $400,000 airing an ad reminiscent of a key tagline from one of Trump’s anti-Harris ads from last year: “Man to man defense isn’t woke enough for Ossoff, he’s playing for they/them.” Carter’s opening salvo of ads included a spot touting the congressman’s MAGA credentials while a person purporting to be a transgender woman holds sports trophies and stands in front of a transgender pride flag talking about how Ossoff has been an ally to the community. Asked about the GOP criticism of that vote, Ossoff campaign communications director Ellie Dougherty told NBC News in a statement that “American parents don’t need federal bureaucrats confirming our children’s genitalia,” a reference to how a state might enforce the mandate in the Republican bill. Scott Paradise, who managed Republican Herschel Walker’s losing Senate campaign in 2022, told NBC News that Ossoff’s first Senate run in 2020 provided a “perfect storm” that allowed Ossoff to position himself as a “centrist” by narrowing his focus to “bread-and-butter issues.” “If he’s talking about the economy or he’s talking about moments where he has stood with the right — whether it's Middle East, to the extent he has on immigration — it’s easier for him to muddy the waters. But this is such a black and white issue in a center-right state” that allows Republicans to try to frame him as out of step, he said. Polling broadly shows the American public doesn’t support transgender women playing in female sports. Last month’s NBC News Stay Tuned Poll, powered by SurveyMonkey found 75% opposed it and 25% supported it. Other national polling has found similar trends. That’s one reason why Trump’s campaign focused heavily on the issue in ads, arguing that Harris was outside the mainstream and pointing to her past support for gender-affirming treatments for prison inmates. After the election, Democrats have disagreed over whether the party’s position on transgender rights, particularly in women’s sports cost them electorally. Asked about the attacks last month during an interview on \"Political Breakfast,\" a podcast hosted by Georgia's public radio affiliate, Ossoff said the big early spending is a signal to him that \"demonstrates the national GOP understands the strength that I'll be bringing to this re-election campaign.\" The Democrat called Republicans, particularly GOP political consultants, \"obsessed and preoccupied with this issue.\" Thinking ahead about \"top of mind\" issues for voters in 2026, Ossoff added, will it be \"whether or not federal bureaucrats are investigating the sexual biology of adolescent athletes? I don’t think so,\" he added. Amy Morton, a Democratic strategist in Georgia, elaborated that she believes the midterms will instead be a \"referendum on the economy\" and Trump's handling of it, emphasizing the Democratic attacks on the GOP's broad policy bill that's working its way through Congress. \"They're going to continue to lean into that issue because they don't want to talk about the issues that are really impacting Georgians,\" she said, adding, \"They made a strategic decision to wrap their arms around Donald Trump so there won't be a degree of separation between his failure as an executive and their failure.\" A Democratic strategist who worked on Sen. Raphael Warnock's successful re-election in Georgia in 2022 added that like their former boss, Ossoff's high-profile elections have helped to define him in the state, making them skeptical that a GOP attempt to brand him as extreme will stick. They added that while Warnock's 2022 Republican opponent, Herschel Walker, leaned heavily on social issues during his unsuccessful bid, Kemp won comfortably with a very different message on the same ballot, showing how a campaign can focus on the issues it wants and leave others to the side. \"You saw Brian Kemp run an extremely disciplined race on the economy. You were hard pressed to get Kemp on the record about abortion in 2022 — the man was laser-focused on small businesses, jobs and the economy. That was the consistent message you heard out of Brian Kemp. You compare that to Herschel Walker and, you can do the math: 300,000 votes,\" the Democrat said. But the economy was also a top issue in the 2024 election, and Trump and the Republican Party still managed to turn their attacks on trans issues into a memorable tagline that stuck with some voters. That's why one national Republican strategist told NBC News that the attack isn't a \"replacement\" for a cogent economic argument, but \"part of the equation. “It’s an issue that obviously had a massive impact in 2024. The Trump campaign’s ‘Harris is for they/them’ ad is one of the greatest ads of our generation in that it’s so simple and was so effective,” the strategist said. Ads about transgender participants in women's sports can run \"on top of: Oh, he also voted to help ensure that illegal immigrants get government-paid health care and he voted against the Laken Riley amendment in 2024 before it was convenient,\" the strategist added. While the transgender sports attacks are drawing headlines, both sides have been running ads focused on spending in Washington too. Democrats have attacked the GOP’s policy bill working its way through Washington, and Republicans hit Ossoff for backing former President Joe Biden’s signature spending bill in 2022. Tharon Johnson, a Georgia Democratic strategist who worked for Biden's 2020 campaign in Georgia agreed that Republicans are \"going to be hard-pressed to make Jon Ossoff into this radical\" in part because of his work both in office and on the campaign trail. And while he believes the situation Harris found herself in last year isn't the same one Ossoff finds himself in now, he said Democrats can still draw a lesson from it: \"Respond sooner, and more effectively.\" So far, Ossoff's response has been to stay focused on the economy and try to frame the debate as about local control.","summary":"Republicans seeking to unseat Georgia Sen.","url":"https://www.nbcnews.com/politics/2026-election/republicans-focus-trans-athletes-early-attacks-jon-ossoff-georgia-rcna211005","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-06/250605-jon-ossoff-vl-957a-1bab02.jpg","video":null,"publish_date":"2025-06-09 20:54:46","author":"Ben Kamisar","authors":["Ben Kamisar"],"language":"en","category":"politics","source_country":"us","sentiment":-0.072},{"id":329726682,"title":"Naveen Chopra Exits as Paramount Global CFO","text":"Paramount Global CFO Naveen Chopra is exiting the company “to pursue other opportunities.” Andrew Warren, currently a strategic advisor to Paramount’s three-headed Office of the CEO and a former CFO at Discovery Communications, will step in on an interim basis.\n\n Warren will be executive vice president and interim chief financial officer. He’s been around to advise George Cheeks, Chris McCarthy and Brian Robbins on CEO matters.“We thank Naveen for his leadership role during a dynamic period of transformation and growth,” Cheeks, McCarthy and Robbins, the co-CEOs, said in a joint statement. “We are excited to partner with Andy, who has been our strategic advisor, in his new, expanded role as interim CFO and we are confident that his deep financial expertise and familiarity with our business make him exceptionally well-suited to step into this position.”\n\n Warren has also served as CFO of STX Entertainment and the NBCU Television Group.\n\n One by one, top Paramount Global executives are going down, making way for David Ellison and his Skydance to take over and set up his own leadership team. Cheeks, McCarthy and Robbins together replaced Bob Bakish, the company’s former president and CEO; Jeff Shell, the former NBCUniversal CEO, will be president of Skydance Paramount when it becomes official.\n\n Lately, the most high-profile exits from Paramount Global have been from within its news division. Shortly after longtime 60 Minutes executive producer Bill Owens bailed over the company’s interference in the newsmagazine show’s coverage of President Trump’s administration, Owens’ boss, Wendy McMahon, followed suit.\n\n Owens said at the time that he was no longer able to make “independent decisions.” \n\n “It’s become clear that the company and I do not agree on the path forward,” McMahon said in a memo to staff last month. ”It’s time for me to move on and for this organization to move forward with new leadership. I have spent the last few months shoring up our businesses and making sure the right leaders are in place; and I have no doubt they will continue to set the standard.”\n\n Trump had sued CBS News over a 60 Minutes interview with his 2024 opponent Kamala Harris. Shari Redstone, who owns the company that runs Paramount Global, has been attempting to settle the issue before it potentially ruins the sale of her controlling stake to Ellison; the deal is still pending approval from the Federal Communications Commission. Redstone recently revealed a thyroid cancer diagnosis.","summary":"Andrew Warren, a former Discovery CFO, is stepping in on an interim basis.","url":"https://www.hollywoodreporter.com/business/business-news/naveen-chopra-exits-paramount-cfo-1236260422/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/06/GettyImages-1247973666.jpg","video":null,"publish_date":"2025-06-09 20:42:17","author":"Anthony Maglio,Tony Maglio","authors":["Anthony Maglio","Tony Maglio"],"language":"en","source_country":"US","sentiment":-0.047},{"id":329728576,"title":"DEEP STATE ACTOR? Former Schiff Committee Staffer Took ‘Career’ Role in Federal Bureaucracy","text":"A former FBI analyst who spent two years advising then-Rep. Adam Schiff while Schiff pushed the Trump-Russia narrative and led the first Trump impeachment subsequently “burrowed in” to the federal bureaucracy. \n\nWhile presidents appoint more than 3,000 people for political positions, the federal government directly employs roughly 2.3 million people, most of whom serve in ostensibly nonpolitical, career positions. The Office of Personnel Management tracks when political appointees transition to career positions—a process often referred to as “burrowing in” to the bureaucracy—and Lucian Sikorskyj did so last September.\n\nSikorskyj moved from principal deputy assistant secretary for counterterrorism at the Department of Homeland Security to associate administrator for materials and safety at the Federal Aviation Administration on Sept. 8, 2024, according to OPM records. He received a pay bump from $180,000 to $214,500.\n\nAccording to his LinkedIn profile, Sikorskyj remains at the FAA. (He has verified his LinkedIn profile by proving his identity via government identification.) The FAA has not responded to The Daily Signal’s requests for comment to confirm whether he remains at the agency.\n\nAfter 9 years at the FBI, Sikorskyj joined the National Security Council in June 2016 under President Barack Obama, where he stayed until October 2017. After working at NATO in Brussels, Belgium, and serving eight months in the office of the director of national intelligence, he joined the House Permanent Select Committee on Intelligence in February 2019. The FBI and the ODNI declined to comment on Sikorskyj’s work history.\n\nAccording to his LinkedIn profile, Sikorskyj served as subcommittee staff director at the committee, working as “a senior advisor to the chair of the committee and nearly 15 members of U.S. Congress.” The profile also states that he “supported the speaker of the House of Representatives and their national security advisor.”\n\nHe also “led, co-led, or played a key role in major and complex congressional investigations, hearings, reports, and congressional delegations at home and abroad.”\n\nIn July 2021, he joined the Department of Homeland Security, where he stayed until May 2023, when he joined the White House National Security Council, according to LinkedIn.\n\nSikorskyj’s profile states that he “serves as a senior leader of the FAA and its chief intelligence and security officer,” directly reporting to the head of the FAA. He “leads 800+ person staff, including 7 executives, with 7 offices, 25+ teams, and a 125+ million-dollar budget with contracts and grants.”\n\nSchiff’s Controversies\n\nWhile Sikorskyj’s LinkedIn profile demonstrates a long career in counterterrorism, his stint serving on the House Intelligence Committee under Schiff may raise bias concerns, especially as Sikorskyj appears to still work in the second Trump administration.\n\nIn February 2019, as Sikorskyj was joining Schiff’s committee, Schiff told CNN, “You can see evidence in plain sight on the issue of collusion” between Trump and Russia.\n\nThe Wall Street Journal Editorial Board cited congressional testimony revealing that “Adam Schiff spread falsehoods shamelessly about Russia and Donald Trump for three years even as his own committee gathered contrary evidence.” The board cited former Director of National Intelligence James Clapper, who told Schiff and his colleagues, “I never saw any direct empirical evidence that the Trump campaign or someone in it was plotting/conspiring with the Russians to meddle with the election.”\n\nThe House of Representatives censured Schiff on June 21, 2023, by a vote of 213 to 209. The censure resolution noted that Schiff, as head of the Intelligence Committee, held “positions of extreme trust, affording him access to sensitive intelligence unavailable to most Members of Congress.” The resolution faulted him for having “abused this trust by alleging he had evidence of collusion that, as is clear from reports by Special Counsel Robert Mueller, Department of Justice Inspector General Michael Horowitz, and Special Counsel John Durham, never existed.”\n\nAt the time, Schiff said he would bear the censure as a “badge of honor,” accusing the Republicans of doing then-former President Trump’s bidding and stating that he “will not yield.”\n\nIn addition to the Trump-Russia saga, Schiff’s Intelligence Committee led the first impeachment of then-President Donald Trump over a July 2019 phone call with Ukrainian President Volodymyr Zelenskyy. \n\nSchiff, now a U.S. senator from California, did not respond to The Daily Signal’s request for comment. \n\nDeep State Opposition\n\nA recent poll found that a whopping 75% of Washington, D.C.-based federal employees making $75,000 or more per year who voted for Democrat presidential nominee Kamala Harris in November said they would not follow a lawful Trump order if they considered it bad policy.\n\nWhile some political appointees who took “career” positions may faithfully work for the U.S. government under any president, this poll suggests that some staff inside the federal government may work against the goals of the current president, in this case Donald Trump.\n\nFurthermore, a recent Foundation for Government Accountability study found that Democrat employees outnumber Republican employees by a 2-to-1 margin across federal agencies. In the 2024 presidential election, 84% of the money that federal employees gave in political contributions went to Harris.\n\nWhile the office of the director of national intelligence declined to comment on Sikorskyj’s history, the office did highlight recent remarks from Director of National Intelligence Tulsi Gabbard. \n\n“We have a long history, unfortunately, of politicization of the Intelligence Community and manipulation of the intelligence to meet some kind of political objective, to undermine the president that has been elected by the American people by those who simply disagree with his views,” she said.\n\nAn aide for the House Intelligence Committee, now chaired by Rep. Rick Crawford, R-Ark., expressed concerns about former Intelligence Community staff acting as deep state operatives under the Trump administration.\n\n“The committee does share the concerns about federal employees, particularly ones in the Intelligence Community, who cannot separate their politics from their jobs,” the aide told The Daily Signal. \n\nA spokesperson for the committee’s Democrat minority also addressed the issue.\n\n“Lucian Sikorskyj’s work on the Intelligence Committee focused on the bipartisan oversight of the Intelligence Community, particularly counterterrorism,” the Democrat spokesperson told The Daily Signal. “He has more than 20 years of experience as a civil servant under both Democratic and Republican administrations, and his expertise as a member of the committee staff was valued by all members.”","summary":"A former FBI analyst who spent two years advising then-Rep. Adam Schiff while Schiff pushed the Trump-Russia narrative and led the first Trump impeachment subsequently... Read More\n\n\nThe post DEEP STATE ACTOR? Former Schiff Committee Staffer Took &#8216;Career&#8217; Role in Federal Bureaucracy appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/09/deep-state-actor-former-schiff-committee-staffer-took-career-role-federal-bureaucracy/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/Adam-Schiff.jpg","video":null,"publish_date":"2025-06-09 20:41:53","author":"Tyler O,Tyler O'Neil","authors":["Tyler O","Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":-0.121},{"id":329721994,"title":"Paramount Chief Financial Officer Naveen Chopra to Exit","text":"Paramount Global’s chief financial officer Naveen Chopra is exiting the media giant to pursue other opportunities, the media giant revealed in an 8-K filing with the U.S. Securities and Exchange Commission on Monday. \n\nThe executive will be replaced in the interim by Andrew Warren, who currently serves as strategic advisor to the Office of the CEO and is the former CFO of Discovery Communications.\n\n“We thank Naveen for his leadership role during a dynamic period of transformation and growth,” Paramount co-CEOs George Cheeks, Chris McCarthy and Brian Robbins said in a statement. “We are excited to partner with Andy, who has been our strategic advisor, in his new, expanded role as interim CFO and we are confident that his deep financial expertise and familiarity with our business make him exceptionally well-suited to step into this position.”\n\nAs CFO, Chopra oversaw Paramount’s financial operations, including treasury, tax, accounting, investor relations, information security and real estate, as well as global corporate development and strategy.\n\nPrior to joining ViacomCBS, he served as the CFO of Amazon’s devices and services business, overseeing Alexa and Echo, FireTV, Ring, Kindle and the Amazon app store. Before Amazon, he was CFO of Pandora Media, where he ran finance, corporate development, music licensing, business development, investor relations, real estate, and chief information officer functions. During his tenure, he led a major corporate turn-around, which led to the company’s acquisition by SiriusXM for $3.5 billion.\n\nHe also served in a variety of roles at TiVo, including interim CEO, CFO, and head of corporate and business development, helping to guide the company through multiple phases of growth and transformation leading to Rovi’s acquisition of the company, as well as business development roles at Microsoft and Hewlett Packard and early-stage venture-backed companies including WebTV, Ofoto, and Rearden Steel.\n\nFrom 2014 to 2020, Chopra also served as a board member at Vonage Holdings, a multi-billion-dollar cloud-communications company. He is currently a member of the board of KQED, one of the nation’s largest public media organizations.\n\nWarren, who joined Paramount in 2024, previously served as chief financial officer of STX Entertainment from 2017 to 2023. Before that, he was senior executive vice president and chief financial officer of Discovery Communications from 2012 to 2017. He also previously served as CFO of Liz Claiborne as well as NBCU Television Group.\n\nChopra’s departure comes as Paramount continues to await regulatory approval of its pending $8 billion merger with Skydance Media and fends off a $20 billion lawsuit against CBS from President Donald Trump over an Oct. 7 “6o Minutes” interview with former vice president Kamala Harris. \n\nMore to come…","summary":"He will be replaced in the interim by former Discovery Communications CFO Andrew Warren\n\n\nThe post Paramount Chief Financial Officer Naveen Chopra to Exit appeared first on TheWrap.","url":"https://www.thewrap.com/paramount-chief-financial-officer-naveen-chopra-exit/","image":"https://www.thewrap.com/wp-content/uploads/2023/06/Naveen-Chopra.jpg","video":null,"publish_date":"2025-06-09 20:41:50","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","source_country":"US","sentiment":0.162},{"id":329709582,"title":"Dems walk back pro-cop, law and order rhetoric from J6 era in the face of spiraling immigration riots","text":"Elected Democrats from coast to coast championed law and order and embraced law enforcement in the wake of the Jan. 6 protest at the U.S. Capitol in 2021, but have seemingly walked back such rhetoric in the face of federal law enforcement officials carrying out immigration raids in Los Angeles that have spiraled into riots. Democrats have increasingly condemned the immigration raids that began Friday in Los Angeles, claiming they were \"illegal\" and revealed alleged evidence of President Donald Trump's \"authoritarianism,\" while attempting to characterize the riots as a result of the administration's alleged overreach. \"Inciting and provoking violence; Creating mass chaos; Militarizing cities; Arresting opponents,\" Democratic California Gov. Gavin Newsom said on X Sunday. \"These are the acts of a dictator, not a President.\" CALIFORNIA REPUBLICANS SLAM NEWSOM, BASS FOR LETTING LA BURN WITH RIOTS AMID TRUMP IMMIGRATION BLITZ \"Deploying federalized troops on the heels of these raids is a chaotic escalation,\" Democratic Los Angeles Mayor Karen Bass posted to X Sunday. \"The fear people are feeling in our city right now is very real – it’s felt in our communities and within our families and it puts our neighborhoods at risk. This is the last thing that our city needs, and I urge protesters to remain peaceful. I’ve been in touch this morning with immigrant rights leaders as well as local law enforcement officials. Los Angeles will always stand with everyone who calls our city home.\" Federal law enforcement officials converged on the city Friday, with both Newsom and Bass issuing statements shortly thereafter denouncing the raids, which are part of Trump's campaign vow to remove the millions of illegal immigrants who flooded the nation under the Biden administration. 'LUNATIC' DEMOCRAT RIPPED FOR 'DEMONIC' VIDEO MESSAGE DEMANDING ICE AGENTS 'GET THE F--- OUT' AMID CA CHAOS Newsom, Bass and other local elected Democrats quickly sounded off that they did not support the raids, while offering words of support to illegal immigrants who reside in Los Angeles. \"As Mayor of a proud city of immigrants, who contribute to our city in so many ways, I am deeply angered by what has taken place,\" Bass, for example, said Friday. \"These tactics sow terror in our communities and disrupt basic principles of safety in our city. My office is in close coordination with immigrant rights community organizations. We will not stand for this.\" Protests against the raids soon devolved into violence over the weekend, as rioters targeted federal officials with rocks and other projectiles, set cars on fire, looted stores and took over 101 Freeway Sunday. Trump said Saturday that he was authorizing the deployment of 2,000 National Guard members to Southern California to help quell the violence as it spiraled, bypassing the governor who typically activates the National Guard during state emergencies. The White House has defended calling in the National Guard to restore law and order, after Democrats reportedly failed to control the increasingly violent protests and the LAPD declared an unlawful assembly in the city. Dozens of violent protesters have been arrested since Friday, according to local police. FEDERAL OFFICIALS SLAM DEMOCRATS FOR 'DANGEROUS' RHETORIC AS ICE AGENTS FACE VIOLENT MOBS IN LA, NYC \"Gavin Newsom did nothing as violent riots erupted in Los Angeles for days,\" White House press secretary Karoline Leavitt posted to X Monday. \"Federal law enforcement officers were attacked by violent radicals and illegal criminals waving foreign flags because Governor Newsom was too weak to protect the city. The Los Angeles Police Chief has even said the riots were getting out of hand. President Trump has stepped in to maintain law and order and protect federal buildings.\" As the riots raged, a handful of elected Democrats, as well as Independent Vermont Sen. Bernie Sanders, have condemned the raids and federal officials cracking down on the protests, which stand in stark contrast to messages they issued in the 2021 era after Trump supporters breached the U.S. Capitol on Jan. 6 following the 2020 election. Democrats have long argued the Jan. 6 protest was a violent insurrection that trampled on the U.S. Constitution and threatened democracy when an estimated 2,000 people breached the Capitol building that day. CALIFORNIA LT. GOVERNOR SAYS LOS ANGELES RIOTS ARE 'GENERATED BY DONALD TRUMP' \"ICE get the f--- out of LA so that order can be restored,\" Democratic California Rep. Norma Torres posted in a video on TikTok Friday of the raids, which received widespread backlash among conservative critics. But when addressing the Jan. 6 protest, Torres invoked the Constitution, celebrated law enforcement and disavowed the \"chaos\" seen at the Capitol in 2021. \"The American people deserve leaders who will uphold the Constitution and protect our democracy from those who seek to destroy it,\" Torres said in a statement in January criticizing Trump’s pardons of the vast majority of those charged in connection to the protest at the Capitol. \"I call on my colleagues, regardless of party affiliation, to condemn this reckless abuse of power and to recommit ourselves to the principles of justice and accountability.\" \"I remember the sound of the mob banging on doors, the bravery of law enforcement officers who risked their lives to protect us, and the sense of betrayal as our sacred democratic institutions were desecrated,\" she added. When asked about the disparity in comments, Torres said she has \"always supported our local law enforcement – whether it be in Los Angeles or Washington, D.C.,\" adding that the ICE raids is \"entirely different.' \"LAPD is trained to handle this situation and have the resources to do so,\" Torres told Fox News Digital on Monday. \"What ICE is doing in California is entirely different – we’re witnessing ICE ignore federal law, people going missing, families being separated, and even American citizens being mistakenly detained. I do not support violent conduct, but I believe the Los Angeles Police Department can restore calm, and prosecute any violent offenders as needed. Bringing in the National Guard will only escalate tensions by introducing a weaponized military presence into the city.\" While Sanders joined CNN Sunday and slammed Trump for moving the country toward \"authoritarianism\" after activating the National Guard as rioters targeted federal law enforcement officials. Sanders, however, also took Trump to task in January for allegedly giving a \"free pass to rioters who attacked the police\" Jan. 6 at the Capitol. \"We have a president who is moving this country rapidly into authoritarianism,\" Sanders said Sunday. \"My understanding is that the governor of California, the mayor of the city of Los Angeles did not request the National Guard, but he thinks he has a right to do anything he wants.\" SOCIAL MEDIA, TRUMP ADMIN ERUPTS OVER LA MAYOR'S REACTION TO ICE RAIDS: 'YOU'RE A CRIMINAL TOO' Sanders repeatedly condemned the Jan. 6 protest in 2021 and in subsequent years, including earlier in 2025 when Trump pardoned the vast majority of Americans charged in the protest. Sanders lauded police officers who were working at the Capitol on the day of the protest, while slamming Trump as trampling democracy. \"President Trump: You do not stand for law and order when you give a free pass to rioters who attacked the police,\" Sanders posted Jan. 21. \"In fact, you are signaling that violence is okay and attacking law enforcement is acceptable behavior.\" \"As someone who was on the Hill that day, I'm grateful to the officers who put their lives on the line to defend myself and my colleagues,\" Sanders continued. \"It's outrageous that the President would betray officers who defended our democracy by absolving violent insurrectionists of their crimes.\" As Newsom rails against the raids and Trump deploying the National Guard to LA, the Democratic governor called for order to be restored following Jan. 6, when he said there was an \"outright assault to our democracy and Democratic institutions.\" \"Peaceful protest is an important mechanism of our democracy but what we are witnessing in our nation’s Capitol building is reprehensible and an outright assault to our democracy and Democratic institutions,\" Newsom said in a 2021 statement. \"The people of California have spoken, and our congressional delegation should never have to fear for their lives to represent Californians,\" the statement continued. \"We are concerned for the safety of California’s congressional delegation and U.S. Capitol staff, and are reaching out to offer support in every way possible. President Trump must call for an end to this escalating situation, acknowledge the will of the people to bring President-elect Biden to the White House and move immediately to a peaceful transition of power.\" When asked for comment on Newsom's previous remarks on Jan. 6 compared to his commentary on the riots, Newsom's press office directed Fox News Digital to the governor's comment to NBC News on Sunday: \"This is about authoritarian tendencies. This about command and control. This is about power. This about ego. This is a consistent pattern... this guy has abandoned the core principles of this great democracy. He’s threatening to go after judges he disagrees with, cut off funding to institutions of higher learning, he’s rewriting history and censoring historical facts.\" The office also noted that Trump said in 2020 during a townhall event that he could not mobilize the National Guard \"unless we’re requested by a governor,\" and pointed Fox Digital to comment from retired Maj. Gen. Randy Manner, former acting vice chief of National Guard bureau, criticizing Trump's activation of the Guard. \"The President's federal deployment of the National Guard over the official wishes of a governor is bad for all Americans concerned about freedom of speech and states rights,\" Manner said, Fox News' Jennifer Griffin reported, on Sunday. \"The governor has the authority and ability to respond to the civil disturbances with law enforcement capabilities within his state, augmented as necessary by requesting law enforcement assistance from other governors. There are over a million badged and trained members of law enforcement in this country for the governor to ask for help if he needs it. While this is presently a legal order, it tramples the governor’s rights and obligations to protect his people. This is an inappropriate use of the National Guard and is not warranted.\" Failed 2024 presidential candidate and former Vice President Kamala Harris posted to X Sunday that the raids were part of Trump's \"cruel, calculated agenda to spread panic and division,\" adding that the activation of the National Guard was \"a dangerous escalation meant to provoke chaos.\" On the one-year anniversary of the Jan. 6 riots, Harris lauded the heroism of police and the National Guard, while celebrating \"the resolve\" of elected officials to protect the Constitution and law and order. TRUMP BORDER CZAR RESPONDS TO NEWSOM'S 'ARREST ME' CHALLENGE AS CALIFORNIA RIOTS OVER ICE RAIDS \"The resolve I saw in our elected leaders when I returned to the Senate chamber that night, their resolve not to yield, but to certify the election, their loyalty, not to party or person, but to the Constitution of the United States, that reflects its strength,\" she said in 2022. \"And so of course, does the heroism of the Capitol Police, the DC Metropolitan Police Department, the National Guard and other law enforcement officers who answered the call that day, including those who later succumbed to wounds, both visible and invisible.\" Federal officials have pinned blame for the Los Angeles violence on Democratic elected officials who have \"villainized and demonized\" ICE law enforcement, Fox Digital previously reported. \"The violent targeting of law enforcement in Los Angeles by lawless rioters is despicable and Mayor Bass and Governor Newsom must call for it to end,\" DHS Assistant Secretary Tricia McLaughlin, for example, wrote in a Saturday statement. \"The men and women of ICE put their lives on the line to protect and defend the lives of American citizens.… From comparisons to the modern-day Nazi gestapo to glorifying rioters, the violent rhetoric of these sanctuary politicians is beyond the pale. This violence against ICE must end.\" ANTI-ICE PROTESTERS IN LOS ANGELES SPIT ON AND BURN AMERICAN FLAG The White House defended Trump's activation of the National Guard, saying it was in direct response to Democrats who have \"completely abdicated their responsibility to protect their citizens\" while law enforcement officials are attacked. \"In recent days, violent mobs have attacked ICE Officers and Federal Law Enforcement Agents carrying out basic deportation operations in Los Angeles, California,\" Leavitt said in a Saturday statement. \"These operations are essential to halting and reversing the invasion of illegal criminals into the United States. In the wake of this violence, California’s feckless Democrat leaders have completely abdicated their responsibility to protect their citizens.\" CLICK HERE TO GET THE FOX NEWS APP \"That is why President Trump has signed a Presidential Memorandum deploying 2,000 National Guardsmen to address the lawlessness that has been allowed to fester,\" Leavitt continued. \"The Trump Administration has a zero tolerance policy for criminal behavior and violence, especially when that violence is aimed at law enforcement officers trying to do their jobs. These criminals will be arrested and swiftly brought to justice. The Commander-in-Chief will ensure the laws of the United States are executed fully and completely.\"","summary":"California Democrats condemn immigration raids in Los Angeles as Trump deploys National Guard, contrasting with their previous support for law enforcement after Jan. 6, 2021.","url":"https://www.foxnews.com/politics/dems-walk-back-pro-cop-law-order-rhetoric-from-j6-era-face-spiraling-immigration-riots","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/riots.png?ve=1&tl=1","video":null,"publish_date":"2025-06-09 19:48:49","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.185},{"id":329737332,"title":"Report: George Soros-Funded PAC to Launch 'Blue Texas' Effort After Democrats Fail to Flip the State","text":"Democrats are reportedly gearing up to try and flip Texas blue with help from leftist billionaire and mega-donor George Soros.\n\nThe group known as Texas Majority PAC is set to launch its “Blue Texas” initiative on Monday, according to the Wall Street Journal (WSJ).\n\nThe newspaper said the Texas Democrat Party and other county parties will join the effort that will culminate in the midterm elections next year.\n\nSoros has tried but failed in the past to turn Texas blue by throwing millions of dollars into the effort. The WSJ article said he recently donated $1 million to the Texas Majority PAC:\n\nTexas has been a Republican stronghold for decades, providing the GOP with its largest batch of electoral votes and supporting President Trump in each of the past three presidential elections. The growth in the state’s Hispanic population during the past two decades has raised hopes among Democrats, but those demographic shifts have done little to change the balance of power. Earlier organizing efforts by Democrats, such as through a group called Battleground Texas, have failed to yield significant results.\nDemocrats haven’t won a statewide election since 1994, and Trump generated his largest margin of victory in Texas last year, defeating former Vice President Kamala Harris by nearly 14 percentage points. Republicans have won every presidential election in Texas since 1980, and the last Democratic U.S. senator to win an election in the state was Lloyd Bentsen in 1988.\n\nThe Texas Majority PAC was trying to turn the state blue in 2024 as other leftist groups were interested in doing the same thing with the help of mass immigration, Breitbart News reported at the time.\n\n“In Texas, the state’s foreign-born population is vital for Democrats,” the outlet said. It is also important to note that some non-governmental organizations (NGOs) partly funded by Soros convinced Democrats to adopt a platform that sought to decriminalize illegal immigration, Breitbart News reported in April.\n\n“The Soros network’s influence over the Democrat Party is widespread, most recently taking shape via various lawsuits so that the nation’s far-Left can fight President Donald Trump in the courts rather than Congress,” the article read.\n\nIn 2020, Texas Democrats had to regroup after they failed to make gains despite believing they would flip the state blue during the presidential election that year, according to Breitbart News.","summary":"Democrats are reportedly gearing up to try and flip Texas blue with help from leftist billionaire and mega-donor George Soros.\n\n\nThe post Report: George Soros-Funded PAC to Launch &#8216;Blue Texas&#8217; Effort After Democrats Fail to Flip the State appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/06/09/report-george-soros-funded-pac-to-launch-blue-texas-effort-after-democrats-fail-to-flip-the-state/","image":"https://media.breitbart.com/media/2025/06/GettyImages-1240879677-640x335.jpg","video":null,"publish_date":"2025-06-09 19:46:16","author":"Amy Furr","authors":["Amy Furr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.233},{"id":329721912,"title":"How Trump just made Gavin Newsom’s day by sending the National Guard to Los Angeles — politically, anyway","text":"On Monday, California Gov. Gavin Newsom announced that he would sue President Donald Trump’s administration for seizing control of the state’s National Guard to quell immigration enforcement protests in Los Angeles. \n\nIn response, Trump seconded his “border czar” Tom Homan’s threat that he might arrest the governor. “I would do it if I were Tom,” Trump told reporters. Just the day before, in an interview with NBC News, Newsom had all but dared Homan to arrest him. \n\nThe protests began late last week after Immigrations and Customs Enforcement agents conducted raids and arrests in Los Angeles at a Home Depot that resulted in 44 people being arrested. \n\nThe move gave Newsom, who has never been able to conceal his aspirations for higher office, an incredible surge of media attention just after he received months of public derision. In truth, Trump’s war on Los Angeles has given California’s Democrats, who have long been beleaguered, a new life.\n\nWhile California has long been one of the biggest vote banks for the Democrats, in recent years, it has caused just as much heartburn for the party. \n\nDuring the Covid-19 pandemic, people fled the state given the high cost of living, though it has seen its population grow in the past two years. \n\nCalifornia also accounted for a quarter of all homeless people in the United States in 2024, according to a report from the Department of Housing and Urban Development.\n\nNewsom has always had a penchant for the spectacle, going back to his time as mayor of San Francisco, when he performed same-sex marriages when even Democrats like Barack Obama and Hillary Clinton publicly opposed marriage for gay couples. \n\nHe relished debating Ron DeSantis, Florida’s ultra-conservative governor, on Fox News and loves going on the network more than people might expect a Democrat from liberal San Francisco should.\n\nBut he’s also faced criticism in recent months for how he handled — or failed to get a handle on — the out-of-control wildfires earlier this year. \n\nHe’s also ruffled some Democratic feathers with his decision to chat with conservatives like former Trump adviser Steve Bannon and Turning Point USA founder Charlie Kirk on his podcast. When he spoke with Kirk, he said that allowing transgender athletes to compete in women’s sports was “deeply unfair,” which naturally angered progressives. \n\nBut now, Newsom is in the place where he feels most comfortable, in a combative stance pushing back against the Trump administration. \n\nLike many other Democratic elected officials, he is weighing whether to jump into the 2028 presidential primary. If somehow Homan decides to slap some handcuffs, it would give Newsom potent fodder for voters in South Carolina and other early-voting primary states.\n\nThe same can be said for Los Angeles Mayor Karen Bass. \n\nDuring the wildfires, Bass was actually not in Los Angeles, but rather in Ghana, which violated her campaign promise to Angelenos that she would not travel internationally while mayor. When a reporter grilled her about being absent during the worst fires in the city’s history, she stayed silent. \n\nBass’ approval ratings plummeted in Los Angeles. And like many other cities with large Hispanic populations, Los Angeles shifted to the right in the 2024 election, though it remains firmly Democratic. \n\nThis would put her in a difficult position going into Los Angeles’s election in 2026, which has a top-two primary system where the two highest-vote earners in the primary advance to the runoff regardless of party.\n\nBut Bass, in part fueled by Trump’s federalizing the National Guard and sending them to her doorstep, has since pushed back to defend the city she leads. \n\nShe has urged people to remain peaceful, saying: “We do not want to play into the [Trump] administration’s hands.” If Bass is seen as advocating for her city in a moment when its large immigrant population feels under siege, it could pay large dividends. \n\nThen, of course, there is Kamala Harris. \n\nIn the months since Trump defeated the former vice president by winning the popular vote and all seven swing states, Harris has weighed whether to seek the governorship of the Golden State when Newsom’s term expires or to take another go at running for the presidency. \n\nOver the weekend, she denounced Trump’s escalation as “part of the Trump administration’s cruel, calculated agenda to spread panic and division.”\n\nRepublicans have loved to beat up on California, a state they once dominated with luminaries such as Pete Wilson, Richard Nixon and Ronald Reagan. But if Trump and the GOP overstep their mandate, they risk a backlash and amplifying the very liberal politics and policies that they seek to quell, and might wind up making them stronger in the long run.","summary":"Trump sending troops to quell the ICE protests and his threats to arrest the California governor will only serve to empower the same on-the-ropes Democratic politicians he wants to drive out, writes Eric Garcia","url":"https://www.independent.co.uk/news/world/americas/us-politics/la-protests-trump-newsom-democrats-b2766615.html","image":"https://static.independent.co.uk/2025/02/22/23/44/SEI237223078.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/ezcdRint-4VHSaSK0.mp4","publish_date":"2025-06-09 19:45:37","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.11},{"id":329713420,"title":"What to stream: Dierks Bentley, Sydney Sweeney, Alex Cooper and 'Deep Cover'","text":"Country superstar Dierks Bentley returning with the album “Broken Branches” and Sydney Sweeney in the dark, dramatic thriller “Echo Valley” are some of the new television, films, music and games headed to a device near you.\n\nAlso among the streaming offerings worth your time, as selected by The Associated Press’ entertainment journalists: “Call Your Daddy” podcast host Alex Cooper is the subject of a new docuseries called “Call Her Alex,” Bravo’s “The Real Housewives of Miami” returns for its seventh season and Netflix's documentary, “Titan: The OceanGate Disaster” looks into the implosion of the submersible that killed five people in 2023.\n\n— Sydney Sweeney plays Julianne Moore’s drug-addicted daughter in the dark, dramatic thriller “Echo Valley,” which really tests how far a mother might go for her troubled kid. The movie was written by Brad Ingelsby, the man behind “Mare of Easttown,” which had a similarly bleak tone. The stacked cast includes Kyle MacLachlan as the ex-husband and father, Fiona Shaw as a friend and Domhnall Gleeson as a pretty scary dealer. It begins streaming on Apple TV+ on Friday, June 13.\n\n— After an underwhelming run in theaters, the live-action “Snow White,” starring Rachel Zegler and Gal Gadot, is coming to Disney+ on Wednesday, June 11. In his review for The Associated Press, Film Writer Jake Coyle wrote that, “presumably one of the reasons to bring actors into remakes of animated classics would be to add a warm-blooded pulse to these characters. Zegler manages that, but everyone else in ‘Snow White’ — mortal or CGI — is as stiff as could be. You’re left glumly scorekeeping the updates — one win here, a loss there — while pondering why, regardless of the final tally, recapturing the magic of long ago is so elusive.”\n\n— Bryce Dallas Howard, Orlando Bloom and Nick Mohammed (“Ted Lasso”) play struggling improv comedians recruited to go undercover for the police in the new action comedy “Deep Cover.” Ian McShane, Paddy Considine and Sean Bean also star in the movie, which is streaming on Prime Video on Thursday, June 12.\n\n— Over on Netflix, a new documentary, “Titan: The OceanGate Disaster,” looks into the implosion of the submersible that killed five people in 2023 on the way to view the wreckage of the Titanic. It begins streaming Wednesday, June 11.\n\n— Film Writer Lindsey Bahr\n\n— The country superstar Dierks Bentley returns with “Broken Branches,” his 11th studio album, out Friday. It’s a rocking good time, even when life’s roads are bumpy, as evidenced across the release — from the jukebox stomp of the title track to the rowdy “She Hates Me,” which includes a surprising interpolation of post-grunge band Puddle of Mudd’s 2001 hit “She (Expletive) Hates Me.”\n\n— Australian band 5 Seconds of Summer has transformed across their career, moving from pop-punk boy band in their teens to full-on arena rock giants. Now that each member of the quartet is endeavoring to release side projects, it’s clear that they all have distinct, unique taste, too. Next up is bassist Calum Hood, with his debut solo album, “Order Chaos Order,” out Friday. It’s energetic, synth-y pop-rock from a matured musician; it’s easy to imagine his band might be jealous of a song like “Call Me When You Know Better,” with its lively production and earworm chorus.\n\n— Also on Friday, the Puerto Rican duo Luis Alfredo Del Valle and Raquel Berrios known as Buscabulla will release their sophomore album, “Se Amaba Así” (which roughly translates to “The Way Love Was”). The electronic Caribbean pop group has long been celebrated for combining genre in inventive ways, effortlessly including salsa, reggaeton, bachata and more into their indie sound. That spirit continues, and in new shapes: “El Camino” is futuristic disco; “Te Fuiste” is danceable, atmospheric synth-pop.\n\n— Music Writer Maria Sherman\n\n— “Call Your Daddy” podcast host Alex Cooper is the subject of a new docuseries called “Call Her Alex,” out Tuesday on Hulu. Cameras rolled as Cooper debuted the first leg of her “Unwell” tour but she also gets personal. She recounts experiencing sexual harassment by a soccer coach at Boston University, and the early days of her podcast when it was a part of Barstool Sports. She also goes into how she transitioned from a shock-jock persona focused only on sex and dating to an advocate for female empowerment who interviewed Vice President Kamala Harris on the presidential campaign trail. The series also interviews Cooper’s family and friends.\n\n— Another new Hulu offering out Tuesday is “The Kollective,” a drama series inspired by the investigative journalism group Bellingcat. With a cast that includes Natascha McElhone and Gregg Sulkin, “The Kollective” follows a group of citizen journalists investigating a global network of political corruption.\n\n— Tyler Perry expands his popular “Sistas” universe with “Divorced Sistas” for BET. LeToya Luckett leads a cast about five female friends navigating marriage, divorce and dating. It premieres Monday on BET and streams on BET+ beginning Tuesday.\n\n— Bravo’s “The Real Housewives of Miami” returns for its seventh season on Wednesday. Miami is the seventh city in the “Housewives” franchise. The cast includes Scottie Pippen’s ex Larsa Pippen, former Russian beauty queen Julia Lemigova (married to Martina Navratilova), and event planner Guerdy Abraira. “RHOM” streams on Peacock.\n\n— “The Chosen: Last Supper” will air in three parts beginning Sunday, June 15, on Prime Video. It follows Jesus (played by Jonathan Roumie) who has reached cult status in Jerusalem as other religious leaders try to quell his influence. Aware of his impending fate, Jesus shares one last meal with those closest to him.\n\n— Alicia Rancilio\n\n— It gets lonely in outer space, especially when your boss leaves you marooned on a hostile planet. All is not lost, however, for space miner Jan Dolski, who can clone himself to create The Alters he needs to get off this blasted rock before the radiation kills him. So we get Jan Scientist, Jan Technician, Jan Botanist and so on. The bad news is that each alter has his own set of personality traits, so a depressive Jan may need to figure out how to cope with an abrasive Jan. Poland’s 11 Bit Studios built its reputation on the grueling survival games Frostpunk and This War of Mine, and The Alters adds a dose of “Mickey 17”-style black comedy. All the Jans arrive Friday, June 13, on PlayStation 5, Xbox X/S and PC.\n\n— Lou Kesten\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"Country superstar Dierks Bentley returning with the album “Broken Branches” and Sydney Sweeney in the dark, dramatic thriller “Echo Valley” are some of the new television, films, music…","url":"https://japantoday.com/category/entertainment/what-to-stream-dierks-bentley-sydney-sweeney-alex-cooper-and-%27deep-cover%27","image":"https://media.japantoday.com/img/store/e2/a7/82e316a05e9c6edcb9e0b41f7c8f014d2517/download/_w1700.jpeg","video":null,"publish_date":"2025-06-09 19:38:53","author":"Japan Today Editor,The Associated Press","authors":["Japan Today Editor","The Associated Press"],"language":"en","source_country":"jp","sentiment":0.24},{"id":329724330,"title":"Trans inmates face rape & death with Trump’s Executive Order","text":"Republish this articleThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License.\nWe encourage republication of our original content. Please copy the HTML code in the textbox below, preserving the attribution and link to the article's original location, and only make minor cosmetic edits to the content on your site.Trans inmates face rape & death with Trump’s Executive Order\nby Mansa Musa, The Real News Network June 9, 2025\n\n Trans inmates face rape & death with Trump’s Executive Order\nby Mansa Musa, The Real News Network June 9, 2025\n\nhttps://youtu.be/nR5RgCO1GrI\n\nPresident Trump’s Executive Order calling for incarcerated transgender women to be housed in men’s prisons and halting gender-affirming medical care for prisoners has put one of the most vulnerable segments of the prison population in even greater danger. In this episode of Rattling the Bars, host Mansa Musa investigates the violent realities trans inmates face in the US prison system, and the impact that Trump’s attacks on LGBTQ+ rights is having inside prisons.\n\nDee Deidre Farmer, Executive Director of Fight4Justice. In 1994, Farmer’s landmark Supreme Court case, the unanimous Farmer v. Brennan decision, established that prisoners have a right to be protected from harm and that prisons are responsible for their safety.\nRonnie L. Taylor, Advocacy, Policy, & Partnerships Director of FreeState Justice in Maryland.\n\nAdditional resources:\n\nAmy Harman, The New York Times, “Judge blocks Trump effort to end treatment for transgender inmates”\nKaley Johnson & Sam Levin, The Guardian, “Trans women transferred to men’s prisons despite rulings against Trump’s order”\n\nProducer / Videographer / Post-Production: Cameron Granadino\n\nThe following is a rushed transcript and may contain errors. A proofread version will be made available as soon as possible.\nMansa Musa:\nAccording to The Guardian, transgender women are being sent back to male prisons under an executive order issued by President Donald Trump. A recent report from Democracy Now, stated that 17 transgender women have coverage under a lawsuit they filed, but the remaining transgender population have been sent back. They are suffering horrible abuses in the form of rape by the male population and from the prison guards.\nThe impact of this decision can be seen in the segment of this transgender population that don't have coverage. More importantly, we can see the impact that this decision is having on the prison population in general. What do you think? Should an executive order supersede a court order where multiple court decisions said transgender women should remain in the population where they're at? Or should an executive order supersede that, regardless of the court?\nTo learn more about trans women and the LBGT community's resistance, I spoke with Deidre Farmer, who in the mid '90s, filed a historical lawsuit against the Federal Bureau of Prisons because of their complicity in allowing rape to exist in all prisons they govern. Out of this lawsuit came PREA: Prison Rape Elimination Act. It became policy and it became law, throughout the prisons and throughout America.\nDeidre Farmer:\nI'm Deidre Farmer, I'm the executive director of Fight for Justice. I was incarcerated in the Federal Bureau of Prisons for a total of about 25-30 years. I brought the first transgender case accepted and decided by the US Supreme Court; In that case, Farmer V. Brennan, the US Supreme Court said that prison officials can be held liable for the sexual assault of other inmates when they knowingly place inmates at risk of danger. I am currently working with several organizations on cases that challenge the executive orders bought by Donald Trump regarding transgender people in prison as well as in the military.\nMansa Musa:\nTalk about how this suit came into existence and more importantly, why?\nDeidre Farmer:\nI entered the Bureau of Prisons as a teenager and when I was 19-20 years old I was transferred to the Federal Penitentiary in Terre Haute. I had never been in a penitentiary environment before and did not know what to expect. I was in the prison system at Terre Haute for about a week when an inmate came into my cell with a knife and demanded that I have sex with him, and when I refused, he beat me up and raped me. Then a number of his homeboys or guys that he associated with, held me hostage in the cell for a day or two.\nI ended up in protective custody and I had already started studying law and spending time in the library. When you're in the segregation unit, you find other people who have had the same experience-- They weren't necessarily transgender people, some of them may have been LGBTQ or young guys that were vulnerable or other people viewed them as weak. When I was transferred from Terre Haute, this is something that continued to play on my mind because I knew people, like me, went into protective custody and therefore the prison officials knew what was happening in the population, but weren't doing anything about it.\nSo I brought a suit claiming that when prison officials know that you are at risk of danger, assault, or rape, they can be sued for it. The district court and the Court of Appeals did not agree with me, but the US Supreme Court accepted the case. I wrote the petition on my own and filed it on my own and they accepted it. Then a friend of mine, who was an attorney at the ACLU National Prison Project, represented me in the Supreme Court. Of course, the court held if you can prove they knew -- Because of the environment or previous incidents -- Then you can sue them.\nMansa Musa:\nOut of this litigation came what is now commonly known as PREA: Prison Rape Elimination Act. Based on this advocacy in the prison system right now, it's policy that they had autonomous system set up where prisoners can complain about being sexually mistreated. We know this is a fact that PREA exists throughout the system-- Federal Bureau, federal, state, and county jail, city jail, it exists.\nThe president issued this order and according to it, all transgender people are to be sent back to the institutions that they've been identified by their original sexual origin; If it's a male that's transgender and he's in a female prison, according to Donald Trump, he going to be sent back to a male prison and vice versa. Talk about the impact that's going to have on the transgender population in general and with the prison population overall.\nDeidre Farmer:\nWhat you're doing is sanctioning the death of transgender people, whether they are transgendered or otherwise, they are still human beings and we should not be subjecting them to death because they do not conform to what our ideology of human beings should be. In my case, the Supreme Court recognized that people with certain vulnerabilities -- Including gender dysphoria or transgender -- Are vulnerable in certain populations.\nAfter my case, there were many studies done. Consequently the US Congress took the issue up and enacted the Prison Rape Elimination Act, which is supposed to have zero tolerance for rape in prisons. As the Supreme Court said, rape is not part of the sentence. Congress, because they recognized from many, many hearings and testimonies from women, young people, disabled people, mentally challenged people, gender-conflicted people who were sexually assaulted in prison or in jail, and consequently implemented PREA, which is nationwide standards. It does not create legal rights, but if you violate it, you can lose federal funding.\nThe executive orders that Trump has issued totally ignores what the Supreme Court has said, totally ignores what the US Congress has said, and what Trump is saying, despite the vulnerabilities that you have, you're going back into that environment. Despite the knowledge that you will be raped, despite the knowledge that the person who raped you might kill you so that you cannot tell. This is not an ideology, this is not a presumption; This is something that happens and has happened.\nNow for transgender people who remain in facilities consistent with their biological gender, it is happening. To say that you will take an incarcerated transgender woman who has had vaginoplasty and has a vagina and place her into a male institution, it's the same as placing a woman in there and to place a person at that risk, it's inhumane.\nMansa Musa:\nIn Baltimore, I spoke to Ronnie Taylor, a policy advocate with Free State Justice about the adversities facing the LGBTQ community in its current political climate. Also, we talked about the historical activism of the LGBTQ community.\nRonnie Taylor:\nThank you for having me. Ronnie Taylor, as you said. Pronouns are she/her. I serve as the advocacy policy and partnerships director here at Free State. We are the oldest LGBT organization providing legal services, resources, advocacy, and education in the state of Maryland. And we're the only-- We call ourselves Maryland's LGBTQ+ advocates.\nMansa Musa:\nI was looking at some of y'alls accomplishments. Y'all have been given numerous awards, but more importantly, y'all had a bill passed to deal with marriage. Talk about that.\nRonnie Taylor:\nAbsolutely. We were birthed out of the merger of Equality Maryland, for those that are familiar with that. We became Free State Legal Project and then Free State Maryland. Equality Maryland passed the Same-Sex Marriage Act numerous years ago, and it was such an accomplishment for Maryland so we wanted to figure out how we can continue to position ourselves as advocates.\nUnfortunately, when the doors closed at Equality Maryland, Free State Legal Project continued to work when it comes to our advocacy portions and we've been continuing to do that. We have some amazing legislative wins such as the Trans Health Equity Act. This recent year we passed the Carlton R. Smith Jr. HIV Modernization Act. The awards are great and it's great to be recognized, but we're going to continue to do the work for Marylanders.\nMansa Musa:\nIn the 2024 presidential campaign, Kamala Harris was being denigrated for providing or signing off on the legislation to allow transgender people to have a sex change according to what their orientation was. The President of the US and the Republican Party had a campaign ad; In the campaign ad they were promoting this as something that was inhuman and immoral with the way they was representing the person that was getting their sex changed, they had them looking almost monstrous. Talk about the impact that is having on the transgender community right now.\nRonnie Taylor:\nThose acts that have come into place and how it is crucial to our current standing Marylanders, I pride myself in saying that on a local level, we have a great partner in our Governor Wes Moore. However, federally we are under attack, and that attack has looked a variance of ways. Military personnel folks and particularly trans folks who have been serving in the military for numerous of years.\nMansa Musa:\nAnd honorably mention.\nRonnie Taylor:\nAnd honorably mention. To have their careers taken away for an oath that they took to protect this country is inhumane in regards to our prison systems. The Prison Rape Elimination Act is a thing, and to say we're going to put folks in cells and disregarding medical procedures and stating that you are trans, it's simply an attack. Furthermore, there's been numerous things this party has done; There's been over 886 pieces of legislation introduced by the Federal Administration for the attack of transgender individuals.\nMansa Musa:\nThis is outstanding because you put all that time and energy into trying to have a moral agenda over people's lives, but at the same token you are a convicted felon, you paid off Stormy Daniels for lewd lascivious behavior towards her, but you turned around and now you want to become the moral cop of people's lives. Talk about the impact this is having on the transgender community and y'alls ability to raise funds.\nRonnie Taylor:\nIt's hard. Funding is at a ultimate halt right now for a lot of organizations, including mine. If you put terms in such as \"DEI\" or \"community\" which our federal government are trying to eliminate, it puts us in a tricky situation. Thankfully we've been able to diversify our funding tools, as I'm in charge of that portfolio, and be able to still do the work. But it's challenging because we don't want to get rid of our moral compass and we refuse to.\nWe're going to continue to do the work, but we find ourselves in a position in which the federal administration has proven they do not want to be a partner in this work. Thankfully, we have a great federal delegation in Maryland that's going to continue to do the work and put forth legislation to combat that hate and that anti stuff, but it's still there and it's impacting everyday lives. It's affecting people's housing, their mental health, their ability to work, and so forth and so on.\nMansa Musa:\nAnd we interviewed a transgender female that was responsible for PREA, Prison Rape and Enforcement Act, and she was saying that right now it look like it's all out assault on transgender men or women in prison based on the fact that the president has put an executive order out saying that you going to be transferred to the prison of your assigned gender as opposed to your current gender. Talk about that if you can.\nRonnie Taylor:\nI couldn't agree with her more. It's definitely an overall attack. It's an agenda, it's an attack. And one of the things that I often remind people in my advocacy work here is our current president, and I use that term loosely, these are just executive orders. This person has done nothing but signed executive orders throughout his time throughout this term. There has not been any laws. The reality is there's still a chance to work and get things done on a local level. Now is the time more than ever. Primary general elections are coming up. We need folks to get in the race for the 2026, there are local elections, and do the work because it can be done.\nAnd overall you need to hold your elected officials to the responsibility. When they took that oath to serve in Annapolis or serve in whatever state house you elected them to be in to do the work of all Marylanders. It's inhumane. Trans people are a part of the political, social economic living sphere that we all consist and exist in. And so this attack on said sub community, it's horrendous and there absolutely needs to be something done about it.\nMansa Musa:\nThis government is taking a conservative act. Like I said, we went back through the military, don't ask, don't tell, but now they just did an executive order around that. Secretary of Defense issued a memorandum about that, their prison, and they taking federal funds from anyone under [inaudible 00:17:48] species of DEI. But they primarily saying that if you're transgender then you don't have an arm and leg to stand on. Why do you think they're having such a conservative act towards this particular community, sub-community?\nRonnie Taylor:\nGreat question, is we have to highlight folks from both sides of the aisle are trans.\nMansa Musa:\nYeah, yeah.\nRonnie Taylor:\nPresident Musk's daughter is a woman of trans experience, but she's not often talked about. She's been pushed underneath of a carpet and it's again, rooted in ignorance.\nMansa Musa:\nAs we go forward, what do you want our viewers to know about the transgender community? And more importantly, speak to them about what transgender means to you and what it should mean to society, because we live in a society supposed to be equal. We say we hold these truths to be self-evident that all people are treated equal and have [inaudible 00:18:42] rights to life, liberty and the pursuit of happiness. If your life is at jeopardy, your liberty is at jeopardy, and then therefore you ain't going to have no pursuit of happiness. Talk about why we should be looking at this issue and be real critical about this administration as it relates to their attitude towards people.\nRonnie Taylor:\nYeah. One of the things I often say is trans people since the beginning of time have done an amazing body of work, and our portfolio show that. Marsha P. Johnson and Sylvia Rivera stood on the front lines of the Stonewall movement and they threw the first brick.\nMansa Musa:\nThat's right.\nRonnie Taylor:\nThat's not often something that we talk about. Trans people are elected officials. We have precious Brandi Davis down in the south, we have Andrea Jenkins in the Midwest, we have Sarah McBride, our first congresswoman.\nMansa Musa:\nCome on, come on.\nRonnie Taylor:\nAnd so folks are capable and willing to do the work, but we refuse to be ostracized. And so what it means to me, and thank you for asking me that question, I have prided myself and it's often a label that I wear with pride and I introduce myself and my pronouns and say, \"I'm a woman of trans experience,\" because I refuse to dim that light in the work that I'm doing.\nMansa Musa:\nThat's right.\nRonnie Taylor:\nAnd so we're in advocacy spaces, we're in policy spaces. We are in all of the spaces. And so it's ultimately the education that gets into it. And so the willingness to learn, there are some of us that are willing to do our trans one-on-one conversations with you, but you have to come to the table with a willingness to learn.\nMansa Musa:\nThat's right.\nRonnie Taylor:\nAnd so, oftentimes our political landscape has shown that it's okay to be disrespectful and neglectful of said communities, but there is some work to be done.\nMansa Musa:\nThere you have it. The real news, Rallying the Boss. Transgender community is here, it's here to stay. We not trying to make no excuse for it, but they're human beings like us. The only problem that we have with this whole entire issue is that someone thinks that they have the moral compass to determine who should have a quality life versus whose life should be treated differently. This country is prided on equality and we are saying that equality is paramount when it comes to recognizing the transgender community and all their accomplishments they have made.\nThese stories about the LBGT community and transgender and their rights to be treated as human beings is something that Rallying the Boss believe should be brought front and center as it relates to humanity. This is about humanity. This is not about a person's preference, sexual orientation. This is about people being treated as human. And we at Rallying the Boss believe that these stories, when you look at them and evaluate them, will give you a sense of understanding about humanity. We ask that you continue to look at Rallying the Boss and we ask that you give your views. Tell us what you think about these stories because it's your views that give us content and context to our next story.\n\n This article first appeared on The Real News Network and is republished here under a Creative Commons Attribution-NoDerivatives 4.0 International License. </script","summary":"“What you're doing is sanctioning the death of transgender people… They are still human beings, and we should not be subjecting them to death because they do not conform to what our ideology of human beings should be.”","url":"https://therealnews.com/trans-inmates-face-rape-death-with-trumps-executive-order","image":"https://therealnews.com/wp-content/uploads/2025/06/frame_20599-scaled.jpg","video":null,"publish_date":"2025-06-09 19:37:35","author":"Mansa Musa","authors":["Mansa Musa"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":329703428,"title":"Trump's ex-communications director makes wild claim about Gavin Newsom's clash with the president over LA riots","text":"Former White House communications director Anthony Scaramucci made a wild claim about California Gov. Gavin Newsom's political future amid his clash with President Donald Trump over this weekend's riots in Los Angeles. \n\nNewsom continued to taunt Trump Monday afternoon after the president returned to the White House and threatened to arrest the Democratic California governor. \n\nScaramucci, who was hired and fired by Trump in a period of 10 days in 2017, saw Newsom's political stock rising. \n\n'This whole fiasco could make Gavin president,' Scaramucci posted to X Monday morning. \n\nScaramucci has supported Democrats, including President Joe Biden and Vice President Kamala Harris, since his brief tenure in the first Trump White House.\n\n'Gavin has the guts to stand up to these wannabe authoritarians. I will give him that,' Scaramucci posted Sunday night. \n\nScaramucci highlighted a post from Newsom saying that Trump sending 2,000 National Guard troops into Los Angeles County was 'not to meet an unmet need, but to manufacture a crisis.'\n\n'He's hoping for chaos so he can justify more crackdowns, more fear, more control. Stay calm. Never use violence. Stay peaceful,' Newsom said. \n\nOn Monday Scaramucci reposted Newsom's demand to have the California National Guard returned to the governor's authority. \n\n'I have formally requested the Trump Administration rescind their unlawful deployment of troops in Los Angeles county and return them to my command. We didn't have a problem until Trump got involved,' the Democrat said. \n\n'This is a serious breach of state sovereignty - inflaming tensions while pulling resources from where they're actually needed. Rescind the order. Return control to California,' Newsom demanded.\n\nNewsom continued to admonish Trump throughout Monday.\n\n'The President of the United States just called for the arrest of a sitting Governor. This is a day I hoped I would never see in America. I don't care if you’re a Democrat or a Republican this is a line we cannot cross as a nation - this is an unmistakable step toward authoritarianism,' Newsom wrote after Trump made his threat on the South Lawn. \n\nNewsom was the one Democratic candidate Trump feared when running against Biden - and later Harris - in the 2024 race, according to Alex Isenstadt's book Revenge: The Inside Story of Trump's Return to Power. \n\nThe ex-president worried that Biden could drop out of the race cuing a Democratic primary. \n\nInstead Biden dropped out of the race so late that the party quickly got behind Harris. \n\n'One person he had been worried about was California Governor Gavin Newsom. Always fixated on visuals, Trump thought the handsome, hair-gelled governor was \"slick\" and the future of the Democratic Party,' Isenstadt wrote. \n\nTrump was also annoyed that Fox News Channel's Sean Hannity woud keep having Newsom on his primetime show, Isenstadt said. \n\nBut in November of 2023, Newsom debated Florida Gov. Ron DeSantis, who was running against Trump in the Republican primary.\n\nTrump, reportedly, wasn't impressed. \n\nHe thought Newsom had 'bombed,' Isenstadt wrote. \n\n'Ron's an idiot, he doesn't have what it takes. But I thought Newsom would be better,' Trump said at the time, according to Isenstadt's account.","summary":"Ex-White House communications director Anthony Scaramucci made a wild claim about California Gov. Gavin Newsom's political future.","url":"https://www.dailymail.co.uk/news/article-14795359/anthony-scaramucci-gavin-newsom-elected-president.html","image":"https://i.dailymail.co.uk/1s/2025/06/09/19/99191069-0-image-a-19_1749495317997.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/09/6044407862157292162/1024x576_MP4_6044407862157292162.mp4","publish_date":"2025-06-09 19:20:05","author":"Editor,Nikki Schwab","authors":["Editor","Nikki Schwab"],"language":"en","source_country":"gb","sentiment":-0.324},{"id":329694462,"title":"Behind the scenes of Trump’s ‘iconic’ McDonald’s visit before election victory: ‘That was epic’","text":"Fox Nation is offering a rare glimpse into Donald Trump’s pivotal McDonald’s visit during the final weeks of his 2024 campaign with a multi-episode installment of “The Art of the Surge.”\n\nIt all starts at a McDonald’s drive-thru, where the then-GOP nominee traded a suit for an apron and got to work as a fry cook in Feasterville, Pennsylvania last October.\n\n“I’ve always wanted to work at McDonald’s, and I never did,” he told workers inside the building.\n\nThe first episode of the series documents Trump’s “first day” on the job from the very beginning, as he requested to work the french fry cooker and learned the process. \n\nHe walked through, step-by-step, dunking fries into hot oil, shaking the basket, pouring servings into the signature red McDonald’s cartons and sprinkling salt over them.\n\nIt became an iconic moment on the campaign trail as the notorious New York City business magnate-turned-president performed a job many Americans have had at one point in their lives. \n\nHe even greeted customers wrapped around the building at the drive-thru window.\n\nAs one family took a Happy Meal from his hands he quipped with a smile, “It’s going to be the best you’ve ever had. It had better be. I made it myself.” \n\nCustomers passed on their messages of encouragement as the high-stakes faceoff with then-vice president and Democratic presidential candidate Kamala Harris was merely two weeks away, with both teams in a mad sprint to the finish line.\n\n“Make America great again!” one driver said.\n\nAnother, shaking hands with Trump, said, “45-47, you’ve got this, sir.” \n\nTrump paused, on occasion, to wave at the mass of fans cheering and holding “Trump-Vance” signs nearby. He told WTXF reporter JoAnn Pileggi that the crowd was smiling and upbeat because they wanted hope. \n\nTurning back inside the building, he faced the camera at one point and smiled as he noted how much fun he was having.\n\n“I could do this all day. I wouldn’t mind this job,” he said. \n\nTrump’s efforts were viewed by many as a mockery of a claim his opponent had worked for the fast food chain while in college.\n\nAt one point, Trump even remarked, “I’ve now worked for 15 minutes. Fifteen more than Kamala.” \n\nAs his team departed on his personal plane, Trump’s deputy director of communications Margo Martin enthused about the day.\n\n“That was epic,” she said.\n\n“Donald Trump working the McDonald’s drive-thru – iconic.” \n\nTrump would go on to defeat Harris in the 2024 election, sweeping all campaign swing states, including Pennsylvania.","summary":"The then-GOP nominee traded a suit for an apron and got to work as a fry cook in Feasterville, Pennsylvania last October.","url":"https://nypost.com/2025/06/09/us-news/inside-trumps-iconic-mcdonalds-visit-before-election-victory/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-3telgncm5-1749492838601.jpg?quality=75&strip=all&1749478486&w=1200","video":"https://cdn.jwplayer.com/videos/zHnJNr0H-RyIcpnTz.mp4","publish_date":"2025-06-09 18:41:37","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":0.069},{"id":329692402,"title":"Oakland journalist Chauncey Bailey’s killer released from prison","text":"OAKLAND — The hitman who shot-gunned Oakland newspaper editor Chauncey Bailey to death nearly 18 years ago in one of the most horrific attacks on a journalist in American history has been released from state prison.\n\nBailey’s sister, Lorelei Waqia, said she was notified this week by the California Department of Correction and Rehabilitation that Devaughndre Monique Broussard has been paroled. He is living in Southern California.\n\n“We hope he has reformed and becomes an asset to the community,” Waqia wrote in a text.\n\nThe CDCR did not immediately respond to a request for information on Broussard’s release. The prosecutor in the case, former Alameda County Deputy District Attorney Melissa Krum, declined to comment.\n\nBroussard, then 19, killed Bailey on Aug. 2, 2007. He eventually admitted that he did so on orders from Yusuf Bey IV, the leader of Oakland’s now defunct Your Black Muslim Bakery, to stop a story Bailey was writing about the bakery. He also admitted killing another man, Odell Roberson, in revenge for Roberson’s nephew killing Bey IV’s brother in 2005.\n\nAs part of a plea deal, in which Broussard eventually testified against Bey IV and another man who helped him carry out the hit, Antoine Mackey, Alameda County prosecutors agreed to seek a rare fixed sentence of 25 years in state prison, which a judge approved. State law allows correction officials to shave time from sentences for good behavior, and records show Broussard also worked as an inmate firefighter which can lead to additional reductions in sentences.\n\nCounting time in county jail prior to being sentenced in 2011, he was incarcerated for about 17 and a half years.\n\nBey IV had learned Bailey was working on a story about the bakery’s decline and recent bankruptcy filing, and he told Broussard, and Mackey, to “take him out before he writes that story,” court records show.\n\nAmbushing Bailey as he walked to the newsroom of the weekly Oakland Post which he had recently joined, Broussard fired three shots at point-blank range from a pistol-grip, .12-gauge shotgun, leaving Bailey dead on the edge of a parking lot at 14th and Alice streets.\n\nIn exchange for the hit, Broussard would later testify, Bey IV promised to teach him how to commit financial crimes by using fake IDs and forged documents to acquire real estate, mortgages and automobiles. Broussard, who grew up poor in San Francisco’s Bayview neighborhood, where he sometimes helped his mother and grandmother sell drugs from their home, agreed.\n\nBroussard was arrested on Aug. 3, 2007, when police raided the bakery compound at 5836 San Pablo Ave. and he was seen throwing the gun used to kill Bailey out a window. That operation – spurred by other crimes police suspected Bey IV’s followers committed – had been scheduled for two days earlier. But police delayed it because two SWAT team leaders were on vacation.\n\nBroussard at first denied killing Bailey, who before joining the Post was a Detroit News, then Oakland Tribune reporter. But after detectives left him and Bey IV alone in an interrogation room – without recording or listening in on the conversation – Broussard confessed.\n\nHe would later claim that Bey IV told him if he admitted that he carried out the murder on his own, he would be paid and a lawyer would be provided for him who would win his case. But Bey IV was charged in an unrelated kidnapping and torture case, and no one from what was left of the bakery aided Broussard’s defense.\n\nIn February 2008, Broussard was interviewed by the CBS news show 60 Minutes. He told Anderson Cooper he didn’t kill Bailey but knew who did. “I’m going to give all that info up when I go to trial,” he said.\n\nBut for more than a year there was little movement in the case. During that time a journalistic collaborative, The Chauncey Bailey Project whose motto was “You can’t kill a story by killing a journalist,” dug into the murder. It reported on a secretly recorded police video of Bey IV mocking Bailey being shot and saying that he had the murder weapon “the night before” police raided the bakery but gave it back to Broussard for protection.\n\nThe project later reported that police had overlooked other evidence in the case, such as cell phone records that showed Bey IV exchanging numerous calls with Mackey and Broussard around the time of the murder.\n\nIn the spring of 2009, Broussard agreed to the plea deal with prosecutors and testified before a grand jury. Bey IV and Mackey were indicted for Bailey’s murder. Based on Broussard’s testimony, they were also indicted in the separate murder of a restaurant worker, Michael Wills, who Mackey killed with an AK-47 on July 12, 2007, near the North Oakland bakery. They were also both charged in Roberson’s murder, which Broussard told grand jurors Mackey helped him carried out.\n\nWhen the case finally went to trial in early 2011, Broussard was Krum’s star witness. He struggled through his testimony as defense lawyers for Bey IV and Mackey grilled him aggressively. But after months of high courtroom drama, Bey IV was convicted of ordering Bailey, Roberson and Wills killed.\n\nMackey was convicted in the killings of Bailey and Wills. The jury deadlocked on charges that he participated in Roberson’s killing.\n\nAlameda County Superior Court Judge Thomas Reardon sentenced both to life in state prison without the possibility of parole. Both have lost multiple appeals. In October, Bey IV filed a 32-page self-written appeal claiming that scriptures in both the Bible and Holy Quran, along with “Sacred geometry” combined with astronomy, astrology, and the frequent appearance of the number 13 throughout holy texts, his trial and incarceration, prove his innocence. He asked for a “new and fair trial.” The judge denied the request.\n\nLast fall, Broussard suddenly became fodder in the presidential campaign when Donald Trump claimed Bailey’s killing was an example of then-Vice President Kamala Harris being soft on crime during her time as San Francisco district attorney in the mid 2000s. It centered on Broussard’s beating and robbery of a man on a San Francisco Muni train in 2005.\n\nTrump alleged that Harris went light on Broussard by agreeing to a plea agreement that resulted in Broussard being placed on probation, the first year of which he served in county jail. Rather than being free to kill Bailey two years later, Trump claimed Broussard should have been in prison. But legal experts called that claim overblown for a first-time offender and said the case – which Harris played no role in – was handled properly.\n\nBroussard also sought parole last year but was denied largely because he had been caught with a cell phone at a fire camp in the High Sierra, records show. He also did not have a complete plan prepared on how he would re-enter society. Still, parole board members noted he was making progress toward release and had completed several college classes.\n\nBroussard also expressed remorse for the murders of Bailey and Roberson, a transcript of the proceeding shows, and he spoke to relatives of the victims who attended the hearing remotely.\n\n“I apologize to my victim’s family members,” he said according to the transcript. He said he struggled to articulate his remorse. “What words is enough. What words make sense?” he said.\n\n“I hurt you in ways that nobody should be hurt. Chauncey Bailey was targeted and killed just because of him simply just doing this job.”\n\nBay Area News Group reporter Nate Gartrell contributed to this story.","summary":"“We hope he has reformed and becomes an asset to the community,” Chauncey Bailey's sister wrote in a text.","url":"https://www.mercurynews.com/2025/06/09/oakland-journalist-chauncey-baileys-killer-released-from-prison/","image":"https://www.mercurynews.com/wp-content/uploads/2025/06/SJM-L-BAILEY-0609-e1749494310297.jpg?w=1024&h=787","video":null,"publish_date":"2025-06-09 18:31:10","author":"Correspondent,The Chauncey Bailey Project,Thomas Peele","authors":["Correspondent","The Chauncey Bailey Project","Thomas Peele"],"language":"en","source_country":"us","sentiment":-0.389},{"id":329726438,"title":"Georgia GOP's attempt to block Brad Raffensperger from running as a Republican may go nowhere","text":"ATLANTA (AP) — Georgia's Republican Party says Georgia Secretary of State Brad Raffensperger should not be able to run under the party's banner anymore, but the party's chairman says the attempt to kick out the state's chief election official may not be going anywhere.\n\nDelegates voted overwhelmingly at the state GOP convention on Saturday in Dalton to adopt a series of resolutions, including one declaring the party shall not “take any action to allow Brad Raffensperger to qualify as a Republican” for future elections.\n\nThe resolution shows the deep hostility many Republican activists have toward Raffensperger following his refusal to help Donald Trump overturn his 2020 election loss in Georgia. Alex Johnson chairs the Georgia Republican Assembly, a group that tries to influence the party. He said Raffensperger has been “generally ignoring and disrespecting” the party, including attempts to change the election system, and that Republicans should be allowed to divorce Raffensperger.\n\n“He doesn’t listen to anything that the Republican party has asked him to do,” Johnson said Monday. “He is hostile and has been hostile towards our presidential nominee and now a person who is president.”\n\nBut party Chairman Josh McKoon told reporters after the convention ended that while the resolution “presents the sense of the convention on what should happen,” state law would only allow the party to refuse to qualify Raffensperger if he falsely swore the loyalty oath to the party required of Republican primary candidates.\n\n“I don’t really see a way for the Georgia Republican Party to decline someone the opportunity to qualify,” McKoon said.\n\nA spokesperson for Raffensperger's office declined to comment Monday. The two-term secretary of state has said he's considering running for governor or U.S. Senate in 2026.\n\nGeorgia has no party registration and its primary elections allow anyone to vote in the party nominating contest of their choice. That means it can be hard to tell who is truly a Republican or a Democrat.\n\nSome Republicans favor a system of voter registration by party and primaries that allow only party members to vote. They also say party officials should decide which candidates should be allowed to run as Republicans.\n\nThe Georgia Republican Party's executive committee voted in January to expel former Lt. Gov. Geoff Duncan after Duncan endorsed Democrat Kamala Harris for president. The committee voted to ban Duncan from party events and said it would not qualify Duncan to run as a Republican in the future.\n\nBut the party in 2023 rejected an attempt to ban ideological traitors from primary ballots. Last year, judges blocked attempts by a county party in northwest Georgia to act as gatekeepers for local candidates.\n\nIn a ruling regarding Catoosa County, the state Supreme Court did not get to the heart of the dispute over whether parties can create rules for qualifying candidates in primary elections beyond those found in Georgia law. Those who push that point of view claim that being forced to qualify everyone who signs up violates their freedom of association under the U.S. Constitution.\n\n“You can’t force a Baptist church to ordain a Buddhist or a Muslim to be a Baptist minister,” said Nathaniel Darnell, president of the Georgia Republican Assembly. “By the same token, you can’t force somebody who is counteracting the Republican principles and objectives to be Republican.”\n\nA federal judge rejected that argument, but some Catoosa County Republicans have appealed the case. The 11th U.S. Circuit Court of Appeals has not yet ruled. Republicans in Chattooga and Pickens counties passed similar rules.\n\nThose who want to act as gatekeepers generally are seeking to move the party to the right. The state convention on Saturday, for example, called for repealing both the state income tax and local property taxes.\n\nThose who hold a different view say voters should decide who’s a true Republican.\n\n“It's a blatant power grab by political elites to take away the voice of Republican voters in this state,” said Scot Turner, a former Republican House member who leads a group that successfully sued to block other changes to state election law.","url":"https://www.yahoo.com/news/georgia-gops-attempt-block-brad-180213678.html","image":"https://s.yimg.com/ny/api/res/1.2/T4u3mExQvJL0aMdoX_5Gqw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04OTc-/https://media.zenfs.com/en/ap.org/613171e2beeb408fdd9d994b3a2b303c","video":null,"publish_date":"2025-06-09 18:02:13","author":"Jeff Amy","authors":["Jeff Amy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":329696866,"title":"‘SNL’ Writers Break Down the ‘Swirl’ of Tackling a Landmark 50th Season, an Anniversary Special and an Election in One Year","text":"It was a late Thursday morning in 30 Rock and “Saturday Night Live” head writers Kent Sublette, Streeter Seidell and Alison Gates were running on caffeine and willpower. As per “SNL” tradition, they stayed up all night Tuesday writing potential sketches for the week’s show. Then, on Wednesday night, they picked the sketches that would move forward for the penultimate episode of the season with host Walton Goggins.\n\nThis was on top of a star-studded 50th-season special in February with icons like Eddie Murphy, Steve Martin, Tina Fey, Amy Poehler and Will Ferrell gracing the 8H stage once again. Oh, yeah, it was an election year, too.\n\n“It was just kind of a swirl,” Seidell said of the season, which also saw cameos from the likes of Adam Sandler and Dana Carvey each week as the show celebrated its cultural legacy. He added, “Your brain just has to file it away as regular work, like, ‘It’s normal that Mike Myers is here.’” Then Sublette jumped in: “It’s normal that you’re going through security with Kamala Harris and security guards with AR-15s.”\n\nExecutive producer and “SNL” creator Lorne Michaels cast the show’s big political roles over the summer, before the 50th season began: Maya Rudolph as Harris, Andy Samberg as Doug Emhoff, Jim Gaffigan as Tim Walz and Dana Carvey as Joe Biden. (That was in addition to James Austin Johnson reprising his spot-on impression of Donald Trump and cast member Bowen Yang being tapped to play JD Vance.) Gates said working with the group of returning vets was a thrill, not just on the cold opens but in other sketches as well, in keeping with the cameo-filled season. “They’re so good and have such funny ideas,” she said.\n\n“There’s obviously a big family element to ‘SNL,’” said Sublette, who’s been with the show since 2007. “When those people come back, you feel that and you feel them feeling that, and it’s a special thing.” He added that everyone felt pressure to get the election right, but everyone having “that same pressure on them elevated it to a point where this seems impossible, but we’re going to figure it out.”\n\nMission accomplished. The pre-election episodes had their share of moments that broke through to the larger zeitgeist, not the least of which was Kamala Harris’ cameo mere days before the election, when she appeared in a sketch playing her own reflection in a mirror opposite Rudolph. The mirror bit was Michaels’ idea, the writers said, and there was some fear that viewers would cry foul since a mirror gag had just been used a few weeks earlier with Jennifer Coolidge. As it turns out, the fretting was unfounded.\n\n“When the lights came up on Kamala, you felt that audience just go insane. You knew they would be appreciative and excited, but it felt very huge and special when they saw her sitting out there,” Sublette said. To make it even more nerve-racking, Harris couldn’t attend the dress rehearsal, so the vice president was performing the sketch on stage for the first time on live TV.\n\nIn the wake of the election, “SNL” viewership remained consistently robust and viewer reaction to the show stayed largely positive week after week. No small feat for a program that is usually declared “dead” at least once every two to three years.\n\n“Week to week, it’s the job that we’ve all been doing for years,” Seidell said. “But it does feel like the reception of the show has been pretty good this season. We’re seeing new cast members popping, and that’s always exciting to see the public discover somebody and really like them, and then that can kind of direct the writing a little bit.”\n\nThat was certainly the case for Marcello Hernandez, who joined the show in 2022 but hit rarefied air in Season 50 with the recurring character of Domingo, the paramour of a philandering bride-to-be. After the character debuted in October, there were two more Domingo sketches during the season, including one on the 50th-anniversary special, with Pedro Pascal and Bad Bunny in supporting roles.\n\nSeidell, Sublette and Gates were all thrilled to see Hernandez’s character break out, but admitted they were surprised that the sketch took off the way it did. “You just can’t tell what people are going to absolutely love,” Seidell said. “I always forget, no one wrote a recurring sketch thinking it would be recurring,” Gates added, but Sublette was quick to note, “Domingo deserves.”\n\nThe head writers were also eager to point out that they feel the writing staff has only gotten stronger over the past few years, with a diverse group of young comedy voices—stand-ups, performers, writers—added to the mix, all working to keep “SNL” current. “If I like every single thing in the show, that’s a problem, because that means it’s just geared toward me,” Seidell said of how he views his role as a head writer, a job previously held by Seth Meyers and Tina Fey, among others. “It’s not that I hate stuff, but I’m like, ‘That’s not really my style of humor, but everyone laughed at it so I have to acknowledge that this deserves a spot in the show.’”\n\nSublette added that Michaels advocates for certain sketches based on how often a cast member may have appeared in the season. “I think Lorne is good at taking a chance on things,” he said, noting that even if there’s just one thing about a sketch that feels special, he’ll frequently give it a shot. “Oftentimes it was right and turned out great, and we try to look at that big picture of our cast and who’s being represented as well.”\n\nDomingo was one of many this season that exploded on social media, where Gen Z seems to be getting the bulk of its “SNL” intake. In many ways, “Saturday Night Live” is tailor-made for the TikTok era, with three-to-six-minute sketches that clip easily for online viewing. “I think Lorne knew that in 1975 and he said, ‘In 50 years, this format is going to clip wonderfully,’” Seidell quipped.\n\n“It’s always been a show to discover as a young person; it’s just being done in a new way,” Sublette said. “I would tape it on VHS and look at it with my friends the next day.”\n\nBut “SNL’s” reputation has been boosted by the proliferation of online viral sketches separate from the show, Seidell said. “It’s certainly nice with YouTube and things, you can normally find a bright spot every show, whereas maybe before you just had to take it as a whole.”\n\nSomething else is different in the era of social media: Many of the show’s stars have their own followings on Instagram and TikTok, with cast members like Bowen Yang, Sarah Sherman, Chloe Fineman, Ego Nwodim and Hernandez often posting clips or behind- the-scenes looks on their personal pages. And new cast member Jane Wickline joined the show with more than 1 million TikTok followers.\n\nSo is “SNL” competing with the creator economy? “Sometimes the thinking almost feels like the opposite, where it’s like, ‘What can we do here—because of the production—that you couldn’t do on your own?’” Gates said. “So something scaled down might work on TikTok, but with the amazing sets and things we can pull off here, what can you only do here?”\n\nThe strength of this era was clear in the 50th-anniversary special, which made heavy use of the current cast in addition to legacy performers. “When you walked into that room and saw who’s sitting in the crowd, I felt such gratitude,” Seidell said. “I got to be like a little part of this thing that was powerful enough to bring all these people together.” As one of the warm-up performers for the audience, Heidi Gardner recalled the absurdity of being tasked with hyping up a crowd that included Jack Nicholson before the show went live. “I just couldn’t believe what was happening,” she said.\n\nThe head writers worked with other “SNL” vets like Fey, Meyers and John Mulaney, who came back to the table to build the live anniversary show. Both Sublette and Seidell were at “SNL” for the 40th-anniversary special and anticipated that the 50th would be “overwhelming.” But when it came time to put pen to paper, they said all the preparation set them up for success.“Once we got into the writing of it, the actual amount of work that each of us had to do was not greater than a regular show,” Seidell explained. “Everyone had one or two things they were responsible for and then you had longer to work on it. So to me it was like, ‘Oh, this is almost, dare I say, easier than the week-to-week regular show.’”\n\nThe constant, of course, is Michaels, who still runs “SNL” every week. Despite retirement rumors bubbling, the 80-year-old has made no indication that he intends to leave the show that he’s steered for nearly half a century. And a couple of hours after the interview with Sublette, Seidell and Gates, the 17th floor of 30 Rock was filled with the smell of popcorn, Michaels’ favorite snack. “Does that mean Lorne’s here?” this reporter asked a young NBC page.\n\n“It does, actually!” the page replied, smiling widely. Back to work.\n\nThis story first ran in the Comedy issue of TheWrap’s awards magazine. Read more from the issue here.","summary":"TheWrap magazine: Kent Sublette, Streeter Seidell and Alison Gates unpack the cameo-filled season, from Trump to Domingo\n\n\nThe post &#8216;SNL&#8217; Writers Break Down the &#8216;Swirl&#8217; of Tackling a Landmark 50th Season, an Anniversary Special and an Election in One Year appeared first on TheWrap.","url":"https://www.thewrap.com/snl-season-50-head-writers-interview-domingo-election-kamala/","image":"https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/06/snl-marcello-hernandez.jpg?fit=1200%2C675&quality=89&ssl=1","video":null,"publish_date":"2025-06-09 18:00:00","author":"Adam Chitwood,Seth Meyers","authors":["Adam Chitwood","Seth Meyers"],"language":"en","source_country":"US","sentiment":-0.276},{"id":329699210,"title":"Warner Bros Discovery splits streaming and cable into 2 firms","text":"Warner Bros Discovery said it would split into two publicly traded companies, separating its studios and streaming business from its fading cable television networks as the parent of HBO and CNN looks to compete better in the streaming era.\n\nThe breakup is the latest unraveling of decades of media consolidation that created global conglomerates spanning content creation, distribution and in some cases, telecommunications. It unwinds WarnerMedia and Discovery’s 2022 merger, aiming to grow the streaming and studios business without the declining networks unit weighing them down.\n\nThe new streaming-and-studios company will include Warner Bros, DC Studios and HBO Max – the crown jewels of WBD’s entertainment library.\n\nThe networks unit, which will hold up to a 20% stake in its counterpart, will house CNN, TNT Sports and Bleacher Report.\n\nCEO David Zaslav will lead the streaming and studios unit, while CFO Gunnar Wiedenfels will head the networks unit. The separation will be structured as a tax-free transaction and is expected to be completed by mid-2026.\n\n“We’ve continued to analyze how our industry is evolving,” Zaslav told investors. “The right path forward became increasingly clear … to separate global networks and streaming and studios into two independent, publicly traded companies.”\n\nMost of the company’s debt would be held by the global networks company. WBD had gross debt of $38 billion as of March. The company said it secured a $17.5 billion bridge loan from J.P. Morgan that it would use to restructure its debt.\n\nShares of WBD rose 7% today, but the stock remains down nearly 60% since the merger, hurt by cable subscriber loss, tough streaming competition and investor concerns over the debt-laden company’s direction.\n\nMedia executives had initially anticipated a wave of consolidation under President Donald Trump’s administration, though that has not come to pass.\n\n“For a series of reasons, that proved harder than anyone thought,” said Jonathan Miller, a veteran media executive who now serves as chief executive of Integrated Media. “It looks like the characteristic of this year will be how do we get our house in order, and do what we can that’s under our control.”\n\nComcast is spinning off most of its NBCUniversal cable networks portfolio into a separate company, Versant. Lions Gate Entertainment completed the separation of its Starz cable network from its film and television studio in May.\n\nSuch breaking up of media conglomerates could set the stage for further deal-making, said one veteran media executive who spoke on condition of anonymity.\n\nBrian Wieser, CEO of Madison and Wall, an advisory firm for media, technology and other companies, said the split will not fix underlying weakness at Warner Bros Discovery.\n\n“If anything, (it) could make them worse off by favoring financial engineering over focusing on improving existing operations or pursuing new opportunities for growth … a deal like this can hamstring both sides of the company until the transactions are closed,” said Wieser.\n\nLast week, about 59% of WBD shareholders at the annual meeting voted against executive pay packages, including Zaslav’s $51.9 million 2024 compensation, in an advisory vote that signaled dissatisfaction.\n\nLike other entertainment companies, WBD is struggling with declining ratings and revenue at its cable networks. Consumers have been dropping pay-television subscriptions in favor of streaming services.\n\n“WBD is a hotchpotch of businesses which have failed to win over the market,” said AJ Bell analyst Dan Coatsworth. The split gives Warner Bros “a better chance to gain broader investor interest and focus management on fewer things.”\n\nIn December WBD announced a separation of streaming and studio operations. The company has been positioning its streaming service as a premium destination with titles such as “The Last of Us” and “Hacks,” after initially betting that a blend of HBO dramas and Discovery’s lifestyle content would broaden its appeal.\n\nIt revived the HBO Max branding last month to underscore this renewed emphasis on premium content, and aid global expansion. The streaming service had about 122 million subscribers as of March. It expects its subscriber base to exceed 150 million by the end of 2026, which would still trail Netflix’s more than 300 million subscribers and the combined 181 million subscribers of Disney+ and Hulu.\n\nSome analysts now expect more deals in the media sector, pointing to Comcast’s plan to spin off most of its cable networks, including MSNBC and CNBC.\n\n“The outlook for the cable network business broadly is pretty ugly and I assume there will be consolidation there,” said Jeff Wlodarczak, analyst at Pivotal Research Group.\n\nHe said WBD’s cable networks could be a logical fit for Comcast’s upcoming cable spinoff, while its streaming and studios business might combine with another player such as Comcast’s Peacock.\n\nAny merger will require approval from U.S. antitrust regulators, who have signaled they intend to focus on mergers that reduce competition in ways that harm consumers or workers.\n\nIndustry observers say consolidation would likely increase consumer prices. The trend has already begun, as streaming services look to turn a profit.\n\nZaslav has said he expects a more deal-friendly environment under Trump. During his first term, Trump repeatedly attacked CNN, and his Department of Justice moved to block the AT&T–Time Warner merger. The pending Paramount Global-Skydance Media merger has yet to gain regulatory approval, as Trump presses his civil suit against Paramount’s CBS News for its “60 Minutes” interview last October with his Democratic rival for the White House, former Vice President Kamala Harris.\n\nJ.P. Morgan and Evercore are advising WBD on the deal, while Kirkland & Ellis is serving as legal counsel.\n\nAdditional reporting by Akash Sriram.","summary":"Warner Bros Discovery said it would split into two publicly traded companies, separating its studios and streaming business from its fading cable television networks as the parent of HBO and CNN looks to compete better in the streaming era.","url":"https://www.staradvertiser.com/2025/06/09/breaking-news/warner-bros-discovery-splits-streaming-and-cable-into-2-firms/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/06/web1_20250609_brk_wbr01.jpg","video":null,"publish_date":"2025-06-09 18:00:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":-0.093},{"id":329680090,"title":"ROOKE: Kamala Harris Learned Nothing From Past Sins, Latest Statement Shows","text":"Instead of sucking up to the political and corporate powers that dominate America, The Daily Caller is fighting for you — our readers. We humbly ask you to consider joining us in this fight.\n\nNow that millions of readers are rejecting the increasingly biased and even corrupt corporate media and \n joining us daily, there are powerful forces lined up to stop us: the old guard of the news media hopes \n to marginalize us; the big corporate ad agencies want to deprive us of revenue and put us out of business; \n senators threaten to have our reporters arrested for asking simple questions; the big tech platforms want \n to limit our ability to communicate with you; and the political party establishments feel threatened by our \n independence.\n\nWe don't complain -- we can't stand complainers -- but we do call it how we see it. We have a fight on our \n hands, and it's intense. We need your help to smash through the big tech, big media and big government blockade.\n\nWe're the insurgent outsiders for a reason: our deep-dive investigations hold the powerful to account. \n Our original videos undermine their narratives on a daily basis. Even our insistence on having fun infuriates \n them -- because we won’t bend the knee to political correctness.\n\nOne reason we stand apart is because we are not afraid to say we love America. We love her with every fiber of \n our being, and we think she's worth saving from today’s craziness.\n\nHelp us save her.\n\nA second reason we stand out is the sheer number of honest responsible reporters we have helped train. We have \n trained so many solid reporters that they now hold prominent positions at publications across the political \n spectrum. Hear a rare reasonable voice at a place like CNN? There’s a good chance they were trained at Daily \n Caller. Same goes for the numerous Daily Caller alumni dominating the news coverage at outlets such as Fox News, \n Newsmax, Daily Wire and many others.\n\nSimply put, America needs solid reporters fighting to tell the truth or we will never have honest elections or a \n fair system. We are working tirelessly to make that happen and we are making a difference.\n\nSince 2010, The Daily Caller has grown immensely. We're in the halls of Congress. We're in the Oval Office. \n And we're in up to 20 million homes every single month. That's 20 million Americans like you who are impossible \n to ignore.\n\nWe can overcome the forces lined up against all of us. This is an important mission but we can’t do it unless you — \n the everyday Americans forgotten by the establishment — have our back.\n\nPlease consider becoming a Daily Caller Patriot today, and help us keep doing work that holds politicians, \n corporations and other leaders accountable. Help us thumb our noses at political correctness. Help us train a new \n generation of news reporters who will actually tell the truth. And help us remind Americans everywhere that there \n are millions of us who remain clear-eyed about our country's greatness.\n\nIn return for membership, Daily Caller Patriots will be able to read The Daily Caller without any of the ads that \n we have long used to support our mission. We know the ads drive you crazy. They drive us crazy too. But we need \n revenue to keep the fight going. If you join us, we will cut out the ads for you and put every Lincoln-headed cent \n we earn into amplifying our voice, training even more solid reporters, and giving you the ad-free experience and \n lightning fast website you deserve.\n\nPatriots will also be eligible for Patriots Only content, newsletters, chats and live events with our reporters \n and editors. It's simple: welcome us into your lives, and we'll welcome you into ours.\n\nWe can save America together.\n\nBecome a Daily Caller Patriot today.","summary":"'Her motive is and always will be to promote left-wing violence'","url":"https://dailycaller.com/2025/06/09/rooke-kamala-harris-los-angeles-riots-statement-violence-protests/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/06/GettyImages-2218983750-scaled-e1749486035114.jpg","video":null,"publish_date":"2025-06-09 17:40:26","author":"Mary Rooke","authors":["Mary Rooke"],"language":"en","source_country":"US","sentiment":-0.054},{"id":329688920,"title":"Woke reporter denies there are riots and looting in LA while chaos unfolds behind him","text":"A local TV reporter in Los Angeles questioned whether the city's violent unrest qualified as rioting - even as a fire burned behind him live on the air.\n\nABC7 reporter Tim Caputo insisted that the 'vast majority' of protestors involved in the demonstrations were 'people taking videos [and] people waving flags' during his one-the-ground report.\n\nHe made the remarks as black smoke billowed into the air behind him and a loud explosion could be heard in the distance.\n\nDuring the segment, ABC7 anchor Jory Rand asked whether those responsible for torching five vehicles were 'a group that splintered off,' 'mak[ing] it look like it's a lot worse than the situation actually playing out on the ground.'\n\n'That's the quintessential question when you have rallies, demonstrations, riots, if you will,' Caputo replied.\n\n'I wouldn't go as far to call it that. I know president Trump had tweeted about riots and looting - I don't know that I would characterize it that way.'\n\nAs the broadcast showed aerial images of cars on fire, Caputo directed his cameraman away from rising smoke.\n\n'From what we've seen... the vast majority are people taking videos, people waving flags, people walking around, people wanting to be part of the cause, wanting to have their voices heard, and wanting to show the power of numbers and the power of force,' the reporter said. \n\nThe clip was quickly re-shared on social media, earning swift criticism from viewers.\n\n'If you take out the really violent stuff it's relatively peaceful,' one X user joked.\n\n'He thinks we have no eyes to see,' another chimed. \n\n'Is this AI,' a third quipped.\n\nThe chaos was triggered Friday by immigration raids that resulted in dozens of arrests of what authorities say are illegal migrants and gang members.\n\nPolice ordered the public to disperse from downtown overnight after an intense day of demonstrations in the region. Around 300 National Guard troops were deployed to the region, spurring anger and fear among many residents.\n\nBy noon local time on Sunday, hundreds had gathered outside the Metropolitan Detention Center in downtown Los Angeles, where Caputo was reporting. \n\nProtesters there approached members of the federal agency and were fired upon with control munitions.\n\nThe group then moved to block traffic on the 101 freeway. The 300 guards called to the crisis have were seen using tear gas, rubber bullets, and flash bangs to control the crowds.\n\nPresident Trump has said the National Guard was necessary because Gov. Gavin Newsom and other Democrats have failed to quell recent protests targeting immigration agents. \n\nHouse Speaker Mike Johnson, a staunch Trump ally, endorsed the president’s move, doubling down Trump's recent criticisms of California democrats and their cooperation with his orders.\n\nFormer Vice President Kamala Harris, who lives in Los Angeles, said the immigration arrests and Guard deployment were designed as part of a 'cruel, calculated agenda to spread panic and division.","summary":"A local TV reporter questioned whether the city's violent unrest qualified as rioting - even as a fire burned behind him live on the air.","url":"https://www.dailymail.co.uk/media/article-14794415/tim-caputo-riots-la-abc-eyewitness-news.html","image":"https://i.dailymail.co.uk/1s/2025/06/09/15/99180685-0-An_ABC7_Los_Angeles_reporter_refused_to_brand_recent_unrest_in_t-a-21_1749479557467.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/09/5629869317743790236/1024x576_MP4_5629869317743790236.mp4","publish_date":"2025-06-09 17:04:11","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.31},{"id":329660078,"title":"Whoopi Goldberg calls out “The View” cohosts over 'fake' Donald Trump vs. Elon Musk feud: 'Y'all bought into it'","text":"The View's Whoopi Goldberg doesn't trust Donald Trump — even when he's feuding with his 2024 presidential election ally Elon Musk.\n\n On Monday's live show, the Oscar-winning Ghost actress held firm in her belief that Trump's recent headline-making clash with Musk — the billionaire who helped Trump win the race against Vice President Kamala Harris — isn't real.\n\n \"In this fight, my money is on Donald Trump, though, because he clapped back and said he'll go after Elon's Pentagon contracts,\" former Trump associate and current conservative View cohost Alyssa Farah Griffin said during a Hot Topics discussion about the feud, which prompted Goldberg to push back against her.\n\n \"I love that y'all bought into it,\" the 69-year-old said.\n\n Griffin countered, looking toward Goldberg as she stressed, \"It's not fake,\" with the actress hitting back when she repeated, \"I do believe it's fake. Yes, I do. It's too strategic.\"\n\n The Republican panelist said she felt that Goldberg was \"giving him too much credit\" in assuming that he'd concocted his feud with Musk — an assertion Goldberg staunchly opposed.\n\n \"No, no, no. I just feel like, oh, suddenly everybody's upset about stuff. I'm sorry, no,\" Goldberg replied. \"This is another distraction to keep us talking — not about the stuff we're talking about, but the stuff they want us to. I'm not buying it. I'm not buying it because they lie.\"\n\n She finished, \"I don't believe anything they say anymore because they've shown themselves not to be the most trustworthy people you want.\"\n\n Late last week, Trump and Musk sparred over the former's proposed \"big beautiful bill,\" with Musk taking issue over the proposed bill's impact on the federal deficit.\n\n In response, Musk claimed that Trump's administration withheld information indicating that Trump was mentioned in records related to child sex offender Jeffrey Epstein.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n In a subsequent interview with Theo Von, Vice President JD Vance responded to the claim, saying, \"Donald Trump didn’t do anything wrong with Jeffrey Epstein.\"\n\n When reached for comment on Goldberg's assessment and Musk's claim that Trump was associated with Epstein, the White House press team provided Entertainment Weekly with an unrelated statement from White House Press Secretary Karoline Leavitt.\n\n The statement indicated that Trump \"will continue the important mission of cutting waste, fraud, and abuse from our federal government,\" though it did not answer EW's inquiries directly.\n\n EW has additionally reached out to representatives for Musk for comment.\n\n The View airs weekdays at 11 a.m. ET/10 a.m. PT on ABC.","summary":"\"It's not fake,\" Alyssa Farah Griffin — who previously worked for Donald Trump — countered. \"You're giving him too much credit.\"","url":"https://ew.com/whoopi-goldberg-calls-out-the-view-cohosts-donald-trump-elon-musk-feud-11750525","image":"https://ew.com/thmb/oKEBuGMhUkGYsFVz0GnFLJI5vZo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/The-View-Donald-Trump-Elon-Musk-060925-d7bb9c3e3d674b18839584d26934409e.jpg","video":null,"publish_date":"2025-06-09 16:30:57","author":"Joey Nolfi","authors":["Joey Nolfi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.232},{"id":329668124,"title":"The best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, and more","text":"Skip to main content\n\nGames Radar\n\nRetro Gamer\n\nTotal Film \nThe smarter take on movies\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99View\n\nBest Netflix Movies\nBest movies on Disney Plus\nMovie Release Dates\nBest Netflix Shows\n\nRecommended reading\n\nStreaming Services\nThe best new shows and movies streaming this week on Netflix, HBO Max, Disney Plus, and more\n\nStreaming Services\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, and more\n\nStreaming Services\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, HBO Max, and more\n\nStreaming Services\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus and more\n\nStreaming Services\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus and more\n\nStreaming Services\nThe best new shows and movies streaming this week on Disney Plus, Netflix, Prime Video, and more\n\nStreaming Services\nThe best new shows and movies streaming this week on Netflix, Apple TV Plus, HBO Max, and more\n\nEntertainment\n\nStreaming Services\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, and more\n\nWill Salmon \n\n9 June 2025\n\nCheck out our guide to the best movies and shows streaming this week, June 9–June 15\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: Netflix)\n\nWelcome back to our weekly guide to the best new shows and movies! On this page you'll find our picks for six great films and TV series, all of which are available to stream this week.\n\nIt's really hard to stay on top of all the new shows and movies vying for your attention each week. That's why we've put together this handy list, which covers many of the best streaming services out there, including Netflix, Prime Video, Disney Plus, and more.\nIt's a slightly quieter week than usual (the second half of June is crammed with new releases), but there's still plenty of intriguing choices out there including the return of Netflix's Arnie action series Fubar, Tyler Perry's new movie, and Call Her Alex – the insightful new documentary about Call Her Daddy co-creator Alexandra Cooper. So go grab your snacks, sit back, relax, and let's plan the week's viewing.\n\nYou may like\n\nThe best new shows and movies streaming this week on Netflix, HBO Max, Disney Plus, and more\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, and more\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, HBO Max, and more\n\n(Image credit: Christos Kalohoridis/Netflix)\nAvailable: US\nWhere to watch: Netflix\n\nThe second season of Arnie's explosive action comedy Fubar arrives on Netflix this week. Schwarzenegger plays Luke Brunner, a CIA operative who has always kept the nature of his work secret from his daughter Emma (Monica Barbaro). The only trouble is, Emma is also secretly employed by the agency...\nFubar season one ended with the Brunners' identities being leaked and the threat of old enemies coming after them, something that season 2 makes good on with the arrival of The Matrix star Carrie-Anne Moss as Greta Nelson, a German spy – and Luke's ex! Packed with thrilling action set pieces and some solid – and even occasionally quite touching – character work as this father and daughter finally get to really know each other, this is hugely entertaining blockbuster TV and a good reminder of just how skilled a comic actor Schwarzenegger is.\nCheck out our guide to the best Netflix shows to watch right now.\nThe Accountant 2\n\n(Image credit: Amazon MGM Studios)\nAvailable: US/UK\nWhere to watch: Prime Video\nIf Fubar hasn't satiated your action appetite this week, then this belated follow-up to the 2016 action film The Accountant surely will. Ben Affleck stars once again as Christian Wolff, the titular bookkeeper. This isn't a story about someone filing tax returns, however – Christian has some serious connections to the criminal underworld, and he'll need to call on them – and his estranged hitman brother Braxton (Jon Bernthal) – when he uncovers a mystery connected to the death of an old friend...\nThe original Accountant movie was a solid, if unspectacular thriller, so it's nice to be able to say that this sequel is a huge improvement in almost every way. The plot is stronger, the action scenes more exciting. Affleck and Bernthal continue to have great chemistry as two estranged brothers who are forced to work together in very difficult circumstances. Exciting stuff.\nKeep track of the best upcoming movies in 2025 and beyond.\nROMCON: Who the F**k is Jason Porter?\n\n(Image credit: Amazon Prime Video)\nAvailable: US/UK\nWhere to watch: Amazon Prime Video\nThis two-part Amazon Original documentary may just put you off dating for life. Toronto real Estate broker Heather Rovet met handsome handyman Jace Peretti in 2018 and the two quickly embarked on a whirlwind relationship. Over time, however, cracks started to show in the relationship, with friends claiming to have seen Jace on dating apps. An accidental discovery eventually revealed the awful truth: \"Jace Peretti\" was actually Jason Porter, a serial thief and fraudster.\nROMCON: Who the F**k is Jason Porter? sees Rovet change from being the heartbroken victim of a horrifyingly cruel romance scam (one that cost her hundreds of thousands of dollars) to someone determined to bring Porter to justice.\nThese are the best shows on Amazon Prime Video to watch right now.\nTyler Perry's Straw\n\n(Image credit: Chip Bergmann/Perry Well Films 2/Netflix)\nAvailable: US/UK\nWhere to watch: Netflix\nTyler Perry may be best known as a comic actor and as the creator of the Madea films, but he's also a versatile writer and director. This crime thriller certainly leans into the more serious side of his writing. Straw follows Janiyah Wiltkinson (Taraji P. Henson), a struggling single mom living in a run down apartment with her starving daughter Aria (Gabrielle E Jackson). While having the day from Hell, Janiyah gets caught up in a robbery – and events spiral drastically out of control...\nTaraji P. Henson is terrific in this intense and stressful thriller about a normal woman pushed fully over the edge. The sheer number of disastrous things that happen to Janiyah in Straw arguably strains credulity a little, but there's a real sense of catharsis as she finally starts to kick back against an unfair system.\nOur list of the best Netflix movies is well-stocked with classics.\nCall Her Alex\n\n(Image credit: Disney)\nAvailable: US\nWhere to watch: Hulu\nAlexandra Cooper is the co-creator (with Sofia Franklyn) and host of Call Her Daddy – a sex advice and comedy show that, since its launch in 2018, has grown into one of the world's most popular podcasts. This two-part documentary follows Cooper as she prepares for her first-ever live show, revealing her anxieties around the tour and delving into the important relationships in her life. It's an honest, intimate, and sometimes harrowing story.\nWhile the first part reveals Cooper's early years, the second episode delves deeper into the story of Call Her Daddy itself, including the highs – an astonishingly lucrative Spotify deal and a high-profile interview with Kamala Harris – and the lows, such as some very public falling out. This is a fast-moving and engaging documentary that's not just for members of Cooper's \"Daddy Gang.\"\nFind something to watch with our list of the best Hulu movies.\nThe Kollective\n\n(Image credit: Hulu)\nAvailable: US/UK\nWhere to watch: Hulu\nThis globe-trotting series follows a team of citizen journalists as they set out to expose a terrifying conspiracy in the wake of a plane crash. Inspired by the real life Netherlands-based investigative journalism group Bellingcat, The Kollective is a smart six-part drama that sees the brave journos uncover government corruption and assassination orders – but will they survive long enough to get the news out to the world?\nThe show stars Californication's Natascha McElhone, Céline Buckens, Felix Mayr, and more, and looks like a dark delve into a web of lies and intrigue, while staying rooted somewhat in fact. It starts streaming on June 10.\nCheck out our guide to the best shows on Hulu for more streaming inspiration.\n\nLooking for something else to watch? Check out our list of the best movies on Disney Plus.\n\nAmazon Prime Video\nDisney Plus\n\nWill Salmon\n\nSocial Links Navigation\nStreaming Editor\n\nWill Salmon is the Streaming Editor for GamesRadar+. He has been writing about film, TV, comics, and music for more than 15 years, which is quite a long time if you stop and think about it. At Future he launched the scary movie magazine Horrorville, relaunched Comic Heroes, and has written for every issue of SFX magazine for well over a decade. His music writing has appeared in The Quietus, MOJO, Electronic Sound, Clash, and loads of other places too.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nThe best new shows and movies streaming this week on Netflix, HBO Max, Disney Plus, and more\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, and more\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus, HBO Max, and more\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus and more\n\nThe best new shows and movies streaming this week on Netflix, Prime Video, Disney Plus and more\n\nThe best new shows and movies streaming this week on Disney Plus, Netflix, Prime Video, and more\n\nLatest in Streaming Services\n\nCreators of Splinter Cell's Netflix series namecheck its wildest inspirations, from Ghost in the Shell to Tom Cruise – and respond to Sam Fisher's \"important\" recasting\n\nA new Netflix crime thriller series is climbing the streamer's charts, but you probably haven't heard of it\n\nMartin Scorsese thought his cameo in Apple TV Plus show with great Rotten Tomatoes score was being filmed \"wrong,\" but he didn't want to \"be a backseat director\" and point it out \n\nAndor fans think the Star Wars show recontextualizes a Cassian and Jyn moment in Rogue One: \"Andor has truly increased the depth and meaning of anything it touches\"\n\nIf you're still upset about Joel in The Last of Us season 2, the co-creator wants you to remember that Pedro Pascal is actually \"alive\" and he's \"in literally everything else\" \n\nAmazon's Mass Effect TV show is moving forward with Star Trek writer as showrunner\n\nLatest in News\n\nMario Kart World has Mirror Mode after all, and you can even explore it in Free Roam thanks to this Super Mario 64 Easter egg\n\nCreators of Splinter Cell's Netflix series namecheck its wildest inspirations, from Ghost in the Shell to Tom Cruise – and respond to Sam Fisher's \"important\" recasting\n\nDeltarune has already been patched 3 times in its opening weekend, with Toby Fox and the team fixing crashes, freezes, and maybe a Geneva Convention violation\n\nThe sandworm in Dune: Awakening mysteriously vanished from the MMO and nobody knows why, but I have good news: it's back\n\nBethesda-approved Skyblivion is suddenly more than just an exciting remake – it's a poster child for a potential game-changer for mods: one-click modding on GOG\n\nAs another year passes with no Elder Scrolls 6 news nearly 14 years since Skyrim, Bethesda fans gather to mourn what could've been at Summer Game Fest 2025: \"I feel like giving up\"\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nFast Fusion review: \"Futuristic racing from the same mold as Wipeout and F-Zero shines on Switch 2\"\n\nJaipur review: \"Lightning in a bottle\"\n\nMario Kart World review in progress: \"Leaves it all out on the track and in between tracks too\"\n\nQueen by Midnight review: \"Saddled by excess that would make a real princess shudder\"\n\nBattle for the Deep review: \"A new and unique take on the long-running, beloved Axis & Allies franchise\"\n\nPredator: Killer of Killers review: \"Great characters, thrilling action, and gorgeous Arcane-esque animation\"\n\nFrom the World of John Wick: Ballerina review: \"Brilliant action, even if the plot gives you a sense of déjà vu\"\n\nKarate Kid: Legends review: \"Better than Karate Kid (2010), nothing on Karate Kid (1984)\"\n\nMission: Impossible – The Final Reckoning review: \"Wraps up this spy franchise in spectacular style with Tom Cruise in peak condition, even if its villain lacks terror\"\n\nFinal Destination Bloodlines Review: \"Meticulous murderous mayhem\" \n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nRick and Morty season 8 review: \"Largely plays it too safe after years of crossing boundaries\"\n\nDoctor Who season 2, episode 6 spoiler review: 'The Interstellar Song Contest' is \"a blast and sets the stage for a thrilling season finale\"\n\nDoctor Who season 2, episode 5 spoiler review: 'The Story & The Engine' is \"one of the most original and ambitious episodes this show has produced in years\"\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...","summary":"Check out our guide to the best movies and shows streaming this week, June 9–June 15","url":"https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-june-9-2025/","image":"https://cdn.mos.cms.futurecdn.net/Xw4vFDNPARXPpf5R8NHX9B.jpg","video":null,"publish_date":"2025-06-09 16:29:59","author":"Will Salmon","authors":["Will Salmon"],"language":"en","source_country":"us","sentiment":0.699},{"id":329667492,"title":"Harris ripped for 'appalling' LA ICE raids statement placing blame on Trump: 'The country dodged a bullet'","text":"Former Vice President Kamala Harris was slammed by conservatives on social media after she issued a statement on the anti-ICE riots in Los Angeles, blaming the Trump administration and calling the unrest \"overwhelmingly peaceful.\" \"Los Angeles is my home,\" Harris posted Sunday as riots had broken out across the city for several days, led by protesters upset with federal agents arresting illegal immigrants in the city, prompting the Trump administration to send in the National Guard. \"And like so many Americans, I am appalled at what we are witnessing on the streets of our city,\" she said. \"Deploying the National Guard is a dangerous escalation meant to provoke chaos. In addition to the recent ICE raids in Southern California and across our nation, it is part of the Trump Administration's cruel, calculated agenda to spread panic and division.\" Harris added that the Trump administration is not concerned about \"public safety\" but rather \"stoking fear.\" ANTI-ICE PROTESTERS IN LOS ANGELES SPIT ON AND BURN AMERICAN FLAG \"Protest is a powerful tool — essential in the fight for justice. And as the LAPD, Mayor, and Governor have noted, demonstrations in defense of our immigrant neighbors have been overwhelmingly peaceful,\" Harris said. \"I continue to support the millions of Americans who are standing up to protect our most fundamental rights and freedoms.\" Harris’ comments were immediately criticized by conservatives online and by Trump officials. \"The country really dodged a bullet in November,\" Fox News contributor Guy Benson posted on X. In another post, Benson added, \"Their official position is that they’re appalled by what’s happening in Los Angeles…because of Trump and ICE, not the violent rioters. In its current form, this party cannot be salvaged.\" FBI SEARCHING FOR SUSPECT WHO ALLEGEDLY ASSAULTED FEDERAL OFFICER DURING ANTI-ICE RIOTS IN LOS ANGELES \"Thank you, America, for employing brain cells and rejecting this woman’s quest to become president of the United States,\" Fox News contributor Katie Pavlich posted on X. Others, including the conservative influencer account LibsofTikTok, took issue with Harris calling the unrest \"mostly peaceful\" by responding with pictures of rioters burning cars and attacking law enforcement. \"No surprise[sic] that the most incompetent Vice President in history stands with the illegal alien rioters,\" GOP Sen. Tom Cotton posted on X. White House principal deputy press secretary Harrison Fields responded on X by saying, \"America’s statement\" along with a photo showing the gains President Donald Trump made across the country in the November 2024 election. \"No one is interested in your opinion,\" Senior Counsel to the Assistant Attorney General for Civil Rights Leo Terrell posted on X. \"President Trump didn’t start these riots,\" California GOP gubernatorial candidate and Riverside County Sheriff Chad Bianco posted on X. \"He’s not out there lighting cars on fire, hurling projectiles at law enforcement or blocking freeways. This statement is an embarrassment and does nothing to diffuse the violent riots taking place across the city.\" \"The Democrats and their ‘leaders’ own this.\" TRUMP'S ICE LAUNCHES BOLD COURTHOUSE MIGRANT ARREST STRATEGY TO FAST-TRACK DEPORTATIONS BIDEN AVOIDED Steve Hilton, a Fox News contributor also running for California governor as a Republican, posted on X, \"In this appalling statement you are siding with violent criminals over California communities; rioters over law enforcement; illegal immigrants over legal immigrants and American citizens.\" \"You are a pandering machine politician who should never hold public office again.\" White House deputy press secretary Abigail Jackson posted on X, \"We all know you support lawless, violent, illegal alien rioters. That’s why you lost so badly in November. Back to irrelevancy you go!\" Fox News Digital reached out to Harris’ office for comment but did not receive a reply. Trump deployed 2,000 National Guard troops to the city in an effort to quell some of the unrest, much to the dismay of Democratic officials. The violent protests erupted as ICE officials carried out plans to remove individuals illegally residing in the left-wing city, which dubbed itself a \"sanctuary\" for illegal immigrants in November 2024 before Trump was sworn back into the Oval Office in January. CLICK HERE TO GET THE FOX NEWS APP ICE raids began Friday, with Los Angeles Mayor Karen Bass issuing a statement supporting illegal immigrants in the city and bucking the Trump administration's deportation efforts. California Gov. Gavin Newsom similarly criticized ICE efforts, branding the immigration raids \"chaotic and reckless.\" \"Continued chaotic federal sweeps, across California, to meet an arbitrary arrest quota are as reckless as they are cruel,\" a statement from the governor read. \"Donald Trump’s chaos is eroding trust, tearing families apart, and undermining the workers and industries that power America’s economy.\" During the riots, ICE officers were targeted with violence that included throwing rocks and other projectiles along with vandalism in the form of graffiti calling for violence against ICE officers. U.S. Border Patrol Chief Michael Banks shared a photo of one Border Patrol agent's bloody hand, which was injured by a rock flying through the windshield. Federal sources said agents could have been killed by the flying debris and several officers have been reported as injured during the rioting. ICE agents captured the \"worst of the worst\" criminal illegal immigrants during Friday operations, including murderers, sex offenders and other violent criminals, the agency said Sunday. About 45 people were arrested across several locations, including two Home Depot stores, a store in the fashion district and a doughnut shop. \"Why do Governor Newsom and Los Angeles Mayor Karen Bass care more about violent murderers and sex offenders than they do about protecting their own citizens?\" asked Department of Homeland Security Assistant Secretary Tricia McLaughlin. \"These rioters in Los Angeles are fighting to keep rapists, murderers, and other violent criminals loose on Los Angeles streets,\" she said. \"Instead of rioting, they should be thanking ICE officers every single day who wake up and make our communities safer.\" Fox News Digital's Taylor Penley, Emma Colton, Greg Wehner and Bill Melugin contributed to this report.","summary":"Former Vice President Kamala Harris was widely mocked on social media over her official statement on the riots that have broken out in Los Angeles in response to ICE raids.","url":"https://www.foxnews.com/politics/harris-ripped-appalling-la-ice-raids-statement-placing-blame-trump-the-country-dodged-bullet","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/adobe-express-file-70.png?ve=1&tl=1","video":null,"publish_date":"2025-06-09 16:27:18","author":"Andrew Miller","authors":["Andrew Miller"],"language":"en","category":"politics","source_country":"US","sentiment":-0.115},{"id":329659248,"title":"Five Instances of Bureaucratic Negligence Allowing Coronavirus Aid Fraud to Occur","text":"Home News Five Instances of Bureaucratic Negligence Allowing Coronavirus Aid Fraud to Occur\n\nFive Instances of Bureaucratic Negligence Allowing Coronavirus Aid Fraud to Occur\n\nPublished on 09 June 2025\n\nInternewscast\n\nCoronavirus,\n\nJoni Ernst,\n\nKelly Loeffler,\n\nSmall Business Administration\n\nShare this @internewscast.com\n\nFacebookXRedditPinterest\n\nShare this @internewscast.com\n\nFacebookXRedditPinterest\n\nYou May Also Like\n\nA college student has died after eating a late-night snack that contained…\n\nInternewscast\n\nJune 9, 2025\n\nAn iconic 80s actress looked unrecognizable as she stepped out in LA…\n\nInternewscast\n\nJune 8, 2025\n\nSecretary Kristi Noem avoided giving a direct response when CBS host Margaret…\n\nInternewscast\n\nJune 8, 2025\n\nGavin Newsom confronted Tom Homan, daring him to arrest him while blaming…\n\nInternewscast\n\nJune 9, 2025\n\nThe Israeli Defense Forces (IDF) have announced that Hamas leader Mohammed Sinwar…\n\nInternewscast\n\nJune 8, 2025\n\nThe star-studded 78th Annual Tony Awards were held at Radio City Music Hall…\n\nInternewscast\n\nJune 9, 2025\n\nGavin Newsom is engaged in a tense struggle for authority in Los…\n\nInternewscast\n\nJune 9, 2025\n\nDonald Trump asserted ‘bring in the troops’ and demanded the arrest of…\n\nInternewscast\n\nJune 9, 2025\n\nLos Angeles is in turmoil as protesters have taken over the 101…\n\nInternewscast\n\nJune 9, 2025\n\nOutstanding Play “English” by Sanaz Toossi The Hills of California — Author:…\n\nInternewscast\n\nJune 9, 2025\n\nFormer vice president and former 2024 Democrat presidential candidate Kamala Harris has…\n\nInternewscast\n\nJune 8, 2025\n\nGeorge Clooney’s return to silver fox status is nearly complete, several months…\n\nInternewscast\n\nJune 9, 2025\n\nLOS ANGELES — California Governor Gavin Newsom announced that the state is…\n\nInternewscast\n\nJune 9, 2025\n\nIn May of 2025, reports emerged that Palantir, co-founded by Peter Thiel,…\n\nInternewscast\n\nJune 9, 2025\n\n“Once a thriving metropolis, Los Angeles has been overrun by illegal immigrants…\n\nInternewscast\n\nJune 9, 2025\n\nFormer CNN anchor Chris Cuomo launched into a furious tirade at a…\n\nInternewscast\n\nJune 9, 2025","summary":"Internewscast Journal\n\nInternewscast\n\n\nPolitics Entertainment Media Economy World London / Europe Border / Cartel Chronicles&#8230;\n\n\nThis Post: Five Instances of Bureaucratic Negligence Allowing Coronavirus Aid Fraud to Occur first appeared on Internewscast Journal","url":"https://internewscast.com/news/five-instances-of-bureaucratic-negligence-allowing-coronavirus-aid-fraud-to-occur/","image":"https://internewscast.com/wp-content/uploads/2025/06/rewrite-this-title-Five-Times-Bureaucrats-Were-Asleep-at-the.jpg","video":null,"publish_date":"2025-06-09 16:16:21","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.01},{"id":329686062,"title":"Democrats Just Can’t Quit the Looters and Rioters","text":"Apparently, the first thing you need to know about the rioting in Los Angeles over the weekend is that you don’t need to care about it.\n\nMaybe you saw them — the mob of vandals who now hide their identity with a keffiyeh rather than a surgical mask, who waved Mexican flags and brandished Hamas regalia (sometimes on the same geopolitically ignorant arm), setting fire to ride shares they themselves ordered and raining missiles down on police trapped beneath an overpass. Well, that was just one part of Los Angeles, you see. And you should know that L.A. is big. Most Angelenos never experienced the riots. Why should they care if their neighbors are in distress amid social unrest that spreads like a contagion? You certainly shouldn’t.\n\nIn addition, Donald Trump is president. Have you accounted for that? Sure, at least 56 people were arrested when riot police were deployed to quell the disturbance, but there would have been no demonstrations at all if the Trump administration hadn’t ordered an immigration-enforcement operation that inspired protesters to block law enforcement from fulfilling their official duties.\n\nThen there was the administration’s decision to deploy 300 National Guard troops to the city. That maneuver was described as “too quick” by Los Angeles police. California Governor Gavin Newsom deemed the decision “illegal, immoral, and unconstitutional,” and he dared Trump border czar Tom Homan to “arrest me.” He promised to sue the federal government over its response to the violence in the streets, putting the focus where it should be — on Newsom’s ambitions and on Trump, the font from which all American ills spring.\n\nAnd don’t you remember that Republicans also rioted that one time? If you thought that was bad, it follows that you cannot find other episodes of violent street action similarly egregious — especially if the violence is perpetrated by vandals who subscribe to the politics of the left. That kind of consistency just has no place in activist discourse.\n\nOf course, the attitude outlined above, on full display right now with the L.A. riots, amounts to a tacit admission that the Democratic Party — in California and elsewhere — understands the extent to which it has become associated with violent hooliganism of this sort. Progressives’ own statements reflect their deserved insecurity and the extent to which they know that the rioters are their people.\n\nFormer Vice President Kamala Harris did not even acknowledge the violence. Instead, she deemed the demonstrations “overwhelmingly peaceful” and civic-minded, castigating the Trump administration for deploying the Guard — a “dangerous escalation meant to provoke chaos.” The rioters know not what they do; they merely respond mechanically and understandably to provocations from above.\n\nNewsom also appealed to flattery. These protests were “provoked by chaos from Washington,” he remarked. “Don’t give Donald Trump what he wants,” the governor added. In expressing similar sentiments, Senator Adam Schiff gave the game away. Violence “is never the answer” and “assaulting law enforcement is never ok,” he observed. “Indeed, doing so plays directly into the hands of those who seek to antagonize and weaponize the situation for their own gain,” the senator continued. “Don’t let them succeed.”\n\nThe conceit in all this is that the rioters can be reasoned with. Maybe they can be complimented and cajoled into abandoning their subversion. Perhaps if they are confronted with the potential for their activities to undermine the Democratic Party’s political goals — objectives the rioters presumably share with their kowtowers in power — they might pacify themselves. Do these barbarians not read The Atlantic? The subtext is obvious: We’re all on the same side here.\n\nThe misconceptions fueling these appeals are illustrative of the problem Democrats dare not acknowledge. They’re right, of course; these are their people. They should not be. They don’t have to be. But the party has for too long seen expressions of violent political passion as a force to be co-opted, harnessed, and wielded. They were open about the goals that informed this ill-conceived project, and we all saw them pursue it. Even today, amid the ashes of the Harris campaign’s attempt to incorporate anarchistic violence into her coalition, Democrats cannot bear to admit the error, much less correct for it.\n\nThere are a few practical notions that Democrats should, by now, have learned to stop rebelling against. Riots and criminal disorder erode faith in government and, accordingly, “the party of government.” Violent social disorder is a contagion that will expand unless it is stopped. Stopping it requires the early, overwhelming intervention by law enforcement, the presence of which discourages would-be participants from joining the mêlée. By calling out the National Guard, the Trump administration put pressure on local authorities to respond with more firmness to the violence than they would otherwise.\n\nDemocrats don’t have to sidle up subserviently alongside the president to display some fealty to these elementary propositions, but nor do they have to position themselves as hostile to the conditions that restore order once it has broken down. They just can’t help themselves. And they cannot help themselves because, at some level, they see these hopeless malcontents as critical elements of their political coalition. At the very least, Democrats have fetishized expressions of uncompromising zeal, even the violent sort, to the point that even the preservation of public safety comes across as suspiciously Trump-coded.\n\nRioting is a clear-cut issue. Democrats have talked themselves into the idea that they have to walk a rhetorical tightrope amid outbreaks of left-wing violence, and that has done inestimable damage to the party’s brand. They must find the courage to jettison this millstone around their necks. That would not be so difficult if Democrats could convince themselves that the masked arsonists and looters ransacking American cities are not their people.\n\nAs long as the party out of power in Washington believes it must cater to the most unsympathetic actors on the fringes of American public life, it’ll allow the GOP to claim a monopoly on law and order. That is what government is for, after all — not redistributing income, picking winners and losers in the economy, or enforcing a more egalitarian social compact, but preserving the peace.\n\nIf the party of government can’t get the basics of government right, why should it be trusted on anything else?","summary":"But if they want to restore their brand, they’ll have to realize that masked arsonists burning down cities must not really be their people.","url":"https://www.nationalreview.com/2025/06/democrats-just-cant-quit-the-looters-and-rioters/","image":"https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2025/06/dems-los-angleles-protests-ice3.jpg?fit=2057%2C1200&ssl=1","video":null,"publish_date":"2025-06-09 16:10:27","author":"Noah Rothman","authors":["Noah Rothman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.28},{"id":329657548,"title":"Republican lawmakers back Trump administration in the heat of Los Angeles riots","text":"On Saturday night, Trump ordered the deployment of the National Guard in California. Gov. Gavin Newsom (D-CA) condemned the move, calling the Trump administration’s order “unlawful.”\n\nMany Democrats, including former Vice President Kamala Harris, publicly criticized Trump’s decision. However, Republicans expressed strong support online.\n\nDepartment of Homeland Security Secretary Kristi Noem said in an X post on Saturday, “If @GavinNewsom was doing his job our ICE agents would not be injured and attacked while doing their jobs and carrying out immigration enforcement.”\n\n“Under the leadership of @POTUS Trump, we will put the safety of American citizens FIRST, not these criminal illegal aliens that sanctuary city politicians are defending,” she added.\n\nHouse Speaker Mike Johnson (R-LA) echoed Noem’s sentiment, saying Newsom is “inexplicably standing with criminals who attack our brave @ICEgov agents as they tirelessly try and fix the failures of the Biden Administration.”\n\nWith the California governor race looming, leading Republican candidates have used the chaos to promote their platforms.\n\nSheriff Chad Bianco, who is running as a Republican, responded to Harris’s defense of the riots, saying Trump “didn’t start these riots. He’s not out there lighting cars on fire, hurling projectiles at law enforcement, or blocking freeways. This statement is an embarrassment and does nothing to diffuse the violent riots taking place across the city.”\n\n“The Democrats and their ‘leaders’ own this,” Bianco said.\n\nFellow Republican contender Steve Hilton criticized a statement from Newsom, who he said is lying instead of leading.\n\n“The chaos and lawlessness was entirely caused by Democrats ‘sanctuary extremism,” Hilton said. “All of this would have been avoided if Democrats had worked WITH federal law enforcement instead of against it.”\n\nTrump addressed the situation on Truth Social early Monday morning.\n\n“Looking really bad in L.A. BRING IN THE TROOPS!!!” Trump said. “ARREST THE PEOPLE IN FACE MASKS, NOW!”\n\nIn response, Newsom announced plans for California to sue over the National Guard deployment. \n\n“This is exactly what Donald Trump wanted. He flamed the fires and illegally acted to federalize the National Guard,” Newsom said. “The order he signed doesn’t just apply to CA. It will allow him to go into ANY STATE and do the same thing. We’re suing him.”","summary":"Congressional Republicans took to social media to support President Donald Trump’s efforts to stop the Los Angeles riots. Protests erupted on Friday in response to a wave of Immigration and Customs Enforcement raids targeting illegal immigrants. The demonstrations quickly escalated into riots as demonstrators attacked police officers and looted businesses. On Saturday night, Trump ordered [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3435335/republican-lawmakers-support-trump-administration-los-angeles-riots/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/AP25160020322895.webp","video":null,"publish_date":"2025-06-09 16:03:39","author":"Ally Goelz","authors":["Ally Goelz"],"language":"en","category":"politics","source_country":"US","sentiment":-0.492},{"id":329661484,"title":"'Rising worry': Trump's trade war is increasingly jeopardizing a major campaign promise","text":"Although Donald Trump's narrow victory over Democratic presidential nominee Kamala Harris in 2024 was far from the \"landslide\" he claims it was — he won the national popular vote by roughly 1.5 percent — his emphasis on inflation and the economy helped get him past the finish line. Trump blamed Harris and then-President Joe Biden for inflation, and his messaging worked: Three Rust Belt states that went to Biden in 2020 — Pennsylvania, Michigan and Wisconsin — went to Trump in 2024.\n\nMany economists are warning, however, that Trump's steep new tariffs could bring about inflation much worse than that of the Biden era. And according to Bloomberg News reporters Mark Niquette, Miranda Davis and Brooke Sutherland, they also threaten his promise to create manufacturing jobs in the Rust Belt and the Midwest.\n\nIn an article published by Bloomberg News on June 9 and republished by Financial Post that day, the journalists explain, \"President Donald Trump’s signature trade policy is threatening to backfire by upending other top priorities: the revival of U.S. manufacturing and the American Rust Belt. In Illinois, Trump's tariffs prompted a compressor maker to delay a key equipment purchase after an ambitious factory revamp. Rockwell Automation Inc., a Wisconsin-based producer of factory tools, says some manufacturers are putting projects on hold because of uncertainty over costs and future demand. Snap-on Inc. is seeing similar hesitancy among car mechanics.\"\n\nREAD MORE:Trump's latest move is a danger to all of us\n\nThe reporters continue, \"The warnings underscore the rising worry that turbulence from Trump’s trade wars will smother the progress U.S. manufacturers have already made revving up American factories. Manufacturing payrolls fell by 8000 last month, the most this year, according to the Bureau of Labor Statistics. U.S. and Chinese negotiators will resume trade talks Monday in London, as the world’s two largest economies look to resolve disputes over tariffs and technology.\"\n\nAccording to Niquette, Davis and Sutherland, the \"anxiety\" over Trump's tariffs may be \"higher in the Midwest\" than in other parts of the United States.\n\nGus Faucher, chief economist for PNC Financial Services Group in Pittsburgh, told Bloomberg News, \"Overall, it is going to be a drag on the U.S. economy. In particular, it's going to be a drag on the Midwestern economy.\"\n\nTrump is claiming that his tariffs will lead to a manufacturing renaissance in the U.S., but according to Niquette, Davis and Sutherland, they are having the opposite effect.\n\nREAD MORE:'It's pathetic': Right-wing red state Republicans are being ripped apart — by football\n\n\"U.S. factory activity contracted for a third straight month in May, and every comment in the Institute for Supply Management’s sample of survey responses from manufacturing executives focused on tariffs — including a respondent in the electric equipment, appliance and components business who said the duties have created supply-chain disruptions rivaling those of the pandemic,\" the Bloomberg reporters note. \"The Midwestern states of Illinois, Indiana, Iowa, Kansas, Michigan, Minnesota, Missouri, Nebraska, North Dakota, Ohio, South Dakota and Wisconsin lost almost 2 million manufacturing jobs between 1998 and 2010 as trade deals and China’s entrance into the World Trade Organization spurred companies to seek lower-cost labor and production outside the U.S.\"\n\nNiquette, Davis and Sutherland add, \"In recent years, though, a cautious optimism had returned…. Since the start of 2021, the region has added over 100,000 factory jobs, according to federal data.\"\n\nREAD MORE: 'Can't you just shoot them?' Inside Trump's threat to deal with 'radical left thugs' in America","summary":"Although Donald Trump's narrow victory over Democratic presidential nominee Kamala Harris in 2024 was far from the \"landslide\" he claims it was — he won the national popular vote by roughly 1.5 percent — his emphasis on inflation and the economy helped get him past the finish line. Trump blamed Harris and then-President Joe Biden for inflation, and his messaging worked: Three Rust Belt states that went to Biden in 2020 — Pennsylvania, Michigan and Wisconsin — went to Trump in 2024.\n\nMany economists are warning, however, that Trump's steep new tariffs could bring about inflation much worse than that of the Biden era. And according to Bloomberg News reporters Mark Niquette, Miranda Davis and Brooke Sutherland, they also threaten his promise to create manufacturing jobs in the Rust Belt and the Midwest.\n\nIn an article published by Bloomberg News on June 9 and republished by Financial Post that day, the journalists explain, \"President Donald Trump’s signature trade policy is threatening to backfire by upending ot","url":"https://www.alternet.org/trump-rust-belt-bloomberg/","image":"https://www.alternet.org/media-library/image.jpg?id=60680210&width=1200&height=600&coordinates=0%2C83%2C0%2C84","video":null,"publish_date":"2025-06-09 15:59:59","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":0.017},{"id":329675758,"title":"What is the National Guard at the heart of Trump’s Los Angeles standoff?","text":"As United States President Donald Trump’s administration cracks down on immigrants and protesters in Los Angeles, it has deployed 2,000 members of the National Guard to aid its efforts.\n\nTrump authorised the deployment after the protests began on Friday, following Immigration and Customs Enforcement (ICE) arrests of 44 people in the city for violating immigration laws.\n\nCalifornia Governor Gavin Newsom, Los Angeles Mayor Karen Bass, former Vice President Kamala Harris and many other senior leaders of the Democratic Party have criticised Trump’s deployment. They have described the deployment of the National Guard against protesters as a provocation aimed at further inflaming tensions already roiling the country’s second-largest city.\n\nBut what is the National Guard, and why is its deployment such a political flashpoint?\n\nWhat is the National Guard?\n\nThe National Guard is a branch of the US military that can perform state and federal functions.\n\nThis means the guard is largely used to respond to state-level emergencies but can also be federalised. The president can also deploy National Guard soldiers to overseas missions.\n\nThe guard’s origins trace back to 1636 when it started as citizen-soldier militias in Massachusetts, which is now a US state but was then a British colony.\n\nThe National Guard became an organised force after the passage of the Militia Act of 1903. The two world wars solidified its status as an organised branch of the US military.\n\nThe Air National Guard was established in 1947 to complement a territorial force.\n\nHow many soldiers are in the National Guard?\n\nIt had 431,291 members as of 2023, the latest data released by the US Department of Defense.\n\nThat included the Army National Guard, which consists of 326,317 soldiers, and the Air National Guard, which has 104,974 members.\n\nMany members of the guard serve part-time while working civilian jobs or attending college.\n\nAll members recruited into the guard have to undergo basic training. After this, they attend drills at regular intervals. Typically, drills take place one weekend each month. Every year, members attend a two-week training.\n\nHow is the National Guard deployed?\n\nTypically, if a US state is experiencing an emergency that requires a National Guard deployment as a response, the state’s governor may deploy its forces stationed in the state.\n\nHowever, presidents can also federalise the National Guard from a state, but typically, this requires a governor’s approval to do so.\n\nWhen is the National Guard deployed?\n\nThe guard is deployed in cases of natural disasters or severe weather, civil unrest, war or when election assistance is needed.\n\nIn 2005, for instance, about 50,000 National Guard soldiers were deployed after Hurricane Katrina hit multiple southern US states.\n\nIn January, Newsom deployed the National Guard as wildfires ravaged several areas of Los Angeles. In recent years, plainclothes National Guard soldiers have staffed polling places during elections.\n\nDuring the current protests, however, Trump deployed the guard in Los Angeles without Newsom’s approval.\n\nRobert Cohen, professor of history and social studies at New York University, told Al Jazeera that Trump’s decision to deploy the National Guard without getting Newsom on board was “wrong, but typical of the way Trump’s partisanship pollutes almost all of his major decisions”.\n\nWhen have presidents federalised the National Guard in the past?\n\nIn 1957, President Dwight D Eisenhower federalised the Arkansas National Guard to desegregate public schools after the US Supreme Court’s Brown v Board of Education ruling, which established that racial segregation in public schools is illegal.\n\nIn 1992, California Governor Pete Wilson and President George HW Bush, both Republicans, deployed the National Guard to quell riots in Los Angeles. Protests, looting, assaults and arson broke out after four police officers who were filmed beating Rodney King, an African American man, for 15 minutes were acquitted of charges of excessive force.\n\nWhat is the debate around the National Guard’s deployment?\n\nThe Posse Comitatus Act of 1878 generally prevents the National Guard and other branches of the US military from being used in civilian law enforcement.\n\nPresidents may circumvent this by invoking the 1807 Insurrection Act, which gives the US president the power to deploy the military to suppress an insurrection.\n\nIn 1965, President Lyndon B Johnson invoked the act and deployed the guard to protect civil rights marchers in Alabama. He did this without taking Alabama Governor George Wallace, a known segregationist, on board. Before Saturday, this was the last time a US president had deployed the National Guard without the approval of the governor.\n\nOn Saturday, instead of using the Insurrection Act, Trump invoked a similar federal law, called the Title 10 authority, to deploy the California National Guard without Newsom’s approval.","summary":"Trump deploys the California National Guard during immigration protests in Los Angeles.","url":"https://www.aljazeera.com/news/2025/6/9/what-is-the-national-guard-at-the-heart-of-trumps-los-angeles-standoff?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/06/afp_6846e670ea0e-1749476976.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-06-09 15:53:49","author":"Apps Support,Sarah Shamim","authors":["Apps Support","Sarah Shamim"],"language":"en","source_country":"QA","sentiment":-0.005},{"id":329665878,"title":"Kamala Harris won the U.S elections: Bombshell report claims voting machines were tampered with before 2024","text":"Kamala Harris won the U.S. elections: Bombshell report claims voting machines were tampered with before 2024: A new report is stirring fresh debate about the outcome of the 2024 U.S. presidential election, claiming that voting machines were secretly altered before ballots were even cast. The bombshell allegation raises a serious question: Did Kamala Harris actually win the 2024 election? According to the investigative piece from Daily Boulder, a private lab quietly implemented sweeping changes to voting machines used in over 40% of U.S. counties ahead of the 2024 race. Those changes, the report claims, were made with no public notice, no formal testing, and no third-party oversight. What changes were made to voting machines before the 2024 election? The report centers around Pro V&V, a federally accredited lab responsible for certifying voting machines in key states like Pennsylvania, Florida, New Jersey, and California. In early 2024, the lab reportedly approved updates to ES&S voting systems, which included: New ballot scanners Printer reconfigurations Firmware upgrades A new Electionware reporting system Instead of labeling these as major changes, Pro V&V classified them as “de minimis,” a term typically reserved for insignificant tweaks. This classification allowed them to bypass public scrutiny and avoid triggering full-scale testing or certification processes. But watchdog group SMART Elections wasn’t convinced. In their words: “This wasn’t just a glitch in some sleepy county. It was a stress test of our entire system.” Soon after the machines went live, complaints began to surface. Were votes miscounted or ignored in key counties? In Rockland County, New York, several voters testified under oath that their ballots didn’t match the official results. Senate candidate Diane Sare reportedly lost votes in precinct after precinct: In one district, 9 voters claimed they voted for Sare, but only 5 votes were recorded. In another, 5 voters swore they supported her, but only 3 votes appeared. It wasn’t just third-party candidates who saw odd results. In multiple Democratic-leaning areas, Kamala Harris’s name was reportedly missing from the top of the ballot entirely. Voters said they couldn’t even find her name to select. These same areas had high support for Democrats like Senator Kirsten Gillibrand, yet Harris received zero votes—a statistical anomaly that defies traditional voting patterns. Even more shocking: Donald Trump received 750,000 more votes than Republican Senate candidates in these districts. As reported by Dissent in Bloom, a political Substack, “That’s not split-ticket voting. That’s a mathematical anomaly.” Who is behind Pro V&V, and why is there no oversight? At the center of the controversy is Jack Cobb, the director of Pro V&V. While he doesn’t appear in the headlines, his lab certifies the machines that millions of Americans use to vote. According to the report, once the controversy began to gain traction, Pro V&V’s website went dark, leaving only a phone number and a generic email address. No public logs. No documentation. No comment. Pro V&V is certified by the Election Assistance Commission (EAC). However, once accredited, labs like Pro V&V face no real public oversight. There is no hotline, no review board, and no formal process for the public to challenge or remove them. The EAC itself has four commissioners, two of whom—Benjamin Hovland and Donald Palmer—were appointed by Donald Trump during his first presidency. Even if wrongdoing were discovered, the process to revoke a lab’s accreditation is slow, murky, and entirely internal. There are no public hearings and no outside investigations. As of June 2025, Pro V&V remains fully accredited and uninvestigated. Could Kamala Harris have actually won the election? The question is no longer whispered in political corners—it’s being asked outright. In May 2025, Judge Rachel Tanguay ruled that allegations raised by SMART Elections were credible enough to move forward. The case, SMART Legislation et al. v. Rockland County Board of Elections, is scheduled for hearing this fall. While the lawsuit won’t change the outcome of the election—Congress already certified Trump’s victory—it could set off wider probes, from state investigations to federal criminal inquiries. Political writer John Pavlovitz openly questioned the result, writing: “Kamala Harris may have won.” During the campaign, Harris reportedly drew massive crowds, high early voting numbers, and strong poll performances in swing states. Her debate showing against Trump was widely viewed as dominant—Trump even skipped the second debate. And yet, despite that momentum, Trump won. Adding fuel to the fire, Elon Musk, who vocally supported Trump, posted cryptic tweets during the 2024 cycle, including: “Anything can be hacked.” Later, Musk stated: “Without me, Trump would have lost the election.” Trump himself added to the speculation, telling supporters: “He [Musk] knows those computers better than anybody. All those computers. Those vote-counting computers. And we ended up winning Pennsylvania like in a landslide.” The upcoming court case could become a pivotal moment in election security history. The lawsuit claims that a private company quietly changed voting machines in over 40% of U.S. counties—and no one knew until after the votes were counted. The implications are serious: Could future elections be altered without oversight? Should the EAC change how it certifies and monitors voting labs? Is the public being kept in the dark about the technology behind their vote? SMART Elections warns this isn’t just about one race: “If one underfunded watchdog group can dig up this much from a quiet New York suburb, what else is rotting in the shadows of this country’s ballots?”","summary":"Kamala Harris election tampering story raises new questions about the 2024 U.S. presidential election outcome. A quiet but major change to voting machines by Pro V&amp;V—used in over 40% of U.S. counties—was never publicly reviewed or disclosed. Watchdog group SMART Elections flagged suspicious updates, missing votes, and statistical anomalies suggesting potential vote tampering. Now, a lawsuit is moving forward, challenging whether Kamala Harris may have actually won.","url":"https://economictimes.indiatimes.com/news/international/us/kamala-harris-won-the-u-s-elections-bombshell-report-claims-voting-machines-were-tampered-with-before-2024/articleshow/121732679.cms","image":"https://img.etimg.com/thumb/msid-121732801,resizemode-4,width-1200,height-900,imgsize-79750,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-09 15:46:17","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.365},{"id":329657554,"title":"2026 California candidates take sides in Trump vs Newsom feud over LA riots","text":"“The people in charge are obviously not in charge. They are more concerned with appeasing the political Left,” Hilton said in a video posted over the weekend. “That is totally unacceptable! We have to guarantee law and order and safety on our streets. That is the first responsibility of people in government. The people in government in California today, they are not doing their job.”\n\nThe people ‘in charge’ in L.A. are not in charge. Newsom, Bass & co are more concerned with appeasing the left than protecting our citizens from crime and disorder.It is totally unacceptable. When I’m governor we will uphold safety in our communities and order on our streets. pic.twitter.com/fInUAfbuIL— steve hilton (@SteveHiltonx) June 7, 2025\n\nHilton also reposted a statement from Newsom on X, accusing the governor of “lying” for claiming Trump “manufactured a crisis.” He added that the riots in Los Angeles could have been avoided if California Democrats offered to work with federal law enforcement “instead of against it.”\n\nInstead of leading, Newsom is lying.The chaos and lawlessness was entirely caused by Democrat 'sanctuary' extremism. All of this would have been avoided if Democrats had worked WITH federal law enforcement instead of against it. https://t.co/QC2ILPL2XQ— steve hilton (@SteveHiltonx) June 9, 2025\n\nRep. Katie Porter (D-CA), who is also running for governor, accused Trump of wanting to “tear communities apart” with his response to the riots. She then claimed that people have “a right to peacefully protest,” and like Newsom, encouraged them not to “give Trump what he wants.”\n\nDonald Trump has one goal: sow division, unrest and violence. He wants to tear communities apart. Californians and all Americans no matter their politics have a right to peacefully protest. Be peaceful. Don't give Trump what he wants.— Katie Porter (@katieporteroc) June 9, 2025\n\nRiverside County Sheriff Chad Bianco, who is running as a Republican, has reposted multiple videos of the riots in Los Angeles, along with one photo of a rioter bearing a Mexican flag while standing atop a car. He said the photo summarizes “Governor Newsom’s lawless California,” and that the state deserves “better.” \n\nFormer Vice President Kamala Harris has not yet announced a bid for next year’s election, though speculation on the possibility has grown following her loss to Trump in the 2024 election. She has accused Trump of committing a “dangerous escalation” with his deployment of the National Guard, and that the administration’s actions are focused on “stoking fear.”\n\nCALIFORNIA DEMOCRATIC CONGRESSWOMAN TELLS ICE TO ‘GET THE F*** OUT OF LA’\n\nBoth Hilton and Bianco have rebuffed Harris’s view on the riots, with the former accusing her of siding with “violent criminals” with her “appalling” statement. Likewise, Bianco argued that Democrats “own” the riots, and that the former vice president’s comment “does nothing” to diffuse them.\n\nOn Sunday evening, the Democratic Governors Association released a letter revealing that Newsom has the backing of the party’s other 22 governors. In sharing the letter, Newsom claimed that Trump’s deployment of the National Guard marks an “alarming abuse of power.”","summary":"President Donald Trump and Gov. Gavin Newsom&#8216;s (D-CA) online feud has prompted candidates in California’s 2026 gubernatorial election to weigh in, some of whom condemned the riots in Los Angeles while others pushed back against the president’s response to them. Newsom has demanded that the Trump administration rescind the president’s order to deploy 2,000 National [&#8230;]","url":"https://www.washingtonexaminer.com/news/3435254/trump-newsom-la-riots-2026-candidates/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/HiltonPorter.webp","video":null,"publish_date":"2025-06-09 15:40:10","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","source_country":"US","sentiment":-0.172},{"id":329646688,"title":"‘They’re about stoking fear’: Harris rips Trump administration over Los Angeles crackdown","text":"Former Democratic presidential candidate Kamala Harris has accused the Trump administration of escalating the situation in Los Angeles “to provoke chaos”. \n\nHarris criticized the decision to send in the National Guard to tackle activists opposing arrests being made by U.S. Immigration and Custom Enforcement (ICE) agents as part of an effort to round-up and deport undocumented migrants.\n\nShe also claimed that the protesters who have taken to the streets of Los Angeles to demonstrate against Trump’s crackdown were “overwhelmingly peaceful”.\n\nProtesters have clashed with police officers for the last three days in opposition to ICE’s latest raids, resulting in violent scenes as the authorities retaliate with tear gas and flash grenades in an attempt to maintain order.\n\n“Los Angeles is my home,” Harris, the state’s former attorney general, said in a statement posted to social media. “And like so many Americans, I am appalled at what we are witnessing on the streets of our city. Deploying the National Guard is a dangerous escalation meant to provoke chaos.”\n\nShe characterized ICE’s actions as “part of the Trump administration’s cruel, calculated agenda to spread panic and division.”\n\nHarris continued: “This administration’s actions are not about public safety – they are about stoking fear. Fear of a community demanding dignity and due process.”\n\nShe went on to express her support for the activists taking part, noting that protest is “a power tool – essential in the fight for justice.” \n\n“I continue to support the millions of Americans who are standing up to protect our most fundamental rights and freedoms,” Harris concluded. \n\nHer comments have faced some criticism online, with a California sheriff claiming she and California governor Gavin Newsom were “gaslighting” Americans. \n\n“President Trump didn’t start these riots,” Riverside County Sheriff Chad Bianco wrote while sharing Harris’s statement. “He’s not out there lighting cars on fire, hurling projectiles at law enforcement or blocking freeways.\n\n“This statement is an embarrassment and does nothing to diffuse the violent riots taking place across the city.”\n\nNewsom has been the most vocal public figure opposing the president’s intervention in the unrest so far, accusing Trump of “manufacturing a crisis” and behaving like a dictator. The Democrats also challenged Trump’s “tough guy” border czar Tom Homan to arrest him.\n\nThe first of the 2,000 federalized members of the National Guard entered the fray on Sunday and Los Angeles Police Chief Jim McDonnell said in a late-night press conference that 27 new arrests had been made that day, warning that the clashes were “getting increasingly worse and more violent.”\n\nICE operations across Los Angeles County since Friday have so far resulted in the arrest of 118 accused illegal immigrants despite the local resistance agents have encountered, the Department of Homeland Security has said.\n\nThe episode is the latest obstacle encountered by the Trump administration as part of its effort to orchestrate the largest mass deportation push in American history, which has seen the president invoke the Alien Enemies Act of 1798 to expand his authority.\n\nHarris has largely kept out of the public eye since losing last November’s presidential election to Trump but did make a surprise appearance at the Met Gala a month ago.\n\nThat came a week after she accused the Republican of “abandoning American ideals” and setting the U.S. on the path to recession through his chaotic tariff policy in a speech in San Francisco in April, predicting the coming storm would amount to the “greatest man-made economic crisis in modern presidential history.”","summary":"Kamala Harris lashes out at president’s ‘cruel, calculated agenda to spread panic and division’ by sending in National Guard to tackle anti-ICE protesters","url":"https://www.independent.co.uk/news/world/americas/us-politics/la-protests-kamala-harris-trump-b2766543.html","image":"https://static.independent.co.uk/2025/05/06/1/32/GettyImages-2212829401.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/zMVyTvvl-OhrQWqOm.mp4","publish_date":"2025-06-09 15:27:14","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":-0.04},{"id":329640436,"title":"Donald Trump's 'terrifying' order as National Guard descend on LA amid clashes","text":"President Donald Trump issued a chilling command as tensions escalated in Los Angeles , posting on his Truth Social page that things were \"looking really bad\" in the city. The 47th POTUS's remarks have sparked outrage from former Vice President Kamala Harris and political commentators who accuse him of inciting fear amid ongoing protests. As clashes between protesters and ICE agents intensify, Trump has instructed National Guard troops to intervene in LA, prompting California Governor Gavin Newsom to brand him a \"stone cold liar.\" Trump's alarming call to action was made clear when he took to Truth Social. His comments have been widely criticised. He wrote: \"Looking really bad in L.A. BRING IN THE TROOPS!!!\" He then doubled down with another post demanding: \"ARREST THE PEOPLE IN FACE MASKS, NOW!\" Former Vice President Harris has slammed the decision to deploy the National Guard, releasing a statement that criticises Trump's \"dangerous escalation\" and expresses her dismay at the unrest in her hometown. Harris stated: \"Los Angeles is my home. And like so many Americans, I am appalled at what we are witnessing on the streets of our city. Deploying the National Guard is a dangerous escalation meant to provoke chaos.\" Harris slammed the \"recent ICE raids in Southern California and across our nation,\" as \"part of the Trump Administration's cruel, calculated agenda to spread panic and division.\" She concluded her statement by asserting that the president was \"stoking fear\". Social media reactions to Harris were mixed, with one supporter enthusing: \"If you were our PRESIDENT, we would be at peace right now! The future wouldn't be so scary.\" However, a critic responded: \"This is why you and the party you represent lost. Keep 'em coming. We don't mind taking the midterms.\" Amid tensions, California Governor Gavin Newsom implored Vice President J.D. Vance to stop kindling unrest while Trump and Vance commended the National Guard for their efforts, despite their absence from the scene. Governor Newsom retorted on social media: \"You didn't even know when your own National Guard was deployed on the ground. Stop fanning the flames.\" He pledged to arrest and prosecute \"bad actors\" but vowed to shield the \"many, many peaceful protestors\" as they exercise a \"fundamental right\", stressing: \"But Donald Trump needs to pull back. He needs to stand down.\" Newson pointedly placed responsibility, saying: \"Donald Trump is inflaming these conditions. This is Donald. Trump's problem right now. And if he can't solve it, we will.\" The National Guard and Donald Trump are facing a fierce backlash from the public, with one person taking to X to express their anger, writing: \"Donald Trump is a weak leader. He does not know how to govern. Little child boy.\"","summary":"Donald Trump has called for the National Guard to be deployed in Los Angeles, with the troops soon descending on the city as violent clashes continue to break out","url":"https://www.mirror.co.uk/news/us-news/donald-trumps-terrifying-order-national-35362606","image":"https://i2-prod.mirror.co.uk/article35362605.ece/ALTERNATES/s1200b/0_President-Donald-Trump-Signs-More-Executive-Orders.jpg","video":null,"publish_date":"2025-06-09 15:22:50","author":"Ewan Gleadow","authors":["Ewan Gleadow"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.094},{"id":329657560,"title":"LA immigration riots: What to know about the protests, Trump’s response, and more","text":"“Looking really bad in L.A.,” the president said.\n\nDefense Secretary Pete Hegseth has 500 Marines now on standby to deploy to the area should California officials deem the action necessary.\n\nThree days of protests\n\nThirty-nine people were arrested over the weekend for participating in riots, McDonnell said at a press conference Sunday evening. Separately, San Francisco police reported 60 arrests Sunday night.\n\nThe protests began Friday after extensive Immigration and Customs Enforcement raids across the city after federal agents arrested around 44 immigrants in Paramount, California. Federal agents executed search warrants at three locations, according to the Department of Homeland Security. Officials revealed that those arrested in the Los Angeles sweep included murderers, sex offenders, and other violent criminals. The DHS arrested 118 illegal immigrants in the Los Angeles area over the week, including the 44 detained in Paramount and five the agency identified as gang members, per the BBC.\n\nAngelica Salas, director of the Coalition for Humane Immigrant Rights, said there were seven raids throughout the city on Friday. She called them “random sweeps” that were carried out without a warrant.\n\n“This has to stop,” Salas said. “Immigration enforcement that is terrorizing our families throughout this country and picking up our people that we love must stop now.”\n\nThe president of SEIU California, a major labor union, was arrested and charged with impeding a federal agent while protesting, according to the U.S. Attorney’s office.\n\nAnti-ICE sentiment in California has been building for weeks after federal authorities conducted an operation targeting illegal immigrants working at San Diego restaurants. Other recent raids carried out by ICE include the arrests of 239 illegal immigrants during a weeklong operation from May 4 to May 10 that “focused on bolstering public safety in the greater Los Angeles area.”\n\nThe riots over the past three days were fueled in part by “misinformation” that ICE was carrying out a sweep of illegal immigrants working at a Paramount Home Depot, where many undocumented migrants go to find work, according to the outlet. The Hope Depot became a key flashpoint for demonstrators during the riots.\n\nThe protesters, some of whom have worn masks, have been accused of assaulting law enforcement and federal agency officials, blocking off a major freeway, and committing other criminal acts. They have tagged various public buildings and other structures with graffiti, including calls to “Kill ICE.” American flags have been set ablaze, as have several self-driving vehicles operated by Waymo, a ride-hailing service. One demonstrator used a makeshift flamethrower to set the interior of one of the cars ablaze, while others were seen throwing Lime electric scooters into the burning cars. Other rioters hurled rocks through the windshield of a Border Patrol pickup truck, wounding the agents inside. Others have been accused of blocking a federal bus in the street and hurling chunks of concrete, rocks, electric scooters, and fireworks at California Highway Patrol officers.\n\nRioters shattered multiple windows of the police headquarters, per CBS News. Suspects have thrown stones, bottles, and Molotov cocktails at police officers, while there were reports on Sunday afternoon of two motorcyclists deliberately crashing into officers behind a police barricade.\n\n“Now they know that they cannot go to anywhere in this country where our people are and try to kidnap our workers, our people — they cannot do that without an organized and fierce resistance,” an anti-ICE demonstrator told Reuters.\n\nTrump warns National Guard troops ‘will be everywhere’ \n\nThe White House has accused Gov. Gavin Newsom (D-CA) and Los Angeles Mayor Karen Bass of failing to meet the demonstrations with adequate force. California Democrats have allowed lawlessness to fester, according to the Trump administration, a move it argues has failed to protect citizens, led to violent attacks on federal authorities, and enabled the destruction of property.\n\nTrump has argued “law and order” must be restored, saying military troops “will be everywhere.”\n\nIf protesters assault law enforcement officers by spitting on them, they will “get hit very hard,” the president warned.\n\n“ARREST THE PEOPLE IN FACE MASKS, NOW!” Trump added in a post to Truth Social early Monday.\n\nThe White House swiftly deployed 2,000 National Guard troops to Los Angeles, the first of whom arrived early Sunday morning. There are now around 300 members of the California National Guard deployed to Los Angeles County, while hundreds of Marines are on standby.\n\nLaw enforcement has met protesters in tactical gear and deployed tear gas, using flashbangs, pepper spray, and other crowd control devices to combat the demonstrations. Police have also used zip ties while wearing riot gear and wielding shields as they interact with protesters.\n\nICE has often controversially used face masks to carry out arrests to avoid being doxed, arguing they need to protect their identities in order to protect themselves and their families from blowback due to “false narratives” spread by Democrats about ICE’s mission and activity.\n\nDemocrats downplay riots \n\nNewsom has demanded that Trump rescind his executive order sending the National Guard to quell the Los Angeles riots. The governor has pledged to sue the White House over the matter, arguing that the president’s directive is unlawful under federal law, state and local authorities are best equipped to protect the area, and that militarizing the situation has escalated tensions.\n\n“The federal government is taking over the California National Guard and deploying 2,000 soldiers in Los Angeles — not because there is a shortage of law enforcement, but because they want a spectacle,” Newsom posted on X. “Don’t give them one.”\n\nOverall, Democrats have accused ICE of inciting the protests due to federal agents’ efforts to arrest and deport illegal immigrants.\n\nThey have blamed the “cruel” Trump administration for fueling the chaos that erupted over the weekend, saying that decisions to send in the National Guard mark a dangerously authoritarian approach that has unnecessarily stoked tensions. All 22 Democratic governors across the country recently signed a letter claiming Trump’s actions to deploy the National Guard mark an “alarming abuse of power” as he seeks to “militarize California.”\n\n“It started peacefully, then we had federal officers, you know, doing the tear gas, shooting out pellets,” Rep. Nanette Barragán (D-CA) said on CNN’s State of the Union.\n\n“People were there to protest,” the California congresswoman continued. “They’re there to protest the mass deportations that are happening. And so it was peaceful. And of course, you escalate the situation. Now you‘re talking about bringing in the National Guard to militarize the situation. It‘s going to get worse. It‘s unnecessary again.”\n\nFormer Vice President Kamala Harris and Sen. Cory Booker (D-NJ) are among the other Democrats who have characterized the riots as “peaceful protests,” even as they call the attacks on law enforcement “unacceptable.”\n\n“Los Angeles is my home,” Harris said in a statement Saturday evening. “And like so many Americans, I am appalled at what we are seeing on the streets of our city. Deploying the National Guard is a dangerous escalation meant to provoke chaos.”\n\n“The reality is we see peaceful protests launching in Los Angeles,” Booker said Sunday on NBC’s Meet the Press. “And again, any violence against police officers should not be accepted. Local authorities can handle that. But remember, a lot of these peaceful protests are being generated because the president of the United States is sowing chaos and confusion by arresting people who are showing up for their immigration hearings, who are trying to abide by the law.”\n\nOn Saturday, “border czar” Tom Homan did not rule out arresting Bass or Newsom should they obstruct immigration enforcement, although he did not accuse either politician of doing so and said he did not believe Bass had “crossed the line yet.”\n\n“I’ll say it about anybody,” Homan told reporters. “You cross that line, it’s a felony to knowingly harbor and conceal an illegal alien. It’s a felony to impede law enforcement doing their job.”\n\nDuring a Sunday evening MSNBC interview, Newsom responded to Homan’s comments.\n\n“Come after me, arrest me,” Newsom said. “Let’s just get it over with, tough guy, you know? I don’t give a damn. But I care about my community. I care about this community.”\n\n“The hell are they doing?” Newsom added. “These guys need to grow up. They need to stop, and we need to push back. And I’m sorry to be so clear, but that kind of bloviating is exhausting. So, Tom, arrest me. Let’s go.”\n\nRepublicans back National Guard deployment\n\nWhite House officials view the scenes unfolding in Los Angeles as “a violent insurrection.” They say the National Guard is needed to end “violent mob assaults” on law enforcement.\n\nFormer Secretary of State Mike Pompeo justified the efforts Sunday as he compared the unrest to the nationwide riots following the death of George Floyd in 2020.\n\nNATIONAL GUARD ARRIVES IN LOS ANGELES TO COMBAT ICE PROTESTS FOLLOWING TRUMP ORDER\n\nPompeo also referenced the summer of 2020, during which rioters devastated cities throughout the country.\n\n“We do all remember the summer of ’20 where this got out of hand, where local law enforcement and governors just let the flames burn,” Pompeo said. “This can’t happen this time. And you see President Trump and his team taking the actions that are both appropriate and necessary to protect people.”","summary":"Riots erupted in California over the weekend over the Trump administration’s efforts to detain illegal immigrants in the Golden State. President Donald Trump warned Monday that Los Angeles Police Chief Jim McDonnell had said protesters are getting “very much more aggressive,” and he reiterated calls to bring in additional military troops to quell protests. “Looking [&#8230;]","url":"https://www.washingtonexaminer.com/news/crime/3435277/los-angeles-immigration-riots-trump-national-guard-what-to-know/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/LA-riots.-.webp","video":null,"publish_date":"2025-06-09 15:14:49","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","category":"politics","source_country":"US","sentiment":0.001},{"id":329646678,"title":"60 minutes host issues dire warning over multimillion-dollar CBS settlement with Trump","text":"CBS News veteran Scott Pelley has warned that a potential settlement between the network’s parent company and Donald Trump would be “very damaging” to the network and company and their reputations.\n\n“It would be very damaging to CBS, to Paramount, to the reputation of those companies,” Pelley told CNN’s Anderson Cooper on Saturday.\n\nPelley compared a potential settlement to Trump’s agreements with several law firms to provide pro-bono support to avoid sanctions from the administration after the president targeted firms and individual lawyers who represented his political opponents.\n\n“I think many of the law firms that made deals with the White House are at this very moment regretting it. That doesn’t look like their finest hour,” Pelley said.\n\nTrump’s spurious lawsuit accuses the network’s 60 Minutes program of favorably editing an interview with Kamala Harris during the 2024 campaign.\n\nParamount, the parent company of CBS, is considering a settlement in an alleged effort to coax the Trump administration to approve a merger with Skydance Media. At 60 Minutes, “everyone thinks this lawsuit is an act of extortion,” one correspondent recently told CNN.\n\nThose discussions resulted in the abrupt resignations of 60 Minutes executive producer Bill Owens and CBS News chief Wendy McMahon, with warnings from First Amendment advocates fearing the administration’s chilling effect against the press and suggestions from members of Congress that the company could be breaking anti-bribery laws.\n\nAsked about Owens’s resignation, Pelley echoed his blistering on-air statement that the longtime producer no longer believed that the network had lost “the independence that honest journalism requires.”\n\n“Bill’s decision to resign may not have been much of a decision for him, because he was always the first person to defend the independence of 60 Minutes,” Pelley added. \n\n“Bill didn’t work for Paramount. Bill worked for our viewers, and he felt very keenly about that. I’m not sure Bill had any choice. Once the corporation began to meddle in Bill’s decisions about the editorial content, or just place pressure in that area, Bill felt he didn’t have the independence that honest journalism requires.”\n\nPelley added that, on one hand, “you really wish the company was behind you 100 percent,” while on the other hand “my work is getting on the air.”\n\n“While I would like to have that public backing, maybe the more important thing is the work is still getting on the air,” Pelley said.\n\nHis comments on the network followed CNN’s presentation of Broadway’s Good Night, and Good Luck and a discussion of the state of American journalism. Pelley said the play — in which George Clooney as Edward R. Murrow spars with Senator Joseph McCarthy at the height of Red Scare hysteria — finds parallels in modern media under the current administration.\n\n“I sense in the country today that there is also a fear to speak because it might wipe out your university, it might wipe out your law firm, it might ruin your career,” Pelley said. \n\n“And the theme of all of that together today is that we have to have the courage to speak, as Americans, you can agree with the government or disagree with the government, but you must not be silent.”\n\nWithout that courage, “the country is doomed,” he said.\n\n“It is the only thing that’s gonna save the country,” Pelley added. “You cannot have democracy without journalism. It can’t be done.”\n\nHis latest comments also echo his fiery commencement speech to Wake Forest University graduates against “the fear to speak” in the United States.\n\n“Power can rewrite history, with grotesque, false narratives,” he said in his address. “They can make criminals heroes, and heroes criminals. Power can change the definition of the words we use to describe reality. Diversity is now described as illegal. Equity is to be shunned. Inclusion is a dirty word. This is an old playbook, my friends. There is nothing new in this.”\n\nIn recent court filings, Trump’s legal team claimed the president suffered “mental anguish” over the 60 Minutes interview with Harris and argued that the network is using “the First Amendment as a sword.”\n\nIn a pair of objections filed in response to the network’s motions to dismiss the defamation suit, which legal experts have described as “frivolous,” the president’s lawyers claim the president experienced personal financial harm from “news distortion.”","summary":"Veteran journalist says ‘the country is doomed’ without ‘courage’ from journalists to speak truth to power","url":"https://www.independent.co.uk/news/world/americas/us-politics/60-minutes-scott-pelley-trump-lawsuit-b2766525.html","image":"https://static.independent.co.uk/2025/06/09/13/21/scott-pelley.png?width=1200","video":"https://cdn.jwplayer.com/videos/efYbF8Es-4VHSaSK0.mp4","publish_date":"2025-06-09 15:14:42","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","source_country":"gb","sentiment":-0.251},{"id":329724562,"title":"POLL RESULTS: Worst Media Take of the Week Winner!","text":"We’ve got a new, fun interactive series called Worst Media Take of the Week, where you — our loyal NewsBusters visitors and MRC supporters — get to vote on which leftist journalist or celebrity had the worst media take of the week. \n\nMuch appreciation to all who voted last week via NewsBusters and the MRC’s various social media sites (Facebook, Instagram and X.com). \n\nThe results of the Worst Media Take of the Week are in and the winner is…\n\nKeith Olbermann!\n\nThe former MSNBC’s Countdown host won with 56 percent of the vote! Olbermann took first place for blaming the terrorist attack in Colorado on the President: “The blood of Boulder, Colorado, is on the hands of Donald Trump.”\n\nPBS host Christiane Amanpour finished in second place with 35 percent of the vote. Washington Post associate editor/PBS contributor Jonathan Capehart third with 9 percent. \n\nThe following is a montage of all the nominees: \n\nWINNER (56 percent of the vote)\n\nKeith Olbermann: “The Blood” of Terror Attack Is “On the Hands of Donald Trump” \n\n“You just round up all the people who you think look like threats. That is remigration. That is ethnic cleansing. That is Donald Trump’s presidency. And that, because you no longer bother to look for people who are guilty or who might be planning heinous acts, you just look for their skin tone and their names, that is why the blood of Boulder, Colorado, is on the hands of Donald Trump.”— Former MSNBC host Keith Olbermann on his Countdown podcast, June 3.\n\nSECOND PLACE (35 percent of the vote)\n\nChristiane Amanpour: “I Literally Prepared to Go to America” As If It Was “North Korea”\n\n“When I went to Harvard to give this speech, and it was just a few days ago, last week. I must say I was afraid. I’m a foreigner, I don’t have a green card, I’m not an American citizen, I’m fairly prominent, and I literally prepared to go to America as if I was going to North Korea.”— PBS host Christiane Amanpour on her podcast Christiane Amanpour Presents: The Ex Files with Jamie Rubin, June 3.\n\nTHIRD PLACE (9 percent of the vote)\n\nJonathan Capehart: Shouldn’t We Be Worried About Trump’s “Mental Acuity?”\n\n“If President Trump is mentally anguished over the editing of a television [60 Minutes with Kamala Harris] interview, why shouldn’t I be concerned about his mental acuity in the office right now and all the crazy stuff he’s doing?” — Washington Post associate editor/PBS contributor Jonathan Capehart on MSNBC’s The Weekend, June 1.\n\nThanks again to all who participated! \n\nFunded by James P. Jimirro","summary":"We’ve got a new, fun interactive series called Worst Media Take of the Week, where you — our loyal NewsBusters visitors and MRC supporters — get to vote on which leftist journalist or celebrity had the worst media take of the week. \n\nMuch appreciation to all who voted last week via NewsBusters and the MRC’s various social media sites (Facebook, Instagram and X.com).  \n\nThe results of the Worst Media Take of the Week are in and the winner is…\n\nKeith Olbermann!\n\nThe former MSNBC’s Countdown host won with 56 percent of the vote! Olbermann took first place for blaming the terrorist attack in Colorado on the President: “The blood of Boulder, Colorado, is on the hands of Donald Trump.”\n\nPBS host Christiane Amanpour finished in second place with 35 percent of the vote. Washington Post associate editor/PBS contributor Jonathan Capehart third with 9 percent. \n\nThe following is a montage of all the nominees: \n\n \n\n\n\n\n\n \n\nWINNER (56 percent of the vote)\n\n \n\nKeith Olbermann: “The Blood” of Terror Attack Is “On the Hands o","url":"https://www.newsbusters.org/blogs/nb/geoffrey-dickens/2025/06/09/poll-results-worst-media-take-week-winner","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-06/WorstMediaMoments_6-5-25_RESULTS.png?itok=SbT_O592","video":null,"publish_date":"2025-06-09 14:52:00","author":"Geoffrey Dickens,James P. Jimirro","authors":["Geoffrey Dickens","James P. Jimirro"],"language":"en","source_country":"US","sentiment":-0.222},{"id":329637490,"title":"‘Arrest Me’: Newsom Dares Trump to Send National Guard to California","text":"After President Donald Trump deployed the National Guard to the Los Angeles area in response to violent protests against Immigration and Customs Enforcement raids, Gov. Gavin Newsom, D-Calif., suggested that he is unwilling to comply with federal authorities. \n\nTrump’s border czar Tom Homan said of Newsom’s comments, “It’s a felony to knowingly harbor and conceal an illegal alien. It’s a felony to impede law enforcement doing their job.”\n\nNewsom responded by taunting Homan to carry out the arrest. \n\n“He’s a tough guy. Why doesn’t he do that? He knows where to find me,” Newsom said. “That kind of bloviating is exhausting. So, Tom, arrest me. Let’s go.”\n\nLos Angeles Mayor Karen Bass also dismissed Homan’s warning.\n\n“He had absolutely positively no reason to even say that,” Bass said. “I spoke to him last night. He understands that I am the mayor of the city; the last thing in the world I’m going to do is get into a brawl with the federal government. So that just made no sense. There was no reason for that comment.”\n\nOn his way back from Camp David, Trump echoed Homan’s warning.\n\n“Officials who stand in the way of law and order, yeah, they will face judges,” the president told reporters Sunday.\n\nSecretary of Homeland Security Kristi Noem, Secretary of Defense Pete Hegseth, Attorney General Pam Bondi, and Los Angeles agencies will “take such action necessary to liberate Los Angeles from the Migrant Invasion, and put an end to these Migrant riots,” Trump said on Truth Social.\n\n“A once great American City, Los Angeles, has been invaded and occupied by Illegal Aliens and Criminals,” Trump said. “Now violent, insurrectionist mobs are swarming and attacking our Federal Agents to try and stop our deportation operations—But these lawless riots only strengthen our resolve.”\n\nICE began the raids Friday, and agitators took to the streets in downtown Los Angeles and Paramount, California. Democrats condemned both the ICE raids and the National Guard response to the riots.\n\nFormer presidential nominee Kamala Harris attacked Trump’s actions and defended the protests as “overwhelmingly peaceful.”\n\n“Los Angeles is my home. And like so many Americans, I am appalled at what we are witnessing on the streets of our city,” Harris said in a statement. “Deploying the National Guard is a dangerous escalation meant to provoke chaos. In addition to the recent ICE raids in Southern California and across our nation, it is part of the Trump Administration’s cruel, calculated agenda to spread panic and division.”\n\n“This Administration’s actions are not about public safety — they’re about stoking fear. Fear of a community demanding dignity and due process,” she continued. “Protest is a powerful tool — essential in the fight for justice. And as the LAPD, Mayor, and Governor have noted, demonstrations in defense of our immigrant neighbors have been overwhelmingly peaceful. I continue to support the millions of Americans who are standing up to protect our most fundamental rights and freedoms.” \n\nHowever, Los Angeles Police Chief Jim McDonnell said in a Sunday evening news conference that the violence was “getting increasingly worse and more violent.”\n\n“This violence that I’ve seen, it’s disgusting,” McDonnell said. “It’s escalated now, since the beginning of this incident. What we saw the first night was bad. What we’ve seen subsequent to that is getting increasingly worse and more violent.”","summary":"After President Donald Trump deployed the National Guard to the Los Angeles area in response to violent protests against Immigration and Customs Enforcement raids, Gov. Gavin... Read More\n\n\nThe post &#8216;Arrest Me&#8217;: Newsom Dares Trump to Send National Guard to California appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/09/arrest-me-newsom-dares-trump-to-send-national-guard-to-california/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/newscy.jpg","video":null,"publish_date":"2025-06-09 14:40:09","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","source_country":"us","sentiment":0.129},{"id":329660090,"title":"Cole Escola reacts to Nicole Scherzinger's Tony Awards win after Jesus hat controversy: '4 more years!'","text":"Newly anointed Tony winner Cole Escola rang in their victory with a joke about fellow Broadway star Nicole Scherzinger.\n\n Shortly after winning Best Performance by an Actor in a Leading Role in a Play at Sunday's 78th Tony Awards, the Oh, Mary! performer quipped about Scherzinger's win for Sunset Blvd. live from the event's press room — months after the former Pussycat Dolls entertainer was criticized for inquiring about Russell Brand's MAGA-inspired \"Make Jesus First Again\" hat on Instagram.\n\n \"Who is it? Nicole?\" Escola asked while on stage in front of reporters in New York City, as Scherzinger was announced inside the main hall at Radio City Music Hall as this year's Best Performance by an Actress in a Leading Role in a Musical winner.\n\n \"Wow. The speculating is over,\" Escola joked. \"Four years. Four more years!\"\n\n Escola's joke came roughly eight months after Scherzinger apologized for engaging with Brand's social media post in November 2024, with speculation about the singer's political affiliation swirling after she commented, \"Where do I get this hat!!!?\" under an image of Brand's MAGA-inspired headpiece.\n\n Screenshots also circulated online at the time, which appeared to show that Scherzinger had liked an Instagram post by Robert F. Kennedy Jr. in which the controversial politician voiced support for Donald Trump's second bid for the White House amid the 2024 presidential election race against Vice President Kamala Harris.\n\n \"I deeply apologize for the hurt caused by my recent engagement with some social media posts,\" Scherzinger wrote in a statement that was later shared to her Instagram. \"When I commented on these posts, I made the mistake of not realizing that they could be easily interpreted as being politically related and I apologize to anyone who understandably reached that conclusion.\"\n\n She continued, \"Many presumptions are being drawn, which do not reflect who I am, what I stand for, or who I voted for. Many of the marginalized communities feeling hurt and concerned by the results of the presidential election are people I care about most. I stand with them, as I always have, throughout my life and career. If you know me, you know that.\"\n\n Following the backlash, Scherzinger's past comments about abortion also resurfaced, particularly from a 2016 interview with The Daily Mail, during which the 46-year-old revealed that she almost declined a role in ABC's 2017 Dirty Dancing remake over the fact that her character, Penny, endured an illegal abortion.\n\n \"I got the role and I almost didn't take it because I didn't want to promote abortion, because my character has an abortion,\" Scherzinger said, later explaining that \"my Papa's a bishop and my family's really hardcore against abortion.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n Entertainment Weekly has reached out to representatives for Escola and Scherzinger for comment.\n\n Watch Escola make the \"four more years\" quip at the 2025 Tony Awards in the video above.","summary":"Escola was in the press room as Scherzinger won her award, prompting the comedian and \"Oh, Mary!\" star to joke about the \"Sunset Blvd.\" actress.","url":"https://ew.com/tony-awards-cole-escola-nicole-scherzinger-four-more-years-11750484","image":"https://ew.com/thmb/I1mqfQ-BNTfZbukpaQc1jpxIGsM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/cole-escola-nicole-scherzinger-060925-eafce2d773cf465cac9ef6b966d94ecd.jpg","video":null,"publish_date":"2025-06-09 14:31:57","author":"Joey Nolfi","authors":["Joey Nolfi"],"language":"en","source_country":"US","sentiment":0.058},{"id":329636982,"title":"LA riots: American strongman sends troops to quell protests in oppn-ruled California","text":"Note: The following piece is inspired by Joshua Keating’s If It Happened There which uses tropes and tones normally used by American media to describe events in other countries. The facts presented deal with as much exactitude and accuracy as an American media outlets’ reporting about a foreign country. Los Angeles, Mexican for the city of angels, is home to Hollywood – America’s answer to Bollywood – and a city where starstruck aspirants come with the dream of being immortalised on the silver screen. Yet, the city, which falls under America-administered California, an opposition state which overwhelmingly voted for Mr Donald Trump’s rival from the Democratic Party, Ms Kamala Harris, soon came to resemble a warzone. Mr Trump – known for strongman-like tendencies like Mr Putin and Mr Jinping – sent in over 2,000 National Guard troops, dressed like Stormtroopers, to quell a popular uprising sparked by workplace raids on labourers who Mr Trump’s officials claim are “illegals” working in America without papers. It was, as one expert put it, a prime example of authoritarian overreach that has become a feature of American autocracy since Mr Trump’s white nationalist Republican Party came to power in the last election. The flashpoint began in LA’s Fashion District, where federal immigration agents—known locally as ICE—raided a garment factory, with similar operations in numerous surrounding areas. The raid at a Home Depot – a retail franchise with numerous outlets across the country – saw violent clashes between protesters, including unionists and local residents. Among the arrested was Mr David Huerta, a unionist, who eyewitnesses say was zip-tied and dragged away near the Metropolitan Detention Centre – which has overnight come to resemble a heavily guarded fortress. The situation grew increasingly volatile, coming to resemble a modern-day version of A Song of Ice and Fire – a popular series of books – which inspired the incest-drama Game of Thrones. Driverless Waymo cars – a company owned by Google, often accused of monopolising the internet to further America’s imperial power – were set ablaze in a powerful demonstration of the working-class revolution against Silicon Valley’s technocratic regime. While California’s duly elected leaders – progressive Democrat Governor Mr Gavin Newsom and Los Angeles Mayor Ms Karen Bass – objected, 2,000 National Guard troops hit hotspots near downtown Los Angeles. Local protest organisers – many embedded with immigrant rights groups – were illegally dragged away. Teenagers and older women with placards were violently attacked as federal officials justified the harsh measures, claiming they were “suspected participants.” A Distraction? Some commentators even wondered if Mr Trump’s heavy-handed action might be a ruse to distract from his recent feud with Mr Elon Musk, a technocrat and the world’s richest man who funded Mr Trump’s return to the White House with both his personal wealth and by buying the social media platform named X – formerly known as Twitter – to help spread canards that could return Mr Trump to the White House. Mr Trump, also a former avid user of Twitter who was banned from the platform earlier and opened his own rival Truth Social, had a spat with Mr Musk over a finance bill that the American President likes to call the “Big Beautiful Bill,” and which Mr Musk called fiscal suicide. The fallout included a physical altercation with Mr Trump’s tariff honcho, Mr Scott Bessent, whose attempt at a parliamentary rebuttal ostensibly left Mr Musk with a black eye. Mr Musk – known for using powerful drugs like ketamine – retaliated by calling Mr Trump some unprintable names and even claiming that the American President’s name was present in the Epstein Files. The Epstein Files, incidentally, refer to a litany of famous celebrities – from both sides of the political aisle, including Republicans and Democrats – who visited Mr Epstein’s island where they allegedly participated in peccadilloes involving underage individuals without their consent. Mr Musk – who until recently ran a government department that looked at cutting fiscal waste – is the first member of Mr Trump’s new team to have a public falling out. Unlike the last administration, where many members including the then Vice President Mr Mike Pence stood up to Mr Trump, the new cabinet is full of individuals whose first claim to fame is complete fealty to Mr Trump. This includes Ms Kristi Noem, the head of Homeland Security, Ms Linda McMahon, the Secretary of Education, former Fox News host Mr Pete Hegseth who is now the Secretary of Defence, and the current Vice President, Mr JD Vance, who once called Mr Trump “cultural heroin” and compared him to Adolf Hitler. In his second term, Mr Trump has eschewed any pretence of adhering to the US Constitution, whether its quelling dissent in institutes of higher education, illegally deporting American citizens, or accepting expensive gifts from foreign nations. Mr Trump’s actions might not just affect residents of America-administered California or even just Americans, given the country’s overstated power over the rest of the world. The new regime under Mr Trump has taken sweeping decisions to target its own population, deport legal citizens, silence dissent, and punish anyone perceived to be disloyal, while the courts – once heralded as the guardians of the Constitution – mutely watch on. Questions must be raised as to whether a country like the United States of America is a fit choice for global events, like the next football World Cup – set to be held in 2026 – when it can’t even adhere to the basic norms that citizens of democracies take for granted.","summary":"​Mr Trump – known for strongman-like tendencies like Mr Putin and Mr Jinping – sent in over 2,000 National Guard troops, dressed like Stormtroopers, to quell a popular uprising sparked by workplace raids on labourers who Mr Trump’s officials claim are “illegals” working in America without papers. It was, as one expert put it, a prime example of authoritarian overreach that has become a feature of American autocracy since Mr Trump’s white nationalist Republican Party came to power in the last election.","url":"https://timesofindia.indiatimes.com/world/us/if-it-happened-there-donald-trump-sends-central-troops-to-quell-protests-in-opposition-ruled-california/articleshow/121731375.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-121731390/121731390.jpg","video":null,"publish_date":"2025-06-09 14:17:14","author":"Nirmalya Dutta","authors":["Nirmalya Dutta"],"language":"en","category":"politics","source_country":"IN","sentiment":0.501}]}