{"offset":0,"number":50,"available":5105,"news":[{"id":255233186,"title":"Kamala Harris’s LA Life: Dinners at Country Club with $300,000 Initiation Fee","text":"Kamala Harris’ Los Angeles dining habits are haute and spicy, as residents in her neighborhood have noticed her penchant for eating out at the exclusive Hillcrest Country Club and a beloved local Mexican chain. A new report in The Wall Street Journal detailing the vice president’s life in Los Angeles, where she and her husband Doug Emhoff share a $2.7 million, 3,500 square foot home in the Brentwood neighborhood, notes that in addition to the posh country club, neighbors have noticed another “habit”–a taste for L.A. institution El Cholo. The current initiation fee at Hillcrest is $300,000, according to a source familiar with club memberships who spoke to the Daily Beast on the condition of anonymity. Monthly dues are $2,300, which comes out to $27,600 per year.","summary":"Photo Illustration by Thomas Levinson/The Daily Beast/GettyKamala Harris’ Los Angeles dining habits are haute and spicy, as residents in her neighborhood have noticed her penchant for eating out at the exclusive Hillcrest Country Club and a beloved local Mexican...","url":"https://nation.lk/online/kamala-harris-s-la-life-dinners-at-country-club-with-300-000-initiation-fee-275299.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-30 00:30:04","author":"Thomas Levinson","authors":["Thomas Levinson"],"language":"en","source_country":"lk","sentiment":0.591},{"id":255232856,"title":"Kamala Harris interview LIVE updates: Democratic Presidential nominee set to give first TV interview as leader with CNN","text":"In another excerpt published on social media as a teaser before the full interview, Harris was asked about changes in her policies over the years, specifically her reversals on fracking and decriminalising illegal border crossings. “I think the most important and most significant aspect of my policy perspective and decisions is my values have not changed,” Harris replied. Harris also brushed off Trump’s questioning of her racial identity after the former president said she “happened to turn Black.” Harris, who is of Black and South Asian heritage, said it was the “same old, tired playbook.” Harris and Walz are still introducing themselves to voters, unlike Trump and Biden, of whom people had near-universal awareness and opinion.","summary":"Kamala Harris and Tim Walz have sat down with US broadcaster CNN for an interview with Danna Bash, in their first prime time interview of their campaign.","url":"https://www.theage.com.au/world/north-america/kamala-harris-interview-live-updates-democratic-presidential-nominee-set-to-give-first-tv-interview-as-leader-with-cnn-20240829-p5k6e6.html","image":"https://static.ffx.io/images/$zoom_1.2495%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/6a3936a3d02be3f3c55d859df1228434683eeaed","video":null,"publish_date":"2024-08-30 00:17:11","author":"Chris Zappone,Farrah Tomazin,Nick Ralston","authors":["Chris Zappone","Farrah Tomazin","Nick Ralston"],"language":"en","catgory":"politics","source_country":"au","sentiment":0.236},{"id":255232940,"title":"Kamala Harris interview LIVE updates: Democratic Presidential nominee set to give first TV interview as leader with CNN","text":"In another excerpt published on social media as a teaser before the full interview, Harris was asked about changes in her policies over the years, specifically her reversals on fracking and decriminalising illegal border crossings. “I think the most important and most significant aspect of my policy perspective and decisions is my values have not changed,” Harris replied. Harris also brushed off Trump’s questioning of her racial identity after the former president said she “happened to turn Black.” Harris, who is of Black and South Asian heritage, said it was the “same old, tired playbook.” Harris and Walz are still introducing themselves to voters, unlike Trump and Biden, of whom people had near-universal awareness and opinion.","summary":"Kamala Harris and Tim Walz have sat down with US broadcaster CNN for an interview with Danna Bash, in their first prime time interview of their campaign.","url":"https://www.smh.com.au/world/north-america/kamala-harris-interview-live-updates-democratic-presidential-nominee-set-to-give-first-tv-interview-as-leader-with-cnn-20240829-p5k6e6.html","image":"https://static.ffx.io/images/$zoom_1.2495%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/6a3936a3d02be3f3c55d859df1228434683eeaed","video":null,"publish_date":"2024-08-30 00:17:11","author":"Chris Zappone,Farrah Tomazin,Nick Ralston","authors":["Chris Zappone","Farrah Tomazin","Nick Ralston"],"language":"en","catgory":"politics","source_country":"au","sentiment":0.236},{"id":255232654,"title":"Trump Flipped These Western Wisconsin Counties. What About This Time?","text":"“I am a true neutral.” Matthew Johnson, a short, energetic Texan, was talking politics as he showed off his spread on the south end of Bagley, Wisc., about a thousand feet from the Mississippi River. There was Abby, the miniature horse from the same sure-footed breed that once worked in the nearby lead mines; his father’s old gravestone protected by a working replica of an early 19th-century signal cannon; and, in a wooden crate, the traditional blacksmithing forge he built. Johnson breaks it out at fairs to reenact life on the American frontier. Politics, Johnson said, leads to division. People in Bagley try to avoid the subject. “We’ve got ultra-conservatives, ultra-liberals, and everybody knows that this is not the place to start your crap,” he told The Epoch Times. Behind him, a freight train screamed on its way through town. Two hundred sixty miles north of Bagley in the state’s Northwoods vacationland, Sawyer County also flipped in 2016. Voter turnout rose that year too. Once a presidential bellwether, Sawyer broke that streak in 2020 when it stuck with Trump. Jim Miller, a local Republican and Fourth Ward alderperson in Hayward, theorized that Sawyer’s Republican turn was “part of a national trend where rural counties have become more red and the large metro areas have become more blue.” “I think Wisconsin and the Midwest have gotten left behind,” Eric Wilson, who was a candidate in the Third District’s Democratic primary, told The Epoch Times when asked why the area trended GOP-ward. Joan Cervenka, treasurer of the Sawyer County & Lac Courte Oreilles Democrats, wasn’t about to write off her home. She told The Epoch Times that her party has stepped up its presence, participating in parades and, in her words, doing more to “[let] the community know we’re here.” The Democrats have a highly visible office in downtown Hayward. Local Republicans don’t. “We’re focusing our efforts on giving money directly to candidates, rather than just having a spot for people to get yard signs,” Miller said of the absence of a physical GOP headquarters. The Epoch Times traveled across Grant County, Sawyer County, and other parts of western Wisconsin to see just how competitive the region might be. It’s part of the invisible middle, afloat and sometimes thriving but hit hard by price increases and globalization. Much of the Midwest looks domesticated; the hills, if there are any, roll gently to the horizon, often under a layer of corn, wheat, or soybeans. But in the Driftless, so-called because of the lack of glacial drift, there’s terrain—rocky bluffs, tall trees, and cold-water streams wending their way to the Mississippi, America’s aorta. On Aug. 10, all-terrain and utility task vehicles (ATVs and UTVs), a common sight throughout the region, crested the hill above the Bagley Cemetery. Harley-Davidson motorcycles were ubiquitous. The company headquarters is in Wisconsin’s largest city—Milwaukee. Near Matthew Johnson’s property in Bagley, the Second Annual Ribfest had just ended. People were still drinking beer and listening to music on speakers. Carrie, who works at a Mobil station in Livingston, said she thinks the region is pretty evenly split, though perhaps more conservative in and around Bagley. “Older people, older community,” she mused. “People come here to unwind [and] get away from politics,” Bruce Allen told The Epoch Times. Allen, who manages a collision repair center, believes the area leans Republican—and he doesn’t think Minnesota Gov. Tim Walz’s place on the ticket will help Vice President Kamala Harris much in western Wisconsin. Many, though not everyone, in the region expressed that same view of Walz. As did Eric Hovde, the GOP U.S. Senate candidate for the state. “I don’t think her choice of Gov. Walz has been helpful at all,” Hovde said at the Madison Club on Aug. 14. As far as campaign resources go, western Wisconsin could be a mixed bag for the GOP—and down-ballot weakness could complicate things for Trump. Outside La Crosse, a mid-sized city on the Mississippi, the region isn’t a major focus for the conservative Turning Point Action’s voter turnout initiative, Chase the Vote. In May, Matthew Martinez, Chase the Vote’s field director, told The Epoch Times that his conservative organization was focused on driving up GOP turnout in higher-density areas of Wisconsin, even ones that aren’t competitive for the party. Much of the purple west is too rural to warrant attention, he said. Third District incumbent Rep. Derrick Van Orden (R-Wis.), a freshman who represents much of the territory that flipped to Trump from Obama, has a multi-million-dollar fundraising lead over Democrat Rebecca Cooke. Aidan Leddick, a student at the nearby university, said the city didn’t feel more conservative than his home, the liberal-leaning Twin Cities. The Minneapolis-St. Paul metroplex sprawls on the other side of the Minnesota state line from northwestern Wisconsin. The vibe was different in little Gratiot, Wisconsin, the closest spot on the map to the Illinois line in Lafayette County. Lafayette’s population was 16,611 as of 2020, according to Census data. Gratiot counted 224 residents that year, down from past years. Early in the evening on Aug. 9, much of Gratiot had squeezed into Rocks Pour House, an old-fashioned inn between Bridge Street (Wisconsin Highway 11) and the Cheese Country Trail. Gratiot’s fire chief, J.R. Kingery, was sitting at the bar next to his sister. Kingery told The Epoch Times that Lafayette was Trump territory. But as recently as 2012, it went for the Democrat—Obama. Kingery didn’t recall offhand the GOP nominee that year (former Massachusetts Gov. and current Utah Sen. Mitt Romney). “Ah—that’s why,” he said. Romney-style “country club conservatism” didn’t seem like a good fit also for nearby Darlington, Wisconsin, a town of about 2,500 half-encircled by the Pecatonica River. Conservative and Republican signage dominated, though at least one house was adorned with a rainbow flag and other totems of 2024. In the distance was a low, constant roar: the Lafayette County Speedway was hosting its season championship. Stock cars flew around the curves, kicking clumps of dirt through chain-link fencing. Families filled bleachers at a safe distance from any flying muck. Teenagers socialized under the stands. Cars filled the open fields nearby, but few bore political bumper stickers. Political signage was likewise hard to spot on the route from Darlington to Platteville, home to a branch of the University of Wisconsin, and the biggest thing around save Dubuque, Iowa, on the other side of the Mississippi. Two Amish men trudged along a busy state highway. Farther west, Kuhls Farm advertised its founding date—1864—on the side of a barn. “Everybody’s related one manner to the other,” Johnson said of people in nearby Bagley. At a half-empty bar in Platteville, bikers in leather got into a shouting match, the specifics impossible to hear over the music, before storming out into the street. The college town went for Clinton in 2016 and Biden in 2020. But it is located in Trump-flipped Grant County. “The big problem that we have right now is that we are just a two-party system, which divide[s] us down the middle,” Mary Matteson, a volunteer at the Grant County Republican Party office, told The Epoch Times late on the morning of Aug. 10. “Right now, my heart says the best man for the job is Donald J. Trump and JD Vance,” Matteson said. She says that she feels the Democratic Party is currently “full of radicals.” She and another volunteer, Derek Bartels, were handing out literature and reminding people to register to vote ahead of the state’s Aug. 13 primary. The county Democrats’ office, just down the street, was closed. Matteson and Bartels doubt Walz’s Upper Midwestern connection will help Harris in the area. Matteson cited the 2020 riots in Minneapolis as a source of concern for voters. Like others who spoke to The Epoch Times, Bartels said Trump’s business background helped him win over voters in purple western Wisconsin. Across the street, at the public library, a flyer advertised a drag queen story hour at a bookstore in Mineral Point. Meanwhile, the Mining and Rollo Jamison Museums—a tribute to the region’s zinc and lead mining heritage—were hosting Mine Day. On a small stage in an open field, women sang a Carter Family bluegrass standard in close harmony: “It makes me homesick to hear your name and hold you dear in my arms again. I’m-a-gonna ride that old lonesome train.…” Not far away, Forrest Rische was picking at his bass under a tent. “I’m 100 percent all-American to the bone,” he told The Epoch Times. He said he believes freedom is “done” for the country if Trump isn’t elected. Dr. David Miller, who had been chatting with Rische about the gold standard, showed The Epoch Times a photo of himself dressed as Kaiser Wilhelm II. He said he isn’t terribly interested in the upcoming presidential election. “I’m a monarchist. I believe in the divine right of kings,” Miller said. Trump signs were thick on the road to Bagley, though the most eye-catching messages were spray-painted on a clutch of buildings under a big limestone cut: “America,” “No More Nice Guy,” “Welcome to Deliverance, Did You Bring Your Banjos,” and “Stay Behind the Gun Line.” The same railroad that slices through Bagley splits Prairie du Chien in two. One bar, Frazier’s Old Faithful Inn, sits just a few feet from the tracks. It sells t-shirts emblazoned with an image of the train that, much to everyone’s delight, drowns out conversations. Home to a prison and a 3M plant, Prairie du Chien narrowly favored Biden in 2020 and Clinton in 2016. It’s the seat of Crawford County, another county that flipped to Trump eight years ago. The city is also Van Orden’s home base; like Bagley and Gratiot, it has leached population in recent years. On the evening of Aug. 10—a Saturday—the county Democrats’ Blackhawk Avenue office was closed. A few doors down, Unicycle Michael, the Driftless Personality, was preparing to perform at The Tavern. Bluegrass, he said, had dug a deep groove into the Mississippi Valley. His sound, though, is a little different. “I kind of describe my style as between James Brown and the Grateful Dead,” said Unicycle Michael—real name Michael Zernia. He said he thinks there’s a mix of political views in the area, but that The Tavern isn’t really the place to talk politics. “We have a space where we can all get along,” he told The Epoch Times. “It just makes us human to enjoy music.” Come November, Fitch and other county clerks across the state will be administering the closely watched presidential election. “We try to keep our poll books clean,” Fitch said of Sawyer County’s records. In Hayward, anti-fentanyl signage lined the roads. The signs showed a beautiful young face: Cassidy Joy Metropulos, a Hayward High School graduate who died of an overdose at just 21. “I think that there’s a lot of people that are either related to or know of somebody that has had a significant impact from drugs,” Joan Cervenka, the local Democrat, told The Epoch Times. Hayward is growing, and the economy isn’t so bad. Fitch said the summer had been a good one for tourism, in line with recent trends. “We live in a beautiful part of the state, so recreation is really big,” Miller said, before adding a caveat about the region’s attractiveness to older Americans. “I love Donald Trump,” she told The Epoch Times on Aug. 12. She and her partner, Marv Newlun, were sitting in that party building in Juneau County—another former bellwether that turned to Trump in 2016 and never went back. Newlun said he thinks Trump flipped the county from Obama “on his own.” The New Lisbon City Council member told The Epoch Times that, in 2016, Democrats in the area would come up to him and say they were voting for the businessman. Turkington, whose three children served in the military, told The Epoch Times that the former president’s anti-war message resonated with her. “That’s our sons!” she said. In 2020, Trump strengthened his performance in the growing county, winning about 65 percent of the vote. The enthusiasm was evident elsewhere in New Lisbon on Aug. 13. At a gas pump on the outskirts of town, Stan Benson’s UTV displayed a “Trump 2024” flag. “If they object to it, they object,” he said when asked how he’d respond to someone who took issue with his flag. While Juneau is clearly Trump country, Biden’s 2020 performance was a little stronger in Mauston than in New Lisbon. On the road into town, parallel to another old train line, pro-Trump houses dueled with those decked in more liberal signage. In the realm of symbols, at least, Mauston looked to be at war with itself. “Once Trump came into the picture, it felt like there was a lot of hate that was released,” Diane Dahl told The Epoch Times. A song from Bob Dylan’s “Blood on the Tracks” played in the background. She owns the building housing the Juneau County Democrats. Their office adjoins her art gallery, “Oh! Arts.” The Democratic primary voter said she was harassed by pro-Trump locals in various ways, including through the regular placement of dead animals on her doorstep. She worries there could be “some kind of weird backlash” if Trump loses in November. “We can hope,” Dahl said when asked if she thinks the county could flip back to the Democrats. She said the replacement of Biden by Harris raised interest in the local party. Michele Baumel, a Republican and the owner of the Reel Inn restaurant and campground in nearby Necedah, Wisconsin, said she runs into many pro-Trump Americans who don’t bother to vote. “‘My vote doesn’t count,’ that’s what they say,” she said. “There were a lot more union jobs around here,” said her partner, Dennis Gerke, when asked why Juneau used to go for Democrats. He’s a Trump voter from a family of traditional union Democrats in Janesville, Wisconsin. “I know a lot of people who’ve changed from Democrat to Republican since 2020,” Gerke added, suggesting that this included many military and union families. The two didn’t know of anyone who went the other way. As recently as 2016, he liked what he heard from Sen. Bernie Sanders (I-Vt.)—“other than his socialist bullcrap.” During an Aug. 14 press conference, Eric Hovde predicted to The Epoch Times that the Trump campaign would step up its rallies in Wisconsin as his Democrat rivals intensify their campaigning in the state. Harris held a rally in Milwaukee on the second day of the Democratic National Convention, the latest of her large-scale Wisconsin campaign events. Trump, meanwhile, hosts a town hall in La Crosse, the heart of Van Orden’s district, on Aug. 29. The moderator: ex-Democrat former Rep. Tulsi Gabbard of Hawaii. As Trump seeks to draw in independents and disaffected Democrats, deep purple, motorcycle- and ATV-loving western Wisconsin is worth watching.","summary":"Between the bluffs and the river, a divided land of American character—and characters.","url":"https://www.theepochtimes.com/article/trump-flipped-these-western-wisconsin-counties-what-about-this-time-5714125","image":"https://img.theepochtimes.com/assets/uploads/2024/08/29/id5715327-Wisconsin-Counties-4-300x180.jpg","video":null,"publish_date":"2024-08-30 00:09:57","author":"Nathan Worcester","authors":["Nathan Worcester"],"language":"en","source_country":"us","sentiment":-0.233},{"id":255232432,"title":"Neighbors Say Kamala Harris Has ‘Habit’ of Dining at $300,000-a-Year Club","text":"Kamala Harris’ Los Angeles dining habits are haute and spicy, as residents in her neighborhood have noticed her penchant for eating out at the exclusive Hillcrest Country Club and a beloved local Mexican chain. A new report in The Wall Street Journal detailing the vice president’s life in Los Angeles, where she and her husband Doug Emhoff share a $2.7 million, 3,500 square foot home in the Brentwood neighborhood, notes that in addition to the posh country club, neighbors have noticed another “habit”–a taste for L.A. institution El Cholo. The current initiation fee at Hillcrest is $300,000, according to a source familiar with club memberships who spoke to the Daily Beast on the condition of anonymity. Monthly dues are $2,300, which comes out to $27,600 per year. Emhoff, a high-powered entertainment lawyer before he took on the role of Second Gentleman, has reportedly been a member of the historically Jewish country club for many years. The Hollywood Reporter reported that its initiation fee in 2011 was $185,000, meaning it’s unlikely he paid at the current rate. A favorite hangout of Hollywood legends including Al Jolson and Milton Berle, it was founded in 1920. Hillcrest’s general manager did not reply to requests for comment. Reached by phone, a club employee said he was unavailable. The facility boasts an 18-hole golf course, tennis courts, an Olympic-size swimming pool, and a fitness center. According to the club’s website, women are not allowed to wear shirts “with reference to sex, drugs, alcohol, tobacco or social or political statements” to the tennis courts, while no such stipulation is made for men (who are nevertheless instructed not to wear shirts with wording “unless they are specifically designed for tennis”). The club boasts five different dining options — The Grill, The Patio, The Lounge, the Courtside Café and the Poolside Café — though only the first three offer dinner. Prices are not listed on the dinner menus, which include standard fare starters like oysters and shrimp cocktail and mains including miso sake black code and a wagyu flat iron steak. The Wall Street Journal did not specify if Harris had any preferred menu items. El Cholo, meanwhile, is decidedly less exclusive. The chain, which has six locations in LA and one in Salt Lake City, has an outpost in Santa Monica, not far from Harris and Emhoff’s LA abode. Apart from noticing where their power couple neighbors dine out, one neighbor told The Journal that it’s “very annoying” to live next to America’s Second Family. Another said to the paper, “I will vote for her if she agrees to sell her house.” In no cases were the complaints personal. The residents of the well-heeled area simply seem perturbed by a growing security radius around Harris’s home, which would likely only grow bigger and more ironclad if she became president.","summary":"Photo Illustration by Thomas Levinson/The Daily Beast/GettyKamala Harris’ Los Angeles dining habits are haute and spicy, as residents in her neighborhood have noticed her penchant for eating out at the exclusive Hillcrest Country Club and a beloved local Mexican chain.\n\nA new report in The Wall Street Journal detailing the vice president’s life in Los Angeles, where she and her husband Doug Emhoff share a $2.7 million, 3,500 square foot home in the Brentwood neighborhood, notes that in addition to the posh country club, neighbors have noticed another “habit”–a taste for L.A. institution El Cholo.\n\nThe current initiation fee at Hillcrest is $300,000, according to a source familiar with club memberships who spoke to the Daily Beast on the condition of anonymity. Monthly dues are $2,300, which comes out to $27,600 per year.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/neighbors-say-kamala-harris-has-habit-of-dining-at-dollar300000-a-year-club","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1724975964/240829-kamala-country-club-tease_eubgri","video":null,"publish_date":"2024-08-30 00:01:33","author":"Sean Craig","authors":["Sean Craig"],"language":"en","source_country":"US","sentiment":0.215},{"id":255232200,"title":"Nancy Mace: I Support Trump Because He Protects Rape Victims Like Me","text":"Rep. Nancy Mace (R-SC) argued on Thursday that her desire for a president who will protect survivors of rape is why she’s voting for Donald Trump, who last year was found by a jury to have raped E. Jean Carroll. Asked in a Fox News interview how she feels about “the whole gender thing” factoring into the election, Mace replied, “I’m voting for Donald Trump because I am a woman.” She went on to mock Kamala Harris for sitting down with CNN alongside her running mate, adding, “Nothing says ‘I’m a woman, hear me roar,’ like having your first national interview sit-down with a man by your side.”","summary":"Tom Williams/CQ-Roll Call, Inc via Getty ImagesRep. Nancy Mace (R-SC) argued on Thursday that her desire for a president who will protect survivors of rape is why she’s voting for Donald Trump, who last year was found by a...","url":"https://nation.lk/online/nancy-mace-i-support-trump-because-he-protects-rape-victims-like-me-275297.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-30 00:00:03","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.536},{"id":255232254,"title":"Live: Kamala Harris and Tim Walz sit down for first interview since election campaign began","text":"Simply put, it's because this is the first major interview the vice-president has done since Joe Biden withdrew from this year's election. The president's last-minute decision to drop out, and endorse his deputy, helped Kamala Harris to secure the Democratic nomination without going through a primary election process. That's when voters on both sides of US politics get the chance to select who they want to be their party's candidate in November. It opens them up to scrutiny and usually involves debates with other candidates and interviews with media outlets. Instead, in recent weeks, the vice-president has stuck to tightly controlled public appearances such as campaign rallies, social media videos, and her speech to the Democratic convention. And that means journalists - and you'd expect, many voters - still have a lot of questions about her vision for the US and her record in office so far.","summary":"US Vice-President Kamala Harris and her running mate Tim Walz sit down for their first interview with CNN since President Joe Biden withdrew from his White House bid. Follow live.","url":"https://www.abc.net.au/news/2024-08-30/kamala-harris-tim-walz-cnn-interview-live-updates/104286472","image":"https://live-production.wcms.abc-cdn.net.au/b2fe4548436bd49e9fad36c919ac5205?impolicy=wcms_crop_resize&cropH=2333&cropW=4148&xPos=301&yPos=787&width=862&height=485","video":null,"publish_date":"2024-08-29 23:57:03","author":"Caitlin Rawling","authors":["Caitlin Rawling"],"language":"en","catgory":"politics","source_country":"AU","sentiment":0.025},{"id":255232372,"title":"In first sit-down interview of her presidential campaign, Harris says ‘my values have not changed’","text":"SAVANNAH, Ga. — Vice President Kamala Harris said Thursday “my values have not changed,” as she was questioned along with her running mate, Minnesota Gov. Tim Walz, in their first major television interview of their presidential campaign. The interview with CNN’s Dana Bash gives Harris a chance to quell criticism that she has eschewed uncontrolled environments, while also giving her a fresh platform to define her campaign and test her political mettle ahead of an upcoming debate with former President Donald Trump set for Sept. 10. But it also carries risk as her team tries to build on momentum from the ticket shakeup following Joe Biden’s exit and last week’s Democratic National Convention. The full CNN interview is set to air at 9 p.m. EDT. It was taped at 1:45 p.m. at Kim’s Cafe, a local Black-owned restaurant in Savannah, Georgia, and excerpts were released Thursday afternoon. Harris was asked about changes in her policies over the years, specifically her reversals on fracking and decriminalizing illegal border crossings. “I think the most important and most significant aspect of my policy perspective and decisions is my values have not changed,” Harris replied. Harris also brushed off Trump’s questioning of her racial identity after the former president said she “happened to turn Black.” Harris, who is of Black and South Asian heritage, said it was the “same old, tired playbook.” She also said she’d name a Republican to serve in her Cabinet if she were elected, though she didn’t have a name in mind. Joint interviews during an election year are a fixture in politics; Biden and Harris, Trump and Mike Pence, Barack Obama and Biden – all did them at a similar point in the race. The difference is those other candidates had all done solo interviews, too. Harris hasn’t yet done an in-depth interview since she became her party’s standard bearer five weeks ago, though she did sit for several while she was still Biden’s running mate. Harris and Walz are still introducing themselves to voters, unlike Trump and Biden, of whom people had near-universal awareness and opinion. They were in the midst of a two-day bus tour through southeast Georgia that culminated with an evening rally in Savannah. Harris campaign officials believe that in order to win the state over Trump in November, she must make inroads in GOP strongholds across the state. Democrats’ enthusiasm about their vote in November has surged over the past few months, according to polling from Gallup. About 8 in 10 Democrats now say they are more enthusiastic than usual about voting, compared with 55% in March. This gives them an enthusiasm edge they did not have earlier this year. Republicans’ enthusiasm has increased by much less over the same period, and about two-thirds of Republicans now say they are more enthusiastic than usual about voting. But at a packed arena on Thursday, Harris cast her nascent campaign as the underdog and encouraged the crowd to work hard to elect her in November. “We’re here to speak truth and one of the things that we know is that this is going to be a tight race to the end,” she said. Harris went through a list of Democratic concerns: that Trump will further restrict women’s rights after he appointed three judges to the U.S. Supreme Court who helped overturn Roe, that he’d repeal the Affordable Care Act, and that given new immunity powers granted presidents by the U.S. Supreme Court, “imagine Donald Trump with no guard rails.” Her rally was briefly disrupted by demonstrators who were protesting the U.S. involvement in the Israel-Hamas war. During her time as vice president, Harris has done on-camera and print interviews with The Associated Press and many other outlets, a much more frequent pace than the president — except for Biden’s late-stage media blitz following his disastrous debate performance that touched off the end of his campaign. Harris’ lack of media access over the past month has become one of Republicans’ key attack lines. The Trump campaign has kept a tally of the days she has gone by as a candidate without giving an interview and have suggested she needs a “babysitter” and that’s why Walz will be there. “Dana Bash of CNN has a chance at greatness today. If she gave a fair but tough interview of Comrade Kamala Harris, she will expose her as being totally inept and ill suited for the job of President, much as I exposed Crooked Joe Biden during our now famous Debate,” Trump posted online Thursday. “How cool would that be for Dana and CNN???” Trump has largely steered toward conservative media outlets when granting interviews, though he has held more open press conferences in recent weeks as he sought to reclaim the spotlight that Harris’ elevation had claimed. After the CNN interview, Walz peeled off for other political events out of state, and Harris continued in Georgia, stopping in at Dottie’s Market in Savannah on Thursday, chatting with the owner’s mom as crowds watched from the street where she told voters she’d be rolling out “basically a tax credit for startups, for small businesses who are starting out.” “This is one of my singular priorities is to invest and grow our small businesses,” she said. She met with volunteers too. On Wednesday, Harris and Walz spent time with a high school marching band to the delight of students, and stopped by a Savannah barbecue restaurant. The campaign wants the events to motivate voters in GOP-leaning areas who don’t traditionally see the candidates, and hopes that the engagements drive viral moments that cut through crowded media coverage to reach voters across the country. Harris has another campaign blitz on Labor Day with Biden in Detroit and Pittsburgh with the election rapidly approaching. The first mail ballots get sent to voters in just two weeks.","summary":"Vice President Kamala Harris said “my values have not changed,” as she was questioned along with her running mate, Minnesota Gov. Tim Walz in their first major television interview.","url":"https://www.centralmaine.com/2024/08/29/in-first-sit-down-interview-of-her-presidential-campaign-harris-says-my-values-have-not-changed/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/08/Election_2024_Harris_71076_ea6cd1.jpg?w=1000","video":null,"publish_date":"2024-08-29 23:56:57","author":"Zeke Miller And Colleen Long,ZEKE MILLER and COLLEEN LONG - Associated Pres","authors":["Zeke Miller And Colleen Long","ZEKE MILLER and COLLEEN LONG - Associated Pres"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.25},{"id":255232166,"title":"Harris campaign refuses to sign off on muted mic debate rules: Still 'in discussions' with ABC","text":"The Harris campaign says it won't sign off on the rules for the upcoming ABC News presidential debate over the microphones being muted. The Sept. 10 debate was supposed to maintain the same guidelines previously agreed upon by the Biden and Trump campaigns, which included that mics be muted outside of speaking time. However, the Harris campaign claims the rules are still not set and it is in negotiations with ABC. \"Our latest understanding is that even though Trump said Monday he would be fine with an unmuted mic, his handlers don’t trust him to spar live with VP Harris and are asking ABC to ignore Trump’s comments and keep the mics muted or else they will back out of the debate for a third time,\" Harris spokesperson Brian Fallon wrote on X Thursday. The post continued, \"We have been asked to accede to Trump’s handlers’ wishes on this point for the sake of preserving the debate. We find the Trump’s team’s stance to be weak, and remain in discussions with ABC on the final rules.\" TRUMP, HARRIS SET FOR PRESIDENTIAL DEBATE ON ABC ON SEPTEMBER 10 Fallon later responded to an X post from CNN correspondent Hadas Gold who reported, \"Harris campaign says they've been asked to let it go on the mics so the debate can go on. Don't seem to be doing that. Per a formal list of debate rules ABC sent out, mics would be muted and largely mirror the CNN rules.\" \"The memo sent by ABC is a draft set of rules that both campaigns need to sign off on and indicate agreement. We have not done so because we think both candidates have expressed a clear desire to have hot mics. Not clear why Trump staff is overruling their principal, who should be capable of making up his own mind,\" Fallon insisted. He added, \"Can confirm this is the only remaining sticking point between the two sides.\" Senior Trump advisor Jason Miller contradicted this response in a comment to Fox News Digital. \"The ABC debate rules are set and finalized. Kamala Harris’ lackeys are simply trying to preserve their excuse for backing out of the debate in case the CNN interview with Dana Bash goes poorly,\" Miller said. Fox News Digital reached out to the Harris campaign, while ABC News declined to comment on the matter. After President Biden dropped out of the race, the Harris campaign insisted on moving forward with the previously agreed upon ABC presidential debate. However, weeks after Trump acquiesced, the Harris campaign began trying to change the rules to make the microphones live throughout the event. Though Trump has expressed openness to the idea, both he and his campaign have attacked the Harris campaign for suddenly demanding changes. \"The deal was that we keep the same rules, now all of a sudden they want to make a change in the rules,\" Trump said Monday. TRUMP TAKES SHOTS AT ABC HOSTS, SUGGESTS HE COULD PULL OUT OF DEBATE \"It doesn’t matter to me, I’d rather have it probably on, but the agreement was that it would be the same as it was last time, in that case it was muted,\" Trump continued. \"I didn’t like it the last time, but it worked out fine.\" Miller told Fox News Digital on Monday, \"The Harris camp, after having already agreed to the CNN rules, asked for a seated debate, with notes, and opening statements. We said no changes to the agreed upon rules. If Kamala Harris isn’t smart enough to repeat the messaging points her handlers want her to memorize, that’s their problem.\" He continued, \"This seems to be a pattern for the Harris campaign. They won’t allow Harris to do interviews, they won’t allow her to do press conferences, and now they want to give her a cheat-sheet for the debate. My guess is that they’re looking for a way to get out of any debate with President Trump.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"A Harris spokesperson remarked Thursday that the campaign is continuing to negotiate the ABC News debate rules on muting the candidates&apos; microphones.","url":"https://www.foxnews.com/media/harris-campaign-refuses-sign-off-muted-mic-debate-rules-still-in-discussions-abc","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/HARRIS-TRUMP.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-29 23:52:45","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.303},{"id":255232242,"title":"Trump says IVF costs would be covered if he is elected","text":"WASHINGTON >> Republican presidential candidate Donald Trump said on Thursday he will require the government or insurance companies to pay for IVF fertility treatments if he is elected in November, a move aimed at appealing to women and suburban voters. “Your government will pay for or your insurance company will be mandated to pay for all costs associated with IVF treatment fertilization for women,” the former president told supporters at a campaign event in Potterville, Mich. Trump also said his administration would push for allowing new parents to deduct “major newborn expenses” from their taxes. “We want more babies,” Trump said. Trump will face Democrat Kamala Harris in the Nov. 5 election. A Reuters/Ipsos poll published on Thursday showed Vice President Harris picking up support among women voters. Not all states currently require insurance companies to cover IVF, which involves combining eggs and sperm in a laboratory dish to create an embryo for couples having difficulty conceiving. Even with coverage, IVF is an expensive process that can cost thousands of dollars in drugs and medical procedures. IVF has emerged as a hot-button issue in this election, as Republicans nationwide have scrambled to contain backlash from a decision by the Alabama Supreme Court, which ruled in February that embryos were children. That ruling left it unclear how to legally store, transport and use embryos, prompting some IVF patients to consider moving their frozen embryos out of the state. Trump did not elaborate on how his administration would cover the cost of IVF treatments and the changes to the U.S. tax code, or whether he would seek congressional action on his proposals.","summary":"WASHINGTON >> Republican presidential candidate Donald Trump said on Thursday he will require the government or insurance companies to pay for IVF fertility treatments if he is elected in November, a move aimed at appealing to women and suburban voters.","url":"https://www.staradvertiser.com/2024/08/29/breaking-news/trump-says-ivf-costs-would-be-covered-if-he-is-elected/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-29T231100Z_640400018_RC2XP9AUAWSR_RTRMADP_3_USA-ELECTION-TRUMP.JPG","video":null,"publish_date":"2024-08-29 23:52:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.332},{"id":255231836,"title":"Oprah Winfrey Says Kamala Harris Is No Longer ‘Hiding in Plain Sight’","text":"One week after backing Kamala Harris with an electrifying speech during the Democratic National Convention, Oprah Winfrey was in Venice on Thursday. Winfrey was there to present her friend fashion designer Diane von Furstenberg’s DVF Awards, which celebrate the work of extraordinary women. At the event, held on the sidelines of the Venice Film Festival, Oprah […]","summary":"One week after backing Kamala Harris with an electrifying speech during the Democratic National Convention, Oprah Winfrey was in Venice on Thursday. Winfrey was there to present her friend fashion designer Diane von Furstenberg’s DVF Awards, which celebrate the work of extraordinary women. At the event, held on the sidelines of the Venice Film Festival, Oprah [&#8230;]","url":"https://variety.com/2024/politics/global/oprah-winfrey-kamala-harris-venice-1236124570/","image":"https://variety.com/wp-content/uploads/2024/08/Winfrey-Harris.jpg","video":null,"publish_date":"2024-08-29 23:48:01","author":"Nick Vivarelli,Nvivarelli","authors":["Nick Vivarelli","Nvivarelli"],"language":"en","source_country":"US","sentiment":0.412},{"id":255232848,"title":"Trump and Harris, Turn the Mic On!","text":"Chido Nwangwu writes on why the United States presidential debate microphones involving Democrats’ Kamala Harris and Republicans’ Donald Trump should always be on as Americans prepare for the November 5, 2024 presidential poll. On CNN last night, Thursday August 29, 2024, the presidential flag bearer for the Democratic Party, Vice President Kamala Harris and her running mate, Minnesota Governor, Tim Walz were interviewed. For all of its worth, it’s not the same value as having the candidates engage in a face-to-face debate! Such as what ABC News has proposed for next month on September 10 in Philadelphia between VP Harris and impeached former President Donald Trump. Debates by candidates seeking to lead are very important. Except for some regressive situations and countries where certain candidates duck and hide from speaking to voters to address the issues that are important to their constituents. Millions of people around the world can relate to the importance of these debates. You will, for example, agree with me that the first debate in this 2024 campaign ignited the events that led to incumbent President Joe Biden’s forced departure from the race. Without a doubt, fairly and objectively moderated debates without muting of the instant reactions and responses, will be the optimal and proper way to reach the voters and viewers assessments. I do know from experience that one of the key tests and unrehearsed exposures about a future or current leader of any country, international organization, state or community happens when microphones are turned on! Essentially, the microphones and video cameras connect the unmediated transmitting and broadcasting of some of masked, carefully controlled, hidden dynamics of the behavior and attitudinal swings of men and women in leadership. According to Trump, he’s concerned that the ABC News debate forum has a “panel of Trump haters.” Brian Fallon, the Harris campaign’s senior adviser for communication has stated that for the ABC News debate and any other“we believe both candidates’ mics should be live throughout the full broadcast.” For public interest clash of ideas between candidates on how to move the country forward, there should be an open dialogue. There should always be open/live/hot mics. This way, I believe that the composite profiles, the multiple negatives, rudeness versus politeness factors, geniality and mannerisms of a leader can be in stark animation. Hopefully, this will be an important case for seriousness and focus on the things that matter. The realities of the Trump versus Harris battle for who will become President must take cognizance of the economic challenges of inflation, conflicts, climatic disasters, health crises, deaths caused by cancer, rapid and dizzying changes in the global financial markets and social transformations around the world. The Middle East, Sahelian Africa, Nigeria, Cameroon, parts of Asia and Latin America have grown to become increasingly violent areas. The Ukraine and Russia war leaves Europe at a knife’s edge. Trump and Harris, turn the mics on! -Dr Nwangwu is Founder of the first African-owned, U.S-based newspaper on the internet, USAfricaonline.com, and established USAfrica in 1992 in Houston. Follow him on X @Chido247","summary":"Chido Nwangwu writes on why the United States presidential debate microphones involving Democrats’ Kamala Harris and Republicans’ Donald Trump should always be on as Americans prepare for the November 5,","url":"https://www.thisdaylive.com/index.php/2024/08/30/trump-and-harris-turn-the-mic-on/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Trump-and-Harris.jpeg","video":null,"publish_date":"2024-08-29 23:46:41","author":"Ayo Yusuf","authors":["Ayo Yusuf"],"language":"en","catgory":"politics","source_country":"ng","sentiment":0.194},{"id":255232430,"title":"Nancy Mace: I Support Trump Because He Protects Rape Victims Like Me","text":"Rep. Nancy Mace (R-SC) argued on Thursday that her desire for a president who will protect survivors of rape is why she’s voting for Donald Trump, who last year was found by a jury to have raped E. Jean Carroll. Asked in a Fox News interview how she feels about “the whole gender thing” factoring into the election, Mace replied, “I’m voting for Donald Trump because I am a woman.” She went on to mock Kamala Harris for sitting down with CNN alongside her running mate, adding, “Nothing says ‘I’m a woman, hear me roar,’ like having your first national interview sit-down with a man by your side.” Mace, herself a sexual assault survivor, said that she wanted to vote for a candidate who would protect “women like me, who are survivors of rape,” as well as victims of incest and single mothers. She gave a cursory rundown of Trump’s policies she believed would do that—“lowering taxes for the middle class, expanding the child care tax credit, looking at the spending of the federal government”—before dragging the conversation back into culture-war territory. “I’m voting for Donald Trump because I want to be sure that biological men aren’t in the locker room showering next to my underage daughter,” she insisted. “I want to make sure men aren’t stealing women’s achievements in sports or academics or their scholarships, and that’s why, as a woman, I support Donald Trump.” Last May, Trump was found liable for sexually abusing and defaming Carroll, with a jury determining that he’d assaulted her in a Manhattan department store decades prior. The former president’s legal team immediately jumped on the fact that the jury hadn’t used the word “rape” in its decision. “This was a rape claim, this was a rape case all along, and the jury rejected that—made other findings,” attorney Joe Tacopina told reporters outside the courthouse. But a judge, in rejecting the Trump team’s motion for a new trial, said the terms “rape” and “sexual abuse” did not differ in any material, real-world way. “The finding that Ms. Carroll failed to prove that she was ‘raped’ within the meaning of the New York Penal Law does not mean that she failed to prove that Mr. Trump ‘raped’ her as many people commonly understand the word ‘rape,’” Judge Lewis A. Kaplan wrote. “Indeed, as the evidence at trial recounted below makes clear, the jury found that Mr. Trump in fact did exactly that.” At least 25 other women have publicly accused Trump of sexual misconduct, ranging from groping to rape, over the last five decades. Mace has nevertheless repeatedly gone to bat for the former president, including as his trial was playing out in New York. In a March appearance on ABC’s This Week, the congresswoman grew increasingly combative as host George Stephanopoulos asked how she could support Trump in light of the Carroll case. Mace accused Stephanopoulos of trying to “shame” her with the question. “I will tell you that I was raped at the age of 16, and any rape victim will tell you I’ve lived for 30 years with an incredible amount of shame,” she spat. “I didn’t come forward because of that judgment and shame that I felt, and it’s a shame that you will never feel, George, and I’m not going to sit here on your show and be asked a question meant to shame me about another potential rape victim. I’m not going to do that.”","summary":"Tom Williams/CQ-Roll Call, Inc via Getty ImagesRep. Nancy Mace (R-SC) argued on Thursday that her desire for a president who will protect survivors of rape is why she’s voting for Donald Trump, who last year was found by a jury to have raped E. Jean Carroll. \n\nAsked in a Fox News interview how she feels about “the whole gender thing” factoring into the election, Mace replied, “I’m voting for Donald Trump because I am a woman.” \n\nShe went on to mock Kamala Harris for sitting down with CNN alongside her running mate, adding, “Nothing says ‘I’m a woman, hear me roar,’ like having your first national interview sit-down with a man by your side.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/nancy-mace-i-support-trump-because-he-protects-rape-victims-like-me","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2660,w_4729,x_0,y_79/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1724969873/GettyImages-2162456427_ydxii2","video":null,"publish_date":"2024-08-29 23:45:46","author":"Aj McDougall","authors":["Aj McDougall"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.205},{"id":255231790,"title":"Trump suggests he’ll vote to overturn Florida’s six-week abortion ban: ‘Too short’ ","text":"Former President Donald Trump suggested Thursday that he’ll vote in favor of a Florida ballot measure aimed at overturning the state’s six week abortion ban. “I think the six week is too short. It has to be more time,” Trump told NBC News when asked how he intends to vote on the November referendum. “I want more weeks.” “I am going to be voting that we need more than six weeks,” the former president added. Florida Gov. Ron DeSantis signed the ban — which allows exceptions to save the mother’s life — into law in April of last year. Trump, at the time, called DeSantis’ decision to sign the bill into law a “terrible mistake.” The so-called “heartbeat” law, which derives its name from when an unborn baby’s heartbeat is detectable, went into effect in May. Amendment 4, which is among six ballot questions Florida voters will take up in November, would provide a state constitutional right to abortion before viability, effectively killing the heartbeat law. The measure will require a threshold of at least 60% support to succeed. Trump has presented himself as being sympathetic to abortion rights advocates since the launch of his 2024 campaign. He announced earlier this year that he would not support a national ban on the procedure. Last week, Trump touted on Truth Social that, if elected, his administration would be “great for women and their reproductive rights.” The Republican nominee for president indicated Thursday that he was fairly satisfied with the state of play as it relates to abortion. “Look, just so you understand, everybody wanted Roe v. Wade terminated for years, 52 years. I got it done,” Trump said. “They wanted to go back to the states.” “Exceptions are very important for me, for Ronald Reagan, for others that have navigated this very, very interesting and difficult path.” A poll from the University of North Florida’s Public Opinion Research Lab released last month showed 69% of Sunshine State residents indicating that they would vote yes on Amendment 4 – which far out-polled support for Vice President Kamala Harris in the state. However, a Florida Atlantic University/Mainstreet USA poll released earlier this month found only 56% of Floridians supporting the proposed amendment – 4 points less than necessary for the amendment to become law.","summary":"“I think the six week is too short. It has to be more time,” Trump told NBC News when asked how he intends to vote on the November referendum. “I want more weeks.”","url":"https://nypost.com/2024/08/29/us-news/trump-suggests-hell-vote-to-overturn-floridas-six-week-abortion-ban-too-short/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/donald-trump-suggests-ll-vote-88528255.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/2V3OJSjp-RyIcpnTz.mp4","publish_date":"2024-08-29 23:43:14","author":"Victor Nava","authors":["Victor Nava"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.125},{"id":255231666,"title":"Rep. Nikema Williams: VP Harris is Bringing a ‘Movement’","text":"“This is not just a moment. This is a movement in this country,” Congresswoman Nikema Williams tells NTD’s Jack Bradley of voters energy this election year. She says energy was high when Vice President Kamala Harris visited the battleground state of Georgia.","summary":"“This is not just a moment. This is a movement in this country,” Congresswoman Nikema Williams tells NTD’s Jack Bradley of voters energy this election year. She says energy was high when Vice President Kamala Harris visited the battleground state of Georgia.","url":"https://www.theepochtimes.com/epochtv/rep-nikema-williams-vp-harris-is-bringing-a-movement-5715424","image":"https://img.theepochtimes.com/assets/uploads/2024/08/29/id5715446-Rep.-Nikema-Williams.jpg","video":null,"publish_date":"2024-08-29 23:31:38","author":"Jack Bradley","authors":["Jack Bradley"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.274},{"id":255231594,"title":"Trump says Florida’s six-week abortion ban is ‘too short’ and suggests he will vote to amend it","text":"Donald Trump opposes Florida’s law that bans abortion at roughly six weeks of pregnancy and appeared to suggest that he will vote for an abortion rights amendment to the state’s constitution this November. Trump, who is registered to vote in Florida, told NBC News on Thursday that he wants “more weeks.” If Florida voters approve Amendment 4 on their ballots this fall, the state’s constitution would be amended to state that “no law shall prohibit, penalize, delay, or restrict abortion before viability or when necessary to protect the patient’s health, as determined by the patient’s healthcare provider.” That amendment would effectively overturn the state’s ban on abortion at six weeks of pregnancy - before most people know they are pregnant. When asked by NBC News how he plans to vote on the amendment, Trump said that “the six week is too short” and “there has to be more time.” “I’ve told them I want more weeks,” he said. “I am going to be voting that we need more than six weeks.” The Republican presidential nominee has failed to present a cohesive platform for reproductive healthcare, and his conflicting statements over the last 25 years have drawn criticism from both abortion rights supporters and his anti-abortion allies. At one point in 2015, Trump had “five positions on abortion in three days,” according to The Washington Post, while Kamala Harris and his Democratic rivals have warned that another Trump administration with a Republican-controlled Congress could advance a national abortion ban. Trump has repeatedly taken credit for the Supreme Court’s reversal of Roe v Wade, which had affirmed a constitutional right to abortion care. The Trump-aligned Project 2025 document, that is designed to inform his administration, also proposes the application of a long-dormant obscenity law to block abortion drugs from the market. The Supreme Court dismissed a right-wing legal challenge to the government’s approval of a widely-used abortion drug, and Trump has said that “generally speaking” he does not support banning drugs like mifepristone under the Comstock Act. “It’s going to be available and it is now,” he recently told CBS News. “And as I know it, the Supreme Court has said: ‘Keep it going the way it is.’ I will enforce and agree with the Supreme Court, but basically they’ve said, keep it the way it is now.” Last week, he claimed on his Truth Social account that his administration “will be great for women and their reproductive rights.” Florida is among more than a dozen states that have outlawed all or most abortions in the wake of the Supreme Court’s 2022 decision in Dobbs v Jackson Women’s Health Organization, which Trump supports. Since earlier this year, Florida’s six-week ban makes it a felony to perform or actively participate in an abortion in the state after roughly six weeks’ gestation, or about two weeks after a missed period. Voters in at least 10 states will vote on abortion rights measures this November, including measures that could enshrine a right to seek abortion care in their states’ constitutions.","summary":"‘I am going to be voting that we need more than six weeks,’ Trump says when asked about Ballot Amendment 4 in Florida","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-abortion-florida-desantis-b2604178.html","image":"https://static.independent.co.uk/2024/08/29/23/6ee89d9ce55c474d8d545a304c799a88.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/VT51YucE-4VHSaSK0.mp4","publish_date":"2024-08-29 23:31:24","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.253},{"id":255231418,"title":"Kamala Harris: I Will Appoint a Republican to My Cabinet","text":"TCF vendors Exponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Roq.ad GmbHCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Index Exchange Inc. Cookie duration: 395 (days).Data collected and processed: Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch QuantcastCookie duration: 396 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch BeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Sovrn, Inc.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch AdikteevDoesn't use cookies.Data collected and processed: Probabilistic identifiers, Authentication-derived identifiers, IP addresses, Users’ profiles, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch RTB House S.A.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch The UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Nexxen Inc.Cookie duration: 180 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EpsilonCookie duration: 184 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Yahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch ADventori SASCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Triple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Xandr, Inc.Cookie duration: 90 (days).Data collected and processed: Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch NEORY GmbHCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Nexxen Group LLCCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch NEURAL.ONECookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch ADITION (Virtual Minds GmbH)Cookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Active Agent (Virtual Minds GmbH)Cookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Taboola Europe LimitedCookie duration: 366 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EquativCookie duration: 396 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Adform A/SCookie duration: 3650 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Magnite, Inc. Cookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch RATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch Sift Media, IncDoesn't use cookies.Data collected and processed: Precise location data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Rakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Lumen Research LimitedDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch Amazon Ad ServerCookie duration: 396 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch OpenXCookie duration: 365 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Yieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Roku Advertising ServicesCookie duration: 396 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Nano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Browsing and interaction data, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch Simplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: Precise location data, IP addresses, Device identifiersmoreUses other forms of storage.View details | Privacy policylaunch PubMatic, IncCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Comscore B.V.Cookie duration: 720 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch FlashtalkingCookie duration: 730 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch PulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Smaato, Inc.Cookie duration: 21 (days).Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Semasio GmbHCookie duration: 366 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Crimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Genius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Criteo SACookie duration: 390 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Adloox SADoesn't use cookies.Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Blis Global LimitedCookie duration: 400 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Lotame Solutions, IncCookie duration: 274 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch LiveRampCookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch GroupM UK LimitedCookie duration: 395 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch LoopMe LimitedCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Dynata LLCCookie duration: 365 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Ask LocalaDoesn't use cookies.Data collected and processed: Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch AziraDoesn't use cookies.Data collected and processed: Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch DoubleVerify Inc.​Doesn't use cookies.Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch BIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch IPONWEB GmbHCookie duration: 365 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch NextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Teads France SASCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Ströer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch OS Data Solutions GmbH & Co. KGCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Permodo GmbHDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Platform161 B.V.Cookie duration: 396 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Basis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch SMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Bombora Inc.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EASYmedia GmbHCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Remerge GmbHDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch advanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Magnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Delta Projects ABCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch usemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch emetriq GmbHCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Publicis Media GmbHCookie duration: 1825 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch M.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch OneTag LimitedCookie duration: 396 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Cloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Smartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Improve DigitalCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Adobe Advertising CloudCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, IP addresses, Privacy choices, Device identifiersmoreView details | Storage details | Privacy policylaunch Bannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch TabMo SASDoesn't use cookies.Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Integral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch WizalyCookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch WeboramaCookie duration: 393 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Jivox CorporationCookie duration: 30 (days).Data collected and processed: Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Vistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policylaunch On Device Research LimitedCookie duration: 30 (days).Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch Rockabox Media LtdDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device characteristicsmoreView details | Storage details | Privacy policylaunch Exactag GmbHCookie duration: 180 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Celtra Inc.Doesn't use cookies.Data collected and processed: Precise location data, IP addresses, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch mainADV SrlCookie duration: 30 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Gemius SACookie duration: 1825 (days).Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch The Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Nielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Solocal SACookie duration: 396 (days).Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Pixalate, Inc.Doesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch Oracle AdvertisingCookie duration: 180 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch NumberlyCookie duration: 180 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch AudienceProject A/SCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Demandbase, Inc.Cookie duration: 730 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Effiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Arrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Seenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policylaunch Commanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policylaunch travel audience GmbHCookie duration: 397 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch HUMANDoesn't use cookies.Data collected and processed: Probabilistic identifiers, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Adludio Ltd.Doesn't use cookies.Data collected and processed: Precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Blendee srlCookie duration: 366 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Innovid LLCCookie duration: 90 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Papirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policylaunch Neustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Verve Group Europe GmbHDoesn't use cookies.Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Otto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Adobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Localsensor B.V.Doesn't use cookies.Data collected and processed: Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Online SolutionCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Relay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch GP One GmbHCookie duration: Uses session cookies.Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch The MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch MindTake Research GmbHCookie duration: 180 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Cint ABCookie duration: 730 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Google Advertising ProductsCookie duration: 396 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch GfK GmbHCookie duration: 730 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch RevJetCookie duration: 730 (days).Data collected and processed: IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Protected Media LTDDoesn't use cookies.Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Clinch Labs LTDCookie duration: 730 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Oracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: IP addresses, Non-precise location datamoreView details | Privacy policylaunch Hearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Amazon AdvertisingCookie duration: 396 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Moloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Adtriba GmbHCookie duration: 730 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Objective Partners BVCookie duration: 90 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch EnsightenCookie duration: 1825 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch eBay IncCookie duration: 90 (days).Data collected and processed: IP addresses, Privacy choices, Device characteristicsmoreView details | Storage details | Privacy policylaunch MetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Hurra Communications GmbHCookie duration: 366 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Ad partners AkamaiPrivacy policylaunch MetaPrivacy policylaunch AunicaPrivacy policylaunch Booking.comPrivacy policylaunch C3 MetricsPrivacy policylaunch IBMPrivacy policylaunch EvidonPrivacy policylaunch AdacadoPrivacy policylaunch intelliAdPrivacy policylaunch DstilleryPrivacy policylaunch MediaMathPrivacy policylaunch ZMSPrivacy policylaunch Omnicom Media GroupPrivacy policylaunch ResonatePrivacy policylaunch SojernPrivacy policylaunch Tradedoubler ABPrivacy policylaunch TrustArcPrivacy policylaunch TruEffectPrivacy policylaunch Travel Data CollectivePrivacy policylaunch advolution.controlPrivacy policylaunch LifeStreetPrivacy policylaunch AdMaximPrivacy policylaunch Batch MediaPrivacy policylaunch Vodafone GmbHPrivacy policylaunch MagnitePrivacy policylaunch ScenestealerPrivacy policylaunch NetquestPrivacy policylaunch Manage.comPrivacy policylaunch CloudflarePrivacy policylaunch Salesforce DMPPrivacy policylaunch NetflixPrivacy policylaunch ebuildersPrivacy policylaunch AppLovin Corp.Privacy policylaunch Fractional MediaPrivacy policylaunch RackspacePrivacy policylaunch LiftoffPrivacy policylaunch MSI-ACIPrivacy policylaunch AdmetricsPrivacy policylaunch NaveggPrivacy policylaunch AdmedoPrivacy policylaunch KochavaPrivacy policylaunch MobitransPrivacy policylaunch ADEXPrivacy policylaunch ImpactPrivacy policylaunch SpotadPrivacy policylaunch AarkiPrivacy policylaunch SFRPrivacy policylaunch CablatoPrivacy policylaunch WaystackPrivacy policylaunch TreSensaPrivacy policylaunch gskinnerPrivacy policylaunch CUBEDPrivacy policylaunch OptomatonPrivacy policylaunch AnalightsPrivacy policylaunch Dentsu Aegis NetworkPrivacy policylaunch DigisegPrivacy policylaunch Haensel AMSPrivacy policylaunch BDSK Handels GmbH & Co. KGPrivacy policylaunch Marketing Science Consulting Group, Inc.Privacy policylaunch DENTSUPrivacy policylaunch KoblerPrivacy policylaunch WidespacePrivacy policylaunch VimeoPrivacy policylaunch","summary":"CNNKamala Harris promised Thursday to appoint a Republican to her Cabinet if she’s elected president.“I think it’s important to have people at the table when some of the most important decisions are being made that have different views, different...","url":"https://nation.lk/online/kamala-harris-i-will-appoint-a-republican-to-my-cabinet-275296.html","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1571,w_2794,x_28,y_16/dpr_2.0/c_limit,w_585/fl_lossy,q_auto/Screenshot_2024-08-30_at_8.58.00_AM_xner7q","video":null,"publish_date":"2024-08-29 23:30:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":0.223},{"id":255231502,"title":"Growing Challenges for Dems in Arab and Muslim Voting Hotspots Across the U.S.","text":"During President Joe Biden’s speech at the Democratic National Convention (DNC) in Chicago on August 19, pro-Palestinian delegates briefly unveiled a banner urging an end to U.S. arms for Israel before they were drowned out by cheers for Biden. Meanwhile, pro-Palestinian protests outside the arena further highlighted the lingering divides between the Democratic establishment and its constituents. Vice President Kamala Harris’s promotion as the party’s nominee has slightly eased tensions, but her reluctance to fully endorse a ceasefire has kept discontent alive. Arab and Muslim Americans have been central to elevating the Gaza War to the forefront of national politics. Yet despite increased attention to their political influence since October 7, 2023, their ability to sway presidential elections is still uncertain. These communities are largely concentrated in major cities and relatively small in numbers, with limited overlap. Roughly three-quarters of the 3.7 million Arab Americans are Christian, while Arab Muslims form about 15 percent of the 4.5 million Muslims in the country. Illinois has the highest per capita Muslim population in the U.S., yet they make up less than 4 percent of the state. Michigan’s Arab population, per capita the largest in the country, forms just over 2 percent. Support for Palestine, however, unites the Arab and Muslim populations, alongside progressives. Their fervent and organized opposition to Biden’s stance on the Gaza conflict casts doubt on whether Harris and the Democrats can regain their support before the election, particularly in must-win swing states. Yet while the Palestinian issue has amplified the visibility of these voters, their political activism extends to cities and congressional districts across the country. Friction with Democrats over several issues has created openings for Republicans, so far with mixed results. The fluidity of Muslim and Arab voters has been apparent for decades. As the American Muslim population grew into a substantial voting bloc in the 1980s, for example, neither political party consistently secured their loyalty. President George W. Bush won the Muslim vote comfortably over Al Gore in the 2000 election, but the War on Terror, Patriot Act, and surveillance and harassment of American Muslim communities after 9/11 drove it to the Democrats. By the 2020 election, Arab and Muslim American dissatisfaction with Democrats reignited some competition over their votes, though it remained lopsided. While 64 percent of Muslim Americans voted for Biden, 35 percent supported Donald Trump, up from 2016, and largely similar to the Arab American vote. Polling in the aftermath of October 7 revealed declining approval for both men, with Biden hit harder. A Council on American-Islamic Relations poll showed Muslim voters preferred Biden to Trump by 37 percent to 27 percent, while Pew Research found support nearly tied at 36 percent to 35 percent. The Arab American Institute found Trump leading Biden 32 percent to 18 percent among Arab Americans. Frustrated with their presidential choices, Muslim and Arab American leaders launched an #AbandonBiden campaign in late 2023 to back third-party candidates, largely on the left, supporting an unconditional ceasefire. Additionally, a push within the Democratic Party’s base to vote “uncommitted” in Michigan’s February 2024 primary in turn garnered 100,000 votes, just over 50,000 shy of Biden’s 2020 margin of victory in the state. “Uncommitted” volunteers expanded their effort to other states, with Minnesota’s tally reaching 20 percent of the total. Overall, protest votes averaged 13 percent in the Democratic primaries—double the historical average. Eyeing an opportunity, Trump has attempted to capitalize on the backlash to Biden. Lebanese-born businessman Massad Boulos, whose son married Trump’s daughter, Tiffany, has led outreach to Arab American voters. He began working closely with Bishara Bahbah, a former associate director of the Middle East Policy Institute at Harvard Kennedy School, who launched the group Arab Americans for Trump. Distrust toward Trump remains high among Muslim communities, however, limiting outreach opportunities. Kamala Harris’s stance on Gaza has remained carefully balanced since she became the presumptive nominee. The vice president skipped Israeli Prime Minister Benjamin Netanyahu’s speech to Congress in July (citing a scheduling conflict), but later met with him privately during his visit. Harris then appointed her aide Nasrina Bargzie in August to help build support among Arab and Muslim voters. Still, despite enthusiasm for Harris, concerns linger among Democrats. Leaders of the “uncommitted” campaign met with Harris and her vice-presidential pick, Tim Walz, in August 2024 for discussions. The organization claimed Harris expressed support for a ceasefire and an openness to discussing an arms embargo, though a Harris aide quickly clarified that the latter was not agreed upon while emphasizing the need for more dialogue. Days later, the #AbandonBiden campaign rebranded to #AbandonHarris, while the Muslim Women for Harris group disbanded and withdrew support for her after Palestinian speakers were denied a speaking slot at the DNC. Arab and Muslim Americans have limited representation in Congress to push the issue. The first Arab-American congressman took office in 1959, and only a handful are currently serving. Keith Ellison became the first Muslim elected to Congress in 2007, representing Minnesota’s 5th District, followed by Andre Carson in 2008, who served Indiana’s 7th District. Ilhan Omar succeeded Ellison in 2019 and was decisively reelected in August 2024. She has maintained strong advocacy for Palestine, alongside fellow Congresswoman Rashida Tlaib, who is both a Muslim and Arab American. The focus on building momentum in congressional districts and in cities has nonetheless positioned Muslim and Arab American communities for greater influence, amplified through cooperation with progressive groups like the Jewish Voice for Peace. Several city councils, such as Akron, Ohio, began passing legislation calling for a ceasefire weeks into the Gaza War. In March 2024, the “Listen to Michigan” group helped organize a town hall in Cleveland for congressional candidates to speak with Arab and Muslim communities, including Matthew Diemer, now the Democratic nominee for Ohio’s 7th District. The intensified efforts of Arab and Muslim groups and politicians have undoubtedly brought greater visibility to Gaza, especially given the Democratic Party’s need to consolidate its electoral coalition. Arab and Muslim Americans have become a significant focus for Republicans and Democrats in swing states like Michigan and Ohio, and an ability to organize on more local levels across the country has granted them growing political weight. Because the concerns of Arab and Muslim Americans are often narrowly tied to the Israel-Palestine conflict, the broader issues affecting these communities tend to be overshadowed, particularly in larger multicultural states. However, in smaller states and communities, friction with Democrats over several issues had led Republicans to sense outreach opportunities for years. The GOP’s strategy has been to appeal to the opposition many Arab and Muslim American communities have toward certain progressive social issues. Muslim and Coptic Christian parents protested the inclusion of LGBT criteria in education in Jersey City in 2020. A similar scenario occurred in Maryland’s Montgomery County in 2023, where hundreds of parents, supported by the Council on American-Islamic Relations, protested against LGBT-inclusive education. County councilwoman Kristin Mink’s claim that parents were on the same side as “white supremacists and outright bigots,” which she later apologized for, reflected the tension between mainstream Democrats and more socially conservative sections of Arab and Muslim American communities. Michigan, with its significant Arab and Muslim populations, has become a major political battleground over LGBT rights. In the city of Dearborn, where these communities are concentrated and where “uncommitted” voters outnumbered votes for Biden by 56 percent to 40 percent, the clash has been particularly notable. In 2022, hundreds of conservative Muslims and Christians united in protest against the inclusion of LGBT content in schools, including prominent Michigan Republicans and Moms for Liberty, a conservative Christian organization. Dearborn, the first Arab-majority city in the U.S., is part of Rashida Tlaib’s 12th District, where her strong support for LGBT rights has prompted Republicans to capitalize on the issue and undermine her support. Former Republican congressional candidate Steven Elliott participated in Dearborn school board meetings with Muslim parents discussing LGBT education, while Matthew DePerno, GOP nominee for Michigan attorney general, stated, “I am proud to stand with the parents of Dearborn,” during his campaign. Hamtramck, Michigan, remains the only Muslim-majority city in the country. Progressives expressed enthusiasm when the city elected the first Muslim-majority council in the U.S. in 2015, and a Muslim mayor in 2022. But in 2023, after the council voted to exclude LGBT flags from city property, local Democratic groups and residents organized protests against the decision, which received support from Republicans. Additionally, cooperation between foreign Muslim organizations and domestic conservative Christian groups has become less taboo. In December 2022, Saudi Arabia’s International Islamic Fiqh Academy expressed solidarity with Family Watch International, a Christian right organization based in Arizona. Representatives from the Organization for Islamic Cooperation then delivered statements at Family Watch International’s annual global policy forum weeks later. While Arab and Muslim Americans may not be flocking to Republicans over their approach to Gaza, Democrats have so far failed to distinguish themselves from the GOP on the issue. A sense of political abandonment, intensified since the Gaza War, has led to more fluid political identities within these communities. Issues such as the erosion of traditional values, support for law enforcement, and others have emerged or reemerged as potential avenues for greater cooperation with Republicans. However, a lack of faith in the GOP’s ability to manage the various issues facing Muslim and Arab American communities means that votes for “uncommitted”, as well as growing disillusionment and abstaining from voting altogether, are becoming more common. Republican leaders will need to more effectively address Muslim and Arab Americans’ concerns about the party’s stance on Israel and Gaza, as well as reverse lingering discontent among traditional Republican voters toward Muslims, if they intend to appeal to these communities. Meanwhile, the Democratic Party faces an uphill battle in convincing these communities to come back into the fold, which will require taking a stronger stance against Israel’s treatment of Palestinians. Politicians like pro-Palestinian Green Party presidential candidate Jill Stein, along with her Muslim vice presidential pick Rudolph Ware, could also help improve the chances of third parties by rallying Muslim and Arab American support in the 2024 election and future campaigns. As Muslim and Arab American populations continue to grow and establish themselves, their political influence will only increase. In 2017, three-quarters of American Muslims were immigrants and children of immigrants, and they are generally younger than the average American. Fast-growing Muslim communities in Texas’s Houston and Dallas-Fort Worth, Washington, DC, and beyond are set to make a significant impact. With effective activism and growing populations, Arab and Muslim American communities are likely to influence both major parties to align more with their interests in the coming years—from foreign policy issues like Gaza to pivotal domestic initiatives. Failing to do so will drive more voters toward third parties, further disrupting the traditional balance of the two-party system. Source: Independent Media Institute","summary":"During President Joe Biden’s speech at the Democratic National Convention (DNC) in Chicago on August 19, pro-Palestinian delegates&#160;briefly unveiled a banner&#160;urging an end to U.S. arms for Israel before they were drowned out by cheers for Biden. Meanwhile, pro-Palestinian protests outside the arena further highlighted the lingering divides between the Democratic establishment and its constituents. Vice President Kamala Harris’s promotion as the party’s nominee has slightly eased tensions, but her reluctance to fully endorse a ceasefire has kept discontent alive. Arab and Muslim Americans have been central to elevating the Gaza War to the forefront of national politics. Yet despite","url":"https://slguardian.org/growing-challenges-for-dems-in-arab-and-muslim-voting-hotspots-across-the-u-s/","image":"https://slguardian.org/wp-content/uploads/2024/07/us-elections-2024-trump.jpg","video":null,"publish_date":"2024-08-29 23:30:00","author":"John P. Ruehl,Sri Lanka Guardian","authors":["John P. Ruehl","Sri Lanka Guardian"],"language":"en","source_country":"LK","sentiment":0.053},{"id":255231544,"title":"Harris gives first interview since entering race","text":"Harris gives first interview since entering race Vice President Kamala Harris gave her first interview Thursday since President Biden dropped his reelection bid last month. It came as former President Donald Trump was under scrutiny for sharing a sexist and degrading social media post about his opponent and former Secretary of State Hillary Clinton. Nancy Cordes has the latest.","summary":"Vice President Kamala Harris gave her first interview Thursday since President Biden dropped his reelection bid last month. It came as former President Donald Trump was under scrutiny for sharing a sexist and degrading social media post about his opponent and former Secretary of State Hillary Clinton. Nancy Cordes has the latest.","url":"https://www.cbsnews.com/video/harris-gives-first-interview-since-entering-race/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/29/5a341d30-202c-43dd-bcc4-69c022746692/thumbnail/1200x630/e362b30a2f286743bb444b23f704b828/0829-en-cordes.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-08-29 23:30:00","author":null,"language":"en","source_country":"US","sentiment":-0.01},{"id":255231456,"title":"Trump vows to cut energy costs in half — and he has a real plan to do it","text":"“I will be the American energy president,” Donald Trump vowed Thursday in Michigan, promising to cut energy costs in half. The “again” was understood, since Trump had made America energy-independent in his first term, before the Harris-Biden crowd took over and sent costs soaring. He’ll “slash red tape,” ramp up approvals of new power plants, spur nuclear energy, and roll back Democrats’ fossil-fuel restrictions. Hear, hear! It’s the all-of-the-above strategy that led the nation to become in Trump’s first term. And it would once again yield huge gains not just for America, but the entire Free World. As former Interior Secretary David Bernhardt made clear on a campaign press call, such plans are vital to future prosperity. “Between soaring demand and retiring coal, we are facing a great [energy] capacity shortfall of at least 30% by 2032,” Bernhardt warned — arguing that Team Harris-Walz can’t make up the difference thanks to “their net zero vision.” Democrats are too obsessed with reducing carbon emissions, and so block not only new gas- and oil-drilling, but also new pipelines, refineries, fossil-fuel power plants (and cars and stoves and heating) and so on. Under Trump’s plan, Bernhardt predicted, “every manufacturing plant, every data center, every semiconductor facility and assembly line will want to be built in America — because America will be the place where the cost of energy is lower than anywhere else on Earth.” Those lower costs will help rein in inflation in America as well: After all, energy — electricity for manufacturing or oil for transportation — accounts for a hefty share of the cost of nearly every product. And energy prices have shot up under Harris-Biden: Gasoline, by 45%, for instance, and commercially used natural gas, as of May, by 43%. Kamala Harris has explicitly opposed fracking (though campaign aides anonymously say she doesn’t anymore) and wants to force every American to switch to electric vehicles. Trump, by contrast, would scrap Harris-Biden rules, lift the bans, help existing plants and boost nuclear power, particularly from “small modular reactors,” a new technology with great promise He’d also push back against EV mandates and pull out of the Paris Climate Accords (again). All of which would do much to shore up the nation’s supplies, stabilize the power grid and enable exports to aid allies in Europe now dependent on Russian energy. The fact is, Making America Great Again means restoring its energy might. That won’t happen in a Harris presidency. It’ll take a Trump victory in November to make the nation “powerful” once again.","summary":"Former President Donald Trump laid out broad plans to bolster the nation's energy supplies by rolling back Kamala Harris-Joe Biden rules, boosting power plants, tapping reserves and spurring nuclear power.","url":"https://nypost.com/2024/08/29/opinion/trump-would-make-america-juiced-again-with-his-all-of-the-above-energy-plans/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-a8aloop9q-1724972622561.jpg?quality=75&strip=all&1724958272&w=1200","video":null,"publish_date":"2024-08-29 23:28:54","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":0.052},{"id":255231548,"title":"Harris in Georgia, Trump in Michigan, Wisconsin","text":"Harris in Georgia, Trump in Michigan, Wisconsin Former President Donald Trump held campaign stops in Michigan and Wisconsin Thursday while Vice President Kamala Harris addressed voters in Savannah, Georgia. CBS News camapign reporters Aaron Navarro and Taurean Small report.","summary":"Former President Donald Trump held campaign stops in Michigan and Wisconsin Thursday while Vice President Kamala Harris addressed voters in Savannah, Georgia. CBS News camapign reporters Aaron Navarro and Taurean Small report.","url":"https://www.cbsnews.com/video/harris-in-georgia-trump-in-michigan-wisconsin-2024/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/29/2bd8ad9b-a7ce-4042-adbd-2dbe50d3b075/thumbnail/1200x630/f6b3f3c8752a36838ed03cd8edde493f/cbsn-fusion-harris-in-georgia-trump-in-michigan-wisconsin-2024-thumbnail.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-08-29 23:27:14","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.589},{"id":255231398,"title":"Whooping cough cases are on the rise. Doctors explain the symptoms","text":"CTVNews.ca Top Stories Road rage incident: Tesla driver knocked senior's teeth out, B.C. RCMP say Authorities are asking for the public's help identifying a Tesla driver following a disturbing road rage incident that played out in North Vancouver, B.C., earlier this month. Poilievre asks Singh to pull out of Trudeau confidence deal to prompt fall election Conservative Leader Pierre Poilievre is asking NDP Leader Jagmeet Singh to pull out of the deal he has with Prime Minister Justin Trudeau, to force an election this fall. Some trees' leaves are changing colour already. Here's why that may be happening, according to a botany expert If you’ve noticed trees in parts of Canada have been changing colours earlier than usual in recent years, you’re not alone, according to a botany expert who spoke with CTVNews.ca. Victim, accused in corn maze killing previously deemed 'significant threat' to public: documents The accused and the victim in a fatal stabbing at the Edmonton Corn Maze earlier this week had both previously been found not criminally responsible for violent crimes and confined to a psychiatric hospital, court documents show. Crown recommends 9 years in prison for protesters at Coutts border blockade A Crown prosecutor says two men convicted of mischief and weapons offences at the 2022 border blockade at Coutts, Alta., should spend nine years in prison. Afghan women sing in protest to Taliban's voice ban Afghan women around the globe are singing in solidarity to protest the Taliban's new rules that prohibit women's voices from being heard in public. Woman found dead before police kill husband on I-95 bridge and discover boy's body in vehicle A man being pursued in the killing of his wife in New Hampshire was shot by police and tumbled from the Interstate 95 bridge that connects the state to Maine, officials said Thursday. Their eight-year-old boy was found dead in the back seat of the father's vehicle afterward. Whooping cough cases are on the rise. Doctors explain the symptoms Pertussis, commonly known as the whooping cough or the 100-day cough is spreading across Canada at a concerning rate, according to public health officials. U.S. army defends Arlington National Cemetery employee in Trump campaign incident The U.S. army defended an Arlington National Cemetery employee who was pushed aside during a visit by former president Donald Trump, saying that she acted professionally and was being unfairly attacked. Canada Crown recommends 9 years in prison for protesters at Coutts border blockade A Crown prosecutor says two men convicted of mischief and weapons offences at the 2022 border blockade at Coutts, Alta., should spend nine years in prison. Manitoba premier says Jeremy Skibicki should stay behind bars for life Convicted serial killer Jeremy Skibicki should never again see the light of day as a free person, and any future parole hearings should take into account the impact his killings have had on family members, Manitoba Premier Wab Kinew said Thursday. Victim, accused in corn maze killing previously deemed 'significant threat' to public: documents The accused and the victim in a fatal stabbing at the Edmonton Corn Maze earlier this week had both previously been found not criminally responsible for violent crimes and confined to a psychiatric hospital, court documents show. Road rage incident: Tesla driver knocked senior's teeth out, B.C. RCMP say Authorities are asking for the public's help identifying a Tesla driver following a disturbing road rage incident that played out in North Vancouver, B.C., earlier this month. Some trees' leaves are changing colour already. Here's why that may be happening, according to a botany expert If you’ve noticed trees in parts of Canada have been changing colours earlier than usual in recent years, you’re not alone, according to a botany expert who spoke with CTVNews.ca. Man sought for murder in Toronto-area woman's death fled to Hong Kong Police say a man wanted for first-degree murder in the death of a Toronto-area woman has fled Canada. World U.S. Justice Department watchdog finds failures in FBI's handling of child sex abuse cases The FBI has failed to report some child sexual abuse allegations to local law enforcement or social service agencies even after changes prompted by its handling of the case against former USA Gymnastics team doctor Larry Nassar, according to a Justice Department watchdog report released Thursday. Afghan women sing in protest to Taliban's voice ban Afghan women around the globe are singing in solidarity to protest the Taliban's new rules that prohibit women's voices from being heard in public. Harris and Walz will sit down for first major television interview of their presidential campaign Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, will sit down Thursday for their first major television interview of their presidential campaign as the duo travels in southeast Georgia on a bus tour. Ukraine says one of its Western-donated F-16 warplanes has crashed One of the handful of F-16 warplanes that Ukraine has received from its Western partners to help fight Russia's invasion has crashed, Ukraine's Army General Staff said Thursday. The pilot died. A baby in Gaza has a strain of polio linked to mistakes in eradication campaign, experts say The baby in Gaza who was recently paralyzed by polio was infected with a mutated strain of the virus that vaccinated people shed in their waste, according to scientists who say the case is the result of “an unqualified failure” of public health policy. U.S. army defends Arlington National Cemetery employee in Trump campaign incident The U.S. army defended an Arlington National Cemetery employee who was pushed aside during a visit by former president Donald Trump, saying that she acted professionally and was being unfairly attacked. Politics Poilievre asks Singh to pull out of Trudeau confidence deal to prompt fall election Conservative Leader Pierre Poilievre is asking NDP Leader Jagmeet Singh to pull out of the deal he has with Prime Minister Justin Trudeau, to force an election this fall. Visitors to Canada can no longer apply for work permits from within the country Visitors to Canada can no longer apply for work permits from within the country, Immigration, Refugees and Citizenship Canada (IRCC) announced Wednesday, bringing an early end to a pandemic-era program that temporarily expanded immigration access. Federal government claims back-to-office mandate will boost careers, improve services In less than two weeks, the federal government’s back-to-office mandate for public servants comes into effect. Employees will be required to work in-person at least three days a week and despite pushback from workers, the government says this is the right move. Health Massachusetts health officials report second case of potentially deadly mosquito-borne virus Massachusetts health officials on Thursday announced a second confirmed case of the mosquito-borne eastern equine encephalitis virus in the state. Tylenol maker defeats U.S. lawsuit over labelling The maker of Tylenol defeated a lawsuit by U.S. consumers who said they were deceived into overpaying for 'Rapid Release' gelcaps that did not relieve pain faster than cheaper tablets, including those labelled Extra Strength and Regular Strength. What to know about the Oropouche virus, also known as sloth fever More than 20 people returning to the U.S. from Cuba have been infected with a virus transmitted by bugs in recent months. They all had Oropouche virus disease, also known as sloth fever. Sci-Tech 'Unprecedented' discovery: 17th-century mummy brains show evidence of cocaine use Preserved brain samples dating back to early 17th-century Milan have tested positive for cocaine, a team of Italian researchers has found, but it's not immediately clear how it got into their systems. TDSB says some student info may have been exposed in June cyberattack Canada's largest public school board says identifying information about some students may have been exposed in a recent cyberattack. Some trees' leaves are changing colour already. Here's why that may be happening, according to a botany expert If you’ve noticed trees in parts of Canada have been changing colours earlier than usual in recent years, you’re not alone, according to a botany expert who spoke with CTVNews.ca. Entertainment 2 men plead not guilty to killing former 'General Hospital' actor Johnny Wactor Two men charged with murder in the killing of former \"General Hospital\" actor Johnny Wactor pleaded not guilty Thursday in a Los Angeles court. Guy Maddin wades into more conventional fare with 'Rumours.' It's still weird. Guy Maddin has built a career helming bewildering, dreamlike, avant-garde films, but the Winnipeg auteur's new dark political comedy \"Rumours\" may be his most accessible work yet. Pop group ABBA ask Donald Trump to stop using their songs, but Trump team says they have the OK Swedish supergroup ABBA has asked Donald Trump to stop using their music at campaign rallies, but the Republican presidential nominee's campaign says it has permission. Business Lululemon cuts full-year outlook amid struggle with 'newness' in its womenswear Lululemon Athletic Inc. says its net income reached US$392.9 million in its second quarter as net revenue climbed. Nvidia's subdued forecast dampens enthusiasm in AI chip stocks after steady rally Nvidia shares pared some losses in premarket trading on Thursday, shaking off an earlier decline as investors stayed confident about the chip giant's growth prospects despite a forecast that fell short of lofty expectations. How one Brazilian judge could suspend Musk's X in the coming hours Brazilian Supreme Court justice Alexandre de Moraes has threatened to suspend social media giant X nationwide in the coming hours if its billionaire owner Elon Musk doesn't swiftly comply with one of his orders. Lifestyle This wilderness resort designed and built by the Timber Kings just hit the market in B.C. A family-owned B.C. wilderness resort designed and built by HCTV's Timber Kings – who said it was one of the \"coolest and most challenging\" projects they have undertaken – has hit the market for $21.5 million. Get ready foodies! Michelin guide coming to Quebec in 2025 Joining Vancouver and Toronto, the Belle Province will become the third locale in Canada for the iconic restaurant guide. Confused about all the deductions on your paycheque? Here's what they mean Financial planning experts say understanding how deductions are calculated on a paycheque is vital for employees budgeting their money, especially those just entering the workforce or new to Canada. Sports Stephen Curry agrees to US$63 million extension with Warriors for 2026-27 season Stephen Curry and the Golden State Warriors have agreed to extend his contract for the 2026-27 season, one in which the NBA's all-time three-point leader and Olympic gold medalist will earn nearly US$63 million. Oilers' Evander Kane says man spat on his vehicle, used racist remark Edmonton Oilers forward Evander Kane posted a video on social media Wednesday, saying that a man spat on his car and used racist language toward him. Nova Scotia Olympian Ellie Black wins Paris 2024 Fair Play Award Nova Scotia Olympian Ellie Black been recognized for her sportsmanship at the 2024 Olympics in Paris. Autos EV prices need to drop by one third if Canada wants to hit sales targets, says gov't report Unless policies or technologies change, the ownership cost of electric vehicles needs to decrease by 31 per cent if Canada wants to reach its sales target of 60 per cent EVs by 2030, according to a new report released Thursday by Parliamentary Budget Officer Yves Giroux. 70-year-old going 160 km/h on Hwy 417 in Ottawa to 'get away from a bad driver' facing charges A 70-year-old from Ottawa is facing charges after clocking 160 km/h on Highway 417 to \"get away from a bad driver\" Wednesday afternoon, according to the Ontario Provincial Police (OPP). Jaguar tells owners of older I-Pace electric SUVs in the U.S. to park them outdoors due to battery fire risk Jaguar is telling owners of about 3,000 electric SUVs to park them outdoors and away from structures due to the risk of battery fires. Local Spotlight 'I don't know what we're going to do': Historic Saskatchewan theatre floods, owners fear closure Alan Dougherty, co-owner of Estevan's Orpheum Theatre believes the historic theatre’s future is up in the air following recent flooding. 'Mini Thni': Alta. First Nations community reclaims traditional Stoney Nakoda name A First Nations community west of Calgary has officially reclaimed its traditional Stoney Nakoda name. The Stoney Nakoda Nations held an event on Thursday to officially rename Morley to Mînî Thnî. 'A home to be loved': Manitoba historical landmark up for sale A piece of Manitoba history is up for sale. Man says he's lucky to be alive after bear attack in Halifax area A man who says he was attacked by a bear on a popular Halifax-area trail says he’s lucky to be alive after the unusual and terrifying incident. Have you seen this statue's head? Manitoba business wants it back after being stolen for a third time The owner of Inspire Studio in Minnedosa is dealing with a bit of a head-scratcher, as the statue outside her business has been vandalized three times, the most recent incident happening this past weekend. 40 restaurants in 60 days: One man's epic quest to find the best lobster roll in N.B. Forty restaurants in 60 days seems like a tall task, but it was a challenge Moncton foodie Jason Gallant took head on to find the best lobster rolls and fried clams in southern New Brunswick. Indigenous talent from Manitoba set to strut the runway in Paris A double dose of Manitoba talent will storm the runways of Paris Fashion Week, wearing distinctly homegrown designs. 'Perfect is good enough': Husband and wife sculptors reflect on 54 years of work It's been a relationship forged in bronze. 'It's always a risk': Saskatoon RC planes take to the skies The Hub City Radio Control Club invited the general public out to watch their RC plane demonstrations, Dozens of pilots and onlookers gathered on the tarmac to watch the planes in action. Vancouver Serious crash closes Lougheed Highway in Mission. Lougheed Highway in Mission has been closed due to a serious crash Thursday afternoon, according to authorities, who say there is no enticipated time for its reopening. 'Full work stoppage': HandyDART drivers set to walk off the job amid labour dispute Hundreds HandyDART drivers in Metro Vancouver will walk off the job next week, according to the union. B.C. vehicle impound fees going up as province looks to curb surging road deaths A surge in traffic deaths on British Columbia's roadways has prompted the provincial government to impose stiffer penalties on dangerous drivers. Toronto TDSB says some student info may have been exposed in June cyberattack Canada's largest public school board says identifying information about some students may have been exposed in a recent cyberattack. Toronto convenience store found selling alcohol weeks before it is allowed: AGCO A convenience store in Toronto has been hit with a three-week liquor and lottery licence suspension after an Alcohol and Gaming Commision of Ontario (AGCO) inspection found it was selling alcoholic beverages well before corner stores can officially stock its shelves with beer, wine and ready-to-drink beverages. One person dead after motorcycle crashes into ditch on Highway 401 A motorcyclist has died in a crash on Highway 401 near Courtice, Ont., police say. Calgary Lawyer who represented 'Freedom Convoy' organizers appointed to Alberta police review board A lawyer who previously represented “Freedom Convoy” organizers has been appointed to an Alberta government police review board. Water use in Calgary slips again, but still far from target Residents reduced their water use again on Wednesday, the city's website shows, but it's still not at the target officials say will prevent critical issues with Calgary's water supply. Caregivers of boy located by police Calgary police have located the caregivers of a young boy. Ottawa Police seek suspect after 14-year-old girl grabbed from behind in Orleans Ottawa Police are asking for the public’s help identifying a male suspect wanted for the alleged assault of a 14-year-old girl who was grabbed from behind while walking in Orléans on Tuesday. No date for Trillium Line launch as OC Transpo address bugs in new system It will be at least October before passengers are riding the Trillium Line, as OC Transpo and its partner continue to identify \"some gaps and some issues\" during testing on Ottawa's new north-south light-rail transit line. Properties in Ottawa identified by federal government for affordable housing Earlier this week the federal government announced a plan to convert 22 federal properties in Ottawa into housing, now the government is giving a glimpse into what those redevelopments could look like. Montreal McGill University law professors picket for right to unionize, better pay A union representing McGill University law professors said its members walked off the job Monday, the first week of classes for the fall semester, over what it described as the school's anti-union tactics and refusal to negotiate in good faith Man, 60, stabbed near Lionel-Groulx metro station, Montreal police investigating Montreal police (SPVM) are investigating after a 60-year-old man was stabbed near Lionel-Groulx metro. With contractors swamped, Montreal area homeowners prepare for long construction delays Montreal homeowners devastated by floods over the summer are realizing that the wait for a contractor can be months long, and insurance companies are telling clients to find their own workers. Edmonton Victim, accused in corn maze killing previously deemed 'significant threat' to public: documents The accused and the victim in a fatal stabbing at the Edmonton Corn Maze earlier this week had both previously been found not criminally responsible for violent crimes and confined to a psychiatric hospital, court documents show. Firestorm caused winds up to 180 km/h at Wabasso Campground, leaving trail of destruction Hundreds of trees around Wabasso Campground have been plastered to the ground, downed not by fire, but by hurricane-force winds that tore up asphalt and left tangled metal wrapped around the trees left standing. Alberta cabinet minister says he 'did nothing wrong' accepting Oilers playoff tickets Alberta Finance Minister Nate Horner says he accepted free VIP tickets to Edmonton Oilers hockey games during the Stanley Cup Playoffs but didn’t break conflict-of-interest rules. Atlantic Two adults charged after providing false information in homicide case: Halifax police Two adults have been charged after allegedly providing false information to Halifax police about a homicide case. Here's how much Canadians made per week, on average: Statistics Canada Canadian weekly earnings remained consistent with months prior, but still four per cent higher than the same time last year, Statistics Canada reported Thursday. Some trees' leaves are changing colour already. Here's why that may be happening, according to a botany expert If you’ve noticed trees in parts of Canada have been changing colours earlier than usual in recent years, you’re not alone, according to a botany expert who spoke with CTVNews.ca. Winnipeg Manitoba premier says Jeremy Skibicki should stay behind bars for life Convicted serial killer Jeremy Skibicki should never again see the light of day as a free person, and any future parole hearings should take into account the impact his killings have had on family members, Manitoba Premier Wab Kinew said Thursday. 'Big uptick' in motorcycles being stolen in 2024 according to Winnipeg police Motorcycle theft is on the rise in 2024 according to the Winnipeg Police Service. Manitoba doctor convicted of sexually assaulting patients sentenced to 12 years behind bars A doctor who was found guilty of sexually assaulting some of his patients over several years was sentenced in a Manitoba court on Thursday. Regina Family of murdered Regina woman hold second annual vigil in hopes her remains will be found The family of Richele Bear continue to look for answers over 10 years after the young Regina woman was murdered. 'Bring it to light': Ex-priest from Regina in court following historic sexual assault charges Wednesday marked the first court appearance for an 81-year-old former priest from Regina who is facing several historic sexual assault charges stemming from alleged incidents in Manitoba. Sask. NDP voices its support for Evraz workers, attacks government's record on steel The leaders of Saskatchewan's two major political parties took shots at each other’s support for workers at Regina's Evraz steel plant. Kitchener Meet the man living in the middle of a Kitchener, Ont. roundabout Drivers going by a Kitchener roundabout may have noticed something unusual – a tent set up on the centre island. Company behind child care registration program apologizes for misleading emails Families were left scrambling after a software malfunction left them without child care for the upcoming school year. The company behind the registration system is now apologizing. Video shows Aug. 17 tornado pass through North Dumfries, Ont. Brand new video shows what happened when a tornado touched down in Ayr, Ont. on Aug. 17. Saskatoon Sask. alpaca farm faces violent dog attack, 3 animals dead A peaceful alpaca farm turned into a horrific scene after a violent dog attack left three animals dead and two injured on Monday evening. The Saskatchewan RCMP says a man died after being struck by a police vehicle The Saskatchewan RCMP says a 31-year-old man has died after being struck by a police vehicle on a grid road outside the northern community of Buffalo Narrows. Sask. school divisions ready to enforce pronoun law when classes start next week School divisions in Saskatchewan say they will be enforcing the province's pronoun law as children head back to class next week. Northern Ontario Trudeau returns to northern Ont. following Liberal cabinet retreat Following the Liberal’s cabinet retreat in Halifax, N.S., where Prime Minister Justin Trudeau reaffirmed his plan to stay on as leader of the party, the prime minister appeared in Sault Ste Marie, Ont., on Thursday. Rock-throwing teens cause motorcycle crash on Maley Drive One person is in hospital with serious injuries in Sudbury after rocks thrown onto Maley Drive on Wednesday caused a motorcycle to slide into a ditch. Confused about all the deductions on your paycheque? Here's what they mean Financial planning experts say understanding how deductions are calculated on a paycheque is vital for employees budgeting their money, especially those just entering the workforce or new to Canada. London Can the city do more to stop dangerous climbs atop the new Victoria Bridge? A brief video that has already been widely circulated on social media shows two people standing on top of the bridge’s west arch on Ridout Street - dangerously high above the river. 'They're going to push us to be on strike'; support workers preparing to walk-out at Western University More than 300 CUPE 2361 members could be on the picket lines at Western University on Friday morning. Want to work from home? Here's the Canadian cities where that's most likely - and London is on the list Recent data released by Statistics Canada indicates that London has the 11th highest proportion of people working from home. Barrie Possible human remains discovered in Tiny Township Provincial police are investigating the report of possible human remains in Tiny Township. Celebrities make Muskoka their summer destination getaway Cottage country, often referred to as the 'Hamptons of the North,' attracted a range of notable figures this summer, including former supermodel Cindy Crawford. Police warn shoppers of growing theft trend Provincial police want to make residents aware of a growing trend of thefts targeting shoppers. Windsor Increased police presence on Eugenie Avenue Increased police presence was reported in the 200 block of Eugenie Avenue on Thursday evening. Cyclist hit at Howard Avenue at Tecumseh Road East The Windsor Police Service is reporting a collision at the intersection of Howard Avenue at Tecumseh Road East. Province-wide cellphone ban hits Windsor classrooms next week As kids and teens across Windsor-Essex try to enjoy the last few days of summer break, a province-wide cellphone ban awaits them at school next week. Vancouver Island B.C. vehicle impound fees going up as province looks to curb surging road deaths A surge in traffic deaths on British Columbia's roadways has prompted the provincial government to impose stiffer penalties on dangerous drivers. Earthquake warning system providing seconds of notice activated in B.C. An earthquake early detection system has been activated in British Columbia to provide the public and infrastructure managers with up to 10 seconds of warning ahead of a potentially harmful tremor. Man sentenced for groping 2 women on Vancouver Island transit bus A 36-year-old man who groped two women on a Victoria-area transit bus has been sentenced to three years of probation. Kelowna Commercial truck plunges off bridge in B.C. Interior, driver unaccounted for, RCMP say The driver of a semi truck and trailer that plunged off of a bridge in the B.C. Interior Saturday morning has not been located, according to police. Merritt, B.C., emergency room closing for 25 hours this weekend The emergency department at Nicola Valley Hospital and Health Centre in Merritt is once again closed due to limited physician availability. Man charged with mischief for allegedly starting several fires Vernon, B.C. A 33-year-old man is facing multiple charges for allegedly setting several fires in Vernon on Monday. Lethbridge Crown recommends 9 years in prison for protesters at Coutts border blockade A Crown prosecutor says two men convicted of mischief and weapons offences at the 2022 border blockade at Coutts, Alta., should spend nine years in prison. Medicine Hat mayor's powers, salary restored following judicial review Medicine Hat's mayor is thankful that a judicial review has restored a number of her duties as well as her salary, but one of her councillors is seeking further investigation. First glasses raised at Cardston, Alta., restaurant after prohibition lifted After well over a century of prohibition, people can finally raise a glass of cheer in a Cardston, Alta., restaurant. Sault Ste. Marie Trudeau returns to northern Ont. following Liberal cabinet retreat Following the Liberal’s cabinet retreat in Halifax, N.S., where Prime Minister Justin Trudeau reaffirmed his plan to stay on as leader of the party, the prime minister appeared in Sault Ste Marie, Ont., on Thursday. Health unit reports increase in overdoses on Manitoulin Island The Community Drug Strategies of Manitoulin have received reports of an increase in overdoses in the region. Sault police seek public assistance in YMCA break-and-enter, theft investigation Sault police are investigating a break-and-enter incident at the city’s YMCA workshop last month. N.L. Dispute over unrecognized Inuit group halts major conference for Canadian North A 16-year-old biennial event aimed at fostering business in the country's eastern Arctic and northern regions has been cancelled indefinitely as a dispute unfolds between Inuit in Canada and a Labrador group claiming to share their heritage. Newly reinstated Newfoundland cod fishery temporarily paused as landings hit limit The federal government has temporarily paused parts of the newly reinstated commercial northern cod fishery off the east coast of Newfoundland as landings approach the seasonal limit. As Newfoundlanders say goodbye to a daily print paper, some worry culture will suffer The final edition of The Telegram newspaper’s daily print hit the stands in St. John's, N.L., on Saturday, marking the end of a 145-year run and a move to weekly print version with daily stories online. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks Our Guide To The Best Meal Prep Containers For Everything From Snacks to Lunches Here Are All The Back-To-School Supplies An Elementary School Student Needs 16 Boring (But Very Useful) Back-To-School Supplies That Cost Less Than $15 Home 17 Practical Products You'll Want In Your Bathroom Immediately If You Pack Your Lunches (Or Your Kids' Lunches), You Probably Need At Least A Few Of These Products 15 Inexpensive Kitchen Gadgets From Amazon Canada That Have Thousands Of 5-Star Reviews Gifts 20 Of The Best Gifts For People Who Travel A Lot 21 Brilliant Gifts For Those Impossible-To-Shop-For People On Your List 20 Birthday Gifts That Won't Disappoint Beauty If You Want Your Quick And Easy Hairstyles To Last, You Need These Products In Your Life I'm Fairly Certain You’ll Never Go A Day Without Using This K-Beauty Moisturizer (And It's On Sale For $10 Right Now) The Revlon One-Step Volumizer Has Been A Reviewer Favourite For Years — Here's Why Deals 22 Amazon Canada Deals And Discounts On Back-To-School Supplies The Best Amazon Canada Deals On Kitchen Products This Week From Lululemon to Amazon Canada: Here Are All The Best Sales, Deals, and Discounts You'll Find Online Right Now Stay Connected","summary":"Pertussis, commonly known as the whooping cough or the 100-day cough is spreading across Canada at a concerning rate, according to public health officials.","url":"https://www.ctvnews.ca/health/whooping-cough-cases-are-on-the-rise-doctors-explain-the-symptoms-1.7019610","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/29/whooping-cough-doctor-1-7019621-1724973980350.jpg","video":null,"publish_date":"2024-08-29 23:26:58","author":"Adrian Ghobrial","authors":["Adrian Ghobrial"],"language":"en","source_country":"CA","sentiment":-0.331},{"id":255231518,"title":"Internet Troll Elijah Daniel Enlists Grimes AI to Piss Elon Off and Push for Regulation","text":"Elijah Daniel wanted you to fall for his fake Grimes song. On Wednesday night, the content creator and internet troll posted a video of what appeared to be him and the singer Grimes flipping off a Tesla while singing diss lyrics about Elon Musk. “Fuck a Tesla I like a Honda/And fuck an X, double entendre,” sings Grimes’ voice in the clip. Many users (and even Newsweek) fell for the troll immediately. Daniel’s plan had worked. “Everything that I do is generally so outrageous and stupid that it would make sense for me to do it, but I wanted to see how many people would believe it off the bat,” he tells Rolling Stone. “People will just kind of automatically assume it’s real.” The new video marks a return to the internet for Daniel after two years. The troll/creator/rapper — also known under the moniker Lil Phag — made headlines in 2013 when he petitioned for a Miley Cyrus song to become the national anthem (guess which one), and in 2016, when he tried throwing a two-foot pink dildo at Trump at a rally. He blew up on Vine at the time for his internet pranks and silly takes, and has since built a following on TikTok and Twitter. (Erm, X.) Daniel wrote the song, titled “Nuisance,” as a Musk troll several months ago, enlisting Grammy-nominated duo SMLE to produce the track. He originally meant to find another artist to feature on the song, until he discovered Grimes’ AI generator, Elf Tech, and decided to have the track double as a Musk diss and indirect commentary on the necessity of artificial intelligence regulation after Grimes unveiled the technology last April, writing on X, “Feel free to use my voice without penalty.” Daniel says that the song takes aim at “two of the biggest advocates of AI” by using Grimes’ voice to diss the tech billionaire. “If they want to respond, then they’re going to have to say AI needs regulation,” he says of Grimes and Musk. (The Tesla founder and musician have been in a heated custody battle over their three children for over a year, and Grimes posted in support of Musk’s trans daughter, following his transphobic remarks, back in July.) “If they don’t respond then I don’t know, maybe it’s just a song with Grimes dissing Elon Musk.” Daniel wrote his verse and Grimes’ fake verse, and put it through Elf Tech to see if people online would believe it was real. Daniel then enlisted a “blonde friend” to put on glasses and wear a hoodie to impersonate Grimes in a clip he posted to TikTok and X. It was quickly picked up by PopCrave and even earned a like on TikTok from Julia Fox. “I would love to say the majority of people are smart enough to not fall for AI misinformation, but they’re falling for human misinformation so I’m not sure adding a supercomputer behind it is going to help,” he says. Daniel says he’s not personally “anti-AI,” but thinks that regulations need to be set in place on its usage, pointing to Trump posting a fake image of “Swifties for Trump” and deepfake pornography rampant on Musk’s internet. “AI has its place in the world, it just needs to be regulated,” he says. “I think it’s going to become a problem fairly soon until it’s regulated.” “Nuisance” marks Daniel’s return online after grappling with a health scare and the death of his mother due to Covid-19 in late 2021. “I didn’t want to grieve her on the internet,” he says. Around the time away, he says he developed adult-onset epilepsy, which led to a car accident in which he shattered his foot and broke three ribs. Several months later, in May 2023, he says his epilepsy “got so bad it triggered a heart attack.” He’s since turned to fitness and focused on his health, and has found the right medication for his condition. “I came back specifically for the election year. There’s no way that I am going to stay away from the internet during an election year,” he says. “I’m doing really good now.” Before his step away from social media, Daniel was even profiled in the New York Times in 2020 for being an “agent of chaos” and released music as Lil Phag alongside Tana Mongeau, Bella Thorne, and CupcakKe. He wrote a parodic, erotic, gay fan-fiction inspired by Donald Trump called Trump Temptations ahead of the 2016 election, and was also detained at a Trump rally for his dildo incident. Daniel says he doesn’t plan to attack the former president with plastic phalluses anytime soon, but he’s excited to see young voters “amped” about President Kamala Harris. “The trolling will always continue,” he says. “[But] I don’t want to get on another no-fly list.”","summary":"“If they want to respond, then they’re going to have to say AI needs regulation,” Daniel says of the musician and Musk","url":"https://www.rollingstone.com/culture/culture-news/elijah-daniel-grims-ai-elon-musk-1235091479/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/musk-Elijah-Daniel-grimes.jpg","video":null,"publish_date":"2024-08-29 23:25:56","author":"Tomás Mier","authors":["Tomás Mier"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.149},{"id":255232386,"title":"\"Fight Is For America's Future\": Kamala Harris At Georgia Rally","text":"Democratic presidential nominee and Vice President Kamala Harris on Thursday emphasised that the current presidential fight is for the future of the United States and asserted that the future is always worth fighting for. The remarks by Harris came while she addressed a rally in Georgia. Harris during the rally said that they are running as the underdog in the upcoming presidential elections in the country and expressed confidence that she will secure victory in the elections. \"68 days to go... We are here to speak the truth and one of the things that we know is that we are running as the underdog. And we have some hard work ahead of us. But we like hard work. Hard work is good work. And with your help, we are going to win this November,\" Harris said. She further said that during her entire career, she has always stood up for people. She said, \"I am no stranger to tough fights... I was a courtroom Prosecutor. So every day in the courtroom, I stood proudly before a judge and I spoke five words--Kamala Harris For The People. My entire career, I only had one client--the people. I stood for women and children against predators who used to abuse them... and for seniors facing abuse. I would tell you that those fights were not easy and neither were the elections that put me in those offices.\" She further said, \"But we never gave up because the future is always worth fighting for. And that is the fight we are in right now. A fight for America's future. We fight for the future with affordable childcare, paid leave and affordable healthcare.\" Earlier, Harris said that she intends to appoint a Republican to her cabinet if she wins the upcoming presidential elections, CNN reported. The remarks by the Vice President came in a joint interview with Walz on CNN. Harris pledged to serve as a president for all Americans. In the interview, she expressed her willingness to appoint a Republican to her Cabinet if elected. However, she didn't specify a particular individual. \"I've got 68 days to go with this election, so I'm not putting the cart before the horse,\" she said. \"But I would, I think. I think it's really important. I have spent my career inviting diversity of opinion. I think it's important to have people at the table when some of the most important decisions are being made that have different views, different experiences. And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican,\" according to CNN. Harris was nominated as the Democratic nominee after President Joe Biden quit the presidential race amid mounting concerns over his age, particularly after his poor show in the debate with Donald Trump in June. If elected president, the 59-year-old Harris would become the first woman in history to become the US president. The vice president is only the second woman ever nominated for the presidency by a major political party. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Democratic presidential nominee and Vice President Kamala Harris on Thursday emphasised that the current presidential fight is for the future of the United States and asserted that the future is...","url":"https://www.ndtv.com/world-news/fight-is-for-americas-future-kamala-harris-at-georgia-rally-6448997","image":"https://c.ndtvimg.com/2024-08/b9fgjh1o_kamala-harris_625x300_30_August_24.jpeg","video":null,"publish_date":"2024-08-29 23:21:12","author":null,"language":"en","catgory":"politics","source_country":"in","sentiment":0.262},{"id":255231062,"title":"Army currently alleges that a staff member of Trump was involved in an incident with a worker at Arlington Cemetery, fueling a dispute regarding honoring Gold Star families affected by the Afghanistan conflict.","text":"The Army on Thursday defended a staff member at Arlington National Cemetery who clashed with Donald Trump campaign officials when they took photos and video of the former president in a restricted area of the cemetery. In a long and unusual statement, the Army noted the Arlington National Cemetery (ANC) staffer acted with ‘professionalism’ and said she was ‘abruptly pushed aside’ by Trump officials when she tried to enforce a federal law that forbids campaign activity at the cemetery. However, since the staffer is not going to press charges, the Army said they considered the matter ‘closed.’ It was a rare rebuke from the military about a former commander in chief. And it comes amid a deepening row between Trump and Gold Star Families about the incident. The families that invited the former president to join them at the cemetery have defended him, but other families who lost loved ones in service to U.S. have criticized Trump for posting photos and video of the visit to his campaign accounts. Arlington National Cemetery is considered hallowed ground in the U.S. military and is managed by the Army. Trump, who is running for a second term in the White House, was invited to visit on Monday with family members of the some of the soldiers killed three years ago when U.S. troops exited Afghanistan. He was there to help them mark the annivesary of the suicide bombing at Abbey Gate and honor the soldiers who died. His campaign said they had permission ahead of time to bring a photographer. And officials told Axios they are ‘weighing options’ about releasing their internal footage backing up their version of the story. They claim a staffer with the cemetery tried to ‘physically block’ members of Trump’s team during the visit and claimed the staffer had a ‘mental health episode.’ ‘The fact is that a private photographer was permitted on the premises and for whatever reason an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump’s team during a very solemn ceremony,’ Steven Cheung, a Trump campaign spokesman, said in a statement. While at the cemetery on Monday, Trump laid three separate wreaths at the Tomb of the Unknown Soldier and then went with the families to Section 60. His campaign posted a video of both parts of the visit on its TikTok account. And several staffers posted photos to social media But the Army hit back, noting the campaign, ahead of the visit, was ‘made aware of federal laws, Army regulations and DoD policies, which clearly prohibit political activities on cemetery grounds.’ ‘An ANC employee who attempted to ensure adherence to these rules was abruptly pushed aside,’ an Army spokesperson said in the statement on Thursday. ‘Consistent with the decorum expected at ANC, this employee acted with professionalism and avoided further disruption. The incident was reported to the JBM-HH police department, but the employee subsequently decided not to press charges. Therefore the Army considers the matter closed,’ the spokesperson noted. ‘This incident was unfortunate, and it is also unfortunate that the ANC employee and her professionalism has been unfairly attacked. ANC is a national shrine to the honored dead of the Armed Forces, and its dedicated staff will continue to ensure public ceremonies are conducted with the dignity and respect the nation’s fallen deserve.’ Military officials told the New York Times that the cemetery staffer feared that pursuing the matter with the authorities at Joint Base Myer-Henderson Hall in Virginia, which has jurisdiction over the cemetery, could subject her to retaliation from Trump supporters. Pentagon officials were deeply concerned about Trump turning the visit into a campaign stop, but they also didn’t want to block him from coming, reported The Washington Post. The officials gave the campaign ‘ground rules’ in an attempt to keep politics out of visit. Ahead of the former president’s visit, Army officials told Trump’s team that he could come in his personal capacity and bring personal aides, but not campaign staff. Campaign staff went anyway. ‘If the campaign feels the need to defend their team’s actions — which include bullying and physically pushing out of the way a longtime public servant and member of the team at Arlington working to protect the sanctity of the sacred spaces — then that’s on them,’ a defense official told The Post. ‘The rules were made clear to participants, and these two chose to disregard those rules. End of story.’ Trump has been heavily critical of President Joe Biden and Vice President Kamala Harris about the withdrawal of U.S. troops from Afghanistan, calling it ‘gross incompetence.’ The visit also allowed Trump to counter reports he doesn’t respect veterans and has previously referred to slain World War II soldiers as suckers and losers, reports Trump has denied. While at Arlington cemetery, the former president laid three wreaths at the tomb, two honoring Staff Sgt. Taylor Hoover and Sgt. Nicole Gee – two Marines killed in the bombing – and another wreath dedicated to all 13 service members who were killed in the attack. He was joined by Marine Cpl. Kelsee Lainhart (Ret.) and Marine Sergeant Tyler Vargas-Andrews, both of whom were injured at the Abbey Gate Bombing. Monday marked three years since the Aug. 26, 2021, suicide bombing at Hamid Karzai International Airport, which killed 13 American service members and more than 100 Afghans. The Islamic State group claimed responsibility for the attack. After the wreath laying, Trump and the families went to Section 60, the final resting place for those who died fighting in Iraq and Afghanistan – a place regularly visited by spouses and family members of the fallen. Media were not allowed to accompany the former president to that section of the cemetery. Trump posed for photos with the family and laid flowers at the tombs of some soldiers who died, according to images posted on social media by his team. While families often take photos at gravesites of loved ones, federal law prohibits any political activity in the cemetery. Sitting presidents have visited Section 60 but never as part of a political campaign. The families of the fallen said they had invited Trump and gave ‘our approval for President Trump’s official videographer and photographer to attend the event, ensuring these sacred moments of remembrance were respectfully captured and so we can cherish these memories forever.’ But the family of a Green Beret who served eight combat tours and is buried in Section 60 expressed concern about Trump’s campaign filming his gravesite without permission. Relatives of Master Sgt. Andrew Marckesano told the New York Times that Trump’s campaign had not followed the rules when it came to visits. Marckesano’s gravesite is adjacent to that of Staff Sergeant Darin Taylor Hoover, a Marine who was killed in Abbey Gate bombing. The Hoover family granted Trump’s team permission to film and take photographs at the gravesite but the Marckesano family did not. Marckesano’s grave was shown in photos from the visit that were published online. Marckesano’s sister Michele told the Times: ‘We fully support Staff Sergeant Darin Hoover’s family and the other families in their quest for answers and accountability regarding the Afghanistan withdrawal and the tragedy at Abbey Gate.’ ‘However,’ she added, ‘according to our conversation with Arlington National Cemetery, the Trump campaign staffers did not adhere to the rules that were set in place for this visit to Staff Sergeant Hoover’s gravesite in Section 60, which lays directly next to my brother’s grave.’ She continued, ‘We hope that those visiting this sacred site understand that these were real people who sacrificed for our freedom and that they are honored and respected accordingly.’ Arlington National Cemetery is the resting place for more than 400,000 service members, veterans and their families.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe Army on Thursday defended a staff member at Arlington National Cemetery&#8230;\n\n\nThis Post: Army currently alleges that a staff member of Trump was involved in an incident with a worker at Arlington Cemetery, fueling a dispute regarding honoring Gold Star families affected by the Afghanistan conflict. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/army-currently-alleges-that-a-staff-member-of-trump-was-involved-in-an-incident-with-a-worker-at-arlington-cemetery-fueling-a-dispute-regarding-honoring-gold-star-families-affected-by-the-afghanistan/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Army-now-claims-Trump-aide-pushed-Arlington.jpg","video":null,"publish_date":"2024-08-29 23:18:53","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.324},{"id":255231018,"title":"Inside the tense Democratic meeting where Biden was given an ultimatum to remain at the top of the ticket","text":"When a flagging Joe Biden turned in a dismal presidential debate performance earlier this summer against Donald Trump, everyone from George Clooney to Jon Stewart called on the 81-year-old to quit the race. But when Biden dug in and vowed to stay in it amid sagging poll numbers, one of his closest allies told the president’s advisers he would support the reelection bid on one condition: that his brain function be assessed by a pair of independent neurologists who would then present their findings to the public at a news conference. According to an eye-popping report published Thursday by The New York Times, the information came from multiple people with firsthand knowledge of the situation. The ultimatum came from US Senator Jack Reed, Democrat of Rhode Island and West Point graduate who heads up the Armed Services Committee, according to the newspaper. A spokesman told the outlet that Reed’s proposal was not meant as an “ultimatum,” per se, but “to impress upon Mr. Biden’s aides the need to be proactive and transparent in the best interest of the president. Rumblings about Biden’s age and ability to retain the Oval Office had been increasing in frequency and pitch since June’s disastrous debate against Trump. However, Biden held firm about his unwillingness to drop out. In early July, Senate Democrats convened at their weekly luncheon, where nine out of 12 spoke forcefully against Biden’s stubbornness about his candidacy, the Times reported. “It knocked my socks off how upset and angry people were, how the overwhelming majority got up and spoke really strongly,” Democratic Majority Leader Sen. Chuck Schumer of New York said. A day earlier, an obstinate Biden had sent an open letter to Congress insisting that he was going to continue running for a second term as US president and angrily lashed out at the “elites” pushing for him to bow out of the race. This “fueled a sense of panic” among Democratic leaders, according to the Times, which said Sens. Sherrod Brown and Jon Tester, Democrats of Ohio and Montana, respectively, were particularly concerned about losing their seats if Biden continued apace. To try and force the issue, Schumer reportedly then arranged an emergency meeting with Biden’s top aides, arriving with a coterie of high-level Democratic legislators who insisted the president end his reelection campaign. To do otherwise could not only taint Biden’s legacy but would expose Americans to the possibility of a second Trump term, a wholly unacceptable outcome, according to the Times. Those who were there said the atmosphere was one of “affection and appreciation,” rather than one of anger or bitterness, the Times reported. Sen. Joe Manchin of West Virginia, who recently left the Democratic Party to become an independent, “made the case that Democrats were acting out of affection for Mr. Biden, much as a family persuading an aging grandparent to surrender the car keys,” according to the Times. Sen. Sheldon Whitehouse, Democrat of Rhode Island, reportedly said he’d continue to support Biden and say publicly that the president was in fine shape. But if Biden’s mental acuity were to decline to a point at which his shortcomings were too obvious to ignore, it “would make a liar of him,” the Times report said. Biden’s advisers pooh-poohed concerns about the debate, but those gathered in the room said they “could not unsee what they had seen,” one attendee told the Times. When it emerged that Biden’s advisers hadn’t shared any details of the meeting with the president, Schumer called White House Chief of Staff Jeffrey Zients and “demanded” a face-to-face meeting with Biden. On July 13, Schumer met with Biden at the president’s beach house in Rehoboth, Delaware. A week later, Biden suspended his race for reelection. As of Thursday afternoon, according to nationwide polls, vice- president Kamala Harris was leading Trump by 3.5 percentage points.","summary":"Sen. Jack Reed reportedly floated a demand that would have painted the president into a corner regarding his neurological state, according to a report.","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-harris-democrats-presidential-election-neurologist-b2604182.html","image":"https://static.independent.co.uk/2024/08/27/19/EEUU-INMIGRACI%C3%93N-C%C3%93NYUGES_87942.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/wshW47C5-4VHSaSK0.mp4","publish_date":"2024-08-29 23:14:42","author":"Justin Rohrlich","authors":["Justin Rohrlich"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.025},{"id":255231024,"title":"Harris Defends Changes in Policy Stances on Border, Fracking","text":"Vice President Kamala Harris is defending her shifts in policy by saying her values remain the same. Harris was responding after being asked about changes she’s made on major policies. Harris also said in the past that she would block funding for a barrier at the U.S.–Mexico border. She said in 2020 that former President Donald Trump’s border wall “is a complete waste of taxpayer money and won’t make us any safer.” While giving a speech to the Democratic National Convention this month, Harris said she would sign a border bill crafted by senators that includes spending hundreds of millions of dollars on the barrier. Harris told CNN in the new interview that she still believes “the climate crisis is real” and that “it is an urgent matter to which we should apply metrics that include holding to deadlines around time.” She pointed out to the Inflation Reduction Act, which she and President Joe Biden supported. The act included money for companies to measure and lower greenhouse gas emissions, among other climate-related work. “We have set goals for the United States of America, and by extension the globe, around when we should meet certain standards in reductions in greenhouse gas emissions, as an example,” Harris said. “That value has not changed. My value around what we need to do to secure our border, that value has not changed.” Harris later discussed reaching a consensus on issues. “I believe it is important to build consensus, and it is important to find a common place of understanding of where we can actually solve problems,” Harris added later, according to CNN. Harris also said she would appoint a Republican to her Cabinet if she wins the presidency, although she did not identify a specific individual. “I think it’s important to have people at the table when some of the most important decisions are being made that have different views, different experiences,” she said, CNN reported. “And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican.” CNN said it will air the full interview at 9 p.m. Eastern. The interview, which also included Minnesota Gov. Tim Walz, Harris’s running mate, was pre-recorded.","summary":"Harris was speaking in her first interview since becoming the Democratic Party's presidential nominee.","url":"https://www.theepochtimes.com/us/harris-defends-changes-in-policy-stances-on-border-fracking-5715261","image":"https://img.theepochtimes.com/assets/uploads/2024/08/29/id5715263-GettyImages-2167257018-300x180.jpg","video":null,"publish_date":"2024-08-29 23:07:06","author":"Zachary Stieber","authors":["Zachary Stieber"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.149},{"id":255230664,"title":"South Carolina Dental Board Cancels Dentist’s License for Removing Dangerous Mercury Fillings, Referring to Pennsylvania Regulations","text":"Last Updated on August 29, 2024 The South Carolina Board of Dentistry has moved to temporarily rescind the dental license of a dentist widely renowned for caring for patients who have been harmed by dentists who expose patients to toxic heavy metals such as mercury. The South Carolina Board of Dentistry, which is chaired by Spartanburg dentist William David Stewart, who runs “Stewart Family Dentistry,” sent a notice to “halt the practice of dentistry” to Dr. Blanche Grube by sending her a letter to her address in Pennsylvania. Chairman Stewart and the South Carolina Board of Dentistry, which operates under the aegis of the South Carolina Department of Labor, Licensing, and Regulation, points to the fact that Pennsylvania’s Bureau of Occupational Affairs has initiated proceedings against Dr. Grube for the so-called infraction of removing toxic mercury amalgams from the mouths of patients who request those fillings to be removed. National File has reached out to Dr. Stewart to determine whether he is paid in his role as Chairman of the South Carolina Board of Dentistry, and whether and how much he is paid to fill his clients mouths with toxic mercury. Pennsylvania’s licensure board is waging economic warfare against Dr. Grube. The state that has the trans health department chair wants her to pay upwards of $55,000 and perform four hours of re-training in four areas in order to regain her license. Pennsylvania State Code, which went into effect on June 24, 1995, makes clear the fact that patients are allowed to request the replacement of their dental amalgams. The code reads: § 33.213. Use and replacement of dental amalgams—statement of policy. “The safety of dental amalgams, specifically, whether the mercury in amalgams causes or contributes to a variety of health problems, has become a recurring issue in dentistry.” The code even admits that “elemental mercury has been associated with adverse health effects.” The code continues: “… nonallergic patients may request the use of alternative restorative materials or replacement of amalgam restorations in the belief, or merely the hope, that a medical condition will thereby disappear or improve. Dentists receiving these requests must make ethical and professional decisions compatible with the best interests of their patients.” In summary, Pennsylvania statute: Among other non-serious claims, Pennsylvania’s State Board of Dentistry suspended Dr. Grube’s license, holding that Grube “removed a dental amalgam,” and that the “removal of that amalgam was unnecessary.” Pennsylvania’s State Board of Dentistry also held that Grube performed a cavitation surgery on several of one of her patient’s teeth. In citing the cavitation as a problem, the PA Board of Dentistry stated that “Cavitation Surgery is not … A procedure recognized or identified in the professions of dentistry or medicine by this specific terminology or by any other synonymous terms.” This is quickly proven to be a false claim with a simple search for the term “cavitation surgery” on any number of search engines, including Google, turning up many different results proving that “cavitation surgery” is, in fact, a thing. It’s little surprise that Pennsylvania, a state that appointed a man who presents as a woman, could get basic medical facts so unbelievably wrong. Here is the letter from the Pennsylvania State Board of Dentistry claiming there is no such thing as a “Cavitation Surgery”: The State of South Carolina’s hinged its entire suspension of Dr. Grube’s license on the Here is a photo of Pennsylvania’s “Physician General,” a man formerly known as Dick who transitioned to a woman, who now calls itself Rachel, who was nominated to that post by former Governor Tom Wolf, and later named to a leadership role in Joe Biden’s Department of Health and Human Services as Assistant Secretary of Health. FAUCI-STYLE HEALTH CZAR IN SOUTH CAROLINA? South Carolina recently tried to install a Health Czar, but that effort was blocked by the South Carolina House Freedom Caucus and Josiah Magnuson. The bill to install a Biden-style healthcare dictator would have set up an “Anthony Fauci” type of health Czar scenario in South Carolina, according to many in the Palmetto State. Despicably, Fox News ran to RINO leadership in the South Carolina State Senate in an attempt to “fact check” the Health Czar bill, claiming it did not install a czar. Sen. Josh Kimbrell is funded in part by the Medical Association of South Carolina, which is still pushing the Covid bio-weapons on the citizenry of South Carolina. The state’s ‘paper of record’, the Post and Courier, even encouraged the state government to crack down on the licenses of doctors who refused to fall in with the Fauci regime’s flimsy mandates to prescribe Remdesevir and Vaccines rather than hydroxychloroquine and ivermectin. Gov. McMaster’s choice to lead South Carolina’s Department of Health and Environmental Control, also called DHEC, is a dysgenic looking bureaucrat named Dr. Simmer (who thankfully decided to wear a mask during much of covid) but whose mask wearing was far out of touch with the average South Carolinian. Despite the relative freedom enjoyed in South Carolina during Covid, Dr. Simmer openly pushed vaccines late into 2021, and reliably masked up. It is unclear why Gov. Henry McMaster and the South Carolina legislature have pursued such liberal health care policies in the wake of the Covid ‘Pandemic,’ but it does not appear that the forces driving medical tyranny have decided to give up, even as 2024 comes to a close and America stares down the barrel of a potential Kamala Harris presidency and what appears to be an entirely bogus monkeypox “pandemic”. Rather, their effort continues via licensing boards that seek to end the medical careers of doctors who advocate for patients who seek to exercise options outside of those prescribed by the medical establishment. It has been widely known within the dental community for decades that mercury fillings are toxic. In 1985, author Sam Ziff wrote a book entitled THE TOXIC TIME BOMB: IS THE MERCURY IN YOUR DENTAL FILLINGS AFFECTING YOUR HEALTH. The President of the British Dental Society for Clinical Nutrition, J.G. Levenson, penned the book’s foreword. Mercury’s toxicity has been widely known about for decades. Dartmouth chemist Karen Wetterhahn famously died in 1997 from mercury toxicity. The use of mercury in dental amalgams, or fillings, is widely recognized to be toxic and dangerous around the planet. EUROPEAN UNION SET TO BAN MERCURY DENTAL AMALGAMS IN 2025 In February, the European Union, which regularly leads the United States in the arena of ensuring safe food sourcing, pharmaceutical therapies, and health care practices, has issued an all-out ban on toxic mercury fillings which begins in four months, on January 1st of 2025. The Minimata Convention is a global effort named after mercury poisoning in Japan that has endeavored for nearly twenty years to eliminate mercury toxicity. Groups like the American Dental Association (ADA), which until the Covid outbreak still enjoyed a high level of respect, continue to publicly advocate for the use of toxic mercury fillings. The U.S. Food and Drug Administration (FDA) admits that toxic mercury fillings can harm dental patients, but still claims that “there are no known health risks associated with ingestion (swallowing) of small particles of dental amalgam,” but cautions against “inhaling (breathing in) mercury vapors” which “may be harmful in certain patients.” The International Association of Dental Research “Affirms the safety of dental amalgam for the general population.” PRISON-LIKE DENTAL CARE FOR THE “GENERAL POPULATION” The fact that the phrase “general population” conjures up images of prisoners rotting away in a jail cell somewhere is no coincidence. Dental care for prisoners has long been recognized to be lacking. That poor care has spawned lawsuits against the privatized systems which administer the lackluster dental healthcare for prisoners. Unsurprisingly, dental insurance providers use an economically coercive approach to pad their bottom line. That economic coercion affects individuals sitting in dental chairs making the choice between types of dental fillings — toxic mercury fillings are often covered, while non-toxic, non-mercury fillings are usually prohibitively costly. The documentary “Evidence of Harm” covers this phenomenon at length. (You can watch it here for free on YouTube.) But the economic terrorism even manifests at the macro level. Ahead of the European Union vote to ban toxic Mercury amalgam fillings in early 2024, dentists with the Irish dental association applied economic terrorism and fear mongering in an attempt to continue the sale of cheaper, toxic mercury fillings, even going so far as to claim that a “combination of factors could make the [national dental health] service unsustainable.” PERSECUTION OF DENTISTS AND DOCTORS IS NOT NEW Dentists nationwide have been disciplined by state dental boards or regulatory agencies for warning patients or the public about mercury dental fillings or other harmful procedures such as root canals, going as far back as 2001. Dr. Hal Huggins lost his dental license in Colorado for speaking out against mercury fillings and root canals. In 2001, Connecticut dentist Dr. Mark Breiner was disciplined and fined $5,000 in December 2001 for advising patients that their mercury fillings and root canals could be contributing to their health problems. Breiner is also the author of Whole Body Dentistry:Discover the Missing Piece to Better Health.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLast Updated on August 29, 2024 The South Carolina Board of Dentistry&#8230;\n\n\nThis Post: South Carolina Dental Board Cancels Dentist&#8217;s License for Removing Dangerous Mercury Fillings, Referring to Pennsylvania Regulations first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/south-carolina-dental-board-cancels-dentists-license-for-removing-dangerous-mercury-fillings-referring-to-pennsylvania-regulations/","image":"https://nationalfile.com/wp-content/uploads/2024/08/PA_Order_1.png","video":null,"publish_date":"2024-08-29 23:03:21","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.207},{"id":255230818,"title":"Kamala Harris defends immigration shift, says she could name Republican to cabinet","text":"US Vice-President Kamala Harris defended some personal shifts in policy toward the centre on Thursday and said she might name a Republican to her cabinet if elected, in her first interview with a mainstream news organisation since Democrats nominated her for president. “I think the most important and most significant aspect of my policy perspective and decisions is, my values have not changed,” she told CNN anchor Dana Bash in an early excerpt from the interview to be broadcast on Friday. Harris has moved more towards the centre on some issues from the time she ran for president in 2020 until she took over from US President Joe Biden as the Democrats’ choice to face Republican former president Donald Trump in the November 5 election. She has toughened her position on migration along the southern US border with Mexico. She also no longer wants a ban on fracking, an energy production method that employs many people in Pennsylvania, one of a handful of swing states that could decide the election. “My value around what we need to do to secure our border – that value has not changed. I spent two terms as the attorney general of California prosecuting transnational criminal organisations, violations of American laws, regarding the illegal passage of guns, drugs and human beings across our border. My values have not changed,” she said. Harris’ conversation was aimed at showing her in command of the issues. Some critics suggested she may be less polished in unscripted settings after she led Democrats’ turnaround with a series of forceful campaign speeches. Harris, joined by her vice presidential running mate, Minnesota Governor Tim Walz, also discussed the possibility of adding a Republican to her potential cabinet, saying she wanted a diversity of opinion. “I think it’s important to have people at the table when some of the most important decisions are being made that have different views, different experiences. And I think it would be to the benefit of the American public to have a member of my cabinet who was a Republican,” she said. The US vice-president has eschewed formal interviews and press conferences during her rapid rise to the top of the Democratic ticket. Though she has taken questions from journalists on the campaign trail and been interviewed on TikTok in recent days, she had, until Thursday, not done a one-on-one interview with a major network or print journalist since Biden ended his re-election campaign on July 21 and endorsed her. Bash, who co-moderated the June 27 debate between Donald Trump and Biden that hastened the president’s departure from the race, conducted the interview in Savannah, Georgia, as Harris and Walz continued their bus tour of the battleground state. Harris’ lack of interviews has sparked criticism from opponents, and some concern among supporters, that she is less sharp in spontaneous settings than at rallies or speeches where she can use prepared remarks and a Teleprompter. Harris and Walz arrived at Kim’s Cafe, a Black-owned restaurant, in the early afternoon to tape the CNN interview. Before Harris picked him as her running mate, Walz did a string of interviews with major television networks. Trump frequently holds press conferences and offers interviews to conservative news outlets. He often uses them to criticise Harris and Biden rather than discuss his own policy aims in detail. On Thursday, Harris campaigned in Savannah, Georgia and told a crowd of 7,500 that “we have some hard work ahead of us”, to defeat her Republican rival Trump, but she was confident Georgia would vote Democratic again after a narrow win for Biden-Harris there in 2020. During the speech, Harris reiterated support for a deal to get a ceasefire and the release of hostages in Gaza when her remarks were interrupted by pro-Palestinian demonstrators. Harris said she and Biden were working “around the clock” to get that deal. “Everyone has a right and should have their voices heard,” Harris said. “I am speaking now, but on the subject I will say this – the president and I are working around the clock.” As Harris’ bus caravan left her Savannah hotel on Thursday, several dozen Trump supporters with signs and banners braved torrential rain to line the streets. Harris and Walz kicked off their bus tour of Georgia on Tuesday.","summary":"In first formal interview since presidential nomination, Harris told CNN she had toughened her position on migration along US-Mexico border.","url":"https://www.scmp.com/news/world/united-states-canada/article/3276481/kamala-harris-defends-immigration-shift-says-she-could-name-republican-cabinet","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/30/183f47de-2fd6-4220-93ee-119f08221852_43948a74.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/08/07/web%20version%20walz%20china.mp4","publish_date":"2024-08-29 23:01:52","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"cn","sentiment":0.154},{"id":255230408,"title":"Letters: Skewed salaries | Eurocentric views | Best measure | Clear-cut choice","text":"Carbon removal needs residents’ PR Startups around Silicon Valley know being a “trailblazer” isn’t easy. I was in Sacramento recently volunteer-lobbying for support of SB 308, introduced by Sen. Josh Becker, to strengthen carbon dioxide removal (CDR). Unfortunately, it didn’t make it through the Assembly Appropriation Committee. New ideas need tons of PR to get voters comfortable before they vote. This is especially true in times of budget cuts and greater needs as California grapples with climate disasters and homeless needs. As a grandmother-to-be, I’m all for CDR to safely take carbon out of the air and reach net-zero faster because environmental-related respiratory issues are on the rise in our family. Learn about CDR and help make it a household name. Have as many conversations as you can to demystify it and get folks comfortable with it, then write your representatives. Jenn Bulka Redwood City Public safety salaries skew city numbers Re: “City-worker costs have skyrocketed” (Page A1, Aug 23) Let’s put the data in perspective. Most of the highest-paid city workers are safety (police and firefighters). The article failed to break down salaries, overtime, benefits and pensions in reporting the “hard data.” Cops are paid a lot of overtime, their pensions are generous compared to other workers and they receive full salary up to one year if injured on duty. Most city workers do not come close to these levels and to attack all “government unions,” as some readers have, does a disservice to the bulk of our hardworking employees. The stark difference in pay is not new, if one looks back in time. City management shares some of the blame as do the rest of us when we value a safety worker more than other workers. Harry Oberhelman San Jose Lofgren, Eshoo must alter Eurocentric views Re: “Lofgren warns Council against supporting tribe” (Page A1, Aug. 9). Reps. Lofgren and Eshoo are out of step and stuck in a policy that must end: Eurocentric control of native peoples and their land use. The entire system created by the Bureau of Indian Affairs is awash with a history of oppression that even involves the justification of genocide, relocation to reservations, theft and cultural abuse of children, and now land use. There is no reason for Eshoo and Lofgren to believe that the old ways should continue without further harm to native tribes. Stop this role of master/subservience now. It’s ugly and no longer serves a useful moral purpose. Delorme Mckee-Stovall San Jose Debt is best measure of economic performance Re: “U.S. economy better off in Democrats’ hands” (Page A6, Aug. 27). Every president since 1929 has increased the U.S. debt. Comparing deficit reduction to debt reduction is just wrong. The accepted way of measuring debt accumulation is beginning Oct. 1 of a new president’s first year, the start of the U.S. fiscal year. There are always financial influences passed on to new administrations from previous laws enacted. Even Bill Maher, hardly a conservative, acknowledged this in his most recent show. Black Swan events also contribute to new debt. Wars, terrorist attacks, pandemics and financial crises all cause massive spending. Yes, the numbers say Democrats have better results, but it’s not that simple. Fun fact: The Biden administration is on track to exceed even Donald Trump’s debt increase (which includes $4.25 trillion in COVID spending), currently at $6.7 trillion with 13 months to go. Brian Dunlap San Jose Harris-Walz are our clear-cut choice Kamala Harris is young and ready to take the reins of a country teeming with young people who know the technology and norms of a new society. Besides that, I firmly believe that a woman has the better temperament to run our country. Men have had the sway, and a few have done well. The rest floundered. It is a shame that we have never had a woman president. Kamala Harris has a winner in Tim Walz. They deserve to be elected. Kohli Singh San Jose","summary":"Mercury News Letters to the Editor for Aug. 30, 2024","url":"https://www.mercurynews.com/2024/08/29/letters-1849/","image":"https://www.mercurynews.com/wp-content/uploads/2017/04/sjm-sjpdgrad-0429-08.jpg?w=1024","video":null,"publish_date":"2024-08-29 23:00:59","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.259},{"id":255231300,"title":"Kamala Harris: I Will Appoint a Republican to My Cabinet","text":"Kamala Harris promised Thursday to appoint a Republican to her Cabinet if she’s elected president. “I think it’s important to have people at the table when some of the most important decisions are being made that have different views, different experiences,” Harris told CNN’s Dana Bash in a pre-released clip of the Democratic presidential nominee’s first extensive interview. “And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican.” Harris floated no names of potential candidates to serve as her token Republican. But her comment represents an olive branch to “Never Trumper” Republicans and independents at a time when the country is bitterly divided and the race between Harris and Donald Trump is a statistical dead heat. A number of Republicans have endorsed the Democratic candidate for president, including well over 200 former aides and officials who served former President George W. Bush, the late Sen. John McCain of Arizona and Sen. Mitt Romney of Utah. Among them is Larry Ellis, a retired four-star general. Several Republicans were hailed prominently at the Democratic National Convention in Chicago last week, including former Rep. Adam Kinzinger of Illinois. “I’ve got 68 days to go with this election, so I’m not putting the cart before the horse,” Harris told CNN in a snippet of the interview released Thursday afternoon, choosing not to speculate on names. “But I would. I think it’s really important. I have spent my career inviting diversity of opinion.” There is precedent for a Democrat naming a Republican to a presidential Cabinet. Barack Obama chose three Republicans to serve in his Cabinet: former Sen. Judd Gregg (R-NH) as Commerce secretary; former Rep. Ray LaHood (R-IL) as secretary of Transportation and Robert Gates, who Obama kept on as Defense secretary. (Gates later harshly criticized Obama’s foreign policy handling.) The CNN interview with Harris and her vice presidential running mate, Minnesota Gov. Tim Walz, was taped Thursday afternoon at a cafe in Savannah, Georgia, and will air in its entirety Thursday at 9 p.m. ET. The long-anticipated media availability is being closely scrutinized by the media and the political world. Harris has come under fire for avoiding traditional media outlets, choosing instead to court social media influencers. The Harris campaign late Wednesday defended the presidential nominee’s decision to bring Walz to the interview, insisting, “For at least 20 years, every ticket, Republican and Democrat, sat for a joint interview.”","summary":"CNNKamala Harris promised Thursday to appoint a Republican to her Cabinet if she’s elected president.\n\n“I think it’s important to have people at the table when some of the most important decisions are being made that have different views, different experiences,” Harris told CNN’s Dana Bash in a pre-released clip of the Democratic presidential nominee’s first extensive interview. “And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican.”\n\nHarris floated no names of potential candidates to serve as her token Republican. But her comment represents an olive branch to “Never Trumper” Republicans and independents at a time when the country is bitterly divided and the race between Harris and Donald Trump is a statistical dead heat.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/kamala-harris-tells-cnn-i-will-appoint-a-republican-to-my-cabinet","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1571,w_2794,x_28,y_16/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1724972602/Screenshot_2024-08-30_at_8.58.00_AM_xner7q","video":null,"publish_date":"2024-08-29 23:00:49","author":"Mary Ann Akers","authors":["Mary Ann Akers"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.257},{"id":255232684,"title":"Here's what to watch for during Harris and Walz's first TV interview","text":"Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, are sitting for their first formal interview since she became the Democratic nominee during a CNN prime-time special airing Thursday at 9 PM ET. Dana Bash will conduct the sit-down, which the network is billing as “the next test in her presidential bid.” CNN says the interview “has taken on elevated significance because of the compressed race Harris is running after she became her party’s candidate and because of the way it mushroomed into an issue between the feuding campaigns.” That might give you some sense of the attitude Bash and the network are bringing to the interview: Harris has something to prove to them and has to answer to GOP nominee Donald Trump’s criticism of her nascent campaign’s chosen media strategy. Bash could take a more balanced approach, of course. But the media hasn’t acquitted itself too well when it comes to Harris’ candidacy. Look at how reporters were reacting when her campaign was a mere three weeks old and she had just picked Walz as her running mate. “The Beltway press is angry that Vice President Kamala Harris hasn’t sat down with them to talk about things like policy,” wrote Daily Kos founder Markos Moulitsas. “In their warped, archaic minds, they are important to the political process as a way to inform readers about the candidates.” Harris already had a strong social media and internet presence and was communicating to the American people just fine, without the press serving as gatekeepers—and that’s probably what had the media’s knickers in a twist in the first place. Harris doesn’t need reporters in order to reach voters, and voters don’t need reporters to find out about her and her policies. Now that Harris has agreed to an interview, there’s grumbling about how she’s not doing it on her own, because running mate Walz will be by her side. USA Today wrote a whole pearl-clutching story about it. “Vice President Kamala Harris received criticism for not formally sitting down with the press since launching her presidential campaign,” wrote USA Today’s Savannah Kuchar. “Now, with her first interview lined up, she is facing new backlash for not doing the event alone.” There is a long tradition of team interviews, of course. Yes, they’re rarely conducted this late in the race, but given what the Harris campaign has had to accomplish in about 40 days, it’s not at all unreasonable. Meanwhile, Trump—or some ghostwriter on his campaign staff—has weighed in to try and work the refs. “Dana Bash of CNN has a chance at greatness today,” Trump (or an aide who knows how to use punctuation) posted on Truth Social. “If she gave a fair but tough interview of Comrade Kamala Harris, she will expose her as being totally inept and ill suited for the job of President, much as I exposed Crooked Joe Biden during our now famous Debate. How cool would that be for Dana and CNN???” All of this scrutiny makes Thursday’s interview as much a test for Bash and CNN as it is for Harris and Walz. RELATED STORIES","summary":"Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, are sitting for their first formal interview since she became the Democratic nominee during a CNN prime-time special airing Thursday at 9 PM ET. Dana Bash will conduct the sit-down, which the network is billing as “the next test in her presidential bid.”&nbsp;\n\n\n\nCNN says the interview “has taken on elevated significance because of the compressed race Harris is running after she became her party’s candidate and because of the way it mushroomed into an issue between the feuding campaigns.”\n\n\n\nThat might give you some sense of the attitude Bash and the network are bringing to the interview: Harris has something to prove to them and has to answer to GOP nominee Donald Trump’s criticism of her nascent campaign’s chosen media strategy. Bash could take a more balanced&nbsp;approach, of course. But the media hasn’t acquitted itself too well when it comes to Harris’ candidacy.","url":"https://www.dailykos.com/story/2024/8/29/2266637/-Here-s-what-to-watch-for-during-Harris-and-Walz-s-first-TV-interview?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1339870/story_image/GettyImages-2166636722.jpg?1724968973","video":null,"publish_date":"2024-08-29 23:00:13","author":"Joan McCarter","authors":["Joan McCarter"],"language":"en","source_country":"US","sentiment":-0.18},{"id":255231028,"title":"Netizens Think Gavin Newsom is Bitter About Harris' Nomination with His Snarky 'Inclusive' Comment","text":"Gavin Newsom recently made a controversial joke about Kamala Harris' presidential nomination for the 2024 elections. Newsom was among the prospective candidates after Biden dropped out of the race. But, Harris won. In his recent podcast interview, he mockingly said he's been \"told to say\" the party's nomination process was inclusive. And the internet thinks he's jealous of her. @scottyd121, a user on X, formerly Twitter, reposted the clip from Newsom's interview and wrote, \"Gavin isn't bitter at ALL about the 'democratic' process of switching Joe with Kamala.\" @Kelly05484118 echoed, \"Maybe he had been drowning his sorrows prior to this and let it slip.\" @tqlemd claimed, \"He's starting the process of sabotaging Harris' election.\" @Toner1955 joked, \"Newsom thought he was going to be chosen.\" Meanwhile, other users called him out for his poor records in the state of California. @irrationalhenry slammed Newsom, \"Yes, he lies openly to his critics.\" @erik_london added to the abovementioned tweet, \"He professionally gaslights for a living. Good thing data doesn't lie in that over a million Californians have fled the state under him.\" @20MillionYears criticized, \"He's done nothing good for this State and its legal residents. That's All.\" @DeanPellegrino2 explained his point, \"Gavin is mad because they chose Harris over him. [The] problem with Gavin is everyone knows he destroyed California’s economy, safety, schools and companies are leaving out in groves.\" The 56-year-old appeared on the Pod Save America podcast on Friday, August 23, 2024, and took a jibe at the Vice President's presidential nomination for the November elections. He told the hosts, \"We went through a very open process, a very inclusive process. It was bottom-up, I don't know if you know that. That's what I've been told to say,\" per New York Post. POTUS Biden abruptly announced he was abandoning his re-election bid against Republican rival Donald Trump on July 21, 2024. The 81-year-old was under intense pressure from his party people and his critics to withdraw his campaign after his catastrophic performance at CNN's first presidential debate with Trump. While some questioned his mental acuity and declining health, his own people feared the Democratic party's future in politics. Although he initially refused to step down, he eventually let go of the race and endorsed his running mate Harris for president. The Democratic party didn't immediately back Biden's endorsement, they considered other candidates as well. Among other prospects was Newsom who was expected to take the responsibility forward. Emily Hoeven, an opinion columnist at the San Francisco Chronicle, said at the time, \"I think it's been clear that he's been waiting in the wings for some time. Now there is a far bigger opening for him than there ever has been,\" per The Guardian. But, since the DNC lent unifying support for Harris and her chosen VP Tim Walz's campaign, Newsom has made this controversial statement. Aside from social media critics, journalists like Glenn Greenwald commented on the viral clip on X, \"The Party of Democracy sits around guffawing at how anti-democratic and vote-free and secret was their process for choosing and then imposing the new Democratic presidential nominee on the country.\"","summary":"A user on X, formerly, Twitter, made a joke at Gavin Newsom&#39;s expense, &#34;Newsom thought he was going to be chosen [as president&#39;s nominee].&#34;","url":"https://www.inquisitr.com/netizens-think-gavin-newsom-is-bitter-about-harris-nomination-with-his-snarky-inclusive-comment","image":"https://dab57h0r8ahff.cloudfront.net/713143/uploads/a51a9b10-65f2-11ef-b176-858dad6f1219_1200_630.jpeg","video":null,"publish_date":"2024-08-29 23:00:09","author":"INQUISITR,Juwairiya Shariq","authors":["INQUISITR","Juwairiya Shariq"],"language":"en","source_country":"US","sentiment":-0.267},{"id":255230428,"title":"Harris leads Trump in nationwide post-DNC 2024 election survey","text":"Vice President Kamala Harris is currently leading former President Donald Trump by a narrow margin following a predictable increase in support from the Democratic National Convention last week, according to a survey that was released on Thursday. The Wall Street JournalÃ¢ÂÂs latest national poll showed Harris leading Trump by 1 percentage point.Â The Democratic nominee pulled 48% support in a head-to-head matchup compared to the Republican nomineeÃ¢ÂÂs 47% backing.Â When third-party candidates were included in the survey, HarrisÃ¢ÂÂ advantage grew to 2 points,Â 47% to 45%.Â Both results were within the pollÃ¢ÂÂs 2.5 percentage point margin for error.Â Based on the survey results, it is implied that Trump, who is 78 years old, would probably win in the Electoral College race, as historically Democratic nominees tend to poll higher than their Republican counterparts in national polls. For Democratic presidential candidates to demonstrate a potential lead in the key battleground states that will ultimately determine the election outcome, they typically require a national polling advantage of at least 3 percentage points. In 2016, for example, former Secretary of State Hillary Clinton topped Trump by 2.1 percentage points in the national popular vote but lost several swing states, handing Trump a decisive Electoral College victory.Â The poll marked the first time that Trump has trailed in the presidential race (head to head) since April of last year, according to the Wall Street Journal.Â The vice presidentÃ¢ÂÂs surge is likely a reflection of the four days of glowing praise showered upon Harris during the four day, nationally televised Democratic gathering in Chicago Ã¢ÂÂ a polling bump that often fades.Â The post-DNC poll found that Democratic voter enthusiasm for Harris (90%) topped GOP enthusiasm for Trump (82%), another likely side effect from the convention.Â However, HarrisÃ¢ÂÂ job approval rating as vice president remains underwater despite the positive vibes at the DNC, with 51% disapproving and 42% approving.Â On the issues, voters still trust Trump to handle the economy (by 8 points) and inflation (by 5 points) better than Harris. Trump was also viewed by voters as more equipped than the vice presidentÂ to handle the Israel-Hamas war and threats from Russia and China.Â Harris made gains with Black voters but the poll found her 83% support among voters who were Black still lower than the 91% support Biden pulled in 2020 election exit polls.Â The Wall Street Journal poll surveyed 1,500 registered voters between Aug. 24-28.Â","summary":"Internewscast Journal\n\nInternewscast\n\n\nVice President Kamala Harris is currently leading former President Donald Trump by&#8230;\n\n\nThis Post: Harris leads Trump in nationwide post-DNC 2024 election survey first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/harris-leads-trump-in-nationwide-post-dnc-2024-election-survey/","image":"https://internewscast.com/wp-content/uploads/2024/08/Harris-eeks-ahead-of-Trump-nationally-in-post-DNC-2024-election.jpg","video":null,"publish_date":"2024-08-29 22:58:30","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.124},{"id":255230566,"title":"‘Pretty Clear’ Who the Next President Will Be: Former DNC Chairman","text":"“A transformative moment,” is how Former DNC Vice Chair Michael Blake described Vice President Kamala Harris’s DNC speech. Telling NTD’s Jack Bradley that it’s “pretty clear” who the next president will be.","summary":"“A transformative moment,” is how Former DNC Vice Chair Michael Blake described Vice President Kamala Harris’s DNC speech. Telling NTD’s Jack Bradley that it’s “pretty clear” who the next president will be. ","url":"https://www.theepochtimes.com/epochtv/pretty-clear-who-the-next-president-will-be-former-dnc-chairman-5715398","image":"https://img.theepochtimes.com/assets/uploads/2024/08/29/id5715400-Michael-Blake.jpg","video":null,"publish_date":"2024-08-29 22:57:28","author":"Jack Bradley","authors":["Jack Bradley"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.82},{"id":255230688,"title":"In CNN interview, Harris says she will appoint Republican to Cabinet","text":"Aug. 29 (UPI) -- Democratic presidential nominee Kamala Harris says in an interview to be broadcast Thursday night on CNN that, if elected, she will appoint a Republican to her Cabinet. The exclusive interview with Harris and her running mate, Minnesota Gov. Tim Walz, is scheduled to air at 9 p.m. EDT. Ahead of the broadcast, CNN revealed that during the exchange, Harris said she would reach out to moderates and independents alienated by the \"extremism\" of GOP nominee Donald Trump by naming a Republican to her administration. \"I've got 68 days to go with this election, so I'm not putting the cart before the horse,\" she says in her first in-depth television interview since accepting the nomination. \"But I would. I think it's really important. I have spent my career inviting diversity of opinion. I think it's important to have people at the table when some of the most important decisions are being made that have different views, different experiences. \"And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican,\" she says. Harris and Walz are on a bus tour through the key swing state of Georgia as they attempt to build on their momentum coming out of last week's Democratic National Convention. Georgia, reliably a Republican stronghold with the GOP owning all the statewide elected offices, flipped to the Democrats in the presidential election under Joe Biden. Most polls either show Harris neck-and-neck or pulling slightly ahead of Trump in the state. On Thursday, the Harris-Walz campaign highlighted what it called growing GOP support, including an open letter signed by more than 200 Republicans who previously worked for either former President George W. Bush, the late Sen. John McCain, R-Ariz., or Sen. Mitt Romney, R-Utah. \"While Donald Trump continues to attack moderates and independents, as well as Republicans he doesn't like, the Harris-Walz campaign has made clear that there is a place in our coalition for voters who reject the extremism of Donald Trump and want to put country over party,\" a campaign spokesperson said. Harris attended a solo rally in Savannah on Thursday, wrapping up the bus tour, before visiting the CNN studios in Atlanta with Walz. Before the airing the interview, the broadcaster also reported that Harris used the airtime to explain how her views on immigration and producing oil and gas via hydraulic fracturing, or fracking, have evolved since her unsuccessful bid for the Democratic presidential nomination four years ago. She came out against fracking as a climate change hazard in 2019, but by the time eventual Democratic nominee Joe Biden tapped her as his running mate, she had already altered her position and, in fact, later cast a tie-breaking vote in the U.S. Senate to expand fracking leases. \"We have set goals for the United States of America and by extension, the globe, around when we should meet certain standards for reduction of greenhouse gas emissions, as an example. That value has not changed,\" she said.","summary":"Democratic presidential nominee Kamala Harris says in an interview to be broadcast Thursday night on CNN that, if elected, she will appoint a Republican to her Cabinet.","url":"https://www.upi.com/Top_News/2024/08/29/CNN-interview-Harris-sappoint-Republican-cabinet/2571724968147/","image":"https://cdnph.upi.com/ph/st/th/2571724968147/2024/upi_com/fc876dbcc071fce2ae523b2027c2e040/v1.2/In-CNN-interview-Harris-says-she-will-appoint-Republican-to-Cabinet.jpg","video":null,"publish_date":"2024-08-29 22:55:28","author":"Don Jacobson","authors":["Don Jacobson"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.031},{"id":255230332,"title":"Kamala Harris finishes Georgia bus trip with Savannah gathering","text":"SAVANNAH, Ga. — Vice President Kamala Harris on Thursday worked to shore up Democratic support in Georgia by visiting a part of the battleground state that politicians don’t frequent nearly as much as the more heavily populated Atlanta area. “For the past two election cycles, voters in this very state, you who are here, have delivered. You sent two extraordinary senators to Washington, D.C.,” Harris said, referring to Raphael Warnock and Jon Ossoff. She said that Georgians mobilized to put a Democrat in the Oval Office four years ago and that she’s hoping for a repeat. “You showed up, you knocked on doors, you registered folks to vote, and you made it happen,” Harris said. “You did that. And so now we are asking you to do it again.” Harris and her running mate, Minnesota Gov. Tim Walz, completed a two-day bus tour of southeastern Georgia. During a stop at a Savannah café Thursday, Harris said she plans to roll out a tax credit proposal for new startups and small businesses next week. “This is one of my singular priorities, is to invest and grow our small businesses,” she said. Shortly before the rally, Walz joined Harris for a joint interview with CNN that’s scheduled to air at 9 p.m. ET Thursday. It’s her first sit-down interview since she launched her White House bid late last month. The crowd began filing into Savannah’s Enmarket Arena more than three hours before Harris was set to speak, braving a downpour while waiting in long lines to pass through security. Inside the arena, energetic supporters held signs reading “Freedom” and “A New Way Forward,” dancing to songs from CJ the DJ, a local radio host, as blue and white lights beamed across the audience. A Harris-Walz campaign official said 7,500 people were in attendance. The official said that’s the venue’s maximum capacity. Protesters interrupted Harris twice, and the audience cheered as they were led out. One protester was pro-Palestinian; it was unclear what the other protester was saying. “I am speaking now,” Harris said as the first protester was escorted out, adding that she and President Joe Biden are working “around the clock” to secure a hostage deal. Walz wasn’t onstage for the Savannah rally. He’s in North Carolina for two campaign events. Biden’s razor-thin 2020 victory in Georgia came down to fewer than 12,000 votes. One of the heaviest blue regions of the state is metro Atlanta, where Biden performed better than 2016 Democratic nominee Hillary Clinton in almost every county. But Democratic leaders in Savannah say the Harris campaign is helping expand party support in the state’s southeast. “Atlanta has always gotten the juice, has always gotten the love, but us here in southeast Georgia, we really matter,” said Aaron “Adot” Whitely, chair of the Democratic Party in Chatham County, where Savannah is located. Biden narrowly improved Democrats’ margins in two blue Southeastern counties in 2020, winning Chatham with 58.6% of the vote. Savannah Mayor Van Johnson, who has long been vocal about the need for Democrats to more seriously engage with cities beyond Atlanta, said he feels the Harris campaign has answered his call by opening seven field offices in southern Georgia. “The fallacy often is that Georgia is Atlanta and Atlanta is Georgia,” Johnson said. “Each city, each county, has its own distinct flavor and its own distinct history, and so it would be a fool’s errand to think that you can fly in and out of Atlanta and that you’ve covered Georgia.” Jonae Wartel, senior adviser to the Harris campaign in Georgia, emphasized that Democrats learned the importance of having a statewide strategy from their successful 2021 Senate runoff races, when she was runoff director for Georgia Democrats. Warnock and Ossoff won their races nearly four years ago, giving Democrats a majority in the Senate. Warnock kept his seat in 2022, beating his Republican opponent. “I think it’s really important to not see Georgians as a single type of voter, but more a broad coalition,” Wartel said. “So taking her to parts of Georgia that are outside of metro Atlanta is incredibly important.” The campaign’s volunteer efforts got a boost when Harris announced her campaign, with more than 35,000 people joining volunteer efforts in Georgia, Porsha White, the Harris campaign’s Georgia director, said in a news release. Amy Morton, CEO of the Democratic consulting firm Southern Majority, said Harris’s rising to the top of the ticket also became a “game changer” for down-ballot races. Often, Democrats in swing districts try to distance themselves from the presidential nominee, Morton said. “That is flipped in this situation,” she said. “I already have Republican opponents in these districts who are sprinting away from Trump.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nSAVANNAH, Ga. — Vice President Kamala Harris on Thursday worked to shore&#8230;\n\n\nThis Post: Kamala Harris finishes Georgia bus trip with Savannah gathering first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/kamala-harris-finishes-georgia-bus-trip-with-savannah-gathering/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Kamala-Harris-caps-Georgia-bus-tour-with.jpg","video":null,"publish_date":"2024-08-29 22:55:12","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.046},{"id":255230308,"title":"Trump calls for universal coverage of IVF treatment with no specifics on how his plan would work","text":"POTTERVILLE, Mich. (AP) — Former President Donald Trump says that, if he wins a second term, he wants to make IVF treatment free for women, but did not detail how he would fund his plan or how it would work. “I’m announcing today in a major statement that under the Trump administration, your government will pay for — or your insurance company will be mandated to pay for — all costs associated with IVF treatment,” he said at an event in Michigan. “Because we want more babies, to put it nicely.” IVF treatments are notoriously expensive, and can cost tens of thousands of dollars for a single round. Many women require multiple rounds and there is no guarantee of success. The announcement comes as Trump has been under intense criticism from Democrats for his role in appointing the Supreme Court justices who overturned Roe v. Wade, ending the constitutional right to an abortion in the country. The decision is expected to be a major motivator for Democrats this November, and was a major theme of the party’s national convention last week as well as Vice President Kamala Harris’ speech as she accepted her party’s nomination. In response, Trump has been trying to present himself as moderate on the issue, going as far as to declare himself as “very strong on women’s reproductive rights.” In an interview with NBC ahead of the event, Trump also suggested that he will vote to repeal Florida’s six-week abortion ban, which limits the procedure before many women even know they are pregnant. Trump, in the interview, did not explicitly say how he plans to vote on the ballot measure when he casts his vote this fall. But he repeated his past criticism that the measure, signed into law by Republican Gov. Ron DeSantis last year, is too restrictive. “I think the six weeks is too short. It has to be more time,’ he said. ”I am going to be voting that we need more than six weeks.” Trump had previously called DeSantis’ decision to sign the bill a “terrible mistake.” Trump has held multiple conflicting positions on abortion over the years. After he considered various potential national cutoff times, he decided earlier this year that regulating abortion should be left to the states. He has repeatedly taken credit for his role in overturning Roe and called it “a beautiful thing to watch” as states set their own restrictions. But he also came out in favor of IVF and pushed lawmakers in Alabama to protect access after the state Supreme Court ruled that frozen embryos can be considered children under state law, sparking national backlash. Trump’s running mate, Ohio Sen. JD Vance, said over the weekend that Trump would not support a national abortion ban if elected president and would veto such legislation if it landed on his desk. “I can absolutely commit that,” Vance said when asked on NBC’s “Meet the Press” whether he could commit to Trump not imposing such a ban. “Donald Trump’s view is that we want the individual states and their individual cultures and their unique political sensibilities to make these decisions because we don’t want to have a nonstop federal conflict over this issue.” The Ohio senator also insisted that Trump, the former president would veto such legislation if Congress passed it. “I mean, if you’re not supporting it as the president of the United States, you fundamentally have to veto it,” he said in an interview that aired Sunday. An AP-NORC poll conducted in June found that more than 6 in 10 U.S. adults support protecting access to IVF, including more than half of Republicans. Only about 1 in 10 are opposed. In his speech, Trump also said that, if he wins, families will be able to deduct expenses for caring for newborns from their taxes. “We’re pro-family,” he said. Trump made the announcement while campaigning in Michigan and Wisconsin as he ramps up his battleground state travel heading into the traditional Labor Day turn toward the fall election. Trump is intensely focused on recapturing states he won in 2016 but lost narrowly in 2020 as he continues to adjust to the reality of his new race against Harris. Trump’s first stop was Potterville, Michigan, near the state capital of Lansing, where he railed against the Biden administration over inflation in the most dramatic terms, accusing Harris and President Joe Biden of having presided over “an economic reign of terror” and “committing one financial atrocity after another.” “Kamala has made middle class life unaffordable and unlivable and I’m going to make America affordable again,” he vowed to supporters at Alro Steel. It was his third visit to the state in the past nine days and second this week after a speech to the National Guard Association in Detroit on Monday. Later, he will visit La Crosse, Wisconsin, for a town hall moderated by former Rep. Tulsi Gabbard, who endorsed him in Detroit. It will be Trump’s first visit to Wisconsin since the Republican National Convention in Milwaukee, which ended three days before Biden dropped out of the race and made way for Harris. Along with Pennsylvania, which Trump will visit on Friday, these three Midwestern states make up a northern industrial bloc Democrats carried for two decades before Trump won them in 2016. Biden recaptured them on his way to the White House in 2020. Trump and his vice-presidential pick, Ohio Sen. JD Vance, have blitzed the battleground states in recent weeks, with Vance in both states this week as well. Trump has struggled in recent weeks to pivot to his new race against Harris, whose candidacy has reinvigorated the Democratic Party. He complained yet again of the switch on Thursday, asking his crowd. “How would you like to be me?” Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"POTTERVILLE, Mich. (AP) — Former President Donald Trump says that, if he wins a second term, he wants to make IVF treatment free for women,...","url":"https://wsvn.com/news/politics/trump-calls-for-universal-coverage-of-ivf-treatment-with-no-specifics-on-how-his-plan-would-work/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/240810_Donald_Trump_Montana_rally.jpg?quality=60&strip=color","video":null,"publish_date":"2024-08-29 22:53:04","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.528},{"id":255231082,"title":"'Same old tired playbook': Kamala fires back at Trump's 'happened to turn Black' comment","text":"Kamala Harris in her CNN interview today addressed former President and Republican presidential candidate Donald Trump's recent comments about her racial identity. Dismissing his remarks as merely a \"same old, tired playbook\", she promptly shifted to the next question.“Next question, please,” Harris said during her first interview with CNN’s Dana Bash in Georgia since becoming the Democratic presidential candidate.Trump had recently made false claims at National Association of Black Journalists conference in Chicago that Harris, the first Black and Asian American vice president, had only previously highlighted her Indian heritage. “I didn’t know she was Black until a number of years ago when she happened to turn Black and now she wants to be known as Black. So, I don’t know, is she Indian or is she Black?” Trump said.Harris in a joint appearance with her running mate Tim Walz told Bash that she believes the most important and significant aspect of her policy perspective and decisions is that her values have not changed. Reaffirming her commitment to serve as president for \"all Americans,\" Harris mentioned in the interview that she would include a Republican in her Cabinet if elected, although she did not specify any particular individual.","summary":"In a CNN interview, Kamala Harris dismissed Donald Trump's comments on her racial identity, calling them outdated. She reaffirmed her consistent values and commitment to serve all Americans. Harris hinted at including a Republican in her Cabinet if elected. This is Harris's first interview since Joe Biden withdrew from the presidential race in late July.","url":"https://timesofindia.indiatimes.com/world/us/same-old-tired-playbook-kamala-fires-back-at-trumps-happened-to-turn-black-comment/articleshow/112906537.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112906639/112906639.jpg","video":null,"publish_date":"2024-08-29 22:50:52","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.009},{"id":255230060,"title":"Harris eeks ahead of Trump nationally in post-DNC 2024 election poll  ","text":"Vice President Kamala Harris holds a slim lead over former President Donald Trump after an expected polling bump following last week’s Democratic National Convention, according to a survey released Thursday. The Wall Street Journal’s latest national poll showed Harris leading Trump by 1 percentage point. The Democratic nominee pulled 48% support in a head-to-head matchup compared to the Republican nominee’s 47% backing. When third-party candidates were included in the survey, Harris’ advantage grew to 2 points, 47% to 45%. Both results were within the poll’s 2.5 percentage point margin for error. The survey’s findings suggest that Trump, 78, would likely emerge victorious in the Electoral College race, since Democratic candidates typically poll higher than Republican ones in national polls. The Democratic presidential candidates usually need at least a 3 point lead nationally to signal that they are also ahead in the battleground states that will decide the election. In 2016, for example, former Secretary of State Hillary Clinton topped Trump by 2.1 percentage points in the national popular vote but lost several swing states, handing Trump a decisive Electoral College victory. The poll marked the first time that Trump has trailed in the presidential race (head to head) since April of last year, according to the Wall Street Journal. The vice president’s surge is likely a reflection of the four days of glowing praise showered upon Harris during the four day, nationally televised Democratic gathering in Chicago – a polling bump that often fades. The post-DNC poll found that Democratic voter enthusiasm for Harris (90%) topped GOP enthusiasm for Trump (82%), another likely side effect from the convention. However, Harris’ job approval rating as vice president remains underwater despite the positive vibes at the DNC, with 51% disapproving and 42% approving. On the issues, voters still trust Trump to handle the economy (by 8 points) and inflation (by 5 points) better than Harris. Trump was also viewed by voters as more equipped than the vice president to handle the Israel-Hamas war and threats from Russia and China. Harris made gains with Black voters but the poll found her 83% support among voters who were Black still lower than the 91% support Biden pulled in 2020 election exit polls. The Wall Street Journal poll surveyed 1,500 registered voters between Aug. 24-28.","summary":"The Wall Street Journal’s latest national poll showed Harris leading Trump by 1 percentage point. ","url":"https://nypost.com/2024/08/29/us-news/harris-eeks-ahead-of-trump-nationally-in-post-dnc-2024-election-poll/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-ilz3v7pja-1724968994459.jpg?quality=75&strip=all&1724954674&w=1200","video":"https://cdn.jwplayer.com/videos/qq06kXKU-RyIcpnTz.mp4","publish_date":"2024-08-29 22:43:16","author":"Victor Nava","authors":["Victor Nava"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.001},{"id":255229962,"title":"RFK Jr. Defends Wife Cheryl Hines From Bradley Whitford’s “Bullying,” Who Chastised Her After Trump Alliance","text":"Fresh off of drawing to a close his independent presidential run and joining forces with former President Donald Trump, Robert. F Kennedy Jr. spoke with TMZ on Tuesday regarding several recent events involving his wife, actress Cheryl Hines, and defended her against attacks from fellow actor Bradley Whitford, who chastised her online for standing by her husband as he endorsed the GOP candidate. Kennedy’s presidential bid was beset with challenges from its inception, as he struggled to get his name on the ballot in all 50 states. Teams had been collecting the required signatures from the electorate nationwide but a lack of enthusiasm about his candidacy and the general thought that he’d play spoiler in November led to him suspending his campaign on Friday, just after the Democratic National convention closed. Kennedy was quick to endorse Trump and Whitford was quick to berate Hines for standing in silence as this all unfolded. “Hey @CherylHines, way to stay silent while your lunatic husband throws his support behind the adjudicated rapist who brags about stripping women of their fundamental rights,” Whitford wrote in a post on X, formerly Twitter. Speaking with TMZ by phone on Wednesday, Kennedy called this language from Whitford a “template for bullying” after noting that Hines is no supporter of Trump and his third presidential bid. “I had to suppress some strong feelings about that, Kennedy said. “You know, it is a template for bullying. Here you have a guy, instead of challenging me, he’s attacking my wife. Who would do that? What kind of person, what kind of man would do that? Why wouldn’t he talk to me directly?” Hines, he said, attended a meeting between Trump and Kennedy just after the former president was shot at a Pennsylvania rally in June. Kennedy’s wife, known to many for portraying a fictionalized version of herself for 12 seasons of Curb Your Enthusiasm, had encouraged the meeting with Trump out of sympathy and not as a supporter. “She urged me to do that, and she did that out of compassion. It was an emotional night for our country. It was an emotional night for everyone, and she made the right judgment,” he declared. “She’s a lifelong Democrat, and the idea of me supporting Donald Trump as president is something that she would have never imagined, that she never wanted in her life. That is, I think, causing her a lot of discomfort,” he added. “And, you know, I’m very grateful to her.” Kennedy was also asked to account for statements he had previously made about Trump before entering his good graces last week. The political legacy, whose father was slain Sen. Robert Kennedy, has said Trump is “a threat to democracy, a bully, that he appealed to bigotry, hatred and xenophobia and prejudice,”; Kennedy was also reminded that he’d said that Trump “was a terrible president.” Facing his past remarks, Kennedy punted, telling TMZ that a 45-minute speech he’s previously given stated his evolution toward Trump’s ideas and policies. “That evolution is not something that I can distill or summarize in a minute,” Kennedy added. So far, Kennedy’s endorsement of Trump does not seem to be making a dent in polling numbers. According to a new Yahoo News/YouGov poll conducted from Aug. 22 to Aug. 26, Vice President Kamala Harris (46 percent) narrowly leads Trump (45 percent) among registered voters in a matchup that includes remaining third-party candidates.","summary":"Fresh off of drawing to a close his independent presidential run and joining forces with former President Donald Trump, Robert. F Kennedy Jr. spoke with TMZ on Tuesday regarding several recent events involving his wife, actress Cheryl Hines, and defended her against attacks from fellow actor Bradley Whitford, who chastised her online for standing by [&#8230;]","url":"https://www.hollywoodreporter.com/news/politics-news/robert-kennedy-jr-defends-cheryl-hines-bradley-whitford-bullying-trump-1235987373/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/08/GettyImages-2115575446.jpg","video":null,"publish_date":"2024-08-29 22:41:38","author":"Kevin Dolak","authors":["Kevin Dolak"],"language":"en","source_country":"US","sentiment":-0.082},{"id":255230476,"title":"Harris in Georgia, Trump in Michigan, Wisconsin","text":"Harris in Georgia, Trump in Michigan, Wisconsin Former President Donald Trump held campaign stops in Michigan and Wisconsin Thursday while Vice President Kamala Harris addressed voters in Savannah, Georgia. CBS News camapign reporters Aaron Navarro and Taurean Small report.","summary":"Former President Donald Trump held campaign stops in Michigan and Wisconsin Thursday while Vice President Kamala Harris addressed voters in Savannah, Georgia. CBS News camapign reporters Aaron Navarro and Taurean Small report.","url":"https://www.cbsnews.com/video/harris-in-georgia-trump-in-michigan-wisconsin-2024-election/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/29/8a144643-8a27-49fc-b596-20e7f94a44da/thumbnail/1200x630/be7976393286f2a98a77790fe0d8f11e/cbsn-fusion-harris-in-georgia-trump-in-michigan-wisconsin-2024-election-thumbnail.jpg?v=25685eaa472b1a5dbb5bd46ae","video":null,"publish_date":"2024-08-29 22:41:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.589},{"id":255230196,"title":"Kamala Harris speech interrupted by Gaza protester at Georgia rally","text":"Pro-Gaza protesters interrupted Kamala Harris during a rally in Georgia, with the vice president insisting that she and Joe Biden were working to secure a ceasefire between Gaza and Israel. Harris spoke at a rally in Savannah as part of a swing through southern Georgia as she seeks to capitalize on the momentum she received after the Democratic National Convention and the fact she is closing the gap in multiple polls in Georgia and other swing states. Harris delivered her standard stump speech when protesters began to interrupt her. “Everyone has a right and should have their voices heard,” she told the audience. “I am speaking now, but on the subject, I will say this, the president and I are working around the clock. We've got to get a hostage deal done and get a ceasefire done now.” Harris has faced demonstrations from people critical of hers and President Joe Biden’s support for Israel during its war against Hamas in Gaza after the surprise attack on October 7, when the terror group killed 1,200 people and took 251 hostages. During a rally in Detroit earlier this month, Harris responded bluntly to hecklers who were chanting, “Kamala Kamala you can’t hide, we won’t vote for genocide.” “If you want Donald Trump to win, then say that. Otherwise, I'm speaking,” she told the demonstrators. Later, during a rally in Glendale, Arizona, she said the administration wanted a ceasefire between Israel and Hamas. “Now is the time,” she said. “And the president and I are working around the clock every day to get that ceasefire deal done and bring the hostages home.” During the Democratic National Convention last week, many delegates who represented voters in Michigan, Minnesota and elsewhere who had voted “uncommitted” in the primaries pushed for Harris to call for a ceasefire and stop sending arms to Israel, which Harris did not agree to do. Later, pro-Gaza activists pushed for a Palestinian-American speaker at the convention, which did not happen. Harris mentioned Palestinian suffering in her speech when she accepted the Democratic nomination for president. “So many innocent lives lost,” she said in Chicago. “Desperate, hungry people fleeing for safety, over and over again. The scale of suffering is heartbreaking.” At the same time, Harris focused heavily on attacking Trump, who has also campaigned in Georgia and will hold a fundraiser with Georgia Governor Brian Kemp, whom he had previously criticized. Harris will also conduct her first sit-down interview since ascending to the top of the Democratic ticket tonight with her running mate Tim Walz, the governor of Minnesota.","summary":"Harris responded with her typical retort that ‘the president and I are working around the clock’ to get a ceasefire deal between Israel and Hamas done","url":"https://www.independent.co.uk/news/world/americas/us-politics/harris-gaza-protester-savannah-georgia-b2604167.html","image":"https://static.independent.co.uk/2024/08/29/22/h0xjr7r4-720.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/tK4HGfy7-4VHSaSK0.mp4","publish_date":"2024-08-29 22:40:35","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.35},{"id":255229914,"title":"JD Vance Begs His Old Billionaire Boss Peter Thiel for Campaign Cash","text":"Republican vice presidential candidate JD Vance is begging his billionaire former boss Peter Thiel to bankroll his bid for the White House. In an interview with the Financial Times, Vance made no secret about how much he has been “talking to Peter and persuading him” to donate to former President Donald Trump’s presidential campaign as he falls behind Vice President Kamala Harris in funding. “You know he’s obviously been exhausted by politics a little bit,” Vance told the Times about the PayPal co-founder. “But he’s going to be really exhausted by politics if we lose and if Kamala Harris is president.” Thiel is connected to Vance’s successful Ohio Senate race win over Democratic Rep. Tim Ryan in 2022. Thiel has also been credited for single-handedly funding Republican Blake Masters’ failed 2022 run for Arizona Senate to the tune of a reported $15 million. Both Masters and Vance are Thiel’s former employees and have been touted as his protégés. Thiel was Vance’s boss at Mithril Capital venture capital fund in California, and then Thiel backed Vance’s Narya Capital before he decided to run for office. Vance has previously referred to Thiel as a “pretty good mentor,” but he knows Thiel has been an even better donor. After donating a reported $1.25 million to Trump’s 2016 presidential campaign, Thiel expressed that he had been less than impressed by Trump’s presidency and announced that he had no plans to give “any money to Republican politicians in 2024.” In a June interview at the Aspen Ideas Festival, Thiel said, “If you hold a gun to my head I’ll vote for Trump.” However, Thiel told The Atlantic in November last year, “there’s always a chance I might change my mind.” Vance said he is being persistent in “talking to Peter and persuading him.” During his recent campaign stop in Wisconsin, Vance commented that Thiel is a “fundamentally a conservative guy.” He added, “I think that he needs to get off the sidelines and support the ticket.”","summary":"Jeff Swensen/John Lamparski/Getty ImagesRepublican vice presidential candidate JD Vance is begging his billionaire former boss Peter Thiel to bankroll his bid for the White House. \n\nIn an interview with the Financial Times, Vance made no secret about how much he has been “talking to Peter and persuading him” to donate to former President Donald Trump’s presidential campaign as he falls behind Vice President Kamala Harris in funding.\n\n“You know he’s obviously been exhausted by politics a little bit,” Vance told the Times about the PayPal co-founder. “But he’s going to be really exhausted by politics if we lose and if Kamala Harris is president.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/jd-vance-begs-his-old-billionaire-boss-peter-thiel-for-campaign-cash","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1724967915/Blank_3000_x_1688_copy_507_bkvtxw","video":null,"publish_date":"2024-08-29 22:40:09","author":"Emell Derra Adolphus","authors":["Emell Derra Adolphus"],"language":"en","source_country":"US","sentiment":-0.11},{"id":255230266,"title":"Expiration of major US-China science treaty signals deep uncertainty amid high tensions","text":"A key US-China science and technology treaty has expired with little apparent evidence of progress following a year of delay fuelled by American apprehensions over how China has benefited from the decades-old pact. Renewal of the US-China Science and Technology Agreement (STA), the first bilateral deal signed between the two countries in 1979, had been postponed twice since August 2023. The most recent six-month extension expired on Tuesday. A State Department official on Thursday said on background: “I don’t have anything additional to share at this time.” This followed word by the same official a day earlier that the two sides were “in communication” about the STA “including on the necessary guardrails around any such cooperation, strengthened provisions for transparency and scientific-data reciprocity”. “The United States remains committed to advancing and protecting US interests in science and technology,” the State Department official added. “We have nothing further to share about the status of the agreement at this time.” On Thursday, the Chinese embassy in Washington did not immediately respond to a request for comment. In the lead-up to the deadline, the Chinese embassy in Washington told the Post that “China-US cooperation on science and technology is mutually beneficial”. “To my knowledge, the two sides have maintained communication about the renewal,” spokesman Liu Pengyu said last Thursday. Discussion of the treaty coincides with the US presidential race shifting into high gear ahead of the November 5 election. The race has seen Republicans accuse Democratic presidential nominee, Vice-President Kamala Harris, and her running mate, Minnesota governor Tim Walz, of being too close to Beijing. Just hours before the pact was about to expire on Tuesday, the Chinese embassy said it would “release related information at [an] appropriate time”. “China and the US side are keeping communication on this,” the embassy said late on Tuesday. Meanwhile, a State Department spokesperson said on background last Friday that the department was negotiating on behalf of the US government to “modernise” the agreement “to reflect the current status of the bilateral relationship”. “We are not prejudging the outcome,” the spokesperson. The discussion also comes amid simmering tensions on multiple fronts between the two economic superpowers This week National Security Adviser Jake Sullivan met in Beijing with President Xi Jinping and Foreign Minister Wang Yi to stabilise bilateral relations tested by their differences over Taiwan, the South China Sea, tariffs and fentanyl. Originally signed by US President Jimmy Carter and Chinese Premier Deng Xiaoping, the symbolically significant pact has been renewed every five years since it took effect, with the most recent renewal in 2018 under then-president Donald Trump. After August last year, when it was on the verge of lapsing, the two countries extended it twice, for six months each time, to negotiate renewal terms. In March, the US House Foreign Affairs Committee unanimously approved a bill to impose greater congressional scrutiny on future State Department efforts to enter, renew or extend any science and technology agreement with China. For decades, the existing agreement has fostered scientific collaboration by providing American and Chinese researchers financial, legal and political support. According to the Congressional Research Service, sub-agreements under the STA have encompassed research areas such as agriculture, energy, the environment, nuclear fusion and safety as well as earth, atmospheric, marine sciences and remote sensing. Its supporters contend the deal shields American researchers working in China and enables research in the US by granting access to crucial Chinese databases, especially in areas like health studies. But critics say China’s state supervision and control over local science and technology projects have allowed Beijing to exploit the STA. They claim Beijing can address scientific gaps, hone skills and capitalise on America’s decentralised academic landscape to predominate in sectors like electric vehicles and renewable energy. In June, the House select committee on China asked the Commerce department to provide information “to assess the damage already caused to US national security” caused by the STA. “We believe the US-PRC STA is a vector to give the PRC access to US dual-use research and presents a clear national security risk,” Republican lawmakers said in a letter. “The Biden administration must stop fuelling our own destruction and allow the STA to expire.” The agreement’s protracted renewal process after decades of uncontroversial renewals highlighted the complex new issues that have come between the two sides, according to Denis Simon of the Asian Pacific Studies Institute at Duke University. “Many of the central issues being discussed were simply not issues in 1979, such as data security and personal security,” said Simon. “The old STA had become almost obsolete, so renewal shifted to devising a new agreement that was more up to date and reflected the realities of 2024 and not the situation 40 years ago.” On Thursday, the US deputy assistant secretary for science and space at the State Department co-chaired a meeting with Japan’s ambassador for science and technology cooperation. They reviewed progress on cooperation in areas such as quantum, fusion and artificial intelligence and strengthened collaboration in emerging technologies including high-performance computing, according to the State Department.","summary":"Landmark deal dating to 1979 is said to shield American researchers working in mainland but critics say Beijing is exploiting its terms.","url":"https://www.scmp.com/news/china/diplomacy/article/3276479/expiration-major-us-china-science-treaty-signals-deep-uncertainty-amid-high-tensions","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/30/676cdf07-676f-413f-a777-e130ebe16473_eed67d15.jpg","video":null,"publish_date":"2024-08-29 22:37:22","author":"Holly Chik,Khushboo Razdan","authors":["Holly Chik","Khushboo Razdan"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.119},{"id":255229702,"title":"Zelensky’s Kursk offense blows up Harris-Biden’s Russia ‘reset’ dreams","text":"Ukrainian President Volodymyr Zelensky is on the offensive. First, he directed the Armed Forces of Ukraine to bring its fight for survival to Kursk inside of Russia. In September, at the United Nations, Zelensky is intent on gunning for the Harris-Biden administration’s absurd Groundhog Day strategy of endless, fruitless defense in Ukraine. Defending into perpetuity is no longer an option. Ukraine is out to win, and Zelensky is insisting on President Biden’s buy-in. But it’s complicated: Biden is a lame duck president who has seemingly checked out — essentially putting the United States on autopilot for the remainder of his presidency. Recognizing this, Zelensky also announced he will be presenting his plan to Vice President Kamala Harris and former President Donald Trump. Yet ending the war in Ukraine is not at the top of either of their to-do lists. Thus, Zelensky finds himself needing to take his case directly to the American people amidst a presidential election cycle that is relegating Ukraine to the rear. His upcoming trip to New York to attend the UN General Assembly is another Gettysburg-like “fix bayonets” moment for Ukraine’s leader. He has the Kremlin on its heels and knows the time is now to press his advantages: momentum, initiative and maneuver. Zelensky only needs American weapons systems and the authority to use them to close the deal — and some American backbone, too. Winston Churchill is often credited with saying, “Americans can always be trusted to do the right thing, once all other possibilities have been exhausted.” Zelensky is out to challenge that notion. As Russian President Vladimir Putin’s “special military operation” enters its 31st month, the United States and NATO must recognize that the strategy of “weakening Russia” by defending Ukraine has not worked. It has contributed to over 612,390 Russian casualties, by Ukraine’s count — but in its wake are thousands of dead and maimed Ukrainian civilians and a blasted World War I-like landscape. The Kremlin simply generates more combat power, secures weapons and ammunition from its “arsenals of evil” in Iran, North Korea and Belarus, and comes at Ukraine again. Putin aims only to continue to feed the “meat grinder” and achieve his objective — the destruction of Ukraine, however long it takes. The Harris-Biden administration’s restrictions on US weapons — and the weapon systems of other NATO countries — for defensive purposes only is a failed technique. The war continues to escalate as the West clings to the idea of wrangling some sort of negotiated outcome that will allow Washington to “reset relations with Moscow,” Politico reported. “Some officials in certain corners of the administration” believe that lifting restrictions on Ukraine could “upend those efforts,” according to the report. Yet Hillary Clinton’s Russian reset attempt failed in 2009, and this one will fail again in 2024. Russia will not voluntarily leave Ukraine, and Zelensky will not cede terrain for a US-brokered peace. The United States cannot reset relations with Moscow; the International Criminal Court has issued an arrest warrant for Putin for alleged war crimes. As former NATO Commander and retired Air Force Gen. Philip Breedlove described the situation, “This war is going to end exactly how Western policymakers decide it will end. If we keep doing what we’re doing, Ukraine will eventually lose. Because right now . . . we are purposely not giving Ukraine what they need to win.” Ukraine is in position to make a win happen. It has taken the initiative and is exploiting success in Russia’s Kursk Oblast while defending against relentless human wave attacks in the Donbas and continuing to make the Crimean Peninsula untenable for Russian forces — all at the cost of not one American or NATO servicemember’s life. Sometimes you need a winner, not another armistice. Resolution is required, not a prolonged “frozen conflict.” It’s time for Washington to get firmly behind Zelensky and his generals and bring this war to a just conclusion. Absent Biden’s own plan to win the war or a clearly defined definition for victory, the Harris-Biden administration would be well served to listen and act on the Zelensky proposal. Ukraine deserves its Yorktown moment. Col. (Ret.) Jonathan Sweet served 30 years as a military intelligence officer. Mark Toth writes on national security and foreign policy.","summary":"Defending into perpetuity is no longer an option: Ukraine is out to win, and Zelensky is insisting on American buy-in. ","url":"https://nypost.com/2024/08/29/opinion/ukraines-offense-dashes-harris-bidens-russia-reset-dream/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/MAJ22.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-29 22:34:34","author":"Jonathan Sweet,Mark Toth","authors":["Jonathan Sweet","Mark Toth"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.131},{"id":255229794,"title":"Get up to speed on today's headlines","text":"Good morning, I'm Maddy Morwood here with you from the breaking news desk. This morning we're looking at the brewing furore around the census. We're now up to six Labor MPs who have told the ABC the government should reverse its decision to axe questions that would (for the first time) give a number on how many LGBTQIA+ Australians there are. Here's what's also making the news: The corporate watchdog claims investment money may have been used to buy a $4.5m penthouse for a developer's wife;Thomas Gallagher has claimed the first Aussie Paralympic gold in Paris after a stunning day in the pool took our medal tally to four; And in breaking news from overnight, Israel and Hamas have agreed to three-day pauses in hostilities for polio vaccinations in Gaza. But let's get back to the simmering tensions over the census questions. What everyone is reading right now \"It comes around every five years and gives the nation an idea of who we are — but next census, they won't ask about who we love or how we identify.\" That's our very own breaking news reporter Esther Linder saying it best. And the Albanese government is facing, shall we say, a bit of internal backlash for its decision to quietly exclude questions surrounding identity and sexuality in the 2026 edition of the national survey. Our political reporters Krishani Dhanji and Tom Crowley take us inside Parliament House for the unfolding story, as six Labor MPs, including assistant health minister Ged Kearney, have vented their dismay. Labor MP Josh Burns told the ABC's Afternoon Briefing the census was \"an important exercise [in] telling people that you count and that you matter\" in more coverage from our political reporter Maani Truu. I'll leave you with this: Current estimates put LGBTQIA+ people as representing 11 per cent of the population. \"Data informs public policy, and if we have the right data we can make better public decisions,\" said Independent MP for Wentworth Allegra Spender. What's trending now Paralympics: While you were sleeping (I've missed saying that!), Australia has taken home four medals, including our first gold when Thomas Gallagher powered home to win the men's S10 50m freestyle final. This morning in the wheelchair basketball, Australia was taking on the Netherlands.Weather: There are fire warnings for Sydney, Wollongong and Mildura, while temps are set to approach 40C in parts of Queensland. Meanwhile Victorians are copping damaging winds courtesy of a cold front and whatever we did to upset the weather gods, we're sorry. Father's Day: Put down those socks and step away from the checkout. You still have time to get dad something good. (I will also say — on Sunday, cheers to all those we love in our life.) What we're following today Harris and Walz: US Vice-President Kamala Harris and her running mate Tim Walz sit down for their first joint interview. This video tells you what to expect, plus we'll be blogging all the action live from 10am AEST. Big four: The CEOs of ANZ, CommBank, NAB and Westpac are up again before the House economics committee. You will be able to catch it all in our live business blog today (recap yesterday's appearance here).Pacific Islands Forum: The regional summit wraps up today. Anthony Albanese has already departed but our colleague Stephen Dziedzic and Marian Kupu are still there and they'll bring you news of the final communique when it's released. Quote of the day —That's an anonymous plea heard during a Senate committee's inquiry into the cost of living, which heard how dental health has become a luxury for many Australians. Dental practices across Australia said they were concerned about cost of living pressures holding back patients from visiting a dentist regularly, and that could just mean trips to the emergency room later on. And most dentists expect their costs are only on the rise this year. This story looks at who is most affected and what those risk factors actually are. One more thing As Australia prepares for the government to finalise its gambling advertising restrictions, our friends at ABC RN have taken a look at what's happened in Belgium where bans have already been implemented. (Spoiler: It hasn't quite gone to plan!) Belgium banned gambling ads through direct marketing, and on free-to-air television, radio and social media. But loopholes remained, e.g. companies can still sponsor teams, so their logos appear on jerseys and in stadiums. The laws are tightening next year to restrict that, but an advisor to the government in the lead-up to restrictions told us it shows how weaknesses will be exploited, and that's something you can expect to happen here too. In fact, you can bet on it. See you next week As always, you can see our full list of top stories below and catch the latest news on our website. Before I go — comedian Hamish Blake revealed he got some of the best advice of his life from which famous figure? Test yourself in our weekly new quiz. Catch you on Monday! Maddy and the ABC News team","summary":"Get up to speed on today's headlines.","url":"https://www.abc.net.au/news/2024-08-30/top-headlines-latest-news/104289436","image":"https://live-production.wcms.abc-cdn.net.au/7ee6f190de6d7dbb04203e514bfae9ec?impolicy=wcms_crop_resize&cropH=700&cropW=700&xPos=0&yPos=0&width=862&height=862","video":null,"publish_date":"2024-08-29 22:32:20","author":"ABC News","authors":["ABC News"],"language":"en","source_country":"AU","sentiment":0.321},{"id":255232110,"title":"Trump Campaign Lashes Out At Fox News Over Poll Showing Kamala Harris Leading In 3 Out Of 4 Swing States","text":"Source: San Francisco Chronicle/Hearst Newspapers via Getty Images / Getty Unless someone is as delusional as Donald Trump and his followers who choose to ignore reality and marvel at America through MAGA-red rose-colored glasses, there’s no denying that the polls have not been friendly to the ex-president as of late. As we reported on Thursday, new polling data collected by the Decision Desk HQ and other polling firms predicted that, at present, Vice President Kamala Harris has a 56% chance of winning the presidency. You just know that when Trump heard that news he immediately shouted, “FAKE NEWS” and thought, “Just wait until my buddies at Fox News have to say about this!” Well — about that… On Wednesday, Fox News, the network where jingoism, white nationalism and xenophobia go to present themselves as journalism, released a poll that shows Harris is ahead of Trump in three of the four key Sun Belt states — Arizona, Georgia and Nevada — with an overall lead of 1 point. Predictably, Trump’s campaign responded to the bad news by getting really angry at the messenger. Source: Boston Globe / Getty Here They Go Again: the Trump Remix “It’s that time of year again. Fox is releasing atrocious polling,” the campaign said in a statement Thursday. “President Trump continues to outperform polling from past cycles. President Trump is 10 points ahead of where he was in Arizona at this point in 2020, according to Fox. Likewise, he is running 8 points ahead of his 2020 polling in Nevada and 5 points ahead of his 2020 polling in North Carolina.” So, basically, Trump’s campaign has responded to Fox News’ poll that shows Harris leading Trump by noting that 2024 Trump is leading 2020 Trump. Even if it’s true it’s a weird flex, but OK. Mind you, Trump constantly treats Fox News like a stepchild he’s ashamed of whenever the relatively rare occasion happens that the network delivers news that isn’t favorable to him. Back in June, he tweeted, “Nobody can ever trust Fox News…” just because House Speaker Paul Ryan made an appearance on the network and said Trump was unfit for office. A few short months and a new Democratic candidate later, and Trump is out here challenging Harris to debate him at Fox News because he’s transparently afraid to go head-to-head with her at their scheduled venue at ABC News. He also called into Fox News while its anchors were covering the Democratic National convention to shout at anyone who would listen that Harris was lying about everything in her well-received speech. So, Trump and his campaign clearly need the network, because Fox News reporters typically hump Trump’s leg and normalize his incessant lies, but they hate the network when it occasionally has to report actual news, and that news isn’t what Trump wants to be reported. Sad. SEE MORE: Fox News Host Is Dragged For Sexist Remark That Army Generals Will ‘Have Their Way’ With Kamala Harris Trump Social Post Suggests He’s Afraid Of Debating Kamala Harris The Diamond And Silk Minstrel Show Tap Dances On Fox News And Gets Dragged 10 photos","summary":"Trump treats Fox News like a stepchild he's ashamed on the relatively rare occasions the network reports the truth about him.\n\n\nThe post Trump Campaign Lashes Out At Fox News Over Poll Showing Kamala Harris Leading In 3 Out Of 4 Swing States appeared first on NewsOne.","url":"https://newsone.com/5510607/trump-campaign-lashes-out-at-fox-news-over-poll-showing-kamala-harris-leading-in-3-out-of-4-swing-states/","image":"https://newsone.com/wp-content/uploads/sites/22/2024/08/17243531924988.jpg?quality=80&strip=all&w=1024&crop=0,0,100,704px","video":null,"publish_date":"2024-08-29 22:30:19","author":"Zack Linly","authors":["Zack Linly"],"language":"en","source_country":"US","sentiment":-0.448},{"id":255231098,"title":"Harris caps two-day Georgia bus tour with appeal to voters at Savannah rally","text":"SAVANNAH, Ga. — Vice President Kamala Harris on Thursday worked to shore up Democratic support in Georgia by visiting a part of the battleground state that politicians don’t frequent nearly as much as the more heavily populated Atlanta area. “For the past two election cycles, voters in this very state, you who are here, have delivered. You sent two extraordinary senators to Washington, D.C.,” Harris said, referring to Raphael Warnock and Jon Ossoff. She said that Georgians mobilized to put a Democrat in the Oval Office four years ago and that she’s hoping for a repeat. “You showed up, you knocked on doors, you registered folks to vote, and you made it happen,” Harris said. “You did that. And so now we are asking you to do it again.” Harris and her running mate, Minnesota Gov. Tim Walz, completed a two-day bus tour of southeastern Georgia. During a stop at a Savannah café Thursday, Harris said she plans to roll out a tax credit proposal for new startups and small businesses next week. “This is one of my singular priorities, is to invest and grow our small businesses,” she said. Shortly before the rally, Walz joined Harris for a joint interview with CNN that’s scheduled to air at 9 p.m. ET Thursday. It’s her first sit-down interview since she launched her White House bid late last month. The crowd began filing into Savannah’s Enmarket Arena more than three hours before Harris was set to speak, braving a downpour while waiting in long lines to pass through security. Inside the arena, energetic supporters held signs reading “Freedom” and “A New Way Forward,” dancing to songs from CJ the DJ, a local radio host, as blue and white lights beamed across the audience. A Harris-Walz campaign official said 7,500 people were in attendance. The official said that's the venue's maximum capacity. Protesters interrupted Harris twice, and the audience cheered as they were led out. One protester was pro-Palestinian; it was unclear what the other protester was saying. “I am speaking now,” Harris said as the first protester was escorted out, adding that she and President Joe Biden are working “around the clock” to secure a hostage deal. Walz wasn’t onstage for the Savannah rally. He’s in North Carolina for two campaign events. Biden’s razor-thin 2020 victory in Georgia came down to fewer than 12,000 votes. One of the heaviest blue regions of the state is metro Atlanta, where Biden performed better than 2016 Democratic nominee Hillary Clinton in almost every county. But Democratic leaders in Savannah say the Harris campaign is helping expand party support in the state’s southeast. “Atlanta has always gotten the juice, has always gotten the love, but us here in southeast Georgia, we really matter,” said Aaron “Adot” Whitely, chair of the Democratic Party in Chatham County, where Savannah is located. Biden narrowly improved Democrats’ margins in two blue Southeastern counties in 2020, winning Chatham with 58.6% of the vote. Savannah Mayor Van Johnson, who has long been vocal about the need for Democrats to more seriously engage with cities beyond Atlanta, said he feels the Harris campaign has answered his call by opening seven field offices in southern Georgia. “The fallacy often is that Georgia is Atlanta and Atlanta is Georgia,” Johnson said. “Each city, each county, has its own distinct flavor and its own distinct history, and so it would be a fool’s errand to think that you can fly in and out of Atlanta and that you’ve covered Georgia.” Jonae Wartel, senior adviser to the Harris campaign in Georgia, emphasized that Democrats learned the importance of having a statewide strategy from their successful 2021 Senate runoff races, when she was runoff director for Georgia Democrats. Warnock and Ossoff won their races nearly four years ago, giving Democrats a majority in the Senate. Warnock kept his seat in 2022, beating his Republican opponent. “I think it’s really important to not see Georgians as a single type of voter, but more a broad coalition,” Wartel said. “So taking her to parts of Georgia that are outside of metro Atlanta is incredibly important.” The campaign’s volunteer efforts got a boost when Harris announced her campaign, with more than 35,000 people joining volunteer efforts in Georgia, Porsha White, the Harris campaign’s Georgia director, said in a news release. Amy Morton, CEO of the Democratic consulting firm Southern Majority, said Harris’s rising to the top of the ticket also became a “game changer” for down-ballot races. Often, Democrats in swing districts try to distance themselves from the presidential nominee, Morton said. “That is flipped in this situation,” she said. “I already have Republican opponents in these districts who are sprinting away from Trump.”","summary":"Vice President Kamala Harris and running mate Minnesota Gov. Tim Walz toured the southeastern part of the battleground state in a push to keep Georgia blue this November.","url":"https://www.nbcnews.com/politics/2024-election/kamala-harris-caps-georgia-bus-tour-savannah-rally-rcna168151","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-08/240829-kamala-harris-savannah-georgia-rally-kh-8aabe2.jpg","video":null,"publish_date":"2024-08-29 22:30:02","author":"Megan Lebowitz,Nnamdi Egwuonwu","authors":["Megan Lebowitz","Nnamdi Egwuonwu"],"language":"en","source_country":"us","sentiment":-0.046},{"id":255229830,"title":"Kamala Harris delivers a speech to rally support for presidency in Southeast Georgia","text":"SAVANNAH, Ga. — Vice President Kamala Harris is expected to take the stage Thursday evening during a rally in Savannah. It will conclude her two-day bus tour through southern and coastal Georgia. Hundreds of people stood in line as they waited for the doors of Enmarket Arena to open. They faced sweltering temperatures and a rain shower, as the line slowly snaked through the security checkpoint. The weather did not dampen spirits, though. Laura Giovanetti and Michelle Mitchell are from South Carolina, but said they could not miss an opportunity to hear the vice president speak. “We wanted to be part of the change, and we wanted to be part of something bigger than ourselves,” Mitchell told First Coast News. Chuck Terry and Beryl Dixon also traveled from outside the city to see the vice president. This will be the second time they have attended a Harris rally. “Just being in the energy and experiencing the joy is enough for me,” Dixon said. Harris considers Georgia to be a battleground state. Her goal this trip is to get to know voters face-to-face in hopes of gaining more support in a predominantly republican region. Tonia Howard-Hall lives in Savannah and appreciates the vice president visiting the region again. “Many times candidates will go to Atlanta, Georgia, and not many times they come here to Savannah,” Howard-Hall said. Howard-Hall wants Harris to touch on some of the more pressing issues in the region. “I’m hoping to hear more about education as far as early childhood education, as well as affordable housing,” Howard-Hall said. “Affordable housing is really needed in this county, in this city.” The Trump campaign released a statement ahead of the rally. A spokesperson said: “Democrats in Georgia are finally learning an important lesson … there is more to Georgia than just Atlanta.” Harris is expected to take the stage at 5:15 p.m.","summary":"Internewscast Journal\n\nInternewscast\n\n\nHarris-Walz supporters braved the heat and rain while waiting for doors to&#8230;\n\n\nThis Post: Kamala Harris delivers a speech to rally support for presidency in Southeast Georgia first appeared on Internewscast Journal","url":"https://internewscast.com/news/kamala-harris-delivers-a-speech-to-rally-support-for-presidency-in-southeast-georgia/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Full-speech-Kamala-Harris-makes-pitch-for.jpg","video":null,"publish_date":"2024-08-29 22:27:10","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.15}]}