{"offset":0,"number":50,"available":350,"news":[{"id":370267692,"title":"Senate Republicans deepfaked Chuck Schumer, and X hasn’t taken it down ","text":"Senate Republicans shared a deepfake video of Chuck Schumer, the Senate minority leader, designed to make it seem like Democrats are celebrating the ongoing government shutdown, which has lasted 16 days. \n\nIn the deepfake, an AI-generated Schumer repeats the phrase “every day gets better for us,” an actual quote taken out of context from a Punchbowl News article. In the original story, Schumer discussed the Democrats’ healthcare-focused shutdown strategy, and said they were not going to back away from Republicans’ playbook of threats and “bambooz[ling].” \n\nThe shutdown is happening because Democrats and Republicans cannot agree to pass a bill funding government through October and beyond. Democrats are trying to hold onto tax credits that would make health insurance cheaper for millions of Americans, secure a reversal to Trump’s Medicaid cuts, and block cuts to government health agencies.\n\nThe video was posted Friday on the Senate Republicans’ X account. According to X’s policies, the platform prohibits “deceptively shar[ing] synthetic or manipulated media that are likely to cause harm.” Harmful content includes media that could “mislead people” or “cause significant confusion on public issues.” \n\nEnforcement actions include removing content, labeling warnings, or reducing visibility. X has not, as of the time of this writing, removed the deepfake or added a warning label — though the video does include a watermark denoting its AI origins. \n\nThe Schumer video is not the first time X has allowed deepfakes of politicians to remain on the platform. In late 2024, X owner Elon Musk shared a manipulated video of former Vice President Kamala Harris in the lead up to the election, sparking debate about misleading voters. \n\nTechCrunch has reached out to X for comment. \n\nUp to 28 states have enacted laws prohibiting deepfakes of political figures, specifically around campaigns and elections, though most don’t outright ban them if they have clear disclosures. California, Minnesota, and Texas have banned deepfakes intended to influence elections, deceive voters, or harm candidates. \n\nThe latest post comes weeks after President Donald Trump posted deepfakes on Truth Social depicting Schumer and Hakeem Jeffries, the House minority leader, making false statements about immigration and voter fraud. \n\nResponding to criticism of the lack of honesty and ethics, Joanna Rodriguez, the National Republican Senatorial Committee communications director, said: “AI is here and not going anywhere. Adapt & win or pearl clutch & lose.”","summary":"The video was posted Friday on the Senate Republicans X account. According to X’s policies, the platform prohibits “deceptively shar[ing] synthetic or manipulated media that are likely to cause harm.” Harmful content includes media that could “mislead people” or “cause significant confusion on public issues.” ","url":"https://techcrunch.com/2025/10/17/senate-republicans-deepfaked-chuck-schumer-and-x-hasnt-taken-it-down/","image":"https://techcrunch.com/wp-content/uploads/2018/02/tc-backlight-e1689786273147.png?w=1200","video":null,"publish_date":"2025-10-17 21:44:07","author":"Rebecca Bellan","authors":["Rebecca Bellan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.373},{"id":370263626,"title":"Gov Josh Shapiro recalls giving Biden brutal reality check about his 2024 campaign","text":"Pennsylvania Gov. Josh Shapiro recalled to \"The Breakfast Club\" in a new interview how he tried to give then-President Joe Biden bad news about the election before he dropped out of the race. Nearly a year after the 2024 election, which was seen as a reckoning for Democrats, the party is still trying to make sense of where they have gone wrong in recent years. Shapiro, who presents himself as a moderate for the party who goes out of his way to engage with conservatives, spoke candidly about his sober warnings to Biden when he was still the de facto 2024 Democratic nominee. \"I went directly to the president and spoke to him about what I saw were, you know, his challenges in Pennsylvania. I was really honest with him,\" Shapiro said. \"We got together at a coffee shop in Harrisburg. I think this has been reported. I mean, I'll just share with you. He said, ‘How's it going?’ I was very clear: ‘It's not going well.'\" JOSH SHAPIRO SAYS KAMALA IS 'GOING TO HAVE TO ANSWER' FOR WHY SHE NEVER RAISED CONCERNS OVER BIDEN'S HEALTH He then recalled what he had told Biden at the time. \"’Polls are showing it's not going well,\" he said. \"I don't think you're handling the cost question. Back to what we talked about before with rising costs. It was a big theme in the campaign. Big issue in Pennsylvania. I didn't think they were handling that well. I expressed that I thought people thought he wasn't up to the job.\" Shapiro argued that his personal style and approach shaped the way he handled this conversation. \"Look, maybe it's old school, but I believe that if you got something to say, you say it directly to that person's face, and he's the president of the United States. I respected him, still respect him, and I respect him enough to say it directly to his face,\" he said. When asked how this sobering assessment was received at the time, Shapiro replied, \"I think he heard it. He told me that their poll numbers were different, and he seemed committed to continuing forward. And listen, that's his call.\" KAMALA HARRIS REVEALS WHAT BIDEN TOLD HER JUST BEFORE CRUCIAL DEBATE WITH TRUMP THAT LEFT HER 'ANGRY' He also recalled arguing to Biden that part of his issue was that Biden's team wasn't straightforward with its own boss. \"Breakfast Club\" host Charlamagne tha God argued that such stories need to be told by any future Democratic Party contenders for the presidency, arguing that \"anybody that wants to lead this party in the future has to throw that old regime under the bus.\" Shapiro, however, disagreed. \"I don't believe that you get ahead in life by throwing people under the bus,\" he said. \"I don't believe that I got to kick somebody in order to get ahead. I think you’ve got to show your work. I think you’ve got to show a vision. I think you’ve got to tell people what you're all about.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP Shapiro was vetted as a possible running mate for Kamala Harris, but she ultimately chose Minnesota Gov. Tim Walz. Shapiro was prescient about Democrats' issues in his state, as Trump went on to win Pennsylvania and the presidency. Fox News Digital reached out to Biden's staff and did not receive an immediate response.","summary":"Josh Shapiro recalled warning then-President Joe Biden that the election was not going well in Pennsylvania, suggesting even that his allies were not giving him the full truth.","url":"https://www.foxnews.com/media/gov-josh-shapiro-recalls-charlamagne-how-he-warned-then-president-biden-his-campaign-not-going-well-pa","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/josh-shapiro-kamala-stephen-a-smith.jpg","video":null,"publish_date":"2025-10-17 21:42:21","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"us","sentiment":-0.561},{"id":370250262,"title":"\"I want names\": Piers Morgan laughs at Kamala Harris' viral claim of being the \"most qualified candidate ever to run for President\"","text":"English broadcaster and journalist Piers Morgan recently shared his reaction after former Vice President of the United States Kamala Harris advocated for her Presidential run. On Thursday, October 16, 2025, the 60-year-old media personality took to his official X account and took a jab at the American politician and attorney for claiming to be the “most qualified candidate” ever to run for the President of the United States.After the X account @libsoftiktok shared a video of Kamala Harris, claiming that some people said she was “the most qualified candidate” to run for President during an on-stage interview with journalist Kara Swisher, Piers Morgan appeared to disagree. Resharing the video on his Twitter, the English journalist tagged Kamala Harris and quipped:“WHO said that? I want names @KamalaHarris.” According to Fox News, during her on-stage interview with journalist Kara Swisher, Harris stressed that she “couldn't do enough” because of the relatively short time that she had on her 2024 campaign trail. Notably, after the former vice president appealed that she wanted voters to not only see her background of who she is as a person, but also see her professional qualifications, Swisher intervened and asked:“That’s a decent resume, but go ahead.”To this, Kamala responded:“Well, some people have actually said I was the most qualified candidate ever to run for president… I'm just speaking fact.” Kamala Harris hints at possible 2028 Presidential runKamala Harris \"107 Days\" Book Tour (Image via Getty)According to Fox News, Kamala Harris also seemingly hinted that she would be running for President in 2028. During her interview last week, when Swisher asked whether she would be running for President in 2028, the former Vice President responded:“Maybe. Maybe not.”Meanwhile, the former vice president was also asked what policies she would focus on if she were to be elected President. She replied:“It’s much too early to have that conversation… I literally yesterday would not have known that this Department of Justice would have indicted the New York Attorney General, right?”Notably, Harris also took a jab at the current President of the US, Donald Trump and the Department of Justice. The 60-year-old told Swisher that she believed that the Democratic Party is responsible for dealing with the immediate needs of the American people and added:“I actually, in reflection, one of the things I would have done differently — and I talk about a few things but one of them on this topic — I really do think we should have done the families piece of ‘Build Back Better’ before we did the infrastructure and the CHIPS Act.”For the unversed, the former vice president has been out on a 15-city book tour in support of her memoir, titled 107 Days, which was published on September 23. Her tour reportedly kicked off in New York on September 24. Notably, her tour partnered her with independently owned bookstores across the United States. Kamala also reportedly stopped at the Masonic in San Francisco on October 5 for two events in collaboration with the Bay Area chain Book Passage. She will also be heading abroad for appearances in London and Toronto, and then wrapping up her book tour in Miami on November 20.","summary":"English broadcaster and journalist Piers Morgan recently shared his reaction after former Vice President of the United States Kamala Harris advocated for her Presidential run.","url":"https://www.sportskeeda.com/us/podcasts/i-want-names-piers-morgan-laughs-kamala-harris-viral-claim-most-qualified-candidate-ever-run-president","image":"https://staticg.sportskeeda.com/editor/2025/10/130c5-17606949297953-1920.jpg","video":null,"publish_date":"2025-10-17 21:03:53","author":"Afreen Shaikh","authors":["Afreen Shaikh"],"language":"en","category":"politics","source_country":"in","sentiment":-0.085},{"id":370262712,"title":"Tommy Tuberville slams Democrats for ‘demonizing’ young male voters after AOC ‘masculinity’ remarks backfire","text":"Rep. Alexandria Ocasio-Cortez, D-N.Y., had a highly scrutinized moment during Wednesday night's CNN town hall with Bernie Sanders, when the congresswoman addressed why she believed Republicans have more success garnering support among young men. \"They are able to radicalize, and target and exploit a generation of young boys, in particular, away from healthy masculinity, and into an insecure masculinity that requires a domination of others, who are poorer, browner, darker or a different gender than them,\" Ocasio-Cortez answered, garnering backlash on social media. Sen. Tommy Tuberville, R-Ala., an SEC-championship-winning football coach who coached at the high school and collegiate level for 40 years, responded to Fox News Digital when asked for his reaction to Ocasio-Cortez's statement. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"When I was coaching, I taught my players that this is the greatest country in the world and if you work hard, the sky is the limit for what you can achieve — no matter what you look like. Unfortunately, woke Democrats have spent the past 20 years telling young men they are ‘racist,’ ‘sexist,’ and ‘toxic’ simply for being men,\" Tuberville said. \"But it didn’t stop there — Democrats tried to prevent men from getting jobs just because of their skin color and also tried to baselessly cancel them during the ‘Me Too’ movement. It’s no wonder that more than half of the young men in this country voted for President Trump in the 2024 election. If Democrats don’t stop demonizing men, they may never win an election again.\" Tuberville, considered a leader of men during his coaching career, helped guide multiple successful college football and NFL players. Those players include quarterback Jason Campbell, running backs Carnell Williams and Ronnie Brown, and cornerback Carlos Rodgers. DEMOCRATIC PARTY SCRAMBLES TO FIX IMAGE AS MEMBERS ACKNOWLEDGE PARTY 'LOST CREDIBILITY' A September report from Decision Desk HQ (DDHQ) found that multiple indicators \"point to substantial Republican gains among Gen Z,\" particularly noting that Democratic registration among young men shrunk significantly compared to young women. The report found Democrat registration among young white men, historically around 49%, fell to 29%. A Fox News voter analysis for the 2024 election found that 55% of men voted for President Donald Trump, and 53% of men aged 18–44 voted for Trump, while 57% of men over age 44 voted for Trump as well. The Associated Press found that more than half of male voters under the age of 30 voted for Trump instead of former Vice President Kamala Harris — including roughly six-in-10 White male voters supporting Trump — about one-third of Black male voters supported Trump, as did about 50% of young Latino male voters. Trump's support among young Black and Latino male voters jumped by about 20% compared to his 2020 support, the AP reported. CLICK HERE TO GET THE FOX NEWS APP Democrats are spending $20 million on a study examining how to speak to \"American men\" after losing ground with the demographic during the 2024 election cycle, The New York Times revealed in May. The project, titled \"American Men: A Strategic Plan,\" will \"study the syntax, language and content that gains attention and virality in these spaces\" of male voters. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Sen. Tommy Tuberville criticized Rep. Alexandria Ocasio-Cortez&apos;s comments about young men, saying Democrats have spent years demonizing men as &quot;racist&quot; and &quot;toxic.&quot;","url":"https://www.foxnews.com/sports/tommy-tuberville-slams-democrats-demonizing-young-male-voters-after-aoc-masculinity-remarks-backfire","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/tommy-tuberville-aoc-split.jpg","video":null,"publish_date":"2025-10-17 20:52:55","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.037},{"id":370259204,"title":"Colbert’s sarcastic nod to new Paramount chief David Ellison on ‘National Boss’s Day’","text":"CBS late-night host Stephen Colbert, who will be out of a job next May, poked fun at his network’s new boss, David Ellison, on Thursday.\n\nDuring his opening monologue, “The Late Show with Stephen Colbert” host made a sarcastic dig at David Ellison, marking National Boss’s Day with a jab at the Paramount Skydance CEO.\n\n“I want to take a moment to celebrate my new boss, Paramount CEO David Ellison: Mr. Ellison, I love you,” Colbert said while looking into his “David Ellison Appreciation Cam.”\n\nEllison, previously CEO of Skydance Media, was named CEO of new joint company Paramount Skydance when his company merged with Paramount in August.\n\nThe merger between Skydance and CBS’s parent company came one month after CBS announced it would end Colbert’s show at the end of the current season in May 2026, citing financial reasons.\n\nDuring Thursday’s episode, the host joked that flattering Ellison might help him keep his show on the air a little longer.\n\nHe began, “I join you tonight in a celebratory mood because, as you know, today is National Boss’s Day. I hope you all treated your boss to their favorite gift — two minutes of awkward chitchat until the elevator arrives. Remember to say your kids’ names so they don’t have to.”\n\nAfter telling Ellison, “I love you,” Colbert winked and said, “That oughta buy us a couple more months.”\n\nThe announcement that Colbert’s show would end next year followed the network’s $16 million settlement with President Donald Trump in July, stemming from his lawsuit over an edited 2024 interview with then–Vice President Kamala Harris on “60 Minutes.”\n\nAt the time, Colbert called out his own employer on his show, alleging that CBS and Paramount gave in to Trump to secure regulatory approval for their merger with Skydance.\n\nHe said, “I believe this kind of complicated financial sentiment with a sitting government official has a technical name in legal circles. It’s ‘big fat bribe,’ because it all comes as Paramount’s owners are trying to get the Trump administration to approve the sale of our network to a new owner, Skydance!”\n\nProminent liberals have also criticized Ellison and his new joint company for purchasing independent outlet “The Free Press” earlier this month and naming its founder, Bari Weiss, the editor-in-chief of CBS News.","summary":"CBS late-night host Stephen Colbert, who will be out of a job next May, poked fun at his network’s new boss, David Ellison, on Thursday.","url":"https://nypost.com/2025/10/17/media/colberts-sarcastic-nod-to-paramounts-new-chief-on-national-bosss-day/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/113662278.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/LWVcNYo8-RyIcpnTz.mp4","publish_date":"2025-10-17 20:52:35","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":-0.14},{"id":370260680,"title":"Joe Concha says New Jersey governor’s race is now a ‘coin flip’","text":"“She gives these like [former Vice President Kamala Harris] word salad answers, whether she supports boys playing against girls in the state or how much she plans on raising taxes,” he said on Fox News.\n\nConcha said Sherrill also struggles to explain to voters why she didn’t walk at her Naval Academy graduation, and how she made $7 million in stock trading. \n\n“She simply cannot explain how she made $7 million while trading defense stocks, all while sitting on the armed services committee in the House, and that’s something voters don’t like on either side of the aisle,” Concha said. \n\nConcha said polling from the last New Jersey gubernatorial race showed Ciattarelli down 8 to 10 points this time four years ago. In this election, he is performing better. \n\n“He barely lost that race,” Concha said. “Now think about what he has going for him now: real name recognition, campaign experience, vulnerable opponent.”\n\nSherrill is ahead of Ciattarelli by 5 points among New Jersey likely voters, down from an 8-point lead in late September, according to a recent Fox News survey.\n\nConcha said the New Jersey governor’s race is going to be close. \n\n“This is now a coin flip in a profoundly blue state, especially when you consider how unpopular the Democratic Party is overall across the country,” he said.","summary":"Washington Examiner Senior Writer Joe Concha said Rep. Mikie Sherrill (D-NJ), the Democratic candidate for New Jersey governor, has been dropping in the polls “like a lead balloon” since Labor Day.&#160; He added that people started paying attention after Sherrill’s poor debate performances against her opponent, Republican candidate Jack Ciattarelli. “She gives these like [former [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3854895/joe-concha-new-jersey-governors-race-is-now-a-coin-flip-mikie-sherrill-polling-dropping/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP25281837230445.jpg?w=696","video":null,"publish_date":"2025-10-17 20:13:41","author":"Sydney Topf","authors":["Sydney Topf"],"language":"en","category":"politics","source_country":"US","sentiment":-0.245},{"id":370263200,"title":"Obama continues tradition of slow-rolled political endorsements as gubernatorial elections hit fever pitch","text":"Former President Barack Obama officially endorsed both Democrat candidates running in the only pair of gubernatorial elections this cycle, following the tradition of the former president holding his endorsement cards close to his chest in the lead-up to elections. \"Mikie’s integrity, grit and commitment to service are what we need right now in our leaders,\" Obama said in a video endorsement ad released Friday by Democratic New Jersey Rep. Mikie Sherrill's gubernatorial campaign. \"Mikie Sherrill is the right choice for your next governor. \"Mikie is a mom who will drive down costs for New Jersey families,\" Obama continued in the ad. \"As a federal prosecutor and former Navy helicopter pilot, she worked to keep our communities safe.\" New Jersey and Virginia are the only states holding gubernatorial elections in 2025's off-season election year, with Sherrill and former U.S. Rep. Abigail Spanberger of Virginia as the only Democrats in the running. OBAMA ENDORSES SPANBERGER, ATTACKS REPUBLICANS IN VIRGINIA GOVERNOR'S RACE ADS Obama endorsed Spanberger Thursday in a pair of ads that also took aim at Republicans for \"attacking abortion rights.\" \"Virginia's elections are some of the most important in the country this year. We know Republicans will keep attacking abortion rights and the rights of women. That’s why having the right governor matters, and I’m proud to endorse Abigail Spanberger,\" Obama said in an ad endorsing the Virginia Democrat. \"Republican policies are raising costs on working families so (that) billionaires can get massive tax cuts,\" he said in another ad endorsing Spanberger. Following Obama's endorsement of Spanberger, the Republican challenger in the race, current Virginia Lt. Gov. Winsome Earle-Sears' campaign told Fox Digital Thursday, \"Abigail Spanberger is scared, and it shows.\" THE ONLY GOP GUBERNATORIAL CANDIDATES RUNNING IN 2025 ELECTIONS LEAN INTO TRUMP'S MAGA CAMPAIGN TACTICS \"After losing support across Virginia, she’s leaning on liberal elites to try and save her collapsing campaign,\" Earle-Sears' press secretary, Peyton Vogel, said. \"This is a desperate play from a candidate who's run out of support, out of ideas and out of time. Voters see through it, and that’s why Winsome Earle-Sears is surging.\" New Jersey Republican Jack Ciattarelli's campaign also blasted the Obama endorsement in a comment to Fox News Digital Friday. \"If anything underscores the lack of enthusiasm around Mikie Sherrill’s arrogant, out-of-touch campaign, it’s that she thinks that endorsements by Barack Obama and Hillary Clinton actually matter to middle and working-class New Jerseyans who have been kicked in the teeth by eight years of one-party Democrat rule making our state more expensive and less safe,\" Ciattarelli campaign strategist Chris Russell told Fox News Digital. \"Spoiler alert: They don’t. If anything, it energizes our voters even more.\" Former Secretary of State Hillary Clinton attended fundraising events for both Democratic gubernatorial candidates in October. Since leaving the Oval Office, Obama typically has held his endorsement card close to his chest. He endorsed former Secretary of State Hillary Clinton in June 2016 following months of signaling support for Clinton without formally offering his endorsement. THE ONLY TWO DEMS RUNNING FOR GOVERNOR IN 2025 ARE FORMER ROOMMATES WITH MIRRORING POLITICAL CAREERS Obama remained coy during the 2020 election about whom he would endorse, saying he would not back anyone during the primary. As Democratic contenders such as former Indiana Mayor Pete Buttigieg, Sen. Elizabeth Warren of Massachusetts and Vermont Sen. Bernie Sanders dropped out of the race, Obama officially endorsed his former vice president, Joe Biden, after he became the party's presumptive nominee. Obama notably got more involved with the 2020 Biden campaign in its final weeks, holding his first in-person event amid the pandemic in Pennsylvania just days before the election. The 44th president called on Democrats to \"chill out\" during the 2020 primary season and wait to see which candidate would emerge successful in the primary process. \"There will be differences, but I want us to make sure that we keep in mind that relative to the ultimate goal, which is to defeat a president and a party that has, I think, taken a sharp turn away from a lot of the core traditions and values and institutional commitments that built this country,\" Obama said in 2019 at a Democrat fundraiser in California. \"Compared to that goal, the differences we're having right now are relatively minor. \"Everybody needs to chill out about the candidates,\" he added, \"but gin up about the prospect of rallying behind whoever emerges from this process.\" OBAMA, PELOSI, OTHER TOP DEMS RESISTED INSTANT HARRIS ENDORSEMENT CITING NEED TO 'EARN IT,' 'HIKING' EXCUSE During the unprecedented 2024 election cycle, Obama did not offer a formal, new endorsement of Biden's re-election run but did join him for campaign events. Biden ultimately dropped out of the race as concerns over his mental acuity and age mounted, with Obama again staying mum for days whether he would endorse then-Vice President Kamala Harris as the party's nominee. Biden dropped out of the race July 21, 2024, and endorsed Harris to run in his place that same day in a separate social media post. Obama and first lady Michelle Obama endorsed Harris in a video message July 26, 2024, as party members and political pundits awaited the Obamas' support with bated breath. TRUMP NOT ON BALLOT, BUT PRESIDENT FRONT AND CENTER IN 2025 ELECTIONS Harris published a memoir, \"107 Days,\" in September that detailed her short 2024 campaign cycle and noted in her book that Obama did not offer an immediate endorsement, instead advising that she has to \"earn\" the nomination and consider the \"timing\" of it. \"Saddle up! Joe did what I hoped he would do. But you have to earn it,\" Obama said when Harris spoke to him, according to the book. \"Michelle and I are supportive but not going to put a finger on the scale right now. Let Joe have his moment. Think through timing.\" CLICK HERE TO GET THE FOX NEWS APP Obama also endorsed former Virginia Gov. Terry McAuliffe's failed 2021 re-election campaign at the end of October 2024, as that election began losing ground to Republican Glenn Youngkin as education issues took center stage. The 2025 gubernatorial elections have teed up the two Democrats as potential leaders of the party if they prove fruitful in their races, following the Democrat Party's disarray from the losses at the 2024 ballot boxes that handed President Donald Trump a victory. Fox News Digital reached out to Obama's office for additional comment on the gubernatorial endorsements Friday but did not immediately receive a reply.","summary":"Former President Barack Obama officially backed both Democrats running in this year&apos;s only gubernatorial elections in New Jersey and Virginia after staying mum on the races.","url":"https://www.foxnews.com/politics/obama-continues-tradition-slow-rolled-political-endorsements-gubernatorial-elections-hit-fever-pitch","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/obama-endorsements-2.jpg","video":null,"publish_date":"2025-10-17 19:56:37","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":370263518,"title":"One of Biden’s Most Disastrous Decisions Is Finally Coming Home to Roost","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nPresident Donald Trump’s friends are trying to take control of TikTok’s algorithm—and with his help, they’re close to doing it. On Sept. 25, Trump announced a “deal” between TikTok parent ByteDance and a group of American investors, which Trump has indicated include conservative media titans Rupert Murdoch and Larry Ellison. The deal does not seem done, even though the administration is acting like it is.\n\nUntil the details get filled in, Democrats with any interest in having political power might consider doing two things. One is making a loud fuss about the transaction. The other is paying close attention to who put them in this predicament—specifically, Joe Biden and Democratic congressional leadership.\n\nIf the deal closes, it will be a long-term disaster for any left-of-center political project. Imagine Elon Musk’s takeover of Twitter, but on very powerful steroids. Twitter gave him agenda-setting power on an app that most elite political journalists will never quit. It also made him a kingpin and punched his ticket to serve as co-leader of the free world for several months. Whether X was a tool of mass political persuasion in the 2024 election is less clear, though. The platform is a black box now that Musk has taken it private, and it’s overrun with spam and A.I. accounts. It’s also orders of magnitude smaller than TikTok.\n\nA conservative takeover of TikTok will be a much bigger problem for American liberalism, and anything left of it, than X could ever be. The platform’s rapidly growing and news-hungry user base is somewhere well into the billions, compared with Twitter’s pre-Musk usage of around 230 million daily users. Of all the major social media apps, TikTok is the one whose success is most rooted in serving content to people via an algorithm, rather than having users pick what they look at. The app’s success influenced almost every other social media platform to take a similar approach. TikTok has limitless influence potential, which is why Trump is so keen for his pals to control it in the United States.\n\nAmazingly, it was Biden who set up these pins and left the bowling alley for Trump to knock them down. This feels like an inopportune time to point out an ex-president’s tactical failure around a social media app, as Trump throws the military at his own people and turns the American regulatory state into a shakedown operation. But that’s just the thing: For Democrats, this is an exceptionally bad time to give Trump de facto control of one of the most popular information platforms in world history. And giving it to him is exactly what Biden did.\n\nTikTok took off in the United States during Trump’s first term, thanks to Lil Nas X and a bunch of teenagers. Its Chinese ownership by Beijing-based ByteDance quickly drew the attention of China hawks, who thought that the Chinese Communist Party was using it for either illicit surveillance of Americans, party propaganda, or both. There is a good bit of evidence on the feed manipulation point, including that TikTok has intentionally made it harder for researchers to get a macro read on the platform. There is less on the surveillance point. TikTok has violated U.S. child privacy laws in the past, but that’s just in keeping with the proud tradition of countless American tech firms. It’s genuinely hard to tell how much of TikTok’s bad behavior around user data comes down to a foreign influence operation versus typical tech company greed and recklessness.\n\nIt was Trump, not Biden, who first gave real juice to the idea of the United States banning TikTok. In 2020, Trump threatened a ban as retaliation for China’s handling of the coronavirus. A few years and most of a presidential term later, both the House and Senate finally passed the ban, as part of a bigger foreign aid bill. Democrats helped out in both chambers, with 165 of them voting to advance it in the House and 46 (all but two) in the Senate. Biden signed it in April 2024, weeks before he walked on to a debate stage in Atlanta and took a lectern across from Trump. Why did Biden sign this bill? Or, for that matter, not intervene with his own party’s congressional leaders before it ever got to him? House Speaker Mike Johnson undoubtedly wanted to make it hard to avoid a TikTok ban when he roped it into the same bill as aid money to Israel and Ukraine. Could it have really been that easy? Apparently, yes.\n\nThe ban, absent ByteDance selling off TikTok, was to go into effect on Jan. 20, 2025, immediately before someone would be inaugurated for a fresh term. What happened next feels like a perfect storm but was not that hard to foresee. Biden withered before our eyes. Kamala Harris replaced him and lost. Trump, who campaigned with obvious blood thirst, returned to power almost exactly concurrently with the ban’s effective date. Shortly before the inauguration, TikTok went offline for American users, but left a note: that Trump had said he would “work with us on a solution to reinstate TikTok once he takes office. Please stay tuned!” The platform returned right after the inauguration, as Trump immediately made clear that the American government wouldn’t enforce the ban. The conservative justices of the Supreme Court (who had just upheld the law, along with the liberals) did not mind. Republicans in Congress didn’t mind either. Come to think of that, neither did Chuck Schumer. Trump has pushed back TikTok’s sell-by date four times so far as he’s angled for a deal that works for him.\n\nIn fairness, I had also been under the impression that laws were laws. But one of Biden’s many hubrises in 2024 was not seeing where this was all going, from his doomed campaign to the inauguration of an opponent who was always poised to take a mafioso approach to regulating mergers and acquisitions. Trump—the first president to publicly back a TikTok ban!—got to be its savior. “SAVING TIKTOK WHILE PROTECTING NATIONAL SECURITY” is the real title of a real executive order. All Trump had to do for it was not enforce a law that he had previously advocated for, and use the pressure of the state to get a favorable deal on whatever timeline he, personally, liked. What a sensational gift to get from his predecessor/successor.\n\nAs Biden exits public life, he has left the entire political left with a heap of trash to sift through. The previous status quo was that TikTok was controlled by a sleazy tech company that was a lot like our own homegrown sleazy tech companies, with some additional foreign policy concerns. The new status quo, if this deal closes, will be TikTok’s algorithm falling under the control of close allies of Trump’s who will unquestionably use it to promote right-wing speech at the expense of anything else. It is clear which of these situations is worse for American liberalism. Who did Biden think was going to buy TikTok, when he signed the deal compelling its divestiture? Which party’s billionaires had previously shown a bigger appetite for buying influential media platforms? What was the plan? Was Reid Hoffman going to buy it? Did Biden realize how ridiculous that sounds but decide to sign the bill anyway out of dutiful China hawkism? He had been moving in that direction even before he took office. Was there no other way to address national security questions than to try to force a sale, putting an amazing propaganda machine on the market for the right bidder?\n\nBecause this deal isn’t actually a deal yet—China hasn’t confirmed it, nor has ByteDance—there’s still a small window of time for Democrats to raise hell about it. That would be hard, however, given that the vast majority of the Democrats in Congress voted to let this happen. In that event, all Democrats can do is learn the right lessons—specifically, that you really can use the power of the state to compel the behavior you want from social media companies, and you don’t even have to be bashful about it. Republicans will (and do) accuse Democrats of colluding with social media companies to destructive ends. Why get the sizzle of the accusation without the steak of wielding government authority to put these companies under the control of people on your team?\n\nTrump’s allies are angling to maximize their control of legacy media outlets, and they’re doing well. The conglomerates that Trump’s friends have not already bought are under intense, nakedly partisan pressure from federal regulators. Most of the tech giants are either controlled by Trump’s ideological teammates (X), managed by executives who will do what Trump wants without too much pressure (Google, Meta, Microsoft), or run by people currently making their newspapers more right-wing in hopes of getting favorable treatment from the big man (Amazon). Conservatives are already doing a whale of a job taking over the American information environment. Democrats might consider reflecting on if they should have helped them take the biggest prize yet.","summary":"This is a bad time to give Trump de facto control of one of the most popular social media apps in history—and that’s exactly what Biden did.","url":"https://slate.com/technology/2025/10/tiktok-ban-biden-trump-conservatives-propaganda.html?via=rss","image":"https://compote.slate.com/images/7dc7d60d-329e-4225-a66a-26b2298afc88.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-10-17 19:37:52","author":"Alex Kirshner","authors":["Alex Kirshner"],"language":"en","source_country":"US","sentiment":-0.219},{"id":370268984,"title":"Wikipedia Editors Discuss Blacklisting CBS News After Bari Weiss Named Editor-In-Chief","text":"Following reports of former New York Times editor and the Free Press founder Bari Weiss being appointed editor-in-chief of CBS News, editors on Wikipedia began negatively slanting her page and those of CBS and the Free Press. This includes attempting to label Weiss as right-wing and slanted edits about a CBS settlement with President Donald Trump. Some suggested blacklisting CBS as a source in the future.\n\nNews about Weiss being appointed to leadership at CBS News first emerged on October 2 with the official announcement on October 6. The newly-merged parent company Paramount Skydance further announced its purchase of her Free Press outlet. Weiss previously worked as an opinion editor for the New York Times before resigning due to what she stated was relentless hostility from radical leftist co-workers. Her selection as editor-in-chief at CBS News reportedly sparked panic among left-wing journalists at CBS, though some apparently welcomed her leadership due to her pro-Israeli stance. CBS has faced numerous other difficulties this year that have also aroused unease at the outlet.\n\nDays after the announcement, Wikipedia editors began labeling Weiss and the Free Press as conservative, despite her identifying as centrist. Editor “Snokalok” added to her page a claim from left-wing New Republic that she was “anti-trans” among other labels. The edit was removed, but another editor subsequently inserted the “anti-trans” label citing LGBT advocacy media. Snokalok also pushed the label on Weiss at the CBS article itself, while claiming her appointment marked a right-ward shift, though this was partly undone. Snokalok’s profile page implicitly attacks Trump and references the false “Nazi salute” claim against Elon Musk. An editor’s attempt to label Weiss conservative was also undone.\n\nAnother editor added a paragraph to the article on the Free Press largely critical of its pro-Israeli stance and also repeatedly labeling it a conservative outlet. Self-proclaimed progressive Trump critic “Tataral” tried to label the outlet a “right-wing Internet blog” and suggested potential deletion of the outlet’s page, though this was undone an hour later for not complying with sources and past consensus. Tataral was previously involved in smearing Acting U.S. Attorney Ed Martin as “far-right” after he sent a letter requesting information about Wikipedia’s bias earlier this year. She also pushed “far-right” smears against Turning Point USA co-founder Charlie Kirk shortly after his assassination last month.\n\nFurther efforts were devoted to discrediting the Free Press and CBS. One editor added material claiming the Free Press falsely reported crime in Austin, Texas had gone up under a Democrat District Attorney when it had actually gone down. In fact, the article notes claims crime went down, but points out major crimes such as murder had risen under the DA’s tenure and cited critics attributing declines in lesser property offenses to declining prosecutions. A larger criticism section added by another editor to the page repeated the claims and others in the article accusing the outlet of misrepresenting the situation in Gaza.\n\nIn edits to the CBS article, an editor significantly expanded material about a lawsuit Trump filed against the network over deceptive editing of a 60 Minutes interview with then-Presidential nominee Kamala Harris, which ended with a settlement in Trump’s favor after a judge approved the suit for trial. The expanded material claimed the “lawsuit was widely described as frivolous by legal experts.” Cited was a CNN article, which linked to another CNN article citing three lawyers, including CNN’s own lawyer. A cited article in the Hill only described the case as being “on shaky ground” instead.\n\nMaterial added also included claiming as fact that the settlement with President Trump was due to needing FCC approval of the Paramount Skydance merger. However, the cited sources either don’t explicitly claim a connection or presented it as mere speculative opinion. Both Paramount and the FCC denied any connection between the two in several of the cited articles, but neither denial was included in the addition to the page. It also made unattributed claims about the settlement being a “blow to freedom of the press” despite the less opinionated sources cited attributing such claims to specific advocacy groups.\n\nWord of Weiss being appointed also prompted multiple discussions for potentially reviewing the current status of CBS under Wikipedia’s “reliable sources” policy central to its verifiability standards. One editor opening the discussion cited the “panic” among CBS journalists as a potential negative sign. Wikipedia’s “perennial sources” page currently colors CBS green, indicating it is considered “generally reliable” on the site. Discussions about “reliability” are the main vehicle by which Wikipedia editors have been purging conservative media including Breitbart News, reports of which went viral several weeks ago following an interview site co-founder Larry Sanger had with commentator Tucker Carlson when discussing his proposal for reform at the site.\n\nAlthough most editors advised a “wait-and-see” approach on CBS, with one outright mocking concerns, others were less hesitant. Editor “Monk of Monk Hall” stated Weiss heading CBS would impact its reliability and suggested collecting evidence for an eventual downgrade discussion. Monk was previously involved in spreading lies attacking Kirk prominently days after Kirk’s assassination. One editor responded to Monk with “evidence” against CBS, noting it now included reporting tied to the Free Press since the leadership move and also argued the outlet was not sufficiently critical of Israel. The same editor had added content seeking to discredit the Free Press to its page. Monk in turn criticized CBS for taking ICE reports credulously.\n\nSuch edits and comments fit a common pattern with Wikipedia blacklisting campaigns. Editors have frequently smeared numerous conservative outlets on their articles prior to pushing for them to be blacklisted, including in campaigns against Fox News and Breitbart News. Free Press is currently listed as a “marginally reliable source” where use is generally discouraged on the site. Attempts to further discredit it, while also tying it to CBS, could be used to build a case against CBS itself as some editors have already indicated.\n\nConcerns about Wikipedia’s bias against conservatives and Israel have prompted an investigation from the House Oversight Committee with bi-partisan members of Congress also inquiring about anti-Israeli bias. Earlier this month, Sen. Ted Cruz as Chair of the Senate Commerce Committee inquired particularly about the site’s sourcing blacklist. Stating Wikipedia was a “noble concept” in his letter to the owners of Wikipedia, Cruz lamented this made its systemic bias even more concerning, especially given its considerable influence on global information.\n\nT. D. Adler edited Wikipedia as The Devil’s Advocate. He was banned after privately reporting conflict of interest editing by one of the site’s administrators. Due to previous witch-hunts led by mainstream Wikipedians against their critics, Adler writes under an alias.","summary":"Following reports of former New York Times editor and the Free Press founder Bari Weiss being appointed editor-in-chief of CBS News, editors on Wikipedia began negatively slanting her page and those of CBS and the Free Press. This includes attempting to label Weiss as right-wing and slanted edits about a CBS settlement with President Donald Trump. Some suggested blacklisting CBS as a source in the future.\n\n\nThe post Wikipedia Editors Discuss Blacklisting CBS News After Bari Weiss Named Editor-In-Chief appeared first on Breitbart.","url":"https://www.breitbart.com/tech/2025/10/17/wikipedia-editors-discuss-blacklisting-cbs-news-after-bari-weiss-named-editor-in-chief/","image":"https://media.breitbart.com/media/2025/10/Bari-Weiss-is-in-charge-of-CBS-News-640x335.jpg","video":null,"publish_date":"2025-10-17 19:36:05","author":"T.D. Adler","authors":["T.D. Adler"],"language":"en","source_country":"US","sentiment":-0.397},{"id":370255150,"title":"Obama, aiming to boost Democrats in New Jersey and Virginia, endorses Sherrill and Spanberger","text":"By MIKE CATALINI and OLIVIA DIAZ, Associated Press\n\nTRENTON, N.J. (AP) — Barack Obama has endorsed the Democratic candidates for governor in New Jersey and Virginia, seeking to boost Mikie Sherrill and Abigail Spanberger ahead of high-stakes elections next month.\n\nThe two-term Democratic former president appears in digital ads for the candidates, who are running in the only governors races this year. The odd-year contests are seen as a barometer of how voters feel about President Donald Trump and Republicans who control Congress ahead of the 2026 midterms.\n\nSherrill faces Republican former Assembly member Jack Ciattarelli, who has been endorsed by Trump. The president participated in a telephone town hall for Ciattarelli ahead of his GOP primary win, and is expected to hold a tele-town hall for him again before the Nov. 4 election.\n\nSpanberger is up against Lt. Gov. Winsome Earle-Sears, who has embraced Trump but has not been endorsed by him. Spanberger is a former CIA case officer and served three terms in Congress, ending this year.\n\nObama specifically mentions the stakes in the video backing Spanberger, criticizing Republicans over tax cuts for the wealthy and for taking aim at abortion rights. He describes Virginia’s elections as “some of the most important in the country this year.”\n\nThe ad backing Sherrill in New Jersey mentions her background as a mom, Navy pilot and one-time federal prosecutor, a biographical sketch that’s been front and center throughout the campaign.\n\nObama’s endorsements come as Democrats have struggled with fundraising and intraparty debates since Kamala Harris’ loss to Trump last year. The party is eager to notch victories in the two Democratic-leaning states that Obama won twice, especially after Trump’s national victory last year. With voting already underway in both states, Democrats are eager to capitalize on anything that might get their voters to the polls.\n\nWhile Democrats have a registration edge in New Jersey and the state has been firmly Democratic in presidential and Senate contests, it has seesawed between the parties in races for governor. And Trump performed better in New Jersey last year than he did in 2016 or 2020.\n\nSherrill is seeking to succeed term-limited incumbent Phil Murphy, a fellow Democrat who defeated Ciattarelli in a closer-than-expected 2021 contest.\n\nIn Virginia, Republican Gov. Glenn Youngkin is also term limited. Peyton Vogel, press secretary for Earle-Sears’ campaign, called the Obama endorsement “a desperate play” and said Spanberger is “leaning on liberal elites” to try to save her campaign.\n\nA Spanberger campaign spokesperson said she is grateful to have Obama’s endorsement.\n\nMail ballots are already being turned in in New Jersey, which also has early in-person voting beginning next week. Early in-person voting is already underway in Virginia where people can also vote by absentee ballot.","summary":"Barack Obama has endorsed Democratic candidates Mikie Sherrill and Abigail Spanberger for governor in New Jersey and Virginia","url":"https://www.twincities.com/2025/10/17/obama-endorses-sherrill-spanberger/","image":"https://www.twincities.com/wp-content/uploads/2025/06/Trump_USAID_54995.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-17 19:08:35","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":370240126,"title":"Obama, aiming to boost Democrats in New Jersey and Virginia, endorses Sherrill and Spanberger","text":"By MIKE CATALINI and OLIVIA DIAZ, Associated Press\n\nTRENTON, N.J. (AP) — Barack Obama has endorsed the Democratic candidates for governor in New Jersey and Virginia, seeking to boost Mikie Sherrill and Abigail Spanberger ahead of high-stakes elections next month.\n\nThe two-term Democratic former president appears in digital ads for the candidates, who are running in the only governors races this year. The odd-year contests are seen as a barometer of how voters feel about President Donald Trump and Republicans who control Congress ahead of the 2026 midterms.\n\nSherrill faces Republican former Assembly member Jack Ciattarelli, who has been endorsed by Trump. The president participated in a telephone town hall for Ciattarelli ahead of his GOP primary win, and is expected to hold a tele-town hall for him again before the Nov. 4 election.\n\nSpanberger is up against Lt. Gov. Winsome Earle-Sears, who has embraced Trump but has not been endorsed by him. Spanberger is a former CIA case officer and served three terms in Congress, ending this year.\n\nObama specifically mentions the stakes in the video backing Spanberger, criticizing Republicans over tax cuts for the wealthy and for taking aim at abortion rights. He describes Virginia’s elections as “some of the most important in the country this year.”\n\nThe ad backing Sherrill in New Jersey mentions her background as a mom, Navy pilot and one-time federal prosecutor, a biographical sketch that’s been front and center throughout the campaign.\n\nObama’s endorsements come as Democrats have struggled with fundraising and intraparty debates since Kamala Harris’ loss to Trump last year. The party is eager to notch victories in the two Democratic-leaning states that Obama won twice, especially after Trump’s national victory last year. With voting already underway in both states, Democrats are eager to capitalize on anything that might get their voters to the polls.\n\nWhile Democrats have a registration edge in New Jersey and the state has been firmly Democratic in presidential and Senate contests, it has seesawed between the parties in races for governor. And Trump performed better in New Jersey last year than he did in 2016 or 2020.\n\nSherrill is seeking to succeed term-limited incumbent Phil Murphy, a fellow Democrat who defeated Ciattarelli in a closer-than-expected 2021 contest.\n\nIn Virginia, Republican Gov. Glenn Youngkin is also term limited. Peyton Vogel, press secretary for Earle-Sears’ campaign, called the Obama endorsement “a desperate play” and said Spanberger is “leaning on liberal elites” to try to save her campaign.\n\nA Spanberger campaign spokesperson said she is grateful to have Obama’s endorsement.\n\nMail ballots are already being turned in in New Jersey, which also has early in-person voting beginning next week. Early in-person voting is already underway in Virginia where people can also vote by absentee ballot.","summary":"Barack Obama has endorsed Democratic candidates Mikie Sherrill and Abigail Spanberger for governor in New Jersey and Virginia","url":"https://www.ocregister.com/2025/10/17/obama-endorses-sherrill-spanberger/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Trump_USAID_54995.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-17 19:08:35","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":370240820,"title":"Obama, aiming to boost Democrats in New Jersey and Virginia, endorses Sherrill and Spanberger","text":"By MIKE CATALINI and OLIVIA DIAZ, Associated Press\n\nTRENTON, N.J. (AP) — Barack Obama has endorsed the Democratic candidates for governor in New Jersey and Virginia, seeking to boost Mikie Sherrill and Abigail Spanberger ahead of high-stakes elections next month.\n\nThe two-term Democratic former president appears in digital ads for the candidates, who are running in the only governors races this year. The odd-year contests are seen as a barometer of how voters feel about President Donald Trump and Republicans who control Congress ahead of the 2026 midterms.\n\nSherrill faces Republican former Assembly member Jack Ciattarelli, who has been endorsed by Trump. The president participated in a telephone town hall for Ciattarelli ahead of his GOP primary win, and is expected to hold a tele-town hall for him again before the Nov. 4 election.\n\nSpanberger is up against Lt. Gov. Winsome Earle-Sears, who has embraced Trump but has not been endorsed by him. Spanberger is a former CIA case officer and served three terms in Congress, ending this year.\n\nObama specifically mentions the stakes in the video backing Spanberger, criticizing Republicans over tax cuts for the wealthy and for taking aim at abortion rights. He describes Virginia’s elections as “some of the most important in the country this year.”\n\nThe ad backing Sherrill in New Jersey mentions her background as a mom, Navy pilot and one-time federal prosecutor, a biographical sketch that’s been front and center throughout the campaign.\n\nObama’s endorsements come as Democrats have struggled with fundraising and intraparty debates since Kamala Harris’ loss to Trump last year. The party is eager to notch victories in the two Democratic-leaning states that Obama won twice, especially after Trump’s national victory last year. With voting already underway in both states, Democrats are eager to capitalize on anything that might get their voters to the polls.\n\nWhile Democrats have a registration edge in New Jersey and the state has been firmly Democratic in presidential and Senate contests, it has seesawed between the parties in races for governor. And Trump performed better in New Jersey last year than he did in 2016 or 2020.\n\nSherrill is seeking to succeed term-limited incumbent Phil Murphy, a fellow Democrat who defeated Ciattarelli in a closer-than-expected 2021 contest.\n\nIn Virginia, Republican Gov. Glenn Youngkin is also term limited. Peyton Vogel, press secretary for Earle-Sears’ campaign, called the Obama endorsement “a desperate play” and said Spanberger is “leaning on liberal elites” to try to save her campaign.\n\nA Spanberger campaign spokesperson said she is grateful to have Obama’s endorsement.\n\nMail ballots are already being turned in in New Jersey, which also has early in-person voting beginning next week. Early in-person voting is already underway in Virginia where people can also vote by absentee ballot.","summary":"Barack Obama has endorsed Democratic candidates Mikie Sherrill and Abigail Spanberger for governor in New Jersey and Virginia","url":"https://www.bostonherald.com/2025/10/17/obama-endorses-sherrill-spanberger/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Trump_USAID_54995.jpg?w=1024&h=732","video":null,"publish_date":"2025-10-17 19:08:35","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":370250638,"title":"Obama, aiming to boost Democrats in New Jersey and Virginia, endorses Sherrill and Spanberger","text":"TRENTON, N.J. (AP) — Barack Obama has endorsed the Democratic candidates for governor in New Jersey and Virginia, seeking to boost Mikie Sherrill and Abigail Spanberger ahead of high-stakes elections next month.\n\nThe two-term Democratic former president appears in digital ads for the candidates, who are running in the only governors races this year. The odd-year contests are seen as a barometer of how voters feel about President Donald Trump and Republicans who control Congress ahead of the 2026 midterms.\n\nSherrill faces Republican former Assembly member Jack Ciattarelli, who has been endorsed by Trump. The president participated in a telephone town hall for Ciattarelli ahead of his GOP primary win, and is expected to hold a tele-town hall for him again before the Nov. 4 election.\n\nSpanberger is up against Lt. Gov. Winsome Earle-Sears, who has embraced Trump but has not been endorsed by him. Spanberger is a former CIA case officer and served three terms in Congress, ending this year.\n\nObama specifically mentions the stakes in the video backing Spanberger, criticizing Republicans over tax cuts for the wealthy and for taking aim at abortion rights. He describes Virginia’s elections as “some of the most important in the country this year.”\n\nThe ad backing Sherrill in New Jersey mentions her background as a mom, Navy pilot and one-time federal prosecutor, a biographical sketch that’s been front and center throughout the campaign.\n\nObama’s endorsements come as Democrats have struggled with fundraising and intraparty debates since Kamala Harris’ loss to Trump last year. The party is eager to notch victories in the two Democratic-leaning states that Obama won twice, especially after Trump’s national victory last year. With voting already underway in both states, Democrats are eager to capitalize on anything that might get their voters to the polls.\n\nWhile Democrats have a registration edge in New Jersey and the state has been firmly Democratic in presidential and Senate contests, it has seesawed between the parties in races for governor. And Trump performed better in New Jersey last year than he did in 2016 or 2020.\n\nSherrill is seeking to succeed term-limited incumbent Phil Murphy, a fellow Democrat who defeated Ciattarelli in a closer-than-expected 2021 contest.\n\nIn Virginia, Republican Gov. Glenn Youngkin is also term limited. Peyton Vogel, press secretary for Earle-Sears’ campaign, called the Obama endorsement “a desperate play” and said Spanberger is “leaning on liberal elites” to try to save her campaign.\n\nA Spanberger campaign spokesperson said she is grateful to have Obama’s endorsement.\n\nMail ballots are already being turned in in New Jersey, which also has early in-person voting beginning next week. Early in-person voting is already underway in Virginia where people can also vote by absentee ballot.","summary":"TRENTON, N.J. (AP) — Barack Obama has endorsed the Democratic candidates for governor in New Jersey and Virginia, seeking to boost Mikie Sherrill and Abigail Spanberger ahead of high-stakes elections next month.","url":"https://www.thestar.com/news/world/united-states/obama-aiming-to-boost-democrats-in-new-jersey-and-virginia-endorses-sherrill-and-spanberger/article_8dcbf5ed-ddee-5a24-8a94-a45dffb69da3.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/13/d1392484-c0d5-5acb-96db-f253853c2ef2/68f2948915a73.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-10-17 19:05:31","author":"Mike Catalini And Olivia Diaz The Associated Press","authors":["Mike Catalini And Olivia Diaz The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.084},{"id":370229906,"title":"Dems’ biggest problem isn’t Mamdani and socialists — it’s the ‘moderates’ who cave to them","text":"When the history books are written, Zohran Mamdani will surely mark the start of a new chapter in American politics.\n\nHe looks likely to win the race for New York City mayor in November — yet even if he loses, socialists have won the fight for the soul of the Democratic Party.\n\nThis story won’t end well for anyone in America.\n\nRepublicans like me have been warning about the rise of socialism among Democrats for years.\n\nIn 2016, Bernie Sanders came closer to the party’s presidential nomination than many expected. In 2018, Alexandria Ocasio-Cortez was elected to Congress with the wind at her back.\n\nThat same wind carried Mamdani, an official member of the Democratic Socialists of America, to a crushing victory in this year’s mayoral primary.\n\nBut the real — and most alarming — shift is among “moderate” Democrats.\n\nInstead of steering their party down a different road, Joe Biden gave the socialist wing some of its biggest demands, from open borders to a massive expansion of the welfare state, to huge swaths of the Green New Deal and taxpayer-funded student loan forgiveness.\n\nNow former Vice President Kamala Harris and New York Gov. Kathy Hochul have both endorsed Mamdani, kowtowing to the left instead of offering an alternative. And Dem leaders like Chuck Schumer are too cowardly to openly oppose him.\n\nAn August Gallup poll showed that a staggering 66% of Democrats now favor socialism over capitalism.\n\nFor the first time since 2010, less than half of the party has a positive view of capitalism.\n\nYoung people in particular are flocking to the socialist banner because they’re desperate for a shot at the American Dream. Is it any wonder that they’re looking to politicians like Mamdani who promise to make life affordable?\n\nAs the mother of two kids in their 20s, I see my own children wondering how they’ll make it in America. It breaks my heart.\n\nThe irony is that socialism can’t give young people the relief they need. As Winston Churchill once said, “Socialism is the philosophy of failure, the creed of ignorance, and the gospel of envy,” and Mamdani’s policies will prove it again.\n\nEach city-run grocery store would cost millions of taxpayer dollars a year to stay open, even as they cripple small businesses that pay taxes today.\n\nHis free buses would cost $652 million year, at least. His free and subsidized child care would have an annual price tag of at least $6 billion.\n\nBut nothing is truly free, and while Mamdani is promising to hike taxes only on the very rich, there’s no way he can pay for his agenda without tax hikes on everyone.\n\nEuropean countries show who really pays for the kind of welfare state socialists want. Compared to Americans, the European middle class generally pays about $12,000 more per person in taxes, just to fund entitlements.\n\nYet by soaking the middle class, European countries have sabotaged their economies into stagnation.\n\nJoe Biden also proved that giving in to socialist demands hurts the people it purports to help: His multitrillion-dollar spending binge spiked inflation to its highest levels in four decades, while taking the national debt to a staggering $36 trillion.\n\nIf Mamdani wins and enacts even a portion of his agenda, New Yorkers will soon pay the price.\n\nBut the rest of America won’t be far behind. Democrats will move even further to the left, in a kind of socialist bidding war.\n\nToday, it’s tax the rich; tomorrow it will be abolish the rich (Mamdani has already said there should be no billionaires).\n\nToday, it’s rent control; tomorrow, it will be free rent and canceling mortgage debt.\n\nEven if Mamdani loses, I don’t see Democrats pulling themselves out of this socialist spiral.\n\nHochul said when endorsing Mamdani that she shares his desire for affordability, but if supposed moderates think socialism is the answer, then the Democratic Party is truly lost.\n\nThe American people’s only hope is for Republicans to offer a real alternative.\n\nRather than experiment with heavy-handed government meddling in the economy, we must show that government is largely the cause of the affordability crisis: The lack of housing in our cities. The rising cost of groceries. Student loans that can’t be paid off.\n\nWe need to state, without apology, that getting government out of the way is the only way to lift up the next generation.\n\nDemocrats are promising the opposite, and they’ll own the destruction that inevitably follows, in New York City and everywhere else.\n\nThe least Republicans can do is give Americans a better option.\n\nNikki Haley was a Republican presidential candidate in 2024, US Ambassador to the United Nations and governor of South Carolina.","summary":"He looks likely to win the race for New York City mayor in November — yet even if he loses, socialists have won the fight for the soul of the Democratic Party.","url":"https://nypost.com/2025/10/17/opinion/dems-biggest-problem-isnt-zohran-mamdani-socialists-its-moderates-who-cave-to-them/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/new-york-mayoral-candidate-zohran-113651309-e1760725597344.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-17 18:58:03","author":"Nikki Haley","authors":["Nikki Haley"],"language":"en","category":"politics","source_country":"us","sentiment":0.007},{"id":370233224,"title":"Trump renews lawsuit against New York Times","text":"US President Donald Trump has renewed his $15 billion defamation lawsuit against The New York Times, its reporters, and publisher Penguin Random House.\n\nTrump initially submitted a 85-page-long lawsuit against the paper last month, accusing it of lying about him for decades and serving as a mouthpiece for the “Radical Left Democratic Party.” He claimed the outlet was “one of the worst and most degenerate newspapers in the history of our country” and described its endorsement of his Democratic rival in 2024, Kamala Harris, as “the single largest illegal campaign contribution, EVER.”\n\nHowever, the original filing was dismissed as “decidedly improper and impermissible.” Judge Steven D. Merryday claimed it read more like a political attack than a legal argument and ordered Trump and his team to resubmit the complaint and make sure it does not exceed 40 pages.\n\nThe new complaint, filed on Thursday, is exactly 40 pages long and now lacks original passages on Trump’s 2024 election victory and the “Russia Collusion Hoax.” The name of a reporters listed in the original, Michael S. Schmidt, has also been dropped.\n\nTrump’s attorneys allege that statements made in The New York Times and the 2024 book Lucky Loser, published by Penguin Random House, were “malicious, defamatory, and disparaging” toward his reputation and career achievements. The suit seeks both financial damages and formal retractions of the claims.A spokesperson for Trump’s legal team has said the president is “continuing to hold the Fake News responsible through this powerhouse lawsuit.”\n\nNew York Times spokesperson Danielle Rhoades Ha responded by saying the paper “will not be deterred by intimidation tactics.”","summary":"Donald Trump has refiled a $15 billion NYT defamation suit against in Florida after a judge dismissed the original complaint \nRead Full Article at RT.com","url":"https://www.rt.com/news/626623-trump-renews-nyt-lawsuit/","image":"https://mf.b37mrtl.ru/files/2025.10/article/68f2684a203027349654e359.jpg","video":null,"publish_date":"2025-10-17 17:30:36","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.438},{"id":370203052,"title":"‘Big Mistake’: Kamala Harris Extends Olive Branch To Elon Musk After EV Summit Snub","text":"Kamala Harris said Wednesday it was a “big mistake” for the Biden White House to exclude Elon Musk from its 2021 electric-vehicle summit, calling on presidents to put “political loyalties” aside when celebrating American innovation.\n\nThe former vice president made the comments in a live interview at Fortune’s Most Powerful Women Summit in Washington, D.C., echoing a point she also makes in her new book, “107 Days.” Her remarks nod to a long-running rift sparked when Tesla was left off the guest list at the White House event. (RELATED: Prosecutor Who Let Tesla Vandal Off Easy Now Under DOJ Probe For Race-Based Policy)\n\n“I write in the book that I thought it was a big mistake to not invite Elon Musk when we did a big EV event,” Harris said. “I mean, here he is, the major American manufacturer of extraordinary innovation in this space — well, and in space — and the fact that he was not invite — on merit, a president of the United States, I believe, has to put aside political loyalties when they get in the way of what is actually… and should be a source of pride for us as Americans that we’re creating that technology and innovation.”\n\n“So I thought that was a mistake,” she continued. “And I don’t know Elon Musk, but I have to assume that that was something that hit him hard and had an impact on his perspective.”\n\nTesla, the country’s top EV maker, wasn’t invited when then-President Joe Biden hosted Detroit’s unionized automakers at the White House on Aug. 5, 2021 — a decision that fueled months of bad blood between the administration and Musk. Musk later met with senior Biden aides in January 2023 to discuss EVs and electrification, though he didn’t meet the president, according to the Associated Press.","summary":"'So I thought that was a mistake'","url":"https://dailycaller.com/2025/10/17/kamala-harris-elon-musk-ev-summit-joe-biden-big-mistake/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-2238215504-1-scaled-e1760719713855.jpg","video":null,"publish_date":"2025-10-17 16:59:49","author":"Daily Caller Staff","authors":["Daily Caller Staff"],"language":"en","source_country":"US","sentiment":-0.252},{"id":370198058,"title":"Illinois Gov. JB Pritzker wins blackjack pot of $1.4M in Las Vegas","text":"It figures that a billionaire would win big in Las Vegas.Illinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.The two-term Democrat, often mentioned as a 2028 presidential candidate, told reporters in Chicago on Thursday that he drew charmed hands in blackjack during a vacation with first lady MK Pritzker and friends in Sin City.“I was incredibly lucky,” he said. “You have to be to end up ahead, frankly, going to a casino anywhere.”IN CASE YOU MISSED IT | NCAA moves toward allowing athletes to bet on pro sportsPritzker, an heir to the Hyatt hotel chain, has a net worth of $3.9 billion, tied for No. 382 on the Forbes 400 list of the nation's richest people. A campaign spokesperson said via email that Pritzker planned to donate the money to charity but did not respond when asked why he hadn't already done so.Pritzker, who intends to seek a third term in 2026, was under consideration as a vice presidential running mate to Kamala Harris last year. He has deflected questions about any ambition beyond the Illinois governor's mansion. But he has used his personal wealth to fund other Democrats and related efforts, including a campaign to protect access to abortion.His profile has gotten an additional bump this fall as he condemns President Donald Trump's immigration enforcement in the Chicago area and the president's attempt to deploy National Guard troops there.The Pritzkers reported income of $10.66 million in 2024, mostly from dividends and capital gains. They paid $1.6 million in taxes on taxable income of $5.87 million.Pritzker is an avid card player whose charitable Chicago Poker Challenge has raised millions of dollars for the Holocaust Museum and Education Center. The Vegas windfall was a “net number\" given wins and losses on one trip, he said. He declined to say what his winning hand was.“Anybody who’s played cards in a casino, you often play for too long and lose whatever it is you won,” Pritzker said. “I was fortunate enough to have to leave before that happened.”","summary":"Illinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week. Read what his said about his trip to Las Vegas.","url":"https://www.scrippsnews.com/politics/illinois-gov-jb-pritzker-wins-blackjack-pot-of-1-4m-in-las-vegas","image":"https://ewscripps.brightspotcdn.com/dims4/default/3dd2b68/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F04%2F2a%2F939b3fe5462a91fc78d9a3a752fe%2Fap25289701549942.jpg","video":null,"publish_date":"2025-10-17 16:41:22","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.259},{"id":370206456,"title":"Ramaswamy Sees New Jersey Election as Way to ‘Pave the Path’","text":"Vivek Ramaswamy’s gubernatorial election in Ohio isn’t until next year, but in the meantime he’s looking to assist another Republican hopeful, this time in New Jersey. Voters in the Garden State will soon select a new governor to replace term-limited Democrat Phil Murphy. There’s a solid chance that will be Jack Ciattarelli, the Republican who came close to beating Murphy in 2021.\n\nOn Wednesday, Ramaswamy, who’s been campaigning throughout Ohio, joined Ciattarelli at the Saddle Brook Diner as part of Ciattarelli’s diner tour.\n\nGreeting Ramaswamy with “a warm New Jersey welcome,” Ciattarelli referred to the entrepreneur as “Mr. Ohio,” and “the next governor of the state of Ohio.”\n\nAddressing the enthusiastic crowd, Ramaswamy pointed out that “New Jersey is a state with a lot of Republicans who just don’t know yet that they’re actually Republicans!” He also referenced Ciattarelli’s endorsement from President Donald Trump, which Ramaswamy said “propelled [Ciattarelli] on this way to now unite this whole state.”\n\n“New Jersey, you guys are about to show this country how it’s done,” Ramaswamy continued before bringing up the state’s recent voting trends. “Just because your neighbors, or your friends, or the people you meet with at the diner used to think one way a few years ago, doesn’t mean it has to stay that way,” he offered to murmurs of agreement. \n\nWhile then Vice President Kamala Harris won New Jersey’s 14 electoral votes last year, her nearly 6-point win was significantly less than when former President Joe Biden won in 2020 by nearly 16 points. \n\nRamaswamy noted that the Republican Party is “not just about defeating the Left,” as “we already did that last year.” Instead, they’re “ready to save the country.” He framed the election as “not about right versus left, but right versus wrong” and what it means to be an American. Ramaswamy would later talk even more about what it means to be an American, just as he has done at other events.\n\n“Next year we’re celebrating the 250th anniversary,” Ramaswamy called to mind, relating this upcoming birthday to what he says is “a moral mandate, an obligation to our founders, to our country, to our history, to preserve that for another 250 years.” Ramaswamy stressed, “We’re doing a great job starting with what we won last November, but the next step is the states,” he reminded, differentiating the importance between handling issues in Washington, D.C., and the states.\n\nRamaswamy also referenced issues affecting New Jersey, including COVID-19, boys participating in girls’ sports, and rising costs as he promoted Ciattarelli as the “one man who is going to take this state of New Jersey to the next level, to show New York across the street, Mamdani’s New York City, how it’s actually done in the United States of America!” He would continue to draw contrasts between New York City under Democrat Zohran Mamdani and New Jersey under a Ciattarelli administration.\n\nRamaswamy also encouraged attendees to “back Jack,” with the crowd chanting along, as a way to “restore merit,” “bring down costs,” “restore freedom of speech,” “wake up the American dream,” and “make New Jersey great again.” Ramaswamy used that as a segue to note that the state is hungry for change.\n\nRamaswamy reminded the crowd he has his own gubernatorial race coming up next year, urging New Jersey to set an example. “We’re going to Ohio next year, but you’ve got to pave the path this year, we’re counting on you,” he told Ciattarelli.\n\nRamaswamy made similar comments to Fox News. He told the outlet that elections in New Jersey and Virginia would “set the table for even bigger and more decisive victories, hopefully in places like Ohio next year.”\n\nRamaswamy’s perhaps most important reminder came towards the end of his appearance with Ciattarelli, as they were beginning to take questions, and that was on the importance of voters turning out, especially for off-year elections. “We’re going to get the job done by showing up,” he said, pointing out it “doesn’t matter” that this isn’t a presidential year, since it is “a governor’s year. And if you’re successful here, you’re paving a path for 2026 across the country, showing them how we’re going to do this.”\n\nDuring his remarks, Ciattarelli not only expressed confident optimism about his own race, but down-ballot races to achieve a Republican majority in the state House. He acknowledged this hasn’t been the case in the Garden State for 30 years. “So,” he told Ramaswamy, “We’re going to win this race this year, we thank you for your help, and then we’re coming to Ohio to help you win.”\n\nThe New Jersey gubernatorial race between Ciattarelli and Democratic Rep. Mikie Sherrill is considered “Lean Democratic,” while Ohio’s is considered “Likely Republican.”","summary":"Vivek Ramaswamy&#8217;s gubernatorial election in Ohio isn&#8217;t until next year, but in the meantime he&#8217;s looking to assist another Republican hopeful, this time in New... Read More\n\n\nThe post Ramaswamy Sees New Jersey Election as Way to &#8216;Pave the Path&#8217; appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/10/17/ramaswamy-sees-new-jersey-election-way-pave-path/","image":"https://www.dailysignal.com/wp-content/uploads/2025/10/Ramaswamyfor1016-scaled.jpg","video":null,"publish_date":"2025-10-17 16:25:31","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","source_country":"us","sentiment":0.143},{"id":370178686,"title":"Gutfeld roasts Kamala Harris: Who are these 'some people'?!","text":"Gutfeld roasts Kamala Harris: Who are these 'some people'?! | Fox News Video\n\nto top close\n\nThis video is playing in picture-in-picture.\n\nOctober 17, 2025\n\nGutfeld roasts Kamala Harris: Who are these 'some people'?!\n\nGreg Gutfeld fires back at the former vice president's claim that she was the most qualified candidate to run for president.\n\nTHE GREG GUTFELD SHOW\n\nVOD-VERTICAL\n\nNOW - 12:30 PM\n\nFox News Channel\n\nOutnumbered\n\n12:00 PM - 1:00 PM\n\nAmerica Reports\n\n1:00 PM - 2:00 PM\n\nAmerica Reports\n\n2:00 PM - 3:00 PM\n\nFox Business Channel\n\nThe Big Money Show\n\n12:00 PM - 1:00 PM\n\nThe Big Money Show\n\n1:00 PM - 2:00 PM\n\nMaking Money with Charles Payne\n\n2:00 PM - 3:00 PM\n\nFox Weather Channel\n\nFox Weather\n\nLive Stream\n\nFox News Radio\n\nFOX News Radio Live Channel Coverage\n\nLive Stream\n\nFox News Channel Live\n\nWATCH LIVE: John Bolton in court after indictment for mishandling classified docs\n\nLive Stream","summary":"Greg Gutfeld fires back at the former vice president&apos;s claim that she was the most qualified candidate to run for president.","url":"https://www.foxnews.com/video/6382893708112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8daca380-97ac-4f84-b2c7-33d93760ecf4/7a67f72a-8215-47d2-8db9-f41941f3bd20/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-10-17 16:06:01","author":null,"language":"en","source_country":"us","sentiment":0.043},{"id":370190444,"title":"Graham Platner&#039;s Resurfaced Posts on Guns and Communism Spark Backlash","text":"Maine Senate candidate Graham Platner’s resurfaced social media posts on topics of guns, racism and communism sparked backlash.\n\nNewsweek reached out to Platner’s campaign for comment via email.\n\nWhy It Matters\n\nPlatner, a 41-year-old oyster farmer and political newcomer, has garnered national headlines for his progressive, populist campaign to take on longtime Republican Senator Susan Collins in Maine. He has earned the backing of progressive leaders like Senator Bernie Sanders and has raised millions of dollars so far. But unearthed social media posts, first reported by CNN, could threaten to upend his bid.\n\nThe stakes are high for Democrats hoping to reclaim control of the Senate, where Republicans hold a 53-47 majority. Maine, a state that backed former Vice President Kamala Harris by about 7 points last November, is one of the party’s best opportunities to flip a seat. But Collins is a formidable incumbent, having won in tough political climates in the past. The election is likely to become one of the most contested of the 2026 midterms.\n\nGraham Platner Social Media Posts—What He Wrote\n\nCNN reported several posts Platner made to Reddit about various political issues. Those posts were made as recently as 2021 and have since been deleted as Platner has distanced himself from his past remarks.\n\nIn one post, he said he “became older and became a communist” in a thread about whether people get more conservative when they get older. In another post, he wrote that his time in the military “radicalized him,” leaving him “significantly more left today.”\n\nA campaign photo of Maine Senate candidate Graham Platner.\n\n“It is difficult to see all that horror, as well as all the grift and corruption, and not find the entire thing utterly bankrupt,” he wrote, according to CNN. “I did used to love America, or at least the idea of it. These days I’m pretty disgusted by it all.”\n\nHe told CNN he no longer feels that disillusionment, but is still “very angry about the wars” he fought in.\n\nIn a separate post, he wrote, “Still got the guns though. I don’t trust the fascists to act politely.”\n\nElsewhere in a 2020 post titled, “White people aren’t as racist or stupid as Trump thinks,” he wrote, “Living in white rural America, I’m afraid to tell you they actually are.”\n\nHe told CNN, “I’m also a White guy and I don’t think I’m a racist. I don’t believe that. I’m sure I was just angry on the Internet about the state of things back then.”\n\nDan Shea, professor of political science at Colby College in Waterville, Maine, told Newsweek the report is a “bombshell.”\n\n“Platner has been making an impassioned plea for both sides to come together. There are hard issues facing Mainers, like health care, the cost of housing and good jobs. It’s not a partisan battle. So his pitch was for the voters to transcended partisan differences. But these revelations will drive away conservatives, certainly,” he said.\n\nIf he becomes the nominee, every Mainer will be familiar with those posts by next October, Shea said.\n\n“Could he still win? That’s hard to imagine, but he is tapping into something raw in the electorate — something Senator Collins might not appreciate. I guess stranger things have happened, especially in the age of Trump,” he said.\n\nHe is facing several other candidates in the Democratic primary, including Governor Janet Mills, who has earned support from many in the party’s more moderate wing.\n\nPlatner’s Social Media Posts Spark Backlash\n\nPlatner has faced a wave of backlash from both Republicans and Democrats over the posts.\n\n“I’m old to enough to remember when Graham Platner proclaimed he can talk to Trump supporters because they’re his neighbors. He actually thinks they’re ‘racist’ and ‘stupid,’” posted Nick Puglia, a spokesperson for the National Republican Senatorial Committee, to X.\n\nNew York Post columnist Karol Markowicz wrote to X, “This is the Democrat running against Susan Collins in Maine. He’s been portrayed as an everyman, blue collar guy.”\n\nSome Democrats also criticized Platner over the posts.\n\n“Can we stop this idiotic hero worship now? Younger does not equal better in every instance. In some cases, yes! But it is important to evaluate every candidate on the merits. I hate seeing the Dems be just as guilty of the cult of personality that is so prevalent on the right,” posted Democratic strategist Jennifer Holdsworth.\n\n“The real problem is we can’t afford to keep running unvetted shapeshifters whose web videos make msnbc viewers and bluesky doom scrollers feel good about themselves but are completely unacceptable to persuadable voters. how many times do we have to do this?” posted consultant Caitlin Legacki.\n\nOthers defended him.\n\n“I refuse to clutch my pearls over Reddit comments when 4chan is in the White House,” posted Stefan Smith, head of digital engagement for the American Civil Liberties Union.\n\nPollster Adam Carlson wr...","summary":"Platner&#039;s resurfaced Reddit posts are a &quot;bombshell&quot; for his campaign to unseat Senator Susan Collins, one expert told Newsweek.","url":"https://www.newsweek.com/graham-platners-resurfaced-posts-guns-communism-spark-backlash-10896327","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/Copy-of-32-image-34.png?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-17 15:58:18","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.196},{"id":370176238,"title":"Meghan and Harry's celebrity-led PR offensive reveals the true depths of their identity crisis: SHARON HUNT","text":"The linen shirts have been tucked away, the baking tins are back in the cupboard, and Netflix has stopped filming slow-motion shots of chicken feeding. Presumably someone else is scattering organic seeds for the hens now.\n\nInstead, royal watchers have spent the past fortnight captivated by Meghan Markle's high-glamour comeback.\n\nIn just two weeks, the archetypal Californian housewife has made a splash in Paris with a surprise front-row Fashion Week appearance, scooped up an award, wined and dined with celebrity pals in the Big Apple, and breezed into Washington, D.C., to deliver a keynote address.\n\nSo, will the real Duchess of Sussex please stand up?\n\nUntil recently, the former Suits actress seemed to be cultivating a sort of Martha Stewart-inspired public image rooted in wholesome homemaking, courtesy of her series With Love, Meghan and social media posts.\n\nThink As Ever jam jars, edible flowers, and a steady stream of rosé.\n\nDare I say it, even the trad wives were living for it.\n\nMeanwhile, her husband Prince Harry has taken a different route, continuing to evolve into the space of a pseudo-royal.\n\nWith tell-all memoirs and snippy interviews in the rearview mirror, the prince has returned to the kind of humanitarian work he championed before his move to the U.S.\n\nDuring a recent trip to London, he resembled the Harry of old as he animatedly chatted with hospital staff and young patients in his role as WellChild patron.\n\nThere was even an olive branch extended from the Sussexes, with reports that Harry's camp had offered to share his diary of engagements with the main branch of the Royal Family to avoid awkward clashes.\n\nYet, just as it seemed Meghan and Harry had finally settled into new roles in 2025, a fresh identity crisis appears to be brewing.\n\nTheir latest brand refresh? A return to the glitz and glamour of the celebrity A-list.\n\nIt started, of course, with that front row appearance at the Balenciaga show. \n\nFor those in the farrr-shun know, Balenciaga is a top-tier design house - so Meghan's attendance as the brand's surprise reveal guest is a coup on all sides. \n\nIndeed, reports from the runway show suggested that all eyes were on the duchess.\n\nAfterwards, Meghan suggested that Balenciaga's Creative Director, Pierpaolo Piccioli, had personally invited her to the runway show as 'the culmination of many years of… friendship'.\n\nYet a later interview with Piccioli painted a rather different picture.\n\nPierpaolo said that Meghan - with whom he's exchanged text messages intermittently over the years - reached out to ask if she could attend the October 4 runway show, effectively inviting herself.\n\nNevertheless, the fabulous life of a jet-setting A-lister must roll on. Meghan - now with husband Harry in tow - headed next to New York City.\n\nThe reason for the trip was to receive an award at the Project Healthy Minds gala.\n\nDonning his-and-hers black two-piece suits, the elegant couple walked the red carpet before proudly accepting the Humanitarians of the Year accolade.\n\nWhile it's not an Emmy, we're sure it'll still look great on the mantlepiece.\n\nWhile in New York, the couple embraced true celebrity style.\n\nMeghan and Harry were spotted – not once, but twice – at exclusive members club Soho House.\n\nOne outing saw the royal couple grab lunch with Serena Williams. On another evening, they were seen dining with Ed Sheeran.\n\nNaturally, these outings were documented by the ever-present media posted outside Soho House.\n\nStill, it's hard to ignore that the Sussexes' star-studded circle remains much the same as it ever was, and they don't seem to be expanding their celebrity Rolodex.\n\nAdding to the glamour of the past few days, Chrissy Teigen also chimed in with an unexpected endorsement to remind everyone how kind and down-to-earth Meghan is. \n\n'It is insane to me how polarising she is for so many different people, when she really is just such a kind, good person that wants the best for all her friends and the best for people around her, and the best for her own relationship and for her children,' Chrissy told People magazine.\n\nWhether a nod from Chrissy - herself arguably as divisive as Meghan - will win hearts and minds remains to be seen, however.\n\nThe celebrity makeover kept on rolling with yet another headline-worthy appearance.\n\nDays later, Meghan joined the likes of Kamala Harris and Selena Gomez in Washington, D.C., to attend Fortune's annual Most Powerful Women Summit.\n\nLooking business chic in an all-white ensemble, she took to the stage on October 14 to reflect on her lifestyle brand and entrepreneurial endeavours.\n\nFashion shows, Soho House, women's summits - this all certainly sounds like the bingo card of a bona fide Hollywood A-lister.\n\nWith impeccable timing, royal commentator Jennie Bond mused this week that her interpretation of Harry and Meghan was that they have 'moved on from their royal roles' – and are instead leaning into all the glitz and glamour.\n\n'They are now full-blown celebrities,' she declared to The Mirror.\n\nHow full-blown? Well, that all depends on how well this latest celebrity-led PR offensive to shoot Meghan and Harry onto the A-list pans out.\n\nAfter all, we've seen countless reinventions of Meghan - from Hollywood star to royal, advocate to Netflix homemaker, and now back to Hollywood. It's becoming hard to keep up.","summary":"Forget the linen shirts and baking tins from her Netflix days - Meghan Markle, with Prince Harry in tow, is clearly embracing a bold, celebrity-driven makeover.","url":"https://www.dailymail.co.uk/femail/article-15189441/Meghan-Markle-Prince-Harry-celebrity-transformation.html","image":"https://i.dailymail.co.uk/1s/2025/10/15/23/103025253-0-image-a-24_1760567397986.jpg","video":null,"publish_date":"2025-10-17 15:25:47","author":"Editor,Sharon Hunt","authors":["Editor","Sharon Hunt"],"language":"en","source_country":"gb","sentiment":0.28},{"id":370186826,"title":"Stephen Colbert sarcastically salutes Paramount’s new chief on 'National Boss’s Day'","text":"CBS late-night host Stephen Colbert, who will be out of a job next May, poked fun at his network’s new boss, David Ellison, on Thursday. During his opening monologue, \"The Late Show with Stephen Colbert\" host made a sarcastic dig at David Ellison, marking National Boss’s Day with a jab at the Paramount Skydance CEO. \"I want to take a moment to celebrate my new boss, Paramount CEO David Ellison: Mr. Ellison, I love you,\" Colbert said while looking into his \"David Ellison Appreciation Cam.\" FCC APPROVES PARAMOUNT-SKYDANCE MERGER FOLLOWING TRUMP SETTLEMENT, COLBERT CANCELLATION Ellison, previously CEO of Skydance Media, was named CEO of new joint company Paramount Skydance when his company merged with Paramount in August. The merger between Skydance and CBS’s parent company came one month after CBS announced it would end Colbert’s show at the end of the current season in May 2026, citing financial reasons. During Thursday’s episode, the host joked that flattering Ellison might help him keep his show on the air a little longer. BARI WEISS JOINS CBS NEWS AS EDITOR-IN-CHIEF, PARAMOUNT BUYS FREE PRESS FOR $150 MILLION He began, \"I join you tonight in a celebratory mood because, as you know, today is National Boss’s Day. I hope you all treated your boss to their favorite gift — two minutes of awkward chitchat until the elevator arrives. Remember to say your kids’ names so they don’t have to.\" After telling Ellison, \"I love you,\" Colbert winked and said, \"That oughta buy us a couple more months.\" The announcement that Colbert’s show would end next year followed the network’s $16 million settlement with President Donald Trump in July, stemming from his lawsuit over an edited 2024 interview with then–Vice President Kamala Harris on \"60 Minutes.\" CLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS At the time, Colbert called out his own employer on his show, alleging that CBS and Paramount gave in to Trump to secure regulatory approval for their merger with Skydance. He said, \"I believe this kind of complicated financial sentiment with a sitting government official has a technical name in legal circles. It’s ‘big fat bribe,’ because it all comes as Paramount’s owners are trying to get the Trump administration to approve the sale of our network to a new owner, Skydance!\" Prominent liberals have also criticized Ellison and his new joint company for purchasing independent outlet \"The Free Press\" earlier this month and naming its founder, Bari Weiss, the editor-in-chief of CBS News. CLICK HERE TO GET THE FOX NEWS APP","summary":"&quot;The Late Show&quot; host Stephen Colbert joked about loving Paramount CEO David Ellison after CBS announced his show will end in May 2026.","url":"https://www.foxnews.com/media/stephen-colbert-sarcastically-salutes-paramounts-new-chief-national-bosss-day","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/colbert-ellison-cbs.jpg","video":null,"publish_date":"2025-10-17 15:14:31","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":-0.079},{"id":370156860,"title":"Americans’ Approval Of Trump’s Handling Of Israel-Hamas War Surges Following Peace Deal, Poll Shows","text":"Americans’ approval of President Donald Trump’s handling of the Israel-Hamas war has risen significantly since April, according to an Emerson College poll released Friday.\n\nTrump announced on Oct. 8 that he had negotiated a deal between Israel and Hamas securing the release of the remaining hostages and the withdrawal of Israeli forces. In the immediate aftermath of Trump brokering the ceasefire deal, 47% — a plurality — of voters approved of his handling of the war between Israel and Hamas, while 34% disapproved, according to the poll. (RELATED: Alyssa Farah Griffin Fails To Keep Her Promise Of Wearing MAGA Hat After Trump’s Success In Middle East)\n\nThis marks a double-digit change from Emerson College’s April 30 poll, when only 30% of respondents expressed approval of the president’s handling of the Israel-Hamas war and 46% disapproved.\n\n“Republicans generally approve of Trump’s handling of the war between Israel and Hamas at 80% to 7%, while Democrats disapprove 57% to 19%,” Spencer Kimball, executive director of Emerson College Polling, said in a statement. “The shift in overall approval comes from independents, who approve 43% to 38%; in April, independents disapproved 43% to 25%.”\n\n“While voters’ attitudes on Trump’s handling of the war between Israel and Hamas have shifted, it doesn’t appear to have impacted his overall job approval,” Kimball added. “Instead, the president’s disapproval increased by a point since August.”\n\n 🚨 BREAKING: Israel, Hamas agree to initial peace plan steps, Trump says. pic.twitter.com/cG1grMcQWn — Daily Caller (@DailyCaller) October 8, 2025 \n\nThough, voters were divided on whether Trump’s second term as president has been more of a success or failure. Of those surveyed, 50% said they view his second term in office as a success and 50% said they think it is a failure.\n\nMoreover, 54% of voters do not think the president deserves the Nobel Peace Prize for his actions in Israel and Gaza, while 38% think he does deserve the prize, according to the survey.\n\nSenate Minority Leader Chuck Schumer on Monday celebrated Trump’s clinching the Middle East peace deal, saying in a statement that he applauds the “enormous advocacy of the tireless hostage families, President Trump, his administration, and all who helped make this moment happen.” Additionally, former Vice President Kamala Harris commended Trump’s peace deal in a Monday statement posted to X, writing that she commends “the leaders and partners whose efforts made this agreement possible, including the president and his team.”\n\nSome Palestinians are reportedly concerned that Hamas may not uphold the terms of Trump’s Middle East peace plan.\n\nThe Emerson College survey was conducted Oct. 13 to 14, 2025. The sample size was 1,000 U.S. registered voters, and the poll’s margin of error was plus or minus 3 percentage points. \n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'shift in overall approval'","url":"https://dailycaller.com/2025/10/17/trump-israel-hamas-war-peace-deal-poll-emerson-college/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-2240136359-scaled-e1760709539492.jpg","video":null,"publish_date":"2025-10-17 14:29:27","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"us","sentiment":-0.051},{"id":370148386,"title":"Stephen Miller is selling his home after his wife said they would ‘not back down’ from sidewalk chalk messages","text":"Stephen Miller, the architect of Trump’s hardline immigration policy, is selling his home after protestors left a series of chalk messages on the sidewalk outside his property. \n\nHis wife, Katie Miller, previously said that the family “will not back down” in the face of the peaceful protests centered around her husband’s political activities. \n\nThe house, which is spread across nearly 6000 square feet, is based in an affluent Arlington neighborhood in Virginia and is listed for $3.75 million. \n\nThe listing shows that the custom-built home, which has a “Southern California aesthetic” inside, was sold as new to the Millers in 2023. It was purchased for $2.875 million. \n\nThe home was listed for sale on October 7, with a neighborhood civic association newsletter declaring that the “Millers have moved.”\n\nMiller is a key figure in the Trump administration and a driving force in the government’s hardline immigration crackdown. \n\nJust this month, his own cousin, Alisa Kasmer, said that her relative is the “face of evil” and wrote that she feels that she must “grieve what you’ve become.”\n\nHis aggressive views on immigration have also been highly controversial in the public sphere, prompting protestors to peacefully write messages such as “stop the kidnapping” outside of his home. \n\nOther messages included “trans rights are human rights,” “DEI enriches us all,” “Hate has no home in Arlington,” “Stephen Miller is destroying democracy,” and “We love immigrants.”\n\nKatie Miller shared a video of her removing the messages with a garden hose on September 14. The post came just days after the assassination of far-right activist Charlie Kirk.\n\n“To the ‘Tolerant Left’ who spent their day trying to intimidate us in the house where we have three young children: We will not back down,” Katie Miller wrote. “We will not cower in fear. We will double down. Always, For Charlie.”\n\nThe family’s Arlington home has six bedrooms, according to the property’s listing. It also has a “boutique style dressing room,” a “spa-inspired bath,” and “comprehensive security.”\n\nArlington largely leans towards the Democratic Party during elections, with Arlington County Democratic Committee chair Steve Baker claiming that 78 percent of the county cast their ballot for Kamala Harris in 2024. \n\nThe Independent has contacted Stephen Miller’s realtor, Daniel Heider, for comment.","summary":"The house, which is nearly 6000 square feet in size, is based in an affluent Arlington neighborhood in Virginia and is listed for $3.75 million","url":"https://www.independent.co.uk/news/world/americas/us-politics/stephen-miller-arlington-home-katie-b2847407.html","image":"https://static.independent.co.uk/2025/10/09/22/Trump_Antifa_09216.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/Ep0MGOgY-OhrQWqOm.mp4","publish_date":"2025-10-17 14:20:52","author":"Owen Scott","authors":["Owen Scott"],"language":"en","source_country":"gb","sentiment":-0.137},{"id":370148378,"title":"Fired Stephen Colbert professes his ‘love’ for new CBS boss David Ellison: ‘That oughta buy us a couple more months’","text":"Stephen Colbert kicked off The Late Show Thursday with a sarcastic jab at his soon-to-be former boss, expressing his “love” for Paramount Skydance chief David Ellison while quipping that he just bought his canceled show a “couple more months.”\n\nColbert, whose decade-plus run with CBS wraps up next May, opened the show by acknowledging that it was a special occasion that he wanted to commemorate with his studio audience. \n\n“I join you tonight in a celebratory mood because, as you know, today is National Boss’ Day,” the Emmy-winning host began. “I hope you all treated your boss to their favorite gift — two minutes of awkward chitchat until the elevator arrives. Remember to say your kids’ names so they don’t have to.”\n\nThe late-night comic then turned directly to the camera – where his face was suddenly framed within a graphic labeled the “David Ellison Appreciation Cam,” and a photo of the smiling CEO was superimposed in the bottom corner of the screen.\n\n“I want to take a moment to celebrate my new boss, Paramount CEO David Ellison,” Colbert gleefully declared. “Mr. Ellison, I love you.”\n\nAfter taking a beat to soak up some laughs, Colbert then tossed in his kicker. “That oughta buy us a couple more months,” he joked, prompting more applause.\n\nColbert, naturally, was referencing the impending end of his show this coming spring and his departure from the network he’s called home since 2015. Colbert’s exit was announced by Paramount this past July. \n\nDespite The Late Show being the top-rated broadcast late-night program, Paramount said it was pulling the plug on the franchise due to it supposedly losing $40 million annually amid dwindling ad revenues and a shifting media environment, calling it “purely a financial decision.” Colbert and other late-night hosts – specifically ABC’s Jimmy Kimmel – have questioned claims of the show’s financial losses, suggesting that the cancellation had more to do with other factors.\n\nIndeed, the decision to cancel Colbert – an outspoken critic of President Donald Trump – came just days before the Trump administration approved Paramount’s $8 billion merger with Ellison’s Skydance media company. The cancellation was also announced weeks after Paramount paid Trump $16 million to settle a “meritless” lawsuit over a 60 Minutes interview with Trump’s White House rival, Kamala Harris, which the company claimed was unrelated to the merger.\n\nAfter Paramount canceled the late-night show and said Colbert would be leaving the network, CBS staffers told The Independent that they didn’t believe the company’s claim of a “financial decision”, and instead saw it as a continuation of the “Trump shakedown” that had begun with the settlement.\n\nThe demise of Colbert’s show is part of a Democratic-led investigation into the merger, and whether Ellison and Paramount violated anti-bribery statutes. Besides the cancellation of the show, which was cheered by Trump and his handpicked FCC chairman Brendan Carr, House Democrats are also looking into the 60 Minutes settlement; Trump’s claim that he struck a “side deal” with Ellison; and pre-merger concessions that Skydance gave to the FCC.\n\nSince officially taking over Paramount in August, Ellison has come under fire from CBS News staffers over their belief that he “lied” to them after his pledge not to “politicize” the network.\n\nWith the president repeatedly heaping praise on David Ellison - whose father is Oracle founder and top Trump ally, the billionaire Larry Ellison - much of the newsroom has been “literally freaking out” over the CEO's latest moves impacting CBS News, feeling that he’s pushing the network to the right to appease the White House.\n\nAfter hiring a former Trump appointee and conservative think tank leader to serve as the network’s ombudsman and revamping its Sunday news show’s editing rules following complaints from the White House, David Ellison announced last week that he had hired Bari Weiss as CBS News editor-in-chief and purchased her anti-woke digital outlet ,The Free Press, for $150 million.\n\nWhile Weiss has already caused some staffers to literally roll their eyes and compare her to Elon Musk during her first week at the helm, at least one senior news executive has already decided to resign amid the flurry of changes at the Tiffany Network.","summary":"‘Mr. Ellison, I love you,’ Stephen Colbert joked on Thursday night","url":"https://www.independent.co.uk/news/world/americas/stephen-colbert-paramount-david-ellison-b2847410.html","image":"https://static.independent.co.uk/2025/10/17/13/34/the-late-show-with-stephen-colbert-(4).jpg?width=1200","video":"https://cdn.jwplayer.com/videos/cK9h4Q7B-OhrQWqOm.mp4","publish_date":"2025-10-17 13:57:33","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.4},{"id":370173088,"title":"Trump Refiles $15b Defamation Lawsuit Against New York Times","text":"US President Donald Trump has refiled a $15 billion defamation lawsuit against The New York Times, court documents show, weeks after it was thrown out by a federal judge.\n\nTrump has intensified his long-established hostility toward the media since his return to the White House and the suit is one of numerous attacks against news organizations he accuses of bias against him.\n\nThe Times complaint was thrown out in September because District Judge Steven Merryday took exception to its florid writing, repetitive and laudatory praise of Trump and its excessive 85-page length.\n\nREAD ALSO: Former Trump Adviser John Bolton Indicted For Mishandling Classified Info\n\nThe suit filed Thursday in Florida and seen by AFP runs to less than half the length, at 40 pages.\n\nIt takes aim at “false, defamatory, and malicious publications”, highlighting a book and two Times articles.\n\nThe lawsuit named the newspaper, three Times reporters and the publisher Penguin Random House as defendants.\n\nIt accuses them of making defamatory statements against Trump “with actual malice.”\n\n“The statements in question wrongly defame and disparage President Trump’s hard-earned professional reputation, which he painstakingly built for decades” before entering the White House, the lawsuit says.\n\nThe court was asked to grant compensatory damages of not less than $15 billion and additional punitive damages “in an amount to be determined upon trial.”\n\nTrump’s attacks on media outlets have seen him restrict access, badmouth journalists critical of his administration, and bring lawsuits demanding huge amounts of compensation.\n\nIn July, Trump sued media magnate Rupert Murdoch and The Wall Street Journal for at least $10 billion after it reported on the existence of a book and a letter he allegedly sent to sex offender Jeffrey Epstein.\n\nParamount settled Trump’s lawsuit over election coverage on CBS News’ flagship show “60 Minutes” for $16 million the same month. He had alleged that the program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favor.","summary":"The suit is one of numerous attacks against news organizations US President, Donald Trump, accuses of bias against him.\n\n\nThe post Trump Refiles $15b Defamation Lawsuit Against New York Times appeared first on Channels Television.","url":"https://www.channelstv.com/2025/10/17/trump-refiles-15b-defamation-lawsuit-against-new-york-times/","image":"https://www.channelstv.com/wp-content/uploads/2025/09/tr.jpg","video":null,"publish_date":"2025-10-17 13:19:14","author":"Channels Television","authors":["Channels Television"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.395},{"id":370133420,"title":"Trump refiles $15 billion defamation lawsuit against New York Times","text":"U.S. President Donald Trump has refiled a $15 billion defamation lawsuit against The New York Times, court documents show, weeks after it was thrown out by a federal judge. \n\nMr. Trump has intensified his long-established hostility toward the media since his return to the White House and the suit is one of numerous attacks against news organisations he accuses of bias against him. \n\nThe Times complaint was thrown out in September because District Judge Steven Merryday took exception to its florid writing, repetitive and laudatory praise of Mr. Trump and its excessive 85-page length. \n\nThe suit filed on Thursday (October 17, 2025) in Florida and seen by AFP runs to less than half the length, at 40 pages. It takes aim at “false, defamatory, and malicious publications”, highlighting a book and two Times articles. \n\nThe lawsuit named the newspaper, three Times reporters and the publisher Penguin Random House as defendants. It accuses them of making defamatory statements against Mr. Trump “with actual malice.” \n\n“The statements in question wrongly defame and disparage President Trump’s hard-earned professional reputation, which he painstakingly built for decades” before entering the White House, the lawsuit says. \n\nThe court was asked to grant compensatory damages of not less than $15 billion and additional punitive damages “in an amount to be determined upon trial.” \n\nMr. Trump’s attacks on media outlets have seen him restrict access, badmouth journalists critical of his administration, and bring lawsuits demanding huge amounts of compensation. \n\nIn July, Mr. Trump sued media magnate Rupert Murdoch and The Wall Street Journal for at least $10 billion after it reported on the existence of a book and a letter, he allegedly sent to sex offender Jeffrey Epstein. \n\nParamount settled Mr. Trump’s lawsuit over election coverage on CBS News’ flagship show “60 Minutes” for $16 million the same month. He had alleged that the program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favour.","summary":"The court was asked to grant compensatory damages of not less than $15 billion and additional punitive damages “in an amount to be determined upon trial.”","url":"https://www.thehindu.com/news/international/trump-refiles-15-billion-defamation-lawsuit-against-new-york-times/article70175337.ece","image":"https://th-i.thgim.com/public/incoming/l7tjgn/article70064431.ece/alternates/LANDSCAPE_1200/2025-09-16T181358Z_952899114_RC25TGAC8SMY_RTRMADP_3_USA-TRUMP-NEW-YORK-TIMES.JPG","video":null,"publish_date":"2025-10-17 13:09:38","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.43},{"id":370135230,"title":"On Substack, TV News Personalities Find a 2nd — and Successful — Life","text":"Marquee journalists are the faces of many on-air media businesses. They deliver the news, in turn building relationships with the audiences that invite them into their homes. For countless budding anchors, it’s the ultimate goal.\n\nOr at least, it was. \n\nAudiences have elevated independent creators and influencers as sources of information to the top of podcast charts, helping the likes of Joe Rogan and Alex Cooper secure multimillion-dollar deals with Spotify and SiriusXM. News organizations, meanwhile, are experiencing dwindling ratings, flagging trust levels, plummeting traffic and making business decisions that run the gamut from consolidation to apparent appeals to a vindictive president.\n\nIt’s forced some of television’s most prominent on-air journalists who’ve left their anchor desks to turn themselves into businesses and rely directly on readers to support their work. While no journalist who spoke to TheWrap would share specific revenue totals, some have built enterprises that have allowed them to hire dozens of people — and unexpectedly learn the ropes of running a news outlet.\n\nThe industry shift reflects how audience habits have changed in an increasingly fragmented media market, opting for individuals over corporations in a watershed moment for the media monoculture. It also shows how the rise of independent platforms has continued throughout the 2020s, years after Substack’s initial boon, allowing talent who made their names through television to see the same early success that journalists like Casey Newton and Matthew Yglesias found on the platform.\n\n“I have never seen this level of pressure on these companies, and obviously it’s trickling down to journalists,” said Katie Couric, the veteran TV anchor who now runs Katie Couric Media with her husband David Molner, managing a staff of nearly 40 people. “We’ve reached an inflection point where many journalists are going to find it just ethically compromising to work for these companies.”\n\nFrom anchor chair to full-time producer\n\nABC News’ senior national correspondent Terry Moran seemingly lit his career up in flames when, just minutes after midnight on June 8, he posted a lengthy screed on X that labeled President Donald Trump and Deputy White House Chief of Staff Stephen Miller each a “world-class hater.” The network eventually suspended Moran before outright firing him, a move that would traditionally send such broadcast journalists into the wilderness.\n\nBut Moran had already spent some time thinking about a new wave of media, observing friends who’ve made platforms — and money — out of Substack and YouTube. Once a Substack producer called him and laid out how to get started on the website, Moran posted a video that said he planned to “get at the important work that we all have to do in this time of such trouble for our country.”\n\nWithin days, his subscriber count reached 90,000, with people eager to hear his takes on the Trump administration. The “stunning” figure helped Moran realize independence was the “media of tomorrow.”\n\n“I picked a great time to get fired and a great way to get fired,” Moran told TheWrap. “I had an audience instantly, people who were galvanized by what happened.”\n\nMoran now boasts over 115,000 subscribers after four months on Substack, and he keeps all of his content free for his subscribers, which represents a mix of paid and unpaid. He said he sees a pathway to his ABC News salary (reported to be at about $500,000) in “a couple of years,” though he said it could be sooner. He would not disclose a breakdown of the mix, but he said he’s been told that about 3% to 8% of someone’s subscribers are paid and that he’s “right in the middle of that.”\n\n“So you can kind of do the math,” he said. (We did: 5.5% of Moran’s roughly 115,000 subscribers would be 6,325 subscribers. If they subscribe at Moran’s $5-a-month tier, he would gross about $341,550 a year after Substack’s 10% cut.)\n\nPart of the success came from audiences’ frustration with the Trump administration’s attacks on the media, which has led some media companies to settle lawsuits deemed dubious by experts or shift programming through actions like appointing an ombudsman with conservative roots or hiring a center-right opinion journalist with no experience in television to lead a broadcast news division.\n\nFormer CNN anchor Jim Acosta has seen similar success, although he spent much less time navigating the independent space after reportedly leaving CNN in January over the network’s plans to move him to a midnight time slot. He didn’t even have a personal laptop.\n\nWithin hours of his final show, he spoke to Substack’s head of news and politics, Catherine Valentine, and uploaded his first video on the platform. Since his January debut, he has gained more than 310,000 subscribers, with tens of thousands of them being paid subscribers despite his content mainly living outside of a paywall.\n\nAcosta, too, would not say whether his revenue totals have reached his CNN salary, but he said he’s managed to hire a former producer from his CNN show and plans to announce more hires “soon.”\n\n“I would not be doing this right now if it were not successful,” he said. “I would be figuring out a way to do something else. But this is doing quite well, so I’m going to continue to pursue it.”\n\nAcosta said his decision to put most of his content outside a paywall reflects the national turmoil affecting the country, a time he said where “the lights are blinking red for our democracy.” He said he didn’t want to appear as though he was “grifting off the moment,” instead providing audiences with reporting that reflects what he sees as threats to democracy in the U.S.\n\n“A huge part of this is a lot of public frustration with corporate media, and just seeing what they’re doing is just not sufficient, not doing enough to hold [Trump’s] feet to the fire,” he said. “So folks are going to gravitate towards these new platforms and say, ‘Aha, see, this is what I want. I want to see folks holding him accountable and not holding back.’ And I think that’s part of the reason why you’ve seen this part of the industry flourish.”\n\nTalent-turned-executives\n\nSome journalists have tried to let their own success take a backseat, opting to use their platform to build a full-scale media business.\n\nMSNBC anchor Mehdi Hasan announced in January 2024 that he would leave the progressive network instead of remaining as an on-air commentator after it canceled his show, opting instead to “look for a new challenge.”\n\nThat challenge came a month later in Zeteo, a name derived from a Greek word meaning “to seek,” which he labeled a “movement for media accountability.” Hasan’s website has since grown into a business with 15 staffers, 12 newsletters and reporting often focused on coverage of the Israel-Gaza conflict and the Trump administration. (He hired two reporters from Rolling Stone, Andrew Perez and Asawin Suebsaeng, last month.)\n\nIn nearly two years, Hasan said, he’s seen revenue in the “several millions” with more than 564,000 subscribers on Substack and 1.4 million YouTube subscribers. Hasan said 1,000 subscribers are considered “founding members” who pay $500 annually, amounting to $500,000, and roughly 50,000 paying subscribers overall, the majority of whom pay the annual rate of $84. It would mean he’s taking in at least $4.7 million in yearly revenue. He said all revenue he takes in comes from American subscribers or investors.\n\nThe business drew a small profit in its first year, and he plans to continue hiring. “We’re not just growing a business in a vacuum, right?” he told TheWrap. “We’re growing a business in a country where the free press is under assault, where the news cycle is insane on a daily basis.”\n\nFormer MSNBC star Joy Reid has also demonstrated an entrepreneurial spirit. After MSNBC fired Reid in February as part of a programming shuffle, she relied on her substantial social media following to build her nascent Substack into a media organization with her husband through their production company Image Lab, drawing hundreds of thousands of subscribers and scoring interviews with the likes of former Vice President Kamala Harris and Maryland Gov. Wes Moore.\n\n“I did not miss a beat,” she said. “People were angry about me being kicked out of MSNBC, but they had a place to put that anger. They could still come and support me, and they did.”\n\nReid has leveraged that support into a media organization that has eight part-time staffers with the eventual goal of providing full-time salaries and health benefits. Her YouTube presence, launched in June, has amassed more than 330,000 subscribers and allows her to sell ads, a money stream that marks “the real way to build a business.” Reid would not provide specific revenue totals, but she said her company has operated “completely independently” without any debt and said her Substack is “already turning a profit.”\n\n“We’re learning that we’re building the plane while we’re flying it,” she said. “But so far, I cannot complain.”\n\nWhile Hasan has leaned into extracurricular appearances, including his role as columnist for the Guardian U.S. and his viral appearance last summer on Jubilee Media’s “Surrounded” debate series, Reid has found crossover episodes of her Substack show — like one on “No Kings Day” with Acosta and Don Lemon — to be “very successful.”\n\nAppetite for independence\n\nAudiences have long gravitated toward journalists who reflect values of honesty, intelligence and authenticity, even in the digital age, according to a Pew Research study published in August. But what defines authenticity remains a subject for debate, and several respondents to Pew’s study found they cared when journalists added “a human touch” to their reporting.\n\nThat’s what helps journalists on Substack grow the fastest, Valentine told TheWrap.\n\n“What is actually making subscribers feel the most attached to people is this feeling like they can FaceTime with the person that they used to watch on cable news,” she told TheWrap. “It is leading to this authenticity thing. It’s this trust thing, and it’s feeling like you have an expert in your pocket thing, and that’s part of the magic that is not translating to legacy right now.\n\n“Every time Jim Acosta’s dog barks, he makes money,” she added. (Acosta’s dog’s name is Duke.)\n\nThose who bring an authentic feel to their news coverage on Substack tend to see the most success. Aaron Parnas, the 26-year-old whose Substack “The Parnas Perspective” ranks at the top of Substack’s news category (more than 615,000 subscribers, with tens of thousands of them paid) due to his prolific coverage of news events, left a past life as a lawyer to pursue his Substack full-time. \n\nParnas’ videos often feature him speaking into his phone, analyzing a news item in near real-time, though he’s also conducted interviews with top Democratic leaders who’ve recognized his platform. His relevance has emerged outside of the internet, as he helped kick off Harris’ book tour for her election memoir, “107 Days,” in New York last month.\n\n“It means the world to me to be independent,” he told TheWrap, saying he draws between 80% to 90% of his income from Substack. “I wouldn’t trade it for anything.”\n\nThe effects have been paramount through other platforms. Media reporter Oliver Darcy left CNN last year and turned an independent media newsletter, Status, into a full-fledged media company on Substack rival Beehiiv with multiple staffers focused on coverage of the media industry. Nearly all of Politico’s hires for its relaunch of its Playbook newsletter in 2021 — Eugene Daniels, Tara Palmeri, Ryan Lizza and Rachael Bade — have either started independent newsletters on Substack or reportedly plan to.\n\nCouric, who started her independent media company in 2018 and launched on Substack earlier this year (more than 70,000 subscribers), said Substack revolutionized the incentive to go independent due to journalists’ ability to develop direct revenue streams, something not found on platforms like Twitter or Instagram.\n\n“You can’t really make money on Instagram covering the news, right? You can make some money on YouTube, but not that much,” she said (and later clarified that YouTube remains a “good” revenue source). “Substack really opened the door to a lot of these independent journalists being able to support themselves.”\n\nNot that all has been rosy on the platform. After the initial boom in 2020 that saw Substack help kickstart journalists’ independent projects with grants and resources, several writers decamped from the platform after Substack’s founders said they would not seek to demonetize Nazis who’d taken root. \n\nFollowing an open letter from 200 writers, Substack announced in January last year that it would remove some of the publications it claimed were inciting violence. But some writers had already left.\n\n“I went from making a little bit of money to actually making a living as an independent journalist with my own publication,” journalist Marisa Kebas wrote on her Beehiiv-hosted newsletter, “The Handbasket,” in December.\n\nSubstack no longer provides journalists with stipends. Still, of Substack’s roughly 50 millionaires on the platform, the “vast majority” are in the news and politics category, Valentine said. \n\n“For most of these journalists, making a million dollars is more than they ever thought they could make in their careers,” she said. “Being able to go independent on their business also was not something radically on their plate, but they’re having so much fun.”\n\nSubstack reports that more than 50,000 publishers make money on the platform.\n\nWhile some creators left this year after the Trump administration took hold, the model has still been successful for Substack. The company raised $100 million in 2025 at a $1.1 billion valuation, according to the New York Times. Investors included the technology investment firm BOND, sports agent and Klutch Sports Group CEO Rich Paul and venture capitalist firm Andreessen Horowitz, among others.\n\nThe journalists who spoke to TheWrap said they did not want to return to their corporate platforms, noting that they value their independence and editorial freedom over the confines of a corporate media environment under immense duress.\n\n“I don’t want to work at a place where those kinds of corporate pressures are just looming over me at all times,” Acosta said. “That’s why I’m enjoying what I’m doing right now. I’m free of all that, you know, until they figure out how to suppress this end of things.”","summary":"Journalists who built their careers in television are finding comparable levels of success, letting them scale themselves up outside of their former corporate confines\n\n\nThe post On Substack, TV News Personalities Find a 2nd — and Successful — Life appeared first on TheWrap.","url":"https://www.thewrap.com/substack-success-for-journalists-mehdi-hasan-joy-reid/","image":"https://i0.wp.com/www.thewrap.com/wp-content/uploads/2025/10/100325-Independent-Media.jpeg?fit=1200%2C675&quality=89&ssl=1","video":null,"publish_date":"2025-10-17 13:00:00","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","source_country":"US","sentiment":-0.052},{"id":370140430,"title":"Hochul's office silent when pressed if she sticks by 'no one is above the law' belief amid AG's indictment","text":"New York Democrat Gov. Kathy Hochul offered her support of Empire State Attorney General Letitia James when she was first indicted on charges of bank fraud and making false statements to a financial institution, following years of the New York governor celebrating legal challenges originating in her home state and elsewhere against President Donald Trump. \"New Yorkers know @NewYorkStateAGJames for her integrity, her independence, and her relentless fight for justice. What we're seeing today is nothing less than the weaponization of the Justice Department to punish those who hold the powerful accountable,\" Hochul posted to X following James' indictment. A grand jury in Virginia indicted James Thursday, months after Federal Housing Finance Director Bill Pulte said in a criminal referral to the Department of Justice in April that James allegedly falsified mortgage records to obtain more favorable loans. She faces charges of bank fraud and making false statements to a financial institution. Pulte alleged in his criminal referral that James purchased a home in Norfolk, Virginia, in 2023, but identified it as her primary residence on mortgage documents and a Fannie Mae, Freddie Mac form. James is legally required to live in New York as a statewide elected official in that state. LEGAL EXPERT CALLS OUT 'IRONIC' TWIST AS NY AG WHO PROSECUTED TRUMP FACES FEDERAL BANK FRAUD CHARGES \"No one is above the law. The charges as alleged in this case represent intentional, criminal acts and tremendous breaches of the public’s trust,\" U.S. Attorney for the Eastern District of Virginia Lindsey Halligan said when James was indicted. \"The facts and the law in this case are clear, and we will continue following them to ensure that justice is served.\" Hochul, as well as other prominent Democrats, have pointed to the indictment as alleged \"political weaponization\" and political persecution of a Trump foe at the hands of the administration. James and Trump have long traded barbs, with James campaigning for the attorney general job in 2018 vowing to pursue legal charges against Trump if elected. Her office ultimately filed nearly 100 legal challenges against the first Trump administration and vowed to continue the legal battles upon his re-election in November 2024. MAMDANI ASSAILS TRUMP FOR 'POLITICAL RETRIBUTION' AGAINST LETITIA JAMES IN SWEEPING DEFENSE OF EMBATTLED AG Trump accused Democrats of waging lawfare — which is understood as leveraging the courts to gain political advantage — as a last-ditch attempt to prevent him from running for the Oval Office again in the 2024 cycle and securing another federal election win. Trump, for example, was indicted and found guilty in a New York case that accused him of falsifying business records, he was indicted on racketeering charges in Georgia, faced federal criminal cases claiming he mishandled sensitive government documents after his first presidency, and another claiming he attempted to overturn the 2020 election results. Trump also faced civil cases, including James accusing Trump and the Trump Organization of inflating asset values in a lawsuit that found Trump and his companies liable. Fox News Digital took a look back at Hochul's previous comments on Trump and the legal cases that plagued the president during his first administration through his interim as the 45th and 47th president, and found the governor frequently celebrated cases that conservatives identified as \"lawfare.\" Fox News Digital reached out to Hochul's office for comment on her past remarks on legal cases against Trump as she promotes the narrative that the administration is weaponizng the justice system against political foes but did not immediately receive a reply. Fox Digital specifically asked if Hochul stands by her previous comments that \"no one is above the law,\" considering James' indictment, but did not receive replies. Trump is the first and only president to be impeached twice by the House, with Hochul remaking during his first impeachment in 2019 — which accused him of abuse of power and obstruction of Congress related to allegedly seeking foreign interference from Ukraine to boost his re-election efforts in 2020 — that no one is above the law. LETITIA JAMES' OWN WORDS COME BACK TO HAUNT HER AFTER FEDERAL BANK FRAUD CHARGES FILED \"It’s really quite simple — NO ONE is above the law. Not now, not ever,\" she posted to Facebook. \"Speaker Pelosi & Democrats in Congress are holding the president accountable because they have a patriotic duty to uphold our Constitution, not play partisan politics.\" As Trump stood trial for the civil fraud case launched by James that accused Trump and Trump Organization of financial fraud, Hochul commented that she had \"full confidence\" that he would be held accountable, while also remarking that he had \"temper tantrums\" in the court. \"Former President Donald Trump is testifying in an unprecedented civil trial brought by our own Attorney General, Tish James. So far from telling the truth as he's required to do, he's throwing temper tantrums from the witness stand and verbally attacking judges and courtroom staff. His conduct has been a disgrace and I have full confidence that Donald Trump will be held accountable for his actions,\" she said in November of 2023. A month later, the Democratic governor appeared to throw her support behind a lawsuit that aimed to prevent Trump's name from appearing on voting ballots for the 2024 election. NEW YORK AG LETITIA JAMES' INDICTMENT SPARKS SHARP PARTISAN DIVIDE A group of Colorado voters brought forth a lawsuit in 2022 arguing Trump should be deemed ineligible from holding political office under a Civil War-era insurrection clause. The lawsuit argued Trump's action on Jan. 6, 2021 — when supporters breached the U.S. Capitol — violated a clause in the 14th Amendment that prevents officers of the United States, members of Congress or state legislatures who \"engaged in insurrection or rebellion\" against the Constitution from holding political office. \"Jan. 6 will live in infamy. Shame on us if we forget that,\" Hochul said in December 2023, when the Colorado Supreme Court declared him ineligible to run for president. \"Shame on us what happened to this country when a Capitol that I used to proudly walk in as a member of Congress was literally under siege, people died, people were injured, and if he doesn’t take responsibility for that, then the American people ought to hold him accountable. So that’s what’s starting in Colorado.\" The U.S. Supreme Court unanimously ruled in March 2024 to keep Trump on the ballot. After Trump was found liable in James' civil fraud case in 2023 and ordered to pay $355 million fine, Hochul worked to calm other business leaders' concerns that they could face similar trials, citing that Trump and \"his behavior\" set him apart. \"I think that this is really an extraordinary, unusual circumstance that the law-abiding and rule-following New Yorkers who are business people have nothing to worry about, because they’re very different than Donald Trump and his behavior,\" Hochul said on radio show \"The Cats Roundtable\" in February 2024. An appeals court threw out the monetary penalty in the case earlier in 2025. Later that same year, Hochul celebrated that \"no one is above the law\" when Trump was found guilty in NY v. Trump on 34 counts of falsifying business records. \"Today's verdict reaffirms that no one is above the law,\" Hochul said in a statement in May 2024. \"In preparation for a verdict in this trial, I directed my Administration to closely coordinate with local and federal law enforcement and we continue to monitor the situation. We are committed to protecting the safety of all New Yorkers and the integrity of our judicial system.\" As the election came down to the wire in 2024, Hochul slammed Trump as a \"fraud\" and \"philanderer\" who lacked New York values, while pointing to the NY v. Trump case. \"Donald Trump was born a New Yorker but ended up a fraud, a philanderer, and a felon. He wasn’t raised with the New York values that I know,\" Hochul declared during her Democratic National Convention speech in Chicago in 2024. \"Trust me, America, if you think you’re tired of Donald Trump, talk to a New Yorker. We’ve had to deal with them for 78 long years, the fraud, the tax dodging, the sham university, the shady charities.\" DOJ OPENS GRAND JURY INVESTIGATION INTO LETITIA JAMES TIED TO TRUMP CIVIL CASE Trump won the Republican primary in the 2024 election cycle, and swept the seven battleground states on Election Day, defeating then-Vice President Kamala Harris to succeed then-Preisdent Joe Biden in the Oval Office. Hochul and James held a press conference the day after the election, and vowed to battle the Trump agenda while honoring the results of the election. \"I want to be very clear that while we honor the results of this election and will work with anyone who wants to be a partner in achieving the goals of our administration in our state, that does not mean we'll accept an agenda from Washington that strips away the rights that New Yorkers have long enjoyed,\" Hochul said on Nov. 6, 2024. \"We did not expect this result, but we are prepared to respond to this result,\" James said during the same press conference. \"And my office has been preparing for several months because we've been here before,\" James said. \"We faced this challenge before, and we used the rule of law to fight back. And we are prepared to fight back once again because, as the attorney general of this great state, it is my job to protect and defend the rights of New Yorkers and the rule of law. And I will not shrink from that responsibility.\" Trump slammed the onslaught of court cases against him in recent years, denying wrongdoing and identifying them as attempts from his political foes as tools to prevent him from seeking and winning re-election. CLICK HERE TO GET THE FOX NEWS APP \"They're playing with the courts, as you know, they've been playing with the courts for four years. Probably got me more votes because I got the highest number of votes ever gotten by a Republican by far, actually, by a lot. And, you know, we had a great election, so I guess it didn't work. But even to this day, they're playing with the courts and they're friendly judges that like to try and make everybody happy. … It's called lawfare, it's called weaponization of justice,\" Trump said in January, just days before he was sworn back into office.","summary":"Governor Kathy Hochul defends Attorney General Letitia James against federal indictment, claiming weaponization despite previously supporting Trump legal challenges.","url":"https://www.foxnews.com/politics/hochuls-office-silent-when-pressed-she-sticks-no-one-above-law-belief-amid-ags-indictment","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/hochul-james-parade.jpg","video":null,"publish_date":"2025-10-17 12:55:53","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.098},{"id":370124380,"title":"Trump refiles $15 bn defamation lawsuit against New York Times","text":"NYT News ServicePresident Donald Trump speaks to reporters before boarding Air Force One at Morristown Airport in Morristown, N.J.\n\nUS President Donald Trump has refiled a $15 billion defamation lawsuit against The New York Times, court documents show, weeks after it was thrown out by a federal judge.Trump has intensified his long-established hostility toward the media since his return to the White House and the suit is one of numerous attacks against news organizations he accuses of bias against him.The Times complaint was thrown out in September because District Judge Steven Merryday took exception to its florid writing, repetitive and laudatory praise of Trump and its excessive 85-page length.The suit filed Thursday in Florida and seen by AFP runs to less than half the length, at 40 pages.It takes aim at \"false, defamatory, and malicious publications\", highlighting a book and two Times articles.Live EventsThe lawsuit named the newspaper, three Times reporters and the publisher Penguin Random House as defendants.It accuses them of making defamatory statements against Trump \"with actual malice.\"\"The statements in question wrongly defame and disparage President Trump's hard-earned professional reputation, which he painstakingly built for decades\" before entering the White House, the lawsuit says.The court was asked to grant compensatory damages of not less than $15 billion and additional punitive damages \"in an amount to be determined upon trial.\"Trump's attacks on media outlets have seen him restrict access, badmouth journalists critical of his administration, and bring lawsuits demanding huge amounts of compensation.In July, Trump sued media magnate Rupert Murdoch and The Wall Street Journal for at least $10 billion after it reported on the existence of a book and a letter he allegedly sent to sex offender Jeffrey Epstein.Paramount settled Trump's lawsuit over election coverage on CBS News' flagship show \"60 Minutes\" for $16 million the same month. He had alleged that the program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favor.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onNew York Times lawsuitTrump defamation lawsuitPresident Trumpdefamation lawsuitThe New York TimesPenguin Random Housewhite housewall street journalparamount\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onNew York Times lawsuitTrump defamation lawsuitPresident Trumpdefamation lawsuitThe New York TimesPenguin Random Housewhite housewall street journalparamount(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Donald Trump has refiled a massive $15 billion defamation lawsuit against The New York Times. This action follows an earlier dismissal of his suit by a federal judge. The lawsuit targets the newspaper, its reporters, and a publisher for alleged defamatory publications. Trump claims these statements have damaged his professional reputation.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-refiles-15-bn-defamation-lawsuit-against-new-york-times/articleshow/124629294.cms","image":"https://img.etimg.com/thumb/msid-124629464,width-1200,height-630,imgsize-53124,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-17 12:02:14","author":"New York Timesafplas","authors":["New York Timesafplas"],"language":"en","category":"politics","source_country":"in","sentiment":-0.347},{"id":370250698,"title":"The Latest: Trump hosts Zelenskyy at the White House following call with Putin","text":"President Donald Trump is hosting Ukrainian President Volodymyr Zelenskyy for talks at the White House on Friday, with the U.S. leader signaling he’s not ready to agree to sell Kyiv a long-range missile system that the Ukrainians say they desperately need.\n\nZelenskyy gets his one-on-one with Trump a day after the U.S. president and Russian President Vladimir Putin held a lengthy phone call to discuss the conflict.\n\nIn recent days, Trump had shown an openness to selling Ukraine long-range Tomahawk cruise missiles, even as Putin warned that such a move would further strain the U.S.-Russian relationship. But following Thursday’s call with Putin, Trump appeared to downplay the prospects of Ukraine getting the missiles, which have a range of about 995 miles (1,600 kilometers).\n\nThe latest:\n\nCatholic bishops denounce Trump administration IVF initiative\n\nThree bishops who chair important committees for the U.S. Conference of Catholic Bishops assailed new moves by the Trump administration to reduce the cost of in vitro fertilization.\n\n“We strongly reject the promotion of procedures like IVF that instead freeze or destroy precious human beings and treat them like property,” the bishops said Friday.\n\n“Without diminishing the dignity of people born through IVF, we must recognize that children have a right to be born of a natural and exclusive act of married love, rather than a business’s technological intervention,” their statement said. “And harmful government action to expand access to IVF must not also push people of faith to be complicit in its evils.”\n\nThe bishops were Robert Barron, chairman of the Committee on Laity, Marriage, Family Life and Youth; Kevin Rhoades, chairman of the Committee for Religious Liberty; and Daniel Thomas, chairman of the Committee on Pro-Life Activities.\n\nTrump administration asks Supreme Court to allow deployment of National Guard in Chicago area\n\nThe Trump administration’s request Friday escalates the president’s conflict with Democratic governors over using the military on U.S. soil.\n\nThe emergency appeal to the high court came after a judge prevented, for at least two weeks, the deployment of Guard members from Illinois and Texas to assist immigration enforcement.\n\nZelenskyy and Trump have finished their meeting\n\nThe two spent more than two hours with top advisers.\n\nThe lunch meeting went much longer than planned, according to a senior Ukrainian official who was not authorized to talk to the media and spoke on the condition of anonymity.\n\n— By Susie Blann\n\nBessent to speak and later meet Chinese counterpart, as trade tensions de-escalate\n\nTreasury Secretary Scott Bessent said he will speak with Chinese Vice Premier He Lifeng on Friday evening and that the delegations led by the two men will meet in Malaysia “probably a week from tomorrow” to prepare for a leaders summit.\n\n“I think that things have de-escalated,” Bessent said Friday in the White House.\n\nTensions flared last week when Beijing expanded export controls on rare earths materials, a move Bessent called an “unprovoked escalation.” In response, Trump threatened to impose a new 100% tariff on China.\n\nBut tensions appear to have eased this week. Trump on Friday said he would meet Chinese President Xi Jinping in “a couple of weeks” in South Korea.\n\nBessent said he and He, when meeting in Malaysia, will prepare for the two presidents to meet. “I am confident that President Trump, because of his relationship with President Xi, will be able to get things back on a good course,” Bessent said.\n\nTrump budget chief announces pause on several Corps of Engineers projects\n\nTrump budget chief Russ Vought says that as part of the government shutdown the U.S. Army Corps of Engineers will pause more than $11 billion in “lower-priority projects” and consider them for cancellation.\n\nHe specifically blamed Democrats for the shutdown and listed New York City, San Francisco, Boston and Baltimore as locations where projects would be paused.\n\nHe said more information would come from the Corps, which maintains waterways to support navigation, helps communities protect against storm damage and cleans sites with hazardous materials.\n\nVought’s announcement on X follows the administration’s announcement that it would put on hold roughly $18 billion in transportation funding for the New York City area and the cancellation of $7.6 billion in grants for clean energy projects in 16 states, all of which voted for Democrat Kamala Harris in last year’s presidential election.\n\nSupreme Court will close to public until shutdown ends\n\nThe building will remain open for official business and the justices’ work will be unaffected, court spokeswoman Patricia McCabe said Friday.\n\nBut beginning Monday, visitors to Washington will no longer have access to the 90-year-old courthouse atop Capitol Hill while the government remains shut down.\n\nThe next round of arguments, including a big test of President Donald Trump’s authority to levy tariffs, takes place the first week of November. Those arguments will take place as scheduled, even if the government hasn’t reopened, McCabe said.\n\nHouse pro-forma session passes without swearing in for Arizona congresswoman-elect\n\nIn a pro-forma session, the House is briefly opened but legislative business is not typically conducted. Republicans closed another such session Friday without allowing the swearing in of Adelita Grijalva, who won a special election last month.\n\nHouse Speaker Mike Johnson has refused to allow Grijalva to take her office while he keeps the House out of Washington during the shutdown. Grijalva would also provide the last signature needed to force a vote on a bill to make the Department of Justice release case files on Jeffrey Epstein — legislation that Johnson opposes.\n\nHouse Democratic leader Hakeem Jeffries said earlier that the Arizona attorney general would take legal action against Johnson if Grijalva was not sworn in Friday.\n\nWith no takers yet, White House holds meeting with colleges weighing ‘compact’\n\nThe White House asked five universities to join a Friday call to discuss the offer, which would provide favorable access to federal funding in return for commitments in line with Trump’s priorities.\n\nIt follows rejections from four of the nine universities invited to sign on. The White House asked college leaders to provide initial feedback by Oct. 20, yet so far none have agreed to the deal.\n\nThose that have not yet announced a decision are Dartmouth College, the University of Arizona, the University of Texas, the University of Virginia and Vanderbilt University.\n\nThe compact has stirred a wave of pushback from critics who say it would restrict free speech and cede sweeping control to the government.\n\nWith cameras rolling live, Trump again drops an F-bomb\n\nTrump was asked about reports that the Venezuelan government offered a plan rejected by the U.S. in which President Nicolás Maduro would agree to eventually leave power.\n\n“He’s offered everything, Trump said. He added, “Because he doesn’t want to f—- around with the United States.”\n\nIn June, when Trump was frustrated with Israel and Iran attacking each other after a ceasefire, he told a group of reporters that the countries had “been fighting so long and so hard that they don’t know what the f—- they’re doing.”\n\nTrump confirms US strike on alleged ‘drug-carrying submarine’ in the Caribbean\n\n“We attacked a submarine, and that was a drug-carrying submarine built specifically for the transportation of massive amounts of drugs” Trump said while hosting the Ukrainian president at the White House.\n\nSecretary of State Rubio did not dispute that there were survivors, but he repeatedly said details would be forthcoming.\n\nFEMA staff protest cuts outside agency headquarters\n\nCurrent and former staff of the Federal Emergency Management Agency demonstrated against workforce and program cuts during a “FEMA Solidarity Rally” on Friday, a potentially risky act of protest because some of the same staffers were placed on leave after signing a public dissent letter in August.\n\nA few dozen people gathered outside the agency’s headquarters in Washington, D.C., calling on Trump to stop dismantling the agency and for its acting chief, David Richardson, to resign, among other demands.\n\nThe agency has been in upheaval since January, with some states waiting nearly two months for disaster declarations to be approved and huge cuts to resilience and preparedness funding. About 18% of the agency’s permanent full-time employees had departed as of June, including 24 senior-level staffers.\n\nTrump says Putin was ‘very generous’ praising him for peacemaking efforts\n\nThe president said his Russian counterpart was speaking on their call Thursday about Trump’s efforts to solve global conflicts and “said it was amazing.”\n\nTrump then again complained that he didn’t get the Nobel Peace Prize this year, saying, “Somebody got it who’s a very nice woman.”\n\nDespite his complaint, he then insisted he was unbothered.\n\n“I don’t care about all that stuff. I just care about saving lives,” he said.\n\nZelenskyy suggests he’s interested in trading Ukrainian military drones for Tomahawk missiles\n\nThe Ukrainian leader said that while his country has thousands of military drones, they don’t have the strong missiles that the U.S. makes and suggested both countries can work together for their military goals.\n\nTrump, when asked if the U.S. was interested in such a deal, said, “We are.”\n\nHe said that drone warfare has “really come to the fore” over the last few years because of the Russia-Ukraine war.\n\nTrump says he understands why Hungary still buys Russian oil, despite his calls to cut off purchases\n\nTrump has long said he would place tariffs to stop Russia’s war in Ukraine, so long as other countries in NATO stopped importing Russian oil. But while meeting with Zelenskyy, Trump seemed to defend Hungary’s purchases of Russian oil.\n\n“Hungary is sort of stuck because they have one pipeline that’s been there for years and years and years, and they’re inland,” Trump said. “I spoke with the very great leader of Hungary, and they are, you know, it’s very hard for them to get oil. I understand it.”\n\nDespite Hungarian Prime Minister Viktor Orbán’s claims that Hungary’s geography precludes sourcing fossil fuels from outside Russia, some critics and experts argue Hungary’s continued purchase of Russian oil and gas are more about politics than pipelines.\n\nTrump plans to meet with Putin in Budapest, Hungary, saying he agreed to the location because he likes Orbán.\n\nThe U.S. president repeated his previous claims that India will not be purchasing oil from Russia at some point in the future, saying that the country has “already de-escalated.”\n\nIt’s not clear whether Zelenskyy will join Trump’s meeting in Hungary with Putin\n\n“To be determined” Trump said as he met with Zelenskyy in the Cabinet room at the White House.\n\nHe said it most likely will be a “double meeting,” but that Zelenskyy would be in touch throughout.\n\nTrump said there is “bad blood” between Putin and Zelenskyy.\n\n“These two leaders do not like each other and we want to make it comfortable for everybody,” he said.\n\nZelenskyy congratulates Trump over landing last week’s ceasefire and hostage deal in Gaza\n\nAt the start of his talks with Trump, Zelenskyy also said the U.S. president now has “momentum” to stop the Russia-Ukraine conflict.\n\n“President Trump now has a big chance to finish this war,” Zelenskyy added.\n\nZelenskyy arrives at White House to meet with Trump\n\nThe Ukrainian president arrived at the White House at 1:25 pm EDT on Friday, greeted by members of the U.S. military holding state flags.\n\nIt’s the fourth meeting between Zelenskyy and Trump as they’ve sought to resolve Russia’s war in Ukraine. Trump spoke separately on Thursday by phone with Russian leader Vladimir Putin and plans to meet with him in roughly two weeks in Budapest, Hungary.\n\nFederal courts are being forced to cut back because of the shutdown\n\nBeginning Monday, courts around the country will maintain limited operations, the federal judiciary said Friday.\n\nFederal judges will continue to serve and be paid, but other court employees will work without pay for now, or be furloughed. Decisions are being made by courthouse by courthouse.\n\nZelenskyy wants to interest Trump in an energy deal with Ukraine\n\nThe Ukrainian president isn’t just coming to the White House in search of military aid. He also has a business pitch for Trump that revolves around fossil fuels.\n\nUkrainian officials have indicated that Zelenskyy is looking to offer to store U.S. liquefied natural gas in Ukraine’s gas storage facilities, which would allow for American presence in the European energy market.\n\nZelenskyy previewed the strategy Thursday in meetings with Energy Secretary Chris Wright and the heads of American energy companies. Zelenskyy posted pictures of the meeting on X and said that it is important to restore Ukraine’s energy infrastructure after Russian attacks and expand “the presence of American businesses in Ukraine.”\n\nTrump meets with Italian tenor Andrea Bocelli\n\nIt wasn’t clear why Trump was holding the meeting at the White House shortly before he was due to meet with Ukraine’s president.\n\nA White House aide posted a photo of Trump meeting with Bocelli in the Oval Office while Bocelli’s music blared from speakers in the Rose Garden.\n\nThe music could be heard on the North Lawn, where Zelenskyy was due to arrive any moment.\n\nNumber of people arrested at Chicago-area ICE facility rises\n\nAs of midday, 11 people have been arrested outside the Broadview facility. Law enforcement is urging demonstrators to stay in designated “protest zones.”\n\nThe ICE facility has been the site of tense protests in recent weeks. Federal agents previously used tear gas and other chemical agents on protesters and journalists.\n\nIllinois State Police said some protesters blocked a street outside the facility Friday and ignored requests to move to the designated protest area.\n\nKat Abughazaleh, a protester and congressional candidate, expressed outrage. “A free speech zone implies that everywhere else is not a free speech zone,” she said.\n\nAbughazaleh said she was hit in the face with a baton Friday and saw a woman pushed to the ground by officers.\n\nTrump calls the 100% tariff on China “not sustainable”\n\nTrump said the new 100% tariff he’s threatened on Chinese goods is “not sustainable,” in an interview with Fox News that aired Friday.\n\nThe president said he was “forced” to consider the high tariff because of China’s new export controls on rare earths, used in products from smartphones to jet planes.\n\nTrump said he hopes to meet Chinese President Xi Jinping on an upcoming Asia trip, and played down further tensions with China. “I think we’re going to do fine with China,” Trump said.\n\nTrump also blamed former President Richard Nixon for opening the floodgate to doing business with China. “He allowed this to happen. You know he was the one, he opened China,” Trump said. “He unleashed it. And we have a very strong adversary, and they only respect strength.”\n\nNixon helped establish communications between the two governments when he visited the communist country in 1972, which led to the normalization of diplomatic ties in 1979.\n\nUS seizes survivors of strike on suspected drug-carrying vessel\n\nThe U.S. has seized survivors after a strike Thursday on a suspected drug-carrying vessel in the Caribbean, the first since President Donald Trump began launching deadly attacks in the region this summer, according to a defense official and another person familiar with the matter.\n\nThe people confirmed the strike Friday on the condition of anonymity because it has not yet been acknowledged by President Donald Trump’s administration. It is believed to be at least the sixth strike since August, and the first to result in survivors who were picked up by the U.S. military. It was not immediately clear what would be done with the individuals.\n\nThis strike on Thursday brings the death toll from the Trump administration’s military action against vessels in the region to at least 28.\n\nFormer National Security Adviser John Bolton makes first court appearance\n\nJohn Bolton arrived at a federal courthouse Friday to surrender to authorities and make his first court appearance on charges accusing the former Trump administration national security adviser of storing top secret records at home and sharing with relatives diary-like notes that contained classified information.\n\nThe 18-count federal indictment Thursday also suggests classified information was exposed when operatives believed to be linked to the Iranian government hacked Bolton’s email account and gained access to sensitive material he had shared. A Bolton representative told the FBI in 2021 that his emails had been hacked, prosecutors say, but did not reveal that Bolton had shared classified information through the account or that the hackers had possession of government secrets.\n\nThe closely watched case centers on a longtime fixture in Republican foreign policy circles who became known for his hawkish views on American power and who served for more than a year in Trump’s first administration before being fired in 2019. He later published a book highly critical of Trump.","summary":"President Donald Trump hosted Ukrainian President Volodymyr Zelenskyy for talks at the White House Friday, with the U.S. leader signaling he’s not ready to agree to sell Kyiv a long-range missile system that the Ukrainians say they desperately need.","url":"https://www.thestar.com/news/world/united-states/the-latest-trump-hosts-zelenskyy-at-the-white-house-following-call-with-putin/article_db755be7-bd93-5e01-b897-c81beb0f81bd.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/custom/image/f84403b8-7d76-11ee-9d02-a72a4951957f.png?resize=600%2C600","video":null,"publish_date":"2025-10-17 11:54:37","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.152},{"id":370142038,"title":"'How about an apology?' Baby boomers blamed for Trump-era woes in blistering NYT op-ed","text":"On January 20, 2025, the United States went from having a member of the Silent Generation in the White House — former President Joe Biden, born in Scranton, Pennsylvania on November 20, 1942 — to Boomer President Donald Trump, born in New York City's Queens borough on June 14, 1946. \n\nTo Trump critics from post-Boomer generations — Generation X, Millennials and Generation Z — the 79-year-old president epitomizes many of the qualities they say they detest in right-wing Boomers, from arrogance to intolerance to selfishness. Yet Trump, in the 2024 election, made gains with Gen-Z voters (along with Latinos and independents) that helped him pull off a narrow victory over Democratic nominee Kamala Harris.\n\nIn a blistering video posted in the New York Times' opinion section on October 17, a group of younger voters lay out some reasons why they blame Baby Boomers for the many problems plaguing the U.S. during Trump's second presidency.\n\nThe voters argue that Boomers, in contrast to the hardships of the World War 2 Generation, \"were handed the world on a silver platter\" — from \"cheap housing\" and \"cheap college\" to upward mobility in their jobs — only to throw those advantages away for future generations by voting for GOP Presidents George W. Bush and Donald Trump in big numbers.\n\n\"You've been an electoral powerhouse since the 1980s,\" the voters argue. \"When presented with a choice between protecting your interests or investing in a better future for your children, you usually chose yourselves. Can you believe it? More benefits for Boomers, more tax cuts from Boomers. And borrowed money to make up the difference.\"\n\nThe video goes on outline the challenges Millennials and Generation X have been facing, including soaring college tuition and unaffordable housing. The younger voters complain, \"And you made it more difficult for younger Americans to live in the cities with the best jobs. You regularly use your electoral might to squash plans for new construction and protect your property values. It's like you think democracy only exists so that you can band together en masse to freeze your communities in time. You're the reason so many Americans sleep in their cars. You're the reason that public schools today are more segregated than they were in 1968.\"\n\nThe video has a request from Boomers: \"How about an apology?\"\n\nThe New York Times' video and a short article accompanying it are available at this link (subscription required).","summary":"On January 20, 2025, the United States went from having a member of the Silent Generation in the White House — former President Joe Biden, born in Scranton, Pennsylvania on November 20, 1942 — to Boomer President Donald Trump, born in New York City's Queens borough on June 14, 1946. \n\nTo Trump critics from post-Boomer generations — Generation X, Millennials and Generation Z — the 79-year-old president epitomizes many of the qualities they say they detest in right-wing Boomers, from arrogance to intolerance to selfishness. Yet Trump, in the 2024 election, made gains with Gen-Z voters (along with Latinos and independents) that helped him pull off a narrow victory over Democratic nominee Kamala Harris.\n\nIn a blistering video posted in the New York Times' opinion section on October 17, a group of younger voters lay out some reasons why they blame Baby Boomers for the many problems plaguing the U.S. during Trump's second presidency.\n\nThe voters argue that Boomers, in contrast to the hardships of the World War 2 Ge","url":"https://www.alternet.org/baby-boomers-ny-times-video/","image":"https://www.alternet.org/media-library/image.jpg?id=54460000&width=1200&height=600&coordinates=0%2C458%2C0%2C459","video":null,"publish_date":"2025-10-17 11:03:52","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":0.252},{"id":370112866,"title":"California's Latest Dumb Gun Law is a Ban on Glocks","text":"Last year, then-Democratic presidential hopeful Kamala Harris insisted in a presidential debate that she is a gun owner and that she and her running mate, Tim Walz, were \"not taking anybody's guns away, so stop with the continuous lying about this stuff.\" Later, she elaborated with 60 Minutes interviewer Bill Whitaker that she owned a Glock pistol that she had fired at the shooting range.\n\nMaybe Harris should have checked with lawmakers in California where she was once attorney general and which she represented in the U.S. Senate. That state just banned the sale of Glock pistols. True, state officials won't take away Kamala's pistol or those already owned by other Californians, but that's cold comfort for anybody looking to purchase new products from the popular gunmaker.\n\nKamala's Machine Gun\n\n\"Democrat Gov. Gavin Newsom signed a bill into law that bans the sale of new Glock guns in California,\" CBS News reported October 13. \"At issue, the new Glock design allows the gun to be easily modified with a Lego-sized piece of plastic known as a 'Glock Switch' that can be 3-D printed to turn it into a fully automatic weapon.\"\n\nAccording to California Assemblymember Jesse Gabriel (D–Encino), who introduced the legislation, \"As parents and lawmakers, we refuse to stand idly by while our schools and communities are being threatened by illegal machine guns.\"\n\nAs you would expect from a legislator, this is nonsense. While machine guns are illegal in some states, California technically allows their possession by civilians, subject to (heavy) regulation, although it strictly limits the issuance of permits. Federal law also allows civilians to own machine guns \"if the machine gun was lawfully registered and possessed before May 19, 1986,\" again subject to heavy regulation. But Glock switches, like other devices that can convert a firearm to full automatic fire, have been illegal for years under federal law, as well as banned by me-too laws in a growing number of states.\n\nGlock switches are add-on parts that are not commercially available (beware of bogus government-run websites that purport to sell them). They've captured media attention in recent years because these things run in trends. In the past, similar attention was given to drop-in sears which could turn some semiautomatic rifles fully automatic (shoestrings can do this with certain models). Those, too, are already illegal, but stories about them play to the appetite in certain corners of our society for scary gun stories. Now it's Glock's turn to be used as a punching bag by politicians.\n\nAccording to Gabriel and his allies, they want Glock to change their guns so they can't be converted.\n\n\"If these companies won't redesign their weapons to protect our communities, California will hold them accountable,\" commented Assemblymember Catherine Stefani (D–San Francisco).\n\nAnother Law That Will Accomplish Nothing\n\nBut as CBS noted in its video report, Glock already redesigned its pistols to prevent insertion of switches; California hasn't approved the new design for sale. The preventive feature can be bypassed with DIY modifications—but the same is true of other firearms in a world where people build guns from scratch.\n\nIn fact, countries that tightly restrict firearms find that underground manufacturers quickly turn to submachine guns (pistol-caliber automatic weapons) because they're easy to make and they're ignoring the law anyway. \"Blocks of steel bar and…tubing are really all that is required to turn these out in any small workshop used for bike and automotive repairs,\" the Impro Guns blog observed last month of automatic weapons used in a Jerusalem terrorist attack.\n\nIn other words, innovative people with benign intent and ill will alike can easily make and modify physical objects; and Gabriel, his fellow lawmakers who voted for this nonsensical legislation, and California Gov. Gavin Newsom are exploiting that fact to ban products of one of the most popular firearms manufacturers—or anything with a similar mechanism.\n\nThat's because the legislation reaches beyond one brand. The new law doesn't just ban Glock pistols, it defines a now-forbidden \"'machinegun-convertible pistol' as any semiautomatic pistol with a cruciform trigger bar that can be readily converted by hand or with common household tools into a machinegun by the installation or attachment of a pistol converter, as specified.\"\n\nGlock Is Stuck Between a Rock and a Hard Place\n\nThat means the reliable mechanism which Glock and its imitators use is now illegal for further sale in California. Glock has been flattered with imitators because the company has stuck with a good design. It has slightly changed that design to discourage conversion to full-automatic fire—though without winning approval in California. But even if it were to swap its current mechanism for something different, that new design would almost certainly still be modifiable into something that Assemblymember Gabriel would call a \"machinegun.\" Of course, a new mechanism created to satisfy politicians' demands is unlikely to be as reliable as the existing one, risking Glock's reputation in return for minimal gain.\n\nGabriel and his fellow legislators claim to be motivated by crimes in which Glocks converted to automatic fire were used. But criminals are as subject to trends as politicians and headline writers. They learned to hold pistols sideways from Hollywood movies, even though it ruins aim, and they convert Glocks to automatic even though it's hard to control a pistol that's running through its magazine on one pull of the trigger because it's cool. They'll be on to something else next.\n\nAs has happened in other countries and is occurring in the U.S., that next thing is likely to be homemade guns built without regard for laws or the alleged concerns of politicians. If those guns are purpose-built submachine guns, they'll be more effective and dangerous than pistols converted to automatic fire.\n\nSo, California's Glock ban won't inconvenience criminals who already ignore the rules. Nor will Kamala Harris's California Highway Patrol security detail feel the effects, since police are exempted. Instead, Californians without special connections will be barred from purchasing a popular firearms brand.\n\nGlock Ban Challenged in the Courts\n\nIt's too much to hope California lawmakers will admit that they're posturing for no good reason and legislating about matters they don't understand. Relief, if it comes, will arrive through a lawsuit brought by groups and individuals that advocate for self-defense rights. The lawsuit points out that the Supreme Court has held that \"a law that bans the sale of—and correspondingly prevents citizens from acquiring—a weapon in common use violates the Second Amendment.\"\n\n\"Every American has a right to choose the tools they trust to defend their lives and liberty. We look forward to ending this insanely unconstitutional scheme just as we have many others,\" comments Firearms Policy Coalition President Brandon Combs.\n\nUntil the relief arrives, Californians should seriously consider just how much deference they want to pay to bad laws passed by ridiculous politicians.","summary":"According to California lawmakers, Kamala Harris’s pistol is a potential machinegun.","url":"https://reason.com/2025/10/17/californias-latest-dumb-gun-law-is-a-ban-on-glocks/","image":"https://reason.com/wp-content/uploads/2025/10/glock-pistol-handgun-firing-range-1200x675.jpg","video":null,"publish_date":"2025-10-17 11:00:40","author":"J.D. Tuccille,Steven Greenhut","authors":["J.D. Tuccille","Steven Greenhut"],"language":"en","source_country":"US","sentiment":-0.247},{"id":370104264,"title":"The Loop NFL Picks: Week 7","text":"Eagles at Vikings (+1½)\nBecause of the lingering high ankle sprain of J.J. McCarthy, Minnesota quarterback Carson Wentz is expected to face his old team that he helped lead to the Super Bowl eight years ago. Vikings fans hoping to see the young McCarthy start have a greater chance on Sunday of seeing the Epstein files.\nPick: Eagles by 3\n\nPanthers at Jets (+1½)\nNew York and Justin Fields hit a franchise low last Sunday in London by tallying minus-10 net yards passing during their loss to Denver. The only possible way they could have done worse in the air is if they flew home on Spirit Airlines.\nPick: Panthers by 7\n\nBuccaneers at Lions (-5½)\nTampa Bay, at 5-1, is tied for the best record in the league, and quarterback Baker Mayfield is the early front-runner for the NFL Most Valuable Player award. Recent presidential runner-up Kamala Harris said she hasn’t seen a better candidate since Kamala Harris.\nPick: Lions by 7\n\nGiants at Broncos (-7½)\nGiants rookie Cam Skattebo made headlines by rushing for three touchdowns against Philadelphia, then ripping his shirt off during a postgame TV interview. He’s now the answer to a trivia question: What if Rob Gronkowski and the Hunchback of Notre Dame had a child.\nPick: Broncos by 1\n\nRaiders at Chiefs (-12½)\nKansas City’s offense will get a needed boost with the return from suspension of Rashee Rice. The standout wide receiver is expected to hit the ground running at full speed, which for him is 119 miles per hour.\nPick: Chiefs by 8\n\nPatriots at Titans (+7½)\nNew England is the surprising leader of the AFC East thanks to the red-hot start for Drake Maye. That’s startling because, as most Patriots fans can remind you, the 23-year-old quarterback isn’t quite old enough to date Bill Belichick.\nPick: Patriots by 17\n\nDolphins at Browns (-2½)\nMiami has turned into a 1-5 dumpster fire, and the coaching hot seat could not get any more broiling for Mike McDaniel. The Dolphins’ coach would no doubt have already been summarily fired if he worked at, say, Penn State.\nPick: Dolphins by 3\n\nColts at Chargers (-1½)\nColts backup quarterback Anthony Richardson suffered serious facial injuries last week during a freak incident during his warmups at Lucas Oil Stadium. Indianapolis police eventually ruled it an accident after initially suspecting Mark Sanchez.\nPick: Chargers by 3\n\nCommanders at Cowboys (+1½)\nCommanders star Jayden Daniels took responsibility Monday night after his late fumble helped hand the victory to Chicago. Despite the quarterback’s blunder, most Washington fans, out of habit, blamed Daniel Snyder.\nPick: Commanders by 3\n\nPackers at Cardinals (+6½)\nGreen Bay’s Josh Jacobs scored two TDs last week against Cincinnati despite being weakened by the flu. The star running back admitted to throwing up several times during the game, which is roughly par for dudes at Lambeau Field.\nPick: Packers by 7\n\nOther games\n\nRams vs. Jaguars (+2½)\nPick: Rams by 3\n\nSaints at Bears (-5½)\nPick: Bears by 7\n\nTexans at Seahawks (-3½)\nPick: Seahawks by 7\n\nFalcons at 49ers (-1½)\nPick: 49ers by 3\n\nRavens, Bills\n\n10-5 straight up\n9-6 vs. spread\n\n54-38-1 straight up (.587)\n45-48 vs. spread (.484)\n\nAll-time (2003-25)\n3873-2139-15 straight up (.644)\n2955-2927-145 vs spread (.502)\n\nYou can hear Kevin Cusick on Thursdays on Bob Sansevere’s “BS Show” podcast on iTunes. You can follow Kevin on X– @theloopnow. He can be reached at kcusick@pioneerpress.com.","summary":"Every Sunday, Kevin Cusick makes his predictions against the Las Vegas point spread, the way God intended …","url":"https://www.twincities.com/2025/10/17/the-loop-nfl-picks-week-7-10/","image":"https://www.twincities.com/wp-content/uploads/2025/09/STP-Z-LOOPNFL-0921-09.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-17 11:00:13","author":"Kevin Cusick","authors":["Kevin Cusick"],"language":"en","category":"sports","source_country":"us","sentiment":-0.136},{"id":370151696,"title":"Ceasefire doesn't mean peace","text":"House Speaker Mike Johnson, a quick study in the art of laying it on thick, announced that he was teaming up with Israel’s Knesset speaker to invite parliamentary leaders from around the world to jointly nominate Donald Trump for the Nobel Peace Prize — and for nothing less than inaugurating “a new golden age.”\n\nThough refraining from that level of MAGA-fication, Democrats have not stinted on the praise due to Trump for achieving the ceasefire and hostage agreement. Former National Security Adviser Jake Sullivan, Bill and Hillary Clinton, Senate Minority Leader Chuck Schumer, Joe Biden and Kamala Harris have all offered kudos.\n\nBut the rush to declare a new dawn in the Middle East, as Trump and his claque have done, is premature. Yes, it is an unmixed good that the bombs have stopped falling on Palestinian neighborhoods and that the hostages, imprisoned in dungeons for two years, are at last free. Trump deserves praise for getting us to this moment with whatever combination of promises, threats and inducements he offered. All good.\n\nBut let’s keep our heads. This is a ceasefire; it is not peace.\n\nPeace requires that both parties to a conflict accept they cannot achieve their objectives through further violence. The attacks of Oct. 7, 2023, shattered what was left of Israeli trust in their Palestinian counterparts. Support for a Palestinian state once commanded majority support in Israel. That optimism took a big hit after the Second Intifada and collapsed after Oct. 7. Today, only 21% of Israeli adults believe they can peacefully coexist with a Palestinian state.\n\nThe views of ordinary Palestinians are difficult to determine with accuracy due to the stress of war, Hamas’ ruthless repression and other restrictions, but recent polling has found that fewer than 40% of Palestinians support Hamas (though 90% disbelieved accounts of Hamas atrocities against Israelis on Oct. 7). A 2021 poll found that majorities of Palestinians in the West Bank and Gaza rejected the idea of a two-state solution in favor of one Palestinian entity “from the river to the sea.”\n\nWhile one can (just barely) imagine a scenario in which a consortium of nations, including Arab and Muslim countries, unites to restore Gaza’s infrastructure, the crystal ball gets cloudy when you try to picture a governance plan for Gaza that excludes Hamas, let alone an independent Palestinian state without Hamas.\n\nLeading up to the ceasefire and hostage release, Hamas and Israel signed onto a 20-point plan that is aspirational but also unspecific, vague and already being violated.\n\nThe fourth declaration in the 20-point plan specified that within 72 hours of signing the agreement, all hostages living and dead would be returned to Israel. That has not happened. Only eight of the 28 bodies have been released, and one of those has been determined not to be that of any of the hostages.\n\nNo sooner did the bombs cease than Hamas fighters began hunting down members of clans who challenge their supremacy. The ceasefire document states that “Hamas and other factions agree to not have any role in the governance of Gaza, directly, indirectly, or in any form.” It’s a worthy aspiration, but saying it — even flanked by world leaders at a meeting in Sharm el-Sheikh, Egypt — doesn’t make it so.\n\nThe outlines of what the plan calls a “New Gaza” are gauzy. A “technocratic, apolitical Palestinian committee” will run Gaza until such time as a reformed Palestinian Authority can take over. Who will choose these technocrats? And how can “apolitical” technocrats (whatever they are) really run a territory? To whom will they be answerable? Who will police the streets? Who will disarm Hamas?\n\nOne can imagine a truly gifted statesman or group of them with huge doses of dedication, time, money and, perhaps, a dash of humility undertaking such a mission on the understanding that this would be the work of years if not decades.Instead, we have the leadership of Trump, who has inserted himself mostly out of lust for glory (read: Nobel Peace Prize), whose time horizon can usually be measured in nanoseconds and who has been known to claim a win long before the game is over. Recall that after one brief visit with Kim Jong Un during his first term, he declared the nuclear threat from that nation to be over.\n\nIt was just a few months ago that Trump was toying with ethnically cleansing the Gaza Strip and turning it into an Arab Riviera under U.S. authority.\n\nTrump did join Israel’s bombing of Iran’s nuclear sites and insisted that the nuclear program was “obliterated,” a finding that intelligence assessments did not support.\n\nAsked the classic, even cliched question about the conflict, Trump’s off-the-cuff response was, “We’re talking about rebuilding Gaza. I’m not talking about single state or double state. ... At some point, I’ll decide what I think is right.”\n\nHe may do just that, or he may be off on another tear about something else. Character is destiny, and Trump’s character is made for division and chaos, not the spadework of diplomacy. The ceasefire and hostage release should be celebrated, but it would be folly to expect much more.\n\nMona Charen is policy editor of The Bulwark and host of the “Beg to Differ” podcast.","url":"https://chicago.suntimes.com/columnists/2025/10/17/ceasefire-israel-gaza-palestinians-donald-trump-mona-charen","image":"https://cst.brightspotcdn.com/dims4/default/4850583/2147483647/strip/false/crop/6014x4009+0+0/resize/1486x991!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F49%2Faf%2F73a7743e48089bbaf4f9fb2c999c%2Fap252","video":null,"publish_date":"2025-10-17 11:00:00","author":"Mona Charen","authors":["Mona Charen"],"language":"en","source_country":"us","sentiment":-0.176},{"id":370124820,"title":"Parents remember who’s in charge of their children’s education","text":"Like so many families in America, I lost faith that schools were going to respect parents and put education over ideology.\n\nVIRGINIA DEMOCRATS WANT TO BRING RADICALISM BACK TO THE COMMONWEALTH\n\nThen came the moment that changed everything. In a now-infamous debate moment, former Gov. Terry McAuliffe commented that “parents shouldn’t be telling schools what to teach.” That single line ignited a sleeping giant among parents in the once-Democratic stronghold of Virginia. It was the movement that delivered Glenn Youngkin the governorship and restored parents to their rightful place at the head of their children’s education.\n\nSince then, Virginia has experienced a powerful transformation, and parents have been put back in the educational driver’s seat. \n\nUnder Youngkin, a Republican, Virginia students are climbing back up national rankings after years of decline. Test scores are up, chronic absenteeism is down, and transparency is back.\n\nThe contrast couldn’t be clearer. Under Democratic leadership, Virginia schools were failing both children and families. Under Youngkin, they’re beginning to thrive.\n\nNow, Virginians face another choice: continue this progress, or return to the same disastrous policies that silenced parents, sexualized classrooms, welcomed boys in girls’ locker rooms, and radicalized children’s curriculum. \n\nAnd last week’s gubernatorial debate was another defining event. \n\nWhen pressed about important questions that deserve honest answers, Spanberger looked like a deer in the headlights. When asked about her party’s attorney general nominee Jay Jones’s appalling text messages (“joking” about the hypothetical killing of a Republican lawmaker and that lawmaker’s children), Spanberger was mute. When asked if boys should be allowed in girls’ bathrooms, Spanberger spewed a classic nonanswer word salad that would make even Kamala Harris blush. \n\nAs the saying goes, it was déjà vu all over again. \n\nIt was the same dishonesty and smugness that parents saw right through in 2021. The same refusal to stand up for the basic common sense that Virginians are desperate to see restored. \n\nIn 2024, then-candidate Donald Trump won back the White House by championing basic, decent values that Virginians (and frankly, all Americans) are desperate to revive. I had the opportunity to visit Mar-a-Lago and show the president firsthand just how important family and parental rights issues are to voters. And in the final stretch of his campaign, Trump leaned into the culture war, cutting through the noise with a clear, sensible message that resonated across swing states like Virginia. \n\nThe governor’s race in the commonwealth is another defining moment.\n\nSPANBERGER PRETENDS SHE DOESN’T UNDERSTAND TITLE IX\n\nSpanberger’s silence on core questions that affect the lives of Virginia’s families should be disqualifying for all parents who care about their children’s future.\n\nVirginians remember what it felt like to be ignored by our government. And this November, we’ll remind Democrats: Parents must always have a say in our children’s education.\n\nTerry Schilling is a parental rights advocate and president of the American Principles Project.","summary":"The deafening silence of Abigail Spanberger during her debate with Lt. Gov. Winsome Earle-Sears (R-VA) should awaken every parent in Virginia. As a Fairfax County father of seven, I remember exactly what it felt like when parents’ voices were silenced under the reign of the Democrats. During former Gov. Ralph Northam’s tenure, Virginia’s public schools [&#8230;]","url":"https://www.washingtonexaminer.com/restoring-america/community-family/3853013/abigail-spanberger-parent-education-rights-virginia-elections/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP25262602613491.jpg?w=696","video":null,"publish_date":"2025-10-17 10:00:00","author":"Terry Schilling","authors":["Terry Schilling"],"language":"en","source_country":"US","sentiment":-0.233},{"id":370070390,"title":"In small towns and rural communities, young voters say they feel unseen by leaders","text":"Andrew Tait has a long workday. He bookends shifts as a warehouse supervisor for a nearby factory with early morning and late night chores on his family's small farm in rural Shenandoah Valley, Virginia.\n\nHe's quick to call himself lucky. But no matter how much the 36-year-old father of two young girls works, he says they barely scrape by — and the goalposts for success keep moving.\n\n\"I have a mortgage, and it's paid every month. But the thought of my children's birthdays or holidays terrifies me,\" Tait said. \"What if the grocery bill goes up again? I mean, I'm on a shoestring.\"\n\nHe's among a generation of young Americans confronting a daunting reality: one of inflated prices and growing concerns about their financial futures. It's an experience facing Gen Z and millennial voters throughout the U.S., each in their own unique ways. For those living in rural communities and small towns, it's left many feeling as if their hardships have gone unseen and unaddressed by politicians vying for their support.\n\nOver the summer, Tait decided to write an essay titled \"Living in the Shadow of the American Dream.\" In it, he shared that he and his partner have put off getting married because he worries that if they did, it would force her and their daughters off Medicaid, and his job's healthcare plan is too expensive for the whole family to afford.\n\n\"I'm not ashamed of our life. It's honest work, and it's full of love,\" Tait wrote. \"However, I am ashamed that in a country as wealthy as ours, people like us are left out in the cold.\"\n\nBy the next presidential election, Gen Z and millennials are projected to make up more than half of the electorate. But many, including Tait, say they've grown dissatisfied with political leaders as they wrestle longstanding financial concerns.\n\n\"I'm really just tired of voting for who I hate least,\" said Tait, who declined to specify how he voted in the 2024 presidential election, but said politicians should focus on improving access to quality food, healthcare and education.\n\n\"I want somebody to inspire me,\" he added. \"It doesn't matter if you're red or blue, whatever side of the aisle you're on, like, come on, guys, what do we want?\"\n\nIt's a common feeling for many young people today, and partially why President Trump's economic message may have resonated with a greater share of young voters last year, says Lee Miringoff, director of the Marist University Institute for Public Opinion.\n\n\"He's making connections with people who are very dissatisfied with the way things are. And therefore, being a candidate who's going to disrupt and change things is a major attraction for a hunk of the electorate that is feeling that economic stress,\" he said. \"That's perhaps most profound with younger people.\"\n\nBut those economic pressures aren't new to many in rural areas, says Nicholas Jacobs, a professor of government at Colby College. These communities have faced such issues for decades, though now, he argues, the difference is that the politics have changed.\n\n\"What I believe to be true from my surveying of rural populations and young people in rural areas is they don't feel like they have two alternatives. They do not feel like the Democratic Party gives them a set of answers to those problems,\" he said. \"I don't think most rural people feel like the Democratic Party even thinks about these problems.\"\n\nDoubting the American Dream\n\nAfter growing up during periods of financial volatility and uncertainty, economic concerns have continued to loom large for Gen Z and millennial Americans.\n\nYounger people collectively make up more than 60% of the labor force and are poised to surpass older generations in educational attainment.\n\nHowever, many still worry about having successful lives. Seven in 10 Gen Zers say jobs are difficult to find right now, along with nearly 6 in 10 millennials, according to a Marist poll from April. An analysis from Pew Research Center last year also found that both generations are less likely to say the American dream is still possible, compared to the generations before them.\n\nHousing is a major worry, with home and rental prices increasing at a faster rate than wages over the last two decades. The median age of a first-time homebuyer has also drastically increased, going from 28 in 1991 to 38 last year, according to the National Association of Realtors.\n\nThis combination of concerns has pushed some young Americans toward more left-leaning, populist ideas and caused others to feel unsatisfied by today's political leaders.\n\n\"I don't really think that there's any one person who really is addressing it,\" said Paul Staley, 35, who lives in a small town outside Birmingham, Alabama with his wife and kids.\n\nHe's one of more than a thousand young people who responded to an NPR callout about how economic concerns have shaped their lives.\n\nStaley works as a field service engineer fixing medical equipment. Raised in a blue-collar household, he can see clear differences between his life and that of his father.\n\n\"He could afford a brand new Corvette as a butcher, but these days, me with a college degree and 10 years of experience, I couldn't hope to really afford a brand new car like that,\" he said. \"The difference is too great. You don't have that same type of opportunity.\"\n\nStaley previously voted for Trump but says he has since gravitated more towards the political center, acknowledging that while he remains interested in the president's economic agenda and did benefit from his tax cut policy, he wants to see additional action on things like rising costs and worker protections.\n\nThose two issues in particular have drawn him more recently to Sen. Bernie Sanders, I-Vt., and Zohran Mamdani, the Democrats' nominee for mayor in New York.\n\n\"These issues are pushing people to their ideological — I don't want to say extremes — but to the end of the political spectrum … I think the answer lies more somewhere in the middle,\" he said. \"Hard work needs to mean more.\"\n\nFeeling left behind \n\nFor others, what matters is opportunities, rather than politics.\n\nJulie Hill, 22, lives in rural northwest Pennsylvania. She says politicians often overlook communities like hers.\n\n\"It can be hard to kind of feel like we're being seen,\" said Hill, who identifies as an independent but voted for former Vice President Kamala Harris last year. \"It seems like rural areas get left behind sometimes.\"\n\nHill is unemployed, currently part of an outpatient rehab program as she deals with mental health challenges, and she's also had to support herself financially after losing family in recent years.\n\nHer dream is to own a home one day, with enough land to raise animals. She loves horses and is still pained by the memory of having to give up her own horse as a teenager when finances got tight.\n\nThat said, Hill admits that homeownership is far away for her, recalling that all the homeowners she knows either inherited land or bought decades earlier when prices were lower.\n\n\"They kind of had that support upfront. They had a place to kind of start out, I guess, whereas I'm starting from complete scratch,\" she said. \"It seems like even just an acre around here is as much as a house was like probably 30, 40 years ago.\"\n\nHill wants to have hope that her American dream can become a reality, but says it doesn't feel possible right now.\n\n\"The story of Sisyphus and the rock, that's kind of what it feels like. You're just pushing that rock up every day just to have it roll back down again,\" she said. \"I've felt like that for a long time, so be nice to be able to get the rock up top and then be able to start building.\"","summary":"Gen Z and millennial voters will make up more than half of the electorate in 2028. They're a crucial bloc for both parties, but many are facing daunting economic realities and feel unseen by leaders.","url":"https://www.npr.org/2025/10/17/nx-s1-5530146/in-small-towns-and-rural-communities-young-voters-say-they-feel-unseen-by-leaders","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3614x2410+0+0/resize/3614x2410!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2F8c%2F43017a1540e5bb8c5e32dedd28aa%2Fandrew-tait-023-update.jpg","video":null,"publish_date":"2025-10-17 09:00:00","author":"Elena Moore","authors":["Elena Moore"],"language":"en","source_country":"us","sentiment":0.035},{"id":370066486,"title":"No ‘Abundance’ of caution: Populists and progressives are winning the argument among Democrats","text":"Progressive Democrats have watched as the Republican Party under President Donald Trump has turned from a free-market party to one that embraces policies unheard of before 2015. From Trump pushing tariffs to taking stakes in private companies, a significant portion of the Democratic Party believes it needs to capitalize on the pro-populist movement by staking its claim to win back some of the voters who gravitated toward the GOP. \n\nThe messaging around economic issues — including housing, healthcare costs, economic inequality, job insecurity, trade protectionism, distrust of the democratic process, and distrust of institutions — resonates with many voters, possibly giving Democrats an opportunity to reclaim some voters or attract new supporters. \n\nSome in Democratic circles think the better way to go is to embrace the so-called “abundance agenda,” coined from the book Abundance by New York Times columnist Ezra Klein and former writer from the Atlantic Derek Thompson. The idea is a supposed reorientation of progressive politics away from scarcity and knee-jerk defensive regulation and toward building, growth, and scale. They argue that many of the pathologies afflicting politics, including the housing shortage, environmental inaction, stalled infrastructure, and underutilized innovation, stem from burdensome regulation, an overemphasis on process, and an aversion to scale.\n\nIt’s almost a rebirth of Al From’s “New Democrat” movement, which sought to move the party away from the left and more toward the center, that proved successful with the election of Bill Clinton in 1992, after three straight defeats at the hands of Ronald Reagan and George H.W. Bush. \n\nStill, it is the populist message that appears to be winning at the moment, and a win by Mamdani in New York City, despite it being a deep-blue city, will only accelerate that trend.\n\nHowever, no matter what strategic path Democrats take, the party has a glaring weakness that costs it more credibility than any policy proposal or idea, and that is the influence of the hard-left progressive Democrats in the party and the insistence on embracing a range of social and policy issues that fall far outside the mainstream of most Americans’ views. These are not minor disagreements at the margins. They’re positions on cultural and policy issues that alienate voters Democrats need to win in places far removed from deep-blue cities. \n\n“Defund the police” may have been a slogan, but in much of the country, it landed like a declaration. The same goes for sweeping rhetoric on immigration, gender identity, and foreign policy. All issues that play well on social media, podcasts, and MSNBC but fall flat with voters Democrats need to win. The result is a party that often looks more defined by its loudest voices than by its most pragmatic ones.\n\nNowhere is this disconnect more evident than on gender identity. A movement that progressive activists frame as a moral imperative is seen by most people as an attempt to reengineer cultural norms overnight. Whether it’s debates over gender ideology in schools, pronoun mandates, or medical interventions for minors, these issues alienate far more voters than they attract, and Republicans know it. \n\nOne of Trump’s most effective campaign ads featured a 6-year-old video of former Vice President Kamala Harris saying that “every transgender inmate in the prison system would have access” to taxpayer-funded sex-change operations. The ad closed by saying, “Kamala is for they/them. President Trump is for you.” \n\nStates and the federal government have introduced legislation to ban biological men from competing in women’s sports. While some efforts have been successful, others have failed, including a Senate effort that Democrats unanimously voted to block from reaching the floor for a vote. Members did not oppose the legislation because it’s untrue that biological men are competing in women’s sports in high schools and colleges. Their opposition was based on the idea that it was unnecessary because it didn’t happen often. Sen. John Hickenlooper (D-CO), following his vote to block the legislation, said, “It’s an infinitesimally small group of people that are really trying to find their ways.”\n\nThe issue is a political gimme, which makes the Democratic position all the more baffling. A January New York Times-Ipsos poll asked more than 2,000 adults, “Thinking about transgender female athletes — meaning athletes who were male at birth but who currently identify as female — do you think they should or should not be allowed to compete in women’s sports?”\n\nNearly 80% of those polled said they should not be allowed to compete in women’s sports, including 67% of Democrats. Only 18% think they should. Democrats continue to dig in, supporting “gender affirming care” when most people know it means puberty blockers, hormone therapy, and sex reassignment surgeries. It’s a political loser, but Democrats are so afraid of angering their activist base that they’ll keep defending it anyway. \n\nGender identity and trans “rights” aren’t the only cultural minefield Democrats keep stepping on. Immigration has become another glaring example of how the party’s loudest members are out of step with the country. While progressive activists denounce border security measures as “cruel” or “xenophobic,” a majority of Americans, including a significant number of Democratic voters, say the border isn’t secure and want stricter enforcement. The gap between the rhetoric and reality is enormous.\n\nFollowing Joe Biden’s election in 2020 and the COVID-19 pandemic, illegal immigration, particularly at the southern border, soared. Democrats and the administration pretended it wasn’t happening and conducted the usual tactic of saying Republicans were attacking “immigrants” to deflect from the issue of illegal immigration. That strategy might have worked when the problem was primarily theoretical, but voters now saw the crisis firsthand. Cities far from the border, including Chicago, New York, and Denver, had to declare states of emergency as they struggled to deal with the surge of migrants. And yet the party’s progressive wing still insists the real problem isn’t the border itself but “Republican fearmongering.”\n\nHowever, the polling does not align with their rhetoric. The previously mentioned New York Times poll also asked about illegal immigration. One question asked about support or opposition to the following: “deporting immigrants in the country illegally who arrived during the recent wave of migration to the southern border over the last four years.”\n\nSixty-four percent of people, including 44% of Democrats, supported deporting them. When asked if they supported deporting all immigrants in the country illegally, 56% supported it, with the highest level coming from Republicans. Still, 32% of Democrats support such a policy. \n\nTrump’s immigration crackdown involving Immigration and Customs Enforcement raids has had mixed results, with the press focusing heavily on mistakes, protesters getting attacked, and overly hyperbolic messaging about ICE officers wearing masks. Still, it is difficult to argue with Trump’s success overall when it comes to tackling illegal immigration. During Trump’s time in office, there has been a precipitous drop in border encounters, according to data from Customs and Border Protection. In August this year, CBP had 9,740 encounters at the border. In August 2024, that figure was 101,790. In 2023, the number was 269,735, and in 2022, it was 227,547. That is a jarring difference, and one that Republicans will use to show Trump’s effectiveness on the issue. \n\nIf gender identity and immigration reveal how far Democrats have drifted from the mainstream, their continued fixation on race and “equity” shows how deeply that disconnect runs. What began as a conversation about fairness has, in the hands of the activist Left, turned into a rigid ideological framework that ends up dividing, instead of uniting, which they claim is their goal. Instead of emphasizing equality of opportunity, Democrats increasingly talk in the language of systemic guilt, privilege, and redistribution. It is language that alienates voters who might otherwise be persuadable.\n\nThe issue has faced significant backlash over the last several years, with some universities scaling back their diversity, equity, and inclusion initiatives in response to state laws and federal directives. Corporations such as Amazon, Google, AT&T, and McDonald’s have eliminated or rolled back their programs. \n\nDemocrats, rather than examining whether or not such programs and initiatives offer any real value or acknowledging voter concerns, have retreated to their usual position of crying foul and calling those opposed racists, bigots, and misogynists. \n\nMost people may support fairness, but they don’t want lectures. And when every issue is filtered through a lens of race and oppression, Democrats stop sounding like problem-solvers and sound more like their activist base. \n\nAll of these issues — gender identity, immigration, and race — have one thing in common: They’ve become litmus tests for the party’s loudest voices, not the voters it needs to win. If Democrats can’t figure out how to square their economic populism with cultural reality, they’ll be handing Republicans an easy playbook for years to come.\n\nJay Caruso is a writer residing in West Virginia.","summary":"New York City will likely elect a socialist as its next mayor despite his unapologetic stance on his positions and policies. Elected progressive Democrats and fellow activists see the probable election of Zohran Mamdani as proof that Sen. Bernie Sanders (I-VT) and Rep. Alexandria Ocasio-Cortez‘s (D-NY) playbook is alive and well.&#160; Progressive Democrats have watched [&#8230;]","url":"https://www.washingtonexaminer.com/premium/3852747/no-abundance-of-caution-populists-progressives/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/Fea.NoAbundance.102225.jpg?w=696","video":null,"publish_date":"2025-10-17 08:25:00","author":"Jay Caruso","authors":["Jay Caruso"],"language":"en","category":"politics","source_country":"us","sentiment":-0.546},{"id":369983656,"title":"Benioff slammed by longtime VC ally over call for troops in San Francisco","text":"By Biz Carson and Felipe Marques\n\n(Bloomberg) — Venture capitalist Ron Conway is leaving the board of Salesforce Inc.’s philanthropic foundation after blasting Chief Executive Officer Marc Benioff for calling on President Donald Trump to send the National Guard to San Francisco.\n\n“It saddens me immensely to say that with your recent comments, and failure to understand their impact, I now barely recognize the person I have so long admired,” Conway said in an email sent Thursday to Benioff and several board members of San Francisco-based Salesforce. A copy of the message was reviewed by Bloomberg News.\n\nConway told Benioff that he was “shocked and disappointed by your comments calling for an unwanted invasion of San Francisco by federal troops and by your willful ignorance and detachment from the impacts of the ICE immigration raids of families with NO criminal record, attacks on freedom of speech, and other unlawful policies.”\n\nOn Wednesday, Trump floated San Francisco as a potential target for National Guard deployments as part of his federal crime crackdown. Benioff told the New York Times last week that he supported such a move. “If they can be cops, I’m all for it,” he said.\n\nConway declined to comment through a spokesperson, while Benioff didn’t respond to a request for comment. A Salesforce representative said in a statement, “We have deep gratitude for Ron Conway and his incredible contributions to the Salesforce Foundation board.”\n\nThe email was reported earlier Thursday by the Times.\n\nTrump has moved to deploy US troops and federal law enforcement officials to major cities — including Los Angeles, Washington, Memphis, Chicago and Portland — to target crime and counter demonstrations against his deportations of undocumented migrants. The president has claimed that Democratic state and local officials have failed to protect citizens and allowed violence to spiral out of control, even as San Francisco’s crime rates have fallen in recent months and the city is on track to see the fewest homicides since the 1950s.\n\nConway’s acrimonious message lays bare a larger conflict within Silicon Valley, as tech luminaries, including some longtime Democratic donors like Benioff, have flocked to Trump. In the tight-knit circle of big tech and venture capital, that shift is causing tensions that are now bubbling up to the surface.\n\nConway, 74, has long been an ally of Benioff’s and served on the foundation’s board for more than a decade. The founder of SV Angel, Conway has been a major political donor, backing Democrat Kamala Harris for president on 2024. He has also been involved in local San Francisco causes, including helping fund Mayor Daniel Lurie’s inauguration.\n\nThe comments caused an uproar in San Francisco, where Benioff, 61, held his firm’s Dreamforce event this week, which attracts tens of thousands of Salesforce employees and customers. Comedians Kumail Nanjiani and Ilana Glazer canceled their performances at the three-day event, though neither publicly criticized Benioff or Salesforce, according to the San Francisco Standard.\n\nIn his email, Conway lambasted Benioff for his threats to move the event from the city. “Dreamforce is important to San Francisco and the city bends over backward to make it a success,” he said. “But San Francisco does not need a federal invasion because you don’t like paying for extra security for Dreamforce.”\n\n©2025 Bloomberg L.P.","summary":"“It saddens me immensely to say that with your recent comments, and failure to understand their impact, I now barely recognize the person I have so long admired,” Ron Conway said.","url":"https://www.mercurynews.com/2025/10/16/salesforce-benioff-ron-conway/","image":"https://www.mercurynews.com/wp-content/uploads/2018/05/sjm-salesforce-0522-17.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-17 02:31:31","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"us","sentiment":-0.306},{"id":369982726,"title":"Mamdani and Sliwa Challenge Cuomo in Heated NYC Mayoral Debate Showdown","text":"During the first general election mayoral debate on Thursday, Andrew Cuomo found himself in the hot seat, as Democratic front-runner Zohran Mamdani and Republican contender Curtis Sliwa launched a barrage of criticisms against the former governor. They targeted Cuomo on various issues, including his dependence on billionaire donors and what Mamdani portrayed as an overly cozy relationship with former President Trump.\n\nCuomo, who is running as an independent in the upcoming November 4 mayoral election, responded primarily to Mamdani’s attacks. He argued that the 33-year-old democratic socialist lacks the requisite experience to lead the city and accused him of holding extreme views on taxation, defunding the police, and the Israel-Hamas conflict.\n\n“His divisiveness is chronic,” Cuomo remarked during the lively two-hour debate, which took place at the NBC studios in 30 Rockefeller Plaza.\n\nTo support his claims, Cuomo referenced Mamdani’s previous endorsement of defunding the NYPD—a stance Mamdani has since revised as a mayoral candidate. Cuomo also criticized Mamdani’s perceived harsh position on Israel, particularly his hesitation during a recent TV appearance to urge Hamas to disarm and his apparent reluctance to affirm Israel’s right to exist as a Jewish state.\n\nThis comment about Hamas caused Mamdani to pivot from his earlier stance. “Of course I believe that they should lay down their arms,” stated Mamdani, a vocal advocate for Palestinian rights.\n\nThroughout the debate, Mamdani, often with support from Sliwa, contended that Cuomo represents the entrenched status quo, a leadership style that he argues is misaligned with the needs of New Yorkers amidst a rising cost of living crisis and threats of funding cuts from the Trump administration.\n\n“If you want more of the same, vote for Andrew Cuomo,” Mamdani said, accusing him of lacking “integrity,” citing, among other things, his resignation as governor in 2021 amid sexual and professional misconduct accusations he now denies.\n\nSlliwa, who’s polling in third place behind Cuomo and Mamdani, blasted both his opponents. But keen to attract some of Cuomo’s politically moderate supporters, Sliwa singled out Cuomo as his main target, tearing into him over public safety reforms he enacted as governor and also questioning whether he’d be able to work with Trump or stand up to him.\n\n“You think you’re the toughest guy around,” Sliwa told Cuomo, seeking to ridicule his claim that he’s best equipped to deal with Trump because of his long record in government.\n\n“I agree with Curtis,” added Mamdani, who accused Cuomo of being “Trump’s puppet,” citing overlapping donors as well as the president’s apparent preference for the ex-governor’s campaign. Trump was reportedly engaged in efforts to push Mayor Eric Adams to exit the race as part of an effort to make it easier for Cuomo to take on Mamdani.\n\nIt made for an unusual dynamic, as the front-runner in a mayoral race is typically the main target in a debate setting.\n\nAccording to polls, the Nov. 4 election remains Mamdani’s to lose. They show him edging out Cuomo by 13% and Sliwa by 30% in the most recent survey of the race conducted earlier this month by Quinnipiac University. Thursday’s debate, which at times delved into deeply personal issues like Mamdani’s religion and Cuomo’s family history, came just over a week before early voting begins Oct. 25.\n\nThis year’s campaign is no typical mayoral race, as Cuomo, a life-long Democrat, runs as an independent in the Nov. 4 election even though he lost June’s Democratic mayoral primary to Mamdani by a 12% margin. Mayor Adams, who was also running as an independent, abandoned his bid for reelection last month amid record low approval ratings.\n\nThe race has also become a test for the two ideological factions of the Democratic Party, with Cuomo representing the more moderate, tradiitonal guard, while Mamdani has emerged as an icon for the left-wing since his upset primary victory.\n\nThat theme came up repeatedly during Thursday’s night debate, as Cuomo tried to make the case Mamdani isn’t a real Democrat.\n\n“You’re not a Democrat, you’re a democratic socialist,” he fumed at Mamdani before accusing him of not supporting Vice President Kamala Harris in the 2024 presidential election.\n\nMamdani affirmed he did vote for Harris and later declared: “Mr. Cuomo lies again and again and again.”\n\nWhile he mostly focused his ire on Cuomo, Sliwa did join the ex-gov in knocking Mamdani’s affrodability agenda as unrealistic. The Democratic nominee’s agenda includes promises to freeze the rent for stabilized tenants, make public buses free and drastically expand subsidized child care, all of it bankrolled by tax hikes on millionaires and corporations that would need to be approved by the state.\n\n“Your fantasies are never going to come about,” Sliwa told Mamdani.\n\nOne of the most tense moments of the debate was when Cuomo accused Mamdani of not being “representative of the Muslim community.”\n\nMamdani, who’d become the first Muslim mayor in New York history if elected, said it was “shameful” for Cuomo to deliver that line of attack.\n\nOn a lighter note, the candidates found some agreement when the moderators asked for their favorite mayor in New York City. Both Mamdani and Cuomo named Fiorello LaGuardia, while Sliwa offered up Rudy Giuliani.\n\nBefore the debate, Mamdani led a march from Trump Tower to the 30 Rock studios that included dozens of supporters, some of whom played brass instruments while chanting “Zohran, Zohran, Zohran.”\n\n“I’m very excited at the opportunity to take on Donald Trump’s puppet — and I’m not talking about Curtis Sliwa,” Mamdani told reporters before walking into 30 Rock.\n\nOriginally Published: October 16, 2025 at 9:55 PM EDT","summary":"Internewscast Journal\n\nInternewscast\n\n\nDuring the first general election mayoral debate on Thursday, Andrew Cuomo found&#8230;\n\n\nThis Post: Mamdani and Sliwa Challenge Cuomo in Heated NYC Mayoral Debate Showdown first appeared on Internewscast Journal","url":"https://internewscast.com/news/mamdani-and-sliwa-challenge-cuomo-in-heated-nyc-mayoral-debate-showdown/","image":"https://internewscast.com/wp-content/uploads/2025/10/Mamdani-Sliwa-gang-up-on-Cuomo-in-testy-NYC-mayoral.jpg","video":null,"publish_date":"2025-10-17 02:02:23","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.155},{"id":369991974,"title":"How Zohran Mamdani says he'll be the mayor of Wall Street and democratic socialists","text":"If elected&comma; democratic socialist Zohran Mamdani will be the mayor of all New Yorkers — including Wall Street.During a mayoral debate with his fellow candidates on Thursday&comma; Mamdani was asked how he&apos;d balance being a mayor of both the Democratic Socialists of America and the center of the finance industry.\"I would be the mayor of this entire city&comma;\" Mamdani said. \"And that means ensuring that the wealth that we generate in this city is also wealth that every single New Yorker can actually feel in their pockets. Because what we have today is a system that has generated the most wealth in the wealthiest country in the history of the world&comma; where one in four of our neighbors are living in poverty. That&apos;s unacceptable.\"Mamdani said he would be fighting for his neighbors in Queens who own small businesses&comma; like toy stores and dry cleaners&comma; and those who work for them.\"Because right now&comma; all of them are being pushed out of this city by corporate greed&comma; by private equity&comma; and by a politics that refuses to fight for them&comma;\" he said.Mamdani shocked New York City this summer when he led the Democratic primary over establishment candidate former Gov. Andrew Cuomo. He was declared the winner on July 1.The 33-year-old democratic socialist&apos;s platform is of concern to some on Wall Street&comma; particularly his aim to add a 2% income tax to those making more than $1 million and his plan to raise corporate taxes to 11.5%.Mamdani said the tax hikes — an idea that Gov. Kathy Hochul said she would be resistant to — will be used to fund city resources&comma; including public transportation and universal childcare. He added that if he could find the money for his proposals elsewhere&comma; he&apos;d drop the tax increase.Despite his loss in the primary&comma; Cuomo is still in the race as an independent&comma; and with current Mayor Eric Adams dropping out&comma; Cuomo is consolidating support from New York&apos;s elite&comma; including business leaders.Not everyone on Wall Street is rooting against a Mamdani win in November&apos;s general election&comma; and some rank-and-file members are donating to the upstart candidate. Business Insider&apos;s Alex Nicoll and Juliana Kaplan reported:Mamdani has also engaged with some of the city&apos;s tech elites&comma; positioning his progressive agenda through a pragmatic lens.Some business leaders&apos; views of the assemblyman&apos;s proposals range from sharply critical to skeptical.Billionaire Mark Cuban&comma; who supported former Vice President Kamala Harris&apos; 2024 campaign&comma; previously said Mamdani&apos;s campaign promise to freeze rent and develop city-owned grocery stores won&apos;t work.\"None of that shit has a chance. Doesn&apos;t matter&comma;\" Cuban said in a talk with \"Pod Save America.\"Thursday night was the first of two planned debates.","summary":"Zohran Mamdani was asked how he'd be mayor of Wall Street and democratic socialists. His answer was tax hikes and tackling corporate greed.","url":"https://www.businessinsider.com/zohran-mamdani-position-wall-street-tax-hikes-nyc-mayoral-debate-2025-10","image":"https://i.insider.com/68f16dcd5dbc4fd10dab049d?width=1200&format=jpeg","video":null,"publish_date":"2025-10-17 01:53:50","author":"Kelsey Vlamis,Lloyd Lee","authors":["Kelsey Vlamis","Lloyd Lee"],"language":"en","category":"politics","source_country":"us","sentiment":-0.016},{"id":369981958,"title":"Mamdani Does Not Deny Cuomo’s Accusation That He Skipped Voting For Kamala In 2024","text":"Democratic New York City mayoral nominee Zohran Mamdani did not appear to deny his opponent’s charge that he did not vote for former Vice President Kamala Harris in the 2024 presidential election.\n\nDuring Thursday’s debate, ahead of the New York City mayoral general election, former Democratic New York Gov. Andrew Cuomo, running for mayor as an independent, accused Mamdani, a self-identified democratic socialist, of not being a Democrat and not voting for Harris. Harris was the party’s failed nominee against then-candidate Donald Trump. Mamdani responded by appearing to not directly state whom he voted for in the 2024 general election. He instead said he supported leaving that year’s Democratic primary ballot blank to protest what he called “the Israeli genocide of Palestinians.” (RELATED: Democrats Hold Socialist Zohran Mamdani At Arms Length After He Declared Victory Over Party’s ‘Soul’)\n\n“You’re not a Democrat. You’re not a Democrat,” said Cuomo, who lost to Mamadani in the June 24 Democratic New York City mayoral primary. “You’re a democratic socialist. You didn’t vote for Kamala Harris, right?”\n\n“That’s an incendiary charge,” Mamdani replied while petitioning the moderator — who appeared to want to move on to another topic — for a chance to respond.\n\n“You didn’t say, leave it blank in the Kamala campaign?” Cuomo asked, referring to Mamdani endorsing a campaign for New York Democrats to oppose former President Joe Biden during the party’s 2024 primaries. This, to protest the way the Biden administration handled the war between Israel and Hamas. Harris was not a candidate during the primaries. She only entered the presidential race after Biden dropped out in July 2024.\n\n“I said leave it blank in the presidential primary because primaries are a place to air dissent,” Mamdani told Cuomo. “And like many Americans, I was horrified by the Israeli genocide of Palestinians.”\n\n“And if you want to look for me on the ballot you will find me as the Democrat,” Mamdani added, without directly addressing how he voted in the 2024 general election.\n\nMamdani has come under fire for failing to directly condemn the phrase “globalize the intifada,” which is widely regarded as a call for antisemitic violence.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"Democratic New York City mayoral nominee Zohran Mamdani did not appear to deny his opponent&#8217;s charge that he did not vote for former Vice President Kamala Harris in the 2024 presidential election. During Thursday&#8217;s debate, ahead of the New York City mayoral general election, former Democratic New York Gov. Andrew Cuomo, running for mayor as [&#8230;]","url":"https://dailycaller.com/2025/10/16/zohran-mamdani-andrew-cuomo-kamala-harris-debate/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FImage-10-16-25-at-8.01%E2%80%AFPM-e1760659392694.jpeg","video":null,"publish_date":"2025-10-17 01:40:28","author":"Anthony Iafrate","authors":["Anthony Iafrate"],"language":"en","category":"politics","source_country":"US","sentiment":-0.061},{"id":369990436,"title":"Trump refiles $15 billion defamation lawsuit against New York Times","text":"FIRST ON FOX — President Donald Trump refiled his $15 billion lawsuit against The New York Times on Thursday after a federal judge previously rejected the original suit due to its length. The amended complaint, filed in the U.S. District Court for Florida’s Middle District in Tampa, accuses The New York Times of defamation, citing two articles published in 2024 and a book authored by two Times reporters last year. He is seeking $15 billion plus punitive damages. \"President Trump is continuing to hold the Fake News responsible through this powerhouse lawsuit against the New York Times, its reporters, and Penguin Random House,\" a spokesman for Trump's legal team told Fox News Digital. JUDGE TOSSES OUT TRUMP'S $15 BILLION LAWSUIT AGAINST NEW YORK TIMES FOR BEING TOO LONG The named defendants are The New York Times Company, reporters Susanne Craig, Russ Buettner, Peter Baker and Michael S. Schmidt, and Penguin Random House, publisher of \"Lucky Loser: How Donald Trump Squandered His Father’s Fortune and Created the Illusion of Success,\" which was authored by Craig and Buettner. A spokesperson for The New York Times told Fox News Digital, \"As we said when this was first filed and again after the judge’s ruling to strike it: this lawsuit has no merit. Nothing has changed today. This is merely an attempt to stifle independent reporting and generate PR attention, but The New York Times will not be deterred by intimidation tactics.\" Fox News Digital also reached out to Penguin Random House for comment. TRUMP ANNOUNCES $15 BILLION LAWSUIT AGAINST THE NEW YORK TIMES FOR DEFAMATION, LIBEL Last month, a federal judge demanded the president's team to amend and shorten its original complaint, which was 85 pages long, to no longer than 40 pages, and gave his team a 28-day window to refile. The amended complaint is 40 pages. The revised suit alleges defamation pertaining to The Times' reporting on Trump's stint as star of \"The Apprentice\" and allegations he engaged in suspect tax maneuvers. This lawsuit follows others Trump had filed against ABC News, CBS News and The Wall Street Journal. Trump has already secured eight-figure settlements against ABC News and CBS News over the past year. ABC agreed to pay $15 million last December as a charitable contribution to a future presidential museum or foundation to settle Trump's defamation lawsuit. The suit was prompted by anchor George Stephanopoulos repeatedly saying on the air Trump had previously been held liable for rape, rather than sexual abuse. It also paid $1 million in legal fees. GEORGE STEPHANOPOULOS AND ABC APOLOGIZE TO TRUMP, ARE FORCED TO PAY $15 MILLION TO SETTLE DEFAMATION SUIT Trump also launched an \"election interference\" lawsuit against CBS over its \"60 Minutes\" interview of then-Vice President Kamala Harris last year, saying its editing decisions amounted to deceiving the public. Ahead of a planned $8 billion merger with Skydance Media, CBS parent company Paramount settled the lawsuit in July to a total that could be upwards of $30 million. Fox News' David Rutz contributed to this report. CLICK HERE TO GET THE FOX NEWS APP","summary":"President Donald Trump revived his $15 billion lawsuit against The New York Times after a federal judge in Florida demanded the suit to be shortened within 28 days.","url":"https://www.foxnews.com/media/trump-refiles-15-billion-defamation-lawsuit-against-new-york-times","image":"https://static.foxnews.com/foxnews.com/content/uploads/2021/03/Trump-New-York-Times.jpg","video":null,"publish_date":"2025-10-17 01:39:52","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.126},{"id":369973492,"title":"Billionaire Illinois Gov. Pritzker wins blackjack pot of $1.4M in Las Vegas","text":"By JOHN O’CONNOR\n\nSPRINGFIELD, Ill. (AP) — It figures that a billionaire would win big in Las Vegas.\n\nIllinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.\n\nThe two-term Democrat, often mentioned as a 2028 presidential candidate, told reporters in Chicago on Thursday that he drew charmed hands in blackjack during a vacation with first lady MK Pritzker and friends in Sin City.\n\n“I was incredibly lucky,” he said. “You have to be to end up ahead, frankly, going to a casino anywhere.”\n\nPritzker, an heir to the Hyatt hotel chain, has a net worth of $3.9 billion, tied for No. 382 on the Forbes 400 list of the nation’s richest people. A campaign spokesperson said via email that Pritzker planned to donate the money to charity but did not respond when asked why he hadn’t already done so.\n\nPritzker, who intends to seek a third term in 2026, was under consideration as a vice presidential running mate to Kamala Harris last year. He has deflected questions about any ambition beyond the Illinois governor’s mansion. But he has used his personal wealth to fund other Democrats and related efforts, including a campaign to protect access to abortion.\n\nHis profile has gotten an additional bump this fall as he condemns President Donald Trump’s immigration enforcement in the Chicago area and the president’s attempt to deploy National Guard troops there.\n\nThe Pritzkers reported income of $10.66 million in 2024, mostly from dividends and capital gains. They paid $1.6 million in taxes on taxable income of $5.87 million.\n\nPritzker is an avid card player whose charitable Chicago Poker Challenge has raised millions of dollars for the Holocaust Museum and Education Center. The Vegas windfall was a “net number” given wins and losses on one trip, he said. He declined to say what his winning hand was.\n\n“Anybody who’s played cards in a casino, you often play for too long and lose whatever it is you won,” Pritzker said. “I was fortunate enough to have to leave before that happened.”\n\nAssociated Press writer Sophia Tareen contributed from Chicago.","summary":"Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.","url":"https://www.bostonherald.com/2025/10/16/pritzker-blackjack-pot-las-vegas/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Illinois_Governor_Lucky_Gambler_49942.jpg?w=1024&h=682","video":null,"publish_date":"2025-10-16 23:55:24","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.276},{"id":369966894,"title":"Billionaire Illinois Gov. Pritzker wins blackjack pot of $1.4M in Las Vegas","text":"By JOHN O’CONNOR\n\nSPRINGFIELD, Ill. (AP) — It figures that a billionaire would win big in Las Vegas.\n\nIllinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.\n\nThe two-term Democrat, often mentioned as a 2028 presidential candidate, told reporters in Chicago on Thursday that he drew charmed hands in blackjack during a vacation with first lady MK Pritzker and friends in Sin City.\n\n“I was incredibly lucky,” he said. “You have to be to end up ahead, frankly, going to a casino anywhere.”\n\nPritzker, an heir to the Hyatt hotel chain, has a net worth of $3.9 billion, tied for No. 382 on the Forbes 400 list of the nation’s richest people. A campaign spokesperson said via email that Pritzker planned to donate the money to charity but did not respond when asked why he hadn’t already done so.\n\nPritzker, who intends to seek a third term in 2026, was under consideration as a vice presidential running mate to Kamala Harris last year. He has deflected questions about any ambition beyond the Illinois governor’s mansion. But he has used his personal wealth to fund other Democrats and related efforts, including a campaign to protect access to abortion.\n\nHis profile has gotten an additional bump this fall as he condemns President Donald Trump’s immigration enforcement in the Chicago area and the president’s attempt to deploy National Guard troops there.\n\nThe Pritzkers reported income of $10.66 million in 2024, mostly from dividends and capital gains. They paid $1.6 million in taxes on taxable income of $5.87 million.\n\nPritzker is an avid card player whose charitable Chicago Poker Challenge has raised millions of dollars for the Holocaust Museum and Education Center. The Vegas windfall was a “net number” given wins and losses on one trip, he said. He declined to say what his winning hand was.\n\n“Anybody who’s played cards in a casino, you often play for too long and lose whatever it is you won,” Pritzker said. “I was fortunate enough to have to leave before that happened.”\n\nAssociated Press writer Sophia Tareen contributed from Chicago.","summary":"Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.","url":"https://www.ocregister.com/2025/10/16/pritzker-blackjack-pot-las-vegas/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Illinois_Governor_Lucky_Gambler_49942.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-16 23:55:24","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":-0.276},{"id":369968440,"title":"Billionaire Illinois Gov. Pritzker wins blackjack pot of $1.4M in Las Vegas","text":"By JOHN O’CONNOR\n\nSPRINGFIELD, Ill. (AP) — It figures that a billionaire would win big in Las Vegas.\n\nIllinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.\n\nThe two-term Democrat, often mentioned as a 2028 presidential candidate, told reporters in Chicago on Thursday that he drew charmed hands in blackjack during a vacation with first lady MK Pritzker and friends in Sin City.\n\n“I was incredibly lucky,” he said. “You have to be to end up ahead, frankly, going to a casino anywhere.”\n\nPritzker, an heir to the Hyatt hotel chain, has a net worth of $3.9 billion, tied for No. 382 on the Forbes 400 list of the nation’s richest people. A campaign spokesperson said via email that Pritzker planned to donate the money to charity but did not respond when asked why he hadn’t already done so.\n\nPritzker, who intends to seek a third term in 2026, was under consideration as a vice presidential running mate to Kamala Harris last year. He has deflected questions about any ambition beyond the Illinois governor’s mansion. But he has used his personal wealth to fund other Democrats and related efforts, including a campaign to protect access to abortion.\n\nHis profile has gotten an additional bump this fall as he condemns President Donald Trump’s immigration enforcement in the Chicago area and the president’s attempt to deploy National Guard troops there.\n\nThe Pritzkers reported income of $10.66 million in 2024, mostly from dividends and capital gains. They paid $1.6 million in taxes on taxable income of $5.87 million.\n\nPritzker is an avid card player whose charitable Chicago Poker Challenge has raised millions of dollars for the Holocaust Museum and Education Center. The Vegas windfall was a “net number” given wins and losses on one trip, he said. He declined to say what his winning hand was.\n\n“Anybody who’s played cards in a casino, you often play for too long and lose whatever it is you won,” Pritzker said. “I was fortunate enough to have to leave before that happened.”\n\nAssociated Press writer Sophia Tareen contributed from Chicago.","summary":"Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.","url":"https://www.sandiegouniontribune.com/2025/10/16/pritzker-blackjack-pot-las-vegas/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Illinois_Governor_Lucky_Gambler_49942.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-16 23:55:24","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":-0.276},{"id":369975378,"title":"Billionaire Illinois Gov. Pritzker wins blackjack pot of $1.4M in Las Vegas","text":"By JOHN O’CONNOR\n\nSPRINGFIELD, Ill. (AP) — It figures that a billionaire would win big in Las Vegas.\n\nIllinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.\n\nThe two-term Democrat, often mentioned as a 2028 presidential candidate, told reporters in Chicago on Thursday that he drew charmed hands in blackjack during a vacation with first lady MK Pritzker and friends in Sin City.\n\n“I was incredibly lucky,” he said. “You have to be to end up ahead, frankly, going to a casino anywhere.”\n\nPritzker, an heir to the Hyatt hotel chain, has a net worth of $3.9 billion, tied for No. 382 on the Forbes 400 list of the nation’s richest people. A campaign spokesperson said via email that Pritzker planned to donate the money to charity but did not respond when asked why he hadn’t already done so.\n\nPritzker, who intends to seek a third term in 2026, was under consideration as a vice presidential running mate to Kamala Harris last year. He has deflected questions about any ambition beyond the Illinois governor’s mansion. But he has used his personal wealth to fund other Democrats and related efforts, including a campaign to protect access to abortion.\n\nHis profile has gotten an additional bump this fall as he condemns President Donald Trump’s immigration enforcement in the Chicago area and the president’s attempt to deploy National Guard troops there.\n\nThe Pritzkers reported income of $10.66 million in 2024, mostly from dividends and capital gains. They paid $1.6 million in taxes on taxable income of $5.87 million.\n\nPritzker is an avid card player whose charitable Chicago Poker Challenge has raised millions of dollars for the Holocaust Museum and Education Center. The Vegas windfall was a “net number” given wins and losses on one trip, he said. He declined to say what his winning hand was.\n\n“Anybody who’s played cards in a casino, you often play for too long and lose whatever it is you won,” Pritzker said. “I was fortunate enough to have to leave before that happened.”\n\nAssociated Press writer Sophia Tareen contributed from Chicago.","summary":"Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.","url":"https://www.twincities.com/2025/10/16/pritzker-blackjack-pot-las-vegas/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Illinois_Governor_Lucky_Gambler_49942.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-16 23:55:24","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.276},{"id":369968182,"title":"Letters: Proposition 50 is unfair and unnecessary","text":"Prop. 50 is unfair\nand unnecessary\n\nProposition 50 official ballots state it is “in response to Texas partisan redistricting.” A comparison of Texas with California shows that Proposition 50 is neither needed nor fair.\n\nNeglecting third parties, in the last presidential election, Texas voted 43% Democrat (Kamala Harris) and California voted 40% Republican (Trump), which are similar values for their respective minority parties. In the U.S. House of Representatives, California now has 17% Republicans (9/52) and Texas has 34% Democrats (13/38), twice the proportion.\n\nIf Texas’ redistricting changes five seats as expected, Texas’ Democratic proportion will drop from 34% to 21% (8/38), which is still higher than California’s 17%. Proposition 50 is not needed for fairness.\n\nIf California’s Proposition 50 also reverses five seats, California’s proportion of House Republicans would drop from 17% to 8% (4/52), which is unacceptably low. Note no on Proposition 50.\n\nDavid Berti\n\nLetters’ Prop. 50\narguments lack nuance\n\nRe: “Prop. 50 would worsen under-representation” and “Plainly speaking, Prop. 50 is unfair” (Page A6, Oct. 14).\n\nBoth writers have some valid points; however, some nuance might have strengthened the power of their arguments. Gov. Newsom says he regrets having to endorse Proposition 50, whereas Arnold Schwarzenegger says two wrongs do not make a right.\n\nCombining these thoughts, and looking for a good direction, I posit the following: Imagine being a passenger riding on a bus loaded with people. It is illegal and dangerous for a rider to grab the steering wheel under most circumstances.\n\nImagine now that the bus starts to veer into oncoming traffic, or is headed over a cliff. The driver may have fallen asleep or is trying to commit suicide. It would be unconscionable for a passenger not to grab the wheel and try to save many lives.\n\nThis may well be a good comparison to the background and details of Proposition 50. Please think carefully … then vote accordingly.\n\nRichard Bartlett\n\nPorter’s debacle shows\na lack of leadership\n\nRe: “Porter’s meltdown opens door for Padilla” (Page A7, Oct. 15).\n\nAs many people did, I witnessed the clip of Katie Porter’s interview with Sacramento journalist Julie Watts and was appalled by her inability to handle a reporter’s questions. If she can’t even cope with a reporter, how is she possibly going to be able to manage the State of California?\n\nShe has lost my support and my vote. I’ll now be supporting Xavier Becerra or, perhaps, Alex Padilla should he choose to run.\n\nPeggy Moyers\n\nTime for Oakland to\nrequire healthy options\n\nI am part of the Oakland HOPS (Healthy Option at Point of Sale), a youth-led initiative working to set a minimum nutrition standard for products sold at checkout.\n\nAs an Oakland resident and student-athlete, I see how much our society pushes unhealthy food onto us. It is difficult to find healthy options in corner stores near school. Passing Healthy Checkout would be putting Oaklanders’ health first.\n\nWe’ve spent the past five years collecting data, hosting focus groups, meeting with residents, businesses and city leaders. This isn’t just about food, it’s about long-term health. It’s about real choice, not the illusion of choice surrounded by sugar and salt.\n\nOakland has the chance to become the second city in the nation to pass this kind of policy. We believe that change is possible. We’re ready. The community is ready. Is our City Council ready?\n\nAshley Trousdell\n\nFederal employees need\nwork, not pink slips\n\nRe: “Judge halts firing of federal workers” (Page A1, Oct. 16).\n\nU.S. District Judge Susan Illston’s ruling to temporarily halt the Trump administration from firing federal workers during the government shutdown was a wise action and a great victory for working families, including many here in the Bay Area.\n\nFederal employees across local agencies have endured weeks of uncertainty, anxiety and deepening financial hardship as bills go unpaid and savings are depleted. Receiving layoff notices and being locked out of their work accounts with no one around to help them is both disrespectful and unfair. The administration appears focused on using federal workers as leverage against Congress rather than resolving the shutdown responsibly.\n\nOur dedicated civil servants deserve dignity and respect, not to be treated as pawns in political strategies. The courts must continue standing against reckless administrative stunts that cause unnecessary harm to innocent people.\n\nAlexandros Silva\n\nU.S. leaders choose\nposturing over solutions\n\nThe current government shutdown is one more example of how those whom we have placed in power over us care more about that power than the security, safety and prosperity of their citizens.\n\nThe current video requested to be played at TSA counters by the United States Secretary of Homeland Security, Kristi Noem, blames the Democrats for the government shutdown. Apparently, it is more important to posture and confront (to gain political points) than to work toward a resolution of this intentionally manufactured crisis.\n\nWe live in a democracy that is supposed to be about learning to live with each other and finding a middle ground that is, at least, tolerated by most. Instead, the current political climate, from the top of the government down, promotes power-grabbing over all else. Those we have trusted to lead need to work together for the common good.\n\nRandall Klein","summary":"Also: Lacking nuance &#124; Porter's debacle &#124; Healthy options &#124; Federal workers &#124; Leaders posturing. East Bay Times reader letters to the editor for Oct. 17, 2025.","url":"https://www.mercurynews.com/2025/10/16/letters-prop-50-unfair-unnecessary/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/APTOPIX_Government_Shutdown_24386.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-16 23:30:10","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.202},{"id":369990190,"title":"Pritzker wins $1.4 million playing blackjack in Las Vegas","text":"It figures that a billionaire would win big in Las Vegas. Illinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week. The two-term Democrat, often mentioned as a 2028 presidential candidate, told reporters in Chicago on Thursday that he drew charmed hands in blackjack during a vacation with first lady MK Pritzker and friends in Sin City. \"I was incredibly lucky,\" he said. \"You have to be to end up ahead, frankly, going to a casino anywhere.\" Pritzker, an heir to the Hyatt hotel chain, has a net worth of $3.9 billion, tied for No. 382 on the Forbes 400 list of the nation's richest people. A campaign spokesperson said via email that Pritzker planned to donate the money to charity but did not respond when asked why he hadn't already done so. Pritzker, who intends to seek a third term in 2026, was under consideration as a vice presidential running mate to Kamala Harris last year. He has deflected questions about any ambition beyond the Illinois governor's mansion. But he has used his personal wealth to fund other Democrats and related efforts, including a campaign to protect access to abortion. His profile has gotten an additional bump this fall as he condemns President Donald Trump's immigration enforcement in the Chicago area and the president's attempt to deploy National Guard troops there. The Pritzkers reported income of $10.66 million in 2024, mostly from dividends and capital gains. They paid $1.6 million in taxes on taxable income of $5.87 million. Pritzker is an avid card player whose charitable Chicago Poker Challenge has raised millions of dollars for the Holocaust Museum and Education Center. The Vegas windfall was a \"net number\" given wins and losses on one trip, he said. He declined to say what his winning hand was. \"Anybody who's played cards in a casino, you often play for too long and lose whatever it is you won,\" Pritzker said. \"I was fortunate enough to have to leave before that happened.\"","summary":"Illinois Gov. JB Pritzker reported a gambling windfall of $1.4 million on his federal tax return this week.","url":"https://www.cbsnews.com/news/illinois-gov-jb-pritzker-wins-1-4-million-playing-blackjack-in-las-vegas/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/06/12/b53ec3ec-1d67-40bc-9ddd-45bda40a920d/thumbnail/1200x630/04fa3c0f61e1554f9223d11f538889d6/gettyimages-2219163103.jpg","video":null,"publish_date":"2025-10-16 22:04:07","author":null,"language":"en","source_country":"US","sentiment":-0.264},{"id":369957654,"title":"Fox News Poll: New Jersey governor’s race has tightened","text":"A new Fox News survey finds Democrat Mikie Sherrill ahead of Republican Jack Ciattarelli by 5 points among New Jersey likely voters (50-45%), down from an 8-point lead in late September (50-42%). Among registered voters, she’s up by 4 points (48-44%), down from a 7-point lead (48-41%). Either way, the race has tightened, and Sherrill’s edge is inside the poll’s margin of sampling error. This analysis uses registered voter results. FOX NEWS POLL: DEMOCRAT SHERRILL LEADS NEW JERSEY GOVERNOR'S RACE Key groups that give Sherrill her advantage include Black voters, those under age 35, women ages 45 and younger, those with a college degree and Hispanic voters. Ciattarelli’s best groups include MAGA supporters, men without a college degree, White men, Catholics and those ages 55-64. About nine in 10 of each candidate’s supporters say they are certain to back them, but more of Ciattarelli’s supporters (69%) say they are extremely or very enthusiastic about voting this year than Sherrill’s (64%). On both sides, one in 10 supporters say they could change their mind before voting. Recent campaign attacks have taken a toll on the candidates’ favorability and honesty ratings. Sherrill’s honesty and trustworthy marks remain positive overall — but have declined since late September. More voters now view her as more honest than not, by a 5-point margin (52–47%), down from a 16-point advantage just three weeks ago (56–40%). FOX NEWS POLL: UNHAPPY WITH NYC'S DIRECTION, VOTERS FAVOR MAMDANI FOR MAYOR BY A WIDE MARGIN A similar shift occurred in her personal ratings. Sherrill was viewed more favorably than unfavorably by 10 points last month (51-41%) — and, now, views are net positive by only 2 points (50-48%). Views of Ciattarelli have also shifted negatively, though not as much as Sherrill’s. On honesty, his marks have gone from being in positive territory by 4 points in September to underwater by 2 points today. His favorable ratings are net negative by 3 points now vs. by 2 points last month. \"The allegations about Sherrill’s record at the Naval Academy damaged her, but the manner in which those records were obtained have left Ciattarelli open to criticism as well,\" says Republican pollster Daron Shaw, who helps conduct the Fox News Poll with Democratic counterpart Chris Anderson. \"On the whole, it seems Ciattarelli has benefited slightly, if only because he was behind and needed to change the dynamics of the race.\" On some traits, perceptions of the candidates are closely aligned. For instance, 54% think Sherrill, a U.S. congresswoman, is a \"strong leader\" and an equal number, 54%, feel the same about Ciatterelli, a former state assemblyman. Half believe the phrase \"can bring needed change\" applies to each. On other characteristics, there are modest differences — such as empathy: 55% think \"cares about people like me\" describes Sherrill, compared to 49% for Ciattarelli. Voters identify taxes (34%) and the cost of living (19%) as the top two problems facing the Garden State, and a larger number trusts Sherrill to handle both of those — by 3 points on taxes and by 6 points on the cost of living. She is also favored on energy costs (+3) and healthcare (+14), while more trust Ciattarelli to handle crime (+7). Some 92% of Republicans support Ciattarelli, and 89% of Democrats back Sherrill, while the small subgroup of independents splits. Sherrill benefits from more NJ voters identifying as Democrats than Republicans. The candidates are competing to fill term-limited Democratic Gov. Phil Murphy’s seat. He beat Ciattarelli by about 3 points in the last election and leaves the governor’s mansion with mixed marks: 47% of New Jersey voters have a positive view of him vs. 49% negative. In addition, while more than half, 55%, are currently unhappy with how things are going in the state, that’s an improvement from 62% who were dissatisfied in the months preceding Murphy’s first term. In both 2020 and 2016, President Donald Trump received 41% of the vote in New Jersey. He performed better in 2024, garnering 46%, yet still losing to former Vice President Kamala Harris (52%). Today, 45% of New Jersey voters have a favorable opinion of Trump, while 54% view him unfavorably. That’s up from eight years ago. During his first term, it was 36% favorable vs. 62% unfavorable. NJ: CLICK HERE FOR CROSSTABS AND TOPLINE Conducted October 10-14, 2025 under the joint direction of Beacon Research (D) and Shaw & Company Research (R), this Fox News Poll includes interviews with a sample of 1,002 New Jersey registered voters randomly selected from a statewide voter file. Respondents spoke with live interviewers on landlines (153) and cellphones (592) or completed the survey online by following a link received via text message (257). There was a subsample of 869 likely voters. Results based on both the registered voter and likely voter sample have a margin of sampling error of ± 3 percentage points. Sampling error for results among subgroups is higher. In addition to sampling error, question wording and order can influence results. Sources for developing weight targets include the most recent American Community Survey, Fox News Voter Analysis, and voter file data. Weights are generally applied to age, race, education, and area variables to ensure the demographics of respondents are representative of the registered voter population. Likely voters are identified based on past vote history and self-reported likelihood of voting. Results among subgroups are only shown when the sample size is at least N=100. Fox News’s Victoria Balara contributed to this report.","summary":"Recent campaign attacks damaged both Mikie Sherrill and Jack Ciattarelli&apos;s favorability ratings as the New Jersey gubernatorial race tightens to a 5-point margin.","url":"https://www.foxnews.com/politics/fox-news-poll-new-jersey-governors-race-has-tightened","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/ciaterrilli-sherrill-new-jersey-fox-news-2.jpg","video":null,"publish_date":"2025-10-16 22:00:02","author":"Dana Blanton","authors":["Dana Blanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.062}]}