{"offset":0,"number":50,"available":400,"news":[{"id":322165962,"title":"Leaked audio reveals extent of Biden’s struggle to remember key details in 2023 interview, including when son died","text":"Audio of President Joe Biden’s 2023 interview with Special Counsel Robert Hur concerning the improper possession of classified documents has been released more than a year after his administration released transcripts.\n\nThe recordings, published by Axios, reveal the extent to which the 46th president, then 80, struggled to remember key details and dates, was prompted by his lawyers, and spoke in a halting, whispering voice, punctuated by long silences.\n\nThey shed light on why the White House refused to release the audio while Biden was still in office amid questions regarding his mental acuity, and also perhaps why Hur’s conclusion was that jurors in any trial that might arise over his possession of the documents would have viewed him as a “sympathetic, well-meaning, elderly man with a poor memory.”\n\nAt the time, the White House hit back at Hur’s assessment of the president, insisting he was “sharp” and that any attacks on Biden were politically motivated — yet the special counsel comes across as respectful, and the tone of the interview is friendly and mostly appears relaxed.\n\nThe release of the audio comes as the Trump administration was reportedly weighing up releasing the recordings. It also comes ahead of the publication of a new book about a White House and presidential campaign hiding the decline of the president as he ran for another term in office. Original Sin by Axios’ Alex Thompson and CNN’s Jake Tapper will be released on Tuesday.\n\nDuring the two three-hour sessions with Hur and his co-counsel Marc Kricknaum, Biden’s attorneys had to remind him of the year his son Beau died and the year that Donald Trump was elected president for the first time — 2015 and 2016, respectively. \n\nBiden spokesperson Kelly Scully told Axios: “The transcripts were released by the Biden administration more than a year ago. The audio does nothing but confirm what is already public.”\n\nWhere the recordings do add a new dimension to what is already known from the transcripts is the length of pauses and the slowly unfolding nature of some answers.\n\nFurther emphasizing these silent moments from the president is the sound of a ticking clock in the background.\n\nNevertheless, Biden remains engaged despite memory lapses. At times, Axios notes, he cracks jokes and makes humorous asides, and throughout, he “sounded more like a nostalgic, grandfatherly storyteller than a potential defendant who could be accused of hoarding secret papers.”\n\nPerhaps the upshot of the basis of the interview was that he had little recollection as to how or why he came to have classified documents in his possession after his two terms as vice president to President Barack Obama.\n\nAt one point, his attorney, Bob Bauer, warns about getting into speculation as to how the documents may have ended up where they did, emphasizing that the president does not recall specific details. \n\nThe timing of the interviews is also noteworthy. The first session took place on October 8, 2023, the day after Hamas attacked Israel from Gaza. In the aftermath of an international crisis that would go on to spark the conflict that continues to this day, Biden is slow, forgetful, and often veers off topic.\n\nHowever, during the second session, the following day, October 9, the president sounds more engaged and vigorous, Axios notes.\n\nWhile Hur’s report did not recommend moving ahead with a prosecution and attempting to persuade a jury of Biden’s guilt in purposefully taking classified materials.\n\n“It would be difficult to convince a jury that they should convict him — by then a former president, well into his 80s — of a serious felony that requires a mental state of willfulness,” he had concluded.\n\nThe Biden camp blasted comments about the president’s age as “gratuitous, inaccurate and inappropriate,” while Donald Trump’s super PAC said that if Biden wasn’t fit enough for trial, he wasn’t fit enough to be president.\n\nThompson and Tapper’s upcoming book is a collection of their reporting on the cover-up around Biden’s mental and physical decline. The book’s excerpts are already causing a ruckus, as they detail startling instances of Biden’s gaps in mental acuity that were reportedly hidden from the public through 2024.\n\nBiden, whom aides reportedly considered putting in a wheelchair at points, reportedly did not recognize Hollywood megastar George Clooney at an event the president had flown in to Los Angeles specifically for Clooney to host on his behalf. Other excerpts claimed he forgot the names of longtime aides, including that of his national security adviser, Jake Sullivan.\n\nDemocrats are now struggling to respond to criticism of why it took so long for Biden to step aside in favor of Kamala Harris, and questions about how long any cover-up of the president’s decline had been going on.\n\nThe release of these audio recordings and the upcoming publication of Original Sin will likely completely swamp any continued denials from Biden defenders regarding the president’s mental fitness more than a year before the 2024 election.\n\nIt could be the break the Democratic Party needs to move forward and start winning back trust from the American people.\n\nWith additional reporting from John Bowden in Washington, D.C.","summary":"Recordings of then-president’s interview with special counsel Robert Hur regarding misplaced classified documents released more than one year after transcripts","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-interview-leaked-recording-special-counsel-b2752746.html","image":"https://static.independent.co.uk/2025/05/16/9/18/BRITAIN-UN-CLIMATE-COP26-kbvbqcx2.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/a98vGseh-4VHSaSK0.mp4","publish_date":"2025-05-17 00:48:21","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","source_country":"gb","sentiment":-0.132},{"id":322166752,"title":"Biden audio release puts his age and health back in the spotlight","text":"Joe Biden’s time in public office is now behind him, but his age and mental acuity have become a litmus test for the next leaders in his party.Audio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about Biden's health back in the spotlight. Months after former President Kamala Harris lost to President Donald Trump, a new book alleges that White House aides covered up Biden's physical and mental decline.Several potential Democratic contenders for the 2028 nomination have been asked in recent days whether they believe Biden was declining in office or whether he should have sought reelection before a disastrous debate performance led to his withdrawal.Many Democrats would prefer to focus on Trump's second term. Trump has done his best to prevent that — mentioning Biden's name an average of six times per day during his first 100 days in office, according to an NBC News analysis — and Republicans have followed his lead, betting that voters frustrated by Trump's policy moves will still prefer him over memories of an unpopular presidency.In the race for Virginia governor, one of this year's highest-profile contests, Republican Winsome Earle-Sears is running a pair of digital ads tying Democrat Abigail Spanberger to Biden, with images of the two hugging and the former president calling her a friend.“The stench of Joe Biden still lingers on the Democratic Party,” Democratic strategist Sawyer Hackett said. “We have to do the hard work of fixing that, and I think that includes telling the truth, frankly, about when we were wrong.”Democratic Sen. Chris Murphy of Connecticut told Politico this week that “there’s no doubt” that Biden, now 82, experienced cognitive decline as president.Pete Buttigieg, the former transportation secretary, wasn’t nearly as blunt but still stopped short of defending Biden’s decision to run. He responded “maybe” when asked Tuesday whether the Democratic Party would have been better off if Biden hadn’t tried to run for a second term.“Right now, with the advantage of hindsight, I think most people would agree that that’s the case,” Buttigieg told reporters during a stop in Iowa.RELATED STORY | Trump's tax bill and Biden's health: 'Grounded' podcast host Maritsa Georgiou weighs inIllinois Gov. JB Pritzker said he didn't see signs of mental or physical decline in his meetings with Biden.“I saw him a few times,” he told CNN this week. “I certainly went to the White House whenever there was an opportunity for me to make the case for something for people in my state. And I never had the experience of anything other than a guy who brought to the table a lot of good ideas about how to solve problems.”The book “Original Sin,” by journalists Jake Tapper of CNN and Alex Thompson of Axios, revives a core controversy of Biden’s presidency: his decision to run for a second term despite voters, including Democrats, telling pollsters that he should not run again. Biden would have been 86 at the end of a second term had he won in November.A spokesperson for Biden did not respond to a request for comment.“We continue to await anything that shows where Joe Biden had to make a presidential decision or where national security was threatened or where he was unable to do his job,” the spokesperson has told many media outlets in response to the book.Late Friday, Axios published portions from audio recordings of Biden's six hours of interviews with prosecutors investigating his handling of classified documents after his term as vice president ended in 2017.The Biden administration had already released transcripts of the interviews, but the recordings shed light on special counsel Robert Hur's characterization of Biden as “a sympathetic, well-meaning, elderly man with a poor memory” and appeared to validate his claim that the then-president struggled to recall key dates, including the year his son Beau died of cancer in 2015.Biden and his aides pushed back aggressively against Hur's report, which they characterized as a partisan hit. Biden was at that time — early 2024 — still planning to run for a second term and fending off accusations that he was too old for another four years in the job.The recordings released by Axios include Biden's discussion of his son's death. His responses to some of the prosecutors' questions are punctuated by long pauses, and his lawyers at times stepped in to help him recall dates and timelines.Before he dropped his reelection bid last summer, Biden faced widespread doubts within his own party, even as Democratic leaders dismissed both a series of verbal flubs and Republican allegations about his declining acuity.In January 2022, just a year into Biden’s first term, an AP-NORC Center for Public Affairs Research poll found that only 48% of Democrats wanted him to seek reelection. That fell to 37% of Democrats in an AP-NORC poll conducted in February 2023. Three-quarters of Americans — and 69% of Democrats — said in August 2023 that they believed Biden was too old to serve as president for another four-year term.And shortly after his debate flop, nearly two-thirds of Democrats said Biden should withdraw from the race.Biden and former first lady Jill Biden appeared on ABC’s “The View” in a preemptive defense of his health and decision-making before the first excerpts of “Original Sin” were published.He said he’s responsible for Trump’s victory but attributed Harris’ loss, at least in part, to sexism and racism. He maintained that he would have won had he remained the Democratic nominee. Both Bidens rejected concerns about his cognitive decline.Patricia McEnerney, a 74-year-old Democrat in Goodyear, Arizona, said Biden should not have tried to run again.“I think it’s sad the way it ended,” she said.She compared him to Douglas MacArthur, the World War II and Korean War general famously dismissed by President Harry Truman.“I think he needs to stop giving interviews. I think that would help,” McEnerney said. “Like MacArthur said, generals just fade away.”Janet Stumps, a 66-year-old Democrat also from Goodyear, a Phoenix suburb, had a different view.“I don’t think it’s going to hurt the Democrats,” Stumps said. “I feel badly that he feels he has to defend himself. I don’t think he has to. Everybody ages. And the fact that he did what he did at his age, I think he should be commended for it.”Hackett, the Democratic strategist, predicted Biden won’t be a major factor in the 2026 midterms or the 2028 presidential primaries. But he said Democrats who want voters to trust them would be well-served “by telling the truth about the mistakes that our party made in the run-up to 2024.”“Those mistakes were largely driven by Joe Biden, and I think any Democrat not willing to say that is not really prepared to face the voters, who want the truth and they want authenticity,” Hackett said.Rick Wilson, a former GOP strategist who co-founded the anti-Trump group the Lincoln Project, said Republicans want to talk about Biden to avoid defending Trump. But he said the strategy is folly.Besides “political nerds,” he said, “no one else cares.”","summary":"Audio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, reviving concerns over the effects his age and health have had on the Democratic party.","url":"https://www.scrippsnews.com/politics/biden-audio-release-puts-his-age-and-health-back-in-the-spotlight","image":"https://ewscripps.brightspotcdn.com/dims4/default/8977a3f/2147483647/strip/true/crop/5420x2846+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F8f%2Fbe%2Fc5c044c9491882d9d45944bee692%2Fap25104778394739.jpg","video":null,"publish_date":"2025-05-17 00:43:06","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.465},{"id":322164876,"title":"Joe Biden's troubling interview with special counsel Robert Hur is revealed in bombshell leaked audio","text":"Troubling newly released audio recordings of Joe Biden speaking to special counsel Robert Hur in 2023 lay bare the declining president's memory lapses and include one particularly disturbing moment when he struggles to recall when his son Beau died. \n\nWhile in office, Biden asserted executive privilege over the audio tapes of his interview with ex-special counsel Hur, who went on record describing Biden as 'elderly' and 'forgetful' and with 'diminished faculties'. \n\nAudio was published Friday from portions of interviews Biden gave to federal prosecutors in 2023, the latest in a stream of reports putting questions about Biden's health back in the spotlight \n\nA then-80-year old Biden fails to recall when his son Beau passed away and even when he left office as vice president under Barack Obama in an interview recorded seven months before the debate disaster against Donald Trump that effectively ended his re-election run.\n\nHur asserted during the investigation over the mishandling of classified evidence that jurors would see the president as 'a sympathetic, well-meaning, elderly man with a poor memory.' \n\nThe audio shows Biden - who has long had a stutter - slurring his words, losing his thought process and not being able to recall important facts about his own life. \n\nAt one point, he can even be heard asking: 'Am I making any sense to you?' \n\nHur was appointed special counsel by Attorney General Merrick Garland in January 2022 to investigate the president's handling of classified files based on a range of areas including Afghanistan.\n\nThe Biden administration had already released transcripts of the interviews taking place on October 8 and October 9, 2023 had already revealed that Biden's lawyer had to tell him what year his son Beau died of brain cancer and the president joked about the special counsel finding pictures of his wife in a swimsuit.\n\n'What was happening though was... What month did Beau die?' Biden mused at one point, adding, 'Oh God, May 30th.'\n\nA White House lawyer then chimed in with the year, 2015. \n\n'Was it 2015 he died?' Biden asked.\n\nHe leads into the confusion by suggesting Beau died in either 2017 or 2018, or even earlier than that, as he's discussing his 2008 presidential run. \n\nBiden asks Hur: 'This is what, 2017, 18, in that area?' \n\nWhen Hur affirms, Biden says: 'Remember, in this time frame, my son is … uh … would’ve been deployed or is dying and so … it was … and by the way there were still a lot of people at the time, when I got out of the Senate, that were encouraging me to run in this period - except the president.' \n\nBeau deployed between 2008 and 2009, at the beginning of Biden's first term as vice president. \n\nHur argued: 'I understood that my explanation about this case had to include rigorous, detailed, and thorough analysis.\n\n'In other words, I needed to show my work,' he will say. 'I knew that for my decision to be credible, I could not simply announce that I recommended no criminal charges and leave it at that. I needed to explain why.'\n\nHur added that he had to call Biden's memory into question and could not make a charging decision without assessing the 'President's state of mind'.\n\n'For that reason, I had to consider the President's memory and overall mental state, and how a jury likely would perceive his memory and mental state in a criminal trial,' he'll say.\n\n'Because these issues were important to my ultimate decision, I had to include a discussion of them in my report.\n\n'I did not sanitize my explanation. Nor did I disparage the President unfairly.\n\n'I explained to the Attorney General my decision and the reasons for it. That's what I was required to do'.\n\nHur's report, summarizing his probe of Biden's mishandling of classified documents, contains a multitude of examples of Biden's 'hazy' memory, including one point where Biden appeared to forget when his son Beau died.\n\nHur insisted that Biden was not fit for prosecution over his mishandling of documents because he was a 'well-meaning, elderly man with a poor memory.' \n\nThe special counsel noted Biden had 'diminished faculties' and at points 'did not remember when he was vice president.' \n\nBiden and his aides pushed back aggressively against Hur's report, which they characterized as a partisan hit. \n\nThe president was at that time - early 2024 - still planning to run for a second term and fending off accusations that he was too old for another four years in the job.\n\nRepublicans jumped on the material, saying it proves Biden isn't fit to run the country.\n\nIt comes as a new book 'Original Sin: President Biden's Decline, Its Cover-up, and His Disastrous Choice to Run Again,' by Jake Tapper and CNN contributor Alex Thompson blows the lid off of the Democrat inability to admit Biden was failing. \n\nA synopsis for the book provided in a press release, meanwhile, described the liberal-led plot. It frames Biden, 'his family, and his senior aides' as 'so convinced that only he could beat Trump again, they lied to themselves, allies, and the public.'\n\n'What you will learn makes President Biden’s decision to run for reelection seem shockingly narcissistic, self-delusional, and reckless - a desperate bet that went bust,' Penguin stated while announcing the book.'\n\nThe publisher further framed the attempt - fueled by coverage that likely aired on legacy stations like ABC, NBC, and CBS - as 'part of a larger act of extended public deception that has few precedents.'\n\nTapper - who also moderated a 2020 debate between the then-candidates - added in a separate statement, in which he quoted Nobel Prize winning novelist Toni Morrison.\n\n‘\"If there’s a book that you want to read, but it hasn’t been written yet, then you must write it.\"'\n\n'That’s what inspired this book,' the Lead With Jake Tapper host said. 'We wanted to know more about what we all just lived through. \n\n'More than 200 interviews later, Alex and I have a much better idea,' he said, talking up the book's sourcing.\n\n'And soon you all will too.'\n\nThe statement was delivered a little more than six months removed from the Atlanta debate that Tapper moderated, which led to accusations that CNN's lead Washington anchor took it easy on the president.\n\nOne segment in particular sparked such accusations, after Tapper appeared to cut the 81-year-old off in the midst of a rambling, nonsensical answer - one of several later cited after the Democrats' abrupt turnaround to opting for Kamala Harris.\n\n'We'd be able to wipe out his debt,' Biden said at the time of sums incurred by Trump-era tax cuts he said 'benefited the very wealthy.'\n\n'We'd be able to help make sure all those things we need to do: child care, elder care, making sure that we continue to strengthen our health care system,' he continued, stumbling at times over his words.\n\n'Making sure that we're able to make every single solitary person eligible for what I've been able to do with the... with the COVID, excuse me, with um, dealing with everything we have to with, uh,' he went on, languishing at this point.\n\n'Look, if we finally beat Medicare...'\n\nHe proceeded to fully trail off. \n\nThe silence that ensued - and the overall moment - went on to live in infamy, after Tapper's timely interjection.\n\n'Thank you President Biden - President Trump?'\n\nWithin days - thanks an array of other viral flubs during the make-or-break faceoff - Biden was bombarded with bipartisan calls to drop out.\n\nHe eventually did, albeit reluctantly, after several weeks.\n\nThat said, Tapper was one of few left-leaning hosts to call attention to Biden's seemingly waning health in the months leading up the debate, while talents like Thompson gave time to accounts from White House staffers insisting the president was fine.\n\nTapper, moreover, cut off Lara Trump during a tense interview that aired on State of the Union in 2020, during an conversation about the candidate's 'cognitive decline.'\n\nThe host - who was reportedly just denied a raise - had just aired a clip of Trump's daughter-in-law criticizing Biden's tendency to stutter, calling it evidence of his 'cognitive decline'.\n\n'I'm like \"Joe, can ya get it out, let's get the words out, Joe,\" You kinda feel bad for him,' she said - leading Tapper to chide her and point out previous reporting surrounding Biden overcoming a stutter over the years. \n\n'How do you think it makes little kids with stutters feel when they see you make a comment like that?' he asked Trump sternly. 'I think you have absolutely no standing to diagnose somebody's cognitive decline'. \n\nBiden and former first lady Jill Biden appeared on ABC´s \"The View\" in a preemptive defense of his health and decision-making before the first excerpts of \"Original Sin\" were published.\n\nHe said he´s responsible for Trump´s victory but attributed Harris´ loss, at least in part, to sexism and racism. \n\nHe maintained that he would have won had he remained the Democratic nominee. Both Bidens rejected concerns about his cognitive decline.\n\nThis is a developing story.","summary":"Newly-released recordings of Joe Biden speaking to special counsel Robert Hur in 2023 show the declining president's memory lapses as he struggles to remember when his son Beau died.","url":"https://www.dailymail.co.uk/news/article-14721459/Joe-Biden-special-counsel-Robert-audio-revealed.html","image":"https://i.dailymail.co.uk/1s/2025/05/17/00/98470163-0-image-a-31_1747438851361.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/07/12/2507610388597131493/1024x576_MP4_2507610388597131493.mp4","publish_date":"2025-05-17 00:40:12","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.507},{"id":322162164,"title":"Musicians Union Slams Trump’s Taylor Swift, Bruce Springsteen Tantrum","text":"The American Federation of Musicians (AFM) is standing by its artists. On Friday, the union issued a statement defending Taylor Swift and Bruce Springsteen after Donald Trump attacked the two stars on social media.\n\n “[We] will not remain silent as two of our members—Bruce Springsteen and Taylor Swift—are singled out and personally attacked by the President of the United States,” read the statement from AFM President Tino Gagliardi. “Bruce Springsteen and Taylor Swift are not just brilliant musicians, they are role models and inspirations to millions of people in the United States and across the world.”\n\n The statement lauded the stars for their “timeless” music with “deep cultural meaning,” signing off the note: “Musicians have the right to freedom of expression, and we stand in solidarity with all our members.”\n\n The statement comes after the President shared several posts on Truth Social Friday, denouncing the stars, “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?'” The message was in reference to a post he shared in September last year against the international pop star who has voiced her disagreement with POTUS’ policies multiple times.\n\n As for Springsteen, Trump decided to share that he “never liked” the Boss’ music and called him “dumb as a rock,” after the music icon described the president as “incompetent and treasonous” at his European tour kickoff. “He’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden,” Trump ranted.\n\n Springsteen has, of course, criticized Trump plenty of times on American soil. In a 2016 interview with Rolling Stone, Springsteen called him a “moron,” and at a 2024 campaign rally for Kamala Harris, he called Trump an “American tyrant.”","summary":"\"Musicians have the right to freedom of expression, and we stand in solidarity with all our members,\" wrote the American Federation of Musicians","url":"https://www.rollingstone.com/music/music-news/trump-taylor-swift-bruce-springsteen-musicians-union-1235341840/","image":"https://www.rollingstone.com/wp-content/uploads/2025/05/trump-musicians-union.jpg","video":null,"publish_date":"2025-05-16 23:37:30","author":"Tomás Mier","authors":["Tomás Mier"],"language":"en","source_country":"us","sentiment":0.201},{"id":322156388,"title":"Donald Trump’s goes on wild rants against Taylor Swift, Bruce Springsteen","text":"The US President – currently on his way home from a whirlwind diplomatic trip to the Middle East – has repeatedly targeted Swift since 2020, when she endorsed former President Joe Biden in that year’s presidential race. \n\nLast September, when the wildly-successful musician again endorsed his opponent – this time former Vice President Kamala Harris – Mr Trump wrote in a Truth Social post: “I hate Taylor Swift.” \n\nAnd on Friday, the President made it clear he’s still nursing a grudge against the wealthiest female musician on the planet when he took to the platform – seemingly unprompted and without further elaboration – and wrote: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT’, she’s no longer ‘HOT’?”. \n\nBar her endorsements of Mr Biden and Ms Harris, Swift has publicly ignored the 78-year-old’s relentless swipes. \n\nMr Trump followed his shot at Swift with a lengthy tirade against Bruce Springsteen. \n\nIn another Truth Social post, the President said the music legend was a “dried out prune” who was “dumb as a rock”, seemingly in retaliation to Springsteen criticising the leader – without naming him – at a concert in Manchester earlier this week.\n\n“In my home, the America I love, the America I’ve written about, and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration,” Springsteen told fans during his ‘Land of Hope and Dreams’ tour. \n\n“Tonight, we ask all who believe in democracy and the best of our American experience to rise with us, raise your voices against authoritarianism, and let freedom ring.” \n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,” Mr Trump wrote, before really letting rip. \n\n“Never liked him, never liked his music, or his Radical Left Politics, and, importantly, he’s not a talented guy – Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our country.\n\n“If I wasn’t elected, it would have been GONE by now! Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)? \n\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare.’ Then we’ll all see how it goes for him!” \n\nAmerican Federation of Musicians of the United States and Canada, Tino Gargliadi, issued a statement in response to Mr Trump’s rant against both Swift and Springsteen, saying it would “not remain silent as two of our members … are singled out and personally attacked by the President of the United States”. \n\n“Bruce Springsteen and Taylor Swift are not just brilliant musicians, they are role models and inspirations to millions of people in the United States and across the world,” he continued.\n\n“Whether it’s Born in the USA or the Eras Tour, their music is timeless, impactful, and has deep cultural meaning. Musicians have the right to freedom of expression, and we stand in solidarity with all our members.”","summary":"The US President reignited his feud with global megastars in a a spectacular rant.","url":"https://www.news.com.au/entertainment/celebrity-life/donald-trumps-goes-on-wild-rants-against-taylor-swift-bruce-springsteen/news-story/39b6662a24ee2aac430f5b9344d53ed1?from=rss-basic","image":"https://content.api.news/v3/images/bin/9262e2660957a5d012081b6a8c88f143","video":null,"publish_date":"2025-05-16 23:30:23","author":"Natalie Brown","authors":["Natalie Brown"],"language":"en","category":"politics","source_country":"au","sentiment":-0.313},{"id":322157534,"title":"Trump’s ‘knock-down-drag-out counterrevolution’ is tackling long-festering ills no one else would","text":"Pundits are confused about what to make of the first 100 days of the second Trump administration.\n\nSupporters talk of “flooding the zone,” believing President Donald Trump is making so many changes so quickly that his opposition is reduced to deer-in-the-headlights infancy.\n\nThey must be right when the nation suffers daily Democratic potty-mouth videos, vandalism of Teslas, infantile meltdowns at congressional witnesses, rioting against federal agents to protect illegal-alien felons, protesting on behalf of women beaters, M-13 gangbangers, human traffickers and assaulters, and visa-holding violent students praising Hamas terrorists.\n\nIn contrast, opponents either claim Trump’s first three months are either directionless chaos or a Hitlerian nightmare or both.\n\nBut what is really happening?\n\nOne, Trump is finally addressing the problems that proverbially “cannot go on forever, and so they won’t go on.”\n\nWhen, if ever, would the left have closed the southern border? \n\nAfter 10 million, 30 million, 50 million illegal aliens?\n\nHow many more criminal illegal entrants was the Biden administration willing to allow into American neighborhoods — 500,000? \n\n1 million? \n\nHow long was the world simply going to ignore the human destruction on the doorstep of Europe?\n\nWould former President Joe Biden or former Vice President Kamala Harris have sought a Ukraine War cease-fire? \n\nOr would it have taken another 1.5 million, 3 million or even 5 million more dead, wounded, and missing Ukrainians and Russians?\n\nNor did past administrations ever seek a solution to the massive national debt, much less the uncontrollable budget and trade deficits.\n\nAll prior presidents passed the day of judgment on to some vague future presidency, assured that their money printing would at least not blow up on their watch.\n\nAll moaned that China was piling up huge trade surpluses while denying its own population the usual modern safety net. \n\nThey knew Beijing’s aim was to use the trillions of dollars in trade surpluses to build a new massive military, a greater arsenal of nuclear bombs and a new imperial Belt and Road overseas empire.\n\nYet no administration did anything but greenlight American offshoring while ignoring Chinese trade cheating and technology theft.\n\nIndeed, prior presidencies appeased and enriched China on the foolish belief that such indulgence would lead to Chinese prosperity, and with such Western-style affluence, soon a globalized, democratic and supposedly friendly China.\n\nIn sum, we just witnessed all at once a 100-day, 360-degree effort to address all the existential challenges that we knew were unsustainable but were either afraid or incompetent to address.\n\nSecond, the administration apparently wants to confront the source of these crises and believes it is the progressive project.\n\nThe left maintains real political power not by grass-roots popularity, but rather by unelected institutional clout. The party of democracy uses anti-democratic means to achieve its ends of perpetual control.\n\nIt wages lawfare through the weaponization of the state, local and federal courts.\n\nIt exercises executive power through cherry-picked federal district and circuit judges and their state and local counterparts.\n\nThe permanent bureaucracies and huge federal workforce are mostly left-wing, unionized and weaponized by a progressive apparat.\n\nTheir supreme directive is to amalgamate legislative, judicial and executive power into the hands of the unelected Anthony Faucis, Jim Comeys and Lois Lerners of the world — and thus to override or ignore both popular plebiscites and the work of the elected Congress.\n\nOver 90% of the media — legacy, network, social and state — are left-wing. \n\nTheir mission is not objectivity but, admittedly, indoctrination.\n\nAcademia is the font of the progressive project; 90% of the professoriate are left-wing and activist — explaining why campuses believe they are above the rules and laws of the Constitution, the Supreme Court and the US Congress.\n\nAdd into the mix the blue-chip Accela corridor law firms and the globalized corporate and revolving-door political elite.\n\nThe net result: Almost everything the vast majority of Americans and their elected representatives did not want — far-left higher education, a Pravda media, biological men destroying women’s sports, an open border, 30 million illegal aliens, massive debt, a weaponized legal system and a politicized Pentagon — became the new culture of America.\n\nSo, Trump is not just confronting unaddressed existential crises but also the root causes of why, when and how they become inevitable and nearly unsolvable.\n\nHis answer is a messy, knock-down-drag-out counterrevolution to reboot the country back to the middle, where it once was and where the Founders believed it should remain.\n\nHis right and left opponents call such pushback chaotic, disruptive and out of control.\n\nBut the counterrevolution appears disorderly and upsetting, mostly to those who originally birthed the chaos; it certainly does not to the majority of Americans who finally wanted an end to the madness.","summary":"Supporters talk of \"flooding the zone,\" believing President Donald Trump is making so many changes so quickly that his opposition is reduced to deer-in-the-headlights infancy.","url":"https://nypost.com/2025/05/16/opinion/trump-is-taking-on-long-festering-ills-no-one-else-would-via-his-knock-down-drag-out-counterrevolution/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/u-s-president-donald-trump-104659064-e1747435046136.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-16 23:28:57","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.333},{"id":322157536,"title":"Biden stumbles over words, struggles with key memories — including year son Beau died — during Special Counsel Hur interview, leaked audio reveals","text":"Former President Joe Biden rambled through an October 2023 interview with special counsel Robert Hur — repeatedly losing his train of thought and struggling to recall key details of his political and personal life, including when his son died, newly released audio of the sitdown shows.\n\n“Well, um, I, I, I, I, I, I don’t know,” Biden, then 80, responded to one question about where he would store papers related to his post-vice presidential work at the Penn Biden Center, his memoir “Promise Me, Dad” and the Cancer Moonshot initiative.\n\nBiden sat down with Hur and co-counsel Marc Krickbaum Oct. 8-9 as part of a probe ordered by then-Attorney General Merrick Garland into the 46th president’s unlawful retention of national security papers from his time as Barack Obama’s No. 2, as well as a senator from Delaware.\n\nBiden’s stunning decline during presidency\n\nBiden didn’t recognize this megastar — and huge supporter — in shocking memory lapse that left celeb ‘shaken to his core’\n\nJill Biden cut off Pennsylvania Gov. Shapiro during post-debate campaign warning: ‘We gotta go’\n\nAdviser reveals how Biden ‘totally f–ked’ Kamala Harris’ 2024 election chances\n\nBiden aides discussed whether president would need wheelchair if re-elected\n\nThe Biden administration had refused to release the audio tapes of the interviews with Hur, which were obtained by Axios on Friday, arguing that they contained protected “law enforcement materials.” \n\nBiden, speaking slowly with his voice fading in and out, repeatedly requested assistance figuring out the years of certain events. \n\n“This is what, 2017, 18, in that area?” he asked in response to the special counsel’s question about the post-vice presidency activities.“Yes, sir,” Hur responded.\n\nThe former president, pausing throughout his answer, then appeared to believe that the events of 2017 and 2018 corresponded with when he left the Senate (2009) and his son Beau Biden’s death (2015).\n\n“Remember, in this time frame, my son is … uh … would’ve been deployed or is dying and so … it was … and by the way there were still a lot of people at the time, when I got out of the Senate, that were encouraging me to run in this period — except the president,” Biden said.\n\nAfter a digression about his presidential ambitions and former President Barack Obama’s reluctance to support him, Biden said: “What was happening though was … what month did Beau die? Oh god, May 30 …”\n\n“2015,” one of his lawyers chimed in. \n\n“Was it 2015 he had died?” Biden asked.\n\n“It was,” the lawyer responded.\n\n“I think it was 2015,” Biden, still unsure, said.","summary":"The release comes as new scrutiny is being given to Biden's mental capacity in office.","url":"https://nypost.com/2025/05/16/us-news/biden-struggled-through-interview-with-special-counsel-robert-hur-new-audio-reveals/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/Biden-Audio-TAB.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/gpWCfjeP-RyIcpnTz.mp4","publish_date":"2025-05-16 23:03:04","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.347},{"id":322151100,"title":"Donald Trump’s ‘Attacks’ on Taylor Swift & Bruce Springsteen Condemned by American Federation of Musicians","text":"Donald Trump recently launched into online rants targeting not one, but two of the world’s biggest musicians, and the American Federation of Musicians International isn’t letting it slide.\n\n Hours after Trump wrote that Taylor Swift isn’t “hot” anymore while calling Bruce Springsteen “dumb as a rock” in posts Friday (May 16) on Truth Social, AFM International President Tino Gagliardi issued a statement condemning the “attacks” on two of the labor union’s members.\n\n “The American Federation of Musicians of the United States and Canada will not remain silent as two of our members — Bruce Springsteen and Taylor Swift — are singled out and personally attacked by the President of the United States,” Gagliardi began.\n\n “Bruce Springsteen and Taylor Swift are not just brilliant musicians; they are role models and inspirations to millions of people in the United States and across the world,” the statement continued. “Whether it’s Born in the U.S.A. or the Eras Tour, their music is timeless, impactful, and has deep cultural meaning. Musicians have the right to freedom of expression, and we stand in solidarity with all our members.”\n\n The “Anti-Hero” singer and E Street Band leader are just two of tens of thousands of musicians who are part of the AFM, which “negotiates fair agreements, protects ownership of recorded music, secures benefits such as health care and pension, and lobbies for musicians and the rights of workers,” according to the union’s website. Swift is a member of her local Nashville branch, while Springsteen is part of chapters in both Los Angeles and his home state of New Jersey, per the AFM’s statement.\n\n The organization’s defense of the two stars counters Trump’s tirade against both of them earlier on Friday. Starting with Swift, the politician had written, “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?'”\n\n The remark comes eight months after he first posted that he hated the 14-time Grammy winner on Truth Social following her endorsement of his opponent, Kamala Harris, in the 2024 election. Trump has a long history of directing barbed comments at Swift, previously making fun of her for getting booed by Philadelphia Eagles fans at the Super Bowl in February.\n\n Shortly after name-dropping the Eras headliner, Trump turned his attention to The Boss. In response to Springsteen slamming the billionaire’s “corrupt, incompetent and treasonous administration” at a concert in Manchester, England, two days prior, Trump wrote, “Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden … Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock.'”\n\n At press time, neither Swift nor Springsteen had addressed Trump’s latest comments, but both have been vocal in their opposition to the Republican Party leader. In addition to backing his opponents in both of the past two elections, the “Karma” artist has criticized his policies on a number of occasions. And in 2020, the “Dancing in the Dark” rock star called Trump a “threat” to democracy, telling The Atlantic, “He simply makes any kind of reform that much harder … These are all existential threats to our democracy and our American way of life.”","summary":"\"We stand in solidarity with all our members,\" states Tino Gagliardi, the labor union's president.","url":"https://www.billboard.com/music/music-news/donald-trump-taylor-swift-bruce-springsteen-condemned-amf-1235974511/","image":"https://www.billboard.com/wp-content/uploads/2025/05/donald-trump-may-12-2025-billboard-02-1548.jpg","video":null,"publish_date":"2025-05-16 22:42:44","author":"Hannah Dailey","authors":["Hannah Dailey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.009},{"id":322165958,"title":"Did a Fox & Friends segment spark Trump’s latest post trashing Taylor Swift?","text":"After wrapping up his newsmaking four-day Middle Eastern trip on Friday, President Donald Trump settled down on Air Force One and appeared to take part in his two favorite activities – watching cable news and rage-posting about celebrities he believes have been mean and nasty to him.\n\nIn a seemingly random and unprovoked attack, Trump fired off a Truth Social post about pop megastar Taylor Swift, asking his followers if they had noticed that “since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’”\n\nThis is hardly the first time the president has lashed out at the “Shake It Off” singer, especially after she endorsed Joe Biden for president in 2020 and then backed Kamala Harris last year. That came on the heels of Trump reposting AI-generated images of Swift supposedly endorsing him for president.\n\n“I HATE TAYLOR SWIFT,” Trump raged at the time, insisting that she would soon “pay a price” for spurning him.\n\nEven though the president has continued to hold a grudge against Swift, why all of a sudden did he decide to re-air his grievances after recently departing Abu Dhabi following a busy foreign trip? Unlike Bruce Springsteen, whom Trump also raged at on Friday after The Boss blasted him during a concert in the UK, Swift had not recently said anything negative (or otherwise) about the president.\n\nAs appears to be the case with much of the president’s social media feed throughout the years, he was likely reacting to something he had just seen on Fox News.\n\nIn the final hour of Fox & Friends, which is well known to be Trump’s favorite morning show, the program featured a quick news report on Rhode Island police finding what appears to be human remains just a short distance from Swift’s seaside mansion in the luxurious Watch Hill neighborhood.\n\n“Human remains were discovered down the road from Taylor Swift's Rhode Island mansion amid fears a New England serial killer is on the loose,” Fox News host Carley Shimkus noted. “Officers say they arrived on the scene Wednesday and located what appeared to be a leg bone. It was found over a quarter-mile from Swift’s home.”\n\nTurning to the other hosts on the couch, Shimkus said: “Sorry to leave it on that note.” Roughly an hour after this report aired, the president fired off his Truth Social post.\n\nThe White House did not immediately respond to a request for comment.\n\nFor years now, the president’s tweeting (and now “truthing”) habits have been heavily influenced by his round-the-clock bingeing of cable news – which always includes an oversized scoop of Fox News.\n\nDuring his first term, for instance, Trump would generally send out multiple tweets a day responding in real time to what he saw on the conservative cable giant. A study by Media Matters found that in 2019, the president sent out 657 live tweets of Fox programming, with Fox & Friends accounting for a third of them.","summary":"Donald Trump has a history of reacting in real-time to what he sees on his favorite cable news morning show","url":"https://www.independent.co.uk/news/world/americas/us-politics/fox-and-friends-taylor-swift-trump-b2752717.html","image":"https://static.independent.co.uk/2025/05/16/22/10/fox-and-friends-(41).jpg?width=1200","video":"https://cdn.jwplayer.com/videos/DsaWzxQW-4VHSaSK0.mp4","publish_date":"2025-05-16 22:38:35","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.249},{"id":322159144,"title":"As Trump Departs the Middle East, He Takes Aim at Taylor Swift and Bruce Springsteen","text":"And his vague threat on Friday about what may await Mr. Springsteen upon his return to the United States seemed ominous, since these days so many of his threats have turned out not to be empty ones.\n\nAsked what exactly Mr. Trump was implying, Steven Cheung, the White House communications director, would only send back a string of insults about Mr. Springsteen’s career. \n\n“The America I love,” he said during his show in Manchester, “is currently in the hands of a corrupt, incompetent and treasonous administration.” \n\nMr. Springsteen went hard at the White House. \n\n“They’re rolling back historic civil rights legislation that has led to a more just and plural society,” he said. “They’re abandoning our great allies and siding with dictators against those struggling for their freedom. They’re defunding American universities that won’t bow down to their ideological demands.” \n\nThe remarks by Mr. Springsteen, who campaigned for Kamala Harris, got a lot of attention at a time when many public figures in American life have avoided criticizing a president who campaigned on enacting retribution and has in many ways delivered on that promise.","summary":"President Trump went on a social media posting spree after four days overseas, where he basked in the kind of lavish praise that so delights him.","url":"https://www.nytimes.com/2025/05/16/us/politics/trump-springsteen-critics-internet.html","image":"https://static01.nyt.com/images/2025/05/16/us/politics/dc-trump/dc-trump-facebookJumbo.jpg","video":null,"publish_date":"2025-05-16 22:28:02","author":"Shawn McCreesh","authors":["Shawn McCreesh"],"language":"en","category":"politics","source_country":"us","sentiment":-0.132},{"id":322150228,"title":"Donald Trump, Taylor Swift feud: President says singer ‘not hot’, tells Bruce Springsteen to keep ‘mouth shut’","text":"US President Donald Trump has added fuel to his unusual beef with music superstar Taylor Swift, saying she is no longer “hot”, while also lashing out at iconic singer Bruce Springsteen, calling him a “dried out prune”.\n\nThe feud has somewhat of an unusual backstory.\n\nDuring Mr Trump’s presidential campaign in 2024, he posted AI generated images of Taylor Swift and and added comments and hashtags including “Swifties for Trump”.\n\nShortly after the AI images were shared, videos started to surface of Mr Trump’s supporters discussing how Swift was a fan of the president, seemingly unaware that there was actually no support.\n\nShortly after, almost immediately after the first debate between former Vice President Kamala Harris and Mr Trump, Swift spoke out and endorsed the Democrat presidential nominee.\n\n“Like many of you, I watched the debate tonight,” the singer wrote before asking her followers to do their research before deciding who to vote for.\n\n“Recently I was made aware that AI of ‘me’ falsely endorsing Donald Trump’s presidential run was posted to his site.\n\n“It really conjured up my fears around AI, and the dangers of spreading misinformation. It brought me to the conclusion that I need to be very transparent about my actual plans for this election as a voter.\n\n“The simplest way to combat misinformation is with the truth.“I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election.\n\n“I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos.”\n\nThat didn’t sit well with Mr Trump, who took to social media, using capital letters to say “I HATE TAYLOR SWIFT!”\n\nMr Trump later said that Swift would “pay the price” for sharing her Democrat views.\n\nAfter going somewhat quiet on the feud, Mr Trump has reopened it claiming Swift is no longer “hot”, claiming responsibility for her, in his opinion, demise.\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer “HOT?” Mr Trump wrote on Truth Social.\n\nIt wasn’t just Swift that Mr Trump wanted to call out through, also hitting out at US singer Bruce Springsteen.\n\n“I see that highly overrated Bruce Springsteen goes to a foreign country to speak badly about the President of the United States,” Mr Trump wrote in a second post.\n\n“Never liked him, never liked his music, or his radical left politics and, importantly, he’s not a talented guy — just a pushy, obnoxious JERK, who fervently supported crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our country.\n\n“If I wasn’t elected, it would have been GONE by now!\n\n“Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)?\n\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the country, that’s just ‘standard fare’.\n\n“Then we’ll all see how it goes for him!”\n\nMr Trump’s post comes after Springsteen said the US President was “unfit for office”.\n\n“In my home, the America I love — the America I’ve written about that has been a beacon of hope and liberty for 250 years — is currently in the hands of a corrupt, incompetent and treasonous administration,” he said at a concert in Manchester, UK.","summary":"US President Donald Trump has lashed out at music superstar Taylor Swift and issued a threatening message to iconic musician Bruce Springsteen.","url":"https://thewest.com.au/politics/world-politics/donald-trump-taylor-swift-feud-president-says-singer-not-hot-tells-bruce-springsteen-to-keep-mouth-shut-c-18721742","image":"https://images.thewest.com.au/publication/C-18721742/5bd7869e9d5ff374db06bcd65be69baabe323558-16x9-x1y0w2446h1376.jpg?imwidth=1200","video":null,"publish_date":"2025-05-16 22:23:27","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.182},{"id":322167272,"title":"Shari Redstone and Paramount’s Own Mission: Impossible—Survive a Trump Lawsuit and a Billion-Dollar Merger","text":"Paramount’s lawyers are in the midst of settlement talks with President Donald Trump over his complaints about the editing of a 60 Minutes interview with Vice President Kamala Harris. CBS said it left out a clumsy answer to a question about US-Israel relations because of time constraints, though it had used the answer in a promotion for the upcoming interview. Trump believes CBS’s top news show portrayed Harris in a positive light, interfering with the election, and sued under the Texas Deceptive Trade Practices Act, a law usually employed to protest false advertising claims. Trump had declined the show’s invitation to speak ahead of the election. He expanded his case in February, claiming $20 billion, up from an initial $10 billion, for having been harmed as a competitor to CBS via his social media network, Truth Social. The network, meanwhile, believes its edited interview has First Amendment protections.\nRedstone has reportedly said that she is taking herself out of the talks, leaving it to her three chief executives to figure out the mess. That has left some feeling frustrated. “She needs to resolve this. Shari has the most to lose,” said one person familiar with the position of Redstone, who would have to pay a $400 million breakup fee if the deal were not to happen. (A CBS News spokesperson declined to comment. The White House press office didn’t respond for comment.)\nIf things go in Trump’s favor, Paramount Global will become the latest media organization to pay Trump millions, sending one more chill down journalism's spine. On April 30, The Wall Street Journal reported that Paramount is ready to settle the dispute for between $15 million and $20 million. But if the president doesn’t like the number, a deal may not happen at all.\nAdding to the pressure, a group of nine senators wrote a letter​​, made public on May 7, to the Paramount Global controlling shareholder, imploring her not to settle the case with Trump: “In our view, that would be a grave mistake.”\n“Rewarding Trump with tens of millions of dollars for filing this bogus lawsuit will not cause him to back down on his war against the media and a free press,” the lawmakers wrote. “It will only embolden him to shakedown, extort, and silence CBS and other media outlets that have the courage to report about issues that Trump may not like.”\nTrump shared a furious statement on Truth Social on Wednesday, May 7, about the Emmy nomination that the 60 Minutes interview with Harris received in the editing category. “These antics are why the American People have no trust in the Press, and demand that the Media, very much including 60 Minutes, CBS and its owners, be held responsible for their corruption and lies, which is exactly what we are doing in Court!”\nMeanwhile, Redstone had been in on-again-off-again merger talks with David Ellison, the owner of Skydance Media. At one point Redstone even walked away from those negotiations before returning to finalize a complicated deal that will involve her shedding her voting control in Paramount by selling her stake in National Amusements, Inc. The current agreement with Skydance is backed by both Oracle cofounder Larry Ellison and Gerry Cardinale’s private-equity firm, RedBird Capital (where former CNN chief Jeff Zucker has a joint-venture business).\nIf Brendan Carr’s Federal Communications Commission gives the deal the go-ahead, Redstone will get to cash a check worth more than $1.75 billion and exit the business her grandfather Mickey Redstone helped establish. Redstone inherited her father Sumner’s controlling stake in what was then known as ViacomCBS in 2020, after his death at age 97.\nDespite Redstone’s rocky relationship with her father, who, according to a 2015 WSJ article, once tried to buy her shares for $1 billion, he would likely be proud of the cards she’s played. Perhaps surprisingly, Redstone is well acquainted with Trump, which may help her navigate these stormy seas. Redstone is also trying to steer the tricky merger through the FCC, which is overseeing the request for the transfer of 28 local CBS TV stations and other licenses to Ellison family–controlled assets, even as it investigates the network for “news distortion” and is forcing Paramount to limit specific corporate diversity, equity, and inclusion efforts. Paramount owns BET, one of the top cable destinations for African American viewers.\nRedstone has shown she is unafraid to make tough decisions. But even after the ouster of Paramount CEO Bob Bakish (whose salary had hit nearly $87 million) and the installation of three chief executives (being paid around $20 million each), the 71-year-old, one of the most powerful women in media, is left with few good choices. Her relationships may help her survive it.\nRedstone has done her best to curry favor with Republicans. “She’s right of center, but not by any means extreme,” according to one person who knows her. “She’s generally interested in news being as accurate as possible. People are a mix of things. She’s very supportive of race relations and things that would be called DEI. She’s not dogmatic, and she’s not a party regular for anyone at all.”\nIn January, Paramount hired Trump fundraiser and lobbyist Brian Ballard to help see the company through the rocky merger-approval process. Ballard Partners is also working for big tobacco companies in a fight against unlicensed vape products. Perhaps hoping a Republican government would be more likely to sign off on her plan, Redstone, through the company PAC, gave slightly more to Republican candidates than to Democrats in the most recent full-year cycle, according to opensecrets.org. And Redstone might have hoped for some goodwill from Trump, who once called to offer words of support amid her fight to get rid of former company management before he was ever a presidential candidate.\n“He would call and tell her to keep up the good fight,” according to the person who knows her. “I think she feels personally appreciative of that.” (Another possible connection: Mark Burnett, producer of The Apprentice, sold Survivor to CBS.) Redstone and Trump have even lunched together. “Part of what is surprising is that he is giving CBS such a hard time when Shari is on one side and [Larry] Ellison is on the other,” that source said. The Oracle cofounder appeared in February at the Oval Office and is an ally of Trump.\nSpeaking at the New York Times DealBook Summit in 2016, just after Trump won the presidency, Redstone told interviewer Andrew Ross Sorkin, “I’m actually really optimistic for someone to come in and unify the country. I think he listened to a lot of voices around this country that people weren’t listening to about some of the challenges that we have, and I’m hopeful that he’ll surround himself with really good people and start to solve some of the problems we have.” In 2019, Redstone discussed launching a right-wing news channel to take on Fox News, according to The Hollywood Reporter.\nAt the center of Redstone’s dilemma is a news division that is at odds with both her mission to make peace with Trump and her life’s work fighting antisemitism. Redstone’s passion for Israeli causes has caused friction with news operatives for years. “She has no interest in understanding life in the Palestinian world,” one person told me, claiming Redstone did not understand journalism. A source close to Redstone denied this, saying she cared about innocent people on all sides of war. (Redstone declined to comment for this story.)\nRedstone has weighed in on news coverage numerous times in recent months, including sticking up for anchor Tony Dokoupil after he challenged Ta-Nehisi Coates on air. Coates had been on CBS Mornings to discuss his book The Message, which is about censorship and includes a section on Israel and Palestine (Vanity Fair excerpted a portion of the book). But the interview got heated and Dokoupil was accused of not meeting editorial standards. (Dokoupil didn’t respond to a request for comment sent via a CBS PR representative.)\nOnly a few blocks away from its New York headquarters, an adaptation of Good Night, and Good Luck opened to packed houses on Broadway. The play stars George Clooney as CBS journalist Edward R. Murrow, who bravely challenges Senator Joseph McCarthy.\nAmidst all this came the resignation of Bill Owens, the executive producer of 60 Minutes, one of American broadcasting’s longest-running, most respected, and most lucrative TV news series. Owens has claimed to be a victim of corporate interference, telling staff in a memo, “Over the past months, it has become clear that I would not be allowed to run the show as I have always run it, to make independent decisions based on what was right for 60 Minutes, right for the audience,” according to a copy shared with The New York Times. “So, having defended this show—and what we stand for—from every angle, over time with everything I could, I am stepping aside so the show can move forward.” Staff wonder if Owens’s departure might have been a gesture of self-sacrifice, aimed to allow the news division to avoid having to apologize to the White House.\nHis close friend and anchor Scott Pelley went further, unspooling the unhappy tale for viewers on air on April 27, explaining that the company’s corporate parent is waiting on merger approval from the Trump administration for the deal with Ellison. “He did it for us, and you,” Pelley told the 60 Minutes audience in an on-air segment, speaking about Owens’s exit. “Paramount began to supervise our content in new ways. None of our stories has been blocked, but Bill felt he lost the independence that honest journalism requires.”\nPelley has pushed a series of segments critical of the president, who has a long-standing beef with the show. (Trump walked off the set as Lesley Stahl began interviewing him back in 2020. A previous dispute in 2005 between Republican president George W. Bush and Dan Rather and his producer ultimately ended Rather’s career at the network.) Owens’s accusations have prompted questions internally about what exactly happened, though it appears that Owens felt that the heat kept getting turned up on him via Susan Zirinsky, who was appointed in January to a role overseeing sensitive news stories. The news division had been beefing up its oversight of news, which had become stretched by multiple growing responsibilities and under fire from critics, including the Anti-Defamation League and the American Jewish Committee, which had complained about a segment covering State Department resignations over President Joe Biden’s Israel defense policies.\nTwo TV news executives said that 60 Minutes made a mistake in the editing of the Harris interview. “You are not supposed to make the edit that they made,” said one person, describing the use of the shorter answer given by the then vice president in response to a question about US relations with Israel’s prime minister, Benjamin Netanyahu. CBS News released the transcripts, showing it had used one portion of Harris’s wordy answer in a promo during Face the Nation and a more succinct answer during the Sunday show.\n“If Mike Wallace had done the interview, he would have said, ‘I can’t believe what you just said to me because it was garbage, and you’re supposed to be president?’” A second experienced TV news executive agreed and said: “Let her do the word salad, and then say, ‘She finally said this…’ You are being true and reflective of the conversation, and they didn’t do that. It’s relevant if you have a commander in chief who can’t communicate.”\nA person close to the show pushed back on the idea of a mistake: “This is absolutely untrue.” The company responded to the Trump lawsuit in a statement that read: “The interview was not doctored; and 60 Minutes did not hide any part of…Vice President Kamala Harris’s answer to the question at issue. 60 Minutes fairly presented the interview to inform the viewing audience, and not to mislead it. The lawsuit Trump has brought today against CBS is completely without merit and we will vigorously defend against it.”\nThe first TV news executive believes that Pelley has become too zealous. “The problem is, Trump is a crazy, kooky, dangerous president. It’s not our job to be the place that looks for every angle possible to take him down. The audience as well. It’s not what 60 Minutes is meant to be.” This person continued, “It’s hurting the broadcast.” The May 4 edition of 60 Minutes included a Pelley segment on Trump’s targeting of law firms. The final broadcast of the season, airing this coming weekend (Sunday, May 18), is not expected to include Pelley.\nOwens’s estimated $3 million contract is being honored, according to a person familiar with discussions. The question is: Who is now running the show? Technically, executive editor Tanya Simon, the daughter of legendary anchor Bob Simon, is in charge, but sources say Pelley had made himself the unofficial executive producer, in part because of his close partnership with Owens. A person close to the show said there was no question that Simon was in charge, while another person said staffers were taking their lead from Pelley because of his long tenure, leadership, and tough stance on Trump actions. (Pelley declined a request for comment via a spokesperson.)\nSeveral people familiar with internal conversations said there’s also been friction between the Owens-Pelley camp and Zirinsky, the former CBS News chief. She stepped down from CBS News in 2021 and was given a wide-ranging programming-making role at the company, but stepped back in January after a segment about Biden’s State Department attracted criticism. Zirinsky returned as part of a broader effort to improve standards oversight across the board, which involved reviewing sensitive content at 60 Minutes. The announcement of Zirinsky’s appointment was made not by president of news Wendy McMahon, but by CBS CEO and president George Cheeks. The beefed-up standards team includes a returning Al Ortiz, a former EP of CBS Evening News who had previously retired, and Tom Cibrowski, working as president of news. (Zirinsky declined to comment.)\nZirinsky was given the title of interim executive editor. One rumor around CBS News is that Owens banned Zirinsky from appearing at their offices. While a person close to the show said that was untrue, Zirinsky has not physically been to the 60 Minutes offices, which are located near the CBS News main headquarters. Another source said that Zirinsky is close to Redstone and had a difficult relationship with Owens. Management of the show is complicated by the fact that 60 Minutes has historically been given leave to operate outside of the control of CBS News. The new layer of fact-checking, albeit one that had previously existed in other eras, had clearly irked Owens, though he noted in his exit comments that the show’s segments had not been blocked.\nOne TV executive wondered why Owens didn’t call out Redstone by name or reference Trump in his departure statement. As this person put it, “He’s still taking their blood money.” (Owens did not respond to a message requesting comment.)\nSome people familiar with corporate politics point to McMahon, the president and CEO of CBS News and stations, who also runs CBS Media Ventures, which is jostling in court to retain the rights to distribute Wheel of Fortune and Jeopardy! And jeopardy is what they say McMahon may be in. She had gone to bat for Owens to get him a significant raise, one source told me, but she isn’t viewed as having strong footing at the moment given that the revamp of CBS Evening News, which saw the departure of Norah O’Donnell from the anchor chair, ended up losing viewers. “She supported Bill until the very end,” said one TV executive familiar with the company. McMahon declined to comment.\nAs the show’s month-to-month season comes to a close, Trump is scoring some wins—China agreeing to a pause on trade tariff tit-for-tat and the return of the last living American hostage held in Gaza. “The obvious fact is there are wins—tariffs and Trump directly dealing with Hamas. There are victories and they will be reported. CBS has to report the wins when they exist,” said one CBS News insider.\nAnother person familiar with the company summed up the problem thus: “It’s a no-win situation. If you want a deal to go through, you’re going to be in a compromise with the government.” If the deal were to get blocked, the news division would be low on the list of anyone’s investment priorities, according to this person.","summary":"“Shari has the most to lose,” a source tells VF of the beleaguered figure at the center of the storm. CBS, the president, 60 Minutes, and a handful of billionaires are all involved, and not one of them is happy.","url":"https://www.vanityfair.com/news/story/shari-redstone-paramount-trump","image":"https://media.vanityfair.com/photos/6823aa0ab8e80fd0fc331688/16:9/w_2384,h_1341,c_limit/Shari-Redstone-Donald-Trump.jpg","video":null,"publish_date":"2025-05-16 21:58:21","author":"Vanity Fair","authors":["Vanity Fair"],"language":"en","source_country":"US","sentiment":-0.237},{"id":322152514,"title":"Biden’s Enablers Never Told Us Why They Did It","text":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see more of his videos.\n\nHello, this is Victor Davis Hanson for The Daily Signal. I’d like to do something a little different in this video, and that is to ask an existential question: Why? \n\nLet’s look at the border. President Joe Biden over four years destroyed it. He defanged Border Patrol and Immigration and Customs Enforcement. He stopped the congressionally approved wall. The result was 12 million people came in. They entered illegally. They resided illegally. And we have 500,000 of them suspected of criminal backgrounds. And almost every day there is a murder/rape.\n\nBut here’s the question. Everybody knows he did it but nobody asked why did he do it? Why did you do the most nihilistic thing in the history of the modern presidency?\n\nI think we’re gonna live with this problem for 50 years. But why did he do it? Why did he say, “You can come in without a COVID-19 vaccination but we are gonna get rid of 8,500 of our U.S. citizens in the military who don’t want to be vaccinated”? Why did he say that you need a Real ID but you don’t if you’re in illegally? Why?\n\nWas it that he wanted new constituents because the agenda didn’t appeal to 51% of the population? Did he think that under early and mail-in voting protocols inaugurated in 2020 that he was gonna be able to have these people vote very quickly? Did he want to grow government and then have a bigger entitlement? Higher taxes? Did he not believe in borders? Was he a globalist?\n\nIt was so nihilistic. It was so destructive that we need to know why. Just tell us why you did it. Was it just because you hated half the country and you wanted to destroy it? You hated MAGA? The garbage, semi-fascists? Is that it?\n\nThe same existential is why do all these reporters say now, “We were in on the deal, we covered up for Biden”? “The Biden staff did it.” “No, the media did it.” But they all agreed that he was non compos mentis. He was cognitively challenged when he was nominated, when they cleared the nomination field out. They got rid of Pete Buttigeig. They got rid of Sen. Elizabeth Warren. They got rid of Sen. Bernie Sanders. They all disappeared quickly. And then they used this waxen effigy as a veneer. \n\nBut why? That was very risky to do that. They all tell us they did it, but they don’t tell us why. Was the idea that good old Joe Biden from Scranton had some conservative remnant vestigial aura about him? And then they could use him and they could tell Jill, Joe, “You get to be president but we’re gonna run it.”\n\nOr was it even worse than that? They thought, “This is what we’ve always been waiting for. This is what Barack Obama said when he wanted a third term and he could phone in a left-wing agenda from his basement without appearing in public.”\n\nIn other words, it wasn’t that they were stuck. They saw this as a wonderful opportunity. Use Joe Biden and just have him come in three days a week, stumble through stuff, and then push through the most left-wing, nihilistic, destructive, socialist agenda in history.\n\nIt really was, if you look at the border and crime and Afghanistan and two theater wars and the hyperinflation and the $7 trillion that he borrowed. Was that the reason why? Or were they just incompetent, they just didn’t know? They were just, “I don’t know. Who are we gonna nominate? Oh, Joe.” They didn’t think he was that bad. \n\nBut please, don’t tell us that you covered it up and think that’s a confession sufficient for the American people. Tell us why you did it. They never tell us why.\n\nSo, we had all these polls. They were wrong in 2016. They were wrong in 2020. They lost credibility. And then in 2024, they did it again. As I said earlier, the NPR/PBS poll of then-Vice President Kamala Harris had her winning four points on the night of the election. She lost by a point and a half. They were five and a half points off. \n\nDavid Plouffe, one of the insiders of the Harris campaign, said he was kind of amazed that all the polls had her ahead when their internal polls—that have to be accurate because you work from them in your campaign strategy and you pay for—not one had her ahead.\n\nSo, why would they risk their reputation and lie again in 2024 and be discredited again and give Rasmussen, Insider Advantage, and Trafalgar more and more credibility as the accurate poll? I don’t have that answer. \n\nWas it because they wanted to gin up momentum? They knew she was gonna lose. They thought if they lied, if the Des Moines Register said she was really winning when she lost by 12 points, they’d get more funding. People would say, “Gee-whiz, Trump’s gonna lose. I don’t wanna vote.” Is that the idea?\n\nWhat was it? Why do they continue to lie? They have to tell us why. It’s not enough just to say, “Politics. We want power.” \n\nWhat was the strategy to make you do something so egregious? So egregious to destroy the border and cause so much misery. So egregious to foist somebody who was not in control of his own cognitive powers as president with nuclear codes. So destructive to try to influence a campaign by repeatedly lying that the losing candidate—who was losing the whole time—was going to win. We just want to know why.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson.&#160;Subscribe to our YouTube channel to see... Read More\n\n\nThe post Biden’s Enablers Never Told Us Why They Did It appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/16/bidens-enablers-never-told-us-why-they-did-it/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/GettyImages-2193524980.jpg","video":null,"publish_date":"2025-05-16 21:42:47","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":-0.44},{"id":322149610,"title":"What Top Democrats Said Then, And Now, About Joe Biden's Decline","text":"The release of a new book by CNN anchor Jake Tapper and Axios reporter Alex Thompson, detailing President Joe Biden's mental and physical decline during his term in office, has landed like a bomb inside an already disoriented Democratic Party — sending shockwaves through its ranks.Obtained by Newsweek ahead of its publication on May 20, Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again paints a stark portrait of a presidency in turmoil—and of a leader whose public image of control and clarity masked private struggles with memory, stamina and recognition.The authors recount scenes in which Biden, then 81, failed to identify longtime friends some of the most recognizable faces in the world, like George Clooney, while requiring increasingly restrictive scheduling to manage his energy. Aides, they write, even discussed the optics of wheeling the president on stage during a potential second term.Perhaps more striking than the anecdotes themselves is the charge that a tight circle of advisers, family members, and party loyalists suppressed the worst of it—from donors, voters, and even members of the Cabinet—through the 2024 election cycle.That election ended in defeat. Biden suspended his campaign in July of that year, handing the nomination to Kamala Harris. But by then, the damage was done. Donald Trump, twice defeated in the popular vote by the Democrats in 2016 and 2020, emerged victorious in November and returned to the White House.Nine months later, the Democratic Party is adrift, with early excerpts from the new book forcing public figures to confront their own complicity or candor in real time. Biden himself made a show of damage control with an interview on The View last week. Some party strategists and rising stars have begun to express regret. Others cling tightly to their loyalty. And still others, eyes already on 2028, are quietly offering up preemptive justifications before the blame begins to settle.\"And with that reckoning, one question—once whispered, now shouted—has emerged as a litmus test for the next generation of Democratic leadership. What did you know about Joe Biden's decline, and when did you know it?Newsweek compares what top Democratic officials, fundraisers, and journalists are saying now with what they said before Biden's defeat.Josh ShapiroShapiro, the popular Pennsylvania governor, transitioned from publicly dismissing any concerns about Biden's cognitive abilities during the 2024 election cycle to later asserting he had privately voiced concerns to Biden about his shortcomings during the same period.Post-election:In an interview with Politico published on May 14, Shapiro said: \"I can tell you that I was very frank with the president during his campaign about what I saw were some of the shortcomings. I was very honest with him in a private setting about that.\"What he said in 2024:Speaking with Politico last August, when asked directly if he had concerns about Biden's cognitive decline, Shapiro responded confidently:\n\"Not at all, and I've been in regular contact with the president.\"Pete ButtigiegThe former transportation secretary transitioned from staunchly defending President Biden's mental acuity during the 2024 campaign to acknowledging, post-election, that Biden's decision to run for a second term may have been a misstep for the Democratic Party.Post-election:During a town hall event in Iowa on May 13, Buttigieg reflected on Biden's 2024 campaign, stating, \"Maybe, you know, right now, with the benefit of hindsight, I think most people would agree that is the case,\" when asked if Democrats would have been better off without Biden as the nominee.He added, \"We're also not in a position to wallow in hindsight. We've got to get ready for some fundamental tests of the future of this country and this party.\"What he said in 2024:In a July 2 interview with Spectrum News, post-debate, Buttigieg defended President Biden's capabilities, describing him as a \"focused and disciplined leader.\" He emphasized Biden's effectiveness, stating, \"Every time I needed something from him from the West Wing I got it.\"Rep. Ro KhannaKhanna, a progressive California lawmaker, went from strongly defending Biden's cognitive fitness in mid-2024, emphasizing personal interactions to back his claims, to openly stating later that it was a mistake for Biden to run again, calling it \"painfully obvious\" Biden should not have sought re-election.Post-election:In a statement shared with the Washington Post on May 14, Khanna said: \"In my few interactions at public events, I found [Biden] coherent and proud of his record, but it is now painfully obvious he should not have run. We should have had an open primary. We must acknowledge this truth to regain trust with the American people.\"What he said in 2024:Speaking with CNN in mid-2024, responding to speculation about Biden's cognitive health, Khanna said: \"I've seen the president twice in the past two weeks... He's completely mentally sharp.\"Sen. Chris MurphyThe junior senator from Connecticut transitioned from defending Biden's mental sharpness in early 2024 to explicitly acknowledging Biden experienced cognitive decline after the election, highlighting it as a key factor in Democrats' defeat.Post-election:In an interview with Politico published on May 14, Murphy said: \"There's no doubt that former President Biden suffered cognitive decline in office. The debate is whether it compromised his ability to act as chief executive... clearly, in retrospect, we should have done something different.\"What he said in 2024:On CBS's Face the Nation on February 11, 2024, Murphy confidently remarked: \"Joe Biden is the only person who's beaten Donald Trump... I know that he is ready for this campaign.\"Sen. Elizabeth WarrenWarren also transitioned from a steadfast defender of President Biden's mental acuity during the 2024 campaign to a more nuanced stance post-election, acknowledging the complexities surrounding his cognitive fitness.Post-election:In an interview on the Talk Easy podcast with Sam Fragoso, released on April 20, Warren was asked if she regretted asserting Biden's sharpness. She responded, \"I said what I believed to be true.\"When pressed on whether she observed any decline from 2021 to 2024, she stated, \"Not when I said that.\" She elaborated, \"He was sharp. He was on his feet. I saw him at live events. I had meetings with him a couple of times.\"Fragoso then challenged that \"on his feet\" was faint praise and Warren conceded, \"Fair enough. Fair enough. Look, the question is what are we going to do now?\"What she said in 2024:In multiple appearances throughout early and mid-2024, Warren publicly defended President Biden's mental fitness. For instance, during a July 2024 interview, she stated, \"The man is sharp. The man knows what he's talking about. He does the job.\" She consistently emphasized her confidence in his capabilities, dismissing concerns about his age and cognitive healthGeorge ClooneyClooney transitioned from strongly defending Biden's cognitive fitness in October 2023, to publicly expressing deep concerns about Biden's mental acuity and urging him not to run in a high-profile July 2024 op-ed, and finally acknowledging after the election a specific troubling encounter with Biden—an event that occurred before he published his piece that helped lead to Biden's exit from the race.Post-election:In a statement provided to the Washington Post on May 14, Clooney confirmed:\n\"The anecdote described in the book about the former president not recognizing me is unfortunately accurate... In hindsight, I have to acknowledge the episode troubled me more than I let on at the time.\"What he said in July 2024 (Op-ed, written after the incident above):\n\nIn a widely discussed op-ed published in The New York Times on July 10, 2024—written after the debate and incident in which Biden failed to recognize him—Clooney wrote:\"I love Joe Biden—as a senator, as vice president, and as president. I consider him a friend, and I believe in him. Believe in his character. Believe in his morals. But the one battle he cannot win is the fight against time. None of us can. It's devastating to say it, but the Joe Biden I was with three weeks ago at the fundraiser was not the Joe 'big F-ing deal' Biden of 2010. He wasn't even the Joe Biden of 2020. He was the same man we all witnessed at the debate.\"What he said in 2023:At a fundraising event for Biden in Los Angeles on October 17, 2023, Clooney asserted:\n\"I've known Joe Biden for 20 years, and trust me, there's no one sharper or more dedicated to leading this country. Spend a few minutes with him, you know he's as sharp as ever.\"David AxelrodAxelrod, a longtime Obama adviser, initially questioned Biden's wisdom in continuing his campaign in November 2023, issuing a notably cool statement on the president's decision to run the following year. But after the election loss, he significantly sharpened his criticism, openly confirming Biden's cognitive decline and labeling Biden's decision to run again \"irresponsible.\"Post-election:In a conversation with NPR's Morning Edition on May 14, Axelrod said: \"It was an irresponsible decision on [Biden's] part, and frankly, on his family's part... They adapted his schedule to his declining condition. The anecdotes [in the book] are troubling.\"What he said in 2023:Axelrod posted on X (formerly Twitter) on November 5, 2023, following weak Biden poll numbers: \"Only @JoeBiden can make this decision. If he continues to run, he will be the nominee... What he needs to decide is whether that is wise; whether it's in his best interest or the country's.\"Jaime HarrisonThe former DNC chair consistently defended Biden's mental acuity throughout 2024, and even after the election loss, criticized Democrats who later expressed regret about Biden's candidacy as politically opportunistic.Post-election:In an interview with the Washington Post in May, Harrison remarked: \"Was Joe Biden old? Yes. He acknowledged it. He went through the process. Nobody decided to challenge him then. So don't get a backbone now after you decided not to get in.\"What he said in 2024:At a speech during the DNC Summer Meeting on August 10, 2024, Harrison declared: \"President Biden remains mentally sharp, fully engaged, and deeply committed to moving this country forward.\"JB PritzkerThe Illinois governor and potential 2028 contender moved from strongly backing Biden during the 2024 campaign—publicly dismissing concerns about his health—to later openly criticizing the timing of Biden's decision to drop out of the race post-election, emphasizing it damaged the party's chances.Post-election:In an interview published on May 13 with Forbes, Pritzker remarked: \"Look, all this stuff about his health or, you know, commentary that people are making in books, frankly that's very backward-looking. I think the one thing that I would say is that certainly either he needed to be the Democratic nominee as he promised he would be or he needed to drop out before the Democratic primaries, right? You can't have—and I learned this when I ran for governor—if you're going to have new people running, right, you've got to be able to run in a set of primaries so people can see you operate.\"What he said in 2024:Following a meeting at the White House on July 3, 2024, Pritzker confidently told reporters: \"I'm all in for Joe Biden. I've been campaigning for Joe Biden. I think you've seen I've got dates scheduled to go to Indiana, to Ohio for Joe Biden.\"Jake TapperThe CNN anchor and co-author of Original Sin is himself part of the story, having shifted from neutral and cautious commentary about Biden's cognitive abilities last spring to explicitly revealing a troubling \"cover-up\" of Biden's cognitive decline with his investigative reporting after the election.Post-election:During an appearance on CNN's The Lead on May 8 promoting the book, Tapper revealed: \"What Alex [Thompson] and I uncovered was deeply troubling. There was a concerted effort by Biden's inner circle to hide the extent of his cognitive and physical decline from voters. Many senior Democrats we spoke with privately acknowledged that the decision to run again was both irresponsible and damaging to the country.\"What he said in 2024:On CNN's live coverage of the Biden-Trump debate on June 21, 2024, Tapper commented: \"Clearly President Biden struggled tonight, and it's fair to say voters are going to have real questions about what that means about his capability. Whether it was just a bad night or something deeper, that will be the conversation going forward.\"","summary":"A new book is providing a litmus test for the party: What did you know about Biden's acuity, and when?","url":"https://www.newsweek.com/what-top-democrats-said-then-now-about-joe-bidens-decline-2073468","image":"https://d.newsweek.com/en/full/2646466/former-president-joe-biden.jpg","video":null,"publish_date":"2025-05-16 21:33:38","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.058},{"id":322149592,"title":"Pete Buttigieg's 2028 Ambitions May Be Undermined by New Biden Book","text":"Political blowback over how former President Joe Biden's staff handled concerns about his age before the 2024 election, as revealed in a new book, could pose challenges to Pete Buttigieg and other Democrats with ties to the former president who are eyeing a 2028 presidential run, experts say.Newsweek reached out to Buttigieg's Win the Era PAC for comment via email.Why It MattersDemocrats' loss in the 2024 election has been blamed, in part, on Biden's decision to run for reelection despite voters' concerns about his health, fueled by his widely panned performance in a debate against President Donald Trump in June 2024 that eventually led to his exit from the race.A new book, Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again, written by Jake Tapper and Axios journalist Alex Thompson, alleges that Biden's inner circle orchestrated a comprehensive effort to obscure the president's condition from the public, donors and members of his cabinet.The book has rekindled debate about whether Democrats should have more forcefully spoken about their concerns about Biden's age.Early excerpts of the book notably do not mention Buttigieg, who served as Biden's transportation secretary, as having any knowledge about Biden's condition. But some experts believe the backlash could still be troubling for him in 2028, as he is the one cabinet member most speculated to be considering a presidential bid.What To KnowAlthough the 2028 presidential race is still years away, some pundits are already discussing whether the Biden saga could haunt Democrats in the next election. Political analyst Chuck Todd said this week on his podcast, The Chuck ToddCast, that it will be a \"question anybody who worked directly for Biden\" must answer if they choose to run for president.\"Gina Raimondo, if she thinks about running for president, Pete Buttigieg, all of these cabinet secretaries are now going to have to answer for all of this,\" he said. \"I do wonder if it's going to make anybody that touches Biden persona non grata. Not just anybody directly in the Biden world.\"Buttigieg is already fielding questions about Biden's condition.He told reporters this week that during his tenure in the administration, whenever he needed anything from the White House, he \"got it,\" praising Biden's collaboration with his department on supporting Baltimore after the Francis Scott Key Bridge collapse last year.\"The same president that the world saw addressing that was the president I was in the Oval with, insisting that we do a good job and do right by Baltimore. That's characteristic of my experience with him,\" he said.He said the party \"maybe\" would have been better off had Biden chosen not to run again and that \"most people would agree that that's the case\" in hindsight.Experts were split on whether the situation could cost Democrats in 2028.Grant Davis Reeher, professor of political science at Syracuse University, told Newsweek the Biden drama has made it more difficult to \"legitimize\" the Democrats' brand as the \"party of truth\" against a \"dishonest Trump.\"This political blowback could hurt any Democratic candidate, but Reeher said some cabinet secretaries may have \"plausible deniability\" if they did not have regular access to the president.\"What's becoming clearer about the Biden presidency is a systematic, persistent effort to hide something important from the public, and a denial about the reality that extended down to party activists,\" he said.Candidates like Buttigieg should \"not try to dismiss or discount\" these concerns \"by pointing to worse lies from Trump,\" he said. Instead, they should pledge to be honest about their own health and to be \"as open and exposed to the press as Trump has been. \"Anne Danehy, senior associate dean and associate professor of the practice at Boston University's College of Communications, told Newsweek that voters will likely have moved on to other issues by then.\"Voters are really just concerned about 'What will you do to make my life better,'\" Danehy said. \"I don't think that they're going to remember anything. They're going to be asking 'What are you going to do to address the issues in our lives?\"Buttigieg could address these concerns by saying he did not have indications about any potential decline at the time, and that Biden had won the primary before exiting the race.Is Pete Buttigieg Running for President?Buttigieg gave an update about whether he's running for president this week, after a trip to Iowa fueled speculation he may be inching toward a run. While speaking Tuesday with Anand Giridharadas on Substack, Buttigieg said he is assessing \"the office and what it calls for.\"\"The other thing you're mapping against all of that is...your life. I mean the stakes are always high for somebody thinking about running for visible political office, but they're fundamentally different when you've got a spouse and kids. Having kids can motivate you to run, but it can also motivate you to spend more time at home,\" Buttigieg said.Polls suggest he would be an early favorite to clinch the nomination if he chooses to run.In a poll by Echelon Insights taken from May 8 to May 12 among 1,000 voters \"in the likely electorate,\" Buttigieg had 10 percent of the vote versus other potential candidates. Former Vice President Kamala Harris had 32 percent, and Representative Alexandria Ocasio-Cortez had 8 percent. The poll had a 3.8 percent margin of error.Buttigieg, then the mayor of South Bend, Indiana, rose to national prominence due to his long-shot presidential bid in 2020.Although he had little name recognition heading into the primary, his message appeared to resonate with some Democrats, as he won the Iowa caucus and placed second in the New Hampshire primary. He dropped out of the race in March 2020 after receiving only 8 percent support in the South Carolina primary.What People Are SayingRobert Y. Shapiro, a professor of political science at Columbia University, told Newsweek: \"Few, if any, will face this criticism, and they can deflect any concerns about this with many far more important national issues to talk about.\"Former Transportation Secretary Pete Buttigieg said in Cedar Rapids, Iowa, this week: \"Democrats do not have the best brand around here or in a lot of places. There's a lot of reasons for that. Some fair, and some not fair.\"House Minority Leader Hakeem Jeffries told reporters when asked about Biden on Monday: \"We're not looking backward. We're looking forward at this particular moment in time.\"Strategist Matthew Yglesias wrote in a Substack post: \"On the one hand, he's clearly one of the most talented and skilled communicators that the Democratic Party has. On the other hand, he was a cabinet officer in a failed administration. Not an administration that was bereft of good ideas or good policies, but an administration that was unpopular and rejected at the polls and that completely failed to achieve its stated core objective of rescuing American democracy from the threat of Donald Trump.\"What Happens NextDemocrats, including Buttigieg, may announce or lay the groundwork for their presidential runs over the coming years. The 2028 primary will likely heat up after the 2026 midterms, when Democrats hope for a 2018-style \"blue wave.\"","summary":"Political backlash over how Biden's staff handled his age concerns may pose a challenge for Buttigieg in 2028.","url":"https://www.newsweek.com/pete-buttigieg-presidential-ambitions-joe-biden-2073497","image":"https://d.newsweek.com/en/full/2646473/pete-buttigieg-2028-ambitions-challenge.jpg","video":null,"publish_date":"2025-05-16 21:28:06","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":0.124},{"id":322134480,"title":"Donald Trump calls legendary rock star ‘dumb as a rock’","text":"Dan DeLuca l The Philadelphia Inquirer (TNS)\n\nOpening his “Land of Hope and Dreams” European tour in Manchester, England, on Wednesday, Bruce Springsteen had many critical things to say about President Donald Trump‘s second presidency.\n\nThe Boss called the Trump administration “corrupt, incompetent and treasonous” and together with the E Street Band, exhorted “all who believe in democracy and the best of our American experiment to rise with us, raise your voices against authoritarianism and let freedom ring!”\n\nThe president did not take kindly to the remarks. He took to Truth Social, still on his Middle East visit, on Friday morning, and wrote, “I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States.” He also added that he never liked Springsteen “or his Radical Left Politics” and went on to call him “not a talented guy — Just a pushy, obnoxious JERK.“\n\nSpringsteen, who performed in support of Kamala Harris in Philadelphia last October, “fervently supported Crooked Joe Biden,” Trump said, before going on to seemingly threaten Springsteen with trouble when he returns to the U.S. after his current tour finishes up with dates in Italy in July.\n\nCalling Springsteen “dumb as a rock” and a “dried out ‘prune’ of a rocker (his skin is all atrophied!),” Trump ended the post with “we’ll all see how it goes for him!”\n\nOn Wednesday, Springsteen evoked James Baldwin in striking a hopeful note abut an American future, post Trump. ”We’ll survive this moment,\" he said. “Now, I have hope, because I believe in the truth of what the great American writer James Baldwin said, he said ‘in this world there isn’t as much humanity as one would like, but there’s enough.’”\n\nThe Boss, who referred to Trump as “Dear Leader” in dedicating his song “the Rainmaker” to him Wednesday, has yet to respond. He next performs in Manchester on Saturday night.\n\n©2025 The Philadelphia Inquirer. Visit inquirer.com. Distributed by Tribune Content Agency, LLC.","summary":"The famed musician spoke out about Trump earlier this week, prompting the president to fire back.","url":"https://www.syracuse.com/entertainment/2025/05/donald-trump-calls-legendary-rock-star-dumb-as-a-rock.html","image":"https://www.syracuse.com/resizer/v2/3TQJ7KI4BJA6NNLEU4ZC5FFWTM.jpg?auth=6374ac4dd4c4bea536c877fc0c54b72fabb7b32b02f4876c3a020ef8d094dc8c&width=1280&quality=90","video":null,"publish_date":"2025-05-16 21:12:01","author":"Tribune News","authors":["Tribune News"],"language":"en","category":"politics","source_country":"us","sentiment":0.007},{"id":322152778,"title":"Trump seems to threaten Bruce Springsteen’s return to the U.S.","text":"Donald Trump doesn’t care that Bruce Springsteen was “Born in the USA.”\n\nThe president let it be known on Truth Social Friday that he didn’t appreciate Springsteen “speaking badly” about him and his administration at the Boss’ “Land of Hope and Dreams” concert in Manchester, England, Wednesday night, especially because the rock ‘n’ roll legend did so when he was out of the country.\n\nIn fact, Trump invoked Springsteen’s location in the U.K. in his warning to the singer that he should “KEEP HIS MOUTH SHUT until he gets back into the country.” It certainly sounded as though the commander in chief was threatening the internationally renowned recording arts some kind of consequence for calling his administration “corrupt” and “treasonous” — and doing so while abroad.\n\nTrump also mysteriously and menacingly said, “That’s just ‘standard fare.’ Then we’ll see how how it goes for him!”\n\nWhat kind of consequence Trump appears to have in mind for Springsteen is anyone’s guess. But trying to sic the Department of Homeland Security on him sounds like a move that would be in this administration’s playbook. Perhaps DHS could muck up the New Jersey native’s ability to return to the United States at the end of his tour in early July. But under what legal authority? Again, that would be anyone’s guess.\n\nMaybe Trump was all bluster with his warning. Meanwhile, if nothing else, Trump got to use his Truth Social rant to hurl insults at Springsteen, calling the 75-year-old, multi-award-winning artist an overrated, “no-talent hack” and a “dried out ‘prune’ of a rocker.”\n\nBut Trump calling Springsteen untalented is curious, considering that the former reality TV star played his “Born in the USA” — without his permission — at political rallies during his first campaign for president in 2016. Springsteen is among a number of top musicians, including Adele, Beyonce, Celine Dion, Guns N’ Roses and Mick Jagger, who have opposed the MAGA leader using their their music to promote his campaign and agenda.\n\nTrump’s beef with Springsteen followed the singer taking time out of his performance Wednesday night to deliver a series of rousing, blistering speeches aimed at the “unfit” president.\n\nPerforming with the E Street back, Springsteen introduced the song that gives the tour its name and said: “In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration.”\n\nUnder the Trump administration, Springsteen said, people are being “persecuted for using their right to free speech and dissent,” “the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death,” and its leaders are taking “sadistic pleasure in the pain they inflict on loyal American workers” while “rolling back historic civil rights legislation.”\n\nSpringsteen also said the Trump administration is “abandoning our great allies and siding with dictators,” defunding U.S. universities that “won’t bow down to their ideological demands,” and “removing residents off American streets and, without due process of law, are deporting them to foreign detention centers and prisons.”\n\nThe musician has been a vocal critic of both Trump administrations, while long supporting Democratic causes and candidates. Springsteen notably campaigned for Joe Biden and Kamala Harris’s respective campaigns.\n\nOn Truth Social, Trump zeroed in on Springsteen’s support for Biden. He said that Springsteen, a “pushy, obnoxious jerk,” was too “dumb” to see that Biden was “a mentally incompetent FOOL” and “our WORST EVER president ever who came close to destroying our country.”\n\nIf there’s any consolation for Springsteen, he wasn’t the only famous musician that the president insulted Friday on Truth Social. He was “on the warpath,” TMZ said. He also posted a message that said that Taylor Swift is “no longer HOT.” Trump wanted to take credit for Swift’s declining “hotness” for declaring “I HATE TAYLOR SWIFT!” after she endorsed former Kamala Harris for president.","summary":"Trump, fuming that Springsteen called him 'corrupt' and 'treasonous' while performing in Europe, told the rocker that he needs to 'KEEP HIS MOUTH SHUT until he gets back into the country.'","url":"https://www.mercurynews.com/2025/05/16/trump-seems-to-threaten-bruce-springsteens-return-america/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/Springsteen.jpeg?w=1024&h=765","video":null,"publish_date":"2025-05-16 21:09:18","author":"Martha Ross","authors":["Martha Ross"],"language":"en","category":"politics","source_country":"us","sentiment":0.017},{"id":322148564,"title":"Trump insults Springsteen, Swift from Air Force One","text":"U.S. President Donald Trump used his down time on Air Force One Friday to insult \"obnoxious JERK\" Bruce Springsteen and declare Taylor Swift \"no longer HOT\" in social media blasts against the music giants.\n\nTrump -- returning from a whirlwind Middle East diplomatic trip -- took to his Truth Social platform to feud with Springsteen, who this week told a British concert audience that his homeland is now ruled by a \"corrupt, incompetent and treasonous administration.\"\n\nIn return, the 78-year-old Republican said the legendary rocker, nicknamed \"the Boss,\" is \"Highly Overrated.\"\n\n\"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK,\" Trump wrote in the lengthy tirade.\n\n\"This dried out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just “standard fare.” Then we’ll all see how it goes for him!\"\n\nSpringsteen is an outspoken liberal critic of Trump and campaigned for Democratic president Joe Biden's ultimately abandoned reelection run last year.\n\nWhile in Manchester on his \"Land of Hope & Dreams\" tour Wednesday, he told fans that \"my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years\" is in danger.\n\n\"Raise your voices against authoritarianism and let freedom ring,\" Springsteen said.\n\nTrump also had strong words for Swift, who endorsed Biden's replacement as the Democratic candidate in 2024, Kamala Harris.\n\nIn a separate post, which provided no context, the US president said: \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she’s no longer 'HOT?'\"\n\nHe appeared to be referencing a post in September last year when he declared \"I HATE TAYLOR SWIFT!\"\n\nSwift, 35, is the wealthiest female musician on the planet, with an estimated personal wealth of $1.6 billion, 14 Grammys and 30 MTV Video Music awards.","summary":"U.S. President Donald Trump used his down time on Air Force One Friday to insult &quot;obnoxious JERK&quot; Bruce Springsteen and declare Taylor Swift &quot;no longer HOT&quot; in social…","url":"https://japantoday.com/category/entertainment/trump-insults-springsteen-swift-from-air-force-one","image":"https://media.japantoday.com/img/store/e2/be/25baef72d8684188e28b5ffeb8f9e4e50366/48d870b3cb5befce58775a979361dfb370e67d16/_w1700.jpeg","video":null,"publish_date":"2025-05-16 21:07:50","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","source_country":"jp","sentiment":-0.008},{"id":322131860,"title":"Trump picks more pointless fights with celebs as his agenda flops","text":"Things aren’t going well in President Donald Trump’s tinseltown, but it’s not just because his “big, beautiful bill” flopped.\n\nDespite having his Medicaid-slashing budget proposal shot down by the House Budget Committee Friday, Trump, who has been busy burying his head in Saudi Arabia’s sand, has also been picking pointless fights with celebrities. \n\n\"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\" he wrote on Truth Social.\n\nOf course, the multi-bankrupt felon might be missing the mark on this one considering Swift broke the world record for her $2 billion Eras Tour. Or maybe he hasn’t heard that the singer rakes in more than 26.6 billion annual streams on Spotify.\n\nGiven Trump and Swift’s long-standing feud, it’s unsurprising that he’s still fostering resentment. But the two haven’t publicly crossed paths since the Super Bowl in February. And even then, Swift gave him the cold shoulder. \n\nSwift has been outspoken about her support for Democrats, openly endorsing both Kamala Harris and Joe Biden. She even called out Trump’s actions during the 2020 uprisings in the wake of the police murder of George Floyd. \n\n“After stoking the fires of white supremacy and racism your entire presidency, you have the nerve to feign moral superiority before threatening violence? ‘When the looting starts the shooting starts’??? We will vote you out in November,” she tweeted in May 2020.\n\nTrump, on the other hand, has fretted over Swift’s opinion of him for quite some time. \n\n“I think she’s beautiful—very beautiful! I find her very beautiful. I think she’s liberal. She probably doesn’t like Trump. I hear she’s very talented. I think she’s very beautiful, actually—unusually beautiful!” he said in a 2024 Variety interview.\n\nBut Swift isn’t the only celebrity Trump can’t quite get over; he’s also decided to go after Bruce Springsteen.\n\nAt a show in Manchester, England, on May 14, Springsteen called Trump and his administration \"corrupt, incompetent, and treasonous.\"\n\n\"Tonight, we ask all who believe in democracy and the best of our American spirit to rise with us, raise your voices against authoritarianism, and let freedom ring,” he said.\n\nNaturally, Trump couldn’t handle the criticism, taking to Truth Social for yet another rant. \n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States. Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy,” he wrote.\n\nLike Swift, Springsteen has amassed his own treasure trove of accomplishments in his lifetime, including 20 Grammy awards, a Presidential Medal of Freedom, and induction into the Rock and Roll Hall of Fame. \n\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country,” Trump added.\n\nThreats and social media rants aside, Trump is wrapping up his “public corruption tour” in the Middle East and will also soon be returning to his country. \n\nHe might benefit from heeding his own advice.","summary":"Things aren’t going well in President Donald Trump’s tinseltown, but it’s not just because his “big, beautiful bill” flopped.\n\n\n\nDespite having his Medicaid-slashing budget proposal shot down by the House Budget Committee Friday, Trump, who has been busy burying his head in Saudi Arabia’s sand, has also been picking pointless fights with celebrities. \n\n\n\n\"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\" he wrote on Truth Social.\n\n\n\nOf course, the multi-bankrupt felon might be missing the mark on this one considering Swift broke the world record for her $2 billion Eras Tour. Or maybe he hasn’t heard that the singer rakes in more than 26.6 billion annual streams on Spotify.\n\n\n\nGiven Trump and Swift’s long-standing feud, it’s unsurprising that he’s still fostering resentment. But the two haven’t publicly crossed paths since the Super Bowl in February. And even then, Swift gave him the cold shoulder. \n\n\n\nSwift has been outspoken about her support for Democrats, openly endorsing","url":"https://www.dailykos.com/story/2025/5/16/2322725/-Trump-picks-more-pointless-fights-with-celebs-as-his-agenda-flops?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1258182/story_image/AP23347645531468.jpg?1703270614","video":null,"publish_date":"2025-05-16 20:30:11","author":"Alix Breeden","authors":["Alix Breeden"],"language":"en","category":"politics","source_country":"US","sentiment":0.082},{"id":322127748,"title":"Trump reignites feud with Taylor Swift: 'No longer hot' because of me","text":"President Donald Trump reignited his feud with Taylor Swift, declaring in a social media post that she was no longer popular because of him. \"Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’\" Trump wrote on Truth Social. The criticism comes as the president wraps up a historic whirlwind tour to the Middle East. Swift and the White House did not return a request for comment. JIMMY KIMMEL NEEDLES TRUMP OVER POST ABOUT TAYLOR SWIFT BOOS, CLAIMS HE'S 'JEALOUS' It’s unclear what prompted Trump to mock Swift this time, though he has occasionally taken shots at the superstar singer since last September after she endorsed his opponent, former Vice President Kamala Harris, in the 2024 election. Trump recently poked fun at Swift during the Philadelphia Eagles' Super Bowl visit to the White House in April. \"I watched in person. I was there along with Taylor Swift. How did that work out?\" Trump said at the celebration. \"How did that one work out?\" TAYLOR SWIFT HEARS LOUD BOOS AT SUPER BOWL LIX AFTER TRUMP GETS RAUCOUS CHEER He first took aim at Swift after she endorsed Harris in the presidential election last September. In a Truth Social post on September 15, Trump wrote, \"I HATE TAYLOR SWIFT!\" The feud continued at the Super Bowl in February after Swift was booed by the crowd after she appeared on the jumbotron. TRUMP MOCKS TAYLOR SWIFT, CHIEFS AFTER SHE WAS BOOED DURING SUPER BOWL LIX Trump, who made history as the first sitting U.S. president to attend a Super Bowl, received loud cheers from the crowd when he was shown on screen during the national anthem. Swift also had to watch her boyfriend, Kansas City Chiefs tight end Travis Kelce, suffer a crushing 40-22 loss to the Philadelphia Eagles. Trump took the opportunity to take a dig at the singer afterward. \"The only one that had a tougher night than the Kansas City Chiefs was Taylor Swift. She got BOOED out of the Stadium. MAGA is very unforgiving!\" Trump wrote on Truth Social after the game. Fox News' Jackson Thompson contributed to this report.","summary":"President Trump mocked superstar Taylor Swift on social media in an ongoing clash that dates back to her Kamala Harris endorsement in the 2024 election.","url":"https://www.foxnews.com/media/trump-reignites-feud-taylor-swift-no-longer-hot-because-me","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trumptaylor.png?ve=1&tl=1","video":null,"publish_date":"2025-05-16 20:24:26","author":"Kristine Parks","authors":["Kristine Parks"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.021},{"id":322135404,"title":"Trump’s ‘big, beautiful bill’ at a crucial juncture","text":"United States House Republicans’ “big, beautiful bill”, a wide-ranging tax and spending legislation, is at a crucial moment.\n\nThe nearly 400-page legislation proposes sweeping changes which include extending the 2017 tax cuts, slashing taxes for businesses and individuals, and enacting deep cuts to social programmes like Medicaid and SNAP.\n\nWhile Republicans tout the bill as a boon for economic growth and middle-class relief, nonpartisan analysts warn it could add trillions to the national debt and strip millions of Americans of medical and food assistance.\n\nThe bill will be voted on by the House Budget Committee today and, if passed, will be voted on the floor next week.\n\nThe most substantive part of the bill is an extension of the 2017 tax cuts. The tax bill would add at least an additional $2.5 trillion to the national deficit over the next 10 years and decrease federal tax revenue by roughly $4 trillion by 2034.\n\nPassing the legislation will also raise the debt ceiling, which sets the amount of money the government can borrow to pay for existing expenditures, by $4 trillion, a sticking point for hardline Republicans who want deeper cuts.\n\nHere are some of the key measures in the proposed bill in its current form.\n\nChanges for households\n\nThe bill increases standard deductions for all Americans. Individual deductions will increase by $1,000, $1,500 for heads of households, and $2,000 for married couples.\n\nThe bill extends the child tax credit of $2,000, which would otherwise have ended with the expiration of the 2017 tax cuts at year’s end.\n\nIt bumps up the child tax credit by $500 per child for this tax year and runs through the end of 2028. It also includes a $1,000 savings account for children born between December 31, 2024 and January 1, 2029. The legislation would also allow families to annually contribute $5,000 tax-free.\n\nThere is a new tax deduction for Americans 65 and older. The new bill would give a $4,000 annual deduction starting this year for people making a gross income of $75,000 for a single person and $150,000 for a married couple. If passed, the rule would take effect for the current tax year and run until the end of 2028.\n\n“It will just make tax paying more complicated and more uncertain when a lot of these things ultimately expire,” Adam Michel, director of tax policy studies at the right-leaning Cato Institute, told Al Jazeera.\n\nAnother provision in the bill modifies state and local tax (SALT) deductions. It allows filers to be able to write off some of what they paid in local and state taxes from their federal filings.\n\nUnder the 2017 tax act, that was capped at $10,000, but the new legislation would raise that to $30,000. Some Republicans, particularly those in states with higher taxes like New York and California, have been pushing to raise the cap or abolish it altogether. However, they have faced fiscal hawks and those who see the increases as relief for those already wealthy.\n\nThe bill includes an increased benefit for small businesses that allows them to deduct 23 percent of their qualified business income from their taxes, up from the current 20 percent.\n\nThere is also a call for no taxes on overtime pay for select individuals. It would not apply to people who are non-citizens, those who are considered “highly compensated employees,” and those who earn a tipped wage.\n\nThe bill, however, also eliminates taxes on tips, a critical campaign promise by both Donald Trump and his Democratic rival Kamala Harris. The bill would allow people who work in sectors like food service, as well as hair care, nail care, aesthetics, and body and spa treatments, to specifically deduct the amount of tipped income they receive.\n\nAt the federal level, employers will still not be required to pay tipped workers more than the subminimum wage of $2.13 hourly. The intention is that workers will be able to make up the difference in tipping the receipt from customers.\n\nCuts to the social safety net\n\nThe legislation calls to make $880bn in cuts to key government programmes with a focus mostly on Medicaid and food stamps.\n\nThe CBO found that more than 10 million people could lose Medicaid access and 7.6 million could lose access to health insurance completely by 2034 under the current plan.\n\nEven far-right Republicans have called out the Medicaid cuts. In an op-ed in The New York Times this week, Republican Senator Josh Hawley of Missouri said the cuts are “morally wrong and politically suicidal”.\n\nAccording to a new report from One Fair Wage shared with Al Jazeera, tipped workers could be hit especially hard, as 1.2 million restaurant and tipped workers could lose access to Medicaid.\n\n“A no tax on tips proposal, which is like a minuscule percentage of their income and doesn’t affect two-thirds of tips workers because they don’t earn enough to pay federal income tax, is just nowhere near enough to compensate for the fact that we’re going to have millions of these workers lose the ability to take care of themselves, in some cases go into medical debt, in many cases just not take care of themselves,” Saru Jayaraman, president of One Fair Wage, an advocacy group for restaurant workers, told Al Jazeera.\n\nThe bill also introduces work requirements to receive benefits, saying that recipients must prove they work, volunteer or are enrolled in school for at least 80 hours each month.\n\nAt the same time, the bill also shortens the open enrolment period by a month for the Affordable Care Act (ACA), otherwise known as Obamacare. This means people who have employer-funded healthcare and lose their job might lose eligibility to buy a private plan on the healthcare exchange.\n\n“It’s taking folks like 11 to 12 weeks to find a new job. The worse the labour market gets, that number will tick up. If you’re unemployed for three months, you get kicked off Medicaid,” Liz Pancotti, managing director of policy and advocacy at the Groundwork Collective, told Al Jazeera.\n\n“Then, if you try to go buy a plan on the ACA marketplace, you are no longer eligible for subsidies … which I think is really cruel.”\n\nOther major proposed cuts will hit programmes like Supplemental Nutrition Assistance Programme or SNAP, which helps 42 million low-income individuals afford groceries and comes at a time when food costs are still 2 percent higher than a year ago. The CBO found that 3 million people could lose SNAP access under the new plan.\n\nThe bill would also force states to take up more responsibility in funding the programmes. States would be required to cover 75 percent of the administrative costs, and all states would have to pay at least 5 percent of the benefits — 28 states would need to pay 25 percent.\n\n“States are now going to be on the hook for billions of dollars in funding for these two vital programmes. They have a tough choice. One is, do they cut funding from others like K-12 education, roads, veteran services, etc, to cover this gap, or do they raise taxes so that they can raise more revenue to cover this gap,” Pancotti added.\n\nUnder the current law, the federal government is solely responsible for shouldering the cost of benefits. The proposed cuts would save $300bn for the federal government but hit state budgets hard.\n\nBill fuels Trump administration priorities\n\nThe bill would also cut the $7,500 tax credit for new electric vehicle purchases and $4,000 for a used EV, a move which could hurt several major US automakers that are already reeling from the administration’s tariffs on automobiles.\n\nGeneral Motors pumped billions into domestic EV production in the last year, which has included a $900m investment to retrofit an existing plant to build electric vehicles in Michigan and alongside Samsung, the carmaker invested $3.5bn in EV battery manufacturing in the US.\n\nIn February, Ford CEO Jim Farley said that revoking the EV tax credit could put factory jobs on the chopping block. The carmaker invested in three EV battery plants in Michigan, Kentucky and Tennessee. The federal government under the administration of former President Joe Biden paid out more than $2bn in EV tax credits in 2024.\n\nThe proposed legislation would also give the Trump administration authority to revoke the tax exempt status of nonprofit organisations that it deems as a “terrorist supporting organisation”. It would give the secretary of the treasury the ability to accuse any nonprofit of supporting “terrorism”, revoke their tax exempt status without allowing them due process to prove otherwise, which has raised serious concerns amongst critics.\n\n“This measure’s real intent lurks behind its hyperbolic and unsubstantiated anti-terrorist rhetoric: It would allow the Treasury Department to explicitly target, harass and investigate thousands of U.S. organizations that make up civil society, including nonprofit newsrooms,” Jenna Ruddock, advocacy director of Free Press Action, said in a statement.\n\n“The bill’s language lacks any meaningful safeguards against abuse. Instead it puts the burden of proof on organizations rather than on the government. It’s not hard to imagine how the Trump administration would use it to exact revenge on groups that have raised questions about or simply angered the president and other officials in his orbit.”\n\nThe bill would introduce new taxes on colleges, including a varying tax rate based on the size of a university’s endowment per student with the highest at 14 percent for universities with a per student endowment of more than $1.25m but less than $2m and 21 percent for those of $2m or more.\n\nThis comes amid the Trump administration’s increased tensions with higher education. In the last week, the Trump administration pulled $450m in grants to Harvard on top of the $2.2bn it pulled in April — a move which will hinder research into cancer and heart disease, among other areas. Harvard has an endowment of $53.2bn, making it one of the richest schools in the country.\n\nThe legislation would also increase funding for a border wall between the US and Mexico, which the administration has argued will help curb undocumented immigration. However, there is no evidence that such a wall has deterred border crossings.\n\nA 2018 analysis from Stanford University found that a border wall would only curb migration by 0.6 percent, yet the bill would give more than $50bn to finish the border wall and maritime crossings. The bill would also provide $45bn for building and maintaining detention facilities and another $14bn for transport.","summary":"The bill proposes sweeping changes, including Trump&#039;s 2017 tax cuts and enacting deep cuts to social programmes.","url":"https://www.aljazeera.com/economy/2025/5/16/trumps-big-beautiful-bill-at-a-crucial-juncture?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/05/2025-05-16T101739Z_591021594_RC2YIEA16E7L_RTRMADP_3_USA-TRUMP-GULF-1747390990.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-05-16 20:21:22","author":"Andy Hirschfeld,Apps Support","authors":["Andy Hirschfeld","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.013},{"id":322120862,"title":"Poll Shows Clear Favorite to Succeed Trump in 2028","text":"Nearly half of registered Republicans surveyed by a pollster in May said they would support Vice President JD Vance in a primary to succeed Donald Trump in 2028. \n\nA J.L. Partners poll given to the New York Post found that 46 percent of respondents would back Vance, making him the only potential candidate who received double-digit support.\n\nFlorida Gov. Ron DeSantis came in a distant second at eight percent, followed by the Ohio gubernatorial candidate Vivek Ramaswamy at seven percent. Secretary of State Marco Rubio and Texas Sen. Ted Cruz each received six percent support, and former South Carolina Gov. Nikki Haley received five percent support.\n\nFor Democrats, the poll found the most likely 2028 nominee is former Vice President Kamala Harris, who had 30 percent support, followed by former Transportation Secretary Pete Buttigieg, who had 8 percent backing. Governors Josh Shapiro of Pennsylvania and Gavin Newsom of California came in at seven percent each,\n\nThe poll did not consider Trump, 78, as a potential Republican candidate. He will be termed out of office in January 2029, but he and his close allies have signaled he might try to bypass the constitution and run for office a third time. \n\nVance, 40, has fully embraced his place in MAGA despite once detesting Trump, calling the then-candidate “America’s Hitler” in 2016. He has been a staunch Trump defender recently and had his loyalty rewarded by being added to the presidential ticket last summer, just two years after he was first elected to public office.\n\nDeSantis, 46, fell out of favor with Trump in 2023 when he campaigned against him in a Republican primary. He may be the most popular candidate for conservatives who do not want to see the MAGA movement continue another four years.\n\nRubio, 53, ran against Trump in the 2016 Republican primaries and was insultingly nicknamed “Little Marco” by the current president. Rubio and Trump have since become close allies, with the ex-senator from Florida reportedly landing on Trump’s VP shortlist last summer. He is firmly embedded in MAGA as a top official in the Trump administration, but he is not as bombastic as Trump, Vance, or even DeSantis.\n\nTrump said in March that the future of MAGA looked “so strong,” with Rubio and Vance appearing to be the early favorites to get the president’s backing come primary season.\n\n“You look at Marco, you look at JD Vance, who’s fantastic,” he told NBC News in an interview on Meet the Press. “You look at—I could name 10, 15, 20 people right now just sitting here. No, I think we have a tremendous party.”","summary":"Kevin Lamarque / REUTERSNearly half of registered Republicans surveyed by a pollster in May said they would support Vice President JD Vance in a primary to succeed Donald Trump in 2028. \n\nA J.L. Partners poll given to the New York Post found that 46 percent of respondents would back Vance, making him the only potential candidate who received double-digit support.\n\nFlorida Gov. Ron DeSantis came in a distant second at eight percent, followed by the Ohio gubernatorial candidate Vivek Ramaswamy at seven percent. Secretary of State Marco Rubio and Texas Sen. Ted Cruz each received six percent support, and former South Carolina Gov. Nikki Haley received five percent support.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/poll-shows-clear-favorite-to-succeed-trump-in-2028/","image":"https://www.thedailybeast.com/resizer/v2/NNKCPVSTP5AS3PMAKKL4FT5HSI.JPG?smart=true&auth=2b5b48d7e9ea0cc3f544260956b8e17851d5170dc98a72c4eab602683e3fc033&width=1440&height=1080","video":null,"publish_date":"2025-05-16 19:49:27","author":"Josh Fiallo","authors":["Josh Fiallo"],"language":"en","source_country":"us","sentiment":-0.132},{"id":322130942,"title":"Donald Trump Is More Popular in New Jersey Than Joe Biden Was Last Year","text":"President Donald Trump is more popular in New Jersey—a Democratic stronghold that shifted toward Republicans in last year's election—than President Joe Biden was in springtime of last year, according to a new poll.Why It MattersTrump's approval rating has seen some fluctuation in recent weeks amid growing dissatisfaction with his economic policies, particularly tariffs, and his handling of immigration. But, Trump's inroads in New Jersey have given Republicans hope that they can compete in this year's governor's race.Democrats have easily won New Jersey in most recent presidential races. Former President Joe Biden carried it by 16 points in 2020. But in 2024, former Vice President Kamala Harris carried it by only six points, Democrats' worst performance in the Garden State in decades.What To KnowNew Jersey voters are roughly split on whether they approve of Trump's job performance nearly four months into his second term in office, according to the Emerson College poll, which surveyed 1,000 registered voters from May 11 to May 13, 2025.It found that 46.7 percent of respondents approve of Trump's job performance while 47 percent disapprove of him so far. It had a margin of error of plus or minus 3 percentage points.That's a stronger approval than Biden held in New Jersey nearly one year earlier, when an Emerson College poll showed that only 40 percent of New Jersey voters approved of him, while 46.5 percent disapproved of his job performance.That poll was an early red flag for Democrats about New Jersey, as it showed Biden only leading by about 6.3 points in the presidential race—only a slightly higher lead than Harris' eventual 5.9 point victory in the state.The 2024 poll surveyed 1,000 registered voters from March 26 to March 29, 2024, and had a margin of error of plus or minus 3 percentage points.The poll also found that Trump is more popular in New Jersey than Democratic Governor Phil Murphy, who is term-limited. Murphy was approved by 40.1 percent of respondents while his performance as governor received a disapproval rating of 44.7 percent.This year's gubernatorial race will be a key test about whether Republicans can continue to gain in the state.Newsweek reached out to a Murphy spokesperson and Biden's office for comment via email.New Jersey last voted for a Republican presidential candidate in 1988, but its off-year gubernatorial races have been more competitive, with Republican Chris Christie serving two terms from 2010-2018. The state last elected a Republican senator in 1972.What People Are SayingWall Street Journal Assistant Editor James Freeman wrote in an opinion article on Thursday: \"Mr. Trump ran more strongly than expected in the Garden State in 2024 when he finished within 6 percentage points of Kamala Harris. Since then he seems to have maintained and perhaps even enhanced his competitive standing.\"Democratic New Jersey gubernatorial candidate and Jersey City Mayor Steven Fulop told Newsweek this week: \"The talking point from Republicans is going to be 'Four more years of Phil Murphy.' So I think that we're unique in a situation that we're coming from a place where we're saying, 'Yeah, the Democratic Party in New Jersey has been broken, and we need to rebuild the Democratic Party.'\"President Donald Trump wrote on Truth Social last month: \"They are negative criminals who apologize to their subscribers and readers after I win elections big, much bigger than their polls showed I would win, [lose] a lot of credibility, and then go on cheating and lying for the next cycle, only worse.\"What Happens NextAfter the June 10 primary, voters in New Jersey will head to the polls for the general election on November 4. The Cook Political Report currently classifies the race as leaning Democrat, meaning it is \"considered competitive\" but Democrats have an \"advantage.\"","summary":"New Jersey residents are split on Trump's job performance, according to a new poll, but he has made inroads in the reliably blue state.","url":"https://www.newsweek.com/donald-trump-popularity-compared-governors-2073353","image":"https://d.newsweek.com/en/full/2646430/donald-trump-joe-biden-new-jersey-approval.png","video":null,"publish_date":"2025-05-16 19:42:35","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.201},{"id":322163312,"title":"Bad Blood: Trump Says Taylor Swift 'No Longer Hot' After His Criticism","text":"President Donald Trump took to Truth Social on Friday morning to declare that pop star Taylor Swift is “no longer hot” after he proclaimed his contempt for the singer.\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?'” President Trump asked in a Friday morning Truth Social post.\n\nSocial media users shared the president’s remarks, with one X user plastering Trump’s Truth Social post over a video of Swift dancing somewhat robotically onstage at one of her concerts.\n\n“Is that dancing?” one X user inquired of Swift’s moves, adding a laughing crying emoji after his question.\n\n“Whoa… those dance moves,” another laughed, adding, “My five year old has better hip action and rhythm,” before calling Swift “overrated.”\n\n“It’s amazing she is paid so much for being so mediocre,” a third said.\n\n“She was never hot,” another argued.\n\n“She is so boring,” another X user declared.\n\n“She’s no longer relevant,” another wrote.\n\n“We now see her for what she is. A talentless hack,” another asserted.\n\nAs Breitbart News reported, Swift endorsed then-Vice President Kamala Harris in September, ahead of the 2024 presidential election via a lengthy Instagram post in which she referred to herself as a “childless cat lady.”\n\nView this post on Instagram\n\nA post shared by Taylor Swift (@taylorswift)\n\nA few days later, Trump took to Truth Social, writing, “I HATE TAYLOR SWIFT!”\n\nNotably, after the “Bad Blood” singer’s endorsement of Harris, “the number of people with a favorable opinion of Swift” took “a nosedive” when compared to the year prior, according to a poll conducted by NBC News last year.\n\nAbout 47 percent of Republicans responded to the survey saying they had a negative view of Swift, “a sharp uptick” from the 26 percent who said they saw the singer negatively in the outlet’s 2023 poll.\n\nMeanwhile, Republican respondents’ positive opinions of the “Cruel Summer” singer also dropped from 28 to percent to a mere 12 percent, while positive views of Swift even fell among independents, from 34 percent in 2023 to 26 percent last fall, ahead of the presidential election, NBC noted.\n\nEarlier this year, Swift’s live album, “Lover: Live From Paris” lost a staggering 99 percent in sales over the course of one week, falling from No. 1 on the Top Album Sales chart to No. 42, according to a report by Forbes.\n\nFor years, Swift did not make her political stance known. That wasn’t until 2018, when the “I Knew You Were Trouble” singer appeared to test how much influence her celebrity status had by endorsing Democrat Phil Bredesen in that year’s Tennessee Senate race.\n\nAs it turns out, Swift’s political endorsements do not appear to be worth much.\n\nNotably, the “We Are Never Ever Getting Back Together” singer failed to take out a Republican candidate, as Bredesen epically lost epically to now-Senator Marsha Blackburn (R-TN) in the November 2018 election.\n\nSimilarly, the pop star’s attempt at preventing President Trump from taking on a second term in the Oval Office proved futile.\n\nThe 45th and 47th president won the 2024 election in a historic landslide that included Trump not only winning the Electoral College (the only thing needed to secure victory in a presidential race), but the popular vote and every swing state in the nation as well.\n\nAs for Swift, the 35-year-old self-proclaimed childless cat lady would likely be better served staying in her lane, working on her music and dance choreography, lest her popularity slip further.\n\nAlana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.","summary":"President Donald Trump took to Truth Social on Friday morning to declare that pop star Taylor Swift is \"no longer hot\" after he proclaimed his contempt for the singer.\n\n\nThe post Bad Blood: Trump Says Taylor Swift &#8216;No Longer Hot&#8217; After His Criticism appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/05/16/bad-blood-trump-says-taylor-swift-no-longer-hot-after-his-criticism/","image":"https://media.breitbart.com/media/2024/09/taylortrump-640x335.jpg","video":null,"publish_date":"2025-05-16 19:37:15","author":"Alana Mastrangelo,Taylor Swift","authors":["Alana Mastrangelo","Taylor Swift"],"language":"en","source_country":"US","sentiment":-0.122},{"id":322120976,"title":"Legendary actor shockingly comes out in support of Donald Trump with space plea","text":"Legendary actor shockingly comes out in support of Donald Trump with space plea\n\nREAD MORE: People are freaking out after seeing Earth from THIS angle\n\nBy CHRIS MELORE, ASSISTANT SCIENCE EDITOR FOR DAILYMAIL.COM\n\nPublished: 18:37 BST, 16 May 2025 | Updated: 19:57 BST, 16 May 2025\n\nA legendary actor has taken a surprising turn to the right after calling on President Donald Trump to make Pluto great again.\n\nWilliam Shatner, best known for playing Captain Kirk on Star Trek, pushed for the Republican leader to overrule scientists and declare that Pluto is once again the ninth planet in the solar system.\n\nThe actor blasted the scientific community on Thursday, calling members of the International Astronomical Union (IAU) a bunch of 'idiots' for stripping Pluto of its status as a planet in 2006, which it had held since its discovery in 1930.\n\nThe 94-year-old took to X to voice his disgust with the scientific community after astronomers reportedly found a large mass in our solar system that some are calling the new 'Planet Nine.'\n\nThis new 'planet' is believed to be hanging out at the very edge of our solar system, billions of miles beyond Pluto, but astronomers still haven't even confirmed if it really exists.\n\nShatner, who has not openly come out as conservative or liberal, has been a long-time supporter of many progressive causes including the fight against climate change and Canada's universal healthcare system.\n\nNow, the Emmy Award winner has apparently swung to the right, siding with MAGA supporters when it comes to President Trump's authority to intervene in typically apolitical matters - like the renaming of mountains and bodies of water.\n\n'He renamed a Gulf and the Astronomer who discovered Pluto was American. Seems like America has jurisdiction on things outside its borders,' Shatner explained on X.\n\nWilliam Shatner called on President Donald Trump to issue an executive order to restore Pluto's status as a planet in our solar system\n\nShatner also took issue with scientists refusing to honor a public vote that chose the name Vulcan for one of Pluto's moons\n\nThe actor cited Trump's ability to rename the Gulf of Mexico the Gulf of America while making the case for the White House to strip scientists of their naming privileges\n\nShatner is one of many people who still feels Pluto was undeservingly kicked out of our family of planets. \n\nSpaceX CEO Elon Musk has publicly agreed with the screen legend on this issue, writing on X in 2021: 'Pluto is a planet. Fight me.'\n\nIn his fiery post, the sci-fi star declared that the scientists in charge of astronomical research were 'just a bunch of corrupt nerds on a power trip' and said it was time for Trump to end their 'tyranny of the cosmos.'\n\nShatner spent Thursday night sparring with fans on X and suggested that Trump should step in make Pluto a planet again. \n\nHe even called on Musk, the so-called 'first buddy,' to convince Trump to sign an executive order giving Pluto back its status in the cosmos.\n\nIt's a surprising turn for the actor, who recently criticized Trump for his continued attempts to purchase his home country of Canada.\n\nIn a recent interview with Bill Maher, the Shatner was baffled by the results of the 2024 presidential election.\n\n'I don't know why Democrats lost. I don't understand [it],' he told Maher on the Club Random podcast.\n\nDailyMail.com has reached out to Shatner for comment.\n\nThe TV star also called on Elon Musk, a friend of President Trump, to lobby the White House to make the change\n\nShatner has not publicly supported Donald Trump and also recently expressed surprise that Kamala Harris was not elected president in 2024\n\nShatner, the 1960s star of Star Trek, called members of the International Astronomical Union 'idiots' and 'corrupt nerds' after naming another reported planet in our solar system as the ninth planet\n\nShatner isn't the first celebrity tied to the sciences to make a recent turn to the right.\n\nHis friend and noted scientist Neil Degrasse Tyson has been at the center of a liberal meltdown on social media after posting a picture with a red MAGA hat.\n\nTyson also posted recently about assault rifles and a recent trip to a shooting range with his wife, which drew the ire of the left on social media.\n\nShatner and Tyson are actually set to battle over the future of Pluto in June during a one-night show in Seattle.\n\nNeil Degrasse Tyson and William Shatner are hosting an on-stage debate in June where they will argue over the future of Pluto as a planet \n\nPluto was downgraded from the ninth planet to a dwarf planet in 2006, but a NASA expert and others have refused to accept the change. Former NASA chief Jim Bridenstine, Elon Musk, and William Shatner have all supported the cause of giving Pluto its planetary status back \n\nLauren Sanchez's ugly wardrobe malfunction that exposed the desperate truth of what lies beneath\n\nTyson, an astrophysicist and director of the Hayden Planetarium in New York, has been a strong supporter of demoting Pluto from its status as a planet.\n\n'Pluto is not only different from the other planets, it's part of a whole new family of objects,' he argued in his book The Pluto Files.\n\nHowever, Shatner has some major support in this controversy, including the former head of NASA.\n\nIn 2019, Jim Bridenstine refused to accept the change, claiming that Pluto was still the ninth planet because it has an ocean under its surface, organic compounds on its surface, and its own moons.\n\n'You can write that the NASA Administrator declared Pluto a planet once again. I'm sticking by that, it's the way I learnt it, and I'm committed to it,' Bridenstine said at the University of Colorado Boulder in 2019.\n\nBridenstine led the space agency from 2018 to 2021 after being appointed to the position during President Trump's first term in office. He's criticized the IAU for having a 'sloppy definition' of what they consider a planet.\n\nShare or comment on this article:\nLegendary actor shockingly comes out in support of Donald Trump with space plea\n\nAdd comment","summary":"A legendary actor has taken a surprising turn to the right and is calling on President Trump to make Pluto great again.","url":"https://www.dailymail.co.uk/sciencetech/article-14717495/Legendary-actor-shockingly-comes-support-Donald-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/05/16/18/98461197-0-image-m-19_1747416872091.jpg","video":null,"publish_date":"2025-05-16 18:57:13","author":"Chris Melore,Editor","authors":["Chris Melore","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.175},{"id":322103430,"title":"President Trump declares Taylor Swift is ‘no longer hot’ as he escalates one-sided feud","text":"Though he should have bigger fish to fry, the President of the United States of America continues to be at war with Taylor Swift.\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?'” President Trump posted on his social media platform, Truth Social, on Friday.\n\nIn September 2024, after Swift endorsed Kamala Harris in the 2024 presidential election, Trump, 78, declared, “I HATE TAYLOR SWIFT.”\n\nHe also said on “Fox & Friends” at the time that he likes fellow Kansas City Chiefs WAG Brittany Mahomes “much better” because “she’s a big MAGA fan.” (He notably taunted Swift for getting booed at this year’s Super Bowl, where she watched boyfriend Travis Kelce play.)\n\nTrump went on to insist that he “was not a Taylor Swift fan” because “she’s a very liberal person” who “seems to always endorse a Democrat.”\n\nThe previous November, however, the reality star-turned-Republican politician was singing a different tune.\n\n“She’s got a great star quality,” he gushed to Variety in an interview published in June 2024. “She really does.”\n\nHe continued, “I think she’s beautiful — very beautiful! I find her very beautiful. I think she’s liberal. She probably doesn’t like Trump. I hear she’s very talented. I think she’s very beautiful, actually — unusually beautiful!”\n\nTrump claimed he didn’t “know” the Grammy winner’s music “well.”\n\n“But she is liberal, or is that just an act?” he asked the reporter. “She’s legitimately liberal? It’s not an act? It surprises me that a country star can be successful being liberal.”\n\nWhen the reporter informed Trump that Swift had shifted from country to pop over a decade ago, the latter responded, “Garth Brooks is liberal. Explain that! How does it happen? But he’s liberal. It’s one of those things …”\n\nSwift, who had been rumored to be secretly conservative, publicly endorsed Tennessee Democratic candidates Phil Bredesen for Senate and Jim Cooper for House of Representatives in October 2018.\n\nHer June 2019 song, “You Need to Calm Down,” rebuked right-wing “freedom of speech” advocates who peddle homophobia. With lyrics about “taking shots” at her on Twitter (now X) before “7 a.m.,” fans felt Trump was the inspiration behind the track.\n\nIn her January 2020 documentary, “Miss Americana,” Swift elaborated on her decision to become politically vocal, saying, “Back in the [2016] presidential election, I was in such a horrendous place that I wasn’t going to pop my head out. These aren’t your dad’s celebrities, and these aren’t your dad’s Republicans. … I need to be on the right side of history.”\n\nLater that year, the singer-songwriter took aim at Trump for his response to both the murder of George Floyd by a police officer and the nationwide protests that followed.\n\n“After stoking the fires of white supremacy and racism your entire presidency, you have the nerve to feign moral superiority before threatening violence? ‘When the looting starts the shooting starts’???” she tweeted at then-POTUS in May 2020, promising to “vote [him] out in November.”\n\nSwift then openly backed Biden in October 2020.","summary":"\"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\" POTUS posted on his social media platform, Truth Social.","url":"https://pagesix.com/2025/05/16/celebrity-news/president-trump-declares-taylor-swift-is-no-longer-hot/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/05/104649107.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-16 18:33:15","author":"Bernie Zilio","authors":["Bernie Zilio"],"language":"en","category":"politics","source_country":"us","sentiment":0.159},{"id":322112594,"title":"'Swifties for Trump' Criticizes Trump's Taylor Swift Comment: 'I Cringe'","text":"Jenna Piwowarczyk, the founder of \"Swifties for Trump,\" criticized President Donald Trump for his comment on Friday declaring Swift \"not hot\" anymore, saying that it contributes to the alienation of conservative women who like Swift's music.\"I cringe when the President says stuff like this,\" Piwowarczyk told Newsweek.Why It MattersTrump's renewed criticism of Swift comes as the megastar continues to play a high-profile role in American cultural life, recently concluding her mega successful Eras Tour.His decision to target Swift—a performer with a massive global following—is consistent with his strategy of attacking influential public figures who oppose him or his policies.What To KnowOn Friday, Trump posted on Truth Social asking if anyone noticed that ever since he said he hates Swift that she's \"no longer 'hot.' \"Piwowarczyk told Newsweek the goal of \"Swifties for Trump\" was to bridge a gap that has historically existed between young women and conservative ideology. Women have been more likely to vote for the Democratic presidential candidate in every election since 1992 and the gender gap between young adults and politics is stark.A recent poll from NBC News found 45 percent of men aged 18-29 approve of Trump's job performance, but only 24 percent of young women do. It's the biggest gender gap of any generation. There's a 13-point gap between men and women aged 45 to 64, a 9-point gap between men and women aged 30-44 and a 7-point gap between men and women 65 years and older.Piwowarczyk, 19, started the group in August and previously told Newsweek it was important to have because she said millions of young, female voters consider themselves Swifties and she wanted them to know why they don't have to choose between loving Swift and voting for Republican.Swift endorsed former Vice President Kamala Harris in the 2024 presidential election in September in a post on Instagram and signed it \"Childless Cat Lady,\" in a reference to a comment Vice President JD Vance made.Days later, Trump posted on Truth Social that he \"hates\" Swift.\"I do not think that President Trump's comments on his feelings towards her had any real negative impact, but I do believe that if he were to speak positively about her, it would lead to more unity between conservatives and young women,\" Piwowarczyk told Newsweek.What They're SayingPiwowarczyk told Newsweek: \"Taylor just got off a 2-year-long tour marathon, and if she wants some time away from the spotlight, that's her business alone, and it does not impact her popularity.\"Trump in a Truth Social post in February 2024: \"I signed and was responsible for the Music Modernization Act for Taylor Swift and all other Musical Artists... There's no way she could endorse Crooked Joe Biden... and be disloyal to the man who made her so much money.\"What Happens NextSwift has not responded to Trump's comments and has been mostly staying out of the spotlight since her Eras Tour came to a close at the end of last year.","summary":"Jenna Piwowarczyk, founder of \"Swifties for Trump,\" says she doubts Trump's comments had any negative impact on the singer.","url":"https://www.newsweek.com/swifties-trump-criticizes-trumps-taylor-swift-comment-i-cringe-2073413","image":"https://d.newsweek.com/en/full/2646304/taylor-swift-donald-trump.jpg","video":null,"publish_date":"2025-05-16 18:25:02","author":"Jenni Fink","authors":["Jenni Fink"],"language":"en","source_country":"us","sentiment":-0.298},{"id":322103452,"title":"JD Vance clear favorite to win the GOP nomination in 2028: poll","text":"Vice President JD Vance is the overwhelming choice to win the 2028 Republican presidential primary, according to a new poll, even with former contenders and allies of President Trump jockeying for position.\n\nThe May survey by J.L. Partners found 46% of registered voters are ready to back Vance as Trump’s successor, while no other named prospect got more than double-digit support.\n\nJust 8% would back Florida Gov. Ron DeSantis in a second bid for the GOP nomination, while 7% supported current Ohio gubernatorial candidate Vivek Ramaswamy. Secretary of State Marco Rubio and Sen. Ted Cruz (R-Texas) each received 6% support.\n\nFormer South Carolina governor and Ambassador to the United Nations Nikki Haley got 5% support in the poll.\n\nA Yale Law graduate and former venture capitalist, Vance made a splash with his 2016 memoir “Hillbilly Elegy” and emerged as a staunch defender of Trump during a successful Senate run in 2022.\n\nThe president tapped Vance as his running mate as the Republican National Convention got underway in Milwaukee last July, touting how “Hillbilly Elegy” had “championed the hardworking men and women of our Country.”\n\nVance, 40, has been one of the Trump administration’s clearest and most effective communicators on key priorities like immigration enforcement, trade and social issues, informed by his Catholic faith.\n\nRubio, 53, has established himself as one of the president’s most trusted cabinet officials — while also serving in acting capacities overseeing the National Archives and the US Agency for International Development (USAID), as well as national security adviser.\n\nTrump said in March that the future of his “Make America Great Again” movement looked “so strong” with such a full bench.\n\n“You look at Marco, you look at JD Vance, who’s fantastic,” he told NBC News’ Kristin Welker during an interview on “Meet the Press.”\n\n“You look at — I could name 10, 15, 20 people right now just sitting here. No, I think we have a tremendous party.”\n\nNotably, Trump opted not to name Vance as his successor, but the vice president’s friendly rivalry with Rubio for the nod hasn’t dampened their relationship.\n\n“He is probably my best friend in the administration,” Vance has told Fox News of Rubio. “We hang out and talk all the time.”\n\nRamaswamy served briefly as co-chair of the Department of Government Efficiency (DOGE) during Trump’s transition — but departed as the president returned to the White House.\n\nHe said on the “Lex Fridman Podcast” last September that he wasn’t ruling out another presidential bid before announcing his run for the Ohio governor’s mansion in February.\n\nJL Partners research manager Caroline Mulvaney said Vance “can expect to gain further support from voters who are currently supporting individuals unlikely to end up on the 2028 ticket, as well as at least some support from voters who are currently undecided.”\n\nIf Rubio did secure the 2028 nomination, 57% of Republican voters said they would support him, per the poll.\n\nAmong Democratic voters, former Vice President and failed 2024 nominee Kamala Harris has 30% support in a hypothetical primary, followed by ex-Transportation Secretary Pete Buttigieg with just 8% backing.\n\nA pair of governors, Josh Shapiro of Pennsylvania and Gavin Newsom of California, each have 7% support, followed by Bronx and Queens Rep. Alexandria Ocasio-Cortez (6%).\n\nTrump has publicly flirted with running for a third term by swapping places with Vance on the 2028 GOP ticket and then taking over after the Ohioan steps aside — but that move has been shot down by congressional Republicans and would possibly run afoul of the Constitution’s 22nd Amendment.\n\nDeSantis and Haley both challenged Trump in the 2024 Republican primary — but the Florida governor bowed out after finishing a distant second in the Iowa caucuses.\n\nHaley, who served as US envoy to the UN in Trump’s first term, suspended her campaign after losing more than a dozen states to the former president on Super Tuesday. \n\nNeither DeSantis nor Haley has shown public interest in running for the White House again.\n\nCruz surprised Trump in the 2016 primary by winning Iowa and has expressed interest in making another run after sitting out the past two cycles.\n\nWhen first son Donald Trump Jr. is added to the list of candidates, Vance retains his big lead with 40% support. But Trump Jr. receives 14% support, surging ahead of all other contenders.\n\nJL Partners, which was one of the few pollsters to accurately predict Trump would win the 2024 popular vote, surveyed 975 registered voters May 13-14 for the poll, with a margin of error of 3.1%.\n\nIts findings were first reported by the UK’s Daily Telegraph newspaper.","summary":"The polling firm JL Partners in May found 46% of registered voters are ready to back Vance as Trump's successor, compared with just 8% who'd like to see Florida Gov. Ron DeSantis return to the GOP primary contest.","url":"https://nypost.com/2025/05/16/us-news/jd-vance-clear-favorite-to-win-the-gop-nomination-in-2028-poll/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/2025-washington-dc-event-president-104644331.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/gpWCfjeP-RyIcpnTz.mp4","publish_date":"2025-05-16 18:10:24","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","source_country":"us","sentiment":0.136},{"id":322095994,"title":"Triggered Trump Unloads on Bruce Springsteen in Wild Rant","text":"President Donald Trump is losing it after Bruce Springsteen torched his administration as “treasonous” and “incompetent.”\n\n“This dried out “prune” of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country,” the 78-year-old president fumed on Truth Social Friday morning. \n\nCalling Springsteen, 75, “dumb as a rock” and “Highly Overrated,” Trump went after the music legend for “speaking badly about the President of the United States.”\n\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy,” he said of the Rock and Roll Hall of Famer and one of the world’s best-selling artists. “[He’s] just a pushy, obnoxious JERK.”\n\nThough Trump now insists that he’s never been a Springsteen fan, he used to blare “Born in the U.S.A” at rallies in 2016—much to the rocker’s dismay.\n\nThe president’s hissy fit came in response to Springsteen’s remarks at the start of the “Land of Hope & Dreams” European tour earlier this week.\n\n“In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years is currently in the hands of a corrupt, incompetent, and treasonous administration,” Springsteen told the crowd in Manchester, England before performing the tour’s namesake song.\n\n“Tonight, we ask all who believe in democracy and the best of our American experience to rise with us, raise your voices against authoritarianism and let freedom ring!”\n\nThroughout the show, Springsteen—who performed at a rally for Kamala Harris last year—came back to the subject, slamming Trump for attacking the press, cozying up to dictators, and defunding universities, without directly naming him. \n\nHe also decried the Trump administration for its “sadistic” firing of federal workers, mass deportations, and for “abandoning the world’s poorest children to sickness and death.” \n\nIt’s not the first time the “Dancing in the Dark” singer has taken aim at Trump—he’s spent years warning that the former president poses a threat to democracy. But his latest rebukes clearly hit an nerve with the famously thin-skinned president, who launched into a familiar tirade against his predecessor—as he often does when trying to deflect criticism. \n\nHe chastised Springsteen for supporting former President Joe Biden, whom he described as “a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.” \n\n“If I wasn’t elected, it would have been GONE by now!” he added.\n\nTrump is flying back to the United States after wrapping up his Middle East trip. In another unhinged Truth Social post he presumably typed out while aboard Air Force One, he said Taylor Swift had stopped being “hot.”","summary":"The Daily Beast/GettyPresident Donald Trump is losing it after Bruce Springsteen torched his administration as “treasonous” and “incompetent.”\n\n“This dried out “prune” of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country,” the 78-year-old president fumed on Truth Social Friday morning. \n\nCalling Springsteen, 75, “dumb as a rock” and “Highly Overrated,” Trump went after the music legend for “speaking badly about the President of the United States.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/triggered-trump-unloads-on-bruce-springsteen-in-wild-rant/","image":"https://www.thedailybeast.com/resizer/v2/OC4FHV2SHFGVXKFPEA2SS3SQ5Q.jpg?smart=true&auth=8b1c8efb30cefcdf747feaf846aed71b30bbc96d77d951eb21146172d7efa449&width=1440&height=1080","video":null,"publish_date":"2025-05-16 18:03:27","author":"Erkki Forster","authors":["Erkki Forster"],"language":"en","category":"politics","source_country":"us","sentiment":0.015},{"id":322113594,"title":"Trump says Taylor Swift ‘no longer HOT’ in Air Force One rant","text":"US President Donald Trump used his down time on Air Force One Friday to insult “obnoxious JERK” Bruce Springsteen and declare Taylor Swift “no longer HOT” in social media blasts against the music giants.\nTrump – returning from a whirlwind Middle East diplomatic trip – took to his Truth Social platform to feud with Springsteen, who this week told a British concert audience that his homeland is now ruled by a “corrupt, incompetent and treasonous administration”.\nIn return, the 78-year-old Republican said the legendary rocker, nicknamed “the Boss”, is “Highly Overrated”.\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy – Just a pushy, obnoxious JERK,” Trump wrote in the lengthy tirade.\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare.’ Then we’ll all see how it goes for him!”\nSpringsteen is an outspoken liberal critic of Trump and campaigned for Democratic US president Joe Biden’s ultimately abandoned re-election run last year.\n\nWhile in Manchester on his “Land of Hope & Dreams” tour on Wednesday, he told fans that “my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years” is in danger.\n“Raise your voices against authoritarianism and let freedom ring,” Springsteen said.\nTrump also had strong words for Swift, who endorsed Biden’s replacement as the Democratic candidate in 2024, Kamala Harris.\nIn a separate post, which provided no context, the US president said: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’”\nHe appeared to be referencing a post in September last year when he declared “I HATE TAYLOR SWIFT!”\nSwift, 35, is the wealthiest female musician on the planet, with an estimated personal wealth of US$1.6 billion, 14 Grammys and 30 MTV Video Music awards.","summary":"The US president also called Bruce Springsteen an ‘obnoxious jerk’ after the legendary rocker criticised Trump in front of a UK audience.","url":"https://www.scmp.com/news/world/united-states-canada/article/3310726/trump-says-taylor-swift-no-longer-hot-air-force-one-rant","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/05/17/b04c9d51-3b3b-466e-a008-b461441e13e5_aa6d58c7.jpg","video":null,"publish_date":"2025-05-16 18:01:14","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"entertainment","source_country":"cn","sentiment":-0.02},{"id":322156780,"title":"'Taylor Swift no longer HOT': Trump slams American singer, claims he's the reason behind it","text":"US President Donald Trump on Friday (May 16) took a jibe at popular singer Taylor Swift, saying that she doesn't look hot after he said that he hates her. Advertisment The US president took to Truth Social, and posted, \"Has anyone noticed that, since I said “I HATE TAYLOR SWIFT,” she\"s no longer “HOT?” Earlier in 2024, Trump hit out at Taylor Swift over her endorsement of then Vice President Kamala Harris, saying, \"I HATE TAYLOR SWIFT!\" It comes days after Taylor Swift endorsed Kamala Harris for the 2024 presidential elections, in an Instagram post. Advertisment“I\"m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them,” Swift wrote in the post. “I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos,” the popstar added at the time. Also read: Mosque visit, soccer ball and new friendships: Trump wraps up Middle East trip | See pics Advertisment Another hit at Bruce Springsteen Trump in another post on Friday, hit out at American singer-songwriter and guitarist Bruce Springsteen, calling him \"highly overrated\" and he's not a talented guy. He further slammed Springsteen for supporting former President Joe Biden, as Trump called him \"Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President.\" \"I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States. Never liked him, never liked his music, or his Radical Left Politics and, importantly, he\"s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country,\" Trump said in his post. Also read: Blake Lively responds to Justin Baldoni's claims about intimidating Taylor Swift The US president continued, \"If I wasn\"t elected, it would have been GONE by now! Sleepy Joe didn\"t have a clue as to what he was doing, but Springsteen is “dumb as a rock,” and couldn\"t see what was going on, or could he (which is even worse!)?\" Trump further slammed the singer, saying, \"This dried out “prune” of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that\"s just “standard fare.” Then we\"ll all see how it goes for him!\" Also read: Human remains found near Taylor Swift's mansion: Does USA have a new serial killer?","summary":"US President Donald Trump on Friday (May 16) took a jibe at popular singer Taylor Swift, saying that she doesn't look hot after he said that he hates her. \n\n\nThe US president took to Truth Social, and posted, \"Has anyone noticed that, since I said &ldquo;I HATE TAYLOR SWIFT,&rdquo; she&rsquo;s no longer &ldquo;HOT?&rdquo;\n\n\n\n\n\n\n\nEarlier in 2024, Trump hit out at Taylor Swift over her endorsement of then Vice President Kamala Harris, saying, \"I HATE TAYLOR SWIFT!\" It comes days after Taylor Swift endorsed Kamala Harris for the 2024 presidential elections, in an Instagram post. \n\n\n&ldquo;I&rsquo;m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them,&rdquo; Swift wrote in the post. \n\n\n&ldquo;I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos,&rdquo; the popstar added at the time.\n\n\nAlso read: Mosque visit, soccer ball and new friendships: Trump wraps up Middle Ea","url":"https://www.wionews.com/world/taylor-swift-no-longer-hot-trump-slams-american-singer-claims-hes-the-reason-behind-it-9076896","image":"https://img-cdn.publive.online/fit-in/1200x675/filters:format(webp)/wion/media/media_files/2025/05/16/aqTRxjK2E2z3UpylFjtj.png","video":null,"publish_date":"2025-05-16 17:36:14","author":"Mansi Arora","authors":["Mansi Arora"],"language":"en","source_country":"in","sentiment":-0.174},{"id":322080642,"title":"Donald Trump brands Bruce Springsteen ‘dried out prune of a rocker’ in blistering rant","text":"Donald Trump has retaliated after Bruce Springsteen’s blistering attacks (Picture: Hulu/Everett/REX/Shutterstock)\n\nDonald Trump has hit back after Bruce Springsteen unleashed several blistering attacks on the US president at his Manchester concert.\n\nThe music legend made three separate rants against the ‘corruption’ and ‘incompetence’ of the Trump administration as he and the E Street Band performed the first of three scheduled shows at the Co-Op Live on Wednesday, opening his latest UK and European tour.\n\nBut now, Trump has retaliated with a rather brutal put-down of The Boss.\n\nIn a lengthy post that has generated thousands of reactions on Truth Social, the 78-year-old politician began: ‘I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States.’\n\nNever missing an opportunity to take aim at predecessor Joe Biden, he continued: ‘Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.’\n\nTrump added: ‘If I wasn’t elected, it would have been GONE by now! Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is “dumb as a rock,” and couldn’t see what was going on, or could he (which is even worse!)?’\n\n The Boss ranted about the US President while performing in Manchester this week (Picture: Sergione Infuso/Corbis via Getty Images)\n\nSaving arguably his most personal insult until last, he concluded: ‘This dried out “prune” of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just “standard fare.” Then we’ll all see how it goes for him! [sic]’\n\nTrump’s rant comes after Springsteen began his gig earlier this week with a performance of Land of Hope and Dreams, telling the audience: ‘It’s great to be in Manchester and back in the UK. Welcome to the Land of Hope and Dreams Tour! \n\n‘The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock ‘n’ roll in dangerous times.’\n\nSpringsteen, 75, continued: ‘In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration.\n\n‘Tonight, we ask all who believe in democracy and the best of our American experiment to rise with us, raise your voices against authoritarianism, and let freedom ring!’\n\nThe Born in the USA artist made another political statement before a performance of House of a Thousand Guitars.\n\n Trump has branded Springsteen a ‘dried out prune of a rocker’ (Picture: Reuters)\n\nSpringsteen declared: ‘The last check, the last check on power after the checks and balances of government have failed, are the people, you and me.\n\n‘It’s in the union of people around a common set of values now that’s all that stands between a democracy and authoritarianism. At the end of the day, all we’ve got is each other.’\n\nThe rocker wasn’t done there, though.\n\nHaving long been a staunch critic of Trump, Springsteen made another excoriating attack on the White House chief and his political ideology as he introduced City of Ruin.\n\n‘There’s some very weird, strange, and dangerous s**t going on out there right now. In America, they are persecuting people for using their right to free speech and voicing their dissent. This is happening now.\n\n‘In America, the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death. This is happening now.\n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n‘In my country, they’re taking sadistic pleasure in the pain they inflict on loyal American workers. They’re rolling back historic civil rights legislation that has led to a more just and plural society. They are abandoning our great allies and siding with dictators against those struggling for their freedom.\n\n‘They are defunding American universities that won’t bow down to their ideological demands. They are removing residents off American streets and, without due process of law, are deporting them to foreign detention centres and prisons. This is all happening now.\n\nThe Glory Days singer added that ‘a majority of our elected representatives have failed to protect the American people from the abuses of an unfit president and a rogue government.’\n\nHe blazed: ‘They have no concern or idea for what it means to be deeply American.’\n\nProudly patriotic, he finished by telling his adoring fans: ‘The America I’ve sung to you about for 50 years is real, and regardless of its faults, is a great country with great people. So we’ll survive this moment.’\n\nIn a bid to remain optimistic, Springsteen vowed to ‘have hope’ because he ‘believes in the truth of what the great American writer, James Baldwin, said’.\n\n Trump also reignited his feud with Taylor Swift this week, claiming she is ‘no longer hot’ (Picture: Kevin Winter/TAS23/Getty Images for TAS Rights Management)\n\n Swift supported Democratic nominee Kamala Harris in the 2024 election (Picture: Rebecca Droke/AFP via Getty Images)\n\nQuoting Baldwin, who wrote the 1953 novel Go Tell It on the Mountain, Springsteen recited: ‘In this world, there isn’t as much humanity as one would like, but there’s enough.’\n\nSpringsteen isn’t the only American music icon to face the wrath of Trump this week, as the Apprentice star, posting from the United Arab Emirates at the tail end of his Middle East trip, also launched another attack on Taylor Swift.\n\nReviving his beef with the Grammy winner just minutes before posting his Springsteen rant, he wrote: ‘Has anyone noticed that, since I said “I HATE TAYLOR SWIFT,” she’s no longer “HOT?”‘\n\nSwift, one of the biggest-selling artists in music history and certainly of this generation, first broke her political silence a few years ago for her Miss Americana Netflix documentary.\n\nShe’s since taken several chances to make her views clear when it comes to the Republican party, while Trump lashed out at her during the 2024 election cycle when she endorsed Democratic candidate Kamala Harris.\n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"A livid Trump has called The Boss 'obnoxious' and 'highly overrated'.","url":"https://metro.co.uk/2025/05/16/donald-trump-brands-bruce-springsteen-dried-prune-a-rocker-blistering-rant-23101529/","image":"https://metro.co.uk/wp-content/uploads/2025/05/SEI_251604863-cb1e.jpg?quality=90&strip=all","video":null,"publish_date":"2025-05-16 17:32:26","author":"Emily Bashforth","authors":["Emily Bashforth"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.165},{"id":322088908,"title":"Taylor Swift Net Worth: How It Changed After Donald Trump's Comment","text":"Taylor Swift's net worth has increased since President Donald Trump said he \"hated\" her last year.Why It MattersTrump, 78, reignited his public feud with Taylor Swift, 35, on Friday on Truth Social, posting, \"Has anyone noticed that, since I said 'I HATE Taylor Swift,' she's no longer 'HOT?'\" The post, providing no elaboration, is the latest in a series of critical remarks Trump has made about the pop star since she became more politically active and supported Democrats during the 2020s.Newsweek reached out to Swift's publicist for comment.What To KnowSwift's net worth as of May 16, is $1.6 billion and is attributed to the earnings of her Eras Tour and the value of her music catalog, according to Forbes. She first eclipsed the billion-dollar mark in October 2023.\"Swift is the first musician to make the billionaire ranking primarily based on her songs and performances,\" Forbes notes.Since Trump's comments saying he hates her, Swift's net worth has increased by $300 million.In September 2024, following Swift's endorsement of then-Vice President Kamala Harris for commander-in-chief, then-candidate Trump took to Truth Social to exclaim in an all-caps post: \"I HATE TAYLOR SWIFT!\"He said in a subsequent interview with Fox & Friends that \"I was not a Taylor Swift fan\" and that by endorsing Harris, \"she'll probably pay a price for it in the marketplace.\"Swift's seen a bigger jump in her net worth in the time period after Trump's comments than the period preceding them. In the eight months before Trump said he hates her, Swift's net worth increased by $200 million, about $100 million less than in the eight months since Trump's comment.Forbes says that Swift's fortune includes roughly $600 million from royalties and touring, notably after the Eras Tour was known for extremely high demand that led to congressional oversight over Ticketmaster due to exorbitant ticket costs and fans not being able to access flooded servers.Swift's music catalog is currently worth an estimated $600 million, while real estate amounts to roughly $125 million. Her catalog's worth also ballooned, from $500 million in January 2024 to the current number by last fall.In 2021, Swift started re-releasing records from her first six albums to reclaim ownership rights.After Trump made his comment on Truth Social in September, his daughter, Ivanka and granddaughter, Arabella, attended Swift's concert in Miami. Earlier that year, Ivanka posted a photo on Instagram from her daughter's birthday where she called her daughter a \"Swiftie\" and revealed a cake that had a lyric from one of the singer's hit songs, \"Blank Space.\"What People Are SayingTrump after the Philadelphia Eagles defeated the Kansas City Chiefs in February's Super Bowl: \"The only one that had a tougher night than the Kansas City Chiefs was Taylor Swift. She got BOOED out of the Stadium. MAGA is very unforgiving!\"Mike Nellis, Democratic strategist and former Harris adviser, posted on X: \"Walmart and other retailers are hiking up prices because of the tariffs, and he's panicked about it—so we're going to see new levels of BS distractions, like him attacking Taylor Swift out of nowhere. It works well enough when you're a candidate, but not when you're in charge.\"What Happens NextSwift has not yet responded to Trump's remarks.Trump's team has made clear they view Swift as a serious political influencer, and the president's posts suggest he may continue using her as a rhetorical foil as campaign season intensifies.","summary":"Trump made a remark on Friday about Taylor Swift being not \"hot\", but past attacks haven't so far affected her revenue stream.","url":"https://www.newsweek.com/taylor-swift-donald-trump-net-worth-hot-2073338","image":"https://d.newsweek.com/en/full/2646205/taylor-swift.jpg","video":null,"publish_date":"2025-05-16 17:30:51","author":"Nick Mordowanec","authors":["Nick Mordowanec"],"language":"en","category":"politics","source_country":"us","sentiment":-0.068},{"id":322084176,"title":"Trump slams Supreme Court, Springsteen and Swift","text":"President Donald Trump took aim at the Supreme Court, fellow Republicans and several celebrities Friday in a series of social media screeds that underscore the domestic political challenges he faces and the personal grievances he won't let go.\n\n\"I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,\" Trump wrote about the iconic American rock star.\n\n\"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he's not a talented guy — Just a pushy, obnoxious JERK,\" he added, after Springsteen called Trump's administration \"treasonous.\"\n\nTrump accused the U.S. Supreme Court of getting \"played,\" and he admonished Republican \"grandstanders\" threatening to derail his legislative agenda in Congress.\n\nHe even took a swipe at pop icon Taylor Swift, claiming \"she's no longer 'HOT'\" and taking credit for her purported decline.\n\nTrump sent all four Truth Social posts within an hour during his flight back to the U.S. from Abu Dhabi, where he had just wrapped a four-day tour through the Middle East.\n\nThe posts show the president shifting his focus back to domestic issues, where he faces fresh political headwinds. They include a major setback for his massive tax-cut bill Friday and a contentious bout of Supreme Court oral arguments Thursday related to his controversial birthright citizenship order.\n\nThe attacks also showcased Trump's trademark willingness to lash out at his perceived enemies — in politics and culture alike.\n\n\"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\" Trump wrote, referencing a prior social media post he sent after Swift endorsed his 2024 campaign rival, former Vice President Kamala Harris.","summary":"The posts showed Trump retraining his focus on a range of domestic issues and grievances after his whirlwind tour of the Middle East.","url":"https://www.cnbc.com/2025/05/16/trump-supreme-court-taylor-swift-springsteen.html","image":"https://image.cnbcfm.com/api/v1/image/108146752-1747407354874-gettyimages-2214731698-wmr56014.jpeg?v=1747407389","video":null,"publish_date":"2025-05-16 17:27:43","author":"Kevin Breuninger","authors":["Kevin Breuninger"],"language":"en","category":"politics","source_country":"us","sentiment":0.028},{"id":322104538,"title":"Donald Trump fires back at Bruce Springsteen after 'dried-out prune of a rocker' calls him 'corrupt' at concert","text":"President Donald Trump is responding to Bruce Springsteen's fiery take on his second presidency, which the singer delivered the opening night of his new Land of Hope and Dreams tour.\n\n Two days after Springsteen told fans in Manchester, England, that Trump was leading \"a corrupt, incompetent, and treasonous administration,\" Trump took to his social media platform Truth Social to address the artist, whom he called a \"dried-out prune of a rocker.\"\n\n \"I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,\" Trump posted on Friday morning. \"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he's not a talented guy — just a pushy, obnoxious JERK who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.\"\n\n Suggesting that the country would be \"gone by now\" if he hadn't been elected again, Trump seemed to warn of a backlash from his supporters if the musician made similar comments about him when he returned to the United States.\n\n \"Springsteen is 'dumb as a rock,' and couldn't see what was going on, or could he (which is even worse!)?\" Trump wrote. \"This dried-out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country. That's just 'standard fare.' Then we'll all see how it goes for him!\"\n\n Springsteen did not shy away from sharing his thoughts on Trump's presidency during his concert at Manchester's Co-Op Live arena on Wednesday.\n\n \"The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock and roll, in dangerous times,\" the Boss told the crowd in footage captured by a concertgoer and shared on social media. \"In my home, the America I love, the America I've written about, and [that] has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration. Tonight, we ask all who believe in democracy and the best of our American experience to rise with us, raise your voices against the authoritarianism, and let freedom ring.\"\n\n He returned to the subject later in his set. \"In America, the richest men are taking satisfaction in abandoning the world's poorest children to sickness and death,\" Springsteen said before singing his 2002 song \"My City of Ruins,\" per Billboard. \"And in my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they are rolling back historic civil rights legislation that led to a more just and moral society. They are abandoning our great allies and siding with dictators against those struggling for their freedom.\"\n\n Springsteen has spoken out against Trump before. Last October, he endorsed Trump's presidential opponent Kamala Harris, and the singer endorsed Joe Biden in 2020 and Hillary Clinton in 2016. When he backed Harris, Springsteen called Trump \"the most dangerous candidate for president in my lifetime.\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n \"Perhaps not since the Civil War has this great country felt as politically, spiritually, and emotionally divided as it does than at this moment,\" he said at the time. \"It doesn't have to be this way.\"\n\n The artist behind songs such as \"Born in the U.S.A,\" \"The River,\" and \"My Hometown\" said he was standing behind the Democratic candidates for president and vice president because he thought their policies mirrored the \"vision of America\" he has been \"consistently writing about for 55 years.\"","summary":"The 20-time Grammy winner recently opened his Land of Hope and Dreams tour by asking fans to \"raise your voices against the authoritarianism and let freedom ring.\"","url":"https://ew.com/donald-trump-fires-back-at-bruce-springsteen-after-concert-remarks-11736493","image":"https://ew.com/thmb/P_XDnO8whuEuBjXpVB1vzGNVCVA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/donald-trump-bruce-springsteen-051625-6299c68876ae4512b4d73a50921996fb.jpg","video":null,"publish_date":"2025-05-16 17:24:28","author":"Mekishana Pierre","authors":["Mekishana Pierre"],"language":"en","source_country":"US","sentiment":0.011},{"id":322081540,"title":"Donald Trump Says Taylor Swift Stopped Being 'Hot' After Becoming His Enemy","text":"Donald Trump reignited his one-sided feud with Taylor Swift on Friday, May 16, posting a personal dig at the pop star on his Truth Social account.\n\n \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?' \" the United States president, 78, posted to his nearly 10 million followers.\n\n Trump's initial all-caps outburst toward Swift came in September 2024, after the 35-year-old singer spoke out against AI-generated images of her that had been used to promote his presidential campaign — and publicly announced her endorsement of Democrat Kamala Harris.\n\n The next day, Trump responded to Swift's endorsement in an interview with Fox & Friends.\n\n \"I was not a Taylor Swift fan,\" he said on the show. \"It was just a question of time. ... But she’s a very liberal person. She seems to always endorse a Democrat. And she’ll probably pay a price for it in the marketplace.\"\n\n Since then, it seems that Trump hasn't let go of the grudge. He took another shot at the singer while celebrating the Philadelphia Eagles' Super Bowl championship at the White House on April 28.\n\n Trump noted that both he and Swift were in attendance at the championship game — the latter obviously cheering on boyfriend Travis Kelce, who plays for the Kansas City Chiefs.\n\n \"How did that work out?\" he asked, to laughs from the crowd, before repeating the question: \"How did that one work out?\"\n\n While Trump might publicly claim to hate the \"Shake It Off\" singer, some of his famous family members count themselves as Swifties.\n\n In October 2024, the president's eldest daughter, Ivanka Trump, took her 13-year-old daughter, Arabella, to see Swift's Eras Tour at Hard Rock Stadium in Miami.\n\n Arabella even received a Swift-themed birthday cake in July 2024.\n\n “Best cake for my favorite Swiftie,” Ivanka captioned an Instagram photo of the heart-shaped dessert, which resembled the cake featured in the “Blank Space” music video.","summary":"The United States president took another shot at the superstar singer on Friday, May 16, seemingly holding onto his grudge against her for backing Democrats in the last two presidential elections","url":"https://people.com/donald-trump-says-taylor-swift-stopped-being-hot-11736523","image":"https://people.com/thmb/h1haU9j5gOINl_oFZOxg8GDfAxA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(398x269:400x271)/Donald-Trump-leaves-Trump-Tower-081924-1-883784e747614916b04800d40e3ba142.jpg","video":null,"publish_date":"2025-05-16 17:12:01","author":"Meredith Kile","authors":["Meredith Kile"],"language":"en","category":"politics","source_country":"US","sentiment":0.125},{"id":322073166,"title":"Brain-Dead Pregnant Woman Forced To Carry Foetus To Birth Due To Abortion Ban In US","text":"A 30-year-old pregnant woman in Georgia, Adriana Smith, has been on life support for over three months after a medical emergency led to her being declared brain dead. Smith’s mother, April Newkirk, said that her daughter was declared brain dead in February after a medical emergency, and doctors have told the family that they are not allowed to remove life support due to the state’s strict anti-abortion law.\nAccording to the “heartbeat law,” once the cardiac activity is detected, which is generally around six weeks into pregnancy, abortion cannot be performed. Newkirk said her daughter is currently 21 weeks pregnant, and removing breathing tubes and other life-saving devices would likely kill the foetus. \n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said, expressing concern about the potential outcome for her grandchild.\nThe situation highlights the complexities surrounding Georgia’s abortion laws, particularly the requirement to prioritise foetal life. Supporters argue that unborn children deserve protection, with some interpreting this to mean preserving foetal life even when the mother is declared brain dead. \nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supports Emory’s interpretation, stating, “I think it is completely appropriate that the hospital do what they can to save the life of the child.”\nMonica Simpson, executive director of SisterSong, a national activist organisation dedicated to reproductive justice for women of colour, criticised the situation, saying the family should have had the autonomy to make medical decisions for Adriana. “Her family deserved the right to have decision-making power about her medical decisions. Instead, they have endured over 90 days of retraumatisation, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\nThe law has faced criticism for its potential consequences, particularly in light of two tragic cases where women, Amber Thurman and Candi Miller, died due to complications from abortion medication, highlighting concerns about restricted access to timely medical care.\nDemocrat Kamala Harris spoke out about the issue, saying that the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after the Dobbs decision.","url":"https://www.news18.com/world/brain-dead-pregnant-woman-forced-to-carry-fetus-to-birth-due-to-abortion-ban-in-us-ws-l-9340564.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/Untitled-design-2025-05-16T222203.011-2025-05-1be3d22505153e2a29ed335145c0307d.jpg","video":null,"publish_date":"2025-05-16 16:58:09","author":"Aanchal Sinha,News18","authors":["Aanchal Sinha","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.269},{"id":322089706,"title":"Trump launches new attack on Taylor Swift claiming she’s ‘no longer hot’ since he said he hated her","text":"Donald Trump has taken another swing at Taylor Swift, claiming that the pop superstar is “no longer hot.”\n\nOn Friday, the President again launched an unprovoked attack on the “Fortnight” singer, writing from his Truth Social account: “Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’”\n\nThe Independent has contacted Swift’s representative for comment. \n\nLast September, the Republican, 78, declared his hatred of Swift, 35, after she endorsed Kamala Harris in the 2024 presidential election. “I HATE TAYLOR SWIFT,” he wrote in all caps on Truth Social at the time. \n\nSwift’s endorsement of the former Vice President came within hours of the conclusion of the first and only presidential debate between Harris and Trump. \n\n“I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election,” Swift wrote in an Instagram post. “If you haven’t already, now is a great time to do your research on the issues at hand and the stances these candidates take on the topics that matter to you the most.”\n\nEven a month into his second-term presidency, Trump continued to troll Swift.\n\nAt the 2025 Super Bowl game between the Kansas City Chiefs and the Philadelphia Eagles, the Grammy-winning artist, who was in attendance to support her boyfriend, Chiefs tight end Travis Kelce, was loudly booed by Eagles fans. \n\nTrump, who was also in attendance, later shared a screenshot of a post from an account called Libs of TikTok showing clips of fan reactions to both him and Swift.\n\n“Trump gets massive cheers at the Super Bowl while Taylor Swift gets booed – The world is healing,” the account wrote. \n\nShortly afterwards, he mocked the “Cruel Summer” singer-songwriter, resharing an edited image of her holding a flag stating, “Trump won, Democrats cheated!” \n\nThen, in April, the President taunted Swift over the Chiefs’ 40-22 loss to the Eagles during his speech at the latter’s White House invitational to celebrate their victory. \n\n“I was there along with Taylor Swift — how did that work out?” Trump said. \n\nMinutes after his latest dig at Swift on social media, the President returned to criticize “obnoxious” Bruce Springsteen, who had branded the Trump administration “corrupt, incompetent and treasonous” at his recent Manchester gig. \n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,” Trump began his rant. \n\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country,” he claimed.\n\n“If I wasn’t elected, it would have been GONE by now! Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)?\n\n“This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country,” Trump threatened, “that’s just ‘standard fare.’ Then we’ll all see how it goes for him!”","summary":"Pop superstar landed herself on Trump’s bad side after endorsing Kamala Harris in the 2024 presidential election","url":"https://www.independent.co.uk/arts-entertainment/music/news/trump-taylor-swift-truth-social-b2752485.html","image":"https://static.independent.co.uk/2025/05/16/14/32/Donald-Trump-and-Taylor-Swift.png?width=1200","video":"https://cdn.jwplayer.com/videos/jsqUPJrw-4VHSaSK0.mp4","publish_date":"2025-05-16 16:49:11","author":"Inga Parkel","authors":["Inga Parkel"],"language":"en","source_country":"gb","sentiment":-0.185},{"id":322086910,"title":"President Trump claims Taylor Swift ‘is no longer hot’ because of him","text":"On Friday, President Donald Trump insinuated in a Truth Social post that he is the reason why Taylor Swift is no longer “hot.”\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT’?” wrote the 47th president.\n\nIt’s unclear what prompted him to post this. His use of the word “hot” also doesn’t appear to be about her looks, but rather her popularity.\n\nSince Swift’s record-breaking Eras tour concluded in December, she’s been laying relatively low. Other than appearances at the Grammys and Super Bowl in February, she’s retreated from the spotlight. Her absence doesn’t necessarily suggest a dip in her popularity, though.\n\nPresident Trump appeared to develop a distaste for the “Shake It Off” hitmaker in September 2024 after she publicly endorsed Kamala Harris for president. A few days later, he posted “I hate Taylor Swift!” in a Truth Social post, which he referenced in his latest Swift post.\n\nBut just a month before his public declaration of hate against Swift, he reshared AI-generated images of the pop star and her fans endorsing him for president on Truth Social, which suggested that he did seem to have a high opinion of Swift and her fanbase before she endorsed Harris.\n\nTrump’s latest post about no longer being “hot” could be referencing Swift’s recent inclusion in the legal dispute between It Ends With Us” stars Blake Lively and Justin Baldoni. Baldoni, who is facing a sexual harassment lawsuit from Lively and has countersued her for defamation, subpoenaed Swift earlier this month. Despite licensing a song for the film, Swift was not in the movie. Her reps slammed the subpoena to People, claiming it was just to create “tabloid clickbait.”\n\nFurthermore, Swift lost all six Grammy awards that she was nominated for in February. The week after, the Kansas City Chiefs lost the Super Bowl to the Philadelphia Eagles. Swift’s boyfriend, Travis Kelce, is a tight end for the Chiefs.\n\nDuring the Eagles’ Super Bowl celebration at the White House last month, Trump even managed to slip in a dig at Swift while discussing the team’s win. “I watched in person. I was there along with Taylor Swift. How did that work out?” he said. As the crowd laughed, he added: “How did that one work out?”\n\nThat said, while Swift isn’t having the best luck in 2025, there’s no clear indication that her popularity has dwindled or that she is no longer “hot” as Trump implied.","summary":"The president posted about the pop star on Truth Social on Friday.","url":"https://www.syracuse.com/celebrity-news/2025/05/president-trump-claims-taylor-swift-is-no-longer-hot-because-of-him.html","image":"https://www.syracuse.com/resizer/v2/7W555P5KY5FCZAPH3RSPWCNM2Q.jpg?auth=ddb11927407f71327c88b79b5b6693f82fc21661cef497b75edb941633050371&width=1280&quality=90","video":null,"publish_date":"2025-05-16 16:48:59","author":"Kelly Corbett","authors":["Kelly Corbett"],"language":"en","category":"politics","source_country":"us","sentiment":0.015},{"id":322077682,"title":"Donald Trump warns 'dried out prune' Bruce Springsteen and makes brutal Taylor Swift dig","text":"Donald Trump has suddenly started hurling abuse at music icons Bruce Springsteen and Taylor Swift. The erratic leader of the free world took to his Truth Social platform to dish out the dirt to the superstars earlier today. Springsteen appears to have angered the Donald by speaking \"badly\" about Trump on tour while there doesn't seem to be a reason for the attack on Swift. Trump ranted about the Born in America singer and also squeezed in some criticism of Joe Biden: \"I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States. \"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy – Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country. \"If I wasn’t elected, it would have been GONE by now! Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is 'dumb as a rock', and couldn’t see what was going on, or could he (which is even worse!)? \"This dried out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just 'standard fare'. Then we’ll all see how it goes for him!\" A couple of hours before the ranting post about Springsteen, Trump fired shots at Taylor Swift. There didn't appear to be a reason for it beyond the 35-year-old backing Kamala Harris in the last election. Trump said: \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she’s no longer 'HOT?'\" It comes as the geriatric President sparked fresh health concerns by appearing to nod off in meetings during his state visit to the Middle East, just a month after the mysterious bruise on his hand reappeared. The 78-year-old signed a £107billion arms deal with Saudi Arabia in Riyadh, where he found a mobile McDonald's restaurant waiting for him when he landed . But he seemed to fall asleep briefly during a televised briefing with Saudi Crown Prince Mohammed bin Salman earlier this week in a clip viewed millions of times online. Sharing the clip, US journalist Aaron Rupar wrote on social media: \"Trump is having a hard time keeping his eyes open.\" For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletter by clicking here .","summary":"The Orange Manbaby woke up on the wrong side of the bed this morning as he unleashed his fury at music icons Bruce Springsteen and Taylor Swift in ranting posts","url":"https://www.dailystar.co.uk/news/us-news/donald-trump-warns-dried-out-35239877","image":"https://i2-prod.dailystar.co.uk/article35240166.ece/ALTERNATES/s1200b/0_US-POLITICS-TRUMP-DIPLOMACY.jpg","video":null,"publish_date":"2025-05-16 16:44:38","author":"Dan Grennan","authors":["Dan Grennan"],"language":"en","source_country":"gb","sentiment":-0.381},{"id":322145824,"title":"'You Guys Screwed This Up!' The View Clashes Over Biden Acuity in 2024","text":"ABC’s The View\nMay 16, 2025\n11:04:13 a.m. Eastern\n\nSARA HAINES: So, you tend to criticize the people that you line up more, that you care more about and that would be the Democrats for me.\n\nPeople lost trust in them because the voters were saying there was a concern. There were people across the board saying they had a concern, and the Democrats said, “no, no, over here, look over here.” They told the voters what to care about and did not listen when the voters said they cared.\n\nSo, these stories come out aren't about beating a dead horse, it’s saying if they could have a fair conversation that we heard you, we saw it as they saw it, they'd be gaining some of the voters back to say, okay, we're not going to keep saying.\n\nJOY BEHAR: You agree with that? You agree with that?\n\nSUNNY HOSTIN: No, I don't. I think that I want to move on from why the Democratic Party lost and I want to hear from the Democratic Party about how we are going to take our country back.\n\n[Cheers and applause]\n\nAnd how -- what they are going to do to combat fascism and what they are going to do to stop the medicate cuts that are going on, to stop giving tax cuts to billionaires, to stop taking federal workers' pensions away, to stop taking federal jobs away, to stop taking education away, to stop attacking our institutions, to stop being – Why is this Trump administration stopping medical research, cancer?! I want to talk about why this administration is giving refugee status to South African white Afrikaners. As opposed to Afghans and Ukrainians and people of color. That's what I want to talk about.\n\nBEHAR: I think that Sara's point is they have to admit what they did wrong before we can move on to that. Am I right?\n\nHAINES: Yes.\n\n[Crosstalk]\n\nALYSSA FARAH GRIFFIN: There's also a reality here. Just so we know, this table spends a lot of time criticizing Donald Trump and a lot of it is very valid and needs to happen, but it’s a fact his approval rating is 39 percent.\n\nHAINES: It’s higher than the Democratic Party.\n\nFARAH GRIFFIN: However Democrats is 27 percent. People felt gaslit and lied to. In 2023 –\n\nBEHAR: Wait, part of that I think the low ratings for the Democrats – I think partly – I may be making this up – is because they haven't fought hard enough. What she's talking about. Not because they’re so angry with the Democrats for being bad.\n\nFARAH GRIFFIN: That may be part of it. 77 percent of Americans in 2023 said Joe Biden was too old run again. And they were told: sit down, shut up, he is the nominee; and then when it became untenable and he stepped aside, they anointed Kamala Harris they were told. There was not a primary. There was not a democratic process.\n\nBEHAR: I know. It was a mistake.\n\nHOSTIN: I don’t think it was a mistake.\n\nFARAH GRIFFIN: And then when she lost, they said, ‘don't look backward. We're moving forward, we’re not even going to talk about why we didn’t listen to you.\n\nWe had Joe Biden here last week. It was an honor to have him. I think he is a good man. I do not think he could have been president for four more years. The hardest job on the planet.\n\n[Crosstalk]\n\nBEHAR: And do you think – can this guy be president for four more years?!\n\nFARAH GRIFFIN: He was elected. I didn't vote for him!\n\n11:08:17 a.m. Eastern\n\nFARAH GRIFFIN: People are quoted in this book saying the would be boxed out of meetings if they raised concerns and there's specific examples. George Clooney goes on the record to Jake tapper and says he moved mountains. He flew in from Italy to do this record fundraiser for Joe Biden. Joe Biden didn't recognize George Clooney. One of the most recognizable.\n\nBEHAR: He looks different lately.\n\nFARAH GRIFFIN: One of the most recognizable men on the planet. Now, that is not a presidential duty. It's not the job -- you don't have to recognize George Clooney. Does that give you confidence that in the middle of the night that if China is about to attack us there's a war breaking out in Iran he is the sharpest person to be able to handle that?\n\nBEHAR: Wait a second, which administration texted war plans to their brother?\n\nWas that Joe Biden?! No!\n\nFARAH GRIFFIN: Should we just keep lowering the bar because Trump is bad and nothing else is bad because Trump is bad?\n\n[Crosstalk]\n\nBEHAR: The ship has sailed! It's out in the ocean somewhere with Biden! It's over! Get over it!\n\nFARAH GRIFFIN: We have Trump because you guys screwed this up! With all due respect.\n\nBEHAR: Does it help to just keep going over the same material about Biden over and over again?!","summary":"While largely failing to have the media be held accountable for lying to the American people about President Biden’s failing mental acuity, Jake Tapper and Alex Thompson’s book Original Sin caused quite the stir on ABC’s The View. During Friday’s show, the liberal ladies were at each other’s throats as they battled over where or not it mattered that their Democratic Party lied to the American people. One of the purported conservatives even exclaimed: “We have Trump because you guys screwed this up!”\n\nPretend independent Sara Haines finally came out as a supporter of Democrats and said her criticism came from a place of love, and that she wanted them to gain the trust of the public again:\n\n\nPeople lost trust in them because the voters were saying there was a concern. There were people across the board saying they had a concern, and the Democrats said, “no, no, over here, look over here.” They told the voters what to care about and did not listen when the voters said they cared.\n\nSo, these stories come out aren","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/05/16/you-guys-screwed-view-clashes-over-biden-acuity-2024","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/2025-05-16-ABC-TV-Clash-Over-Biden-Acuity-in-2024.gif?itok=E7xcIYjN","video":null,"publish_date":"2025-05-16 16:31:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","source_country":"US","sentiment":-0.476},{"id":322076124,"title":"Donald Trump Calls Bruce Springsteen ‘Dumb As a Rock’ After Musician Slams ‘Treasonous’ Administration","text":"Donald Trump is not too happy with Bruce Springsteen, whom the president called “highly overrated” and “dumb as a rock” in a heated post on Truth Social after the musician slammed his administration during a concert in Manchester, England.\n\n On Friday morning (May 16) — two days after Springsteen voiced his disdain for the United States government’s “corrupt, incompetent and treasonous” leadership at the kickoff show of his 2025 European tour — Trump began by writing, “I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States.” \n\n “Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy — Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country,” Trump continued. “Sleepy Joe didn’t have a clue as to what he was doing, but Springsteen is ‘dumb as a rock,’ and couldn’t see what was going on, or could he (which is even worse!)?”\n\n “This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare,'” Trump added. “Then we’ll all see how it goes for him!”\n\n Billboard has reached out to Springsteen’s reps for comment.\n\n The twice-impeached president’s comments come after The Boss greeted his Manchester crowd Wednesday (May 14) by saying, “The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock and roll, in dangerous times.”\n\n “In my home, the America I love, the America I’ve written about, and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration,” he continued before launching into 2001’s “Land of Hopes and Dreams.” “Tonight, we ask all who believe in democracy and the best of our American experience to rise with us, raise your voices against the authoritarianism, and let freedom ring.”\n\n Springsteen — who also posted the speech on his Instagram — has long been open about his stance on American politics, endorsing Trump’s opponent Kamala Harris in the 2024 election. Four years prior, he called the POTUS — who in May 2024 was convicted of all 34 felony counts in his hush money trial — a “threat to our democracy” in an interview with The Atlantic.\n\n The “Born in the U.S.A.” singer is just one of many major music stars who has made their stance against Trump clear — and Springsteen also isn’t the only one of them whom the former reality star has put on blast recently. Also on Friday, Trump insulted Taylor Swift, writing that the 14-time Grammy winner is “no longer ‘HOT?'”","summary":"The politician also wrote that The Boss is \"not a talented guy\" as well as a \"pushy, obnoxious JERK.\"","url":"https://www.billboard.com/music/music-news/donald-trump-slams-bruce-springsteen-boss-treasonous-1235973861/","image":"https://www.billboard.com/wp-content/uploads/2025/05/Donald-Trump-may-12-2025-billboard-1548.jpg","video":null,"publish_date":"2025-05-16 16:25:53","author":"Hannah Dailey","authors":["Hannah Dailey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.12},{"id":322151688,"title":"“The View”'s Alyssa Farah Griffin snaps at Joy Behar in heated debate: 'We have Trump because you guys screwed this up!'","text":"Alyssa Farah Griffin snapped at Joy Behar during a heated exchange about the 2024 election.\"We have Trump because you guys screwed this up,\" Griffin yelled with her arms out.The View cohosts continued sparring over the heated Hot Topics.\n\nConservative commentator and former Donald Trump White House associate Alyssa Farah Griffin let loose on The View cohost Joy Behar, a staunch liberal, during a particularly heated Hot Topics exchange Friday morning.\n\nThe cohosts engaged in a lively debate about ongoing criticisms of 82-year-old Joe Biden's fitness to hold office ahead of the 2024 presidential race against Donald Trump, which Biden bowed out of following immense pressure from Democrats to do so — including a public plea from Hollywood heavyweight George Clooney.\n\nAfter The View played a clip of Sen. Chuck Schumer (D-NY) insisting that the party was \"looking forward\" instead of regurgitating talking points over concerns about Biden's age, the panelists brought up a recent book that alleged Biden didn't recognize Clooney at a 2024 campaign event. (Entertainment Weekly has reached out to a representative for Biden for comment.)\n\n\"Does that give you confidence in the middle of the night, if China is about to attack us, there's a war breaking out in Iran, that he's the sharpest person to handle that?\" Griffin asked during the moment (watch in the video above).\n\nBehar cut in to ask a question with a reference to Secretary of Defense Pete Hegseth's Signal scandal: \"Wait a second, which administration texted war plans to their brother?\"\n\nGriffin replied with a question of her own: \"The Trump [administration], but do we just keep lowering the bar because Trump is bad? Nothing else is bad because Trump is bad?\"\n\nBehar looked toward Griffin to note that \"the ship has sailed\" and is \"out in the ocean somewhere with Biden.\" She urged, \"It's over. Get over it,\" before Griffin snapped.\n\n\"No, we have Trump because you guys screwed this up!\" the 35-year-old said with her arms outstretched toward Behar, before adding, \"With all due respect.\"\n\nThe audience lightly gasped after Griffin's outburst, to which Behar replied, \"Alright, but does it help to just keep going over the same material about Biden over and over agin? I mean, really.\"\n\nSunny Hostin then brought up other criticisms about Trump, and the conversation didn't lessen in intensity until Behar finally threw the show to a commercial break with a joke comparing the panel to the cast of The Real Housewives franchise.\n\nEver since the November 2024 election, Griffin has frequently sparred with her cohosts over issues related to the momentous political event.\n\nGriffin took particular issue with Hostin's assertion that racism and misogyny played a significant factor in Vice President Kamala Harris losing the election to Trump.\n\nOn the Nov. 18 episode, Griffin told her colleague that she's \"missing it\" entirely if she felt that a \"vast majority in this country voted because of racism and misogyny,\" with Hostin then citing that \"the stats are the stats\" when it comes to backing up her assessment.\n\n\"But, [the stat] doesn't say, 'I'm white, I voted for Donald Trump because of racism,'\" Griffin replied after raising her hand to emphasize her words. \"That's not a fact. What fact are you talking about?\"\n\nSign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\nBiden also recently appeared on The View to address similar topics, and even revealed during his interview that he \"wasn't surprised\" Harris lost the election.\n\n\"Not because I didn't think the vice president was qualified to be president,\" he clarified on the May 8 telecast. \"She is, she's qualified to be president of the United States of America. I was surprised because they went the sexist route, the whole route. 'This is a woman,' she's this, she's that, really, I've never seen as successful and consistent [of a] campaign undercutting the notion that a woman couldn't lead the country — and a woman of mixed race.\"\n\nThe View airs weekdays at 11 a.m. ET/10 a.m. PT on ABC. Watch Griffin and Behar clash in the video at the top of this post.\n\nRead the original article on Entertainment Weekly","url":"https://www.aol.com/lifestyle/view-alyssa-farah-griffin-snaps-161153941.html","image":"https://media.zenfs.com/en/aol_entertainment_weekly_articles_368/5a8d5696f05fa042f96d39bf495c1ffa","video":null,"publish_date":"2025-05-16 16:11:53","author":"Joey Nolfi","authors":["Joey Nolfi"],"language":"en","source_country":"us","sentiment":-0.37},{"id":322066844,"title":"“The View”'s Alyssa Farah Griffin snaps at Joy Behar in heated debate: 'We have Trump because you guys screwed this up!'","text":"Conservative commentator and former Donald Trump White House associate Alyssa Farah Griffin let loose on The View cohost Joy Behar, a staunch liberal, during a particularly heated Hot Topics exchange Friday morning.\n\n The cohosts engaged in a lively debate about ongoing criticisms of 82-year-old Joe Biden's fitness to hold office ahead of the 2024 presidential race against Donald Trump, which Biden bowed out of following immense pressure from Democrats to do so — including a public plea from Hollywood heavyweight George Clooney.\n\n After The View played a clip of Sen. Chuck Schumer (D-NY) insisting that the party was \"looking forward\" instead of regurgitating talking points over concerns about Biden's age, the panelists brought up a recent book that alleged Biden didn't recognize Clooney at a 2024 campaign event. (Entertainment Weekly has reached out to a representative for Biden for comment.)\n\n \"Does that give you confidence in the middle of the night, if China is about to attack us, there's a war breaking out in Iran, that he's the sharpest person to handle that?\" Griffin asked during the moment (watch in the video above).\n\n Behar cut in to ask a question with a reference to Secretary of Defense Pete Hegseth's Signal scandal: \"Wait a second, which administration texted war plans to their brother?\"\n\n Griffin replied with a question of her own: \"The Trump [administration], but do we just keep lowering the bar because Trump is bad? Nothing else is bad because Trump is bad?\"\n\n Behar looked toward Griffin to note that \"the ship has sailed\" and is \"out in the ocean somewhere with Biden.\" She urged, \"It's over. Get over it,\" before Griffin snapped.\n\n \"No, we have Trump because you guys screwed this up!\" the 35-year-old said with her arms outstretched toward Behar, before adding, \"With all due respect.\"\n\n The audience lightly gasped after Griffin's outburst, to which Behar replied, \"Alright, but does it help to just keep going over the same material about Biden over and over agin? I mean, really.\"\n\n Sunny Hostin then brought up other criticisms about Trump, and the conversation didn't lessen in intensity until Behar finally threw the show to a commercial break with a joke comparing the panel to the cast of The Real Housewives franchise.\n\n Ever since the November 2024 election, Griffin has frequently sparred with her cohosts over issues related to the momentous political event.\n\n Griffin took particular issue with Hostin's assertion that racism and misogyny played a significant factor in Vice President Kamala Harris losing the election to Trump.\n\n On the Nov. 18 episode, Griffin told her colleague that she's \"missing it\" entirely if she felt that a \"vast majority in this country voted because of racism and misogyny,\" with Hostin then citing that \"the stats are the stats\" when it comes to backing up her assessment.\n\n \"But, [the stat] doesn't say, 'I'm white, I voted for Donald Trump because of racism,'\" Griffin replied after raising her hand to emphasize her words. \"That's not a fact. What fact are you talking about?\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n Biden also recently appeared on The View to address similar topics, and even revealed during his interview that he \"wasn't surprised\" Harris lost the election.\n\n \"Not because I didn't think the vice president was qualified to be president,\" he clarified on the May 8 telecast. \"She is, she's qualified to be president of the United States of America. I was surprised because they went the sexist route, the whole route. 'This is a woman,' she's this, she's that, really, I've never seen as successful and consistent [of a] campaign undercutting the notion that a woman couldn't lead the country — and a woman of mixed race.\"\n\n The View airs weekdays at 11 a.m. ET/10 a.m. PT on ABC. Watch Griffin and Behar clash in the video at the top of this post.","summary":"Griffin intensely clapped back at her cohosts during an intense exchange about Democrats losing the 2024 presidential election.","url":"https://ew.com/the-view-alyssa-farah-griffin-snaps-joy-behar-you-guys-screwed-this-up-11736331","image":"https://ew.com/thmb/lfe43aF6nRd9xA5PBTluVcZNPsQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-view-1-051625-ff3e5930b04749469fef8be19c27cc82.jpg","video":"https://cdn.jwplayer.com/videos/lC49MrIj-dXL4r88Q.mp4","publish_date":"2025-05-16 16:11:53","author":"Joey Nolfi","authors":["Joey Nolfi"],"language":"en","source_country":"US","sentiment":-0.344},{"id":322094524,"title":"Trump Calls Bruce Springsteen “Pushy, Obnoxious JERK” After Springsteen Slams “Treasonous” Administration","text":"On Wednesday, 75-year-old Springsteen ridiculed Trump in several separate comments before playing his songs “Land of Hope and Dreams,” “House of a Thousand Guitars,” and “My City of Ruins.” Later, the musician posted a transcript of his remarks on his website and a video of them on his YouTube channel. “The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock ‘n’ roll, in dangerous times,” Springsteen said. “In my home, the America I love, the America I’ve written about that has been a beacon of hope and liberty for 250 years is currently in the hands of a corrupt, incompetent and treasonous administration.”\nBefore a cheering crowd, Springsteen went on to accuse the Trump administration of “taking sadistic pleasure in the pain that they inflict on loyal American workers.” He added, “They’re rolling back historic civil rights legislation that has led to a more just and plural society. They’re abandoning our great allies and siding with dictators against those struggling for their freedom. They’re defunding American universities that won’t bow down to their ideological demands. They’re removing residents off American streets and, without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now.”\nBy Friday, 78-year-old Trump had caught wind of Springsteen’s speeches and responded with some harsh words of his own. “I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,” Trump wrote on Truth Social, where he also took another shot at Taylor Swift, writing that she was “no longer hot.” (Vanity Fair has reached out to Swift for comment.)\nAs for Springsteen, “Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy,” Trump continued. “Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country.”\nTrump also seemed to take issue with the fact that Springsteen made his criticism outside of the United States—and did so while wrinkled. “This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that’s just ‘standard fare,’” Trump continued. “Then we’ll all see how it goes for him!” (VF has reached out to Springsteen for comment.)\nOthers in the conservative sphere have criticized Springsteen for speaking out against Trump in another country, including Fox News’s Greg Gutfeld and fellow musician Kid Rock, who called it a “punk move.” But the Born in the U.S.A. singer has frequently trolled Trump in all parts of the world, previously calling the president a “moron” and declaring his 2016 campaign a “tragedy for our democracy.”\nSpringsteen has long endorsed democratic presidential candidates. He cut an ad for Kamala Harris in the 2024 presidential election, also performing at a rally for her in the battleground state of Georgia. When Biden was elected in 2020, he delivered his victory speech after walking out to Springsteen’s song “We Take Care of Our Own.”\nDuring his recent concert, Springsteen said that Trump’s agenda would not triumph. “The America I’ve sung to you about for 50 years is real and, regardless of its faults, is a great country with great people,” he said. “So we’ll survive this moment.” Springsteen will be back onstage in Manchester on Saturday, May 17.","summary":"The septuagenarians have long been adversaries—and are now trading fighting words.","url":"https://www.vanityfair.com/hollywood/story/trump-calls-bruce-springsteen-pushy-obnoxious-jerk-after-springsteen-slams-treasonous-administration","image":"https://media.vanityfair.com/photos/68275b6628ca3e9f36933645/16:9/w_1801,h_1013,c_limit/vf-springsteen-trump.jpg","video":null,"publish_date":"2025-05-16 16:05:09","author":"Savannah Walsh","authors":["Savannah Walsh"],"language":"en","category":"politics","source_country":"US","sentiment":-0.016},{"id":322120948,"title":"What Democrats can learn from Trump’s approach to the Middle East","text":"The writer was vice-president Kamala Harris’s national security adviser\n\nIt is fair to say that Donald Trump does not have a lot of fans in Democratic foreign policy circles, and rightly so. The US president’s chaotic approach to issues, lack of historical knowledge, appointments of craven loyalists to senior policymaking positions and apparent affinity for dictators are rightly the object of criticism and scorn.\n\nBut there is one area where many Democrats grudgingly envy Trump: his ability to take on established orthodoxies without paying a political price.\n\nWhereas Democratic leaders fear political backlash when they contemplate breaking new ground, Trump seems to relish it. And his willingness to ignore convention has been on full display this week during his trip to the Middle East.\n\nThe first example is the fact of the trip itself. Whereas newly inaugurated US presidents almost always make their first trips to key allies in Europe and North America, Trump has (after a brief stop in Rome for the pope’s funeral) smashed that tradition by going to Saudi Arabia (as he did in 2017).\n\nIndifferent to allied sensibilities or concerns from within his party about democracy and human rights, Trump used that platform to announce major defence sales and investments in the US — popular moves at home. He easily brushed off potential criticism (which President Barack Obama faced in 2009) for travelling to Arab states without stopping in Israel.\n\nIsrael policy is another example. Trump has taken positions that show “daylight” with Israel in ways that his predecessors — certainly including Joe Biden — would not have contemplated for fear of creating a political firestorm and congressional opposition. He negotiated directly with Hamas, securing the release of an American hostage. He ended a bombing campaign of the Houthis in Yemen without securing their agreement to stop shooting missiles at Israel. He is negotiating directly with Iran about a nuclear deal that Israel strongly opposes. And he is reportedly talking to Saudi Arabia about bilateral agreements that Israel only wants the US to offer in exchange for an Israeli-Saudi normalisation deal.\n\nThere is something to be said for all these steps. But if Biden had pursued them he would be likely to have faced massive opposition — from his own party and probably Trump himself.\n\nAnd then there was Trump’s agreement to lift sanctions on Syria and meet its new president, Ahmed al-Sharaa. Sharaa is a former jihadist who was once held in an American prison in Iraq and had a $10mn US bounty on his head. His organisation, now known as Hay’at Tahrir al-Sham, was the poster child for Islamist terrorism and designated by the US as a foreign terrorist organisation. After HTS took over Syria by ousting Bashar al-Assad in late 2024, the US maintained that designation and other sanctions while waiting for proof that Sharaa had genuinely abandoned his terrorist past. But Trump broke with that policy, announcing the lifting of US sanctions to great fanfare in Riyadh.\n\nA Democratic president might have worried about sitting down with a former Islamist terrorist who does not recognise Israel and has still to prove his commitment to democracy and human rights. But Trump was right to brush off such concerns, given the opportunity to steer Syria away from its erstwhile Iranian and Russian allies.\n\nPerhaps the most consequential test of Trump’s approach may emerge from the nuclear talks with Iran — now taking place directly in another break with recent practice. Trump may or may not ultimately agree to a nuclear agreement similar to Obama’s 2015 deal, but the one thing that is certain is that if he does he will be able to sell it to his party and Congress in a way that Biden never could have.\n\nDemocrats will obviously not want to flout all the same conventions as Trump — certainly accepting a $400mn Qatari plane in violation of the constitution and calling for the US to depopulate and take over Gaza would not be on the list. And unlike Trump, Democrats are not likely to have total control over their party or Congress anytime soon.\n\nBut when it comes to the willingness to challenge conventional wisdom and political obstacles in pursuit of foreign policy goals, there is something Democrats could learn from. Americans appreciate confidence and authenticity, even when they may not agree with the specific policy in question. On foreign policy, Democrats might not have the same degree of political flexibility as Trump, but they probably have more than they think.","summary":"The willingness to challenge received wisdom can yield results without political costs","url":"https://www.ft.com/content/38c70d15-62f4-49b4-840d-154ba415f97a","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F233e9318-12ed-4193-a724-d1e8fa96e711.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1","video":null,"publish_date":"2025-05-16 16:00:48","author":"Philip Gordon","authors":["Philip Gordon"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.256},{"id":322063750,"title":"Trump’s Bizarre Take on Taylor Swift: ‘No Longer Hot’","text":"Donald Trump has revived his bizarre beef with global superstar Taylor Swift, claiming she is “no longer hot.”\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” he wrote on Truth Social Friday. \n\nTrump first struck at the pop megastar in September, posting only “I HATE TAYLOR SWIFT!” after she endorsed former Vice President Kamala Harris for president. \n\n“I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them,” Swift said in an Instagram post. “I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos.”\n\nTrump then went after Swift again on Fox News, saying that he “was not a Taylor Swift fan” and that “she’ll probably pay a price for it in the marketplace.” \n\nHe also made a dig at her during the Super Bowl in February, when she was booed. \n\n“The only one that had a tougher night than the Kansas City Chiefs was Taylor Swift. She got BOOED out of the Stadium,” he posted. “MAGA is very unforgiving!”\n\nThen in March, Swift endorsed Tennessee’s democratic Senate candidate Phil Bredesen, endorsing her “pro-human rights and pro-LGBTQ+” positions. \n\n“I always have and always will cast my vote based on which candidate will protect and fight for the human rights I believe we all deserve in this country,” she said on Instagram.\n\nTrump responded by saying that he now likes Swift’s tunes “25 percent less.”","summary":"GettyDonald Trump has revived his bizarre beef with global superstar Taylor Swift, claiming she is “no longer hot.”\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” he wrote on Truth Social Friday. \n\nHas anyone noticed that, since I said &quot;I HATE TAYLOR SWIFT,&quot; she&#39;s no longer &quot;HOT?&quot;\n\n&mdash; Trump Posts on  (@trump_repost) May 16, 2025Read more at The Daily Beast.","url":"https://www.thedailybeast.com/trumps-bizarre-take-on-taylor-swift-no-longer-hot/","image":"https://www.thedailybeast.com/resizer/v2/BT4MQL7GFJHGPDHJ2UEJEZF73U.png?smart=true&auth=710925ae3997fbe41b075212623abd90636a1ea191e4dc06cb1a0099b107e420&width=1440&height=1080","video":null,"publish_date":"2025-05-16 16:00:31","author":"Kenneal Patterson","authors":["Kenneal Patterson"],"language":"en","source_country":"us","sentiment":0.247},{"id":322092198,"title":"Trump 'remains strong' in deep red parts of California — despite his 'crippling' policies","text":"Before the 1990s, California was a very strong state for Republicans. San Francisco and Oakland were famously liberal, but most of the state — from San Diego County to Bakersfield to Glendale to Barstow to Santa Barbara — leaned GOP, and Orange County south of Los Angeles was a bastion of right-wing politics. \n\nNot since President George H.W. Bush in 1988, however, has a Republican carried California in a presidential race. And even though former Vice President Kamala Harris lost the national popular vote to now-President Donald Trump by a narrow 1.5 percent in 2024, she won California by 20 percent. \n\nNonetheless, some parts of California still lean GOP, including Shasta County in the state's far north. \n\nREAD MORE: When the sleeping giant awakens, Trump will be toast\n\nThe Guardian's Dani Anguiano, in an article published on May 16, stresses that Trump remains popular there even though his policies will hurt working-class residents.\n\nAnguiano reports, \"Officials in Shasta County, a region of 180,000 perhaps best known in recent years for its turbulent far-right politics, recently voted unanimously to send a letter to the federal government expressing concern about how layoffs could affect the nearby Whiskeytown national recreation area, which brings as much as $80m to the local economy each year…. In March, about 150 people took to the streets in Redding, the Shasta County seat, to protest proposed cuts to the Department of Veterans Affairs.\"\n\nThe Guardian reporter continues, \"A month later more than 1000 people in the area gathered to demonstrate against the (Trump) Administration’s policies. Amid reports about possible reductions to Medicaid, the head of the area’s largest healthcare provider warned such action could have 'crippling' impacts in a county where the local Medicaid provider serves nearly a third of the population.\"\n\nBut despite all that, Anguiano reports, \"Trump’s agenda\" has \"remained strong among Republicans in California.\"\n\nREAD MORE: Mike Johnson made a revealing 'admission' about Trump's 'open corruption': conservative\n\nBruce Ross, a Shasta County Republican, told The Guardian, \"Everybody who lives up in Northeastern California knows folks who work for the Forest Service, or for federal agencies, and it's tough for them. I think on a human level, that's real….. There's been a lot of drama about it. But I think the actual results have shown that the administration is listening to people and saying, OK, this is important.\"\n\nREAD MORE: 'A huge scandal': Internal doc exposes Trump hunt for Social Security fraud as a sham","summary":"Before the 1990s, California was a very strong state for Republicans. San Francisco and Oakland were famously liberal, but most of the state — from San Diego County to Bakersfield to Glendale to Barstow to Santa Barbara — leaned GOP, and Orange County south of Los Angeles was a bastion of right-wing politics. \n\nNot since President George H.W. Bush in 1988, however, has a Republican carried California in a presidential race. And even though former Vice President Kamala Harris lost the national popular vote to now-President Donald Trump by a narrow 1.5 percent in 2024, she won California by 20 percent. \n\nNonetheless, some parts of California still lean GOP, including Shasta County in the state's far north. \n\nREAD MORE: When the sleeping giant awakens, Trump will be toast\n\nThe Guardian's Dani Anguiano, in an article published on May 16, stresses that Trump remains popular there even though his policies will hurt working-class residents.\n\nAnguiano reports, \"Officials in Shasta County, a region of 180,000 perhaps ","url":"https://www.alternet.org/trump-guardian-northern-california/","image":"https://www.alternet.org/media-library/president-donald-trump-in-the-white-house-on-march-20-2025-the-white-house-flickr.jpg?id=60262240&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-05-16 15:58:03","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":0.286},{"id":322074058,"title":"The Real First 100 Days","text":"Pundits are confused about what to make of the first 100 days of the second Trump administration.\n\nSupporters talk of “flooding the zone,” believing President Donald Trump is making so many changes so quickly that his opposition is reduced to deer-in-the-headlights infancy.\n\nThey must be right when the nation suffers daily Democrat pottymouth videos, vandalism of Teslas, infantile meltdowns at congressional witnesses, rioting against federal agents to protect illegal alien felons, protesting on behalf of women beaters, M-13 gangbangers, human traffickers, and assaulters, and visa-holding violent students praising Hamas terrorists.\n\nIn contrast, opponents either claim that Trump’s first three months are either directionless chaos or a Hitlerian nightmare or both.\n\nBut what is really happening?\n\nOne, Trump is finally addressing the problems that proverbially “cannot go on forever, and so they won’t go on.”\n\nWhen, if ever, would the Left have closed the southern border? After 10, 30, 50 million illegal aliens?\n\nHow many more criminal illegal entrants was the Biden administration willing to allow into American neighborhoods—500,000? One million? Three million?\n\nHow long was the world simply going to ignore the human destruction on the doorstep of Europe?\n\nWould former President Joe Biden or former Vice President Kamala Harris have sought a ceasefire? Or would it have taken another 1.5, 3, or even 5 million more dead, wounded, and missing Ukrainians and Russians?\n\nNor did past administrations ever seek a solution to the massive national debt, much less the uncontrollable budget and trade deficits.\n\nAll prior presidents passed the day of judgment on to some vague future presidency, assured that their money printing would at least not blow up on their watch.\n\nAll moaned that China was piling up huge trade surpluses while denying its own population the usual modern safety net. They knew Beijing’s aim was to use the trillions of dollars in trade surpluses to build a new massive military, a greater arsenal of nuclear bombs, and a new imperial Belt and Road overseas empire.\n\nYet no administration did anything but greenlight American outsourcing and offshoring while ignoring Chinese trade cheating and technology theft.\n\nIndeed, prior presidencies appeased and enriched China on the foolish belief that such indulgence would lead to Chinese prosperity, and with such Western-style affluence, soon a globalized, democratic, and supposedly friendly China.\n\nIn sum, we just witnessed all at once a 100-day, 360-degree effort to address all the existential challenges that we knew were unsustainable but were either afraid or incompetent to address.\n\nSecond, the administration apparently wants to confront the source of these crises and believes it is the progressive project.\n\nThe Left maintains real political power not by grassroots popularity, but rather by unelected institutional clout. The party of democracy uses antidemocratic means to achieve its ends of perpetual control.\n\nIt wages lawfare through the weaponization of the state, local, and federal courts.\n\nIt exercises executive power through cherry-picked federal district and circuit judges and their state and local counterparts.\n\nThe permanent bureaucracies and huge federal workforce are mostly left-wing, unionized, and weaponized by a progressive apparat. Their supreme directive is to amalgamate legislative, judicial, and executive power into the hands of the unelected Anthony Faucis, Jim Comeys, and Lois Lerners of the world—and thus to override or ignore both popular plebiscites and the work of the elected Congress.\n\nOver 90% of the media—legacy, network, social, and state—are left-wing. Their mission is not objectivity but, admittedly, indoctrination.\n\nAcademia is the font of the progressive project. Ninety percent of the professoriat are left-wing and activist—explaining why campuses believe they are above the rules and laws of the Constitution, the Supreme Court, and the U.S. Congress.\n\nAdd into the mix the blue-chip Accela corridor law firms and the globalized corporate and revolving-door political elite.\n\nThe net result is clear: Almost everything the vast majority of Americans and their elected representatives did not want—far-left higher education, a Pravda media, biological men destroying women’s sports, an open border, 30 million illegal aliens, massive debt, a weaponized legal system, and a politicized Pentagon—became the new culture of America.\n\nSo, Trump is not just confronting unaddressed existential crises but also the root causes of why, when, and how they become inevitable and nearly unsolvable.\n\nHis answer is a messy, knock-down-drag-out counterrevolution to reboot the country back to the middle where it once was and where the Founders believed it should remain.\n\nHis right and left opponents call such pushback chaotic, disruptive, and out of control.\n\nBut the counterrevolution appears disorderly and upsetting, mostly to those who originally birthed the chaos; it certainly does not to the majority of Americans who finally wanted an end to the madness.\n\n(C)2025 Tribune Content Agency, LLC.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Pundits are confused about what to make of the first 100 days of the second Trump administration. Supporters talk of &#8220;flooding the zone,&#8221; believing President... Read More\n\n\nThe post The Real First 100 Days appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/16/trump-real-first-100-days/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/GettyImages-2215206485-scaled.jpg","video":null,"publish_date":"2025-05-16 15:55:07","author":"Defunding Child Transitions,Victor Davis Hanson","authors":["Defunding Child Transitions","Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":-0.374},{"id":322048636,"title":"Trump Revives Taylor Swift Feud And Calls Bruce Springsteen ‘Highly Overrated’","text":"President Donald Trump launched attacks on a pair of billionaire musicians, Taylor Swift and Bruce Springsteen, in a series of Truth Social posts Friday morning, both of whom are vocal critics of Trump and have sparred with him in the past.\n\nTrump has long been critical of Swift, who has endorsed his presidential opponents. (Photo by Jeff ... More Kravitz/FilmMagic)\n\n“Has anyone noticed that, since I said ‘I HATE TAYLOR SWIFT,’ she’s no longer ‘HOT?’” Trump said, referencing a post he made on Truth Social in September slamming the singer after she endorsed his opponent, former Vice President Kamala Harris.\n\nThe reason for Trump’s attack on Swift is unclear, as Swift has not mentioned him recently, and she has kept a low profile on social media and in public since her blockbuster Eras Tour wrapped up in December.\n\nMinutes later, Trump made another post targeting the “Highly Overrated Bruce Springsteen” after the musician blasted Trump as “treasonous” and “unfit” for office while on stage in London on Wednesday.\n\n“Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy,” Trump said of Springsteen, criticizing him for supporting his former opponent, former President Joe Biden.\n\nTrump threatened Springsteen—whom he called a “dried out ‘prune’ of a rocker”—to “KEEP HIS MOUTH SHUT until he gets back into the Country.”\n\nAlso in his post on Springsteen, Trump renewed his criticism of Biden, whom he has targeted in hundreds of Truth Social posts since retaking office, calling him “our WORST EVER President.”\n\nWhat Did Bruce Springsteen Say About Trump At His U.k. Show?\n\nSpringsteen, a longtime Trump critic, said at the opening night of his U.K. tour this week the United States is “currently in the hands of a corrupt, incompetent and treasonous administration.” Springsteen accused the Trump administration of alienating U.S. allies, rolling back civil rights and “abandoning the world’s poorest children to sickness and death.” He also referenced Trump’s ongoing battle with Harvard University and his administration's deportation of several international students: “They’re defunding American universities that won’t bow down to their ideological demands. They’re removing residents off American streets and, without due process of law, are deporting them to foreign detention centers and prisons,” Springsteen said. Following the show, the White House said in a statement that “the 77 million Americans that elected President Trump disagree with elitist and out-of-touch celebrities like Bruce Springsteen,” adding he is “welcome to stay overseas,” NBC News reported. Springsteen endorsed all three of Trump’s Democratic presidential opponents, and he has previously criticized Trump as a “threat to our democracy.”\n\nHow Have Taylor Swift And Trump Sparred?\n\nSwift has spoken out against Trump’s presidency since his first term and endorsed both Biden in 2020 and Harris in 2024, which has provoked Trump to launch multiple attacks on the singer. In 2019, Swift accused Trump of treating the presidency like an “autocracy,” and a year later, she criticized his controversial declaration that “when the looting starts, the shooting starts,” as protests raged following the police killing of George Floyd. “After stoking the fires of white supremacy and racism your entire presidency, you have the nerve to feign moral superiority before threatening violence? ‘When the looting starts the shooting starts’??? We will vote you out in November,” Swift posted in May 2020. In August 2024, Trump reshared AI-generated images that falsely indicated Swift had endorsed his candidacy, stating: “I accept!” Swift later wrote on Instagram the AI images were one of the reasons she decided to vocally endorse Harris. After Swift endorsed Harris, Trump told “Fox & Friends”: “I’m not a Taylor Swift fan,” adding, “She seems to always endorse a Democrat, and she’ll probably pay a price for it in the marketplace.” Trump again criticized Swift in February after the Super Bowl, which she attended to support her boyfriend, Kansas City Chiefs tight end Travis Kelce, where she was met with some boos when shown on a jumbotron. “The only one that had a tougher night than the Kansas City Chiefs was Taylor Swift. She got BOOED out of the Stadium. MAGA is very unforgiving!” Trump said on Truth Social.\n\nIs Taylor Swift Really No Longer “hot?”\n\nSwift has not posted on social media or released music since her Eras Tour wrapped up in December, though she had a highly successful 2024. The Eras Tour ended as the highest-grossing tour of all time, grossing more than $2 billion. It was also credited with boosting many local economies globally and in the United States. Swift also had the two best-performing albums of 2024, according to Billboard’s year-end chart, with her record-breaking “The Tortured Poets Department” and “1989 (Taylor’s Version).”\n\nForbes Valuation\n\nSwift and Springsteen are two of the wealthiest musicians in the world. Swift is the world’s wealthiest female musician, with an estimated net worth of $1.6 billion, and she is the first musician to make the billionaire ranks based solely on her music catalog and performances. Springsteen is worth an estimated $1.2 billion, and he sold his music catalog for $500 million in 2021. Trump is worth an estimated $5.4 billion.\n\nFurther Reading\n\n‘MAGA Is Unforgiving’: Trump Mocks Taylor Swift After Some Spectators Boo Her At Super Bowl (Forbes)\n\nBruce Springsteen Is Now A Billionaire (Forbes)\n\nFollow me on Twitter. Send me a secure tip.\nEditorial StandardsForbes Accolades","summary":"Trump said Swift is “no longer ‘HOT’” after he posted in September that he hates the singer, who endorsed his 2024 election opponent, former Vice President Kamala Harris.","url":"https://www.forbes.com/sites/conormurray/2025/05/16/trump-revives-taylor-swift-feud-and-calls-bruce-springsteen-highly-overrated/","image":"https://imageio.forbes.com/specials-images/imageserve/6622c3704d8bec474e388467/0x0.jpg?format=jpg&crop=2335,1312,x541,y37,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-05-16 15:38:22","author":"Conor Murray,Forbes Staff","authors":["Conor Murray","Forbes Staff"],"language":"en","source_country":"US","sentiment":0.001}]}