{"offset":0,"number":50,"available":542,"news":[{"id":346773102,"title":"The Five - Wednesday, July 30","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode July 30, 2025 38:46 \n FULL EPISODE\n\n EXP 8 DAYS\n The Five - Wednesday, July 30 \n Donald Trump, Kamala Harris, Economy \n Tags MOST RECENT EPISODES | VIDEOSTHE FIVE | FULL EPISODES","summary":"Donald Trump, Kamala Harris, Economy","url":"https://www.foxnews.com/video/6376355032112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/5c727a32-3653-4822-88a9-35cba8157827/3771f192-ffa1-459d-bc70-f7b28df48e56/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-07-31 01:12:28","author":null,"language":"en","source_country":"us","sentiment":-0.259},{"id":346773114,"title":"Kamala Harris is a 'great candidate for Republicans,' says Rep. James Comer","text":"Kamala Harris is a 'great candidate for Republicans,' says Rep. James Comer | Fox News Video\n\nto top close\n\nThis video is playing in picture-in-picture.\n\nIngraham Angle\n\nJuly 30, 2025\n\nKamala Harris is a 'great candidate for Republicans,' says Rep. James Comer\n\nRep. James Comer, R-Ky., discusses his investigation into former President Joe Biden's mental acuity while in office and former Vice President Kamala Harris' decision not to run for California governor on 'The Ingraham Angle.'\n\nWHAT TO WATCH | VIDEOS\n\nLATEST NEWS | VIDEOS\n\nTHE INGRAHAM ANGLE\n\nKAMALA HARRIS\n\nNOW - 9:30 PM\n\nFox News Channel\n\n9:00 PM - 10:00 PM\n\n10:00 PM - 11:00 PM\n\nFox News @ Night\n\n11:00 PM - 12:00 AM\n\nFox Business Channel\n\nLegends & Lies: The Real West\n\n9:00 PM - 10:00 PM\n\nLegends & Lies: The Real West\n\n10:00 PM - 11:00 PM\n\nLegends & Lies: The Real West\n\n11:00 PM - 12:00 AM\n\nFox Weather Channel\n\nFox Weather\n\nLive Stream\n\nFox News Radio\n\nFOX News Radio Live Channel Coverage\n\nLive Stream\n\nFox News Channel Live\n\nFox Weather\n\nLive Stream","summary":"Rep. James Comer, R-Ky., discusses his investigation into former President Joe Biden&apos;s mental acuity while in office and former Vice President Kamala Harris&apos; decision not to run for California governor on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6376351268112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b399651a-762f-4163-a241-1feacf2916e5/5b2cd96d-86e0-43d1-bc11-eca5909e0b90/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 01:09:43","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.199},{"id":346773100,"title":"Trump's putting his doubters on notice, says Jesse Watters","text":"to top close Video This video is playing in picture-in-picture.\n\nJesse Watters Primetime July 30, 2025 08:46 \n\n Trump's putting his doubters on notice, says Jesse Watters \n Fox News host Jesse Watters gives his take on the economy and former Vice President Kamala Harris' decision not to run for California governor on 'Jesse Watters Primetime.'\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRJESSE WATTERS PRIMETIMEV-VIDEOPOLITICS","summary":"Fox News host Jesse Watters gives his take on the economy and former Vice President Kamala Harris&apos; decision not to run for California governor on &apos;Jesse Watters Primetime.&apos;","url":"https://www.foxnews.com/video/6376353623112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/756f7b10-15c9-40e2-ae0d-4cc5b5c6a027/1395100d-145c-4bbc-8cb2-4f9ad96bbefa/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-31 01:08:36","author":null,"language":"en","source_country":"us","sentiment":0.597},{"id":346773940,"title":"Harrison Ford laments 'rich get richer and poor get poorer' in critique of Trump presidency","text":"Actor Harrison Ford spoke out about President Donald Trump's second term in an interview published Wednesday, lamenting, the \"rich get richer and poor get poorer,\" which he declared wasn't right. \"In politics and in life, you don’t always get what you want, but you get what you get, and you don’t get upset. They teach us that in kindergarten, but they also teach you to fight for what you think is right,\" he told Variety. \"Now, because we’ve been disaggregated in this way, we’re having a hard time finding commonality. But if you look at the economy, you’ll figure out where the commonality is — it’s where it always was: Rich get richer, and poor get poorer. And that ain’t exactly right,\" Ford conituned. Ford supported former Vice President Kamala Harris in 2024 and recorded a video endorsement for the former vice president. OBAMA SWIPES AT AFFLUENT LIBERALS DURING RARE PUBLIC REMARKS, SAYS 'ALL OF US ARE GOING TO BE TESTED' Ford said the country was \"on a healthy swing to the right\" right now, but added that it would swing back the other way. Asked by Variety where they should go from here, Ford responded, \"You’re asking an unqualified person. So I don’t have that answer.\" In Ford's campaign video for Harris, he said, \"The truth is this: Kamala Harris will protect your right to disagree with her about policies or ideas.\" Harris garnered a lot of celebrity endorsements, including George Clooney, Cardi B, Jamie Lee Curtis, and TV producer Shonda Rhimes. KAMALA HARRIS COMES KNIVES OUT AGAINST TRUMP IN FIRST SPEECH SINCE LEAVING OFFICE: ‘ABSOLUTE CHAOS’ Ford said during the endorsement video that Trump wanted revenge. Variety asked Ford how he felt about making the video for Harris, as someone who doesn't talk about politics often. \"Fine,\" he responded. He also spoke to Variety about his career and was asked whether he would ever retire. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP \"No. That’s one of the things I thought was attractive about the job of an actor, was that they need old people, too, to play old people’s parts,\" he said.","summary":"Harrison Ford spoke out against President Donald Trump&apos;s second term on Wednesday, lamenting &quot;the rich get rich and the poor get poorer&quot; during an interview with Variety.","url":"https://www.foxnews.com/media/harrison-ford-laments-rich-get-richer-poor-get-poorer-critique-trump-presidency","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/harrison-ford-donald-trump.jpg","video":"https://www.foxnews.com/video/6376041749112","publish_date":"2025-07-31 01:00:03","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.045},{"id":346771972,"title":"Former Vice President Kamala Harris not running for California governor (Video)","text":"Former Vice President Kamala Harris announced Wednesday that she will not run for California governor in 2026. CBS News executive director for White House and politics Fin Gmez joins with more.\n\nCBS News 24/7 is the premier anchored streaming news service from CBS News and Stations that is available free to everyone with access to the internet and is the destination for breaking news, live events, original reporting and storytelling, and programs from CBS News and Stations' top anchors and correspondents working locally, nationally and around the globe. It is available on more than 30 platforms across mobile, desktop and connected TVs for free, as well as CBSNews.com and Paramount+ and live in 91 countries.\n\nSubscribe to the CBS News YouTube channel: https://youtube.com/cbsnews\nWatch CBS News: https://cbsnews.com/live/\nDownload the CBS News app: https://cbsnews.com/mobile/\nFollow CBS News on Instagram: https://instagram.com/cbsnews/\nLike CBS News on Facebook: https://facebook.com/cbsnews\nFollow CBS News on Twitter: https://twitter.com/cbsnews\nSubscribe to our newsletters: https://cbsnews.com/newsletters/\nTry Paramount+ free: https://paramountplus.com/?ftag=PPM-05-10aeh8h\n\nFor video licensing inquiries, contact: licensing@veritone.com","summary":"Former Vice President Kamala Harris announced Wednesday that she will not run for California governor in 2026. CBS News executive director for White House and politics Fin Gmez joins with more. CBS News 24/7 is...\n\n\nThe post Former Vice President Kamala Harris not running for California governor (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/07/30/former-vice-president-kamala-harris-not-running-for-california-governor-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/07/31/maxresdefault-7.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1753923180","video":null,"publish_date":"2025-07-31 00:23:00","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","category":"politics","source_country":"in","sentiment":0.236},{"id":346771980,"title":"Kamala Harris says she will not run for California governor (Video)","text":"International\n\nSouth Cinema\n\nSocial News XYZ Reviews\n\nMovie Schedules\n\nMovies News\n\nLive Events\n\nMotorsports\n\nOther Sports\n\nScience/Tech\n\nBusiness Wire India\n\nEnvironment\n\nHome » Videos » Kamala Harris says she will not run for California governor (Video) \n\nKamala Harris says she will not run for California governor (Video)\n\nPosted By: Social News XYZ\nJuly 30, 2025\n\nFormer Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.\n\n#kamalaharris\n\nSubscribe: http://smarturl.it/AssociatedPress\n\nRead more: https://apnews.com\n\nThis video may be available for archive licensing via https://newsroom.ap.org/home\n\nFacebook Comments\n\nAbout SocialNewsXYZ\nAn Indo-American News website.It covers Gossips, Politics, Movies, Technolgy, and Sports News and Photo Galleries and Live Coverage of Events via Youtube.\nThe website is established in 2015 and is owned by AGK FIRE INC.\n\nLike Loading...\n\nKamala Harris says she will not run for California governor (Video)\nDescription\n\nFormer Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.\n#kamalaharris \nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\nThis video may be available for archive licensing via https://newsroom.ap.org/home\n\nPrevious post\n\nSiddhant Chaturvedi, Tripti Dimri, Saurabh Sachdeva, Mrunal Thakur, And Other Celebs At Screening Of Dhadak 2 – Gallery\n\nSonu Sood At His Birthday Celebration – Gallery\n\nThankYou Dear Movie Press Meet – Gallery\n\nKingdom Movie Press Meet – Gallery\n\nActress Rekha Nirosha Glam Stills From ThankYou Dear Movie Press Meet\n\nActress Bhagyashri Borse Glam Stills From Kingdom Movie Press Meet\n\nVaani Kapoor Spotted At Mumbai Airport Departure – Gallery\n\nRasha Thadani Spotted At Mumbai Airport Departure – Gallery\n\nIbrahim Ali Khan Spotted At Mumbai Airport Departure – Gallery\n\nHema Malini Spotted At Mumbai Airport Departure – Gallery\n\nTop Stories\n\n‘Responded to Pahalgam attack with full resolve’: PM Modi lauds JP Nadda’s explanation on Op Sindoor\n\nKashmiri youth no longer radicalised: HM Amit Shah\n\nTerrorism in Kashmir systematically dismantled under PM Modi govt: HM Amit Shah\n\nNew banking laws to come into effect from August 1\n\n‘Don’t control me’: Jaya’s snap leaves Priyanka Chaturvedi smiling, Rajya Sabha stunned\n\nTrump tariffs: India says will take all steps necessary to secure ‘national interest’\n\nUnion Minister JP Nadda’s blazing attack: ‘No more biryani for bombers’\n\nRS debate: HM Shah blasts Cong for coining ‘saffron terror’, says ‘Hindus can never be terrorists’\n\nTrump’s tariffs could open new growth opportunities for India: Industry leaders\n\nIndigenous safety system Kavach 4.0 kicks in on Mathura-Kota section of Indian Railways\n\nArchives Archives\n\nCopyright 2025 | AGK FIRE INC|\nTerms of Service / Privacy Policy | Contact Us","summary":"Former Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028. #kamalaharris Subscribe: http://smarturl.it/AssociatedPress Read more:...\n\n\nThe post Kamala Harris says she will not run for California governor (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/07/30/kamala-harris-says-she-will-not-run-for-california-governor-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/07/31/maxresdefault-2.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1753922045","video":null,"publish_date":"2025-07-31 00:04:05","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","category":"politics","source_country":"in","sentiment":0.284},{"id":346772856,"title":"‘South Park’ Episode Ridiculing Trump Draws 5.9 Million Viewers","text":"A promotional image for the Season 27 debut of 'South Park' on Comedy Central\nComedy Central\n\nComedy Central’s South Park has had a very good month, with the long-running show’s Season 27 premiere drawing a total audience of 5.9 million viewers, according to Paramount, which streams the show on Comedy Central and Paramount+. It marks South Park’s biggest premiere episode since 1999, fueled in part by the significant buzz the episode generated with its mockery of Donald Trump and Comedy Central’s parent company, Paramount Global.\n\nIn the premiere episode, titled “Sermon on the ‘Mount,\" Trump is seen in bed with the Devil, and wielding his power to arrest and sue his enemies. The episode is noteworthy as it comes just days after the approval of a merger between Paramount and Skydance, which South Park creators Trey Parker and Matt Stone suggested led to a delay in the show’s premiere date.\n\nShow creators Matt Stone and Trey Parker tear into the Paramount Skydance merger\n\n“In response to the press release from Comedy Central about the change in premiere date for South Park,\" said a statement posted to the show’s page on X, \"Trey Parker and Matt Stone said – ‘This merger is a s--- show and it’s f---ing up South Park. We are at the studio working on new episodes and we hope the fans get to see them somehow.’”\n\nThe White House was unimpressed with the Trump-focused episode, with spokesperson Taylor Rogers telling multiple outlets the show “hasn’t been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention.”\n\nMORE FOR YOU\n\nThe show’s merciless ridicule of Trump--which included graphic taunts about the president’s manhood--comes as the fallout from the $8 billion Paramount and Skydance merger included an agreement that Paramount would pay $16 million to settle a lawsuit brought by Trump over a 60 Minutes interview with Kamala Harris and a concession that CBS install a “bias monitor” at the network.\n\nCBS also announced it would cancel its decades-long franchise in late night, The Late Show with Stephen Colbert, citing financial difficulties in continuing production of the show. The timing of the decision led many to suggest the decision to cut Colbert was likely related to the hosts frequent jokes made about the president.\n\nNew York, USA - JULY 21: Dozens of anti-Trump protesters gathered outside the Ed Sullivan Theater, home of The Late Show with Stephen Colbert, to protest CBS's reported decision to fire the longtime host. Demonstrators held signs and chanted in support of Colbert, blaming political pressure and criticizing the network's move as a blow to free speech and satire. The protest came shortly after rumors surfaced that Colbert's termination was linked to his outspoken criticism of President Donald Trump. (Photo by Lokman Vural Elibol/Anadolu via Getty Images)\nAnadolu via Getty Images\n\n‘Cowardly capitulation that could set a dangerous precedent’\n\nIn an interview with PBS, FCC Commissioner Anna Gomez, the lone dissenting vote in the 2-1 FCC vote to approve the merger, described as “cowardly capitulation that could set a dangerous precedent, reshaping the future of entertainment, while eroding the freedom of the press.”\n\nNo such capitulation coming from South Park, it would seem. On the heels of its season premiere--which generated huge traffic on YouTube for its Trump segments--a trailer for the second episode shows that the show isn’t done with the president just yet, showing Trump sharing a dinner with Satan, and rubbing his leg under the table.\n\nEditorial StandardsReprints & Permissions","summary":"It's the long-running show's biggest premiere since 1999, fueled by segments ridiculing Donald Trump.","url":"https://www.forbes.com/sites/markjoyella/2025/07/30/south-park-episode-ridiculing-trump-draws-59-million-viewers/","image":"https://imageio.forbes.com/specials-images/imageserve/688aa995febdb969b9d11ce9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-07-31 00:02:46","author":"Mark Joyella,Senior Contributor","authors":["Mark Joyella","Senior Contributor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.025},{"id":346763278,"title":"US politics live: Kamala Harris’ major election announcement","text":"The prospect of Australia getting a decent trade deal with the US are looking dimmer with Donald Trump signalling he is determined to put in place tariffs of potentially as high as 20 per cent on nations that haven’t finalised an agreement with Washington hy Friday. \n\nThe US President on Wednesday, US time, said the August 1 deadline for tariffs “will not be extended”.\n\nTo get all the latest news from US President Donald Trump and what it means for Australia as soon as it drops — download the news.com.au app direct to your phone.\n\nAustralia was initially set to have a 10 per cent “baseline tariff”. But in recent days, Mr Trump has suggested that “baseline” could be as high as 15 or 20 per cent. \n\nOn Wednesday, he said India could be whacked with a 25 per cent tariff and an unknown “penalty” for doing so much trade with China and Russia. \n\nIn the US itself, Kamala Harris has said she won’t stand for California Governor. That does, however, open up the possibility of her standing for president once again in 2028. \n\nThe Federal Reserve has again kept interest rates on hold which is sure to infuriate Mr Trump and reignite the campaign against the Central Bank’s chair Jerome Powell. \n\nBut there are signs the Fed could well cut rates soon. \n\nMeanwhile, the Democrats have been trying to use a little known and rarely used law to force the White House to publish the so-called “Epstein files”.\n\nRead on for more updates.","summary":"Former US vice president and 2024 presidential candidate Kamala Harris has made a huge call on her future. Follow our live coverage.","url":"https://www.news.com.au/world/north-america/us-politics/us-politics-live/live-coverage/538d4d10648fe66aec0ddf6ba30cc2e5?from=rss-basic","image":"https://content.api.news/v3/images/bin/21b63830414589a2d12d0e6ffc912a77","video":null,"publish_date":"2025-07-30 23:54:42","author":"Benedict Brook In The Us","authors":["Benedict Brook In The Us"],"language":"en","category":"politics","source_country":"au","sentiment":-0.575},{"id":346771986,"title":"7/30 The Takeout with Major Garrett (Video)","text":"GDP surges in second quarter after dipping earlier this year; Kamala Harris will not run for California governor\n\nCBS News 24/7 is the premier anchored streaming news service from CBS News and Stations that is available free to everyone with access to the internet and is the destination for breaking news, live events, original reporting and storytelling, and programs from CBS News and Stations' top anchors and correspondents working locally, nationally and around the globe. It is available on more than 30 platforms across mobile, desktop and connected TVs for free, as well as CBSNews.com and Paramount+ and live in 91 countries.\n\nSubscribe to the CBS News YouTube channel: https://youtube.com/cbsnews\nWatch CBS News 24/7: https://cbsnews.com/live/\nDownload the CBS News app: https://cbsnews.com/mobile/\nFollow CBS News on Instagram: https://instagram.com/cbsnews/\nLike CBS News on Facebook: https://facebook.com/cbsnews\nFollow CBS News on X: https://x.com/cbsnews\nSubscribe to our newsletters: https://cbsnews.com/newsletters/\nTry Paramount+ free: https://paramountplus.com/?ftag=PPM-05-10aeh8h\n\nFor video licensing inquiries, contact: licensing@veritone.com","summary":"GDP surges in second quarter after dipping earlier this year; Kamala Harris will not run for California governor CBS News 24/7 is the premier anchored streaming news service from CBS News and Stations that is...\n\n\nThe post 7/30 The Takeout with Major Garrett (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/07/30/7-30-the-takeout-with-major-garrett-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/07/31/maxresdefault-1.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1753921083","video":null,"publish_date":"2025-07-30 23:48:03","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","source_country":"in","sentiment":0.186},{"id":346769826,"title":"Bernie Sanders puts Senate Democrats on notice over Gaza – and on the record with vote to block arms to Israel","text":"Sen. Bernie Sanders (I-VT) is now forcing Senate Democrats to reckon not only with the images of starvation and suffering in Gaza but also the tectonic shift within voters in their own party. \n\nSanders – the democratic socialist independent, former presidential candidate and gadfly-turned vanguard of the left-wing – will force two votes to pressure the Senate to block arms to Israel in response to civilian massacres in Gaza and the impending famine. \n\nThe votes are similar to those Sanders held in the weeks after the election, when many wondered whether President Joe Biden’s outspoken support for Israel’s war in Gaza after a surprise assault by Hamas may have cost Kamala Harris votes in Michigan and with young voters. \n\n“What polling shows is the American people are sick and tired of supporting a racist extremist government in Israel, which is now starving, starving children to death with U.S. taxpayer money,” Sanders told The Independent. \n\nSanders has some polling to back up his claim. A Gallup poll shows 32 percent of Americans support Israel’s military action in Gaza and 60 percent oppose. \n\nThe Democrats’ divide is much starker. While 25 percent of Independents support Israel’s actions only 8 percent of Democrats are in support. For those wondering, Marjorie Taylor Greene is firmly in the minority of Republicans who think the war is a “genocide,” as 71 percent support Israel’s actions.\n\nUnsurprisingly, Sanders’s fellow progressive, Sen. Elizabeth Warren (D-MA) supports his push to block arms to Israel. \n\n“The Prime Minister has instead created a humanitarian catastrophe, and every day that goes by, the world sees it more vividly and makes clear that they want Netanyahu to stop, stop starving little babies,” Warren told The Independent. \n\nSenate Minority Leader Chuck Schumer told The Independent early on Wednesday that he hadn’t seen Sanders’s amendment, but given his outspoken support for Israel, he likely will not vote for it.\n\nThe next generation of Democratic Senate leaders is clearly angry. On Tuesday, before Sanders announced his votes, Sen. Brian Schatz of Hawaii, who like Sanders is Jewish, unloaded on Israeli Prime Minister Benjamin Netanyahu. \n\n“There's nobody that can credibly claim that one of the most capable militaries in the world is unable to do basic food distribution, they've been doing this in war zones for decades,” he told The Independent.\n\nMany expect Schatz to succeed retiring Sen. Dick Durbin of Illinois, the first senator to support a ceasefire, as Democratic whip in the Senate. So his condemnations speak volumes, specifically, his critique of the Gaza Humanitarian Foundation, the Israel and U.S.-supported group which supplanted United Nations food distribution.\n\n“They kicked out all the organizations that know how to do this,” Schatz said. “They stood up a new organization that's never done this before, that's mostly comprised of military contractors, and it is flat and freely and people are dying so we're all furious, and there's some bipartisan fury.”\n\nThe same can be said of Sen. Amy Klobuchar (D-MN), a potential candidate to succeed Schumer when he eventually retires. When Klobuchar ran against Sanders and Warren, in the Democratic presidential primary, she occupied the moderate lane and has earned a reputation as an consensus builder who can pass legislation. \n\nBut last week, she delivered a floor speech excoriating the Netanyahu government’s treatment of Gaza. Many on social media pointed out how a few weeks ago, she joined a bipartisan delegation that met with Netanyahu when he came to Washington. \n\nKlobuchar told The Independent on Tuesday that she specifically went to the meeting to ask Netanyahu about Israel’s Defense Minister Israel Katz’s proposal to create a “humanitarian city” for displaced Palestinians. \n\n“In fact, the reason I went to the meeting, I was invited as number-three in Democratic leadership, and I went,” Klobuchar said. “The reason I went was to raise the lack of humanitarian aid into Gaza and that they had to have more access point.” \n\nKlobuchar’s fellow Minnesotan Sen. Tina Smith said she would back Sanders’s amendment and has voted for them in the past. \n\n“I think it is just very important that we show these votes our strong disapproval of the way the Netanyahu government is the prosecuting this war,” she said. Smith, who is retiring at the end of next year said the “horrible images” out of Gaza have signaled a change. \n\nSmith has often been mistaken for Sen. Tammy Baldwin (D-WI), who just won re-election last year, despite Harris losing the Badger State. Baldwin did not say whether she had read the legislation, though she denounced the treatment of Gazans. \n\n“The situation in Gaza is a humanitarian crisis and action must be taken,” she told The Independent. “We need to send a strong message to our president, as well as Netanyahu, and I expect to support them.”\n\nA swing-state Democrat who narrowly won re-election, a future whip and a potential majority leader’s critiques shows Democrats no longer see opposing Israel’s treatment of Palestinians as a politically verboten topic. \n\nThe Democratic Party clearly has seen how it no longer sees Israel’s actions as acceptable, and regardless of how the vote will go, they will have been woken up by Sanders: the Jewish son of Polish immigrants who fled antisemitism and lived on an Israeli kibbutz in his youth.","summary":"Sanders says ‘the American people are sick and tired of supporting a racist extremist government in Israel.’ The democratic socialist is trying to move Democrats to match voter sentiment, Eric Garcia writes","url":"https://www.independent.co.uk/news/world/americas/us-politics/bernie-sanders-israel-gaza-democrats-vote-b2799185.html","image":"https://static.independent.co.uk/2025/07/30/22/46/GettyImages-2225406189.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/smlh6vkk-OhrQWqOm.mp4","publish_date":"2025-07-30 23:31:44","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":0.114},{"id":346770332,"title":"Kamala Harris rules out running for California governor","text":"Former US presidential candidate Kamala Harris says she will not run for governor of California.\n\nFollowing her unsuccessful 2024 presidential bid, reports suggested Harris was weighing entering next year's election to lead her home state of California, where she had served as a US senator and worked as a prosecutor.\n\n\"After deep reflection,\" the former vice-president, a Democrat, said in a statement on social media, \"I've decided that I will not run for Governor in this election.\"\n\n\"For now, my leadership - and public service - will not be in elected office,\" she added, saying she would share \"more details in the months ahead about my own plans.\"\n\nHer decision leaves the door open for her to mount another try for the White House in 2028, while also removing a possible frontrunner from the race to succeed Governor Gavin Newsom, a fellow Democrat understood to have his own presidential ambitions.\n\nIn her statement, Harris appeared to address worries within her own party about its direction and future after she lost November's election to President Donald Trump.\n\n\"As we look ahead, we must be willing to pursue change through new methods and fresh thinking—committed to our same values and principles, but not bound by the same playbook,\" she posted.\n\nPrimaries for California's next governor are set to take place in June 2026, before the general election in November. Newsom is completing his second and final term and the new governor will take office in 2027.\n\nDemocrats dominate the state's political leadership, and whoever wins the party's nomination will be expected to then take the governorship. Arnold Schwarzenegger, the last Republican to serve as governor, left office in 2011.\n\nAn economic powerhouse of America, California would be the world's 5th largest economy if it were a country. It's also home to the Silicon Valley, where companies like Apple and Meta are based, giving its governor, as well as its regulations and laws, influence at the national level.","summary":"Former US presidential candidate Kamala Harris says she will not run for governor of California.","url":"https://www.myjoyonline.com/kamala-harris-rules-out-running-for-california-governor/","image":"https://www.myjoyonline.com/wp-content/uploads/2024/10/image-11-21.jpg","video":null,"publish_date":"2025-07-30 23:31:00","author":"Abubakar Ibrahim,Bbc 31pm","authors":["Abubakar Ibrahim","Bbc 31pm"],"language":"en","category":"politics","source_country":"gh","sentiment":0.231},{"id":346765048,"title":"Toni Atkins gains key endorsements ahead of Harris opting out of gubernatorial race","text":"Toni Atkins, a longtime leader in San Diego and across the state, has clutched key endorsements for her gubernatorial candidacy as she fights for a spot in the race.\n\nShe first became the director of clinic services at San Diego’s Womancare Health Center and from there she moved to City Hall, becoming a member of the San Diego City Council in 2000. She moved on to the state Assembly, then was elected to the state senate in 2016. \n\nA year later, she became the first woman and openly LGBTQ person to serve as the Senate President pro Tempore.\n\nNow, she’s aiming for governor, with the endorsement of top state leaders.\n\nAtkins is up against a slew of other candidates in the race, which will be decided more than a year from now. California Gov. Gavin Newsom is currently serving his second term and is not eligible to run for the office again, which opens the race up without an incumbent.\n\n“Toni Atkins is the real deal. Her motivation is doing good for people and building stronger communities,” said current Senate President pro Tempore Mike McGuire in a statement. \n\n“She’s relentless in her pursuit to expand affordable housing, lower costs for all Californians and no one brings people together like she does.”\n\nEndorsers currently serving in political office include state senators Scott Wiener, Caroline Menjivar, John Laird, and assemblymembers LaShae Sharp-Collins, of La Mesa, and Cecilia Aguiar-Curry, who is currently the assembly majority leader. \n\nFormer senators Susan Eggman and Richard Roth also have endorsed Atkins.\n\nA poll conducted earlier this month by UC Irvine showed the majority of those surveyed polling as “not sure yet,” but second to that was former Vice President Kamala Harris with support from 24% of those surveyed. \n\nHarris never threw her hat in the ring, but she also never ruled out running, until Wednesday afternoon, when she officially announced across social media platforms that she would not be entering the gubernatorial race. \n\n“In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor. I love this state, its people, and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor this election,” Harris wrote in her statement. \n\nThe UC Irvine poll didn’t specifically include Atkins, but the “other category” was polling at 1%. The highest polling candidates behind Harris were Rick Caruso, a Republican polling at 9% and Katie Porter, a Democrat polling at 6%.\n\nHarris’ withdrawal could shake up the next poll, potentially granting Atkins the opportunity to move up, especially combined with the recent endorsements.\n\n“From day one, this campaign has been about California’s future — tackling rising costs, defending our freedoms, and standing up for communities too often left behind. Vice President Harris has made her decision, and I thank her for her decades of service to our state and country,” Atkins said in a statement following Harris’ announcement.\n\n“The mission hasn’t changed. This is a campaign built to lead, built to win, and built to fight for every Californian, in every zip code. Our path to victory is clear, and I’m ready to lead on day one as Governor of California,” she said.","summary":"Top state leaders have endorsed former state legislator Toni Atkins in the 2026 gubernatorial race.","url":"https://timesofsandiego.com/politics/2025/07/30/toni-atkins-gains-key-endorsements-gubernatorial-race/","image":"https://timesofsandiego.com/wp-content/uploads/2024/01/Toni-Atkins-Podium.jpg","video":null,"publish_date":"2025-07-30 23:27:20","author":"Chris Jennewein,Gabrielle Wallace • Times of San Diego","authors":["Chris Jennewein","Gabrielle Wallace • Times of San Diego"],"language":"en","source_country":"US","sentiment":0.268},{"id":346750822,"title":"Harris halts gubernatorial talk, spurs speculation on run for White House","text":"July 30 (UPI) -- Former Vice President Kamala Harris will not seek the governorship of California in 2026 but might run for president in 2028.\n\nHarris on Wednesday ended partial speculation regarding her political future when she announced she won't run in California's gubernatorial election next year.\n\n\"I have given serious thought to asking the people of California for the privilege to serve as their governor,\" Harris said in a prepared statement.\n\n\"I love this state, its people and its promise. It is my home,\" Harris said. \"But after deep reflection, I've decided that I will not run for governor in this election.\"\n\nHarris said she will focus her efforts on \"helping elect Democrats across the nation who will fight fearlessly.\"\n\nWhile doing that, Harris will be \"listening to the American people\" and will share \"more details in the months ahead about my own plans,\" she said.\n\nThose plans could include another run for the presidency during the 2028 election.\n\n\"Our politics, our government and our institutions too often have failed the American people, culminating in this moment of crisis,\" Harris said without elaborating on her crisis claim.\n\n\"We must be willing to pursue change through new methods and fresh thinking -- committed to our same values and principles but not bound by the same playbook,\" she added.\n\nHarris previously was California's attorney general from January 2011 to January 2017.\n\nShe then was a U.S. senator for California from 2017 until being appointed vice president in 2021.\n\nHarris lost the Nov. 5 election to President Donald Trump after former President Joe Biden ended his re-election campaign amid internal pressure, declining approval ratings and after a poor debate performance against Trump.\n\nCalifornia Gov. Gavin Newsom also might seek the Democratic Party's nomination for the presidency in 2028.\n\nOther potential Democratic Party candidates include Rep. Alexandria Ocasio-Cortez of New York and former Transportation Secretary Pete Buttigieg.\n\nHarris in February accepted the NAACP's Chairman Award.","summary":"Former Vice President Kamala Harris will not seek the governorship of California in 2026 but might run for president in 2028 after helping other Democrats.","url":"https://www.upi.com/Top_News/US/2025/07/30/kamala-harris-california-governor/8291753915400/","image":"https://cdnph.upi.com/sv/ph/og/upi/8291753915400/2025/1/7613a4ab60b70c8fccfc18b28f33a9d1/v1.5/Harris-halts-gubernatorial-talk-spurs-speculation-on-run-for-White-House.jpg","video":null,"publish_date":"2025-07-30 23:09:20","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.168},{"id":346759564,"title":"The Will Cain Show - Wednesday, July 30","text":"to top close Video This video is playing in picture-in-picture.\n\n Your Preview Pass expires in 00:00 Don't have a TV subscription?\n\nFull Episode July 30, 2025 44:39 \n FULL EPISODE\n\n EXP 7 DAYS\n The Will Cain Show - Wednesday, July 30 \n Donald Trump, Economy, Kamala Harris \n Tags MOST RECENT EPISODES | VIDEOSTHE WILL CAIN SHOW | FULL EPISODES","summary":"Donald Trump, Economy, Kamala Harris","url":"https://www.foxnews.com/video/6376350918112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/990505083001/6ccfc28e-51c6-4f75-a8c3-de848d06aef5/8134e1c6-1283-413b-b1f3-d83146ee2f27/1280x720/match/1024/512/image.jpg?pubId=694940094001?ve=1&tl=1","video":null,"publish_date":"2025-07-30 23:02:35","author":null,"language":"en","source_country":"us","sentiment":-0.535},{"id":346756406,"title":"Celsius Cans Spiked With Vodka? High Noon’s Surprising Recall Explained","text":"High Noon has issued a nationwide recall after finding that some of its vodka seltzer drinks were mistakenly packaged in Celsius energy drink cans. According to a notice on the US Food and Drug Administration (FDA) website, some Celsius Astro Vibe Sparkling Blue Razz Edition cans were found inside High Noon’s Beach Variety 12-packs. The error happened due to a mix-up by a packaging supplier, who accidentally sent Celsius-branded cans to High Noon’s facility. This mistake could mean that some people might unknowingly consume alcohol, which can be risky for children, those with medical conditions, or individuals who avoid alcohol for religious reasons. So far, no injuries or health issues have been reported. The recalled products were shipped in late July to stores and distributors in several states, including Florida, Michigan, New York, Ohio, Oklahoma, South Carolina, Virginia, and Wisconsin, reported CNBC. High Noon is asking customers to throw away any Celsius-labeled cans that they find in their Beach Variety packs. The company is offering refunds and has provided a way for people to contact them for help. Also Read: Kamala Harris Says No To California Governor Bid — All In On 2028? High Noon, which is owned by E. & J. Gallo Winery, is one of the fastest-growing alcoholic seltzer brands in the US. It is known for its fruit-flavored vodka drinks which are sold in variety packs. Customers who think that they may have purchased the affected product are urged to check their packs carefully and reach out to the company in case of any concerns. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"High Noon is recalling some of its vodka seltzer drinks after a packaging error led to alcohol being placed in Celsius energy drink cans. The mislabeled cans were found in certain Beach Variety 12-packs sold across multiple states. The mistake could lead to accidental alcohol consumption, raising health and safety concerns.","url":"https://www.timesnownews.com/world/us/us-news/celsius-cans-spiked-with-vodka-high-noons-surprising-recall-explained-article-152377573","image":"https://images.timesnownews.com/thumb/msid-152377634,thumbsize-1005139,width-1280,height-720,resizemode-75/152377634.jpg","video":null,"publish_date":"2025-07-30 22:45:10","author":"Saihaj Madan","authors":["Saihaj Madan"],"language":"en","source_country":"in","sentiment":-0.238},{"id":346760066,"title":"Foo Fighters’ New Drummer Revealed (Exclusive)","text":"Skip to main content\n\nJuly 30, 2025 3:44pm\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nDave Grohl of Foo Fighters performs onstage during Harley-Davidson's Homecoming Festival - Day 2 at Veterans Park on July 15, 2023 in Milwaukee, Wisconsin.\n\nDaniel Boczarski/Getty Images\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nThe Foo Fighters have found their next drummer, as the rock band has tapped Ilan Rubin for the gig, sources confirm to The Hollywood Reporter.\n\nRubin is best known for his work with Nine Inch Nails, where he’s served as the band’s touring drummer since 2009 and was inducted into the Rock & Roll Hall of Fame with the band in 2020, becoming the youngest-ever inductee at the time at 32 years old. He’s also the drummer for Angels & Airwaves and has worked with Danny Elfman as well.\n\nThe move comes just over two months after Foo Fighters parted ways with drummer Josh Freese, who joined the group in 2023 as successor to the late Taylor Hawkins, who died in 2022.\n\nRelated Stories\n\nJess Glynne Criticizes White House for Using Viral Jet2 Holiday Sound in Deportation Meme: \"Makes Me Sick\" \n\nAvex Music Group and S10 Report Early 2025 Chart Successes\n\nNotably, as Rubin joins the Foos, THR has learned that Freese will return to Nine Inch Nails, which a rep for the band has confirmed. The band subsequently shared a picture of Freese and tagged the drummer in an Instagram story, writing “let’s fucking go.”\n\nIt’s unclear at press time whether Rubin joins Foo Fighters as a full-time member or as a touring drummer for the band. According to a source, Rubin had committed to Nine Inch Nails through this year and informed band frontman Trent Reznor last week that he had “accepted a job with another band.” A rep for the Foo Fighters declined to comment.\n\nThe switch up comes just a week before Nine Inch Nails are slated to start the North American leg of their Peel it Back tour in Oakland at the Oakland Arena on August 6. The band started that tour with a 15-date European leg back in June. The tour is slated to be one of the biggest of the year, with Nails all but selling out most of their two-dozen arena dates months before the tour’s start. Beyond the tour itself, Nine Inch Nails are also behind the soundtrack for the upcoming Tron: Ares, the first time the band is being credited as the composers on a film rather than individual members Reznor and Atticus Ross.\n\nFreese confirmed his split from the Foo Fighters on his Instagram in May, writing that the band had decided “to go in a different direction with their drummer,” adding that ” I’m not angry-just a bit shocked and disappointed.”\n\nIt’ll be a reunion for Freese, who was the Nails’ live drummer from 2005 to 2008. In a 2021 podcast interview with Dean Delray, Freese said he’d left Nails because he and his wife had two young boys at home and he “needed to just go home and be a dad for a while.” Rubin went on to succeed Freese in that band and is himself a dad to one with another on the way.\n\nThe Foo Fighters will play their first shows in a year starting in Jakarta, Indonesia on October 2, followed by dates in Singapore, Tokyo and Osaka later that month. They’ll play a show in Mexico City on November 14 as well.\n\nThe group released “Today’s Song,” their first new music since 2023, earlier this month to celebrate their 30th anniversary, with Grohl sharing an extensive letter with fans recalling the “moments of unbridled joy, and moments of devastating heartbreak” the band has faced over the years. He paid tribute to Hawkins, writing that “you are still in everything we do, everywhere we go, forever,” and he thanked Freese for his service with the band, writing that without “the thunderous wizardry of Josh Freese, this story would be incomplete.”\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nJess Glynne Criticizes White House for Using Viral Jet2 Holiday Sound in Deportation Meme: “Makes Me Sick” \n\nStormy Daniels\n\nFrom Martha to Diddy, Trial Sketch Artist Draws History Live From the Courtroom\n\nFormer Vice President Kamala Harris Says She Will Not Run for California Governor in 2026\n\nAvex Music Group and S10 Report Early 2025 Chart Successes\n\nRambling Reporter\n\nVegas Oddsmakers Say Aaron Taylor-Johnson Will Be the Next James Bond. Don’t Bet on It.\n\nRob Thomas Talks Happiness, New Solo Album, Ryan Gosling Duet Hopes and the Dreamy Ballad Inspired by Shania Twain\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"Ilan Rubin replaces Josh Freese, who was let go from the band back in May. But there’s a twist.","url":"https://www.hollywoodreporter.com/news/music-news/foo-fighters-new-drummer-replacing-josh-freese-1236333764/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/07/GettyImages-1547234981-1.jpg","video":null,"publish_date":"2025-07-30 22:44:46","author":"Ethan Millman","authors":["Ethan Millman"],"language":"en","source_country":"us","sentiment":0.461},{"id":346759454,"title":"Wes Moore blasts 2028 speculation, says Democrats ‘gave up’ on voters in 2024","text":"“I think that anybody who’s talking about 2028 is not taking 2025 very seriously,” Moore said. “Anyone spending their time and energy building an infrastructure for 2028, I think, is almost disqualifiable because it means you’re not taking this moment seriously.”\n\nMoore’s remarks come as speculation about his own political future continues to grow. The first-term Maryland governor is already drawing early buzz from high-profile figures and media outlets as a potential 2028 presidential contender.\n\nDespite Moore’s refusal to entertain 2028 talk, several prominent voices within the party and beyond have begun to elevate his name.\n\nActor and longtime Democratic activist George Clooney recently described Moore as “levitating above the fray,” praising his intelligence, military service, and executive leadership. \n\nFormer NBA star Charles Barkley also weighed in, telling TheGrio that if the Democratic Party does not nominate Wes Moore or Pennsylvania Gov. Josh Shapiro (D-PA), he “would not even consider voting for anybody else” in the 2028 primary.\n\nStill, Moore is adamant that now is not the time for 2028 chatter.\n\n“You are obviously not paying attention to what this man [Trump] is doing to our communities,” he said. “You’re not paying attention to the fact that we have a president of the United States who is literally attacking our history.”\n\nIn the podcast conversation, Moore sharply criticized the Democratic Party’s 2024 campaign approach, saying it wrongly prioritized a few swing states at the expense of national engagement.\n\n“It feels like there are certain areas and communities that we almost seemingly just gave up on,” Moore said. “We stopped competing. We stopped making the case.”\n\nHe warned that this narrow focus alienated core parts of the Democratic base, particularly communities of color and working-class voters.\n\n“Do you know who hears ‘this is only going to come down to three states’? The other 47,” he said. “They feel like they don’t even matter.”\n\nMoore emphasized that black men, in particular, have felt neglected, not only by Democratic messaging but by alleged structural inequities that the party has failed to address.\n\n“We have a justice system that has been targeting and weighing against black men. We have an education system that criminalizes and punishes black boys. And we blame them for their failure, not the system,” Moore said.\n\nThroughout the interview, Moore underscored that politics must be grounded in service, not calculation.\n\n“This is not game theory. This is not checkers,” he said. “These are real lives.”\n\nHe cautioned Democrats against treating elections like a numbers game, reiterating the need for values-based leadership rooted in equity and inclusion.\n\n“If you’re spending time focusing on 2028, to me, you’re disqualified because you’re not taking 2025 seriously.”\n\nMoore, 46, is Maryland’s first black governor, a former Army captain, Rhodes Scholar, and nonprofit organization executive. He rose to national prominence with a sweeping legislative agenda and his high-profile leadership during the 2024 campaign, where he served as a key surrogate for Vice President Kamala Harris.\n\nThough Moore has made clear he is not running for president in 2028, interest in him continues to mount, fueled not just by party insiders but also by celebrities, strategists, and voters looking for new leadership.\n\nMoore insists his focus is squarely on Maryland and the urgent need to confront Trump’s return to power.\n\n“We see you,” Moore told Harrison. “If you weren’t on the field in 2024, you shouldn’t be leading in 2028.”","summary":"Gov. Wes Moore (D-MD) addressed fellow Democrats this week, arguing that anyone already eyeing the 2028 presidential race is “disqualifiable” and out of touch with perceived urgent threats facing the country under President Donald Trump’s second term. Moore also critiqued the Democratic Party’s 2024 campaign strategy while speaking with former DNC Chair Jaime Harrison on [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3486910/wes-moore-2028-speculation-democrats-gave-up-on-voters/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/Wes-Moore-2.webp","video":null,"publish_date":"2025-07-30 22:30:37","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","category":"politics","source_country":"US","sentiment":-0.154},{"id":346758890,"title":"California Governor Race: Leading Candidates as Kamala Harris Opts Out","text":"Former Vice President Kamala Harris' decision to pass on the California gubernatorial race sets up a competitive primary for the plethora of candidates already vying for the state's top seat.Why It MattersHarris announced on Wednesday she is not running for governor in the 2026 election to replace California Governor Gavin Newsom, who cannot run again due to term limits. Harris enjoyed an early polling lead in the race, and some Democrats speculated that if she chose to run, others would have exited the race, deciding not to compete against her.The announcement leaves the field open for other Democrats, many of whom are already working to build up statewide name recognition in the expansive—and expensive—state.What to KnowHarris wrote in a statement Wednesday that she has \"given serious thought to asking the people of California for the privilege to serve as their governor\" but decided she will \"not run for Governor in this election.\"\"For now, my leadership—and public service—will not be in elected office,\" Harris added. \"I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead of my own plans.\"With Harris out of the race, other Democrats will spend the coming months working to win over the sizable number of primary voters who intended to support her if she chose to run. Her supporters make up a sizable group of the electorate, as she led each of the polls that included her.Notably, California uses a jungle primary system, where all candidates, regardless of political party, run on a single ballot for the primary. The two candidates with the most support advance to the general election.A Capitol Weekly poll of the race from February showed Harris favored by 23 percent of respondents. Republican John Cox, who has not said he's running, followed at 21 percent, and former U.S. Representative Katie Porter, a Democrat who represented parts of Orange County from 2019 to 2025, placed third with 16 percent.However, when asked about the ballot without Harris, Porter held a lead over other candidates with 26 percent. Cox followed with 21 percent.Democrat Rick Caruso had 8 percent support (though he has not formally announced a campaign), while former U.S. Health and Human Services Secretary Xavier Becerra and current California Lieutenant Governor Eleni Kounalakis each garnered 5 percent support.Former state Assembly Speaker Antonio Villaraigosa, ex-state Controller Betty Yee and former state Senator and Assembly Speaker Toni Atkins each had 3 percent support in that poll, which surveyed 692 registered voters from February 3 to February 7.A recent Emerson College poll also asked voters about who they plan to vote for, though the survey did not include Republicans.When Harris was included, she led the pack with 31 percent.However, when Harris was not included, Porter led with 12 percent, while Villaraigosa followed with 5 percent. Republican Chad Bianco gained 4 percent, and Becerra, Kounalakis and Yee had support from 3 percent of voters apiece. It surveyed 911 likely voters from April 12 to April 14 and had a margin of error of plus or minus 3 percentage points.Regardless of who wins the primary, Democrats are viewed as the favorite for the general election, as California is a reliably blue state. In the November presidential election, Harris carried her home state by more than 20 points, with more than 58 percent of the vote share in her unsuccessful battle for the White House against President Donald Trump.What People Are SayingPorter wrote in a post to X: \"@KamalaHarris is a principled leader and I'm proud of the work we accomplished together on consumer protection during the housing crisis and grateful for her service to California and our country. I look forward to seeing her next accomplishments and continuing our work together.\"Villaraigosa wrote in a statement: \"I have deep respect for Vice President Kamala Harris and her decades of leadership and public service to the people of California and our nation. Her decision not to enter the race for governor reflects her continued commitment to serving at the highest levels of government, and I know she will continue to be a powerful voice for justice, equality, and opportunity.\"Atkins wrote in a statement: \"From day one, this campaign has been about California's future — tackling rising costs, defending our freedoms, and standing up for communities too often left behind. Vice President Harris has made her decision, and I thank her for her decades of service to our state and country.\"Democratic strategist Michael Trujillo wrote to X: \"Former Vice President Kamala Harris announcing later today she's not running for CA Governor will make history in the number of cascading dominos this will have across CA in terms of candidates futures, lower statewide races impacted etc. Her exit is the full employment political operative Act because of the number of candidates for CA GOV that will be running for this office.\"What Happens NextWhether other candidates later jump into the race and join a crowded primary field after Harris' announcement remains to be seen. The Cook Political Report and Sabato's Crystal Ball both classify the race as being safely Democratic, meaning it's not viewed as competitive at this point.Harris' announcement fueled speculation that she could again run for president in 2028 in what is also likely to be a competitive Democratic primary against potential high-profile candidates like Newsom and former Transportation Secretary Pete Buttigieg.","summary":"Harris' decision not to run for governor leaves open a crowded primary ahead of the 2026 midterms.","url":"https://www.newsweek.com/california-governor-race-kamala-harris-opts-out-2106676","image":"https://d.newsweek.com/en/full/2693546/california-governor-update-kamala-harris-opts-out.png?w=1600&h=900&q=88&f=c2d36f35e7e74120ca7beb85da838b6e","video":null,"publish_date":"2025-07-30 22:07:53","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":0.147},{"id":346763074,"title":"What Kamala Harris’s Decision for Governor Means for 2028","text":"Kamala Harris’s decision not to run for governor of California leaves open the door to a presidential campaign in 2028, even as her fellow Democrats are months into preparing for a future without her.\n\nThe ambitious governors, senators and former Biden administration officials who are already traveling the country, taping podcasts and building infrastructure for national campaigns have been aiming to put Ms. Harris and former President Joseph R. Biden Jr. in their collective rearview mirror.\n\nAnd while Ms. Harris, as the former vice president, would enter the 2028 presidential primary as the most recognizable Democrat with the broadest fund-raising network, she would also carry the baggage of a 2024 campaign that Democrats do not view with much fondness.\n\nAt 60, she is certainly young enough to run again — and more than two decades younger than the president she served. But for a party seeking a reset after President Trump won for a second time, and figuring out how to win back trust with working-class voters, she would be anything but a fresh face.","summary":"A Harris ally says “all options are on the table” but cautions against reading too much into the former vice president’s choice to skip the California governor race.","url":"https://www.nytimes.com/2025/07/30/us/politics/kamala-harris-2028-democrats.html","image":"https://static01.nyt.com/images/2025/07/30/multimedia/30pol-harris1-fkjb/30pol-harris1-fkjb-videoSixteenByNineJumbo1600.jpg","video":null,"publish_date":"2025-07-30 21:52:35","author":"Shane Goldmacher","authors":["Shane Goldmacher"],"language":"en","category":"politics","source_country":"us","sentiment":-0.235},{"id":346745374,"title":"WATCH:  Kamala Harris says she won't run for governor of California in 2026","text":"ABC News Live\n\nNTSB holds hearing on January's DC midair collision\n\nTracking continued dangerous heat and humidity across much of the eastern half of the U.S.; timing the cool down; flood threats for today and tomorrow for multiple areas\n\nSenate considers Pres. Trump executive nominations","summary":"Former Vice President Kamala Harris announced Wednesday that she won’t run for California governor in 2026.","url":"https://abcnews.go.com/Politics/video/kamala-harris-run-governor-california-2026-124219830","image":"https://i.abcnewsfe.com/a/f61fb129-aee8-434a-8b04-731bfd78f2cf/250730_abc_social_kamala_gov_hpMain_9x16.jpg?w=992","video":null,"publish_date":"2025-07-30 21:50:17","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.428},{"id":346759460,"title":"With Harris out, which Democrats are left standing for California governor bid?","text":"Here are the top contenders to replace Newsom, with Harris now out of the picture.\n\nKatie Porter\n\nFormer Democratic Rep. Katie Porter entered the race on March 11 and is the front-runner. She was elected in 2018 to represent a district historically represented by Republicans. She was a vocal, anti-Trump voice during her time in Congress.\n\nPorter opted to run for Senate during the 2024 elections and lost in the Democratic primary to Sen. Adam Schiff, who went on to beat Steve Garvey in the general election.\n\nEarlier in her career, Porter was appointed by then-Attorney General Harris in 2012 as California’s independent monitor of a $25 billion national mortgage settlement.\n\nWith Harris as the previous polling favorite, Porter was the second most popular Democrat in the polls.\n\nXavier Becerra\n\nFormer Health and Human Services Secretary Xavier Becerra launched his campaign in April. He has over 30 years of experience representing California, serving in a district representing neighborhoods around Downtown Los Angeles from 1993 through 2017. He was also chairman of the House Democratic Caucus.\n\nIn 2017, then-Gov. Jerry Brown chose him to replace Kamala Harris as California’s attorney general after she was elected to the Senate. He became HHS secretary in March 2021 and held the position for the rest of Joe Biden’s presidency.\n\nFollowing Harris’s announcement that she wouldn’t run, Becerra appeared to link himself to her, saying he was “proud of our shared record.” This move isn’t surprising, given that Harris polled 57% among California Democrats.\n\nEleni Kounalakis\n\nLt. Gov. Eleni Kounalakis was elected to her current position after a grassroots campaign that saw her visit all of California’s 58 counties. As California’s No. 2, Kounalakis has gone so far to prove her progressive stances that she’s often gone ahead of Newsom, even going against him in asking California Secretary of State Shirley Weber to exclude Trump from the state’s 2024 primary.\n\nKounalakis launched her bid for governor over three years before Election Day, announcing in April 2023.\n\nKonalakis also praised Harris after her announcement to leave the race.\n\nAntonio Villaraigosa\n\nAntonio Villaraigosa served as Los Angeles mayor from 2005 to 2013 and has since spent his time in advocacy. He experienced a blistering loss in the 2018 gubernatorial election, coming in third place, but is now hoping for another shot.\n\nKATIE PORTER STUCK IN WAITING GAME IN CALIFORNIA GOVERNOR’S RACE\n\nVillaraigosa has catered much of his message toward affordability and economic growth.\n\nLike the other candidates, Villaraigosa praised Harris’s decision not to run for governor.","summary":"After former Vice President Kamala Harris announced on Wednesday that she wouldn&#8217;t run for California governor, the field opened up for various candidates. California will elect a new governor in 2026, as incumbent Gov. Gavin Newsom (D-CA) will be termed out. In such a deep blue state, the winner of the Democratic primary is nearly [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3486776/with-harris-out-which-democrats-are-left-standing-for-california-governor-bid/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Porter.webp","video":null,"publish_date":"2025-07-30 21:47:56","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":0.017},{"id":346759464,"title":"Kamala Harris ally Katy Perry dines with Justin Trudeau in Montreal, stirring speculation","text":"KatyPerry is saying \"bon appétit\" to #JustinTrudeau … as the pair was seen chowing down at a swanky restaurant in Montreal.#Exclusive video at the 🔗HERE: https://t.co/5zuWZzOdMc pic.twitter.com/E30ll0cflJ— TMZ (@TMZ) July 29, 2025\n\nPerry, who recently split from longtime partner Orlando Bloom, has long been a vocal supporter of former Vice President Kamala Harris. She performed during Harris’s 2024 presidential campaign at a star-studded Philadelphia rally alongside Oprah Winfrey, Lady Gaga, and Jon Bon Jovi. She has called Harris a “protector of the future” and posted photos with Harris and former second gentleman Doug Emhoff, alongside then-partner Bloom, during the campaign’s final stretch.\n\nPerry’s 2024 election activism unexpectedly crossed paths with her ex-husband, comedian and podcast host Russell Brand, who has emerged as a supporter of President Donald Trump. The pair were married for just over a year, from October 2010 to December 2011. In a June 2024 episode of his podcast Stay Free with Russell Brand, he told RNC spokeswoman Elizabeth Pipko he couldn’t understand how any “freedom-loving American” would choose President Joe Biden over Trump.\n\nTrudeau, meanwhile, stepped down after nearly a decade as Canada’s prime minister, following a sharp decline in public support and internal party pressure. He was replaced in March by Mark Carney, who has sought to distance himself from Trudeau-era policies amid rising tensions with the U.S. under returning President Donald Trump.\n\nThe timing of Trudeau’s dinner with Perry adds intrigue, as both figures remain active in international cultural and political circles.\n\n View this post on Instagram \n\nTrudeau and Trump have had a publicly contentious relationship, including Trump’s infamous suggestion during a December 2024 Mar-a-Lago meeting that Canada become the “51st state” if it couldn’t survive without U.S. trade deals. \n\nTrudeau was caught on a hot mic weeks later calling Trump’s annexation talk “a real thing,” citing American interest in Canada’s critical minerals.\n\nPerry, for her part, made headlines in April after joining an all-female crew on Jeff Bezos’s Blue Origin spaceflight. She described the mission as “a journey of unity,” emphasizing the symbolic value of women leading in space exploration. However, the flight became a flashpoint in culture wars when Transportation Secretary Sean Duffy publicly disputed their right to be called “astronauts.”\n\nKaty Perry says that their rocket launch is “uniting” the whole country.. Lmaoo. 🤦‍♂️🤦‍♂️ pic.twitter.com/9StJAOOOG8— American AF 🇺🇸 (@iAnonPatriot) April 15, 2025\n\nResponding to a Blue Origin X post that referred to the participants as the “astronaut crew,” Duffy wrote: “You cannot identify as an astronaut. They do not meet the FAA astronaut criteria.”\n\nHe referenced the FAA’s guidelines under the Commercial Space Astronaut Wings Program. He called the mission “inspiring,” but emphasized that “brave and glam” passengers do not make “astronauts.”\n\nThe trip reportedly caused tension with Bloom, who allegedly called the mission “cringeworthy.” Their relationship ended soon after, with Bloom attending Bezos and Lauren Sánchez’s Italy wedding alone. Perry, despite her close friendship with Sánchez, was notably absent.\n\nStill, any rumors of a falling-out with Sánchez appear to be unfounded. \n\nIn July, just weeks after the Bezos wedding, Sánchez and Perry were spotted together in Paris during Couture Week. They were later photographed enjoying lunch together at upscale Parisian bistro L’Avenue, joined briefly by Kim Kardashian.\n\nNow back on tour with stops across Canada, Perry’s Montreal dinner with Trudeau comes when both publicly navigate personal transitions. Trudeau’s separation from ex-wife Sophie Grégoire was announced in 2023, and Perry’s split from Bloom has remained a subject of tabloid intrigue.\n\nWhile there’s no confirmed romance between the two, their meeting has brought together overlapping threads of celebrity, diplomacy, and political power.","summary":"Pop superstar Katy Perry and former Canadian Prime Minister Justin Trudeau were spotted having dinner together at a Montreal fine-dining restaurant Monday night, prompting speculation about a potential connection between the politically engaged public figures. The dinner, confirmed by staff at Le Violon restaurant and first reported by TMZ, lasted around two hours. Though no [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3486567/kamala-harris-ally-katy-perry-dines-with-justin-trudeau-in-montreal-stirring-speculation/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/Katy-Perry-Trudeau.webp","video":null,"publish_date":"2025-07-30 21:35:44","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","source_country":"US","sentiment":0.032},{"id":346740836,"title":"Barabak: By scrapping bid for California governor, Harris boosts White House prospects -- if she runs","text":"By closing one door, Kamala Harris has left another ajar. Running for California governor in 2026, which she ruled out Wednesday, would almost certainly have precluded another run for the White House in 2028 — something Harris explicitly did not rule out. There were significant hurdles to attempting both. To have any chance of being governor, Harris would have almost certainly had to have sworn off another presidential bid, convincing California voters that the state's top political job was not something she viewed, blithely, as a mere placeholder or springboard to the White House. There also would have been the practical difficulty of running the nation's most populous state, a maw of endless crises and challenges, while at the same time pursuing the presidency. No California governor has ever done so successfully, though several tried. Harris' much-anticipated decision, announced in a written statement, was not a huge surprise. Unlike others — Pete Wilson, Gray Davis, Arnold Schwarzenegger, to name a few — Harris has never burned with a fever to be California governor. She had a clear shot at the position in 2016, but opted instead to run for the U.S. Senate, in part because the role seemed like a better launching venue for a try at the White House. Privately, several of those closest to Harris questioned whether she had much appetite to deal with the myriad aggravations of being governor — the stroking and hand-holding of recalcitrant lawmakers, the mind-numbing drafting of an annual budget, the endless march of disasters, both natural and man-made. Not least, many wondered whether Harris would be content returning to the small stage of Sacramento after traveling the world as vice president and working in the rarified air of politics at its peak. There is every possibility that Harris will retire from public life. Sean Clegg, a long-time Harris adviser, noted the Democrat has spent more than two decades in elected office. \"I think she’s interested in exploring how she can have an impact from the outside for a while,” Clegg said. For her part, Harris said she looked forward \"to getting back out and listening to the American people [and] helping Democrats across the nation who will fight fearlessly.\" Doesn't sound like life in a cloister. If Harris did run for president, she'd start out as a nominal front-runner, based on her universal name recognition and deep nationwide fund-raising base — advantages no other contestant could match. But she won't scare away very many opponents; the Democratic field in 2028 will most likely be a large and expansive one, as it was the first time Harris ran for president in 2020. (And notably crashed and burned.) Charlie Cook, who has spend decades as a nonpartisan political handicapper, said he would view Harris \"as a serious contender, but no more so than a handful of other people would be.\" Normally, Cook went on, her status as the party's most recent vice president would give her a significant, if not overwhelming, edge. \"But I think the desire/need to turn the corner and get some separation from Biden probably strips away any advantage that she would have,\" Cook said. Harris got a small taste of the Biden burden she could carry in the 2028 campaign when two of her prospective gubernatorial rivals — former Los Angeles Mayor Antonio Villaraigosa and former Health and Human Services Secretary Xavier Becerra — suggested she was complicit in covering up Biden's mental and physical frailties. “She could say she didn’t know,” Villaraigosa taunted in a May interview. “They can’t prove that she did. But last time I looked, she had lunch with him pretty regularly ... She had to have seen what the world [saw] over time and particularly in that debate. The notion that she didn’t? Come on. Who’s going to buy that?” A strategist for one potential presidential rival suggested Democrats were eager to turn the page on Biden and, along with him, Harris. \"There's a lot of respect for her taking on the challenge of cleaning up Biden's mess in 2024,\" said the strategist, who asked to remain nameless to avoid compromising an as-yet-unannounced candidate. \"But I think it's going to be a hard sell. She lost to Donald Trump who was convicted of 34 felony counts and run out of D.C. in shame. There is some blame there for his return.\" Should Harris make a third try for the White House, it raises the intriguing possibility of facing her fellow Californian, Gov. Gavin Newsom, who has been effectively running for president for the past several months. The two, who came up together in the elbows-out world of San Francisco politics, have had a decades-long rivalry, sharing many of the same donors and, once upon a time, the same set of strategists. If the two ran, it would be the first time since 1968 that a pair of major Californians faced off for their party's presidential nomination. That year, Gov. Ronald Reagan made a late, failed attempt to overtake Richard Nixon, the former vice president and U.S. senator from California. At it happened, Nixon had waged an unsuccessful 1962 run for California governor after leaving the White House. While that failure didn't stop him from eventually winning the White House, it certainly didn't help. In fact, Nixon left California and moved to the East Coast, taking a job at a white-shoe law firm and using New York City as his political base of operations. Harris' announcement Wednesday promised \"more details in the months ahead about my own plans.\" She said nothing about relocating or leaving California behind.","summary":"It would have been difficult, if not impossible, for Harris to be elected governor without ruling out a 2028 run for president. If she seeks the White House, she'd be the Democrats' shaky front-runner.","url":"https://www.latimes.com/politics/story/2025-07-30/kamala-harris-california-governor-white-house-2028-analysis","image":"https://ca-times.brightspotcdn.com/dims4/default/fe047d9/2147483647/strip/false/crop/5108x3447+0+0/resize/1486x1003!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6d%2Fed%2Fd8e03d2143aa831eeb5af9264db3%2Fhttps-delivery-getty","video":null,"publish_date":"2025-07-30 21:19:37","author":"Mark Z. Barabak","authors":["Mark Z. Barabak"],"language":"en","category":"politics","source_country":"us","sentiment":-0.153},{"id":346763660,"title":"Thursday Briefing: Trump’s Steep Tariffs on Brazil","text":"Tsunami: A magnitude 8.8 earthquake near Russia, one of the largest on record, caused coastal surges across the Pacific Ocean but relatively little damage. Here’s why.\n\nTravel: All departing flights out of two of London’s largest airports, Heathrow and Gatwick, were briefly grounded yesterday because of a radar problem.\n\nU.S.: Kamala Harris, the former vice president, announced that she had decided not to run for California governor.\n\nAfrica: Eight people were reported dead after Ugandan soldiers attacked troops in South Sudan, long considered their allies.\n\nCanada: Health authorities have recorded more than 4,200 cases of measles this year, far more than most Western nations.\n\nTaiwan: The Trump administration, focused on delicate talks with China, told President Lai Ching-te to cancel a planned stop in New York.\n\nSpace: NASA’s new radar mission launched from India. Here’s what it will do.\n\nSoutheast Asia: Even after a cease-fire, Cambodia and Thailand’s dispute over ancient temples on their border is unresolved.\n\nCelebrities: The U.S. and Canada are buzzing after Katy Perry met Justin Trudeau for dinner in Montreal.","summary":"Plus, the future of Mexican music.","url":"https://www.nytimes.com/2025/07/30/briefing/trump-tariffs-brazil-india-palestine.html","image":"https://static01.nyt.com/images/2025/07/30/multimedia/31ambriefing-asia-nl-lede/31ambriefing-asia-nl-lede-videoSixteenByNineJumbo1600.jpg","video":null,"publish_date":"2025-07-30 21:19:04","author":"Daniel E. Slotnik","authors":["Daniel E. Slotnik"],"language":"en","source_country":"us","sentiment":-0.164},{"id":346758628,"title":"High Noon recalls vodka seltzers that were mistakenly labeled as Celsius energy drinks in multiple states","text":"High Noon recalls: High Noon, a popular alcoholic beverage brand, has issued a nationwide product recall due to a labeling error that resulted in vodka seltzers being packed in cans intended for Celsius energy drinks. The confusion has sparked concerns about unintentional alcohol consumption. No illnesses have been reported, but consumers are urged to check their cans right away.The mislabeled drinks, which are sold in eight states, have the potential to lead to accidental alcohol consumption. What triggered the High Noon recall?The error occurred when a shared packaging supplier sent High Noon empty Celsius cans, which were later filled and added to the variety packs.According to a post on the US Food and Drug Administration's website, High Noon declared a recall of vodka seltzer drinks that it claims were mistakenly marketed as Celsius energy drinks, as per a report by Bloomberg.Live Events\"Unintentional alcohol ingestion will occur if the liquid in these cans is consumed,\" the company stated. As of right now, no illnesses or adverse events have been linked to this recall.Following the unintentional filling of certain Celsius Astro Vibe sparkling blue razz cans with High Noon vodka seltzer, High Noon, which is owned by E&J Gallo Winery, recalled its Beach Variety 12-packs.ALSO READ: Kamala Harris confirms she won’t run for California Governor in 2026, eyes new national role- here's what she plans to do instead The recall concerns two production lots of High Noon Beach Variety packs in which vodka seltzer was inadvertently put into cans of Celsius Astro Vibe sparkling blue razz drinks with a silver top.In an email, a Gallo representative stated that the voluntary recall was the result of \"a labeling error from our can supplier\" and that the company was proactively managing the recall in collaboration with the FDA, retailers, and distributors.How can consumers identify the mislabeled cans?By mistake, empty Celsius cans were sent to a facility in High Noon. Celsius Astro Vibe Sparkling Blue Razz is one of the impacted beverages. The tops of the vodka-filled cans are silver rather than black.The error resulted from a packaging mix-up. Consumers should check lot codes and properly dispose of affected products.ALSO READ: Aimee Osbourne makes a rare appearance at Ozzy Osbourne’s Funeral, honouring a quiet legacyWhich states and products are affected?Lot codes L CCC 17JL25 14:0 to L CCC 17JL25 23:59 and L CCC 18JL25 00:00 to L CCC 18JL25 03:00 are impacted by High Noon beach variety packs, a sper a report by NewsNation.Between July 21 and July 23, the packs were shipped to retailers in Florida, Michigan, New York, Ohio, Oklahoma, South Carolina, Virginia, and Wisconsin.Before consuming Celsius Astro Vibe sparkling blue razz drinks from cans that were not included in the variety pack, consumers are urged to confirm that the cans are not from lot codes L CCB 02JL25 2:55 to L CCB 02JL25 3:11.What should I do if I have an infected can?Customers should dispose of their products without drinking if they have items in the impacted lot codes. Celsius is collaborating with High Noon and parent company Gallo to recall the drinks; it was not involved in the mislabeling incident.Contact consumerrelations@highnoonvodka.com if you have the impacted drinks and would like a refund or have any questions, reported NewsNation.There have been no reported adverse events or illnesses related to the recall.FAQsWhat should I do if I have an infected can?Check the lot code. If it matches the recall, discard the can and contact High Noon for assistance.Is Celsius to blame for the mixup?No, the error occurred at High Noon's facility as a result of mislabeled cans from a common packaging supplier.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onhigh noon recallhigh nooncelsius recallcelsius drinkcelsiushigh noon celsiuscelsius energy drink\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onhigh noon recallhigh nooncelsius recallcelsius drinkcelsiushigh noon celsiuscelsius energy drink(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"High noon celsius energy drink recall: High Noon issued a nationwide recall of its Beach Variety 12-packs due to a labeling error. Vodka seltzers were mistakenly packaged in Celsius energy drink cans, potentially leading to unintentional alcohol consumption. The affected products were shipped to retailers in eight states, and consumers are urged to check lot codes and dispose of mislabeled cans.","url":"https://economictimes.indiatimes.com/news/international/us/high-noon-recalls-vodka-seltzers-that-were-mistakenly-labeled-as-celsius-energy-drinks-in-multiple-states/articleshow/123005648.cms","image":"https://img.etimg.com/photo/65498029.cms","video":null,"publish_date":"2025-07-30 21:12:53","author":"High Noon","authors":["High Noon"],"language":"en","source_country":"in","sentiment":-0.356},{"id":346738010,"title":"High Noon recalls vodka seltzers mistakenly labeled as energy drinks in multiple states","text":"High Noon recalls: High Noon, a popular alcoholic beverage brand, has issued a nationwide product recall due to a labeling error that resulted in vodka seltzers being packed in cans intended for Celsius energy drinks. The confusion has sparked concerns about unintentional alcohol consumption. No illnesses have been reported, but consumers are urged to check their cans right away.The mislabeled drinks, which are sold in eight states, have the potential to lead to accidental alcohol consumption. What triggered the High Noon recall?The error occurred when a shared packaging supplier sent High Noon empty Celsius cans, which were later filled and added to the variety packs.According to a post on the US Food and Drug Administration's website, High Noon declared a recall of vodka seltzer drinks that it claims were mistakenly marketed as Celsius energy drinks, as per a report by Bloomberg.Live Events\"Unintentional alcohol ingestion will occur if the liquid in these cans is consumed,\" the company stated. As of right now, no illnesses or adverse events have been linked to this recall.Following the unintentional filling of certain Celsius Astro Vibe sparkling blue razz cans with High Noon vodka seltzer, High Noon, which is owned by E&J Gallo Winery, recalled its Beach Variety 12-packs.ALSO READ: Kamala Harris confirms she won’t run for California Governor in 2026, eyes new national role- here's what she plans to do instead The recall concerns two production lots of High Noon Beach Variety packs in which vodka seltzer was inadvertently put into cans of Celsius Astro Vibe sparkling blue razz drinks with a silver top.In an email, a Gallo representative stated that the voluntary recall was the result of \"a labeling error from our can supplier\" and that the company was proactively managing the recall in collaboration with the FDA, retailers, and distributors.How can consumers identify the mislabeled cans?By mistake, empty Celsius cans were sent to a facility in High Noon. Celsius Astro Vibe Sparkling Blue Razz is one of the impacted beverages. The tops of the vodka-filled cans are silver rather than black.The error resulted from a packaging mix-up. Consumers should check lot codes and properly dispose of affected products.ALSO READ: Aimee Osbourne makes a rare appearance at Ozzy Osbourne’s Funeral, honouring a quiet legacyWhich states and products are affected?Lot codes L CCC 17JL25 14:0 to L CCC 17JL25 23:59 and L CCC 18JL25 00:00 to L CCC 18JL25 03:00 are impacted by High Noon beach variety packs, a sper a report by NewsNation.Between July 21 and July 23, the packs were shipped to retailers in Florida, Michigan, New York, Ohio, Oklahoma, South Carolina, Virginia, and Wisconsin.Before consuming Celsius Astro Vibe sparkling blue razz drinks from cans that were not included in the variety pack, consumers are urged to confirm that the cans are not from lot codes L CCB 02JL25 2:55 to L CCB 02JL25 3:11.What should I do if I have an infected can?Customers should dispose of their products without drinking if they have items in the impacted lot codes. Celsius is collaborating with High Noon and parent company Gallo to recall the drinks; it was not involved in the mislabeling incident.Contact consumerrelations@highnoonvodka.com if you have the impacted drinks and would like a refund or have any questions, reported NewsNation.There have been no reported adverse events or illnesses related to the recall.FAQsWhat should I do if I have an infected can?Check the lot code. If it matches the recall, discard the can and contact High Noon for assistance.Is Celsius to blame for the mixup?No, the error occurred at High Noon's facility as a result of mislabeled cans from a common packaging supplier.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onhigh noon recallhigh nooncelsius recallcelsius drinkcelsiushigh noon celsiuscelsius energy drink\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onhigh noon recallhigh nooncelsius recallcelsius drinkcelsiushigh noon celsiuscelsius energy drink(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"High Noon issued a nationwide recall of its Beach Variety 12-packs due to a labeling error. Vodka seltzers were mistakenly packaged in Celsius energy drink cans, potentially leading to unintentional alcohol consumption. The affected products were shipped to retailers in eight states, and consumers are urged to check lot codes and dispose of mislabeled cans.","url":"https://economictimes.indiatimes.com/news/international/us/high-noon-recalls-vodka-seltzers-mistakenly-labeled-as-energy-drinks-in-multiple-states/articleshow/123005648.cms","image":"https://img.etimg.com/photo/65498029.cms","video":null,"publish_date":"2025-07-30 21:12:53","author":"High Noon","authors":["High Noon"],"language":"en","source_country":"in","sentiment":-0.356},{"id":346769752,"title":"Kamala Harris Rules Out Running for California Governor: My Leadership 'Will Not Be in Elected Office'","text":"Former Vice President Kamala Harris ruled out a run for California governor in 2026, noting that her leadership and public service would “not be in elected office.”\n\nHarris, who was the Democratic candidate for the 2024 presidential election, issued a statement explaining that she had spent the last six months “reflecting on this moment in our nation’s history” and what the “best way” was for her to “continue fighting for the American people.”\n\nHarris explained that she was “looking forward to getting back out and listening” to American citizens, and helping to get more Democrats elected, adding that she would be “sharing more details” about her “own plans.”\n\n“In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor,” Harris said. “I love this state, its people, and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election.”\n\nHarris continued to explain that she has “extraordinary admiration and respect for those who dedicate their lives to public service.”\n\n“At the same time, we must recognize that our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis,” Harris added. “As we look ahead, we must be willing to pursue change through new methods and fresh thinking—committed to our same values and principles, but not bound by the same playbook.”\n\n“For now, my leadership—and public service—will not be in elected office,” Harris added. “I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.”\n\nAs Breitbart News previously reported, Harris had been considering jumping into the California gubernatorial race, with sources previously telling the Hill that Harris was “sticking to a self-imposed end-of-summer deadline” in which to make her decision on whether to jump into the race or not.\n\nSeveral Democrat donors who had “boosted” Harris during her presidential campaign — which ended up $20 million in debt after raising $1 billion, were reported to be less than enthusiastic about Harris’s “possible return to the campaign trail,” Politico reported.\n\nDemocrat contenders for the California gubernatorial race include Xavier Becerra, who previously served as the Secretary of Health and Human Services (HHS) under former President Joe Biden, and former Los Angeles Mayor Antonio Villaraigosa.","summary":"Former Vice President Kamala Harris ruled out a run for California governor in 2026, noting that her leadership and public service would &#8220;not be in elected office.&#8221; Harris, who was the Democratic candidate for the 2024 presidential election, issued a\n\n\nThe post Kamala Harris Rules Out Running for California Governor: My Leadership &#8216;Will Not Be in Elected Office&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/07/30/kamala-harris-rules-out-running-for-california-governor-my-leadership-will-not-be-in-elected-office/","image":"https://media.breitbart.com/media/2025/07/Kamala-Harris-Praise-Be-640x335.jpeg","video":null,"publish_date":"2025-07-30 21:12:43","author":"Elizabeth Weibel","authors":["Elizabeth Weibel"],"language":"en","category":"politics","source_country":"US","sentiment":0.186},{"id":346731880,"title":"Ethan Klein alleges HasanAbi's associate 'wants him executed'","text":"Streamers and political commentators Hasan \"HasanAbi\" Piker and Ethan Klein (founder of H3H3 Productions) have been going back and forth in a longstanding feud stemming from their varying viewpoints on the Israel-Palestine conflict. Recently, Klein accused an associate of Piker, who goes by \"Mike from PA\" and \"Central_Committee,\" of wanting the H3H3 founder \"executed\" via Instagram.In an Instagram Story, Ethan Klein claims that this allegation stems from the time he called Mike a \"virgin\":\"Mike from PA wants me executed because I called him a virgin lol.\"The story also referenced an X post from Mike, one that criticized the r/h3h3productions subreddit, calling it a \"stalker community\":\"I love how these stalker communities just have to invent a framework in order for their unhinged lies to have any purchase. If you propagandize and incite genocide, it is ALREADY a crime in the United States. If you participate in a genocide, the death penalty is ALREADY law.\"For context, this comes after another Mike from PA post was shared on the H3H3 subreddit, prompting some users to make sarcastic comments against the Twitch streamer. The original post from Mike allegedly took shots at Ethan Klein for his solidarity with Israel:\"It's important that we punish the propagandists who supported this genocide. Criminal charges, the death penalty, everything should be on the table.\"Notably, in late May 2025, Mike claimed that for Ethan to understand \"empathy,\" the latter would have to \"see some stars\":\"And I get it! I want to be... I understand the value of empathy. I understand the value of trying to reach out to someone. To somebody like Ethan, he needs to see some stars before he's going to f**king back down. You know? And so I just would not do this.\"Looking at HasanAbi's relationship with Mike from PA amidst their feud with Ethan KleinBased on shared ideologies, Mike has been a consistent supporter of HasanAbi and has spoken to him on stream.During the November 2024 US Elections, Mike, Hasan, and AustinShow conducted an overview of two candidates, Donald Trump and Kamala Harris.That being said, some, like Rob's Media on YouTube, spoke on Mike from PA's association with HasanAbi, wondering what his intentions were and if his left-leaning political ideas are genuine:\"Hasan has no will towards Mike, viewing him as one of many loyal orbiters who will adamantly defend him no matter what... I have to ask, how genuine is this? Does Mike actually hold these political beliefs? Or is he a grifter?\"In other news, during a recent Anti-ICE Benefit rally, HasanAbi made remarks that some online users interpreted as inciting political violence, leading to criticism online.","summary":"Streamers and political commentators Hasan \"HasanAbi\" Piker and Ethan Klein (founder of H3H3 Productions) have been going back and forth in a longstanding feud stemming from their varying viewpoints o","url":"https://www.sportskeeda.com/us/streamers/news-ethan-klein-alleges-hasanabi-s-associate-wants-executed","image":"https://staticg.sportskeeda.com/editor/2025/07/dd83e-17539040332016-1920.jpg","video":null,"publish_date":"2025-07-30 21:03:42","author":"Vishnu Menon","authors":["Vishnu Menon"],"language":"en","category":"politics","source_country":"in","sentiment":-0.138},{"id":346739564,"title":"Heading toward midterm elections, Democrats not up off the floor","text":"Which leads to the clue referred to above. Politico’s Andrew Howard reports that former Democrats Brian Bengs in South Dakota (Trump +29 in 2024) and Todd Achilles in Idaho (Trump +36) are joining former Democrat Dan Osborn of Nebraska (Trump +20) to run for senator as self-declared independents, with no credible Democrat in the race. \n\nOsborn did so in 2024, scaring incumbent Republican Rep. Deb Fischer while losing by only 6 points. This was an improvement on Greg Orman’s 2014 independent candidacy in Kansas, where he lost by 11 points in a state that was +22 Republican for president two years before. \n\nWhy are these Democrats, some in states such as South Dakota and Nebraska that have reelected Democratic senators in recent years, shunning the Democratic label? Most likely because, in a country of increased straight-ticket voting, they believe the Democratic label is political poison. \n\nAfter four years of the Biden administration, the Pew Research Center said the presidential electorate moved from +6 Democratic in 2020 to +1 Republican in 2024, with Republicans close to equal among under-30 voters. “For months now,” Republican pollster Patrick Ruffini notes, “We’ve observed a new trend in polling: the Democratic party’s favorability ratings have fallen below the GOP’s. That’s hardly ever happened before.”\n\nThe Wall Street Journal’s July 16-20 poll shows that 63% of voters have negative feelings about the Democrats, the highest since 1990. That poll also showed Republicans maintaining their 2024 lead in party identification, in sharp contrast to Trump’s first term. And it showed pluralities of voters favored Republicans even on issues on which majorities disapproved of Donald Trump’s most recent actions, including the economy, tariffs, immigration, foreign policy, and Ukraine.\n\nIt looks like the Democrats’ baggage, especially from the Biden years, is heavier than the loads Trump Republicans must juggle. Democrats’ credibility has been damaged as their arguments, one after another, have proven to be based on lies: the Russia collusion hoax, COVID-19 school closings, “transitory” inflation, the Hunter Biden laptop, and open borders immigration. \n\nAll of which suggests that Democrats’ hopes of overturning the Republicans’ 53-47 Senate majority may rest more on independents running in Trump-heavy states than on purple state Democrats. And, despite conventional wisdom, there’s a cognizable chance that Republicans will not lose the narrow 220-215 majority they won in the House of Representatives in 2020.\n\nOnce upon a time, in the split-ticket voting era, Democrats maintained their large House majority in 1972 despite Richard Nixon’s 61% landslide by winning fully half the seats in House districts Nixon carried. Those days are gone. In 2024, voters in only 16 House districts split their ticket between president and congressman.\n\nThe Democrats’ problem is that Republicans are defending only three districts carried by former Vice President Kamala Harris, while Democrats are defending 13 seats won by Donald Trump. That’s one of the reasons that Steve Kornacki, to the dismay of his MSNBC audience, says Republicans could hold on to the House. \n\nMeanwhile, Harry Enten dismays his CNN audience by pointing out that the narrow leads Democrats enjoy in House generic vote polling leave them not nearly as well-positioned for 2026 as they were at this point in 2005 and 2017 for their big gains in 2006 and 2018. \n\nCore Democratic hatred of and obsession with Donald Trump will certainly have them stomping to the off-year polls, and Trump Republicans’ newly biracial and young male coalition may not be similarly motivated. But Republican gains are widespread while Democratic gains are scarcely visible. As Bloomberg columnist Conor Sen writes, “It’s currently not possible to identify any cohort of potential first-time Dem voters.”\n\nTrump has gained a percentage over three elections, as the New York Times’s brilliant graphics pointed out. In 1,433 counties with 42 million people, while his Democratic opponents gained three times in only 57 counties with 8 million people. “For years, the belief was Democrats have had demographic destiny on our side,” Jewish Insider’s Josh Kraushaar tweeted, “Now, the inverse is true.”\n\nThe veteran liberal reporter Thomas Edsall portrays in his New York Times online column a “realignment with staying power” and fears. “The real possibility that discontent with the Democratic party—its perceived failure to value work, its political correctness, the extremity of its social and cultural liberalism—might have become deeply embedded in the electorate.”\n\nMeanwhile, the economic numbers are coming in more positively than those who predicted doom in April from Trump’s tariffs (I called them “lunatic”), and as analyst Nate Silver writes, “There remains a strong case that voters are concerned about the economy and the cost of living, but that everything else is priced in.” As for the fuss over the Epstein tapes, Silver writes, “It looks like we’re back to the usual pattern: the overwhelming majority of voters either already hate Trump, or are happy to shrug off his scandals.” “The country is moving toward Trump,” says Chris Matthews, onetime staffer for Jimmy Carter and Tip O’Neill. “They want a president who is a strong figure. And he‘s got it. And half the country buys it.” Nothing’s inevitable in politics, but so far, the Democrats have not gotten up off the floor.","summary":"Here’s a clue that the off-year elections in November 2026 may not go the way conventional wisdom suggests. That conventional wisdom is that the president’s party almost always loses the House and, slightly less often, Senate seats.  There are two structural reasons for this. One is that parties in power tend to do things or [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/3486750/midterm-elections-democratic-party-polling/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/05/iStock-1417949846.jpg.optimal.jpg","video":null,"publish_date":"2025-07-30 20:44:02","author":"Michael Barone","authors":["Michael Barone"],"language":"en","category":"politics","source_country":"US","sentiment":-0.151},{"id":346738694,"title":"Kamala Harris Chances in 2028 Primary After Passing on California Gov. Run","text":"Kamala Harris' announcement that she is opting out of running for California governor fueled speculation that she could run for president again in 2028, and polls provide insight on her chances in a potential Democratic primary.Newsweek reached out to Harris' office for comment via email.Why It MattersDespite Harris' loss to President Donald Trump in November's presidential race, some Democrats have floated her as a potential candidate in 2028. She built up some goodwill in the party by improving Democrats' polling position after replacing former President Joe Biden as the party's nominee, so some believe she could be a viable candidate if she had more time to run a campaign amid a better national environment.Others, however, say she lost a winnable race, pointing to decisions like her approach to the conflict between Israel and Hamas, refusal to break from an unpopular Biden on some issues and campaigning with Republicans like former Representative Liz Cheney. Critics also say she would likely face questions about whether she was aware of Biden's alleged health decline while in office.Kamala Harris Announcement: What We KnowHarris wrote in a statement Wednesday that she has \"given serious thought to asking the people of California for the privilege to serve as their governor\" but decided she will \"not run for Governor in this election.\"Harris did not say she plans to run for president but that she would share more details about her plans in the future.\"For now, my leadership—and public service—will not be in elected office,\" Harris wrote. \"I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead of my own plans.\"Harris narrowly lost every swing state and the popular vote to Trump in November. She also ran for president in 2020 but struggled to gain traction in the 2020 Democratic primary.Democratic 2028 Presidential Primary Polling: Where Kamala Harris StandsEarly polling of the primary suggests Harris would have a lead over other potential Democratic candidates if she chooses to run. She may face a competitive primary against other high-profile Democrats like California Governor Gavin Newsom and former Transportation Secretary Pete Buttigieg, who have taken early steps to build their national name recognition.A McLaughlin poll released in early July showed that Harris had support from 25 percent of respondents. Newsom and Representative Alexandria Ocasio-Cortez, who has not indicated she plans to run, each received 9 percent support, while Buttigieg received 8 percent.That poll surveyed 1,000 general election voters from July 9 to July 14.An Echelon Insights poll found similar results, giving Harris 26 percent of the vote, Buttigieg 11 percent, Newsom 10 percent and Ocasio-Cortez 6 percent. It surveyed 1,084 likely voters from July 10 to July 14 and had a margin of error of plus or minus 3.6 percentage points.Not all polls show Harris with a major lead over other candidates, however.The latest AtlasIntel poll showed Buttigieg leading with 27 percent support. Ocasio-Cortez followed with 19 percent, while 16 percent backed Newsom. In that poll, only 14 percent of respondents picked Harris. It surveyed 1,935 adults from July 13 to July 18 and had a margin of error of plus or minus 2 percentage points.A recent Emerson College poll also showed Buttigieg in the lead with 16 percent of the vote. Harris followed with 13 percent and 12 percent leaned toward Newsom. Ocasio-Cortez and Pennsylvania Governor Josh Shapiro each held 7 percent. It surveyed 1,000 registered voters on June 24 and June 25 and had a margin of error of plus or minus 3 percentage points.Harris' chances on Polymarket jumped 3 percent following her announcement. However, the oddsmaker still shows her with only a 6 percent chance of winning the party's primary—behind Buttigieg, Ocasio-Cortez, Newsom, Shapiro and Kentucky Governor Andy Beshear.What People Are SayingRepresentative Robert Garcia, a California Democrat, responded to her announcement on X, formerly Twitter: \"Kamala Harris has served our state as Attorney General, U.S. Senator, and Vice-President. We could not be more grateful. Excited about her hitting the road and traveling the country to help us flip the House and win back Congress. Let's go!\"Democratic strategist Michael Trujillo wrote to X: \"Former Vice President Kamala Harris announcing later today she's not running for CA Governor will make history in the number of cascading dominos this will have across CA in terms of candidates futures, lower statewide races impacted etc. Her exit is the full employment political operative Act because of the number of candidates for CA GOV that will be running for this office.\"What Happens NextHarris did not say whether she plans to run for president. Typically, most candidates wait until after the midterms to formally announce their campaigns.","summary":"Harris ruled out a run for governor, but did not say whether she plans to run for president again.","url":"https://www.newsweek.com/kamala-harriis-chances-primary-passing-governor-run-2106643","image":"https://d.newsweek.com/en/full/2693509/kamala-harris-2028-polling.jpg?w=1600&h=900&q=88&f=4d96fd23a684cf49fcc4c6c5e1dacc28","video":null,"publish_date":"2025-07-30 20:41:27","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"us","sentiment":0.152},{"id":346727582,"title":"Former Vice President Kamala Harris says she will not run for California governor in 2026 (World)","text":"Former Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.\n\n“Over the past six months, I have spent time reflecting on this moment in our nation’s history and the best way for me to continue fighting for the American people and advancing the values and ideals I hold dear,” Harris said in a statement released by her office Wednesday.\n\n“I have given serious thought to asking the people of California for the privilege to serve as their governor. I love this state, its people and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election,” she said.\n\nHarris' decision extends a guessing game about her political future that started after she lost last year’s presidential election to Donald Trump. Harris spent months privately considering whether to run for governor, stage another run for the White House or step away from electoral politics altogether after her bruising defeat by Trump.\n\nShe has not ruled out another run for president, after unsuccessful bids in 2020 and 2024. It’s not known when she will make that decision.\n\nHarris didn't mention Trump directly in her statement, but said “our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis.”\n\nRemaining in the fight\n\n“For now, my leadership — and public service — will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,” Harris said.\n\n“In the United States of America, power must lie with the people. And We, the People must use our power to fight for freedom, opportunity, fairness and the dignity of all. I will remain in that fight,” the statement said.\n\nHarris would have entered the crowded contest to replace term-limited Gov. Gavin Newsom as a front-runner given her widespread name recognition, fundraising prowess and track record of winning statewide elections. Before serving as U.S. senator and vice president, she was elected state attorney general and district attorney in San Francisco.\n\nBut after years in Washington on the national and international stage, it was never clear if Harris was interested in returning to the less-glamorous world of statehouse politics in Sacramento.\n\nYoung voters\n\nDemocratic strategist Sean Clegg, a longtime Harris adviser, said the former vice president was tempted to make a gubernatorial run but decided to explore other options. Among the possibilities she has considered: starting a nonprofit to engage younger voters.\n\n“She's been in elective office for 22 straight years, she's been in public service since she got out of law school,” Clegg said. “Having spent her entire life inside the system, she's more motivated, more excited by the opportunity to make change outside of the system.”\n\n“Her decision, at the end of the day, it was just a gut decision,” Clegg added. “She asked herself, ‘Do I want to go back into the system as the top elected official in California, or do I want to try to do something completely different?’”\n\nAnother White House run?\n\nOutside California, Harris’ political career has been marked by historic firsts but also disappointments.\n\nHarris sought the 2020 Democratic presidential nomination, but dropped out of the race before the leadoff Iowa caucuses — the first defeat of her political career. After Joe Biden chose her as his running mate, she made history as the first woman, Black person or person of South Asian descent to serve as vice president. In 2024, Harris became the Democratic presidential nominee after Biden left the race months before Election Day and endorsed her. She lost that race to Trump, who won every swing state.\n\nHarris faces some uncertainty if she chooses to make another White House run.\n\nHarris would have to convince national Democrats that she’s the face of the party’s future, despite losing to Trump last fall. She also carries the baggage of being tied to Biden, whom Democrats have increasingly criticized for seeking a second term rather than stepping aside. Biden’s legacy was tarnished as he left office, and since then new questions have swirled about his physical and mental abilities as his term ended.\n\nThe 2028 presidential contest is expected to attract a large field, which could potentially include Newsom. Any candidate will have to unify a fractious Democratic Party with low approval ratings that is struggling to slow Trump’s agenda in Washington.\n\nIn her most extensive public remarks since leaving office in January, Harris said in a San Francisco speech that Trump’s leadership represented a “ wholesale abandonment ” of American ideals.\n\nHarris’ decision not to seek the governorship keeps the contest to replace Newsom wide open. The Democratic field includes former U.S. Rep. Katie Porter, former Los Angeles Mayor Antonio Villaraigosa, former Biden administration health secretary Xavier Becerra and a handful of state officeholders.\n\nIn a statement, Villaraigosa speculated that Harris' political career was not over. Her decision, he said, “reflects her continued commitment to serving at the highest levels of government.\"","summary":"Former Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028. 'Over the past six months, I have spent time reflecting on this moment in our nation's history and the best way for me to con...","url":"https://www.castanet.net/news/World/564162/Former-Vice-President-Kamala-Harris-says-she-will-not-run-for-California-governor-in-2026","image":"https://www.castanet.net/content/cp/2025/7/e09a97ecca46c51ffd79332337853e5816858202be34abd99e14f76c2c5bcf90.jpg","video":null,"publish_date":"2025-07-30 20:39:00","author":"Michael R. Blood,The Canadian Press","authors":["Michael R. Blood","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.096},{"id":346727580,"title":"Bessent says new Trump child savings accounts are 'back door for privatizing Social Security' (World)","text":"The children's savings program included in President Donald Trump's tax break-and-spending cut law “is a back door for privatizing Social Security,” Treasury Secretary Scott Bessent said Wednesday.\n\nBessent's remarks, which he made at a forum hosted by Breitbart News, were striking after Trump's repeated promises that he would not touch Social Security. Democrats quickly seized on the comment as a sign the GOP wants to revive a dormant but unpopular push to privatize the long-running retirement program.\n\n“A stunning admission,” Senate Democratic leader Chuck Schumer said in a Senate speech. “Bessent actually slipped, told the truth: Donald Trump and government want to privatize Social Security.”\n\nThe White House did not immediately respond to a request for comment about Bessent’s remarks.\n\nThe idea of privatizing Social Security has been raised, and abandoned, by Republicans before, as millions of Americans have come to rely on the certainty of the federal government providing monthly checks in old age. Privatization proposals would shift the responsibility for retirement funds away from the government onto Americans, through personal savings accounts that may or may not be enough to live on.\n\nUnder the GOP’s “big, beautiful bill,” as the law is called, Republicans launched a new children’s savings program, Trump Accounts, which can be created for babies born in the U.S. and come with a potential $1,000 deposit from the Treasury.\n\nMuch like an individual retirement account, the Trump Accounts can grow over time, with a post-tax contribution limit of $5,000 a year, and are expected to be treated similarly to the rules for an IRA, and can eventually be tapped for distribution in adulthood.\n\nBut Bessent on Wednesday allowed for another rationale for the accounts, suggesting they could eventually be the way Americans save for retirement.\n\n“In a way, it is a back door for privatizing Social Security,” Bessent said while speaking about the program.\n\nEver since the George W. Bush administration considered proposals to privatize Social Security more than 20 years ago, Republicans have publicly moved away from talking about the issue that proved politically unpopular and was swiftly abandoned.\n\nIn the run-up to the 2006 midterms, Democrats capitalized on GOP plans to privatize Social Security, warning it would decimate the program that millions of Americans have come to rely on in older age. They won back control of both the House and the Senate in Congress.\n\nThe Democrats warned Wednesday that Bessent's comments showed that Republicans want to shift the government-run program to a private one and are again trying to dismantle the retirement program that millions of Americans depend on.\n\n“Donald Trump’s Treasury Secretary Scott Bessent just said the quiet part out loud: The administration is scheming to privatize Social Security,” Tim Hogan, a spokesperson for the Democratic National Committee, said in a statement.\n\n“It wasn’t enough to kick millions of people off their health care and take food away from hungry kids. Trump is now coming after American seniors with a ‘backdoor’ scam to take away the benefits they earned,” Hogan said.\n\nThe program has faced dire financial projections for decades, but changes have long been politically unpopular.\n\nSocial Security’s trust funds, which cover old age and disability recipients, will be unable to pay full benefits beginning in 2034, according to the most recent report from the programs trustees.\n\nThose officials have said those findings underline the urgency of making changes to programs.\n\nTrump, attuned to Social Security's popularity, has repeatedly said he would protect it.\n\nThroughout his 2024 presidential campaign, Trump repeatedly said he would “always protect Social Security” and said his Democratic opponents, President Joe Biden and Vice President Kamala Harris, would destroy the program.\n\nDuring the 2024 presidential primary campaign, he also accused other Republicans who have expressed support for raising the age for Social Security of being threats to the program.\n\nTrump said in an interview with NBC’s “Meet the Press” in December after he won the presidential election, “We’re not touching Social Security, other than we might make it more efficient.”\n\nHis White House this year said Trump “will always protect Social Security.”\n\nSocial Security Agency Commissioner Frank Bisignano, a Wall Street veteran, was asked at his confirmation hearing in March about whether Social Security should be privatized and said he’d “never heard a word of it” and “never thought about it.”","summary":"The children's savings program included in President Donald Trump's tax break-and-spending cut law 'is a back door for privatizing Social Security,' Treasury Secretary Scott Bessent said Wednesday. Bessent's remarks, which he made at a forum hosted by Breitbart News, were striking after Trump's repe...","url":"https://www.castanet.net/news/World/564160/Bessent-says-new-Trump-child-savings-accounts-are-back-door-for-privatizing-Social-Security","image":"https://www.castanet.net/content/cp/2025/7/7d85a7b5e6ad3b1ebdbd79660de39c46df7e0fe08bf3ce72812a6aa0592b4ae3.jpg","video":null,"publish_date":"2025-07-30 20:37:00","author":"Michelle L. Price,The Canadian Press","authors":["Michelle L. Price","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.293},{"id":346730254,"title":"Stop Dishonoring My Murdered Relatives by Comparing Trump to Hitler ","text":"I grew up being told—though I, of course, could never verify it since their corpses were roasted to ashes in the crematoria—that 200 of my relatives were murdered during the Holocaust. \n\nYou, on the Left, who contend President Donald Trump has something to do with Hitler and the Gestapo, likely know approximately what happened to them. You’re just not taking it seriously. \n\nBecause they were Jewish, they were herded out of the ghettos where they had been barely subsisting, packed into cattle cars, and transported to one of Hitler’s various highly-efficient death camps. \n\nThe very young, the very old and many others were immediately selected for death. Perhaps one in five of the rest were preserved in order to endure unimaginably cruel conditions as laborers, lasting as long as they could, which often wasn’t very long at all. Their demonic overseers and the Polish winter made sure of that. \n\nTexas Rep. Jasmine Crockett, always poised to launch a seismic inanity, called Trump a “wannabe Hitler” during a July 20 TV appearance, which at least suggests he’s not quite there yet. Former Vice President Al Gore, veteran Democrat strategist James Carville, and comedian Larry David have all in recent weeks likened Trump to Hitler. Analogies to the Gestapo, the SS and Joseph Goebbels are liberally applied to anyone who works for Trump. \n\nIt’s all part of the “You’re Hitler” chorus that has plagued the administration from its first day with the contention, strikingly ambitious in its stupidity, that Elon Musk was delivering the fascist salute during a post-Inauguration rally. \n\nI get the politics here, and it’s abhorrent. But no doubt some of this is true belief. So, for those stricken with advanced Trump Derangement Syndrome, a few comments. \n\nTrump bears no resemblance to Hitler, and any contention otherwise is, whether stated to win elections or out of conviction, an insult to everyone who died at the Fuhrer’s hand. \n\nHitler was a sociopathic failed artist who wrote a book about the mayhem and murder he planned to unleash, and then, after obtaining power, got right down to business. \n\nTrump is a gregarious extrovert with legions of friends and a small army of children and grandchildren, not storm troopers. He succeeded mightily in mainstream society as a businessman, bestselling author, and TV star, and then got himself elected president twice. Sure, he doesn’t exemplify polite society, but he’s a high-achieving iconoclast, not a pathological deviant. \n\nThe faceoff between Trump’s executive branch and the judiciary that is underway is a serious matter that is still playing out. The Constitution and the law must be upheld. But this is not the burning of the Reichstag. \n\nRepublicans didn’t play the Hitler card when President Joe Biden appointed a commission to study packing the Supreme Court. Or when he defied the court by forgiving student debt. “The Supreme Court blocked it, but that didn’t stop me,” Biden said. Is that not an authoritarian boast? \n\nThey didn’t cast the card when the Democrat Party made sure its constituency didn’t get a choice during the 2024 presidential primaries, and then, when Biden withdrew from the race, rammed the nomination of Kamala Harris through to the winner’s circle instead allowing a truncated primary. No one called the left Nazis when they tried to lawfare their most feared political opponent, Trump, into prison. Nor when they sent a swarm of armed agents into his home in a search for documents. Nor when the top brass at our spy and federal police agencies plotted to undermine an election by falsely tying Trump to Russian election interference. \n\nThe rise of the bureaucratic state in the U.S. hasn’t drawn comparisons to the Nazis’ expansionary fiscal policies and their lethally virulent bureaucracy. Trump’s dramatic effort to rein in the U.S. bureaucracy is described without irony by Democrats and the press as an assault on democracy rather than what it is, an effort to scale back state power over Americans’ daily lives. \n\nSo, if you want to head down this road, there’s a lot of Hitler to go around. But no one has earned the comparison. \n\nWhat surely has been earned, with the careless invocation of Hitler, is the recognition that these Democrats do not care enough about Nazism and the Holocaust to recognize what those things truly were about. They are callous, heartless, and in their absence of compassion for its victims, guilty of imperiling the essential vow Jews have repeated to themselves and the world for 80 years: Never forget.","summary":"I grew up being told—though I, of course, could never verify it since their corpses were roasted to ashes in the crematoria—that 200 of my... Read More\n\n\nThe post Stop Dishonoring My Murdered Relatives by Comparing Trump to Hitler  appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/30/stop-dishonoring-my-murdered-relatives-by-comparing-trump-to-hitler/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/250730_Donald_Trump.jpg","video":null,"publish_date":"2025-07-30 20:30:00","author":"Comparing Trump,Keith Koffler","authors":["Comparing Trump","Keith Koffler"],"language":"en","category":"politics","source_country":"us","sentiment":-0.161},{"id":346738008,"title":"Shannon Sharpe out at ESPN following $50 million lawsuit settlement- here's what he plans to do next","text":"(Image via Gilbert Flores/Getty Images)\n\nESPN has parted ways with Shannon Sharpe, a Pro Football Hall of Famer, following a civil rape lawsuit that rocked the network and sports media world. Sharpe denied the allegations, but the controversy grew too large to ignore. His departure comes after a private settlement and several weeks of public scrutiny.Days after he settled a shocking $50 million lawsuit accusing him of rape, Andrew Marchand of The Athletic reported Wednesday that the Worldwide Leader had broken off his relationship with the Pro Football Hall of Famer, as per a report by the NY Post.Sharpe, 57, had been a high-profile addition to ESPN in the fall of 2023, leaving FS1’s Undisputed alongside Skip Bayless for a fresh start. His sharp takes, charisma, and on-screen chemistry with Stephen A. Smith quickly made waves among fans. How did the lawsuit unfold?But things took a dramatic turn in April 2025 when a civil lawsuit surfaced accusing the Hall of Fame tight end of sexual assault, battery, and coercion.Live EventsThe plaintiff, who was named in the complaint as Jane Doe, claimed that Sharpe had repeatedly sexually assaulted her in late 2024 and early 2025.Intimate details of the relationship were revealed during an ugly back-and-forth between Sharpe and the accuser and her lawyer, during which he denied \"all allegations of coercion or misconduct\" in a statement issued through his legal counsel.According to Sharpe's attorney, Lanny J. Davis, the statement from his legal team contained explicit messages that the accuser had sent him.\"This was a consensual, adult relationship that involved role-playing, sexual language, and fantasy scenarios, as the evidence clearly shows,\" Davis said.ALSO READ: Kamala Harris confirms she won’t run for California Governor in 2026, eyes new national role- here's what she plans to do insteadIn the wake of the accusations, Sharpe left ESPN. \"At this juncture I am electing to step aside temporarily from my ESPN duties. I will be devoting this time to my family, and responding and dealing with these false and disruptive allegations set against me,\" Sharpe stated in April.What led to Sharpe’s fallout with ESPN?Though Sharpe initially announced a temporary leave of absence, ESPN confirmed this week that his exit is permanent. According to reporting by The Athletic’s Andrew Marchand, the network and Sharpe have quietly severed ties, closing the door on his brief but headline-making tenure. “This is a serious situation, and we agree with Shannon’s decision to step away,” ESPN said in a statement when the allegations first broke.What’s next for Shannon Sharpe?Though he’s now off ESPN’s payroll, Sharpe is far from vanishing. He continues to host Club Shay Shay, his viral interview podcast, and co-hosts Nightcap with Chad Ochocinco. Still, his sudden departure from television’s biggest sports network raises questions about his future in mainstream sports media. FAQsDid Shannon Sharpe voluntarily leave ESPN?Sharpe initially took a temporary leave of absence, but his departure is now permanent.What exactly were the allegations in the lawsuit?Sharpe was charged with sexual assault and battery in a civil suit, which he settled.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onShannon SharpeESPNshannon sharpe lawsuitshannon sharpe firedespn shannon sharpeshannon sharpe settlementshannon sharpe espnshannon sharpe accuserPro Football Hall of Famesports media controversy\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onShannon SharpeESPNshannon sharpe lawsuitshannon sharpe firedespn shannon sharpeshannon sharpe settlementshannon sharpe espnshannon sharpe accuserPro Football Hall of Famesports media controversy(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Shannon Sharpe is no longer with ESPN. This follows a civil lawsuit. The lawsuit accused him of sexual assault. Sharpe denied the allegations. He settled the lawsuit privately. Sharpe joined ESPN in 2023. He left FS1 for a fresh start. His departure raises questions about his future. He continues to host his podcast. He also co-hosts Nightcap.","url":"https://economictimes.indiatimes.com/news/international/us/shannon-sharpe-out-at-espn-following-50-million-lawsuit-settlement-heres-what-he-plans-to-do-next/articleshow/123005504.cms","image":"https://img.etimg.com/thumb/msid-123005580,width-1200,height-630,imgsize-32936,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-30 20:26:01","author":"The Athletic","authors":["The Athletic"],"language":"en","source_country":"in","sentiment":-0.057},{"id":346740374,"title":"Beatles","text":"Kelowna's Homepage ●●●●●●●\n\nWednesday, Jul 30\n\nObitsAutoMallEventsCamsTango\n\nWest Kelowna\n\nLake Country\n\nOliver / Osoyoos\n\nNewsletter Signup\n\nOfficer could be charged\nPrince George 12:42 pm - 2,778 views\n\nPipeline hits resistance\nBC 12:32 pm - 3,104 views\n\nNew fire evacuates campers\nHarrison Lake 12:09 pm - 4,750 views\n\nMetro Vancouver\n\nWest Kelowna\n\nOliver / Osoyoos\n\nPrince George\n\nAll BC News\n\nWestons to buy Bay charter\nCanada 1:41 pm - 1,707 views\n\nCrown attorneys fire back\nCanada 11:51 am - 3,418 views\n\nBig cuts to gender equality\nCanada 11:43 am - 4,007 views\n\nAlberta News\n\nMore Canada News\n\nCyanide in wife's shakes\nUnited States 1:48 pm - 359 views\n\nKamala Harris will not run\nCalifornia 1:39 pm - 296 views\n\n'Privatizing Social Security'\nUnited States 1:37 pm - 309 views\n\nMore World News\n\nIs AI causing layoffs? \nBusiness 1:50 pm - 841 views\n\nPanasonic has a new CEO\nBusiness 1:45 pm - 138 views\n\nU.S. Fed holds rates steady\nBusiness 11:13 am - 431 views\n\nSponsored Video\n\nBiz Opportunities\n\nThink Local\n\nPromoted Posts\n\nOkanagan Edge\n\nOkanagan Biz\n\nGot the Edge\n\nGet Involved\n\nBusiness Buzz\n\nRockets waive netminder\nWHL- 6,053 views\n\nRockets make Junior roster\nWHL- 8,809 views\n\nBlue Jays are soaring\nCanada- 4,406 views\n\nPenticton Speedway\n\nSilver Star\n\nPerry superfan basks in fame\nEntertainment 1:47 pm - 315 views\n\nGrateful Dead turn 60\nEntertainment 11:07 am - 482 views\n\nSurprise hit of the summer\nEntertainment 7:10 am - 6,325 views\n\nTV Listings\n\nAround the Web\n\nWeekly Horoscopes\n\n Classifieds\n\nMarketplace Live\n\nGarage Sales\n\nReal Estate\n\nRec Vehicles\n\nElectronics\n\nSports-Health\n\nRV-Boats-Powersports\n\nHobbies-Music\n\nVintage-Antiques\n\nHome Improvement\n\nCommercial-Business\n\nFarmer's Market\n\nHorse-Farm-Pets\n\nGarage-Free-Auctions\n\nClassifieds Rate Sheet\n\n Real Estate\n\nCastanet Real Estate Listings\n\nREW Real Estate Listings\n\nShowhome Showcase\n\nLuxury Homes\n\nLuxury Homes South\n\nLuxury Homes North\n\nInvestment Real Estate \n\nOpen Houses\n\nOne Foot Off Center\n\nAdopt-a-Pet\n\nCelebrations\n\n Pay Parking Tickets\n\nLake Country\n\nWest Kelowna\n\nWestbank First Nation\n\nInterior Health\n\nUBC Okanagan\n\nOkanagan College\n\nGarage Sales\n\nFood & Drink\n\nWine Reviews\n\nCampus Life Okanagan\n\nCampus Life Kamloops\n\nBus Schedule\n\nYLW Arrive / Depart\n\nKelowna Council\n\nCrime Stoppers\n\n Electronics / \n Entertainment / \n\nContact Seller\n\nLogin to Email Seller\nThe Beatles White Album (Blue Records) $75\n\nThe Beatles 1 Sealed $65\n\nThe Beatles White Album complete all papers included in \n\nexcellent condition $90\n\nThe Beatles White album APPLE 1st pressing USA $100 \n\nThe Beatles White Album ( White Records) pictures and inner sleeve with extras $180\n\nTRADING FOR SILVER OR GOLD COINS, NOTHING ELSE \n\nMANY MANY MORE BEATLES AND MIRE COMING SOON\n\n250-863-7938\n\nContact Seller\n\nYour Best Deal View All Ads\n\nMember Since:\nOctober 2020\n\nKelowna, British Columbia\n\nEmail Seller\n\nMore ads from Your Best Deal\n\n 2025 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\nJul 30, 2025\n\nAug 29, 2025\n\nListing Type:\n\n Login to Add to Watchlist \n\nImportant Safety Tip\n If you feel that this ad is miscategorized, fraud, scam or phishing, duplicate or business listing report it by clicking here. \n\nMore Like This\n\nRecords galore \n\nRecords and more \n$15 and up \n\nI will ship\n\n250-863-7938\n\nIRON MAIDEN \n\n50 bucks. Great condition. \n\nIRON MAIDEN KILLERS\n\nNear mint condition. The record is, cover slightly worn. 60.00\n\n5 Rosanne Cash records\n\n5 Rosanne Cash records \n\nShe Remembers Everything\n\nThe River and the Thread\nBlack Cadillac\n\nall in very good condition and play fin..\n\nKamloops Honda\n2023 Nissan Armada SL - REMOTE START | NAV | HEATED SEATS\n\nMore Listings\n\nRVPowersports\n\nPenticton Honda Centre\n2019 Polaris Ranger XP 1000 EPS NorthStar Edition \n\nMore Listings\n\n \n\n© 2025 Castanet.net\n\nMake Castanet Your Homepage\n\nAdvertising","summary":"by: Your Best Deal\n\nDescription: The Beatles White Album (Blue Records) $75\n\nThe Beatles 1 Sealed $65\n\nThe Beatles White Album complete all papers included in \nexcellent condition $90\n\nThe Beatles White album APPLE 1st pressing USA $100 \n\nThe Beatles White Album ( White Records) pictures and inner sleeve with extras $180\n\nTRADING FOR SILVER OR GOLD COINS, NOTHING ELSE \n\nMANY MANY MORE BEATLES AND MIRE COMING SOON\n\n250-863-7938","url":"https://classifieds.castanet.net/details/beatles/5178467/","image":"https://c.castanet.net/img/832/large/5178467-1-2.jpg","video":null,"publish_date":"2025-07-30 20:16:29","author":"555464","authors":["555464"],"language":"en","category":"entertainment","source_country":"ca","sentiment":0.06},{"id":346724952,"title":"Kamala Harris announces she will not be running for governor of California in 2026","text":"Former vice president Kamala Harris has announced she will not be running for governor of California in 2026, ending months of speculation.\n\nIn a statement released by her office Wednesday, Harris said she had reached the decision after “deep reflection” and vowed to “remain in the fight” despite not holding an official political office.\n\n“Over the past six months, I have spent time reflecting on this moment in our nation’s history and the best way for me to continue fighting for the American people and advancing the values and ideals I hold dear,” the statement read.\n\n“I have given serious thought to asking the people of California for the privilege to serve as their governor. I love this state, its people and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election,” she said.\n\nSpeculation about Harris’ next steps has been rife ever since her dramatic loss to Donald Trump in the 2024 presidential race – having taken over from Joe Biden after he stepped down mid-campaign.\n\nThe former VP and US senator from California has spent time largely out of the limelight, with many believing she was mulling a run for governor, stepping away from politics entirely, or plotting another stab at the presidency in 2028.\n\nIn her statement, Harris did not rule out another presidential bid, despite unsuccessful bids in both 2020 and 2024. It is not known if or when she will make that decision.\n\nHarris’ statement Wednesday did not mention her 2024 adversary, Donald Trump, by name but wrote that “our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis.”\n\n“For now, my leadership — and public service — will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,” the statement added.\n\n“In the United States of America, power must lie with the people. And We, the People must use our power to fight for freedom, opportunity, fairness and the dignity of all. I will remain in that fight.”\n\nHarris may well have been a frontrunner in the race to succeed current Gov. Gavin Newsom, who is reaching the end of his term-limited tenure. Before serving as U.S. senator and vice president, she was elected state attorney general and district attorney in San Francisco.\n\nNewsom has also been touted as a potential name for the Democratic presidential ticket in 2028 – meaning a potential Californian head-to-head, should Harris choose to try again. \n\nPrior to her stint as Joe Biden’s second-in-command, Harris sought the 2020 Democratic presidential nomination, but dropped out of the race before the leadoff Iowa caucuses — the first defeat of her political career. \n\nAfter Biden chose her as his running mate, she made history as the first woman, Black person or person of South Asian descent to serve as vice president. In 2024, Harris became the Democratic presidential nominee after Biden left the race months before Election Day and endorsed her. She lost that race to Trump, who won every swing state.\n\nShould she want to run for the third time, Harris may face an uphill battle – having to convince Democrats to back her again, despite the resounding defeat to Trump last November. \n\nMany still associate her with some of the perceived failings of the Biden administration, which she failed to adequately distance herself from after taking the reins of the campaign.\n\nBiden’s legacy was tarnished as he left office, after holding out on stepping down despite consistent pressure from Democratic heavyweights to do so. Since his exit new questions have swirled about his physical and mental abilities as his term ended.\n\nLooking ahead to 2028, whoever runs for Democratic leader will have to unify a fractious party with low approval ratings that is struggling to slow Trump’s agenda in Washington.","summary":"Former vice president vowed to ‘remain in the fight,’ fueling speculation she may be preparing for another presidential run in 2028","url":"https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-california-governor-2026-president-b2799141.html","image":"https://static.independent.co.uk/2025/06/27/16/45/GettyImages-2218984974.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/TEV2fOz2-4VHSaSK0.mp4","publish_date":"2025-07-30 20:15:29","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","source_country":"gb","sentiment":-0.111},{"id":346730454,"title":"Former Vice President Kamala Harris Says She Will Not Run For California Governor In 2026 | N18G","text":"Last Updated:July 31, 2025, 01:43 IST Videos\n\nFormer Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.“Over the past six months, I have spent time reflecting on this moment in our nation’s history and the best way for me to continue fighting for the American people and advancing the values and ideals I hold dear,” Harris said in a statement released by her office Wednesday. News18 Mobile App - https://onelink.to/desc-youtube","summary":"Former Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.“Over the past six months, I have spent time reflecting on this moment in our nation’s history and the best way for me to continue fighting for the American people and advancing the values and ideals I hold dear,” Harris said in a statement released by her office Wednesday. News18 Mobile App - https://onelink.to/desc-youtube","url":"https://www.news18.com/videos/former-vice-president-kamala-harris-says-she-will-not-run-for-california-governor-in-2026-n18g-9474533.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/1753906623_aecd0ed3-f5eb-4218-b07f-c4131adf8d3b.jpeg","video":null,"publish_date":"2025-07-30 20:13:41","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.2},{"id":346739568,"title":"Kamala Harris announces she will not run for California governor in 2026","text":"She added: “For now, my leadership — and public service — will not be in elected office.\n\n“I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.”\n\nHarris’s decision follows a long period of uncertainty about her next steps following November’s defeat. \n\nThose close to the former vice president said she had been quietly staging a political return. Some claimed she wanted to enter the 2026 gubernatorial contest, while others said she was laying the groundwork for a third White House run. \n\nHarris’s lack of definite answers, until now, had put the California contest on hold as candidates and deep-pocketed donors waited for her to make a move.\n\n“Vice President Harris’s decision to not enter the California Governor’s race should not be a surprise,” Jeff Le, former deputy Cabinet secretary to Democratic California Gov. Jerry Brown, told the Washington Examiner.\n\n“She largely spent months away from the spotlight in a will she, won’t she holding pattern that froze gubernatorial aspirants for months. The Vice President had not aggressively done the comprehensive donor and stakeholder canvassing necessary to galvanize support for a state of almost 40 million constituents, a sign of political uncertainty. \n\n“While the Vice President’s name ID and national exposure had put her at the top of California polls, it was also clear that many of the candidates were not going to defer to her, including former Representative Katie Porter and former LA Mayor Antonio Villaraigosa who declared staying in the race regardless of the VP’s decision.”\n\nVeteran Democratic strategist Sean Clegg, a longtime adviser to Harris, told the Los Angeles Times that Harris had weighed a gubernatorial run but decided her next chapter would be focused on other political pursuits.\n\n“I think she listened to her gut. … Obviously, she saw a huge opportunity, so she had to consider it, but at the end of the day, she just didn’t feel called,” said Clegg, who has worked on Harris’s campaigns since 2008. “Until January of this year … she’s been in public office continuously for 22 years and has spent her entire career since she graduated law school in public service. I think she’s interested in exploring how she can have an impact from the outside for a while.”\n\nHarris has purportedly written a memoir and is considering starting a nonprofit group focused on young voters.\n\nHarris became the Democratic Party’s presidential nominee after former President Joe Biden dropped out following a disastrous debate performance against Trump and a pressure campaign from senior Democrats to step aside.\n\nAlthough Harris’s campaign debuted to a wave of enthusiasm, she was handily beaten by Trump in November after blowing through $1.5 billion in 15 weeks. The campaign dished out large sums of money on advertising, social media influencers, staff, celebrity concerts, drone shows, and a town hall featuring Oprah Winfrey.\n\nFor all the time, money, and effort, Harris had very little to show for it. She became the first Democratic presidential candidate to lose the national popular vote in two decades, falling to Trump in every battleground state.\n\nShe spent the first seven months of 2025 settling back into her Brentwood, California, home with husband Doug Emhoff. \n\n“Losses are hard in politics,” Mike Nellis, a Democratic strategist who served as senior adviser to Harris and Sen. Adam Schiff (D-CA), told the Washington Examiner. “People put their lives on hold to serve and to run, and she deserves the opportunity to rest, clear her head, and decide what she thinks is best — for herself, for the people of California, for the people of this country, and for her family, for that matter.”\n\nHad Harris decided to run for governor of California, it wouldn’t have been as easy a win as some believed. She was known as a progressive hero, but when she ran for president, she started to shy away from some of her more extreme positions, quietly erasing her record and turning herself into a centrist Democrat because she thought it would make her more electable. She publicly changed her mind on fracking, border security, the Green New Deal, and taxes on tips.\n\nThe former vice president would have also opened herself up to questions about her 107-day sprint to the White House, what she knew about Biden’s declining health, and whether someone who had run unsuccessfully for president twice really wanted to be California’s governor.\n\nShe also would have inherited a difficult budget situation brought on by fiscal mismanagement and multibillion-dollar gaps due to a flurry of spending by Gov. Gavin Newsom (D-CA).\n\nWednesday’s announcement did not rule out a third run for the White House. If she decided to get into the 2028 race, she would undoubtedly face a competitive Democratic field that could include California’s current governor.","summary":"Former Vice President Kamala Harris announced Wednesday she would not run for California governor in 2026, ending months of speculation that she might. In a statement posted on X, Harris, who was defeated by President Donald Trump in the 2024 presidential election, wrote: “In recent months, I have given serious thought to asking the people [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3486639/kamala-harris-not-run-california-governor-2026/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/AP25211676373525.webp","video":null,"publish_date":"2025-07-30 20:13:00","author":"Barnini Chakraborty","authors":["Barnini Chakraborty"],"language":"en","source_country":"US","sentiment":0.097},{"id":346722838,"title":"Kamala Harris rules out running for California governor","text":"Her decision leaves the door open for her to mount another try for the White House in 2028, while also removing a possible frontrunner from the race to succeed Governor Gavin Newsom, a fellow Democrat understood to have his own presidential ambitions.\n\nIn her statement, Harris appeared to address worries within her own party about its direction and future after she lost November's election to President Donald Trump.\n\n\"As we look ahead, we must be willing to pursue change through new methods and fresh thinking—committed to our same values and principles, but not bound by the same playbook,\" she posted.\n\nPrimaries for California's next governor are set to take place in June 2026, before the general election in November. Newsom is completing his second and final term and the new governor will take office in 2027. \n\nDemocrats dominate the state's political leadership, and whoever wins the party's nomination will be expected to then take the governorship. Arnold Schwarzenegger, the last Republican to serve as governor, left office in 2011.\n\nAn economic powerhouse of America, California would be the world's 5th largest economy if it were a country. It's also home to the Silicon Valley, where companies like Apple and Meta are based, giving its governor, as well as its regulations and laws, influence at the national level.","url":"https://www.bbc.com/news/articles/czd05mzp874o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/ffef/live/4bc82be0-6d7b-11f0-89ea-4d6f9851f623.jpg","video":null,"publish_date":"2025-07-30 20:09:02","author":"Jake Lapham","authors":["Jake Lapham"],"language":"en","category":"politics","source_country":"gb","sentiment":0.228},{"id":346728940,"title":"Kamala Harris decides not to run for governor of California","text":"WASHINGTON: Former Vice President Kamala Harris will not run for California governor, she announced Wednesday, ending months of speculation following her 2024 defeat to Donald Trump in the presidential race.\n\n“In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor,” Harris said in a prepared statement. “I love this state, its people, and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election.”\n\n“For now, my leadership and public service will not be in elected office,” she continued. “I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans.”\n\nHarris, who did not address a possible 2028 presidential candidacy, added: “In the United States of America, power must lie with the people. And We, the People must use our power to fight for freedom, opportunity, fairness, and the dignity of all. I will remain in that fight.”\n\nHarris held statewide office in California for 10 years, first as the state attorney general and then for four years as a U.S. senator, before she resigned to assume the vice presidency after Joe Biden won the 2020 election. She then replaced Biden as the Democratic presidential nominee in 2024 after he dropped out of the race.\n\nA person close to Harris who spoke with her Wednesday said Harris looked forward to talking to Californians and people across the country about this moment, but as a private citizen. They insisted that Harris had a path to victory if she had run for governor.\n\n“Stay tuned because she’s going to have other announcements and they’re not about 2028,” the person said.\n\n“She still wants to be part of the national conversation and talk about Donald Trump and being in debates and forums in California is not going to allow her to do that,” the person added.\n\nHarris’ decision keeps the race to be California’s next governor wide open. Democratic Gov. Gavin Newsom, who came up through San Francisco politics alongside Harris, is unable run for re-election due to term limits.\n\nA number of Democrats have jumped into the race to succeed Newsom, including Lt. Gov Eleni Kounalakis; former Health and Human Services Secretary and state Attorney General Xavier Becerra; former Rep. Katie Porter; former state Senate President Toni Atkins, and former Los Angeles Mayor Antonio Villaraigosa, among others.\n\nThe party is expected to hold onto the governorship in the heavily Democratic state, which Harris carried by 20 points in the last presidential race.\n\nCourtesy: NBC","summary":"WASHINGTON: Former Vice President Kamala Harris will not run for California governor, she announced Wednesday, ending months of speculation following her 2024 defeat to Donald Trump in the presidential race. &#8220;In recent months, I have given serious thought to asking the people of California for the privilege to serve as their Governor,&#8221; Harris said in [&#8230;]","url":"https://thefrontierpost.com/kamala-harris-decides-not-to-run-for-governor-of-california/","image":"https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvdGhlZnJvbnRpZXJwb3N0LmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDdcLzQ5YWYyNzJiYTQyMDY0NjAyMGU3MzBlMDQxZjQ1ZDhlLTEwMjR4NjgzLmpwZyIsInR4dCI6IkthbWFsYSBIYXJyaXMgZGVjaWRlcyBub","video":null,"publish_date":"2025-07-30 19:54:17","author":"The Frontier Post","authors":["The Frontier Post"],"language":"en","category":"politics","source_country":"pk","sentiment":0.185},{"id":346738000,"title":"Kamala Harris confirms she won’t run for California Governor in 2026, eyes new national role- here's what she plans to do instead","text":"Kamala Harris won’t run for California Governor in 2026: Former Vice President Kamala Harris has announced that she will not run for governor of California in 2026. Her announcement ends one chapter but sparks further speculation about her long-term political goals. Harris appears to be reshaping her influence outside of elected office with new organizations.While once considered the favorite, she expressed a desire to lead outside of elected office. Her future plans may include forming a political action committee, conducting a listening tour in Southern states, or preparing for a presidential run in 2028, as per a report.Why is Harris skipping the 2026 governor’s race?On Wednesday, former Vice President Kamala Harris declared she would not seek the 2026 California gubernatorial election, putting an end to speculation about her interest in the position but igniting fresh speculation about the 2024 Democratic presidential nominee's future plans, as per a report by CNN.Live EventsALSO READ: Aimee Osbourne makes a rare appearance at Ozzy’s Funeral, honouring a quiet legacy\"My leadership — and public service — will not be in elected office for the time being,\" she stated in a statement issued on Wednesday. \"I am eager to return to the American public and listen to their concerns, assist in electing Democrats nationwide who will not back down, and provide additional information about my own plans in the coming months.\"Harris and her team said she would take some time to consider her options after losing to President Donald Trump. One of those options was to run for governor of California or possibly for president again in 2028.However, Harris also encountered skepticism from some home-state Democrats who were worried about the fallout from her failed White House campaign and the possibility of her being dragged across the state's crucial midterm US House districts, as per a report by CNN.Could she run for president again in 2028?During the lengthy discussions, Harris had asked aides for research and memos outlining alternative options, as well as contacted former California governors to find out what she could accomplish on the job.These include establishing a 501(c)(4) organization that focuses on the information ecosystem and how to empower younger voters while rethinking democratic institutions, forming a political action committee to raise funds for other candidates, and conducting a listening tour of Southern states in preparation for a 2028 presidential run.Prior to the announcement of an anticipated fall book tour, Harris wanted to decide whether to run. That news will be released shortly. According to someone familiar with her thinking, she reasoned that if she didn't run for governor, she would have time for all of these.What role does she see for herself now?In her statement on Wednesday, she declared, \"I have extraordinary admiration and respect for those who dedicate their lives to public service—service to their communities and to our nation.” “At the same time, we must recognize that our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis. As we look ahead, we must be willing to pursue change through new methods and fresh thinking — committed to our same values and principles, but not bound by the same playbook.”That statement is a sign of a bigger change in her mind. Harris doesn't seem to be jumping into another high-profile campaign. Instead, she seems to be focused on changing the Democratic Party's message and infrastructure, especially as the party gets ready for important midterm elections in 2026.In California, where the Democratic field is still crowded with names like former Rep. Katie Porter, former Los Angeles Mayor Antonio Villaraigosa, and former HHS Secretary Xavier Becerra, Harris's decision to drop out changes the race completely. Some Democrats were hesitant, even though she was a well-known name in the state, because they were still worried about how she did in the 2024 presidential campaign.Kamala Harris will stay out of elected office, but not out of politics. Her decision clears the path for other Democrats in California while allowing her to focus on a broader agenda. Whether that leads to another presidential run remains to be seen. Kamala Harris is not done shaping the political future of the Democratic Party, she’s just getting started again, from a different angle.FAQsIs Kamala Harris running for Governor in 2026?No, she has confirmed that she will not participate in the race.What are her plans instead?She is looking into national organizing efforts and possibly running for president in 2028.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onKamala Harris 2026California governor raceHarris presidential run 2028Kamala Harris political plansDemocratic Party futureCalifornia politicsKamala Harris announcementKamala HarrisKamala Harris won’t run for California Governorkamala\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onKamala Harris 2026California governor raceHarris presidential run 2028Kamala Harris political plansDemocratic Party futureCalifornia politicsKamala Harris announcementKamala HarrisKamala Harris won’t run for California Governorkamala(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Kamala Harris will not contest for California governor in 2026. This ends speculation about her interest in the position. She plans to reshape her influence outside elected office. Harris may form a political action committee. She might conduct a listening tour in Southern states. A presidential run in 2028 is also possible. She will focus on national organizing efforts.","url":"https://economictimes.indiatimes.com/news/international/us/kamala-harris-confirms-she-wont-run-for-california-governor-in-2026-eyes-new-national-role-heres-what-she-plans-to-do-instead/articleshow/123005384.cms","image":"https://img.etimg.com/thumb/msid-123005388,width-1200,height-630,imgsize-85082,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-30 19:52:53","author":"Tionskamala Harris","authors":["Tionskamala Harris"],"language":"en","source_country":"in","sentiment":0.101},{"id":346739960,"title":"Democratic senator addresses whether Kamala Harris has reached the end of her political career","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics July 30, 2025 06:23 \n\n Democratic senator addresses whether Kamala Harris has reached the end of her political career \n Sen. Chris Coons, D-Del., weighs in on former Vice President Kamala Harris' decision against running for California governor and debates the impact of President Donald Trump's tariffs on prices on 'The Story.'\n Tags POLITICSSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE STORYV-VIDEOKAMALA HARRISDEMOCRAT ELECTIONSSENATE DEMOCRATSDONALD TRUMPTRADETRADEINFLATIONGROWTHCALIFORNIADELAWARESTATE AND LOCAL ELECTIONSGOVERNORS","summary":"Sen. Chris Coons, D-Del., weighs in on former Vice President Kamala Harris&apos; decision against running for California governor and debates the impact of President Donald Trump&apos;s tariffs on prices on &apos;The Story.&apos;","url":"https://www.foxnews.com/video/6376346759112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ef3e392f-dd28-4f8e-9a3c-be52f8f8398f/9cafbd2e-894d-4d9b-b10a-98bf12893cf8/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-30 19:46:22","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.192},{"id":346723242,"title":"Kamala Harris Opts Out of California Governor’s Race","text":"Kamala Harris announced Wednesday that she will not run for California governor, ending months of speculation that the former vice president would seek to succeed Gavin Newsom. “For now, my leadership — and public service — will not be in elected office,” she said in a statement. Harris would have been a leading contender, and […]","summary":"Kamala Harris announced Wednesday that she will not run for California governor, ending months of speculation that the former vice president would seek to succeed Gavin Newsom. &#8220;For now, my leadership &#8212; and public service &#8212; will not be in elected office,&#8221; she said in a statement. Harris would have been a leading contender, and [&#8230;]","url":"https://variety.com/2025/politics/news/kamala-harris-opts-out-california-governor-1236474722/","image":"https://variety.com/wp-content/uploads/2024/07/Kamala-Harris.jpg","video":null,"publish_date":"2025-07-30 19:42:07","author":"Gene Maddaus,Gmaddaus","authors":["Gene Maddaus","Gmaddaus"],"language":"en","category":"politics","source_country":"US","sentiment":-0.264},{"id":346735468,"title":"Kamala Harris Says No To California Governor Bid — All In On 2028?","text":"Former Vice President Kamala Harris has announced that she will not be entering the race for Governor of California. “After deep reflection, I’ve decided that I will not run for Governor in this election,” said in her statement. “For now, my leadership – and public service – will not be in elected office,” she wrote. Harris, who previously served as California’s attorney general and US senator, did not reveal much about what’s next but hinted at future plans, saying that she would share more “in the months ahead.” Her move has fueled further talk that she may be focusing her sights on a possible 2028 presidential run instead. The statement has ended months of speculation about her potential entry into a race which is currently filled with lesser-known candidates. This is a developing story. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Former Vice President Kamala Harris has announced that she will not be entering the race for Governor of California.","url":"https://www.timesnownews.com/world/us/us-news/kamala-harris-says-no-to-california-governor-bid-all-in-on-2028-article-152377196","image":"https://images.timesnownews.com/thumb/msid-152377198,thumbsize-634279,width-1280,height-720,resizemode-75/152377198.jpg","video":null,"publish_date":"2025-07-30 19:35:03","author":"Saihaj Madan","authors":["Saihaj Madan"],"language":"en","category":"politics","source_country":"in","sentiment":0.332},{"id":346739946,"title":"Steve Hilton: Kamala Harris has shown zero interest in any of these issues","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics July 30, 2025 02:59 \n\n Steve Hilton: Kamala Harris has shown zero interest in any of these issues \n Steve Hilton discusses former Vice President Kamala Harris deciding against running for California governor on 'The Story.'\n Tags POLITICSV-VIDEOTHE STORYSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIR","summary":"Steve Hilton discusses former Vice President Kamala Harris deciding against running for California governor on &apos;The Story.&apos;","url":"https://www.foxnews.com/video/6376344394112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/4af602e7-6acb-4d8f-bbe2-41430275020d/6f5cbe27-755c-404e-9ceb-a6d5bd3c0d1a/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-30 19:28:45","author":null,"language":"en","source_country":"us","sentiment":0.099},{"id":346739962,"title":"Kamala Harris reveals whether she will run for California governor","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Politics July 30, 2025 03:22 \n\n Kamala Harris reveals whether she will run for California governor \n 'The Story' anchor Martha MacCallum reports on former Vice President Kamala Harris' decision regarding running for California governor.\n Tags POLITICSSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE STORYV-VIDEOKAMALA HARRISCALIFORNIAGOVERNORSSTATE AND LOCAL ELECTIONSDEMOCRAT ELECTIONSHOUSE OF REPRESENTATIVES DEMOCRATSPENNSYLVANIA","summary":"&apos;The Story&apos; anchor Martha MacCallum reports on former Vice President Kamala Harris&apos; decision regarding running for California governor.","url":"https://www.foxnews.com/video/6376345857112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/0453ed39-14f8-4ae2-8214-19d05ac8c3fd/5a3103b4-fc51-4193-a865-93ec4144e897/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-30 19:27:48","author":null,"language":"en","source_country":"us","sentiment":0.455},{"id":346721910,"title":"Former Vice President Kamala Harris will not run for California governor","text":"Former Vice President Kamala Harris confirmed Wednesday she won’t enter the 2026 California governor’s race, ending months of mounting speculation about a return to politics after a crushing defeat in the 2024 presidential race to Donald Trump.In a statement posted to her social media account, Harris said she had \"reflected deeply\" and decided not to seek elected office \"for now.\"\"For now, my leadership - and public service - will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,\" Harris wrote in a statement.Harris, who served as California’s Attorney General and later as U.S. senator before becoming Vice President under President Joe Biden in 2021, was widely considered a leading contender to succeed term-limited Democrat Governor Gavin Newsom. ‘NO ONE’ EXCITED ABOUT KAMALA HARRIS’ POTENTIAL GUBERNATORIAL RUN, SAY CALIFORNIA DONORS Though she called California \"my home\" and expressed pride in serving the state, Harris said her efforts would be focused elsewhere. The announcement reconfigures the 2026 Democratic primary field, potentially clearing the way for candidates like Lt. Gov. Eleni Kounalakis, Attorney General Rob Bonta, and former Los Angeles Mayor Eric Garcetti to mount less encumbered campaigns. In her X post, Harris seemed to signal she isn’t retreating from politics entirely. \"We must be willing to pursue change through new methods and fresh thinking—committed to our same values and principles, but not bound by the same playbook,\" she wrote. \"My leadership—and public service—will not be in elected office.\"CLICK HERE TO GET THE FOX NEWS APP While stepping aside from the race, Harris vowed to continue the fight for \"freedom, opportunity, fairness, and the dignity of all.\"This is a breaking news story. Check back later for more updates.","summary":"Former Vice President Kamala Harris announced on Wednesday that she would not be seeking the governor&apos;s office in her home state of California via X post.","url":"https://www.foxnews.com/politics/former-vice-president-kamala-harris-not-run-california-governor","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/07/kamala-harris.jpg","video":"https://www.foxnews.com/video/6376172069112","publish_date":"2025-07-30 19:27:35","author":"Jasmine Baehr","authors":["Jasmine Baehr"],"language":"en","category":"politics","source_country":"US","sentiment":0.065},{"id":346721954,"title":"Former VP Kamala Harris says she will not run for California governor in 2026","text":"Former Vice President Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.\n\n“Over the past six months, I have spent time reflecting on this moment in our nation’s history and the best way for me to continue fighting for the American people and advancing the values and ideals I hold dear,” Harris said in a statement released by her office Wednesday.\n\n“I have given serious thought to asking the people of California for the privilege to serve as their governor. I love this state, its people and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election,” she said.\n\nHarris’ decision extends a guessing game about her political future that started after she lost last year’s presidential election to Donald Trump. Harris spent months privately considering whether to run for governor, stage another run for the White House or step away from electoral politics altogether after her bruising defeat by Trump.\n\nShe has not ruled out another run for president, after unsuccessful bids in 2020 and 2024. It’s not known when she will make that decision.\n\nIn her statement, Harris never mentions Trump directly but said “our politics, our government, and our institutions have too often failed the American people, culminating in this moment of crisis.”\n\n“For now, my leadership — and public service — will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,” Harris added.\n\n“In the United States of America, power must lie with the people. And We, the People must use our power to fight for freedom, opportunity, fairness and the dignity of all. I will remain in that fight,” the statement said.\n\nHarris would have entered the crowded contest to replace term-limited Gov. Gavin Newsom as a front-runner given her widespread name recognition, fundraising prowess and track record of winning statewide elections. Before serving as U.S. senator and vice president, she was elected state attorney general and district attorney in San Francisco.\n\nBut after years in Washington on the national and international stage, it was never clear if Harris was interested in returning to the less-glamorous world of statehouse politics in Sacramento.\n\nOutside California, Harris’ political career has been marked by historic firsts but also disappointments.\n\nHarris sought the 2020 Democratic presidential nomination, but dropped out of the race before the leadoff Iowa caucuses — the first defeat of her political career. After Joe Biden chose her as his running mate, she made history as the first woman, Black person or person of South Asian descent to serve as vice president. In 2024, Harris became the Democratic presidential nominee after Biden left the race months before Election Day and endorsed her. She lost that race to Trump, who won every swing state.\n\nHarris faces some uncertainty if she chooses to make another White House run.\n\nHarris would have to convince national Democrats that she’s the face of the party’s future, despite losing to Trump last fall. She also carries the baggage of being tied to Biden, whom Democrats have increasingly criticized for seeking a second term rather than stepping aside. Biden’s legacy was tarnished as he left office, and since then new questions have swirled about his physical and mental abilities as his term ended.\n\nThe 2028 presidential contest is expected to attract a large field, which could potentially include Newsom. Any candidate will have to unify a fractious Democratic Party with low approval ratings that is struggling to slow Trump’s agenda in Washington.\n\nIn her most extensive public remarks since leaving office in January, Harris said in a San Francisco speech that Trump’s leadership represented a “ wholesale abandonment ” of American ideals.\n\nHarris’ decision not to seek the governorship keeps the contest to replace Newsom wide open. The Democratic field includes former state Sen. Toni Atkins, U.S. Rep. Katie Porter, former Los Angeles Mayor Antonio Villaraigosa, former Biden administration health secretary Xavier Becerra and a handful of other state officeholders.","summary":"Kamala Harris will not run for California governor next year, leaving open the possibility that she could mount a third run for the White House in 2028.","url":"https://timesofsandiego.com/politics/2025/07/30/former-vp-kamala-harris-will-not-run-california-governor-2026/","image":"https://timesofsandiego.com/wp-content/uploads/2024/11/AP24204573860948-1024x683-1.jpg","video":null,"publish_date":"2025-07-30 19:25:30","author":"Associated Press,Susan Walsh","authors":["Associated Press","Susan Walsh"],"language":"en","category":"politics","source_country":"US","sentiment":0.138},{"id":346744156,"title":"Former Vice President Kamala Harris Says She Will Not Run for California Governor in 2026","text":"The heavily watched decision by the former Democratic presidential candidate leaves open both her political future, as she's not ruling out a 2028 presidential bid, and the race to succeed Gavin Newsom.","summary":"The heavily watched decision by the former Democratic presidential candidate leaves open both her political future, as she's not ruling out a 2028 presidential bid, and the race to succeed Gavin Newsom.","url":"https://www.hollywoodreporter.com/news/politics-news/kamala-harris-not-running-california-governor-2026-1236334048/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/08/GettyImages-2167987259-H-2024.jpg","video":null,"publish_date":"2025-07-30 19:20:28","author":"Hilary Lewis,The Associated Press","authors":["Hilary Lewis","The Associated Press"],"language":"en","category":"politics","source_country":"bz","sentiment":0.175},{"id":346719882,"title":"Kamala Harris will not run for governor of California in 2026","text":"WASHINGTON >> Democratic former Vice President Kamala Harris said today she will not run for governor of California, ending speculation that the failed presidential candidate would seek the high-profile post.\n\n“I have given serious thought to asking the people of California for the privilege to serve as their Governor. I love this state, its people, and its promise. It is my home. But after deep reflection, I’ve decided that I will not run for Governor in this election,” she said in a statement.\n\nHarris said she would not run for office now, leaving the door open for a possible presidential bid in 2028.\n\n“For now, my leadership — and public service — will not be in elected office. I look forward to getting back out and listening to the American people, helping elect Democrats across the nation who will fight fearlessly, and sharing more details in the months ahead about my own plans,” she said.\n\nHarris has kept a relatively low profile since losing the presidential election to Republican Donald Trump in 2024.\n\nCalifornia Governor Gavin Newsom, a Democrat who has held the post since 2019, cannot run for re-election due to term limits.\n\nOther high-profile Democrats have announced their candidacy, including Xavier Becerra, who served as health and human services director under former President Joe Biden and former U.S. Representative Katie Porter.","summary":"WASHINGTON >> Democratic former Vice President Kamala Harris said today she will not run for governor of California, ending speculation that the failed presidential candidate would seek the high-profile post.","url":"https://www.staradvertiser.com/2025/07/30/breaking-news/kamala-harris-will-not-run-for-governor-of-california-in-2026/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_20250501_brk_kma01.jpg","video":null,"publish_date":"2025-07-30 19:20:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":0.076}]}