{"offset":0,"number":50,"available":297,"news":[{"id":341268456,"title":"Douglas Schoen: New York City moves left, California moves right","text":"Zohran Mamdani’s surprise victory in last month’s New York City Democratic Mayoral primary has raised two important questions that may impact the direction of the Democratic Party, and thus American politics. \n\nFirst, does Mamdani’s win offer definitive proof of the power of the progressive wing of the Democratic Party, or was it a relative fluke due to circumstances too unique to be replicated in other cities, states, or on the national level?\n\nSecond, as it relates to California specifically, will Mamdani’s victory boost a progressive movement that has seen voters increasingly reject it in recent years?\n\nTo be sure, there are legitimate arguments for both sides of these questions.\n\nIndeed, Mamdani not only won, but, in receiving 56% of the final vote, soundly defeated the competition led by former Gov. Andrew Cuomo.\n\nMoreover, the 33 year old state Assemblyman was carried to victory by an extremely diverse coalition, winning Asian voters (+15), Hispanic voters (+6), and White voters (+5) according to an analysis by the New York Times.\n\nSimilarly, the winning formula behind Mamdani’s campaign – savvy use of social media – is not particularly hard for other progressive candidates to replicate.\n\nAll of this has emboldened progressives across the country.\n\nCommon Sense, a progressive news outlet, has declared that Mamdani’s win proves the need for Democrats to welcome the rise of socialists within the party and the start of a total shakeup of the party to give more influence to the far-left.\n\nConversely, there are reasons to believe that, rather than underscoring the dominance and appeal of progressives, Mamdani’s victory could simply be chalked up to a perfect storm of circumstances that are not present in other elections.\n\nMamdani’s top challenger, Cuomo, had spent a decade as governor of New York and was seen as the establishment candidate at a time when 69% of voters say the Democratic establishment is “out of touch” per Washington Post polling.\n\nFurther, New York City itself is idiosyncratic, giving Mamdani a base that may not exist, at least to this scale, elsewhere.\n\nNew York City Democratic primary voters tend to be considerably further to the political left than one would see in other states or on the national level, including a heavy concentration of young, college-educated, and progressive voters.\n\nAccording to a post-election survey from SurveyUSA, “very liberal” voters (32%) made up the biggest share of primary voters. \n\nThis compares to data from Gallup which indicates that less 1-in-10 (9%) voters nationwide consider themselves “very liberal.”\n\nPut another way, it’s difficult to imagine Mamdani’s self-described Democratic Socialist agenda being received as well in purple districts in Pennsylvania, North Carolina, or Georgia.\n\nIn that same vein, assuming Mamdani wins the general election, how he governs will severely impact the fortunes of progressives across the country. \n\nIf his more extreme policies cause the city financial distress, capital flight, or a breakdown in public safety, any enthusiasm he’s generated thus far for progressive leadership will rapidly evaporate.\n\nOf course, the flip side is that if anger towards the Trump administration grows over issues like deportations, tariffs, or other executive overreach, it may further embolden progressives. \n\nOr, given the far-left’s tendency to be the most vocal contingent of the Democratic Party, and the most willing to voice opposition to Trump, it may make their candidates look more appealing to Americans turned off by the administration. \n\nThe second question that arises from Mamdani’s win is whether it translates into renewed strength for progressives in California, or even the possibility of a far-left candidate making their mark on the upcoming gubernatorial election.\n\nAs the biggest solidly blue state in the country, California politics are often further to the left of other states, but in recent years, progressives have seen their influence wane.\n\nHowever, progressives there are viewing Mamdani’s win as a “harbinger” of things to come, according to a recent Politico article. \n\nAnd yet, there are signs that Californians may not be ready to return to progressive governance.\n\nConsider San Francisco, a former bastion of the state’s far-left. Just three years ago, voters recalled District Attorney Chesa Boudin, amid mounting exhaustion with progressive criminal justice policies. Then last year, the city elected centrist Democrat Daniel Lurie as mayor, doubling down on a shift towards the center and away from progressive candidates.\n\nAt the same time, the 2024 election showed a considerable shift to the right among California voters. \n\nFormer Vice President Kamala Harris’ 20-point margin of victory over President Trump was the smallest for a Democrat since 2004, and Trump flipped 10 counties that had voted for former President Biden in 2020.\n\nThe state’s voters also passed Prop 36, reinstituting tough-on-crime laws.\n\nWith that in mind, is it possible that a reinvigorated progressive wing will impact the gubernatorial election?\n\nThe former VP leads most polls, including a recent UC Irvine survey showing her 15-points ahead of 2nd place Rick Caruso (24% to 9%). \n\nBut, if Harris does not run – she has yet to decide – the race could theoretically be wide open for a progressive candidate.\n\nUltimately, the Democratic Party remains at a crossroads, caught between the growing influence of the far-left, and the more politically viable moderate wing. \n\nWhether or not Mamdani’s victory heralds a new era of a progressive-dominated Democratic Party remains to be seen, but it is far too early to declare a widespread desire for similar candidates. \n\nDouglas Schoen is a longtime Democratic political consultant.","summary":"Ultimately, the Democratic Party remains at a crossroads, caught between the growing influence of the far-left, and the more politically viable moderate wing. ","url":"https://www.ocregister.com/2025/07/13/douglas-schoen-new-york-city-moves-left-california-moves-right/","image":"https://www.ocregister.com/wp-content/uploads/2025/07/AP25183592584242.jpg?w=1024&h=683","video":null,"publish_date":"2025-07-13 23:38:31","author":"Douglas Schoen","authors":["Douglas Schoen"],"language":"en","source_country":"us","sentiment":-0.066},{"id":341269694,"title":"Douglas Schoen: New York City moves left, California moves right","text":"Zohran Mamdani’s surprise victory in last month’s New York City Democratic Mayoral primary has raised two important questions that may impact the direction of the Democratic Party, and thus American politics. \n\nFirst, does Mamdani’s win offer definitive proof of the power of the progressive wing of the Democratic Party, or was it a relative fluke due to circumstances too unique to be replicated in other cities, states, or on the national level?\n\nSecond, as it relates to California specifically, will Mamdani’s victory boost a progressive movement that has seen voters increasingly reject it in recent years?\n\nTo be sure, there are legitimate arguments for both sides of these questions.\n\nIndeed, Mamdani not only won, but, in receiving 56% of the final vote, soundly defeated the competition led by former Gov. Andrew Cuomo.\n\nMoreover, the 33 year old state Assemblyman was carried to victory by an extremely diverse coalition, winning Asian voters (+15), Hispanic voters (+6), and White voters (+5) according to an analysis by the New York Times.\n\nSimilarly, the winning formula behind Mamdani’s campaign – savvy use of social media – is not particularly hard for other progressive candidates to replicate.\n\nAll of this has emboldened progressives across the country.\n\nCommon Sense, a progressive news outlet, has declared that Mamdani’s win proves the need for Democrats to welcome the rise of socialists within the party and the start of a total shakeup of the party to give more influence to the far-left.\n\nConversely, there are reasons to believe that, rather than underscoring the dominance and appeal of progressives, Mamdani’s victory could simply be chalked up to a perfect storm of circumstances that are not present in other elections.\n\nMamdani’s top challenger, Cuomo, had spent a decade as governor of New York and was seen as the establishment candidate at a time when 69% of voters say the Democratic establishment is “out of touch” per Washington Post polling.\n\nFurther, New York City itself is idiosyncratic, giving Mamdani a base that may not exist, at least to this scale, elsewhere.\n\nNew York City Democratic primary voters tend to be considerably further to the political left than one would see in other states or on the national level, including a heavy concentration of young, college-educated, and progressive voters.\n\nAccording to a post-election survey from SurveyUSA, “very liberal” voters (32%) made up the biggest share of primary voters. \n\nThis compares to data from Gallup which indicates that less 1-in-10 (9%) voters nationwide consider themselves “very liberal.”\n\nPut another way, it’s difficult to imagine Mamdani’s self-described Democratic Socialist agenda being received as well in purple districts in Pennsylvania, North Carolina, or Georgia.\n\nIn that same vein, assuming Mamdani wins the general election, how he governs will severely impact the fortunes of progressives across the country. \n\nIf his more extreme policies cause the city financial distress, capital flight, or a breakdown in public safety, any enthusiasm he’s generated thus far for progressive leadership will rapidly evaporate.\n\nOf course, the flip side is that if anger towards the Trump administration grows over issues like deportations, tariffs, or other executive overreach, it may further embolden progressives. \n\nOr, given the far-left’s tendency to be the most vocal contingent of the Democratic Party, and the most willing to voice opposition to Trump, it may make their candidates look more appealing to Americans turned off by the administration. \n\nThe second question that arises from Mamdani’s win is whether it translates into renewed strength for progressives in California, or even the possibility of a far-left candidate making their mark on the upcoming gubernatorial election.\n\nAs the biggest solidly blue state in the country, California politics are often further to the left of other states, but in recent years, progressives have seen their influence wane.\n\nHowever, progressives there are viewing Mamdani’s win as a “harbinger” of things to come, according to a recent Politico article. \n\nAnd yet, there are signs that Californians may not be ready to return to progressive governance.\n\nConsider San Francisco, a former bastion of the state’s far-left. Just three years ago, voters recalled District Attorney Chesa Boudin, amid mounting exhaustion with progressive criminal justice policies. Then last year, the city elected centrist Democrat Daniel Lurie as mayor, doubling down on a shift towards the center and away from progressive candidates.\n\nAt the same time, the 2024 election showed a considerable shift to the right among California voters. \n\nFormer Vice President Kamala Harris’ 20-point margin of victory over President Trump was the smallest for a Democrat since 2004, and Trump flipped 10 counties that had voted for former President Biden in 2020.\n\nThe state’s voters also passed Prop 36, reinstituting tough-on-crime laws.\n\nWith that in mind, is it possible that a reinvigorated progressive wing will impact the gubernatorial election?\n\nThe former VP leads most polls, including a recent UC Irvine survey showing her 15-points ahead of 2nd place Rick Caruso (24% to 9%). \n\nBut, if Harris does not run – she has yet to decide – the race could theoretically be wide open for a progressive candidate.\n\nUltimately, the Democratic Party remains at a crossroads, caught between the growing influence of the far-left, and the more politically viable moderate wing. \n\nWhether or not Mamdani’s victory heralds a new era of a progressive-dominated Democratic Party remains to be seen, but it is far too early to declare a widespread desire for similar candidates. \n\nDouglas Schoen is a longtime Democratic political consultant.","summary":"Ultimately, the Democratic Party remains at a crossroads, caught between the growing influence of the far-left, and the more politically viable moderate wing. ","url":"https://www.sandiegouniontribune.com/2025/07/13/douglas-schoen-new-york-city-moves-left-california-moves-right/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/07/AP25183592584242.jpg?w=150&strip=all","video":null,"publish_date":"2025-07-13 23:38:31","author":"Douglas Schoen,Gqlshare","authors":["Douglas Schoen","Gqlshare"],"language":"en","source_country":"us","sentiment":-0.066},{"id":341231818,"title":"Former Biden Campaign Lawyer Now Works in Trump Justice Department","text":"A lawyer who worked for Joe Biden’s 2020 presidential campaign and for two different offices in the Biden White House now works in President Donald Trump’s administration as an ostensibly nonpolitical staffer at the Justice Department.\n\nWhile presidents appoint more than 3,000 people for political positions, the federal government directly employs roughly 2.3 million people, most of whom serve in purportedly nonpolitical, career positions. The Office of Personnel Management tracks when political appointees transition to career positions—a process often referred to as “burrowing in” to the bureaucracy—and Sarah Scheinman did so in 2022.\n\nEarlier this year, Scheinman posted a photo of herself with President Joe Biden.\n\n“So proud to have served in the Biden-Harris administration these past four years,” she wrote on LinkedIn. “I have worked with the most dedicated public servants in the White House, OMB, and the Department of Justice who every day seek to make things better for all of us.”\n\nAccording to OPM records, Scheinman transitioned from a political role to a career position on Oct. 31, 2022. She left her position as associate general counsel at the Office of Management and Budget to take an attorney-advisor position in the Justice Department’s antitrust division. In the transition, she went from an annual salary of $84,766 to $112,890. \n\nA Justice Department official confirmed to The Daily Signal Tuesday that Scheinman still works at the DOJ. An OMB official confirmed that she previously worked at OMB.\n\nAccording to her LinkedIn profile, Scheinman worked on the Biden campaign legal team from September to December 2020, before joining the White House Presidential Personnel Office in February 2021. She transitioned to OMB in September 2021.\n\nBefore joining the White House, she worked as an associate at Davis Polk & Wardwell. The law firm did not respond to The Daily Signal’s request for comment.\n\nDeep State Opposition\n\nA recent poll found that 75% of Washington, D.C.-based federal employees making $75,000 or more per year who voted for Democrat presidential nominee Kamala Harris in November said they would not follow a lawful Trump order if they considered it bad policy.\n\nWhile some political appointees who took “career” positions may faithfully work for the U.S. government under any president, this poll suggests that some staff inside the federal government may work against the goals of the current president, in this case Trump.\n\nFurthermore, a February Foundation for Government Accountability study found that Democrat employees outnumber Republican employees by a 2-to-1 margin across federal agencies. In the 2024 presidential election, 84% of the money that federal employees gave in political contributions went to Kamala Harris.\n\nFederal workers enjoy workplace protections that make them very difficult to fire. The new administration is seeking to reform these rules to enable the president to fulfill his duties as head of the executive branch without facing opposition from hostile bureaucrats.\n\nScheinman did not respond to The Daily Signal’s request for comment.\n\nThis is the latest in a series on bureaucrats burrowing in. Part one covers eight appointees. Part two focuses on a former Russiagate advisor who works at the Federal Aviation Administration. Part three reveals a former lawyer for then-Sen. Kamala Harris who now works at the Defense Department.","summary":"A lawyer who worked for Joe Biden&#8217;s 2020 presidential campaign and for two different offices in the Biden White House now works in President Donald... Read More\n\n\nThe post Former Biden Campaign Lawyer Now Works in Trump Justice Department appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/13/former-biden-campaign-lawyer-now-works-trump-justice-department/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/Joe-Biden-smile.jpg","video":null,"publish_date":"2025-07-13 18:43:00","author":"Tyler O,Tyler O'Neil","authors":["Tyler O","Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":0.027},{"id":341227872,"title":"My backstage run-in with 'arrogant' Sofia Vergara and her abused ex-hubby that proves Tom Brady is right to dump their fling, reveals KENNEDY","text":"Tom Brady and Sofia Vergara set off five alarm gossip bells last week with rumors of a blossoming yacht romance.\n\nBut then a Brady source scuttled the summer fun — dismissing the tittle-tattle and saying the 53-year-old actress was 'too old' for Tom, 47, and that he could only handle her Colombian hot sauce in 'small doses'.\n\nPredictably, the knives came out for the QB with the most Superbowl hardware in history — and Sofia lovers called him ageist, misogynist scum.\n\nBut, sorry to say: I get it!\n\nThe comely would-be couple were first linked when they sat together over dinner on the newly launched Ritz Carlton yacht. \n\nThe vessel's maiden voyage, off the Italian coast this month, brilliantly piggybacked off the celeb-packed Bezos wedding, with many of their A-list attendees climbing on board to continue the love-in.\n\nRumor has it that Tom personally requested to sit with Sofia — and I bet that's when she started yapping about her favorite subject: Sofia Vergara.\n\nI met Sofia at the 2010 MTV Video Music Awards. She was at the height of her Modern Family fame, but instead of bubbly and bouncy, I found her to be annoying, arrogant and condescending.\n\nShe looked at me, a lowly journalist, like the veritable dirt on her Manolo.\n\nIt was a shame because I was such a fan of her Gloria character, but off camera – and despite her glorious curves — she has some sharp edges.\n\nThat night I also met the man who would become her second ex-husband, actor Joe Manganiello.\n\nHe was the utter opposite: gracious, affable and the kind of humble guy you want to root for. But he also got caught in her propeller.\n\nSoon after their 9-year union imploded last year, Sofia — worth a reported $180 million — gave an interview clearly designed to cut handsome Joe down to size.\n\n'I want somebody that has as much money as me or more, because if not, it's a nightmare. They end up resenting you,' she said.\n\nIf only that were the reason they end up resenting you, Sofia.\n\nThat naughty Tom Brady source told the Daily Mail last week that while the actress is certainly 'his type… he isn't going to start a relationship with her as she is older and stuck in her ways. He knows he could only take her in small doses.'\n\nTranslation: She's hot. But really, really annoying.\n\nShe's part of the Heidi Klum School of aging beauties who desperately advertise their bare assets on social media in a bid to squeeze every bit of daylight out of their hotness before the sun sets for good.\n\nIn fact, we only learned Sofia was on the Ritz Carlton yacht thanks to her constant stream of Insta snaps, showcasing her bodacious but aging backside.\n\nShe has a son who's 33. You wouldn't know it.\n\nAnd despite Brady's own predilection for nude sunbathing and over-plucking those brows, he's actually a pretty private guy.\n\nHis Gisele Bündchen divorce was wounding. And while she's moved swiftly on to play bedroom martial arts with her jiu-jitsu instructor, Tom's been left alone in retirement to worry about their three children.\n\nAfter appearing in a Netflix 'roast' last year — replete with light ribbing about his recent split — Tom admitted he thought of it as a parenting 'f*** up'.\n\n'It was tough on my kids for sure.'\n\nSo it is any wonder he now fears a hot-blooded blabbermouth who may use a union with him as leverage in the TikTok clout-chasing race?\n\nThis Herculean hottie may be a highly sought after, lubed up hunk of man meat, but he's still a real person with real feelings and is entitled to not date someone who'll treat him like a fleshy Vince Lombardi trophy.\n\nAnd spare me the talk of ageism and misogyny. I too am 52 and partnered up with a younger man. But I have enough self-respect to not post every detail of our lives — and my bare body! — and he very much enjoys when I tell him about things from the olden days like 'Diff'rent Strokes' and seeing 'Ferris Bueller's Day Off' at the movies.\n\nTom's just being honest. Let him move on and not pester him to death over dodging this blatant bullet.\n\nFrench Epstein\n\nAttorney General Pam Bondi is praying she never hears the name Jeffrey Epstein ever again. But I'm dumping fuel on the raging conspiracy fire.\n\nRemember Jean-Luc Brunel, the French 'modeling agent' who allegedly pimped out 12-year-old girls to Epstein and friends.\n\nBrunel curiously committed suicide in a Parisian jail, two years after Jeff allegedly off'ed himself.\n\nSorry, Pammy. I'm not helping, am I?\n\n Stupid spice\n\nJust how god awful are Krazy Kamala's political instincts?\n\nDuring the 2024 campaign, she botched a softball sit-down with a friendly podcaster who asked her for her hottest hot take.\n\nHarris's answer to this observant Muslim host: bacon should be used as a 'spice' on everything.\n\nThe buried interview has now resurfaced. Kamala's career has not.\n\nBad double date\n\nThis week Prince and Princess of Wales hosted French President Emanuel Macron and his prize-fighting wife for a state visit.\n\nRoyal watchers were pleased to see the affectionate hometown pair so cozy, as William gently helped his wife down the stairs.\n\nEmanuel was just lucky he didn't get hit again.\n\nValley girl\n\nThe hills were out in Sun Valley as Lauren Sanchez and her trophy husband strolled through the billionaire summer camp with her Rocky Mountains on display. Girl, you got the guy, give the cleavage a rest.\n\nJazzy Jeff squeak out a million for better fitting tops.\n\nSpare a quid?\n\nBarack Obama may be worth a handsome $70 million, but he's still grinding.\n\nBarry is hawking photo-ops and hand shakes at a pair of September speaking gigs in the UK for a cool 1750 pounds a pop.\n\nHe should donate the proceeds to the upkeep of his $1 billion presidential library.\n\nNah… let the taxpayer cover it.\n\nKate Moss looked beat up from the feet up at a recent beach outing.\n\nThe once gorgeous supermodel appears to have skipped the dentist by the look of her corn-tooth smile. Is she playing ex-Johnny Depp in a new biopic?\n\nGen-Z Milli Vanilli\n\nA rediscovered 60s band is smashing it on Spotify.\n\nThe Velvet Sundown has amassed over a million monthly listeners, but it turns out they're as fake as the affection between the First Couple of France.\n\nThis soulless hoax is an AI creation!\n\nWell, they're perfect for a generation raised on iPhones and isolation.","summary":"The knives came out for the QB with the most Superbowl hardware in history - and Sofia lovers called him ageist, misogynist scum. But, sorry to say: I get it!","url":"https://www.dailymail.co.uk/tvshowbiz/article-14901541/Sofia-Vergara-Tom-Brady-KENNEDY.html","image":"https://i.dailymail.co.uk/1s/2025/07/13/19/91270863-0-image-m-11_1752429758887.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/06/30/2854192982399234212/1024x576_MP4_2854192982399234212.mp4","publish_date":"2025-07-13 18:16:50","author":"Editor,Kennedy","authors":["Editor","Kennedy"],"language":"en","source_country":"gb","sentiment":0.118},{"id":341197498,"title":"Trump's 2020 election loss may have been worse for America than his victory, columnist argues","text":"Political columnist Ed Kilgore argued in a piece published Sunday that the U.S. would have been better off if President Donald Trump had won re-election in 2020 over former President Joe Biden. \"A Trump reelection in 2020 would have made the 2024 election in whose shadow we stand a very different proposition. There would have been no Trump campaign of vengeance to rouse the MAGA faithful and desensitize the public to his failings,\" Kilgore wrote in New York Magazine's Intelligencer. Kilgore acknowledged in the column that the idea seemed nuts, noting that Trump would have inherited several burdens had he remained in office. He wrote that everyone would agree that it would have been good if there were no Jan. 6 capitol riot. \"The effect of this scenario on the Democrats of 2024 would have been even more dramatic. A defeated Joe Biden would have gracefully ended his political career in 2021. Kamala Harris would have suffered two debilitating losses in the 2020 presidential cycle, once as a presidential nomination candidate and once as a veep nominee; no one would have considered her a serious candidate for 2024,\" he added. DEM SENATOR SAYS BIDEN SHOULD HAVE DROPPED OUT OF PRESIDENTIAL RACE MUCH SOONER Kilgore said the Democratic Party would have had a normal nominating process leading up to 2024 and that the party would have overcome its divisions between the progressive and establishment wings. A Trump win in 2020, according to Kilgore, would have allowed Democrats and the former president to avoid the key issues that prompted Americans to vote for Trump in 2024, including immigration, inflation and Biden's age. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"The Democratic Party would not be defending record inflation, uncontrolled immigration, too much ‘wokeness,’ a mismanaged withdrawal from Afghanistan, and all sorts of other problems. No one would be writing exposés about an aging Democratic president losing his grip but hanging grimly on to power. Democrats could have managed a fresh start and a likely 2024 win without losing ground with key constituencies or earning the bitter enmity of so many unhappy young people,\" he added. Kilgore said that the Democratic administration's alignment with several negative realities made Trump's political comeback possible. BETO O'ROURKE CLAIMS BIDEN 'FAILED' AMERICA BY RUNNING FOR SECOND TERM The political columnist argued that Trump's comeback led to \"horrific policies\" and a GOP that is \"devoted to hatefulness and extremism.\" He also said that it also left the Democratic Party in shambles, as they lack a clear path forward. CLICK HERE TO GET THE FOX NEWS APP \"Would it have been worse had Trump won in 2020? I don’t think so,\" he concluded.","summary":"The New York Magazine&apos;s Ed Kilgore argued on Sunday that the U.S. would have been better off had President Trump won in 2020 over Joe Biden.","url":"https://www.foxnews.com/media/trumps-2020-election-loss-may-have-been-worse-america-than-his-victory-columnist-argues","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/trump-biden.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-13 15:07:03","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.327},{"id":341189322,"title":"One Year Since Butler, There’s A Lot to Be Thankful For","text":"DAILY CALLER NEWS FOUNDATION—July 13 marks the one-year anniversary of the assassination attempt on President Donald Trump in Butler, Pennsylvania.\n\nThankfully, his life was spared that day by the grace of God, and he was able to continue his re-election campaign to reclaim the presidency. Now that his “One Big Beautiful Bill” is the law of the land, the American people have reason to once again be hopeful for a better future for themselves, their families and their beloved country.\n\nIt takes time to dig out from a failed presidency, when reckless decisions were made for four long years without regard for the damage they would cause. Since taking office in January, Trump and his team have been working to change America’s trajectory.\n\nThe border is now more secure than it’s ever been. The Iranian nuclear threat has been eliminated. The mindset of fiscal responsibility is permeating throughout the federal government. Criminal illegal aliens are being deported. The Pentagon is once again focused on defending America instead of wokeism. Fair trade deals are being negotiated that level the playing field for American workers, and our country is once again respected around the world.\n\nThe enactment of Trump’s policy agenda puts an exclamation point on a successful first six months back in the Oval Office. The consequential bill says loud and clear that Trump and Republicans in Congress are listening to the American people. The legislation extends the pro-growth Trump tax cuts for years to come; provides a record cut in mandatory federal spending that starts to address the national debt crisis; prioritizes Medicaid for those who need it most by implementing work requirements; fully secures the border and funds the largest deportation operation in American history; ends taxes on tips, overtime and Social Security; green lights American energy production to drive down inflation; and dramatically strengthens our national defense with a Golden Dome.\n\nMake no mistake about it, this is an enormous win for Trump, the GOP, and hardworking American families who have been waiting for relief—and common sense—from Washington for far too long. The Joe Biden-Kamala Harris administration was a time of volatility, uncertainty, lawlessness, and malaise. Trump’s signature legislation will finally calm the stormy seas caused by the destructive policies of Biden and the left-wing radicals he delegated authority to.\n\nIt’s fitting to think about what dangerous priorities would have been included in Harris’ first budget reconciliation bill had she been elected last November. By listening to Democrat leaders Chuck Schumer and Hakeem Jeffries and watching their caucuses vote against the One Big Beautiful Bill en bloc, we can assume that the Harris-Tim Walz administration would have not only allowed the Trump tax cuts to expire but would have also called for additional tax increases to bankroll their socialist wish list. The rhetoric coming from the left also makes it clear that the border would still be wide open, and blanket amnesty for illegal immigrants—including criminals—would probably have been a part of the legislation as well. And it goes without saying that the Green New Scam would have been supercharged, inflation would have gone unaddressed, and the corrosive diversity, equity, and inclusion agenda would have been codified.\n\nElections do indeed have consequences. And Trump’s landslide victory spared America from a left-wing agenda that our country may not have been able to recover from.\n\nIn the last few days alone, we’ve seen yet another month of robust job creation. The Supreme Court ruled to stop the unconstitutional practice of nationwide injunctions by partisan district court judges. The Barack Obama administration was exposed for politicizing the 2016 intelligence assessment to frame Trump with the phony Russia hoax. A new fair trade deal with Vietnam was announced, and the stock market is at record levels.\n\nBut due to our nation’s dire financial situation, the president and House Speaker Mike Johnson know there must be more tax reform and additional spending cuts in the form of new reconciliation bills later this year and next spring. After a long period of darkness, these are encouraging times for the United States of America. Come July 13, remember what may have been and say a prayer for Trump.\n\nOriginally published by The Daily Caller News Foundation.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"DAILY CALLER NEWS FOUNDATION—July 13 marks the one-year anniversary of the assassination attempt on President Donald Trump in Butler, Pennsylvania. Thankfully, his life was spared... Read More\n\n\nThe post One Year Since Butler, There’s A Lot to Be Thankful For appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/13/one-year-since-butler-theres-a-lot-to-be-thankful-for/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/20250711Donald-Trump-Shot.jpg","video":null,"publish_date":"2025-07-13 15:00:00","author":"David Bossie,The Daily Caller","authors":["David Bossie","The Daily Caller"],"language":"en","source_country":"us","sentiment":0.131},{"id":341190578,"title":"I Had a Near-Death Experience at Trump Rally: Shielding My Pregnant Wife During Gunfire at the President","text":"Saturday, July 13 – Donald Trump is shot during a rally in Butler, Pennsylvania. The Republican frontrunner is hit in the ear but stands up and pumps his fist to the crowd. Shooter Thomas Matthew Crooks, 20, is shot dead but the Secret Service is slammed for suspected security blunders. Ex-fire chief Corey Comperatore is killed protecting his family.\n\nSunday, July 14 – President Joe Biden calls on Americans to unite and “cool down” political rhetoric in the wake of Trump’s shooting. The Democrat had faced growing calls since his disastrous performance in June’s CNN debate. Shocking video reveals how close Trump came to being killed after turning his head at the last minute.\n\nMonday, July 15 – The Republican National Convention kicks off in Milwaukee, Wisconsin, where Trump is formally nominated as the Republican candidate. An emotional-looking Trump makes his first appearance since surviving the shooting wearing a large ear bandage. It quickly becomes a must-have fashion item at the RNC. Ohio Senator JD Vance is named as Trump’s running mate. Previously anti-Trump, Vance at just 39 is an inexperienced choice, but seen as having a connection with ordinary Americans. In an interview, Biden admits it was a “mistake” to talk about putting Trump in “the bullseye” days before the assassination attempt.\n\nTuesday, July 16 – The FBI warns of more potential violence in the wake of Trump’s shooting. Intelligence claims Iran had a separate plot to assassinate Trump, but there is no proven link to Crooks. Biden returns to the campaign trail for the first time since the assassination attempt and insists he isn’t stepping down.\n\nWednesday, July 17 – Joe Biden tests positive for Covid, just days after saying he would drop out of the presidential race if he was diagnosed with a medical condition. It intensifies the calls for him to step aside with Kamala Harris and Gavin Newsom floated as potential replacements. At the RNC, JD Vance makes his first speech since being selected as Trump’s VP pick, to the delight of the MAGA crowd.\n\nThursday, July 18 – Donald Trump addresses the RNC, his first speech since surviving an attempted assassination. He appears slower and more subdued than usual but gives the longest convention acceptance speech in US history. Just before he goes on, former wrestler Hulk Hogan rips his shirt off and tells cheering crowds “Trumpomania” will sweep America. Former First Lady Melania, who has barely been seen on the campaign trail, makes an appearance but does not speak. Barack Obama joins calls for Biden to step aside.\n\nFriday, July 19 – President Biden appears to consider resigning, as a source says he is in a “contemplative stage” while isolating with Covid. Video emerges showing Biden appearing to lean into the wrong woman after mistaking her for his wife Jill. Meanwhile, the world’s biggest tech outage sparks travel chaos for Republicans leaving the RNC in Milwaukee.\n\nSaturday, July 20 – Donald Trump holds his first campaign rally since the shooting in Butler. He appears in Michigan without his ear bandage. His former doctor Ronny Jackson describes his injuries. He appears in his first interview alongside his running mate Vance. Senior Democrat Nancy Pelosi speaks for the first time since being linked to growing calls for Biden to resign. Meanwhile, Biden’s reelection campaign continues to insist he is running, as a spokesperson slams Trump’s rally remarks as showing he is “focused only on himself.”\n\nSunday, July 21 – Joe Biden announces he isn’t running in November in a shock letter, just hours after insisting he was staying in the race. He is the first incumbent to step down in their first term since 1968. Biden endorses Kamala Harris for president as senior Dems through their support behind the Vice President. The news appears to throw the Republicans off their stride. Biden vows to continue his term until November’s election.\n\nMonday, July 22 – Kamala Harris raises a record $81 million in 24 hours as she secures the Democratic candidacy. She also inherits some $91 million in leftover campaign funds from Biden. Harris gives her first speech since Biden stepped out, and speaks to the president on the phone, although he doesn’t appear in person. Under-pressure Secret Service chief Kimberly Cheatle appears on Capitol Hill and faces increasing calls to resign over the shooting of Trump. She admits the Secret Service “failed” on July 13 and resigns the following day.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA local mayor who was seated in the front row during the&#8230;\n\n\nThis Post: I Had a Near-Death Experience at Trump Rally: Shielding My Pregnant Wife During Gunfire at the President first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/i-had-a-near-death-experience-at-trump-rally-shielding-my-pregnant-wife-during-gunfire-at-the-president/","image":"https://internewscast.com/wp-content/uploads/2025/07/I-was-inches-from-death-as-Trump-rally-gunman-shot.jpg","video":null,"publish_date":"2025-07-13 14:27:41","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.36},{"id":341175264,"title":"World News | 'Beautiful' or 'Ugly,' Trump's Big Bill Shapes Battle for House Control in 2026 Midterms","text":"Washington, Jul 13 (AP) Debate over President Donald Trump's sweeping budget-and-policy package is over on Capitol Hill. Now the argument goes national. From the Central Valley of California to Midwestern battlegrounds and suburban districts of the northeast, the new law already is shaping the 2026 midterm battle for control of the House of Representatives. The outcome will set the tone for Trump's final two years in the Oval Office. Also Read | Is FBI Director Kash Patel Resigning Amid Dan Bongino vs Pam Bondi Row? Republican Leader Fact-Checks Fake News, Says 'Conspiracy Theories Just Aren't True, Never Have Been'. Democrats need a net gain of three House seats to break the GOP's chokehold on Washington and reestablish a power centre to counter Trump. There's added pressure to flip the House given that midterm Senate contests are concentrated in Republican-leaning states, making it harder for Democrats to reclaim that chamber. As Republicans see it, they've now delivered broad tax cuts, an unprecedented investment in immigration enforcement and new restraints on social safety net programmes. Also Read | Iran's President Masoud Pezeshkian Was Injured in Israel's Nasrallah-Style Assassination Plot While High-Level Meeting Was Underway: Report. Democrats see a law that rolls back health insurance access and raises costs for middle-class Americans while cutting taxes mostly for the rich, curtailing green energy initiatives and restricting some workers' organising rights. “It represents the broken promise they made to the American people,” said Rep Suzan DelBene, a Washington Democrat who chairs the party's House campaign arm. “We're going to continue to hold Republicans accountable for this vote.” Parties gear up for a fight Whether voters see it that way will be determined on a district-by-district level, but the battle will be more intense in some places than others. Among the 435 House districts, only 69 contests were decided by less than 10 percentage points in the 2024 general election. The Democratic Congressional Campaign Committee has so far identified 26 Democratic-held seats it must defend vigorously, along with 34 GOP-held seats it believes could be ripe to flip. Republicans' campaign arm, the National Republican Congressional Committee, has so far listed 18 GOP incumbents as priorities, plus two districts opened by retirements. There are a historically low number of so-called crossover districts: Only 13 Democrats represent districts Trump carried in 2024, while just three Republicans serve districts Democratic presidential nominee Kamala Harris carried. Both committees are busy recruiting challengers and open-seat candidates and more retirements could come, so the competitive map will evolve. Still, there are clusters of districts guaranteed to influence the national result. California, despite its clear lean to Democrats statewide, has at least nine House districts expected to be up for grabs: three in the Central Valley and six in southern California. Six are held by Democrats, three by the GOP. Pennsylvania features four districts that have been among the closest national House races for several consecutive cycles. They include a suburban Philadelphia seat represented by Rep Brian Fitzpatrick, one of just two House Republicans to vote against Trump's bill and one of the three GOP lawmakers from a district Harris won. Fitzpatrick cited the Medicaid cuts. Vice President JD Vance plans on Wednesday to be in Republican Rep Rob Bresnahan's northwest Pennsylvania district to tout the GOP package. Bresnahan's seat is a top Democratic target. Iowa and Wisconsin, meanwhile, feature four contiguous GOP-held districts in farm-heavy regions where voters could be swayed by fallout from Trump's tariffs. Democrats fight to define the GOP Beyond bumper-sticker labels – Trump's preferred “Big Beautiful Bill” versus Democrats' “Big Ugly Bill” retort – the 900-page law is, in fact, an array of policies with varying impact. Democrats hammer Medicaid and food assistance cuts, some timed to take full effect only after the 2026 midterms, along with Republicans' refusal to extend tax credits to some people who obtained health insurance through the Affordable Care Act. The Congressional Budget Office estimates that 11.8 million more Americans would become uninsured by 2034 if the bill became law; 3 million more would not qualify for food stamps, also known as SNAP benefits. “Folks will die here in Louisiana and in other parts of the country,” House Minority Leader Jeffries warned last week during a town hall in Republican Speaker Mike Johnson's home state of Louisiana. Jeffries singled out vulnerable Republicans like California Rep David Valadao, who represents a heavily agricultural Central Valley district where more than half the population is eligible for the joint state-federal insurance programme. California allows immigrants with legal status and those who are undocumented to qualify for Medicaid, so not all Medicaid recipients are voters. But the programme helps finance the overall health care system, including nursing homes and hospitals. Republicans highlight the law's tightened work requirements for Medicaid enrollees. They argue it's a popular provision that will strengthen the programme. “I voted for this bill because it does preserve the Medicaid programme for its intended recipients — children, pregnant women, the disabled, and elderly,” Valadao said. “I know how important the programme is for my constituents.” Republicans hope voters 'see lower taxes' The law includes USD 4.5 trillion in tax cuts. It makes permanent existing rates and brackets approved during Trump's first term. Republicans and their allies have hammered vulnerable Democrats for “raising costs” on American households by opposing the bill. GOP campaign aides point to the popularity of individual provisions: boosting the USD 2,000 child tax credit to USD 2,200 (some families at lower income levels would not get the full credit), new deductions on tip and overtime income and auto loans; and a new deduction for older adults earning less than USD 75,000 a year. “Everyone will have more take home pay. They'll have more jobs and opportunity,” Johnson said in a Fox News Sunday interview. “The economy will be doing better and we'll be able to point to that as the obvious result of what we did.” Democrats note that the biggest beneficiaries of Trump's tax code are wealthy Americans and corporations. Pairing that with safety net cuts, Florida Rep Debbie Wasserman Schultz concluded, “The cruelty is the point.” Immigration, meanwhile, was Trump's strongest issue in 2024. NRCC aides say that will continue with the new law's investments in immigration enforcement. Democrats believe the Trump administration has overplayed its hand with its push for mass deportation. Playing the Trump card The president is a titanic variable. Democrats point to 2018, when they notched a 40-seat net gain in House seats to take control away from the GOP. This year, Democrats have enjoyed a double-digit swing in special elections around the country when compared to 2024 presidential results. Similar trends emerged in 2017 after Trump's 2016 victory. Democrats say that reflects voter discontent with Trump once he's actually in charge. Republicans answer that Trump's job approval remains higher at this point than in 2017. But the GOP's effort is further complicated by ongoing realignments: Since Trump's emergence, Democrats have gained affluent white voters -– like those in suburban swing districts -– while Trump has drawn more working-class voters across racial and ethnic groups. But Republicans face a stiffer challenge of replicating Trump's coalition in a midterm election without him on the ballot. Democrats, meanwhile, must corral voters who are not a threat to vote for Republicans but could stay home. Jeffries said he's determined not to let that happen. “We're going to do everything we can until we end this national nightmare.” (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Debate over President Donald Trump's sweeping budget-and-policy package is over on Capitol Hill. Now the argument goes national.","url":"https://www.latestly.com/agency-news/world-news-beautiful-or-ugly-trumps-big-bill-shapes-battle-for-house-control-in-2026-midterms-6993296.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-13 13:48:23","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.107},{"id":341180386,"title":"A year after Trump’s near-assassination, friends and allies see some signs of a changed man","text":"U.S. President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance. \n\n“Did I hear what I think I heard?” Mr. Trump remarked as he spoke from behind a wall of thick, bulletproof glass. “Don't worry, it’s only fireworks. I hope. Famous last words,\" he quipped, drawing laughs and cheers.\n\n“You always have to think positive,\" he went on. \"I didn’t like that sound, either.\"\n\nThe comments, just days before the first anniversary of Trump's near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump's ear and killing one of his supporters in the crowd.\n\nThe attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Mr. Trump's triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden's decision to abandon his reelection bid and the elevation of Vice-President Kamala Harris as his successor.\n\nOne year after coming millimetres from a very different outcome, Mr. Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term, making him even more dug in on achieving his far-reaching agenda.\n\n“I think it’s always in the back of his mind,\" said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Mr. Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. “He’s still a rough and tumble guy, you know. He hasn’t become a Zen Buddhist. But I think he is, I’ll say this, more appreciative. He’s more attentive to his friends,\" he said, pointing to Mr. Trump sending him a message on his birthday earlier this week.\n\nMs. Graham added: \"It’s just a miracle he’s not dead. He definitely was a man who believed he had a second lease on life.\"\n\nWhile many who survive traumatic events try to block them from memory, Mr. Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He's decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, “Fight, fight, fight!\" \n\nA painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president’s residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk. \n\nAnd while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his “all-time favorite chart in history” of southern border crossings that he credits for saving his life. \n\nDuring a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting.\n\n“I get that throbbing feeling every once in a while,\" he said, gesturing to his ear. “But you know what, that’s OK. This is a dangerous business. What I do is a dangerous business.”\n\nMr. Trump will spend Sunday's anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey.\n\nMr. Trump's chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason.\n\n“I would say I think he believes that he was saved. I do. And he would never — even if he thought it before, I don’t think he would have admitted it. And he will now,\" she told “Pod Force One.” \n\nShe, too credited divine intervention. The chart, she noted, “was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn’t happen because it happened. It happened because, I believe, God wanted him to live.”\n\nAs a result, she said, when Trump says things that “are perfunctory — every president says ‘God bless America’ — well, it’s more profound with him now, and it’s more personal.\"\n\nShe also credited the attack with helping change public perceptions of Trump during the campaign.\n\n“For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that’s helpful,\" she said.\n\n“You know, I have an obligation to do a good job, I feel, because I was really saved,” Trump told Fox News Friday. “I owe a lot. And I think — I hope — the reason I was saved was to save our country.” \n\nRoger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when U.S. Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing.\n\nStone said he's found the president “to be more serene and more determined after the attempt on his life” in Butler.\n\n“He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,” he said. \n\nRalph Reed, chairman of the Faith and Freedom Coalition, agreed.\n\n“I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don’t turn your head at that instant,\" he said. “He knew he was lucky to be alive.”\n\nGiven how close Mr. Trump came to a very different outcome, Reed said, “it’s hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I’ve talked to who said they were confident that he would win for that reason. That there must have been a reason.”","summary":"One year after Donald Trump’s near-assassination at a campaign rally in Butler, Pennsylvania, friends and allies see some signs of a changed man","url":"https://www.thehindu.com/news/international/a-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-a-changed-man/article69807642.ece","image":"https://th-i.thgim.com/public/incoming/lstrq/article69807680.ece/alternates/LANDSCAPE_1200/IMG_New_Trump_after_assa_2_1_5SD4KQBL.jpg","video":null,"publish_date":"2025-07-13 13:46:46","author":null,"language":"en","source_country":"in","sentiment":0.096},{"id":341167446,"title":"Sorry, Elon. There’s already a third party, and it’s called MAGA","text":"AgenciesMusk is a political contradiction, with no consistent ideas about policy. \n\nElon Musk just can’t seem to make up his mind. Either he has “done enough” when it comes to political spending and will focus on his businesses or he will spend more money to start a new political party to take on the “uniparty.”“By a factor of 2 to 1, you want a new political party and you shall have it!” Musk wrote on X after posting a poll on July 4. The world’s richest man is right. For years, Americans have stated a desire for another party beyond red or blue. An October Gallup poll showed support for a third party at 58%. The numbers speak to an overall discontent with a lack of choice and distaste for rank partisanship. Third-party support ebbs and flows, but the desire for more choices is a constant.Nevertheless, while voters claim to want more choices, once they cast their ballots, third-party candidates haven’t broken through in any meaningful way. In 2020, 1.79% voted for a third-party candidate for the White House. In 2024, 1.85% of voters backed a candidate not named Kamala Harris or Donald Trump. A group called No Labels tried and failed to identify a credible White House candidate in 2024. Typically, third party candidates have only acted as spoilers; see Ross Perot in 1992, Ralph Nader in 2000 and Jill Stein in 2016. Part of the problem is the very high structural hurdles the two existing parties have put in place to keep rival parties from forming. Live EventsBloombergThere is also this to consider: A third party kind of already exists. It’s called the Republican Party under Trump, otherwise known as MAGA. Rather than run on a third party line, as he explored doing in 2000 with Perot’s Reform Party, Trump rode populist discontent to power within an existing political party.He hijacked the GOP and remade it in his own image with ideas from both parties. He is pro-union, more isolationist than hawk, and against free trade. And he doesn’t care about the debt and deficits — he agrees with Massachusetts Senator Elizabeth Warren that the debt ceiling “should be thrown out entirely.” As one headline from Reason Magazine put it, “Donald Trump Sounds Like a Democrat From the 1980s.”Musk, with his billions and his influence, might be better off bankrolling candidates within the two-party system who offer a similar ideological blend. But for now, he seems set on doing what others before him have tried and failed to do. So let’s take him at his word and assume that the world’s richest man will show some focus and play in the 2026 midterms via a third party. “One way to execute on this would be to laser-focus on just 2 or 3 Senate seats and 8 to 10 House districts,” he posted. “Given the razor-thin legislative margins, that would be enough to serve as the deciding vote on contentious laws, ensuring that they serve the true will of the people.”His strategy actually isn’t a bad one and aligns with what some other groups are doing.“Elon, I don’t know what he is going to do, but I believe some of these candidates he would want to give some cash to,” said Adam Brandon, senior advisor to The Independent Center, a group that will back a handful of independent candidates in the midterms. “If we do this in 2026, this sets up a different conversation in 2028.” The group is hosting what they are billing as the largest independent event in Washington DC later this month, and predicts that 2026 will see an independent surge. But Musk may be a tainted messenger. He once enjoyed a level of support among a wide array of people with differing political views as a kind of real life Tony Stark, but his approval ratings have dipped in recent months, as has his brand. In December, according to a YouGov poll, Musk was even among independent voters, with 42% liking and disliking him. His unfavorable rating is now 59% among that group. His numbers are also down among Democrats and Republicans. It’s true that some people tend to like Musk’s products, even as they dislike him. Witness the Anti-Elon Tesla Club stickers affixed to his signature product. What is missing, however, is a real reason for Musk’s latest version of the disruptive third party. Musk is a political contradiction, with no consistent ideas about policy. He says the America Party is about freedom, yet it seems to be about his own personal grievances with Trump. He claims to care about ballooning deficits, yet is happy to take billions from the federal government to foot the bill for his projects. He claims to care about the environment, yet also claims that global depopulation is a bigger threat than climate change.What would the America Party platform look like and what candidates would it attract? What story would they tell about the big problems the country faces and what would the solutions be? That kind of narrative coherence is necessary, as party affiliation has become an extension of identity. In choosing to back a party, voters are telling a story about who they are, what they believe and how they think the government should operate. It’s akin to joining a club.Musk has billions. But he has few resonant answers to that standard question that can be paraphrased this way when it comes to political parties: What are you and why are you here? Absent that, his third-party ambitions are likely to run aground. (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onElon Muskthird party politicsAmerica PartyRepublican PartyMAGADonald Trump\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onElon Muskthird party politicsAmerica PartyRepublican PartyMAGADonald Trump(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Musk, with his billions and his influence, might be better off bankrolling candidates within the two-party system who offer a similar ideological blend. But for now, he seems set on doing what others before him have tried and failed to do.","url":"https://economictimes.indiatimes.com/news/international/global-trends/sorry-elon-theres-already-a-third-party-and-its-called-maga/articleshow/122419732.cms","image":"https://img.etimg.com/thumb/msid-122419740,width-1200,height-630,imgsize-25730,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-13 13:05:17","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","source_country":"in","sentiment":-0.125},{"id":341167448,"title":"'Beautiful' or 'Ugly,' Trump's big bill shapes the battle for House control in 2026 midterms","text":"NYT News ServiceThe Democratic Congressional Campaign Committee has so far identified 26 Democratic-held seats it must defend vigorously, along with 34 GOP-held seats it believes could be ripe to flip. \n\nWASHINGTON: Debate over President Donald Trump's sweeping budget-and-policy package is over on Capitol Hill. Now the argument goes national. From the Central Valley of California to Midwestern battlegrounds and suburban districts of the northeast, the new law already is shaping the 2026 midterm battle for control of the House of Representatives. The outcome will set the tone for Trump's final two years in the Oval Office. Democrats need a net gain of three House seats to break the GOP's chokehold on Washington and reestablish a power center to counter Trump. There's added pressure to flip the House given that midterm Senate contests are concentrated in Republican-leaning states, making it harder for Democrats to reclaim that chamber. As Republicans see it, they've now delivered broad tax cuts, an unprecedented investment in immigration enforcement and new restraints on social safety net programs. Democrats see a law that rolls back health insurance access and raises costs for middle-class Americans while cutting taxes mostly for the rich, curtailing green energy initiatives and restricting some workers' organizing rights. \"It represents the broken promise they made to the American people,\" said Rep. Suzan DelBene, a Washington Democrat who chairs the party's House campaign arm. \"We're going to continue to hold Republicans accountable for this vote.\"Live Events Parties gear up for a fight Whether voters see it that way will be determined on a district-by-district level, but the battle will be more intense in some places than others. Among the 435 House districts, only 69 contests were decided by less than 10 percentage points in the 2024 general election. The Democratic Congressional Campaign Committee has so far identified 26 Democratic-held seats it must defend vigorously, along with 34 GOP-held seats it believes could be ripe to flip. Republicans' campaign arm, the National Republican Congressional Committee, has so far listed 18 GOP incumbents as priorities, plus two districts opened by retirements. There are a historically low number of so-called crossover districts: Only 13 Democrats represent districts Trump carried in 2024, while just three Republicans serve districts Democratic presidential nominee Kamala Harris carried. Both committees are busy recruiting challengers and open-seat candidates and more retirements could come, so the competitive map will evolve. Still, there are clusters of districts guaranteed to influence the national result. California, despite its clear lean to Democrats statewide, has at least nine House districts expected to be up for grabs: three in the Central Valley and six in southern California. Six are held by Democrats, three by the GOP. Pennsylvania features four districts that have been among the closest national House races for several consecutive cycles. They include a suburban Philadelphia seat represented by Rep. Brian Fitzpatrick, one of just two House Republicans to vote against Trump's bill and one of the three GOP lawmakers from a district Harris won. Fitzpatrick cited the Medicaid cuts. Vice President JD Vance plans on Wednesday to be in Republican Rep. Rob Bresnahan's northwest Pennsylvania district to tout the GOP package. Bresnahan's seat is a top Democratic target. Iowa and Wisconsin, meanwhile, feature four contiguous GOP-held districts in farm-heavy regions where voters could be swayed by fallout from Trump's tariffs. Democrats fight to define the GOP Beyond bumper-sticker labels - Trump's preferred \"Big Beautiful Bill\" versus Democrats' \"Big Ugly Bill\" retort - the 900-page law is, in fact, an array of policies with varying impact. Democrats hammer Medicaid and food assistance cuts, some timed to take full effect only after the 2026 midterms, along with Republicans' refusal to extend tax credits to some people who obtained health insurance through the Affordable Care Act. The Congressional Budget Office estimates that 11.8 million more Americans would become uninsured by 2034 if the bill became law; 3 million more would not qualify for food stamps, also known as SNAP benefits. \"Folks will die here in Louisiana and in other parts of the country,\" House Minority Leader Jeffries warned last week during a town hall in Republican Speaker Mike Johnson's home state of Louisiana. Jeffries singled out vulnerable Republicans like California Rep. David Valadao, who represents a heavily agricultural Central Valley district where more than half the population is eligible for the joint state-federal insurance program. California allows immigrants with legal status and those who are undocumented to qualify for Medicaid, so not all Medicaid recipients are voters. But the program helps finance the overall health care system, including nursing homes and hospitals. Republicans highlight the law's tightened work requirements for Medicaid enrollees. They argue it's a popular provision that will strengthen the program. \"I voted for this bill because it does preserve the Medicaid program for its intended recipients - children, pregnant women, the disabled, and elderly,\" Valadao said. \"I know how important the program is for my constituents.\" Republicans hope voter s see lower taxes The law includes $4.5 trillion in tax cuts. It makes permanent existing rates and brackets approved during Trump's first term. Republicans and their allies have hammered vulnerable Democrats for \"raising costs\" on American households by opposing the bill. GOP campaign aides point to the popularity of individual provisions: boosting the $2,000 child tax credit to $2,200 (some families at lower income levels would not get the full credit), new deductions on tip and overtime income and auto loans; and a new deduction for older adults earning less than $75,000 a year. \"Everyone will have more take home pay. They'll have more jobs and opportunity,\" Johnson said in a Fox News Sunday interview. \"The economy will be doing better and we'll be able to point to that as the obvious result of what we did.\" Democrats note that the biggest beneficiaries of Trump's tax code are wealthy Americans and corporations. Pairing that with safety net cuts, Florida Rep. Debbie Wasserman Schultz concluded, \"The cruelty is the point.\" Immigration, meanwhile, was Trump's strongest issue in 2024. NRCC aides say that will continue with the new law's investments in immigration enforcement. Democrats believe the Trump administration has overplayed its hand with its push for mass deportation. Playing the Trump card The president is a titanic variable. Democrats point to 2018, when they notched a 40-seat net gain in House seats to take control away from the GOP. This year, Democrats have enjoyed a double-digit swing in special elections around the country when compared to 2024 presidential results. Similar trends emerged in 2017 after Trump's 2016 victory. Democrats say that reflects voter discontent with Trump once he's actually in charge. Republicans answer that Trump's job approval remains higher at this point than in 2017. But the GOP's effort is further complicated by ongoing realignments: Since Trump's emergence, Democrats have gained affluent white voters -- like those in suburban swing districts -- while Trump has drawn more working-class voters across racial and ethnic groups. But Republicans face a stiffer challenge of replicating Trump's coalition in a midterm election without him on the ballot. Democrats, meanwhile, must corral voters who are not a threat to vote for Republicans but could stay home. Jeffries said he's determined not to let that happen. \"We're going to do everything we can until we end this national nightmare.\"(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontrumpDemocratsRepublicanAmericansUS GOP\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontrumpDemocratsRepublicanAmericansUS GOP(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"The battle lines are drawn for the 2026 midterm elections as both parties strategize around President Trump's budget-and-policy package. Democrats aim to flip three House seats, highlighting potential losses in healthcare access and tax benefits for the middle class. Republicans defend their tax cuts and immigration enforcement investments, hoping voters will see economic benefits.","url":"https://economictimes.indiatimes.com/news/international/global-trends/beautiful-or-ugly-trumps-big-bill-shapes-the-battle-for-house-control-in-2026-midterms/articleshow/122419619.cms","image":"https://img.etimg.com/thumb/msid-122419671,width-1200,height-630,imgsize-77206,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-13 12:46:28","author":"Jack Pitt-Brooke","authors":["Jack Pitt-Brooke"],"language":"en","category":"politics","source_country":"in","sentiment":0.068},{"id":341159794,"title":"One year later, Butler still has few answers","text":"It wasn’t unusual for the 20-year-old to go to the shooting range or borrow his father’s gun for target shooting, so the request went without a second thought; in fact, he had been to the shooting club and practiced on the rifle range the day before.\n\nHe asked his nursing home employer, where he worked as a dietary aide, for the day off, assuring them he would be back the next day. He bought 50 rounds of ammo, and then found a parking spot less than a mile from the rally and began to walk towards the farm show complex.\n\nA local Pittsburgh television caught him on film walking back and forth at the perimeter of the event just over an hour before he fired his first shots.\n\nHe was spotted minutes before the shooting on top of the roof of an out building—rally attendees spotted him and desperately tried to alert the Secret Service while a Butler Township officer attempted to stop him when he himself climbed the same roof as Crooks who pointed his gun directly at the officer.\n\nThe officer retreated. Crooks began firing at the crowd and at then former President Donald Trump, who as fate would have it, had turned his head to face a chart; a chart that was rarely used, and if it was used, it was on his other side and towards the end of a rally.\n\nCrooks would hit the President in the ear, mortally wound local retired fire chief Corey Comperatore, a father of two daughters, and wife of Helen, and gravely injured two others in the crowd: Jim Copenhaver and David Dutch. \n\n26 seconds later, after firing those shots, Crooks was dead, shot in the head by a Secret Service sniper. Trump, meanwhile, was able to gather himself and rise to his feet, pumping his fist and chanting “fight, fight” with blood streaming down his face. The incident and iconic images all but sealed his return to the presidency, regardless of whether he was set to face former President Joe Biden or his eventual opponent, former Vice President Kamala Harris, in November.\n\nOne year later, walking around the grounds of the Butler Farm Show grounds, little has changed, although the stage which Trump spoke on is now a building.\n\nLittle is still known about Crooks and his motives, although a CBS News investigation published this week showed his descent into secrecy began in the fall of 2023 when he started using Mailfence, which is an encrypted email service, and Mullvad, a VPN service that effectively makes online activity covert.\n\nIt also showed that he was interested in things fairly common for a 20-year-old in western Pennsylvania, such as news updates on the Pittsburgh Steelers.\n\nAccording to the Congressional Task Force on the Trump Assassination Attempt, Crooks’s father said in hindsight that the signs of his son’s mental health decay began six months before July 13, 2024.\n\nAn investigator wrote: “Crooks’ father explained that within the last year he observed several instances of his son dancing in his bedroom throughout the night. He would occasionally see Crooks talking to himself with his hands moving, which he expressed as uncommon and had become more prevalent after he had finished his last semester.”\n\nIn the Bethel Park neighborhood where Crooks’ mother and father live, and where he was raised, the home has multiple security cameras but very little signs of life despite numerous visits to the neighborhood. \n\nThey have a lawyer, and neither is answering questions.\n\nBoth parents allowed their social work licenses to expire a couple of months ago; his mother, Mary, submitted her resignation from her lifelong job in February. It is clear she left because of the shooting.\n\n“Certain circumstances have left me with no other option than to vacate a position I have been proud to hold for the past 27 years,” she wrote in the resignation letter originally obtained by the New York Times.\n\nHelen Comperatore says she remains stuck in that moment when her husband, Corey, her childhood sweetheart, was taken from her. They met in kindergarten, dated in high school, and were married at 21. Within weeks, one of her daughters will be getting married.\n\nToday, she will be holding a private memorial service for Corey. \n\n“Corey should be here,” she told the Washington Examiner through tears while sitting at a picnic bench not far from her Sarver home.\n\n Of Crooks, that day, and the failings of the Secret Service haunt her.\n\n“They failed my husband miserably, and I want answers from this,” she said.\n\nOne year later, several agents have been suspended, a decision announced this week, but she wants more information. In talking with the people of Butler, people who attended the rally and the suburban neighborhood of Bethel Park, that sentiment is shared.\n\nOn Trump, she says she knows he will make sure that things that went wrong that day won’t happen again.\n\n“I still worry about him because of this, he is the most compassionate man I’ve met, but one year later I still worry about him every day.”","summary":"One year ago, then former President Donald Trump was shot during a rally in Butler, Pennsylvania. The tragic event, which resulted in the death of a rallygoer, Corey Comperatore, transformed the 2024 presidential race, with Trump&#8217;s defiant response sealing his reputation as America&#8217;s fighter. In Butler, there are still little in the way of answers. [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/columnists/3469454/trump-assassination-attempt-butler-one-year-anniversary-few-answers/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/AP25017590778995.webp","video":null,"publish_date":"2025-07-13 12:00:00","author":"Salena Zito","authors":["Salena Zito"],"language":"en","source_country":"US","sentiment":-0.265},{"id":341159796,"title":"As Trump’s grip tightens, the political center thins out","text":"Tillis broke with Trump last week by voting against the president’s sweeping domestic policy bill, citing his concerns that its Medicaid provisions could shutter rural hospitals in North Carolina. Trump quickly lashed out on social media and said he was meeting with potential primary challengers. \n\nThe next day, Tillis announced he wouldn’t run for reelection in 2026, saying, “It’s become increasingly evident that leaders who are willing to embrace bipartisanship, compromise, and demonstrate independent thinking are becoming an endangered species.”\n\nThe White House swiftly dismissed his concerns. “The senator was wrong,” press secretary Karoline Leavitt said during a briefing. “The president put out a Truth Social post addressing it, and then the senator announced he’s no longer running for office anymore, so I think that case has been closed.”\n\nThe response rattled many on Capitol Hill. Several GOP strategists said it reinforced fears that centrist voices, even those with strong records of supporting Trump’s agenda, are being pushed out.\n\n“It’s not like Tillis was a constant thorn in [Trump’s] side,” said a Senate GOP strategist, pointing to his past votes to confirm nominees like Defense Secretary Pete Hegseth. ”One vote and he’s out. He should have been given the space to do what’s right for his constituents, especially considering his vote didn’t sink the legislation.”\n\nBacon, a self-described “traditional conservative,” said he won’t run again in June either, citing growing divides in the GOP over foreign policy, trade, and what he called the “cult of personality” surrounding Trump. He’s criticized Trump’s tariff policies, posture toward Russia, and even his support for Elon Musk’s DOGE initiative. “There’s a tug of war right now within our party,” he said.\n\nBacon has represented Nebraska’s 2nd Congressional District, a competitive, Omaha-based seat won by former Vice President Kamala Harris, since 2016. With his exit, Democrats see a prime pickup opportunity in the state’s lone “blue dot” district. \n\n“Some of these people want to be bipartisan,” said Casey Burgat, a former Hill staffer and politics professor at George Washington University. “But they recognize that if they’re seen as too compromising, they’re going to be replaced by someone who promises to stand up to the other side.”\n\nThat pressure is growing as primary elections, dominated by ideologically driven voters, increasingly determine who makes it to Washington. “This is the result of over a decade of declining competitive districts,” Burgat said. “Now, bipartisanship is a word that will get you primaried more than it’ll get you reelected.”\n\nAs dissenting voices fade, Trump’s grip on legislative strategy, appointments, and party messaging has only tightened. A growing constellation of conservative influencers is helping enforce that control, amplifying attacks on Republicans deemed insufficiently loyal.\n\nOne of the most prominent is Laura Loomer, a Trump devotee, online provocateur, and MAGA activist, with 1.7 million followers on X. She recently slammed Tillis for “falling on his sword” over Medicaid and regularly brands GOP senators “weak” for defying Trump. Her posts often circulate widely in pro-Trump media and, according to aides, can generate real political headaches. \n\nThat dynamic is reshaping decisions in real time. Earlier this year, Sen. Joni Ernst (R-IA) expressed concern over Hegseth’s nomination as defense secretary, citing his record on military sexual assault. After backlash from Trump-aligned voices, she ultimately voted to confirm him. In the aftermath, reports have emerged that Ernst may be rethinking whether to run for another term, though the reasons behind her deliberation remain unclear.\n\n“I thought we were going to see more [senators] stand up to [Trump] and vote against his Cabinet picks,” said one Republican operative, speaking on the condition of anonymity to reflect candidly on the situation. “But they all fell in line.”\n\nSome in the party warn that this approach could cost Republicans in November. Chris Pack, a longtime GOP strategist and former NRCC official, said Trump-aligned influencers are short-sighted when they target lawmakers in swing districts. \n\n“When you have a Republican in a seat won by a Democrat like Kamala Harris, realizing that elected officials need to be more bipartisan in their vote should be common sense,” he explained. “But, it’s not because it’s all about getting clicks and likes and retweets for these influencers.” \n\nNot every Trump critic is facing retaliation. While Trump targeted Rep. Thomas Massie (R-KY), even backing a super PAC to unseat him, he’s stayed silent on Rep. Brian Fitzpatrick (R-PA), who also voted against the “big, beautiful bill.” \n\nBurgat said that silence may be strategic. “Trump ignoring Fitzpatrick’s vote against him suggests that either he or his team recognizes that if he puts his thumb on the scale, that seat is one of the most likely to flip.”\n\nDemocrats, too, are seeing their center thin out. This year, Sens. Gary Peters (D-MI), Tina Smith (D-MN), and Jeanne Shaheen (D-NH) announced plans to retire. Their decisions followed announcements by Sen. Joe Manchin (I-WV) in 2023 and Sen. Kyrsten Sinema (I-AZ) in 2024, both former Democrats who left the party to become independents before ultimately deciding not to run again. \n\nThe broader shift began during Trump’s first term, when a wave of Republicans opted not to seek reelection. Sens. Jeff Flake (R-AZ), Bob Corker (R-TN), Pat Toomey (R-PA), and Ben Sasse (R-NE) all chose to step aside rather than face increasingly Trump-aligned electorates. Sen. Mitt Romney (R-UT), who voted to convict Trump during the 2020 impeachment trial, also declined to run for reelection in 2024.\n\nSen. John McCain (R-AZ), one of Trump’s most outspoken critics, voted against repealing the Affordable Care Act in 2017. He died the following year after a battle with brain cancer. \n\nThat same period saw a steady stream of more centrist House Republicans, such as Reps. Charlie Dent (R-PA), Ileana Ros-Lehtinen (R-FL), and Dave Reichert (R-WA) opt out, citing rising dysfunction and extremism. More recently, Reps. Liz Cheney (R-WY) and Adam Kinzinger (R-IL), key figures in the Jan. 6 investigation, were pushed out. Cheney lost to a Trump-backed challenger; Kinzinger chose not to run amid threats and political isolation. \n\n“There is little wiggle room in the conference for differing opinions,” Burgat said. “If you stand up to the Trump norm, there’s an outright expectation of loyalty, and if not, he’ll back a primary challenger or take to social media to replace you.”\n\nFormer Vice President Mike Pence pushed back on the idea that Trump has completely reshaped the GOP. \n\n“I think President Trump, as presidents should, has changed aspects of the agenda of the Republican Party,” Pence said in a recent CNN interview. “But I don’t think he’s changed the Republican Party.” \n\nStill, the pattern among elected officials suggests otherwise.\n\n“Some of these members still want to serve,” Burgat said. “But they’re finding the job completely unsatisfying and unworthy of their time. And that speaks not just to them, but to the state of the institution itself.”\n\nTILLIS’S SURPRISE RETIREMENT SCRAMBLES 2026 SENATE MAP AND TURNS NORTH CAROLINA INTO TOP TARGET\n\nMore retirements are likely on the horizon. Republicans hold a narrow House majority, and about a dozen incumbents are running for Senate or governor. Strategists expect a new wave of exits after the August recess, as lawmakers weigh whether they still see a place for themselves in Washington.\n\nAs the GOP charts its path forward, Pack urges the party to focus on winning general elections rather than settling scores in primaries.\n\n“Stop thinking the game ends at halftime. The game ends on Election Day in November,” he said. “You can either get a participation trophy or a vote to hold the gavel.”","summary":"President Donald Trump’s grip on the GOP is eroding the party’s ideological center, as many lawmakers conclude there’s little room left for compromise — or for them. Among the latest to bow out are Sen. Thom Tillis (R-NC) and Rep. Don Bacon (R-NE), two Republicans known for bipartisan deal-making, whose departures highlight the mounting pressure [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3469162/gop-centrists-retire-endangered-species-trump-grip-power/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/Thom-Tillis-July-2025.webp","video":null,"publish_date":"2025-07-13 11:00:00","author":"Samantha-Jo Roth","authors":["Samantha-Jo Roth"],"language":"en","category":"politics","source_country":"US","sentiment":0.143},{"id":341207106,"title":"In Arizona, Democrats battle over who’s the real “outsider”","text":"Everyone is running as an outsider in the Democratic primary to replace the late Arizona Rep. Raúl Grijalva, speaking to the appetite for change within the party.\n\nGrijalva, who died in March, always positioned himself as an outsider in Democratic politics throughout his 11 terms in Congress. In 2015, he was the first Democrat in Congress to endorse Sen. Bernie Sanders, I-Vt., in the 2016 presidential primary, and in Congress he was known as a principled environmentalist and advocate for Indigenous communities.\n\nThe two leading candidates vying to become his successor in Arizona’s 7th district also see an outsider campaign as the path to victory, with both Grijalva’s daughter, Adelita Grijalva, and activist Deja Foxx positioning themselves as anti-establishment. Both are competing in the July 15 Democratic primary, the winner of which will take part in a special election set for Sept. 23.\n\nAdelita Grijalva, 54, has leaned on her experience in the district, serving for 20 years on the Tucson Unified School District board and, since 2021, on the Pima County Board of Supervisors. She has also picked up the endorsement of national progressive figures, like Sanders and Rep. Alexandria Ocasio-Cortez, D-N.Y.\n\nFoxx, 25, has positioned herself as representing a new generation of politics. Before running for Congress, Foxx worked on former Vice President Kamala Harris’s 2020 presidential campaign, advocated for women’s reproductive rights, and spoke at the 2024 Democratic National Convention. She has garnered the support of one-time Vice DNC chair David Hogg, who decided not to run again, after the party voted to redo the vice chair election on a technicality. The decision capped off a months-long fight within the party, after promising to support primary challengers to Democrats he described as “asleep at the wheel.”\n\nDaniel Hernandez, a former member of the Arizona House of Representatives, Jose Malvido Jr., an Indigenous activist, and Patrick Harris, Sr., a retired health care executive, are also running in the primary.\n\nIn what little polling has been done on the race, however, Grijalva and Foxx have dominated the field. A Change Research survey from late June found that Grijalva led the field with 43% support while Foxx came in second with 35%. Hernandez was a distant third at 9%.\n\nThomas Volgy, a political scientist at the University of Arizona and the former mayor of Tucson, told Salon that “neither one of these are really establishment candidates in any sense.” Volgy added that the two are running on similar platforms and that, in large part, the decision in the district is coming “down to the tradeoff between Grijalva’s experience and Foxx’s youth.”\n\nBoth have centered standing up to Trump, expanding Medicare and Medicaid, supporting investments in housing and raising the Social Security payroll tax cap.\n\nIn an interview with Salon earlier this year, Foxx pitched herself as a break from the usual, saying “that if you feel like the way things have been going isn’t working, if you’re unhappy with the state of this country as it stands, then we’re going to need to do things differently, and I’m the candidate to do it.”\n\n“The way we have been doing things isn’t working, and I am the only break from the status quo in this race,” Foxx added.\n\nGrijalva has made a similar pitch, while promising to continue her father’s legacy in Congress.\n\n“I know how to fight because I learned from the best,” Grijalva said in one of her ads. “My parents named me Adelita — it means fighter — and they taught me what that really means. It’s about standing up for the people who raised you, taught you, stood by you. You fight for people. You fight for community. And you never back down — especially when the stakes are this high.”\n\nOne thing that has shaken up the race in the final stretch is a string of mailers, digital ads and phone calls by an apparently pro-Foxx committee that has been created and dropped more than $113,000 into the race in just the last month.\n\n“Our democracy is under attack. We need a leader to fight back against Trump. That’s not Adelita Grijalva. After closing schools and firing teachers, she even blocked oversight and illegally banned critics from meetings. We can’t trust Adelita Grijalva,” said the speaker in one digital ad paid for by the group.\n\nAccording to Volgy, the mention of Grijalva allegedly banning critics from meetings refers to an incident in which one person would repeatedly attend school board meetings and accuse the one gay school board member of being a pedophile.\n\n“Adelita, who was chairing the board, finally said, ‘That’s enough,’” Volgy said. “It’s pretty well known what played out there. To use that as a sort of smear, an attack on Adelita, I think has really backfired.”\n\nThe group, Tucson Families Fed Up PAC, is so new that, at the time of writing, the FEC had not yet had time to process their filings. According to the raw filings available, the group has spent all of its money on a Washington, DC-based firm named Pinwheel Productions.\n\nStart your day with essential news from Salon.\nSign up for our free morning newsletter, Crash Course.\n\nVolgy said that these ads may have had a “jarring effect” on voters in the district, who he said are not used to that sort of messaging in a congressional primary, having been represented by Raúl Grijalva for some 22 years.\n\nAt times, the attacks in the campaign have become personal, with candidates differentiating themselves based on their biography as much as their platforms. Both have responded to jabs from outside groups, with Grijalva being accused of running on her family name.\n\n“I also want to address this idea of me being a so-called ‘legacy candidate.’ If legacy means fighting for the most vulnerable, standing up to corporate greed, defending immigrants and working families and advancing environmental justice and tribal sovereignty, then yes. I am a progressive and those are the values I fought for and the legacy I’m proud to carry forward,” Grijalva said in an Instagram post. “I am not a Rockefeller. I’m a Grijalva from the south side of Tucson. I’m not in this for fame, sponsorships, or likes.”\n\nFoxx, in turn, has spent significant time responding to concerns about her age and experience.\n\n“I think about how some people have criticized me for not having the right kind of experience, never having run for state or local office, never having held a position at the state [legislature] or school board. But it’s worth pointing out that our school boards are unpaid. Our state legislators, they make $24,000 a year … If we make underpaid and unpaid labor a prerequisite to leadership, we are going to continue to be in a deficit of representation when it comes to age and economics,” Foxx told Salon.","summary":"The election to replace Rep. Raúl Grijalva has pit an online influencer against the late congressman's daughter","url":"https://www.salon.com/2025/07/13/in-arizona-democrats-battle-over-whos-the-real-outsider/","image":"https://www.salon.com/app/uploads/2025/07/arizona-2179746842-150x150.jpg","video":null,"publish_date":"2025-07-13 10:30:49","author":"Russell Payne","authors":["Russell Payne"],"language":"en","category":"politics","source_country":"US","sentiment":0.129},{"id":341158144,"title":"Blood and bravado: the Trump shooting upended an election and shook the US","text":"Blake Marnell was standing in the front row, about 10 yards from Donald Trump, when the shots rang out. He watched the Secret Service pile on the former US president. “I was able to see him standing and I could see the blood on his ear,” Marnell recalls. “When he put his fist up, I remember yelling, ‘Yes! Yes! Yes!’”\n\nSunday marks one year since the assassination attempt on Trump at a campaign rally in Butler, Pennsylvania, and a week that changed US politics. Eight days later then-president Joe Biden, 81, dropped out of the election race amid concerns over his mental and physical decline.\n\nThe twin shocks to the system of July 2024 continue to echo. Trump’s supporters hailed his survival as proof of divine intervention. He declared in his inaugural address in January: “I was saved by God to make America great again.” He has governed with a zealous self-belief that earns comparisons with authoritarians from history.\n\nDemocrats, meanwhile, continue to wrestle the fallout of Biden’s late withdrawal. Some argue that he could have pushed on and won; most believe that he left the race too late and paved the way for Trump’s return to the White House. Younger voters accuse the party establishment of betrayal and beat the drum of generational change.\n\nWhat few dispute is that the shooting of Trump was indicative of a culture of political violence that has taken hold over the past decade, with recent examples including the murder of a Minnesota politician and her husband. It also set in motion a news cycle that has barely drawn breath over the past year as the most unconventional president of modern times dominates the national consciousness.\n\nFor Marnell, who lives in San Diego, California, that hot summer’s day in Butler began like dozens of the other Trump rallies he has been to before and since. He was wearing a “brick suit” that symbolises the president’s border wall and looked up at a giant screen that displayed a chart detailing US-Mexico border crossings.\n\nTrump had his head turned to the right to review the graphic when the gunfire began and nicked his right ear. “I didn’t even recognise them as gunshots,” 60-year-old Marnell said in a phone interview. “I thought they might be firecrackers.”\n\nFor several long seconds there was pandemonium. Firefighter Corey Comperatore was killed while David Dutch and James Copenhaver were both hospitalised with injuries. Secret Service agents killed the gunman, 20-year-old Thomas Crooks, whose motives remain a mystery, and rushed on top of Trump, whose fate was initially uncertain.\n\n“There was every range of emotion in the crowd. There was anger. There were people who turned around and were yelling at the TV cameras. There were people who were in prayer. There were people crying. There were people who were in disbelief. It was just an incredible gamut and range of reactions.”\n\nBut what happened next became the stuff of political legend. Trump rose, pumped his fist and beseeched his followers to “Fight! Fight! Fight” even as blood streaked his face. The resulting image flashed around the world and is still displayed in the West Wing and worn on T-shirts by his “Make America great again” (Maga) acolytes.\n\nHenry Olsen, a senior fellow at the Ethics and Public Policy Center thinktank in Washington, said: “He showed courage and determination when you’d think the first thing somebody wants to do is slink away and save themselves. His response was to be the medieval chieftain who was rallying his troops round the banner and showing that he was undeterred to fight, to use his word. It was incredibly moving.”\n\nBiden was quick to call Trump and express sympathy. On 17 July, Biden tested positive for Covid-19. On 19 July, Trump, wearing a patch on his ear, delivered a 90-minute address at the Republican national convention in Milwaukee, where some delegates wore ear patches in solidarity.\n\nThen, on 21 July, Biden suddenly announced that he was stepping aside and would not be the Democratic nominee for president. The writing had been on the wall since his disastrous debate performance against Trump the previous month. Party leaders such as Nancy Pelosi and Chuck Schumer had urged him to withdraw. Finally, he yielded.\n\nEven by the standards of the Trump era, it had been a jaw-dropping eight days. Larry Sabato, director of the Center for Politics at the University of Virginia, said: “There have been dramatic weeks and months but, in an election campaign, there’s just nothing like it in all of American history.”\n\nJournalist Chris Whipple was working on a different project when he heard the news of Biden’s exit, “realised this was the political story of the century”, and pivoted to writing a book that would become Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History.\n\n“It created that devastating split screen between the strengths of Trump and the weakness of Biden,” Whipple said. “The image of Trump rising off that stage with blood on his cheeks and his fist in the air mouthing ‘fight, fight, fight’ was devastating in comparison to the image of Biden shortly thereafter climbing off Air Force One with Covid headed to his bunker in Rehoboth Beach, standing on those steps, looking lost and gripping the handrail.”\n\nIn their new book 2024: How Trump Retook the White House and the Democrats Lost America, journalists Josh Dawsey, Tyler Pager and Isaac Arnsdorf write how Trump’s future chief of staff, Susie Wiles, told him after the assassination attempt: “You do know this is God.” At first Trump was silent, they write, but by the next day he was telling everyone: “If anyone ever doubted there was a God, that proved there was.”\n\nNumerous speakers at the Republican convention insisted that Trump had been spared by God so that he could pursue his mission. The Detroit pastor Lorenzo Sewell refers to it as a “millimetre miracle”.\n\nWhipple added: “To this day the true believers think this was God’s plan and maybe – without playing armchair psychologist – it’s contributed to a kind of fearlessness in Trump that I’m not sure we saw in the first term. Some might say recklessness. It changed Trump. It changed the country.”\n\nConversely, the Democrats have still not recovered from the debacle of Biden’s late departure. His anointed successor, Kamala Harris, had only 107 days to campaign and ignited a burst of Democratic enthusiasm, notably at the party convention and when she debated Trump. But it was too little too late and she lost both the electoral college and the national popular vote.\n\nWhipple commented: “It was a seismic political event and the reverberations continue to this day. His 11th-hour abdication, leaving Kamala Harris with too short a runway to mount a winning campaign, obviously is historic and there is to this day a lot of anger among Democrats about the fact that Biden should have stepped away a year earlier or more.\n\n“That has real political ramifications. We’re seeing it in the popularity of Zohran Mamdani in New York and Alexandria Ocasio-Cortez and Bernie Sanders. It’s not just their message which is appealing to so many but also the fact that they’re anti-establishment. Biden and his gang have come to represent the corrupt Democratic establishment because of his last-minute abdication. You’re seeing an anti-establishment revolt.”\n\nBiden’s determination to cling on has been the subject of Democratic hand-wringing – and several books – though he insists he has no regrets. Many in the party wish he had stepped aside after the 2022 midterm elections so it could have held an open primary contest to find an heir apparent. Now Democrats find themselves leaderless and, according to a March poll, at a record low approval rating of 29%.\n\nKurt Bardella, a Democratic strategist and political commentator, said: “The real fallout was the lack of a clear successor to President Biden.\n\n“Had there been a real primary process that would have been able to unfold over the course of a year and a half, it would have weeded out the contenders and pretenders and would have put forward a ticket that, even if they ended up losing, could still have been very much part of the conversation heading into 2028. Instead, we’re starting 2028 already behind.”\n\nHow elections are won and lost is always complex. With inflation and immigration looming large, there is no guarantee that another Democratic candidate would have beaten Trump. Nor will it ever be known how determinative his made-for-TV response to the assassination attempt was. But it did have some important consequences.\n\nWithin minutes of the shooting, Elon Musk, the tech billionaire, announced his endorsement of the former president. Musk would go on to spend a record of about $280m in backing Trump and Republican candidates, then lead the president’s assault on the federal bureaucracy until their spectacular falling-out.\n\nThe Meta chief executive, Mark Zuckerberg, also praised Trump’s reaction, calling his raised fist “one of the most badass things I’ve ever seen in my life”. Zuckerberg went on to attend Trump’s inauguration and make changes to Meta such as ending third-party fact-checking, removing restrictions on topics such as immigration and gender identity and bringing political content back to users’ feeds.\n\nThe events of one year ago may also have shaped Trump’s psychology, fuelling an impatient, seize-the-day approach to the presidency that sets the news agenda at breakneck speed, knocks opponents back on their heels and brooks no compromise.\n\nOlsen said: “Trump dialed it up to 11 on his inauguration. A lot of that is the indirect influence of his survival of the assassination attempt. This is a man who is going with his instincts and going to do what he’s going to do and not going to prioritise – he’s going to push everything everywhere all at once.”\n\nTrump has survived legal troubles and taken on the elites and won, at least in his own mind, Olsen added. “I don’t think he thinks he’s invincible but he feels vindicated. Coupled with a sense of vulnerability means this is a guy who knows that everything could end tomorrow and believes he’s been proven right, so he’s darn well going to use the time that he has left to him to move forward to do even more that he believes is right.”","summary":"A year ago the image of Trump’s raised fist became a political touchstone, helping force Joe Biden from the race and fuelling a presidency like no other\n\nBlake Marnell was standing in the front row, about 10 yards from Donald Trump, when the shots rang out. He watched the Secret Service pile on the former US president. “I was able to see him standing and I could see the blood on his ear,” Marnell recalls. “When he put his fist up, I remember yelling, ‘Yes! Yes! Yes!’”\n\nSunday marks one year since the assassination attempt on Trump at a campaign rally in Butler, Pennsylvania, and a week that changed US politics. Eight days later then-president Joe Biden, 81, dropped out of the election race amid concerns over his mental and physical decline.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/jul/13/trump-assassination-attempt-shooting","image":"https://i.guim.co.uk/img/media/47cfa3eb6b220f96716b07ddc2f27226aa0b8f34/196_0_3156_2524/master/3156.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-07-13 10:00:37","author":"David Smith","authors":["David Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.355},{"id":341127174,"title":"Një plumb që e ndryshoi përgjithmonë! Donald Trump, një vit pas atentatit: Më forcoi! Ishte dora e Zotit!","text":"Një vit pas atentatit të 13 korrikut 2024 në Butler, Pennsylvania, që i mori jetën një mbështetësi dhe e la të plagosur vetë Donald Trump, Presidentin e SHBA-ve vazhdon ta përshkruajë atë ngjarje si një moment që ndryshoi jo vetëm fushatën, por edhe vetë atë si lider politik dhe si njeri.\n\nNë momentin kur plumbi i atentatorit kaloi centimetra pranë kokës së tij, Trump ishte duke parë një grafik mbi emigracionin, i vendosur në anën tjetër të skenës. Ky kthim koke i shpëtoi jetën, dhe shumë nga ndjekësit e tij e konsideruan këtë “dorë të Zotit”.\n\n“Ndodhi një bashkësi rrethanash që shmangu tragjedinë. Ai flet gjithmonë për ndërhyrje hyjnore,” deklaroi drejtori i komunikimit në Shtëpinë e Bardhë, Steven Cheung.\n\nAtentatori 20-vjeçar, Thomas Matthew Crooks, u qëllua për vdekje nga shërbimi sekret në vendngjarje. Përveç Trumpit, nga të shtënat humbi jetën edhe një qytetar, Corey Comperatore, dhe u plagosën dy persona të tjerë. Ngjarja tronditi skenën politike amerikane dhe u pa si një pikë kthese në fushatën zgjedhore presidenciale të vitit 2024.\n\nVetëm dy ditë pas atentatit, Trump u rikthye në skenën politike, duke u shfaqur në Konventën Republikane në Milëaukee, në një hyrje spektakolare që simbolizonte rikthimin e tij si një “kampion” i papërkulur. Që nga ajo ditë, retorika e tij ka përfshirë gjithnjë e më shumë referenca fetare dhe misionare. Ai ka përshkruar shpëtimin nga vdekja si një thirrje hyjnore për të “shpëtuar Amerikën”.\n\n“Nuk dua të them se ishte vetëm rastësi. Më pëlqen të besoj se ishte Zoti. Ai po na shikon,” deklaroi Trump në një intervistë, duke shtuar se përvoja e ka forcuar shpirtërisht dhe politikisht: “Ndryshoi diçka brenda meje. E ndjej veten më të fortë.”\n\nPas atentatit, siguria në tubimet e tij u përforcua ndjeshëm, ndërsa për disa javë ato u mbajtën në ambiente të mbyllura. Më vonë, me vendosjen e barrierave të blinduara, Trump rifilloi mitingjet karakteristike, edhe pse u duk herë pas here i ndjeshëm ndaj lëvizjeve të papritura nga audienca.\n\nNgjarja në Butler u përdor nga përkrahësit për të theksuar një dimension “mistik” të lidershipit të tij. Ndër ta, edhe Elon Musk, i cili e mbështeti hapur vetëm një ditë pas atentatit dhe u shfaq krah tij në një tubim tre muaj më vonë.\n\nPavarësisht momenteve ku u përpoq të promovonte unitetin kombëtar, Trump shpejt iu rikthye sulmeve të ashpra ndaj kundërshtarëve, sidomos Joe Biden dhe Kamala Harris. Megjithatë, bashkëpunëtorët e afërt thonë se ajo që mbeti nga 13 korriku ishte një ndjenjë më e thellë misioni.\n\n“Pas atij momenti, ai e ndjeu edhe më fort përgjegjësinë për të punuar në emër të popullit,” u shpreh Steven Cheung. “Misioni i tij mori një rëndësi edhe më të madhe.”/abcnews.al","summary":"Një vit pas atentatit të 13 korrikut 2024 në Butler, Pennsylvania, që i mori jetën një mbështetësi dhe e la të plagosur vetë Donald Trump, Presidentin e SHBA-ve vazhdon ta përshkruajë atë ngjarje si një moment që ndryshoi jo vetëm fushatën, por edhe vetë atë si lider politik dhe si njeri. Në momentin kur plumbi [...]Read More...","url":"https://abcnews.al/nje-plumb-qe-e-ndryshoi-pergjithmone-donald-trump-nje-vit-pas-atentatit-me-forcoi-ishte-dora-e-zotit/","image":"https://abcnews.al/wp-content/uploads/2025/07/donald-trump.webp","video":null,"publish_date":"2025-07-13 09:13:55","author":"Rovena","authors":["Rovena"],"language":"en","category":"politics","source_country":"al","sentiment":0.136},{"id":341119164,"title":"What if Trump Had Been Assassinated? An Alternate History, According to AI","text":"Alternate history, according to Merriam-Webster, is \"fiction that is based on history and that explores what might have happened if certain historical events, figures, etc., had been different.\" The genre has deep roots. Writers from Livy to Machiavelli, and more recently authors such as Philip K. Dick and Robert Harris, entertained counterfactuals to question moral and political choices.In 2006, Newsweek itself published \"An Alternate 9/11 History.\" This article follows that tradition, asking speculatively what might have happened if Donald Trump had been assassinated during his 2024 presidential campaign, but with a modern twist. Using an identical prompt, Newsweek asked three leading large language models—ChatGPT, Grok and Gemini—for their take on the events that might have followed. Their responses have been edited lightly for clarity and style.ChatGPTOne year ago today, America was forever altered.At 6:41 p.m. on July 13, 2024, during a reelection rally in Butler, Pennsylvania, former President Donald J. Trump was fatally shot by a lone assailant, later identified as 20-year-old Thomas Matthew Crooks, a radicalized U.S. citizen. The Secret Service neutralized the shooter within seconds, but the damage had been done. Trump succumbed to his injuries en route to a Pittsburgh trauma center. What followed was a year of national reckoning, political chaos, and an election season that redefined modern American democracy.July 2024: The ShockwaveA National CrisisTrump's death triggered an immediate national emergency. President Joe Biden addressed the nation within hours, calling for calm, condemning political violence, and ordering flags to be flown at half-staff. Congress convened in an emergency session, issuing a bipartisan resolution mourning Trump's death — though the unity was short-lived.Riots erupted in major cities. Some were spontaneous vigils turned violent; others were retaliatory actions. Social media spiraled into conspiratorial mayhem, with QAnon and alt-right influencers decrying \"deep state\" plots. Some liberal commentators privately feared left-wing scapegoating. The FBI began a sweeping investigation, finding no foreign involvement — a fact rejected by vast swaths of Trump's base.The Republican Power VacuumWith just over three months to the election, Trump's sudden absence left a gaping hole in the Republican Party. Former Vice President Mike Pence quickly ruled himself out. Florida Governor Ron DeSantis and former U.N. Ambassador Nikki Haley scrambled to consolidate support. Ultimately, Trump's eldest son, Donald Trump Jr., backed by loyalists and endorsed by Lara Trump and Steve Bannon, emerged as the \"true heir\" to the MAGA mantle.August to November 2024: The Fractured ElectionRepublican Convention ChaosThe Republican National Convention in Milwaukee turned into a media spectacle and political knife fight. DeSantis and Haley split traditional delegates, while Trump-aligned factions rallied around Trump Jr., who lacked governing experience but surged on emotion and identity. In a stunning compromise brokered by House Speaker Mike Johnson, the convention nominated Trump Jr. for president and Ohio Senator JD Vance as his running mate.Biden's New ChallengeBiden, then 81, had planned a cautious reelection campaign. But with Trump's martyrdom galvanizing a MAGA revival and younger Trump on the ticket, Biden's team shifted strategy. Vice President Kamala Harris became more visible. Progressive turnout initiatives accelerated. The campaign emphasized unity and warned of \"dynastic authoritarianism\" rising from Trump's ashes.November 2024: An Election Like No OtherA Close and Contested VoteDespite predictions of a landslide for Biden in the wake of national tragedy, the election was razor-thin. Voter turnout was the highest since 1900. Trump Jr. carried deep-red states by larger margins than his father ever had. But Biden held onto Pennsylvania, Michigan, and Arizona by narrow margins, securing 281 electoral votes.Trump loyalists immediately cried foul. Protests, some violent, erupted outside ballot-counting centers. Lawsuits flooded swing-state courts. Biden's legal team, better prepared than in 2020, prevailed in most challenges.On December 14, 2024, the Electoral College confirmed Biden's reelection. Trump Jr. refused to formally concede but gave a televised address stating, \"This fight is not over — we will return stronger.\" He launched a new political movement days later: \"45 Reborn.\"2025: A Nation Under StrainPolitical ClimateIn the year since, America has seen persistent instability. Congressional Republicans are divided between traditional conservatives and Trump Reborn loyalists, who now form the Freedom Revival Caucus. Extremist militia activity has surged, leading the Department of Homeland Security to elevate domestic terrorism as a top-tier threat.Biden, now 82, faces declining approval ratings and questions about his capacity. Harris' visibility has only increased amid rumors she may take the reins before 2028.Media and Cultural FalloutRight-wing media branded Trump as a martyr, with comparisons to Lincoln and Kennedy. A Butler memorial event this week is expected to draw tens of thousands. Liberal and mainstream outlets continue to probe the shooter's motives and failures in intelligence coordination.Streaming platforms released a wave of content — from documentaries to speculative dramas. Butler: The Day Democracy Died? trended on Netflix for months. Schools in some red states banned curricula discussing the assassination, citing \"partisan distortion.\"Foreign ResponseAmerica's adversaries — particularly Russia and China — exploited the chaos. Disinformation campaigns surged. NATO allies expressed concern about U.S. reliability, though Biden's foreign policy remained relatively consistent.In a symbolic blow, the U.N. Security Council saw a Russian resolution condemning political violence in the U.S. pass with abstentions from France and India — a diplomatic embarrassment.Looking AheadAs the country marks this somber anniversary, it remains deeply divided. Some see Trump's assassination as a tragic turning point; others view it as the spark that birthed a new era of radicalized politics. The 2026 midterms now loom as a critical test for both parties — and for American democracy itself.Whether Trump's death quelled or accelerated authoritarian forces remains an open question. What is certain: America is no longer the same.GrokA Year After the Assassination: How Trump's Death Reshaped American PoliticsOn July 13, 2024, the United States was thrust into a state of shock and uncertainty when former President Donald Trump was assassinated during a campaign rally in Butler, Pennsylvania. The assailant, a lone gunman with extremist affiliations, was quickly neutralized by Secret Service agents, but not before fatally wounding Trump. This tragic event, occurring just days before the Republican National Convention, sent ripples through the political landscape, reshaping the 2024 presidential election and the subsequent trajectory of American governance. As we reflect on the year since that fateful day, this article explores the immediate aftermath, the political realignment, the election dynamics, and the early months of the new presidency, culminating in the state of the nation by July 13, 2025.Immediate Aftermath: A Nation in MourningThe assassination of Donald Trump, a polarizing yet undeniably influential figure, elicited a wide range of reactions. Supporters gathered in vigils across the country, from Butler to Mar-a-Lago, mourning the loss of a leader who had reshaped the Republican Party. Social media platforms, particularly X, buzzed with posts expressing grief, anger, and speculation. Some users, echoing sentiments from posts around that time, suggested conspiracies, though official investigations pointed to a lone actor with no broader network.President Joe Biden addressed the nation, condemning the violence and urging unity: \"We must come together as Americans to reject hatred and division.\" Republican leaders, including Senate Minority Leader Mitch McConnell and House Speaker Mike Johnson, issued statements honoring Trump's contributions while calling for calm. However, the polarized political climate led to tensions, with some fringe groups amplifying conspiracy theories about the assassination, complicating the national discourse.\n\nDescription\n\nTrump Assassination\nJuly 13, 2024\nFormer President Trump fatally shot at a rally in Butler, PA.\n\nBiden's National Address\nJuly 13, 2024\nPresident Biden condemns violence and calls for unity.\n\nRNC Emergency Meeting\nJuly 14, 2024\nRepublican National Committee convenes to discuss nominee selection.\n\nPolitical Realignment: The RNC's ResponseWith the Republican National Convention scheduled to begin on July 15, 2024, in Milwaukee, Wisconsin, the Republican Party faced an unprecedented challenge: selecting a new presidential nominee just months before the general election. The primaries, which ran from January to June 2024, had already positioned Trump as the presumptive nominee, with other candidates like Florida Governor Ron DeSantis, former U.N. Ambassador Nikki Haley, and entrepreneur Vivek Ramaswamy. Trump's death necessitated swift action from the RNC, which has the authority to fill vacancies in such scenarios.After intense deliberations, the RNC and convention delegates rallied around DeSantis, who had polled strongly in the primaries and was seen as a natural successor to Trump's populist agenda. DeSantis, known for his conservative policies in Florida, accepted the nomination with a speech that paid tribute to Trump while outlining his vision for America: \"We will honor President Trump's legacy by making America strong, secure, and prosperous again.\"To unify the party, DeSantis selected Ohio Senator JD Vance as his running mate. Vance, a vocal supporter of Trump's \"America First\" policies, appealed to the MAGA base while bringing a younger, dynamic presence to the ticket. The choice was strategic, aiming to maintain the loyalty of Trump's supporters while broadening the appeal to moderates and independents.Election Dynamics: A Charged CampaignThe 2024 presidential election was one of the most emotionally charged in recent history. DeSantis campaigned on a platform emphasizing law and order, border security, and economic nationalism, echoing Trump's rhetoric but with a more disciplined approach. His campaign leveraged the emotional weight of Trump's assassination, framing it as a call to action for conservatives to \"protect America's future.\" Rallies across swing states like Pennsylvania, Michigan, and Wisconsin drew large crowds, with supporters chanting \"Finish the Fight\" in homage to Trump.On the Democratic side, Vice President Kamala Harris emerged as the nominee after Biden announced he would not seek reelection, a decision influenced by concerns about his age and health. Harris, with Minnesota Governor Tim Walz as her running mate, campaigned on progressive policies, including health care expansion, climate action, and social justice reforms. She sought to contrast her vision of inclusivity with what she described as the \"divisive rhetoric\" of the Republican campaign.The election was a close contest, with polls showing a tight race in battleground states. The assassination of Trump introduced an unpredictable variable, with some voters motivated by sympathy for the Republican cause, while others were wary of continued polarization. DeSantis's focus on economic recovery and security resonated in key states, ultimately securing him a narrow victory in November 2024, with 280 electoral votes to Harris's 258.\n\nElectoral Votes\n\nPennsylvania\n\nDeSantis (R)\n\nDeSantis (R)\n\nDeSantis (R)\n\nThe DeSantis Presidency: January to July 2025Inaugurated on January 20, 2025, President Ron DeSantis moved quickly to implement his agenda. His first major action was an executive order enhancing border security, increasing funding for Immigration and Customs Enforcement (ICE) and expanding the use of technology at the U.S.-Mexico border. This move was met with approval from conservatives but drew criticism from Democrats, who argued it diverted resources from comprehensive immigration reform.On the economic front, DeSantis pushed for tax cuts and deregulation to stimulate growth, citing persistent inflation concerns. By July 2025, the unemployment rate had dropped to 3.5 percent, a positive sign, though inflation remained a challenge, hovering around three percent. His administration also introduced a health care initiative aimed at increasing competition among providers, though it faced resistance in a divided Congress.Internationally, DeSantis adopted a hawkish stance, particularly toward China. He imposed new tariffs on Chinese goods and strengthened alliances in the Indo-Pacific, including a high-profile summit with leaders from Japan, South Korea, and Australia. His foreign policy also included continued support for Israel in the Gaza conflict, while maintaining a skeptical approach toward aid for Ukraine, reflecting the \"America First\" ethos.The ongoing investigation into Trump's assassination remained a point of contention. While official reports confirmed the lone gunman narrative, conspiracy theories persisted, fueled by social media and amplified by some conservative commentators. DeSantis faced pressure to address these concerns without alienating his base, a delicate balancing act that defined much of his early presidency.A Nation Reflects: July 13, 2025As the one-year anniversary of Trump's assassination approached, memorials were held nationwide, from small gatherings in Butler to a televised ceremony at the National Mall. DeSantis delivered a speech that sought to unify the country: \"Donald Trump was a patriot who changed the course of our nation. We honor his memory by building a stronger, more united America.\"The political landscape, however, remained deeply divided. Trump's death had not healed the partisan rift but rather intensified it, with debates over his legacy and the direction of the Republican Party dominating discourse. DeSantis's presidency, while achieving some legislative successes, faced challenges in bridging the gap between Trump's loyalists and those seeking a new path forward.Looking AheadThe assassination of Donald Trump on July 13, 2024, marked a turning point in American history. The rise of Ron DeSantis to the presidency, the realignment of the Republican Party, and the ongoing debates over Trump's legacy have shaped a nation still grappling with its identity. As DeSantis navigates the complexities of governance, the events of that day continue to cast a long shadow, reminding Americans of the fragility of democracy and the power of leadership to shape the future.GeminiOne year ago today, the political landscape of the United States was irrevocably altered. In a moment of shocking violence, a rally in Butler, Pennsylvania, became the epicenter of a national tragedy. Former President Donald Trump, the presumptive Republican nominee for the 2024 presidential election, succumbed to injuries sustained in an assassination attempt. The bullet that struck him on that sweltering July afternoon did more than just silence a powerful voice; it ignited a chain of events that sent shock waves through the Republican Party, reshaped the presidential race, and continues to define the very trajectory of American politics.The Immediate Aftermath: Chaos and a Nation in MourningThe news of Trump's death on July 13, 2024, spread like wildfire, plunging the nation into a state of disbelief and profound grief, particularly among his fervent supporters. Initial reports from Butler were chaotic, with conflicting information about the extent of his injuries. The eventual confirmation of his passing, delivered by solemn White House and medical officials, triggered an outpouring of condolences from across the political spectrum, even from those who had been his staunchest opponents. Flags were lowered to half-staff, and a period of national mourning was declared.For the Republican Party, the loss was cataclysmic. Trump had not only been their leading candidate but a dominant, almost singular, force for years. His campaign infrastructure, built around his persona, was suddenly leaderless. The upcoming Republican National Convention, just days away, was thrown into disarray.The Scramble for Succession: A Convention in CrisisThe Republican National Committee (RNC), under Rule 9 of its party rules, immediately convened an emergency session. The task was immense: to select a new presidential nominee from a field that had largely cleared out to accommodate Trump's seemingly unassailable path.The convention, originally planned as a celebratory coronation, transformed into a tense, somber, and ultimately pivotal gathering. Mike Pence, Trump's former vice president, initially emerged as a leading contender, seen by many as a steady hand and a natural successor. However, the emotional intensity of the moment, coupled with the desire for a candidate who could both honor Trump's legacy and unify a fractured party, led to unexpected turns.Figures like Florida Governor Ron DeSantis and former U.N. Ambassador Nikki Haley, who had both challenged Trump in the primaries before dropping out, reentered the conversation with renewed vigor. The internal debates were fierce, reflecting the deep ideological divides within the GOP. Ultimately, after days of intense backroom negotiations and multiple ballots, the RNC, seeking to balance experience with a fresh face capable of galvanizing the base, nominated a dark horse: Senator JD Vance of Ohio.Vance, a prominent conservative voice who had become a vocal Trump ally, was chosen, with a somewhat surprising pick for vice president: South Dakota Governor Kristi Noem, a popular figure known for her strong conservative stances and appeals to the populist wing of the party. The ticket was a deliberate attempt to retain Trump's base while projecting a younger, more dynamic image.The General Election Reshaped: A New DynamicThe Democratic Party, meanwhile, was grappling with its own challenges. President Joe Biden, who had faced persistent questions about his age and fitness, had already indicated he would not seek reelection, a decision announced shortly before the Butler shooting. This had paved the way for Vice President Kamala Harris to assume the mantle as the Democratic nominee, with Minnesota Governor Tim Walz as her running mate.The sudden absence of Donald Trump from the ballot fundamentally altered the general election narrative. No longer was it a referendum on Trump's past presidency or his controversial style. Instead, it became a contest between a unified Democratic ticket, emphasizing continuity and experience, and a Republican ticket still grappling with the shadow of its fallen leader, trying to define its future.The campaign became less about direct attacks on Trump and more about policy debates, particularly on economic issues, immigration, and America's role in a volatile global landscape. Public discourse, while still polarized, felt, to many, marginally less acrimonious without Trump's often-inflammatory rhetoric dominating the airwaves.Election Day and Beyond: A New Era BeginsThe November 2024 election was marked by record voter turnout, fueled by a sense of historical significance and the profound changes wrought by the events of July 13th. The election results were tight, reflecting a deeply divided nation. In the end, after several days of vote counting in key swing states, Kamala Harris was declared the winner, becoming the first female President of the United States.Her victory was seen by many as a testament to the resilience of the American democratic process in the face of unprecedented tragedy. The inauguration on January 20, 2025, was a solemn yet hopeful affair, acknowledging the deep wounds of the past year while looking toward a new chapter.The First Six Months of the Harris Presidency: A Look BackAs of July 13, 2025, Harris' first six months in office have been defined by a concerted effort to unify the country and address pressing domestic and international issues.\nBipartisan Reach: In a stark contrast to the previous administration's often confrontational approach, Harris has made visible efforts to engage with Republican leaders, seeking common ground on infrastructure, economic development, and even some aspects of immigration reform. While significant legislative breakthroughs remain challenging due to the narrow margins in Congress, the tone in Washington has demonstrably shifted.\nEconomic Focus: Facing persistent inflation and concerns about a potential economic slowdown, the administration has prioritized measures aimed at strengthening the middle class, investing in green energy, and re-shoring manufacturing jobs. Debates over fiscal policy remain intense, with Republicans pushing for greater spending cuts and tax reform.\nGlobal reengagement: On the international stage, Harris has emphasized the restoration of traditional alliances and a renewed commitment to multilateralism. Her administration has focused on shoring up support for Ukraine, navigating complex relations with China, and addressing ongoing conflicts in the Middle East with a more collaborative diplomatic approach.\nThe Shadow of Butler: The memory of July 13, 2024, continues to cast a long shadow. Debates over gun control have intensified, though meaningful federal legislation remains elusive. Security protocols for public figures have been significantly reviewed and tightened. The nation continues to grapple with the underlying political divisions that some argue were exacerbated, rather than healed, by the tragedy. Memorials to Donald Trump have been planned and are being erected in various locations, serving as constant reminders of the sudden and dramatic end to his political saga.\nOne year on, the impact of that fateful day in Butler is undeniable. America is on a different path, navigating a political landscape that, while still marked by profound disagreements, is undeniably altered by the absence of one of its most polarizing and influential figures. The future remains unwritten, but the events of July 13, 2024, will forever be a defining moment in the nation's history.The narratives above are speculative reconstructions grounded in known historical patterns, public statements and expert analyses. For instance, calls for unity and condemnation of violence by leaders like Biden were documented after the Butler attack. Reports showed far-right supporters spreading conspiracy theories accusing Biden of complicity contributing to a spike in political threats and violence in late 2024. Policy projections under a Harris administration were outlined in scenario analyses during the 2024 campaign and her approach to foreign crises (supporting Ukraine, navigating tension with Israel's government over Gaza, countering China) was consistent with expert expectations. These and other insights have contributed to the alternate histories, produced with AI, in this article. Please let us know what you think in the comments below.","summary":"One year on from the shooting at a Trump rally in Butler, Pennsylvania, Newsweek takes a look at what history might have been like had things gone differently.","url":"https://www.newsweek.com/what-if-trump-was-assassinated-2024-election-kamala-harris-president-2097107","image":"https://d.newsweek.com/en/full/2681259/donald-trump-assassination-butler.jpg","video":null,"publish_date":"2025-07-13 09:00:01","author":"Theo Burman","authors":["Theo Burman"],"language":"en","source_country":"us","sentiment":0.113},{"id":341119162,"title":"Biden's Legacy: What Remains After Trump Dismantled Build Back Better?","text":"Presidents are often remembered for the policies they champion and the battles they fight—both militarily abroad and culturally at home. Yet, as the Oval Office swings from party to party, the core pieces of one administration's legacy often become the first targets of the next, dismantled or remade in favor of a new mandate.Former President Joe Biden's time in office was a rare chapter in modern American politics, serving one term sandwiched between two led by President Donald Trump. Republican strategist John Feehery, partner at EFB Advocacy, described Biden to Newsweek as a \"transitional figure\" between two Trump presidencies.Where some presidents build and refine what came before, others work to tear down and reassemble the frameworks of their predecessors, often reshaping the nation's priorities in the process.The passage of Trump's sweeping domestic policy package, the One Big Beautiful Bill Act (OBBB), incorporates numerous provisions that undo Biden's Build Back Better Act agenda and presidential platform. As Trump's vision takes shape, Newsweek spoke with several politicos and professors about what this means for Biden's legacy and how it may impact the policy landscape both leaders have fought to define.Newsweek on Friday filled out an online contact form in seeking comment from Biden.Biden's Build Back Better Act Legacy Biden, who pledged to \"rebuild the backbone of the country,\" which he identified as the middle class, crafted a centerpiece bill focused on social spending and climate programs, which totaled around $1.75 trillion. The Democrat-led House passed the bill in 2021, but it was not voted upon in the Senate. However, portions of it were enacted piecemeal through other individual legislations and were a part of his larger political platform.At the time, the Congressional Budget Office (CBO) projected the Build Back Better Act would increase the deficit by $367 billion over a decade. However, based on the CBO data, the passage of the legislation would create an increase in tax revenue of $127 billion. The majority of the new revenue was due to taxes on the extremely wealthy due to tightening IRS restrictions.The bill allocated $555 billion toward clean energy and green initiatives, including funding wind and solar energy projects, as well as providing electric vehicle tax credits, among others.Fiscally, the bill aimed to provide 39 million households tax cuts up to $3,600 by expanding the Child Tax Credit. It also dedicated $400 billion to addressing child care costs and prekindergarten.The bill pushed to expand health care access, reducing premiums and closing the Medicaid Coverage Gap, supporting around 4 million uninsured people to obtain coverage even if living in states that did not expand Medicaid under the Affordable Care Act.Beyond his legislative ambitions, Biden presided over a nation grappling with the aftermath of a pandemic and the eruption of geopolitical crises. COVID-19 continued to shape American life and economic recovery efforts during his initial months as president, while across the world, Russia invaded Ukraine and Israel and Hamas broke out into war. Both mass conflicts have carried into the current administration.Feehery emphasized this, telling Newsweek that Biden \"will be seen as presiding over some of the worst public policy positions in our nation's history, namely the Covid nightmare and the Russian invasion of Ukraine.\"However, George C. Edwards III, professor of political science at Texas A&M, views Biden's legacy through a different lens, telling Newsweek, \"When the dust has settled, Joe Biden will be remembered for leading the U.S. out of the Covid-19 epidemic and helping the U.S. economy achieve a soft landing as the envy of the world.\"Edwards continued, \"He also made historic strides in building the infrastructure of the country, advancing environmental protection, fighting climate change, developing renewable energy, and investing in digital technology.\"Biden's Infrastructure Investment and Jobs Act passed both the House and Senate and was signed into law in November 2021. He also championed the CHIPS and Science Act, which was signed into law in August 2022 and allocates $52.7 billion for semiconductor research, manufacturing and workforce development in the U.S. The act may mark one of the rare instances of Trump actually reinforcing a Biden-era policy, through the president's push to increase domestic manufacturing and levy steep tariffs.Barbara Perry, presidential studies professor at the University of Virginia's Miller Center, told Newsweek: \"In the short run, President Biden's legacy seems upended by the OBBB and other reversals by the second Trump administration. In the long lens of history, however, he will be remembered for righting the ship of state, listing badly after January 6, 2021's attack on the Capitol, and saving Americans and the US economy from the ravages of the COVID-19 pandemic.\"She added that \"Unfortunately for the near-term, because of his advanced age and health status, he will not be given the decades that Presidents Carter, Bush I, and Bush II had to boost their approval ratings in active post-presidencies.\"Trump's One Big Beautiful Bill ImpactOn Independence Day, Trump signed into law his \"big, beautiful bill,\" likely to be considered the legislative legacy of his second term.The massive spending bill includes several provisions that essentially reverse large portions of Biden's policy initiatives, including massive cuts to Medicaid, elimination of electric vehicle and clean energy tax credits, tax cuts for high-income earners and corporations, and increased border security spending, education policy rollbacks, among others.Medicaid provides health coverage to tens of millions of low-income Americans, with around 71 million currently enrolled in the program. The CBO estimates that more than 10 million Americans could lose their health coverage under the law, and also anticipates the bill to slash the program by about $790 billion over the next decade to help offset roughly $4.5 trillion in tax breaks.\"The effects of Trump's bill are so far-reaching that it's not just Biden's legacy that's at stake but FDR's, Truman's, Eisenhower's, JFK's, and, maybe above all, LBJ's,\" Sean Wilentz, professor of American history at Princeton University, told Newsweek in an email, pointing to the \"effective destruction\" of federal medical programs.Edwards said that while \"Donald Trump is trying to reverse Biden's policies regarding climate change and renewable energy,\" it will be trying, as \"the foundations have been laid.\"Conversely, Republican strategist Matt Klink told Newsweek that \"Donald Trump is effectively erasing many of the Biden administration's most notable and public achievements,\" through the passage of his sweeping spending bill. He argues the bill has three central premises: \"First, it reinforces long-time Republican priorities about the social safety net being there for people when needed, not a permanent government handout.\"\"Second, for Donald Trump's [Make America Great Again] MAGA supporters, it provides funding to deliver on the president's campaign promises such as the border wall, more aggressive immigration enforcement, and a defense build-up.\"And lastly, according to Klink, \"it negatively impacts the Biden-Harris legacy and has thrown national Democrats for a loop.\"He concluded, \"President Biden, previously viewed as a moderate, was either misled or wasn't capable of stopping a radical leftward plunge by national Democrats. The center-right American electorate reacted negatively toward Joe Biden, Kamala Harris, and Congressional Democrats.\"As Republicans and Democrats gear up for the pivotal 2026 midterms—a referendum on Trump's tenure as much as a battle for Congress—the Democratic Party is taking a hard look at Biden's legacy and the fallout from the 2024 election. With control of the House and Senate at stake, they're racing to rebrand, regroup and mobilize their bases for the fight ahead.For Trump, his \"big, beautiful bill\" may soon stand as the cornerstone of his legacy, as its sweeping provisions take effect, dismantling significant portions of Biden's policy achievements and reshaping the nation's economic and social landscape.","summary":"Nearly six months into Trump's second term, he has passed a sweeping bill that works to erase much of Biden's policy legacy.","url":"https://www.newsweek.com/bidens-legacy-what-remains-after-trump-dismantled-build-back-better-2097514","image":"https://d.newsweek.com/en/full/2681375/bidens-legacy-build-back-better-what-remains.png","video":null,"publish_date":"2025-07-13 09:00:01","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","category":"politics","source_country":"us","sentiment":0.207},{"id":341139896,"title":"Reece James backs Chelsea to stun PSG in FIFA Club World Cup final, video: \"We're going to surprise a lot of people\"","text":"Chelsea captain Reece James had made a bold statement ahead of the 2025 FIFA Club World Cup final today, July 13The England international believes the Blues are not pushovers despite all odds favouring the reigning UEFA Champions League winnersBoth teams recorded one loss each during their group stage matches and are expected to light up the MetLife Stadium\n\nReece James is confident Chelsea will surprise doubters when they face Paris Saint-Germain in the 2025 FIFA Club World Cup final on Sunday, July 13.\n\nThe Ligue 1 giants have been labelled favourites to win the tournament, but the England international said the Blues will make a statement when they clash at the MetLife Stadium \n\nThe Premier League side outclassed South American side Fluminense by two goals to nothing in the semi-final last Wednesday, July 9.\n\nNew signing Joao Pedro, who was on holiday in Brazil, scored a brace for Chelsea against his boyhood club. \n\nI don't care- James\n\nChelsea captain Reece James said he is not bothered about the pedigree of Paris Saint-Germain during the Club World Cup.\n\nAccording to Daily Mail, the 25-year-old said the Blues are preparing to win the tournament for the second time.\n\nThe England star emphasised that had had played for a favourite in the final, where they did not eventually win the trophy, adding that the same fate may befall PSG. He said BBC:\n\n\"I want to be honest with you, I do not care that everyone is hyping our opponent. The team is preparing right, and Chelsea is going to the final to win.\n\n\"As a player, I have been to many finals before where my team were the favourites but we ended up losing.\n\n\"PSG are amazing and we're expecting a tough game, but we also have an amazing team and we're going to surprise a lot of people.\"\n\nStats on PSG form\n\nParis Saint-Germain are currently in the best form of their life since Lius Enrique took over as coach.\n\nAccording to beINSPORTS, PSG have won a treble consisting of the French Cup, Ligue 1 and Champions League, and are a game away from a fourth major trophy of 2025 after dismantling Real Madrid 4-0 in their semi-final last Thursday, July 10.\n\nThe French giants have beaten other Premier League sides, Manchester City, Liverpool, Aston Villa and Arsenal, in the Champions League before humbling Inter Milan 5-0 in the final.\n\nTrump confirms presence at CWC final \n\nLegit.ng earlier reported that US President Trump has confirmed that he will be in attendance at the final at the MetLife Stadium on Sunday, a year after a failed assassination attempt on him in Butler, Pennsylvania. \n\nThe 45th and 47th president of the United States also hinted that he will present the trophy, which has been at the Oval Office after its unveiling, to the winner. \n\nTrump escaped with a minor wound after he was shot at during a Republican Party open-air campaign rally ahead of the presidential election against Kamala Harris.\n\nSource: Legit.ng","summary":"Chelsea captain Reece James says the Blues are ready to shock favourites Paris Saint-Germain in the 2025 FIFA Club World Cup final at MetLife Stadium, United States.","url":"https://www.legit.ng/sports/football/1664094-surprise-a-lot-people-chelsea-captain-speaks-cwc-final-psg-video/","image":"https://cdn.legit.ng/images/1200x675/c92ea84059b2ba7d.jpeg?v=1","video":null,"publish_date":"2025-07-13 08:52:02","author":"Bayo Olupohunda,Dare Kuti","authors":["Bayo Olupohunda","Dare Kuti"],"language":"en","source_country":"ng","sentiment":-0.119},{"id":341109712,"title":"Report on Trump assassination attempt out; was Secret Service aware of threat?","text":"Secret Service officials came to know about a threat to Donald Trump's life days before the Republican leader was targeted in an assassination attempt in Butler, Pennsylvania, according to a Government Accountability Office (GAO) report. The report was requested and shared by senator Chuck Grassley of Trump's Republican Party, ahead of the first anniversary (July 13) of the attack by Thomas Matthew Crooks, who was eliminated by a Secret Service sniper moments after the gunman fired shots at Trump.\"Senior-level Secret Service officials became aware of a threat to then-former President Trump. This information was not specific to the July 13 rally or gunman,\" it noted, adding that the agents on the ground, as well as local law enforcement, were left unaware due to the agency's \"siloed practice for sharing classified threat information.\"\"Making changes to Secret Service policies to require it to proactively share threat information internally could help ensure its agents and partners will have information needed to provide effective protection,\" the GAO recommended.In a statement accompanying the report, Grassley said the agency's failures were the result of \"a series of bad decisions and bureaucratic handicaps.\"\"The Secret Service's failure was the culmination of years of mismanagement and came after the Biden administration denied requests for enhanced security to protect President Trump. Americans should be grateful that President Trump survived that day and was ultimately re-elected to restore common sense to our country,\" he stated.The report also noted that several Secret Service officers experienced limited cellphone service during the rally, which may have impacted their ability to communicate effectively in real time.The attack killed one person - attendee Corey Comperatore - and injured two others, while Trump was grazed by a bullet. At the time, he was the Republican Party's presumptive nominee for the November presidential polls; he would go on to clinch the nomination, and defeated the then-Vice President Kamala Harris to complete a remarkable return to the White House for a second and final term, four years after losing as the incumbent president to Joe Biden.Meanwhile, Grassley further highlighted a $1.17 billion allocation to the Secret Service as part of the newly passed One Big Beautiful Bill Act, saying it would be used to address the agency's shortcomings.\"I'm hopeful this significant injection of resources will go a long way in bringing the agency up to speed,\" he added.Earlier, six agents were suspended for security failures linked to the assassination attempt. The suspensions, ranging from 10 to 42 days, involved personnel from both supervisory and line agent levels, according to deputy director Matt Quinn.","summary":"A Government Accountability Office report revealed that the Secret Service was aware of a threat to Donald Trump before the assassination attempt in Pennsylvania. The report, requested by Senator Chuck Grassley, highlighted failures in sharing classified threat information, leaving agents and local law enforcement unprepared.","url":"https://timesofindia.indiatimes.com/world/us/series-of-bad-decisions-report-on-trump-assassination-attempt-out-was-secret-service-aware-of-threat/articleshow/122416628.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-122416697/122416697.jpg","video":null,"publish_date":"2025-07-13 08:02:44","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.16},{"id":341101544,"title":"Trump Considers Revoking Rosie O’Donnell’s US Citizenship","text":"WASHINGTON (AP) — President Donald Trump has stated that he is seriously considering the possibility of “revoking” the U.S. citizenship of actress and comedian Rosie O’Donnell, a long-term adversary, despite a longstanding Supreme Court decision that forbids the government from taking such an action.\n\n“Due to the fact that Rosie O’Donnell is not beneficial for our Great Country, I am giving serious thought to revoking her Citizenship,” Trump wrote in a social media post on Saturday. He also mentioned that O’Donnell, who relocated to Ireland in January, should remain there “if they accept her.”\n\nTheir public criticisms of one another have continued for many years, often in a bitter exchange that started well before Trump entered the political scene. Recently, O’Donnell has used social media to condemn Trump and his administration’s recent decisions, including the passing of a large GOP-favored tax breaks and spending cuts plan.\n\nIt’s just the latest threat by Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk.\n\nBut O’Donnell’s situation is notably different from Musk, who was born in South Africa. O’Donnell was born in the United States and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps – but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the Fourteen Amendment of the Constitution prevents the government from taking away citizenship.\n\n“The president has no authority to take away the citizenship of a native-born U.S. citizen,” Frost said in an email Saturday. “In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.”\n\nO’Donnell moved to Ireland after Trump defeated Vice President Kamala Harris to win his second term. She has said she’s in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Trump Saturday, O’Donnell wrote on social media that she had upset the president and “add me to the list of people who oppose him at every turn.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON (AP) — President Donald Trump has stated that he is seriously&#8230;\n\n\nThis Post: Trump Considers Revoking Rosie O&#8217;Donnell&#8217;s US Citizenship first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-considers-revoking-rosie-odonnells-us-citizenship/","image":"https://internewscast.com/wp-content/uploads/2025/07/Trump-says-he039s-considering-039taking-away039-Rosie-O039Donnell039s-US-citizenship.jpg","video":null,"publish_date":"2025-07-13 07:23:37","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.021},{"id":341083950,"title":"Trump ‘considering’ taking away US citizenship from comedian Rosie O’Donnell","text":"President Donald Trump says he is considering “taking away” the US citizenship of a long-time rival: the actress and comedian, Rosie O’Donnell.\n\nThe move comes despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government.\n\n“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Mr Trump wrote in a social media post on Saturday.\n\nHe added that Ms O’Donnell, who moved to Ireland in January, should stay in Ireland “if they want her”.\n\nThe two have criticised each other publicly for years, an often bitter back-and-forth that predates Mr Trump’s involvement in politics.\n\nIn recent days, O’Donnell on social media denounced Mr Trump and recent moves by his administration, including the signing of a massive tax breaks and spending cuts plan.\n\nIt is just the latest threat by Mr Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk.\n\nBut Ms O’Donnell’s situation is notably different from Mr Musk, who was born in South Africa.\n\nMs O’Donnell was born in the United States and has a constitutional right to US citizenship.\n\nThe US State Department notes on its website that US citizens by birth or naturalisation may relinquish US nationality by taking certain steps – but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the 14th Amendment of the constitution prevents the government from taking away citizenship.\n\n“The president has no authority to take away the citizenship of a native-born US citizen,” Ms Frost said in an email on Saturday.\n\n“In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.”\n\nMs O’Donnell moved to Ireland after Mr Trump defeated vice president Kamala Harris to win his second term. She has said she is in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Mr Trump on Saturday, Ms ‘Donnell wrote on social media that she had upset the president and “add me to the list of people who oppose him at every turn”.","summary":"President Donald Trump says he is considering “taking away” the US citizenship of a long-time rival: the actress and comedian, Rosie O’Donnell. The move comes despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government. “Because of the fact that Rosie O’Donnell is not in the best interests of our [&#8230;]\n\n\nThe post Trump ‘considering’ taking away US citizenship from comedian Rosie O’Donnell appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/entertainment/2025/07/13/trump-considering-taking-away-us-citizenship-from-comedian-rosie-odonnell/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/07/4a1f85b41dba44738b9b633f39f48f0b-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-07-13 06:59:01","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.006},{"id":341083000,"title":"Trump ‘considering’ taking away US citizenship from comedian Rosie O’Donnell","text":"“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Mr Trump wrote in a social media post on Saturday.\n\nHe added that Ms O’Donnell, who moved to Ireland in January, should stay in Ireland “if they want her”.\n\nThe two have criticised each other publicly for years, an often bitter back-and-forth that predates Mr Trump’s involvement in politics.\n\nIn recent days, O’Donnell on social media denounced Mr Trump and recent moves by his administration, including the signing of a massive tax breaks and spending cuts plan.\n\nIt is just the latest threat by Mr Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk.\n\nBut Ms O’Donnell’s situation is notably different from Mr Musk, who was born in South Africa.\n\nMs O’Donnell was born in the United States and has a constitutional right to US citizenship.\n\nThe US State Department notes on its website that US citizens by birth or naturalisation may relinquish US nationality by taking certain steps – but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the 14th Amendment of the constitution prevents the government from taking away citizenship.\n\n“The president has no authority to take away the citizenship of a native-born US citizen,” Ms Frost said in an email on Saturday.\n\n“In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.”\n\nMs O’Donnell moved to Ireland after Mr Trump defeated vice president Kamala Harris to win his second term. She has said she is in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Mr Trump on Saturday, Ms ‘Donnell wrote on social media that she had upset the president and “add me to the list of people who oppose him at every turn”.","summary":"President Donald Trump says he is considering “taking away” the US citizenship of a long-time rival: the actress and comedian, Rosie O’Donnell.The ...","url":"https://www.irishexaminer.com/world/arid-41668745.html","image":"https://www.irishexaminer.com/cms_media/module_img/9403/4701635_1_seoimage1x1_4a1f85b41dba44738b9b633f39f48f0b.jpg.jpg","video":null,"publish_date":"2025-07-13 06:59:00","author":"Associated Press Reporters,Irishexaminer.com","authors":["Associated Press Reporters","Irishexaminer.com"],"language":"en","category":"politics","source_country":"ie","sentiment":0.026},{"id":341066744,"title":"'It was unforgettable': Trump reflects on Butler assassination attempt","text":"The first anniversary of Donald Trump's near-assassination in Butler, Pennsylvania, has served as a stark reminder of the lingering impact of that day when a gunman opened fire at a campaign rally, grazing the ear of the then-Republican presidential candidate, and killing one of his supporters in the crowd.\n\nOne year after coming millimetres from a very different outcome, Mr Trump is, according to friends and aides, still the same, but they see signs — beyond being on higher alert on stage — that his brush with death did change him in some ways.\n\n\"I think it's always in the back of his mind,\" said South Carolina senator Lindsey Graham, a long-time friend who was in close touch with Mr Trump after the shooting, and joined him that night in New Jersey after he was treated at a Pennsylvania hospital.\n\n\"He's still a rough and tumble guy, you know. He hasn't become a Zen Buddhist. But I think he is, I'll say this, more appreciative. He's more attentive to his friends,\" he said, pointing to Mr Trump sending him a message on his birthday earlier this week.\n\nSenator Graham added: \"It's just a miracle he's not dead. He definitely was a man who believed he had a second lease on life.\"\n\nThe attack dramatically up-ended the 2024 campaign and launched a frenzied 10-day stretch that included Mr Trump's triumphant arrival at the Republican National Convention with a bandaged ear, with then-US president Joe Biden's decision to abandon his re-election bid, and the elevation of then-vice president Kamala Harris as his successor.\n\nConstant reminders\n\nWhile many who survive traumatic events try to block them from memory, Mr Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history.\n\nHe's decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted: \"Fight, fight, fight!\"\n\nA painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president's residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk.\n\nAnd while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his \"all-time favourite chart in history\" of southern border crossings, that he credits for saving his life.\n\nDuring a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting.\n\nThe president reflected on the shooting in an interview on Fox News with his daughter-in-law, Lara Trump, earlier this week.\n\n\"Well it was unforgettable. I didn't know exactly what was going on. I got whacked, there's no question about that,\" he told Fox News.\n\n\"Our sniper, within less than five seconds was able to get in from a long distance with one shot.\n\n\"If he didn't do that, you would've had an even worse situation, it was really bad. His name is David, he did a fantastic job. He just went about his business. Less than about four seconds, and that's when it all stopped and he got him perfectly from a long distance, we got a little bit lucky in that regard,\" Mr Trump said.\n\nShooter's motive remains unclear\n\nA year on from the assassination attempt and authorities say the shooter's motive remains unclear.\n\nThomas Matthew Crooks, 20, was identified by the FBI as the person behind the attack that injured Mr Trump and killed a 50-year-old volunteer firefighter.\n\nMr Crooks shot Mr Trump from the rooftop of a nearby building and was killed by Secret Service snipers shortly after he opened fire.\n\nAuthorities said they have not found any kind of manifesto or motivation for the attack.\n\nMr Crooks was a registered Republican and the 2024 election would've been the first time he was old enough to vote in a presidential election.\n\nHe was a resident of Bethel Park, Pennsylvania, about an hour away from where the rally was held.\n\nThe FBI had to analyse Crooks's DNA because he did not have any form of identification on him during the attack.\n\nTrump spared for a reason\n\nMr Trump's chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview that he walked away from the shooting believing he had been spared for a reason.\n\n\"I would say, I think he believes that he was saved. I do. And he would never — even if he thought it before, I don't think he would have admitted it. And he will now,\" she told Pod Force One.\n\nAs a result, she said, when Mr Trump says things that \"are perfunctory — every president says 'God bless America' — well, it's more profound with him now, and it's more personal\".\n\nShe also credited the attack with helping change public perceptions of Mr Trump during the campaign.\n\n\"For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that's helpful,\" she said.\n\nRoger Stone, a long-time friend and informal adviser, noted that Mr Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989, and another near-assassination two months after Butler when US Secret Service agents spotted a man pointing a rifle through the fence near where Mr Trump was golfing.\n\nMr Stone said he's found the president \"to be more serene and more determined after the attempt on his life\" in Butler.\n\n\"He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,\" he said.\n\nRalph Reed, chair of the Faith and Freedom Coalition, agreed.\n\n\"I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was, and if you don't turn your head at that instant,\" he said. \"He knew he was lucky to be alive.\"\n\nGiven how close Mr Trump came to a very different outcome, Mr Reed said, \"it's hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I've talked to who said they were confident that he would win for that reason. That there must have been a reason\".\n\nMr Trump will spend the anniversary of the assassination attempt, attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey.","summary":"US President Donald Trump reflects on his near-assassination after he was shot at a rally in Butler, Pennsylvania, on July 13, 2024.","url":"https://www.abc.net.au/news/2025-07-13/donald-trump-reflects-on-assassination-attempt-one-year-on/105526454","image":"https://live-production.wcms.abc-cdn.net.au/f5c76c7f5c6daf140905588f1a50dc5f?impolicy=wcms_crop_resize&cropH=1594&cropW=2833&xPos=0&yPos=82&width=862&height=485","video":null,"publish_date":"2025-07-13 05:21:22","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":0.066},{"id":341049662,"title":"A year after Trump's near-assassination, friends and allies see some signs of a changed man","text":"APUS President Donald Trump\n\nWASHINGTON: President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance. \"Did I hear what I think I heard?\" Trump remarked as he spoke from behind a wall of thick, bulletproof glass. \"Don't worry, it's only fireworks. I hope. Famous last words,\" he quipped, drawing laughs and cheers. \"You always have to think positive,\" he went on. \"I didn't like that sound, either.\" The comments, just days before the first anniversary of Trump's near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump's ear and killing one of his supporters in the crowd. The attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Trump's triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden's decision to abandon his reelection bid and the elevation of Vice President Kamala Harris as his successor.Live Events One year after coming millimeters from a very different outcome, Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term, making him even more dug in on achieving his far-reaching agenda. \"I think it's always in the back of his mind,\" said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. \"He's still a rough and tumble guy, you know. He hasn't become a Zen Buddhist. But I think he is, I'll say this, more appreciative. He's more attentive to his friends,\" he said, pointing to Trump sending him a message on his birthday earlier this week. Graham added: \"It's just a miracle he's not dead. He definitely was a man who believed he had a second lease on life.\" Constant reminders While many who survive traumatic events try to block them from memory, Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He's decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, \"Fight, fight, fight!\" A painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president's residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk. And while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his \"all-time favorite chart in history\" of southern border crossings that he credits for saving his life. During a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting. \"I get that throbbing feeling every once in a while,\" he said, gesturing to his ear. \"But you know what, that's OK. This is a dangerous business. What I do is a dangerous business.\" Trump will spend Sunday's anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey. Crediting divine intervention Trump's chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason. \"I would say I think he believes that he was saved. I do. And he would never - even if he thought it before, I don't think he would have admitted it. And he will now,\" she told \"Pod Force One.\" She, too credited divine intervention. The chart, she noted, \"was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn't happen because it happened. It happened because, I believe, God wanted him to live.\" As a result, she said, when Trump says things that \"are perfunctory - every president says 'God bless America' - well, it's more profound with him now, and it's more personal.\" She also credited the attack with helping change public perceptions of Trump during the campaign. \"For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that's helpful,\" she said. \"You know, I have an obligation to do a good job, I feel, because I was really saved,\" Trump told Fox News Friday. \"I owe a lot. And I think - I hope - the reason I was saved was to save our country.\" Roger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when U.S. Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing. Stone said he's found the president \"to be more serene and more determined after the attempt on his life\" in Butler. \"He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,\" he said. Ralph Reed, chairman of the Faith and Freedom Coalition, agreed. \"I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don't turn your head at that instant,\" he said. \"He knew he was lucky to be alive.\" Given how close Trump came to a very different outcome, Reed said, \"it's hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I've talked to who said they were confident that he would win for that reason. That there must have been a reason.\"(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontrumpwhite housetrump sstonerepublican national conventionfox newsralph reedroger stone\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontrumpwhite housetrump sstonerepublican national conventionfox newsralph reedroger stone(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"One year after a near-assassination attempt, Donald Trump reflects on the event's impact. Friends and aides note he is more appreciative and believes he was saved by God to save the country. Trump commemorates the event with memorabilia and sees it as a sign of divine intervention, fueling his determination to achieve his agenda and restore the nation.","url":"https://economictimes.indiatimes.com/news/international/global-trends/a-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-a-changed-man/articleshow/122414097.cms","image":"https://img.etimg.com/thumb/msid-122414104,width-1200,height-630,imgsize-122760,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-13 03:06:41","author":"Jill Colvin","authors":["Jill Colvin"],"language":"en","source_country":"in","sentiment":0.096},{"id":341045268,"title":"A year after Trump’s near-assassination, friends and allies see some signs of a changed man","text":"WASHINGTON (AP) — President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country’s 250th anniversary celebration, when he heard what sounded like fireworks in the distance.\n\n“Did I hear what I think I heard?” Trump remarked as he spoke from behind a wall of thick, bulletproof glass. “Don’t worry, it’s only fireworks. I hope. Famous last words,” he quipped, drawing laughs and cheers.\n\n“You always have to think positive,” he went on. “I didn’t like that sound, either.”\n\nThe comments, just days before the first anniversary of Trump’s near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump’s ear and killing one of his supporters in the crowd.\n\nThe attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Trump’s triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden’s decision to abandon his reelection bid and the elevation of Vice President Kamala Harris as his successor.\n\nOne year after coming millimeters from a very different outcome, Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term, making him even more dug in on achieving his far-reaching agenda.\n\n“I think it’s always in the back of his mind,” said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. “He’s still a rough and tumble guy, you know. He hasn’t become a Zen Buddhist. But I think he is, I’ll say this, more appreciative. He’s more attentive to his friends,” he said, pointing to Trump sending him a message on his birthday earlier this week.\n\nGraham added: “It’s just a miracle he’s not dead. He definitely was a man who believed he had a second lease on life.”\n\nConstant reminders\n\nWhile many who survive traumatic events try to block them from memory, Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He’s decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, “Fight, fight, fight!”\n\nA painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president’s residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk.\n\nAnd while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his “all-time favorite chart in history” of southern border crossings that he credits for saving his life.\n\nDuring a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting.\n\n“I get that throbbing feeling every once in a while,” he said, gesturing to his ear. “But you know what, that’s OK. This is a dangerous business. What I do is a dangerous business.”\n\nTrump will spend Sunday’s anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey.\n\nCrediting divine intervention\n\nTrump’s chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason.\n\n“I would say I think he believes that he was saved. I do. And he would never — even if he thought it before, I don’t think he would have admitted it. And he will now,” she told “Pod Force One.”\n\nShe, too credited divine intervention. The chart, she noted, “was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn’t happen because it happened. It happened because, I believe, God wanted him to live.”\n\nAs a result, she said, when Trump says things that “are perfunctory — every president says ‘God bless America’ — well, it’s more profound with him now, and it’s more personal.”\n\nShe also credited the attack with helping change public perceptions of Trump during the campaign.\n\n“For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that’s helpful,” she said.\n\n“You know, I have an obligation to do a good job, I feel, because I was really saved,” Trump told Fox News Friday. “I owe a lot. And I think — I hope — the reason I was saved was to save our country.”\n\nRoger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when U.S. Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing.\n\nStone said he’s found the president “to be more serene and more determined after the attempt on his life” in Butler.\n\n“He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,” he said.\n\nRalph Reed, chairman of the Faith and Freedom Coalition, agreed.\n\n“I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don’t turn your head at that instant,” he said. “He knew he was lucky to be alive.”\n\nGiven how close Trump came to a very different outcome, Reed said, “it’s hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I’ve talked to who said they were confident that he would win for that reason. That there must have been a reason.”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country&#8217;s 250th anniversary celebration, when he heard what sounded like fireworks...","url":"https://wsvn.com/news/politics/a-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-a-changed-man/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/07/2150712_Trump_assassination_attempt_Pennsylvania.png","video":null,"publish_date":"2025-07-13 02:25:39","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":0.068},{"id":341064852,"title":"Trump threatens to strip Rosie O’Donnell of U.S. citizenship","text":"President Donald Trump said he was weighing using the power of the government against one of his longtime entertainment world nemeses, comedian and actress Rosie O’Donnell, threatening to revoke her citizenship.\n\nTrump said on Truth Social this morning, “Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship.”\n\nThe president called O’Donnell a “threat to humanity” and said she should stay in Ireland, where she moved to in January after Trump won a second term.\n\nTrump’s headline-grabbing provocation about O’Donnell comes at a moment in which his administration is contending with criticism on many fronts: His top law enforcement officials are bitterly feuding over the Jeffrey Epstein saga; there remain unanswered questions about the decision to halt munitions to Ukraine and who authorized it; the homeland security chief is facing intense scrutiny over the Federal Emergency Management Agency’s response in Texas; and so on.\n\nO’Donnell snapped back at Trump with her own barrage of insults on Instagram.\n\n“The president of the USA has always hated the fact that I see him for who he is — a criminal con man sexual abusing liar out to harm our nation to serve himself,” she said. “This is why I moved to Ireland.”\n\nShe further taunted the president in a subsequent post showing a photo of Trump with Epstein, taken in 1997 in Palm Beach, Florida.\n\n“You want to revoke my citizenship? Go ahead and try, King Joffrey with a tangerine spray tan,” she said, referring to the sadistic child-king in “Game of Thrones.”\n\nExperts said the president does not have the power to take away the citizenship of a U.S.-born citizen.\n\nJulia Gelatt, associate director of the immigration program at the Migration Policy Institute, said: “U.S. citizens can relinquish their citizenship voluntarily, and federal courts can strip naturalized citizens of their citizenship if there is proven fraud or misrepresentation or other major cause. But U.S.-born citizens cannot have their citizenship taken away.”\n\nAmanda Frost, an expert on citizenship law at the University of Virginia School of Law, cited Supreme Court precedent.\n\n“In 1967, the U.S. Supreme Court declared in Afroyim v. Rusk that the Citizenship Clause of the Fourteenth Amendment bars the government from stripping citizenship, stating: ‘In our country the people are sovereign and the government cannot sever its relationship to the people by taking away their citizenship,’” she said in an email.\n\nTrump’s feud with O’Donnell dates to 2006, when she mocked the president on “The View” for defending a Miss USA contestant roiled in a controversy. She questioned his own moral compass and role as a businessman. Trump, who at the time was best known for his show, “The Apprentice,” threatened to sue “The View” over her comments.\n\nSoon after, Trump began hurling insults at O’Donnell, calling her “fat” and “wacko.” In a 2015 Republican debate on Fox News, one of the moderators said, “You’ve called women you don’t like fat pigs, dogs, slobs and disgusting animals.” Trump interjected: “Only Rosie O’Donnell.”\n\nTrump’s threat to revoke O’Donnell’s citizenship is the latest in a series of statements he has made about political adversaries and celebrities who have criticized him.\n\nAfter billionaire Elon Musk and Trump fought publicly over the president’s sprawling domestic policy bill, the president suggested he might be interested in deporting Musk.\n\nWhen asked by a reporter if he would deport Musk, a naturalized U.S. citizen who was born in South Africa, Trump responded, “I don’t know. We’ll have to take a look.”\n\nTrump has repeated baseless claims that Zohran Mamdani, the Democratic nominee for mayor of New York City, is living in the U.S. without legal status. Trump has threatened to arrest him if he interfered with the federal crackdown on illegal immigration.\n\nHe’s also called for “major investigations” into celebrities like Bruce Springsteen and Beyonce, calling their endorsements of Kamala Harris in last year’s presidential election “corrupt and unlawful.”\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"President Donald Trump said he was weighing using the power of the government against one of his longtime entertainment world nemeses, comedian and actress Rosie O&#8217;Donnell, threatening to revoke her citizenship.","url":"https://www.staradvertiser.com/2025/07/12/breaking-news/trump-threatens-to-strip-rosie-odonnell-of-u-s-citizenship/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_20250712_WEB_TRUMP-ODONNELL-CITIZENSHIP.jpeg","video":null,"publish_date":"2025-07-13 02:18:00","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":-0.246},{"id":341033394,"title":"Trump voters say president’s tariffs are major red flag for them: new poll","text":"Many supporters of President Donald Trump are not fans of his trade policies, with a new poll showing them slamming his tariffs. \n\nA poll by Politico and Public First conducted in June found that between a quarter and almost half of those who backed Trump in last year’s election harbor doubts about various parts of his tariff policies, particularly when it comes to China. \n\nOnly half of Trump voters think his tariffs on China will benefit U.S. companies, according to the poll. \n\nThis comes as the president has refocused his efforts on trade and bringing industries back to the U.S. Trump recently sent off several contentious tariff letters to other countries, which outlined his threats to put in place major new tariffs. \n\nThe poll from mid-June, well before the tariff letters were sent, reveals that Trump may lose some supporters over his policies. While he promised during the 2024 campaign to bring down the cost of living, his trade policies now may rock the global economy and push up inflation. \n\nRoughly one in four Trump voters said in the poll that the tariffs are damaging the ability of the U.S. to negotiate trade deals with other countries. The president’s supporters are also evenly split on whether Trump should have the power to impose tariffs, with 44 percent saying he should have Congress’s approval versus 45 percent who say he should have the authority to put in place the levies. \n\nTrump has said that he may put in place yet another round of tariffs on August 1, threatening a 30 percent tariff on goods from Mexico and the European Union. The tariffs, which Trump has claimed will bring in “big money” to the U.S., are paid by the importer, and many companies pass those costs on to the customer. \n\nForty-six percent of Trump voters said they back tariffs on China “even if it increases prices at home.” Meanwhile, 32 percent say they only support tariffs if it doesn’t raise prices, and nine percent said they oppose tariffs. Twenty-five percent of Trump voters said the tariffs on China hurt U.S. companies. \n\nHowever, 55 percent said that while it will be challenging to get a deal with China, they expect that the president “will be able to do it.” Eighteen percent said it won’t be difficult to reach an agreement. Twelve percent said Trump won’t be able to get a deal with the second-largest economy in the world. \n\nAmong those who voted for former Vice President Kamala Harris, 47 percent said the same. Eighty-six percent of Harris voters said the tariffs are damaging to the U.S. ability to arrange better trade deals.","summary":"Only half of Trump voters think his tariffs on China will benefit U.S. companies","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-tariffs-poll-voters-b2787994.html","image":"https://static.independent.co.uk/2025/07/12/21/11-88efd82867e543d0bfca2fb7f0e00322.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/am4xLKX4-OhrQWqOm.mp4","publish_date":"2025-07-13 00:46:53","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.182},{"id":341025934,"title":"Trump says he's considering 'taking away' Rosie O'Donnell's U.S. citizenship","text":"WASHINGTON — President Donald Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actress and comedian Rosie O’Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government.\n\n“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Trump wrote in a social media post on Saturday. He added that O’Donnell, who moved to Ireland in January, should stay in Ireland “if they want her.”\n\nThe two have criticized each other publicly for years, an often bitter back-and-forth that predates Trump’s involvement in politics. In recent days, O’Donnell on social media denounced Trump and recent moves by his administration, including the signing of massive GOP-backed tax breaks and spending cuts.\n\nIt’s just the latest threat by Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk.\n\nBut O’Donnell’s situation is notably different from Musk, who was born in South Africa. O’Donnell was born in the United States and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps — but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the Fourteenth Amendment of the Constitution prevents the government from taking away citizenship.\n\n“The president has no authority to take away the citizenship of a native-born U.S. citizen,” Frost said in an email Saturday. “In short, we are a nation founded on the principle that the people choose the government; the government cannot choose the people.”\n\nO’Donnell moved to Ireland after Trump defeated Vice President Kamala Harris to win his second term. She has said she’s in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Trump on Saturday, O’Donnell wrote on social media that she had upset the president and “add me to the list of people who oppose him at every turn.”","url":"https://chicago.suntimes.com/nation-world/2025/07/12/trump-says-hes-considering-taking-away-rosie-odonnells-u-s-citizenship","image":"https://cst.brightspotcdn.com/dims4/default/b4ed83e/2147483647/strip/true/crop/2259x1290+0+116/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F91%2F6e%2F7f2a26ca486791a6a0b9ad0d5e99%2Ftrum","video":null,"publish_date":"2025-07-12 22:13:32","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.049},{"id":341041156,"title":"Trump says he's considering 'taking away' Rosie O'Donnell's US citizenship","text":"WASHINGTON — President Donald Trump said he is considering \"taking away\" the U.S. citizenship of a longtime rival, actor and comedian Rosie O'Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government.\n\n\"Because of the fact that Rosie O'Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,\" Trump wrote in a social media post Saturday. He added that O'Donnell, who moved to Ireland in January, should stay in Ireland \"if they want her.\"\n\nThe two criticized each other publicly for years, an often bitter back-and-forth that predates Trump's involvement in politics. On social media in recent days, O'Donnell denounced Trump and recent moves by his administration, including the signing of a massive Republican-backed tax breaks and spending cuts plan.\n\nIt's not the first time Trump threatened to revoke the citizenship of people with whom he publicly disagreed; most recently, he also targeted his former adviser and one-time ally, Elon Musk.\n\nO'Donnell's situation is notably different from Musk, who was born in South Africa. O'Donnell was born in the United States and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps — but only if the act is performed voluntarily and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the Fourteen Amendment of the Constitution prevents the government from taking away citizenship.\n\n\"The president has no authority to take away the citizenship of a native-born U.S. citizen,\" Frost said in an email Saturday. \"In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.\"\n\nO'Donnell moved to Ireland after Trump defeated Democratic Vice President Kamala Harris, winning his second term. She said she's in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Trump on Saturday, O'Donnell wrote on social media that she upset the president and \"add me to the list of people who oppose him at every turn.\"","summary":"She was born in the United States and the Fourteen Amendment of the Constitution prevents the government from taking away citizenship.","url":"https://buffalonews.com/news/nation-world/government-politics/article_88158389-a5c2-5d03-b55f-f62eac9cfbdd.html","image":"https://bloximages.chicago2.vip.townnews.com/buffalonews.com/content/tncms/assets/v3/editorial/8/81/88158389-a5c2-5d03-b55f-f62eac9cfbdd/6872d5691dfb7.preview.jpg?crop=1698%2C891%2C19%2C97&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-07-12 21:30:00","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.112},{"id":341012420,"title":"How Trump sued CBS and won: The '60 Minutes' settlement that rocked the media world, explained","text":"President Donald Trump sued CBS News and its parent company, Paramount Global, in October 2024 over an interview on \"60 Minutes\" with then-Vice President Kamala Harris. Trump accused the outlet of deceptive editing and election interference. The lawsuit and its subsequent settlement have far-reaching implications and set off a fierce debate about media ethics and accountability, as well as corporate interference. Fox News Digital breaks down exactly what happened — from the final payout to speculation as to why Paramount settled and what blowback the lawsuit has received since. What happened: October 8, 2024: CBS '60 Minutes' airs two different answers from former Vice President Kamala Harris to the same question | Watch October 18, 2024: Former FCC commissioner explains if CBS News could be in hot water over editing | Watch October 20, 2024: CBS breaks its silence over editing allegations October 31, 2024: Trump sues CBS News for $10 billion alleging 'deceptive doctoring' of Harris' '60 Minutes' interview February 5, 2025: FCC releases CBS News' raw '60 Minutes' transcript April 14, 2025: Trump lashes out at CBS News and \"60 Minutes\" April 23, 2025: \"60 Minutes\" executive producer Bill Owens abruptly quits May 9, 2025: Paramount, CBS News' parent company, faces mounting pressure May 29, 2025: Trump rejects Paramount's $15 million offer to settle CBS News lawsuit July 1, 2025: Paramount, CBS pay eight figures, change editorial policy in settlement | Watch July 7, 2025: CBS parent company sparks massive outrage with Trump lawsuit settlement CLICK HERE TO GET THE FOX NEWS APP Reactions","summary":"Fox News Digital breaks down how a &quot;60 Minutes&quot; editing decision of a Kamala Harris interview wound up turning into a lofty lawsuit settlement with President Trump.","url":"https://www.foxnews.com/media/how-trump-sued-cbs-won-60-minutes-settlement-rocked-media-world-explained","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-60mins-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-12 21:00:20","author":"Kaylee Holland","authors":["Kaylee Holland"],"language":"en","source_country":"US","sentiment":-0.147},{"id":341021706,"title":"Trump says he is considering revoking Rosie O'Donnell's U.S. citizenship","text":"President Trump says he is considering \"taking away\" the U.S. citizenship of a longtime rival, actress and comedian Rosie O'Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government. \"Because of the fact that Rosie O'Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,\" Mr. Trump wrote in a social media post on Saturday. He added that O'Donnell, who moved to Ireland in January, should stay in Ireland \"if they want her.\" The two have criticized each other publicly for years, an often bitter back-and-forth that predates Mr. Trump's involvement in politics. In recent days, O'Donnell on social media denounced Mr. Trump and recent moves by his administration, including the signing of a massive GOP-backed tax breaks and spending cuts plan. Responding to Mr. Trump Saturday, O'Donnell wrote on social media that she had upset the president and to \"add me to the list of people who oppose him at every turn.\"O'Donnell wrote that Mr. Trump \"has always hated the fact that i see him for who he is - a criminal con man sexual abusing liar out to harm our nation to serve himself - this is why i moved to ireland.\"O'Donnell moved to Ireland after Mr. Trump defeated Vice President Kamala Harris to win his second term. She has said she's in the process of obtaining Irish citizenship based on family lineage.It's just the latest threat by Mr. Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk. But O'Donnell's situation is notably different from Musk, who was born in South Africa. O'Donnell was born in the U.S. and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps – but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.Since taking office again in January, Mr. Trump has sought to limit paths to citizenship and access to green cards. On Thursday, a federal judge issued a nationwide block against Mr. Trump's executive order ending birthright citizenship.Amanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the Fourteenth Amendment of the Constitution prevents the government from taking away citizenship. \"The president has no authority to take away the citizenship of a native-born U.S. citizen,\" Frost said in an email Saturday. \"In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.\"","summary":"The two have criticized each other publicly for years, an often bitter back-and-forth that predates President Trump's involvement in politics.","url":"https://www.cbsnews.com/news/trump-rosie-odonnell-u-s-citizenship-revoke-threat/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/07/12/d16edee7-a13f-4206-931d-4b11da43df1d/thumbnail/1200x630/028ba318f46c550fc1b5a0fdcafa225e/gettyimages-2185059791.jpg","video":null,"publish_date":"2025-07-12 21:00:09","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.027},{"id":341008456,"title":"Trump says he’s considering ‘taking away’ Rosie O’Donnell’s US citizenship","text":"WASHINGTON (AP) — President Donald Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actress and comedian Rosie O’Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government.\n\n“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Trump wrote in a social media post on Saturday. He added that O’Donnell, who moved to Ireland in January, should stay in Ireland “if they want her.”\n\nThe two have criticized each other publicly for years, an often bitter back-and-forth that predates Trump’s involvement in politics. In recent days, O’Donnell on social media denounced Trump and recent moves by his administration, including the signing of a massive GOP-backed tax breaks and spending cuts plan.\n\nIt’s just the latest threat by Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk.\n\nBut O’Donnell’s situation is notably different from Musk, who was born in South Africa. O’Donnell was born in the United States and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps – but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the Fourteen Amendment of the Constitution prevents the government from taking away citizenship.\n\n“The president has no authority to take away the citizenship of a native-born U.S. citizen,” Frost said in an email Saturday. “In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.”\n\nO’Donnell moved to Ireland after Trump defeated Vice President Kamala Harris to win his second term. She has said she’s in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Trump Saturday, O’Donnell wrote on social media that she had upset the president and “add me to the list of people who oppose him at every turn.”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actress and comedian Rosie O’Donnell, despite a decades-old Supreme...","url":"https://wsvn.com/entertainment/trump-says-hes-considering-taking-away-rosie-odonnells-us-citizenship/","image":"https://wsvn.com/wp-content/uploads/sites/2/2017/02/170207_rosie_o_donnell.jpg?quality=60&strip=color","video":null,"publish_date":"2025-07-12 20:23:28","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","category":"politics","source_country":"us","sentiment":-0.02},{"id":341151656,"title":"Trump says he's considering 'taking away' Rosie O'Donnell's U.S. citizenship","text":"President Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actor and comedian Rosie O’Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government. “Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Trump wrote in a social media post on Saturday. He added that O'Donnell, who moved to Ireland in January, should stay there “if they want her.” The two have criticized each other publicly for years, an often bitter back-and-forth that predates Trump’s involvement in politics. In recent days, O’Donnell on social media denounced Trump and recent moves by his administration, including the signing of a massive GOP-backed tax breaks and spending cuts plan. It's just the latest threat by Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former advisor and one-time ally, Elon Musk. But O'Donnell's situation is notably different from that of Musk, who was born in South Africa. O'Donnell was born in the United States and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps — but only if the act is performed voluntarily and with the intention of relinquishing U.S. citizenship. Amanda Frost, a professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the 14th Amendment of the Constitution prevents the government from taking away citizenship. “The president has no authority to take away the citizenship of a native-born U.S. citizen,\" Frost said Saturday. “We are a nation founded on the principle that the people choose the government; the government cannot choose the people.” O'Donnell moved to Ireland after Trump defeated Vice President Kamala Harris to win his second term. She has said she's in the process of obtaining Irish citizenship based on family lineage. Responding to Trump Saturday, O’Donnell wrote on social media that she had upset the president, and said “add me to the list of people who oppose him at every turn.”","summary":"President Trump says he is considering revoking actress and comedian Rosie O’Donnell’s U.S. citizenship","url":"https://www.latimes.com/world-nation/story/2025-07-12/trump-says-hes-considering-taking-away-rosie-odonnells-us-citizenship","image":"https://ca-times.brightspotcdn.com/dims4/default/50708f3/2147483647/strip/true/crop/2259x1186+0+168/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F12%2F5d%2F2daba6f2996a9c227c4ec58f3c5f%2F4f0b5f80f8024e1085ab","video":null,"publish_date":"2025-07-12 20:15:38","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.141},{"id":341076428,"title":"Kamala Harris Fuels Jill Biden Feud Rumors with Icy Social Media Snub—And It’s Too Hard to Ignore","text":"As per Nicki Swift, Harris shared a special Fourth of July snap of herself and husband Doug Emhoff watching fireworks. However, one arm in the frame hinted she had deliberately cropped out Joe and Jill Biden. Former Robert F. Kennedy Jr. campaign adviser Link Lauren shared the full version, captioning: “Kamala cropping Joe out is very symbolic.”\n\nOnline users were quick enough to weigh in with opinions as usual. However, this time those were not about Kamala’s relationship with Donald Trump or her husband Doug, but the deliberate attempt she made to crop out the former President and his wife. One X user quipped, “At least take his arm out of the shot when you crop it,” while another commented, “She’s erasing him like a girl angrily scribbling out her ex-best friend’s photo in the yearbook.”\n\nThis Fourth of July, I am taking a moment to reflect. Things are hard right now. They are probably going to get worse before they get better.\nBut I love our country — and when you love something, you fight for it. Together, we will continue to fight for the ideals of our nation. pic.twitter.com/pYxJVw0fiD\n— Kamala Harris (@KamalaHarris) July 4, 2025\n\nOthers claimed that the country missed seeing her in politics, and another commented, “Devastated that you aren’t leading our country. Almost hopeless”. A third user wrote, You see how Kamala didn’t say ‘Happy 4th of July!’ Or ‘Happy Independence Day!’ Very demure, very mindful, very understanding. She knows that there is nothing to celebrate on this unforeseen day. You get it. You understand. Thanks, auntie!”\n\nFor Harris, distancing herself from the Bidens may have been strategic—or a sign that the feud is far from behind them. However, Kamala Harris and Second Gentleman Doug Emhoff have reportedly experienced a significant rift with President Joe Biden after surrounding the 2024 U.S. presidential election.\n\nInitially, Biden had remained in the race but later withdrew, endorsing Harris as the Democratic nominee after a widely criticized debate performance. Kamala Harris went on to face a historic defeat against Donald Trump in the general election, which was highly publicized, and Trump resumed office for his second term in January 2020.\n\nAccording to The Wall Street Journal, the relationship between Biden and Harris has grown “frosty” following the loss. There is growing speculation that both President Biden and First Lady Jill Biden are disappointed in how Harris handled the campaign. In contrast, others argue Biden’s delayed withdrawal set the former VP up for failure.\n\nMeanwhile, Kamala has been quite off the radar since the defeat, and sources claim she might run for the Governor of California of the state in 2026. She also won an award at the 2025 NAACP Image Awards on February 22, 2025. In a stunning all black outfit, she received the prestigious Chairman’s Award for her longstanding commitment to public service and social justice. \n\nThis evening, I was honored to accept the NAACP’s Chairman’s Award.\nI grew up inspired by the work of the NAACP — by all those who took up the fight for justice, equality, and opportunity. Their example is part of the reason I chose a life of public service.\nAt this moment,… pic.twitter.com/lmRFCLUQTq\n— Kamala Harris (@KamalaHarris) February 23, 2025\n\nCritics say that Kamala’s recent picture cropping attempt may still be struggling to bring back her independence from Joe Biden’s legacy, and this subtle post just brought that underlying tension back into focus. While Kamala seems to be navigating her next political moves, we would tell her not to keep any bad blood in her heart for her opposition, especially for Joe Biden, who at 82 got diagnosed with an “aggressive” form of prostate cancer, which has spread to his bones. His office authorities who announced the news said, “The cancer appears to be hormone-sensitive, which allows for effective management.” ( via BU today).","summary":"Kamala Harris crops out the Bidens in a recent snap she posted to mark the 4th of July, sparking speculation over a strained relationship!","url":"https://www.inquisitr.com/kamala-harris-fuels-jill-biden-feud-rumors-with-icy-social-media-snub-and-its-too-hard-to-ignore","image":"https://www.inquisitr.com/wp-content/uploads/2025/07/Kamala-Harris-and-Joe-and-Jill-Biden-.jpg","video":null,"publish_date":"2025-07-12 20:04:15","author":"Sweta Choudhury","authors":["Sweta Choudhury"],"language":"en","category":"politics","source_country":"US","sentiment":-0.101},{"id":341007456,"title":"Trump says he’s considering ‘taking away’ Rosie O’Donnell’s US citizenship","text":"WASHINGTON (AP) — President Donald Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actress and comedian Rosie O’Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government. \n\n“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Trump wrote in a social media post on Saturday. He added that O’Donnell, who moved to Ireland in January, should stay in Ireland “if they want her.” \n\nThe two have criticized each other publicly for years, an often bitter back-and-forth that predates Trump’s involvement in politics. In recent days, O’Donnell on social media denounced Trump and recent moves by his administration, including the signing of a massive GOP-backed tax breaks and spending cuts plan. \n\nIt’s just the latest threat by Trump to revoke the citizenship of people with whom he has publicly disagreed, most recently his former adviser and one-time ally, Elon Musk. \n\nBut O’Donnell’s situation is notably different from Musk, who was born in South Africa. O’Donnell was born in the United States and has a constitutional right to U.S. citizenship. The U.S. State Department notes on its website that U.S. citizens by birth or naturalization may relinquish U.S. nationality by taking certain steps – but only if the act is performed voluntary and with the intention of relinquishing U.S. citizenship.\n\nAmanda Frost, a law professor at the University of Virginia School of Law, noted the Supreme Court ruled in a 1967 case that the Fourteen Amendment of the Constitution prevents the government from taking away citizenship. \n\n“The president has no authority to take away the citizenship of a native-born U.S. citizen,” Frost said in an email Saturday. “In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.”\n\n O’Donnell moved to Ireland after Trump defeated Vice President Kamala Harris to win his second term. She has said she’s in the process of obtaining Irish citizenship based on family lineage.\n\nResponding to Trump Saturday, O’Donnell wrote on social media that she had upset the president and “add me to the list of people who oppose him at every turn.”\n\nAssociated Press, The Associated Press","summary":"WASHINGTON (AP) — President Donald Trump says he is considering “taking away” the U.S. citizenship of a longtime rival, actress and comedian Rosie O’Donnell, despite a decades-old Supreme Court ruling that expressly prohibits such an action by the government. “Because of the fact that Rosie O’Donnell is not in the best interests of our Great [&#8230;]","url":"https://toronto.citynews.ca/2025/07/12/trump-says-hes-considering-taking-away-rosie-odonnells-us-citizenship/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/07/f8754d53ce60662535ae1184a31916c569bce4d9eaa1f3063a8fdf4ebfe820ec.jpg","video":null,"publish_date":"2025-07-12 19:45:33","author":"Evan Agostini,News Staff","authors":["Evan Agostini","News Staff"],"language":"en","category":"politics","source_country":"ca","sentiment":0.014},{"id":340990778,"title":"Tyler Perry’s Madea’s Destination Wedding: Full list of cast and characters","text":"Tyler Perry's 13th film in the Madea cinematic universe, titled Madea’s Destination Wedding, premiered on Netflix on July 11, 2025. The movie centers around Madea, who flies to the Bahamas to attend her grandniece Tiffany's spontaneous wedding to rapper Zavier. As the family reunites at the luxury resort, tensions arise, leading to complicated and comical situations. As secrets unfold and chaos erupts, Madea tries to keep the family together, all while following her usual dramatic traditions.Madea’s Destination Wedding brings back multiple cast members from the previous franchise, including Cassi Davis Patton, Tyler Perry, Tamela Mann, and David Mann. Other actors like Diamond White, Taja V. Simpson, and Xavier Smalls also make an appearance in the film.Main cast in Madea’s Destination Wedding and the characters they playTyler Perry as Madea, Joe Simmons, and Brian SimmonsBarack Obama Joins Kamala Harris As She Campaigns For President In Georgia - Source: GettyMadea is the straight-talking mother hen of the Simmons family. With her coarse humor and hard-nosed approach, she is the linchpin of the movie. Madea is the chief coordinator of the disastrous family vacation in the Bahamas for her grandniece Tiffany's wedding.Tyler Perry also plays the character of Brian, Tiffany's father, and Joe, Madea's older brother. Brian attempts to treat the circumstance logically and with restraint in his capacity as an accomplished attorney. Brian is initially resistant to the impromptu wedding, particularly upset about Zavier's past and motives. Joe accompanies the family to the Bahamas and brings his signature vulgar humor and inappropriate commentary to nearly every situation.Tyler Perry is an American actor, comedian, and producer best known for playing Mabel \"Madea\" Simmons. He made his first appearance as the character in the 1999 stage play I Can Do Bad All by Myself. Some of his other projects include Star Trek, Daddy's Little Girls, Good Deeds, and Temptation: Confessions of a Marriage Counselor. He is also the author of the New York Times bestseller Don't Make a Black Woman Take Off Her Earrings: Madea's Uninhibited Commentaries on Love and Life and Higher Is Waiting.Cassi Davis Patton as Aunt Bam95th Birthday Celebration For Dr. Christine King Farris - Source: GettyAunt Bam is Madea's feisty and quirky cousin in Madea’s Destination Wedding. Her presence injects high energy and comedic finesse into the family's island escapade. She also assists Madea in tracking down the real reasons behind the wedding.Cassi Davis Patton is an American actress who has gained fame for playing Aunt Bam in Tyler Perry's Madea franchise. She made her debut in Madea's Happy Family and has since remained a staple regular in Perry's theater productions as well as his films. She has also played Ella Payne in House of Payne and The Paynes.Also read: Tyler Perry’s Madea’s Destination Wedding ending explained: Did Tiffany say “I Do”?Tamela Mann as Cora SimmonsTamela Mann (Image via Instagram/@davidandtamela)Cora is Madea's daughter and tends to be the spiritual and emotional center within the family. Cora provides a realistic view in Destination Wedding, offering healing and advice as tensions build regarding Tiffany's choice. She facilitates conflicts and attempts to keep peace with the more fiery actors.Tamela Mann is an American gospel singer and actress who is most popularly known for her role as Cora Simmons in the Madea franchise. She started her career singing for Kirk Franklin and rose to fame after releasing a solo gospel song, \"Take Me to the King.\" She has acted in various Tyler Perry movies and television shows.David Mann as Mr. BrownDavid and Tamela Mann (Image via Instagram/@davidandtamela)Mr. Brown, Cora's father and Madea's ex-boyfriend, is a boisterous, flamboyant type who serves mostly as comic relief. Although he doesn't propel the primary plot, his character adds comedic richness to Madea’s Destination Wedding's tone and dynamic to the family as a familiar, well-loved Madea franchise character.David Mann is an American comedian and actor, most notably recognized for his character role as Mr. Brown in Tyler Perry's plays and movies, such as Meet the Browns and Madea Goes to Jail. Famous for his sense of comic timing and flamboyant demeanor, he often acts together with his wife, Tamela Mann, in film and music.Supporting cast and characters of Madea’s Destination Wedding View this post on Instagram Instagram PostHere are the rest of the actors in Madea’s Destination Wedding, along with the characters they are going to portray.Tyler Perry as Madea / Joe / BrianCassi Davis as Aunt BamDavid Mann as Mr. BrownTamela J. Mann as CoraTaja V. Simpson as DebrahDiamond White as TiffanyJermaine Harris as BJXavier Smalls as ZavierWalnette Carrington as KajaBrandon Sutton as DennisBree Shannon as Passport WorkerMelanie Kiran as Passport WorkerRocky Myers as FredJonico Pratt as Front Desk AgentNicole Musgrove as Front Desk AgentInes Sanchez-Nagakane as Flight AttendantIsaac Hughes as ThugJohn Pratt as ThugOral Noel Brown II as Reverend HartmanPaul Trunz as Federal MarshallGregory L. Wilson II as Handsome Cart DriverMarilyn Delancey as Casino DealerXaviera Gibson as Table Games SupervisorRead more: Tyler Perry's Madea's Destination Wedding soundtrack: Complete list of every song in the movie.Madea’s Destination Wedding is available to watch on Netflix.","summary":"Tyler Perry's 13th film in the Madea cinematic universe, titled Madea’s Destination Wedding, premiered on Netflix on July 11, 2025.","url":"https://www.sportskeeda.com/us/movies/tyler-perry-s-madea-s-destination-wedding-full-list-cast-characters","image":"https://staticg.sportskeeda.com/editor/2025/07/5246f-17523439986784-1920.jpg","video":null,"publish_date":"2025-07-12 18:54:29","author":"Abhisri Kodandaraman","authors":["Abhisri Kodandaraman"],"language":"en","source_country":"in","sentiment":0.942},{"id":340985292,"title":"Jake Paul references Kamala Harris in fiery response to reporter questioning female 'sexualization' in boxing","text":"An historic night at Madison Square Garden on Friday night turned into an awkward moment in the wee hours of Saturday morning at the Taylor-Serrano 3 post-fight press conference. A reporter based out of Puerto Rico asked a question that \"has to do with the projection of women in boxing.\" The reporter insinuated that there was an \"issue\" with ring girls and the \"sexualization of women\" in an all-female card. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Most Valuable Promotions co-founder Nakisa Bidarian asked, maybe not so tongue-in-cheek, \"Do you want ring boys?\" \"A couple of people have said, ‘Why not have boys or any of them?'\" the reporter replied. Jake Paul, who seemed dejected throughout the entire press conference (understandably so, given Amanda Serrano's loss), had enough. \"Bro, bro. Please shut the … stop. Just stop talking,\" he said. Bidarian then butted back in, saying \"if anybody wants to send an application to be a ring boy at MVP, send it to that young man.\" Paul then replied, \"Send it to f---ing Kamala Harris.\" MVP set a Guinness World Record for the most titles on the line in a single boxing card with 21. KATIE TAYLOR SAYS COMPLETING TRILOGY SWEEP OVER AMANDA SERRANO WAS 'VERY SATISFYING' AFTER CLOSE FIRST FIGHTS Taylor defeated Amanda Serrano for the third time in as many fights between the two living legends on Friday night at Madison Square Garden via majority decision. Taylor retained her WBA, WBO, WBC, and IBF super lightweight championship belts. This was the trilogy bout between two of the greatest female boxers to step into the ring. Taylor won the first bout back on April 30, 2022, which also took place at the world’s most famous arena, in a split decision. The two squared off again on Nov. 15 of last year as the co-main event to Jake Paul vs. Mike Tyson, and Taylor won in a controversial unanimous decision. One judge scored the fight a tie, but the two others gave it to Taylor, and she released an emphatic yell when the results were read. CLICK HERE TO GET THE FOX NEWS APP Taylor improved to 25-1 in her illustrious career, while Serrano is now 47-4-1, with three of those losses to Taylor. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"After a reporter asked about the &quot;sexualization of women&quot; in boxing, Jake Paul said ring boy applications should be sent to Kamala Harris.","url":"https://www.foxnews.com/sports/jake-paul-references-kamala-harris-fiery-response-reporter-questioning-female-sexualization-boxing","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/mvp-girls.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-12 17:54:59","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","category":"politics","source_country":"us","sentiment":0.025},{"id":340980632,"title":"Opinion: South Carolina visit shows Newsom is focused on the White House","text":"This column was originally published by CalMatters. Sign up for their newsletters.\n\nIf anyone still harbors doubts that Gavin Newsom is contemplating a run for the White House in 2028, this week’s sojourn into South Carolina for some schmoozing with local politicians and photo ops with common folk should dispel them.\n\nAlthough South Carolina is a strongly Republican state, in 2024 the Democratic Party, at the behest of then-President Joe Biden, designated it as the first state to have a presidential primary. It could play that role again in 2028.\n\nThus, Democratic politicians who see themselves as potential candidates are — to no one’s surprise — finding reasons to visit the state. Newsom’s rationale is that he wants to know how cuts in federal health care programs are affecting South Carolinians.\n\nEver since winning a second and final term as governor three years ago, Newsom has obviously been building a national profile, all the while insisting that he had no presidential ambitions.\n\nHowever, after spending half of his 57 years climbing the political ladder one rung at a time, it seemed unlikely that he would simply retire from politics after his governorship ended and return to running his wine and hospitality business.\n\nLast month, Newsom acknowledged the possibility of a 2028 run in an interview with the Wall Street Journal, saying “I’m not thinking about running, but it’s a path that I could see unfold.” This week’s visit to South Carolina proves that he’s headed down that path.\n\nCould Newsom pull it off?\n\nWhen Kamala Harris lost to Donald Trump last year, it opened the door for all Democratic hopefuls. The party is undergoing a post-election upheaval after losing not only the presidency but control of both houses of Congress.\n\nThere’s a sense that the nation’s voters are not buying what the party has been selling, but there’s no consensus on how it should change to win back disaffected voter blocs, nor is there a commanding figure to lead its transformation.\n\nNewsom has been a vocal critic of the party’s failure to connect with blue-collar voters, particularly young men, but has yet to articulate an alternative approach. He’s also been slowly edging away from his previous image as a California progressive — much to the dismay of environmentalists, gay and transgender rights advocates and other left-leaning groups.\n\nThe lack of an obvious leader in what could be a crowded field of Democratic hopefuls creates an opening for Newsom to offer himself as someone who could put together a coalition of voter blocs capable of defeating the 2028 Republican candidate — most likely, at this early stage, Vice President JD Vance.\n\nEarly polling does place Newsom among the upper tier of potential Democratic candidates, although with barely double-digit support. Nevertheless, Newsom’s path to the White House — or at least to the Democratic nomination — is also filled with potholes, beginning with the inescapable fact that he’s from California.\n\nThe state’s image these days is a far cry from the land of sunshine and opportunity that it once enjoyed. Its chronic housing shortage, its squalid encampments of homeless people in the state’s major cities and its self-designation as a sanctuary for undocumented immigrants are potent campaign fodder for Newsom’s rivals — and his Republican opponent, should he win the nomination.\n\nTo many, Newsom also comes across as slick and glib rather than sincere, someone who bends reality to portray California and himself as leaders to be emulated. If Newsom is to become acceptable to South Carolinians and other voters across the nation, he will have to persuade them that his eight years as governor of California has earned him a promotion to the top rung on the ladder.\n\nThat won’t be easy.\n\nCalMatters is a nonpartisan and nonprofit news organization bringing Californians stories that probe, explain and explore solutions to quality of life issues while holding our leaders accountable.\n\nWant to submit a letter to the editor, guest column or opinion piece? Find our guidelines and submission form here.","summary":"Ever since winning a second and final term as governor three years ago, Gavin Newsom has obviously been building a national profile.","url":"https://timesofsandiego.com/opinion/2025/07/12/south-carolina-visit-shows-newsom-focused-white-house/","image":"https://i0.wp.com/timesofsandiego.com/wp-content/uploads/2025/07/Newsom-South-Carolina.jpg?fit=820%2C527&ssl=1","video":null,"publish_date":"2025-07-12 17:00:00","author":"Dan Walters • CalMatters Columnist","authors":["Dan Walters • CalMatters Columnist"],"language":"en","source_country":"us","sentiment":-0.239},{"id":340969704,"title":"Trump floats stripping Rosie O’Donnell of US citizenship: ‘She is a Threat to Humanity’","text":"President Trump raged Saturday that he’s giving “serious consideration” to taking away comedian Rosie O’Donnell’s US citizenship, arguing his longtime nemesis is a “Threat to Humanity.” \n\n“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Trump wrote on Truth Social. \n\nO’Donnell, 63, moved overseas, to the Dublin suburb of Howth, in Ireland, with her 12-year-old child in January in response to Trump’s victory against Kamala Harris in the 2024 presidential election. \n\nIn March, O’Donnell revealed she and her child, who is non-binary and autistic, were in the process of obtaining Irish citizenship following their trans-Atlantic move. \n\nIt’s unclear what legal basis Trump could use to strip O’Donnell, who was born on Long Island, of her American citizenship. \n\nAmericans cannot lose their US citizenship status even if they obtain citizenship elsewhere. \n\n“She is a Threat to Humanity, and should remain in the wonderful Country of Ireland, if they want her,” Trump’s post continued. “GOD BLESS AMERICA!” \n\nThe feud between O’Donnell and Trump dates back nearly two decades, to when the “A League of Their Own” actress ridiculed “The Apprentice” star on “The View” in 2006. \n\nAt the time, O’Donnell chastised Trump for acting like a “moral authority” when controversy broke out over the winner of that year’s Miss USA pageant. \n\nTrump immediately hit back, describing the lefty comedian as “disgusting both inside and out.” \n\n“You take a look at her, she’s a slob. She talks like a truck driver,” Trump told “The Insider” in 2006. \n\nIn August 2015, during the Republican primary debate, then-Fox host Megyn Kelly asked Trump about his use of language like “fat pigs,” “dogs,” “slobs” and “disgusting animals” to describe women.\n\n“Only Rosie O’Donnell,” he retorted.\n\nIn April, O’Donnell accused Trump of paying “no mind to any of the laws that the founders stood by and that our country stands for and that is a beacon of shining light and freedom for the rest of the world,” in an interview with CNN explaining her decision to leave the US. \n\n“It’s bad as they promised and even a little bit worse and it’s been heartbreaking and personally very very sad to watch,” she said of Trump’s second stint in the White House. \n\nO’Donnell told NewsNation host Chris Cuomo in June that she believes she can be a better mother in Ireland than in the US under Trump. \n\n“Coming to Ireland was totally a way to take care of myself and my non-binary autistic child, who’s going to need services and help and counseling and all the things that he’s [Trump is] threatening to cut in his horrible plan of the big, beautiful bill,” she said on the “Chris Cuomo Project” podcast. \n\nO’Donnell found coping with Trump’s first term while living in the states “very difficult,” she said.\n\n“I was very, very depressed. I was overeating. I was overdrinking,” she told Cuomo.","summary":"“Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship,” Trump wrote on Truth Social Saturday.","url":"https://nypost.com/2025/07/12/us-news/trump-threatens-to-strip-rosie-odonnells-us-citizenship/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/president-donald-trump-leaving-white-108051948.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/YxAHNytr-RyIcpnTz.mp4","publish_date":"2025-07-12 16:36:44","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.073},{"id":341080960,"title":"Donald Trump Threatens To Revoke Rosie O’Donnell’s Citizenship; She Calls Him “A Danger To The Nation” In Response — Update","text":"Donald Trump posted on Saturday that he is giving “serious consideration” to revoking Rosie O’Donnell’s citizenship.\n\nThe president posted on Truth Social, “Because of the fact that Rosie O’Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship. She is a Threat to Humanity, and should remain in the wonderful Country of Ireland, if they want her. GOD BLESS AMERICA!”\n\nMore from Deadline\n\nThe president cannot revoke the citizenship of someone born in the U.S., something that legal scholars have long noted. The 14th Amendment to the Constitution says, “All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States.”\n\nO’Donnell, who was born in New York, is a longtime Trump nemesis. She moved her family to Ireland earlier this year, saying in a TikTok video that “when it is safe for all citizens to have equal rights there in America, that’s when we will consider coming back.”\n\nO’Donnell has continued to be critical of Trump on TikTok and other social media, posting earlier this week that Trump “has put this country in danger” with his “horrible decisions.” She said that the cuts to the National Weather Service were linked to the deaths in the flash floods in Texas. “These are the results that we are going to see on a daily basis,” she said.\n\nAfter Trump’s Truth Social post, O’Donnell wrote on TikTok, “the potus ladies n gentlemen is a disgrace to all our beautiful country stands for – he is a danger to the nation – a mentally ill untreated criminal who lied to america for a decade on the apprentice – thanks mark burnett – and u fell for it – its so tragic – had u grown up in Ny – as i did and he did – u too would know what a total fool he is – add me to the list of people who oppose him at every turn – its now or never america 🇺🇸 – my little posts from dublin upset him – go arrest a few brown people u truly evil man child.”\n\nTrump has sought to end the practice of “birthright” citizenship via executive order. That has been challenged in the courts, and this past week a judge blocked Trump’s effort.\n\nDespite signing an executive order earlier this year to ensure that the federal government would not engage in “any conduct that would unconstitutionally abridge the free speech of any American citizen,” Trump has sought to sanction dissenting voices. Among other things, he recently threatened to prosecute CNN for reporting on an app that tracks sightings of ICE agents, and earlier this year barred AP reporters and photographers from the Oval Office and other White House venues because their Stylebook did not recognize the president’s change of the name of the Gulf of Mexico to the Gulf of America.\n\nIn May, Trump called for a “major investigation” of Bruce Springsteen, alleging that Kamala Harris paid for his endorsement during her 2024 campaign. Her campaign has denied that claim. Springsteen has been critical of Trump while on a European tour, calling the president’s administration “corrupt, incompetent and treasonous.”\n\nBest of Deadline\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.","url":"https://www.yahoo.com/news/donald-trump-threatens-revoke-rosie-140344760.html","image":"https://s.yimg.com/ny/api/res/1.2/9bDubZOgQkSxCgYJMZ9ezA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjg7Y2Y9d2VicA--/https://media.zenfs.com/en/deadline.com/693d48f6deb906e8da1b368e7ef7f6a8","video":null,"publish_date":"2025-07-12 14:03:44","author":"Ted Johnson","authors":["Ted Johnson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.082},{"id":340944766,"title":"How Do You Solve a Problem Like Mamdani? Democrats Don’t Have an Answer","text":"The meteoric rise of New York City Democrat mayoral nominee Zohran Mamdani poses a major question for Washington Democrats—is his brand of Palestinian activism, economic interventionism, and pro-LGBTQ+ rhetoric the future of their party?\n\nThe 33-year-old state assemblyman’s trouncing of former New York Gov. Andrew Cuomo in the city’s party primary has brought to light a host of controversial positions: supporting taxpayer-funded transgender surgeries on his campaign website, proposing government-run grocery stores, and refusing to condemn the phrase “globalize the intifada,” among other things.\n\nAsked how he views a candidate who does not condemn phrases which many consider genocidal, Ken Martin, the chair of the Democratic National Committee, chose a live-and-let-live approach.\n\n“There’s no candidate in this party that I agree 100% of the time with,” he replied. \n\n“To be honest with you, there’s things that I don’t agree with Mamdani that he said. But at the end of the day, I always believe … that you win through addition, you win by bringing people into your coalition. We have conservative Democrats, we have centrist Democrats, we have labor progressives like me, and we have this new Democrat, which is the leftist.”\n\nBut what works in New York City might not work in the swing districts and swing states that decide who has power in Washington.\n\nBut Sen. John Fetterman, D-Pa., who has consistently supported Israel, said of Mamdani, “Everything that I’ve read on him, I don’t really agree with virtually any of it politically. So that’s just where I’m at as a Democrat. I mean, he’s not even a Democrat, honestly.”\n\nFetterman, much like swing-state Democrat Sens. Ruben Gallego of Arizona and Elissa Slotkin of Michigan, has generally chosen moderated rhetoric over doubling down on progressive rhetoric since Republican President Donald Trump’s victory in November.\n\nSlotkin, asked shortly after Mamdani’s mayoral primary victory how she interpreted the development, chose to focus on Mamdani’s cost-of-living proposals, while shying away from commenting on his more controversial platform planks.\n\n“People, just like in November, are still really focused on costs and the economy, and their own kitchen table math, and they’re looking for a new generation of leadership,” Slotkin said, adding, “It reinforces that you may disagree on some key issues, but understanding that people are concerned about their family budget, that is a unifying thing for a coalition.”\n\nSlotkin, who narrowly won her Michigan Senate seat in November by just over 19,000 votes out of more than 5.57 million cast, or 48.6% to 48.3%, emphasized economic issues throughout her campaign and warned as early as September 2024 that the Democrats’ presidential candidate, then-Vice President Kamala Harris, was “underwater in our polling.”\n\nFor now at least, Democrats in Washington appear to not know what to do with Mamdani.\n\nHouse Minority Leader Hakeem Jeffries, D-N.Y., has still not endorsed Mamdani, despite his primary win. When asked, he consistently chooses to mention Mamdani’s proposals to address the high cost of living in New York City. \n\nJeffries has applied a bit of pushback against Mamdani’s rhetoric on the Israel-Hamas war, though, particularly his repeated refusals to condemn “globalize the intifada.”\n\n“‘Globalizing the intifada,’ by the way of example, is not an acceptable phrase, and he’s going to have to clarify his position on that,” Jeffries said after Mamdani’s victory. \n\n“With respect to the Jewish communities that I represent, I think our nominee is going to have to convince folks that he is prepared to aggressively address the rise in antisemitism in the city of New York.”\n\nIt remains to be seen how Mamdani’s rise as a national face of the Democratic Party will affect Democrats’ chances outside of their dark-blue urban centers of support.\n\nDemocrats are seeking Senate seat pickups in 2026, for example, in states such as Maine and North Carolina—far removed from New York.\n\nVice President JD Vance has accused Mamdani of creating a coalition of “downwardly mobile, college-educated people” and carved-out ethnic blocs by pandering to shared hatreds.\n\n“That’s an interesting coalition. Maybe it works in the New York Democratic primary. I don’t think it works in the United States at large,” the vice president said in a July 5 speech in San Diego.\n\nRural America and moderate voters appear to be the target for Democrats going into the midterms.\n\nThe Democratic Congressional Campaign Committee is now running ads against GOP incumbents such as Rep. Derrick Van Orden of Wisconsin and Rob Bresnahan of Pennsylvania, accusing them of attacking rural hospitals with the recently passed Republican budget reconciliation bill’s restructuring of Medicaid.\n\nSen. Jon Ossoff, D-Ga., is also trying to appeal to moderate voters ahead of a difficult 2026 reelection campaign. \n\nAs Trump’s “Big, Beautiful Bill” was considered, he joined just three other Democrat senators to vote for an amendment to the bill that would have discouraged states from issuing Medicaid payments to illegal immigrants. \n\nThat’s a far cry from Mamdani who has openly called for “standing up for our sanctuary city policies” in New York City.","summary":"The meteoric rise of New York City Democrat mayoral nominee Zohran Mamdani poses a major question for Washington Democrats—is his brand of Palestinian activism, economic... Read More\n\n\nThe post How Do You Solve a Problem Like Mamdani? Democrats Don’t Have an Answer appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/12/democrats-dont-know-what-do-mamdani/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/Zohran-Mamdani.jpg","video":null,"publish_date":"2025-07-12 14:00:00","author":"George Caldwell","authors":["George Caldwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.068},{"id":341004814,"title":"Melania Trump wears charm bracelet in honor of Texas flooding victims: 'We are grieving' - USA Today","text":"Melania Trump wore a charm bracelet gifted by a family in the wake of the Texas floods.\n\nOn July 11, the first lady toured devastation across Texas Hill Country alongside President Donald Trump and shared how she received the accessory, which she wore on her left wrist, during a roundtable meeting with local officials.\n\n\"We just met with the wonderful families. We prayed with them. We hugged. We held hands,\" the first lady said. \"They shared their stories, and I met beautiful young ladies who gave me this special bracelet from the camp in honor of all the little girls who lost their lives. We are here to honor them and also to give support and help.\"\n\n\"I will be back I promised them. I pray for them and am giving them my strength and love,\" she added.\n\nIn a statement shared with press, Trump's official office confirmed that she was gifted a charm bracelet by the Hotze Family – to honor victims of flooding at Camp Mystic, a nearly 100-year-old nondenominational all-girls summer camp that sits on 700 acres.\n\nThe flooding has claimed the lives of more than 120 people since heavy rainfall overwhelmed the Guadalupe River and flowed through homes and summer camps in the early morning hours of July 4. \n\nThe president and first lady arrived at Lackland Air Force Base in San Antonio, Texas, before traveling to Kerrville, Texas, to survey the damage of catastrophic flooding that tore across the Texas Hill Country, as authorities and volunteers searched for the missing, and local residents mourned the dead.\n\nEarlier in the day, Trump was pictured embracing her husband while departing the White House in a khaki-colored jacket and monochromatic army green look paired with animal print sunglasses and Converse Chuck Taylor kicks, also a fashion favorite of former Vice President Kamala Harris.\n\nFor the arrival, Trump tucked her free-flowing waves from earlier under a black baseball cap. In recent months, Trump has made selective public appearances that reflect her private, low-key nature.\n\nHowever, in major moments, she has appeared alongside the president at a slew of engagements including his second Inauguration festivities, Fourth of July events, the White House Easter egg roll and the administration's multimillion-dollar festival and parade celebrating the 250th anniversary of the U.S. Army.\n\nContributing: Bart Jansen, Joey Garrison","summary":"Melania Trump wears charm bracelet in honor of Texas flooding victims: 'We are grieving'  USA Today","url":"https://www.usatoday.com/story/entertainment/celebrities/2025/07/12/melania-trump-bracelet-texas-flood-victims/84682195007/","image":"https://www.usatoday.com/gcdn/authoring/authoring-images/2025/07/12/USAT/84776783007-20250711-t-211418-z-2141931065-rc-2-ikfauw-43-s-rtrmadp-3-usaweathertexastrump.JPG?crop=2810,1581,x0,y0&width=1600&height=800&format=pjpg&auto=webp","video":null,"publish_date":"2025-07-12 13:30:48","author":"Jay Stahl","authors":["Jay Stahl"],"language":"en","category":"politics","source_country":"us","sentiment":0.509},{"id":340928382,"title":"Trump supporters' stunning verdict on Pam Bondi's future over handling of Epstein files bombshell","text":"Even amid the brewing MAGA fury over the Justice Department's handling of the Jeffrey Epstein matter, an overwhelming majority of people who backed Donald Trump in last year's election are standing by Attorney General Pam Bondi. \n\nBondi and other top DOJ officials have been under fire ever since the release of a department memo stating that there was 'no incriminating 'client list' of the late convicted sex offender, and the release of prison security footage bolstering the case that he 'died by suicide.'\n\nAmong those calling for her to go are close Trump advisor and prominent MAGA conspiracy theorist Laura Loomer. Conservative podcaster Tucker Carlson accused Bondi of 'covering up crimes.'\n\nBut a survey of more than 1,000 registered voters conducted by J.L. Partners for the Daily Mail reveals that Trump voters are sticking by Bondi for the most part. \n\nTwenty-one percent of Trump 2024 supporters think Bondi should resign, compared to 43 percent who are against it.\n\nThat compares to a 54 percent majority of Democrats and – concerningly for Republicans – a 35 percent plurality of Independents.\n\nAmong Kamala Harris supporters from last year, 59 percent think she should resign, compared to 11 percent who don't. \n\nThe poll results came as FBI Director Dan Bongino stayed home from work Friday and was reportedly considering quitting amid the fury over the Epstein matter.\n\nAn insider at the DOJ even told the Daily Mail that Bongino will quit if Bondi doesn't step down or get fired. 'I don't see a scenario where Dan stays if Bondi remains,' the insider said. White House Press Secretary Karoline Leavitt told the Daily Mail on Tuesday that Trump is 'proud' of Bondi.\n\nOne source close to Bongino told Axios, 'he ain't coming back.' \n\nThe sensitivity of the issue was on display this week when Trump suddenly erupted at a reporter who asked him about the case. \n\n'Are you still talking about Jeffrey Epstein?' Trump vented during his cabinet meeting. 'This guy's been talked about for years.' \n\nBondi herself went into damage control after the DOJ released the surveillance video on Monday in an attempt to quell rampant speculation that the billionaire pedophile was killed in prison. \n\nSkeptics had homed in on a missing one-minute segment of the video.\n\nBondi explained that it was part of a daily reset that takes place at the Metropolitan Detention Center.\n\n'The video was not conclusive, but the evidence prior to it was showing he committed suicide,' Bondi said.\n\n'There was a minute that was off the counter, and what we learned from the Bureau of Prisons is every night they redo that video... every night should have the same minute missing,' he said.\n\nThat hasn't stopped calls for her ouster.\n\nIt was Bondi herself who had raised expectations during a FBI 21 interview on Fox News when host John Roberts asked her if DOJ would release a 'list of Jeffrey Epstein's clients.'\n\n'It's sitting on my desk right now to review. That's been a directive by President Trump. I'm reviewing that,' Bondi, the former Florida AG and longtime Trump loyalist answered.\n\nThat hasn't stopped Loomer from continuing to post about the hubbub. She wrote Friday that FBI Director Kash Patel and Assistant Director Dan Bongino 'are livid' with Bondi over her memo. \n\n'Pam Blondi has brought total embarrassment to President Trump' and others, she wrote. She said she had 'lied' to the nation and that 'I'm told Kash and Bongino are furious with Blondi and the blowback she has caused them with her lack of transparency,' using a deliberate nickname.\n\nOverall, 37 percent say Bondi should resign, compared to 26 percent against and 37 percent who are unsure.","summary":"Donald Trump's Attorney General has faced an onslaught of criticism, months after she appeared to say she had the pedophile financier's 'client list' on her desk.","url":"https://www.dailymail.co.uk/news/article-14898073/trump-supporters-pam-bondi-epstein-files-client-list.html","image":"https://i.dailymail.co.uk/1s/2025/07/11/23/100237899-0-image-m-23_1752271199291.jpg","video":null,"publish_date":"2025-07-12 13:17:06","author":"Editor,Geoff Earle","authors":["Editor","Geoff Earle"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.249},{"id":340926292,"title":"World News | Year After Trump's Near-assassination, Friends and Allies See Some Signs of Changed Man","text":"Washington, Jul 12 (AP) President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance. “Did I hear what I think I heard?” Trump remarked as he spoke from behind a wall of thick, bulletproof glass. “Don't worry, it's only fireworks. I hope. Famous last words,\" he quipped, drawing laughs and cheers. Also Read | India To Begin Rare Earth Magnet Production in Hyderabad To Counter China's Supply Curbs: Union Minister of Coal and Mines G Kishan Reddy. “You always have to think positive,\" he went on. \"I didn't like that sound, either.\" The comments, just days before the first anniversary of Trump's near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump's ear and killing one of his supporters in the crowd. Also Read | 'We All Deserve Better': US State Department Lays Off Over 1,300 Employees Under Donald Trump Administration Plan. The attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Trump's triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden's decision to abandon his reelection bid and the elevation of Vice President Kamala Harris as his successor. One year after coming millimeters from a very different outcome, Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term. “I think it's always in the back of his mind,\" said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. “He's still a rough and tumble guy, you know. He hasn't become a Zen Buddhist. But I think he is, I'll say this, more appreciative. He's more attentive to his friends,\" he said, pointing to Trump sending him a message on his birthday earlier this week. Graham added: \"It's just a miracle he's not dead. He definitely was a man who believed he had a second lease on life.\" Constant reminders While many who survive traumatic events try to block them from memory, Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He's decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, “Fight, fight, fight!\" A painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president's residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk. And while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his “all-time favourite chart in history” of southern border crossings that he credits for saving his life. During a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting. “I get that throbbing feeling every once in a while,\" he said, gesturing to his ear. “But you know what, that's OK. This is a dangerous business. What I do is a dangerous business.” Trump will spend Sunday's anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey. Crediting divine intervention Trump's chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason. “I would say I think he believes that he was saved. I do. And he would never — even if he thought it before, I don't think he would have admitted it. And he will now,\" she told “Pod Force One.” She, too credited divine intervention. The chart, she noted, “was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn't happen because it happened. It happened because, I believe, God wanted him to live.” As a result, she said, when Trump says things that “are perfunctory — every president says God bless America' — well, it's more profound with him now, and it's more personal.\" She also credited the attack with helping change public perceptions of Trump during the campaign. “For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that's helpful,\" she said. “You know, I have an obligation to do a good job, I feel, because I was really saved,” Trump told Fox News Friday. “I owe a lot. And I think — I hope — the reason I was saved was to save our country.” Roger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when US Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing. Stone said he's found the president “to be more serene and more determined after the attempt on his life” in Butler. “He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,” he said. Ralph Reed, chairman of the Faith and Freedom Coalition, agreed. “I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don't turn your head at that instant,\" he said. “He knew he was lucky to be alive.” Given how close Trump came to a very different outcome, Reed said, “it's hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I've talked to who said they were confident that he would win for that reason. That there must have been a reason.” (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance.","url":"https://www.latestly.com/agency-news/world-news-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-changed-man-6991496.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-12 13:06:09","author":null,"language":"en","source_country":"in","sentiment":0.138},{"id":341015642,"title":"A year after Trump's near-assassination, friends and allies see some signs of a changed man","text":"WASHINGTON (AP) — President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country’s 250th anniversary celebration, when he heard what sounded like fireworks in the distance.\n\n“Did I hear what I think I heard?” Trump remarked as he spoke from behind a wall of thick, bulletproof glass. “Don’t worry, it’s only fireworks. I hope. Famous last words,” he quipped, drawing laughs and cheers.\n\n“You always have to think positive,” he went on. “I didn’t like that sound, either.”\n\nThe comments, just days before the first anniversary of Trump’s near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump’s ear and killing one of his supporters in the crowd.\n\nThe attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Trump’s triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden’s decision to abandon his reelection bid and the elevation of Vice President Kamala Harris as his successor.\n\nOne year after coming millimeters from a very different outcome, Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term.\n\n“I think it’s always in the back of his mind,” said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. “He’s still a rough and tumble guy, you know. He hasn’t become a Zen Buddhist. But I think he is, I’ll say this, more appreciative. He’s more attentive to his friends,” he said, pointing to Trump sending him a message on his birthday earlier this week.\n\nGraham added: “It’s just a miracle he’s not dead. He definitely was a man who believed he had a second lease on life.”\n\nConstant reminders\n\nWhile many who survive traumatic events try to block them from memory, Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He’s decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, “Fight, fight, fight!”\n\nA painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president’s residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk.\n\nAnd while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his “all-time favorite chart in history” of southern border crossings that he credits for saving his life.\n\nDuring a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting.\n\n“I get that throbbing feeling every once in a while,” he said, gesturing to his ear. “But you know what, that’s OK. This is a dangerous business. What I do is a dangerous business.”\n\nTrump will spend Sunday’s anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey.\n\nCrediting divine intervention\n\nTrump’s chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason.\n\n“I would say I think he believes that he was saved. I do. And he would never — even if he thought it before, I don’t think he would have admitted it. And he will now,” she told “Pod Force One.”\n\nShe, too credited divine intervention. The chart, she noted, “was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn’t happen because it happened. It happened because, I believe, God wanted him to live.”\n\nAs a result, she said, when Trump says things that “are perfunctory — every president says ‘God bless America’ — well, it’s more profound with him now, and it’s more personal.”\n\nShe also credited the attack with helping change public perceptions of Trump during the campaign.\n\n“For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that’s helpful,” she said.\n\n“You know, I have an obligation to do a good job, I feel, because I was really saved,” Trump told Fox News Friday. “I owe a lot. And I think — I hope — the reason I was saved was to save our country.”\n\nRoger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when U.S. Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing.\n\nStone said he’s found the president “to be more serene and more determined after the attempt on his life” in Butler.\n\n“He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,” he said.\n\nRalph Reed, chairman of the Faith and Freedom Coalition, agreed.\n\n“I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don’t turn your head at that instant,” he said. “He knew he was lucky to be alive.”\n\nGiven how close Trump came to a very different outcome, Reed said, “it’s hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I’ve talked to who said they were confident that he would win for that reason. That there must have been a reason.”\n\nAssociated Press writer Nicole Winfield contributed to this report from Rome.","summary":"WASHINGTON (AP) — President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance.","url":"https://www.thestar.com/news/world/united-states/a-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-a-changed/article_a07f50fe-9f6a-5156-aa08-bb1390260311.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/8/51/851892a0-001c-5a10-89a4-308a06cc146d/68725cccef914.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-07-12 13:00:04","author":"Jill Colvin The Associated Press","authors":["Jill Colvin The Associated Press"],"language":"en","source_country":"ca","sentiment":0.104},{"id":341075992,"title":"A year after Trump’s near-assassination, friends and allies see some signs of a changed man","text":"By JILL COLVIN\n\nWASHINGTON (AP) — President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country’s 250th anniversary celebration, when he heard what sounded like fireworks in the distance. \n\n“Did I hear what I think I heard?” Trump remarked as he spoke from behind a wall of thick, bulletproof glass. “Don’t worry, it’s only fireworks. I hope. Famous last words,” he quipped, drawing laughs and cheers.\n\n“You always have to think positive,” he went on. “I didn’t like that sound, either.”\n\nThe comments, just days before the first anniversary of Trump’s near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump’s ear and killing one of his supporters in the crowd.\n\nThe attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Trump’s triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden’s decision to abandon his reelection bid and the elevation of Vice President Kamala Harris as his successor.\n\nOne year after coming millimeters from a very different outcome, Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term, making him even more dug in on achieving his far-reaching agenda.\n\n“I think it’s always in the back of his mind,” said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. “He’s still a rough and tumble guy, you know. He hasn’t become a Zen Buddhist. But I think he is, I’ll say this, more appreciative. He’s more attentive to his friends,” he said, pointing to Trump sending him a message on his birthday earlier this week.\n\nGraham added: “It’s just a miracle he’s not dead. He definitely was a man who believed he had a second lease on life.”\n\nConstant reminders\n\nWhile many who survive traumatic events try to block them from memory, Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He’s decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, “Fight, fight, fight!” \n\nA painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president’s residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk. \n\nAnd while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his “all-time favorite chart in history” of southern border crossings that he credits for saving his life. \n\nDuring a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting.\n\n“I get that throbbing feeling every once in a while,” he said, gesturing to his ear. “But you know what, that’s OK. This is a dangerous business. What I do is a dangerous business.”\n\nTrump will spend Sunday’s anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey.\n\nCrediting divine intervention\n\nTrump’s chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason.\n\n“I would say I think he believes that he was saved. I do. And he would never — even if he thought it before, I don’t think he would have admitted it. And he will now,” she told “Pod Force One.” \n\nShe, too credited divine intervention. The chart, she noted, “was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn’t happen because it happened. It happened because, I believe, God wanted him to live.”\n\nAs a result, she said, when Trump says things that “are perfunctory — every president says ‘God bless America’ — well, it’s more profound with him now, and it’s more personal.”\n\nShe also credited the attack with helping change public perceptions of Trump during the campaign.\n\n“For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that’s helpful,” she said.\n\n“You know, I have an obligation to do a good job, I feel, because I was really saved,” Trump told Fox News Friday. “I owe a lot. And I think — I hope — the reason I was saved was to save our country.” \n\nRoger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when U.S. Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing.\n\nStone said he’s found the president “to be more serene and more determined after the attempt on his life” in Butler.\n\n“He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,” he said. \n\nRalph Reed, chairman of the Faith and Freedom Coalition, agreed.\n\n“I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don’t turn your head at that instant,” he said. “He knew he was lucky to be alive.”\n\nGiven how close Trump came to a very different outcome, Reed said, “it’s hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I’ve talked to who said they were confident that he would win for that reason. That there must have been a reason.”\n\nAssociated Press writer Nicole Winfield in Rome contributed to this report.","summary":"By JILL COLVIN WASHINGTON (AP) &#8212; President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country&#8217;s 250th anniversary celebration, when he heard what sounded like fireworks in the distance. &#8220;Did I hear what I think I heard?&#8221; Trump remarked as he spoke from behind a wall of [&#8230;]","url":"https://www.bostonherald.com/2025/07/12/a-year-after-trumps-near-assassination-friends-and-allies-see-some-signs-of-a-changed-man/","image":"https://www.bostonherald.com/wp-content/uploads/2025/07/Trump_Butler_Anniversary_35386.jpg?w=1024&h=682","video":null,"publish_date":"2025-07-12 12:59:13","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.085},{"id":341047238,"title":"A year after Trump's near-assassination, friends and allies see some signs of a changed man","text":"WASHINGTON (AP) — President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance.\n\n“Did I hear what I think I heard?” Donald Trump remarked as he spoke from behind a wall of thick, bulletproof glass. “Don't worry, it’s only fireworks. I hope. Famous last words,\" he quipped, drawing laughs and cheers.\n\n“You always have to think positive,\" he went on. \"I didn’t like that sound, either.\"\n\nThe comments, just days before the first anniversary of Trump's near-assassination in Butler, Pennsylvania, served as a stark reminder of the lingering impact of the day when a gunman opened fire at a campaign rally, grazing Trump's ear and killing one of his supporters in the crowd.\n\nThe attack dramatically upended the 2024 campaign and launched a frenzied 10-day stretch that included Trump's triumphant arrival at the Republican National Convention with a bandaged ear, President Joe Biden's decision to abandon his reelection bid and the elevation of Vice President Kamala Harris as his successor.\n\nOne year after coming millimeters from a very different outcome, Trump, according to friends and aides, is still the same Trump. But they see signs, beyond being on higher alert on stage, that his brush with death did change him in some ways: He is more attentive and more grateful, they say, and speaks openly about how he believes he was saved by God to save the country and serve a second term, making him even more dug in on achieving his far-reaching agenda.\n\n“I think it’s always in the back of his mind,\" said Sen. Lindsey Graham of South Carolina, a longtime friend and ally who was in close touch with Trump after the shooting and joined him that night in New Jersey after he was treated at a Pennsylvania hospital. “He’s still a rough and tumble guy, you know. He hasn’t become a Zen Buddhist. But I think he is, I’ll say this, more appreciative. He’s more attentive to his friends,\" he said, pointing to Trump sending him a message on his birthday earlier this week.\n\nGraham added: \"It’s just a miracle he’s not dead. He definitely was a man who believed he had a second lease on life.\"\n\nConstant reminders\n\nWhile many who survive traumatic events try to block them from memory, Trump has instead surrounded himself with memorabilia commemorating one of the darkest episodes in modern political history. He's decorated the White House and his golf clubs with art pieces depicting the moment after the shooting when he stood up, thrust his fist dramatically in the air and chanted, “Fight, fight, fight!\"\n\nA painting of the scene now hangs prominently in the foyer of the White House State Floor near the staircase to the president’s residence. Earlier this year, he began displaying a bronze sculpture of the tableau in the Oval Office on a side table next to the Resolute Desk.\n\nAnd while he said in his speech at the Republican convention that he would only talk about what had happened once, he often shares the story of how he turned his head at just the right moment to show off his “all-time favorite chart in history” of southern border crossings that he credits for saving his life.\n\nDuring a press conference in the White House briefing room last month, he acknowledged lingering physical effects from the shooting.\n\n“I get that throbbing feeling every once in a while,\" he said, gesturing to his ear. “But you know what, that’s OK. This is a dangerous business. What I do is a dangerous business.”\n\nTrump will spend Sunday's anniversary attending the FIFA Club World Cup soccer final in East Rutherford, New Jersey.\n\nCrediting divine intervention\n\nTrump's chief of staff, Susie Wiles, who as his then-campaign chief was with him at the rally, said in a podcast interview released last week that Trump walked away from the shooting believing he had been spared for a reason.\n\n“I would say I think he believes that he was saved. I do. And he would never — even if he thought it before, I don’t think he would have admitted it. And he will now,\" she told “Pod Force One.”\n\nShe, too credited divine intervention. The chart, she noted, “was always the last chart in the rotation. And it was always on the other side. So to have him ask for that chart eight minutes in, and to have it come on the side that is opposite, caused him to look in a different direction and lift his head just a little because it was higher. And that just doesn’t happen because it happened. It happened because, I believe, God wanted him to live.”\n\nAs a result, she said, when Trump says things that “are perfunctory — every president says ‘God bless America’ — well, it’s more profound with him now, and it’s more personal.\"\n\nShe also credited the attack with helping change public perceptions of Trump during the campaign.\n\n“For the American public to see a person who was such a fighter as he was that day, I think, as awful and tragic as it might have been, it turned out to be something that showed people his character. And that’s helpful,\" she said.\n\n“You know, I have an obligation to do a good job, I feel, because I was really saved,” Trump told Fox News Friday. “I owe a lot. And I think — I hope — the reason I was saved was to save our country.”\n\nRoger Stone, a longtime friend and informal adviser, noted that Trump has had other brushes with death, including a last-minute decision not to board a helicopter to Atlantic City that crashed in 1989 and another near-assassination two months after Butler when U.S. Secret Service agents spotted a man pointing a rifle through the fence near where Trump was golfing.\n\nStone said he's found the president “to be more serene and more determined after the attempt on his life” in Butler.\n\n“He told me directly that he believed he was spared by God for the purpose of restoring the nation to greatness, and that he believes deeply that he is protected now by the Lord,” he said.\n\nRalph Reed, chairman of the Faith and Freedom Coalition, agreed.\n\n“I think for people who know the president, it is commonly believed that it changed him. I mean, how could it not? Imagine if you were who he was and if you don’t turn your head at that instant,\" he said. “He knew he was lucky to be alive.”\n\nGiven how close Trump came to a very different outcome, Reed said, “it’s hard not to feel on some level that the hand of providence protected him for some greater purpose. And there are people that I’ve talked to who said they were confident that he would win for that reason. That there must have been a reason.”\n\nAssociated Press writer Nicole Winfield in Rome contributed to this report.","url":"https://www.yahoo.com/news/trumps-near-assassination-friends-allies-125913413.html","image":"https://s.yimg.com/ny/api/res/1.2/qSiZRk3U25Tn.mvyuVNJRQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjg7Y2Y9d2VicA--/https://media.zenfs.com/en/ap.org/c9187648b52b83210d6c7c02b939bbca","video":null,"publish_date":"2025-07-12 12:59:13","author":"Jill Colvin","authors":["Jill Colvin"],"language":"en","source_country":"us","sentiment":0.074},{"id":340926840,"title":"Faith-Based 'Tradpop' Music Makes Comeback as Conservative Ideals Ascend in Culture","text":"Faith-based “traditional pop” music, also known as “tradpop,” is reportedly making a comeback as conservative ideals become more mainstream following a broader cultural shift in the United States and President Donald Trump’s landslide 2024 election victory.\n\nAlex Warren’s faith-based love song, “Ordinary” — which features lyrics mentioning the Lord, holy water, angels, heaven, an altar, and Hallelujah — reached the No. 1 song in the U.S. this week, and has remained on Billboard’s Hot 100 for the past 20 weeks.\n\n“The angels up in the clouds are jealous, knowing we found something so heavenly — something so out of the ordinary,” Warren sings in the chorus of “Ordinary,” adding, “You got me kissing the ground of your sanctuary. Shatter me with your touch, oh, Lord, return me to dust.”\n\n“Hopeless Hallelujah, on this side of Heaven’s gate. Oh, my life, how do ya breathe and take my breath away? At your altar, I will pray you’re the sculptor, I’m the clay,” the song’s lyrics add.\n\nCountry star Morgan Wallen also topped the charts for a fifth week in a row with his recently released album, “I’m the Problem,” breaking his own record from 2023 for the most songs ever charted on the Billboard Hot 100 in a single week.\n\nSingers Jelly Roll, Thomas Rhett, Benson Boone, and Shaboozey, meanwhile, have country-pop and folk style songs topping Billboard’s charts.\n\n“It’s a stark cultural contrast from last summer,” Semafor noted, recalling last year having been “defined” by the rise of “boundary-pushing” pop stars like Sabrina Carpenter, Chappell Roan and Charli XCX, whose “brat summer” trend “was embraced by Kamala Harris’ presidential campaign.”\n\nBut in the summer of 2025, “things are looking very different” with regards to which musician are popular in the United States, pop music commentator and podcaster Sam Murphy pointed out.\n\n“What they’re representing is a shift toward something far more safer, far more traditional, and far more conservative,” Murphy said. “Many of these names have strong religious beliefs or religious backgrounds, [and] it is coming through in the music.”\n\nVeteran pop stars, meanwhile, “haven’t managed to cut through,” the podcaster added, citing Lady Gaga’s 2025 studio album, Mayhem, with singles “Abracadabra” and “Disease” struggling on the charts.\n\n“They both failed to get into the Top 10,” Murphy said, adding that instead, Lady Gaga’s new song, “Die with a Smile” is “the huge single off the record, and that represents something far more traditional.”\n\n“It’s a ballad, it features somebody who is a very safe radio choice in Bruno Mars, and it has a sound that is quite vintage and familiar to people,” the pop music commentator noted.\n\n“Obviously, at the end of 2024, we shift into a conservative government, and so, it makes sense that the culture begins to reflect the time,” Murphy said. “I feel when you push the needle so far one way, it’s inevitable that it’s going to swing back very far in the opposite direction.”\n\nThe popularity of Warren’s “Ordinary” also comes at a time when the online “tradwife” trend is being increasingly embraced and celebrated by younger conservatives who express their desire for more traditional values involving marriage and large families, Semafor remarked.\n\nLast year, as the tradwife trend began to take off, Breitbart News caught up with Gen Z conservatives at Turning Point USA’s annual Young Women’s Leadership Summit, who shared that many students are finding it “rebellious” to identify as right-wing amid the left pushing their propaganda in schools.\n\nWhen it comes to being “a trad wife” and living “the trad life,” it means “upholding and living a traditional life and not allowing the government to control us,” Turning Point USA contributor and Gen Z political commentator Morgonn McMichael told Breitbart News last summer.\n\n“Just bringing to back to the home,” McMichael said of the tradwife concept, expressing hope in “strong nuclear families and continuing to create strong generations that are going to love their country.”\n\nVideo Source: Jack Knudsen / Breitbart News\n\nAlana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.","summary":"Faith-based &#8220;traditional pop&#8221; music, also known as &#8220;tradpop,&#8221; is reportedly making a comeback as conservative ideals become more mainstream following a broader cultural shift in the United States and President Donald Trump&#8217;s landslide 2024 election victory. Alex Warren&#8217;s faith-based love\n\n\nThe post Faith-Based &#8216;Tradpop&#8217; Music Makes Comeback as Conservative Ideals Ascend in Culture appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/07/12/faith-based-tradpop-music-makes-comeback-as-conservative-ideals-ascend-in-culture/","image":"https://media.breitbart.com/media/2025/07/nathan-mullet-7JNwaNhZeWI-unsplash-640x335.jpg","video":null,"publish_date":"2025-07-12 12:16:41","author":"Alana Mastrangelo","authors":["Alana Mastrangelo"],"language":"en","source_country":"US","sentiment":0.487},{"id":340940078,"title":"2024 book review: Trump, Biden, Harris and a turbulent election full of what-ifs","text":"Donald Trump is on a roll. The “big, beautiful bill” is law. Ice, his paramilitary immigration force, rivals foreign armies for size and funding. Democrats stand demoralized and divided. 2024: How Trump Retook the White House and the Democrats Lost America, by Josh Dawsey, Tyler Pager and Isaac Arnsdorf, is a book for these times: aptly named, deeply sourced.\n\nKamala Harris declined to speak. Joe Biden criticized his successor in a brief phone call, then balked. Trump talked, of course.\n\n“If that didn’t happen … I think I would’ve won, but it might have been a little bit closer,” he says of the assassination attempt in Butler, Pennsylvania, which set the race alight.\n\nYet 2024 is about more than the horse race. It also chronicles how the elites unintentionally made Trump’s restoration possible, despite a torrent of criminal charges against him, 34 resulting in convictions, and civil lawsuits that saw him fined hundreds of millions of dollars.\n\n“Trump always drew his strength from decades of pent-up frustration with the American democratic system’s failures to address the hardships and problems the people experienced in their daily lives,” Dawsey, Pager and Arnsdorf write.\n\n“In 2024, [Trump’s] supporters saw institutions stacked against them … leading them to identify viscerally with his legal ordeal, even though they had not experienced anything like it before.”\n\nDawsey is a Pulitzer prize winner, working political investigations and enterprise for the Wall Street Journal. Pager covers the White House for the New York Times. Arnsdorf was part of the Washington Post team that won a Pulitzer for coverage of the assassination attempt.\n\nDawsey and Pager are Post alumni. With Arnsdorf, they capture the aspirations and delusions of Trump and the pretenders to his Republican throne, of Biden and Harris too.\n\n“In the weeks after the election, Biden repeatedly told allies that he could have won if he’d stayed in the race,” 2024 reports, “even as he publicly questioned whether he could have served another four years.”\n\nReally? Biden’s approval rating fell below 50% in August 2021 and never recovered. From October 2023, he trailed Trump. A year out, the authors reveal, Barack Obama warned his former vice-president’s staff: “Your campaign is a mess.”\n\nBiden’s aides privately derided Obama as “a prick”.\n\n“They thought he and his inner circle had constantly disrespected and mistreated Biden, despite his loyal service as vice-president.”\n\nAs for Harris, Dawsey, Pager and Arnsdorf report that she “knew that the race would be close, but she really thought she would win”.\n\nDespite that, David Plouffe, a senior Harris adviser, admitted post-election that internal polls never showed her leading.\n\n“I think it surprised people because there were these public polls that came out in late September, early October, showing us with leads that we never saw,” he said. Harris’s debate win never moved the needle.\n\nDawsey, Pager and Arnsdorf contend that the outcome was not foreordained. Rather, they raise a series of plausible-enough “what-ifs”. One is: “If the Democrats got clobbered, as expected, in the 2022 midterms, and Joe Biden never ran for re-election.”\n\nExcept, by early 2022, according to This Shall Not Pass, a campaign book published that year, Biden saw himself as a cross between FDR and Obama.\n\nA telephone conversation between Biden and Abigail Spanberger, a moderate congresswoman now the Democratic candidate for governor in Virginia, captures Biden’s self-perception.\n\n“This is President Roosevelt,” Biden begins, before thanking Spanberger for her sense of humor.\n\nShe replies: “I’m glad you have a sense of humor, Mr President.”\n\nBack to 2024. Biden bristled at being challenged. Pushback risked being equated with disloyalty. His closest advisers were either family members or dependent on him for their livelihoods. He lacked social peers with incomes and personages of their own.\n\nMike Donilon, a longtime aide, tells the authors: “It was an act of insanity by the Democratic leadership to have forced Biden out.\n\n“Tell me why you walked away from a guy with 81m votes … A native of [swing-state] Pennsylvania. Why do that?”\n\nBecause Biden’s debate performance was a gobsmacking disaster. He also found navigating the stairs of Air Force One difficult and needed prompts to find the podium. In May 2025, Biden announced that he had been diagnosed with stage-four prostate cancer – a disclosure that came after 2024 went to press.\n\nThe authors of 2024 pose Republican hypotheticals too. One: “If Trump never got indicted, or if Republicans didn’t respond by rallying to him, or if the prosecutions were more successful.”\n\nRon DeSantis, Florida’s governor, demonstrated a lack of nerve. Glaringly, he failed to use the initial E Jean Carroll trial, over the writer’s allegation that Trump sexually assaulted her, to bolster his presidential ambitions. DeSantis didn’t dispatch his wife, Casey DeSantis, to Manhattan to offer daily thoughts and prayers for the plaintiff, or for Melania Trump. If you want to be the man, first you’ve got to beat the man.\n\nAnother hypothetical: “If Trump and Biden didn’t agree to an early debate …”\n\nThat question hangs over everything.\n\nTrump’s pronouncements leave Dawsey, Pager and Arnsdorf anxious. After the 2022 midterms, he mused about terminating the constitution. Later, on the campaign trail, he spoke openly of being a “dictator for a day”. When he was back in the West Wing, reporters asked: “Are you a dictator on day one?” “No,” he replied. “I can’t imagine even being called that.”\n\nDawsey, Pager and Arnsdorf then catalog Trump’s unilateral actions on that first day, including stripping political opponents of security clearances. Later that month, he commenced his vendetta against law firms he deemed to be enemies. In February, Trump barred the Associated Press from the White House press pool unless the news agency referred to the Gulf of Mexico as the “Gulf of America”.\n\n2024 contains no mention of Hungary’s Viktor Orbán. Perhaps it should have made space. Hungary’s leader is an autocrat in all but name, an elected leader who has removed freedoms regardless. Republicans adore him.\n\n 2024 is published in the US by Penguin Random House","summary":"Deeply sourced narrative charts the delusions of the main players and the disastrous debate that reset the campaign\n\nDonald Trump is on a roll. The “big, beautiful bill” is law. Ice, his paramilitary immigration force, rivals foreign armies for size and funding. Democrats stand demoralized and divided. 2024: How Trump Retook the White House and the Democrats Lost America, by Josh Dawsey, Tyler Pager and Isaac Arnsdorf, is a book for these times: aptly named, deeply sourced.\n\nKamala Harris declined to speak. Joe Biden criticized his successor in a brief phone call, then balked. Trump talked, of course.\n\n2024 is published in the US by Penguin Random House\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/jul/12/2024-book-review-trump-biden-harris-election","image":"https://i.guim.co.uk/img/media/2744b8ee211dfd49faff45a297bc342a453bc8e3/500_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-07-12 12:00:11","author":"Lloyd Green","authors":["Lloyd Green"],"language":"en","category":"politics","source_country":"us","sentiment":-0.338}]}