{"offset":0,"number":50,"available":4,"news":[{"id":263074054,"title":"OPINION - Guto Harri: Donald Trump is the badass the West needs right now","text":"Yes, he’s odious, repulsive and, in many ways, ludicrous. The white eyes in an ocean of orange spray tan, the crazy hair, the big fat frame; none of this fits with our Hollywood ideal of a US President. His lewd phallic gestures with a microphone during the closing stages of his campaign were beyond parody.\n\nBut he won. He won clean, fair and decisively. On both the popular poll and critical stash of votes in the electoral college there was no doubt about the outcome. And whether we like it or not, US voters knew what he was and what he was offering them. This was not a vote against a clapped out, partially senile sitting President, nor indeed a rejection of Kamala Harris who rose to the challenge belatedly presented to her, magnificently. This was a pro-active endorsement of Donald Trump in all his crude, red blooded fury.\n\nUnlike Keir Starmer here, elected by default after years of Tory chaos without being remotely open about the left wing plans he’s now putting in place, the 45th President will now have a second shot at “making America great again”, because he offered a decisive policy and personality break with the recent past.\n\nAlongside his passionate groupies there were many more who pinched their noses and voted for a more aggressive, proactive politics where illegal migrants will now be rounded up and kicked out, cheap foreign imports penalised with heavy tariffs, shoplifters shot on sight, drug dealers and people traffickers sentenced to death. The infamous wall along the Mexican border that he promised nearly a decade ago will be finished. Narcos farms south of that border will be bracing themselves for missile attacks and special forces. Oil and gas producers will be unleashed. An anti-woke university will be set up and teachers across the States will be told to “embrace patriotic values”.\n\nMany of us will be squeamish about some of this. The left here will watch in horror. Keir Starmer raced out a tweet congratulating “the closest of allies”, but David Lammy will surely need a new job by Christmas, because we cannot have a Foreign Secretary who described the re-endorsed choice of the American people as a “neo-Nazi … racist KKK … dangerous clown and sociopath”. The Mayor of London can get away with “calling him out” as a “racist, sexist and homophobe”, because Sadiq Khan is not in charge of UK foreign policy. David Lammy is, and the Prime Minister will now surely regret appointing him as well as allowing his party to openly recruit more than a hundred activists to go campaign for Kamal.\n\nWe may well need to take drastic action to ensure the UK’s voice is heard in the new White House. Alongside a new Foreign Secretary like Peter Mandelson we need someone on the ground in Washington who cannot be ignored. Our current Ambassador to DC is excellent but transatlantic relationships with Trump are going to be more transactional than ever, and we need a big personality capable of spelling things out in neon lit lights. I hesitate to say this, but it may be time to engage the one British politician who’ll be at the republican celebrations today, Nigel Farage. No, I really don’t like the idea much, but better to talk to someone who Trump likes and listens to than place calls to the Oval Office that may take a long time to get answered.\n\nOn one critical issue in foreign affairs we’re about to find out how much the new President listens to the former Prime Minister, Boris Johnson. Arguably the most striking boast by Donald Trump in the run up to this election was that he could end Russia’s war against Ukraine on the first day he takes charge.\n\nPut crudely, which will now be the default tone of diplomacy, both Putin and Zelensky will have the new facts of life spelt out to them by January. The heroic leader in Kyiv will be told there’ll be no more US money or weapons unless he cuts a deal with the Kremlin. Putin will be threatened with the full might of the US military unless he backs off and agrees that the only piece of Ukraine he’ll get to keep is the Crimea — which he bit off ten years ago. Boris will do all he can to help Zelensky but Trump sees himself as a deal maker above all else and won’t want to undermine that reputation on day one.\n\nIn the Middle East and in China, political calculations about ongoing assaults and potential invasions will now be radically reassessed. Most Brits, according to IPSOS UK, would have preferred Kamala Harris. On the eve of the election, 63% thought a Trump Presidency would be a “bad thing”. Only 21% thought the opposite. But the hard men of the world will be anxious about having one of their own across the pond.\n\nBill Clinton, Barrack Obama and Joe Biden were highly capable and rational in their dealings with the rest of the world but they played safe and were ultimately predictable. Less well intentioned opponents got used to knowing exactly what they could get away with.\n\nNot so with Trump, and he’s made it clear that he loathes the chaos and carnage that has taken place on the Democrats’ watch. Predictable and rational are good qualities of course, and a more impulsive and aggressive President could be extremely dangerous. Donald Trump, to be frank, is a badass. But this decade has already been dominated by such people so whatever else you feel today console yourself that we in the West have our own badass in the mix, and having been chosen democratically, he’s better place to fight back on our behalf and on behalf of democracy.\n\nGuto Harri is a former chief communications officer at City Hall","summary":"Yes, he’s odious, repulsive and, in many ways, ludicrous. The white eyes in an ocean of orange spray tan, the crazy hair, the big fat frame; none of this fits with our Hollywood ideal of a US President. His lewd phallic gestures with a microphone during the closing stages of his campaign were beyond parody.","url":"https://www.standard.co.uk/comment/donald-trump-us-election-president-victory-west-badass-b1192363.html","image":"https://static.standard.co.uk/2024/11/05/13/46/US-VOTE-POLITICS-TRUMP-eamtrv7z.jpeg?width=1200","video":null,"publish_date":"2024-11-06 13:08:39","author":"Guto Harri","authors":["Guto Harri"],"language":"en","category":"politics","source_country":"gb","sentiment":0.232},{"id":262865876,"title":"World’s “First Wooden Satellite” Lignosat To Orbit Earth For Six Months","text":"World’s “First Wooden Satellite” Lignosat To Orbit...\n\nThai ‘Celebrity’ Baby Hippo Picks Trump Over Harri...\n\nUS Election 2024: Beyonce, Taylor Swift, Oprah Win...\n\n5 Times Virat Kohli-Anushka Sharma Gave Us Couple ...\n\nTrump Draws Parallels to Lincoln, Finishes Campaig...\n\nTrump Calls for \"Death Penalty for Migrants\", Vows...\n\nTrump Warns He'll \"Impose Tariffs on Mexico, China...\n\nTrump Calls for \"Death Penalty for Migrants\", Vows...\n\nProtests As Pro Kurdish Mayors Stripped of Posts In Turkey\n\nIsraeli Settlers Torch Cars In West Bank\n\nIsrael Shows Soldiers And Tanks In Lebanon\n\nIran Will Attack Israel With ‘All Resources’\n\n‘Used For Survival’ Israeli Opposition Lashes Out ...\n\n“Murderers!”: Angry Crowds Throw Mud At Spain's Ki...\n\nHouthis ‘Will Continue To Hit Israeli Ships’ In Re...\n\nTrump Says He Wouldn't Mind If Someone ‘Shot Throu...\n\n“From Cursed Gaza…” Families of Hostages Call On N...\n\nUS Election 2024: ‘Want To See Me Knock...?’ Donal...\n\nKamala Harris Opens Saturday Night Live, Urges US ...\n\nIran: Female Student Arrested For Stripping To Pro...","summary":"The world's first wooden satellite, developed by Japanese researchers, was successfully launched into space from NASA’s Kennedy Space Center on November 4. This pioneering project aims to test the use of timber in lunar and Mars exploration.LignoSat, created by Kyoto University and Sumitomo Forestry, will be transported to the International Space Station on a SpaceX mission before being released into orbit approximately 400 km (250 miles) above the Earth.Named after the Latin word for \"wood,\" this palm-sized satellite will demonstrate the potential of renewable materials in space habitation.Once deployed, LignoSat will remain in orbit for six months, with its electronic components monitoring how wood withstands the harsh conditions of space, where temperatures can vary from -100 to 100 degrees Celsius every 45 minutes as it moves between darkness and sunlight.","url":"https://www.news18.com/short-videos/world/world-s-first-wooden-satellite-lignosat-to-orbit-earth-for-six-months-9110377.html","image":"https://images.news18.com/ibnlive/uploads/2024/11/1730824383_fbd4e7c7-a087-4679-9197-07d1ae240e93-16x9.jpeg?impolicy=website&width=1200&height=900","video":null,"publish_date":"2024-11-05 16:30:06","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.153},{"id":262852244,"title":"Thai ‘Celebrity’ Baby Hippo Picks Trump Over Harris In US Election","text":"Thai ‘Celebrity’ Baby Hippo Picks Trump Over Harri...\n\nUS Election 2024: Beyonce, Taylor Swift, Oprah Win...\n\n5 Times Virat Kohli-Anushka Sharma Gave Us Couple ...\n\nTrump Draws Parallels to Lincoln, Finishes Campaig...\n\nTrump Calls for \"Death Penalty for Migrants\", Vows...\n\nTrump Warns He'll \"Impose Tariffs on Mexico, China...\n\nTrump Calls for \"Death Penalty for Migrants\", Vows...\n\nProtests As Pro Kurdish Mayors Stripped of Posts In Turkey\n\nIsraeli Settlers Torch Cars In West Bank\n\nIsrael Shows Soldiers And Tanks In Lebanon\n\nIran Will Attack Israel With ‘All Resources’\n\n‘Used For Survival’ Israeli Opposition Lashes Out ...\n\n“Murderers!”: Angry Crowds Throw Mud At Spain's Ki...\n\nHouthis ‘Will Continue To Hit Israeli Ships’ In Re...\n\nTrump Says He Wouldn't Mind If Someone ‘Shot Throu...\n\n“From Cursed Gaza…” Families of Hostages Call On N...\n\nUS Election 2024: ‘Want To See Me Knock...?’ Donal...\n\nKamala Harris Opens Saturday Night Live, Urges US ...\n\nIran: Female Student Arrested For Stripping To Pro...\n\n\"Not Giving Trump a Second Chance...\" Cardi B Endo...","summary":"Thailand’s beloved baby hippo, Moo Deng, predicted a victory for Republican Donald Trump in the US presidential election set for November 5. On November 4, Moo Deng was presented with two fruit baskets marked with the names of the candidates, Trump and Democratic contender Kamala Harris. The baskets were filled with fruits such as dragon fruit and watermelons.According to a post by Khao Kheow Zoo on social media platform X, \"Moo Deng chose Trump because the piece of dragon fruit was bigger.\"Born in July at Thailand’s Khao Kheow Open Zoo, Moo Deng has become a social media sensation with millions of fans worldwide captivated by her playful and clumsy charm.","url":"https://www.news18.com/short-videos/world/thai-celebrity-baby-hippo-picks-trump-over-harris-in-us-election-9110332.html","image":"https://images.news18.com/ibnlive/uploads/2024/11/1730820811_89d205a0-9206-4b8a-84f7-edcae902a43b-16x9.jpeg?impolicy=website&width=1200&height=900","video":null,"publish_date":"2024-11-05 15:30:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.04},{"id":262751850,"title":"US Election: ‘I feel like I’m running for president’ – Cardi B","text":"American rapper, Cardi B has said she can't contain her feelings ahead of the presidential election. The Grammy-winning star shared that she has been nervous and feels like she is running for the presidency. \"I don’t know why I’m so nervous for tomorrow. \"I feel like I’m running for president,\" she shared with her 36 million followers on X. DAILY POST recalls that Cardi B spoke at Harris’ rally in Milwaukee, Wisconsin, on Friday, where she formerly endorsed the Democratic Party's candidate for the presidential election. During the rally, Cardi B claimed that the Republican Party's candidate and Harri's main challenger, Donald Trump was promoting anti-women agendas. “Donald Trump is a hustler who is trying to hustle women out of their rights and hustle Americans out of their money…He’s selling more than watches and sneakers. He’s selling bigotry, misogyny, division, chaos, and confusion,\" she stated. The rapper also later debunked rumours that she was paid to endorse Kamala Harris via her X handle. Cardi denied receiving any monetary reward for her outing at Harris' rally.","summary":"American rapper, Cardi B has said she can&#8217;t contain her feelings ahead of the presidential election. The Grammy-winning star shared that she has been nervous and feels like she is running for the presidency. &#8220;I don’t know why I’m so nervous for tomorrow. &#8220;I feel like I’m running for president,&#8221; she shared with her 36 [&#8230;]\n\n\nUS Election: &#8216;I feel like I’m running for president&#8217; &#8211; Cardi B","url":"https://dailypost.ng/2024/11/05/us-election-i-feel-like-im-running-for-president-cardi-b/","image":"https://dailypost.ng/wp-content/uploads/2023/08/Cardi-B-.jpeg","video":null,"publish_date":"2024-11-05 07:40:20","author":"Sunny Green Itodo","authors":["Sunny Green Itodo"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.263}]}