{"offset":0,"number":50,"available":303,"news":[{"id":371708526,"title":"Jeff Daniels slams Trump's 'decency' after performing 'No Kings' song on MSNBC","text":"Actor Jeff Daniels performed a song inspired by the \"No Kings\" protests live on MSNBC's \"Deadline: White House\" Tuesday. \"When we interviewed Joan Baez for 'The Best People' podcast, we asked her what was different about the movements in the 60s,\" host Nicolle Wallace said. \"She said, ‘Well, lots of things. But one of them, we had each other, and we had the music.’ On Saturday, 7 million Americans found each other at the 'No Kings' protest. And today, thanks to Jeff Daniels, we’ve got the music.\" The \"Tron: Ares\" actor then performed a song he wrote called \"Crazy World,\" which he described as \"how I cope.\" ACTOR JEFF DANIELS LAMENTS KAMALA HARRIS’ LOSS, SUGGESTS SHE WOULD HAVE GOVERNED LIKE ABRAHAM LINCOLN \"I’ve seen a young girl smiling at something he just said/ I watched him fall until her pretty green eyes, his cheeks turned Valentine red/ I’ve seen an old man walking with his wife by his side/ I watched him reach down, take her hand, damned if I didn’t cry,\" Daniels sang as he strummed a guitar on the MSNBC set. \"This crazy world’s gone crazy. Who am I to judge?/ Nice to know in the world full of hate, there's someone out there still making love.\" Before he performed his song, Daniels talked about the lack of \"decency\" from President Donald Trump, particularly in his AI video response to the \"No Kings\" protests. ACTOR JEFF BRIDGES TELLS ICE TO GET 'OFF OUR STREETS' AS 'THE DUDE' CHARACTER ON 'JIMMY KIMMEL LIVE!' \"By the way, do we really have to treat people like that? You know, the meme that he had where he was flying with the crown and the, you know, spewing excrement all over the people down below,\" Daniels said. \"The country, America,\" Wallace responded. \"Would Lincoln have done that?\" Daniels asked. \"I don’t think Nixon would have done that,\" Wallace remarked. \"Nixon wouldn’t have done it. Reagan wouldn’t have done it. Bush wouldn’t have done it — either Bush. I think people in the Midwest, where I am … we value our decency and our civility,\" Daniels said. SINGER KENNY LOGGINS DENOUNCES TRUMP'S 'NO KINGS' POST USING HIS ICONIC 'TOP GUN' SONG He added that he believed that decency and civility will matter again after people \"vote for change\" in the midterm elections. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Fox News Digital reached out to MSNBC for comment.","summary":"Actor Jeff Daniels performed his original song, &quot;Crazy World,&quot; on MSNBC&apos;s &quot;Deadline: White House&quot; Tuesday after being inspired by the &quot;No Kings&quot; protests.","url":"https://www.foxnews.com/media/jeff-daniels-slams-trumps-decency-after-performing-no-kings-song-msnbc","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/daniels2.jpg","video":null,"publish_date":"2025-10-22 23:49:28","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"US","sentiment":-0.034},{"id":371689108,"title":"Kamala Harris Family Secret Service Agent Reportedly Moonlighted As Plus Size Model","text":"A female agent formerly on the Secret Service detail for Vice President Kamala Harris’ stepdaughter Ella Emhoff moonlighted as a model and never passed her physical fitness test, sources told RealClearPolitics.\n\nFormer Secret Service Director Kimberly Cheatle emphasized Diversity, Equity and Inclusion (DEI) during her tenure before she was forced to resign in the aftermath of the assassination attempt on President Donald Trump’s life, RealClearPolitics reported. Under Cheatle’s leadership, one agent on Emhoff’s detail was retained after she failed to pass her physical fitness test multiple times, sources in the Secret Service community told the outlet. (RELATED: REPORT: Kimberly Cheatle Allegedly Planned To Destroy White House Cocaine, Agency Denies Claims)\n\nThe agent was featured in a magazine profile and hinted at her Secret Service position in a photo shoot labeled, “Undercover, But Never Underdressed,” the outlet reported. The agent describes herself as a “nationally published curve model, plus-size fashion and fitness influencer, and body-positive advocate” on social media, according to RealClearPolitics.\n\n Standards lapsed at Secret Service during the Biden administration so much so that an agent–assigned to protect VP Harris’ family–not only never passed a physical fitness test but was allowed to moonlight as a plus-sized model, @SusanCrabtree exclusively reports. pic.twitter.com/Hxg4PEijXe — Philip Melanchthon Wegmann (@PhilipWegmann) October 22, 2025\n\nAfter the agent had failed her physical fitness test multiple times, she was placed in the Special Services Division, which handles support functions for the agency, sources in the Secret Service community told the outlet. Her new job handles the maintenance of the armored vehicle fleet and screens mail and packages coming into the White House complex, the sources added.\n\n“The U.S. Secret Service is in full compliance with the Jan. 20, 2025 executive order and the agency discontinued all relevant programs and activities within the 60-day timeline,” U.S. Secret Service Chief of Communications Anthony Guglielmi told the Daily Caller in a statement.\n\n“Director Curran’s leadership is centered on recruiting and retaining a workforce characterized by attention to detail, discipline, and commitment to our dual mission while also ensuring promotions and reassignments are merit based – the right person, for the right position, at the right time,” the statement continued. “Director Curran has challenged his leadership team to reaffirm a commitment to the highest professional standards to achieve operational excellence.”\n\nThe agency reached 24% women agents and officers by the time Cheatle resigned, several Secret Service sources told RealClearPolitics.\n\nRealClearPolitics also reported that during Cheatle’s time, agents in minority groups could enter chat rooms on the agency’s internal DEI website so they could discuss their struggles in the workplace.\n\nCheatle resigned in July after she testified in front of the House Oversight Committee about the near assassination attempt on Trump. She had served as director since 2022.\n\n“The immediate reaction to her resignation is that it is overdue, she should have done this at least a week ago,” Speaker Mike Johnson said in a press conference following the resignation. “Now we have to pick up the pieces. We have to rebuild the American people’s faith and trust in the Secret Service as an agency.”","summary":"'Agent was featured in a magazine profile'","url":"https://dailycaller.com/2025/10/22/kamala-harris-family-secret-service-agent-ella-emhoff-model-plus-size-dei/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-2231026087-scaled-e1761167530844.jpg","video":null,"publish_date":"2025-10-22 21:57:32","author":"Reagan Reese","authors":["Reagan Reese"],"language":"en","source_country":"us","sentiment":0.217},{"id":371708748,"title":"Gavin Newsom Rocked by Poll Showing Him Losing Dem. Nomination Drive to Kamala Harris","text":"Radical California Gov. Gavin Newsom has been rocked by a poll of 2028 Democrat presidential hopefuls that shows he is now losing to former Vice President Kamala Harris.\n\nA Noble Predictive Insights poll conducted over the first week of October found that Newsom is trailing Harris for the 2028 Democrat nomination among Democrats and independents, Newsweek reported.\n\nThis poll shows that Newsom’s assumption that he is the front runner is not exactly a foregone conclusion. The poll placed Harris at 33 percent among Democrats and 27 percent with independents. But Newsom was behind 13 percent among Democrats and back three percent with independents.\n\nOther candidates in the poll include New York Democrat Congresswoman Alexandria Ocasio-Cortez, who ranked third with a mere eight percent, followed by former Biden Transportation Secretary Pete Buttigieg at seven percent support.\n\nThe poll might show the beginning of erosion in Newom’s commanding position as Democrat frontrunner, after a poll in August found he led the field with 25 percent to Harris’s 19 percent, Politico reported at the time.\n\nNewsom has positioned himself as the obvious Democrat front runner and has launched a major social media trolling campaign to attack Trump and Republicans with lowbrow memes, self-aggrandizing boasts, and name calling with accusations that Trump and Republicans are “fascists.”\n\nIn September, for instance, he spent an entire day trying to defend his incendiary claim that White House Deputy Chief of Staff Stephen Miller is a “fascist.”\n\nNewsom decided to call Miller a “fascist” just days after the same accusation was carved into the bullet casings apparently used in the assassination Charlie Kirk. He had also called Miller, who is Jewish, “SS” — a reference to the Nazis who led the Holocaust.\n\nFollow Warner Todd Huston on Facebook at: Facebook.com/Warner.Todd.Huston, Truth Social @WarnerToddHuston, or at X/Twitter @WTHuston","summary":"Gavin Newsom has been rocked by a poll of 2028 Democrat presidential hopefuls that shows he is losing to former Vice President Kamala Harris.\n\n\nThe post Gavin Newsom Rocked by Poll Showing Him Losing Dem. Nomination Drive to Kamala Harris appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/10/22/gavin-newsom-rocked-by-poll-showing-him-losing-dem-nomination-drive-to-kamala-harris/","image":"https://media.breitbart.com/media/2025/10/Newsom-and-Harris-640x335.jpeg","video":null,"publish_date":"2025-10-22 21:56:24","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","source_country":"US","sentiment":-0.267},{"id":371705178,"title":"Dumb and Dumber star caterwauls bizarre anti-Trump song on Nicolle Wallace's MSNBC show","text":"Actor Jeff Daniels bizarrely broke out his guitar and belted out a politically charged song live on Nicolle Wallace’s MSNBC show Tuesday.\n\nDaniels, star of the 1994 screwball hit Dumb and Dumber, performed the cringeworthy ditty in support of Saturday's 'No Kings' protests across the country.\n\nThe 70-year-old, who railed against Republicans on Wallace's podcast in July, called the song Crazy World and told the host writing it 'is how I cope.'\n\n'This crazy world’s gone crazy. Who am I to judge?' Daniels sang as he strummed an acoustic guitar. \n\n'Nice to know in the world full of hate, there's someone out there still making love.\n\n'I've seen a prayer get answered. I've seen a bride in June. I'm proud to say I've seen the Milky Way winking at the man in the moon. \n\nI've seen a dozen roses. I've seen a heart on a sleeve. I've seen enough to know what I know. Know that I still believe.\n\n'It's crazy. This world's gone crazy. Who am I to judge? \n\n'It's nice to know in a world full of hate, there's someone out there. There's someone out there. There's someone out there.' \n\nOther examples of 'love' in Daniels' lyrics included 'a young girl smiling', an elderly couple, a dog's tail wagging, and a young child at play.\n\nAfter the actor finished, Wallace remarked, 'We needed that.'\n\nElsewhere in his appearance, Daniels discussed economic anxiety and what he sees as an overall decline in decency under Trump.\n\n'I think people in the Midwest, where I am… we value our decency and our civility,' he said.\n\nHe added that such decency was woefully absent from an AI-generated video posted by the president on Saturday, showed Trump flying a fighter jet and dumping excrement on 'No Kings' demonstrators. \n\n'Do we really have to treat people like that?' Daniels asked, acknowledging he saw the video as satire. \n\nHe further told Wallace of Trump: 'Down the road, if he doesn’t deliver on the economy like he promised he would, then that stuff will start to add up. And they’ll get tired of it, and they’ll vote for change.' \n\nOn Wallace's podcast in July, Daniels ripped the GOP and his home state of Michigan for voting for Trump. \n\nHe also called the president a 'snake oil salesman' and expressed his desire for Trump voters to lose their money.\n\nThe actor said that Kamala Harris would have been a better choice for president because she would have lead the country like Abraham Lincoln.","summary":"Jeff Daniels performed the cringeworthy ditty in support of Saturday's 'No Kings' protests across the country.","url":"https://www.dailymail.co.uk/media/article-15216915/jeff-daniels-song-msnbc-nicolle-wallace-donald-trump.html","image":"https://i.dailymail.co.uk/1s/2025/10/22/17/103221075-0-image-m-7_1761152257510.jpg","video":null,"publish_date":"2025-10-22 21:11:12","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.018},{"id":371708788,"title":"9 Most Ridiculous Displays Seen at the No Kings Protests","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters Signup \n\n BREITBARTThis Video Title Has Been Overridden By Editorial Staff And Should Be Used Instead Of The Original\n\n BREITBART\n\nGraham Platner\nNo Kings Protests\nGaza Peace Deal\nSchumer Shutdown\nICE Crackdowns\n\n9 Most Ridiculous Displays Seen at the No Kings Protests\n\n Matthew Perdie / Breitbart News\n\nHannah Knudsen22 Oct 2025 \n\nDonald Trump\n\nPlease let us know if you're having issues with commenting.\n\n BREITBART \n This Video Title Has Been Overridden By Editorial Staff And Should Be Used Instead Of The Original \n\nMOST POPULAR\n\nTrump Administration Significantly Ups Sanctions on Russia\nReport: Trans Americans to Flee Country Due to 'Most Anti-LGBTQ+ President'\nMarlow: Trans Americans Threaten to Leave Trump Voters Say I Voted for This\nNFL Rejects Calls to Drop Bad Bunny from Super Bowl Halftime Show\nCurtis Sliwa Meltsdown on Radio Interview After Being Told He Will 'Lose'\nManchester Pride Begins Liquidation as Drag Queens and Artists Revolt\nPoll: 4 in 10 Say Illegal Immigrants Who Haven't Committed Crimes Should St\nMurphy: Trump White House Ballroom Construction 'Absolutely Illegal'\nJames Woods Roasts Hillary Clinton's White House Renovation Screed\nGavin Newsom Rocked by Poll Showing He's Losing to Kamala Harris\n\nFROM THE HOMEPAGE\n\nTrump Administration Significantly Ups Sanctions on Russia in Push for Ceasefire in Ukraine\nTrump’s War Against Narco-Terrorists at Sea Expands to Pacific Ocean\nBreitbart Business Digest: The Tariff Inflation Scare Is Dead\nHHS: Illegal Alien Child Rapist Received Thousands in Taxpayer-Funded Medicaid Benefits\nLate-Term Abortion Clinic Expected to Open in New Jersey\nCurtis Sliwa Melts Down on Radio Interview After Being Told He Will ‘Lose Badly’\nDHS Rebukes California Democrats’ Plan to Launch ‘ICE Tracker’ to Dox Immigration Agents\nGavin Newsom Rocked by Poll Showing Him Losing Dem. Nomination Drive to Kamala Harris\n9 Most Ridiculous Displays Seen at the No Kings Protests\nTrump Admin Continues to Fight Order Blocking National Guard Deployment to Portland\nSanctuary Chicago: ICE Agents Seek Custody of Illegal Alien Accused of Violently Raping Woman\nDemocrat Scott Wiener Claims U.S. ‘Slipping into Fascism’ in Congressional Campaign Launch \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nEditorial Guidelines\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters Signup\n\nCopyright © 2025 Breitbart","summary":"What are we fighting now? The patriarchy? Nazis? Climate deniers? #FreetheNipple opposers? No — KINGS!\n\n\nThe post 9 Most Ridiculous Displays Seen at the No Kings Protests appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/10/22/9-most-ridiculous-displays-seen-at-the-no-kings-protests/","image":"https://media.breitbart.com/media/2025/10/trump-inflatable-no-kings-bnn-640x335.jpg","video":null,"publish_date":"2025-10-22 21:11:02","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.455},{"id":371683870,"title":"Hunter Biden calls excerpts of Harris' book 'personally painful' and 'not authentic'","text":"Former first son Hunter Biden said Monday he was deeply \"disappointed\" by former Vice President Kamala Harris' new campaign memoir. Biden told journalist Tommy Christopher on his Substack platform that while he had not read Harris' book, he's been hurt by the things he's heard coming from it – feeling she had betrayed a sense of loyalty to former President Joe Biden. \"I don’t know, I’d have to admit, it’s personally painful,\" Biden said. \"I just think that people like particularly the vice president is that–I guess my… Personally, you know, sense of loyalty.\" BIDEN AIDES BLAST HARRIS BOOK EXCERPTS, ADDING VP 'WAS SIMPLY NOT GOOD AT THE JOB': REPORT He continued, \"Is it for her to, in a book, to try to distance herself and take the– what I would call the really easy path to distance herself. To–what I guess she thinks. I think that the biggest complaint about the vice president has always been is that, which I never believe, and I really mean it, is that she is not authentic.\" He accused Harris of trying to \"play both sides\" with her memoir, such as her retroactively suggesting that she should have encouraged the former president to drop out of the race sooner. HUNTER BIDEN BREAKS SILENCE ON PARDON FROM DAD JOE: ‘I REALIZE HOW PRIVILEGED I AM’ \"[Joe Biden] chose her out of loyalty and I just don’t understand, I guess I don’t understand why someone would choose the expedient path as it relates to that relationship, their own political expediency,\" Biden said. Despite his frustrations, Biden said Harris had an \"incredible résumé\" and that he would have \"gladly\" voted for her for president in a different race. OBAMA LEADING BIDEN OFF STAGE BY THE HAND 'REALLY PISSED ME OFF,' HUNTER BIDEN SEETHES \"Anyway, but that just makes me, again, it’s like, you know, because I really love, I love what she represented, and I love the fact that my dad made the decision,\" Biden added. Harris' office declined to comment to Fox News Digital. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Harris' memoir, \"107 Days,\" which offers a look inside her brief presidential campaign, has pushed the former vice president back into the spotlight as she promotes the book on tour. The tour has received mixed reviews from liberal critics.","summary":"Hunter Biden accused former Vice President Kamala Harris of trying to distance herself from the Biden administration after the release of her campaign memoir.","url":"https://www.foxnews.com/media/hunter-biden-calls-excerpts-harris-book-personally-painful-not-authentic","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/hunter-biden-kamala-harris.jpg","video":null,"publish_date":"2025-10-22 20:53:31","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"US","sentiment":0.225},{"id":371682526,"title":"Sunny Hostin Suggests She Had To Protect Son From Her Allegedly Racist White Neighbors","text":"“The View” co-host Sunny Hostin suggested on Wednesday that she had to protect her son from getting harmed by allegedly racist white neighbors.\n\nThe co-hosts discussed the killing of Ajike “AJ” Owens, a black mother who was fatally shot by her white neighbor on June 2, 2023, which prompted Hostin to say that black children are often seen as a threat in neighborhoods. Hostin said that she once brought her son into the police station to ensure that they would not “harass” him if their neighbors reported him to authorities.\n\n“As a mother of black children, I know that black boys are not given the presumption of innocence and the presumption of youth,” Hostin said. “She’s calling the police and saying they’re trying to steal her car and they’re 11 years old, they don’t know how to drive. And so for me, what was interesting was I have had to be in the position where I have gone to my local police department because I know my son is going to be training for the Junior Olympics running around the neighborhood in an all white neighborhood.”\n\n“And I have brought him to the police and said, ‘he belongs to me. This is my son. Do not harass him. Do not stop him.’ So she was doing what so many black mothers do and she was killed for protecting her child,” Hostin continued. (RELATED: Sunny Hostin Complains About Being Called A Racist On Social Media)\n\nHostin has repeatedly accused Republicans of being racist against black and Hispanic people. In November 2021, Hostin asserted that white women voted for Republican Virginia Gov. Glenn Youngkin so they could pretend slavery never happened.\n\nThe co-host also alleged that Republicans would never vote for Republican South Carolina Sen. Tim Scott as the 2024 presidential nominee because the party has a “real racism problem.” She also accused former United Nations Ambassador Nikki Haley of hiding her Indian heritage by using her nickname, despite the fact that Hostin does not go by her real name, Asuncion.\n\nMore recently, Hostin falsely accused President Donald Trump’s administration in February of ignoring illegal immigration coming from the U.S.-Canadian border because they are not Hispanic. More than half of the migrants who illegally cross the northern border are from Latin American and East Asian countries.\n\nHostin also suggested that former Vice President Kamala Harris lost the 2024 election for being a mixed-race woman. She complained about being stuck in America, calling it a “racist” country.\n\nThe co-host discovered in February 2024 that she is a descendant of Spanish slave owners who resided in Puerto Rico during an episode of PBS’ “Finding Your Roots.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'In an all white neighborhood'","url":"https://dailycaller.com/2025/10/22/sunny-hostin-accuses-white-neighbors-racism/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FScreenshot-2025-10-22-at-3.31.13%E2%80%AFPM-e1761161530366.png","video":null,"publish_date":"2025-10-22 20:12:11","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","source_country":"US","sentiment":-0.205},{"id":371682556,"title":"DAVID BOSSIE: GOP Shouldn’t Give An Inch To Democrats In Shutdown Fight","text":"The crazed “No Kings” protests around the country last weekend brought together the absolute worst of the Trump deranged people in the country and turned out to be nothing more than the latest fraud perpetrated on the American people by the radical left.\n\nThe well-funded astroturf sideshow is additional proof that the Democrat Party is coming apart at the seams, and headlines like “Violent symbolism, threats steal show at nationwide ‘No Kings’ protests” should tell us all we need to know.\n\nIn the real world, the “No Kings” operation is seen as an exhibition in dishonesty and desperation by a shrinking group of traditionally unchecked activists who are terrified by the commonsense reforms being enacted by President Donald Trump. With a straight face, the far left is trying to convince anyone who will listen that the president is a king — even in the midst of a government shutdown.\n\nIt’s so absurd we shouldn’t have to waste time on it, but these are the crazy times we live in. Hardworking taxpayers and God-fearing America loving families from coast to coast know that if President Trump were a king, the government would be open. These horrendous optics for Democrats and their Soros-funded marches are fitting for a dying movement that’s out of fresh ideas and innovative policies. (RELATED: ‘Negotiate With Us Now’: Democrats Demand GOP Bail Them Out Of Schumer-Caused Shutdown)\n\nIf nothing else, these counterproductive protests will galvanize support behind Trump’s America First agenda and the growing consensus that the left has gone too far. Let’s remember that “No Kings” is no different than the phony Occupy Wall Street sit-ins and Trump-hating Resistance efforts before it.\n\nIn fact, they’re all designed to do the same things: give the left’s professional protest industry something to do; keep angry, disillusioned people angry and disillusioned; and foment division among Americans. Make no mistake, this is an industry and a key component of the Democrat Party.\n\nOur 45th and 47th president is a citizen-politician and a once in a lifetime change agent who represents an existential threat to the failed status quo that the Democrat Party has been building methodically for the past century. Sadly, as long as the corrupt mainstream media chooses to remain an accomplice, the left’s modus operandi of cooking up false narratives like the Russia, Russia, Russia hoax, and countless others will continue.\n\nLet’s get one thing straight, the federal government hasn’t been shut down for more than three weeks because President Trump is some all-powerful despot. The government is closed because a small group of career Democrat politicians in the U.S. Senate — led by Minority Leader Chuck Schumer — feel their power slipping away and are trying urgently to appease their agitated base. (RELATED: JORGE MARTINEZ: Democrats End Up Handing Trump Huge Gift With Their Shutdown Strategy)\n\nThe American people are well-versed on the facts; and the facts are that the government remains closed today because sixty votes are needed in the Senate to pass a funding bill, and there are only 53 Republicans.\n\nThe true tyrants in this shameful episode are the likes of Democrat Sens. Schumer, Dick Durbin, and Bernie Sanders — just to name a few — who’ve been in Congress a total of 120 years. Watching this unaccountable bunch try to falsely label Trump, a twice democratically elected president, a king is simply beyond the pale.\n\nAfterall, this is the same outfit that gleefully allowed former President Joe Biden to ignore the Supreme Court and illegally pay off billions in student loans with taxpayer dollars without congressional authorization. It’s also the same con artists who turned a blind eye to the Obama and Biden administration’s weaponization of our nation’s law enforcement and intelligence agencies against President Trump.\n\nAnd lest we forget, these are the same people who coronated Kamala Harris as their 2024 nominee for president even though she didn’t receive a single primary vote.\n\nSenate Democrats manufactured a crisis over Obamacare — former President Barack Obama’s signature legislation — to justify shutting the government down. In a truly despicable act, they’ve chosen to keep the people’s work hostage if Republicans won’t agree to tack on $1.5 trillion in additional spending for enhanced COVID-era Obamacare subsidies and health benefits for illegal immigrants.\n\nThe reason Obamacare needs a bail out is because it’s not working, like so many other government programs. The truth is that since its inception in 2010, Obamacare has been ineffective at keeping health care costs down and delivering quality care.\n\nPresident Trump and Republicans in Congress are ready and willing to have an honest and transparent debate about reforming our health care system. However, this can only be accomplished if Senate Democrats finally vote to re-open the government. And any debate about the future of health care must be grounded in reality — that means acknowledging that we must stop spending at COVID-era levels four years after the China virus has ended.\n\nThe federal government spent $4.4 trillion in fiscal year 2019 and now we’re spending around $7 trillion annually. This is both reckless and unsustainable, but unfortunately only President Trump and the GOP are sounding the alarm.\n\nAmerica must return to pre-COVID spending right now or risk bankruptcy far sooner than anticipated. This starts by opening the government and holding a legitimate debate about rising health care costs and our catastrophic $37.9 trillion national debt.\n\nIf we want to fix our healthcare system while paying down the debt, it can’t be done by propping up a failed program just because it’s got Barack Obama’s name on it. Republicans must not cave to pressure from left-wing Democrats and the liberal media under any circumstances.\n\nThe GOP won’t win in 2026 and beyond by being Democrat-lite. Like President Ronald Reagan used to say — and President Trump lives by — it’s time for bold colors, not pale pastels.\n\nDemocrats are at their weakest point in recent memory; it’s time to break the back of those who exist to defend the failed status quo that’s destroying our country.\n\nThis is a fight worth having.\n\nDavid Bossie is the president of Citizens United and served as a senior adviser to the Trump-Pence 2020 campaign. In 2016, Bossie served as deputy campaign manager for Donald J. Trump for President and deputy executive director for the Trump-Pence Transition Team.\n\nThe views and opinions expressed in this commentary are those of the author and do not reflect the official position of the Daily Caller News Foundation.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Democrats are at their weakest point in recent memory'","url":"https://dailycaller.com/2025/10/22/opinion-republicans-cant-give-an-inch-to-democrats-in-shutdown-fight-david-bossie/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-2241445597-scaled-e1761158764954.jpg","video":null,"publish_date":"2025-10-22 19:27:31","author":"David Bossie","authors":["David Bossie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.274},{"id":371649238,"title":"Biden's former press secretary launches extraordinary attack on George Clooney for saying what everyone thought about ailing former president","text":"Former White House Press Secretary Karine Jean-Pierre blasted actor George Clooney in her new book for writing a high-profile essay telling Joe Biden to drop out of last year's presidential election.\n\nIn July 2024, Clooney penned a guest essay for the New York Times in which he described seeing an ailing Biden in the run-up to the election.\n\n'When I woke up, the piece was there, splayed across the pages of The New York Times. The headline? \"George Clooney: I Love Joe Biden. But We Need a New Nominee,\" Jean-Pierre wrote in in her book, Independent: A Look Inside a Broken White House, Outside the Party Lines.\n\n'I read it in disbelief.' \n\nIn the essay, Clooney wrote of a fundraiser he hosted with Biden: 'It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fundraiser was not the Joe \"big f***ing deal\" Biden of 2010. He wasn't even the Joe Biden of 2020. \n\n'He was the same man we all witnessed at the debate. ' \n\nJean-Pierre said the actor's piece came as a 'gut punch' to her old boss, whom she maintained was still fit to lead the country.\n\n'Clooney was an A-list Hollywood celebrity and a self-professed proud Democrat. His opinion was a huge deal and would draw tremendous attention from the media and the public alike,' Jean-Pierre wrote.\n\nShe also criticized decisions made by the Democratic party before Biden bowed out of the race, framing her colleagues' effort to remove him as a betrayal.\n\nClooney's calls 'may not have been a calculated jab at the party’s campaign to push out the president, but the letter lent a renewed velocity to the effort,' she wrote.\n\n'After its publication, more and more party leaders said Biden had to go.' \n\n'Though his concerns weren't completely unjustified, his assessment didn't offer the full context.' \n\nJean-Pierre also described the fundraiser Clooney hosted with Biden, which she attended. \n\n'We went through nine time zones. I was tired, and I'm decades younger than Biden, so it was understandable that he might not have been sprinting across a ballroom or at his most electric when addressing the star-studded crowd,' she wrote. \n\nJean-Pierre claimed that she did not personally witness any signs of Biden's cognitive decline and that the Democratic party effectively forced him out. \n\nShe did recognize that something was off after Biden's disastrous debate performance against Donald Trump in June 2024.\n\n'He was hoarse. He kind of looked like he was sick,' she wrote \n\nHigh-level Democrats already put off by Biden's odds then jumped at the chance to attack him, Jean-Pierre claimed.\n\n'Everything that I've been pushing back on - his age, is he fit - like automatically anytime he would sneeze or have a runny nose or something would happen, that would be where the questions would go,' she wrote. \n\nStill, she maintained that she saw no reason to doubt the president ability to serve. \n\nAside from Clooney, Jean-Pierre blamed high-ranking Democrats like Nancy Pelosi for the disunity and disloyalty within the party.\n\nThe book's title is a reference to how the former press secretary no longer identifies as a Democrat, but as an Independent. \n\nIt comes after months after Jake Tapper co-authored a book about Biden's decline. \n\nDozens of unnamed sources who spoke with the CNN star suggested members of the party for months attempted to cover-up the then-president's cognitive decline. \n\n'The President appeared severely diminished, as if he’d aged a decade since Clooney last saw him, in December, 2022,' Tapper and co-author Alex Thompson wrote. The book came out in May. \n\nKamala Harris, in her own memoir, wrote that it was 'reckless' for Biden to run for re-election in 2024 and that his handling of the race endangered her campaign.","summary":"Karine Jean-Pierre blasted actor George Clooney in for writing a high-profile essay telling Joe Biden to drop out of last year's presidential election.","url":"https://www.dailymail.co.uk/media/article-15217101/karine-jean-pierre-george-clooney-joe-biden.html","image":"https://i.dailymail.co.uk/1s/2025/10/22/18/103225407-0-image-m-51_1761154794974.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/10/21/7213838508860132980/1024x576_MP4_7213838508860132980.mp4","publish_date":"2025-10-22 18:57:58","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.309},{"id":371643238,"title":"DNC pays off $1.6M in debt for Kamala Harris’ failed campaign as Dems face tight race in New Jersey","text":"WASHINGTON — The Democratic National Committee (DNC) is still paying off shortfalls incurred by former Vice President Kamala Harris’ failed 2024 election campaign — with at least $1.6 million paid out in September alone, according to the latest federal filings.\n\nThe Harris campaign shelled out $1.49 million alone for media production and consulting, $106,312 for data services and $21,762 to rent space at a Grand Rapids, Mich. community center for an October 2024 event alongside billionaire investor Mark Cuban touting the Democratic nominee as the “pro-business candidate.”\n\nLast month’s payouts push the total debt covered since Election Day to more than $20 million, according to Axios, which first reported on the Federal Election Commission (FEC) filings. \n\nIt’s unclear how much more debt remains to be settled.\n\nFormer President Barack Obama’s successful 2012 campaign incurred a similar level of debt that the DNC three years to fully pay off, with former chairwoman Donna Brazile claiming the 44th commander-in-chief’s “neglect had left the party in significant debt.”\n\nHarris made a “handshake deal” with the national party after Donald Trump defeated her this past November, under which the DNC agreed to cover $20.5 million in outstanding campaign bills, The New York Times reported in August.\n\nThose debts included costs of internal polling, consulting, flights and production companies — some of which helped put on star-studded concerts as well as campaign events that featured Harris with the likes of Beyonce and Megan Thee Stallion.\n\nHarris spent a whopping $1.5 billion during her 107-day sprint to Election Day after President Biden suspended his re-election campaign July 21, 2024, only to lose all seven critical swing states to Trump.\n\nThe fundraising totals for the 2024 election nearly broke the all-time record from four years prior, with both campaigns raising a combined $2.5 billion.\n\nBut as of June, DNC officials were openly expressing concern that the party was so cash-strapped that it could have to borrow more money just to keep the lights on.\n\nSome megadonors — including billionaires such as media mogul Barry Diller and Michael Bloomberg, the former Republican mayor of New York City — were also slamming their pocketbooks shut.\n\n“There is just a broad consensus that the DNC is ineffectual and not where we should be giving money,” one longtime ex-donor told The Post in June.\n\nThe following month, FEC filings for the first half of 2025 showed the Republican National Committee had racked up $96,419,883 in contributions and registered $80,782,884 cash on hand, dominating the DNC’s $69,224,921 in donations and $15,220,609 war chest.\n\nThe DNC currently has $11,974,008 cash on hand, and has pumped at least $3.5 million into a closely watched gubernatorial race in New Jersey, a deep blue state where no Republican has won the governorship since 2013. \n\nReps for the DNC and Harris did not immediately respond to a request for comment.","summary":"Former President Barack Obama's 2012 campaign resulted in a similar level of debt that the DNC had to pay off over the next few years, which hurt Hillary Clinton's candidacy, according to some Democrats.","url":"https://nypost.com/2025/10/22/us-news/dnc-pays-off-1-6m-in-debt-for-kamala-harris-failed-campaign-as-democrats-face-tight-race-in-new-jersey/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/113973990.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/37iNWGZM-RyIcpnTz.mp4","publish_date":"2025-10-22 18:30:12","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","source_country":"zm","sentiment":-0.044},{"id":371640720,"title":"Fox News rages over Jen Psaki’s ‘disturbing’ comments about JD Vance’s wife Usha: ‘Outright slander!’","text":"Fox News hosts and pundits are absolutely apoplectic over MSNBC star Jen Psaki’s recent remarks about Usha Vance, accusing the former Biden spokeswoman of “slander” for mocking Vance’s marriage to the vice president and joking that the Second Lady should send a sign for help.\n\n“She should apologize,” Fox & Friends host Lawrence Jones declared Wednesday morning while the other hosts described Psaki’s comments as “disturbing.”\n\nIn a recent appearance on the liberal podcast I’ve Had It, Psaki – a primetime host at MSNBC who once served as the White House press secretary in the Joe Biden administration – spoke at length about how she was more worried about JD Vance than Donald Trump.\n\nDuring her conversation with hosts Jennifer Welch and Angie “Pumps” Sullivan, Psaki noted that the veep “wants to be president more than anything else” while claiming both Vance’s youth and ambition make him “scarier in certain ways” than the 79-year-old president.\n\n“He’s willing to do anything to get there,” she declared, labeling the 41-year-old vice president a “little Manchurian candidate” who is “agile in the sense that he is a chameleon who makes himself into whatever he thinks the audience wants to hear from him.” \n\nDuring the back-and-forth over the vice president’s political future, Psaki brought up the second lady and snarked that she wonders if their marriage is in a good place. \n\n“I always wonder what’s going on in the mind of his wife,” Psaki quipped. “Like, are you OK? Please blink four times. Come over here – we’ll save you.”\n\nThat moment soon went viral in the conservative corners of social media, drawing predictable rage from prominent MAGA influencers and commentators. \n\n“Unhinged Jen Psaki is now smearing JD Vance, suggesting that his wife, Usha, wants to leave her husband and offers to ‘save’ her,” anti-trans social media account Libs of TikTok – which is run by Trump ally Chaiya Raichik – posted on X. “@MSNBC should be ashamed to pay her salary.”\n\nWith others fuming about Psaki’s “disgusting comments” while claiming they were “an insult to women who are in actual bad marriages,” Fox News commentator Joe Concha declared online that the ex-Biden flack was “not a good person” before taking his grievances to the airwaves.\n\n“This is a national primetime host and former White House press secretary. She is engaging in outright slander,” Concha exclaimed on Wednesday’s broadcast of Fox & Friends First, before invoking MAGA’s favorite insult for Psaki.\n\n“I mean, Peppermint Patty here is just making stuff up and has zero idea what she’s talking about,” the Fox News pundit huffed. “She can’t argue about policy, so she’s resorting to fabricated personal attacks.”\n\nMoments after derisively comparing the MSNBC host to a cartoon character, meanwhile, Concha lamented that it’s “such a toxic time right now” and how “we just have personal attacks and ad hominem stuff.” \n\nThe hosts of the president’s favorite morning show also took their turns slamming Psaki, with the Fox & Friends crew describing the remarks as “so nasty” and “disturbing” before Jones demanded an apology from the rival cable news host.\n\n“I would not hold your breath,” co-host Brian Kilmeade – who recently issued his own mea culpa over his inflammatory remarks about homeless people – reacted.\n\nDuring Tuesday’s telecast of America’s Newsroom, right-wing radio talk show host Hugh Hewitt – who is also a Fox News contributor – asserted that Psaki likely felt she was in a “safe space” to take shots at the Vances because she was on a podcast that appeals to the “far-left edge of the Democratic Party.”\n\nHewitt, who was previously a paid commentator for MSNBC, claimed that Psaki’s remarks indicated that the “left is out of ideas” as they have “no substance” and can only resort to “insults.” He further insisted that appearing on the I’ve Had It podcast was merely a way for Psaki to “engage clicks to let people know she is still” at MSNBC as it transitions to the upcoming MS NOW rebrand.\n\nAmid the right-wing media backlash over Psaki’s comments, the White House also made sure to add its voice to the mix. White House communications director Steven Cheung, who regularly replicates his boss’ bombastic “lib owning” tone, blasted Psaki’s comments while branding her his own Trumpian nickname.\n\n“Jen Psuki must be transferring her own personal issues onto others,” he Cheung wrote on X, adding that she is “a dumba** who has no comprehension of the truth and has to overcompensate for her lack of talent by saying untrue things. Circle back on that, moron.”\n\nMeanwhile, during Wednesday’s segments about Psaki, the network’s hosts suggested that conservatives and Fox News personalities largely avoid taking shots at political spouses or vice presidents.\n\n“I think another rule in general is don't go after the spouse. Why would you do that? It is not helpful,” anchor Dana Perino said during her conversation with Hewitt. \n\nAdditionally, towards the end of the Fox & Friends First discussion with Concha, co-host Todd Piro pondered the media reaction if Kayleigh McEnany – a former Trump spokesperson who now hosts multiple Fox News shows – would have “attacked Kamala Harris.”\n\nHowever, the conservative cable giant’s stars have long gone after the wives and families of Democratic presidents and elected officials. Michelle Obama, for instance, was a regular target of Fox News and the conservative media ecosystem throughout her husband’s presidency and in the years since.\n\nOn top of that, before John Fetterman became Fox News’ favorite Democrat, the network’s right-wing opinion hosts regularly took aim at his wife Giselle during Fetterman’s Senate run in 2022 – suggesting that she was pushing her husband to stay in the race following his stroke.\n\n“There was the effort to frame this as some brave and vulnerable act. Not anything that would be considered craven or a cruel political calculation by a stage wife and political nihilist,” Fox News host Laura Ingraham declared at the time, while her colleague Jesse Watters wondered if “the bisexual Brazilian immigrant [had] been vetted.”\n\nAs for McEnany, she has regularly lobbed attacks at Harris, saying just last month that the former vice president and Democratic presidential nominee refused to take accountability for her own “incompetence.”","summary":"‘I always wonder what’s going on in the mind of his wife,’ Jen Psaki snarked recently. ‘Like, are you OK? Please blink four times. Come over here – we’ll save you.’","url":"https://www.independent.co.uk/news/world/americas/us-politics/fox-news-jen-psaki-usha-vance-b2850339.html","image":"https://static.independent.co.uk/2025/10/22/17/10/Screenshot-Capture-2025-10-22-12-46-50.png?crop=1021.5,681,x81.7,y0&trim=0,82,0,81&width=1200","video":"https://cdn.jwplayer.com/videos/daZdQNyB-4VHSaSK0.mp4","publish_date":"2025-10-22 18:14:19","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.077},{"id":371649880,"title":"Trump Campaigned on Free Speech. That Isn't How He's Governed.","text":"The Constitution's First Amendment protects free speech for good reason.\n\nIf people can't say what they want, we don't have honest debate.\n\nI was relieved when Donald Trump, campaigning for the presidency, said, \"If we don't have free speech, then we just don't have a free country!\"\n\nGood for him. Free speech is crucial to freedom.\n\nDemocrats, by contrast, had been eagerly censoring. During COVID-19, they threatened social media companies, ordering them to censor the internet.\n\n\"They are directly speaking to millions!\" complained Kamala Harris, \"without any level of oversight, and that has to stop!\"\n\nFortunately, once Trump was reelected, he told his staff: \"Stop all government censorship.\"\n\nBut now that Trump's president, and getting lots of criticism from the media, he's started calling speech that he doesn't like \"illegal.\"\n\n\"They'll take a great story, and they'll make it bad. I think that's really illegal, personally.\"\n\nHe also threatened TV stations: \"They give me only bad publicity…maybe their license should be taken away.\"\n\n\"There's free speech, and then there's hate speech,\" said his attorney general, Pam Bondi. \"We will absolutely target you…if you are targeting anyone with hate speech.\"\n\nThey will \"target\" people?\n\nTrump's Federal Communications Commission (FCC) chairman, Brendan Carr, joined in. When Jimmy Kimmel said nasty and incorrect things about Charlie Kirk's murder, Carr threatened ABC's TV licenses, saying, like a mafia boss, \"We can do this the easy way or the hard way.\"\n\nYet months earlier, he'd tweeted: \"Dismantle the censorship cartel and restore free speech rights.\"\n\nAnd years earlier, he tweeted that the FCC does \"not have a roving mandate to police speech in the name of the 'public interest.'\"\n\nHe was right—then.\n\nBut power tends to corrupt.\n\nOnce Carr was in power, he no longer supported the speech he'd recently promoted.\n\nFortunately, some Republicans pushed back.\n\nSen. Rand Paul (R–Ky.): \"Brendan Carr has got no business weighing in on this.\"\n\nSen. Ted Cruz (R–Texas): \"I like Brendan Carr, but what he said there is dangerous as hell.\"\n\nCarr and Bondi later \"clarified\" their comments. Carr said his \"easy way or hard way\" comment was not a threat to pull licenses. Bondi said hate speech itself won't be prosecuted.\n\nBizarrely, Democrats suddenly became free speech advocates.\n\n\"Reject the government's attempt to weaponize this moment into an all-out assault on free speech,\" said Rep. Alexandria Ocasio-Cortez (D–N.Y.).\n\nBut wait. When her party was in power, Ocasio-Cortez wanted government to \"rein in our media environment so that you can't just spew disinformation!\"\n\nAnd \"rein in\" is exactly what Democrats tried to do, often succeeding.\n\nFacebook's Mark Zuckerberg complained that Biden administration officials \"would call up our team and scream at them….All these different agencies and branches of government basically just started investigating, coming after our company. It was brutal!\"\n\nWhoever is in power likes to use that power to shut the other side up.\n\nIn America, no government has the right to censor.\n\nPoliticians eager to shut the other side up should have paid attention to Charlie Kirk when, just a few months before he was killed, he said: \"You should be allowed to say outrageous things! You should be allowed to say contrarian things….That is the bedrock of a liberal democracy.\"\n\nCOPYRIGHT 2025 BY JFS PRODUCTIONS INC.","summary":"Politicians across the aisle love free speech—until they're in power.","url":"https://reason.com/2025/10/22/trump-campaigned-on-free-speech-that-isnt-how-hes-governed/","image":"https://reason.com/wp-content/uploads/2025/10/john-stossel-free-speech-1200x675.png","video":null,"publish_date":"2025-10-22 18:05:38","author":"John Stossel,Shawn Regan","authors":["John Stossel","Shawn Regan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.598},{"id":371669628,"title":"How the Supreme Court made Trump's $230 million 'shakedown' possible","text":"On Tuesday, October 21, the New York Times reported that President Donald Trump \"is demanding that\" the U.S. Department of Justice (DOJ) \"pay him about $230 million in compensation for the federal investigations into him.\"\n\n Discussing the matter in the White House Oval Office that day, Trump told reporters, \"It's awfully strange to make a decision where I'm paying myself…. But I was damaged very greatly, and any money I would get I would give to charity.\"\n\nIn 2024, Trump was the first presidential candidate in U.S. history to receive his party's nomination despite facing four criminal indictments — two prosecuted by then-special counsel Jack Smith for DOJ, one prosecuted by Manhattan District Attorney Alvin Bragg Jr., and one prosecuted by Fulton County, Georgia DA Fani Willis. Bragg's hush money/falsified business records case was the only one that went to trial, and Trump was convicted on 34 felony counts. But all of the cases were doomed when Trump narrowly defeated Democratic nominee Kamala Harris by roughly 1.5 percent.\"\n\nPrevious DOJ investigations of Russian interference in the 2016 presidential election did not result in any indictments of Trump, although he is arguing that they hurt him nonetheless.\n\nIn an article published on October 22, Mother Jones' Pema Levy argues that the U.S. Supreme Court helped pave the way for Trump's $230 million demand.\n\n\"President Donald Trump is demanding that the Justice Department transfer $230 million in taxpayer dollars into his own personal bank account,\" Levy writes. \"He can do this, because thanks to the Supreme Court's recent decisions, the executive branch could accurately be described by King Louis XIV — L'état, c'est Trump. At first you might think, 'Can he do that? Can he just shakedown the DOJ for roughly a quarter of a billion dollars?' And then you think about the Supreme Court opinions under Chief Justice John Roberts, in which the Court has shifted the fundamental structure of American government such that federal agencies, including the Justice Department, are mere extensions of the president's will.\"\n\nIn the High Court's 6-3 ruling in Trump v. the United States, six GOP-appointed justices ruled that U.S. presidents enjoy absolutely immunity from prosecution for \"official acts\" committed in the White House but not for \"unofficial acts.\" Barack Obama-appointed Justice Sonia Sotomayor, in her scathing dissent, warned that SCOTUS was giving way too much power to the federal government's executive branch — and that a future president could order Navy SEALs to assassinate of a political rival, claim it was an \"official\" act, and get away with murder. In his analysis of the ruling for The Nation, progressive legal expert Elie Mystal said that the ruling was dangerous because it gave presidents \"absolute immunity\" rather than merely \"qualified immunity.\" \n\n\"The colossal cash transfer he is demanding is being described as compensation for investigations the Department (of Justice) launched into Russia's interventions in the 2016 election and Trump's absconding with classified documents after his first term,\" Levy explains. \"Now that he's back in the White House, Trump plans to make the government pay for its appropriate use of its ability to investigate and prosecute to safeguard our democracy. And he grasps the fact that he has the absolute power to do that…. Roberts can claim that he's expanding democratic accountability. But at this point, we can all see the mess he's created. A man who takes from the voters to line his pockets is not feeling all that accountable to anyone.\"\n\nRead Pema Levy's full article for Mother Jones at this link.","summary":"On Tuesday, October 21, the New York Times reported that President Donald Trump \"is demanding that\" the U.S. Department of Justice (DOJ) \"pay him about $230 million in compensation for the federal investigations into him.\"\n\n\n Discussing the matter in the White House Oval Office that day, Trump told reporters, \"It's awfully strange to make a decision where I'm paying myself…. But I was damaged very greatly, and any money I would get I would give to charity.\"\n\nIn 2024, Trump was the first presidential candidate in U.S. history to receive his party's nomination despite facing four criminal indictments — two prosecuted by then-special counsel Jack Smith for DOJ, one prosecuted by Manhattan District Attorney Alvin Bragg Jr., and one prosecuted by Fulton County, Georgia DA Fani Willis. Bragg's hush money/falsified business records case was the only one that went to trial, and Trump was convicted on 34 felony counts. But all of the cases were doomed when Trump narrowly defeated Democratic nominee Kamala Harris by ro","url":"https://www.alternet.org/trump-doj-supreme-court/","image":"https://www.alternet.org/media-library/image.jpg?id=61784619&width=1200&height=600&coordinates=0%2C39%2C0%2C39","video":null,"publish_date":"2025-10-22 17:48:53","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.395},{"id":371629978,"title":"Kamala’s Costly Campaign Debt Drags Democrats Down As GOP Fundraising Surges Ahead","text":"The Democratic National Committee (DNC) is heading into the midterm cycle at a steep financial disadvantage versus Republicans, hamstrung by lingering debt from former Vice President Kamala Harris’s 2024 presidential campaign and lackluster donor enthusiasm.\n\nThe Republican National Committee (RNC) brought in $10.7 million in September and holds $86 million in cash reserves, according to the latest fundraising totals released this week. By contrast, the DNC raised $10.3 million and had just $12 million on hand.\n\nPart of the challenge stems from debt left hanging after Harris’s failed presidential bid, which burned through $1.5 billion in an astonishingly short 107 days. The DNC paid $1.6 million in September alone to cover campaign obligations, bringing its total repayments tied to Harris’s campaign to more than $20 million so far, according to Axios. (RELATED: Democrats Ask For Money While Blaming Trump, GOP For Shutdown)\n\nThe fundraising gap underscores deep frustration among donors with the DNC’s direction. Earlier this year, most top donors snubbed a San Francisco fundraiser featuring Harris, forcing the party to scramble for a host and ultimately raising far less than expected, people familiar with the event told The Wall Street Journal.\n\nThe DNC has also struggled with internal turmoil since its crushing presidential defeat, split between its progressive wing and more moderate members.\n\nDavid Hogg, a gun control activist elected as one of the DNC’s vice chairs in February, faced backlash from other Democrats after proposing primary challenges against incumbent Democrats and was removed from his post in June. Leaked audio from June revealed that DNC Chair Ken Martin questioned his own leadership abilities amid internal conflicts triggered by Hogg’s efforts, Politico first reported.\n\nMeanwhile, some top Democratic officials have become increasingly upset with some of their party leaders, including Martin, for not doing enough to back Democratic Socialist Zohran Mamdani’s mayoral campaign in New York City, Axios reported. Key figures such as House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer have yet to endorse Mamdani, less than two weeks from Election Day.\n\nDemocratic House and Senate committees are outperforming the national party, with the Democratic Senatorial Campaign Committee outraising the National Republican Senatorial Committee by nearly $2 million in the third quarter of 2025.\n\nMajor Democratic donors are also channeling funds to individual candidates rather than the national committee. Virginia gubernatorial candidate Abigail Spanberger and Mikie Sherrill in New Jersey have raised significant sums, while some Senate candidates in battleground states like Georgia are reporting strong fundraising results. Democrats have also poured considerable resources into efforts to redraw California’s congressional maps.\n\nThe DNC did not respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Debt left hanging by failed Harris bid'","url":"https://dailycaller.com/2025/10/22/kamala-campaign-debt-drags-democrats-down-gop-fundraising-surge/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F10%2FGettyImages-2162789021-scaled-e1761146295270.jpg","video":null,"publish_date":"2025-10-22 17:07:53","author":"Melissa O'rourke","authors":["Melissa O'rourke"],"language":"en","category":"politics","source_country":"us","sentiment":-0.104},{"id":371643642,"title":"The Trump regime wants to make America white again","text":"I spend more time arguing with proud nativists in bars around DC than I would like. You might be surprised how blatantly some spout their horror of the US’s ethnic diversity. But these conversations are an indication of the toxic cauldron that is bubbling away inside the Trump administration.\n\nIt’s not long before well-read Maga-ites – and I encounter more literate people on the right than the left – ask whether I’ve read David Hackett Fischer’s Albion’s Seed (1989), which traces American culture back to the English counties from which the first colonists came. The implication is that the US must restore its old ethnic make-up in order to be truly American again. They see the United States as defined by its Anglo-European ancestry and therefore a non-European United States is no longer America. Donald Trump seems to agree: a thread running through the past eight months is the attempt to restore that European heritage.\n\nAmerica’s leaders have always grappled with how to distinguish the US from the many countries this nation of immigrants is made from. Language has long been the subject over which this battle is fought.\n\nA problem for the US’s Founding Fathers was fashioning a distinct national identity apart from Britain, even though they shared a common language with the mother country. The Marquis de Chastellux reported in 1780 that some Bostonians wanted to make Hebrew the official language. In 1795, the House narrowly voted down a proposal that all its proceedings be printed in German as well as English. Congress had to satisfy itself by renaming English as the “language of the United States”. The great lexicographer Noah Webster wrote in 1789 that as an “independent nation, our honour requires us to have a system of our own, in language as well as government. Great Britain, whose children we are, and whose language we speak, should no longer be our standard.”\n\nSo much for Webster in Trump’s America. The idea that the US is exclusively defined by its English or sometimes European heritage – and therefore not other cultures – has been building for some time on the American right. This nativism increasingly means conceiving of the US as an Anglo-Saxon creation with a single language. By 1988, 17 states had voted to make English the official tongue in response to the wave of Asian and Hispanic immigration that ramped up after 1965. But it is Trump who has gone the furthest.\n\nIn March, he symbolically declared English the official language of the US. His executive order said this was necessary to secure a “unified and cohesive society”. Trump has re-proclaimed Leif Erikson Day – to memorialise the Viking said to be the first European to set foot on continental North America – and has commemorated Christopher Columbus Day without doing the same for Indigenous People’s Day. Imagine how different this would be if Kamala Harris had won the presidency. (In 2021, she said Columbus’s expedition to America “ushered in” part of the US’s “shameful past”.)\n\nWhat might seem like a redundant fight over a nation’s symbols is backed up by real policy. The New York Times has reported that the administration wants to prioritise refugees from European countries, particularly those suppressed for supporting populism and opposing immigration. At the same time, the administration sees “immigrants’ rights” as an oxymoron.\n\nThere are now calls for naturalised American citizens to be denied the same rights as the native born. The Maga congresswoman Nancy Mace has suggested that Ilhan Omar, a fellow member of Congress, be deported back to Somalia, where she was born. Laura Loomer, an online activist the president listens to, has called for Muslims to be banned from standing in Congress. “Why do we even have Muslims in Congress?” she tweeted. “What a stain on our country.”\n\nOr consider the right’s reaction to the announcement that Bad Bunny, a Puerto Rican rapper whose lyrics are mostly in Spanish, will headline the Super Bowl’s half-time show at the start of next year. Remember that Puerto Rico is part of the US. Trump called the decision “ridiculous” and Maga influencer Benny Johnson complained there would be “no songs in English”. A counter-programme called the All-American Halftime Show is being put on instead. On its website, attendees are asked what music they would like to hear. One of the options is “anything in English”.\n\nThe progressive congressman Ro Khanna said to me earlier this year that Trump and his vice-president, JD Vance, want to turn America into “another ordinary nation”. In other words, they want to get rid of the idea that anyone who believes in US ideals can become American in favour of a country for those who can prove that their American lineage goes back generations. I suspect Vance would have little to disagree with in Khanna’s characterisation. As Vance put it in July, those who fought in the Civil War have a “have a hell of a lot more claim over America” than progressive liberals.\n\nThe question is, how far is the administration willing to go to make its vision for America a reality? It calls to mind Fritz Stern’s line on conservative revolutionaries wanting to “destroy the despised present in order to recapture an idealised past in an imaginary future”. \n\n[Further reading: Give Donald Trump the credit]","summary":"Maga is calling for naturalised citizens to be denied the same rights as US-born ones","url":"https://www.newstatesman.com/world/americas/north-america/us/2025/10/the-trump-regime-wants-to-make-america-white-again","image":"https://dl6pgk4f88hky.cloudfront.net/2025/10/22/00029102.jpg","video":null,"publish_date":"2025-10-22 16:54:41","author":"Freddie Hayward","authors":["Freddie Hayward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.109},{"id":371614802,"title":"Two Trump allies are getting a brutal dose of reality from the far right: analysis","text":"During the United States' 2024 presidential race, prejudice and racism against Indians and Indian-Americans wasn't hard to find.\n\nMAGA influencer Laura Loomer's comments attacking Democratic nominee Kamala Harris' mother, a native of India, were so offensive that even far-right Rep. Marjorie Taylor Greene (R-Georgia) called her out. And after Donald Trump chose now-Vice President JD Vance as his nominee, white nationalist Nick Fuentes attacked Vance for being married to an Indian-American woman, Usha Vance.\n\nBefore businessman Vivek Ramaswamy dropped out of the 2024 GOP presidential primary and endorsed Trump, some Christian nationalists argued against nominating him because he's a Hindu.\n\nIn a late October article, Salon's Sophia Tesfaye cites Ramaswamy and FBI Director Kash Patel as two examples of \"top MAGA foot soldiers\" who are getting a brutal dose of reality thanks to far-right racism against Indians and Indian-Americans.\n\n\"On Monday, (October 20),\" Tesfaye explains, \"FBI Director Kash Patel posted a simple message on X to mark Diwali. The first Indian-American to lead the FBI, Patel is a practicing Hindu who took his oath of office earlier this year with his hand resting on the Bhagavad Gita. After sharing the holiday's message of hope, light and goodness, the New York-born Patel faced a wave of online hate, including calls for him to 'go back to India.' Conservative podcaster Steven Crowder shared Patel's message with 'Could we not?'\"\n\nTesfaye continues, \"Right-wing pastor and podcaster Joel Webbon's reply was more blunt: 'Go back home and worship your sand demons. Get out of my country.' Another MAGA supporter asked why Patel was 'betraying Charlie Kirk.'\"\n\nThe Salon journalist notes that the Trump White House was \"swarmed by anti-Indian prejudice\" for hosting a Diwali event scheduled for November.\n\n\"MAGA-aligned Vivek Ramaswamy, the Republican candidate for governor in Ohio, faced similar attacks from the right,\" Tesfaye observes. \"On Monday, disparaging comments targeting Ramaswamy resurfaced from Paul Ingrassia, Trump's controversial nominee to lead the White House Office of the Special Counsel, who said in January 2024, 'Never trust a chinaman or Indian. NEVER.' After Ingrassia's comments were revealed, at least four Republican senators, including Senate Majority Leader John Thune of South Dakota, yanked their support for the nominee, whose confirmation hearing was scheduled for Thursday. Ingrassia withdrew his nomination late Tuesday.\" \n\nTesfaye adds, \"Ingrassia's messages were part of thousands of leaked texts from over 350 Young Republican operatives in a Telegram group chat that was exposed by Politico, revealing a culture steeped in racist, antisemitic and misogynistic language.\"\n\nTesfaye emphasizes that those Young Republicans on Telegram \"weren't anonymous trolls,\" but rather, \"held official roles in campaigns, government offices and influential conservative organizations.\"\n\n\"Republicans like to pretend that so-called woke liberals are the real racists,\" Tesfaye notes, \"but this rhetoric and behavior undermines that notion…. For Indian-Americans in the MAGA movement, even their conservative identity will not shield them.\"\n\nSophia Tesfaye's full article for Salon is available at this link.","summary":"During the United States' 2024 presidential race, prejudice and racism against Indians and Indian-Americans wasn't hard to find.\n\nMAGA influencer Laura Loomer's comments attacking Democratic nominee Kamala Harris' mother, a native of India, were so offensive that even far-right Rep. Marjorie Taylor Greene (R-Georgia) called her out. And after Donald Trump chose now-Vice President JD Vance as his nominee, white nationalist Nick Fuentes attacked Vance for being married to an Indian-American woman, Usha Vance.\n\nBefore businessman Vivek Ramaswamy dropped out of the 2024 GOP presidential primary and endorsed Trump, some Christian nationalists argued against nominating him because he's a Hindu.\n\nIn a late October article, Salon's Sophia Tesfaye cites Ramaswamy and FBI Director Kash Patel as two examples of \"top MAGA foot soldiers\" who are getting a brutal dose of reality thanks to far-right racism against Indians and Indian-Americans.\n\n\"On Monday, (October 20),\" Tesfaye explains, \"FBI Director Kash Patel posted a s","url":"https://www.alternet.org/patel-ramaswamy-maga-racism/","image":"https://www.alternet.org/media-library/image.jpg?id=61877183&width=1200&height=600&coordinates=0%2C710%2C0%2C711","video":null,"publish_date":"2025-10-22 16:38:00","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":0.024},{"id":371647510,"title":"Kamala Harris, Chimamanda Ngozi Adichie to Appear Together at the London Literature Festival","text":"Tomorrow, October 23, U.S. Vice President Kamala Harris and Nigerian author Chimamanda Ngozi Adichie will share a stage at the London Literature Festival for what’s billed as ‘a conversation.’\n\nOn one side is Kamala, former U.S. Vice President who once ran one of the most closely watched campaigns in modern politics. On the other side is Chimamanda, a novelist and feminist voice whose words have travelled from Lagos to all over, shaping how a generation thinks about gender, power, and identity.\n\nIt’s a pairing that feels both unexpected and oddly inevitable. One built her influence through political grit; the other through literary skill, yet both women understand the weight of visibility and what it means to lead serious conversations.\n\nKamala’s Side of the Table\n\nKamala Harris has been on the road since late September, promoting her new memoir ‘107 Days’. It’s a retelling of her 2024 presidential run, which was short-lived, bruising, and deeply personal. For many Democrats still trying to make peace with the party’s loss to Donald Trump, the book reads like both a confession and a comeback plan.\n\nIn the memoir, Harris revisits what went wrong. She writes about loyalty, how she stood by the Bidens and how that loyalty was not returned. She admits the pressure of running a campaign while trying to distance herself from an unpopular administration, and for once, she lets readers in on the emotional cost: the exhaustion, the strain on her marriage, and the loneliness of being both the first and the fall guy.\n\nHer tone on tour has been different, too, as seen in excerpts from TikTok. She’s less defensive, more reflective. The politician who once struggled to connect feels more human on stage, maybe because she’s finally telling her story without a teleprompter and without the noise of Washington. Maybe because, in her own way, she’s learning that vulnerability can be a kind of power too.\n\nChimamanda’s Side of the Table\n\nAcross from her would sit Chimamanda Ngozi Adichie, a woman who has built her career around using words to reimagine power. Her latest novel, Dream Count, is an exploration of desire, identity, and the struggle of integration in America; themes that sound nothing like politics until you realise they are.\n\nFor years, Chimamanda has balanced the art of storytelling with activism. Her feminism isn’t loud for the sake of volume; it’s precise and sometimes polarising. \n\nThrough fiction, she’s documented how politics moves through people, how love, grief, and migration can be political acts in themselves.\n\nHer relationship with politics isn’t straightforward either. She has been outspoken about Nigeria’s social structure, especially the barriers facing women in leadership. She also writes from a place of emotional truth rather than policy. If Harris represents power by office, Chimamanda represents power through influence.\n\nRead Also: Chimamanda Just Got a Mermaid Award, But What Does That Even Mean?\n\nAt first glance, Kamala and Chimamanda might not seem to have much in common. One writes speeches, the other writes stories. One lost an election, the other won the literary world. But put them on the same stage, and suddenly the distance between fiction and politics doesn’t feel that wide.\n\nBoth women have learned how it feels to be reduced, Kamala by headlines, Chimamanda by think pieces. Both have been called too much in spaces built to keep women contained, and both, in their own ways, have had to answer the same question: how do you stay powerful when the world decides your power is inconvenient?\n\nMaybe that’s what makes this conversation something more interesting to look forward to. It’s not really about their books. It’s about what happens when two women who have spent their lives explaining themselves finally get to be in control of their own narratives.\n\nThey come from different corners, yet both know what it means to hold an audience, to command attention, to make people feel something. Policy or storytelling, both are fluent in persuasion. Tomorrow’s conversation might promise more than just small talk.","summary":"Kamala Harris, Chimamanda Ngozi Adichie to Appear Together at the London Literature Festival","url":"https://www.pulse.ng/articles/lifestyle/chimamanda-adichie-kamala-harris-london-literature-festival-2025102215040096879","image":"https://image.api.sportal365.com/process/smp-images-production/pulse.ng/22102025/4c77cb13-278a-438f-b192-55846cdafa61.png","video":null,"publish_date":"2025-10-22 15:32:00","author":"Gift Davies","authors":["Gift Davies"],"language":"en","source_country":"ng","sentiment":0.215},{"id":371607734,"title":"Joe Concha suggests Karine Jean-Pierre’s low book sales are due to ‘credibility’ problem","text":"“Twenty-four thousand on Amazon. Boy, that’s a hard thing to do when you’re on five major networks for five days and still everyone is saying ‘I don’t want to be part of this,’” Concha added, referring to the number of Independent copies sold as of Tuesday.\n\nDuring her media tour, Jean-Pierre has stood by former President Joe Biden, claiming that she “never saw anyone who wasn’t there” but instead saw Biden as “someone who was always engaged.” \n\nJean-Pierre has faced pushback from even ardent Biden supporters. While interviewing Jean-Pierre Monday, late-night talk show host Stephen Colbert described Biden during the time of his presidential debate last year as a “dramatically different person” than he was earlier in his campaign. Jean-Pierre admitted Biden had “aged,” which affected his debate performance with Trump.\n\nThis contrasts with former Vice President Kamala Harris, who has seen significantly higher book sales of her book, 107 Days, in which she openly questions Biden’s mental acuity. Publisher Simon & Schuster reported that the book sold over 350,000 copies in its first week, resulting in a fifth printing of hardcover copies.\n\nHarris expressed her regret in not vocally opposing Biden’s decision to run for reelection, writing, “the stakes were simply too high.”\n\n“This wasn’t a choice that should have been left to an individual’s ego, an individual’s ambition,” Harris wrote of Biden.","summary":"Washington Examiner Senior Writer Joe Concha mocked former White House press secretary Karine Jean-Pierre for the “hard” accomplishment of selling just over 20,000 copies of her book, Independent, on Amazon. “She has been on every network that isn’t Fox News over the last five days, getting ample time, where we’re talking ABC, CNN, MSNBC, and [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3859468/joe-concha-suggests-karine-jean-pierre-book-sales-due-to-credibility-problem/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP25255528519465.jpg?w=696","video":null,"publish_date":"2025-10-22 15:17:46","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","category":"politics","source_country":"US","sentiment":-0.235},{"id":371584466,"title":"NJ GOP voter registration numbers surge ahead of hotly contested governor race","text":"The number of registered Republicans in New Jersey grew by nearly 31,000 this year — while the number of registered Democrats dropped by more than 11,000, new data shows. \n\nDemocrats still hold the overall edge in the Garden State, with a total of 2,525,346 registered voters compared to 1,670,297 registered Republicans and 2,340,583 unaffiliated voters.\n\nNew Jersey residents had to register to vote by Oct. 14 to be able to cast their ballot in the closely watched governor’s race between Democrat Mikie Sherrill and Republican Jack Ciattarelli.\n\n“After 25 years of a Democrat-controlled legislature and eight years of Phil Murphy, New Jersey voters have had it. Mikie Sherrill will be more of the same, but worse,” Ciattarelli campaign strategist Chris Russell told The Post in response to the new numbers.\n\n“The state is unaffordable, overdeveloped, and far-left policies are negatively impacting our schools and the safety of our communities. It’s time for change, and Jack Ciattarelli is that change.”\n\nDuring the first two weeks of October, Republicans brought in 2,250 new registered voters, while the Democrats gained 1,478 and 13,062 registered as unaffiliated voters.\n\nIn another promising sign for the Republican candidate, GOP voters are returning a higher rate of mail-in ballots — an indicator of greater enthusiasm for Ciattarelli.\n\nNew Jersey Republicans have a return rate of 48.43%, compared to the Democrats’ 47.93%, according to data compiled by DecisionDeskHQ Director of Data Science Michael Pruser — though Democrats have an advantage of 165,692 returned ballots in the raw numbers.\n\n“The first day of early in-person voting is Saturday, and in 2024, Democrats won the first day of voting by 1.2% (outvoting Republicans by 1,644),” Pruser noted. \n\n“If it is to be believed that Ciattarelli has enthusiasm on his side, R’s are going to have not simply to eke out a win on the first day, but generate a somewhat convincing one.”\n\nHistorically, Republicans have been less inclined to vote by mail than Democrats, though that trend started to change last November with President Trump’s victory over Kamala Harris.\n\nThe latest RealClearPolitics polling average shows Sherrill leading Ciattarelli by 4.1 percentage points. \n\nIn 2021, Democratic incumbent Phil Murphy defeated Ciattarelli by just 3.2 percentage points, a margin that ended up being nearly five percentage points closer than the final RCP average.\n\nElection Day is Nov. 4.","summary":"New Jersey Republicans notched some new 31,000 registered voters this year, while Democrats shed 11,106, new data revealed after the voter registration deadline closed last week.","url":"https://nypost.com/2025/10/22/us-news/nj-gop-voter-registration-numbers-surge-ahead-of-hotly-contested-governor-race/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-rdlkc0nqb-1761141778752.jpg?quality=75&strip=all&1761127401&w=1200","video":"https://cdn.jwplayer.com/videos/r5QUgiaq-RyIcpnTz.mp4","publish_date":"2025-10-22 15:07:01","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.523},{"id":371679934,"title":"Exclusive—Adam Piper: Jay Jones and His Fellow Democrats Need to Stop Calling Everyone a Fascist","text":"Google “Donald Trump” and “fascism,” and you’ll find countless headlines, from both left-wing and mainstream outlets, twisting the term beyond recognition.\n\nOnce used to describe totalitarian regimes responsible for genocide and war, “fascism” has become a lazy insult hurled by liberal commentators, academics, and media elites against Republicans.\n\nIf these legacy institutions care at all about the preservation of their credibility, the aims of democracy, and decency, they should speak out about the language being used by the left today. Clearly denouncing the recent messages from Democrat Jay Jones would be a good place to start.\n\nWe used to say, “Sticks and stones may break my bones, but words will never hurt me.” Political rhetoric today has devolved from words to weapons.\n\nCalling political opponents “fascists” isn’t clever—it’s dangerous. It encourages hostility, dehumanizes conservatives, and gives the left a moral license to attack those with different beliefs. I’ve seen it firsthand as a husband, father, and political operative watching the climate of hatred grow darker.\n\nThe term “fascist” and other liberal triggers have led to significant political violence, including the murder of a conservative icon and a Fortune 500 CEO and assassination attempts on a Republican president and a Republican member of Congress.\n\nPublic disagreement and spirited debate are hallmarks of democracy. But branding people “fascists” for their beliefs crosses a line. When the media or academia excuse such language, they become complicit in the culture of violence it breeds.\n\nThe word “fascist” carries enormous weight. Most people who use it today couldn’t provide its dictionary definition; it’s become one of the most dangerously misunderstood and misused words in America. Those who use it simply crave the outrage and validation it provokes on social media. What began as a political insult has evolved into a rallying cry for radical liberal activists who justify harassment, threats, and ultimately, violence.\n\nThis isn’t theoretical. When I was a teenager, my fellow teenage Republicans were labeled “fascists” by Amnesty International students without consequence. Decades later, outside a restaurant on Capitol Hill, protestors screamed the same slur through bullhorns while police stood by. The setting had changed, but the hatred had not.\n\nDemocrats have taken the rhetoric further, comparing Republicans to Hitler or calling them fascists from national platforms.\n\nLast year, during a town hall on CNN, then-Vice President Kamala Harris referred to her political opponent, Donald Trump, as a fascist. The same administration’s White House press secretary also called Trump a fascist.\n\n“Fascist” made its way back into the political debate this year in the Virginia Attorney General’s race. In leaked text messages, Democrat candidate Jay Jones fantasized about putting “two bullets” in the head of his political opponent and justified the thought because his opponent is “breeding little fascists.”\n\nThe liberals who engage in this rhetoric know what they are doing. When California Gov. Gavin Newsom calls a White House staffer a fascist, he knows exactly what he is doing. It’s a signal to supporters that conservatives are not just wrong but evil; and, once again, violence becomes easier to rationalize.\n\nLet me be crystal clear: there is nothing fascist about being a Republican. In fact, the most authoritarian policies in my political lifetime came from Democrats and their COVID-era shutdowns — from Democrat Gavin Newsom arresting people for walking on the beach to Kansas Democrat Gov. Laura Kelly closing churches on Easter.\n\nThe media and other bastions of liberal elitism, such as academia, must be willing to publicly condemn Democrat discord — whether as minor as Gavin Newsom’s tweet or as severe as Virginia Democrat attorney general candidate Jay Jones’ text messages repeatedly fantasizing about putting bullets in the heads of his political opponents and their “fascist” children.\n\nThe media and so-called non-partisan academics must not only hold Democrats like Jay Jones accountable when they promote violence, but they also must hold leftists accountable when they celebrate murderers like Luigi Mangione.\n\nYes, carnival barking creates clicks and ad revenue. However, we have evolved to an era of yellow journalism and are at the brink of ending bipartisanship for generations to come.\n\nIt’s time for Democrats and the media to show restraint, reject the politics of demonization, and restore respect for genuine debate. America is better than this—and it starts with Democrats having the courage to tell Jay Jones to drop out of the race and retiring “fascist” from the liberal lexicon once and for all.\n\nAdam Piper is the executive director of the Republican Attorneys General Association (RAGA).","summary":"Public disagreement and spirited debate are hallmarks of democracy, but branding people “fascists” for their beliefs crosses a line.\n\n\nThe post Exclusive—Adam Piper: Jay Jones and His Fellow Democrats Need to Stop Calling Everyone a Fascist appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/10/22/exclusive-adam-piper-jay-jones-and-his-fellow-democrats-need-to-stop-calling-everyone-a-fascist/","image":"https://media.breitbart.com/media/2025/10/jay-jones-facist-getty-640x335.png","video":null,"publish_date":"2025-10-22 13:57:13","author":"Adam Piper","authors":["Adam Piper"],"language":"en","category":"politics","source_country":"US","sentiment":-0.015},{"id":371616780,"title":"Kamala Harris, Chimamanda Adichie to converse at London Literature festival","text":"Former United States Vice President Kamala Harris is set to participate in a conversation with renowned Nigerian author Chimamanda Ngozi Adichie at the London Literature Festival on Thursday, October 23.\n\nHarris’ book reflects on her brief but intense presidential campaign, offering readers an insider view of the challenges, lessons, and emotions behind the scenes.\n\n“I look forward to being in conversation with Chimamanda Ngozi Adichie on Thursday as part of the London Literature Festival,” Harris tweeted.\n\nThe event is part of Harris’s ongoing book tour for her memoir, “107 Days,” which chronicles her brief but intense presidential campaign. \n\nRead Also: 2024 US elections: Reasons Donald Trump defeated Kamala Harris\n\nThe sold-out event, in partnership with Foyles, promises to be a thought-provoking discussion on leadership, identity, and storytelling.\n\nHarris has expressed her anticipation for the conversation, stating that she looks forward to engaging with Adichie.\n\nThe London stop is one of several appearances on the “107 Days” book tour, which began shortly after the book’s release on September 23, 2025.\n\nHarris has already appeared in several US cities alongside notable figures, sharing insights into her campaign experiences.","summary":"Former United States Vice President Kamala Harris is set to participate in a conversation with renowned Nigerian author Chimamanda Ngozi Adichie at the London Literature Festival on Thursday, October 23.\n\n\nThe post Kamala Harris, Chimamanda Adichie to converse at London Literature festival appeared first on The Nation Newspaper.","url":"https://thenationonlineng.net/kamala-harris-chimamanda-adichie-to-converse-at-london-literature-festival/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2025/10/22144513/Chimamanda-Ngozi-Adichie-and-Kamala-Harris-1.webp","video":null,"publish_date":"2025-10-22 13:45:25","author":"The Nation,Yewande Fasan","authors":["The Nation","Yewande Fasan"],"language":"en","source_country":"ng","sentiment":0.527},{"id":371545366,"title":"Is Secret Service Committed to Reforming DEI, 'Woke' Culture?","text":"Sean Curran knew he had his work cut out for him when he agreed to head the Secret Service and help the troubled agency recover its reputation. Two assassination attempts against Donald Trump \u0013 and the less-than-candid response by the agency brass \u0013 had sullied the reputation of the once-storied agency and led to a raft of questions on Capitol Hill about whether the Secret Service had lost sight of its very purpose.\n\nCurran, the low-key former head of Trump\u0019s campaign Secret Service detail, found himself heading an agency that had been undermined by cronyism, nepotism, and uneven discipline. In addition, the Biden administration\u0019s shift to DEI hiring and promotions added another layer of priorities that complicated the agency\u0019s mission-critical work, according to interviews with more than a dozen current and former agents.\n\nOver the last decade, the tensions produced by this change in culture, coupled with the demanding travel schedule many agents face, have led to an alarming exodus of mid-career and senior agents choosing to leave rather than stay until their 20-year retirement mark.\n\nLast fall, amid the fallout over the assassination attempts, the agency started offering $40,000-$50,000 recruitment bonuses and retention bonuses of up to 25% of an agent\u0019s or officer\u0019s salary to try to stem the tide. But the efforts have had limited success, these same sources say.\n\nThe pressing question now, seven months after Curran took the helm, is whether he and his team are doing enough to transform the culture, jettison DEI priorities as President Trump ordered, improve morale and retention, and return the Secret Service to its elite mission-focused status.\n\nCurran and his new leadership team insist they\u0019re laser-focused on making the necessary changes to ensure that last year\u0019s failures never happen again. Curran has cited several post-Butler reforms initiated or continued under his direction, including ensuring clear lines of accountability and improving communications and information-sharing with local law enforcement. He also touts the creation of an Aviation and Airspace Security Division to improve the agency\u0019s drone-monitoring capabilities, and changes to the agency\u0019s resource allocation to ensure that assets are more appropriately applied in a threat-based way.\n\nAccountability for assassination failures has proven more elusive. Members of Congress in both political parties have expressed deep concern that no one was fired over the myriad mistakes made in Butler, and those who were disciplined received only 10 to 42 days of leave without pay, while Curran has promoted several supervisors who also bear some responsibility for security failures that day.\n\nAlthough there have been no serious assassination attempts on Trump\u0019s life in the seven months since Curran took over, politically motivated attacks have spiked and violent rhetoric has almost become normalized. Menacing comments against Trump and other Republicans have only ratcheted up in the wake of Turning Point USA co-founder Charlie Kirk\u0019s assassination, including during last weekend\u0019s \u001cNo Kings\u001d nationwide protests \u0013 some of which featured explicitly violent signs, gestures, and threats.\n\nOver the last year, several individuals have been arrested for vowing to kill the president, with successful Secret Service investigations resulting in some of these arrests.\n\nOn Sunday, the Secret Service also announced that it had discovered a \u001csuspicious\u001d hunting stand with a direct sight line to Trump\u0019s Air Force One exit at Palm Beach International Airport.\n\nDespite these interdiction efforts, several embarrassing Secret Service incidents have occurred in recent months, renewing concerns about the agency\u0019s ability to protect Trump and other administration leaders and their families:\n\nIn early October, a Secret Service Uniformed Division officer fell asleep in public while providing security for the U.N. General Assembly and left his fully automatic rifle unattended while he went to the restroom.\nAfter Charlie Kirk\u0019s assassination, a Secret Service agent who attributed Kirk\u0019s murder to \u001ckarma\u001d in a Facebook post and criticized efforts to eliminate DEI priorities in the federal government was disciplined and placed on administrative leave.\nOver Labor Day weekend, the Secret Service physically screened a man\u0019s bag but missed a Glock pistol and let him into the Virginia course where Trump was golfing. The man, a member of the club, discovered the mistake and self-reported it.\nIn mid-September, pro-Palestinian protesters confronted Trump at a D.C. restaurant, hurling epithets and calling him \u001cthe Hitler of our time\u001d for more than 30 seconds before Trump told his detail to escort them out.\nIn late May, a physical fight between two female officers outside of former President Barack Obama\u0019s D.C. residence was caught on video.\n\nThe string of incidents has reignited debates over whether DEI and years of deteriorated standards remain corrosive problems within the agency.\n\nIn an interview with RealClearPolitics, Sen. Marsha Blackburn, a Tennessee Republican, recalled how former Secret Service Director Kimberly Cheatle, who was forced to resign after her disastrous congressional testimony in the wake of the Butler assassination attempt, had aggressively promoted the \u001c30x30\u001d initiative under a Biden directive to make the federal government a DEI model for the nation. The DEI program promotes the arbitrary hiring of women with the goal of 30% women agents and officers by 2030.\n\nThe goal was one of Cheatle\u0019s top priorities, and she had achieved 24% women agents and officers in the agency by the time she resigned last year, according to several Secret Service sources.\n\n\u001cNow, if that is going to be your goal, and you\u0019re taking your eye off of your core mission, which is to protect individuals, and then you are no longer meeting your prescribed mission,\u001d Blackburn said, \u001cthis is how you end up getting ineffectiveness into agencies, and we see it in agency after agency.\u001d\n\n\u001cThe American people are tired of this, whether it\u0019s the ESG or any of these other initiatives,\u001d she added. \u001cThey want government to do their job, and with the Secret Service, it is to protect these individuals who face constant threats.\u001d\n\nDuring Trump\u0019s first week in office, he pledged to forge a \u001ccolor-blind and merit-based society,\u001d and took aim at DEI programs across the federal government.\n\nIn late September, Secretary of War Pete Hegseth ordered all of the top generals and admirals in the U.S. military to convene in Virginia and announced 10 new directives that would shift the military\u0019s culture away from what he called \u001cwoke garbage\u001d and back to a \u001cwarrior ethos\u001d and physical fitness.\n\n\u001cNo more identity months, DEI offices or dudes in dresses. No more climate change worship,\u001d Hegseth railed. \u001cNo more division, distraction of gender delusions. No more debris. As I\u0019ve said before and will say, we are done with that shit.\u001d \n\nAnd while nearly every media outlet credentialed to cover the Pentagon, regardless of political leanings, is openly opposed to Hegseth\u0019s restrictive new Pentagon access requirements, his commitment to return to a military meritocracy has been credited with transforming a recruitment and retention crisis into a bonanza.\n\nVeteran Secret Service agents believe that a similar turnaround could be particularly beneficial for the Secret Service, especially given the hyperactive proclivities of the principals in the new administration. For agents on the top details, the high pace they expect during a campaign year hasn\u0019t let up, because Trump and Vice President JD Vance have far more frequent travel schedules than President Biden and Kamala Harris did. Agents on Vance\u0019s detail are putting in some of the longest hours and toughest travel schedules in the agency.\n\nIn contrast to Hegseth\u0019s detractors, who fault him for his bombastic style and aggressive reforms, criticism of Curran has focused on his far quieter, low-profile approach. Curran commissioned Hollywood producer Michael Bay to produce a $1 million recruiting video, which was released online during the Super Bowl, yet he has done relatively few media interviews. He also has yet to address the rank-and-file agents in an in-person speech or via Zoom, opting to send emails when laying out new standards and informing the workforce of changes.\n\nSecret Service spokesman Anthony Guglielmi insists the agency is in full compliance with Trump\u0019s executive order eliminating all DEI programs at the federal level and instituting the necessary changes within the required 60-day timeline.\n\nCurran is not only comporting with the letter of Trump\u0019s executive order eliminating DEI at all federal agencies, but also its spirit, Guglielmi asserts.\n\n\u001cDirector Curran's leadership is centered on recruiting and retaining a workforce characterized by attention to detail, discipline, and commitment to our dual mission while also ensuring promotions and reassignments are merit based \u0013 the right person, for the right position, at the right time,\u001d he told RCP in a statement. \u001cDirector Curran has challenged his leadership team to reaffirm a commitment to the highest professional standards to achieve operational excellence.\u001d \n\nShortly after Curran was sworn in in March, he sidelined many of Cheatle\u0019s top lieutenants to bring in his own team. Just a few weeks later, however, a U.S. District Court judge temporarily blocked the Trump administration from firing 19 intelligence officers who had previously served on DEI programs at the CIA and the Office of the Director of National Intelligence. The judge\u0019s order requires the employees to remain on paid administrative leave while they seek reassignments or appeal their firings.\n\nThere was no similar attempted mass firing of DEI officials at the Secret Service. Two of the key DEI leaders had already left before Trump took office. Lucious Hires, the former top DEI executive, voluntarily departed the agency last summer. His deputy, Jonathan Wynn, followed suit in December after Trump\u0019s victory.\n\nResponding to Trump\u0019s anti-DEI executive order, Curran shifted the agency\u0019s Office of Equity and Employee Support Services and its remaining employees back to its original mission of serving as the Equal Employment Opportunity and Conflict Resolution office. Before being rebranded and taking on a swath of DEI initiatives during the Obama administration, the EEO office for decades had handled employee complaints of unlawful discrimination and or harassment based on race, color, religion, sex, age, or disability.\n\nUnlike Hegseth, Curran has allowed the few known transgender agents currently on staff to remain, though it\u0019s unclear how many there are. It\u0019s also unclear whether any of them are currently using drugs and surgeries to transition, something that theoretically could impact their ability to serve in protective assignments.\n\nThe Secret Service declined to provide the exact number of transgender agents or officers on staff, citing personnel privacy rules.\n\nCurran has banned Uniformed Division officers from wearing rainbow-colored pride pins or patches, which Cheatle\u0019s leadership approved and encouraged. Nonetheless, transforming the agency back into a meritocracy won\u0019t happen overnight.\n\nSenior agents report that several years ago, the agency was facing such a retention and recruitment crisis that it started accepting far younger candidates and far more who lacked previous law enforcement or military experience than it did previously. More recently, during Cheatle\u0019s tenure, the agency also accepted overweight applicants, some of whom have had trouble passing physical fitness tests.\n\nOver the past several years, agents also report that outside of the top details, including the team protecting the president and the vice president, some field offices around the country are allowing the honor system for self-reported physical fitness or are simply not requiring them. For years, there\u0019s also been such a manpower shortage, and agents are stretched so thin, that many offices have drastically reduced firearms practice, according to several sources in the Secret Service community.\n\nStill, some current and former Secret Service are taking issue with decisions Curran can control \u0013 the retention and promotion of agents who were key parts of his predecessor\u0019s team. Curran\u0019s decisions to retain one senior woman and promote another, both of whom played key roles in Cheatle\u0019s tainted leadership team, have spurred renewed scrutiny both on Capitol Hill and within the Secret Service community.\n\nDarnelly De Jesus, a 25-year agency veteran and proponent of DEI, became the Secret Service\u0019s agent in charge of its Office of Professional Responsibility last November, under then-acting Director Ron Rowe. Rowe was a Biden appointee and Cheatle\u0019s previous hand-picked deputy, whom then-Department of Homeland Security Secretary Alejandro Mayorkas tapped to lead the agency after Cheatle\u0019s departure.\n\nCurran has decided to keep De Jesus on his assistant director team. In that role, she oversees all agency misconduct cases and is ultimately charged with signing off on all disciplinary recommendations.\n\nServing as a member of the president\u0019s or the vice president\u0019s security team immediately positions a young agent for future promotions. But instead of pursuing that track, De Jesus rose through the ranks as the agency\u0019s chief ethics officer and the deputy assistant director of training, while serving as one of the agency\u0019s leading architects of and advocates for DEI recruiting and promotion policies.\n\nIn her current role overseeing misconduct cases, De Jesus is one of eight assistant directors who comprise the Secret Service\u0019s top-tier leadership team, aside from the deputy director and chief of staff.\n\nCurran\u0019s decision to keep De Jesus in that post, and his more recent decision to promote another female agent who served as Cheatle\u0019s chief of staff, are raising questions among the rank and file about whether he\u0019s doing enough to break with the agency\u0019s recent past.\n\nDe Jesus\u0019 presence in leadership is seen as a symbol among Secret Service critics on Capitol Hill and numerous current and former agents who believe that misplaced DEI priorities during the Biden years contributed to the failures at Butler.\n\nOne agent, Rashid Ellis, has publicly blamed DEI for contributing to the near-assassination of Trump. Ellis, who opposes DEI, also argues that he was unfairly denied an agency leadership position and believes women gender quotas \u001cplayed a factor.\u001d\n\nWhatever action the Secret Service takes with regard to Ellis\u0019 complaints, De Jesus, a major DEI advocate who has the power to pull employees\u0019 clearances, suspend, or terminate them, will ultimately be the one signing off on those decisions. Some Secret Service employees fear that De Jesus could retaliate against whistleblowers, including Ellis, who have expressed concern about the agency\u0019s DEI policies on Capitol Hill and elsewhere.\n\nAs of Sept. 30, De Jesus\u0019 LinkedIn resume still touted her work during the Biden administration drafting an \u001centerprise white paper\u001d on Cheatle\u0019s 30x30 initiative to hire more women, which she said was designed to \u001cincrease hiring, retention, and advancement with the projected goal of meeting 30% of women in the law enforcement by 2030.\u001d\n\nAfter RCP inquired about her role in the 30x30 program, that bullet point disappeared from her online bio, although she still touted several other DEI accomplishments, including her cross-agency work creating \u001ca ground-breaking first-line supervisory class for all females across 22 separate agencies.\u001d She also mentions her experience increasing staffing in two divisions from \u001c35% to 80% in 10 months, resulting in a 128% increase in hiring, with 73% being qualified minorities and female candidates.\u001d\n\nSome agents are also pointing to Kyo Dolan\u0019s early October promotion to assistant director of field operations, one of the largest divisions in the agency with more than 3,000 employees, as further evidence that Curran is not a change agent.\n\nDolan served as Cheatle\u0019s and Rowe\u0019s chief of staff from May 2024 until March 2025, when Curran took the helm and named his own top leadership team.\n\nDolan\u0019s cybersecurity skills are highly respected, making her promotion less objectionable than De Jesus\u0019 for many in the agency. Neither De Jesus nor Dolan worked in a traditional protective assignment during their formative Phase 2 time in the agency and neither of them have spent time on a presidential detail, a long-valued path to promotion and agency leadership. Dolan, however, pursued cyber-security investigations for most of her career, becoming a preeminent cyber-security expert and spearheading the development of the first-ever cyber-protective career path for technical agents in the Secret Service.\n\n\u001cYou would think that doing time on a presidential detail would be something that you would want from everyone on your team of eight assistant directors given the gravity of your one mission,\u001d Rich Starapoli, former Secret Service agent and a former Homeland Security deputy secretary, told RCP. \u001cYou can\u0019t keep the status quo \u0013 it\u0019s bad for optics.\u001d\n\nCurran has publicly said he disagrees with DEI initiatives, but many in the Secret Service community have questioned just how committed he is considering these two personnel decisions and just how deeply rooted and pervasive DEI became under Cheatle.\n\nThe Secret Service\u0019s former DEI Director Lucious Hires in 2023 had called spreading DEI within the agency \u001cmission imperative\u001d and the \u001cultimate goal\u001d and worked to incorporate it into \u001cevery action, every day.\u001d The agency also promoted itself as setting the \u001cgold standard\u001d of DEI in a recruitment brochure that same year and established a group of the agency \u001cGame Changers\u001d to form the \u001cInclusion Engagement Council,\u001d which helped spearhead and oversee DEI policies and hiring and promoting goals.\n\nUnder Cheatle\u0019s leadership, DEI had become so normalized that an overweight female agent who never passed her physical fitness tests was not only retained on staff \u0013 she was allowed to moonlight as a model. The agent, who was featured in a magazine profile, traded on her job in federal law enforcement and hinted at her Secret Service position in a photo shoot labeled, \u001cUndercover, But Never Underdressed.\u001d\n\nThe female agent, who bills herself as a \u001cnationally published curve model, plus-size fashion and fitness influencer, and body-positive advocate\u001d on social media, was assigned to protect Kamala Harris\u0019 stepdaughter, Ella Emhoff, in New York. After several failed attempts to pass a physical fitness test, the agent was placed in the Special Services Division, which handles support functions for the agency, including the maintenance of the armored vehicle fleet and the screening of mail and packages for the White House complex, according to four sources in the Secret Service community.\n\nDuring Cheatle\u0019s tenure, agents belonging to different ethnic and minority groups, such as Latinos, blacks, and LGBTQ+ individuals, each had a special \u001ccaf�\u001d chat room on the agency\u0019s internal DEI website that would meet on different days to discuss the difficulties of being a minority while serving in the Secret Service, according to sources familiar with the practice.\n\nSecret Service employees, along with those from the Department of Defense and other federal agencies, planned to send employees to an \u001cOut and Equal\u001d Workplace Summit at Disney World in October of last year, at the height of the campaign season, as RCP first reported.\n\nFor three days in early 2023, the Secret Service sent five employees, including Andrew Murphy, the openly gay then-head of the Boston field office, to the 2023 World LGBTQI+ Conference for Criminal Justice in Melbourne, Australia, according to FOIA documents obtained by the Center to Advance Security in America and provided to RCP.\n\nAfterward, Murphy sent Director Cheatle a list of \u001caction items\u001d necessary to become a \u001ctrans-inclusive agency.\u001d Included in that list were the following:\n\nDetermining whether physical fitness standards were having a negative impact on recruiting trans agents.\nBuilding a private changing area/curtained stall within both male and female locker rooms to offer privacy for gender non-conforming employees.\nUsing the Royal Canadian Mounted Police\u0019s comprehensive guide to support transgender, non-binary, and \u001ctwo-spirit\u001d employees transitioning in the workplace.\nAgency approval of a badge with a rainbow flag as a cost-free tool to recruit more LGBTQ+ employees. \n\nBefore Curran became director, Murphy was removed from the head of the Boston Field Office following an investigation into his handling of agents\u0019 overtime and is now serving as an assistant special agent in charge of a different division, according to three knowledgeable sources.\n\nSusan Crabtree is RealClearPolitics' national political correspondent.","summary":"Sean Curran knew he had his work cut out for him when he agreed to head the Secret Service and help the troubled agency recover its reputation. Two assassination attempts against Donald Trump - and the less-than-candid response by the agency brass - had sullied the reputation of the once-storied agency and led to a raft of questions on Capitol Hill about whether the Secret Service had lost sight of its very purpose.","url":"https://www.realclearpolitics.com/articles/2025/10/22/is_secret_service_chief_committed_to_reforming_dei_woke_culture__153434.html","image":"https://assets.realclear.com/images/70/700184_6_.jpeg","video":null,"publish_date":"2025-10-22 13:00:29","author":"RCP,Susan Crabtree","authors":["RCP","Susan Crabtree"],"language":"en","category":"politics","source_country":"US","sentiment":-0.058},{"id":371556828,"title":"The buzzy word that Democrats have pinned their hopes on","text":"The buzziest political word of the year is “affordability” — it’s the mantra that carried the insurgent progressive candidate Zohran Mamdani to victory in New York City’s mayoral primary, and that Democrats across the country have since raced to claim as their own.\n“Affordability is the central issue, the central reason to be a Democrat,” Massachusetts Sen. Elizabeth Warren declared in August. California Gov. Gavin Newsom has similarly placed “affordability” at the center of his state housing reforms and his administration’s plan to manufacture generic insulin pens. Minnesota Attorney General Keith Ellison launched his reelection bid this week under the banner of “Afford your life.” \nFew candidates or elected officials are willing to acknowledge what many economists say quietly: that prices tend to be “sticky,” and that absent a major economic slowdown, costs are unlikely to fall much from where they are today. Still, Democratic strategists who worried that the party under Joe Biden had for too long ignored cost-of-living issues and the growing frustration around inflation have been happy to see “affordability” take center stage. That the cry is being led by a candidate endorsed by the Democratic Socialists of America has even given the term leftist validation — despite the fact that a decade ago “affordability“ stood as the vague, squishy descriptor socialists blamed for watering down the goal of universal health care with the Affordable Care Act.\nBut when it comes to the explanation for today’s affordability crisis, the party has found itself embroiled in seemingly endless factional debates — with each camp insisting their diagnosis is the primary one. Is the crisis because, as the Abundance theorists argue, we’re not building enough? Or is it, as some populists allege, due to corporate greed and Wall Street recklessness? Or because we’ve shirked on antitrust enforcement, allowing monopolies to take over and artificially raise prices? Or because, as progressives argued in the 2010s, unions were decimated and too much was left to the market? Rather than acknowledge that multiple factors might be at play, each faction has largely dug in around its preferred explanation.\nOne attempt to unify these debates comes from the Economic Security Project (ESP), a progressive organization focused on direct cash support and the broader social safety net. It offers a new analysis of affordability in hopes that a comprehensive framework might lead to clearer political solutions, and perhaps more harmonious political consensus. Though Mike Konczal, one of the report’s co-authors, emphasized in an interview that their work represents an “honest assessment“ of structural problems and not a political compromise, it’s clear that the analysis aims to offer a more constructive path forward than the in-fighting so many have grown used to.\nBroken markets, broken incomes\nThe analysis divides the affordability crisis into two categories: problems with markets and problems with incomes.\nMarkets, ESP argues, fail in three main ways\n* First, “gatekeepers” constrain supply — for example, drug companies stacking up patents to stop competition, hospitals merging to reduce choices, and NIMBYs blocking housing. \n* Second, “fragmented markets” falter when the lack of customers makes services unprofitable, leaving rural areas without hospitals or broadband. \n* Third, “manipulated signals” obscure true costs through features like junk fees and algorithmic pricing, which prevent consumers from comparison shopping and cost them thousands a year. \nOn the income side, ESP argues that three forces make essentials unaffordable even when markets function well. \n* “Life-cycle mismatches” mean costs peak when earnings are low — child care arrives early in careers when paychecks are smaller, while health care expenses surge in retirement. \n* Inequality keeps incomes too low for many families: 43 percent of families can’t cover basic necessities, and since 1979, wages have risen only 29 percent while productivity climbed 83 percent. \n* Lastly, economic shocks like recessions leave lasting scars; for example, workers displaced in downturns can lose up to three years of lifetime earnings.\nThe framework covers most of the leading theories and treats all six causes as equally important, declining to rank any theory against another. It builds on a different framework published in September by Jared Bernstein, chair of the Council of Economic Advisers under Biden, and Neale Mahoney, a Stanford University economist. The Bernstein-Mahoney report laid out more specific policy recommendations than ESP, though ESP says it plans to issue those types of proposals beginning next year. \nBoth analyses arrive as Democrats sort through competing ideas for understanding why costs are so high. The most prominent this year has been Abundance, popularized by Vox co-founder Ezra Klein and journalist Derek Thompson, which focuses on supply constraints: zoning laws blocking housing, permitting delays slowing infrastructure, regulatory barriers limiting competition. Their diagnosis is that government-imposed bottlenecks are preventing us from building enough of what we need.\nESP incorporates those arguments but argues it’s incomplete. In the case of child care, for example, even if you removed every supply constraint (like licensing requirements that limit the number of providers or zoning rules that restrict home-based daycares) families would still struggle to afford care early in their careers. Building more housing, similarly, is not enough to protect families when job losses or inflation erode real incomes.\nAs proof that these various approaches aren’t really in tension, ESP points to California. In the past two years, state lawmakers passed major YIMBY upzoning laws while also enacting anti-monopoly measures, including a ban on algorithmic rent-setting software like RealPage and reforms targeting prescription-drug middlemen who mark up prices. The same Democratic legislators — progressives like state Sen. Scott Wiener and Assemblymember Buffy Wicks — championed both sets of policies. “At the state level, at the personnel level, we often don’t see these conflicts as much as you might suspect,” Konczal said.\nThe framework tries to show that addressing broken markets in one area doesn’t preclude addressing broken incomes in another. Or, put differently, the conflicts that often dominate online debates may be more about interpersonal feuds and factional positioning than actual policy trade-offs. \nThe future of affordability\nKonczal acknowledged that because the framework doesn’t prioritize among causes, “people will obviously have disagreements on which is more important,“ calling that “a very useful disagreement to have.” By not making those judgments itself, the framework lets each camp find validation without forcing trade-offs about which problems deserve the most urgent action. \nThis raises an obvious question: If political battles are ultimately about resource allocation and legislative priorities, what’s gained by a unifying framework that sidesteps the hardest choices?\nSome, like Matt Bruenig, founder of the left-wing People’s Policy Project, think the ESP framework gets the logic generally right but badly misweights the causes. “As far as magnitude goes, income distribution dwarfs everything else,” he told Vox. Broken incomes bear most of the blame for lack of affordability, he argues, while theories like monopolistic pricing get more attention than the evidence warrants.\nThe weighting question connects to a deeper issue. When should markets be fixed and when should they be replaced? This is arguably the key question for affordability and one that the various factions have not yet squarely confronted. \nShould health care be made more affordable through competition and transparency, or guaranteed through universal coverage? Should housing costs come down through supply increases, or should housing be partially decommodified through social housing? \nIronically, “affordability” once meant something very different to progressives. A decade ago, Democrats fought over whether the government should guarantee services or simply make them cheaper. The Bernie Sanders wing pushed for universality — Medicare-for-all, free college, housing as a right — while moderates framed goals around access: less costly insurance, debt-free college, homeownership incentives. “Affordable“ became the compromise word, often dismissed by the left as a disappointing cop-out — a promise of market participation instead of universal provision.\nNow you have a progressive organization embracing “affordability” while explicitly invoking Social Security-style guarantees for life-cycle costs. \nDoes one need to pick? Kamala Harris’s 2024 campaign showed how “affordability” can cover both approaches. She ran on an “opportunity economy“ centered on market-based solutions: small business tax credits, housing supply increases, cutting red tape. But she also proposed banning price gouging on groceries, capping prescription drug costs, and expanding the Child Tax Credit. “Affordability” let her do both without having to explain when markets needed fixing versus when they needed bypassing.\nThat’s either sophisticated politicking or strategic ambiguity. The optimistic read is that the left has evolved beyond the false binary of guarantees versus opportunity. You can fix markets and provide universal goods — they’re complementary, not contradictory. Recognizing that markets can work for some things if we fix them, while other things need decommodification, is arguably progress.\nThe pessimistic read is that “affordability” is doing too much work, covering for a lack of clarity about priorities. Without a theory of when to use which approach, you get a “do everything” framework that risks defaulting to market-based solutions because they’re easier and more politically palatable, even when the right answer might be to fight for universal programs.\nWhen I asked the report authors whether they had a theory for when something should be guaranteed versus made more affordable, they demurred. “It depends,” Konzcal said, saying that “most economic problems involve both” sides. He pointed to public options as a balanced approach, but offered little clarity for when to deploy them. “Markets can innovate and scale, while public options can anchor supply, set benchmarks, and ensure universal access,” he said. \nTheir sector-specific reports planned for 2026 will be a clearer test of where this framework ultimately goes. That’s where we’ll see if this can tackle the thorniest questions: What should we stop trying to make people afford at all?","summary":"The buzziest political word of the year is “affordability” — it’s the mantra that carried the insurgent progressive candidate Zohran Mamdani to victory in New York City’s mayoral primary, and that Democrats across the country have since raced to claim as their own. “Affordability is the central issue, the central reason to be a Democrat,” [&#8230;]","url":"https://www.vox.com/politics/465634/democrats-zohran-politics-affordable-affordability-inflation-economy-campaign","image":"https://platform.vox.com/wp-content/uploads/sites/2/2025/10/gettyimages-2241797253.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613","video":null,"publish_date":"2025-10-22 13:00:00","author":"Rachel Cohen","authors":["Rachel Cohen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.173},{"id":371578896,"title":"Republicans are ridiculing ‘No Kings.’ A striking new poll shows Americans aren’t laughing","text":"Republicans have spent many days trying to marginalize the massive anti-Trump “No Kings” rallies held across the country over the weekend.\n\nThey’ve argued the people involved were extremists and even predicted they would be violent (which turned out not to be true). They’ve claimed the protesters hate America. And they’ve argued that the “No Kings” message itself is nonsensical, given President Donald Trump is a democratically elected president who sometimes works with Congress.\n\nTrump said Sunday that the people were “not representative of this country.” He and his team have taken to mockingly posting memes and AI videos with Trump donning a crown — including one that the president shared in which he dumps brown waste on protesters.\n\nHouse Speaker Mike Johnson added Monday night on Fox News that the protesters’ messages were “completely the opposite of what America was founded upon.”\n\nNew polling, though, reinforces how much the thrust of the “No Kings” message has resonated with much of the American public.\n\nIn fact, a majority of Americans appear sympathetic to it, at least to some extent. And their ranks appear to be growing.\n\nThe survey from the Public Religion Research Institute gave people two options. One was that Trump is a “potentially dangerous dictator whose power should be limited before he destroys democracy.” The other was that he’s a “strong leader who should be given the power he needs to restore America’s greatness.”\n\nAmericans chose the “dictator” option by a strong margin, 56 percent-41 percent.\n\nAnd notably, that margin has nearly doubled since April, when Americans also sided with the “dictator” option but by a smaller, 52 percent-44 percent margin.\n\nThe same poll also showed a 54 percent majority sided with the view that Trump is waging an “assault on constitutional balances and the rule of law.” The alternative was that his overhaul of the federal government is “a long-overdue correction of disastrous policies” (43 percent).\n\nIt’s possible to oversell poll numbers like this. Giving people binary choices can inflate numbers by making people choose one extreme or another. People who don’t like Trump but don’t think he’s a dictator might feel compelled to choose the “dictator” option to avoid endorsing a man they don’t like.\n\nBut tellingly, the poll also asked people about the strength of their views. Fully 45 percent of Americans said they “strongly” agreed Trump was a dangerous dictator, and 43 percent strongly agreed that he’s waging an assault on checks and balances and the rule of law.\n\nIn both cases, nearly half of independents strongly agreed with those sentiments.\n\nThese are, to put it mildly, not insignificant numbers. Say what you will about elements of the “No Kings” rallies; this polling suggests the thrust of the demonstrations hardly appears ridiculous to a majority of Americans.\n\nAnd this is merely the latest indicator that huge numbers of Americans have such concerns.\n\nClear majorities see him exceeding his powers\n\nWhether “dictator” or “king” are particularly apt labels, Americans are clearly sympathetic to the idea that Trump is abusing his power.\n\nAmid the rallies Saturday, a number of conservatives argued that invoking “Kings” was a non sequitur, given Trump was popularly elected in 2024.\n\n“I don’t understand how Trump is a King when he won every single swing state, the electoral college and popular vote in a democratic election,” said Meghan McCain.\n\nFox News analyst Brit Hume noted that at least some of Trump’s policies have gotten congressional approval. “Some King,” he said.\n\nBut there is no question that Trump has disregarded the limits of his authority — and disregarded Congress — in extraordinary ways. The protesters don’t seem to be arguing that Trump is technically a monarch, so much as that he’s seeking to exercise unchecked power when he can.\n\nAnd that seems to be an argument that a majority of Americans sympathize with.\n\nMany have worried about this for a long time\n\nIf anything, these concerns already existed and have just gotten more pronounced as Trump has grabbed for more power.\n\nBefore Trump’s second term began:\n\nIt’s not just a partisan thing\n\nIt might be tempting to look at these numbers and think, well, it’s just partisan.\n\nA decade ago, many Republicans accused Barack Obama of acting like a king, too. And what about when Joe Biden tried to work around a Supreme Court ruling invalidating his move on student loans?\n\nBut Americans clearly see a difference with Trump.\n\nFor one, in that last poll mentioned above, only about 2 in 10 voters said Trump’s then-opponent, Kamala Harris, was a fascist — less than half of Trump’s number.\n\nFor another, the Washington Post-Ipsos poll showed just 34 percent of Americans thought Biden had exceeded his authorities, compared with Trump’s 62 percent.\n\nAnd perhaps tellingly, the AP-NORC poll in April showed a majority of Americans suddenly wanted to restrict that presidency in ways they hadn’t before. The percentage who said a president has “too much” power rose from 32 percent last year (under Biden) all the way up to 54 percent (under Trump).\n\nAll of which suggests Americans — or at least a majority of them — see something extraordinary happening right now.\n\nRepublicans can try to diminish the “No Kings” rallies all they want, but they’re speaking to something that’s very real to lots of people.","summary":"Republicans have spent many days trying to marginalize the massive anti-Trump “No Kings” rallies held across the country over the weekend. They’ve argued the people involved were extremists and even predicted they would be violent (which turned out not to be true). They’ve claimed the protesters hate America. And they’ve argued that the “No Kings” &#8230;\n\n\nThe post Republicans are ridiculing ‘No Kings.’ A striking new poll shows Americans aren’t laughing appeared first on Egypt Independent.","url":"https://egyptindependent.com/republicans-are-ridiculing-no-kings-a-striking-new-poll-shows-americans-arent-laughing/","image":"https://amayei.nyc3.digitaloceanspaces.com/2025/10/c-2025-10-18t152352z-1448845292-rc2feharbkr9-rtrmadp-3-usa-trump-protests_jpg.jpg","video":null,"publish_date":"2025-10-22 12:16:33","author":"CNN","authors":["CNN"],"language":"en","category":"politics","source_country":"eg","sentiment":-0.316},{"id":371576026,"title":"Republicans are ridiculing ‘No Kings.’ A striking new poll shows Americans aren’t laughing","text":"Republicans have spent many days trying to marginalize the massive anti-Trump “No Kings” rallies held across the country over the weekend.\nThey’ve argued the people involved were extremists and even predicted they would be violent (which turned out not to be true). They’ve claimed the protesters hate America. And they’ve argued that the “No Kings” message itself is nonsensical, given President Donald Trump is a democratically elected president who sometimes works with Congress.\nTrump said Sunday that the people were “not representative of this country.” He and his team have taken to mockingly posting memes and AI videos with Trump donning a crown — including one that the president shared in which he dumps brown waste on protesters.\nHouse Speaker Mike Johnson added Monday night on Fox News that the protesters’ messages were “completely the opposite of what America was founded upon.”\nNew polling, though, reinforces how much the thrust of the “No Kings” message has resonated with much of the American public.\nIn fact, a majority of Americans appear sympathetic to it, at least to some extent. And their ranks appear to be growing.\nThe survey from the Public Religion Research Institute gave people two options. One was that Trump is a “potentially dangerous dictator whose power should be limited before he destroys democracy.” The other was that he’s a “strong leader who should be given the power he needs to restore America’s greatness.”\nAmericans chose the “dictator” option by a strong margin, 56 percent-41 percent.\nAnd notably, that margin has nearly doubled since April, when Americans also sided with the “dictator” option but by a smaller, 52 percent-44 percent margin.\nThe same poll also showed a 54 percent majority sided with the view that Trump is waging an “assault on constitutional balances and the rule of law.” The alternative was that his overhaul of the federal government is “a long-overdue correction of disastrous policies” (43 percent).\nIt’s possible to oversell poll numbers like this. Giving people binary choices can inflate numbers by making people choose one extreme or another. People who don’t like Trump but don’t think he’s a dictator might feel compelled to choose the “dictator” option to avoid endorsing a man they don’t like.\nBut tellingly, the poll also asked people about the strength of their views. Fully 45 percent of Americans said they “strongly” agreed Trump was a dangerous dictator, and 43 percent strongly agreed that he’s waging an assault on checks and balances and the rule of law.\nIn both cases, nearly half of independents strongly agreed with those sentiments.\nThese are, to put it mildly, not insignificant numbers. Say what you will about elements of the “No Kings” rallies; this polling suggests the thrust of the demonstrations hardly appears ridiculous to a majority of Americans.\nAnd this is merely the latest indicator that huge numbers of Americans have such concerns.\nClear majorities see him exceeding his powers\nWhether “dictator” or “king” are particularly apt labels, Americans are clearly sympathetic to the idea that Trump is abusing his power.\n 56 percent said Trump had gone “too far” in “using the power of the presidency and executive branch,” according to a July CNN poll. That was up from 52 percent in February. \n 57 percent said Trump had gone “too far” in using presidential power to achieve his goals, according to an April AP-NORC poll. \n 62 percent said Trump has gone beyond his authority as president, according to a September Washington Post-Ipsos poll. \n 69 percent said Trump was exercising more presidential power than other recent presidents, and 49 percent said both that and that it was “bad” for the country, according to a September Pew Research Center poll. \n 54 percent of registered voters said he is “exceeding the powers available to him,” according to a September New York Times-Siena College poll. (That included nearly 1 in 5 Republicans.) \nAmid the rallies Saturday, a number of conservatives argued that invoking “Kings” was a non sequitur, given Trump was popularly elected in 2024.\n“I don’t understand how Trump is a King when he won every single swing state, the electoral college and popular vote in a democratic election,” said Meghan McCain.\nFox News analyst Brit Hume noted that at least some of Trump’s policies have gotten congressional approval. “Some King,” he said.\nBut there is no question that Trump has disregarded the limits of his authority — and disregarded Congress — in extraordinary ways. The protesters don’t seem to be arguing that Trump is technically a monarch, so much as that he’s seeking to exercise unchecked power when he can.\nAnd that seems to be an argument that a majority of Americans sympathize with.\nMany have worried about this for a long time\nIf anything, these concerns already existed and have just gotten more pronounced as Trump has grabbed for more power.\nBefore Trump’s second term began:\n Americans were about evenly split on whether he would try to rule as a dictator, with 40 percent predicting he would and 41 percent disagreeing, according to a December Washington Post-University of Maryland poll. \n 53 percent said it was at least “somewhat likely” he would act as a dictator, according to a December Reuters-Ipsos poll. \n 53 percent of voters said they were “concerned” by Trump’s 2023 comment — he claims it was a joke — that he wanted to be a dictator for a day, per a Quinnipiac University poll. \n 49 percent of voters said Trump was a “fascist” in an October 2024 ABC News-Ipsos poll. \nIt’s not just a partisan thing\nIt might be tempting to look at these numbers and think, well, it’s just partisan.\nA decade ago, many Republicans accused Barack Obama of acting like a king, too. And what about when Joe Biden tried to work around a Supreme Court ruling invalidating his move on student loans?\nBut Americans clearly see a difference with Trump.\nFor one, in that last poll mentioned above, only about 2 in 10 voters said Trump’s then-opponent, Kamala Harris, was a fascist — less than half of Trump’s number.\nFor another, the Washington Post-Ipsos poll showed just 34 percent of Americans thought Biden had exceeded his authorities, compared with Trump’s 62 percent.\nAnd perhaps tellingly, the AP-NORC poll in April showed a majority of Americans suddenly wanted to restrict that presidency in ways they hadn’t before. The percentage who said a president has “too much” power rose from 32 percent last year (under Biden) all the way up to 54 percent (under Trump).\nAll of which suggests Americans — or at least a majority of them — see something extraordinary happening right now.\nRepublicans can try to diminish the “No Kings” rallies all they want, but they’re speaking to something that’s very real to lots of people.","summary":"Republicans have spent many days trying to marginalize the massive anti-Trump “No Kings” rallies held across the country over the weekend. They’ve argued the people involved were extremists and even predicted they would be violent (which turned out not to be true). They’ve claimed the protesters hate America. And they’ve argued that the “No Kings” &#8230;\n\n\nThe post Republicans are ridiculing ‘No Kings.’ A striking new poll shows Americans aren’t laughing appeared first on Egypt Independent.","url":"https://www.egyptindependent.com/republicans-are-ridiculing-no-kings-a-striking-new-poll-shows-americans-arent-laughing/","image":"https://amayei.nyc3.digitaloceanspaces.com/2025/10/c-2025-10-18t152352z-1448845292-rc2feharbkr9-rtrmadp-3-usa-trump-protests_jpg.jpg","video":null,"publish_date":"2025-10-22 12:16:33","author":"CNN","authors":["CNN"],"language":"en","category":"politics","source_country":"eg","sentiment":-0.316},{"id":371540962,"title":"Right-wing podcast stars including Tucker Carlson and Candace Owens in line for Golden Globes award","text":"The Golden Globes recently announced the 25 nominees for its inaugural Best Podcast category, with MAGA favorites Tucker Carlson, Candace Owens, Megyn Kelly, Ben Shapiro, and Theo Von in the running.\n\nThe award will be presented at the 83rd annual Globes ceremony on January 26, 2026, and places the right-wing broadcasters, many of whom regularly peddle conspiracy theories, in a category alongside established news and politics shows like The Daily from The New York Times, Up First from NPR, and Pod Save America.\n\nOther popular shows nominated include The Joe Rogan Experience, Good Hang with Amy Poehler, and Call Me Daddy with Alex Cooper.\n\nNow, according to Status, the company behind the ceremony, Penske Media Corporation, has sent out “a pitch deck… to at least some of the shows eligible for the awards,” explaining that they are “selling marketing packages – costing upwards of $75,000 – that allow podcasters to promote their programs directly to Globes voters who will determine the winner.”\n\nWhile nominated artists and shows have consistently lobbied for industry awards, Status writer Oliver Darcy argues that the difference this time is that PMC CEO Jay Penske owns not just the Globes but also the entertainment media outlets Variety, Rolling Stone, Deadline Hollywood, Billboard, and The Hollywood Reporter.\n\n“In other words, the same corporate entity now both sets the stage and writes the glowing coverage,” Darcy states.\n\nHe explains that a nominee paying out for one of the $75,000 marketing packages means “someone like Carlson or Owens can pay tens of thousands of dollars to be feted by Variety, handed a trophy, and lavished with glowing coverage and social promotion from one of the industry’s most influential and renowned publications.\n\n“The potential for a ‘paid sponsorship’ disclosure might technically separate the advertisements from the outlet’s traditional editorial, but the effect is the same: PMC is offering far-right influencers who thrive on outrage a glossy stage and an endorsement of legitimacy.”\n\nThe Independent has reached out to Penske Media for comment.\n\nThe podcast sector is booming at present, and right-wing shows were credited with helping President Donald Trump regain the White House last November by enabling the Republican ticket to zero in on young men in particular and court their vote.\n\nTrump’s son Barron is believed to have been guiding the strategy in this field. At the same time, Democratic candidate Kamala Harris’s decision not to agree to a guest spot on Rogan’s show, unlike her rival, was seen as a blow to her campaign and led to criticism of her advisers for misreading the post-pandemic media landscape.\n\nThe president was spoofed, appearing on a fictional teen podcast called Snack Homiez alongside Sabrina Carpenter on the latest episode of Saturday Night Live over the weekend.","summary":"Megyn Kelly, Ben Shapiro, and Theo Von among other nominees for inaugural ‘Best Podcast’ gong","url":"https://www.independent.co.uk/news/world/americas/us-politics/golden-globes-best-podcast-maga-trump-b2849993.html","image":"https://static.independent.co.uk/2025/07/29/17/38/Screenshot-Capture-2025-07-29-12-17-07.png?crop=924,616,x124,y0&trim=0,124,0,124&width=1200","video":"https://cdn.jwplayer.com/videos/EDfbdQmz-kPrKkZNL.mp4","publish_date":"2025-10-22 11:52:25","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":0.174},{"id":371590676,"title":"Ivanka Trump Once Had a Crush on Axl Rose — The Rockstar Who Trashed Her Dad","text":"As a member of the Trump family, Ivanka Trump continues to be under the spotlight, for one reason or the other. Recently, she is being widely discussed because of her previous relationships after her brother Eric Trump revealed an unexpected teenage crush she once had. \n\nEric’s recent memoir, Under Siege, discusses how Ivanka, as a teenager, was infatuated with Axl Rose, the notorious Guns N’ Roses frontman. Eric recalls Ivanka’s room in Trump Tower featuring a signed poster of Rose, complete with his bandana, tattoos, and rockstar swagger. \n\nAxl Rose CRAZY Vocals, 1991.\nAs surprising as it sounds, he had a foot injury at the time! #GunsNRoses pic.twitter.com/NxBp1lYUhf\n— 🎸 Rock History 🎸 (@historyrock_) February 8, 2024\n\nWhat really got the internet talking, however, wasn’t just Ivanka’s admiration for the rock star, but the fact that Axl Rose is known for his outspoken dislike of President Donald Trump. At a 2016 Mexico City concert, Rose encouraged the crowd to destroy a piñata that looked like Trump. \n\nIn 2018, he also tweeted that Ivanka’s role in Trump’s administration was “inappropriate,” further fueling the notion that Ivanka has a penchant for men hostile to her father.\n\nWhen Daily Mail readers caught wind of Eric’s revelation, reactions ranged from pure surprise to harsh criticism. “I didn’t see that coming… Ivanka had curious taste as a young girl,” one comment read. \n\nFor many, the news triggered memories of another of Ivanka’s supposed romantic connections, with legendary music producer Quincy Jones. In a widely-circulated 2018 interview with Vulture, Jones himself shared that he once went on a date with Ivanka around 2006. \n\nHe claimed fashion designer Tommy Hilfiger arranged the meeting through his daughter, Kidada. Jones didn’t hold back his praise, calling Ivanka “attractive” and saying she had “the most beautiful legs I ever saw in my life.”\n\nNow, the one thing common between both Jones and Rose is their open disliking of Trump. Talking about Trump, Jones mentioned him as “a megalomaniac, narcissistic. I can’t stand him.” \n\nThe music mogul also said, “He’s just telling uneducated rednecks what they want to hear.” Some reports cast doubt on the story at the time, quoting an unnamed source as saying, “This story is not true.”\n\nHold on to your Nickers I just heard the interview and read the article\nQuincy Jones says he once dated Ivanka Trump 12 yrs ago. @IvankaTrump\nThe man’s 84 yrs old say that a lot ppl die with telling their life story Quincy says he is telling his pic.twitter.com/tGb94c45B8\n— Tricia (@queentrucker) June 5, 2023\n\nJones, however, stood by his version. He continued his criticism of Trump throughout his life and even donated to Kamala Harris’ campaign in 2019. Jones also kept speaking openly against Trump’s presidency until his own death in 2024.\n\nThis apparent pattern in Ivanka’s love life, linking herself to men who publicly disparage her father, has sparked a barrage of commentary online. “Most people hate Don. She can’t eliminate everyone,” read one remark. Another dismissed the drama with humor, “I hear she had a crush on Big Bird when she was 3 years old and Big Bird is a Trump hater.”\n\nA more critical voice said, “I love Trump but Ivanka is repulsive—grabbing fame and turning on her father—go away! How did the Trump boys turn out so well and Ivanka so self-obsessed.”\n\nThe discussion was further fueled recently when Ivanka and her husband, Jared Kushner, were spotted near Beyoncé and Jay-Z at a charity event in Atlantic City. The Carters, well-known Democratic supporters, were reportedly seated at the same table, which led to netizens observing the same pattern of Ivanka associating herself with people who openly criticize her father.\n\nHowever, such continuous drama has not stopped Ivanka from talking about her loyalty to her family and also the kind of toxicity that politics brings. On the Him & Her Show podcast in January, she explained, “There’s a darkness in that world that I don’t really want to welcome into mine.” She added, “Some people love the gladiator aspect of it — the fight. That was never me.” \n\nHer words show she understands the complexity of the family she is a part of and yet she is ready to stand her own ground and make her own choices, including in matters of the heart​.","summary":"Ivanka’s dating history has led to netizens making a curious observation.","url":"https://www.inquisitr.com/ivanka-trump-once-had-a-crush-on-axl-rose-the-rockstar-who-trashed-her-dad","image":"https://www.inquisitr.com/wp-content/uploads/2025/10/Ivanka-Trumps-romantic-history-is-being-scrutinized-2.jpg","video":null,"publish_date":"2025-10-22 11:42:35","author":"Pramila Tripathi","authors":["Pramila Tripathi"],"language":"en","source_country":"us","sentiment":0.225},{"id":371494868,"title":"Democratic Candidate Graham Platner Denies Being ‘Secret Nazi’","text":"Maine Democratic Senate hopeful Graham Platner has denied being a “secret Nazi” after video emerged of him with a tattoo on his chest which resembles the Totenkopf, or “death’s head,” symbol adopted by the SS.\n\nNewsweek contacted Platner for comment via email on Wednesday outside of regular office hours.\n\nWhy It Matters\n\nPlatner, 41, is standing in the Democratic primary for the right to face Republican Senator Susan Collins at the 2026 midterm elections. Maine backed Kamala Harris by around seven points in November 2024 and Collins is widely regarded as one of the most vulnerable Republican senators. \n\nDemocrats are hoping to seize control of the Senate in November 2026, a move that would significantly impede President Donald Trump’s ability to enforce his policy agenda.\n\nThe revelation about Platner’s tattoo could impact his popularity with Democratic primary voters and comes after controversial posts he made on Reddit were revealed by several media publications. \n\nSenate candidate Graham Platner speaks at a town hall at the Franco Center in Lewiston, Maine, on October 15, 2025. \n\nWhat To Know\n\nPlatner, a former U.S. Marine who has been endorsed by Bernie Sanders, was interviewed by former Barack Obama spokesperson Tommy Vietor on the popular Pod Save America podcast. \n\nDuring the interview Vietor played a clip of Platner serenading his sister-in-law with Miley Cyrus’ “Wrecking Ball’ during her wedding a decade ago wile wearing only his underpants. In the video Platner has a skull and crossbones tattoo, which resembles the Totenkopf, on his chest. According to the Anti-Deformation League the Totenkopf was adopted by the SS and was particularly associated with the SS-Totenkopfverbande, which was responsible for guarding concentration camps.\n\nPlatner said he had got the tattoo in Split, Croatia, in 2007 while on leave with a group of fellow Marines commenting: “We got very inebriated and we did what Marines on liberty do and we decided to go get a tattoo.\n\nVietor said the video had been provided by Platner’s team, with the Senate hopeful saying he had “got wind that in the opposition research somebody was shopping the idea that I was a secret Nazi with a hidden Nazi tattoo.”\n\n“And we went to a tattoo parlor in Split, Croatia, and we chose a terrifying looking skull and crossbones off the wall because we were Marines and, you know, skulls and crossbones are a pretty standard military thing, and we got those tattoos and then we all moved on with our lives.”\n\nThe U.S. military has a policy that checks for extremist, racist and sexist tattoos. Platner said he had never tried to hide his tattoo and had passed security clearance to join the army national guard after leaving the Marines and later for the state department when he worked as security detail for the U.S. ambassador to Afghanistan.\n\nHe insisted “I am not a secret Nazi” adding: “Actually if you read through my Reddit comments I think you can pretty much figure out where I stand on Nazism and antisemitism and racism in general, I would say a life-long opponent.”\n\nPod Save America shared a clip of the exchange via X on Tuesday where it went viral, receiving over 1.2 million views.\n\nNEW: Graham Platner reacts to recently resurfaced video of him singing shirtless at a wedding and an opposition research attack alleging he's a \"secret nazi.\" Full interview out now on the Pod Save America YouTube. pic.twitter.com/r8GEePCPLP— Pod Save America (@PodSaveAmerica) October 21, 2025\n\nEarlier this month Platner was embroiled in controversy when CNN reported since deleted Reddit posts he made, dating back to 2021. In one post Platner said he “became older and became a communist” while in another he replied “Living in white rural America, I’m afraid to tell you they actually are” after somebody suggested white people “aren’t as racist or stupid as Trump thinks.” \n\nIn further Reddit posts attributed to Platner by publications including Politico, The Washington Post, The Hill, and the Bangor Daily News he said Black people usually only tip “between 0-5%” and referring to underwear designed to prevent sexual assault in 2013 said people should “take some responsibility for themselves and not get so f***** up they wind up having sex with someone they don’t mean to?”\n\nSpeaking to Politico about the posts Platner said: “I made dumb jokes and picked fights. But of course I’m not a socialist. I’m a small business owner, a Marine Corps veteran, and a retired s*** poster.”\n\nWhat People Are Saying\n\nGenevieve McDonald, a former state representative who resigned as Platner’s political director over his Reddit posts, responded to the tattoo revelation on X, formerly Twitter.\n\nShe said: “Graham has an antisemitic tattoo on his chest. He’s not an idiot, he’s a military history buff. Maybe he didn’t know it when he got it, but he got it years ago and he should have had it covered up because he knows damn ...","summary":"Platner is in the spotlight for a tattoo and his political director resigned after controversial Reddit posts were revealed.","url":"https://www.newsweek.com/democratic-candidate-graham-platner-denies-being-secret-nazi-10917579","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/AP25293626326255.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-22 09:14:24","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.165},{"id":371487152,"title":"DNC pays $1.6 million more for Kamala Harris' campaign debt","text":"Driving the news: Harris spent an unprecedented $1.5 billion during her 107-day campaign, and invoices continue to roll into the DNC nearly a year later.\n\nThe DNC had only about $12 million in cash on hand by the end of September, as the party made investments in campaigns in Virginia and New Jersey, along with other state parties.The DNC usually covers such debts after a presidential campaign, but such obligations can still make it harder for a losing party to rebuild for the next election cycle.Democratic officials aren't sure how much more outstanding debt there is from Harris' campaign, people familiar with the matter told Axios.\n\nFlashback: The DNC also was on the hook for more than $20 million in debt after Barack Obama's reelection in 2012.\n\nEven with Obama helping to raise funds in the years afterward, the DNC didn't fully pay off the debt until 2015. That left the committee in a vulnerable position heading into the 2016 election, which Hillary Clinton ultimately lost to Donald Trump.\n\nWhat they're saying: Harris and the DNC declined to comment.","summary":"The Democratic National Committee paid $1.6 million in September to cover debt from Kamala Harris' 2024 campaign — bringing the DNC's total payout to the campaign to more than $20 million, and counting.\n\nWhy it matters: The DNC is trying to rebuild in the aftermath of 2024, and is being hampered by debts the party racked up last year.\n\nDriving the news: Harris spent an unprecedented $1.5 billion during her 107-day campaign, and invoices continue to roll into the DNC nearly a year later.\n\n\nThe DNC had only about $12 million in cash on hand by the end of September, as the party made investments in campaigns in Virginia and New Jersey, along with other state parties.\nThe DNC usually covers such debts after a presidential campaign, but such obligations can still make it harder for a losing party to rebuild for the next election cycle.\nDemocratic officials aren't sure how much more outstanding debt there is from Harris' campaign, people familiar with the matter told Axios.Flashback: The DNC also was on the hook fo","url":"https://www.axios.com/2025/10/22/dnc-kamala-harris-campaign-debt","image":"https://images.axios.com/kM_YWxPQuN-PLGUVCG26hLk3M7M=/0x0:5854x3293/1366x768/2025/10/21/1761085538076.jpg","video":null,"publish_date":"2025-10-22 09:05:04","author":"Alex Thompson","authors":["Alex Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.106},{"id":371494876,"title":"Toxic California: Democrats Don’t Want to Succeed Gavin Newsom as Governor","text":"Gavin Newsom will step down as governor of California in January 2026, after serving the constitutionally mandated maximum of two terms, offering an opening for Democrats interested in running what is now the world’s fourth biggest economy. \n\nHowever a number of prominent California Democrats, including former vice president Kamala Harris, have announced they won’t stand while others such as Senator Alex Padilla have yet to declare their intentions.\n\nSpeaking to Newsweek one prominent political scientist said she was “surprised there isn’t a bigger name candidate,” while another suggested the candidate pool had been reduced by difficulties some Democratic mayors in California have had running their respective cities.\n\nNewsweek contacted the California Democratic Party for comment on Tuesday via email outside of regular office hours.\n\nAccording to data published in April by the International Monetary Fund (IMF) and the Bureau of Economic Analysis California has overtaken Japan to become the fourth biggest economy in the world, with the IMF calculating its 2024 GDP at $4.1 trillion.\n\nThe California governorship has a track record of acting as a steppingstone to the White House with two former governors of the state, Richard Nixon and Ronald Reagan, going on to serve as president. Newsom, who has repeatedly gone viral taunting President Donald Trump on social media, is widely regarded as one of the potential front-runners for the 2028 Democratic presidential nomination.\n\nThe Candidates\n\nThus far a number of Democrats have announced they are running in the party’s primary for the 2026 California gubernatorial election. These include House Democrat Katie Porter, former U.S. Health Secretary and ex-Attorney General of California Xavier Becerra, Ian Calderon, formerly the majority leader in the California Assembly, ex-California State Controller Betty Yee and Antonio Villaraigosa, who served as mayor of Los Angeles from 2005 to 2013.\n\nA Citrin Center/Politico poll of 1,445 registered California voters conducted between July 28 and August 12 found Porter in the lead on 15 percent, ahead of Republican candidates Chad Bianco and Steve Hilton with 15 percent and 10 percent respectively.\n\nFormer U.S. Vice President Kamala Harris in Atlanta, Georgia in 2025 (left) and Katie Porter in front of the U.S. Capitol on July 25, 2023, in Washington, D.C. (right). (Paras Griffin/Alex Wong/Getty Images)\n\nHowever Porter sparked controversy by threatening to leave an interview after becoming frustrated with follow-up questions, and a Zogby Strategies poll of 1,000 likely voters conducted over September 7 to 9 put her on 23 percent of the vote, behind British-born Hilton on 29 percent.\n\nJust as notable however are the potential candidates who have either declined to run, or are yet to enter the race.\n\nIn July, Harris said she wouldn’t be running for the governorship of California commenting “for now, my leadership, and public service, will not be in elected office.”\n\nSenator Alex Padilla, the California Democrat who shot to national attention in June when he was forcibly removed from a news conference hosted by Homeland Security Secretary Kristi Noem, has yet to announce a run, as has California’s other Senator, Adam Schiff, who led President Trump’s first impeachment trial in the House. \n\nWhen asked in March by Politico what he thought about the Democratic primary field, California Attorney General Rob Bonta, who has also ruled out a gubernatorial run, commented: “No one has stood out to me.” \n\nCalifornia Lieutenant Governor Eleni Kounalakis initially said she would run for governor, but in August announced she was dropping out and would stand for state treasurer instead.\n\nSpeaking to Newsweek Professor Sarah Hill, a political scientist who teaches at California State University, commented: “I’m surprised there isn’t a bigger name candidate. Katie Porter has been leading the pack, but if you look at her political experience, it’s actually very limited (and we’ll see what happens in the polls after her recent difficulties).”\n\nShe added: “Here’s what I haven’t been able to figure out, and I’ve been asking around, but so far no one has a good answer: Why hasn’t the Democratic Party rallied around Xavier Beccera as a strong candidate (through endorsements and such)? He’s actually the best qualified at this point. He was popular in Congress and has served as the California Attorney General, which is a very common step to becoming Governor. He also has experience as the Secretary of Health and Human Services, so his resume is great for Governor; I think it’s the strongest in the field.\n\n“If Democrats do get Alex Padilla to run, it seems like he’ll be the favorite. But without him, I’m really curious about why Xavier Beccera hasn’t taken off as a preferred candidate.”\n\nProfessor Benjamin Bishin, an American politics ex...","summary":"A number of prominent California Democrats have either ruled themselves out of running to replace Newsom, or are yet to declare.","url":"https://www.newsweek.com/toxic-california-democrats-dont-want-to-succeed-gavin-newsom-as-governor-10914729","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/Toxic-California-Democrats-Dont-Want-to-Succeed-Gavin-Newsom-as-Governor.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-22 09:00:00","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.181},{"id":371546828,"title":"Democrats demonstrate their creeping embrace of Marxism with &#39;No Kings&#39; protest","text":"The “No Kings” protests over the weekend embodied the self-indulgence of the left. Bankrolled by the usual leftist nongovernmental organizations and the Communist Party USA, the occasion turned out to be struggle sessions for elderly White liberals eager to denounce President Trump.\n\nMr. Trump is the duly sworn-in leader of a constitutional republic. He won two Republican primaries and at least two general elections. First, he prevailed over Hillary Clinton, who believed she had a divine right to rule because she was married to former President Bill Clinton. The New York Times all but anointed her victor in the race a month before the 2016 ballots were cast, announcing she had a 93% chance of victory.\n\nMr. Trump also defeated Vice President Kamala Harris, an unpopular figure who trailed in the 2016 Democratic primary. A handful of party elites decided she should inherit the role after the public recognized that President Biden was, and always had been, an empty suit carefully managed by courtiers.\n\nAs commander in chief, Mr. Trump governs with restraint. Unlike his Democratic predecessors who ignored the Supreme Court rulings they didn’t like, Mr. Trump follows even the partisan decrees of Democratic-appointed district court judges who seek to sabotage the agenda that voters endorsed.\n\nThese inferior magistrates are wielding imperial power, but No Kings isn’t picketing their courthouses. That’s because “No Kings” is a slogan from the marketing agency hired to run an operation with millions of dollars in funding from the foundations of George Soros and other far-left billionaires. Were it otherwise, No Kings malcontents in London and Toronto would be directing their vitriol at Buckingham Palace.\n\nKing Charles III is head of state of England and Canada. Perhaps that’s easy to forget in the Great White North given the remote nature of his majesty’s reign, but Canada’s $20 bill will soon feature his visage as a reminder. Until then, it commemorates Queen Elizabeth II.\n\nThis isn’t a problem because leftists don’t oppose monarchy. They espouse a sentiment fit for a bumper sticker that distracts attention from their own dictatorial tendencies. Speakers at the No Kings rallies are the people who brought you lockdowns, forced masking, cancel culture and censorship.\n\nThese 21st-century Bolsheviks are on a mission to divide the nation so it can be refashioned without a limit on the federal government’s authority to meddle in our lives. As House Speaker Mike Johnson put it, No Kings unites “Marxists, socialists, antifa supporters, anarchists and the pro-Hamas faction of the far-left Democrats. This is the face of today’s Democratic Party.”\n\nRed flags abound with participants vocalizing support for the likes of Luigi Mangione and Charlie Kirk’s assassin. These riffraff increasingly threaten the stability of polite society as they “resist” whatever the Democratic Party aristocrats tell them they should hate. Liberal prosecutors and judges ensure anyone acting on these marching orders escape punishment for the mayhem they cause.\n\nMr. Trump trolled the vulgar sign wavers over the weekend with artificial-intelligence-generated images of himself sporting a crown, mocking the No Kings charade.\n\nThe chieftains who oversee the one-party states in China, Cuba and Venezuela don’t wear the trappings of royalty, but they are kings in all but name. Those are the regimes that the No Kings organizers hope to emulate.\n\nThus, No Kings isn’t about defying “authoritarianism.” It’s about replacing Western values and tradition with the tyranny of unelected bureaucrats. No thanks.","summary":"Democrats demonstrate their creeping embrace of Marxism with &#39;No Kings&#39; protest","url":"https://www.washingtontimes.com/news/2025/oct/20/editorial-democrats-demonstrate-creeping-embrace-marxism-no-kings/","image":"https://media.washtimes.com/media/image/2025/10/18/US_No_Kings_Protest_Washington_70147.jpg","video":null,"publish_date":"2025-10-22 06:12:40","author":"Editorial Board","authors":["Editorial Board"],"language":"en","source_country":"au","sentiment":0.011},{"id":371546830,"title":"Letter to the editor- Modern Democratic Party is off the rails","text":"It’s clear that marketing gurus have chosen the word “democracy” as the trigger word for all Democratic politicians to use — and use often. At the same time, it’s clear that the Democrats have no idea what the word means or how, when or where to use it.\n\nThe other fact now made painfully clear is that liberals and their politician friends haven’t the slightest clue as to what “king” means or what a king even is, other than just another trigger word they have been told to employ as frequently as possible.\n\nIn America in 2025, the Democratic Party proudly supports electing a Muslim communist for mayor in New York City. They also believe former Vice President Kamala Harris and Rep. Alexandria Ocasio-Cortez are the best candidates they have and should be elected president and vice president, respectively, in 2028.\n\nThese same Democrats and liberals also believe that President Trump is a racist dictator, that his Cabinet and the 77 million Americans who voted for him are Nazis and that America should have no sovereignty as a nation.\n\nThe last flicker of hope for sanity and clarity for the self-imploding Democratic Party is now Sen. John Fetterman of Pennsylvania.\n\nGARY A. GUBISCH\n\nSelbyville, Delaware","summary":"Letter to the editor- Modern Democratic Party is off the rails","url":"https://www.washingtontimes.com/news/2025/oct/21/letter-editor-modern-democratic-party-rails/","image":"https://media.washtimes.com/media/image/2023/08/11/080823-twt-promo-editor-900x542.jpeg","video":null,"publish_date":"2025-10-22 06:12:27","author":"Threat Status","authors":["Threat Status"],"language":"en","category":"politics","source_country":"au","sentiment":-0.247},{"id":371434438,"title":"Use humour to make powerful statements: Ben Stiller's advice during \"challenging\" Trump's second term","text":"ANIBen Stiller \n\nActor, director, and producer Ben Stiller opened up on the state of comedy and termed the current circumstances \"challenging\" for comedians during US President Donald Trump's second term. Stiller, in an interview to a British magazine during the promotion of his new Apple TV documentary 'Stiller & Meara: Nothing Is Lost,' reflected on the difficulties comedians face today.\"We live in a world where taking chances with comedy is more challenging,\" Stiller said. \"You're seeing that front and center in our country.\"Stiller offered advice to comedians, encouraging them to stay true to their craft and continue using humor to make powerful statements amid challenging times.\"But I think it's important that comedians keep doing what they're doing, speaking truth to power and being free to say what they want. That's the most important thing,\" he continued.Live EventsAccording to the report, Stiller's comments come after Disney temporarily suspended Jimmy Kimmel Live! last month after receiving backlash over a comment made by host Jimmy Kimmel during his September 15 episode. The remark was criricised online, including from FCC chair Brendan Carr. Stiller was among several Hollywood figures who came to Kimmel's defense, writing on X, \"This isn't right.\"Stiller has been outspoken about politics and previously voiced his support for Kamala Harris ahead of the 2024 presidential election. He also participated in the \"Unite For America\" call hosted by Oprah Winfrey last year.Stiller has lately been focused on producing television projects, including the Emmy-winning drama 'Severance'. He ispopular for his comedy work in films like 'Zoolander,' 'Tropic Thunder,' 'Meet the Parents,'' and 'Night at the Museum.'Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onBen StillercomedyDonald TrumpJimmy KimmelHollywoodDisneystillerOprah Winfreyjimmy kimmel livekamala harris\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onBen StillercomedyDonald TrumpJimmy KimmelHollywoodDisneystillerOprah Winfreyjimmy kimmel livekamala harris(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Ben Stiller finds comedy's current landscape \"challenging,\" particularly during the Trump administration, urging comedians to remain fearless in speaking truth to power.  His remarks follow backlash against Jimmy Kimmel, whom Stiller defended.  The actor, known for his political activism and producing acclaimed shows like 'Severance,' emphasizes humor's vital role in making powerful statements.","url":"https://economictimes.indiatimes.com/news/international/global-trends/use-humour-to-make-powerful-statements-ben-stillers-advice-in-challenging-trumps-second-term/articleshow/124734540.cms","image":"https://img.etimg.com/thumb/msid-124734582,width-1200,height-630,imgsize-99528,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-22 06:05:56","author":"Oprah Winfrey","authors":["Oprah Winfrey"],"language":"en","category":"politics","source_country":"in","sentiment":0.131},{"id":371433766,"title":"Opinion: Fine Gael's confused campaign branding has done nothing to help Humphreys","text":"We need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nDaft.ie Property\nAllianz Home\nThe 42 Sport\nTG4 Entertainment\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nThe campaign period has offered an interesting case study in political brand management.Alamy\n\nThe First Name Treatment\n\n Fine Gael's confused campaign branding has done nothing to help Humphreys\n\nFine Gael’s campaign hasn’t been clear in painting a picture of the person they are asking the electorate to vote for, writes Gerard O’Shea. \n\n7.01am, 22 Oct 2025\n\nShare options\n\n“FOR DIEGO, I would go to the end of the world… But with Maradona, I wouldn’t take a step.”\n\nThis quote from Fernando Signorini, who was personal trainer to the great Argentinian footballer, highlights the difference between the private and public personas, between the person and their job. Diego was the man, Maradona was the footballer.\n\nIn politics, the use of a first name in campaigning – formally or informally – is perhaps rarer, but there are some notable examples.\n\nIn Ireland, we have Bertie (Ahern, former Taoiseach). In Britain, there’s Boris (former Prime Minister Johnson). Other examples include Jacinda, Kamala and Hillary (Ardern, Harris and Clinton respectively).\n\nOf course, the relative rarity of these names is a factor, but by ‘firstnaming’ a politician, the tactic is clear: portray them as relatable, immediate, one of the people.\n\nStrategically, the implication is even more stark – the campaign wants you to identify with and vote for the person, not the politics. It’s an attempt to shift the dial away from the head and towards the heart, away from policy and towards what Sean Moncrieff in the Irish Times called “vibes.” Boris is the person, Johnson is the politician. We’re asking you to vote for the person.\n\nFine Gael’s material for the 2024 Presidential Election campaign seems to make clear their approach to promoting their candidate: “Heather for President” – not Humphreys. Heather is the person, Humphreys is the politician.\n\nThe issue is that the rest of their campaign doesn’t seem aligned with this strategy.\n\nThe shifting sands of the Irish presidency\n\nPrior to 1990, every single Irish President was either nominated by or represented Fianna Fáil.\n\nOf the nine elections, only four were contested, all by Fine Gael providing the opponent.\n\nOnly once, in 1945, did a third candidate stand, and predictably finished third. In essence, the Presidential race was always one Fianna Fáil candidate versus one non-Fianna Fáil candidate.\n\nParty politics mattered, and to an extent, so did policy.\n\nNot necessarily what policies the President could enact, which they have no power to do, but whose career had most entitled them to a comfortable political retirement in Áras an Uachtarán.\n\nThe 1990 election changed all that.\n\nMary Robinson was elected – the first time Fianna Fáil’s pick had not won, the first time a woman had even stood, and the first time a woman had been elected.\n\nAdvertisement\n\nFianna Fáil’s candidate restored normal order in 1997, but it was different by then.\n\nRobinson, and subsequently Mary McAleese and Michael D. Higgins, were elected as much because of who they were as because of what they had done.\n\nHeather Humphreys’s campaign\n\nHeather Humphreys is evidently a very capable politician. She served as a TD for fourteen years, eleven of those as a minister across five different departments. She is clearly very well qualified to run for the role of president.\n\nThe problem is Fine Gael are asking people to vote for Heather, not Humphreys. Heather is the person, Humphreys is the politician. If you ask voters to vote for a person, they need to know who they’re voting for. We know very little about Heather.\n\nFrom the outset, her campaign literature set the tone. Her flyer, sent to every household in the country, says very little about who she is. It tells us she loves the country, believes in communities and that she wants to be a unifying voice, but almost nothing about her as a person.\n\nIn fact, even if this was a flyer for Humphreys the politician, it still says very little about her political career – it mentions her “life experience” but provides no insight for the uninitiated as to what that experience is.\n\nAn election campaign leaflet for Heather Humphreys\n\nBy contrast, her election opponent, Catherine Connolly (incidentally, her literature is largely surname-led) tells us in her flyer that she is a mother, public representative, barrister and psychologist. Yes, this isn’t the sum of who she is, but it’s a start.\n\nPerhaps she had lower name recognition than Humphreys and needed this kickstart, but from this platform, throughout her campaign, Connolly has been the more relatable and more knowable person. Whether one agrees or disagrees with her policies, we’re getting a much clearer sense of who she is as a person. In a vibes election, these things matter.\n\nA party piece\n\nConnolly’s sporting prowess went viral when her keepie-uppies and basketball skills at a campaign event popped up on social media feeds across the country.\n\nIt seemed so good that some viewers thought it must be AI-generated content. But it wasn’t – it was us finding out something we didn’t know about somebody, an opportunity to get to know her that little bit more.\n\nInterviewed by RTÉ Drivetime a few days later, Connolly went into more detail on her sporting and family background. Humphreys, when asked if she too had any talents the public might not have known about, replied that her special skill was “listening”.\n\nThis was a fairly soft question in the scheme of a political interview. It was an easy opportunity to let us in a little bit on who Heather the person is. The answer, instead, was political – the kind of soundbite job interview answers people give when they don’t want to give anything away.\n\nIt was an answer from Humphreys when we were crying out to hear from Heather.\n\nStrategic rigidity vs electoral agility\n\nOf course, one might say the Fine Gael campaign was conceived at a time when there was going to be at least a third, and perhaps even a fourth, candidate in the race.\n\nIn that scenario, there was a logic to Humphreys remaining politically formal. The campaign could allow the two others who had perhaps more evident political weaknesses to target each other.\n\nRelated Reads\n\nHeather Humphreys' journey from 'take no crap' Clones councillor to Áras contender\n\nA Heather Humphreys poster in DublinAlamy Stock Photo\n\nAlamy Stock Photo\n\nThis was certainly the approach in the first three-way televised debate (although almost immediately, popular opinion suggested it hadn’t worked as well as hoped). If the campaign could be pitched as one involving Jim Gavin, a political rookie, and Connolly, whose views could easily be portrayed by opponents as extreme, competing hard with each other, Humphreys could remain above the fray and be seen as the one truly “Presidential” candidate.\n\nGavin’s withdrawal, less than three weeks before polling day, removed that possibility. It became a straight fight between Humphreys and Connolly. And after three weeks of campaigning, it started more and more to resemble a personality and popularity contest.\n\nThe political lessons\n\nEvery campaign is unique. Clearly, there were some bizarre occurrences in this election, not least Gavin’s dramatic withdrawal.\n\nPresidential elections are different to general elections. In general elections, we demand policy platforms, diplomacy and experience. Increasingly, in presidential elections, we look for the person who we like most, who we most identify with, who we think most closely reflects who we are and where we’re heading.\n\nDrawing specific lessons from one campaign can be difficult, but for Fine Gael and Team Humphreys, there are three key lessons to learn from this experience.\n\nKnow the ‘rules’.\n\nYou have to understand the terms of the election you’re in. If the contest is going to be about the popularity of the candidate, then the electorate need to get to know them. If it is going to be about policies and political experience, then those are the things you need to talk about. Fine Gael have never been clear about the type of election they want this to be, and the grounds they want to fight it on.\n\nBe consistent in your messaging.\n\nEverything about how Fine Gael have run this campaign suggests their candidate is Humphreys the politician, not Heather the person. That is an absolutely valid approach, but choosing to focus campaign posters and flyers, which are the main places most people will encounter the candidate, on “Heather” brought inconsistency and confusion to what they were asking people to vote for.\n\nPlay the game you find yourself in, not the one you want to be in. When UK Prime Minister Harold Macmillan was asked what was the greatest challenge for a statesman, he replied: ‘Events, dear boy, events’. The same is true of election campaigns.\n\nGavin’s withdrawal moved the goalposts in this campaign. The Humphreys strategy of remaining above the fray while the others slugged it out no longer works in a two-horse race. Campaigns need to stay true to their message, but be agile to reflect the new reality. Since it became a head-to-head between Connolly and Humphreys, the election has needed to be fought on those terms. Fine Gael need to convince people why they should vote for Heather.\n\nThe latest opinion poll from the Irish Times/Ipsos B&A on 16 October gave Catherine Connolly a commanding lead (60% to 32% excluding undecideds).\n\nOf course, large electoral leads have been turned around before. Humphreys has the backing of one of the Government coalition parties, the tacit support of most members of the others, and increasing public backing from high-profile politicians from across the political spectrum.\n\nHowever, it appears it would take a shift of seismic proportions at this stage to reverse the groundswell of support behind Connolly.\n\nIf Fine Gael are to create that shift, perhaps they need to show us who Heather is.\n\nGerard O’Shea is a vice president at communications firm FINN Partners\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nGerard O’Shea\n\nView 3 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Opinion: Fine Gael's confused campaign branding has done nothing to help Humphreys”.\n\nRecipient's Email\n\nFeedback on “Opinion: Fine Gael's confused campaign branding has done nothing to help Humphreys”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nHeather Humphreys\n\nThe First Name Treatment\n\nNews in 60 seconds\n\nSix arrests and one garda injured as Commissioner condemns 'thuggery' of Citywest riot\n\nover and out\nCovid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate\n\nChristina Finn\n\nTop UN court to rule on Israel's aid obligations in Gaza, as Palestinians in need of 'lifeline'\n\n44 mins ago\n\none battle after another\nDebate verdict: The stalest of stalemates but Connolly's talking like she's already won\n\nRónán Duffy\n\nprime time players\nPlayer ratings: How did the candidates (and the hosts) fare in tonight's debate? \n\nAs it happened\nHow the final debate of the Áras campaign played out \n\nWest Dublin\nGarda van set alight as large anti-immigration protest turned violent in Citywest\n\nWest Dublin\nGarda van set alight as large anti-immigration protest turned violent in Citywest\n\nWest Dublin\nMan (26) appears in court charged over sexual assault of young girl near Citywest hotel \n\nCitywest Hotel\nYoung girl allegedly assaulted in west Dublin had gone missing from Tusla care\n\nThe Morning Lead\nTown missing unit of gardaí after four members injured in two serious assault incidents\n\nNiall O'Connor\n\nmore from us\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Fine Gael’s campaign hasn’t been clear in painting a picture of the person they are asking the electorate to vote for, writes Gerard O’Shea.","url":"https://www.thejournal.ie/readme/opinion-election-campaign-heather-humphreys-branding-6850368-Oct2025/","image":"https://img2.thejournal.ie/article/6850368/river/?height=400&version=6850639","video":null,"publish_date":"2025-10-22 06:00:13","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":0.272},{"id":371689950,"title":"Republicans are ridiculing ‘No Kings.’ A striking new poll shows Americans aren’t laughing","text":"Republicans have spent many days trying to marginalize the massive anti-Trump “No Kings” rallies held across the country over the weekend.\n\nThey’ve argued the people involved were extremists and even predicted they would be violent (which turned out not to be true). They’ve claimed the protesters hate America. And they’ve argued that the “No Kings” message itself is nonsensical, given President Donald Trump is a democratically elected president who sometimes works with Congress.\n\nTrump said Sunday that the people were “not representative of this country.” He and his team have taken to mockingly posting memes and AI videos with Trump donning a crown — including one that the president shared in which he dumps brown waste on protesters.\n\nHouse Speaker Mike Johnson added Monday night on Fox News that the protesters’ messages were “completely the opposite of what America was founded upon.”\n\nNew polling, though, reinforces how much the thrust of the “No Kings” message has resonated with much of the American public.\n\nIn fact, a majority of Americans appear sympathetic to it, at least to some extent. And their ranks appear to be growing.\n\nThe survey from the Public Religion Research Institute gave people two options. One was that Trump is a “potentially dangerous dictator whose power should be limited before he destroys democracy.” The other was that he’s a “strong leader who should be given the power he needs to restore America’s greatness.”\n\nAmericans chose the “dictator” option by a strong margin, 56%-41%.\n\nAnd notably, that margin has nearly doubled since April, when Americans also sided with the “dictator” option but by a smaller, 52%-44% margin.\n\nThe same poll also showed a 54% majority sided with the view that Trump is waging an “assault on constitutional balances and the rule of law.” The alternative was that his overhaul of the federal government is “a long-overdue correction of disastrous policies” (43%).\n\nIt’s possible to oversell poll numbers like this. Giving people binary choices can inflate numbers by making people choose one extreme or another. People who don’t like Trump but don’t think he’s a dictator might feel compelled to choose the “dictator” option to avoid endorsing a man they don’t like.\n\nBut tellingly, the poll also asked people about the strength of their views. Fully 45% of Americans said they “strongly” agreed Trump was a dangerous dictator, and 43% strongly agreed that he’s waging an assault on checks and balances and the rule of law.\n\nIn both cases, nearly half of independents strongly agreed with those sentiments.\n\nThese are, to put it mildly, not insignificant numbers. Say what you will about elements of the “No Kings” rallies; this polling suggests the thrust of the demonstrations hardly appears ridiculous to a majority of Americans.\n\nAnd this is merely the latest indicator that huge numbers of Americans have such concerns.\n\nClear majorities see him exceeding his powers\n\nWhether “dictator” or “king” are particularly apt labels, Americans are clearly sympathetic to the idea that Trump is abusing his power.\n\n56% said Trump had gone “too far” in “using the power of the presidency and executive branch,” according to a July CNN poll. That was up from 52% in February.57% said Trump had gone “too far” in using presidential power to achieve his goals, according to an April AP-NORC poll.62% said Trump has gone beyond his authority as president, according to a September Washington Post-Ipsos poll.69% said Trump was exercising more presidential power than other recent presidents, and 49% said both that and that it was “bad” for the country, according to a September Pew Research Center poll.54% of registered voters said he is “exceeding the powers available to him,” according to a September New York Times-Siena College poll. (That included nearly 1 in 5 Republicans.)\n\nAmid the rallies Saturday, a number of conservatives argued that invoking “Kings” was a non sequitur, given Trump was popularly elected in 2024.\n\n“I don’t understand how Trump is a King when he won every single swing state, the electoral college and popular vote in a democratic election,” said Meghan McCain.\n\nFox News analyst Brit Hume noted that at least some of Trump’s policies have gotten congressional approval. “Some King,” he said.\n\nBut there is no question that Trump has disregarded the limits of his authority — and disregarded Congress — in extraordinary ways. The protesters don’t seem to be arguing that Trump is technically a monarch, so much as that he’s seeking to exercise unchecked power when he can.\n\nAnd that seems to be an argument that a majority of Americans sympathize with.\n\nMany have worried about this for a long time\n\nIf anything, these concerns already existed and have just gotten more pronounced as Trump has grabbed for more power.\n\nBefore Trump’s second term began:\n\nAmericans were about evenly split on whether he would try to rule as a dictator, with 40% predicting he would and 41% disagreeing, according to a December Washington Post-University of Maryland poll.53% said it was at least “somewhat likely” he would act as a dictator, according to a December Reuters-Ipsos poll.53% of voters said they were “concerned” by Trump’s 2023 comment — he claims it was a joke — that he wanted to be a dictator for a day, per a Quinnipiac University poll.49% of voters said Trump was a “fascist” in an October 2024 ABC News-Ipsos poll.\n\nIt’s not just a partisan thing\n\nIt might be tempting to look at these numbers and think, well, it’s just partisan.\n\nA decade ago, many Republicans accused Barack Obama of acting like a king, too. And what about when Joe Biden tried to work around a Supreme Court ruling invalidating his move on student loans?\n\nBut Americans clearly see a difference with Trump.\n\nFor one, in that last poll mentioned above, only about 2 in 10 voters said Trump’s then-opponent, Kamala Harris, was a fascist — less than half of Trump’s number.\n\nFor another, the Washington Post-Ipsos poll showed just 34% of Americans thought Biden had exceeded his authorities, compared with Trump’s 62%.\n\nAnd perhaps tellingly, the AP-NORC poll in April showed a majority of Americans suddenly wanted to restrict that presidency in ways they hadn’t before. The percentage who said a president has “too much” power rose from 32% last year (under Biden) all the way up to 54% (under Trump).\n\nAll of which suggests Americans — or at least a majority of them — see something extraordinary happening right now.\n\nRepublicans can try to diminish the “No Kings” rallies all they want, but they’re speaking to something that’s very real to lots of people.\n\nFor more CNN news and newsletters create an account at CNN.com","url":"https://www.yahoo.com/news/articles/republicans-ridiculing-no-kings-striking-040251859.html","image":"https://s.yimg.com/ny/api/res/1.2/FReWhc2rVV2sO3V7FyHztg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTE5MjA7aD0xMDgwO2NmPXdlYnA-/https://media.zenfs.com/en/cnn_articles_875/d6ba0d89bb0c330325e1881f9c0ff458","video":null,"publish_date":"2025-10-22 04:02:51","author":"Analysis By Aaron Blake, Cnn","authors":["Analysis By Aaron Blake, Cnn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.354},{"id":371415132,"title":"Senate hopeful says he's 'not a secret Nazi' after admitting he got a tattoo in Croatia while 'very inebriated'","text":"Liberal Maine Senate hopeful Graham Platner had to say that he's 'not a secret Nazi' after getting a tattoo associated with the SS in Croatia while drunk with his fellow Marines. \n\nGraham Platner, 40, is challenging for the seat currently belonging to Republican Susan Collins and his left-wing campaign has scored him the endorsement of Bernie Sanders. \n\nPlatner's campaign has come under fire after his account on Reddit between 2013 and 2021 showed offensive views on sexual assault, race, references to being a Communist and that 'all' cops are 'bastards.'\n\nHe decided to combat further controversy by offering up his own 'oppo research' to Dem-friendly Pod Save America this weekend that included shocking video of Platner with the tattoo. \n\nThe podcast then showed a video of a heavily inebriated Platner, stripped down to his underwear, celebrating his brother's wedding by singing and dancing to Miley Cyrus' 'Wrecking Ball.'\n\nIn the video, on the left side of his chest, is a tattoo that looks like the 'Totenkopf,' a symbol of the SS during Nazi Germany. \n\nThe image was revived by neo-Nazis and has been referred to as a 'common hate symbol' by the Anti-Defamation League. \n\nAs Platner explained it on the podcast following the clip, the tattoo was a drunken mistake. \n\n'We got very inebriated, and we did what Marines on liberty do, and we decided to go get a tattoo,' he said.\n\nWhen confronted on the image's Nazi relations, Platner denied he was one. \n\n'I am not a secret Nazi. Uh, actually, if you read through my Reddit comments, I think you can pretty much figure out where I stand on Nazism, right? Uh, and anti-semitism and racism in general. Uh, I would say a lifelong opponent,' Platner added.\n\nPlatner said that it had taken years for him to learn the tattoo's nefarious backstory, having gotten it while he and his fellow marines were on leave. \n\nWe went to a tattoo parlor in Split, Croatia, and we chose a terrifying looking skull and crossbones off the wall because we were Marines and, you know, skulls and crossbones are a pretty standard military thing,' he said.\n\nPlatner added that the troops all just 'moved on with our lives,' with Platner even moving over to the Army, saying that his full screening from the Armed Forces didn't clock the tattoo either. \n\nI've just lived my entire life like a regular person, uh, with a skull and crossbones on their chest, which by that I mean taking my shirt off, performing Miley Cyrus songs in front of my extended family.'\n\nNo one had ever suggested he was 'a Nazi' until he heard about potential opposition research on it being dropped by his opponents, who he believes is trying to destroy him. \n\n'I knew that they were going to throw the book at me, right? Like I I knew that we are up against the machine. We were told not to run this race. I was specifically sent messages saying we were not supposed to do this. We had to wait our turn.' \n\n'We didn't have permission and that if we did it, they were going to try to just destroy my life. And that is what they're trying to do. Um I will say the Nazi part did not did not see that coming.'\n\nThe reveal comes after a weekend of terrible press for Platner over his Reddit history.\n\nThe Washington Post uncovered a screed Platner, a Marine and Army veteran, wrote under the name 'P-Hustle' downplaying sexual assault in the military. \n\n'In today's current climate, when every whisper of a misplaced hand brings down a feature length film, anyone who actually thinks the military is purposefully covering up rape to save the career of some god d*** [captain], is clearly both an idiot and junior enough in rank or life experience to think it matters,' he wrote in 2013. \n\n'Rape is a real thing. If you're so worried about it to buy Kevlar underwear you'd think you might not get blacked out f***** up around people you aren't comfortable with,' he added in a separate post. \n\nHe even referred to someone who shared a comic strip satirizing the difficulties of women reporting sexual assault in the military as 'retarded.'\n\nIn a further investigation of his account, the Bangor Daily News reported he asked why 'black people don't tip' in another thread. \n\nHowever, in 2020, when a poster wrote that rural white Americans 'aren't as racist or stupid as Trump thinks,' Platner responded: 'Living in white rural America, I'm afraid to tell you they actually are.'\n\nIn 2021, he wrote in response to the adage that people become more conservative as they age: 'I got older and became a communist.'\n\nIn a different thread from the same year, one poster commented on a black lieutenant in the Army who was held a gun point and pepper sprayed by police during a traffic stop: 'Bastards. Cops are bastars.'\n\nPlatner wrote: 'All of them, in fact.'\n\nThe candidate, who was previously an oyster farmer, issued statements during the controversy denouncing many of these views, including that he was a Communist, that rural Americans were racist and his anti-police statements, he told CNN.\n\n'That was very much me f**king around the internet. I don't want people to see me for who I was in my worst Internet comment – or even frankly who I was in my best Internet comment. I don't think any of that is indicative of who I am today, really.'\n\nHowever, as the offensive posts began to mount, Platner decided to release a 5-minute apology video on Friday to try and diffuse the outrage.\n\nHe said that as he looks back on the posts, many of which are now deleted, he sees 'things that I absolutely do not agree with, I see words and statements that I abhor.'\n\nPlatner added, however, that he also sees 'the trajectory of my life' from a man who had gotten back from fighting if Afghanistan in 2011 and left the Army in 2012. \n\n'Some of the worst comments I made, the things I think are least defensible, come from that time.' \n\nHe blamed it on being in the infantry which he called a 'very male-dominated place' and pointed out that women weren't allowed to fight in the infantry at that point. \n\n'When I got out, I still had the crude humor, the dark feelings, the offensive language that really was a hallmark of the infantry when I was in it.' \n\nHe said they came from a time of his life where he 'can see myself changing' and talks about the progression of his language as the posts go on.\n\nHowever, Platner notes that he also became 'more disillusioned' as time went on with politics and the state of the world, a reflection of what he said was his own state of mind.\n\n'I was struggling deeply. I had PTSD, I had depression, I had all of things that come with serving in two wars that I eventually began to not believe in all,' he said of fighting in Afghanistan and Iraq.\n\nHe said he was looking for 'community' and an 'outlet for my feelings, for my rage, for my isolation.'\n\nPlatner said 'that all went away' when he found 'actual community.'\n\n'The reason that I stopped posting on Reddit in 2021 was the because I found this,' he said, pointing to his Sullivan, Maine backyard. \n\n'I had moved back to my hometown, I'd found community, I'd started a business, I met someone to fall in love with, I began to really begin to feel connected again and not only did it make me feel connected, it gave me a lot of hope,' he said.\n\n'I went from thinking that people were bad to knowing that people were good. I went from thinking that there was no hope to having nothing but hope.'\n\nHe said that despite the offensive comments, he is 'very proud of the person I am today.'\n\n'I won't defend things I said in the past, I will say that if it wasn't for that entire journey, I wouldn't be who I am today and I am proud of who I am today.'\n\nPlatner said he was sorry to supporters who see 'someone they don't recognize' in the posts, adding that he doesn't recognize himself.\n\nHowever, he added that he does recognize that there are many people who feel the way he used to and implored them to find community.\n\n'I'm sorry for this. Just know that it's not reflective of all at who I am. I don't want you to judge me on the dumbest thing I wrote on the internet. I want you to judge me on who I am today.'\n\nThe scandals come as Platner faces an establishment-backed challenger in the race to challenge Collins in 2026.\n\nMaine´s two-term Democratic Governor Janet Mills will run for the seat as well, setting up a possible showdown between the parties´ best-known figures in a state where Democrats see a chance to gain a seat in their uphill quest for the Senate majority. \n\nNational Democrats see Maine as an important target. It is in the only place on the 2026 Senate election map where Republicans are defending a seat in a state carried last year by Democratic presidential nominee Kamala Harris. \n\nThe party would need to gain a net of four seats, while most of the states with Senate elections next year are places where Republican Donald Trump beat Harris. \n\nMaine is an exception, while in North Carolina, where Trump narrowly won, Democratic former Gov. Roy Cooper is viewed as a contender, and Democratic former Sen. Sherrod Brown is running in Ohio, where Trump won comfortably.\n\nCollins has long cast herself as a reflection of Maine's independent spirit but has frequently voted with Trump on key issues. \n\nPlatner has the backing of Bernie Sanders, who posted on social media on Thursday that Platner is 'a great working class candidate for Senate in Maine who will defeat Susan Collins' and that it´s 'disappointing that some Democratic leaders are urging Governor Mills to run.","summary":"Graham Platner, an under fire candidate for the Senate, decided to drop 'opposition research' on himself showing the offensive tattoo.","url":"https://www.dailymail.co.uk/news/article-15214673/Senate-hopeful-says-hes-not-secret-Nazi-admitting-got-tattoo-Croatia-inebriated.html","image":"https://i.dailymail.co.uk/1s/2025/10/22/02/103194817-0-image-m-9_1761097364690.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/10/18/2731711780205579420/1024x576_MP4_2731711780205579420.mp4","publish_date":"2025-10-22 02:58:20","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":-0.464},{"id":371402828,"title":"This week’s bestsellers at Southern California’s independent bookstores","text":"The SoCal Indie Bestsellers List for the sales week ended Oct. 19 is based on reporting from the independent booksellers of Southern California, the California Independent Booksellers Alliance and IndieBound. For an independent bookstore near you, visit IndieBound.org.\n\nHARDCOVER FICTION\n\n1. The Impossible Fortune: Richard Osman\n\n2. Shadow Ticket: Thomas Pynchon\n\n3. What We Can Know: Ian McEwan\n\n4. The Secret of Secrets: Dan Brown\n\n5. The Loneliness of Sonia and Sunny: Kiran Desai\n\n6. Twice: Mitch Albom\n\n7. Katabasis: R. F. Kuang\n\n8. Alchemised: SenLinYu\n\n9. Heart the Lover: Lily King\n\n10. Atmosphere: Taylor Jenkins Reid\n\nHARDCOVER NONFICTION\n\n1. 1929: Inside the Greatest Crash in Wall Street History — and How It Shattered a Nation: Andrew Ross Sorkin\n\n2. Good Things: Recipes and Rituals to Share with People You Love: Samin Nosrat\n\n3. 107 Days: Kamala Harris\n\n4. The Let Them Theory: A Life-Changing Tool That Millions of People Can’t Stop Talking About: Mel Robbins, Sawyer Robbins\n\n5. Perseverance Principles: How to Unlock Confidence, Consistency, and Wealth Under Pressure: J.J. Mazzo\n\n6. The Compass Within: A Little Story About the Values That Guide Us: Robert Glazer\n\n7. Night People: How to Be a DJ in ’90s New York City: Mark Ronson\n\n8. Always Remember: The Boy, the Mole, the Fox, the Horse and the Storm: Charlie Mackesy\n\n9. All the Way to the River: Love, Loss, and Liberation: Elizabeth Gilbert\n\n10. Separation of Church and Hate: A Sane Person’s Guide to Taking Back the Bible from Fundamentalists, Fascists, and Flock-Fleecing Frauds: John Fugelsang\n\nMASS MARKET\n\n1. 1984: George Orwell\n\n2. Animal Farm: George Orwell\n\n3. Mistborn: The Final Empire: Brandon Sanderson\n\n4. Hyperion: Dan Simmons\n\n5. Jurassic Park: Michael Crichton\n\n6. Oathbringer: Brandon Sanderson\n\n7. Slaughterhouse-Five: Kurt Vonnegut\n\n8. Interview with the Vampire: Anne Rice\n\n9. The Way of Kings: Brandon Sanderson\n\n10. The Illustrated Man: Ray Bradbury\n\nTRADE PAPERBACK FICTION\n\n1. The City and Its Uncertain Walls: Haruki Murakami\n\n2. Martyr!: Kaveh Akbar\n\n3. Mate: Ali Hazelwood\n\n4. Project Hail Mary: Andy Weir\n\n5. The Frozen River: Ariel Lawhon\n\n6. Playground: Richard Powers\n\n7. The Ministry of Time: Kaliane Bradley\n\n8. The Best Short Stories 2025: The O. Henry Prize Winners: Edward P. Jones (Ed.)\n\n9. Demon Copperhead: Barbara Kingsolver\n\n10. We Solve Murders: Richard Osman","summary":"See the top-selling releases among hardcover fiction and nonfiction, plus trade and mass market paperbacks for the sales week that ended Oct. 19.","url":"https://www.ocregister.com/2025/10/21/this-weeks-bestsellers-at-southern-californias-independent-bookstores-200/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/LDN-L-BESTSELLERS-LIST-1026-FEATURED.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-22 01:29:10","author":"Gqlshare,Staff report","authors":["Gqlshare","Staff report"],"language":"en","category":"politics","source_country":"US","sentiment":0.373},{"id":371395486,"title":"While they smear ‘No Kings’ rallies, Trump and his GOP can’t escape their own ‘Nazi’ problem","text":"Republicans suffered a key defeat as one of Donald Trump’s nominees went down in flames on Tuesday.\n\nAn embarrassing spectacle played out over the course of several days on the Hill as the president’s nominee to lead the Office of Special Counsel saw members of the GOP come out one by one to oppose his nomination. Paul Ingrassia withdrew his bid Tuesday evening after it became clear he was not going to receive enough votes for even a simple majority in a chamber where Republicans hold 53 votes out of 100 seats.\n\nThe reason for Ingrassia’s unpopularity was obvious: reports revealed that Ingrassia allegedly claimed to have “a Nazi streak” in texts sent to other Republicans. He is also accused of using racist slurs and allegedly referred to Martin Luther King Jr., the American civil rights champion, as “the 1960s George Floyd,” adding that “his ‘holiday’ should be ended and tossed into the seventh circle of hell where it belongs.”\n\nThe headlines came as Trump and his allied MAGA Republicans in Washington have eagerly leaned into depictions of the American left as a group of violent thugs and avowed antisemites, aided at times by Democrats who line the party’s conservative wing. But Ingrassia’s downfall was only the latest crack in the foundations of that argument, not hardly the first.\n\nAs Republicans were pressed about Ingrassia’s alleged “Nazi” admission into Tuesday, their party is still dealing with the fallout from a completely separate scandal involving the authoritarian German regime from World War II: a leaked groupchat wherein prominent leaders of Young Republicans chapters around the country openly expressed support for racist beliefs, used racist and homophobic slurs hundreds of times, and joked about sending their enemies to gas chambers. A Vermont state senator was forced to resign in disgrace after the texts leaked.\n\nStill another anti-Semitism scandal is brewing in New Jersey, home to a key election for governor in a few weeks. The Republican nominee, Jack Ciattarelli, was introduced onstage at an event Saturday by an unpaid adviser to his campaign who opened for the would-be governor by insisting that he (the adviser) was not “taking money from Jews”. The adviser, Ibrar Nadeem, also called for a ban on same-sex marriage in the same remarks.\n\nWhat’s really in danger isn’t Donald Trump’s ability to get a nominee through the Senate, which remains (for the most part) rock steady. It’s the broader ability of the GOP to guide the depictions of its enemies, even at a moment when the Democratic Party is functionally leaderless and the party’s base seems at war with its remaining leadership in Washington.\n\nRepublicans entered 2025 with a clear ability to divide an already splintering left political coalition that Kamala Harris and Joe Biden failed to piece back together last year. First on the Laken Riley Act and later on a government shutdown threat in March, the GOP was successful in dominating the narrative and forcing their foes into politicized defeats.\n\nThat ability appears to have faded, with Democrats seemingly finding their unity in Congress and Republicans repeatedly hamstrung by factors that have undermined the president’s attempts to paint the left as violent radicals. Republicans continue to rage against the surging campaign of Zohran Mamdani in New York; Rep. Elise Stefanik, formerly a member of House Republican leadership, referred to him with an Islamophobic slur (“jihadist”) on X, while on Fox News, a host falsely claimed on Tuesday that Mamdani wanted to “eliminate” New York City’s entire Jewish community.\n\nThe smears have largely failed to land, and Mamdani remains above 50 percent in most polling. Meanwhile, congressional Republicans are facing questions about so many issues related to anti-Semitism within their party that it’s now the right struggling to maintain message discipline, right as a federal government shutdown enters its fourth week. \n\nMillions of Americans poured into the streets this past Saturday for “No Kings” rallies in all 50 states, a clear show of the left’s strength that came despite blistering denunciations of the demonstrations and the Democratic Party from both the White House and congressional Republicans, who called the supporters of America’s main opposition party “terrorists” who hated their own country.\n\nMany of those protesters turned up to events in wild and wacky costumes, including in D.C., where demonstrators at a dance party on the outskirts of a 200,000-strong crowd told The Independent that they aimed to counter the narrative of “violent” protesters on the left. Despite events taking place in every state, no significant incidents of violence took place at the protests on Saturday.\n\nEven the momentum the right seemed to reclaim over September in the wake of the murder of Charlie Kirk during a speaking engagement at Utah Valley University seems to have fizzled. While Republicans seemed poised to use the issue to create a one-sided view of political violence in the U.S., on Tuesday Speaker Mike Johnson found himself dodging a question about a pardoned January 6 rioter who’s now charged with plotting to assassinate Hakeem Jeffries, the Democratic House minority leader.\n\nPolls can only show so much in terms of how effective either party is at winning the Washington messaging war, which is only mildly effective so far out from the midterm elections next year. But real electoral tests are coming up to measure the strength of each party’s brand, including most imminently the races in Virginia and New Jersey. Republicans could find themselves shifting strategy as this shutdown drags on and if it becomes clear that their foes are coming out of the post-2024 funk.","summary":"Paul Ingrassia’s withdrawal over his alleged ‘Nazi’ admission is a sign that the ability of Trump and the GOP to dictate a narrative in Washington is weakening once again, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-no-kings-protests-gop-nazi-b2849718.html","image":"https://static.independent.co.uk/2025/10/08/06/CIERRE_DE_GOBIERNO_57084.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/PrWjXH2x-4VHSaSK0.mp4","publish_date":"2025-10-22 00:56:59","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.37},{"id":371370244,"title":"FEMA under Biden politically discriminated against Americans: Report","text":"Homeland Security Secretary Kristi Noem said evidence is clear of “textbook political discrimination against Americans in crisis.”\n\n“The federal government,” Noem said, “was withholding aid against Americans in crisis based on their political beliefs – this should horrify every American, regardless of political persuasion. For years, FEMA employees under the Biden administration intentionally delayed much-needed aid to Americans suffering from natural disasters on purely political grounds.\n\n“They deliberately avoided houses displaying support for President Trump and the Second Amendment, illegally collected and stored information about survivors’ political beliefs, and failed to report their malicious behavior. We will not let this stand.”\n\nMatt Taibbi was first to report the investigation’s conclusion on Monday. The Center Square on Monday was unsuccessful in obtaining a copy of the report prior to Tuesday morning’s national release.\n\nEvidence examined by the Privacy Office of Homeland Security included screenshots of FEMA’s tool to collect and maintain information for the purpose of disaster survivor assistance. The report says, “The entries within the tool clearly showed that canvassers included information related to political party affiliation, campaign signs, and other information that may be considered First Amendment-protected freedom of expression within the free-text notes section.”\n\nAnd, it said, “In several instances, canvassers’ records indicate that canvassers skipped homes and left no disaster assistance flyers, citing the First Amendment-protected activity.”\n\nA map of the United States includes instances in eight states between 2021 and 2024, with the testimony to Congress quote of former FEMA Administrator Deanne Criswell above it. She said, “I do not believe that this employee’s actions are indicative of any widespread cultural problems at FEMA.”\n\nMarn’i Washington, fired from her position as a disaster survivor assistance crew leader for FEMA, on the Nov. 11 edition of the Roland Martin Unfiltered Daily Digital Show had confirmed homes skipped. She said it happened at homes not only with signs for Trump but also for Kamala Harris and Joe Biden.\n\nShe said it happened in Florida and the Carolinas. Hurricane Milton was one of three hurricanes to hit Florida in 66 days, and another was Helene that ravaged Georgia, the Carolinas, and Tennessee – the most deaths and mostly costly damage coming in North Carolina.\n\nOn the Homeland Security report’s map, two notations for North Carolina include instances in October and November last year. The first says, “The survivor had a sign that read … NRA, we do our part,” and the second said, “Survivor stated that homes have been damaged, but there are Republicans on the grounds with guns, so please be careful.”\n\nA dot for Florida from October says, “Trump sign, no contact per leadership.” Another dot for November said, “There was a political flyer, so I didn’t leave a FEMA brochure.”\n\nFrom September 2021 in Pennsylvania, the report notes, “… a lot of explicit political flags, posters, etc. ‘F— Joe Biden’ ‘MAGA 2024’ ‘Joe Biden Sucks’ ‘Trump 2024’ We do not recommend anyone visiting this location.”\n\nFrom October 2021, in Louisiana, “Homeowner had sign stated … this is trump country.”\n\nHERE ARE THE GROUPS TRUMP HAS DESIGNATED AS TERRORIST ORGANIZATIONS\n\nThe map and incidents noted were not inclusive of findings; rather, just a sampling.\n\nNoem said the following actions will happen:\n\n• Referred the case to the Department of Justice for further investigation and potential prosecution.\n\n• Also referred the case to the Department of Homeland Security Office of the Inspector General.\n\n• Canceled the door-to-door survey practice that FEMA used to discriminate against Americans.\n\n• Instructed the DHS Privacy Office to issue clear recommendations to FEMA to address these egregious violations and prevent future ones.\n\n• Required FEMA to adhere to stricter data collection practices, strengthen guidance and training, and clearly define legitimate safety and hostility concerns to ensure staff make fair and lawful decisions.\n\n• Instructed FEMA to also implement rigorous oversight and auditing mechanisms to restore integrity to its disaster relief operations.","summary":"(The Center Square) – Reports of FEMA disaster assistance teams in 2024 bypassing homes displaying signs supporting then-presidential candidate Donald Trump were true and were indicative of a pattern tracing back to Hurricane Ida in 2021, says an internal probe by the U.S. Department of Homeland Security. In addition, the 22-page analysis made available Tuesday [&#8230;]","url":"https://www.washingtonexaminer.com/politics/biden/3859142/fema-biden-discriminated-americans-report/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/08/fema-office-building-outside.webp?w=696","video":null,"publish_date":"2025-10-21 22:56:51","author":"Center Square","authors":["Center Square"],"language":"en","category":"politics","source_country":"US","sentiment":-0.159},{"id":371375548,"title":"Bernie Sanders stands by Maine oysterman taking on Susan Collins despite ‘racist’ posts and ‘troubling’ tattoo","text":"Bernie Sanders on Tuesday defended Graham Platner, the Maine oysterman running against Republican Susan Collins in the state’s marquee Senate race, who has come under fire amid allegations of racist social media posts.\n\n“In all due respect, alright, what I'm worried about? 50,000 Americans may die unnecessarily,” the Vermont senator told The Independent when asked about some old Reddit posts from Platner that have sparked allegations of racism.\n\nDemocrats are now fretting after the progressive insurgent oysterman vying for the party’s nomination to challenge the five-term senator has come under fire for a series of inflammatory posts on Reddit and also for having a tattoo that bears a striking resemblance to Nazi ink. \n\nPressed further about Platner’s comments about sexual assault, Sanders defensively shot back, “Have you served four tours of duty?”\n\nSanders, a socialist Independent who caucuses with the Democrats, has endorsed Platner — and he’s campaigned for him in Maine.\n\nLast week, CNN reported that Platner, a Maine oysterman who served in the Marine Corps, had a Reddit account where he said, “I got older and became a communist” and that “all” police officers are “bastards.” \n\nThe Washington Post would later report that Platner also posted on Reddit asking why Black people did not tip and asked why women did not “take some responsibility for themselves and not get so f----d up they wind up having sex with someone they don’t mean to?” \n\nPlatner would later apologize for the posts and say they were the result of his feeling alienated after returning home from military service. \n\nHe came under even more fire as a guest on Pod Save America, the liberal podcast hosted by former Obama administration staffers. He would proceed to show a video of himself singing at a wedding in his underwear revealing that he had a tattoo on his chest that resembled the totenkopf, which means “death’s head,” a skull and crossbones-like symbol popular in Nazi Germany. \n\nPlatner has denied it was a Nazi tattoo and said that he got it while drunk in Croatia with his fellow Marines. \n\n“We chose a terrifying skull and crossbones off the wall because we were Marines,” he told host Tommy Vietor and said he continued to receive security clearance. Platner said he eventually got wind that the tattoo had entered into opposition research. \n\n“And I can honestly say that if I was trying to hide it, I have not been doing a very good job for the past 18 years,” Platner added. \n\nThe trove of news has quenched much of the fervor surrounding Platner in recent weeks since he announced his candidacy to challenge Collins. Up until then, few Democrats had stepped up to run against Maine’s senior senator, who is the only Republican who represents a state Kamala Harris won. \n\nPlatner’s campaign raked in more than $3 million since he announced in August. He immediately earned comparisons to Zohran Mamdani’s campaign for New York City mayor and Sen. John Fetterman’s 2022 campaign in Pennsylvania. He also shares many of the same consultants as they used.\n\nMeanwhile, Sen. Chris Murphy (D-Conn.), who has praised Platner’s campaign on X, said he had not seen the news about Platner. \n\n“I know a lot of people say that they haven't looked at it, and they don’t really mean it,” Murphy told The Independent. “I know he said some stuff on Reddit. I haven’t read it.”\n\nPlatner’s various controversies represents a conundrum for Democrats: Many of their voters are dissatisfied with the party leadership and want candidates who challenge the status quo. But many younger Democratic candidates of Platner’s age grew up in a time when they also documented most of their adult life online. \n\nSen. Ruben Gallego (D-Ariz.) won his race last year and is also a veteran of the Marine Corps who, like Platner, spoke about living with post-traumatic stress disorder after serving in Iraq. \n\nWhen The Independent asked about the tattoo, Gallego said he had not seen it, but on Platner’s past statements said that if people grow out of their troublesome behaviors, they should be given grace. \n\n“We have to evaluate if that's the case I think that's a legitimate conversation to be had,” Gallego told The Independent. “But, you know, everyone has a right to grow and grow out of their stupidity, essentially. And I think voters should take the opportunity to evaluate that.”\n\nAt the same time, Maine’s popular executive, Gov. Janet Mills, a more establishment-friendly candidate, also jumped into the primary last week. \n\nDuring Senate Democratic leadership’s weekly press conference, Senate Minority Leader Chuck Schumer got behind Mills when asked about Platner’s comments.\n\n“We think that Janet Mills is the best candidate to retire Susan Collins,” he said. “She's a tested two-term governor and the people of Maine have an enormous amount of affection and respect for her.”\n\nBut some pointed out how at 77, Mills seemed to confirm the Democratic Party’s age problem that led to criticism during the 2024 election. \n\nCollins, who has voted for most of Trump’s nominees but who voted against Trump’s “One Big, Beautiful Bill,” has yet to announce whether she will seek re-election.","summary":"The anti-establishment ex-Marine earned plaudits from some Democrats. Now his comments risk their chances of defeating incumbent Republican senator","url":"https://www.independent.co.uk/news/world/americas/us-politics/maine-senate-graham-platner-b2849506.html","image":"https://static.independent.co.uk/2025/10/21/17/59/Election-2026-Senate-Maine-0cf7ui7e.jpeg?width=1200","video":null,"publish_date":"2025-10-21 22:38:47","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","source_country":"gb","sentiment":-0.309},{"id":371361734,"title":"Karine Jean-Pierre defends former President Biden’s mental acuity in new book","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Five October 21, 2025 08:39 \n\n Karine Jean-Pierre defends former President Biden’s mental acuity in new book \n ‘The Five’ reacts to former White House press secretary Karine Jean-Pierre shifting political allegiances and former Vice President Kamala Harris’ possible 2028 presidential run. \n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE FIVEV-VIDEOPOLITICSJOE BIDENKAMALA HARRISELECTIONS","summary":"‘The Five’ reacts to former White House press secretary Karine Jean-Pierre shifting political allegiances and former Vice President Kamala Harris’ possible 2028 presidential run.","url":"https://www.foxnews.com/video/6383481171112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2cde121f-23fd-4368-9a0e-321d21af1489/59c159b4-dddd-49e5-92a4-f5879b39eedc/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-10-21 21:48:10","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.478},{"id":371369462,"title":"Democrats Within Striking Distance of Flipping GOP Seats in 2 Swing States","text":"A pair of new Democratic internal polls point to tight races in two battleground congressional districts currently held by Republicans ahead of the 2026 midterm elections.\n\nWhy It Matters\n\nDemocrats are hoping to retake the majority in the House of Representatives in November 2026. Historically, the party of the president loses seats in the midterms, and President Donald Trump’s approval rating has dropped since his return to office in January. But some recent polls suggest that Democrats are in a weaker position than they were at this point in his first term—fueling concerns about whether a strong “blue wave” will strike next year.\n\nTwo new polls of Arizona’s 6th Congressional District and Wisconsin’s 3rd, however, point to tight races. These are likely to become two of the most competitive battles next year and are among Democrats’ top targets.\n\nThe polls are conducted by a Democratic-aligned firm, but they underscore the competitive nature of the seats.\n\nWhat To Know\n\nArizona’s 6th District, held by Republican Juan Ciscomani, supported Trump by less than 1 percentage point in November after narrowly backing former President Joe Biden in 2020.\n\nCiscomani has drawn several Democratic challengers, including veteran JoAnna Mendoza. A recent survey from Public Policy Polling, first reported by Politico, asked voters in the district whether they would support Ciscomani or Mendoza.\n\nThe poll found that 42 percent of respondents said they would support Mendoza, while 41 percent would vote for Ciscomani. It surveyed 581 voters on October 14 and October 15.\n\nA voter casts a ballot in Madison, Wisconsin, on November 8, 2022.\n\nA separate Public Policy Polling survey asked voters in Wisconsin’s 3rd Congressional District about how they plan to vote next year. The district is currently represented by Republican Derrick Van Orden. It is a bit more conservative, with Trump winning there by about 7 points last year.\n\nThe poll showed Democratic challenger Rebecca Cooke, who ran for the seat last year, leading 44 percent to 42 percent, with 13 percent of respondents remaining undecided. The poll surveyed 609 voters in the district on the same days this month.\n\nCooke fared better than former Vice President Kamala Harris in the district last year, losing by less than 3 percentage points, so she is viewed as a top recruit for Democrats, who are hopeful she will be able to flip the seat in a more favorable environment.\n\nGeneric ballot polling has been a concern for Democrats. While they do hold a modest lead over Republicans in head-to-heads, it is much more narrow than in 2017. On Monday, Democrats led RealClearPolitics’ aggregate by about 1.6 points, compared with their lead of 9.2 points on October 20, 2017.\n\nDemocrats won the national popular vote by about 8.4 percentage points and a 235-199 House majority in the 2018 midterms.\n\nWhat People Are Saying\n\nMendoza, in a statement: “These numbers reflect and confirm what I hear every day across southern Arizona. Families are ready for leadership that puts people – not DC party leaders – first. I’ve spent my life serving my country and my community, and I’m ready to bring that same commitment to Congress to make life more affordable and ensure every family has a fair shot.”\n\nCooke, in a statement: “Not only is Derrick Van Orden deeply unpopular, but his record in Congress—backing tax cuts for the ultra-rich while asking Wisconsin working families to do more with less—is toxic. My campaign is bringing people together around real solutions that lower costs, improve health care access and put an end to the culture of corruption in Washington.”\n\nNRCC spokesperson Mike Marinella previously told Newsweek: “Democrats can’t hide their far-left lunacy, from their reckless government shutdown to their radical socialist agenda. Voters are sick of paying the price for Democrat chaos, and voters will elect Republicans across the board.”\n\nWhat Happens Next\n\nThe Cook Political Report classifies both races as toss-ups, meaning they’re set to be among the most contested elections of the midterms.","summary":"Two recent polls show tight races in battleground Arizona and Wisconsin congressional districts.","url":"https://www.newsweek.com/democrats-within-striking-distance-of-flipping-gop-seats-in-2-swing-states-10916155","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/GettyImages-1244622530.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-21 21:43:19","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.071},{"id":371355228,"title":"Fox News Politics Newsletter: Bill Nye, Buttigieg boost Spanberger amid Jones scandal","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -Winsome Sears responds to JMU fan telling her to 'go back to Haiti' after weekend of leftist invective -DOJ argues judge's decision blocking Mahmoud Khalil's removal was 'indefensible' -Charlie Kirk assassination sparks Senate hearing on 'left-wing political violence,' Schmitt vows action Science Rules: Bill Nye, Buttigieg to boost Spanberger in key VA city as Jones scandal looms over Dem ticket Former PBS host and ex-Boeing engineer Bill Nye \"The Science Guy\" will join former Transportation Secretary Pete Buttigieg to headline a rally with Virginia Democratic gubernatorial candidate Abigail Spanberger on Tuesday in the hometown of their party’s forefather. Spanberger will rally with Buttigieg and Nye in Charlottesville – the city that birthed President Thomas Jefferson – while across town at the college founded by America’s third president, GOP lieutenant gubernatorial candidate John Reid will headline a public \"Dome Room\" forum hosted by pollster Larry Sabato’s University of Virginia Center for Politics. Spanberger’s rally occurs as she tries to separate herself from scandal-plagued attorney general candidate Jay Jones…READ MORE. White House 'CRAZY PLOT': Trump says Schumer, Senate Democrats holding government 'hostage' with shutdown: 'We will not be extorted' HILLARY'S TANTRUM: Hillary Clinton fires up voters against Trump's White House ballroom construction: 'It’s your house' SPEAKING HER MIND: Karine Jean-Pierre reveals she never thought Kamala Harris would win DRUG WAR DISPUTE: San Francisco mayor rejects Trump's National Guard deployment plan over drug dealer arrest authority World Stage GUNBOAT DIPLOMACY: US military buildup in the Caribbean sees bombers, Marines and warships converge near Venezuela CYBER CLASH: China accuses NSA of cyberattack on national timekeeping system MEASURE OF SECURITY: Vance warns Hamas as Gaza peace plan's Civilian Military Cooperation Center opens INFLUENTIAL: Dem senator says Melania Trump is America’s ‘secret weapon’ against Putin’s ‘war criminality’ Capitol Hill MONEY TRAIL: National Dems bankroll campaign of 'Fake Independent' Senate candidate from Midwestern state LIAR EXPOSED: House Judiciary Committee refers former CIA Director John Brennan to the Justice Department for prosecution SENATE FLIP-FLOP: Fetterman calls out Dems' flip: 'We ran on killing the filibuster, and now we love it' FISCAL FRICTION: Republicans push to renew Obamacare subsidies while rejecting Democrats’ shutdown tie-in LINKED BY LOYALTY: Blackburn says Trump support was 'common thread' among lawmakers reportedly targeted by Jack Smith Across America RULES FOR THEE: Jay Jones murder texts latest case of Democrats circling the scandal wagons HONOR CODE BROKEN: ‘She lied’: Mikie Sherrill classmate says involvement in cheating scandal deeper than she claims POLITICAL KRYPTONITE: New Jersey Dems snub endorsing socialist candidate Mamdani as gubernatorial election looms OFF THE JOB?: Dem Rep Mikie Sherrill skips 145 House votes as NJ governor's race heats up 'I SAID NO': Defiant Sliwa says 'I am not dropping out' of NYC mayor race: 'Under no circumstance' 'DISOBEY': Portland city council member calls on National Guard troops to defy deployment orders AUSTIN ATROCITY: Illegal immigrants arrested after woman found shot to death in Texas woods, 1 wanted by Mexican feds: police Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-bill-nye-buttigieg-boost-spanberger-amid-jones-scandal","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/spanberger-bill-nye.png","video":null,"publish_date":"2025-10-21 20:54:09","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.005},{"id":371370686,"title":"'60 Minutes' in Chaos: New CBS News Boss Stuns Crew Members After Asking Controversial Question About 'Being Biased' — 'They Felt Blindsided and Humiliated'","text":"New CBS News boss Bari Weiss left all but one of the stars of 60 Minutes on the verge of a \"revolt\" after she reportedly questioned why they left objectivity behind in favor of a left-leaning bent, RadarOnline.com can reveal. \n\nWeiss, 41, was brought aboard the network for her moderate and centrist views and is trying to right the ship after the news magazine faced battering accusations of favoring Democrats and going out of its way to make President Donald Trump look bad.'Blindsided and Humiliated'Weiss reportedly called a meeting of the 60 Minutes staff on October 14 and asked, \"Why does the country think you’re biased?\" leaving them stunned. \n\n\"It was basically a revolt,\" a show source told Hollywood insider Rob Shuter, who writes on Substack. \n\n\"They felt blindsided and humiliated and wanted to hit back.\"\n\nShuter reported the insider claimed correspondents Lesley Stahl, Scott Pelley, Cecilia Vega, Bill Whitaker, and Jon Wertheim openly complained about Weiss’s \"outsider arrogance.\"\n\n\"They think she’s questioning their integrity — and their legacy,\" another staffer huffed.'Time to Listen'One prominent staffer trying to remain above the fracas is Anderson Cooper, who fears for the show's future if they stay on the current liberal-leaning course. \n\n\"Anderson wanted no part of it,\" a CBS source revealed to Shuter. \"He told colleagues this wasn’t the time to circle the wagons — it was time to listen.\"\n\n\"He knows public trust is fading,\" a producer added about the CNN star. \"And he’s protecting himself, not the bureaucracy.\"\n\nA CNN rep countered the CBS insider, exclusively telling RadarOnline.com that Cooper wasn't present for the meeting and hasn't discussed it with any of his 60 Minutes colleagues.'Balanced and Fact-Based' JournalismWeiss is a former New York Times opinion page writer who left the paper in July 2020 after claiming it was an \"illiberal environment\" that caused her to be the subject of \"constant bullying.\"\n\nShe started a popular Substack that led to her launching the online media company The Free Press.\n\nDavid Ellison, Chairman and CEO of Paramount, made it clear in Weiss' October 6 hiring announcement that she was being brought aboard to regain viewers' trust in the CBS News brand.\n\n\"We believe the majority of the country longs for news that is balanced and fact-based, and we want CBS to be their home,\" Ellison said about Weiss's primary initiative, calling her a \"proven champion of independent, principled journalism.\"Huge Payout to TrumpCBS and its parent company, Paramount Global, famously agreed to pay Trump $16 million in August to settle a lawsuit over 60 Minutes allegedly editing an interview with his Democrat opponent, Kamala Harris, to make her answers seem more coherent. \n\nTrump initially sued for $10 billion in damages, claiming \"deceptive conduct\" by the network in the October 2024 interview between Whittaker, 74, and Harris, 61, in the days leading up to the presidential election. \n\nThe tycoon's team filed the suit due to \"CBS’s partisan and unlawful acts of election and voter interference through malicious, deceptive, and substantial news distortion calculated to confuse, deceive, and mislead the public,\" in their complaint.\n\nThe lawsuit accused CBS of attempting to \"tip the scales in favor of the Democratic Party as the heated 2024 Presidential election — which President Trump is leading — approaches its conclusion.\"\n\nTrump emerged victorious the following month, securing his second term as president. \n\nOn October 21, a CNN rep exclusively told us Cooper wasn't present for the meeting and hasn't discussed it with any of his 60 Minutes colleagues.","summary":"The stars of '60 Minutes' are in a 'revolt' and 'humiliated' amid new CBS News boss Bari Weiss questioning the show's objectivity.","url":"https://radaronline.com/p/60-minutes-chaos-bari-weiss-questions-biased-coverage/","image":"https://media.radaronline.com/brand-img/YVnbEPCoq/0x0/60-minutes-chaos-bari-weiss-one-sided-journalism-1761071260584.jpg","video":null,"publish_date":"2025-10-21 20:01:19","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":-0.259},{"id":371361676,"title":"Karine Jean-Pierre calls Karoline Leavitt 'deplorable' for remarks about Democrats","text":"Former White House press secretary Karine Jean-Pierre called current White House press secretary Karoline Leavitt \"deplorable\" on Tuesday during an interview on \"The View.\" The co-hosts of \"The View\" played a clip of Leavitt saying that the Democratic Party's \"main constituency are made up of Hamas terrorists, illegal aliens, and violent criminals.\" \"I do want to say something to the first clip that you all just showed, which is hearing that, it’s deplorable,\" Jean-Pierre said. \"And I’m using that word on purpose. Because they don’t seem to understand, this is the Trump White House, that they don’t work for just one man. They work for the American people.\" Jean-Pierre also criticized Leavitt's viral post of a text change with a HuffPost reporter, where she made a \"your mom\" joke and said she wouldn't take any more of his \"bulls---\" questions. KARINE JEAN-PIERRE INSISTS TO SKEPTICAL CBS ANCHORS THAT BIDEN WAS TREATED UNFAIRLY, ALWAYS SEEMED SHARP \"The White House press secretary is not about doing online trolling,\" Jean-Pierre said. \"It is not. It is an honor and a privilege to have that job and to speak on behalf of the most powerful person in the world. And there is a level of respect for the freedom of the press, even if you disagree with them.\" Jean-Pierre, who has said she wants to fix a \"broken\" political system, said Leavitt was contributing to further political divisiveness. Her use of the word \"deplorable\" was a reference to Hillary Clinton's remarks about many of Donald Trump's supporters in 2016. \"It doesn’t help with the partisanship that we’re seeing right now. And also, that is not what the White House is supposed to be about. It’s supposed to be about every American person, every voter, every citizen, everyone that lives in this country,\" Jean-Pierre said. The White House didn't respond to a request for comment. KARINE JEAN-PIERRE REVEALS SHE NEVER THOUGHT KAMALA HARRIS WOULD WIN The former press secretary joined the co-hosts of \"The View\" to discuss her new book, \"Independent,\" in which she details her disdain for the Democratic Party over how it forced out her old boss, President Joe Biden, from the 2024 White House race. Jean-Pierre left the party earlier this year to become an independent. In the book, Jean-Pierre said she was disgusted by how Democrats treated Biden after his poor debate performance against Trump last year, ultimately pressuring him to leave the 2024 White House race. She has been widely promoting the book, also doing interviews with \"The Late Show with Stephen Colbert,\" \"CBS Mornings\" and NPR this week. KARINE JEAN-PIERRE SAYS BIDEN HEALTH TALKING POINTS WERE TIGHTLY CONTROLLED AT SENIOR LEVEL Even Colbert, a fervent Biden supporter, was skeptical on Monday of her continued defense of Biden's mental acuity in office. CLICK HERE TO GET THE FOX NEWS APP \"You’re talking to a guy who helped raise $25 million for Joe Biden in March of that same year,\" Colbert told Jean-Pierre. \"And three months later, I saw a guy who I had not seen backstage at the benefit that I did. It seemed like a dramatically different person. And at 81 years old, that’s not entirely unexpected. You can imagine why people got so worried.\"","summary":"Former White House press secretary Karine Jean-Pierre said Karoline Leavitt&apos;s sharp attack on Democrats was &quot;deplorable&quot; during an interview on &quot;The View.&quot;","url":"https://www.foxnews.com/media/karine-jean-pierre-calls-karoline-leavitt-deplorable-remarks-about-democrats","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/karine-jean-pierre-karoline-leavitt.jpg","video":null,"publish_date":"2025-10-21 19:59:59","author":"David Rutz,Hanna Panreck","authors":["David Rutz","Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.186},{"id":371338102,"title":"The Donald J. Trump Ballroom freakout","text":"“It’s not his house. It’s your house. And he’s destroying it,” tweeted the melodramatic Hillary Clinton. \n\nSome of us remember when the first couple rented out the people’s bedroom like some Old West tavern owners and then stole the people’s furniture and tableware on their way out of town. One imagines Trump will leave the ballroom behind for the next administration. \n\n“Ripping apart the White House just like he’s ripping apart the Constitution,” presidential hopeful Gavin Newsom tweeted. \n\nPresident John F. Kennedy’s niece Maria Shriver, who is apparently put off by Washington opulence, said, “This breaks my heart and it infuriates me. Hundreds of millions of dollars to build a new ballroom. Good god.”\n\nDemocrats are suddenly great stewards of the national purse. \n\nNearly every president has done some renovation to the White House. In this case, numerous companies and people pledged to chip in $200 million in private funds to build “The Donald J. Trump Ballroom at the White House” addition. The administration contends that there isn’t enough room for events, necessitating the use of tents outside to accommodate visitors. It seems to be a reasonable request. \n\nNow, if your contention is that presidents should embrace a more unassuming, republican demeanor in Washington, I’m with you. Our habit of treating Washington as a sacred place goes against the values of the founders. We know, of course, that the anger about the ballroom has nothing to do with renewing our egalitarian virtues. If President Kamala Harris had built a new ballroom with private donations, we would be subjected to fawning stories about the new Camelot and deep dives on the elegant design. The Left loves power. It loves Washington. It loves big parties. It simply can’t live with the idea that it loses elections.","summary":"One of the defining characteristics of the modern Left is the daily meltdown. Whatever President Donald Trump does, night and day, whether it is innocuous or within his executive power, Democrats will unleash waves of histrionics and feigned fury. It has become insufferably boring, performative, and self-destructive. The hysteria only delegitimizes any credibility they may [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/3858616/the-donald-trump-ballroom-freakout/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP25294605718578.jpg?w=696","video":null,"publish_date":"2025-10-21 18:59:48","author":"David Harsanyi","authors":["David Harsanyi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.263},{"id":371324420,"title":"Science Rules: Bill Nye, Buttigieg to boost Spanberger in key VA city as Jones scandal looms over Dem ticket","text":"Former PBS host and ex-Boeing engineer Bill Nye \"The Science Guy\" will join former Transportation Secretary Pete Buttigieg to headline a rally with Virginia Democratic gubernatorial candidate Abigail Spanberger on Tuesday in the hometown of their party’s forefather. Spanberger will rally with Buttigieg and Nye in Charlottesville – the city that birthed President Thomas Jefferson – while across town at the college founded by America’s third president, GOP lieutenant gubernatorial candidate John Reid will headline a public \"Dome Room\" forum hosted by pollster Larry Sabato’s University of Virginia Center for Politics. Spanberger’s rally occurs as she tries to separate herself from scandal-plagued attorney general candidate Jay Jones. Nye and Spanberger are expected to receive a welcome in the notable blue dot in the sea of rural Shenandoah Valley red that is Charlottesville. VIRGINIA GOV. YOUNGKIN WARNS AGAINST DEM CANDIDATE'S CENTRIST LABEL, SAYS SHE'LL END COOPERATION WITH ICE Trump Winery and its Albemarle Estate lodging, managed by Eric Trump, lies on the opposite side of town, down the street from Monticello itself. The road that runs from Jefferson’s estate to Trump’s is regularly lined with dozens of large American flags abutting the estate’s property line. That contrast will be evident Tuesday, as Spanberger enlists celebrities in hopes of propelling her to victory, while Reid, who has claimed to be pulling within neck-and-neck of Democrat Ghazala Hashmi, also seeks to engage with the public in the closing days. While she has condemned Jones’ comments, Spanberger has continued to decline to call for him to drop out – while pivoting this week to attacking her Republican opponent, Lt. Gov. Winsome Earle-Sears, on her pro-life views. WINSOME EARLE-SEARS RELEASES ‘TWO BULLETS’ AD SCATHING OPPONENT FOR FAILING TO DEMAND JAY JONES’ OUSTER An ad released Monday criticized Earle-Sears’ support for a near-total abortion ban and in turn positioned Spanberger as the champion of individual rights. Moving from medical science to engineering, Nye resurfaced this week clamoring against President Donald Trump at a \"No Kings\" protest in his hometown of Washington, D.C., where he accused some in the MAGA faithful of being \"Confederates.\" \"We are here to tell our lawmakers that what’s going on in our government is wrong. They must stop the abuses of this petulant president and his circle of sycophants… This president and his associates cannot tolerate dissent. To them, our free speech is frightening. They are arresting people and denying due process in courts,\" Nye said in part. SPANBERGER DEFENDS ABORTION AD CRITICIZING SEARS AFTER BERNIE WARNS AGAINST HIGHLIGHTING ISSUE The former star of PBS’ \"Bill Nye the Science Guy\" and the engineer-by-trade who invented an aircraft implement while working for Boeing, slammed Trump for trying to \"silence television hosts.\" When asked about Nye's switch from science to politics, White House spokesperson Abigail Jackson remarked, \"You mean Bill Nye the Liberal Activist Guy?\" While Republicans are not the party typically associated with major Hollywood and celebrity endorsements, over his decade-plus in politics, Trump has garnered several very vocal stars in his camp. \"Charles In Charge\" star Scott Baio has been most vocal as of late, saying in 2024 he believed the U.S. was always a \"MAGA\" nation. OBAMA ENDORSES SPANBERGER, ATTACKS REPUBLICANS IN VIRGINIA GOVERNOR'S RACE ADS Jon Voight has routinely released stern X videos addressing the public and/or public officials on Trump’s bona fides: \"Who else has faced greater challenges and enemies since Lincoln?\" he asked. Mel Gibson, who played a version of Revolutionary War hero Francis Marion in \"The Patriot,\" has been complimentary of Trump while remarking that 2024 Democratic nominee Kamala Harris had \"the IQ of a fence post.\" Trump has since appointed him a \"special ambassador.\" NATION'S ONLY TWO 2025 RACES FOR GOVERNOR ROCKED WITH THREE WEEKS UNTIL ELECTION DAY Just on the other side of Skyline Drive from Jones’ rally site is the former district of then-House Speaker Todd Gilbert – the Republican whom Jones envisioned shooting in the head in texts revealed earlier this month. Earle-Sears repeatedly interjected during the two gubernatorial candidates' debate to urge Spanberger to call for Jones to drop out once and for all. On Monday, Sen. Ted Cruz, R-Texas, headlined a fundraiser with Earle-Sears at the home of a Tysons Corner real estate developer. CLICK HERE TO DOWNLOAD THE FOX NEWS APP A Spanberger campaign official confirmed to Fox News Digital that the Democrat will appear in the coming days with former President Barack Obama at a rally as well.","summary":"Virginia&apos;s gubernatorial race intensifies as Spanberger campaigns with celebrity endorsers while facing pressure over scandal-plagued running mate Jay Jones.","url":"https://www.foxnews.com/politics/science-rules-bill-nye-buttigieg-boost-spanberger-key-va-city-jones-scandal-looms-over-dem-ticket","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/spanberger-bill-nye.png","video":null,"publish_date":"2025-10-21 18:35:24","author":"Charles Creitz","authors":["Charles Creitz"],"language":"en","category":"politics","source_country":"US","sentiment":0.184},{"id":371346428,"title":"Biden completes a round of radiation therapy as part of his prostate cancer treatment","text":"WASHINGTON (AP) — Former President Joe Biden on Monday completed a round of radiation therapy treatment for the aggressive form of prostate cancer he was diagnosed with after leaving office, a spokesperson said.\n\nBiden had been receiving treatment at Penn Medicine Radiation Oncology in Philadelphia, said aide Kelly Scully.\n\nThe 82-year-old Democrat left office in January, six months after he dropped his bid for reelection following a disastrous debate against Republican Donald Trump amid concerns about Biden’s age, health and mental fitness. Trump defeated Democrat Kamala Harris, who was Biden’s vice president.\n\nIn May, Biden’s postpresidential office announced that he had been diagnosed with prostate cancer and that it had spread to his bones. The discovery came after he reported urinary symptoms.\n\nProstate cancers are graded for aggressiveness using what is known as a Gleason score. The scores range from 6 to 10, with 8, 9 and 10 prostate cancers behaving more aggressively. Biden’s office said his score was 9, suggesting his cancer is among the most aggressive.\n\nLast month, Biden had surgery to remove skin cancer lesions from his forehead.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — Former President Joe Biden on Monday completed a round of radiation therapy treatment for the aggressive form of prostate cancer he was...","url":"https://wsvn.com/news/politics/biden-completes-a-round-of-radiation-therapy-as-part-of-his-prostate-cancer-treatment/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/01/250117-Biden-sets-record-by-commuting-sentences-of-nearly-2500-people-convicted-on-nonviolent-drug-charges.jpg?quality=60&strip=color","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/93f55ddf-dc5e-42ef-b459-105839f843a1/b29e0279-3436-4bbd-ba05-878feca5b6b9/main.mp4?fastly_token=NjhmODRjMzRfNzc2NWIwNzk4ZTBkMjlmYWM2MGJmZWY3MjE3NTA2N2YxM","publish_date":"2025-10-21 18:33:49","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.694},{"id":371367918,"title":"Report: FEMA under Biden politically discriminated against Americans","text":"(The Center Square) – Reports of FEMA disaster assistance teams in 2024 bypassing homes displaying signs supporting then-presidential candidate Donald Trump were true and were indicative of a pattern tracing back to Hurricane Ida in 2021, says an internal probe by the U.S. Department of Homeland Security.\n\nIn addition, the 22-page analysis made available Tuesday says the Federal Emergency Management Agency violated the Privacy Act of 1974, treated individuals unfairly based on political beliefs, and these actions stemmed from systemic issues in FEMA policies, processes and practices.\n\nHomeland Security Secretary Kristi Noem said evidence is clear of \"textbook political discrimination against Americans in crisis.\"\n\n“The federal government,” Noem said, “was withholding aid against Americans in crisis based on their political beliefs – this should horrify every American, regardless of political persuasion. For years, FEMA employees under the Biden administration intentionally delayed much-needed aid to Americans suffering from natural disasters on purely political grounds.\n\n“They deliberately avoided houses displaying support for President Trump and the Second Amendment, illegally collected and stored information about survivors’ political beliefs, and failed to report their malicious behavior. We will not let this stand.”\n\nMatt Taibbi was first to report the investigation's conclusion on Monday. The Center Square on Monday was unsuccessful obtaining a copy of the report prior to Tuesday morning national release.\n\nEvidence examined by the Privacy Office of Homeland Security included screenshots of FEMA’s tool to collect and maintain information for the purpose of disaster survivor assistance. The report says, “The entries within the tool clearly showed that canvassers included information related to political party affiliation, campaign signs, and other information that may be considered First Amendment-protected freedom of expression within the free-text notes section.”\n\nAnd, it said, “In several instances, canvassers’ records indicate that canvassers skipped homes and left no disaster assistance flyers, citing the First Amendment-protected activity.”\n\nA map of the United States includes instances in eight states between 2021 and 2024, with the testimony to Congress quote of former FEMA Administrator Deanne Criswell above it. She said, “I do not believe that this employee’s actions are indicative of any widespread cultural problems at FEMA.”\n\nMarn’i Washington, fired from her position as a disaster survivor assistance crew leader for FEMA, on the Nov. 11 edition of the Roland Martin Unfiltered Daily Digital Show had confirmed homes skipped. She said it happened at homes not only with signs for Trump but also Kamala Harris and Joe Biden.\n\nShe said it happened in Florida and the Carolinas. Hurricane Milton was one of three hurricanes to hit Florida in 66 days, and another was Helene that ravaged Georgia, the Carolinas and Tennessee – the most deaths and mostly cosstly damange coming in North Carolina.\n\nOn the Homeland Security report’s map, two notations for North Carolina include instances in October and November last year. The first says, “The survivor had a sign that read … NRA, we do our part,” and the second said, “Survivor stated that homes have been damaged, but there are Republicans on the grounds with guns so please be careful.”\n\nA dot for Florida from October says, “Trump sign, no contact per leadership.” Another dot for November said, “There was a political flyer so I didn’t leave a FEMA brochure.”\n\nFrom September 2021 in Pennsylvania, the report notes, “… a lot of explicit political flags, posters, etc. ‘F--- Joe Biden’ ‘MAGA 2024’ ‘Joe Biden Sucks’ ‘Trump 2024’ We do not recommend anyone visiting this location.”\n\nFrom October 2021 in Louisiana, “Homeowner had sign stated … this is trump country.”\n\nThe map and incidents noted were not inclusive of findings; rather, just a sampling.\n\nNoem said the following actions will happen:\n\n• Referred the case to the Department of Justice for further investigation and potential prosecution.\n\n• Also referred the case to the Department of Homeland Security Office of the Inspector General.\n\n• Canceled the door-to-door survey practice that FEMA used to discriminate against Americans.\n\n• Instructed the DHS Privacy Office to issue clear recommendations to FEMA to address these egregious violations and prevent future ones.\n\n• Required FEMA to adhere to stricter data collection practices, strengthen guidance and training, and clearly define legitimate safety and hostility concerns to ensure staff make fair and lawful decisions.\n\n• Instructed FEMA to also implement rigorous oversight and auditing mechanisms to restore integrity to its disaster relief operations.","summary":"(The Center Square) – Reports of FEMA disaster assistance teams in 2024 bypassing homes displaying signs supporting then-presidential candidate Donald Trump were true and were indicative of a pattern tracing back to Hurricane Ida in 2021, says an internal probe…","url":"https://www.guampdn.com/news/national/report-fema-under-biden-politically-discriminated-against-americans/article_c6976ee3-a5d4-5737-9e73-6dbaa10d3d2b.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/9/3f/93f5338c-bd65-5d58-9716-6c3a719edc45/68f7ed91eaf2b.preview.jpg?crop=1637%2C859%2C0%2C202&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-10-21 17:46:00","author":"By Alan Wooten | The Center Square","authors":["By Alan Wooten | The Center Square"],"language":"en","category":"politics","source_country":"gu","sentiment":-0.109},{"id":371324404,"title":"Karine Jean-Pierre reveals she never thought Kamala Harris would win","text":"Former White House press secretary Karine Jean-Pierre wrote in her new book that she didn't think former Vice President Kamala Harris would win the election. \"When I woke up, it was over. Harris had lost. I received calls from friends who were distraught or numb with disbelief. But I wasn’t surprised by the outcome. The truth was, I never really believed Harris could win. I’d been in the body of a Black woman all my life. I’d stood at the podium in the White House briefing room, traveled in my chocolate skin through rural towns, and all my experiences of blistering stares and racist assumptions left me unable to see this country electing a president who looked like me,\" she wrote in her book, \"Independent.\" Jean-Pierre's new book details her decision to leave the Democratic Party, citing what she believes was a betrayal of former President Joe Biden. The former press secretary said she felt pessimistic about Harris because of her own experiences in the role, writing that she faced misogyny, sexism and double standards. KARINE JEAN-PIERRE INSISTS TO SKEPTICAL CBS ANCHORS THAT BIDEN WAS TREATED UNFAIRLY, ALWAYS SEEMED SHARP \"Harris and so many others had fought and hoped so hard. I wanted to believe. I wanted to believe. But in the end, I was proven right. The United States just wasn’t there yet. Once again, and this time not because of an electoral artifact embedded in the Constitution, we had elected Trump,\" Jean-Pierre wrote. Jean-Pierre called out the Democratic Party throughout her book, particularly voicing frustration over what she said was the party's betrayal of former President Biden. She also blamed the party for Harris' loss. \"It was deeply disturbing that after shoving Biden aside in a disgraceful display, the party’s elders couldn’t summon enough know-how to help an intelligent, accomplished attorney like Harris defeat an ignorant former reality TV star. The party had to redefine its mission, and figure out a way to move forward without publicly tearing apart our standard bearers or leaving their successors dangling in the wind,\" she wrote. KAMALA HARRIS' BOOK, MEDIA TOUR SLAMMED BY LIBERAL CRITICS AS 'EMBARRASSING' AND 'UNHELPFUL' Biden had also blamed sexism and racism for Harris's loss. \"I wasn’t surprised, not because I didn’t think the vice president was the most qualified person to be president. She is. She’s qualified to be president of the United States of America. I was surprised, I was surprised because they went the route of, the sexist route, the whole route. I mean, this is a woman, she’s this, she’s that. I mean, it really, I’ve never seen quite as successful and a consistent campaign undercutting the notion that a woman couldn’t lead the country, and a woman of mixed race,\" Biden said on \"The View.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Jean-Pierre also wrote that Harris deserved to seek the nomination without a \"cage fight with governors and congresspeople jostling to jump the front of the line.\" \"Bypassing Harris would have also been disrespectful to Black women overall, the ride-or-die foot soldiers of the Democratic Party who’d long done the work but too often got bypassed or overlooked once the campaigns that needed their votes and labor were in the rearview mirror,\" the former press secretary wrote. CLICK HERE TO GET THE FOX NEWS APP Harris, who wrote her own memoir about her failed 2024 campaign, has repeatedly touted on her book tour and in recent public appearances that President Donald Trump does not have a mandate, calling the 2024 election the \"closest\" of this century.","summary":"Karine Jean-Pierre revealed in her new book, &quot;Independent,&quot; that she never thought former Vice President Kamala Harris would win the 2024 election, blaming racism.","url":"https://www.foxnews.com/media/karine-jean-pierre-reveals-she-never-thought-kamala-harris-would-win","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/jean-pierre-harris.jpg","video":null,"publish_date":"2025-10-21 17:33:25","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"US","sentiment":-0.367}]}