{"offset":0,"number":50,"available":224,"news":[{"id":392847344,"title":"Kamala Harris buys $8M mansion in Malibu’s celeb-packed Pt. Dume","text":"Former Vice President Kamala Harris is upgrading her Los Angeles real estate portfolio, trading one celebrity-soaked neighborhood for another. \n\nHarris and her husband Doug Emhoff recently dropped a little over $8 million ($8.15 million) on a 4,000-square-foot, four-bedroom, six-bathroom home in Point Dume, a neighborhood in Malibu that’s home to a who’s who of both Hollywood and — more recently — Silicon Valley power players, the California Post has learned. \n\nIn recent weeks several Point Dume residents have spotted Emhoff strolling through the neighborhood which rests on a 63-acre promontory perched above one of California’s most famous and exclusive beaches known as Little Dume. \n\nAccess to Little Dume, which boasts one of the most coveted surf breaks in all of California requires a special key that only a select group of Point Dume residents can possess. \n\nWhile much of Malibu remains devastated by the one-two punch of the 2018 Woolsey Fire and the 2025 Palisades Fire, Point Dume is in relatively good shape compared to other parts of Malibu.\n\nThe neighborhood has long been one of the more desirable and expensive zip codes due to its large lots and the privacy it provides which has attracted a parade of A-list actors over the years including Sean Penn, Gerard Butler and Julia Roberts.\n\nIn recent years, the glitterati of Hollywood have had to make way for the titans of Silicon Valley including venture capitalist Marc Andreesen, Google co-founder Sergey Brin and Emerson Collective president Laureen Powell Jobs, who have been snatching up many of the area’s trophy properties.\n\nHarris was born and raised in Northern California, but has made LA her primary residence ever since she married Emhoff in 2014. \n\nThey share a four-bedroom 3,500 square foot home in Brentwood that, according to The Wall Street Journal, Emhoff bought back in 2012 before he met Harris. The status of that house is unclear.\n\nAccording to an online listing, Harris and Emhoff’s new home was originally built in 1979 sits on three quarters of an acre and has a main living area that “is bathed in natural light, featuring high wood-beamed ceilings, a built-in speaker system, and a gas fireplace.” \n\nCompass’ Chris Cortazzo was the listing agent on the sale.\n\nA representative for Harris declined to comment, and Cortazzo did not respond to a request for comment.","summary":"Former vice-president Kamala Harris is upgrading her Los Angeles real estate portfolio, trading one celebrity-soaked neighborhood for another. ","url":"https://nypost.com/2026/01/13/real-estate/kamala-harris-buys-8m-mansion-in-malibus-celeb-packed-pt-dume/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/01/118846045.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/7Hcb1BeA-RyIcpnTz.mp4","publish_date":"2026-01-14 00:25:09","author":"Peter Kiefer","authors":["Peter Kiefer"],"language":"en","source_country":"us","sentiment":0.34},{"id":392842780,"title":"White House to end funding to sanctuary cities and states on Feb. 1","text":"Sanctuary cities often have policies limiting local law enforcement’s ability to cooperate with federal immigration officers.\n\nThe Department of Justice has identified 11 states as sanctuary jurisdictions, including California, Illinois, Minnesota and New York. The District of Columbia is also considered a sanctuary jurisdiction.\n\nTrump’s announcement comes just days after an Immigration and Customs Enforcement officer fatally shot an American citizen in Minneapolis. The fallout has been a whirlwind, with state officials demanding they be involved in the FBI’s investigation into the shooting, Democrats arguing ICE shouldn’t have been in Minneapolis in the first place and Trump administration officials labeling Renee Good, the woman who was killed, as a domestic terrorist.\n\nOn Tuesday, some leaders in sanctuary jurisdictions vowed to take the administration to court if the policy were to move forward.\n\n“See you in court @realDonaldTrump,” Chicago Mayor Brandon Johnson posted on X shortly after Trump’s announcement.\n\nTrump has repeatedly attempted to withhold funding from Democrat-run states, such as his $10 billion cut to child care funds in blue states earlier this month and his October cancellation of nearly $8 billion in funding to states that voted for Democrat Kamala Harris in the 2024 presidential election. Judges in New York and Washington, D.C., ruled against both those moves, respectively.","url":"https://www.politico.com/news/2026/01/13/white-house-end-funding-sanctuary-cities-states-00726557","image":"https://www.politico.com/dims4/default/474b598/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F36%2Fda%2F9ded7f85472381a04d4d3328ef5f%2Ftrump-90909.jpg","video":null,"publish_date":"2026-01-13 23:09:00","author":"Cheyanne M. Daniels","authors":["Cheyanne M. Daniels"],"language":"en","source_country":"us","sentiment":-0.452},{"id":392843652,"title":"Judge sides with blue states in fight over $7.6 billion cancelled clean energy funds","text":"A federal judge ruled in favor of Saint Paul, Minnesota, and several clean energy groups that were looking to win back federal funds for clean energy. The legal decision issued Monday comes after the Trump administration rolled back nearly $7.6 billion in October previously allocated to blue states. \n\nThe funding cancellation only targeted projects operating in 16 states that voted for Kamala Harris in 2024 and where Democrats served as governor at the time. Projects in other states were spared, even though many are part of the same Department of Energy programs and share the same general purpose. \n\n“Defendants offer no explanation for how their purposeful segregation of grantees based on their electoral support for President Trump rationally advances their stated government interest,” wrote U.S. District Judge Amit Mehta in the ruling.\n\nThe funding rollback affected a variety of congressionally-approved projects, including solar power and battery installations, developing hydrogen fuel supply chains, improving energy efficiency and building electric vehicle charging infrastructure. The October cancellation came as the Trump administration has realigned U.S. energy policy away from renewables to instead focus on expanding oil and gas drilling, keeping coal plants running and investing in nuclear power. \n\nIn a statement to Straight Arrow News, an Energy Department spokesperson stood by the agency’s “review process” that it said, “evaluated these awards individually and determined they did not meet the standards necessary to justify the continued spending of taxpayer dollars.” \n\nWhat was argued in the case? \n\nIn an announcement of the terminations, the Energy Department said affected projects were “not consistent with this Administration’s goals, policies and priorities” for energy development. The agency said it had determined terminated projects “did not adequately advance the nation’s energy needs, were not economically viable, and would not provide a positive return on investment of taxpayer dollars.”\n\nIn legal filings, lawyers for the department had argued that “consideration of partisan politics is constitutionally permissible, including because it can serve as a proxy for legitimate policy considerations.”\n\nThe plaintiffs — the City of Saint Paul, Interstate Renewable Energy Council, Plug In America, Elevate Energy, Southeast Community Organization, and the Environmental Defense Fund — argued the cancellations violated the Fifth Amendment’s equal protection clause. The financial awards for these grantees were fully obligated, meaning not only had Congress allocated the funds, but the Energy Department had already signed contracts finalizing the specific awards. \n\nSiding with the plaintiffs’ claim that their equal protection rights were violated, Judge Mehta found the administration failed to explain how segregating grantees based on how they vote served any legitimate government interest. The terminated grants were “otherwise comparable” to awards in Republican-voting states that the Energy Department did not cancel.\n\n“There is no reason to believe that terminating an award to a recipient located in a state whose citizens tend to vote for Democratic candidates — and, particularly, voted against President Trump — furthers the agency’s energy priorities any more than terminating a similar grant of a recipient in a state whose citizens tend to vote for Republican candidates,” Judge Mehta wrote. \n\nWhat happens next? \n\nThe Energy Department did not respond to questions about whether the agency would seek an appeal, but a spokesperson told SAN, “the American people deserve a government that is accountable and responsible in managing taxpayer funds.”\n\nThe ruling only applies to a few grant award winners who were plaintiffs in the case. The Energy Department is ordered to vacate termination orders and immediately release the $27.6 million in federal grants to the city of Saint Paul and six organizations involved in the suit. The ruling for these entities is likely to open the door to other affected grant recipients across the country. In total, 321 financial awards were terminated in October, affecting more than 230 projects. \n\nThe department also faces scrutiny from an internal agency watchdog over the decision. An Energy Department Inspector General audit announced in mid-December is reviewing whether the cancellations were politically motivated and complied with department rules. The audit is currently ongoing. \n\nThe post Judge sides with blue states in fight over $7.6 billion cancelled clean energy funds appeared first on Straight Arrow News.","url":"https://muvitv.com/2026/01/13/judge-sides-with-blue-states-in-fight-over-7-6-billion-cancelled-clean-energy-funds/","image":"https://muvitv.com/wp-content/uploads/2026/01/GettyImages-2239224797_Getty_Images_clean-OG6n18.jpeg","video":null,"publish_date":"2026-01-13 22:17:52","author":"Muvi","authors":["Muvi"],"language":"en","source_country":"zm","sentiment":-0.333},{"id":392832712,"title":"'Abbott Elementary,' 'Reasonable Doubt,' 'Paradise' score NAACP Image Awards nominations","text":"LOS ANGELES -- The NAACP has announced its list of \"57th NAACP Image Awards\" nominees.\n\n\"Abbott Elementary\" is up for six awards, including Outstanding Comedy Series and Quinta Brunson, Janelle James, Tyler James Williams, William Stanford Davis earned acting nods. The show also was nominated for Outstanding Writing.\n\n\"Reasonable Doubt\" also earned six nods, including Outstanding Drama Series, Emayatzy Corinealdi for Outstanding Actress and Morris Chestnut and Brandee Evans for Outstanding Guest Performance.\n\nHulu's \"Paradise\" has also been nominated for Outstanding Drama Series. And Sterling K. Brown has acting nominations for \"Paradise\" and \"Washington Black.\"\n\n\"Percy Jackson and the Olympians\" on Disney+ is nominated for Outstanding Children's Series and Leah Sava Jeffries has a nod for Outstanding Performance by a Youth (Series, Special, Television Movie or Limited-Series).\n\nHulu's \"All's Fair\" earned two nominations for Outstanding Hair and Makeup.\n\n\"Sinners\" earned the most nominations with 18, including Outstanding Motion Picture, Directing and acting nominations for Michael B. Jordan, Delroy Lindo, Miles Caton, Jayme Lawson and Wunmi Mosaku.\n\n\"Highest 2 Lowest\" received nine, including an acting nomination for A$AP Rocky.\n\nIndividually, Teyana Taylor received six nominations over multiple categories, including Entertainer of the Year.\n\n\"The NAACP Image Awards is our declaration to our community that \"We See You,\" affirming Black creativity, excellence, and humanity across every space where our stories are told,\" said Derrick Johnson, President and CEO of the NAACP. \"From film, television, and music to literature and beyond, the voices of all of our nominees tell stories that honor our past, celebrate our identity, and remind us that storytelling has the power to move culture forward.\"\n\n\"The NAACP Image Award nominations underscore what we've always known to be true - our people are the heartbeat of culture,\" said Louis Carr, President of BET. \"Their creativity, excellence, and commitment to telling our stories with authenticity and purpose continue to set the standard. We're honored to stand alongside the NAACP in celebrating the voices and visionaries who move our culture forward.\"\n\nThe awards will be handed out February 28 in Pasadena, CA.\n\nThe full list of nominees is below: \n\nEntertainer of the Year\n\nCynthia ErivoDoechiiKendrick LamarMichael B. JordanTeyana Taylor\n\nFilm Categories\n\nOutstanding Motion Picture\n\nHighest 2 Lowest (A24)One of Them Days (Sony Pictures Releasing)Sarah's Oil (Amazon MGM Studios)Sinners (Warner Bros. Pictures)Wicked: For Good (Universal Pictures)\n\nOutstanding Actor in a Motion Picture\n\nAndré Holland - Love, Brooklyn (Greenwich Entertainment)Denzel Washington - Highest 2 Lowest (A24)Michael B. Jordan - Sinners (Warner Bros. Pictures)Nnamdi Asomugha - The Knife (Relatively Media)Tyriq Withers - HIM (Monkeypaw Productions)\n\nOutstanding Actress in a Motion Picture\n\nCynthia Erivo - Wicked: For Good (Universal Pictures)Danielle Deadwyler - 40 Acres (Magnolia Pictures)Keke Palmer - One of Them Days (Sony Pictures Releasing)Kerry Washington - Shadow Force (Lionsgate)Tessa Thompson - Hedda (Amazon MGM Studios)\n\nOutstanding Supporting Actor in a Motion Picture\n\nA$AP Rocky - Highest 2 Lowest (A24)Damson Idris - F1 (Apple Original Films)Delroy Lindo - Sinners (Warner Bros. Pictures)Jeffrey Wright - Highest 2 Lowest (A24)Miles Caton - Sinners (Warner Bros. Pictures)\n\nOutstanding Supporting Actress in a Motion Picture\n\nJanelle James - One of Them Days (Sony)Jayme Lawson - Sinners (Warner Bros. Pictures)Regina Hall - One Battle After Another (Warner Bros. Pictures)Teyana Taylor - One Battle After Another (Warner Bros. Pictures)Wunmi Mosaku - Sinners (Warner Bros. Pictures)\n\nOutstanding Directing in a Motion Picture\n\nElijah Bynum - Magazine Dreams (Briarcliff Entertainment)Guillermo del Toro - Frankenstein (Netflix)Lawrence Lamont - One of Them Days (Sony Pictures Releasing)R.T. Thorne - 40 Acres (Magnolia Pictures)Ryan Coogler - Sinners (Warner Bros. Pictures)\n\nOutstanding Writing in a Motion Picture\n\nChloé Zhao - Hamnet (Focus Features)Nora Garrett - After the Hunt (Amazon MGM Studios)Ryan Coogler - Sinners (Warner Bros. Pictures)Syreeta Singleton - One of Them Days (Sony Pictures Releasing)Walter Mosley, Nadia Latif - The Man in My Basement (Andscape)\n\nOutstanding Independent Motion Picture\n\n40 Acres (Magnolia Pictures)Love, Brooklyn (Greenwich Entertainment)Magazine Dreams (Briarcliff Entertainment)Opus (A24)Unexpected Christmas (3 Diamonds Entertainment)\n\nOutstanding International Motion Picture\n\n40 Acres (Magnolia Pictures)My Father's Shadow (MUBI)Souleymane's Story (Kino Lorber)The Fisherman (Luu Vision Media)The Secret Agent (NEON)\n\nOutstanding Breakthrough Performance in a Motion Picture\n\nA$AP Rocky - Highest 2 Lowest (A24)Chase Infiniti - One Battle After Another (Warner Bros. Pictures)Miles Caton - Sinners (Warner Bros. Pictures)Tabitha Brown - Unexpected Christmas (3 Diamonds Films)Tyriq Withers - HIM (Monkeypaw Productions)\n\nOutstanding Ensemble Cast in a Motion Picture\n\nMichael B. Jordan, Hailee Steinfeld, Miles Caton, Jack O'Connell, Wunmi Mosaku, Jayme Lawson, Omar Miller, Buddy Guy, Delroy Lindo, Peter Dreimanis, Lola Kirke, Li Jun Li, Saul Williams, Yao - Sinners (Warner Bros. Pictures)Keke Palmer, SZA, Vanessa Bell Calloway, Lil Rel Howery, Katt Williams - One of Them Days (Sony Pictures Releasing)Jonathan Bailey, Marissa Bode, Coleman Domingo, Cynthia Erivo, Jeff Goldblum, Ariana Grande, Ethan Slater, Bowen Yang, Michelle Yeoh - Wicked: For Good (Universal Pictures)Denzel Washington, Jeffrey Wright, Ilfenesh Hadera, A$AP Rocky - Highest 2 Lowest (A24)Idris Elba, Rebecca Ferguson, Gabriel Basso, Jared Harris, Tracy Letts, Anthony Ramos, Moses Ingram, Jonah Hauer-King, Greta Lee, Jason Clarke - A House of Dynamite (Netflix)\n\nOutstanding Animated Motion Picture\n\nElio (Walt Disney Studios Motion Pictures)KPop Demon Hunters (Netflix)Sneaks (Briarcliff Entertainment)The Bad Guys 2 (DreamWorks Animation)Zootopia 2 (Walt Disney Studios Motion Pictures)\n\nOutstanding Character Voice-Over Performance - Motion Picture\n\nAnthony Mackie - Sneaks (Briarcliff Entertainment)Craig Robinson - The Bad Guys 2 (DreamWorks Animation)Danielle Brooks - The Bad Guys 2 (DreamWorks Animation)Lil Rel Howery - Dog Man (DreamWorks Animation)Quinta Brunson - Zootopia 2 (Walt Disney Studios Motion Pictures)\n\nOutstanding Short Form (Live Action)\n\nADO (Baylor University)Before You Let Go (Find Your People Program)Best Eyes (American Film Institute Conservatory)Ella (Netflix)Food for the Soul (P.A. Works)\n\nOutstanding Short Form (Animated)\n\nASALI: Power of The Pollinators (Upenndo! Productions)Black Man, Black Man (Chainwheel Productions)Captain Zero: Into the Abyss Part II (Cutting Edge Animation)Jazzy Bells (Deep C Digital)Wednesdays with Gramps (DreamWorks Animation)\n\nOutstanding Breakthrough Creative (Motion Picture)\n\nCassandra Mann - Unexpected Christmas (3 Diamonds Entertainment LLC)Contessa Gayles - Songs from the Hole (Netflix)Nnamdi Asomugha - The Knife (Relativity Media)R.T. Thorne - 40 Acres (Magnolia Pictures)Rachael Abigail Holder - Love, Brooklyn (Greenwich Entertainment)\n\nOutstanding Performance by a Youth in a Motion Picture\n\nAmari Price - The Knife (Relativity Media)Estella K. Kahiha - The Woman in the Yard (Athena Studios)Jahleel Kamara - Shadow Force (Lionsgate)Naya Desir-Johnson - Sarah's Oil (Amazon MGM Studios)Peyton Jackson - The Woman in the Yard (Universal Pictures)\n\nOutstanding Cinematography in a Motion Picture\n\nAutumn Durald Arkapaw, ASC - Sinners (Warner Bros. Pictures)Kira Kelly - HIM (Universal Pictures)Martim Vian - Love, Brooklyn (Greenwich)Sean Bobbitt - Hedda (Amazon MGM Studios)Shabier Kirchner - Materialists (A24)\n\nTelevision Categories\n\nOutstanding Comedy Series\n\nAbbott Elementary (ABC)Harlem (Prime Video)Survival of the Thickest (Netflix)The Residence (Netflix)The Upshaws (Netflix)\n\nOutstanding Actor in a Comedy Series\n\nCedric The Entertainer - The Neighborhood (CBS)David Alan Grier - St. Denis Medical (NBC)David Oyelowo - Government Cheese (Apple TV)Mike Epps - The Upshaws (Netflix)Vince Staples - The Vince Staples Show (Netflix)\n\nOutstanding Actress in a Comedy Series\n\nAyo Edebiri - The Bear (FX/Hulu)Maya Rudolph - Loot (Apple TV)Michelle Buteau - Survival of the Thickest (Netflix)Quinta Brunson - Abbott Elementary (ABC)Uzo Aduba - The Residence (Netflix)\n\nOutstanding Supporting Actor in a Comedy Series\n\nColman Domingo - The Four Seasons (Netflix)Giancarlo Esposito - The Residence (Netflix)Josh Johnson - The Daily Show (Comedy Central)Wendell Pierce - Elsbeth (CBS)William Stanford Davis - Abbott Elementary (ABC)\n\nOutstanding Supporting Actress in a Comedy Series\n\nEdwina Finley - The Residence (Netflix)Ego Nwodim - Saturday Night Live (NBC)Janelle James - Abbott Elementary (ABC)Jerrie Johnson - Harlem (Prime Video)Wanda Sykes - The Upshaws (Netflix)\n\nOutstanding Drama Series\n\nBel-Air (Peacock)Beyond the Gates (CBS)Forever (Netflix)Paradise (Hulu)Reasonable Doubt (Hulu)\n\nOutstanding Actor in a Drama Series\n\nForest Whitaker - Godfather of Harlem (MGM+)Jabari Banks - Bel-Air (Peacock)Michael Cooper Jr. - Forever (Netflix)Morris Chestnut - Watson (CBS)Sterling K. Brown - Paradise (ABC)\n\nOutstanding Actress in a Drama Series\n\nAngela Bassett - 9-1-1 (ABC)Emayatzy Corinealdi - Reasonable Doubt (Hulu)Lovie Simone - Forever (Netflix)Patina Miller - Power Book III: Raising Kanan (STARZ)Queen Latifah - The Equalizer (CBS)\n\nOutstanding Supporting Actor in a Drama Series\n\nAdrian Holmes - Bel-Air (Peacock)Ato Essandoh - The Diplomat (Netflix)Caleb McLaughlin - Stranger Things (Netflix)Jacob Latimore - The Chi (Showtime)Wood Harris - Forever (Netflix)\n\nOutstanding Supporting Actress in a Drama Series\n\nAisha Hinds - 9-1-1 (ABC)Audra McDonald - The Gilded Age (HBO Max)Karen Pittman - Forever (Netflix)Karen Pittman - The Morning Show (Apple TV)Nicole Beharie - The Morning Show (Apple TV)\n\nOutstanding Guest Performance\n\nBrandee Evans - Reasonable Doubt (Hulu)Dave Chappelle - Saturday Night Live (NBC)Janet Hubert - Bel-Air (Peacock)Malcolm-Jamal Warner - Murder in a Small Town (FOX)Morris Chestnut - Reasonable Doubt (Hulu)\n\nOutstanding Limited Television (Series, Special, or Movie)\n\nG20 (Prime Video)Ironheart (Disney+)Ruth & Boaz (Netflix)Straw (Netflix)Washington Black (Hulu)\n\nOutstanding Actor in a Limited Television (Series, Special, or Movie)\n\nBrian Tyree Henry - Dope Thief (Apple TV)Giancarlo Esposito - Please Don't Feed the Children (Tubi)Idris Elba - Heads of State (Prime Video)Taye Diggs - Terry McMillan Presents: His, Hers & Ours (Lifetime)Tyler Lepley - Ruth & Boaz (Netflix)\n\nOutstanding Actress in a Limited Television (Series, Special, or Movie)\n\nBrandy Norwood - Christmas Everyday (Lifetime)Dominique Thorne - Ironheart (Disney+)Serayah - Ruth & Boaz (Netflix)Taraji P. Henson - Straw (Netflix)Viola Davis - G20 (Prime Video)\n\nOutstanding Supporting Actor in a Limited Television (Series, Special, Movie)\n\nGlynn Turman - Straw (Netflix)Jay Ellis - All Her Fault (Peacock)Rockmond Dunbar - Straw (Netflix)Sterling K. Brown - Washington Black (Hulu)Ving Rhames - Dope Thief (Apple TV)\n\nOutstanding Supporting Actress in a Limited Television (Series, Special, or Movie)\n\nAngela Bassett - Zero Day (Netflix)Lyric Ross - Ironheart (Disney+)Marsai Martin - G20 (Prime Video)Sherri Shepherd - Straw (Netflix)Teyana Taylor - Straw (Netflix)\n\nOutstanding Directing in a Comedy Series\n\nAmy Aniobi - Survival of the Thickest - \"It's Not a Mo'Ment, It's a Movement, Bitch!\" (Netflix)Colman Domingo - The Four Seasons - \"Ultimate Frisbee\" (Netflix)Paul Hunter - Government Cheese - \"Father Facts, Figures, and Failures\" (Apple TV)Theodore Witcher - Demascus - \"The Thanksgiving Episode\" (Tubi)Tyler James Williams - Abbott Elementary - \"The Science Fair\" (ABC)\n\nOutstanding Directing in a Drama Series\n\nAngela Barnes - Ironheart - \"The Past Is the Past\" (Disney+)Anton Cropper - Reasonable Doubt - \"Feelin' It\" (Hulu)Jet Wilkinson - The Copenhagen Test - \"Copenhagen\" (Peacock)Mario Van Peebles - Power Book III: Raising Kanan - \"Allow Me to Re-Introduce Myself\" (STARZ)Salli Richardson-Whitfield - The Gilded Age - \"My Mind Is Made Up\" (HBO Max)\n\nOutstanding Directing in a Television Movie, Documentary or Special\n\nAlanna Brown - Ruth & Boaz (Netflix)Nicole G. Leier - Trapped in the Spotlight (Lifetime)Olatunde Osunsanmi - Star Trek: Section 31 (Paramount+)Tailiah Breon - Not My Family: The Monique Smith Story (A&E)Troy A. Scott - I'll Never Let You Go (Lifetime)\n\nOutstanding Writing in a Comedy Series\n\nAisha Muharrar - Hacks - \"Clickable Face\" (HBO Max)Frida Perez - The Studio - \"The War\" (Apple TV)Lizzy Darrell - Abbott Elementary - \"100th Day of School\" (ABC)Monique D. Hall - Sesame Street - \"Tamir's Art Show\" (MAX)Naomi Ekperigin - St. Denis Medical - \"Buffalo Bruce and the Matty Kid\" (NBC)\n\nOutstanding Writing in a Drama Series\n\nAjani Jackson - Law & Order - \"Episode 10\" (NBC)Bryce Ahart, Stephanie McFarlane - FBI - \"Episode 12\" (CBS)C.A. Johnson - The Beast in Me - \"Thanatos\" (Netflix)Cynthia Adarkwa - The Pitt -\"12:00 P.M.\" (HBO Max)Walter Mosley - The Lowdown - \"Tulsa Turnaround\" (FX/Hulu)\n\nOutstanding Writing in a Television Movie, Documentary or Special\n\nAireka Muse - Friends & Lovers (Lifetime Movie Network)Jas Summers - Stay (Hulu)Jerrod Carmichael - Jerrod Carmichael: Don't Be Gay (HBO Max)Michael Elliot, Cory Tynan - Ruth & Boaz (Netflix)Roye Okupe and Brandon Easton - Iyanu: The Age of Wonders (Cartoon Network)\n\nOutstanding News/Information (Series or Special)\n\nCNN NewsNight with Abby Phillip (CNN)Finding Your Roots with Henry Louis Gates, Jr. (PBS)Hurricane Katrina: 20 Years After the Storm With Robin Roberts (ABC)Michelle Obama: The Style, The Power, The Look: A Conversation with Robin Roberts (ABC)The Don Lemon Show (YouTube)\n\nOutstanding Talk Series\n\nHouse Guest (YouTube TV)Sherri (Syndicated)Tamron Hall Show (ABC)The Jennifer Hudson Show (Syndicated)The View (ABC)\n\nOutstanding Reality Program/Reality Competition Services/Game Show\n\nCelebrity Family Feud (ABC)Dancing with the Stars (ABC)Full Court Press (ESPN, ESPN+)Love & Marriage: Huntsville (OWN: Oprah Winfrey Network)Ready to Love (OWN: Oprah Winfrey Network)\n\nOutstanding Variety (Series or Special)\n\nTiny Desk Concerts Celebrates Black Music Month 2025 (NPR)HBCU Honors (BET Networks)BET Awards 2025 (BET Networks)Wicked: One Wonderful Night (NBC)Ali Siddiq: My Two Sons (YouTube/Moment PPV)\n\nOutstanding Children's Program\n\nEyes of Wakanda (Disney+)Gracie's Corner (YouTube TV)Iyanu (Cartoon Network)Percy Jackson and the Olympians (Disney+)Reading Rainbow (KidZuko)\n\nOutstanding Performance by a Youth (Series, Special, Television Movie or Limited-Series)\n\nAmanda Christine - IT: Welcome to Derry (HBO Max)Blake Cameron James - IT: Welcome to Derry (HBO Max)Jeremiah Felder - The Residence (Netflix)Leah Sava Jeffries - Percy Jackson and the Olympians (Disney+)Percy Daggs IV - Paradise (Hulu)\n\nOutstanding Host in a Talk or News/Information (Series or Special) - Individual or Ensemble\n\nAbby Phillip - CNN NewsNight with Abby Phillip (CNN)Don Lemon - The Don Lemon Show (YouTube)Henry Louis Gates, Jr. - Finding Your Roots with Henry Louis Gates. Jr. (PBS)Scott Evans - House Guest (YouTube TV)Sherri Shepherd - Sherri (Syndicated)\n\nOutstanding Host in a Reality/Reality Competition, Game Show or Variety (Series or Special) - Individual or Ensemble\n\nAlfonso Ribeiro and Julianne Hough - Dancing with the Stars (ABC)Barbara Corcoran, Lori Greiner, Robert Herjavec, Daymond John, Daniel Lubetzky, Kevin O'Leary - Shark Tank (ABC)Bozoma St. John and Jimmy Fallon - On Brand with Jimmy Fallon (NBC)Kevin Hart - BET Awards 2025 (BET Networks)Steve Harvey - Celebrity Family Feud (ABC)\n\nOutstanding Animated Series\n\nDisney Jr.'s Ariel (Disney Jr.)Gracie's Corner (YouTube TV)Iyanu (Cartoon Network)Lil Kev (BET+)Weather Hunters (PBS KIDS)\n\nOutstanding Character Voice-Over Performance (Television)\n\nAnika Noni Rose - The Mighty Nein (Prime Video)Ayo Edebiri - Big Mouth (Netflix)Cedric the Entertainer - The Proud Family: Louder and Prouder (Disney+)Graceyn Hollingsworth - Gracie's Corner (YouTube TV)Kyla Pratt - The Proud Family: Louder and Prouder (Disney+)\n\nOutstanding Short Form Series or Special - Reality/Nonfiction/Documentary\n\nCollege Gameday: Michael Vick (ESPN)Glam Through the Ages (KeyTV Network)Noochie's Live From the Front Porch (YouTube TV)The Apple Music Super Bowl LIX Halftime Show starring Kendrick Lamar (FOX)The Daily Show: After The Cut (Comedy Central)\n\nOutstanding Breakthrough Creative (Television)\n\nChinaka Hodge - Ironheart (Disney+)Daniel Lawrence Taylor - Boarders (Tubi)Haolu Wang - Black Mirror (Netflix)Jas Summers - Stay (Hulu)Tearrance Averelle Chisolm - Demascus (Tubi)\n\nOutstanding Costume Design (TV or Film)\n\nBel-Air - Queensylvia Akuchie (Peacock)Highest 2 Lowest - Francine Jamison-Tanchuck (A24)Love, Brooklyn - Missy Mickens (Greenwich Entertainment)Sinners - Ruth E. Carter (Warner Bros. Pictures)Wicked: For Good - Paul Tazewell (Universal Pictures)\n\nOutstanding Make-up (TV or Film)\n\nAll's Fair - Kate Biscoe (Hulu)Bel-Air - Alyssa Hudson (Peacock)Chief of War - Christian Tinsley (Apple TV)Highest 2 Lowest - Ngozi Olandu Young (A24)Sinners - Ken Diaz (Warner Bros. Pictures)\n\nOutstanding Hair Styling (TV or Film)\n\nAll's Fair - Valerie Jackson (Hulu)Bel-Air - Terry Hunt (Peacock)Beyond the Gates - Wankala L. Hinkson (CBS)Reasonable Doubt - Deaundra Metzger (Hulu)Sinners - Shunika Terry (Warner Bros. Pictures)\n\nOutstanding Editing in a Motion Picture or Television Series, Movie, or Special\n\nDeanna Nowell, ACE - Ironheart (Disney+)Maysie Hoy, ACE - Ruth & Boaz (Netflix)Michael P. Shawver - Sinners (Warner Bros. Pictures)Ralph Jean-Pierre - The Beast in Me (Netflix)Shaheed Qaasim - Poker Face (Peacock)\n\nOutstanding Stunt Ensemble (TV or Film)\n\nButterfly - Yeonheon Jung (Prime Video)F1 - Gary Powell (Apple TV)G20 - Grant Powell (Prime Video)Shadow Force - Dartenea Bryant (Starz)Sinners - Andy Gill (Warner Bros. Pictures)\n\nDocumentary Categories\n\nOutstanding Documentary (Film)\n\nBeing Eddie (Netflix)Fatherless No More (First Gen Films)Left Behind (Corso Films)The Perfect Neighbor (Netflix)Who in the Hell is Regina Jones? (Weigel Productions)\n\nOutstanding Documentary (Television)\n\nA Star Without a Star: The Untold Juanita Moore Story (Apple TV)Eyes on the Prize III: We Who Believe in Freedom Cannot Rest 1977-2015 (HBO Max)Great Migrations: A People on the Move (PBS)High Horse: The Black Cowboy (Peacock)Number One on the Call Sheet (Apple TV)\n\nOutstanding Short Form Documentary (Film)\n\nBlack Longevity (Apt. 5f)CIRILO, A Legacy Untold (JOCMedia & Entertainment)Freeman Vines (Switchboard)Masaka Kids, a Rhythm Within (Netflix)The Ebony Canal: A Story of Black Infant Health (Ya Momz House)\n\nOutstanding Directing in a Documentary (Television or Film)\n\nAhmir 'Questlove' Thompson - Sly Lives! (aka The Burden of Black Genius) (Hulu)Andre Gaines - Boo-Yah - A Portrait of Stuart Scott (ESPN)Contessa Gayles - Songs from the Hole (Netflix)Reginald Hudlin, Shola Lynch - Number One on the Call Sheet (Apple TV)Yemi Oyediran - King of Them All: The Story of King Records (PBS)\n\nMusic Categories\n\nOutstanding Album\n\nAm I The Drama? - Cardi B (Atlantic Records)Beloved - GIVON (Epic Records)Let God Sort Em Out - Clipse, Pusha T, Malice (Roc Nation Distribution)Mutt Deluxe: Heel - Leon Thomas (EZMNY Records/Motown Records)SOS Deluxe: LANA - SZA (RCA Records/Top Dawg Entertainment)\n\nOutstanding Song - Soul/R&B\n\n\"Folded\" - Kehlani (Atlantic Records)\"Burning Blue\" - Mariah the Scientist (Epic Records)\"It Depends\" - Chris Brown feat. Bryson Tiller (RCA Records/Chris Brown Entertainment)\"Yes It Is\" - Leon Thomas (EZMNY Records/Motown Records)\"Bed of Roses\" - Teyana Taylor (Def Jam Recordings)\n\nOutstanding Song - Hip-Hop/Rap\n\n\"Anxiety\" - Doechii (Top Dawg Entertainment/Capitol Records)\"Chains & Whips\" - Clipse, Kendrick Lamar, Pharrell Williams, Pusha T, Malice (Roc Nation Distribution)\"ErrTime\" - Cardi B (Atlantic Records)\"Ride (Remix)\" - Chance the Rapper feat. Do or Die & Twista (CTR LLC)\"Typa\" - GloRilla (CMG/Interscope Records)\n\nOutstanding Male Artist\n\nBryson Tiller - \"Solace\" & \"The Vices\" (RCA Records/TrapSoul)Chris Brown - \"It Depends\" feat. Byrson Tiller (RCA Records/Chris Brown Entertainment)GIVON - \"Beloved\" (Epic Records)Kendrick Lamar - \"luther\" (pgLang under exclusive license to Interscope Records)Leon Thomas - MUTT Deluxe: Heel (EZMNY Records/Motown Records)\n\nOutstanding Female Artist\n\nAlex Isley - \"Hands\" (Warner Records)Cardi B - Am I the Drama? (Atlantic Records)Doechii - \"Anxiety\" (Top Dawg Entertainment/Capitol Records)SZA - SOS Deluxe: LANA (RCA Records/Top Dawg Entertainment)Teyana Taylor - Escape Room (Def Jam Recordings)\n\nOutstanding Duo, Group or Collaboration (Traditional)\n\n803Fresh feat. Fantasia - \"Boots on the Ground Remix\" (Snake Eyez Music Group/Artist Partner Group)Clipse, Kendrick Lamar, Pharrell Williams, Pusha T, Malice - \"Chains & Whips\" (Roc Nation Distribution)Cynthia Erivo & Ariana Grande - \"For Good\" (Republic Records)Mariah Carey, The Clark Sisters - \"Jesus I Do\" (gamma.)Travis Greene & Andra Day - \"Let Freedom Ring\" (Greenelight Music/TRIBL Records)\n\nOutstanding Duo, Group or Collaboration (Contemporary)\n\nCardi B, Kehlani - \"Safe\" (Atlantic Records)Chris Brown feat. Bryson Tiller & Usher - \"It Depends (Remix)\" (RCA Records/Chris Brown Entertainment)kwn feat. Kehlani - \"Worst Behavior\" (RCA Records)FLO - \"The Mood (Remixes)\" (Uptown Records/Republic Records)Leon Thomas & Chris Brown - \"MUTT (Remix)\" (EZMNY Records/Motown Records)\n\nOutstanding New Artist \n\nElmiene - \"Useless Without You\" (Def Jam Recordings)Lee Vasi - \"Love Me to Life\" (Capitol CMG/Leeda Music Group)Madison McFerrin - \"Scorpio\" (MadMcFerrin Music LLC)Monaleo - \"Who Did the Body?\" (Columbia Records)Ravyn Lenae - \"Bicycle Race\" (Atlantic Records)\n\nOutstanding Jazz Album\n\nFor Dinah - Ledisi (Candid Records)We Insist! 2025 - Terri Lyne Carrington & Christie Dashiell (Candid Records)Beneath the Skin - Nnenna Freelon (Origin Records)Live-Action - Nate Smith - Nate Smith (Naive)Griot Songs - Omar Thomas Large Ensemble (Omar Thomas Music)\n\nOutstanding Gospel/Christian Album\n\nJekalyn X The Legends - Jekalyn Carr (Waynorth Music)Live at Maverick City - Maverick City Music (Tribl Records, LLC)Only on the Road (Live) - Tye Tribbett (Freligious Music)Tasha - Tasha Cobbs Leonard (Motown Gospel)The Live Reunion: Washington D.C. - JJ Hairson and Youthful Praise (James Town Music)\n\nOutstanding International Song\n\nIn Our Sight - Skip Marley (Def Jam Recordings)Is It - Tyla (Epic Records)Love - Burna Boy (Spaceship/Bad Habit/Atlantic Records)With You - Davido feat. Omah Lay (RCA Records/Sony Music UK)You4Me - Tiwa Savage (Everything Savage/EMPIRE)\n\nOutstanding Music Video/Visual Album\n\n\"Anxiety\" - Doechii (Top Dawg Entertainment/Capitol Records)\"Boots on the Ground\" - 803Fresh (Snake Eyez Music Group/APG)\"Escape Room\" - Teyana Taylor (Def Jam Recordings)\"Folded\"- Kehlani (Atlantic Records)\"luther\" - Kendrick Lamar & SZA (pgLang under exclusive license to Interscope Records\n\nOutstanding Soundtrack/Compilation Album\n\nGodfather of Harlem: Season 4 (Original Series Soundtrack) (Epic Records, a division of Sony Music Entertainment)Highest 2 Lowest (Original Soundtrack) (A24)Sinners (Original Motion Picture Soundtrack) (Proximity Media LLC, under exclusive license to Masterworks, a label of Sony Music Entertainment)The Proud Family: Louder and Prouder: Season 3 (Music from the Series) (Walt Disney Records)Wicked: For Good (The Soundtrack) (Republic Records)\n\nOutstanding Gospel/Christian Song\n\n\"Church\" - Tasha Cobbs Leonard feat John Legend (Motown Gospel)\"Constant - Live\" - Maverick City Music, Jordin Sparks, Chandler Moore, Anthony Gargiula (Tribl Records)\"Do it Again\" - Kirk Franklin (Fo Yo Soul Recordings/Tribl Records)\"Don't Faint\" - Jekalyn Carr (Waynorth Music)\"Jesus I Do\" - Mariah Carey feat. The Clark Sisters (gamma.)\n\nOutstanding Original Score for Television/Film\n\nBoots (Madison Gate Records)Eyes of Wakanda Original Soundtrack (Hollywood Records)Marvel's Ironheart: Vol. 1 (Original Soundtrack) (Hollywood Records)One of Them Days (Original Motion Picture Soundtrack) (Madison Gate Records, TriStar Productions)Sinners (Original Motion Picture Score) (Proximity Media LLC, under exclusive license to Sony Classical, a label of Sony Music Entertainment)\n\nLiterary Categories\n\nOutstanding Literary Work - Fiction\n\nCan't Get Enough - Kennedy Ryan (Forever/Grand Central Publishing/Hachette Book Group)Chronicles of Ori: An African Epic - Harmonia Rosales (W. W. Norton & Company)Death of the Author - Nnedi Okorafor (William Morrow)Happy Land - Dolen Perkins-Valdez (Berkley, Penguin Random House)Harlem Rhapsody - Victoria Christopher Murray (Berkley, Penguin Random House)\n\nOutstanding Literary Work - Non-Fiction\n\nA More Perfect Party: The Night Shirley Chisholm & Diahann Carroll Reshaped Politics - Juanita Tolliver (Legacy Lit/Hachette Book Group)Born in Flames - Bench Ansfield (W. W. Norton & Company)From These Roots - Tamara Lanier (Penguin Random House, Crown)Hidden Hospitality: Untold Stories of Black Hotel, Motel, and Resort Owners from the Pioneer Days to the Civil Rights Era - Calvin Stovall Jr. (Brown Books Publishing Group)I Am Nobody's Slave - Lee Hawkins (HarperCollins Publishers)\n\nOutstanding Literary Work - Debut Author\n\nAnela Malik - American Soul: The Black History of Food in the United States (National Geographic Partners, LLC)Charles B. Fancher - Red Clay (Blackstone Publishing)Dr. Judith Joseph - High Functioning: Overcome Your Hidden Depression and Reclaim Your Joy (Little, Brown Spark)Lorna Lewis - A Sky Full of Love (Lake Union)Zoe B. Wallbrook - History Lessons (Soho Crime)\n\nOutstanding Literary Work - Biography/ Autobiography\n\n107 Days - Kamala Harris (Simon & Schuster)The Look - Michelle Obama (Crown)Toni at Random - Dana A. Williams (Amistad, HarperCollins)Truly - Lionel Richie (HarperOne)Uncommon Favor: Basketball, North Philly, My Mother, and the Life Lessons I Learned from All Three - Dawn Staley (Black Privilege Publishing (Atria Books, Simon & Schuster)\n\nOutstanding Literary Work - Instructional\n\nAmerican Soul: The Black History of Food in the United States - Anela Malik (National Geographic Partners, LLC)Braided Heritage: Recipes and Stories on the Origin of American Cuisine - Dr. Jessica Harris (Penguin Random House/Clarkson Potter)We the Pizza: Slangin' Pies and Savin' Lives - Muhammad Abdul-Hadi (Penguin Random House/Clarkson Potter)Who Better Than You? - Will Packer (Penguin Random House)Wine Pairing for the People - Cha McCoy (Harvest, an imprint of William Morrow, HarperCollins)\n\nOutstanding Literary Work - Poetry\n\nDeath of the First Idea - Rickey Laurentiis (Alfred A. Knopf)Florida Water - Aja Monet (Haymarket Books)The Grace of Black Mothers - Martheaus Perkins (Trio House Press)The Intentions of Thunder: New and Selected Poems - Patricia Smith (Scribner)We Look Better Alive - Ali Black (Burnside Review Press)\n\nOutstanding Literary Work - Children\n\nBlack Boy, Rise - Brynne Barnes (Chronicle Books)Black Diamond Kings: Heroes of Negro League Baseball - Charles R. Smith Jr. (Candlewick Press)My Quiet Place - Monica Mikai (Chronicle Books )The History of We - Nikkolas Smith (Penguin Young Readers)Yvonne Clark and Her Engineering Spark - Allen R. Wells; Illustrated by DeAndra Hodge (Farrar Straus Giroux Books for Young Readers/Macmillan)\n\nOutstanding Literary Work - Youth/Teens\n\n(S)Kin - Ibi Zoboi (HarperCollins/Versify)Nic Blake and the Remarkables: The Book of Anansi - Angie Thomas (HarperCollins/Clarion Books)The Scammer - Tiffany D. Jackson (HarperCollins - Quill Tree Books)The Story of My Anger - Jasminne Mendez (Penguin Young Readers)Through Our Teeth - Pamela N. Harris (HarperCollins/Quill Tree Books)\n\nOutstanding Literary Work - Graphic Novel\n\nCreaky Acres: A Graphic Novel - Calista Bril (Penguin Young Readers)Defiant: The Story of Robert Smalls - Rob Edwards (Stranger Comics)One Crazy Summer: The Graphic Novel - Rita William-Garcia (HarperCollins/Quill Tree Books)Parable of the Talents a Graphic Novel Adaptation - Octavia E. Butler, adapted by Damien Duffy, Illustrated by John Jennings and David Brame (Abrams ComicArts)They Choose Violence - Sheldon Allen (AWA Studios)\n\nOutstanding Literary Work - Journalism \n\n\"As Black New Yorkers Move Out, N.Y.C. Politics May Be Reshaped\" - Maya King (Newspaper)\"Audra McDonald Took the Stage and Rewrote the Rules\" - Adam Davenport (Online)\"Black joy and boots: How line dancing is fanning cultural connection\" - Lisa Respers France (News Service)\"HBCUs Reel as Trump Cuts Black-Focused Grants: 'This Is Our Existence'\" - Jasper Smith (Online)\"On Borrowed Time\" - Anissa Durham (Online)\n\nPodcast Categories\n\nOutstanding Podcast - News and Information\n\nAccidentally Informed (ComebackTV Presents)Native Land Pod (iHeartMedia/Reasoned Choice Media)The Assignment with Audie Cornish (CNN)The Don Lemon Show (Lemon Media Network)The Joy Reid Show (Image Lab Media Group LLC)\n\nOutstanding Podcast - Lifestyle/Self-Help\n\nAgeless, Fearless, & Unscripted (Williamson Media Group)Hot & Bothered with Melyssa Ford (Forged Path Productions)IMO with Michelle Obama and Craig Robinson (Higher Ground)Just Heal with Dr. Jay (Cue & Coda Films)Money And Wealth With John Hope Bryant (Black Effect-iHeartPodcasts)\n\nOutstanding Podcast - Society and Culture\n\nBaby, This Is Keke Palmer (Wondery)Higher Learning with Van Lathan and Rachel Lindsay (The Ringer)IMO with Michelle Obama and Craig Robinson (Higher Ground)The Don Lemon Show (Lemon Media Network)What Now? with Trevor Noah (Day Zero Productions)\n\nOutstanding Podcast - Arts, Sports and Entertainment\n\nIMO with Michelle Obama and Craig Robinson (Higher Ground)Legacy Talk with Lena Waithe (Hillman Grad & Lemonada Media)ReLiving Single with Erika Alexander & Kim Coles (Hartbeat)Shawn Stockman's On That Note (CTG Media)SPOLITICS with Jemele Hill (Unbothered Inc)\n\nOutstanding Podcast - Scripted/Limited Series/Short Form\n\nExonerated: The Cost of Wrongful Conviction (WURD Radio)Interesting Things with JC (Jim Connors LLC)Kingsland (SBH Productions and Audible)Squeezed with Yvette Nicole Brown (Lemonada Media)The Prophecy Season 2 (Audible, Simpson Street and Q Code Media)\n\nDigital Content Categories\n\nOutstanding Digital Content Creator - Art/Comedy\n\nDarren Watkins Jr. - @IShowSpeedJordan Howlett - @jordan_the_stallion8Joshua Neal - @joshuadnealLou Young - @LouuuyoungTee Sanders - @teesanderscomedy\n\nOutstanding Digital Content Creator - Political/Culture\n\nElizabeth Booker Houston - @bookersquaredGarrison Hayes - @garrisonhGeorge Lee Jr. - @theconsciousleeJoshua Doss - @doss.discourseLynae Vanee - @lynaevance\n\nOutstanding Digital Content Creator - Fashion/Beauty\n\nAllyiah Gainer - @allyiahsfaceDe'arra Taylor - @dearraEni Popoola - @enigivensundayJackie Asamoah - @jackieainaWisdom Kaye - @wisdm\n\nOutstanding Digital Content Creator - Gaming/Tech\n\nBerlin Edmonds - @BerleezyCory Kenshin - @CoryxKenshinGerard Williams - @HiphopgamerJay Ann Lopez - @blackgirlgamersKhleo Thomas - @khleothomasAlex Hill - @justaddhotsauceJeanette Jenkins - @msjeanettejenkinsKeith Lee - @Keith_Lee125Kimberly Villalobos - @KimmysKreations.1Massy Arias - @Massy.arias\n\nThe Walt Disney Company is the parent company of this ABC staion.","summary":"Sterling K. Brown, Quinta Brunson, Janelle James, Michael B. Jordan, Kendrick Lamar and more are NAACP Image Awards nominees.","url":"https://abc7.com/post/abbott-elementary-reasonable-doubt-paradise-score-naacp-image-awards-nominations/18397336/","image":"https://cdn.abcotvs.com/dip/images/18397688_011326-otrc-naacpawards-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/ccg/011326-otrc-naacpawards-vid.mp4","publish_date":"2026-01-13 22:16:27","author":"Gina Sirico,OTRC","authors":["Gina Sirico","OTRC"],"language":"en","category":"politics","source_country":"us","sentiment":0.865},{"id":392844194,"title":"Trump uses affordability speech to air grievances and empty boasts – but offers little to bring down prices","text":"President Donald Trump on Tuesday turned what was supposed to be a routine address to Michigan business leaders to highlight his administration's economic policies into an hour-long airing of grievances and empty boasts that offered little in the way of details on how he will address Americans’ concerns in the months before voters decide whether to permit his party to retain unified control of Washington.\n\nThe president’s annual appearance before the Detroit Economic Club started off with the usual Trumpian platitudes and shout-outs to the club’s leadership and other Motor City and Wolverine State business and political luminaries, but quickly pivoted to partisan conspiracy-mongering as Trump, who lost the 2020 presidential election to Joe Biden, falsely claimed to have won Michigan’s electoral votes in all three of his runs for the White House. \n\nHe continued bragging about his 2024 election win, which included a popular vote victory over former vice president Kamala Harris, before turning to complaints about Democrats and a few Republicans who have criticized his recent military intervention in Venezuela and for good measure insulting his predecessor, former president Joe Biden, as “a real dope.”\n\nFinally turning to the topic on which he’d been planning to speak — the economy — the president said the U.S. had experienced what he called “the strongest and fastest economic turnaround in our country's history” since he returned to office last January. \n\n“There's never been anything like this. You are so lucky I allow you into this room to even be with me,” he said. \n\nThe assembled business leaders laughed nervously as he assured them he was only kidding before again claiming they were “so lucky” to be under his administration because American economic growth was “exploding.”\n\n“Productivity is soaring, investment is booming, incomes are rising. Inflation is defeated. America is respected again like never before,” he said.\n\nAfter more boasts about his administration’s economic record and swipes at both Biden and elected leaders in states such as California that did not vote for him or his party last year, the president began accusing Federal Reserve leaders — including Board of Governors Chair Jerome Powell, who he called a “stiff” — of trying to sabotage the country’s economy by failing to lower interest rates in response to positive economic numbers.\n\n“In the old days, when you had good numbers, interest rates would go down. When you had good numbers, the market would go through the roof. That's the way we're going to make it again. That's the old fashioned way. That's the right way,” Trump said. “Today, if you announce great numbers, they raise interest rates to try and kill it, so you can never really have that kind of rally.”\n\nTrump’s desire for lower interest rates has led to him to conduct a months-long campaign of browbeating and intimidation against Powell and other members of the central bank’s board that recently escalated after a federal prosecutor in Washington launched a probe into whether the Fed chair lied to Congress during testimony about a long-running renovation of the bank’s headquarters which Trump has accused him of mismanaging.\n\nHe claimed the bank once hewed to an “old standard” that lowered rates when the economy was doing well, but that has not been the case in the central bank’s modern history.\n\nWhen the Fed began raising interest rates during Biden’s presidency, it was to tamp down on inflation not seen since the mid to late 1970s after then-President Richard Nixon browbeat then-Fed chair Arthur Burns into slashing rates ahead of his 1972 re-election campaign. \n\nNixon ultimately reaped the short-term benefits in the form of his historic 1972 landslide victory which saw him win 49 of 50 states over Democratic nominee George McGovern, but by the end of the decade the artificial stimulation he had championed brought about crushing “stagflation” — a combination of low growth and high inflation — that would only be tamed in the mid 1980s after then-chair Paul Volcker instigated a recession by leading the central bank to jack up rates to 20 percent. \n\nTrump, who will nominate a replacement for Powell when his term as chair expires in May, said he wants Powell’s replacement to push for lower rates “because our country becomes stronger” that way. \n\nAfter a brief interlude during which he took credit for increased military recruiting that began under his predecessor, Trump claimed the country’s alleged recent economic success was due to his use of exorbitant tariffs on almost all American trading partners — import taxes which he falsely claims are paid by foreign countries as a kind of tribute for the privilege of having Americans import their products. \n\nThe president proceeded to embark on an extended stem-winding rant about how the country’s greatest period was during the late 1800s and early 1900s when tariffs were the main source of revenue for a far smaller federal government.\n\nHe claimed — without offering evidence — that the government’s use of an income tax after ratification of the 16th Amendment to the U.S. Constitution had roots in a foreign conspiracy to “convince” the United States that tariffs were “no good.”\n\n“So some genius ... said, ‘oh, let's go to an income tax system.’ So instead of foreign companies and countries paying everything, the people started paying,” he said before claiming that the start of the income tax in 1913 caused the Great Depression (it did not).\n\nTrump’s defense of his tariff policies comes as the Supreme Court prepares to rule on whether he exceeded his authority by unilaterally imposing the import taxes on most of the world without involving Congress. \n\nHe accused the American business owners who brought a lawsuit to invalidate the taxes as being “China-centric” and suggested that his administration will “figure something out” to impose new tariffs if the high court rules against him. \n\nRoughly 40 minutes into his nearly hour-long remarks, he finally returned to the topic of affordability, which he called “a fake word by Democrats,” and promised that he’d roll out new ideas to bring housing costs down while attending the World Economic Forum in Davos, Switzerland next week. \n\nHe promised “much more detail” about policies that would permit more Americans to enjoy home ownership when he visits the Swiss resort town while also teasing a new “health care affordability framework” that he’ll introduce later this week.\n\nWhile Americans who purchase health insurance on Affordable Care Act exchanges are reeling from massive premium increases due to his refusal to support extending Covid-era tax credits that kept costs lower for consumers, Trump claimed the forthcoming plans would “reduce premiums for millions of lower drug prices” while “delivering price transparency and demand honesty and accountability from insurance companies all over the country.”","summary":"Address to Detroit Economic Club includes few concrete proposals to address cost-of-living concerns","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-detroit-speech-affordability-lying-b2899921.html","image":"https://static.independent.co.uk/2026/01/13/19/22/President-Donald-Trump-delivers-remarks-to-the-Detroit-Economic-Club-at-the-MotorCity-Casino-Hotel-T.jpeg?crop=2297,1531.3,x0,y0.3&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/YXgMGzl3-OhrQWqOm.mp4","publish_date":"2026-01-13 21:33:03","author":"Andrew Feinberg","authors":["Andrew Feinberg"],"language":"en","category":"politics","source_country":"gb","sentiment":0.036},{"id":392822558,"title":"The Democrats' Pattern of Violence","text":"You and I have all seen the videos of Renee Good taunting, stalking, and obstructing ICE officials conducting law enforcement activities in the city. And we've all seen the video when Good makes the fatal decision to accelerate her SUV (encouraged by her wife yelling, \"Drive, baby, drive!\" while filming) into an ICE agent. That agent used legitimate force to stop a threat and now Renee Good is dead.\n\nDespite what our eyes and ears are telling us, Democrats have spent the past week pretending the shooting was a cold-blooded murder. They said Good was \"scared\" (but videos showed her smiling), they said she didn't know the man ordering her out of the vehicle was a member of law enforcement (but she'd spent all day tailing them), they said she didn't hit the ICE agent (she did). \n\nThat's gaslighting.\n\nAnd now here's another example of it, wherein we're supposed to believe that the riots we're seeing during both this Trump administration and the last one are somehow the fault of Trump and conservatives.\n\nObama: PeaceTrump: RiotsBiden: PeaceTrump: RiotsDo people really not see the pattern here?— Claire (@ClaireFosterPHD) January 12, 2026\n\nAnd while the account in question is a parody, the sentiment is real and the pattern undeniable: Democrats are inherently violent and they've encouraged their voters to engage in lawless rioting, \"resistance\" and obstruction of federal law enforcement. The pattern is also that the so-called \"defenders of democracy\" do not, in fact, like democracy, nor do they respect the democratic process.\n\nDonald Trump won the 2016 election and again in 2024. Democrats have spent the past decade claiming he stole 2016, and they spent 2021-2025 trying to put Trump behind bars so he couldn't run again. Instead, they kicked Joe Biden off the ballot and installed Kamala Harris even though she never received a single primary vote, and was so soundly rejected by Democratic Party voters in 2020 that she dropped out before Iowa.\n\nRather than debate the issues or — heaven forbid — work with President Trump on, well, anything, Democrats do what Leftists have done since time immemorial: engage in violence to get their way.\n\nHere's a two-and-a-half-minute video of many prominent Democrats doing just that.\n\nYour daily reminder that the Democratic Party is the party of violence and the calls to violence come from the top.Two and a half minutes straight of Democrat officials and talking heads calling for violence: pic.twitter.com/zFkTfcn5cT— Libs of TikTok (@libsoftiktok) October 21, 2025\n\nOf course, Nancy Pelosi, Hakeem Jeffries, Eric Swalwell, and their ilk aren't the ones going out and getting their hands dirty. Instead, they send out women like Renee Good, who they somehow convinced to believe that Trump is Hitler and ICE agents are Nazis. And it got her killed. Of course, the decision to hit the gas pedal is all on Good, but she was on that street because Democrats told her it was her duty to do so in resistance to President Trump.\n\nInstead, they'll trip over one another to get in front of microphones to tell their voters to go out and, as MN Lt. Governor Peggy Flanagan demanded, \"put their bodies on the line.\"\n\nMeanwhile, conservatives have jobs and families and lives to live. We're also not violent, despite the Left's gaslighting that portrays us as domestic terrorists for daring to question school boards, as gun-crazed would-be school shooters because we support the Second Amendment, and as disseminators of \"disinformation\" because we believe the First Amendment lets us say what's on our mind. We all know that's not true, yet the narratives persist.\n\nAs Orwell noted, \"The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.\" That Party is the modern Democratic Party, and they used Orwell as an instruction manual rather than a cautionary tale.\n\nThe good news is that gaslighting only works if people agree to deny what they can plainly see. Americans watched the videos. They saw the obstruction, the escalation, and the moment when a bad decision turned fatal. Pretending otherwise isn’t compassion — it’s manipulation. We also see it every time the Left accuses the Right of doing the very things the Democrats are doing. And the sooner people reject the Left’s demand to suspend reality for the sake of a narrative, the sooner we can stop sacrificing lives and sanity to political theater.","url":"https://townhall.com/tipsheet/amy-curtis/2026/01/13/vip-trump-riots-we-see-the-pattern-here-n2669395","image":"https://media.townhall.com/cdn/hodl/2025/160/e8b2f7e9-635e-48de-b39a-7cdfbdcbd542.jpg","video":null,"publish_date":"2026-01-13 21:00:50","author":"Amy Curtis","authors":["Amy Curtis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.507},{"id":392846320,"title":"In Detroit speech, Trump touts an economic boom invisible to many","text":"President Donald Trump visited Detroit on Tuesday, Jan. 13 to declare that the economic boom he promised Michigan during the 2024 campaign is well underway, but his perception is not shared by many Michiganders or supported by recent economic data.\n\nTrump, in an hourlong speech to the Detroit Economic Club as protesters demonstrated at two nearby locations, said the impact of his aggressive tariff policies has exceeded even his own optimistic expectations.\n\n\"One year ago, we were a dead country,\" Trump said during a speech in which he repeated familiar phrases from other addresses and few lines drew more than tepid applause. \"Now, we are the hottest country anywhere in the world.\"\n\nIn fact, though growth in U.S. gross domestic profit exceeded expectations in the third quarter of 2025, it slowed more than expected in December amid business caution about hiring because of import tariffs and rising artificial intelligence investment, Reuters reported Jan. 9, while the U.S. unemployment rate dipped to 4.4% from 4.5% in November.\n\nThe most recent Bureau of Labor Statistics figures from November also show the number of auto and auto parts jobs combined down in Michigan and across the nation compared with December 2024, the month before Trump took office.\n\nAt a business panel discussion that preceded Trump's appearance, Mary Buchzeiger, CEO of Lucerne International, a global auto supplier based in Auburn Hills, voiced a view shared by many business leaders that tariffs will hurt U.S. competitiveness.\n\n\"Tariffs are a tax on U.S. citizens,\" Buchzeiger said. \"People don't realize that.\"\n\nTrump pointed to lower gas prices, a booming stock market, and signs that the U.S. trade deficit might be shrinking, along with his administration's efforts to reduce fraud related to government social programs.\n\nTrump arrived in Detroit for his first Michigan visit of 2026 amid continued concern among automakers and consumers about his tariff-focused trade policies, and amid recent controversies about the Jan. 7 fatal shooting of 37-year-old Renee Good by an Immigrations and Customs Enforcement officer in Minneapolis, the Jan. 3 U.S. military extraction of Venezuelan President Nicolas Maduro, and the Jan. 11 disclosure that the U.S. Justice Department has launched a criminal investigation of Federal Reserve Chair Jerome Powell, all as Trump mulls possible military strikes against Iran and has renewed talk about taking over Greenland, a semiautonomous territory of NATO ally Denmark.\n\nMichigan automakers, who were encouraged under President Joe Biden to invest heavily in electric vehicle technology and manufacturing, have faced costly adjustments amid policy reversals under Trump, while at the same time responding to tariffs. On Dec. 15, Ford said it will record $19.5 billion in special charges related to restructuring its business, including pulling back its all-electric vehicle investments. GM has pegged its loss related to pivoting away from EVs in 2025 at $7.6 billion. Stellantis in October announced a $13 billion investment in U.S. manufacturing, including significant investments at two Michigan plants and moving production of the Jeep Compass away from Ontario, as earlier planned, to Illinois.\n\nMore: Multiple protesters arrested outside Trump's speech in Detroit\n\nMore: Trump in Michigan for speech to Detroit Economic Club: Watch replay\n\nMichigan will be a crucial state in the November midterm elections, as Trump hopes to hold or expand Republicans' narrow control of Congress amid 2.7% inflation in December and low approval numbers. Michigan's 2026 calendar includes an open U.S. Senate seat to replace Democratic U.S. Sen. Gary Peters, who is stepping down after two six-year terms, and several competitive U.S. House elections. Trump has stressed the importance of the midterms and pushed some states to redraw district lines to improve GOP chances. He has talked about the need to ban absentee voting by mail, raising concerns about voter suppression under the guise of election security. In September, the Trump administration sued Michigan and five other states for refusing to turn over complete voter registration data that Michigan Secretary of State Jocelyn Benson says includes personal data the U.S. Justice Department isn't automatically entitled to under the law.\n\nAfter Trump's speech, Democratic National Committee Chair Ken Martin accused the president of trying to mislead Michiganders. “Under Donald Trump’s failed economic policies, Michiganders are seeing their paychecks get tighter, and jobs disappear. And today, Trump tried to gaslight Michigan families once again — but they weren’t fooled — because new polling shows that Donald Trump is disastrously unpopular in Michigan,\" Martin said in a statement.\n\nEarlier on Jan. 13, Trump toured Ford's Dearborn Truck Plant, where the popular F-150 pickup truck is manufactured. Trump was joined on the tour by Ford Executive Chairman Bill Ford, Ford CEO Jim Farley, and U.S. Treasury Secretary Scott Bessent.\n\nTrump addressed the Detroit Economic Club twice before, during his 2016 and 2024 campaigns, but Jan. 13 was his first speech to the business group as president. Trump's 2024 remarks drew criticism when he said, in a comment not seen as complimentary, that the whole country would look like Detroit if then Democratic Vice President Kamala Harris won the election.\n\nJust down the street from the Jan. 13 event, at Trumbull and Temple, The Drop Trump Coalition assembled a crowd of over 100 to protest the president's visit as cars driving down Trumbull honked regularly in sporadic bursts of support.\n\nSam Poirier, 21, had the day off work and drove down from Adrian to protest on behalf of her siblings, some of whom she said are Latino and have voiced fear over getting pulled over or taken by ICE agents regardless of their status as American citizens.\n\nPoirier said regardless of where someone stands on the political spectrum, government agents acting aggressively against their own citizens should be concerning. “When it happens to one person, it opens the door up for it happening to others,” she said.\n\nProtesters also gathered at Detroit's Cass Park.\n\nThere, Ann Smith, a 52-year-old Ypsilanti resident, said she joined the protest because she believes “everything going on in the world right now is unacceptable.”\n\nSmith said she was alarmed by the police response as officers repeatedly ordered demonstrators to move and warned of possible force if they did not comply.\n\nFree Press staff writers Beki San Martin and Darcie Moran contributed to this report.\n\nContact Paul Egan: 517-372-8660 or pegan@freepress.com.\n\n(This story was updated to add a video.)","url":"https://eu.freep.com/story/news/politics/2026/01/13/donald-trump-speech-detroit-economic-club/88145888007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/13/PDTF/88163429007-trump-011326-es-04.jpg?auto=webp&crop=2258,1271,x0,y112&format=pjpg&width=1200","video":null,"publish_date":"2026-01-13 20:51:01","author":"Detroit Free Press","authors":["Detroit Free Press"],"language":"en","source_country":"us","sentiment":-0.027},{"id":392810048,"title":"Havana Syndrome Mystery Deepens: How A Newly Revealed Pentagon Device Is Fueling Fresh Suspicion","text":"A new CNN report suggests the mystery surrounding Havana Syndrome may be entering a critical new phase, after the Pentagon reportedly spent more than a year testing a device believed by some investigators to be capable of causing the illness. According to four sources briefed on the matter, the device was acquired through an undercover operation and cost the US government “eight figures.”,The device was purchased by Homeland Security Investigations (HSI), a division of the Department of Homeland Security, using Defense Department funding in the final days of the Biden administration. While still under study, its existence has reignited internal debate across the US government over the true cause of Havana Syndrome, officially known as “anomalous health incidents” (AHIs). The Pentagon later briefed House and Senate intelligence committees on the findings.,The device reportedly emits pulsed radio waves, a mechanism long speculated by some officials and researchers to be linked to the illness. One source said the device could fit inside a backpack, though officials remain puzzled about how a portable device could cause the severe neurological symptoms reported by some victims. The device reportedly contains Russian components, though it is not entirely Russian-made.,What Is Havana Syndrome?,Havana Syndrome first came to public attention in late 2016, when US diplomats stationed at the American embassy in Havana, Cuba, reported sudden symptoms consistent with head trauma. Some reports suggest earlier cases may date back to 2014.,Since then, at least 1,500 suspected cases across 96 countries have been reported, according to US officials cited by CNN. Cases have emerged in countries including China, India, Austria, Vietnam, France, and Switzerland. High-profile incidents include a delayed 2021 trip to Hanoi by then–Vice President Kamala Harris following reports of an anomalous health incident, as well as symptoms experienced by National Security Council staff and diplomats worldwide.,Havana Syndrome Causes and Symptoms,The exact cause of Havana Syndrome remains unknown. Over the years, officials have explored multiple theories, ranging from sonic attacks to directed energy weapons.,According to CNN, the newly acquired device produces pulsed radio waves, which some believe could be responsible for the illness. Past intelligence assessments have also suggested “pulsed electromagnetic energy” as a plausible explanation. However, researchers have struggled to determine how such energy could consistently cause the reported damage.,Reported symptoms have included:,VertigoSevere or pounding headachesNauseaEar-popping sensationsPiercing, directional noisesDespite the severity of symptoms, the National Institutes of Health found no evidence of “MRI-detectable brain injury,” adding further complexity to the investigation.,Conflicting Intelligence Assessments,US intelligence agencies have given mixed answers about Havana Syndrome over the years. In 2022, a panel said some cases might be caused by external electromagnetic energy, but in 2023 and early 2025, officials said it was unlikely that a foreign government ran a worldwide attack, though they couldn’t completely rule it out.,Many victims are frustrated, feeling ignored. Some former CIA officers say the agency downplayed evidence. A 2024 joint investigation pointed to Russia’s GRU Unit 29155, which Russia denies. Former CIA officer Marc Polymeropoulos said if the Pentagon device can cause Havana Syndrome, it would be “vindication” for victims.,Why the Device Matters,Officials are now concerned that if the technology is viable, it may have proliferated globally, allowing multiple countries access to a device capable of causing career-ending injuries to US personnel. How the US government discovered the device, or from whom it was purchased, remains unclear.,As investigations continue, Havana Syndrome remains one of the most baffling and contentious medical and national security mysteries facing the US government.,Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"The Pentagon is reportedly testing a covertly acquired device that emits pulsed radio waves and may be linked to Havana Syndrome, deepening the mystery around the illness. While the cause remains unproven, the discovery has reignited debate over whether directed energy attacks are harming US diplomats and officials worldwide.","url":"https://www.timesnownews.com/world/us/us-news/havana-syndrome-meaning-causes-symptoms-pentagon-device-article-153443628","image":"https://images.timesnownews.com/thumb/msid-153443647,thumbsize-1388603,width-1280,height-720,resizemode-75/153443647.jpg","video":null,"publish_date":"2026-01-13 20:45:45","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","source_country":"in","sentiment":-0.289},{"id":392817482,"title":"&#039;Havana Syndrome&#039; Map Shows Reported Cases Across the World","text":"The mystery of the so-called Havana Syndrome has stumped experts, intelligence officials and lawmakers for close to a decade. More than 1,000 officials and their family members are thought to have been plagued by memory loss, hearing problems, trouble sleeping and what appears to be brain injury—yet no credible cause has emerged to explain the common set of symptoms originally linked to the U.S. Embassy in the Cuban capital when the ailment first became public nearly 10 years ago. But, according to a Monday report from CNN, the Pentagon has been testing a device purchased by undercover homeland security operatives that could finally pull back the curtain on the enigma of what the U.S. officially terms “anomalous health incidents.“ What Is Havana Syndrome? The first cases became public in late 2016, when U.S. government employees and several Canadian diplomats, plus their relatives, experienced similar symptoms after being assigned to the U.S. Embassy in Havana. Cases were then reported across the world, including in the U.S. Intelligence assessments fed back to the public had not been able to identify what causes the symptoms and who may be to blame. Tourists ride classic convertible cars on the Malecon beside the U.S. Embassy in Havana, Cuba, on October 3, 2017. A U.S. intelligence report, published in January 2025, said most of the American intelligence community still doubted that a foreign adversary was behind Havana Syndrome. But one U.S. intelligence agency believed there is a “roughly even chance“ that a foreign actor had used a “novel weapon or prototype device“ to induce the symptoms, according to the unclassified assessment. One scientific study commissioned by the State Department and published in 2022 said the symptoms appear to be “consistent with the effects of directed, pulsed radio frequency energy.“ “Many of the chronic, nonspecific symptoms are also consistent with known radio frequency effects, such as dizziness, headache, fatigue, nausea, anxiety, cognitive deficits, and memory loss,“ according to the study. Another intelligence agency judged that there was the same probability a foreign actor had developed such a weapon that could have caused the reported illness. One of the most common working theories has put Russia at the heart of deploying or experimenting with some form of sonic or directed-energy weapon. Moscow, an ally of Cuba, has repeatedly denied any involvement in inducing the symptoms. The device acquired by Homeland Security Investigations—part of the Department of Homeland Security—produces pulsed radio waves, one source told CNN. It contains Russian components but is not entirely Russian-made, they added. Newsweek reached out to the Russian Foreign Ministry by email for comment. In November 2021, then-CIA Director William Burns warned Russian intelligence services that there would be “consequences“ if they were found to be responsible for Havana Syndrome, The Washington Post reported. Where Have People Experienced Havana Syndrome? Symptoms associated with the illness have been reported around the world, but it's hard to work out exactly how many people have been affected and how many suspected cases could be coincidental or ultimately unrelated. Texas Republican Representative August Pfluger, chairing a congressional hearing in May 2024, pointed to cases in the U.S., China, Vietnam, Germany, Austria, Serbia, Taiwan, Colombia and Australia. In late 2017, a senior CIA operative reported a suspected case of Havana Syndrome, followed by another incident often described as linked to the illness in Guangzhou, China, the following year. In the years since, suspected cases of Havana Syndrome have been tentatively reported elsewhere, in countries such as Poland and Uzbekistan. Olivia Troye, a homeland security adviser during President Donald Trump's first administration, told CBS News' 60 Minutes that she had experienced a “piercing feeling“ in her head, nausea and disorientation as she walked close to the White House. A visit by then-Vice President Kamala Harris to Vietnam in 2021 was delayed for several hours by an investigation into two possible cases of Havana Syndrome in Hanoi. At least two U.S. officials in Germany suffered symptoms linked to Havana Syndrome, the Wall Street Journal reported in August 2021. Weeks later, a CIA officer in India reported illness consist with Havana Syndrome, according to media reports at the time.","summary":"No definitive conclusions on the source of Havana Syndrome have ever been reached.","url":"https://www.newsweek.com/havana-syndrome-map-shows-reported-cases-across-the-world-11349863","image":"https://assets.newsweek.com/wp-content/uploads/2026/01/AP22174811076771-1.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-01-13 20:38:32","author":"Ellie Cook,John Feng","authors":["Ellie Cook","John Feng"],"language":"en","category":"politics","source_country":"US","sentiment":-0.481},{"id":392819746,"title":"Trump declares ‘economic boom’ as inflation persists","text":"President Donald Trump visited the swing state of Michigan on Tuesday to deliver a speech before the Detroit Economic Club, a nonpartisan, members-only organization. He falsely declared “inflation is defeated” and ranted his way through a familiar list of grievances — election fraud, transgender athletes and Republican defectors in Congress among them. \n\nThe speech was a crucial opportunity for the Trump administration, which has been trying to get the president to focus on affordability — a word he has repeatedly derided as a “Democrat hoax” — in swing states ahead of midterm elections. Those efforts have been largely unsuccessful so far: In Pennsylvania last month, Trump delivered a meandering speech in which he again called affordability a “hoax” and attacked former President Joe Biden using vulgarity.\n\nBut in Trump’s telling on Tuesday, the economy is his administration’s latest success story. \n\n“The results are in, and the Trump economic boom has officially begun,” he said. In a speech that lasted more than an hour and regularly went off script, Trump bragged about “almost no inflation and super high growth” and said that grocery prices and rents are down.\n\nBut federal data released Tuesday shows that inflation has remained almost unchanged, at 2.7% last month, with prices for food and housing on the rise. The GDP, on the other hand, was up by 4.3% in the third quarter of 2025, indicating economic growth. \n\nTrump also claimed that tariffs “are making money for Michigan,” insisting “they are paid by middlemen.” But tariffs are ultimately passed onto consumers, and the Yale Budget Lab estimates that Trump’s tariffs are costing the average American household $1,700 annually. He also said gasoline is “under $2 in many places” — but the national average is $2.80, according to AAA, and the lowest appears to be $2.20 in Oklahoma. (In Michigan, the state average is almost $2.90, according to the data.) \n\nThe economy remains a key issue for Michigan voters, who have complained of rising prices amid Trump’s aggressive tariff campaign, according to local polling. The poll, conducted by The Detroit News and local NBC affiliate WDIV, found that almost half of respondents — 48% — said Trump’s economic policies have made the economy weaker overall. More than 60% said their household costs have gone up in the past year. \n\nThe state, which narrowly voted for Trump’s re-election amid his promises to combat inflation, will be a focal point for the GOP in November, as Republicans seek to maintain control of two swing U.S. House districts they won in 2024. \n\nThe president often gets defensive when speaking on the economy. He told Politico last month he would grade the economy “an A-plus-plus-plus-plus-plus,” and insisted that “prices are coming down,” despite evidence to the contrary. And in a breathless, defiant pre-Christmas address delivered from the White House, Trump blamed the cost-of-living crisis on Democrats and made baseless claims about the cost of gasoline and the status of inflation. \n\nThe blame game continued Tuesday, as the president faulted Democrats and his predecessor — whom he referred to as “sleepy Joe Biden” — for Americans’ economic woes. \n\nFollowing the speech, the Democratic National Committee cast Trump’s economy as “a disaster.”\n\n“Under Donald Trump’s failed economic policies, Michiganders are seeing their paychecks get tighter, and jobs disappear,” said DNC Chair Ken Martin in a press release. “And today, Trump tried to gaslight Michigan families once again — but they weren’t fooled — because new polling shows that Trump is disastrously unpopular in Michigan.”\n\nTrump has touted some economic wins in his second term: The prices of eggs, gasoline and Thanksgiving turkeys have all come down, and he has announced cost-cutting deals with several prescription drug companies. In his White House address last month, Trump announced so-called “warrior dividends” of $1,776 — “in honor of our nation’s founding in 1776” — that would be paid out to more than 1.45 million service members. \n\nTrump also recently announced a slate of new measures that he suggested would bring down prices for average Americans. Last week, he said he was calling for a one-year cap of 10% on credit card interest rates and that he would take immediate steps to “ban large institutional investors from buying more single-family homes” — a plan that appears similar to the housing plan put forward by former Democratic presidential candidate and Vice President Kamala Harris. (Trump said Tuesday he would provide more details on that plan at the annual World Economic Forum in Davos, Switzerland, next week.) And on Monday, Trump said in a Truth Social post that his administration was working with tech companies, including Microsoft, to bring down Americans’ electricity bills. \n\nBut some American consumers can expect hard times ahead as a result of various Trump-backed policies. Monthly premiums for the lowest-income enrollees of insurance plans under the Affordable Care Act have skyrocketed after subsidies expired on Jan. 1. In September, the health policy organization KFF estimated that enrollees’ monthly premiums would more than double. \n\nOn Tuesday, Trump teased even more actions to come to help bring prices down — with a caveat. \n\n“In the coming weeks, I will be laying out even more plans to help bring back affordability,” he said, “and remember — that’s a fake word by Democrats.”","url":"https://www.ms.now/news/trump-declares-economic-boom-as-inflation-persists","image":"https://www.ms.now/wp-content/uploads/2026/01/250113-donald-trump-es.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2026-01-13 20:33:39","author":"Julianne McShane","authors":["Julianne McShane"],"language":"en","source_country":"us","sentiment":-0.452},{"id":392811072,"title":"Donald Trump's estranged niece Mary, 60, announces she has married second wife","text":"Donald Trump's estranged niece has revealed that she quietly married her second wife in an intimate ceremony last fall. \n\nMary Trump, 60, shared the news on Sunday in a newsletter to her Substack subscribers, titled 'Reader, I Married Her.' \n\n'There is a human impulse during dark times to turn away from the light, especially when the darkness encroaches in a way that feels inescapable,' she wrote. \n\n'Luckily, the opposite impulse also exists; despite the increasing onslaught of deliberate cruelty, lost ground, and assaults on our very understanding of who we are over the last year, our better instincts prevail - our instincts not only to subsist and survive, but to thrive.'\n\nMary shared that she met her second wife on January 20, 2025, noting the irony that she found love on the day that her estranged uncle was inaugurated. \n\nShe has been a fierce critic of the President throughout his political career. She campaigned against him and endorsed Kamala Harris in 2024, writing that she was 'proud and honored' to support the Democratic candidate. \n\nTrump's niece added that the wedding was last October and only a small group of family and close friends attended. \n\nShe gushed over the newfound love in her life, adding: 'There is more to the story, of course - including the reason for my not having spoken of my marriage publicly before this - and times continue to be challenging.'\n\nMary also took the opportunity to condemn her uncle's administration, calling the first year of his second term 'as shocking as it is predictable.' \n\nAlthough she didn't reveal her wife's name in the post, author E Jean Carroll commented: 'MARY! MARY! AMERICA NEEDED SOME JOY! And you and Ronda are giving it to us!!!'\n\nCarroll was awarded $83 million in a New York civil court after she accused the President of sexually abusing her. \n\nMary has a daughter, Avary Linden Trump, from her first marriage. Her father, Fred Trump Jr, was the President's older brother. He died in 1981 from a heart attack linked to alcoholism. \n\nFred was one of Trump's four siblings, including Maryanne, Elizabeth and Robert. Elizabeth is the only one of Trump's siblings still alive. \n\nTrump has previously said that Fred's alcoholism was the reason why he never drank, telling the Washington Post in 2019: 'He was so handsome, and I saw what alcohol did to him even physically... and that had an impact on me, too.'\n\nMary, a trained psychologist, revealed the family's tumultuous dynamic in her 2024 memoir, Who Could Ever Love You. \n\nShe wrote about her father's alcoholism, how he competed with his siblings for their father's attention, and how his death at 42 impacted her. \n\n'Inadequately and only conditionally loved, there were no adults in her life except for the father she loved, but lost before she could know him; and a mother abandoned by her ex-husband’s rich and powerful family who demanded her loyalty but left her with nothing,' the memoir's description reads. \n\nMary's brother, Fred Trump III, has also repeatedly spoken out against Trump's policies. \n\nIn response to the President's use of the 'R' slur, the 63-year-old wrote on X in December: 'As the parent of a young adult with severe disabilities, the use of the 'R' word is never acceptable and is very hurtful. Where has this country gone that we even have to discuss this?'\n\nFred Trump III also wrote a book about the family's dark secrets titled All in the Family: The Trumps and How We Got This Way.","summary":"Mary Trump shared that she married her second wife in a private ceremony last October. She said: 'There is a human impulse during dark times to turn away from the light.'","url":"https://www.dailymail.co.uk/news/article-15460151/mary-trump-married-donald-niece.html","image":"https://i.dailymail.co.uk/1s/2026/01/13/18/105479333-0-image-m-13_1768327244163.jpg","video":null,"publish_date":"2026-01-13 20:21:51","author":"Editor,Sophie Gable","authors":["Editor","Sophie Gable"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.063},{"id":392809608,"title":"Markey, Pressley renew push to end qualified immunity after ICE shooting death","text":"WASHINGTON, D.C. — Six days after 37-year-old Minneapolis mom and wife Renee Good’s shooting death by a U.S. Immigration and Customs Enforcement agent, Massachusetts congressional lawmakers Sen. Ed Markey and Rep. Ayanna Pressley on Tuesday reintroduced legislation first filed in 2020 that would end qualified immunity for federal law enforcement officers. \n\nThe federal legislators unveiled their “Qualified Immunity Abolition Act of 2026,” which is a more developed version of a 2020 bill they filed in the wake of George Floyd’s murder in Minneapolis. That bill never passed.\n\nThe theory of qualified immunity has given officials a legal shield from wrongdoing or misconduct in their positions for decades. If the updated legislation filed by Markey and Pressley were to pass, it would ensure that not only state and local officials, but also federal officials, could be sued by victims for civil rights violations.\n\nThe two legislators said that the measure will help defend families being “abused” by law enforcement, including ICE agents.\n\n“When masked ICE agents are allowed to kill and harm people with impunity, we have crossed a dangerous threshold in our nation,” Markey said in a statement. “All too often, the flawed and judge-made doctrine of qualified immunity shields law enforcement officers from liability, even when they commit egregious misconduct or use excessive force.”\n\nMarkey said the updated act seeks to abolish this unjust defense in cases against federal law enforcement officers, allowing victims their rights in court. “With ICE agents trampling over our laws, our rights, and our communities, we must demand justice and hold wrongdoers accountable,” he said.\n\nPaul Collins, a professor of legal studies and political science at the University of Massachusetts Amherst who has a focus on bias and the legal system, gave some insights into the history of qualified immunity.\n\n“Qualified immunity is a controversial topic. On the one hand, some view it as desirable since it enables government actors — including police — to do their jobs without great fear of legal liability,” said Collins. “On the other hand, others view it as undesirable since it makes it difficult to hold government actors accountable for harmful actions, including killing another person.”\n\nHe said that qualified immunity was introduced to protect police officers, but doesn’t appear in the U.S. Constitution.\n\nSince 1871, the law of the land has been that officials can be tried for their actions. In its passage of the “Civil Rights Act of 1871,” also known as the “Ku Klux Klan Act,” Congress allowed individuals to sue government officials, including law enforcement officers, who violate civil rights.\n\nThat changed in 1967 when the Supreme Court, in Pierson v. Ray, introduced the concept of qualified immunity, ruling that police could be protected if they acted in “good faith” with probable cause, even if mistaken. Since then, immunity has expanded over the decades.\n\n“The Court further clarified qualified immunity in 1982, when it established the current rule, which holds that police have immunity as long as their conduct ‘does not violate clearly established statutory or constitutional rights of which a reasonable person would have known,'” said Collins. “In short, qualified immunity is a judge-made doctrine that makes it exceptionally difficult to hold police accountable for actions that violate individuals’ constitutional rights, including instances of police killings.”\n\nBoth Markey and Pressley have been on the front lines tackling qualified immunity since 2020 when police officer Derek Chauvin, who is currently serving a more than 20-year sentence, murdered Floyd.\n\nFollowing Floyd’s murder, Markey joined Sen. Cory Booker, D-New Jersey, then-Sen. Kamala Harris, then-Congressional Black Caucus Chair Karen Bass, and Rep. Jerrold Nadler (NY-12) in introducing the “Justice in Policing Act” to increase data collection on police violence and improve police training.\n\nIn May of 2025, ahead of the fifth anniversary of Floyd’s death, the two reintroduced their “Ending Qualified Immunity Act,” a measure that died in the Senate.\n\nIn a statement Tuesday, Pressley said, “We cannot stand idly by while rogue federal agents — emboldened by the Trump White House — ravage our communities, brutalize families, and kill our neighbors on the street in cold blood. Our bill sends a powerful message to everyone in America — citizen or not — that when ICE agents break the law, they should and will be held accountable. For Renee Good, Keith Porter, Nenko Gantchev, and every death at the hands of federal law enforcement, Congress must end qualified immunity.”\n\nPorter and Gantchev were also ICE victims. On New Year’s Eve 2025, Porter was killed by an off-duty ICE agent in Los Angeles. Gantchev died in late 2025 while in ICE custody at the North Lake Processing Center in Michigan, with natural causes being ruled the official cause of death.\n\nMeanwhile, in Minneapolis on Tuesday, federal officers dropped tear gas and sprayed eye irritant at activists during another day of confrontations while students miles away walked out of a suburban school to protest the Trump administration’s bold immigration sweeps.\n\nThe government’s immigration crackdown is next headed to a federal court where Minnesota and two mayors are asking a judge to immediately suspend the operation. No hearing has been set on the request.\n\nGas clouds filled a Minneapolis street near where Renee Good was fatally shot in the head by an immigration agent on Jan. 7. A man scrubbed his eyes with snow and screamed for help as agents in an unmarked Jeep sprayed an orange irritant and drove away.\n\nIt’s common for people to boo, taunt and blow orange whistles when they spot heavily armed agents passing through in unmarked vehicles or walking the streets.\n\n“Who doesn’t have a whistle?” a man with a bag of them yelled.\n\nBrita Anderson, who lives nearby and came to support neighborhood friends, said she was “incensed” to see agents in tactical gear and gas masks, and wondered about their purpose.\n\n“It felt like the only reason they’d come here is to harass people,” Anderson said.\n\nIn Brooklyn Park, Minnesota, students protesting the immigration enforcement operation walked out of school as students elsewhere have done this week.\n\nWith the Department of Homeland Security pledging to send more than 2,000 immigration officers into Minnesota, the state, joined by Minneapolis and St. Paul, sued Trump’s administration Monday to halt or limit the surge.\n\nThe lawsuit says the Department of Homeland Security is violating the First Amendment and other constitutional protections by focusing on a progressive state that favors Democrats and welcomes immigrants.\n\n“This is, in essence, a federal invasion of the Twin Cities in Minnesota, and it must stop,” state Attorney General Keith Ellison said.\n\nMinneapolis Mayor Jacob Frey said: “What we are seeing is thousands — plural — thousands of federal agents coming into our city. And, yeah, they’re having a tremendous impact on day-to-day life.”\n\nDozens of protests or vigils have taken place across the U.S. to honor Good since the 37-year-old mother of three was killed, including last weekend throughout western Massachusetts.\n\nHomeland Security says it has made more than 2,000 arrests in the state since early December and is vowing to not back down. Spokesperson Tricia McLaughlin, responding to the lawsuit, accused Minnesota officials of ignoring public safety.\n\n“President Trump’s job is to protect the American people and enforce the law — no matter who your mayor, governor, or state attorney general is,” McLaughlin said.\n\nThe Trump administration has repeatedly defended the immigration agent who shot Good, saying he acted in self-defense. But that explanation has been widely panned by Frey, Minnesota Gov. Tim Walz and others based on videos of the confrontation.\n\nMaterial from the Associated Press was used in this report.","url":"https://gazettenet.com/2026/01/13/markey-pressley-renew-push-to-end-qualified-immunity-after-ice-shooting-death/","image":"https://i0.wp.com/gazettenet.com/wp-content/uploads/2025/07/795b2f43-27b3-430e-ac4e-20533fe69ef9.jpg?fit=750%2C500&quality=89&ssl=1","video":null,"publish_date":"2026-01-13 20:19:13","author":null,"language":"en","source_country":"us","sentiment":-0.369},{"id":392805438,"title":"Tony Dokoupil, 'CBS Evening News' host, to interview Donald Trump","text":"Newly minted \"CBS Evening News\" host Tony Dokoupil is set to interview President Donald Trump on Jan. 13.\n\nThe Tuesday interview comes as Dokoupil faced a bumpy first week on the job amid technical difficulties and other criticisms. Trump rarely participates in interviews with the three major networks: NBC, ABC and CBS.\n\n\"I just met President Donald J. Trump at a Ford factory in Dearborn, MI to talk about Iran, the economy and Fed Chair Jerome Powell,\" Dokoupil shared on social media.\n\nThe Trump interview also comes during a turbulent time in America, divided over the fatal shooting of Renee Nicole Good by U.S. Immigration and Customs enforcement agent Jonathan Ross in Minneapolis.\n\nTony Dokoupil admits 'big problems here' in 'CBS Evening News' debut\n\nThe ex-\"CBS Mornings\" host was named an evening anchor on Dec. 10 by CBS' editor-in-chief Bari Weiss. He started the new role last week.\n\nWeiss, who founded the right-leaning news source The Free Press, has faced some critics since her October hiring. In particular, Weiss stirred controversy in December after CBS pulled a \"60 Minutes\" segment about the notorious El Salvador prison CECOT at the last minute.\n\nAt the time, CBS News said it pulled the segment because \"we determined it needed additional reporting\" and that it \"will air in a future broadcast.\" Correspondent Sharyn Alfonsi, who reported the \"60 Minutes\" piece, reportedly wrote in an email to colleagues that the decision to pull the segment \"is not an editorial decision, it is a political one,\" according to The New York Times.\n\nCBS' parent company Paramount also paid $16 million to settle a lawsuit with Trump last July after he alleged \"60 Minutes\" deceptively edited an interview with 2024 election opponent Kamala Harris.\n\nWeiss in a statement last month said she hoped Dokoupil's new role could help bring together split viewers: \"We live in a time in which many people have lost trust in the media. Tony Dokoupil is the person to win it back,\" she said.\n\nDokoupil last week saw technical problems when discussing the day's news, from Minnesota Gov. Tim Walz's decision to skip a third gubernatorial campaign to Defense Secretary Pete Hegseth's rebuke of Arizona Sen. Mark Kelly.\n\n\"To other news, as you just heard from Jill – to other news now, to Gov. Walz,\" Dokoupil said. \"No, we're gonna do Mark Kelly. First day, first day, big problems here,\" he added with a smile.\n\n\"Are we going to Kelly here? Or are we going to go into Jonah Kaplan?\" Dokoupil then asked in reference to the Minnesota-based CBS reporter who was covering the Walz story.\n\nThe anchor's wide-reaching interview with the president is set to air on the Jan. 13 episode of \"CBS Evening News\" at 6:30 PM ET.\n\nContributing: Taijuan Moorman, Brendan Morrow","url":"https://eu.usatoday.com/story/news/politics/2026/01/13/trump-tony-dokoupil-cbs-evening-news/88162510007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/13/USAT/88163285007-2254648747.jpg?auto=webp&crop=5499,3093,x0,y251&format=pjpg&width=1200","video":null,"publish_date":"2026-01-13 19:55:06","author":"Usa Today","authors":["Usa Today"],"language":"en","category":"politics","source_country":"us","sentiment":0.081},{"id":392805284,"title":"Somalis face deportation as US ends special status","text":"The United States said Tuesday it would end a special protected status for Somalis, telling them they must leave the country by mid-March under an escalating crackdown on the community.\n\nThere is a large Somali community in Minnesota, the Midwestern state at the forefront of raids and searches by immigration officers, one of whom shot and killed a local woman last week, sparking protests.\n\nMinnesota has sought a temporary restraining order for the ICE operation in the state, which, if granted by a federal judge, would pause the enforcement sweeps that have so far reportedly led to 2,000 arrests.\n\nIn recent weeks, Washington has lashed out at Somali immigrants, alleging large-scale public benefit fraud in Minnesota’s Somali community, the largest in the country, with around 80,000 members.\n\nThe Department of Homeland Security said on X that it was “ENDING Temporary Protected Status for Somalians in the United States.”\n\n“Our message is clear. Go back to your own country, or we’ll send you back ourselves,” it said.\n\nDHS followed up by re-tweeting its initial post with a photograph of President Donald Trump and the caption “I am the captain now,” a reference to the film “Captain Phillips” in which a tanker is seized by Somali pirates.\n\nTemporary Protected Status (TPS) shields certain foreigners from deportation to disaster zones and allows them the right to work.\n\nIn November 2025, Trump wrote on social media: “I am, as President of the United States, hereby terminating, effective immediately, the Temporary Protected Status (TPS Program) for Somalis in Minnesota.”\n\nTuesday’s announcement set a March 17 departure deadline for Somalis losing their legal status.\n\nIlhan Omar, the first Somali-American elected to Congress, said Saturday that Trump is “trying to scare them and terrorise them every single day… And what we know is that Somalis are not intimidated.”\n\nOn Tuesday, the Republican president took to his Truth Social platform to attack Democrats who lead Minneapolis, its twin city St. Paul, and Minnesota.\n\n“Minnesota Democrats love the unrest that anarchists and professional agitators are causing because it gets the spotlight off of the 19 Billion Dollars that was stolen by really bad and deranged people,” Trump wrote. \n\n“FEAR NOT, GREAT PEOPLE OF MINNESOTA, THE DAY OF RECKONING & RETRIBUTION IS COMING!”\n\nImmigration and Customs Enforcement, meanwhile, has kept up its large-scale migrant sweeps across Minnesota, including Monday in the city of Detroit Lakes.\n\nOn Tuesda,y masked officers dragged a woman from her car as ICE agents conducted checks. Another individual was carried away by their limbs.\n\nThe Minneapolis Police Department said its overtime bill between January 8 and January 11 was $2 million. That period marked the height of protests sparked by the ICE-related killing, recordings of which were widely shared online.\n\nRenee Nicole Good, 37, was shot dead in her car by an ICE officer on Wednesday in Minneapolis.\n\n Fraud allegations\n\nThe Trump administration, in recent months, has latched onto news of a large-scale public benefit fraud scandal to carry out immigration raids and harsher policies targeting Minnesota’s Somali community.\n\nFederal charges have been filed against 98 people accused of embezzlement of public funds, and as US Attorney General Pam Bondi stressed, 85 of the defendants were “of Somali descent.”\n\nFifty-seven people have already been convicted in the scheme to divert $300 million in public grants intended to distribute free meals to children — but the meals never existed, prosecutors said.\n\nRepublican elected officials and federal prosecutors accuse local Democratic authorities of turning a blind eye to numerous warnings because the fraud involved Minnesota’s Somali community.\n\nDemocratic Governor Tim Walz, former vice president Kamala Harris’s running mate in the 2024 election — rejects the accusation.\n\nWhile the case became public in 2022, prosecutors ramped it up again this year with hotly politicised revelations.\n\nSituated on the Horn of Africa, war-torn Somalia has consistently been categorised as one of the world’s least developed countries by the United Nations, and the US State Department maintains a level-four “Do Not Travel” advisory, its strongest warning.","summary":"The U.S. has ended Temporary Protected Status (TPS) for Somalis, mandating they leave by mid-March amid escalating immigration crackdowns in Minnesota.\n\nRead More: https://punchng.com/somalis-face-deportation-as-us-ends-special-status/","url":"https://punchng.com/somalis-face-deportation-as-us-ends-special-status/","image":"https://cdn.punchng.com/wp-content/uploads/2023/07/24132450/Somali.jpeg","video":null,"publish_date":"2026-01-13 19:55:00","author":"Agency Report,Punch Newspapers","authors":["Agency Report","Punch Newspapers"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.009},{"id":392814754,"title":"Plaintiff's Attorney Tops KBJ's Bizarre Word Salads in SCOTUS Trans Athletes Case","text":"It's been an interesting morning in the Supreme Court, where the justices are listening to oral argument on two cases that may well determine the future of the lunatic policy of allowing boys and men to participate in girls' and women's sports. And, as you might expect, some of the comments have been jaw-droppers — especially if you're a biologist. \n\nFull disclosure: I studied biology, unlike Justice Jackson.\n\nFirst up, we have a lawyer for plaintiff and \"transgender woman\" Lindsay Hecox, one Kathleen Hartnett, who struggled to produce a definition of something most humans have known since, well, forever — the definition of \"man\" and \"woman.\" Under questioning from Justice Alito, Kathleen Hartnett sounded distinctly unsure of herself.\n\nHere's the exchange in writing (I listen to these things so you don't have to):\n\nJustice Samuel Alito: To pick up on the issue of discrimination on the basis of transgender status, let me just go back to, let me go to some basics. Do you agree that a school may have separate teams for a category of students classified as boys, and a category of students classified as girls?Kathleen Hartnett: Yes, Your Honor.SA: If it does that, then is it not necessary for there to be, for equal protection purposes, if that is challenged under the equal protection clause, an understanding of what it means to be a boy or a girl, or a man or a woman?KH: Yes, Your Honor.SA: And what is that definition? For equal protection purposes? What does it mean to be a boy or a girl, or a man or a woman?\n\nHere's where it goes off the rails.\n\nKH: Sorry, I misunderstood your question. I think that the underlying enactment, whatever it was, the policy, the law, the... we'd have to have an understanding of how the state or the government, was understanding that term, to figure out whether or not someone was excluded. We do not have a definition for the court.\n\nLet me provide one: If a person has an XY chromosome pair, they are a boy or man. If a person has an XX chromosome pair, they are a girl or woman. It's not complicated. She continues:\n\nKH: And we don't take issue with the... we're not disputing the definition in here, what we're saying is that the way it applies in practice is to exclude birth-sex males categorically from women's teams, and that there's a subset of those birth-sex males where it doesn't make sense to do so, according to the state's own interest. SA: Well, how can you, how can a court determine whether there's discrimination on the basis of sex without knowing what sex means? For equal protection purposes.KH: I think here we just know it is... we, we basically know the... that they've identified person to their own statute, Lindsay qualifies as a birth sex male. And she's being excluded categorically from the women's teams as the statute. So we're taking the statute's definitions as we find them, and we don't dispute them, we're just trying to figure out, do they create an equal protection problem. \n\nOK, now listening to this, one could be forgiven for wondering just which side of the case Kathleen Hartnett is arguing. Aside from the \"birth sex male\" horse squeeze — sex is determined genetically at conception, not at birth — she admits that Lindsay Hecox is a boy, and has been excluded from the girls' team as is right and proper. Were I in Justice Alito's shoes, my next question may have been \"Can you tell me exactly why we're even here?\"\n\nRead More: Morning Minute: Title IX Was Enacted for a Reason - It's Time to Remember That\n\nWe can expect this kind of pettifoggery from an attorney for the plaintiff on this issue. But from a Justice of the Supreme Court?\n\nThis video is rather longer, but this is the real head-scratcher. This is Justice Ketanji Brown Jackson, speaking to Idaho's Attorney General Alan Hurst:\n\nJustice Jackson: And so, to the extent, that you have an individual, who says what is happening in this law is that it is treating someone who is transgender, but who does not have, because of the medical interventions and the things that have been done, who does not have, uh, the same, uh, threat to physical competition and safety and all the reasons the state puts forward — that's actually a different class, says this individual. So you're not treating the class the same. And how do you respond to that? \n\nIt's difficult to know where to begin with this, a word salad that would make Kamala Harris blush with envy. This is another case of \"What's the question here?\"\n\nI can only reply as a biologist, but there's ample evidence that even \"transgender women\" who have undergone hormone therapy still have the musculoskeletal and cardiorespiratory advantages they were born with. And even if those advantages could be somehow erased, does Justice Jackson propose we set up innumerable examination and evaluation centers, to try to determine whose born advantages have been sufficiently negated?\n\nIt seems to me, a legal layman and a biologist, that the solution is a simple one: biological reality. In school sports, boys are boys and girls are girls, and never the twain shall meet. It's worked very well this way for years; each sex has its own inherent advantages and abilities. That we are even questioning this is a bad sign of just how silly segments of our population have become, and how that silliness has managed to make its way onto the United States Supreme Court.\n\nEditor’s Note: Every single day, here at RedState, we will stand up and FIGHT, FIGHT, FIGHT against the radical left and deliver the conservative reporting our readers deserve.\n\nHelp us continue to tell the truth about the Trump administration and its successes. Join RedState VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://redstate.com/wardclark/2026/01/13/plaintiffs-attorney-tops-kbjs-bizarre-word-salads-on-first-day-of-trans-athletes-case-n2198090","image":"https://media.townhall.com/cdn/hodl/2024/182/980adf29-6757-4ddc-9666-cdf8d033d52f.jpg","video":null,"publish_date":"2026-01-13 19:35:25","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"politics","source_country":"us","sentiment":-0.239},{"id":392819762,"title":"From courts to Congress to communities across the U.S., Americans are telling Trump ‘no’","text":"This is an adapted excerpt from the Jan. 12 episode of “The Rachel Maddow Show.”\n\nAmid the blitz of headlines, you might not have seen the news that on Monday, a federal court blocked the Trump administration from cutting billions of dollars Congress had appropriated for clean energy in blue states.\n\nThe administration admitted that it wanted to cut funding for states that voted for Kamala Harris in 2024, and leave in place funding for states that voted for Donald Trump. But a federal court has now ruled that illegal.\n\nThat ruling came after another federal court on Monday stopped Trump from shutting down a big offshore wind farm in Rhode Island and Connecticut.\n\nIt's the worst rebuke Trump has had from congressional Republicans since he’s been back in office in this disastrous year.\n\nJust one day prior, yet another federal court blocked Trump from cutting funding to the American Academy of Pediatrics.\n\nThe group criticized the flock-of-ducks-level insane quackery at Trump’s Department of Health and Human Services, under Robert F. Kennedy Jr., and the president responded by canceling its grant. But a judge has now ruled that was illegal retaliation, and so the funding has to be reinstated.\n\nOn Friday, a federal judge in Washington blocked Trump from cutting off federal election funds to states in retaliation for them not changing their election rules in ways that he wants. The judge said, “The Constitution assigns no authority to the president over federal election administration.”\n\nOn the same day, another federal court blocked Trump from freezing billions of dollars for child care and social services for kids — again — apparently in Democratic-run states.\n\nHe’s losing all the time and everywhere now. There may still be people who are shocked that Trump keeps breaking the law over and over and over again, blatantly and insistently. But the courts are not shocked anymore, and they just tell him “no” every single day — often multiple times a day.\n\nIt’s not just the courts. Last week, in one 48-hour stretch, we had a Senate vote for a war powers resolution to block Trump from any further military action in Venezuela, with five Republican senators siding with Democrats to pass that. It was enough to advance that resolution, and it will get another vote this week.\n\nThat came right on the heels of 17 Republicans in the House breaking ranks with Trump and siding with Democrats on the Affordable Care Act to try to at least temporarily undo the disastrous decision by Trump and Republicans in their so-called One Big Beautiful Bill to send tens of thousands of Americans’ health insurance rates through the roof.\n\nTrump is already whining about how he might have to veto it, if and when it passes the Senate — because he definitely wants to make sure that people’s health insurance premiums double or triple in cost because of something he personally did.\n\nIt’s the worst rebuke Trump has had from congressional Republicans since he has been back in office in this disastrous year.\n\nThis didn’t get as much attention as it should have, but right on the heels of the Senate giving Trump a one-finger salute on Venezuela and the House giving him a one-finger salute on what he did to people’s health insurance, Congress also rejected his steep budget cuts to federal science programs.\n\nTrump is trying to cut the National Science Foundation by 56%, but Congress is saying it will cut it by less than 1%. He wants to slash NOAA, the National Oceanic and Atmospheric Administration; Congress wants no cuts.\n\nTrump wants to cut basic research, which has been the lifeblood of American technological innovation since World War II; Congress instead is bumping it up more than 2%.\n\nThis is a bipartisan thing. It started in the Senate as a bipartisan agreement, and last week the House voted for it as well.\n\nI know it’s like muscle memory to assume that: a) Congress does nothing; and b) If they defy that rule and do something, it’s always terrible, but something is changing.\n\nRepublicans in the House are now down to such a slim margin that if every Democrat is there, at the moment, Republicans can afford only one defection on any given vote.\n\nThey know they’re going to get walloped in the midterms. With moderate Democrat Mary Peltola announcing on Monday that she’s going to run against the unpopular Alaska Republican Sen. Dan Sullivan, that means Democrats are getting pretty close to a shot at taking over the Senate in the midterms as well.\n\nThe American people are reacting instinctually to what Trump is doing to us, using our small-d democratic muscle memory to use our right of free speech, our right to freedom of assembly, to say no.\n\nAlso on Monday, Democratic Sen. Mark Kelly of Arizona brought a high-powered lawsuit against the administration and Pete Hegseth, suing to block their efforts to reduce his rank and dock his retirement pay, all for saying the true statement that service members are supposed to disobey illegal orders.\n\nThe state of Illinois, now joined by the city of Chicago, and the state of Minnesota, along with the city of Minneapolis, have also brought major lawsuits against the Trump administration to stop the attack by Trump’s federal agents against their constituents.\n\nNow, if the administration was hoping its shambolic violence would discourage Americans from standing up to them, they do not understand Americans.\n\nThere were huge protests last weekend against the Trump administration in Minneapolis, where Renee Nicole Good was shot and killed by an Immigration and Customs Enforcement officer last week. There were also protests in downtown Colorado Springs, Colorado, where Good is from originally.\n\nPeople took to the streets in places all across the country, not just in major cities such as New York City or Boston, but in places including Clayton, Missouri; Carson City, Nevada; Huntington Beach, California; San Antonio; and even in Fairbanks, Alaska, where the temperature was minus 25 degrees.\n\nUsually, when we have this many protests to cover all across the country, it’s because there’s been some long-planned thing, where people had weeks of notice. That was true with the first No Kings Day or the second.\n\nWhat happened these past few days was not that; it was essentially spontaneous, everywhere. There were well over a thousand protests taking place in every state in the country.\n\nThe American people are reacting instinctually to what Trump is doing to us, using our small-d democratic muscle memory to use our right of free speech, our right to freedom of assembly, to say no.\n\nThey said it couldn’t be done. But Congress is waking up, the courts are waking up — and the people are absolutely fully awake.\n\nAllison Detzel contributed.","url":"https://www.ms.now/rachel-maddow-show/maddowblog/courts-congress-protests-trump-ice-overreach-republicans","image":"https://www.ms.now/wp-content/uploads/2026/01/260113-ice-protest-pi.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2026-01-13 19:24:42","author":"Erum Salam","authors":["Erum Salam"],"language":"en","category":"politics","source_country":"us","sentiment":-0.257},{"id":392790632,"title":"US ends protection for Somalis amid escalating migrant crackdown","text":"President Donald Trump answers questions from members of the press as he departs the White House January 13, 2026 in Washington, DC. [AFP]\nThe United States said Tuesday it would end a special protected status for Somalis, telling them they must leave the country by mid-March under an escalating crackdown on the community.\nThere is a large Somali community in Minnesota, the midwestern US state at the forefront of raids and searches by immigration officers, one of whom shot and killed a local woman last week, sparking protests.\nIn recent weeks Washington has lashed out at Somali immigrants, alleging large-scale public benefit fraud in Minnesota's Somali community, the largest in the country with around 80,000 members.\nThe Department of Homeland Security said on X it was \"ENDING Temporary Protected Status for Somalians in the United States.\"\n\"Our message is clear. Go back to your own country, or we'll send you back ourselves,\" it said.\n\"Temporary Protected Status\" (TPS) shields certain foreigners from deportation to disaster zones and allows them the right to work.\nIn November 2025, US President Donald Trump wrote on social media: \"I am, as President of the United States, hereby terminating, effective immediately, the Temporary Protected Status (TPS Program) for Somalis in Minnesota.\"\nOn Tuesday, the Republican president took to his Truth Social channel to attack Democrats who lead Minneapolis, its twin city of St. Paul, and Minnesota.\n\"Minnesota Democrats love the unrest that anarchists and professional agitators are causing because it gets the spotlight off of the 19 Billion Dollars that was stolen by really bad and deranged people,\" Trump wrote.\n\"FEAR NOT, GREAT PEOPLE OF MINNESOTA, THE DAY OF RECKONING & RETRIBUTION IS COMING!\"\nImmigration and Customs Enforcement (ICE) meanwhile has kept up its large-scale migrant sweeps across Minnesota, including the city of Detroit Lakes on Monday.\nThe Minneapolis Police Department said its overtime bill between January 8 and January 11 was $2 million. That period marked the height of anti-ICE protests sparked by the dramatic killing, which was filmed and widely shared online.\nRenee Nicole Good, 37, was shot dead in her car by an Immigration and Customs Enforcement (ICE) officer in Minneapolis last Wednesday.\nFraud allegations \nStudents have protested against the situation in Minnesota, including in the Minneapolis suburb of Maple Grove, local media reported.\nThe Trump administration in recent months has latched onto news of a large-scale public benefit fraud scandal to carry out immigration raids and harsher policies targeting Minnesota's Somali community.\nFederal charges have been filed against 98 people accused of embezzlement of public funds and -- as US Attorney General Pam Bondi stressed on Monday -- 85 of the defendants were \"of Somali descent.\"\nFifty-seven people have already been convicted in the scheme to divert $300 million in public grants intended to distribute free meals to children -- but the meals never existed, prosecutors said.\nRepublican elected officials and federal prosecutors accuse local Democratic authorities of turning a blind eye to numerous warnings because the fraud involved Minnesota's Somali community.\nDemocratic Governor Tim Walz -- former vice president Kamala Harris's running mate in the 2024 election -- rejects the accusation.\nWhile the case became public in 2022, prosecutors ramped it up again this year with hotly politicized revelations.\nSituated on the Horn of Africa, war-torn Somalia has consistently been categorized as one of the world's least developed countries by the United Nations, and the US State Department maintains a level-four \"Do Not Travel\" advisory, its strongest warning.","url":"https://www.standardmedia.co.ke/africa/article/2001538455/us-ends-protection-for-somalis-amid-escalating-migrant-crackdown","image":"https://cdn.standardmedia.co.ke/images/articles/thumbnails/UF7vMMX3kS1k9fbIyxvRnEVdjwqm9Yibtu4RqTyj.jpg","video":null,"publish_date":"2026-01-13 18:04:15","author":null,"language":"en","category":"politics","source_country":"ke","sentiment":-0.07},{"id":392779732,"title":"US ends protection for Somalis amid escalating migrant crackdown","text":"The United States said Tuesday it would end a special protected status for Somalis, telling them they must leave the country by mid-March under an escalating crackdown on the community.\n\nThere is a large Somali community in Minnesota, the midwestern US state at the forefront of raids and searches by immigration officers, one of whom shot and killed a local woman last week, sparking protests.\n\nIn recent weeks Washington has lashed out at Somali immigrants, alleging large-scale public benefit fraud in Minnesota's Somali community, the largest in the country with around 80,000 members.\n\nThe Department of Homeland Security said on X it was \"ENDING Temporary Protected Status for Somalians in the United States.\"\n\n\"Our message is clear. Go back to your own country, or we'll send you back ourselves,\" it said.\n\n\"Temporary Protected Status\" (TPS) shields certain foreigners from deportation to disaster zones and allows them the right to work.\n\nIn November 2025, US President Donald Trump wrote on social media: \"I am, as President of the United States, hereby terminating, effective immediately, the Temporary Protected Status (TPS Program) for Somalis in Minnesota.\"\n\nOn Tuesday, the Republican president took to his Truth Social channel to attack Democrats who lead Minneapolis, its twin city of St. Paul, and Minnesota.\n\n\"Minnesota Democrats love the unrest that anarchists and professional agitators are causing because it gets the spotlight off of the 19 Billion Dollars that was stolen by really bad and deranged people,\" Trump wrote.\n\n\"FEAR NOT, GREAT PEOPLE OF MINNESOTA, THE DAY OF RECKONING & RETRIBUTION IS COMING!\"\n\nImmigration and Customs Enforcement (ICE) meanwhile has kept up its large-scale migrant sweeps across Minnesota, including the city of Detroit Lakes on Monday.\n\nThe Minneapolis Police Department said its overtime bill between January 8 and January 11 was $2 million. That period marked the height of anti-ICE protests sparked by the dramatic killing, which was filmed and widely shared online.\n\nRenee Nicole Good, 37, was shot dead in her car by an Immigration and Customs Enforcement (ICE) officer in Minneapolis last Wednesday.\n\n Fraud allegations \n\nStudents have protested against the situation in Minnesota, including in the Minneapolis suburb of Maple Grove, local media reported.\n\n Immigration and Customs Enforcement (ICE) has kept up its large-scale migrant sweeps across Minnesota. By Octavio JONES (AFP/File) \n\nThe Trump administration in recent months has latched onto news of a large-scale public benefit fraud scandal to carry out immigration raids and harsher policies targeting Minnesota's Somali community.\n\nFederal charges have been filed against 98 people accused of embezzlement of public funds and -- as US Attorney General Pam Bondi stressed on Monday -- 85 of the defendants were \"of Somali descent.\"\n\nFifty-seven people have already been convicted in the scheme to divert $300 million in public grants intended to distribute free meals to children -- but the meals never existed, prosecutors said.\n\nRepublican elected officials and federal prosecutors accuse local Democratic authorities of turning a blind eye to numerous warnings because the fraud involved Minnesota's Somali community.\n\nDemocratic Governor Tim Walz -- former vice president Kamala Harris's running mate in the 2024 election -- rejects the accusation.\n\nWhile the case became public in 2022, prosecutors ramped it up again this year with hotly politicized revelations.\n\nSituated on the Horn of Africa, war-torn Somalia has consistently been categorized as one of the world's least developed countries by the United Nations, and the US State Department maintains a level-four \"Do Not Travel\" advisory, its strongest warning.","url":"https://www.modernghana.com/news/1463259/us-ends-protection-for-somalis-amid-escalating.html","image":"https://cdn.modernghana.com/images/content/afp_us_customs_and_border_protection_agents_deploy_tear_gas_whil.jpg","video":null,"publish_date":"2026-01-13 17:56:00","author":null,"language":"en","category":"politics","source_country":"gh","sentiment":-0.084},{"id":392794594,"title":"U.S. ends protection for Somalis amid escalating migrant crackdown","text":"The United States said Tuesday it would end a special protected status for Somalis, telling them they must leave the country by mid-March under an escalating crackdown on the community.\n\nThere is a large Somali community in Minnesota, the midwestern US state at the forefront of raids and searches by immigration officers, one of whom shot and killed a local woman last week, sparking protests.\n\nIn recent weeks Washington has lashed out at Somali immigrants, alleging large-scale public benefit fraud in Minnesota’s Somali community, the largest in the country with around 80,000 members.\n\nThe Department of Homeland Security said on X it was “ENDING Temporary Protected Status for Somalians in the United States.”\n\n“Our message is clear. Go back to your own country, or we’ll send you back ourselves,” it said.\n\n“Temporary Protected Status” (TPS) shields certain foreigners from deportation to disaster zones and allows them the right to work.\n\nIn November 2025, US President Donald Trump wrote on social media: “I am, as President of the United States, hereby terminating, effective immediately, the Temporary Protected Status (TPS Program) for Somalis in Minnesota.”\n\nOn Tuesday, the Republican president took to his Truth Social channel to attack Democrats who lead Minneapolis, its twin city of St. Paul, and Minnesota.\n\n“Minnesota Democrats love the unrest that anarchists and professional agitators are causing because it gets the spotlight off of the 19 Billion Dollars that was stolen by really bad and deranged people,” Trump wrote.\n\n“FEAR NOT, GREAT PEOPLE OF MINNESOTA, THE DAY OF RECKONING & RETRIBUTION IS COMING!”\n\nImmigration and Customs Enforcement (ICE) meanwhile has kept up its large-scale migrant sweeps across Minnesota, including the city of Detroit Lakes on Monday.\n\nThe Minneapolis Police Department said its overtime bill between January 8 and January 11 was $2 million. That period marked the height of anti-ICE protests sparked by the dramatic killing, which was filmed and widely shared online.\n\nRenee Nicole Good, 37, was shot dead in her car by an Immigration and Customs Enforcement (ICE) officer in Minneapolis last Wednesday.\n\nFraud allegations\n\nStudents have protested against the situation in Minnesota, including in the Minneapolis suburb of Maple Grove, local media reported.\n\nThe Trump administration in recent months has latched onto news of a large-scale public benefit fraud scandal to carry out immigration raids and harsher policies targeting Minnesota’s Somali community.\n\nFederal charges have been filed against 98 people accused of embezzlement of public funds and -- as US Attorney General Pam Bondi stressed on Monday -- 85 of the defendants were “of Somali descent.”\n\nFifty-seven people have already been convicted in the scheme to divert $300 million in public grants intended to distribute free meals to children -- but the meals never existed, prosecutors said.\n\nRepublican elected officials and federal prosecutors accuse local Democratic authorities of turning a blind eye to numerous warnings because the fraud involved Minnesota’s Somali community.\n\nDemocratic Governor Tim Walz -- former vice president Kamala Harris’s running mate in the 2024 election -- rejects the accusation.\n\nWhile the case became public in 2022, prosecutors ramped it up again this year with hotly politicized revelations.\n\nSituated on the Horn of Africa, war-torn Somalia has consistently been categorized as one of the world’s least developed countries by the United Nations, and the U.S. State Department maintains a level-four “Do Not Travel” advisory, its strongest warning.","url":"https://www.ctvnews.ca/world/article/us-ends-protection-for-somalis-amid-escalating-migrant-crackdown/","image":"https://www.ctvnews.ca/resizer/v2/E22WW2QYZKGXRMMB3MHBRT3TCQ.jpg?auth=a3ed2d78aa4b8ed78172fd86b260219985667b300f7af66766e4d19a36c1472e","video":null,"publish_date":"2026-01-13 17:16:37","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.076},{"id":392744232,"title":"Former MSNBC Host Admits Woman Fatally Shot In Minneapolis Was ‘ICE Interrupter’","text":"Former MSNBC host Joy Reid admitted during a Monday interview with podcaster Angela Yee that Renee Nicole Good was part of a group of “ICE interrupters” that sought to obstruct federal immigration enforcement.\n\nGood was fatally shot by a United States Immigration and Customs Enforcement (ICE) agent during a Jan. 7 enforcement operation, raising tensions between state and local officials and the federal government. Reid, appearing on Monday’s episode of “Way Up with Angela Yee,” said that Good had sought to prevent ICE agents from apprehending illegal immigrants. (RELATED: ‘We Need To Kill These People’: Left-Wing TikTok User Calls For Violence Against ICE Agents)\n\n“This woman was part of a group of people who they train to try to be ICE interrupters. And what they try to do is observe what ICE is doing, film them, and try to use their white privilege. to be honest, they’re mainly white people, which is what we asked them to do, right?” Reid said. “Because black people… we can’t put our bodies on the line because cops will shoot us.”\n\n“And so the presumption had been, particularly a white woman, remember, part of the rationale for doing this with ICE is to save white women from being ravaged by criminal brown men,” Reid continued, referencing the outcry over the murders of Laken Riley, Rachel Morin and Jocelyn Nungaray by illegal immigrants. “So, they white women have been taking the lead in being the ones to step forward and challenge ICE.”\n\nRiley, Morin and Nungaray were all raped and murdered by illegal immigrants who had been allowed to remain in the country by the Biden administration. Their murders made illegal immigration, long a signature issue of President Donald Trump, a prominent issue in the 2024 campaign.\n\n“In this case, this white woman and her wife, who’s also a white woman, were driving in an SUV. They parked to try to block ICE from snatching people out of a suburban neighborhood,” Reid told Yee.\n\nAmong the illegal immigrants arrested by ICE in the Minneapolis area on Jan. 7, the day Good was shot, were multiple sex offenders, people convicted on drug charges and people convicted of assault, according to a Thursday release by the Department of Homeland Security.\n\nICE deployed hundreds of agents into the Minneapolis area in December to target illegal immigrants from Somalia after initial reports indicated there was widespread fraud ravaging Minnesota’s welfare programs. Federal officials said during a Dec. 18 press conference that the amount of stolen money was at least $9 billion, while the Treasury Department is investigating whether some of the stolen funds went to the radical Islamic terrorist group Al-Shabaab. (RELATED: CNN Legal Analyst Predicts Minnesota Democrats’ Anti-ICE Suit Will Go Down In Flames)\n\nReid has a history of making racially-charged rants, including calling the Founding Fathers “killers” and leeches and attacking “white women” for not backing then-Vice President Kamala Harris during MSNBC coverage of the election results on Nov. 5, 2024. Tucker Carlson, a co-founder of the Daily Caller and Daily Caller News Foundation, compared the MSNBC shows of Reid and fellow MSNBC host Tiffany Cross to “Hutu radio” during an October 2022 episode of his Fox News show, referencing media that reportedly incited the 1994 genocide in Rwanda.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'They parked to try to block ICE'","url":"https://dailycaller.com/2026/01/13/former-msnbc-host-admits-woman-fatally-shot-in-minneapolis-was-ice-interrupter/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F12%2FDCNF-Reid-Founders-Rant-Genocide-Featured.jpg","video":null,"publish_date":"2026-01-13 16:20:04","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","source_country":"US","sentiment":-0.51},{"id":392752180,"title":"How the Democrats Lost Their Manhood","text":"\"Being a male is a matter of birth. Being a man is a matter of choice.\" —Edwin Louis Cole\n\nThe day the Democratic Party lost testicle #1 was in 2016. They limped by for another eight years and severed part #2 in the summer of 2024.\n\nBoth times, the root cause of its neutering was exactly the same: The Dems tried to rig a presidential election to help a female candidate.\n\nHistorians, I suspect, will credit the Democratic Party’s PR emasculation to two events. The first was rigging the 2016 primaries in favor of Hillary Clinton.\n\nAll the grassroots liberals wanted Bernie Sanders. It was the “corporations and billionaires” (boo, hiss) who backed Clinton.\n\nThat was the moment when left-wing activists lost faith in their party’s integrity. It created an us-versus-them mentality — and incentivized calls for a socialist takeover.\n\nFew recognized it at the time, but in retrospect, that was when the Democratic Party’s ethos changed forever.\n\nThe second castration was eerily similar to the first: Once again, to favor a female candidate, the Democratic Party rigged its 2024 nomination process so Vice President Kamala Harris would cruise to victory without winning a single primary, caucus, or statewide vote.\n\nThe end result?\n\nJust like before, Donald Trump was elected president.\n\nAnd then the Democratic Party’s popularity sank like a rock. They still haven’t recovered. With its (more) moderate wing defeated and discredited, the radical leftists consolidated power and filled the vacuum, transforming the Democratic Party into what we see today. \n\nIt now belongs to them.\n\nLeft-wingers would love to blame their electoral losses on sexism, but as the Survey on American Life so aptly stated:\n\nFor those ready to argue that young men supported Trump because did not like the idea of voting for a woman, the VoteCast data offers a simpler explanation: Most young men like Donald Trump. Fifty-five percent of young men who voted in the 2024 election said they had a favorable view of Trump. \n\nLiberal publications were tearing their hair out to explain the defection of young men. Toxic masculinity and/or media manipulation were popular explanations.\n\nFrom New York Magazine:\n\nIt seems plausible to me that social media and online culture are splitting the media that young men and women get. If you’re a 23-year-old man interested in the Ultimate Fighting Championship and online, you’re being driven into a very intensely male online world.Whereas, if you’re a 23-year-old female and your interests align with what the YouTube algorithm codes, you are not entering that world. You’re actually entering the opposite world.\n\nWith apologies to opium, “copium” is a powerful drug, too. It’s easy to see why the Dems prefer to blame toxic masculinity and/or media algorithms: Doing so absolves them of all culpability.\n\nBut that theory doesn’t seem to hold, because the latest polling shows that President Trump’s popularity with young men is currently on the upswing. If it were all toxic masculinity and/or media manipulation, we’d see large numbers of men defecting from the GOP as the truth is revealed.\n\nBut that’s not happening. The opposite is true!\n\nFrom Newsweek (Jan. 9, 2026): Donald Trump’s Approval Rating Rises With Young Men\n\nDonald Trump’s approval rating has risen with young men, according to recent polling data.[…]Recent polling data shows Trump’s job approval among young men appears to have changed course after reaching a low before Christmas, and increasing in the last three polls since then. [emphasis added]\n\nWe all want easy answers, but in political elections, it’s almost always a combination of factors. Rigging elections to help female candidates was just part of the equation.\n\nOther factors include equating masculinity with “toxicity”: arguing that gender is purely a social construct, allowing biological men into female locker rooms, and fighting the “evil patriarchy” by promoting women and further disadvantaging men — even though men are statistically more likely not to go to college and are falling economically behind.\n\nWhen you look at it like that, voting Democratic is contrary to a man’s self-interest.\n\nMeanwhile, Donald Trump is shrugging off bullet wounds, fighting passionately for what he believes in, and rolling forward — confidently and methodically. As the GOP’s most important “brand ambassador,” President Trump exemplifies the attributes that men have traditionally admired the most.\n\nSo the GOP keeps getting more manly — and the Democratic Party more feminine.\n\nJust like clockwork, every time there’s a political fork in the road, the Democrats double down on feminism. And that’s what we’re seeing today with the ICE protests.\n\nRenee Nicole Good’s sad, avoidable demise will be replayed over and over again. It’ll be like the Zapruder film on steroids. The Democratic Party needs Good to be a sympathetic martyr, because that’s how political PR works: Defining the martyr’s brand ID is step one.\n\nWhoever defines the martyr defines the mission.\n\nBut the trouble is that Good isn’t a sympathetic victim. She and her spouse, Becca Good, were Karens writ large. They ignored the laws they personally disliked — because they know best, of course — and deliberately mocked and antagonized law enforcement.\n\nFor millions of American men, Good’s behavior wasn’t novel. We’ve been to this rodeo a zillion times before, because it’s the same kind of Karen behavior we’ve seen in school, at work, in public, in government, and on TV! It’s the tyranny of these smug, self-important, middle-aged white women who bully their way to the top.\n\nNews flash for the left: The more you show Renee Nicole Good and Becca Good on TV, the more young men you’ll lose.\n\nWhich will almost certainly happen, because the left wing owns today’s Democratic Party. So, if you want to appeal to the party’s base, you’re going to call for the abolition of ICE.\n\nYou have to: 69% of Democrats now want to abolish the agency. A pro-ICE Democrat has no future in his party.\n\nBut most Americans disagree. According to the latest data, 50% oppose abolishing ICE; just 42% support abolishing it. \n\nThat’s an eight-point gap.\n\nWhich matters, because Trump won in 2024 with just 49.81% of the vote, compared to Kamala Harris’ 48.34%. Numerically, this is a golden opportunity for the GOP to grow its margins.\n\nAnd so, the war of optics continues: (male) ICE agents are ridding our country of dangerous illegals. The U.S. military swooped in and captured Nicolás Maduro. Trump is talking tough to Iran. The economy keeps expanding. \n\n(And the upcoming UFC fight card at the White House ought to be a doozy!)\n\nWhereas the GOP is becoming more masculine, the Democratic Party is building a movement around the martyred image of Renee Nicole Good. It’s ridding itself of its last vestiges of masculinity. Soon, there’ll be nothing XY left.\n\nIt’s becoming less like a political party — and more like a sorority house.\n\nThat’s the other angle that future historians will find so fascinating: Not only did Donald Trump transform his own party, but he also transformed the opposition. \n\nHe masculinized the Republicans and feminized the Democrats.\n\nOne Last Thing: 2026 is a critical year for America First: It began with Mayor Mamdani declaring war on “rugged individualism” and will reach a crescendo with the midterm elections. Nothing less than the fate of the America First movement teeters in the balance.\n\nNever before have the political battlelines been so clearly defined. Win or lose, 2026 will transform our country.\n\nWe need your help to succeed! \n\nAs a PJ Media VIP member, you’ll receive exclusive access to our behind-the-paywall content, commentating privileges, and an ad-free experience. VIP Gold gets you the same level of “insider access” across our entire family of sites (PJ Media, Townhall, RedState, twitchy, Hot Air, and Bearing Arms). That means: More stories, more videos, more content, more fun, more conservatism, more EVERYTHING! \n\nAnd if you CLICK HERE and use the promo code FIGHT you’ll receive a Trumpian 60% discount! \n\nThank you for your consideration.","url":"https://pjmedia.com/scott-pinsker/2026/01/13/how-the-democrats-lost-their-manhood-n4948218","image":"https://media.townhall.com/cdn/hodl/pj/images/up/2025/72/94c65894-ff0b-4791-a437-624eae09642e.jpg","video":null,"publish_date":"2026-01-13 15:30:00","author":"Scott Pinsker","authors":["Scott Pinsker"],"language":"en","category":"politics","source_country":"us","sentiment":-0.227},{"id":392723840,"title":"‘Despicable’: Rich Democrat candidate’s wife called Bible ‘[bleeping] stupid,’ loved joke about Trump’s ‘demise’","text":"Susan Chatzky, the wife of a Democrat U.S. House candidate, made a series of inflammatory Facebook posts over the course of a decade, in which she deemed the Bible “f***ing stupid,” appeared to joke about President Donald Trump’s death and suggested that young white men to be deported or imprisoned.\n\nSusan’s husband, Peter Chatzky, a wealthy tech executive and deputy mayor of his affluent Westchester County village, is vying to unseat Republican New York Rep. Mike Lawler in a contest that could be among the most competitive races of the midterms. His wife’s comments appear to be at odds with the “compassion and empathy” Chatzky called for when announcing his congressional run.\n\n“We’re one America,” Chatzky told the Westchester County, New York-based outlet The Examiner News in June 2025, adding that he hoped to end the “hatred and divisiveness” in the current political climate. “We can all be successful together.”\n\nSusan Chatzky’s incendiary social media posts, which were previously unreported, were hidden from public view after the Daily Caller News Foundation reached out for comment.\n\nChatzky, a former board member of a local Planned Parenthood center, mocked the Bible and appeared to compare it to a popular children’s book series in a December 2021 post.\n\n“I really, really, really, don’t care about your f***ing stupid Bible,” Chatzky wrote on Facebook. “It’s a book. Should we live our lives according to Nancy Drew?”\n\nIn August 2025 while responding to the news of Taylor Swift’s engagement to NFL star Travis Kelce, Chatzky appeared to call attention to Trump’s hypothetical death.\n\n“The interwebs are so excited, you would think ‘it’ had happened,” Chatzky wrote on her Facebook page.\n\nAn account in the comments clarified the “it” in question was the death of the current president.\n\n“Imagine being Trump and knowing people are super happy for Taylor but bummed the breaking news wasn’t [sic] his demise,” the user wrote, adding a laughing emoji.\n\n“What a great day that will be!” the user added with a praying emoji at the end.\n\nChatzky reacted with a heart, referred to on Facebook as a “love.”\n\nThe National Republican Congressional Committee (NRCC), House Republicans’ campaign arm, slammed Chatzky’s inflammatory comments in a statement to the DCNF.\n\n“Radical Democrat Peter Chatzky and his wife are despicable,” NRCC spokeswoman Maureen O’Toole said. “They unabashedly support using hateful, discriminatory rhetoric and violence to get what they want. That is no way to lead, and Chatzky is unfit to serve the Hudson Valley in Congress.”\n\nIn October 2015, Susan Chatzky posted a graphic purportedly showing the number of mass shootings that year through September. In an exchange in the comments lamenting several shootings that day, she called for more drastic measures.\n\n“I hate to say this, but I think we need to deport white men in their 20s. Or put them in internment camps,” Chatzky said. “I’ll really miss my sons.”\n\nWhen another account expressed alarm at Chatzky’s proposal and said her broad generalizations of white people could lead to stereotypes of black men, Chatzky backtracked and claimed she was joking.\n\n“I’m just tired of people being so afraid of people of color,” Chatzky said in a comment since-scrubbed from public view. “I was trying to point out how ridiculous that is. That stupid mom who wouldn’t let her son learn about Islam really got to me this week.”\n\nChatzky also reacted positively to a viral news story in January 2021 during which an 18-year-old woman publicly shamed her mother for getting punched in the face at a pro-Trump rally.\n\n“This gives me hope,” Chatzky wrote in a post accompanying a Newsweek story of the incident.\n\nThat month, Chatzky also argued members of Congress who declined to wear masks in the Capitol should face criminal prosecution.\n\n“The lawmakers who refused to wear masks should be brought up on charges of reckless endangerment,” Chatzky wrote.\n\nPeter Chatzky is among several Democrats running in a crowded primary to defeat Lawler in November.\n\nCait Conley, an Army combat veteran and former national security official, and Rockland County legislator Beth Davidson appear to be the favorites of national Democrats. Chatzky, however, is pledging to shake up the June primary with a $5 million investment into his campaign from his personal wealth.\n\nLawler’s Hudson Valley seat, New York’s 17th congressional district, is one of three GOP-held districts that former Vice President Kamala Harris carried in 2024, albeit the Democrat won it by under one percentage point. The NRCC is expected to spend aggressively to defend Lawler’s reelection bid.\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].","summary":"'I hate to say this, but I think we need to deport white men in their 20s. Or put them in internment camps'","url":"https://www.wnd.com/2026/01/despicable-rich-democrat-candidates-wife-called-bible-bleeping/","image":"https://www.wnd.com/wp-content/uploads/2021/04/christians-in-god-we-trust-flag-congress-patriotic-americans-churches-bible-scripture-jpg.jpg","video":null,"publish_date":"2026-01-13 14:21:45","author":"Daily Caller News Foundation","authors":["Daily Caller News Foundation"],"language":"en","category":"politics","source_country":"us","sentiment":-0.014},{"id":392665076,"title":"The quest to 'Make America Fertile Again' stalls under Trump","text":"ReutersU.S. Health and Human Services (HHS) Secretary Robert F. Kennedy Jr. and Agriculture Secretary Brooke Rollins gesture, as they announce new nutrition policies during a press conference at the Department of Health and Human Services in Washington, D.C., U.S., January 8, 2026.\n\nVice President JD Vance last week called falling marriage rates \"a big problem.\" The deputy secretary of Health and Human Services in December urged his agency to \"make America fertile again.\" And at a recent conference for young conservatives, Transportation Secretary Sean Duffy doubled down on the importance of marriage and children, holding out his nine kids as a model for others to follow.But one year into President Donald Trump's second term, his administration has enacted few policies to reduce the rising cost of having children -- frustrating some conservatives who expected Trump to prioritize their plans to boost the U.S. birthrate as it continues to drop.ET Budget Survey: Tell us your wishlistSome Republicans in Congress and leading conservative policy groups have pushed unsuccessfully to significantly expand tax credits for families or introduce a \"baby bonus\" for all new moms, proposals that Trump and Vance had championed in the past. Trump's plans for combating infertility have also largely stalled out, after the administration announced a new policy on in vitro fertilization in October that fell far short of Trump's campaign promise to make the procedure free.\"If your version of being pro-family is talking about how great families are and encouraging people to get married and have kids, you end up doing a lot of lip service without changing the material and economic conditions on the ground,\" said Patrick T. Brown, who focuses on family policy at the conservative Ethics and Public Policy Center. \"Just the bully pulpit alone is not really enough.\"Conservative advocates in touch with the White House said family policy issues were not a current priority for Trump's domestic policy team, which has been hyper-focused on immigration.Live EventsA White House spokesperson, Kush Desai, said the administration was pursuing a \"multifaceted approach\" to helping American parents. That agenda has included reducing the cost of medications necessary for in vitro fertilization and working with Congress to institute $1,000 \"Trump accounts\" for every baby born, an investment account accessible when the child turns 18.\"The administration is committed to robustly addressing the problems underlying family formation in America,\" Desai said.While a group of prominent conservatives had been pushing for more explicitly pro-family policies for years, the dawn of the second Trump administration last year seemed to many like the moment when leaders in Washington would turn their focus to the issue, with figures from Vance to Elon Musk regularly talking about the importance of people having more babies. Project 2025, the policy blueprint that has forecast much of Trump's agenda, opened with a promise to \"restore the family as the centerpiece of American life.\"Through the first half of last year, many conservatives believed that the Trump administration would focus on the issue. White House officials met with a wide array of family policy advocates in the first months after Trump took office, soliciting suggestions for policies that would encourage women to have more children.Trump referred to himself last spring as the \"fertilization president.\" He then praised the idea of a federal \"baby bonus,\" before pursuing the less costly \"Trump accounts\" -- a measure that family policy advocates say will do little to encourage procreation because the accounts are not accessible to parents while raising their children.Plans began to take shape over the summer for a \"White House family summit,\" according to three people who spoke on the condition of anonymity to share private discussions. For months, leaders from several conservative policy groups worked with the White House to coordinate the details of the event, the people said. The president would talk on the South Lawn about the importance of getting married and having more babies, they had planned, and sign executive orders on the topic.One proposed executive order under consideration would have introduced a \"honeymoon bonus\" for low-income couples to maintain the federal benefits they received as single people for up to one year after their wedding, according to documents reviewed by The New York Times. Another would have directed the Health Department to create an \"America First Baby Box\" for all new parents, with American-made blankets and a diaper starter pack.But plans for the summit fizzled in the fall.\"There has been big distractions, but that's not an excuse to kick the can down the road on family policy,\" said John Mize, the CEO of the anti-abortion group Americans United for Life. \"There are several people in the administration who are strongly pro-family, but the issue gets put down on the priority list.\"After signing an executive order early in his term promising to cut the cost of in vitro fertilization, Trump officials went silent on the issue for much of last year. Trying to please both Christian conservatives opposed to IVF and the general public, which remains overwhelmingly supportive of the procedure, the Trump administration settled on a policy in the fall that reduces the cost of the series of procedures by 10% to 20% -- a meaningful discount for some but unlikely to significantly expand access.Some remain optimistic that Trump could still make the issue of falling birthrates a priority. The president said on social media last week that he wanted to prevent large investors from buying more single-family homes -- a move aimed at bringing down housing costs for families.Policy groups are continuing to outline their own grand ambitions. The Heritage Foundation, the organization behind Project 2025, on Thursday released extensive recommendations on how to push more people toward marriage, including access to tens of thousands of dollars in investment accounts if they wed before age 30.The report recommended expanding tax credits for married couples after they give birth, with a \"large family bonus\" for those with more than two children. Heritage has already been talking to influencers who have been vocal on these subjects, said Roger Severino, the group's vice president for economic and domestic policy.Severino said he believed that a \"vibe shift\" on marriage and family was already underway. He cited an NBC News poll released in the fall, in which young men under 30 who voted for Trump in 2024 listed \"having children\" as the most important marker of their definition of success. For young men who voted for Kamala Harris, on the other hand, \"having children\" was way down the list, the 10th most important marker -- after having money and a good job.\"Marriage is making a comeback,\" Severino said.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontrumpwhite housetrump s agendatrump and vancetrump administrationtransportationnew york timesnbc news\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontrumpwhite housetrump s agendatrump and vancetrump administrationtransportationnew york timesnbc news \n\nExplore More Stories123","summary":"President Donald Trump's administration is facing criticism for its limited action on declining birth rates. Despite vocal support from Vice President JD Vance and other officials, concrete policies to reduce the cost of raising children have stalled. Conservatives expected more, but the focus has been on immigration.","url":"https://economictimes.indiatimes.com/news/international/global-trends/the-quest-to-make-america-fertile-again-stalls-under-trump/articleshow/126506285.cms","image":"https://img.etimg.com/thumb/msid-126506323,width-1200,height-630,imgsize-126862,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2026-01-13 13:13:45","author":"The New York","authors":["The New York"],"language":"en","category":"politics","source_country":"in","sentiment":-0.061},{"id":392644472,"title":"Notice Anything Regarding All These Angry, Miserable White Liberal Women?","text":"Social media has become a driver of information, among many other things, but it’s also provided the single greatest argument toward ending women’s suffrage. I’m sorry, but white, crusty, liberal women have killed the case for the 19th Amendment. Should there be a complete and total shutdown of women’s voting rights until we can figure out what’s going on? Maybe. Look, we know what’s going on, to be honest. We killed their hopes of a Hillary Clinton presidency and obliterated Kamala Harris’ shoddy, inept, and overall shambolic 2024 campaign. \n\nWith all the whining, ranting, and calls for violence, have you noticed one common theme regarding all the videos they post on social media? They’re all alone. It’s befitting because normal people don’t want to be around this hot mess. One comedian had it right—they’re alone in these videos because none of them have friends. \n\nI call her the ICE LADY.. pic.twitter.com/LQMpSkSpGW— Ben Bankas (@BenBankas) January 10, 2026\n\n“I’ve been called a c*nt and a b*tch, but you know what I’ve never been called? A Republican!”How does this make Republicans feel? 😂✨🌈 pic.twitter.com/oseucLnOgt— Meme’nOnLibs (@MemeNonLibs) January 13, 2026\n\nA liberal Instagram influencer called ‘kris.and.dave’ has 1.4 million followersTHIS is what inciting extreme violence looks like, and there are 475k likes on this post“As a combat veteran, I'm having a hard time seeing the difference between ICE and ISIS. ICE covered their… pic.twitter.com/8EQ5Bn128K— Wall Street Apes (@WallStreetApes) January 12, 2026\n\nLiberal woman sits in her car alone and cries about hating President Trump..Do all these people just cry 24/7..!? lol pic.twitter.com/e1WeE6gP4Q— American AF 🇺🇸 (@iAnonPatriot) January 12, 2026\n\nLiberal influencer (thestaceyshows) with over 15k followers says she’s at the gun range training to kill “MAGA f*cks”She says more women were there and they’re all training to kill MAGA“Today I was at the range — You motherf*cking MAGA f*cks, you might think that we're out… pic.twitter.com/zqujGixvn4— Wall Street Apes (@WallStreetApes) January 12, 2026\n\n“He shot her because she was queer”This is the bs propaganda that leftist activists feed to lgbtq people to justify trans violence. https://t.co/bEx1WmL5zK— Libs of TikTok (@libsoftiktok) January 11, 2026\n\nFor some of these videos, have you no shame, ladies? Also, nice of you to ruin Psycho Killer by the Talking Heads. Dear Lord. \n\nEven in packs, they’re insufferable:\n\nWe need a complete and total shutdown of left-wing, middle-aged white women until we can figure out what is going on. https://t.co/GyY0Yregwj— Bonchie (@bonchieredstate) January 11, 2026\n\nThis is what ICE officers have to put up with to enforce the law pic.twitter.com/OlHJHqvHMF— End Wokeness (@EndWokeness) January 11, 2026\n\nA new wave of craziness has hit after an ICE agent shot and killed a leftist activist, Renee Nicole Good, in Minneapolis on January 7. Good accelerated her car toward a federal agent, and he opened fire. Don't try to ram your car into cops, ladies. I can assure you that no harm will occur. \n\nJust insane:\n\n\"AVENGE RENEE GOOD!\"Antifa and far-left extremists in Portland, Ore. are pasting flyers around the city showing the face, spouse, house, name and home address of a lesbian woman they say is an ICE agent. The flyers urge comrades to \"be bold\" in taking direct action to \"avenge… pic.twitter.com/5ebjNQtCEb— Andy Ngo (@MrAndyNgo) January 12, 2026","url":"https://townhall.com/tipsheet/mattvespa/2026/01/13/notice-anything-regarding-all-these-angry-miserable-white-liberal-women-n2669375","image":"https://media.townhall.com/cdn/hodl/2026/12/f5d8df82-dacb-458c-95db-eb52697d1454.jpg","video":null,"publish_date":"2026-01-13 12:00:59","author":"Matt Vespa","authors":["Matt Vespa"],"language":"en","category":"politics","source_country":"us","sentiment":-0.547},{"id":392660864,"title":"Capitol Ink | Minnesota ICE","text":"Skip to content\n\nWhite House\n\nEnergy/Environment\n\nHealth Care\n\nTransportation\n\nHeard on the Hill\n\nFintech Beat\n\nPolitical Theater\n\nDonald Trump\n\nDonald Trump Tweets\n\nWhite House Calendar\n\nWhite House Releases\n\nPress Seating Chart\n\nEpstein Files\n\nKamala Harris\n\nNewsletters\n\nCapitol Ink\n\nRoll Call e-Edition\n\nClassifieds\n\nRollCall logo\n\nSearch RollCall.com\n\nRollCall logo\n\nWhite House\n\nEnergy/Environment\n\nHealth Care\n\nTransportation\n\nHeard on the Hill\n\nFintech Beat\n\nPolitical Theater\n\nDonald Trump\n\nDonald Trump Tweets\n\nWhite House Calendar\n\nWhite House Releases\n\nPress Seating Chart\n\nEpstein Files\n\nKamala Harris\n\nNewsletters\n\nCapitol Ink\n\nRoll Call e-Edition\n\nClassifieds\n\nSearch RollCall.com\n\nCapitol Ink\n\nCapitol Ink | Minnesota ICE\n\n (R.J. Matson/CQ Roll Call)\n\nR.J. Matson\n\nPosted January 13, 2026 at 7:00am\n\nRecent Stories\n\nCapitol Ink | Minnesota ICE\n\nShould Jan. 6 be a national holiday?\n\n6 key questions about the 2026 midterm elections\n\nKelly sues Hegseth over DOD retaliation\n\nGOP lawmakers ding Powell probe as coercion, distraction\n\nWarren pitches a bigger economic tent for Democrats\n\nThe Source for news on \nCapitol Hill since 1955\n\nNewsletters\n\nSubscriptions\n\nCQ and Roll Call are part of FiscalNote, a leading provider of political and business risk solutions. Copyright 2026 CQ and Roll Call. All rights reserved.","url":"https://rollcall.com/2026/01/13/capitol-ink-minnesota-ice/","image":"https://rollcall.com/app/uploads/2026/01/Capitol-Ink-01-13-26-Thumbnail.jpg","video":null,"publish_date":"2026-01-13 12:00:00","author":"Posted January 13, 2026 At 7:00am","authors":["Posted January 13, 2026 At 7:00am"],"language":"en","source_country":"us","sentiment":-0.172},{"id":392805916,"title":"NYT Just Confirmed Why The Left Was Right About Trump Being a Fascist","text":"When President Donald Trump‘s longest-serving chief of staff, John Kelly, declared he fit the definition of a fascist in 2024, Republicans called him crazy. They claimed there was no way fascism could’ve made its way to the U.S. But almost two years have passed, and fears of fascism continue to brew. Now, experts believe it’s finally time to call a spade a spade, bringing even more fears about the future of American democracy to the forefront.\n\nThe textbook definition of fascism emphasizes extreme nationalism, militarism and suppression of opposition for the benefit of the government. According to The New York Times, Trump fits the category to a T.\n\n“If anyone had predicted back in 2024 precisely what Trump’s return to the White House was going to look like, I suspect they’d have been accused of suffering from Trump Derangement Syndrome,” columnist Michelle Goldberg wrote. “But the shrillest of Resistance libs have always understood Trump better than those who make a show of their dispassion.”\n\nTake Trump’s recent capture of Venezuela’s dictator, Nicolás Maduro. The president skipped over the Constitution, which demands he ask Congress’ approval for military use, and essentially took over the nation’s oil reserves. Trump has also flirted with taking over other sovereign countries like Greenland and Canada– straight out of the playbook of fascist leaders like Adolf Hitler and Benito Mussolini.\n\nOf course, news of Trump targeting Greenland has taken a back burner to the ongoing fallout after an ICE agent shot and killed a U.S. citizen in Minneapolis last week. The administration has defended the agent, contradicting video proof of the tragedy.\n\n“Both ICE’s occupation of Minneapolis and Trump’s threatened seizure of Greenland are part of the same story: An increasingly unpopular regime is rapidly radicalizing and testing how far it can go down the road toward autocracy,” the Times reported.\n\nWe also told you that Trump’s rapidly dropping approval rating is prompting fears ahead of the midterm elections, when Democrats are hoping to swoop in and change the tide in the Republican-and Trump-controlled Congress.\n\nDemocrats have long labeled Trump a fascist dictator. Former Vice President Kamala Harris famously predicted he’d go after his political enemies, use the military against the American people and target civil rights way before she lost to him in 2024. Now, it seems Harris’ nightmares are all coming true, and there’s no one to stop it.\n\nThat’s a clear difference between Trump’s first and second terms, as the Times pointed out. Then, the president was “restrained by the establishment types around him,” according to the outlet. His first cabinet was filled with long-time Republicans and experts who could check Trump. Now, the government is being run by Trump’s yes-men. But while that fact might have you thinking about changing your citizenship, the folks at The Times have hope that all is not lost.\n\n“None of this means that America is destined to become a fully fascist country,” The New York Times clarified. Instead, Americans should focus on seeing the president for exactly what he is. The Times continued, “The important thing isn’t really the name we give to this political development, but our ability to see what’s happening clearly and make sense of its likely trajectory.”","summary":"After much debate on whether Trump is a fascist, we finally break it down for you. \n\nRead more...","url":"https://www.theroot.com/nyt-just-confirmed-why-the-left-was-right-about-trump-b-2000084180","image":"https://assets-server.theroot.com/wp-content/uploads/2026/01/13095906/GettyImages-2255276943-1-scaled.jpg","video":null,"publish_date":"2026-01-13 11:35:24","author":"Phenix S Halley","authors":["Phenix S Halley"],"language":"en","source_country":"US","sentiment":-0.037},{"id":392690430,"title":"President Donald Trump to speak at Detroit Economic Club: What to know","text":"Looking for info on President Donald Trump's abruptly announced visit to Detroit set for Tuesday, Jan.13? Here's what we know and a smattering of potentially relevant context:\n\nWhen and where and to whom is he speaking?\n\nFigure 2 p.m. or later at the Motor City Casino (specifically the Sound Board Theater) off Grand River in Detroit. The president is using the hall to address the Detroit Economic Club, a nonpartisan, nonprofit, 92-year-old organization that has been bringing in Fortune 500 CEOs and policymakers (including every president since Richard Nixon) to speak for decades.\n\nWhat is he speaking about?\n\nNeither the White House nor the Detroit Economic Club has said what the specific topic will be. But it being Detroit and this being just ahead of the auto show starting, it's a safe bet Trump's not coming to talk (at length anyway) about Greenland. The president has been accentuating his economic agenda and he's almost certain to emphasize his argument that moves to end government policies promoting the production and sale of electric vehicles, cut taxes on interest paid on new cars and trucks made in the U.S. and his tariffs on imported autos and auto parts have been, or will be, good for domestic automaking.\n\nIf we're right and Trump rhapsodizes about his record with autos, it's worth noting that as it currently stands, the industry is a mixed bag. Sales were up in 2025 despite pressure from tariffs but some of that may have been due to buyers getting ahead of electric vehicle subsidies ending under Trump and the presumption that tariffs would lead to higher costs. But General Motors and Ford are taking huge hits to their bottom lines due to lost EV investments. Stellantis sales dropped 3% from 2024 and despite promised investments from Toyota, Hyundai and others, auto and auto parts jobs combined were down in November compared to when Trump took office.\n\nMore: How do Americans rate Trump? See polls ahead of Detroit visit\n\nMore: How to watch Trump's speech to Detroit Economic Club on Tuesday\n\nHow long will he speak?\n\nIt's anyone's guess. It's unusual, however, for Trump to give short speeches.\n\nIs he expected to make news?\n\nWe don't know as yet. There's been no advance word on policy announcements from the White House.\n\nIs this speech open to the public?\n\nNot really. It was open to Detroit Economic Club members and their guests for a fee but those tickets are sold out.\n\nCan I watch it live?\n\nYou can. You should check out freep.com first, as we're likely to have the feed queued up for watching and you'll be able to easily access all this marvelous extra content we're serving up. You can also check it out, if you like, on the White House's live YouTube channel and C-SPAN.\n\nIs this Trump's first speech as president to the club?\n\nThis is a trick question: The answer, somewhat remarkably, is yes, though he has spoken to the club twice before, in August 2016 and October 2024. On the first occasion, he was running for his first term; on the second, he was an ex-president running for reelection after losing to President Joe Biden in 2020.\n\nAnything notable about those speeches?\n\nOh yes. His first speech saw protesters inside and outside what was then the Cobo Center in downtown Detroit and some hecklers inside − including Rashida Tlaib, who two years later would become a congresswoman representing Detroit − were removed for interrupting then-candidate Trump.\n\nThe second speech, as a former president, was a much different, campaign-style affair with music and applause that went on for nearly two hours (despite what typically had been a much shorter time limit for Economic Club speeches). During that time, he proposed cutting taxes on new car loans (which he passed last year) and said if his opponent, then-Vice President Kamala Harris, won the election, \"Our whole country will end up being like Detroit.\" It was not meant as a compliment.\n\nIs he making any other stops?\n\nYes. On Monday, White House Press Secretary Karoline Leavitt said Trump will also tour the Ford factory in Dearborn that makes the F-150 pickup. (Ford's F-series is the best-selling vehicle in the U.S.) Five years ago, Biden went to Dearborn too as Ford unveiled the all-electric F-150 Lightning and even took one for a test drive. Ford has since halted production of the Lightning.\n\nContact Todd Spangler: tspangler@freepress.com. Follow him on X @tsspangler.","url":"https://eu.freep.com/story/news/politics/2026/01/13/trump-in-detroit-heres-everything-you-need-to-know/88147327007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/01/08/USAT/88074555007-20251218-t-191520-z-1059569379-rc-26-jia-4-eds-0-rtrmadp-3-usatrump.JPG?auto=webp&crop=3743,2107,x0,y194&format=pjpg&width=1200","video":null,"publish_date":"2026-01-13 11:05:30","author":"Detroit Free Press","authors":["Detroit Free Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.176},{"id":392660130,"title":"BBC seeks dismissal of Trump's $10bn defamation lawsuit","text":"The British Broadcasting Corporation BBC, seeks dismissal of $10bn Trump lawsuit over Panorama edited clips.\n\nThe broadcaster’s submission calls on the Florida court to throw out the defamation case where the U.S. president is suing over the editing of the 6 January 2021 speech.\n\nThe BBC is to attempt to have Donald Trump’s $10bn defamation lawsuit over the editing of a speech for Panorama thrown out, according to court documents.\n\nThe broadcaster faced criticism for airing an episode of the investigative documentary series that featured an edited clip of Trump’s address to a rally on 6 January 2021, which it is alleged gave the impression he encouraged supporters to storm the Capitol building in Washington, DC.\n\nThe spliced clips in the edition of Panorama suggested that Trump told the crowd, “We’re going to walk down to the Capitol, and I’ll be there with you, and we fight. We fight like hell.” The words were taken from sections of his speech almost an hour apart.\n\nThe BBC will file a motion to dismiss, claiming the Florida court lacks “personal jurisdiction” over them, the court venue is “improper,” and that Trump has “failed to state a claim,” documents filed on Monday revealed.\n\nThe corporation will argue that it did not create, produce, or broadcast the documentary in Florida and that Trump’s claim that the documentary was available in the US on the streaming service BritBox is untrue.\n\n“Simply clicking on the link that plaintiff cites for this point shows it is not on BritBox,” the broadcaster’s lawyers said in court documents.\n\nThe BBC will also claim the president has failed to “plausibly allege” it published the documentary with “actual malice,” which public officials are required to show when filing suit for defamation in the US.\n\nThe broadcaster has asked the court “to stay all other discovery”—the pre-trial process in which parties gather information—pending the decision on the motion.\n\nIn asking for discovery to be delayed, lawyers for the BBC said, “The plaintiff will seek broad, objectionable discovery on the merits, implicating the BBC’s entire scope of coverage of Donald J. Trump over the past decade or more and claiming injury to his entire business and political profiles.”\n\nA 2027 trial date has been proposed should the case continue.\n\nThe BBC was approached for comment. It vowed previously to defend itself against the $10bn lawsuit over the episode, which aired in 2024.\n\nTrump has sought $5bn in damages each on two counts, alleging that the BBC defamed him and that it violated Florida’s Deceptive and Unfair Trade Practices Act.\n\nThe US president alleged the broadcaster “intentionally, maliciously, and deceptively” edited the 6 January speech he gave before the attack on the US Capitol.\n\nWhile BBC has acknowledged previously that the editing was an “error of judgment” and apologized to Trump, it has insisted there is no legal basis for a defamation claim.\n\nTim Davie, who was the BBC’s director general, and Deborah Turness, who was the head of BBC News, resigned last month over the controversy.\n\nTrump’s lawsuit against the BBC was filed at the US District Court for the Southern District of Florida, even though BBC iPlayer, the main streaming platform that carries Panorama, and BBC One, the main TV channel that broadcasts it, are not available in the US.\n\nThe episode never aired in the U.S., and the BBC is expected to argue that it therefore had no significant impact on Trump’s reputation among U.S. audiences.\n\nSince his re-election, Trump has scored several high-profile legal wins against big media firms in the US. ABC, owned by Disney, agreed to pay $15m as part of a settlement over a defamation lawsuit he brought after comments made by the anchor George Stephanopoulos.\n\nIn July, Trump reached a $16m settlement with Paramount, the parent of CBS News, over what he claimed was false editing of a pre-election interview with the Democratic candidate for president, Kamala Harris.\n\nAdditionally, regarding BBC's lawsuit, the firm's spokesperson said, \"As we have made clear previously, we will be defending this case.\"\n\n\"We are not going to make further comment on ongoing legal proceedings,\" he added.","url":"https://www.thenews.com.pk/latest/1388239-bbc-seeks-dismissal-of-trumps-10bn-defamation-lawsuit","image":"https://www.thenews.com.pk/assets/uploads/2026-01-13/1388239_033402_updates.jpg","video":null,"publish_date":"2026-01-13 10:33:00","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.153},{"id":392586036,"title":"Who’s Afraid of Madam Governor?","text":"The question is no longer whether Nigerian women are interested in power. The more honest question is whether Nigeria’s political architecture is genuinely prepared for women to exercise power without apology, patronage, or pity. The renewed campaign for increased women’s seats in the legislature has once again exposed the fault lines in our democratic imagination.\n\nObviously on account of its strong appeal, many citizens across gender divides freely support the idea. Some others, on the other hand, including some women, dismiss it as defeatist likening it to a charity-driven shortcut that undermines merit. Yet, beneath this argument lies a deeper fear: the discomfort with women not just participating in politics, but leading it.\n\nNigeria’s politics, noisy and competitive as it is, remains robustly masculine. From party structures to campaign financing, from godfatherism to violent primaries, politics is designed as a system that rewards brute endurance rather than broad-based inclusion. In such a terrain, women are routinely advised to “work harder,” “wait longer,” or “learn the ropes,” even when the ropes themselves are deliberately knotted against them. The agitation for reserved seats or affirmative quotas must therefore be understood not as a plea for pity, but as a strategic intervention in a structurally skewed system.\n\nCritics of the campaign argue that conceding seats to women amounts to lowering the bar. They insist that politics should remain a free contest where only the strongest survive. But this argument conveniently ignores the fact that the contest has never been free. It ignores the historical disadvantages women face in access to funding, party tickets, political networks, and even physical safety. To demand “equal competition” in an unequal field is not principled neutrality. Rather, it presents moral indifference disguised as fairness.\n\nGlobally, affirmative action has never been about replacing merit with mediocrity. Rather, it is about widening the gate so that merit, long suppressed by structural exclusion, can finally walk in. The Sustainable Development Goals (SDGs), which Nigeria endorsed with fanfare, are anchored on a simple but powerful philosophy: leave no one behind. Political parties that mouth this slogan in development conferences but ignore it in their internal power-sharing arrangements are guilty of selective idealism. If parties are sincere about inclusive growth and governance, then propping up more women should not be an afterthought; it should be a core democratic obligation.\n\nWomen, however, must also recognise that no liberation is handed down ready made.\n\nBeyond advocacy, there is a compelling need for collectivisation. Nigerian women constitute a very significant percentage of the population, yet this numerical strength rarely translates into coordinated political muscle. Too often, women’s political engagement is fragmented by party loyalties, ethnic considerations, and elite patronage. The challenge before women is to build cross-party, cross-regional solidarities that can sway progressives and pragmatists alike—not with emotional appeals alone, but with disciplined organisation and ideological clarity.\n\nThe recent political journey of Senator Aisha “Binani” Dahiru in Adamawa State offers both inspiration and caution. Her near-emergence as Nigeria’s first elected female governor was a moment of collective pride for many women. Yet, the confusion, controversy, and ultimate frustration that followed her candidacy also exposed the perils of weak political anchorage.\n\nCritics argue that her alignment with powerful but controversial political figures, including Atiku Abubakar, burdened by the infallible stamp of corruption by his own former boss, President Obasanjo, easily diminished here rating. Atiku is also notorious for frequent party switching, thus blurring her ideological compass and deepened uncertainty around her political project. Whether one agrees with these criticisms or not, the lesson is clear: women’s political advancement cannot rest solely on proximity to imagined male political titans whose interests may not align with long-term feminist or democratic goals.\n\nThis is why patience and political tutelage matter. Power is not only seized; it is also learned. Women aspiring to executive leadership must demonstrate readiness to understudy political colossi endowed with uncommon wits, strategic depth, and ideological consistency. Leadership, after all, is not a spontaneous performance; it is a cultivated craft.\n\nAs I once argued, enduring professionalism including political longevity and effectiveness are products of mentorship, intellectual discipline, and moral clarity. Women should not be ashamed to learn; neither should they be content with perpetual apprenticeship.\n\nThe international landscape offers both cautionary and encouraging examples. In the United States, Vice President Kamala Harris came close to history. Her journey to the threshold of the presidency underscores both the possibilities and the limits of representation within entrenched political systems. That she did not emerge president does not diminish her achievement; it highlights the persistence required to crack the highest glass ceilings.\n\nBefore Harris however, Ellen Johnson Sirleaf defied sceptics to become Liberia’s president, steering her country through post-conflict recovery and earning global respect. Her story remains a powerful rebuke to those who ask, often with thinly veiled cynicism, whether African women can lead nations.\n\nSo, who says Nigerian women cannot become governors—and ultimately president? Certainly not history. Certainly not logic. And certainly not competence. What stands in the way is not capacity, but courage: the courage of parties to institutionalise inclusion, the courage of men to relinquish monopolies of power, and the courage of women to insist on space without apology.\n\nReserved legislative seats, therefore, should be seen as transitional instruments, not permanent crutches. Their purpose is to normalise women’s presence in power, to break the myth that leadership is inherently male, and to create role models that can inspire younger generations. Once the terrain becomes less hostile and more inclusive, such measures may no longer be necessary. But to reject them now, in the name of abstract meritocracy, is to perpetuate a system that has already failed too many.\n\nUltimately, democracy thrives not when everyone competes under the same illusion of fairness, but when institutions consciously correct historical imbalances. A Nigeria that is afraid of a Madam Governor is a Nigeria afraid of its own potential. The campaign for increased women’s seats is not about charity. It is indeed about justice, strategy, and the unfinished business of nation-building.\n\nThe real question, then, is not whether women are ready for power. It is whether Nigeria is ready to stop pretending that exclusion is excellence. In line with the thesis of SDGs, for Nigeria, now is the time to start building a democracy that truly leaves no one behind.\n\nProfessor Tunde Akanni teaches Journalism at the Lagos State University.","summary":"The question is no longer whether Nigerian women are interested in power. The more honest question is whether Nigeria’s political architecture is genuinely prepared for women to exercise power without\n\n\nThe post Who’s Afraid of Madam Governor? appeared first on The Nation Newspaper.","url":"https://thenationonlineng.net/whos-afraid-of-madam-governor/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2026/01/13112540/Madam-Gov.jpg","video":null,"publish_date":"2026-01-13 10:26:15","author":"The Nation,Tunde Akanni","authors":["The Nation","Tunde Akanni"],"language":"en","category":"politics","source_country":"ng","sentiment":0.034},{"id":392537496,"title":"Host burns bosses with unapproved joke","text":"Deals of the Week\n10:59AMTuesday, January 13th, 2026\n\nTubi: watch for free\n\nSet your local weather \n\nBreaking News\n\nCourts & Law\n\nCourts & Law\n\nCourts & Law\n\nCourts & Law\n\nSouth Australia\n\nWestern Australia\n\nNorthern Territory\n\nBreaking News\n\nNorth America\n\nUS Politics\n\nSouth America\n\nMiddle East\n\nUK Politics\n\nHealth Problems\nMental Health\n\nInspiration\nWeight Loss\n\nSchool Life\n\nRestaurants & Bars\nFood Warnings\n\nRelationships\n\nThe Sealed Section\n\nFamily & Friends\n\nFashion Shows\n\nFashion Trends\n\nFace & Body\nCosmetic Surgery\n\nTrue Stories\n\nLifestyle Videos\n\nTravel Ideas\n\nShort Breaks\n\nFood & Drinks\n\nDestinations\n\nNorth America\n\nNew Zealand\n\nMiddle East\nCentral America\nSouth America\n\nTravel Advice\n\nTips & Tricks\n\nAccommodation\n\nAustralian Holidays\n\nNorthern Territory\n\nSouth Australia\n\nWestern Australia\n\nTravel Videos\nEntertainment\n\nCelebrity Life\n\nHook Ups & Break ups\nCelebrity Photos\nCelebrity Kids\nCelebrity Deaths\n\nCelebrity Style\n\nWhat To Watch\n\nMorning Shows\nCurrent Affairs\n\nUpcoming Movies\n\nMovies Reviews\n\nMusic Festivals\n\nBooks & Magazines\n\nGolden Globes\n\nEntertainment Videos\n\nSocial Media\n\nMobile Phones\n\nHome Entertainment\n\nArchaeology\n\nEnvironment\n\nClimate Change\nSustainability\nNatural Wonders\n\nMotoring News\n\nOn the Road\n\nTechnology Videos\n\nCost of Living\n\nHow to Save\n\nSalary Secrets\nPersonal Finance\n\nSuperannuation\n\nAustralian Culture\nPower & Influence\n\nInside Parliament\n\nGig Economy\n\nBreaking News\n\nManufacturing\n\nOther Industries\n\nAustralian Economy\nWorld Economy\nInterest Rates\nFederal Budget\n\nAustralian Markets\nWorld Markets\nAustralian Dollar\nCryptocurrency\n\nReal Estate\n\nSydney & NSW\nMelbourne & VIC\nAdelaide & SA\n\nCricket Live Scores\n\nSports Life\n\nAmerican Sports\n\nParalympics\n\nV8 Supercars\n\nHorse Racing\n\nExpert Opinion\n\nMore Sports\n\nSport Videos\n\nSales & Deals\n\nHome & Appliances\n\nHealth & Wellbeing\n\nEntertainment\n\nGolden Globes\n\nNikki Glaser’s Golden Globes jibe at CBS News was not approved by bosses\nGolden Globes host Nikki Glaser sparked controversy after making an unapproved joke about the network that airs the ceremony.\nSara Nathan - Page Six\n\nJanuary 13, 2026 - 12:24PM\n\nShare via Email\n\nShare on Facebook\n\nShare on Whatsapp\n\nOuça este artigo\n\nGlobes Golden Globes host Nikki Glaser didn’t run her controversial CBS News jibe past the division bosses, sources tell Page Six.\nGlaser, 41, made a dig at the network that hosts the awards bash saying, “The award for most editing goes to CBS News. Yes. CBS news: America’s newest place to see-BS-news.”\nThe joke was met by loud laughter from the A-list, super liberal crowd.\n\nThe comic dig on during Monday’s show came after a turbulent few weeks for newly installed CBS editor-in-chief Bari Weiss, who hit the headlines after killing a US 60 Minutes segment about the US sending deportees to a prison in El Salvador — causing uproar among the staff.\n\nGolden Globes host Nikki Glaser poked fun at CBS during her opening monologue, the very network that hosts the Globes. Picture: Paramount+\nHowever, we’re told news is an separate entity to the entertainment section and Weiss is expected to shrug off the dig and “move on”.\n“The news division is fully separate,” said an industry insider, confirming Glaser did not have to check her monologue with bosses. \n“Let’s move on,” the insider added.\nCBS News was previously accused by President Donald Trump of editing an interview with then-Vice President Kamala Harris to provide a better image of the Democratic candidate in the months leading up to the 2024 presidential election. \n\nNewly installed CBS News editor-in-chief Bari Weiss has had a turbulent few weeks since taking the role. Picture: Leigh Vogel/Getty Images\nTrump sued the network after accusing them of “election interference” in favour of Harris. CBS’ parent company later agreed to a $US16 million settlement with Trump ahead of its merger with Skydance Media.\n\nWeiss was put in place by Skydance owner David Ellison, who also bought her website, The Free Press, last October for $US150 million.\nSince landing in the hot seat, she has hand-picked Tony Dokoupil to helm the CBS Evening News.\nHowever, the former CBS Mornings co-host suffered an embarrassing start to his tenure with tech glitches during his first show last week. Despite this, he still reeled in 4.4 million viewers during his debut last Monday, more than half a million more eyeballs than usual for that time slot.\n\nGlaser also made a joke about Warner Bros. with CEO David Zaslav (right) in the audience with Netflix boss Ted Sarandos. Picture: Neilson Barnard/Getty Images\nHis news-making interview with border czar Tom Homan was then overshadowed by the firing of Javier Guzman, one of the show’s top producers. Guzman reportedly made no secret of his dislike of Weiss.\nAlthough Glaser mocked CBS News, the CBS Network and its parent company Paramount aired the Globes, with the ceremony also streaming on Paramount+.\n\nMore Coverage\nLeo suddenly very different during ad break\nTamantha Ryan – Page Six\n‘Can’t be legal’: Star’s rogue act at Globes\nSophia Melissa Caraballo Piñeiro – Page Six\nEllison is currently waging a hostile takeover of Warner Bros. in an attempt to scupper Netflix’s bid to buy the company.\nAs Warner Bros. CEO David Zaslav watched from the crowd, Glaser also joked while hosting, “We’ll start the bidding for Warner Bros. at $5, do I hear $5?”\nThis article originally appeared in Page Six and was reproduced with permission\n\nJoin the conversation (0 Comments)\n\nAdd your comment to this story\n\nTo join the conversation, please\n log in. Don't have an account?\n\nJoin the conversation, you are commenting as\n\nMore related stories\nGolden Globes\nUnaired Globes moment angers viewers\nThe Golden Globes has sparked fury from viewers over a “disrespectful” move made during a commercial break.\n\nGolden Globes\nSurprise backlash over Aussie star’s speech\nRose Byrne had one of the night’s best speeches at the Golden Globes – but one admission has sparked controversy online.\n\nGolden Globes\nComedian roasts celebs’ Golden Globes act\nBill Maher made a dig at celebrities who were wearing pins at the Golden Globes for a political reason.\n\nRegistration\n\nIn The Know Quiz\nNewsletters\nCompetitions\n\nWelcome to news.com.au\n\nCode of Conduct\n\nHelp and Support\n\nGeneral Feedback\nAdvertise with us\nStandards of Practice\n\nLicensing & Reprints\n\nOur News Network\n\nThe Daily Telegraph\n\nThe Courier Mail\n\nOur Partners\n\nrealestate.com.au\n\nCODE Sports\n\nA NOTE ABOUT RELEVANT ADVERTISING: We collect information about the content (including ads) you use across this site and use it to make both advertising and content more relevant to you on our network and other sites. Find out more about our policy and your choices, including how to opt-out.Sometimes our articles will try to help you find the right product at the right price. We may receive payment from third parties for publishing this content or when you make a purchase through the links on our sites.\n\nPrivacy policy\nRelevant ads opt-out\nCookie policy\nTerms of use\nNationwide News Pty Ltd © 2026. All times AEDT (GMT +11). Powered by WordPress.com VIP","summary":"Golden Globes host Nikki Glaser sparked controversy after making an unapproved joke about the network that airs the ceremony.","url":"https://www.news.com.au/entertainment/awards/golden-globes/nikki-glasers-golden-globes-jibe-at-cbs-news-was-not-approved-by-bosses/news-story/d046fbe64ec4156889d11d707ee39b5d?from=rss-basic","image":"https://content.api.news/v3/images/bin/2d4149b02aa395cd2ec87722e07c0cdc","video":null,"publish_date":"2026-01-13 09:59:14","author":"0 Comments","authors":["0 Comments"],"language":"en","source_country":"au","sentiment":0.622},{"id":392583302,"title":"The 2025 book on oligarchy that may explain 2026","text":"Dear Readers, Just when you thought the geopolitical madness of 2025 would give way to some quiet reflection and reconsideration, the year 2026 has started at a breakneck speed and has already made observers wonder what lies ahead for the world in the rest of the year. US President Trump has already taken over a sovereign country (Venezuela), threatened to take over the territory (Greenland) of another (Denmark), one that is a long-time ally. Not to mention the worsening situation in Iran, where civil unrest could become another reason for Trump to intervene. All this while, the Ukraine-Russia conflict continues to simmer even as China arguably feels emboldened to finally act towards taking over Taiwan, a long-held claim. Inside the US, crackdown on immigrants has led to the killing of an unarmed US citizen by an ICE (Immigration and Customs Enforcement) agent in Minneapolis. On the economic front, job growth has faltered and, quite worryingly for any and everyone who lent money to the US, the US Department of Justice is now opened criminal investigation against the Chairman of the US Federal Reserve (their central bank) — a move that is being seen as a threat to the independence of the Fed. Given its status and role in global affairs, the actions of the US President tend to have wide-ranging ramifications even when he (and hopefully, someday a ‘she’) doesn’t want to be interventionist. But as we come close to the completion of the first full year of Trump’s second term, his deeply interventionist policies have left no one untouched — be it a poor shrimp farmer along the coasts or a young man hoping to create a better life in the US. If you think Trump’s decisions are spot on — and there are many who think so, albeit not perhaps outside the US — then of course there is no issue. But if you disagree with his actions, the most important question in your mind would be the same that was there in 2025: Is there no way to stop this madness? There is. And it is called the midterm elections. Come November 2026, all the seats in the US House of Representatives and one-third of the seats in the US Senate will be up for grabs. As of this moment, the Trump-led Republican Party is in control in both houses of the US Congress but if the US voters have had enough by then, November 3rd could see Donald become a “lame duck” president. In other words, if the US Congress is in the hands of the opposition Democratic Party, the US President will be lucky to avoid impeachment leave alone getting any legislative agenda passed. How likely is that? It is true that Kamala Harris’ spectacular loss in 2024 — she lost all the battleground states and saw the whole country shift Republican, even in so-called deep blue states like New York and California — left the Democrats in dust. But that’s where November 5 from last year is crucial. It was the day that saw the surprising victory of Zohran Mamdani as the Mayor of New York. Mamdani’s victory was like driving a stake through the heart of capitalism. In his victory speech Mamdani said things that no one ever thought one could say in the US and get away with it. Sample this: ‘We will replace the frigidity of rugged individualism with the warmth of collectivism…I was elected as a democratic socialist and I will govern as a democratic socialist. I will not abandon my principles for fear of being deemed radical. As the great Senator from Vermont once said, “What’s radical is a system which gives so much to so few and denies so many people the basic necessities of life”,’ said Mamdani. Mamdani was not the only one who won last November. It was sort of a blue wave. Democrat Abigail Spanberger won the Governor’s race in Virginia, becoming the first female governor of the state. Ghazala Hashmi was elected Lieutenant Governor — becoming the first Muslim woman in a statewide office. In New Jersey, another state, Democrat Mikie Sherrill won the Governor’s election. While there may be differences of opinion among them, all of them won on an agenda of affordability — promising to make the government work towards easing the affordability crisis. So away from the everyday threats of taking over sovereign countries and yet claiming to deserve the Nobel Peace Prize, something could be fundamentally changing on the ground. That’s because Trump’s economic policies have failed to address the growing inequalities in the US. And it won’t be surprising if the scales tilt furiously to the other side in November and voters hand over the political power to the other view of how the US and the world should be governed. What is that view? New York mayor Zohran Mamdani recommended Fight Oligarchy by Bernie Sanders. That's the focus of this edition of BLT. The book in question is by the Vermont Senator Mamdani talked about: Fight Oligarchy by Bernie Sanders. It came out late last year and essentially talks about a movement led by Sanders to get public support towards electing a candidate that can “fight oligarchy” in the US. “Oligarchy is a system in which a small number of extremely wealthy individuals control the economic, political, and media life of a nation. It is a system in which ordinary people have very little power to determine the future of their country,” writes Sanders. Many well-to-do Indians got a hint of the ills of an oligarchy when Indigo airlines failed to provide service. It made Indians examine, at least for those few days, the structure of India’s economy. But let’s stick to the US because it is often the flag-bearer of the kind of economy India wants to become. In the very first chapter, Sanders lays out the nature and extent of the problem. “In America today…while the rich get richer, the middle class struggles to pay the rent, put food on the table, and pay for health care. The poor live in desperation…One man (Elon Musk), worth nearly $400 billion, now owns more wealth than the bottom 52 percent of American households. The top 1 percent own more wealth than the bottom 93 percent. And the CEOs of large corporations make 350 times more than their average employee.” This is still not the most stunning bit. The inequality and concentration of power is not just about income or wealth. Sanders points out that “that just four companies in America control 80 percent of the processing of beef, 70 percent of pork, and nearly 60 percent of poultry.” Now here is the most alarming bit: Just three huge Wall Street firms — Vanguard, BlackRock, and State Street — are the major stockholders in 95 percent of S&P 500 corporations. And this leads to remarkable results. “You want to know who owns General Motors? Well, their three largest shareholders are Vanguard, BlackRock, and State Street. Okay. But who owns Ford, GM’s supposed rival? If you guessed Vanguard, BlackRock, and State Street, in that same exact order, you would be correct. What about the big oil companies, ExxonMobil and Chevron? That’s right. Vanguard, BlackRock, and State Street are the three largest shareholders of both those companies. How about Pfizer, Merck, and Johnson & Johnson, three huge pharmaceutical companies? Yup. Vanguard, BlackRock, and State Street own all three.” It is tempting to keep quoting but you get the drift. The book is fairly small in length — you can read it in a day or max over the weekend, and is written, as you can see, in a manner that reads like a very engaging political speech. Furthermore, it is reasonably priced be it the print or the audible version. A particularly standout chapter in the book is titled: “Some lessons from History”. It is a short recounting of how many things that are today considered par for the course were thought to be “radical” in US (and global) history. Slavery, racial segregation, an eight-hour work day, free public education, women’s right to vote, rights of the LGBT community: There are many examples of what the world thought too radical at one point in time and has now become the norm. For Sanders, it is time to fight oligarchy and restructure the US economy — a thought just as radical as Trump’s policies. Whether you agree with Sanders or not, this book is thought-provoking and — if political winds continue to disfavour Trump — it holds the secret of where the next stage of US politics might lie. Three short letters: AOC. Although she has not yet announced a bid but if Alexandria Ocasio-Cortez were to win the 2028 US presidential elections, for many Americans (and people elsewhere), it would mark a step towards the US becoming a vibrant democracy that leads prioritises the economic well-being of all instead of a few oligarchs. It is another matter that in the eyes of many others Venezuela would have taken ample revenge on the US in case she wins! Is the Indian economy on the right path? What changes should India’s government make to the economy’s structure in order to realise our potential? Share your views and queries at udit.misra@expressindia.com Take care, Udit","url":"https://indianexpress.com/article/books-and-literature/the-2025-book-on-oligarchy-that-may-explain-2026-10469337/","image":"https://images.indianexpress.com/2026/01/Udit-Book-Line-and-thinker.jpg","video":null,"publish_date":"2026-01-13 09:29:38","author":"Udit Misra","authors":["Udit Misra"],"language":"en","source_country":"in","sentiment":-0.341},{"id":392512140,"title":"NJ considers restricting ICE cooperation, but unclear if Murphy will sign bills","text":"New Jersey lawmakers are expected to pass a package of legislation aimed at strengthening the state’s immigrant protections on Monday, setting up a potential fight with the Trump administration as it scales up immigration enforcement across the country.\n\nThe package includes a bill that would codify the New Jersey Immigrant Trust Directive, first issued in 2018 by previous state Attorney General Gurbir Grewal. The directive restricts when municipal, county and state law enforcement officials can aid federal immigration authorities.\n\nUnder the bill, New Jersey law enforcement officials are also prohibited from stopping or detaining anyone based on race or ethnicity, “except when responding to a suspect-specific or investigation-specific situation.”\n\n“We must ensure that everyone — citizens and immigrants alike — is afforded the protections promised by the constitution and treated fairly by law enforcement,” state Sen. Britnee Timberlake, a Democrat from Essex County and one of the bill’s sponsors, said in a statement last week after the state Senate Judiciary Committee advanced the bill. “No one should ever be singled out or targeted because of their race.”\n\nAnother bill would call for establishing policies to prevent federal agents from operating in so-called “sensitive locations,” such as hospitals and schools. A third would prevent state government agencies and health care facilities from sharing sensitive personal information with federal authorities.\n\nGov. Phil Murphy, a Democrat, has not said whether he plans to sign the legislation before he leaves office next week. His office did not respond to Gothamist’s request for comment on Monday.\n\nThe legislative proceedings are among the last in the state Legislature’s current two-year session. New York state lawmakers are also considering a measure to limit police cooperation with immigration authorities.\n\nThe move by New Jersey lawmakers comes amid heightened tensions nationally following the fatal shooting of 37-year-old Renee Good by a U.S. Immigration and Customs Enforcement agent in Minneapolis last week. A White House spokesperson criticized the bills last week, before that shooting, and said the state Legislature should “focus on protecting law-abiding citizens, not the criminal aliens who kill them.”\n\nA spokesperson for incoming Gov. Mikie Sherrill, also a Democrat, did not respond to a request to comment on the bills. During her campaign, Sherrill declined to fully support passing the Immigrant Trust Directive into law, citing concerns over its ability to survive a court challenge.\n\n“If this goes up to the Supreme Court, which it likely will, then that overturns other states’ mandates for how they're protecting people,” Sherrill said during a candidate discussion hosted by WNYC and NJ Spotlight News in May.\n\nNew Jersey Republicans have pushed back on the package, claiming federal law would supersede these measures. During an Assembly Judiciary Committee hearing last week, Assemblymember Bob Auth, a Republican from Bergen County, cited the U.S. Constitution’s supremacy clause in objecting to the bills.\n\nAmol Sinha, executive director for the New Jersey chapter of the American Civil Liberties Union, which is supporting the legislation, said the Immigrant Trust Directive has survived various court challenges in the past eight years, including one by the first Trump administration.\n\n“The federal government cannot commandeer local resources in order to do its dirty work,” he said. “We've already seen [the directive] stand up as lawful and constitutional twice in federal court, including by a Trump-appointed judge.”\n\nAmy Torres, executive director for the  New Jersey Alliance for Immigrant Justice, said the measures’ supporters expect the Trump administration to try to stop them from taking effect.\n\n“I think this will be a PR fight more than anything. But the truth is this is about what New Jersey does for itself, versus what it's beholden to the federal government to do,” she said.\n\nIn the 2024 presidential election, Donald Trump appeared to make significant gains with voters in New Jersey. He came within roughly six points of Democratic nominee Kamala Harris, about a 10-point improvement compared to his run four years earlier.\n\nThat apparent electoral progress by the GOP evaporated in November when Sherrill trounced Republican nominee Jack Ciattarelli by about 14 points in the governor’s race.","summary":"Federal agents guard the Delaney Hall immigration detention center in Newark on June 12, 2025.\n\n\n  \n\nThe governor is slated to leave office next week as the state Legislature finishes its session. [ more › ]","url":"https://gothamist.com/news/nj-considers-restricting-ice-cooperation-but-unclear-if-murphy-will-sign","image":"https://api-prod.gothamist.com/images/354912/fill-1200x800|format-webp|webpquality-85/","video":null,"publish_date":"2026-01-13 09:15:21","author":"Mike Hayes","authors":["Mike Hayes"],"language":"en","category":"politics","source_country":"us","sentiment":-0.239},{"id":392707138,"title":"Former Special Counsel Jack Smith Will Testify Before House Judiciary Committee","text":"Former special counsel Jack Smith will testify before the House Judiciary Committee next week where he will be questioned by both Republicans and Democrats regarding his prosecutions of President Donald Trump.\n\nSmith previously prosecuted President Trump for allegedly holding classified documents at Mar-a-Lago and for his alleged role in the January 6 riot on Capitol Hill. He dropped both cases after Trump defeated former Vice President Kamala Harris in the 2024 presidential election.\n\n“Smith will appear before the committee on January 22, one month after he sat for a closed-door deposition with the committee and testified for eight hours about his special counsel work,” reported Fox News on Monday.\n\n“In a public hearing, House lawmakers will be able to question Smith in five-minute increments, whereas in the deposition, each party questioned Smith in one-hour sessions,” added the outlet.\n\nIn a transcript of his deposition, Smith said that he prosecuted Trump with no regard for his political associations.\n\n“I made my decisions in the investigation without regard to President Trump’s political association, activities, beliefs, or candidacy in the 2024 presidential election,” Smith said. “We took actions based on what the facts, and the law required, the very lesson I learned early in my career as a prosecutor.”\n\nAs Breitbart News reported in November, Smith received former House Speaker Kevin McCarthy’s cellphone records from AT&T during his investigation into the January 6 riot on Capitol Hill. At the time, Fox News initially reported that Smith “subpoenaed AT&T for McCarthy’s records, but AT&T had indicated to Senate Judiciary Committee Chairman Chuck Grassley that the company had not shared any of the former speaker’s phone records.”\n\nThe outlet later obtained a letter that AT&T sent to Grassley indicating the former House Speaker’s records were shared with Jack Smith:\n\nSmith on Jan. 24, 2023, allegedly sought the “toll records for the personal cell phones of U.S. Speaker of the House Kevin McCarthy (AT&T) and U.S. Representative Louie Gohmert (Verizon.)”\nThe information was included as part of a “significant case notification” drafted by the FBI’s Criminal Investigative Division May 25, 2023.\nAT&T, though, notified Grassley that the company received a subpoena for McCarthy’s records in January 2023, separate from the May 2023 subpoena for other toll records, and allegedly inadvertently supplied those personal cellphone records to Smith.\n\nAT&T said the subpoena “sought records for a personal cellular phone number” and that it did not in “any way indicate that the information sought related to a member of Congress.”\n\n“We identified (the subpoena) yesterday as such based on the phone number in the subpoena,” the company said. “Based on this newly found record, we write to correct our October 24, 2025 response, which was based (on) a reasonable review of our records at that time.”\n\n“AT&T’s Global Legal Demand Center receives hundreds of thousands of legal demands each year, and unlike the May 2023 subpoena discussed in our October 24 response, the subpoena we produced today did not seek records from a campaign account,” it continued. “Rather, as confirmed from press accounts, the subpoena sought records for a personal cellular phone number. It also did not in any way indicate that the information sought related to a member of Congress.”\n\nRELATED: Biden Spying! Senator Reveals Jack Smith’s BlueAnon Fever-Swamp Obsession\n\n“As a result, the subpoena processing center had no reason to believe that the phone number was associated with a member of Congress, and AT&T did not make further inquiries to the Special Counsel and produced the information as required by the subpoena,” it concluded.\n\nSmith said he followed the Department of Justice policy to subpoena phone records in his deposition.\n\n“If Donald Trump had chosen to call a number of Democratic senators [to delay the election certification proceedings], we would have gotten toll records for Democratic senators. So responsibility for why these records, why we collected them, that’s — that lies with Donald Trump,” Smith said.","summary":"Former special counsel Jack Smith will testify before the House Judiciary Committee next week where he will be questioned by both Republicans and Democrats regarding his prosecutions of President Donald Trump.\n\n\nThe post Former Special Counsel Jack Smith Will Testify Before House Judiciary Committee appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2026/01/13/former-special-counsel-jack-smith-will-testify-before-house-judiciary-committee/","image":"https://media.breitbart.com/media/2025/12/Jack-Smith--640x335.jpeg","video":null,"publish_date":"2026-01-13 08:44:03","author":"Paul Bois,Paul Roland Bois","authors":["Paul Bois","Paul Roland Bois"],"language":"en","category":"politics","source_country":"US","sentiment":-0.093},{"id":392708438,"title":"BBC seeks dismissal of $10bn Trump lawsuit over Panorama ‘fight like hell’ clip","text":"The BBC is to attempt to have Donald Trump’s $10bn defamation lawsuit over the editing of a speech for Panorama thrown out, according to court documents.\n\nThe broadcaster faced criticism for airing an episode of the investigative documentary series that featured an edited clip of Trump’s address to a rally on 6 January 2021, which it is alleged gave the impression he encouraged supporters to storm the Capitol building in Washington DC.\n\nThe spliced clips in the edition of Panorama suggested that Trump told the crowd: “We’re going to walk down to the Capitol and I’ll be there with you, and we fight. We fight like hell.” The words were taken from sections of his speech almost an hour apart.\n\nThe BBC will file a motion to dismiss, claiming the Florida court lacks “personal jurisdiction” over them, the court venue is “improper” and that Trump has “failed to state a claim”, documents filed on Monday revealed.\n\nThe corporation will argue that it did not create, produce or broadcast the documentary in Florida and that Trump’s claim that the documentary was available in the US on the streaming service BritBox is untrue.\n\n“Simply clicking on the link that plaintiff cites for this point shows it is not on BritBox,” the broadcaster’s lawyers said in court documents.\n\nThe BBC will also claim the president has failed to “plausibly allege” it published the documentary with “actual malice”, which public officials are required to show when filing suit for defamation in the US.\n\nThe broadcaster has asked the court “to stay all other discovery” – the pre-trial process in which parties gather information – pending the decision on the motion.\n\nIn asking for discovery to be delayed, lawyers for the BBC said: “The plaintiff will seek broad, objectionable discovery on the merits, implicating the BBC’s entire scope of coverage of Donald J Trump over the past decade or more and claiming injury to his entire business and political profiles.”\n\nA 2027 trial date has been proposed should the case continue.\n\nThe BBC was approached for comment. It vowed previously to defend itself against the $10bn lawsuit over the episode, which aired in 2024.\n\nTrump has sought $5bn in damages each on two counts, alleging that the BBC defamed him and that it violated Florida’s Deceptive and Unfair Trade Practices Act.\n\nThe US president alleged the broadcaster “intentionally, maliciously and deceptively” edited the 6 January speech he gave before the attack on the US Capitol.\n\nWhile BBC has acknowledged previously that the editing was an “error of judgment” and apologised to Trump, it has insisted there is no legal basis for a defamation claim.\n\nTim Davie, who was the BBC’s director general, and Deborah Turness, who was the head of BBC News, resigned last month over the controversy.\n\nTrump’s lawsuit against the BBC was filed at the US district court for the southern district of Florida, even though BBC iPlayer, the main streaming platform that carries Panorama, and BBC One, the main TV channel that broadcasts it, are not available in the US.\n\nThe episode never aired in the US and the BBC is expected to argue that it therefore had no significant impact on Trump’s reputation among US audiences.\n\nSince his re-election, Trump has scored several high-profile legal wins against big media firms in the US. ABC, owned by Disney, agreed to pay $15m as part of a settlement over a defamation lawsuit he brought after comments made by the anchor George Stephanopoulos.\n\nIn July, Trump reached a $16m settlement with Paramount, the parent of CBS News, over what he claimed was false editing of a pre-election interview with the Democratic candidate for president, Kamala Harris.\n\nA BBC spokesperson said: “As we have made clear previously, we will be defending this case. We are not going to make further comment on ongoing legal proceedings.”","summary":"Broadcaster’s submission calls on Florida court to throw out defamation case where US president is suing over editing of 6 January 2021 speech\n\nThe BBC is to attempt to have Donald Trump’s $10bn defamation lawsuit over the editing of a speech for Panorama thrown out, according to court documents.\n\nThe broadcaster faced criticism for airing an episode of the investigative documentary series that featured an edited clip of Trump’s address to a rally on 6 January 2021, which it is alleged gave the impression he encouraged supporters to storm the Capitol building in Washington DC.\n\n Continue reading...","url":"https://www.theguardian.com/media/2026/jan/13/bbc-seeks-dismissal-of-10bn-trump-lawsuit-over-panorama-fight-like-hell-clip","image":"https://i.guim.co.uk/img/media/c7fff38fb2cc011c15a7a5f9375fc4a0f3ddd411/379_0_4809_3846/master/4809.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2026-01-13 07:52:05","author":"Jamie Grierson","authors":["Jamie Grierson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.233},{"id":392564654,"title":"Court says Trump illegally blocked clean energy grants to Democratic states","text":"A United States judge has ruled that the administration of President Donald Trump acted illegally when it cancelled the payment of $7.6bn in clean energy grants to states that voted for Democrat Kamala Harris in the 2024 presidential election.\n\nIn a decision on Monday, US District Judge Amit Mehta said the administration’s actions violated the Constitution’s equal protection requirements.\n\n“Defendants freely admit that they made grant-termination decisions primarily – if not exclusively – based on whether the awardee resided in a state whose citizens voted for President Trump in 2024,” Mehta wrote in a summary of the case.\n\nThe grants were intended to support hundreds of clean energy projects across 16 states, including California, Colorado, New Jersey and Washington state. The projects included initiatives to create battery plants and hydrogen technology.\n\nBut projects in those states were cancelled in October, as the Trump administration sought to ratchet up pressure on Democratic-led states during a heated government shutdown.\n\nAt the time, Trump told the network One America News (OAN) that he would take aim at projects closely associated with the Democratic Party.\n\n“We could cut projects that they wanted, favourite projects, and they’d be permanently cut,” he told the network.\n\nRussell Vought, the Trump-appointed director for the Office of Management and Budget, posted on social media that month that “funding to fuel the Left’s climate agenda” had been “cancelled”.\n\nThe cuts included up to $1.2bn for a hub in California aimed at accelerating hydrogen technology, and up to $1bn for a hydrogen project in the Pacific Northwest.\n\nSt Paul, Minnesota, was among the jurisdictions affected by the grant cuts. The city and a coalition of environmental groups filed a lawsuit to contest the Trump administration’s decision.\n\nSecond legal setback\n\nA spokesperson for the US Department of Energy, however, said the Trump administration disagrees with the judge’s ruling.\n\nOfficials “stand by our review process, which evaluated these awards individually and determined they did not meet the standards necessary to justify the continued spending of taxpayer dollars”, spokesman Ben Dietderich said.\n\nThe Trump administration has repeatedly pledged to cut back on what it considers wasteful government spending.\n\nMonday’s ruling was the second legal setback in just a matter of hours for Trump’s efforts to roll back the clean energy programmes in the US.\n\nA separate federal judge ruled on Monday that work on a major offshore wind farm for Rhode Island and Connecticut can resume, handing the industry at least a temporary victory as Trump seeks to shut it down.\n\nThe US president campaigned for the White House on a promise to end the offshore wind industry, saying electric wind turbines – sometimes called windmills – are too expensive and hurt whales and birds.\n\nInstead, Trump has pushed for the US to ramp up fossil fuel production, considered the primary contributor to climate change. The US president has repeatedly defied scientific consensus on climate change and referred to it as a “hoax”.","summary":"A US district judge ruled that Trump&#039;s decision singled out states that voted for Democrats in the 2024 elections.","url":"https://www.aljazeera.com/news/2026/1/13/court-says-trump-illegally-blocked-clean-energy-grants-to-democratic-states?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2026/01/AP22055617825181-1768276087.jpg?resize=1920%2C1440","video":null,"publish_date":"2026-01-13 05:21:32","author":"Adam Hancock,Apps Support","authors":["Adam Hancock","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.628},{"id":392644490,"title":"In Reelection Launch, Josh Shapiro Admits Violent Attack Almost Drove Him From the Race","text":"COLLIER TOWNSHIP, Pennsylvania – Gov. Josh Shapiro (D-PA) launched his reelection bid in western Pennsylvania on Thursday, highlighting his accomplishments since taking office in 2023 and outlining his goals for a second term.\n\nDespite noting that Republicans and independents were present in the packed carpenters' union hall, the only boos came when Shapiro mentioned his Philadelphia Eagles fandom. It was, unmistakably, Steeler country.\n\nThe crowd was loud and enthusiastic, packed with local figures such as newly sworn-in Pittsburgh Mayor Corey O'Connor and labor leaders, including Darrin Kelly of the Allegheny-Fayette Labor Council, alongside scores of trade and union workers filling the cavernous hall.\n\nVisually, the rollout differed from Shapiro's 2022 kickoff along the river in Johnstown. Substantively, however, it was familiar: a message rooted in the importance of place.\n\nIn an exclusive interview with the Washington Examiner after the speech, before departing for his Philadelphia announcement, Shapiro summed it up simply: different location, same goal – ensuring every community in Pennsylvania gets a fair shot.\n\n\"I wanted to be focused here in the union hall on those who I believe are going to make up the power of the next generation of workers in Pennsylvania,\" he said of the trade union members who are already working on shovel-ready energy projects in the region.\n\n\"If we don't invest in skills-based labor, we're not going to have as bright a future in our commonwealth,\" he said. \"And so that's why I'm here today, focused on what I think is the ability to help every Pennsylvanian chart their own course and achieve success. And so much of that runs through halls like this one.\"\n\nBefore Shapiro took to the stage, one of the people who stepped up ahead of him was a man who goes by \"Tim O.,\" a 52-year-old father who is on his second career and his second year in a carpentry apprenticeship. Tim became choked up when he said, \"I don't look like other apprentices.\"\n\nShapiro said Tim was an example of his administration's investment in trade programs in a state where over 60 percent of the population did not attend college and that it was important to give him a platform.\n\n\"One of the things I always ask the apprentices is, 'Hey, how'd you get here? What brought you here? What was your journey?' Some of them come right out of high school, and we want to create those pathways,\" Shapiro explained of the variety of answers he has received over the years. \"Some of them go to college for a year, realize it's not for them. Some of them have different careers and then find their ways here.\"\n\n\"The key is opening up the doors to places like this and showing people it exists because we need people like Tim O., who, even at 52, to dedicate their lives to having the skills we need to produce more energy, to quite literally build bridges and build buildings,\" Shapiro said.\n\nThe speech was filled with stories highlighting accomplishments, future goals, and governing with purpose, and included a brief swipe at the bipartisan chaos in Washington. Notably, Shapiro avoided inflammatory language, steering clear of demonizing Republicans or President Donald Trump.\n\nAnd he used the word \"we\" instead of \"I\" when discussing accomplishments, something many politicians cannot find a way to do.\n\n\"I obviously have profound differences from the president. You have written about that,\" he said. \"No one expects us to agree on everything. But to me, vilifying others, attacking others, is not a way to bring people together and get stuff done.\"\n\nShapiro, who has a good relationship with Sen. Dave McCormick (R-PA), said his job is to champion the things people can do together for the commonwealth.\n\n\"My focus is on building bridges, creating more opportunity for folks to come together, and delivering results for people like Tim O. and others who need help,\" he said. \"And so, to me, I want this campaign to be hopeful. I want to highlight differences where we have different policy views, but I want to focus on uplifting people.\"\n\nLarry Ceisler, a Washington County native and Philadelphia-based public affairs official, said the reason you do not see Shapiro go personal on Trump is that, first of all, that is always who he has been, and, second, because he always wants his governance to be about purpose, not divisiveness.\n\n\"He always tries to make it substantive and not personal because he never wants to be perceived as attacking the people who support the president, so when he does criticize, it is based on the issues,\" Ceisler said.\n\nShapiro begins his launch with a formidable amount of cash. This week, his campaign announced he ended 2025 with over $30 million in cash on hand and a Quinnipiac University poll that showed Shapiro's favorability rating at 58 percent.\n\nHe faces Republican Stacy Garrity, the state treasurer, who has won back-to-back races for that statewide elected office. Garrity said in a statement that \"Josh Shapiro is more concerned with a promotion to Pennsylvania Avenue than serving hardworking Pennsylvanians.\"\n\nShapiro's governorship entered the national spotlight early, shaped by crisis decisions beginning in 2023, shortly after he took office, with the train derailment in East Palestine, Ohio, near the Pennsylvania border. The fiery wreck, visible for miles, was followed by a controlled burn that raised concerns across Beaver and Lawrence counties over toxic contamination in the air and water.\n\nThat was followed in June 2023 by a tanker truck crash beneath Interstate 95 in Philadelphia, a vital East Coast artery carrying more than 150,000 vehicles a day. The crash killed the driver and caused the overpass to collapse. Despite predictions that the highway could be closed for years, six temporary lanes reopened within two weeks, allowing traffic to move while permanent repairs were made.\n\nShapiro was also governor in July 2024 when gunman Thomas Crooks attempted to assassinate Trump, killing local fire chief Cory Comperatore and wounding two others. Shapiro was on the scene in Butler the following morning with first responders and investigators. He was in office as well when Luigi Mangione was arrested in Altoona for the alleged killing of UnitedHealthcare CEO Brian Thompson, and when three police officers were murdered in York County in the deadliest day for Pennsylvania law enforcement in 16 years.\n\nDuring that period, Shapiro was also on the short list of possible running mates for 2024 Democratic presidential nominee Kamala Harris, before ultimately determining the role was not the right fit.\n\nLast year, an arsonist attempted to kill Shapiro and his family by firebombing the governor's residence, setting the home ablaze, and causing extensive damage. Shapiro, his wife, their children, and other family members narrowly escaped the rapidly spreading flames.\n\nShapiro has said the attack prompted serious conversations with his wife about whether he should seek reelection.\n\n\"I think a couple of days after that, my primary focus was on being a good dad and a good husband and being a good governor. And I have tried very, very hard to both heal myself and be there for my kids as they work through this and be there for Laurie,\" he said of his wife, who was with him at the beginning of the interview.\n\nShapiro admits there were many family discussions on what they should do.\n\n\"We had a long talk about whether we wanted to keep doing this in the face of that kind of attack and that kind of threat,\" he said. \"The reality is we all ended up in the exact same place. Yes, we not only have to keep governing, but we've got to run again and keep doing this because you can't let those who want to inflict pain on others bring harm to communities. You can't let them win.\"\n\nShapiro said he expects to continue working through the aftermath for years, noting that members of both parties privately reached out to check on his well-being and offer help, including Trump, who was himself the target of an assassination attempt.\n\n\"He called, and I appreciated that,\" he said. \"And we talked about his brush with death in public. No public officials should have to go through this. Our politics shouldn't be this way.\"\n\nShapiro said he hopes the way he runs his campaign and governs will help lower the temperature and allow for a measure of healing.\n\n\"I said today in my speech, go talk to that person that voted a different way in the last election and have a respectful conversation,\" Shapiro said. \"We need more of that.\"\n\nSalena Zito is a staff reporter and columnist for the Washington Examiner. She reaches the Everyman and Everywoman through shoe-leather journalism, traveling from Main Street to the beltway and all places in between.\n\nEditor’s Note: Do you enjoy Townhall’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin Townhall VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://townhall.com/columnists/salenazito/2026/01/13/in-reelection-launch-josh-shapiro-admits-violent-attack-almost-drove-him-from-the-race-n2669369","image":"https://media.townhall.com/cdn/hodl/2024/234/9fa1a495-f556-4b9a-9320-728c97118de9.jpg","video":null,"publish_date":"2026-01-13 05:01:00","author":"Salena Zito","authors":["Salena Zito"],"language":"en","category":"politics","source_country":"us","sentiment":0.105},{"id":392555948,"title":"Judge Says Trump Admin Illegally Cut Billions in Grants From Blue States’ Climate Projects","text":"President Donald Trump’s administration acted illegally in blocking $7.6 billion for climate projects in democratically run states, a federal judge ruled Monday.\n\nThe grants were canceled after a review found the projects were not financially feasible and did not advance the country’s energy needs. The judge said this action violated the Constitution’s equal protection requirements and targeted states that voted for Kamala Harris in the 2024 presidential election.","url":"https://www.theepochtimes.com/us/judge-says-trump-admin-illegally-cut-billions-in-grants-from-blue-states-climate-projects-5969995","image":"https://img.theepochtimes.com/assets/uploads/2025/05/22/id5861912-CP125118560-300x180.jpg","video":null,"publish_date":"2026-01-13 02:57:09","author":"Troy Myers","authors":["Troy Myers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.25},{"id":392555892,"title":"Judge Says Trump Admin Illegally Cut Billions in Grants From Blue States’ Climate Projects","text":"President Donald Trump’s administration acted illegally in blocking $7.6 billion for climate projects in democratically run states, a federal judge ruled Monday.\n\nThe grants were canceled after a review found the projects were not financially feasible and did not advance the country’s energy needs. The judge said this action violated the Constitution’s equal protection requirements and targeted states that voted for Kamala Harris in the 2024 presidential election.","url":"https://www.theepochtimes.com/us/judge-says-trump-admin-illegally-cut-billions-in-grants-from-blue-states-climate-projects-5969995?cmt=1","image":"https://img.theepochtimes.com/assets/uploads/2025/05/22/id5861912-CP125118560-300x180.jpg","video":null,"publish_date":"2026-01-13 02:57:09","author":"Troy Myers","authors":["Troy Myers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.25},{"id":392663432,"title":"BBC says it will file motion to dismiss $10 billion Trump lawsuit over January 6 speech edit","text":"The BBC said it will challenge United States President Donald Trump's defamation case after the broadcaster was slapped with a mutli-billion dollar lawsuit over a programme edit. The United Kingdom's national broadcaster said that it will take steps to dismiss Trump's defamation lawsuit over a Panorama programme edit , documents filed late on late on Monday, January 12 UK time, showed. Trump is seeking up to 10 billion dollars (£7.5 billion) in damages in response to the edit of his speech that the president's lawyers say was \"false and defamatory\". The broadcaster is accused of deliberately editing parts of Trump's January 6, 2021 speech to make it appear that he encouraged supporters to storm the Capitol. Five people were left dead and hundreds injured in the protest. The October 2024 documentary titled \"Trump: A Second Chance?\" cut parts of Trump's speech, reportedly changing the meaning of what he told supporters. His speech was spliced to show him saying: “We’re going to walk down to the Capitol… and I’ll be there with you. And we fight. We fight like hell.” It was released days before the 2024 US election faceoff between Republican Trump and Democrat Kamala Harris. The broadcaster will file a motion to dismiss on claims that the Florida court lacks \"personal jurisdiction\" over the BBC, the court venue is \"improper\" and that Trump has \"failed to state a claim\", the Press Association reported. The BBC will argue that it did not create, produce or broadcast the documentary in Florida and that the claim that the documentary was available in the US on streaming service BritBox is untrue. The BBC will also claim that Trump failed to \"plausibly allege\" the broadcaster published the documentary with \"actual malice\". Public officials are required to show this when filing suit for defamation in the US. The PA reported that the BBC has asked the court \"to stay all other discovery\" – the pre-trial process in which parties gather information – pending the decision on the motion. PA said the BBC has been approached for comment. A 2027 trial date has been proposed should the case continue. For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters .","url":"https://www.dailystar.co.uk/news/latest-news/bbc-says-file-motion-dismiss-36541094","image":"https://i2-prod.dailystar.co.uk/article36537357.ece/ALTERNATES/s1200b/1_US-POLITICS-TRUMP.jpg","video":null,"publish_date":"2026-01-13 02:15:49","author":"Tannur Anders","authors":["Tannur Anders"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.092},{"id":392491434,"title":"San Jose Mayor Matt Mahan considers run for California governor","text":"San Jose Mayor Matt Mahan, who has increasingly waded into statewide issues in recent years, is reconsidering his political future and could be preparing to enter California’s crowded race for governor — a contest that so far lacks a clear front-runner.\n\nNone of the declared candidates have offered a “clear and compelling” vision for the state, Mahan, 43, said in a phone interview from Sacramento. California, he said, needs “bold and independent leadership,” particularly on homelessness.\n\n“I see business as usual in Sacramento,” said Mahan, who was at the Capitol advocating for reforms aimed at making housing more affordable. “I don’t see anyone acting like it’s a crisis.”\n\nThe comments came the same day Attorney General Rob Bonta announced he will not run for governor, instead seeking reelection after suing the Trump administration more than 50 times in the past year.\n\nBonta had faced growing pressure from supporters in recent months to enter the race, particularly after former Vice President Kamala Harris and Sen. Alex Padilla declined to run to replace term-limited Gov. Gavin Newsom.\n\nIn a statement, Bonta, a former Alameda city council member and state Assembly member, said the calls have “sharpened my focus and reminded me how grateful I am to work with so many who care so deeply for this state,” but added, “My resolve is firm: our fight against corporate greed and vicious attacks from Washington requires a leader with battle-tested experience in the courtroom.”\n\nMahan did not say when he would decide whether to run, noting that he still needs to discuss the possibility with his family. If he enters the race, he would join a field in which a large share of voters remain undecided.\n\nSonoma State University political science professor David McCuan said the open-seat contest has drawn a rush of candidates but few have been able to build sustained momentum, with many polling in the single digits.\n\nMcCuan described Mahan as an “unconventional Democrat” and said the mayor’s early political success in San Jose suggests this could be the right moment to make a move.\n\n“Much of politics is about timing,” he said. “And his timing is right for what could come next in his political career.”\n\nStill, McCuan noted that while Mahan is well known in Silicon Valley and the Bay Area, he remains far less familiar to voters in Southern California, where much of the state’s electorate lives.\n\nMahan burst onto the local political scene in 2020 with his election to the City Council, only to become mayor three years later. A moderate Democrat, he has at times clashed with his own party, emerging as a vocal critic of Newsom’s refusal to fund Proposition 36 — the tough-on-crime ballot measure approved by voters in 2024 amid a wave of smash-and-grabs and open drug use in the state. Mahan has also faulted the governor’s administration for dismissing allegations of waste, fraud and abuse in state programs, arguing those concerns should not be partisan.\n\nAs mayor, Mahan has centered his agenda on what he calls a “Back to Basics” approach: addressing homelessness, cleaning up blighted streets and reducing crime. Late last year, he launched a coalition aimed at expanding that model statewide.\n\n“We are taking bold action that is different, that is meant to produce different outcomes,” he said of San Jose’s success in these areas. “I’m not hearing these current candidates think and talk in that way on these big issues.”\n\nMahan hosted several of the candidates for governor in San Jose last month for a tour of one of the city’s interim housing sites as he pushed for the restoration of key state homelessness funds. None of the Democratic candidates in attendance — including billionaire investor Tom Steyer, former Orange County Rep. Katie Porter, former state Controller Betty Yee, state schools chief Tony Thurmond and former Assembly Majority Leader Ian Calderon — struck Mahan as offering the kind of vision he is seeking.\n\nOther Democrats in the race include former U.S. Health and Human Services Secretary and California Attorney General Xavier Becerra, former Los Angeles Mayor Antonio Villaraigosa and U.S. Rep. Eric Swalwell. Republicans running include former Fox News commentator Steve Hilton and Riverside County Sheriff Chad Bianco.\n\nA recent Emerson College poll found that about a third of voters remain undecided. Bianco led with 13% support, followed closely by Swalwell and Hilton at 12% each.","summary":"Mahan points to homelessness, public safety and what he calls “business as usual” in Sacramento as reasons he’s reassessing his political future.","url":"https://www.mercurynews.com/2026/01/12/san-jose-mayor-matt-mahan-considers-run-for-california-governor/","image":"https://www.mercurynews.com/wp-content/uploads/2025/07/AI-At-Work_39792.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2026-01-13 01:42:11","author":"Grace Hase","authors":["Grace Hase"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":392490730,"title":"EXCLUSIVE: Rich Democrat Candidate’s Wife Called Bible ‘F*cking Stupid,’ Loved Joke About Trump’s ‘Demise’","text":"Susan Chatzky, the wife of a Democratic House candidate, made a series of inflammatory Facebook posts over the course of a decade, in which she deemed the Bible “fucking stupid,” appeared to joke about President Donald Trump’s death and suggested that young white men to be deported or imprisoned.\n\nSusan’s husband, Peter Chatzky, a wealthy tech executive and deputy mayor of his affluent Westchester County village, is vying to unseat Republican New York Rep. Mike Lawler in a contest that could be among the most competitive races of the midterms. His wife’s comments appear to be at odds with the “compassion and empathy” Chatzky called for when announcing his congressional run.\n\n“We’re one America,” Chatzky told the Westchester County, New York-based outlet The Examiner News in June 2025, adding that he hoped to end the “hatred and divisiveness” in the current political climate. “We can all be successful together.”\n\nSusan Chatzky’s incendiary social media posts, which were previously unreported, were hidden from public view after the Daily Caller News Foundation reached out for comment. \n\nChatzky, a former board member of a local Planned Parenthood center, mocked the Bible and appeared to compare it to a popular children’s book series in a December 2021 post.\n\n“I really, really, really, don’t care about your fucking stupid Bible,” Chatzky wrote on Facebook. “It’s a book. Should we live our lives according to Nancy Drew?” (RELATED: Dem Vying To Unseat Rep. Mike Lawler Blasted For ‘Amateur’ Campaign After Walking Back ‘Bizarre’ Allegation)\n\nIn August 2025 while responding to the news of Taylor Swift’s engagement to NFL star Travis Kelce, Chatzky appeared to call attention to Trump’s hypothetical death.\n\n“The interwebs are so excited, you would think ‘it’ had happened,” Chatzky wrote on her Facebook page. \n\nAn account in the comments clarified the “it” in question was the death of the current president.\n\n“Imagine being Trump and knowing people are super happy for Taylor but bummed the breaking news wasn’t [sic] his demise,” the user wrote, adding a laughing emoji. \n\n“What a great day that will be!” the user added with a praying emoji at the end.\n\nChatzky reacted with a heart, referred to on Facebook as a “love.”\n\nThe National Republican Congressional Committee (NRCC), House Republicans’ campaign arm, slammed Chatzky’s inflammatory comments in a statement to the DCNF.\n\n“Radical Democrat Peter Chatzky and his wife are despicable,” NRCC spokeswoman Maureen O’Toole said. “They unabashedly support using hateful, discriminatory rhetoric and violence to get what they want. That is no way to lead, and Chatzky is unfit to serve the Hudson Valley in Congress.”\n\nIn October 2015, Susan Chatzky posted a graphic purportedly showing the number of mass shootings that year through September. In an exchange in the comments lamenting several shootings that day, she called for more drastic measures. \n\n“I hate to say this, but I think we need to deport white men in their 20’s. Or put them in internment camps,” Chatzky said. “I’ll really miss my sons.”\n\nWhen another account expressed alarm at Chatzky’s proposal and said her broad generalizations of white people could lead to stereotypes of black men, Chatzky backtracked and claimed she was joking. \n\n“I’m just tired of people being so afraid of people of color,” Chatzky said in a comment since-scrubbed from public view. “I was trying to point out how ridiculous that is. That stupid mom who wouldn’t let her son learn about Islam really got to me this week.”\n\nChatzky also reacted positively to a viral news story in January 2021 during which an 18-year-old woman publicly shamed her mother for getting punched in the face at a pro-Trump rally. \n\n“This gives me hope,” Chatzky wrote in a post accompanying a Newsweek story of the incident.\n\nThat month, Chatzky also argued members of Congress who declined to wear masks in the Capitol should face criminal prosecution.\n\n“The lawmakers who refused to wear masks should be brought up on charges of reckless endangerment,” Chatzky wrote. \n\nPeter Chatzky is among several Democrats running in a crowded primary to defeat Lawler in November. \n\nCait Conley, an Army combat veteran and former national security official, and Rockland County legislator Beth Davidson appear to be the favorites of national Democrats. Chatzky, however, is pledging to shake up the June primary with a $5 million investment into his campaign from his personal wealth.\n\nLawler’s Hudson Valley seat, New York’s 17th congressional district, is one of three GOP-held districts that former Vice President Kamala Harris carried in 2024, albeit the Democrat won it by under one percentage point. The NRCC is expected to spend aggressively to defend Lawler’s reelection bid.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Should we live our lives according to Nancy Drew?'","url":"https://dailycaller.com/2026/01/12/susan-peter-chatzky-facebook-posts-bible-trump-stupid/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FIMG_4233-e1768265017137.jpg","video":null,"publish_date":"2026-01-13 00:45:16","author":"Adam Pack","authors":["Adam Pack"],"language":"en","category":"politics","source_country":"US","sentiment":-0.07},{"id":392499774,"title":"Offshore wind developer prevails in U.S. court as Trump calls wind farms 'losers'","text":"A federal judge ruled Monday that work on a major offshore wind farm for Rhode Island and Connecticut can resume, handing the industry at least a temporary victory as President Trump seeks to shut it down.\n\nAt the U.S. District Court for the District of Columbia, Senior Judge Royce Lamberth said the government did not explain why it could not take action short of a complete stop to construction on Revolution Wind while it considers ways to mitigate its national security concerns. He said it also did not provide sufficient reasoning for its change in position.\n\nRevolution Wind has received all of its federal permits and is nearly 90% complete to provide power for Rhode Island and Connecticut.\n\nTrump says his goal is to not let any \"windmills\" be built. Three energy developers are challenging the administration's freeze of their offshore wind projects in the federal courts this week.\n\nDanish energy company Orsted, Norwegian company Equinor, and Dominion Energy Virginia each sued to ask the courts to vacate and set aside the administration's Dec. 22 order to freeze five big projects on the East Coast over national security concerns. Orsted's hearing was first on its Revolution Wind project. Orsted said it will soon resume construction to deliver affordable, reliable power to the Northeast.\n\nThe administration did not reveal specifics about its national security concerns, but Trump said Friday while meeting with oil industry executives about investing in Venezuela that wind farms are \"losers.\" He said they lose money, destroy the landscape and kill birds.\n\n\"I've told my people we will not approve windmills,\" Trump said. \"Maybe we get forced to do something because some stupid person in the Biden administration agreed to do something years ago. We will not approve any windmills in this country.\"\n\nThe Biden administration sought to ramp up offshore wind as a climate change solution. Trump began reversing the country's energy policies his first day in office with a spate of executive orders aimed at boosting oil, gas and coal. A federal judge ruled Monday that the Trump administration acted illegally when it canceled $7.6 billion in clean energy grants for projects in states that voted for Democrat Kamala Harris in the 2024 election.\n\nThe Trump administration paused leases for the Vineyard Wind project under construction in Massachusetts, Revolution Wind, Coastal Virginia Offshore Wind, and two projects in New York: Sunrise Wind and Empire Wind. New York's attorney general sued the Trump administration on Friday over Empire Wind and Sunrise Wind.\n\nRevolution Wind and Sunrise Wind are both major offshore wind projects by Orsted. Rhode Island and Connecticut filed their own request in court to try to save Revolution Wind.\n\n\"The law takes precedent over the political whims of one man, and we will continue to fight to make sure that remains the case,\" Rhode Island Attorney General Peter Neronha said in a statement.\n\nAt Monday's hearing, attorney Janice Schneider, representing Revolution Wind, said the stop work order came at a critical stage of construction, with the project nearly 90% built and weeks away from beginning to deliver power to the electric grid. She said the delay is costing more than $1.4 million per day, and a specialized vessel has just enough time now to install the remaining turbines before its contract is up at the site in February.\n\nSchneider said they take national security issues seriously, but the government has not shared more information about its concerns with their experts who have security clearances, or shared unclassified summaries.\n\n\"We do think that this court should be very skeptical of the government's true motives here,\" Schneider said, citing Trump's comments from Friday.\n\nDepartment of Justice attorney Peter Torstensen argued that national security is paramount and protecting against new risks identified in the classified materials outweighs any alleged irreparable harm to the developers.\n\nWork on the Revolution Wind project was previously paused on Aug. 22 for what the Bureau of Ocean Energy Management said were national security concerns. A month later, Judge Lamberth ruled the project could resume, citing the irreparable harm to the developers and the demonstrated likelihood of success on the merits of their claim. Orsted is building it with Skyborn Renewables.\n\nWith four offshore wind projects still stalled, Hillary Bright, executive director of offshore wind advocacy group Turn Forward, said she's hopeful that they will prevail in court and that the administration will begin to understand \"the immense benefits that these nearly complete power sources can bring to our nation's energy and national security.\"\n\nEquinor owns Empire Wind. Its limited liability company, Empire Wind LLC, said the project faces \"likely termination\" if construction can't resume by this Friday because the order disrupts a tightly choreographed construction schedule dependent on vessels with very limited availability. Its hearing is Wednesday.\n\n\"I would like to think that offshore wind is, and will continue to be, part of an all-of-the-above energy solution, which our country desperately needs,\" said Molly Morris, Equinor's senior vice president overseeing Empire Wind.\n\nDominion Energy Virginia, which is developing Coastal Virginia Offshore Wind, was the first to sue. It's asking a judge to block the order, calling it \"arbitrary and capricious\" and unconstitutional. Its hearing is Friday.","summary":"A federal judge ruled Monday that work on a major offshore wind farm can resume, handing the industry at least a temporary victory as President Trump seeks to shut it down.","url":"https://www.npr.org/2026/01/12/g-s1-105808/offshore-orsted-revolution-wind-trump-court-clean-energy","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8056x6040+0+0/resize/8056x6040!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fde%2Ff9%2F1375e510444db616b743134fe8af%2Fap26012662836755.jpg","video":null,"publish_date":"2026-01-13 00:12:14","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.023},{"id":392578664,"title":"Just One Part of MAHA Movement Doesn’t Resonate With Voters","text":"FIRST ON THE DAILY SIGNAL—Republican House candidates in purple districts who support changing the childhood vaccine schedule could pay the price in midterms, according to new data from President Donald Trump’s go-to pollster, Fabrizio Ward.\n\n“In the districts that will decide the control of the House of Representatives next year, Republican and Democratic candidates who support eliminating long standing vaccine requirements will pay a price in the elections,” says a Nov. 3 memo obtained by The Daily Signal. \n\nFabrizio Ward, a polling firm led by Tony Fabrizio and Bob Ward, surveyed 1,000 voters in the 35 most competitive congressional districts on their attitudes toward recommended vaccines.\n\nThis comes after the U.S. Department of Health and Human Services announced it has updated the childhood immunization schedule to recommend 11, rather than 17, shots for children. \n\nThe generic congressional ballot in the 35 most competitive districts was a “statistical dead-heat with Democrats holding a two-point edge.”\n\nBut “if the Republican candidate supported the elimination of long-standing vaccine recommendations, the ballot margin shifts a net 12-points in the Democrat’s favor, with the GOP candidate trailing by 14-points,” the memo says.\n\nIn the 35 districts in question, if the Democratic candidate is against the standing vaccine recommendations, their 2-point lead slides a net 20 points with the Republican leading by 18 points.\n\n“The negative movement for the candidate in either party scenario is even more dire among Swing voters—those voters who say they don’t typically vote along straight party lines—slipping a net 22-points for the Republican vaccine skeptic, and a net 31-points for the Democrat vaccine skeptic,” the memo says.\n\n“Vaccine skepticism is bad politics,” Fabrizio Ward concludes.\n\nFabrizio Ward found that the Make America Healthy Again, or MAHA, movement is popular across party lines with the exception of vaccine skepticism. Voters in the 25 competitive districts resonated with MAHA food policy, with 9 in 10 voters for both Trump and Kamala Harris saying the government should require labeling of harmful ingredients and chemicals in ultra-processed foods.\n\n“At the other end of the spectrum, vaccine skepticism, that is the removal of established childhood vaccine recommendations for diseases like whooping cough, measles, hepatitis and others is rejected by the overwhelming number of voters, resonates with just one-in-five voters, and just a third of self-described MAHA voters,” the memo says. \n\n“Vaccine skepticism is an outlier, not a defining policy, of the Make America Healthy Again movement, which has very popular elements with appeal across the political spectrum in these most competitive districts,” Fabrizio Ward writes.\n\nThe polling firm found broad support for childhood vaccines, including Hepatitis B, Shingles, and whooping cough. \n\nMore than 7 in 10 voters in these districts from across the political spectrum say the benefits of common vaccines, like MMR (83%), TDAP (77%), Hepatitis B (73%), and shingles (73%), outweigh the risks. For each vaccine, this includes more than 6 in 10 MAHA voters.\n\nUnder the new guidance, the Centers for Disease Control and Prevention recommends that all children get vaccinated against diphtheria, tetanus, whooping cough, Hib, pneumococcal conjugate, polio, measles, mumps, rubella, HPV, and chickenpox. The rotavirus, COVID-19, influenza, meningococcal disease, hepatitis A, and hepatitis B vaccines have been removed from the schedule.\n\nNo vaccine has been banned due to the change, and insurance will continue to cover the previously recommended 17. \n\nFabrizio Ward did not immediately respond to The Daily Signal’s request for comment.","summary":"FIRST ON THE DAILY SIGNAL—Republican House candidates in purple districts who support changing the childhood vaccine schedule could pay the price in midterms, according to... Read More\n\n\nThe post Just One Part of MAHA Movement Doesn’t Resonate With Voters appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2026/01/12/exclusive-trump-pollster-warns-anti-vax-sentiment-could-spell-trouble-republicans/","image":"https://www.dailysignal.com/wp-content/uploads/2026/01/f.jpg","video":null,"publish_date":"2026-01-12 23:45:00","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":392542932,"title":"CT cheers: Court says Trump administration illegally blocked $7.6B in clean energy grants","text":"By MATTHEW DALY\n\nWASHINGTON (AP) — A federal judge ruled Monday that the Trump administration acted illegally when it canceled $7.6 billion in clean energy grants for projects in states that voted for Democrat Kamala Harris in the 2024 election.","url":"https://www.courant.com/2026/01/12/trump-clean-energy/","image":"https://www.courant.com/wp-content/uploads/2026/01/Trump-CFPB_46753_7e5090.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2026-01-12 22:38:30","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.131},{"id":392512462,"title":"Court says Trump administration illegally blocked $7.6B in clean energy grants to Democratic states","text":"By MATTHEW DALY\n\nWASHINGTON (AP) — A federal judge ruled Monday that the Trump administration acted illegally when it canceled $7.6 billion in clean energy grants for projects in states that voted for Democrat Kamala Harris in the 2024 election.\n\nThe grants supported hundreds of clean energy projects in 16 states, including battery plants, hydrogen technology projects, upgrades to the electric grid and efforts to capture carbon dioxide emissions.\n\nThe Energy Department said the projects were terminated after a review determined they did not adequately advance the nation’s energy needs or were not economically viable. Russell Vought, the White House budget director, said on social media that “the Left’s climate agenda is being canceled.”\n\nU.S. District Judge Amit Mehta said the administration’s action violated the Constitution’s equal protection requirements.\n\n“Defendants freely admit that they made grant-termination decisions primarily — if not exclusively — based on whether the awardee resided in a state whose citizens voted for President Trump in 2024,” Mehta wrote in a 17-page opinion. The administration offered no explanation for how their purposeful targeting of grant recipients based on their electoral support — or lack of it — for Trump “rationally advances their stated government interest,” the judge added.\n\nThe ruling was the second legal setback for the administration’s rollback of clean energy program in a matter of hours. A federal judge ruled Monday that work on a major offshore wind farm for Rhode Island and Connecticut can resume, handing the industry at least a temporary victory as Trump seeks to shut it down.\n\nA spokesman for the Energy Department said officials disagree with the judge’s decision on clean energy grants.\n\nOfficials “stand by our review process, which evaluated these awards individually and determined they did not meet the standards necessary to justify the continued spending of taxpayer dollars,” spokesman Ben Dietderich said. “The American people deserve a government that is accountable and responsible in managing taxpayer funds.”\n\nProjects were canceled in California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, New Hampshire, New Jersey, New Mexico, New York, Oregon, Vermont and Washington state. All 16 targeted states supported Harris.\n\nThe cuts include up to $1.2 billion for California’s hydrogen hub that is aimed at accelerating hydrogen technology and production, and up to $1 billion for a hydrogen project in the Pacific Northwest. A Texas hydrogen project and a three-state project in West Virginia, Ohio and Pennsylvania were spared, according to clean-energy supporters who obtained a list of the DOE targets.\n\nThe city of St. Paul and a coalition of environmental groups filed a lawsuit after they lost grants.\n\nTrump said in an interview with One America News, a conservative outlet, last fall that his administration could cut projects that Democrats want. “I’m allowed to cut things that never should have been approved in the first place and I will probably do that,” Trump said in the Oct. 1 interview.\n\nVickie Patton, general counsel for the Environmental Defense Fund, one of the groups that filed the suit, said the court ruling “recognized that the Trump Department of Energy vindictively canceled projects for clean affordable energy that just happened to be in states disfavored by the Trump administration, in violation of the bedrock Constitutional guarantee that all people in all states have equal protection under the law.”\n\nThe administration’s actions violated the Constitution, foundational American values and “imposed high costs on the American people who rely on clean affordable energy for their pocketbooks and for healthier lives,” Patton said.\n\nAnne Evens, CEO of Elevate Energy, one of the groups that lost funding, said the court ruling would help keep clean energy affordable and create jobs.\n\n“Affordable energy should be a reality for everyone, and the restoration of these grants is an important step toward making that possible,” she said.","summary":"The grants supported hundreds of clean energy projects in 16 states.","url":"https://www.sandiegouniontribune.com/2026/01/12/trump-clean-energy/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2026/01/Trump-CFPB_46753_7e5090.jpg?w=150&strip=all","video":null,"publish_date":"2026-01-12 22:38:30","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.497},{"id":392478816,"title":"Court: Trump administration illegally blocked grants to Democratic states","text":"WASHINGTON (AP) — A federal judge ruled Monday that the Trump administration acted illegally when it canceled $7.6 billion in clean energy grants for projects in states that voted for Democrat Kamala Harris in the 2024 election.\n\nThe grants supported hundreds of clean energy projects in 16 states, including battery plants, hydrogen technology projects, upgrades to the electric grid and efforts to capture carbon dioxide emissions.\n\nThe Energy Department said the projects were terminated after a review determined they did not adequately advance the nation’s energy needs or were not economically viable. Russell Vought, the White House budget director, said on social media that “the Left’s climate agenda is being canceled.”\n\nU.S. District Judge Amit Mehta said the administration’s action violated the Constitution’s equal protection requirements.\n\n“Defendants freely admit that they made grant-termination decisions primarily — if not exclusively — based on whether the awardee resided in a state whose citizens voted for President Trump in 2024,” Mehta wrote in a 17-page opinion. The administration offered no explanation for how their purposeful targeting of grant recipients based on their electoral support for Trump — or lack of it — “rationally advances their stated government interest,” the judge added.\n\nThe ruling was the second legal setback for the administration’s rollback of clean energy program in a matter of hours. A separate federal judge ruled Monday that work on a major offshore wind farm for Rhode Island and Connecticut can resume, handing the industry at least a temporary victory as Trump seeks to shut it down.\n\nA spokesman for the Energy Department said officials disagree with the judge’s decision on clean energy grants.\n\nOfficials “stand by our review process, which evaluated these awards individually and determined they did not meet the standards necessary to justify the continued spending of taxpayer dollars,” spokesman Ben Dietderich said. “The American people deserve a government that is accountable and responsible in managing taxpayer funds.” \n\nProjects were canceled in California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maryland, Massachusetts, Minnesota, New Hampshire, New Jersey, New Mexico, New York, Oregon, Vermont and Washington state. All 16 targeted states supported Harris.\n\nThe cuts include up to $1.2 billion for California’s hydrogen hub that is aimed at accelerating hydrogen technology and production, and up to $1 billion for a hydrogen project in the Pacific Northwest. A Texas hydrogen project and a three-state project in West Virginia, Ohio and Pennsylvania were spared, according to clean-energy supporters who obtained a list of the DOE targets.\n\nThe city of St. Paul and a coalition of environmental groups filed a lawsuit after they lost grants.\n\nTrump said in an interview last fall with One America News, a conservative outlet, that his administration could cut projects that Democrats want. “I’m allowed to cut things that never should have been approved in the first place and I will probably do that,” Trump said in the Oct. 1 interview.\n\nVickie Patton, general counsel for the Environmental Defense Fund, one of the groups that filed the suit, said the court ruling “recognized that the Trump Department of Energy vindictively canceled projects for clean affordable energy that just happened to be in states disfavored by the Trump administration, in violation of the bedrock Constitutional guarantee that all people in all states have equal protection under the law.”\n\nThe administration’s actions violated the Constitution, foundational American values and “imposed high costs on the American people who rely on clean affordable energy for their pocketbooks and for healthier lives,” Patton said.\n\nAnne Evens, CEO of Elevate Energy, one of the groups that lost funding, said the court ruling would help keep clean energy affordable and create jobs.\n\n“Affordable energy should be a reality for everyone, and the restoration of these grants is an important step toward making that possible,” she said.","url":"https://apnews.com/article/trump-clean-energy-democrats-blue-state-hydrogen-9269a5a839122e1b3fd487787747d47e","image":"https://dims.apnews.com/dims4/default/e16e663/2147483647/strip/false/crop/2392x1600+0+0/resize/1486x994!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fe2%2F44937d418076667d925ac6ee8df2%2Fc79a18abff9547cba884dc7c87db8c62","video":null,"publish_date":"2026-01-12 22:25:29","author":"Matthew Daly","authors":["Matthew Daly"],"language":"en","category":"politics","source_country":"us","sentiment":-0.511},{"id":392483698,"title":"White House says Trump 'laser-focused' on issue he calls a 'hoax'","text":"The White House says President Donald Trump has been “laser-focused on making America affordable” since taking office. Just one month ago, President Trump called affordability a “hoax” perpetrated by Democrats.\n\nPresident Trump has recently attempted to preserve his sweeping tariffs amid Supreme Court review, has engaged in foreign policy messaging involving Venezuela, Iran, and Greenland — including promoting himself as the “acting President of Venezuela” — and has responded sharply to protests involving federal officers.\n\nThe president campaigned on lowering the cost of living on “day one,” but nearly 51 weeks into his second term, inflation remains high.\n\nWhite House Press Secretary Karoline Leavitt told Fox News that the president would travel to Detroit on Tuesday to deliver a speech about “all of the positive economic news that we continue to see as a result of his agenda.”\n\n“So tomorrow, he looks forward to traveling to the great state of Michigan, a state he won big, to not only tour a factory that produces Ford F-150s, and is going to be hiring more, and producing more trucks right here in the USA because of President Trump’s effective tariff policies,” Leavitt said.\n\nTrump narrowly won Michigan, taking less than half of the vote and besting Vice President Kamala Harris by 1.4 percentage points.\n\nLeavitt said that “mortgage rates that are falling under 6% for the first time in years,” “the national average of gasoline is the lowest that it’s been in five years,” and core inflation is “at its lowest level in five years.”\n\nShe suggested that “with a little bit of patience, the American people are going to continue to see that the best is yet to come,” and claimed that Trump “has a proven economic formula that works.”\n\nLeavitt also said that Trump has a housing plan “in the works” and a healthcare plan “in the works,” and vowed that Americans will “continue to hear from the president, and he’ll continue to hit the road across the country to speak directly with the people he loves most, the American people.”","summary":"The White House says President Donald Trump has been “laser-focused on making America affordable” since taking office. Just one month ago, President Trump called affordability a “hoax” perpetrated by Democrats.\n\nPresident Trump has recently attempted to preserve his sweeping tariffs amid Supreme Court review, has engaged in foreign policy messaging involving Venezuela, Iran, and Greenland — including promoting himself as the “acting President of Venezuela” — and has responded sharply to protests involving federal officers.\n\n The president campaigned on lowering the cost of living on “day one,” but nearly 51 weeks into his second term, inflation remains high.\n\n White House Press Secretary Karoline Leavitt told Fox News that the president would travel to Detroit on Tuesday to deliver a speech about “all of the positive economic news that we continue to see as a result of his agenda.”\n\n“So tomorrow, he looks forward to traveling to the great state of Michigan, a state he won big, to not only tour a factory that ","url":"https://www.alternet.org/trump-affordability-2674876815/","image":"https://www.alternet.org/media-library/image.jpg?id=62717527&width=1200&height=600&coordinates=0%2C60%2C0%2C60","video":null,"publish_date":"2026-01-12 22:07:23","author":"David Badash","authors":["David Badash"],"language":"en","category":"politics","source_country":"US","sentiment":-0.151},{"id":392589906,"title":"Indian American Leaders Offer Sharp Contrast Ahead Of Trump's Detroit Visit","text":"Republican leader Sunny Reddy announced that he is sponsoring billboards across Michigan to welcome Trump during his visit. In a social media post, Reddy said the effort was meant to greet the president and signal support for Michigan Republicans.\n\n“I wanted to share that I'm sponsoring billboards across Michigan to welcome President Trump to our state,” Reddy wrote, adding that he was“proud to stand with Michigan Republicans”. He was recently elected as vice chairman of the Republican Party in Michigan.\n\nA very different message was offered by Democratic Congressman Shri Thanedar, who represents a Detroit-area district and has been openly critical of Trump.\n\nThanedar recalled Trump's previous visit to Detroit, saying the former president had insulted the city.“The last time Donald Trump visited Detroit, he insulted our city, saying the whole country would end up like Detroit if Kamala Harris were elected,” Thanedar said.\n\nHe challenged Trump's economic claims, particularly regarding manufacturing and job creation. Thanedar said Trump had promised to bring manufacturing jobs and economic success to the region, but argued that the opposite had occurred.\n\n“For the last eight months, we've lost 68,000 manufacturing jobs, and unemployment has hit a four-plus year high,” Thanedar said.\n\nThanedar also criticised rising living costs, saying everyday expenses have increased for Americans.“Life in America is more expensive than ever,” he said, adding that Detroit“does not need any more of your insults or lies.”\n\nPositioning himself as an advocate for working families, Thanedar said he was focused on lowering costs and improving affordability in the city.“Detroit deserves better,” he said.“I'm fighting for you, Detroit. Fighting to bring your costs down and make life more affordable.”","summary":"(MENAFN - IANS) Washington, Jan 13 (IANS) On the eve of President Donald J. Trump's visit to Detroit, two Indian American leaders in Michigan have put forward sharply contrasting messages, ...","url":"https://menafn.com/1110589828/Indian-American-Leaders-Offer-Sharp-Contrast-Ahead-Of-Trumps-Detroit-Visit","image":"https://menafn.com/updates/pr/2026-01/12/I_694aaimage_story.jpg","video":null,"publish_date":"2026-01-12 22:00:33","author":"Date,MENAFN","authors":["Date","MENAFN"],"language":"en","category":"politics","source_country":"jo","sentiment":-0.34},{"id":392588698,"title":"Dem senator with presidential dreams sues Pete Hegseth in latest escalation in clash over 'seditious' video","text":"A Democratic senator who has been slammed for what the Trump administration calls 'seditious' behavior has filed a retaliatory federal lawsuit against Pentagon boss Pete Hegseth.\n\nArizona Senator Mark Kelly is hitting back at the secretary of war for his attempt to strip the Democrat of his military rank and pay. \n\n'From the moment I drove through the gates of Naval Air Station Pensacola, to when I was shot at over Iraq and Kuwait, to when I landed Space Shuttle Endeavour on its last mission, I gave everything I had to this country and I earned my rank of Captain, United States Navy,' Kelly said in a statement released on Monday. \n\n'There are few things as important as standing up for the rights of the very Americans who fought to defend our freedoms,' he continued. \n\nLast week, Hegseth sent a censure letter to Kelly to inform him of a pending review of his rank and pension - a 'necessary' step to punish the Democrat, the note states. \n\nIn November, Kelly and five other Democratic members of Congress made a video advocating for active US service members to disobey 'illegal' orders from the Trump administration, a move that earned the ire of Hegseth. \n\nSince he is retired and still receiving payment from the military, the Arizona senator is subject to the Uniform Code of Military Justice, Hegseth's letter claimed. \n\nThe letter from Hegseth also cheekily refers to Kelly as 'Captain (for now).'\n\n'Our laws are clear. You can refuse illegal orders,' Kelly and a handful of other Democratic lawmakers said in a video released in November. \n\nAll six of the Democrats in the video touted their own military or intelligence backgrounds, though they did not specify which illegal orders were given or if Trump or Hegseth were engaged in unlawful activity. \n\nTrump and Hegseth fumed at the time that the liberals' demands qualified as seditious behavior. \n\nThe president even suggested sedition can be punished by hanging. \n\n'SEDITIOUS BEHAVIOR, punishable by DEATH!' before reposting another them that stated, 'HANG THEM, GEORGE WASHINGTON WOULD!' \n\n'Pete Hegseth wants our longest-serving military veterans to live with the constant threat that they could be deprived of their rank and pay years or even decades after they leave the military just because he or another Secretary of Defense doesn’t like what they’ve said,' Kelly said Monday. \n\n'That’s not the way things work in the United States of America, and I won’t stand for it.'\n\nHegseth, Secretary of the Navy John Phelan, the Department of Defense and the Department of the Navy are listed as defendants, according to the suit. \n\nHegseth noted in November that the other five Democrats will not be investigated because they do not fall under the Pentagon's jurisdiction.\n\nThe others include Senator Elissa Slotkin of Michigan, an ex-CIA analyst who served multiple tours in Iraq; Representative Jason Crow of Colorado, a former Army Ranger; Representative Maggie Goodlander of New Hampshire, a former Navy reservist; and Representative Chrissy Houlahan of Pennsylvania, a former Air Force officer.\n\nKelly, who was vetted to be Kamala Harris' running mate in 2024, said last week he's thought about running for president in 2028.\n\n'Of course,' he told podcaster Aaron Parnas. 'I think every senator thinks about it at some point. It would be irresponsible not to think about it.","summary":"A Democratic senator who has been slammed for what the Trump administration calls 'seditious' behavior has filed a retaliatory federal lawsuit against Pentagon boss Pete Hegseth.","url":"https://www.dailymail.co.uk/news/article-15457251/mark-kelly-sues-pete-hegseth-seditious-video.html","image":"https://i.dailymail.co.uk/1s/2026/01/12/20/105453345-0-image-m-18_1768249039452.jpg","video":"https://video.dailymail.com/video/mol/2025/11/20/7242948230490899794/1024x576_MP4_7242948230490899794.mp4","publish_date":"2026-01-12 21:29:16","author":"Editor,Jon Michael Raasch","authors":["Editor","Jon Michael Raasch"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.243},{"id":392518818,"title":"Judge: Trump violated Fifth Amendment by ending energy grants in only blue states","text":"The Trump administration violated the Fifth Amendment when canceling billions of dollars in environmental grants for projects in “blue states” that didn’t vote for him in the last election, a judge ruled Monday.\n\nTrump’s blatant discrimination came on the same day as the government shut down last fall. In total, 315 grants were terminated in October, ending support for 223 projects worth approximately $7.5 billion, the Department of Energy confirmed. All the awardees, except for one, were based in states where Donald Trump lost the majority vote to Kamala Harris in 2024.\n\nOnly seven awardees sued, defending projects that helped states with “electric vehicle development, updating building energy codes, and addressing methane emissions.” They accused Trump officials of clearly discriminating against Democratic voters by pointing to their social media posts boasting about punishing blue states.\n\nOn X, the director of the Office of Management and Budget, Russell Vought, bragged that nearly “$8 billion in Green NewScam funding to fuel the Left’s climate agenda is being cancelled,” then listed only states that did not vote for Trump. Meanwhile on Truth Social, Trump confirmed he met with Vought to “determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut” during the shutdown.\n\nOn Monday, US District Judge Amit Mehta wrote in his opinion that the case was “unique” because ordinarily “the mere presence of political considerations in an agency action” does not mean that officials have run “afoul of the Fifth Amendment’s guarantee of equal protection.”","summary":"Donald Trump’s social media post triggers rare Fifth Amendment ruling.","url":"https://arstechnica.com/tech-policy/2026/01/judge-trump-violated-fifth-amendment-by-ending-energy-grants-in-only-blue-states/","image":"https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2254848310-1024x648.jpg","video":null,"publish_date":"2026-01-12 21:27:35","author":"Ashley Belanger","authors":["Ashley Belanger"],"language":"en","category":"politics","source_country":"US","sentiment":-0.765}]}