{"offset":0,"number":50,"available":401,"news":[{"id":302425972,"title":"Netanyahu gives Fetterman a fancy beeper","text":"Benjamin Netanyahu gifted a ‘silver-plated beeper’ to Senator John Fetterman during his visit to Israel this week. Israel ‘s Prime Minister presented Fetterman with the bizarre gift during an awkward exchange in his office in Jerusalem. In an apparent move to double down on his support for Israel, Fetterman presented Netanyahu with a framed article from a Philadelphia newspaper that memorialized the PM’s brother, an Israeli soldier who was killed in 1976 during an Israeli raid in Uganda.\n\nIn return, the Israeli leader offered Fetterman a gift of his own, jokingly asking: ‘What can I give a man who has everything? How about giving him a beeper?’ ‘This is a silver-plated beeper. The real beeper is, like, one-tenth the weight,’ Netanyahu said as he handed the pager to the laughing senator. ‘It’s nothing, but it changes history.’ The gift is an apparent reference to the Israel’s operation in Lebanon last September that saw the military detonate pagers that were used by members of Hezbollah. The explosive attack left 42 people dead and thousands injured.\n\nNetanyahu presented a golden pager to President Donald Trump in February when the pair met at the White House , but some have questioned why he would give this symbolic gift to a junior member of the senate . Fetterman, however, has repeatedly voiced his support for Israel, despite his Democratic Party being highly critical of the offensive in Gaza . Video of the exchange, posted online yesterday, shows how Fetterman laughed as Netanyahu presented him with the gift.\n\nHe appeared to admire the device before saying, ‘When that story broke, I was like, ‘Oh, I love it, I love it.’ And now, it’s like, thank you for this.’ ‘Thank you,’ he said again as he shook the prime minister’s hand. Fetterman on Tuesday doubled down his support for Israel after it shattered the tenuous ceasefire with Hamas by bombarding Gaza with air strikes. ‘Hamas does not want peace. I unapologetically, 100% stand with Israel, and demand the release of all remaining hostages,’ he tweeted, noting that he was ‘sending this from Israel’.\n\nBut his message and display of support for Netanyhu’s troops has prompted backlash from liberals who have branded him the ‘most despicable scum in Congress’. ‘I can’t believe this man once conned progressives into campaigning for him and defending him,’ one X user said of Fetterman. ‘Forget pro Israel, he’s pro Netanyahu, who just massacred over 100 kids to avoid going to court for his trial. Sick stuff.’ ‘This despicable ghoul is a US senator. What a joke!’ echoed another. ‘OMG. To be this cruel and this tacky all at the same time,’ one user penned. Another wrote: ‘Who doesn’t enjoy a gift from a criminal thug murderer?’\n\n‘Proud of their terrorism. Sickos of the highest degree,’ said another. One added: ‘Absolutely no way this is real… right???’ ‘Why is the senator from Pennsylvania hanging out in Israel? And who’s paying for it?’ another asked. Fetterman has broken with his party’s liberal wing several times, including maintaining his staunch support for Israel and supporting the Laken Riley Act focused on illegal immigrants.\n\nThe outspoken senator also made headlines earlier this month when he criticized his party’s response to Trump’s address to Congress . Democrats faced backlash for several stunts and protests during the address, including refusing to stand and clap for a young cancer survivor who was honored by Trump, while one congressman was even booted from the chamber for his antics. ‘I don’t think that was the best look for our party last night,’ Fetterman said when asked by Fox News for his reaction to how Democrats behaved during the speech.\n\nFetterman also took to X to share a more hostile take on his party’s performance, which be branded a ‘sad cavalcade of self owns and unhinged petulance.’ ‘It only makes Trump look more presidential and restrained,’ he said as he shared a Politico article that mocked Democrats who held up protest signs during the speech as ‘giving bingo.’ ‘We’re becoming the metaphorical car alarms that nobody pays attention to — and it may not be the winning message,’ Fetterman posted.\n\nDespite suffering health issues during his run for the senate in 2022, including having a stroke that impaired his speech , and his apparent break from his party, Fetterman has been floated by some as a potential Democratic presidential candidate in 2028. Fetterman was floated as a potential candidate as Democrats begin their search for a standard bearer to lead them into the 2028 election, following Kamala Harris’ resounding defeat in November. Comedian Bill Maher even called for him to run , saying ‘Democrats need to find their Trump.’\n\nFetterman was previously asked about his White House ambitions in December 2023, to which he told Politico that he was ‘not thinking about 2028’. Despite losing in a landslide to Trump, Harris surprisingly topped a post-election poll among Democrats, where she led the field with 41 per cent of the vote, according to a Puck News/Echelon Insights survey. The rest of the pack combined – 13 Democratic politicians who all scored in the single digits – garnered 43 per cent, with 16 per cent of those surveyed saying they were ‘unsure’ to the question of who they would vote for if a party primary were held now.\n\nWant more stories like this from the Daily Mail? Visit our profile page and hit the follow button above for more of the news you need.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBenjamin Netanyahu gifted a &#8216;silver-plated beeper&#8217; to Senator John Fetterman during his&#8230;\n\n\nThis Post: Netanyahu gives Fetterman a fancy beeper first appeared on Internewscast Journal","url":"https://internewscast.com/news/asia/netanyahu-gives-fetterman-a-fancy-beeper/","image":"https://i.dailymail.co.uk/1s/2025/03/20/20/96397549-0-Benjamin_Netanyahu_gifted_a_silver_plated_beeper_to_Senator_John-a-65_1742501251023.jpg","video":null,"publish_date":"2025-03-20 23:54:50","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.228},{"id":302411168,"title":"Walz celebrated Tesla stock downfall — Minnesota owns over a million shares","text":"Minnesotans’ retirement funds are not getting a boost as the Tesla stock price has dropped by over 50% since December, since the state holds well over 1 million shares according to the latest records.\n\nIn June 2024, the Minnesota State Board of Investments released a report showing the state held 1.6 million shares of Tesla stock in its retirement fund. Minnesota also held over 211,000 shares of Tesla in its non-retirement fund, records show.\n\nVenture capitalist Kevin O’Leary, known for starring on Shark Tank, raised concerns that Walz’s anti-Tesla rhetoric undermines Minnesota’s pension plan.\n\n“That poor guy didn’t check his portfolio and his own pension plan for the state. It’s beyond stupid what he did,” O’Leary said during a CNN panel this week. “What’s the matter with that guy? He doesn’t check the well-being of his own constituents.”\n\nWalz experienced a bruising loss as former Vice President Kamala Harris’s running mate during the presidential election last year. However, the governor has reentered the spotlight in recent weeks through a round of high-profile interviews and town halls, reviving speculation that he could be a potential contender for the 2028 presidential election — something he has refused to rule out.\n\nWalz’s comments about Tesla come as pension fund managers in states like Illinois have warned that the electric vehicle company’s stock decline could impact retirement funds in states holding shares.\n\n“This is a real cost to real people,” Illinois State Treasurer Michael Frerichs told ABC News. “We’re talking about firefighters, police officers, nurses who work in public. Their retirement dollars are at stake.”\n\nIn New York, Democrats are pushing the state’s pension fund to divest from Tesla, citing volatile stock prices.\n\nTwenty-three state senators sent a letter last week to New York Comptroller Thomas DiNapoli, pressuring him to divest from 3.5 million Tesla shares owned by the state’s pension fund. \n\n“New York’s pension fund is one of the best-managed in the nation, and we must ensure that it remains financially sound for the more than one million retirees and beneficiaries who depend on it,” Democratic state Senator Patricia Fahy said in a press release. “Given Tesla’s ongoing volatility and significant profit decline, we should seriously evaluate the risks of continued investment and its impact on the pension fund’s stability. Beginning to responsibly divest from Tesla is a prudent step to protect the long-term stability of the fund and ensure that we are making responsible financial decisions on behalf of New York’s public employees and retirees and financial future.”\n\nVanguard and BlackRock, both carrying heavy weight in the U.S. retirement market, could also stand to lose should Tesla experience continued losses. \n\nTIM WALZ BECOMES DEMOCRATIC LEADERS’ BIGGEST CRITIC TO REMAKE HIMSELF\n\nVanguard Group is Tesla’s second-largest shareholder, behind Musk, owning over 240 million shares. The company’s Target Retirement Funds are used by more people, over 15 million, than any other.\n\nOver half of the $11.6 trillion in assets BlackRock manages fall under retirement products. The company holds over 200 million shares of Tesla stock.","summary":"While Gov. Tim Walz (D-MN)&#160;celebrated after Tesla’s stock tumbled, his constituents could see financial losses if Elon Musk’s electric vehicle company experiences a serious downturn.&#160; Walz told a crowd on Tuesday that he enjoyed checking to see how Tesla&#8217;s stock is doing because seeing the stock fall gives him “a little boost during the day.” [&#8230;]","url":"https://www.washingtonexaminer.com/policy/technology/3354704/tim-walz-tesla-stock-price-minnesota-owns-ov-shares/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Tim-Walz-4.webp","video":null,"publish_date":"2025-03-20 22:58:05","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","category":"business","source_country":"us","sentiment":-0.11},{"id":302416114,"title":"Al Franken Reprises Real-Life Role as U.S. Senator in “The Residence ”7 Years“ ”After Resigning amid Scandal (Exclusive)","text":"Al Franken is reprising one of his most important roles.\n\n In Netflix's latest whodunit, The Residence, the former politician, 73, plays a fictional senator named Aaron Filkins.\n\n The murder mystery series, which premiered on March 20, stars Uzo Aduba as Detective Cordelia Cupp, who launches an investigation after a dead body turns up in The White House. The Shondaland production follows the search for a killer in a house of 132 rooms filled with 157 suspects after “a disastrous State dinner.”\n\n While speaking exclusively with PEOPLE at the show's world premiere, Franken opened up about how his role in the series came to be. \"I did not audition. It just came to me,\" he explains. \"They asked me to do it and I went, 'I haven't done this in a while. I hope I can do it!'\"\n\n Despite having doubts, when the Saturday Night Live alum read the script, he knew how \"great\" it was. \"I wasn't sure that I would great in it, but I wanted to do it,\" he says.\n\n Franken quickly got back into the groove. In fact, he found himself giving pointers to his costars on how politicians conduct themselves in real life.\n\n \"There's a big difference. I had to tell everyone around me how to act,\" he recalls. \"You're thinking of a different kind of performance art when you're in the Senate than when you're actually acting.\"\n\n Franken also drew from his own experiences when he learned that his character was described as \"avuncular.\"\n\n \"That made me think of some of my former colleagues,\" he said. \"Chuck Grassley is avuncular. Lindsey Graham can be avuncular. Lamar Alexander from Tennessee was avuncular.\"\n\n To fully get into the role, he adds, \"I got a different pair of glasses and I [parted] my hair on a different side and I was a whole new different person.\"\n\n Franken was elected to the Senate as a Democrat from Minnesota in 2008 and served from 2009 until he stepped down in 2018 following sexual misconduct allegations by multiple women. The Senate Ethics Committee launched an investigation into the second-term senator when multiple women came forward.\n\n One woman, a former Democratic congressional aide, alleged that Franken tried to forcibly kiss her after a taping of his radio show in 2006. Franken, who has been married to wife Franni Bryson since 1975, has repeatedly apologized for his inappropriate behavior, which he said was unintentional but “crossed a line” for some women.\n\n Morning news anchor at KABC radio in Los Angeles Leeann Tweeden alleged that Franken groped and forcibly kissed her during a USO tour in 2006. She also released a photo of Franken apparently grabbing her breasts while she was sleeping. She later said she accepted Franken’s subsequent apology and didn’t think he had to step down.\n\n When Franken gave an emotional resignation speech from the Senate floor, he said, “Some of the allegations against me are simply not true. Others I remember very differently.”\n\n At least eight Democratic senators called for his resignation, including Sens. Kirsten Gillibrand of New York, Claire McCaskill of Missouri, Patty Murray of Washington, Maggie Hassan of New Hampshire, Kamala Harris of California, Tammy Baldwin of Wisconsin, Mazie Hirono of Hawaii and Debbie Stabenow of Michigan. And at least three male Democratic senators called for him to step down, including Sherrod Brown of Ohio, Joe Donnelly of Indiana and Bob Casey of Pennsylvania.\n\n \"This decision is not about me. It’s about the people of Minnesota,\" Franken said during his resignation speech. \"It’s become clear that I can’t both pursue the Ethics Committee process and at the same time remain an effective senator for them. Let me be clear: I may be resigning my seat but I am not giving up my voice.”\n\n Three years later, Franken said he was keeping his options \"open\" about running for office again. \"It was a very weird, tough situation at that moment,\" Franken said of his resignation, per The Hill. \"I love the Senate. I love the work that I did.\"\n\n Franken, who was a writer and features player at Saturday Night Live throughout the years from 1975-1995, most recently appeared at the SNL 50th anniversary event in February and the Peacock documentary SNL50: Beyond Saturday Night.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n The Residence is available to stream on Netflix.","summary":"\"They asked me to do it and I went, 'I haven't done this in a while. I hope I can do it!'\" Franken tells PEOPLE of playing a senator in Netflix's new murder mystery","url":"https://people.com/al-franken-talks-reprising-real-life-us-senator-role-netflix-the-residence-after-scandal-exclusive-11700694","image":"https://people.com/thmb/UNg3ISikmvrlt7iUwiw-7Mtqesc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(664x419:666x421)/Al-Franken-032025-2-371053e97e1c46c7871f0960f1ce4440.jpg","video":null,"publish_date":"2025-03-20 22:34:29","author":"Abby Stern,Esther Kang","authors":["Abby Stern","Esther Kang"],"language":"en","source_country":"US","sentiment":0.045},{"id":302411084,"title":"JD Vance takes shot at Harris as he jokes that drinking led to her 'word salads'","text":"Vice President JD Vance took a shot at former Vice President Kamala Harris, suggesting her alcohol habits were responsible for her \"word salads.\" Vance’s remarks came as he described the difference between how he and Harris have handled the role as vice president, and he speculated about the relationship dynamic between Harris and former President Joe Biden. \"Well, I don’t have four shots of vodka before every meeting,\" Vance said in an interview with radio host and Daily Caller editor Vince Coglianese in an interview that aired Thursday. \"That’s one way I think that Kamala really tried to bring herself into the role, is these word salads. I think I would need the help of a lot of alcohol to answer a question the way that Kamala Harris answered questions.\" Vance then shared his suspicions that Harris and Biden didn't have the same level of trust he and President Donald Trump share, noting his opinion was based on \"guesswork\" since he doesn’t speak to either Biden or Harris frequently. VANCE KNOCKS GLOBALIZATION'S ‘CHEAP LABOR’ AND LAUDS 'AMERICA'S GREAT INDUSTRIAL COMEBACK' AT AI SUMMIT \"My sense is that there wasn’t a level of trust between Biden and Harris,\" Vance said. \"She was just less empowered to do her job. Luckily, I’m in a situation where the president trusts me, where if he asks me to do something, he believes it’s going to happen. … I feel empowered in a way that I think a lot of vice presidents haven’t been, but that’s all in the service of accomplishing the president’s vision.\" Harris routinely faced scrutiny for comments in which she jumbled words, including when she said, \"I grew up understanding the children of the community are the children of the community\" in September 2024. KAMALA HARRIS SHREDDED FOR WORD SALAD REPEATING PHRASE ‘CHILDREN OF THE COMMUNITY’ Harris, who previously served as a senator from California, is now a speaker with CAA Speakers, which represents high-profile celebrities. CAA did not immediately respond to a request for comment from Fox News Digital. A spokesperson for Vance confirmed the vice president made the remarks on the podcast but did not provide additional comment to Fox News Digital. Coglianese did not immediately respond to a request for comment from Fox News Digital. Meanwhile, Vance also poked fun at himself in the interview Thursday. Vance, who has become the source of thousands of memes circulating the internet after the heated Oval Office meeting between Trump and Ukrainian President Volodymyr Zelenskyy in February, said he finds the memes entertaining. In particular, he said he enjoys one based off Leonardo DiCaprio pointing at the television from the 2019 film \"Once Upon a Time in Hollywood,\" and another swapping his face with members of the band Van Halen. CLICK TO GET THE FOX NEWS APP \"I’m a personal fan of Vance Halen, but that’s because I really like the band Van Halen,\" Vance said. \"So that’s just my personal preferences. I don’t know how it happened or where it came from, but it’s been very, very funny to watch your own face become this meme. It’s made the job a lot more fun, so I encourage people to keep doing it.\" Fox News Digital's Alexander Hall contributed to this report.","summary":"Vice President JD Vance took a shot at former Vice President Kamala Harris and her &quot;word salads&quot; in a new interview.","url":"https://www.foxnews.com/politics/jd-vance-takes-shot-harris-he-jokes-drinking-led-her-word-salads","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/diagonal-split-reverse.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-20 22:25:31","author":"Diana Stancy","authors":["Diana Stancy"],"language":"en","source_country":"us","sentiment":-0.01},{"id":302406544,"title":"Edgar Bronfman Jr. gets subpoena in legal battle to block Skydance-Paramount merger: sources","text":"New York City’s pension funds have issued a subpoena for billionaire media mogul Edgar Bronfman Jr. to testify in their lawsuit to block the Skydance-Paramount merger, according to two sources close to the situation.\n\nThe pensions hope the former Warner Music CEO and current FuboTV executive chairman can shed light on whether Project Rise Partners has submitted a legitimate bid to challenge Skydance’s $8 billion deal to merge with Paramount, a source with direct knowledge of the case said.\n\nDaphna Ziman is leading the Project Rise bid, which it values at $8.8 billion not including the assumption of nearly $5 billion in debt. Bronfman has a stake in Ziman’s Cinemoi, a bankrupt cable network focused on fashion and film, according to Skydance.\n\nThe pensions — representing public service workers and overseen by NYC mayoral candidate Brad Lander — sent the subpoena to the 69-year-old Bronfman this week. He will be ordered by the Delaware Chancery Court, which has been handling the case, to answer questions in the next week or so, sources said.\n\n“They want to know if PRP’s financing is legit,” a source said.\n\nIn a letter filed in court earlier this month, Skydance called out Project Rise for allegedly attempting to derail the merger, claiming it has uncovered proof of “fraud” and “misrepresentation” in the competing offer.\n\nSkydance also raised the possibility that Bronfman, who made his own late attempt to buy Paramount only to withdraw it in August, could be behind Project Rise’s bid. If so, the Paramount board already considered his offer and does not need to again, they argued.\n\n“That Mr. Bronfman and/or the ‘Bronfman Group’ have personal and economic relationships withPRP’s principal (Ms. Ziman) and syndicate member (Mr. Gross) suggests PRP’s fraudulentbidding may be motivated in part by Mr. Bronfman’s prior failed bid and, at the very least,commands further investigation.”\n\nZiman and Bronfman declined to comment.\n\nInitially, the NYC pensions were asking the court for a restraining order to block the merger. They have since withdrawn that request, but are considering refiling for an injunction if Bronfman verifies that Project Rise’s bid was legitimate, a source said.\n\nIf Bronfman fails to give evidence that PRP has adequate financing in place, the pensions will likely wait to see if the long-stalled merger with David Ellison’s Skydance finally goes through — and then sue the newly-formed company for allegedly underpaying investors other than controlling shareholder Shari Redstone, the source said.\n\nThe FCC has held up signing off on the Paramount merger while the agency investigates allegations of biased editing of an interview with Democratic presidential candidate Kamala Harris by CBS’ “60 Minutes” ahead of the November election.","summary":"New York City’s pension funds have issued a subpoena for billionaire media mogul Edgar Bronfman Jr. to testify in their lawsuit to block the Skydance-Paramount merger, according to two sources close to the situation.","url":"https://nypost.com/2025/03/20/media/edgar-bronfman-jr-gets-subpoena-in-legal-battle-to-block-skydance-paramount-merger-sources/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100734069.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-20 22:07:47","author":"Josh Kosman","authors":["Josh Kosman"],"language":"en","source_country":"zm","sentiment":-0.296},{"id":302402446,"title":"Democrats celebrate Tesla’s struggles, ignore SpaceX triumph: Letter to the Editor","text":"While Americans were watching the stranded astronauts being safely brought home, including Sunita Williams (“The woman who fell to Earth was born in Euclid,” March 20), and marveling at the technical abilities of Elon Musk’s SpaceX, leftists emboldened by hateful rhetoric from Democrats were vandalizing Musk’s privately owned Tesla dealerships and U.S. Sen. Mike Kelly, who happens to have been a former astronaut, was calling Musk names.\n\nOn top of which, Tim Walz, the governor of Minnesota, who was Kamala Harris’ running mate last year, used a speech to gloat over Tesla’s falling stock price. Obviously, Walz and Musk’s other Democratic critics could care less about the thousands of workers that Tesla employs as well as the millions whose 401(k)s include Tesla stock. And they wonder why they got trounced in the last election.\n\nHarry Caito","summary":"Obviously, Tim Walz and Elon Musk’s other Democratic critics could care less about the thousands of workers that Tesla employs as well as the millions whose 401(k)s include Tesla stock. And the Democrats wonder why they got trounced in the last election, writes Harry Caito of Westlake in a letter to the editor.","url":"https://www.cleveland.com/letters/2025/03/democrats-celebrate-teslas-struggles-ignore-spacex-triumph.html","image":"https://www.cleveland.com/resizer/v2/VRXT2ZYD55GFROUETN2RPDL2ZE.jpg?auth=047ad5776449a1f8e5b2bb7e96d741a161a2d18d8748dd394b37cbb74680d9ab&width=1280&quality=90","video":null,"publish_date":"2025-03-20 21:54:46","author":"Other Voices","authors":["Other Voices"],"language":"en","source_country":"US","sentiment":-0.633},{"id":302398794,"title":"First Democrat Senator to Turn Against Biden Questions Schumer's Leadership","text":"Democratic Senator Michael Bennet was among the first to ring alarm bells about former President Joe Biden's chances to win reelection. Now, he is publicly hinting towards a change in leadership within his party, including with Senate Minority Leader Chuck Schumer.Newsweek reached out to Bennet's and Schumer's offices for comment via email.Why It MattersOn July 9, Bennet said during a CNN interview that he felt like Biden would lose the November election to Trump in a \"landslide.\" He was the first Democrat senator to raise concerns about Biden's ability to win the election after the June debate.While the Colorado senator did not call for Biden to step out of the race at that time, he warned about the ex-president's poor debate performance against Trump and Democrats not responding well enough to Americans' concerns.What to KnowSchumer, 74, has been in the Senate since 1999 and has either been majority or minority leader since 2016, depending on whether his party holds the presidency or not.The lawmaker from New York has been scrutinized by various members and factions of his own party in recent days. He's viewed by some as capitulating to Republicans after he voted in favor of passing a six-month spending bill to keep the government running.While Schumer has become a source of ire, he's maintained that his working with Republicans was the correct decision.\"I knew it was a difficult choice, and I knew that I would get a lot of criticism for my choice,\" Schumer said Tuesday on ABC's The View. \"But I felt as a leader, I had to do it.\"He reiterated the confidence in his decision on CBS Mornings, saying \"I assure the public, a shutdown would have been the greatest disaster. We would have had half the federal government we have now.\"On Wednesday, Bennet was asked during a town hall in Golden, Colorado, if Schumer should step aside.\"I do think on the leadership question, it's always better to examine whether folks are in the right place, and we're certainly going to have that conversation,\" Bennet said, according to NPR.Bennet said that it remains imperative for Democrats to show that they have Americans' backs, and that the general populace knows who and what they are fighting for. The spending bill extension did not show that fight, he added.\"Let me just say it's important for people to know when it's time to go,\" the senator said when asked about Schumer keeping his leadership position. \"We're going to have conversations, I'm sure, in the foreseeable future, about all the Democratic leadership.\"Bennet hasn't been the only Democrat to speak candidly about changing up the people who are leading the Democratic Party.Others have included New York Representative Alexandra Ocasio-Cortez, who has been urged by some to primary Schumer due to her popularity within the party.In a CNN poll released on Sunday, respondents said that Ocasio-Cortez best embodies the party's \"core values.\" That was higher than 2024 Democratic presidential candidate Kamala Harris and California Governor Gavin Newsom.\"There are members of Congress who have won Trump-held districts in some of the most difficult territories in the United States, who walked the plank and took innumerable risks in order to defend the American people ... just to see some Senate Democrats even consider acquiescing to Elon Musk, I think it is a huge slap in the face and I think that there's a wide sense of betrayal,\" Ocasio-Cortez said last week on CNN.Representative Glenn Ivey said on Tuesday that it \"may be time for Senate Democrats to get a new leader.\" \"What People Are SayingEx-White House Press Secretary and MSNBC host Jen Psaki: \"Schumer backed down from a government shutdown threat and helped Republicans pass their funding bill last week. His argument was that a shutdown would have made it harder to resist Donald Trump's takeover of the government. But in the process, he gave up all Democrats' leverage. Republican leaders, including Trump, didn't have to pay any price. Trump even thanked Schumer for 'doing the right thing.'\"Patricia Crouse, a political scientist in residence at the University of New Haven, told Newsweek: \"Each day, Trump issues a new executive order with very little push back from Democrats. Many Democrats believed that voting against the CR [continuing resolution] in the Senate was finally a chance for the Democrats to take a stand against Trump and Republicans in Congress, and that didn't happen. I believe Democrats are genuinely disappointed in leadership and would like to see change. Whether that happens or not is another matter entirely.\"What Happens NextSchumer could step down as leader but has vowed to remain in the position, citing himself as the right person in this moment. In 2028, when running for a sixth term, he could face a primary challenge from Ocasio-Cortez or others.Democrats set their own rules for picking their leaders in the Senate and Schumer could be removed if a majority of Democrats want him out of the leadership position. First, 20 percent of members would need to submit a written request to call an unscheduled meeting and then hold a vote to elect a new leader.","summary":"\"It's important for people to know when it's time to go,\" Senator Michael Bennet said about the Democrats' leader in the Senate.","url":"https://www.newsweek.com/schumer-bennet-democrats-biden-leadership-2048183","image":"https://d.newsweek.com/en/full/2611612/bennet.jpg","video":null,"publish_date":"2025-03-20 21:47:45","author":"Nick Mordowanec","authors":["Nick Mordowanec"],"language":"en","category":"politics","source_country":"US","sentiment":0.153},{"id":302405388,"title":"Trump signs executive order to ‘eliminate’ US education department","text":"Flanked by pupils and teachers, US President Donald Trump on Thursday signed an executive order intended to essentially dismantle the federal Department of Education, making good on a long-standing campaign promise to conservatives.\nThe order would leave school policy almost entirely in the hands of states and local boards, a prospect that alarms liberal education advocates.\nThe order will “begin to eliminate” the department, Trump said at a signing ceremony in the East Room of the White House. Closing the department completely requires an act of Congress, and Trump lacks the votes for that.\n“We’re going to be returning education, very simply, back to the states where it belongs,” Trump said.\nThe order follows the department’s announcement last week that it would lay off nearly half of its staff. It is the latest step by Trump, who has been in office some two months, to reshape the US government and upend the federal bureaucracy.\nEducation has long been a political lighting rod in the United States, with conservatives favouring school choice policies that help private schools and left-leaning voters largely supporting programmes and funding for public schools.\nFights about US education accelerated during the coronavirus pandemic, a divide Trump tapped into as a presidential candidate.\nTrump has said he wants Education Secretary Linda McMahon, who attended the White House event, to put herself out of a job. His executive order seeks to whittle the department down to basic functions such as administering student loans, Pell Grants and resources for children with special needs.\n\n“We’re going to shut it down and shut it down as quickly as possible,” Trump said. “It’s doing us no good.”\nThough Republicans control both chambers of Congress, Democratic support would be required to achieve the needed 60 votes in the Senate for such a bill to pass.\nAt the event, Trump suggested the matter may ultimately land before Congress in a vote to do away with the department entirely.\nHe was joined at the ceremony by Republican governors including Greg Abbott of Texas and Ron DeSantis of Florida. Trump also credited the conservative advocacy group Moms for Liberty.\nThe education department oversees some 100,000 public and 34,000 private schools in the US, although more than 85 per cent of public school funding comes from state and local governments. It provides federal grants for needy schools and programmes, including money to pay teachers of children with special needs, fund arts programmes and replace outdated infrastructure.\nIt also oversees the US$1.6 trillion in student loans held by tens of millions of Americans who cannot afford to pay for university outright.\nAhead of the ceremony, White House spokeswoman Karoline Leavitt cited disappointing literacy levels and testing scores among American children as justification for scaling back the department, which was founded in the 1970s.\n\nTrump has acknowledged that he would need buy-in from lawmakers and teachers’ unions to fulfil his campaign pledge of fully closing the department. He does not have it.\n“See you in court,” the head of the American Federation of Teachers union, Randi Weingarten, said in a statement.\nUS Senator Patty Murray, a Democrat, said in a statement: “Donald Trump knows perfectly well he can’t abolish the Department of Education without Congress – but he understands that if you fire all the staff and smash it to pieces, you might get a similar, devastating result.”\nTrump has also delivered broadsides against higher education in the United States by reducing funding and taking on diversity, equity and inclusion policies at colleges and universities, just as he has in the federal government.\nColumbia University faced a Thursday deadline to respond to demands to tighten restrictions on campus protests as preconditions for opening talks on restoring US$400 million in suspended federal funding.\n\nMost of the American public do not support closing the federal education department.\nA Reuters/Ipsos poll found last month that respondents opposed shuttering the Department of Education by roughly two to one – 65 per cent to 30 per cent. The Reuters/Ipsos poll, which was conducted online and nationwide, surveyed 4,145 US adults and its results had a margin of error of about 2 percentage points.\nFederal aid accounts for 15 per cent of all K-12 revenue in states that voted for Trump in the 2024 election, compared with 11 per cent of revenue in states that voted for his Democratic rival Kamala Harris, according to a Reuters analysis of Census Bureau data.\nTwo programmes administered by the Department of Education – aid for low-income schools and pupils with special needs – are the largest of those federal aid programmes.\nRepublicans have shown little appetite in the past for overhauling the Title I programme for low-income schools, which plays the biggest role, on a per capita basis, in conservative states such as Alaska, Mississippi, Louisiana and Wyoming, according to census figures.\nA proposal to allow that money to be used by private schools and home schools failed in the House of Representatives by 83-331 in March 2023, with more than half of the chamber’s Republicans voting against it.","summary":"Order would leave school policy almost entirely in the hands of states and local boards, a prospect that alarms liberal education advocates.","url":"https://www.scmp.com/news/world/united-states-canada/article/3303232/trump-signs-order-aimed-closing-us-education-department","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/21/86750f45-04c1-4ce8-94b8-0c0110645cfa_8927351c.jpg","video":null,"publish_date":"2025-03-20 21:34:36","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.059},{"id":302415472,"title":"Even more Democrats are saying Schumer’s time is up","text":"Four major groups focused on organizing young progressives are offering Senate Minority Leader Chuck Schumer two options: fight President Donald Trump or resign from leadership. \n\nThe letter, which demands that Schumer “obstruct the MAGA agenda with every tool you have,” was signed by College Democrats of America, the Sunrise Movement, United We Dream Action, and Voters of Tomorrow.\n\n“Chuck Schumer, your leadership is failing to meet the moment. Your decision—along with nine other Senate Democrats—to cave and support the MAGA budget bill is just the latest example of how you and other Democratic leaders are driving young people away from the Democratic Party,” the groups wrote in a joint letter, first shared with Politico on Thursday. “Instead of taking a stand against Trump’s illegal actions to gut our healthcare, dismantle public education, attack immigrants and trans people, and tear up climate action, you supported a budget that gave tax cuts to Donald Trump, Elon Musk, and their billionaire buddies. You sided against us.”\n\nThe momentum behind the letter suggests progressives are not letting up on Schumer after he betrayed his party and encouraged Senate Democrats to vote for cloture last week, ending a filibuster of a partisan funding bill that further strengthens Trump’s power over spending decisions.\n\nOn Wednesday, Rep. Glenn Ivey of Maryland became the first Democrat in Congress to suggest that Schumer should call it quits as minority leader. Rep. Delia Ramirez of Illinois, another Democrat, soon called for Schumer’s resignation from his leadership position. \n\n“This is a moment for Democrats to do more than just talk about fighting or obstructing Donald Trump’s agenda of destroying Social Security and Medicaid, but actually using every legislative authority to do that,” Ramirez told Politico.\n\nNotably, it’s not just House members losing confidence in Schumer. Members of the Senate Democratic Caucus are also starting to doubt his leadership. \n\nDuring a town hall in his home state of Colorado, Democratic Sen. Michael Bennet issued a not-so-subtle dig at Schumer, suggesting it’s important “to know when it’s time to go.”\n\n“I do think on the leadership question, it’s always better to examine whether folks are in the right place, and we're certainly going to have that conversation,” he said. \n\nAnd while Democratic Sen. Elizabeth Warren of Massachusetts also didn’t explicitly call for Schumer to step down from leadership, she did say earlier this week that Schumer was “wrong” for his vote.\n\nVoters, especially younger ones, are also losing faith in Schumer. A series of polls released over the past few days show that Schumer’s overall approval has slipped, with fewer Democrats now viewing him favorably. \n\nFor example, Civiqs found Schumer’s favorability rating underwater. As of Thursday, only 27% of registered voters have a positive view of him, while 58% view him unfavorably. Among Democrats, his favorability rating dipped from 69% in early December to 60% now.\n\nYounger Democrats are particularly critical, according to Civiqs. Among those ages 18 to 34, just 41% view Schumer favorably, while 28% hold an unfavorable view. Older Democrats, meanwhile, are more supportive of him: 70% of Democrats ages 50 to 64 and 77% of those 65 and older view him positively.\n\n“Gen Z voters want leaders with a backbone who will stand up to billionaires and fight for working people,” the four progressive groups’ letter to Schumer read. “But it’s not just us. You have lost the trust of millions of voters and many of your colleagues in Congress.”\n\nIt also warned that if Democrats continue down their current path, they risk losing the support of “even more young and working-class voters.” And evidence of that is already showing.\n\nYoung voters preferred Vice President Kamala Harris to Trump in 2024, according to exit polls, which are not perfect. However, Harris received only 54% of the vote to Trump’s 43% among voters ages 18 to 24. Typically, Democratic presidential candidates receive at least 60% of the vote from this group, according to NPR.\n\nEven if Schumer insists he’s not going anywhere, calling himself the “best leader for the Senate,” it’s clear that the party—out of power, bereft of a single leader, and struggling to find a cohesive response to Trump and Republicans—is in need of a new direction.\n\nAfter all, polls show that the party is widely unpopular, and in a year that should be crucial for Democrats, it doesn’t seem like there’s widespread confidence that Schumer is the sort of inspirational leader capable of guiding the party out of the wilderness.","summary":"Four major groups focused on organizing young progressives are offering Senate Minority Leader Chuck Schumer two options: fight President Donald Trump or resign from leadership. \n\n\n\nThe letter, which demands that Schumer “obstruct the MAGA agenda with every tool you have,” was signed by College Democrats of America, the Sunrise Movement, United We Dream Action, and Voters of Tomorrow.\n\n\n\n“Chuck Schumer, your leadership is failing to meet the moment. Your decision—along with nine other Senate Democrats—to cave and support the MAGA budget bill is just the latest example of how you and other Democratic leaders are driving young people away from the Democratic Party,” the groups wrote in a joint letter, first shared with Politico on Thursday. “Instead of taking a stand against Trump’s illegal actions to gut our healthcare, dismantle public education, attack immigrants and trans people, and tear up climate action, you supported a budget that gave tax cuts to Donald Trump, Elon Musk, and their billionaire buddies. ","url":"https://www.dailykos.com/story/2025/3/20/2311511/-Even-more-Democrats-are-saying-Schumer-s-time-is-up?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1411063/story_image/AP25070722260093.jpg?1742502449","video":null,"publish_date":"2025-03-20 21:00:09","author":"Alex Samuels","authors":["Alex Samuels"],"language":"en","category":"politics","source_country":"US","sentiment":0.083},{"id":302411820,"title":"Trump Destroys Education Department in Terrifying Sign for Future","text":"The Democratic National Committee announced Wednesday that it will put up billboards in Republican districts in Arizona, Colorado, Florida, Iowa, Michigan, Missouri, Nebraska, and Pennsylvania telling local residents to push their members of Congress to hold town halls. The billboards will even include these Republicans’ phone numbers. \n\n“Republicans are refusing to meet with their constituents after voting to take away health care and make it harder for families to put food on the table,” the new chair of the DNC, Ken Martin, said in a statement. “This isn’t surprising—over the last few months, one word has come to describe Republicans: cowards.” \n\nMinnesota Governor Tim Walz, who was Kamala Harris’s running mate in 2024, is also holding events in Republican districts, visiting Eau Claire, Wisconsin, in Van Orden’s district on Tuesday for a “People v. Musk” rally following earlier visits to Iowa and Nebraska. Senator Bernie Sanders has held several rallies in Republican territory, and he and Representative Alexandria Ocasio-Cortez plan to visit Nevada, Arizona, and Colorado later this week.","summary":"Donald Trump has killed the Education Department.\n\nVia executive order, the president stripped apart the centralized authority overseeing the American educational system on Thursday, marking the end of a 45-year-old institution.\n\n“Today we take a very historic action that was 45 years in the making,” Trump said, marking the department’s elimination. “Everybody knows it’s right. The Democrats know it’s right, and I hope they’re going to vote for it because ultimately it may come before them.”\n\nTrump then announced who he said he hoped would be the agency’s last leader, Education Secretary Linda McMahon.\n\n“It’s about time; everybody’s saying it,” Trump said.\n\nPell grants and Title I funding for low-income students, as well as resources for disabilities and special needs would be “fully preserved,” according to Trump, though the responsibility would be redistributed to “various other agencies and departments that will take very good care of them, and that’s very important to Linda, I know, and very important to ","url":"https://newrepublic.com/post/192425/donald-trump-education-department-project-2025","image":"https://images.newrepublic.com/f43181a36f519441a337ab990361d6aca097c478.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-03-20 20:31:31","author":"District Judge Ellen,Ellie Quinlan Houghtaling","authors":["District Judge Ellen","Ellie Quinlan Houghtaling"],"language":"en","category":"politics","source_country":"lr","sentiment":-0.034},{"id":302378644,"title":"Kelsey Piper: A Reasonable Approach to AI","text":"In February 2025, Vice President J.D. Vance delivered a keynote speech at the AI Action Summit in Paris. He advocated for \"AI opportunity\" rather than \"AI safety,\" promoting a deregulatory vision for AI that emphasized U.S. leadership and free speech while criticizing Europe's \"excessive\" regulations like the Digital Markets Act. In contrast, then-Vice President Kamala Harris, speaking at the AI Safety Summit in London in November 2023, advocated for pretty much the exact opposite. Where Harris sought guardrails, Vance's speech marked a sharp pivot toward deregulation and unilateral dominance, highlighting a stark shift in U.S. policy under the Trump administration. So what does this all mean politically, culturally, and for everyday humans? Will AI take our computer jobs?","summary":"Vox's Kelsey Piper joins the show to discuss the drastic differences between the Biden and Trump administrations on AI—and what it all means for the future of humanity.","url":"https://reason.com/podcast/2025/03/20/kelsey-piper-a-reasonable-approach-to-ai/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/03/Kelsey1-copy.png","video":null,"publish_date":"2025-03-20 20:04:00","author":"Zach Weissmueller","authors":["Zach Weissmueller"],"language":"en","source_country":"us","sentiment":0.513},{"id":302425288,"title":"Tim Walz Talks Tough About Conservatives & His Critics: 'I Could Kick Most of Their Ass'","text":"Gov. Tim Walz (D-MN) is sick of hearing attacks on his masculinity from the MAGA movement, boasting that he could “kick most of their ass.”\n\nWalz’s seething outburst occurred during an episode of California Gov. Gavin Newsom’s podcast released this week.\n\n“And not that I spend much time thinking about this, and it just baffled me how much time they spent trying to attack me that I wasn’t, like, masculine enough in their vision,” Walz said of his losing campaign as former Vice President Kamala Harris’s running mate in 2024.\n\n“I saw Fox News did a couple of days because I used a straw — and I’m like, ‘Hell, man, what am I — how else do you drink a milkshake?’ type of thing. But they focused on it obsessively,” he claimed, asserting that this “obsession” and “weirdness” is on his critics.\n\n“We buy their frame on these issues of sexuality… but their whole thing was that they spent all their time, these guys, on Fox News, that Walz is gay, he’s not masculine, you know, he doesn’t coach football the way he should. What do you think about this?” he continued.\n\n“I figured it out that the identity piece of this is more important than the actual substance behind it,” Walz said during the conversation before Newsom jumped in.\n\n“Well, they’ve been doing it for decades. I mean, we’ve saw the welfare queens. They’ve seen the southern strategy. We’ve seen it over and over. It’s an old playbook, and we’re as dumb as we want to be that we allow them to do this with CRT and ESG, DEI, and every three letter word… And they weaponize grievance… They talk down to people… they humiliate people. They weaponize difficult issues,” Newsom continued, concluding that the left must stop reacting and get off of defense.\n\n“Gotta go on the offense. We got to meet people where they are. But I also think this — and this is where, you know, this is part of the conversation I’m trying to have is. You got to respect people you disagree with,” Newsom said as Walz asked how they fight it and answered his own question.\n\n“I think I could kick most of their ass. I do think that,” Walz said, adding that he could probably “outrun” them, too.\n\n“I don’t know if we’re going to fall into that place where we want to, okay, we challenge you to do a, you know, a WWE fight here type of thing here,” Walz continued as Newsom said they are losing so many men to “these guys online.”\n\nThe interview comes as Walz hints that he could be considering a 2028 presidential bid, particularly raising eyebrows with his tour of Republican House districts.\n\nThat comes on the heels of Walz telling New Yorker Radio Hour, “If I think I could offer something… I would certainly consider that,” speaking of running for higher office.","summary":"Gov. Tim Walz (D-MN) is sick of hearing attacks on his masculinity from the MAGA movement, boasting that he could \"kick most of their ass.\"\n\n\nThe post Tim Walz Talks Tough About Conservatives &#038; His Critics: &#8216;I Could Kick Most of Their Ass&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/03/20/tim-walz-talks-tough-about-conservatives-his-critics-i-could-kick-most-of-their-ass/","image":"https://media.breitbart.com/media/2025/03/GettyImages-2177221561-640x335.jpg","video":null,"publish_date":"2025-03-20 20:02:11","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.278},{"id":302381650,"title":"'Secretly Divorcing' Michelle Obama Breaks Silence on Why She Has Been MIA as Talk Grows She and Barack Are Quietly Negotiating 'Split Deal of the Century'","text":"Michelle Obama has finally revealed why she has spent so much time out of the public eye, RadarOnline.com can reveal.\n\nThe former first lady explained she stepped away from politics to raise her kids – something she may soon have to do alone if she and Barack divorce as rumors suggest.Amid ongoing calls for her to run for president herself, the mother-of-two shot down any democratic hopes during an appearance on Kylie Kelce's Not Gonna Lie podcast, saying she simply is \"not interested in politics.\"\n\nMichelle, 61, confessed: \"When people ask me, would I ever run (for office), the answer is no.\"\n\nThe author seemed to appear guilty as she tried to describe the \"sacrifice\" her kids were forced to make when they suddenly became first children. \n\n\"I was so glad when we got out of the White House\" she admitted, noting that daughters Malia, 26, and Sasha, 23, were forced against their will to live their formative years in public.\n\nBarack, 63, spent eight years in the White House, ending his second term in 2017. \n\nMichelle revealed: \"I wanted them to have the freedom of not having the eyes of the world on them. They still are dealing with paparazzi and being who they are and trying to carve out their own identity.\"Carving out that identity could be complicated if their parents follow through on long-simmering divorce rumors.\n\nRadarOnline.com recently revealed Barack and Michelle are quietly carving up their $70million empire and edging closer to confessing that their 32-year marriage is over.\n\nHard-nosed lawyers and mediators for the former Democratic Party power couple are attempting to come to terms and divvy up their dollars and assets before the estranged spouses come clean with the American people later this year, said sources.\n\n\"They want to have everything ironed out in advance,\" an insider with knowledge of the deliberations said. \"The last thing they want is an ugly fight with lots of nasty legal filings.\"Their sensational split set would be the first-ever post-White House divorce between a former president and first lady.\n\nA political expert told us the pair's partnership had turned \"venomous\" following Republican Donald Trump's landslide victory over Democrat Kamala Harris in the 2024 presidential contest.\n\nAccording to sources, Barack demanded his partner run for president after Joe Biden's abrupt exit from the Oval Office race in July.\n\nBut insiders the Harvard-trained lawyer turned Tinseltown producer instead turned down her hubby's ultimatum and chose to further pursue her Hollywood ambitions on the other side of the country.\n\nA source added: \"They'd already been living separate lives on opposite coasts for some time, but that was no longer an option after Michelle refused to run and Barack was forced to back Kamala.\n\n\"That was a total humiliation for him – especially since she lost.\"Although Barack took to social media in January to wish his wife happy birthday in a lovey-dovey X post, sources said a public statement regarding their marriage's end will likely be Issued after the summer – as it will take months to sort out their intermingled mountain of holdings.\n\n\"They have homes in D.C., Martha's Vineyard and Chicago-plus a stock portfolio in excess of $25million,\" our insider added. \"There are also substantial revenue streams from their various media projects to divide and manage going forward.\n\n\"It's far from easy to untangle a life of three decades with someone, but maintaining the illusion of a happy and stable marriage is no longer a solution. They both are of the mind that they will be better off on their own.\"","summary":"Michelle Obama has revealed she stepped away from politics to raise her kids – something she may soon have to do alone if she and Barack divorce.","url":"https://radaronline.com/p/secretly-divorcing-michelle-obama-missing-barack-negotiating-split-divorce/","image":"https://media.radaronline.com/brand-img/5uA_sp0jR/0x0/barack-michelle-obama-divorce-rumors-asset-settlement-3-1740077217683.jpg","video":null,"publish_date":"2025-03-20 20:00:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":-0.103},{"id":302391742,"title":"JD Vance: Unlike Kamala Harris I Don't Have 'Four Shots of Vodka Before Every Meeting'","text":"Vice President JD Vance blasted former Vice President Kamala Harris when asked how he is handling the vice presidency differently than his predecessor, joking that he does not have “four shots of vodka before every meeting.”\n\nRadio host Vince Coglianese asked Vance asked how he is doing the job differently than Harris.\n\n“Well, I don’t have, you know, four shots of vodka before every meeting,” Vance joked. “That’s one way I think that Kamala really tried to bring herself into the role is these word salads.”\n\n“I think that I would need the help of a lot of alcohol to answer a question the way that Kamala Harris answered questions,” he continued, adding that he does not talk to Harris or former President Joe Biden very often, but he believes there was a lack of trust between the two, and that is not a problem he has with President Donald Trump.\n\n“My sense is, and this is a little bit of guesswork, obviously, I don’t talk to Kamala Harris or Joe Biden very often, but my sense is that there wasn’t a level of trust between Biden and Harris and so, you know, she was just less empowered to do her job,” he said.\n\n“And you know, luckily, I’m in a situation where the President trusts me, where if he asked me to do something, he believes it’s going to happen. And obviously we’ll talk about it and check in,” Vance said, explaining that he feels empowered in a way that he believes many vice presidents have not been.\n\n“That’s all in the service of accomplishing the President’s vision. And I think I try to remind myself of that every single day that the American people elected Donald J. Trump to do a job. For him to do that job successfully, the people around him, starting at the top, with the Vice President, have to do their jobs,” he continued.\n\nVance also spoke about how the position of the vice president is unique in that it actually does not hold any “formal power.” Therefore, he views his role “fundamentally as trying to help the President do whatever he needs to do.”\n\n“And so that’s made me more of a generalist. There’s not a particular issue where I’ve sort of made just my issue. I think the President and I work on everything, and obviously I take direction from his leadership, but I try to implement the agenda as well as I can,” he explained, adding that it has been fun because Trump has empowered him to be “involved in everything.”\n\n“That’s made the job a lot more fun than I think maybe it would otherwise be,” he added.\n\nHarris came under fire after her loss to Trump after releasing her first video message following her concession speech, as she appeared to be disheveled.\n\n“I just have to remind you, don’t you ever let anybody take your power from you. You have the same power that you did before November 5, and you have the same purpose that you did,” Harris said.\n\n“And you have the same ability to engage and inspire. So don’t ever let anybody or any circumstance take your power from you,” she continued, as many questioned why staffers would have allowed that video to go public.","summary":"Vice President JD Vance blasted former Vice President Kamala Harris when asked how he is handling the vice presidency differently than his predecessor, joking that he does not have \"four shots of vodka before every meeting.\"\n\n\nThe post JD Vance: Unlike Kamala Harris I Don&#8217;t Have &#8216;Four Shots of Vodka Before Every Meeting&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/03/20/jd-vance-unlike-kamala-harris-i-dont-have-four-shots-of-vodka-before-every-meeting/","image":"https://media.breitbart.com/media/2025/03/GettyImages-2163101519-640x335.jpg","video":null,"publish_date":"2025-03-20 19:22:04","author":"Hannah Knudsen","authors":["Hannah Knudsen"],"language":"en","source_country":"US","sentiment":-0.161},{"id":302391746,"title":"U.S. Trucking Advocate: Foreign Drivers Causing Fatal Accidents, 'Slashing Truckers' Income, Pushing Companies out of Business'","text":"A highway disaster in Texas has exposed the growing number of dangerous foreign truck drivers on U.S. roads, and advocates are using a legislative debate in Arkansas to jump-start federal changes to loopholed trucking regulations.\n\n“We’re trying to make a statement so that the feds will do something,” said Shannon Everett, a cofounder of American Truckers United. The foreign truck drivers — including many illegals — are killing American drivers, slashing truckers’ income, and pushing companies out of business,” he told Breitbart News.\n\nFreight Waves described the March 13 Texas disaster when a truck slammed into the back of a traffic jam:\n\nA man has been arrested as authorities continue to investigate the cause of a crash that killed five people Thursday on Interstate 35 in Austin, Texas.\nAuthorities said 17 vehicles were involved, including a tractor-trailer hauling goods for Amazon, in the accident that happened around 11:30 p.m. in the southbound lanes of I-35. Five people were pronounced dead on the scene, including a child and an infant. Eleven others were taken to hospitals.\nSolomun Weldekeal Araya, 37, the Dallas-based driver of the tractor-trailer, was arrested Friday by the Austin Police Department and charged with five counts of intoxication manslaughter and two counts of intoxication assault.\n\nFox7Austin.com reported:\n\nThe driver was detained and identified as Solomun Weldekeal Araya. The affidavit says he spoke mostly Tigrinya, a language spoken in Eritrea and northern Ethiopia, but also understood and spoke English.\n\nA field sobriety test showed he could not keep his balance or focus on instructions, and that he was swaying from side to side and front to back. Officers also noticed eyelid tremors and determined based on the test results that, due to a drug or controlled substance, he did not have the normal use of his mental and physical faculties to safely operate a motor vehicle.\n\nForeign truck drivers are pushing up the highway accident rate and pushing Americans out of jobs and well-paying truck routes, Everett said. The sector is always eager for more new drivers because it loses so many overworked and underpaid Americans each year, he said.\n\nMany cargo brokers hire illegal aliens to deliver goods to and from U.S. sites. The migrants often work in groups of two or more, allowing them to deliver goods faster — and at less cost than charged by American drivers — on the best-paid routes, said Everett. The “labor dumping,” he said, ensures that brokers can cut Americans out of good wages and jobs, and are pushing multiple American trucking companies out of business.\n\nThe rising number of foreign drivers is enabled by the federal government’s decision to roll back border rules and driver safety requirements, including a rule that drivers were expected to understand English.\n\nMany migrants took trucking jobs after being welcomed through President Joe Biden’s loose borders, either at the southern border or at international airports.\n\n“For us, the biggest problem is …. illegal immigrants coming in and getting the license without anything,” Rhaman Dhillon, the founder of the California-based North American Punjabi Truckers Association. “No training, no language [test], no nothing. They still get it,” he told Breitbart News.\n\nFederal and state rules make it easy for migrants to get commercial driver’s licenses, he said:\n\nYou can go ahead and get your written test passed in California, your physical [test] done in California, your drug test done in California, and then you go to Utah for your skill test. In [10 states], the drive test is given by a private third-party company, so those people, they will pass you in the drive test by accepting money.\n\nThere’s a proposed rulemaking in [the federal agencies] right now, it is working its way through that where they want more states to do this same thing because they think there is a driver shortage. We always say there’s no driver shortage, it’s a driver retention crisis because companies are not taking care of the drivers the way they should be. So that’s why people are coming in and they’re leaving the industry very quickly.\n\n“There are 12 states, including Washington, D.C., that have state-only testing, while there are 29 states that have a combination of third-party and state testing, leaving 10 states with third-party testing only,” according to OverDriveOnline.\n\nThe migrant influx into trucking is extraordinarily rapid.\n\nIn 2021, for example, National Public Radio reported that “the North American Punjabi Trucking Association estimates Punjabi Sikhs make up 20 percent of the country’s truckers and control as much as 40 percent of the industry in California.” NPR did not estimate the share who are illegal migrants or who are working illegally on tourist visas.\n\nDrivers from Eastern Europe are also getting on U.S. roads. A trucking publication, Freight Waves, described illegal driving by East Europeans, including one driver who said he was pressured to drive for 50 hours straight:\n\n“Many of us in the trucking industry know this is nothing less than human trafficking and that’s been going on since the 1990s when the Berlin Wall fell,” Joe Rajkovacz, director of governmental affairs for the Western States Trucking Association (WSTA), told FreightWaves. “Men from Eastern Europe and India were brought over by some companies with false promises of a better life and were enslaved to drive a truck.”\n\nEverett has been pushing federal agencies to deal with the problems caused by migrant truckers since 2019 after he had to lay off 450 U.S. drivers at his Arkansas trucking firm. However, he made no progress under President Joe Biden’s pro-migration administration. “No, none at all,” he said.\n\nDhillon also pushed Biden’s federal officials to address the problems. “I raised this point in front of FMCSA [Federal Motor Carrier Safety Administration], in front of DoT [Department of Transportation],” Dhillon said, adding:\n\nI was on the Biden-Harris Trucking Action Plan Committee. I met Mr. Biden. I went to White House. We did everything we could to raise this point in front of OSHA [Occupational Safety and Health Administration], in front of the Labor Department, that, “Hey, this is the biggest loophole right now that this industry has.”\n\nNow Everett is lobbying the Arkansas legislature to help prod the federal government to close the loopholes and to help U.S. truckers regain work from the migrants.\n\nIn the state House, he’s pushing a bill that would bar drivers with trucking licenses granted by distant countries from Arkansas roads.\n\nHe’s facing a rival bill sponsored by the state’s powerful Arkansas Trucking Association of trucking companies. That bill passed a committee vote on Wednesday — despite testimony showing the danger of migrant drivers — and may be approved by the state assembly on Thursday, March 20.\n\nThe association’s bill provides two useful features, including the ability for state troopers to arrest foreign drivers who present fake credentials, such as faked Commercial Drivers Licenses from Mexico, said Everett. But those two elements are a smoke screen for the bill’s failure to deal with the core problem caused by the rising number of foreign truckers, he added.\n\nWorse, the bill would change state law to echo business-backed federal regulations that favor migrant drivers and their low-wage employers, he said. ” They are changing Arkansas State law, which currently only allows a commercial driver’s license from the United States or Canada … to include foreign commercial driver’s licenses.”\n\nIn our transportation committee hearing, safety experts testified that these foreign commercial driver’s licenses have no database or repository that we can access and that our safety professionals here in the United States can [use to] see … these people’s driving history or their backgrounds.\nSo why would we extend [driving license] reciprocity to …. those foreign driver’s licenses when they’re not reciprocating with all the background information and driver history of all these drivers? So we just believe that’s egregious. We cannot believe that our own American Trucking Association would have a different standard for foreign drivers than they have for our American drivers.\n\nHowever, the main problem lies in Washington, where lobbyists for trucking companies and retailers have helped produce rules and regulations that enable migrant drivers, minimize safety testing, and throttle enforcement of U.S. standards on foreign drivers, he said.\n\nFor example, trucking companies can hire foreigners who fly into the United States with B-1 visas that are supposedly reserved for foreign employees attending training sessions or conference events. This loophole means companies can hire truckers from many countries — including India — to replace Americans who would otherwise deliver loads on routes into and out of Canada and Mexico.\n\nHis perspective is now likely to get a friendly hearing in the federal government because President Donald Trump has promised to deport millions of illegals.\n\nTrump worked hard to get the endorsement of the Teamsters Union in 2024. The union did not endorse him but also chose to not endorse Vice President Kamala Harri amid pro-Trump grassroots pressure from truck drivers.\n\nTrump’s new Secretary of transportation is Sean Duffy, a former congressman from Wisconsin.\n\nThe trucking industry is huge. It employs roughly 100,000 people in Arkansas, and 8.5 million people nationwide, according to the American Trucking Association. The association’s membership includes Amazon and many other companies.\n\nThe United States Bureau of Labor Statistics estimates that, in 2023, there were 2.2 million trucking jobs in America.","summary":"A highway disaster in Texas has exposed the growing number of dangerous foreign truck drivers on U.S. roads, and advocates are hoping a legislative debate in Arkansas will jump-start federal changes to loopholed trucking regulations.\n\n\nThe post U.S. Trucking Advocate: Foreign Drivers Causing Fatal Accidents, &#8216;Slashing Truckers&#8217; Income, Pushing Companies out of Business&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/immigration/2025/03/20/u-s-trucking-advocate-foreign-drivers-causing-fatal-accidents-slashing-truckers-income-pushing-companies-out-of-business/","image":"https://media.breitbart.com/media/2025/03/GettyImages-1605645464-640x335.jpg","video":null,"publish_date":"2025-03-20 19:16:23","author":"Neil Munro","authors":["Neil Munro"],"language":"en","source_country":"US","sentiment":-0.453},{"id":302387050,"title":"Vance hits his daily ick quota with disgusting claim about Harris","text":"Vice President JD Vance called in to right-wing podcaster Vince Coglianese’s show this week to berate his predecessor, former Vice President Kamala Harris, saying that the main difference between the two is that he doesn’t drink before work.\n\n“Well, I don't have, you know, four shots of vodka before every meeting. That's one way, I think, that Kamala really tried to bring herself into the role is, is these word salads. And I think that I would need the help of a lot of alcohol to answer a question the way that Kamala Harris answered,” he said.\n\nSome choice words from a guy whose daytime food-ordering skills rival a 4 AM college run to Dunkin’ Donuts. Not to mention Vance’s infamous word salad about “childless cat ladies” and his embarrassing attempt at bullying Ukrainian President Volodymyr Zelenskyy in the Oval office. \n\nAnd, of course, it’s well known that President Donald Trump’s Secretary of Defense, Pete Hegseth, has a history of being “very drunk at work functions.”\n\nDuring the podcast episode, Vance also said that Harris “was just less empowered to do her job.” That’s quite the statement coming from the same person whose campaign claimed that former President Joe Biden was controlled by Harris. \n\nTrump and Vance built their campaign on blaming Harris for all of Biden’s “bad” policies and accusing her of failing in her role as the mythical “border czar.”\n\nBut Vance’s gratuitous takedown of a perceived political enemy is unfortunately nothing new for the Trump administration. Whether it’s taking down portraits of Trump’s “enemies” or revoking security protections from officials he does not like, the Trump administration is fueled by pettiness and revenge.","summary":"Vice President JD Vance called in to right-wing podcaster Vince Coglianese’s show this week to berate his predecessor, former Vice President Kamala Harris, saying that the main difference between the two is that he doesn’t drink before work.\n\n\n\n“Well, I don't have, you know, four shots of vodka before every meeting. That's one way, I think, that Kamala really tried to bring herself into the role is, is these word salads. And I think that I would need the help of a lot of alcohol to answer a question the way that Kamala Harris answered,” he said.\n\n\n\n\n\n\n\n\nx\n\n\nx\nYouTube Video\n\n\nSome choice words from a guy whose daytime food-ordering skills rival a 4 AM college run to Dunkin’ Donuts. Not to mention Vance’s infamous word salad about “childless cat ladies” and his embarrassing attempt at bullying Ukrainian President Volodymyr Zelenskyy in the Oval office. \n\n\n\nAnd, of course, it’s well known that President Donald Trump’s Secretary of Defense, Pete Hegseth, has a history of being “very drunk at work functions.”\n\n\n\nD","url":"https://www.dailykos.com/story/2025/3/20/2311474/-Vance-hits-his-daily-ick-quota-with-disgusting-claim-about-Harris?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1411017/story_image/AP25073601678410.jpg?1742492341","video":null,"publish_date":"2025-03-20 19:00:09","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":-0.409},{"id":302408860,"title":"Vice President JD Vance Mocks Kamala Harris Over Drinking: 'Well, I Don’t Have Four Shots Of Vodka Before Every Meeting","text":"US Vice President JD Vance took a jab at his predecessor, Kamala Harris, joking about her alleged drinking habits during an interview, reported New York Post. Speaking to radio host and Daily Caller editorial director Vince Coglianese, Vance said, \"Well, I don’t have four shots of vodka before every meeting,\" when asked how his approach differed from Harris's. Vance further mocked Harris’s speaking style, which has often been criticized as incoherent or rambling. \"That’s one way that I think Kamala really tried to bring herself into the role, is these word salads,\" he added. \"And I think that I would need the help of a lot of alcohol to answer a question like Kamala Harris answered a question.\" Harris has frequently been ridiculed online for what critics describe as her tendency to string together high-sounding but ultimately vague statements. Some social media users have even speculated—without any concrete evidence—that she had a habit of drinking before public appearances. During her tenure as vice president, Harris was occasionally seen drinking casually in public settings. In one notable instance during a campaign interview, she cracked open a Miller High Life beer with late-night host Stephen Colbert. While many saw it as a relatable moment, it also fed into rumours that she enjoyed drinking more than her political counterparts—particularly as both Joe Biden and Donald Trump are known teetotalers. Also Read: Vance himself has admitted to enjoying a drink, saying during his own campaign that he liked beer \"a little bit too much.\" However, his latest comments reinforce the ongoing trolling of Harris, particularly regarding her speaking style and public demeanor. One of Harris’s most recent appearances at an AI conference further fueled online speculation. While discussing technological innovation, she inexplicably veered into a personal anecdote about using DoorDash to order Doritos before the Oscars. \"We did DoorDash ’cause I wanted Doritos. And the red carpet part was about to start and nobody wanted to leave to go to the grocery store. So it was DoorDash,\" she said, before adding, \"So I was willing to give up whatever might be the tracking of Kamala Harris’ particular fondness for nacho cheese Doritos for the sake of getting a big bag of Doritos as I watched the Oscars.\" Harris continued, \"But here’s the thing: At what point do we also uplift and highlight the consumer’s right to also expect—and you can debate with me if it should be a right—I think it should.\" Her remarks left many puzzled, with some online commentators suggesting she may have been \"three glasses of wine deep.\" While there is no verified evidence that Harris has a drinking problem, her speaking style and occasional offbeat comments have often led to public scrutiny. Vance’s comments add to the ongoing mockery Harris has faced, reinforcing an image—fair or not—that her public statements often lack clarity. Whether his remarks were merely in jest or an intentional attempt to keep the rumours alive, they have certainly reignited online debates about Harris's time in office. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News, World and around the world.","summary":"US Vice President JD Vance mocked Kamala Harris’s speaking style and alleged drinking habits, joking that he doesn’t take \"four shots of vodka before every meeting.\" Harris’s past public remarks, including a bizarre AI conference speech about DoorDash and Doritos, have fueled online trolling.","url":"https://www.timesnownews.com/world/us/us-news/vice-president-jd-vance-mocks-kamala-harris-over-drinking-well-i-dont-have-four-shots-of-vodka-before-every-meeting-article-119268448","image":"https://static.tnn.in/thumb/msid-119268813,thumbsize-26664,width-1280,height-720,resizemode-75/119268813.jpg","video":null,"publish_date":"2025-03-20 18:30:55","author":"Shivani","authors":["Shivani"],"language":"en","category":"politics","source_country":"in","sentiment":-0.075},{"id":302348968,"title":"Michelle Obama reveals the real reason she won't answer Democrat calls to run for president in 2028","text":"Michelle Obama revealed the real reason she won't answer the Democrats' call to run for president, saying bluntly it's 'never gonna happen.'\n\nThe former first lady had a candid conversation on her feelings about politics when she sat down with Kylie Kelce on the March 20 episode of Kelce's Not Gonna Lie podcast.\n\nShe made it clear that, even though Democrats have approached her numerous times about running for president, she would never consider it, because of the affect it would have on daughters Malia and Sasha. \n\n'I was so glad when we got out of the White House,' she told Kelce.\n\nObama said she worried about the affect of growing up in such a public environment would have on daughters Malia, 26, and Sasha, 23. \n\nThe girls were nine and seven when Barack Obama became the 44th President of the United States in January 2009.\n\n'I wanted them to have the freedom of not having the eyes of the world on them,' she said of her girls. \n\n'They still are dealing with paparazzi and being who they are and trying to carve out their own identity.'\n\nBecause of that, she said, she would never be a candidate for political office.\n\n'So when people ask me would I ever run, the answer is no. If you ask me that, then you have absolutely no idea the sacrifice that your kids make when your parents are in that role.' \n\nDemocrats have long dreamed of having Michelle Obama top their presidential ticket due to her enormous popularity throughout the country. She's floated as a potential candidate every four years. \n\nAnd, in the summer of the 2024 election, a Reuters/Ispos poll found Obama was the only Democrat with a lead on Trump in a hypothetical match-up, garnering 50 percent support to his 39 percent.\n\nBut the former first lady - who campaigned for Kamala Harris last year - was clear she had no interest in pursuing the office herself. \n\nShe added: 'Not only am I not interested in politics in that way but the thought of putting my girls back into that spotlight when they are just now establishing themselves — we've done enough.'\n\nAnd her decision is final.\n\nThe 'question [has been] asked and answered' and is 'never gonna happen,' she said.\n\nShe said of her daughters: 'They've already served their time. … It would be unthinkable. Nope.'\n\nThe former first lady remains a popular surrogate on the campaign trail. In addition for Harris last year, Obama campaigned for Hillary Clinton in 2016, has helped numerous Democratic Senate candidates and is a regular speaker at the Democratic National Convention. \n\nMalia and Sasha currently live in Los Angeles. Malia works in the film industry. \n\nMichelle Obama appeared on Kelce's show to promote her new podcast with her brother: IMO with Michelle Obama and Craig Robinson.\n\nThe former first lady also made jokes about her marriage with Barack Obama, saying the couple differed on whether to have another child: he wanted one and she didn't.\n\nThe Obamas have been fighting off rumors of an impending divorce. \n\nSpeculation that they were having problems arose after fans noticed Michelle was not with her husband at numerous events.\n\nThe former president was notably alone at Jimmy Carter's state funeral in December 2024 and Donald Trump's January inauguration, where Michelle broke tradition by declining to attend.","summary":"Michelle Obama revealed the real reason she won't answer the Democrats' call to run for president, saying bluntly it's 'never gonna happen.'","url":"https://www.dailymail.co.uk/news/article-14520259/Michelle-Obama-reason-president-2028.html","image":"https://i.dailymail.co.uk/1s/2025/03/20/18/96402677-0-image-a-18_1742494139590.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/20/4991664637474488108/1024x576_MP4_4991664637474488108.mp4","publish_date":"2025-03-20 18:17:32","author":"Editor,Emily Goodin","authors":["Editor","Emily Goodin"],"language":"en","category":"politics","source_country":"gb","sentiment":0.021},{"id":302356786,"title":"Conservative groups urge FCC to end ‘60 Minutes’ Harris interview probe — and get rejected","text":"Conservative advocacy groups on Thursday asked the Federal Communications Commission to reject a news distortion complaint over CBS’s “60 Minutes” interview with then-Vice President Kamala Harris that aired in October.\n\nThe Center for Individual Freedom, Americans for Tax Reform, Taxpayers Protection Alliance and other groups called on FCC Chair Brendan Carr to end the investigation into the unit of Paramount Global, saying an “adverse ruling against CBS would constitute regulatory overreach and advance precedent that can be weaponized by future FCCs.”\n\nThe FCC is reviewing whether the broadcast violates “news distortion” rules. \n\nThough the agency is prohibited from censorship or infringing on the First Amendment rights of media, broadcasters cannot intentionally distort the news.\n\nThe groups also urged the FCC to “take steps to curtail the commission’s ability to engage in content-based regulation and reviews.”\n\nThe groups said there were legitimate concerns about prior actions aimed against conservatives but said the better course was to eliminate rules on news distortion complaints.\n\n“We understand and appreciate why many conservatives would seek to now ‘level the playing field’ and subject other media organizations — such as CBS’s parent company Paramount — to the same regulatory cudgel that has long afflicted conservative media,” the groups said.\n\nCarr said in an email to Reuters he was rejecting the groups’ request to immediately dismiss the complaint against CBS. \n\n“The FCC’s review of the complaint against CBS remains active and ongoing,” he said.\n\nThe American Civil Liberties Union said separately there was no basis to investigate. \n\n“To conduct an investigation into news distortion without a shred of evidence appears intended to harass CBS and chill those putting forth disfavored viewpoints,” the group said.\n\nCBS, which is owned by Paramount Global, said earlier this month that sanctioning the company over the interview “would blatantly violate the First Amendment by substituting the government’s editorial judgment for that of CBS and its journalists.”\n\nA complaint alleges CBS violates the FCC’s rules on “news distortion.” The network broadcast a portion of Harris’ answer on “Face the Nation” and a different one on “60 Minutes.”\n\nCBS turned over the unredacted video and transcript to the FCC that made it public as did the broadcaster.\n\nPresident Trump has sued CBS for $20 billion over the broadcast. Paramount is seeking FCC approval for an $8.4 billion merger with Skydance Media.\n\nLast month, the FCC reinstated complaints about the “60 Minutes” interview with Harris, as well as about how Walt Disney’s ABC News moderated the pre-election TV debate between then-President Joe Biden and Trump, as well as against Comcast’s NBC for letting Harris appear on “Saturday Night Live” shortly before the election she lost to Trump. \n\nThe prior FCC chair rejected those complaints.","summary":"The groups said \"adverse ruling against CBS would constitute regulatory overreach and advance precedent that can be weaponized by future FCCs.\"","url":"https://nypost.com/2025/03/20/media/conservative-groups-urge-fcc-to-end-60-minutes-harris-interview-probe/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/fcc-kamala-harris-60-minutes.jpg?quality=75&strip=all&1742477969&w=1200","video":null,"publish_date":"2025-03-20 18:07:29","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.009},{"id":302356784,"title":"Ellen DeGeneres and Portia de Rossi celebrate 20th anniversary after leaving the US post-election","text":"Ellen DeGeneres and Portia de Rossi commemorated two decades of love after fleeing the United States when President Trump was elected into office for a second term. \n\nThe former talk show host shared a photo on her Instagram Wednesday, where she could be seen staring into her wife’s eyes in front of a beautiful sunset.\n\n“20 years together. Happy to be with you everywhere and always @portiaderossi,” DeGeneres captioned the sweet snap.\n\nDeGeneres and de Rossi appeared to be celebrating their relationship milestone with an adventurous African escapade as the comedian tagged the luxury African safari company, Singita, as well as the guided tour company, Safarious.\n\nIt’s unclear which country the lovebirds were exploring as Singita operates private game lodges in South Africa, Zimbabwe, Tanzania and Rwanda.\n\nThey did, however, tag a South Africa-based tour guide who goes by the name Safari Dan. \n\nDeGeneres, 67, and the “Arrested Development” actress, 52, notoriously moved out of their home in Montecito, Calif., and settled in the UK after Trump returned to the Oval Office.\n\nIn November 2024, sources told TMZ that the duo decided to “get the hell out” of the country after Trump’s victory over Kamala Harris left them feeling “very disillusioned.” \n\nThey now reside in a home nearly two hours outside of London in the Cotswolds in South West England.\n\nDe Rossi and DeGeneres reportedly purchased the property before the 2024 election.\n\nShortly after moving across the pond, DeGeneres and de Rossi surfaced at a local UK pub called The Farmers Dog.\n\nDeGeneres was almost unrecognizable as she dyed her famously short blond pixie cut a new shade of brunette. \n\nThe “Ellen DeGeneres Show” alum and de Rossi are no strangers to going big when it comes to commemorating their relationship. \n\nIn 2023, they honored their more than 14 years of marriage by renewing their vows in their Montecito abode. \n\nKris Jenner officiated the ceremony and Brandi Carlile performed while stars in attendance included Meghan Markle and Prince Harry.\n\nDeGeneres and de Rossi tied the knot with an intimate, 20-person wedding ceremony in Los Angeles Aug. 16, 2008.","summary":"\"20 years together. Happy to be with you everywhere and always @portiaderossi,\" DeGeneres captioned a photo of what appeared to be her and her wife on safari.","url":"https://pagesix.com/2025/03/20/celebrity-news/ellen-degeneres-and-portia-de-rossi-celebrate-20th-anniversary/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/03/100767275.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/9LpPyIEi-guILbWnz.mp4","publish_date":"2025-03-20 18:05:54","author":"Leah Bitsky","authors":["Leah Bitsky"],"language":"en","source_country":"zm","sentiment":0.442},{"id":302378420,"title":"Switzerland Becomes Latest Nation to Consider Social Media Ban for Children","text":"Enable Accessibility\nSkip to Content\n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nB Inspired \n\nEntertainment\n\nLondon / Europe\nBorder / Cartel Chronicles\nIsrael / Middle East\n\nLatin America\n\nOn the Hill\n\nOn the Hill Articles\nOn The Hill Exclusive Video\n\nBreitbart News Daily\n\nNewsletters \n\n BREITBART\n\nDeport Battle\nUkraine Peace Push\nTesla Terror\nJust DOGE It!\n\nIsrael Strikes Hamas\n\nSwitzerland Becomes Latest Nation to Consider Social Media Ban for Children\n\n Jonathan Raa/NurPhoto via Getty Images\n\nJohn Hayward20 Mar 2025 \n\nLondon / Europe\nNational Security\n\nfree speech\nNetherlands\nsmartphones\nSocial Media\nSwitzerland \n\nPlease let us know if you're having issues with commenting.\n\nMOST POPULAR\n\n'Tesla Takedown' Protesters Plan Massive Global Demonstrations\nSinger Courtney Love Files for U.K. Citizenship over Trump\nReport: DHS Arrests Georgetown Student Who Spread 'Hamas Propaganda'\nTrump: Putin and I Agreed to 'Immediate' Energy, Infrastructure Ceasefire\nTrump Fires Both Democrat FTC Commissioners\nComedy Central Audience Repeatedly Applauds Tesla Terrorism\nReport: Trump to Sign Order Shutting Down U.S. Education Department\nMarried Couple Deported After Living Illegally in U.S. for 35 Years\nExclusive — Trump on Calls with Zelensky, Putin: ‘Very Good Conversations'\nLive: Astronauts Return to Earth After Being Stuck on ISS for over 9 Months\n\nFROM THE HOMEPAGE\n\nExclusive–President Trump: ‘The Democrat Party Broke Themselves’\n‘Attempted Murder:’ 15+ Conservatives Targeted by Swatting Attacks in 1 Week\n‘Tesla Takedown’ Protesters Plan Massive Global Demonstrations Against Elon Musk on March 29\nFBI Investigates Arson Attack on Las Vegas Tesla Repair Facility\nVancouver Auto Show Pulls Tesla Exhibit over ‘Safety Concerns’\nJD Vance: Unlike Kamala Harris I Don’t Have ‘Four Shots of Vodka Before Every Meeting’\nNolte: $660 Million Dakota Pipeline Jury Verdict Could Put Greenpeace Out of Business\nSwitzerland Becomes Latest Nation to Consider Social Media Ban for Children\nICE Official: Many Gang Members Deported by Trump Face Murder, Rape, Kidnapping Charges\nExclusive Poll: Majority of Americans Oppose ESG as State Financial Officers Fight Against It\nReport: Canadian Furniture Maker Moves Production to North Carolina After Trump’s Tariff Threats\nNolte: Married Couple Deported to Colombia After Living Illegally in U.S. for 35 Years \n\n BREITBART NEWS\n\nAccessibility Statement\nPolicy Info\nTerms of Use\nPrivacy Policy\n\nGet the App\nNewsletters\n\nCopyright © 2025 Breitbart","summary":"Switzerland is the latest country to consider a sweeping ban on social media for children, similar to the one adopted by Australia in November 2024.\n\n\nThe post Switzerland Becomes Latest Nation to Consider Social Media Ban for Children appeared first on Breitbart.","url":"https://www.breitbart.com/tech/2025/03/20/switzerland-becomes-latest-nation-to-consider-social-media-ban-for-children/","image":"https://media.breitbart.com/media/2025/03/social-media-phone-getty-640x335.jpg","video":null,"publish_date":"2025-03-20 18:00:11","author":"John Hayward","authors":["John Hayward"],"language":"en","source_country":"US","sentiment":0.186},{"id":302347474,"title":"Trump's Secret Fear Revealed: How President Was Left 'Terrified' of Running Against Gavin Newsom — As the Democrats' 'Savior' Is Hammered for Inviting Right-Winger Steve Bannon onto New Podcast","text":"Donald Trump was \"terrified\" of the thought of having to run for president against California Governor Gavin Newsom, RadarOnline.com can reveal. \n\nNewsom is seen as an upcoming power player in the Democratic party, however his recent sit-down with conspiracist Steve Bannon has angered some of his peers.Trump was reportedly worried that the more he attacked Joe Biden on the campaign trail, the democrats would bench Biden for a sexier candidate – like Newsom. \n\nAnd that's exactly what almost happened. Although, after Biden announced he was dropping out of the race, would-be savior Newsom stunned the party by throwing his support behind eventual candidate Kamala Harris. \n\nNewsom has never revealed why he decided not to run for president, but theories range from money challenges to his personal relationship with Harris to his fear of losing, and killing his career.But political reporter Alex Isenstadt, who explores the election chaos in his new book Revenge: The Inside Story of Trump's Return to Power, revealed the possibility of Newsom entering the race had Trump running scared.\n\nIsenstdat explained on Tara Palmeri's podcast: \"Trump saw Newsom as slick and as the future of the Democratic party,\" adding that the man-who-would-be president actually respected the governor.\n\n\"He saw him as a well-put-together individual.\"\n\nTrump's so-called respect faltered, however, after Newsom's perceived poor performance in a debate against Florida governor Ron DeSantis in November 2023 – around the same time he was losing ground in the Republican primary and was desperate for publicity.\n\nIsenstdat continued: \"Trump would tell people at the time that DeSantis is an idiot but he thought that Newsom would have performed better at that debate.\n\n\"Trump always had his eye on Newsom, but after that he began to see him as less of a threat.\"Trump quickly gained confidence against Newsom after his overwhelming election night victory, and when Los Angeles was recently ravaged by wildfires, the president pointed a finger clearly at his nemesis – even bestowing him with one of his trademark nicknames – \"Newscum.\"\n\nTrump wrote: \"Governor Gavin Newscum refused to sign the water restoration declaration put before him that would have allowed millions of gallons of water, from excess rain and snow melt from the North, to flow daily into many parts of California, including the areas that are currently burning in a virtually apocalyptic way.\n\n\"He wanted to protect an essentially worthless fish called a smelt, by giving it less water (it didn't work!), but didn't care about the people of California. Now the ultimate price is being paid.\"\n\nHe went on to claim: \"I will demand that this incompetent governor allow beautiful, clean, fresh water to FLOW INTO CALIFORNIA! He is the blame for this. On top of it all, no water for fire hydrants, not firefighting planes. A true disaster.\"\n\nTrump later added: \"One of the best and most beautiful parts of the United States of America is burning down to the ground. It's ashes, and Gavin Newscum should resign. This is all his fault!!!\"Meanwhile, Newsom may not be the golden child democrats predicted – especially after raising ire for inviting far-right political strategist Bannon on his own podcast. \n\nAndy Beshear, the governor of Kentucky, led the outcry from liberal colleagues who criticized Newsom's choice of guests.\n\nBeshear said: \"I think that Governor Newsom bringing on different voices is great; we shouldn’t be afraid to talk and to debate just about anyone.\n\n\"But Steve Bannon espouses hatred and anger, and even at some points violence, and I don’t think we should give him oxygen on any platform, ever, anywhere.\"","summary":"Donald Trump was worried the younger Gavin Newsom would step in and steal the thunder of the presidential race after Joe Biden dropped out.","url":"https://radaronline.com/p/trumps-secret-fear-president-terrified-gavin-newsom-democrats-steve-bannon-podcast/","image":"https://media.radaronline.com/brand-img/11fJ4jxFy/0x0/donald-trump-gavin-newsom-1742491835002.jpg","video":null,"publish_date":"2025-03-20 18:00:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","category":"politics","source_country":"us","sentiment":-0.2},{"id":302352664,"title":"'Murder the truth': Inside the secret right-wing campaign to silence the media","text":"The new book Murder the Truth: Fear, the First Amendment, and a Secret Campaign to Protect the Powerful by The New York Times business investigations editor David Enrich chronicles an ongoing campaign by the wealthy and powerful to overturn the landmark Supreme Court decision New York Times Co. v. Sullivan, which in 1964 established bedrock protections against spurious defamation and libel cases in the U.S. legal system. By “subject[ing] people to this torturous, long-running and extremely expensive legal process,” those who can afford to pay for expensive and threatening defamation lawsuits can silence any public criticism and suppress others’ rights to free speech, says Enrich. “It has huge implications for our democracy and the ability of everyone to speak their mind.”\n\nThis is a rush transcript. Copy may not be in its final form.\n\nAMY GOODMAN: This is Democracy Now!, democracynow.org, The War and Peace Report. I’m Amy Goodman.\n\nWe turn now from attacks on the right to protest to attacks on press freedom. President Trump is escalating his criticism of the news media, claiming many outlets are engaged in illegal activity. This is part of what he said last week during a speech at the Great Hall of the Department of Justice.\n\nPRESIDENT DONALD TRUMP: I believe that CNN and MSDNC, who literally write 97.6% bad about me, are political arms of the Democrat Party. And in my opinion, they’re really corrupt, and they’re illegal. What they do is illegal. … These networks and these newspapers are really no different than a highly paid political operative. And it has to stop. It has to be illegal. It’s influencing judges, and it’s entered — it’s really changing law, and it just cannot be legal. I don’t believe it’s legal.\n\nAMY GOODMAN: President Trump’s comments come amidst a right-wing push to overturn protections for the press to investigate public figures, a right guaranteed by the landmark 1964 Supreme Court decision New York Times v. Sullivan.\n\nWe’re joined now by David Enrich. He’s New York Times’ business investigations editor. His new book is titled Murder the Truth: Fear, the First Amendment, and a Secret Campaign to Protect the Powerful.\n\nIf you can start off — it’s great to have you with us, David — by talking about what this Supreme Court decision, this landmark decision in the 1960s, Sullivan, was all about?\n\nDAVID ENRICH: Well, it was brought on behalf of supporters of Martin Luther King, and it basically detailed this litany of abuses by Southern officials. The gist of it was completely true: Southern officials were trying to preserve white supremacy. Some of the facts were either wrong or exaggerated, and a powerful Southern official named L.B. Sullivan, sued The New York Times and won at trial. And the goal, basically, of Sullivan and his pals was that by filing lawsuits that seized on tiny little inaccuracies, you could punish the media for covering the civil rights movement.\n\nAnd so, this went up to the Supreme Court, and the Supreme Court ruled, in a unanimous decision in 1964, that in order to preserve free speech and allow people to write and criticize and investigate powerful people and institutions, the media and the public needed breathing room so that if they got a fact wrong by mistake or made an honest error, they would not be sued into oblivion. And so, that Supreme Court ruling has really set the stage for decades of investigative journalism and for normal people, non-journalists, as well, to speak up and kind of reveal abuses and criticize people who hold positions of power, both at the national level or at a community level, as well.\n\nAMY GOODMAN: And what does this mean for the First Amendment?\n\nDAVID ENRICH: And it means that the First Amendment gives everyone the right to speak and to interrogate powerful people, and you do not need to worry about — there should not be a legal cloud hanging over your head when you criticize or investigate someone powerful, and you do not need to worry that an innocent mistake is going to bankrupt you because of litigation.\n\nAMY GOODMAN: So, let’s go back to 2016, Donald Trump vowing to make it easier to sue news organizations.\n\nDONALD TRUMP: I’m going to open up our libel laws, so when they write purposely negative and horrible and false articles, we can sue them and win lots of money. We’re going to open up those libel laws, so that when The New York Times writes a hit piece, which is a total disgrace, or when The Washington Post, which is there for other reasons, writes a hit piece, we can sue them and win money.\n\nAMY GOODMAN: So, that was before Donald Trump became president the first time around. Talk about the significance of what he’s saying and the overall campaign, as in your subtitle, the Secret Campaign to Protect the Powerful.\n\nDAVID ENRICH: Well, when Donald Trump made those remarks in 2016, it kind of acted as the firing of a starter’s pistol in a race, and it sent a signal to the entire kind of conservative movement, and, in particular, the conservative legal movement, that a race was on to try to dismantle some of the long-standing First Amendment protections for the media and for others. And you can trace very directly back to that speech that he gave in Fort Worth, Texas, in February of 2016 the arrival on the scene of this kind of small cottage industry of high-priced lawyers whose entire practices were devoted to suing and threatening news outlets.\n\nAnd the more successes they piled up, the more the strategy caught on, so that by the time — and within a couple of years, there was a real grassroots movement, funded and fueled by the likes of the Federalist Society, the Heritage Foundation, the Claremont Institute, to really weaponize defamation laws to make it much, much scarier, really, especially for small and independent news outlets and journalists, to write about powerful people — not just the president of the United States, but across — but in their local communities, a big company, maybe a powerful real estate developer, things like that. And this strategy has now worked its way all the way up to the Supreme Court, where there is increasing support for either doing away with New York Times v. Sullivan altogether, or at least chipping away at it around the edges.\n\nAMY GOODMAN: So, you’re the business investigations editor at The New York Times. What led you to write this book?\n\nDAVID ENRICH: Well, we were getting, and still do get, inundated with legal threats basically every time that we start writing about or investigating someone powerful. And it occurred to me — you know, The New York Times is in a pretty good position to handle that kind of threat, but it occurred to me a few years ago that, you know, the experience might be very different if you worked at a smaller outlet or if you were an independent journalist. And, you know, there are so many independent journalists right now, which I think is a really good thing for the media and a good thing for our democracy. But it’s people with a Substack newsletter or a blog or a podcast who are uniquely vulnerable to these types of threats and these types of litigation, because they are enormously expensive to defend against.\n\nAnd they’re not always meant to — these challenges are not always meant to win in court. They’re often meant to just subject people to this torturous, long-running and extremely expensive legal process. And a lot of people make the economically rational decision, which is that in the face of those threats and in the face of that litigation, they’re going to back down rather than fight, which is exactly what the people making those threats want you to do.\n\nAMY GOODMAN: So, talk about how Hulk Hogan or, as you point out, much more relevantly, Peter Thiel fit into this story.\n\nDAVID ENRICH: Yeah, so, Peter Thiel had a long-running grudge against —\n\nAMY GOODMAN: And explain who he is.\n\nDAVID ENRICH: Yeah, Peter Thiel is one of the most powerful people in Silicon Valley. He was an early supporter of Donald Trump, and he’s very closely aligned with people like Elon Musk. And he —\n\nAMY GOODMAN: Co-founder of PayPal.\n\nDAVID ENRICH: Co-founder of PayPal, yes, and one of the owners of Palantir, as well. And he had a long-running grudge against the website Gawker, because Gawker was really pioneering a form of journalism that was very skeptical of Silicon Valley elites and was kind of puncturing some of the bubble surrounding them. And so he set out in the early 2010s to destroy Gawker. And he went searching. He hired a bunch of people. He put a bunch of money into this. And he eventually settled on a case involving Hulk Hogan. Gawker had published a snippet of a sex tape involving Hulk Hogan.\n\nAnd so, Peter Thiel secretly financed and organized a multifaceted legal campaign using Hulk Hogan as a vehicle for retribution against Gawker. He won — Hulk Hogan won. Peter Thiel won. Gawker was destroyed. And this became a real blueprint for other billionaires and other powerful people to really attack the media. They saw that they — a well-funded, well-orchestrated, secret legal campaign — had the ability to absolutely destroy a well-established media outlet.\n\nAMY GOODMAN: So, Gawker was destroyed. Now talk about some of the Supreme Court justices’ views. Particularly begin with Clarence Thomas.\n\nDAVID ENRICH: Well, Clarence Thomas, during his confirmation hearings in 1991, expressed real support for New York Times v. Sullivan. He then went through a period where he got some very negative media coverage, and his views seemed to shift. And so, by 2019, Clarence Thomas became the first sitting Supreme Court justice to openly call for the overturning of New York Times v. Sullivan.\n\nHis argument originally was grounded in the 45 words of the First Amendment, which do not mention libel or defamation, and therefore should not — he argued that should not be protected under the First Amendment. Really, though, this was a part of a campaign by Thomas and his allies to really erode the powers of the media and the protections for the media and normal people to speak up when they saw abuses and to criticize people like him.\n\nAnd so, he, now joined by Neil Gorsuch, as well, have really embraced this call and are trying to recruit other justices, I think, and are calling for other people to file lawsuits that might make their way up to the Supreme Court that will challenge these long-standing precedents that protect, again, not just press freedoms, but the right of a person in a community to circulate a petition, for example, or make a comment on Facebook about their mayor, things like that. So this is not just about protecting journalists. It’s really about protecting anyone who wants to stand up and have their voice heard on matters of public importance.\n\nAMY GOODMAN: Where does Neil Gorsuch stand?\n\nDAVID ENRICH: Gorsuch has joined Thomas in wanting to have this overturned. And his views really — and he views Sullivan as protecting all sorts of online defamatory speech. The arguments that he has made — I mean, one of the things I do in this book is really deconstruct those arguments. And it turns out, a lot of them are premised on not just kind of faulty logic, but inaccurate data that he cited, that he got from a law review article that was filled with a lot of false assumptions and kind of misinterpreted data. And so, he has actually had to correct his opinion calling for the overturning of New York Times v. Sullivan, but it is still being cited to this day by the conservative legal movement as one of the real kind of sources of information and authority that should be used to overturn it.\n\nAMY GOODMAN: You begin your book, the prologue, “A Panicked Phone Call.” You tell the story of Guy Larson [sic]. Tell us who he — Guy Lawson — is.\n\nDAVID ENRICH: So, Lawson is an American journalist and author who wrote a book that became the basis for the movie War Dogs, with — starring Jonah Hill. And the book basically tells the story of how these three stoners from Miami Beach become international arms traffickers. It’s kind of a rollicking, really fascinating tale. Some of the action is set in Albania. And there’s a bit part in the book played by the son of Albania’s former prime minister, who is kind of an autocratic strongman. And the details in the book, as far as I’ve been able to determine, were completely accurate. But for argument’s sake, the son of the strongman claims that he was kind of smeared in the book and that some of the facts were wrong, so he filed a lawsuit against Lawson in U.S. court, and it’s worked its way — it’s been kind of years winding its way through the legal process. It got dismissed by multiple courts. But years later, it worked its way up to the Supreme Court, and it became one of the latest vehicles to try and challenge Sullivan.\n\nAnd it was seized on by people who had been inspired by Clarence Thomas, who had basically issued an open invitation to lawyers and, you know, prospective litigants, begging them to bring him a case that he could used to overturn Sullivan. It made its way up to the Supreme Court. They did not get enough votes to actually overturn Sullivan, or even hear the case, but it became another vehicle for Clarence Thomas and Neil Gorsuch to really, you know, bring this issue much more to public light and to argue forcefully that Sullivan should be overturned. And those calls, while unsuccessful — they did not get the Supreme Court to change the legal standard — they inspired hordes of lawyers, activists and other judges at lower levels across the country to really lean into this argument. And you can look at cases all over the country, and you can see that they are slowing down, they are taking longer, they’re not getting dismissed as quickly. And that creates all sorts of pain and difficulties for — especially for local and independent journalists, who now have much kind of higher odds of being dragged through expensive litigation.\n\nAMY GOODMAN: So, you talk about — let’s look a some of the cases that President Trump is involved with right now. He sues ABC. He sues The Des Moines Register. He sues CBS. Is he trying to bring these cases to the Supreme Court? Now, of course, ABC, there was a settlement. Explain what these cases were about and what it means to settle.\n\nDAVID ENRICH: Yeah, well, first of all, Trump is very much trying to get a case to the Supreme Court that will lead to the overturning of Sullivan. I don’t think any of those three cases you mentioned are the likely vehicles, but there are a bunch of others working their way through the federal appeals system that I think stand a much better chance.\n\nThese more recent lawsuits against ABC, CBS and The Des Moines Register are all pretty clearly efforts by Trump and his allies to weaponize the law to get — to kind of punish criticism and to deter others from speaking up and saying critical things. And they involve different legal theories. The ABC case was a straight-up defamation case. The Des Moines Register and the —\n\nAMY GOODMAN: I mean, ABC case, where George Stephanopoulos had said President Trump —\n\nDAVID ENRICH: Yeah.\n\nAMY GOODMAN: — was found civilly liable for rape. Now, again — \n\nDAVID ENRICH: Yeah.\n\nAMY GOODMAN: — the judge in the case said, in common parlance, this case would be about rape.\n\nDAVID ENRICH: Yeah, and even in the technical details, that he was actually found liable by the jury for sexual abuse, not rape. But so, even if you assume, for argument’s sake, that that’s an important difference and that Stephanopoulos got it wrong — and I think Stephanopoulos would say he didn’t get it wrong — but for argument’s sake, let’s say he did get it wrong. That is exactly the type of mistake that is supposed to be protected by New York Times v. Sullivan, because it is an honest, good-faith error, and you should not be held liable. ABC nonetheless decided that it was prudent to settle this case.\n\nAMY GOODMAN: Or Disney did —\n\nDAVID ENRICH: Well, right.\n\nAMY GOODMAN: — which owns ABC.\n\nDAVID ENRICH: Disney, as parent company, did. And, I mean, I think the rationale for that — and we’re seeing this play out in other settings, as well — is that these big multinational companies, that have varied interests, are trying to protect their corporate interests and do not feel like having outstanding litigation against the president of the United States is in their best interest, and so they are, pretty clearly, I think, taking the side of their profits in the long term over the First Amendment concerns that many of their journalists have. And you’re seeing a very similar dynamic playing out with CBS right now.\n\nAMY GOODMAN: And CBS is the case of 60 Minutes.\n\nDAVID ENRICH: Yeah.\n\nAMY GOODMAN: And Trump is suing them for $20 billion, I think, at this point, for how they edited a Kamala Harris piece.\n\nDAVID ENRICH: Yeah, and this is the very definition of what I think is a meritless lawsuit. And at the time the lawsuit was filed, there were some discrepancies in the way CBS kind of cut or aired parts of Kamala Harris’s interview with 60 Minutes. We now have the full, unedited transcript. We have the full, unedited recordings of those interviews. And it is plainly clear, objectively, that the interview, while edited, was not done so deceptively. There are not material differences between the different things that aired on different CBS shows. And so, the lawsuit, clearly, to me at least, and certainly all the legal observers I’ve spoken to, with the exception of people aligned with Trump, is not a strong legal argument. And yet, CBS’s parent company, which has a multibillion-dollar merger pending, that it needs —\n\nAMY GOODMAN: Paramount.\n\nDAVID ENRICH: Yeah — that it needs federal approval for, has started talking with the Trump side about possibly settling this. And the rationale, again, is quite clear: They are concerned, on the Paramount side, that if they do not settle this, that the Trump administration is going to essentially punish them by holding up this multibillion-dollar merger. And so, you have journalists and, I think, media executives at CBS who are apoplectic about the prospect of settling this, because, A, they are on very strong legal footing, and, B, it would set a terrible precedent that the companies are going to cave to this kind of legal extortion. But I think — we’ll see what happens.\n\nAMY GOODMAN: How does protection of the press in the United States compare to other countries? And talk about libel tourism.\n\nDAVID ENRICH: Yeah. So, the U.S. is — the First Amendment is a really special thing in the U.S. It’s one of the things that distinguishes America from many other democracies. So, if you look at countries like the U.K., for example, or Australia, which are, you know, very democratic — small-D democratic countries, it is much harder for journalists and others to write critical things or to investigate powerful people and institutions in those countries, because their libel laws make it much easier to sue, and that also allows you to much more easily and kind of potently threaten people.\n\nAnd so, you have — in the U.K., for example, we’ve had this phenomenon, as you just said, called libel tourism, where people, rich people, like Russian oligarchs, and big companies file lawsuits against journalists from all over the world in the British court system. And that has created a real chilling effect even for American journalists, who sometimes find themselves getting sued in British courts just because you published something. It goes online. It’s accessible probably everywhere in the world. That can expose you to liability in the British court system.\n\nNow, it’s getting a little bit harder to actually bring those suits right now, but, to me, it’s a really clear reminder of the importance of the protections we have in the U.S. It really does differentiate this country from many others. And it means we have a much more robust and aggressive media. And again, it also means that just normal people who want to circulate a petition online can do so without fear that if they get a fact wrong, they are not going to be bullied and intimidated and potentially sued because of just minor inaccuracies.\n\nAMY GOODMAN: So, finally, after you wrote this book, Murder the Truth: Fear, the First Amendment, and a Secret Campaign to Protect the Powerful, were you more or less hopeful?\n\nDAVID ENRICH: Oh my goodness, less hopeful. We have a real problem right now in this country. We have very strong legal protections, and yet people and companies and institutions are, on a daily basis, threatening journalists and threatening normal people, and they are getting their way a lot of the time, and that’s with our legal protections in place. And the assault on these protections is very much underway. It’s a very much alive threat, I think. And we’re seeing the White House engage in this almost on a daily basis, it seems. So I think the threat is growing, and it has huge implications for our democracy and the ability of everyone to speak their mind and criticize powerful people.\n\nAMY GOODMAN: We’re going to talk about some of the particular cases you look at in the book after the show, and we’ll post it as a web exclusive at democracynow.org. David Enrich, New York Times business investigations editor. His new book, just out, Murder the Truth: Fear, the First Amendment, and a Secret Campaign to Protect the Powerful.","summary":"The new book Murder the Truth: Fear, the First Amendment, and a Secret Campaign to Protect the Powerful by The New York Times business investigations editor David Enrich chronicles an ongoing campaign by the wealthy and powerful to overturn the landmark Supreme Court decision New York Times Co. v. Sullivan, which in 1964 established bedrock protections against spurious defamation and libel cases in the U.S. legal system. By “subject[ing] people to this torturous, long-running and extremely expensive legal process,” those who can afford to pay for expensive and threatening defamation lawsuits can silence any public criticism and suppress others’ rights to free speech, says Enrich. “It has huge implications for our democracy and the ability of everyone to speak their mind.”\n\n\n\n\n\n\n\nThis is a rush transcript. Copy may not be in its final form.\n\nAMY GOODMAN: This is Democracy Now!, democracynow.org, The War and Peace Report. I’m Amy Goodman.\n\nWe turn now from attacks on the right to protest to attacks on press fre","url":"https://www.alternet.org/new-york-times-co-v-sullivan/","image":"https://www.alternet.org/media-library/image.jpg?id=56038851&width=1200&height=600&coordinates=0%2C369%2C0%2C370","video":null,"publish_date":"2025-03-20 17:49:54","author":"Amy Goodman,Democracy Now","authors":["Amy Goodman","Democracy Now"],"language":"en","source_country":"us","sentiment":0.024},{"id":302340376,"title":"Wrestling Legend Being Discussed For WWE Hall Of Fame 2025: Report","text":"There's speculation that James \"Kamala\" Harris may be inducted into the WWE Hall of Fame this year.Kamala, known for his iconic \"Ugandan Giant\" persona, captivated audiences with his fearsome, \"wild savage\" character, complete with distinctive face and body paint, a loincloth, and a spear. He was often accompanied by handlers, aka managers, who appeared to control his actions.During the 1980s and 1990s, Kamala had several stints in WWE, where he engaged in prominent feuds with wrestling icons such as Hulk Hogan and The Undertaker. Beyond his WWE career, he also competed in notable promotions like WCCW, Mid-South Wrestling, USWA, and WCW.More News: Jade Cargill Involved In Backstage Confrontation With WWE Star: ReportAccording to WrestleVotes, WWE has held discussions regarding the induction of the former wrestling star into their Hall of Fame. Should he be selected, he would join Triple H and Lex Luger as part of this year's class.\"According to sources, another name being discussed internally for the WWE Hall of Fame Class of 2025 is 'The Ugandan Giant' Kamala,\" WrestleVotes said.\"Kamala, who had a successful career throughout the '80s and '90s, is expected to join Triple H, Lex Luger, and others in this year's class.\"Due to complications from high blood pressure and diabetes, a condition he had since 1992, Kamala had his left leg amputated below the knee on November 7, 2011. His refusal of dialysis treatment necessitated his retirement. In April 2012, his right leg was also amputated below the knee.In July 2016, Kamala was among the former wrestlers involved in a class-action lawsuit against WWE. The lawsuit, filed by attorney Konstantine Kyros, alleged that wrestlers suffered traumatic brain injuries during their time with the company and that WWE concealed the associated risks.This lawsuit was one of several filed by Kyros against WWE. In September 2018, District of Connecticut judge Vanessa Lynne Bryant dismissed the lawsuit. Some speculated that his participation in the lawsuit likely hindered his chances of being inducted into the WWE Hall of Fame.On August 5, 2020, during the COVID-19 pandemic, Kamala tested positive for the virus in Mississippi and was hospitalized. The virus attacked his existing diabetes complications, leading to cardiac arrest on August 9, 2020. He passed away later that afternoon at the age of 70.More WWE News:\nCody Rhodes Rejected The Rock's Legitimate Push For Him To Turn Heel\nWWE's Plans For Next Saturday Night's Main Event Revealed\nRic Flair Sends Warning To John Cena Ahead Of WWE WrestleMania\nFor more on WWE, head to Newsweek Sports.","summary":"WWE is discussing the possibility of inducting a legend into the Hall of Fame.","url":"https://www.newsweek.com/sports/wrestling/wrestling-legend-being-discussed-wwe-hall-fame-2025-report-2048072","image":"https://d.newsweek.com/en/full/2521590/wwe-hall-fame.jpg","video":null,"publish_date":"2025-03-20 17:36:34","author":"Andrew Ravens","authors":["Andrew Ravens"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.141},{"id":302338588,"title":"Dean Phillips calls out 'great way to lose even more Democrats' as Tim Walz bashes Elon Musk","text":"Former Rep. Dean Phillps, D-Minn., has suggested that bashing billionaire business magnate Elon Musk will not be a winning political strategy. \"Objecting to his initiative is one thing, but calling @ElonMusk, a US citizen who’s built some of the most innovative companies in world history, a \"South African nepo baby\", is a great way to lose even more Democrats,\" Phillips noted in a Wednesday post on X. Minnesota Gov. Tim Walz recently used that phrase to refer to Musk, who is spearheading an effort to expose government waste and fraud. ELON MUSK CONGRATULATES SPACEX, NASA FOR ‘EXCELLENT WORK’ RESCUING STRANDED ASTRONAUTS \"And there's nothing conservative about an unelected, South African nepo baby firing people at the VA,\" he said last week during remarks in Iowa. He also deployed the phrase while speaking in Wisconsin on Tuesday, according to the New York Times, which also reported that he had called Musk a \"dips---.\" ELON MUSK CALLS JIMMY KIMMEL AN ‘UNFUNNY JERK’ AFTER HE APPEARS TO MAKE LIGHT OF TESLA ATTACKS Walz was then Vice President Kamala Harris' running mate when she sought the presidency last year, but the Democratic duo lost to the Republican ticket headed by political juggernaut, now-President Donald Trump. \"Regardless of one’s opinion of Musk, this is a great strategy for further alienating center right and center left Americans and losing federal elections,\" Phillips opined earlier this month when retweeting a post that featured footage of Rep. Alexandria Ocasio-Cortez, D-N.Y., calling Musk a \"billionaire con man with a lot of money.\" ‘SQUAD’ DEM AYANNA PRESSLEY TRASHES ELON MUSK, CALLING HIM A ‘NAZI NEPO BABY’ CLICK HERE TO GET THE FOX NEWS APP Rep. Ayanna Pressley, D-Mass., has called Musk a \"Nazi nepo baby.\" Phillips mounted a Democratic presidential primary bid in 2023 but ultimately dropped out in 2024.","summary":"Former Rep. Dean Phillips, a Democrat, suggested that calling Elon Musk a &quot;&apos;South African nepo baby,&apos; is a great way to lose even more Democrats.&quot;","url":"https://www.foxnews.com/politics/dean-phillips-calls-out-great-way-lose-even-more-democrats-tim-walz-bashes-elon-musk","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/phillips-musk.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-20 17:29:52","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","category":"politics","source_country":"us","sentiment":-0.258},{"id":302352654,"title":"'More for us': Conservative rips Trump’s tariff policy as 'get ready to eat less'","text":"When David Frum and other Never Trump conservatives were rooting for then-Vice President Kamala Harris in the 2024 election, they laid out a variety of reasons why, despite some policy differences, they considered her a much better choice than Donald Trump. \n\nOne was foreign policy: Trump's favorable view of Russian President Vladimir Putin was a major concern for Frum, MSNBC's Joe Scarborough and other Never Trumpers. Another was economic policy: Harris shared Never Trumpers' opposition to the aggressive tariffs Trump was proposing. \n\nPresident Trump, after returning to the White House, didn't back down on tariffs and is getting the U.S. into an all-out trade war with long-time allies that include Canada, Mexico and countries in the European Union (EU). And both consumers and businesses, Frum warns in an article published by The Atlantic on March 18, can expect to suffer as a result. \n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs\n\nFrum makes his point by comparing Trump unfavorably to the late Sen. Robert A. Taft (R-Ohio), who was a candidate in the 1948 GOP presidential primary but lost to New York Gov. Thomas A. Dewey (who lost to incumbent President Harry Truman in the general election). Sen. Taft was the oldest son of former President William Howard Taft, and Democrats, Frum recalls, hammered him mercilessly because of some comments he made about rising food prices in 1947. \n\nSen. Taft argued, \"Voluntary reduction of consumption is the first step. We should eat less.… eat less meat and eat less extravagantly.\"\n\n\"At Taft's next appearances,\" Frum explains, \"hecklers chanted, 'Eat less, eat less.' Democrats ridiculed him as 'Eat-Less Taft.' The following year, Republicans rejected Taft as their nominee in favor of the more progressive and internationalist Thomas Dewey, the governor of New York. The GOP had lost its momentum: At the general election, the Democrats held the presidency and regained control of the House and Senate.\"\n\nFrum continues, \"I think of 'Eat-Less Taft' as I hear President Donald Trump's appointees defend their administration's consumer-crushing tariffs.\"\n\nREAD MORE: Busted: Report exposes Musk operatives who infiltrated Social Security Agency\n\nTrump has said that although his tariffs may cause some short-term pain, they will lead to a major economic boom down the road —an argument that Frum considers badly flawed.\n\n\"President Trump alluded to an impending 'disturbance' in his March 4 speech to a Joint Session of Congress,\" Frum writes. \"Questioned later in the Oval Office about a possible recession, he euphemistically acknowledged a 'period of transition' ahead. So get ready to eat less. At least Taft's message offered some kind of hope at the end — and, of course, it wasn’t Taft's personal fault that food prices had risen. But Trump's tariffs are Trump’s fault, and it's clear that if he has his way, they will be permanent…. Trump is a flimflam man who will promise anything to anybody and count on the suckers forgetting tomorrow what he said yesterday.\"\n\nFrum adds, \"His Cabinet officers, however, are gradually revealing the true cost of the Eat Less scam. They do not match Taft's self-harming candor. But their real message of 'Less for you, more for us' is reverberating louder and clearer.\"\n\nREAD MORE: 'The threat is extremely real': Critics sound alarm over Trump 'emergency","summary":"When David Frum and other Never Trump conservatives were rooting for then-Vice President Kamala Harris in the 2024 election, they laid out a variety of reasons why, despite some policy differences, they considered her a much better choice than Donald Trump. \n\nOne was foreign policy: Trump's favorable view of Russian President Vladimir Putin was a major concern for Frum, MSNBC's Joe Scarborough and other Never Trumpers. Another was economic policy: Harris shared Never Trumpers' opposition to the aggressive tariffs Trump was proposing. \n\nPresident Trump, after returning to the White House, didn't back down on tariffs and is getting the U.S. into an all-out trade war with long-time allies that include Canada, Mexico and countries in the European Union (EU). And both consumers and businesses, Frum warns in an article published by The Atlantic on March 18, can expect to suffer as a result. \n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs\n\nFrum makes his point by ","url":"https://www.alternet.org/trump-tariffs-david-frum/","image":"https://www.alternet.org/media-library/image.jpg?id=58368413&width=1200&height=600&coordinates=0%2C39%2C0%2C39","video":null,"publish_date":"2025-03-20 17:23:55","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":0.014},{"id":302425700,"title":"Pinstripes are on catwalks and in the White House. Is there more to this look than money and privilege?","text":"Conor McGregor knows his way around the octagon. He also knows his way around a courtroom – last November, the UFC fighter was found liable for rape in a civil case in Ireland. And now he knows his way around the White House too – the US seat of power that is all too welcoming for sexual predators. Visiting the American capital this week, McGregor met Donald Trump in the White House on Saint Patrick’s Day, wearing an outfit that had the markings of a man after the president’s own heart: a three-piece pinstripe suit.\n\nTrump loves a suit, so you can also easily imagine that the New York tycoon in him loves a Gordon Gekko-esque pinstripe. McGregor’s meeting was strongly condemned by Ireland’s taoiseach, while an Irish rape crisis charity described it as “sinister”. But, with his sartorial choices, McGregor showed himself to be the latest Trump loyalist with a penchant for a strong-lined suit.\n\nRobert F Kennedy Jr, Trump’s secretary of health and human services, has worn the delineated style to testify before the Senate, as well as in cabinet meetings. Stephen Miller, the ideological anti-immigration firebrand who is one of the architects of Trump’s callous “zero tolerance” family separation policies, is a fan. On this side of the Atlantic, Nigel Farage is also partial.\n\nNot to be glib about the hate-filled politics of the Trumpian right, but, whether consciously or not, these outfit choices trace a through-line between the kind of politics these figures espouse and the kind of message a pinstripe signals – elitism, wealth, power and privilege.\n\nBut the fact that the manosphere and its adjacents are wearing the look hasn’t stopped the largely progressive fashion world from getting in on the trend of late. At the most recent shows, a subtle line was sketched up and down suits and overcoats at Calvin Klein in an ode to CK 90s chic. At the Coach show, watched over by Kamala Harris’s stepdaughter Ella Emhoff, pinstripe was styled in the kind of high-low petri dish way younger generations tend to throw outfits together – over boxer short-style shorts with T-shirts grunged with scribbled messages. It was there at the debut show of Haider Ackermann for Tom Ford, slinking out from underneath belted, croc-collared overcoats. As well as a glut of others: Armani, Khaite, Dior, Dolce & Gabbana, Moschino, Ralph Lauren and Stella McCartney. In Berlin, the inclusive brand Richert Beil often uses pinstripe in its gender-questioning designs.\n\nIn the world of pop culture, pinstripe charts its own course. “Hot,” Charli xcx captioned on a picture of herself wearing a pinstripe Vivienne Westwood bustier earlier this year – a homage, surely, to Carrie Bradshaw when she got drunk at Vogue. A$AP Rocky would have looked like an extra from Bugsy Malone had he not had Rihanna on his arm, as he appeared outside an LA court after he was acquitted of two felony counts of assault last month.\n\nWhile Trump’s supporters seem to favour bolder, brasher lines, even the most subtle pinstripe is instantly communicative of entitlement and excess – it feels ramped up in an 80s-coded Wall Street way. Perhaps that is what makes it so tempting to toy with. Worn by Charli xcx, its businesslike attitude makes the boardroom seem brat. It is corpcore rather than corporate, a kind of cosplay of the office rather than anything to do with actual spreadsheets and quarterly reviews.\n\nThe lines are loaded, and McGregor knows it, having used pinstripe in the past to transmit a very direct message to his opponent Floyd Mayweather Jr: written into the stripes of a suit he wore pre-fight were the words “Fuck You”. And Jeremy Corbyn also knows a thing or two about packing a punchy message in a pinstripe. On the campaign trail in Whitby in 2019, he touted a bespoke suit with his motto, “For the many, not the few” stitched into the Labour-red pinstripes. Pinstripe is clearly a stripe for all.\n\nTo read the complete version of this newsletter – complete with this week’s trending topics in The Measure and your wardrobe dilemmas solved – subscribe to receive Fashion Statement in your inbox every Thursday.","summary":"Whether worn by RFK Jr or Jeremy Corbyn, a strong-lined suit portrays a very particular message. Now, everyone from A$AP Rocky to Charli xcx is getting in on the action\n\nConor McGregor knows his way around the octagon. He also knows his way around a courtroom – last November, the UFC fighter was found liable for rape in a civil case in Ireland. And now he knows his way around the White House too – the US seat of power that is all too welcoming for sexual predators. Visiting the American capital this week, McGregor met Donald Trump in the White House on Saint Patrick’s Day, wearing an outfit that had the markings of a man after the president’s own heart: a three-piece pinstripe suit.\n\nTrump loves a suit, so you can also easily imagine that the New York tycoon in him loves a Gordon Gekko-esque pinstripe. McGregor’s meeting was strongly condemned by Ireland’s taoiseach, while an Irish rape crisis charity described it as “sinister”. But, with his sartorial choices, McGregor showed himself to be the latest Trump l","url":"https://www.theguardian.com/fashion/2025/mar/20/pinstripes-took-over-the-white-house-and-now-corpcore-has-invaded-the-catwalk","image":"https://i.guim.co.uk/img/media/12b71a7905e6a864aab0f8fac47beafca70c07e8/0_0_3836_2303/master/3836.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmY","video":null,"publish_date":"2025-03-20 17:00:35","author":"Ellie Violet Bramley","authors":["Ellie Violet Bramley"],"language":"en","source_country":"us","sentiment":0.044},{"id":302320958,"title":"Burn, baby, burn: How Trump 2.0 is a first-class shock-and-awe experience","text":"Yes, “shock and awe” is back in the second age of Donald Trump. His border czar, Tom Homan, used that very phrase to describe border policy from day one of the new administration and, whether the president has actually said it or not, it’s now regularly in headlines, op-eds, and so much else. If you remember, it was the phrase used, in all its glory, to describe America’s massive bombing and invasion of Iraq in 2003. (You remember! The country that supposedly threatened us with nuclear weapons but, in fact, didn’t have any!)\n\nWe Americans were, of course, going to shock and awe them. But from that moment on (if not from the moment, in the wake of the 9/11 attacks, when, rather than simply going after Osama bin Laden and crew, President George W. Bush launched a full-scale invasion of Afghanistan), you could say that it was we who were truly shocked and awed. After all, in their own disastrous fashion, our post-9/11 wars prepared the way for… yes!… Donald Trump to take the White House the first time around (shock and awe!)—and then blame the final disastrous retreat of the American military from Afghanistan in 2021 on the Biden administration. (“Kamala Harris, Joe Biden—the humiliation in Afghanistan set off the collapse of American credibility and respect all around the world.”) And of course, four years later, his reelection on a functional platform of Trump First, Americans Last, was distinctly a double shock and awe!\n\nTariff by tariff, tax by tax, act by act, Donald Trump stands a reasonable chance of taking this planet down with him. \n\nAnd if you’ll excuse my being thoroughly repetitious, that was—or at least should have been seen as—the true definition of shock and awe. Donald Trump! Twice! Even now, can you truly take it in? In fact, more or less every moment since his reelection victory in November 2024 has been—pardon me for the turn of phrase—a first-class S&A experience.\n\nAnd—shock, if not awe—I haven’t even mentioned Elon Musk yet, have I? I mean, who can take him in either? The richest man on Planet Earth (S&A!) and, at least until President Trump levied those massive tariffs on our three major trading partners (only to partially back off soon after), still making money hand over fist (wrist, pissed?)—about $224 billion extra dollars (S&A!) just between the November 2024 election victory of Donald Trump and the moment he actually took power again in January 2025—at the expense of the rest of us. Meanwhile, he’s been more or less running this country (into the ground) hand in glove with Donald Trump, who, by the way, is already talking about a possible third term in office! (“They say I can’t run again; that’s the expression… Then somebody said, I don’t think you can. Oh.”) Now, wouldn’t that be an all-American S&A first (or do I mean last?)!\n\nAn MMMW World\n\nPhew, I’m already out of breath and exclamation points! No surprise there, of course, given the awesomely shocking and shockingly Trumpified (or do I mean Muskratted?) world we’re now living in and dealing with.\n\nAfter all, we once again have a president who himself is (or may be—since you never know with him) a multi-billionaire and has at his side the DOGE-y man with a totally made-up position and an organization that nonetheless seems to have the power to dismantle whole parts of our government. (Science? Medicine? Who needs them? Veterans, who cares?) He could evidently even purchase Mars (and donate his sperm to help colonize that planet). And imagine this: Despite all the dough they and their billionaire pals possess—there are at least 13 of them in his administration, worth something like $460 billion—Elon and he seem intent on shoving through Congress a plan that would make his tax cuts for billionaires a permanent feature of American life (whatever it may cost the rest of us).\n\nDon’t try to tell me that we’re not in a mad, mad, mad world (MMMW, if you prefer). And hey, the man who only recently set a record by spending more than an hour and 40 minutes giving the longest State of the (Dis)Union speech or speech of any sort ever to a joint session of Congress has done a remarkable job of foisting his version of an America First (Foist? Last?) policy on the rest of us and this world—a world that distinctly isn’t ours, but his. Think of us as now living in a Trump First World, or TFW. Of course, his version of America First includes those recent tariffs (some but not all of which have been delayed again) that, though officially levied against Canada, China, and Mexico, were actually being foisted on the rest of us. Count on one thing: In the end, we will undoubtedly pay through the nose for them. So, no question about it, we have certainly entered a distinctly S&A era.\n\nThe Double D of Donald\n\nIn truth, the 45th and 47th ( and 48th and 49th?) president of the United States is a genuinely remarkable figure. Truly historic—or do I mean hysteric? After all, who can’t bring some image of him to mind at any moment? That face, that stare, that glare, that red tie, that wave in his hair. Need I say more?\n\nIn his own remarkable fashion, he should be given full credit and a double capital D—for both Donald and Decline. Or just think of him as PD (for President Decline). And it is remarkable that a single figure, one man who once oversaw the bankruptcy of six different companies he had launched, could become responsible for potentially the greatest bankruptcy of all—the ending of the American Century (as we once knew it) and even, after a fashion, humanity’s centuries on Planet Earth.\n\nI mean, who can even remember anymore the time in a distant century—the year was 1991, to be exact, the very moment when Donald Trump filed for bankruptcy for the Trump Taj Mahal and the year before he did the same for the Trump Plaza Hotel—when the Soviet Union went into the garbage pail, China had not yet truly risen, and this country was left alone as not just a great power but The Great Power or TGP, the only one left on Planet Earth? That, in retrospect, was a truly shock-and-awe moment. And isn’t it no less shock-and-awing to think that a mere 34 years later, that same country is now led by a raging maniac on an America First platform that could, in effect, prove to be an America Last one? In a mere two terms in office, he will have taken what was once known as the planet’s “sole superpower” into a world of chaos and, ultimately, disaster of a sort we still can’t really grasp. He will have been the monarch—and yes, that’s the appropriate word, not president—from hell. (In fact, the White House digital strategy team all too appropriately produced a portrait of President Trump with a golden crown and the phrase “LONG LIVE THE KING”!)\n\nAnd if that (and he) isn’t the definition of shock and awe, what is?\n\nBurn, Baby, Burn\n\nWorse yet, tariff by tariff, tax by tax, act by act, Donald Trump stands a reasonable chance of taking this planet down with him. Think of it as little short of remarkable that, in a world in which every month, every year (and every decade) is hotter than the previous one in a record fashion, in a world in which the weather and its devastating effects—from fires to storms to floods—is only growing more extreme and more horrific, Americans freely voted in (a second time around!) someone whose election phrase of choice was “drill, baby, drill,” but might as well have been “heat, baby, heat” or “storm, baby, storm,” or simply “burn, baby, burn.”\n\nAnd if his platform was America First (but truly Donald First), it distinctly should have been Planet Earth Last. (Of course—don’t be shocked—he also appointed as secretary of health a man who thinks that the way to fight measles outbreaks is with anything but a vaccine.) Yes, above all else, Donald Trump, who has called climate change both a “scam” and a “Chinese hoax,” continues to be focused on making sure that ever more oil, natural gas, and coal comes out of the ground and is indeed burned, baby, burned forever and a day.\n\nConsider it a remarkable historical irony that America First has remained Donald Trump’s slogan all these years when, in reality (or what passes for it in his universe), it should certainly have been Trump First and, when it came to anything that truly mattered to him, America (not to speak of the rest of the world) Last!\n\nOf course, no one should be surprised, given the way the fossil fuel companies funded his campaign. He’s already gone out of his way to cancel anything the Biden administration did to fight climate change and announced the country’s departure from the Paris climate accords (again). As The New York Timesput it recently, “In a few short weeks [of his second term in office], President Trump has already severely damaged the government’s ability to fight climate change, upending American environmental policy with moves that could have lasting implications for the country, and the planet.” What he’s doing is now considered a “deep freeze” on climate programs of all sorts (though it might better be thought of as a hot melt).\n\nAt one point, he was even talking about eliminating 65% of the employees at the Environmental Protection Agency (S&A!). Lasting implications indeed.\n\nIn any other era, President Trump would still undoubtedly have been considered a nightmare and a half, but not a potentially world-ending one (at least the world as humanity has known it all these endless centuries). The truth is that, once upon a time, if you had told anybody that this would be our S&A version of the future, you would have been laughed out of the room.\n\nThe Second Time Around with No End in Sight\n\nAnd yet, there can be no question that, all these years later, despite bankruptcy after bankruptcy, and failure after failure, he remains the man of the second, minute, hour, day, week, month, and year. Give him credit. It’s a remarkable record not just when it comes to the success of failure but of putting Himself (and yes, under the circumstances, I do think that should be capitalized!), not America First.\n\nOh, and while all of this has been going on, the Democratic Party has not completely but largely been missing in action. Imagine that! And as for Congress, remind me what it is (other than an audience for You Know Who).\n\nConsider it a remarkable historical irony that America First has remained Donald Trump’s slogan all these years when, in reality (or what passes for it in his universe), it should certainly have been Trump First and, when it came to anything that truly mattered to him, America (not to speak of the rest of the world) Last!\n\nWorse yet, if all of us hadn’t actually lived through the Trumpian epoch (epic? toothpick?), I don’t think anyone could have made this up or, in a previous version of America, even imagined it happening. And if they could, there can be little question that they would simply have been laughed out of the room, if not institutionalized, not once but twice.\n\nAnd yet here we are, the second time around with no end in sight, and a third time a history-breaking possibility, leaving us fully and thoroughly in another America on another planet. Phew! Talk about shock and awe!\n\nI must admit, with at least three years and 10 months to go in the era of You Know Who, I find it hard to imagine our future, even if (as is certainly possible) the American and global economies go down the tubes and the Democrats are swept back into Congress—I’m sorry, where?—in 2026.\n\nNonetheless, for the (un)foreseeable future, we’re all living with Donald Trump in a genuinely shock-and-awe world of almost unpredictable strangeness. In some fashion, all of us are now Afghans or Iraqis.\n\nNOW READ: Wake up: In Trump’s America, you are no longer guaranteed your rights or your freedom","summary":"Yes, “shock and awe” is back in the second age of Donald Trump. His border czar, Tom Homan, used that very phrase to describe border policy from day one of the new administration and, whether the president has actually said it or not, it’s now regularly in headlines, op-eds, and so much else. If you remember, it was the phrase used, in all its glory, to describe America’s massive bombing and invasion of Iraq in 2003. (You remember! The country that supposedly threatened us with nuclear weapons but, in fact, didn’t have any!)\n\nWe Americans were, of course, going to shock and awe them. But from that moment on (if not from the moment, in the wake of the 9/11 attacks, when, rather than simply going after Osama bin Laden and crew, President George W. Bush launched a full-scale invasion of Afghanistan), you could say that it was we who were truly shocked and awed. After all, in their own disastrous fashion, our post-9/11 wars prepared the way for… yes!… Donald Trump to take the White House the first time around (sh","url":"https://www.alternet.org/trump-shock-and-awe/","image":"https://www.alternet.org/media-library/image.jpg?id=56126969&width=1200&height=600&coordinates=0%2C143%2C0%2C144","video":null,"publish_date":"2025-03-20 16:59:18","author":"Tom Engelhardt","authors":["Tom Engelhardt"],"language":"en","source_country":"us","sentiment":-0.116},{"id":302322156,"title":"JD Vance says he doesn't have 'four shots of vodka' before every meeting unlike Kamala Harris","text":"Vice President JD Vance confirmed what has been there in the form of rumors, trolling and speculations that former vice president Kamala Harris was always 'high as a kite'. However, JD Vance's statement also came in the form of a joke when he was asked how he does things differently from his predecessor. \"Well, I don’t have four shots of vodka before every meeting,” Vance laughed in an interview with radio host and Daily Caller editorial director Vince Coglianese.“That’s one way that I think Kamala really tried to bring herself into the role, is these word salads,” Vance added, “and I think that I would need the help of a lot of alcohol to answer a question like Kamala Harris answered a question.”Apart from her 'word salads' which are a collection of high-sounding words strung together signifying nothing, Kamala Harris is often trolled for the singsong tone in which she speaks which people think is because of her alleged day drinking problem. Several of her appearances struck social media users as being 'drunk' though there is no report confirming any type of alcohol abuse the former vice president may have had. — ThomasSowell (@ThomasSowell) In one of her interviews during the campaigning, Kamala Harris cracked open a Miller High Life beer can with Stephen Colbert which was seen as a cool gesture for a presidential nominee as Joe Biden and Donald Trump are known to be teetotallers. JD Vance too was seen drinking a beer with supporters during the campaigning. He said he liked beer a little bit too much. Kamala Harris' latest public appearance was at an AI conference where she talked about innovation but ended up talking about her famous Doritos with DoorDash serving as the innovation link. “We did DoorDash ’cause I wanted Doritos. And the red carpet part was about to start and nobody wanted to leave to go to the grocery store. So it was DoorDash … So I was willing to give up whatever might be the tracking of Kamala Harris’ particular fondness for nacho cheese Doritos for the sake of getting a big bag of Doritos as I watched the Oscars,” she began.“And that’s right. But here’s the thing: At what point do we also uplift and highlight the consumer’s right to also expect — and you can debate with me if it should be a right — I think it should,” Harris said making many to believe that she was three glasses of wines deep.","summary":"\"Well, I don’t have four shots of vodka before every meeting,” Vice President JD Vance said jokingly when he was asked what he was doing differently than his predecessor. He added that he would need a lot of alcohol if he had to produce Kamla Harris's 'word salads'. “That’s one way that I think Kamala really tried to bring herself into the role, is these word salads,” Vance added, “and I think that I would need the help of a lot of alcohol to answer a question like Kamala Harris answered a question.”","url":"https://timesofindia.indiatimes.com/world/us/jd-vance-says-he-doesnt-have-four-shots-of-vodka-before-every-meeting-unlike-kamala-harris/articleshow/119265773.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-119265860/119265860.jpg","video":null,"publish_date":"2025-03-20 16:35:45","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.212},{"id":302329784,"title":"Michelle Obama says Barack wanted a third child and reveals the reason she didn’t","text":"Michelle Obama says she was only ever interested in being a family of four, but Barack wanted one more baby.\n\nSpeaking to Kylie Kelce in the most recent episode of her podcast Not Gonna Lie, the former first lady said her husband suggested having a third child, and she shot the idea down.\n\n“I was like, I think I've been lucky with these two,” she said of their two daughters Malia, 26, and Sasha, 23. “Barack was like, ‘We should have a third,’ and I was like, ‘Dude.’” \n\nKylie, 32, who’s expecting her fourth child with her husband Jason soon, agreed she would’ve said the same thing if she were her.\n\n“Two good sleepers, I'd call it too,” Kylie told the 61-year-old mother. \n\nMichelle added: “You know, I'm thinking we're gonna get a crazy one.” \n\nReflecting on her experience giving birth to Malia and Sasha, the Becoming author said: “I think the sadness or the postpartum that I felt with my kids really came from, like, you love these babies so much.\n\n“You immediately, you're connected, and you think, ‘Oh my god, all you have is me. I feel so bad for you. I wish you had a parent,’” she noted.\n\nLater in the interview, Michelle spoke about how she believes it’s a good thing Barack is strictly a girl dad. “I told Barack, ‘Dude you need a bunch of women in your life to smack you around,’” she said.\n\nAhead of the 2024 election, there were calls from the Democrats for Michelle to run for president after her husband served two consecutive terms. However, her office quickly made it clear that she wouldn’t be running. \n\n“As former First Lady Michelle Obama has expressed several times over the years, she will not be running for president,” Crystal Carson, director of communications for Michelle, said in a statement sent to NBC News at the time. “Mrs. Obama supports President Joe Biden and Vice President Kamala Harris’ re-election campaign.” \n\nSpeaking to Kylie, Michelle expanded on her decision not to run, explaining she wanted to protect her children. \n\n“I wanted them to have the freedom of not having the eyes of the world on them and so when people ask me would I ever run, the answer is no,” she said. “If you ask me that, then you have absolutely no idea the sacrifice that your kids make when your parents are in that role. \n\n“The thought of, like, putting my girls back into that spotlight when they are just now establishing themselves,” Michelle added. “I think we've done enough… they've already served their time.” \n\nWhen Barack was first elected President of the United States in 2009, Malia and Sasha were 10 and seven, respectively. They would spend the next eight years of their lives living in the White House. \n\nSince their dad exited office in 2017, Malia has graduated from Harvard University, and Sasha has graduated from the University of Southern California.","summary":"The former first lady joined Kylie Kelce on her podcast to discuss her experience as a mother of two","url":"https://www.independent.co.uk/life-style/michelle-obama-barack-children-b2718820.html","image":"https://static.independent.co.uk/2025/03/20/15/35/MixCollage-20-Mar-2025-11-28-AM-5683.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/9HzjxNyY-4VHSaSK0.mp4","publish_date":"2025-03-20 16:16:51","author":"Kaleigh Werner","authors":["Kaleigh Werner"],"language":"en","source_country":"gb","sentiment":-0.019},{"id":302301072,"title":"19 things you probably didn't know about Barron Trump in honor of his 19th birthday","text":"Donald Trump's youngest son, Barron, has finally turned 19 - and it's cause for celebration.\n\nBarron, the only child of President Donald Trump and his wife Melania, was born on March 20, 2006, and has remained largely out of the spotlight as he's grown up.\n\nBarron was born and raised in New York City, and attended school there until 2017, when his dad took office for his first term in the White House.\n\nAt the time, he was the first boy to live in The White House in over 50 years. \n\nOf course, Donald Trump's other children are much older than Barron - he shares sons Don Jr., 47, Eric, 41, and daughter Ivanka, 43, with his late wife, Ivana Trump.\n\nHe also shares daughter Tiffany, 31, with ex Marla Maples.\n\nNow, Barron is all grown up and completing his freshman year at New York University's Stern School of Business.\n\nIn honor of his big day, we've gathered 19 facts about the teen - and some of them may take you by surprise. \n\n 1. He's very particular about his outfits, and he has them custom made \n\nDespite his young age, Barron seems to have an eye for fashion, and he isn't afraid to wear what he wants.\n\nBefore his father's inauguration ceremony this past January, he worked with luxurious company Pearce Bespoke, a 'mobile custom clothing fashion bar,' to secure high-end outfits for the festivities.\n\nThe company, who Barron has favored for years, also has high-profile athletes like Eli Manning, Washington Commanders quarterback Jayden Daniels, and former NFL quarterback Drew Brees among its clients.\n\nSpecifically, Barron works with chief executive officer Nathan Pearce, who was introduced to the first son by internet personality Justin Waller, who is friends with the teen and also a top client of Pearce's, per Women's Wear Daily.\n\n'Justin said he wanted to introduce me to Barron. Literally a week later I was on a flight down to Mar-a-Lago,' Pearce told WWD in a new interview.\n\nTogether, Barron and Pearce picked out multiple suits, dress shirts, and 'an ultra-dark charcoal cashmere overcoat.'\n\n 2. Barron was baptized when he was eight months old \n\nIn December 2006, eight months after he was born, Barron was baptized at the Episcapal Church of Bethesda-by-the-Sea in Palm Beach, Florida, per The Palm Beach Post. \n\nHe was baptized in the Catholic Church, and was of course accompanied by his mom, Melania, and Dad, Donald.\n\nHis older siblings also joined the family for their youngest brother's baptism. \n\nFor the occasion, Barron was dressed in an adorable white onesie and matching booties with frilly socks.\n\n3. He is multilingual, thanks to his mother and grandparents \n\nDuring a 2010 appearance on Larry King Live, Melania revealed that Barron speaks three languages.\n\nOf course, Barron can speak English, but he is also fluent in Slovenian, as his mom hails from Slovenia.\n\nIt's unclear what the third language is, but Melania has spoken about his ability to speak Slovenian at length in the past.\n\nDuring a 2005 interview with People, she divulged that her son often calls his grandmother on the phone, where they speak Slovenian together.\n\n'My opinion is that more languages you speak, better it is, but but when you come to America, you speak English,' she told the outlet at the time.\n\nA recently resurfaced video also showed him speaking with an adorable Slovenian accent when he was just four years old. \n\nIt was taken as part of the Larry King interview in 2010, and the tot was hanging out with his parents in his dad's office at Trump Tower.\n\nBarron, who was dressed in an adorably tiny suit, could be seen running around and picking up a Louis Vuitton briefcase that now sells for almost $10,000.\n\n'I like, I like my suitcase,' Barron said, as he picked up the heavy briefcase and toted it around to his mother Melania.\n\n'I have to go to school now?' he asked his mom. 'Now I'm gonna go?'\n\n 4. He's a podcast fanatic - and even influenced his dad to go on a few during his most recent campaign \n\nAs Donald Trump campaigned for his second term in the 2024 election, he appeared on multiple podcasts with popular hosts such as Joe Rogan and Theo Von.\n\nHowever, he admitted that it was his son, Barron, who helped him with this political move.\n\nThe then 18-year-old first suggested his father appear on YouTuber and wrestler Logan Paul's podcast, Impaulsive, an insider with the campaign told ABC News in October.\n\nAnd, according to Trump campaign senior advisor Jason Miller, Barron was 'very involved' in the process. \n\n'Barron has been very involved in recommending a number of the podcasts that we should do,' Miller told the Politico Playbook Deep Dive podcast this fall. \n\n'I got to tell you, hats off to the young man. Every single recommendation he's had has turned out to be absolute ratings gold that's broke the internet.'\n\n 5. Barron is athletic and has played various sports in the past \n\nWhen his dad made an appearance on Theo Von's podcast in August, the president revealed that his son is quite the athlete.\n\n'He plays golf, soccer, he is very good at soccer. He is a good athlete, Barron,' he told the host at the time.\n\nOf course, Trump loves to play golf, and so does his granddaughter, Kai Trump, 17.\n\nThis year, she committed to play golf at The University of Miami after she graduates high school in 2026.\n\n 6. He doesn't appear to have a girlfriend, but his dad has admitted he's a 'good looking guy'\n\nBarron doesn't appear to have a romantic partner at the moment, but if he does, it's being kept under wraps.\n\nDuring a podcast appearance in October, his dad let it slip that he doesn't think his son has had a girlfriend quite yet.\n\nThe topic came up while Trump was being interviewed by Patrick Bet-David on the PBD podcast.\n\n'Is he good with the ladies in school at NYU? Is he there yet?' the interviewer asked the president.\n\n'No, I'm not sure he's – I don't think he's had a girlfriend yet,' Trump revealed. 'I don't think so. Every once in a while …' he said, before ending the thought in rapid-fire conversation.\n\n'He’s a good looking guy,' Trump added about his towering 6-foot-7 son.\n\n7. Barron has a cheeky sense of humor \n\nAlthough he's remained largely private throughout the years, Barron displayed a bit of a cheeky sense of humor at his father's inauguration ceremony this past January.\n\nIn a video that was captured by reporter Emily Davies at The Washington Post, Barron photobombed a group photo of his three family members during the inauguration.\n\nAs sisters Tiffany Trump and Ivanka Trump, along with their sister-in-law Lara Trump, posed for a group photo, little did they know that 6-foot-7 Barron was towering over them the entire time.\n\nOnce the women turned around, they realized that their little brother was behind them, photobombing the group shot.\n\nHowever, they seemed pleasantly surprised by the 18-year-old, as they flashed huge smiles on their faces while he began to laugh. \n\nIvanka even patted her little brother on the shoulder afterwards, as her face broke out into a grin.\n\nAnd, if that wasn't enough to prove it, his tailor, Nathan Pearce, previously revealed to WWD that the teen is 'hilarious.'\n\n'But as I said, he's super-sharp,' Pearce shared. 'You put him in a room with star businessmen and he will hold his own.'\n\n'He can talk to them all day because he's witty, smart and has a dry sense of humor.'\n\n8. He's 'popular with the ladies' at NYU - even though he doesn't have a girlfriend \n\nEven though he may not have a girlfriend yet, word on the street is that Barron is quite popular with the ladies at NYU's Stern School of Business, where he's a freshman.\n\n'He's a ladies' man for sure. He's really popular with the ladies,' a source revealed to People in December.\n\nThe source continued, 'He's tall and handsome. A lot of people seem to think he's pretty attractive — yes, even liberal people like him.' \n\nIn September, the president confirmed Barron's college choice and said his youngest son was 'accepted to a lot of colleges.' \n\n9. Barron is extremely 'hospitable' to his guests, especially at Mar-a-Lago\n\nBarron is quite the host, and even once treated a guest to a few items from the Mar-a-Lago estate's pro shop.\n\nHis tailor, Pearce, told WWD that the teen made him feel extremely welcomed when he visited him at his home in Palm Beach.\n\n'You know what is another word I would say? Hospitable. He is down-to-earth, nice as can be and hospitable,' Pearce said at the time.\n\nHe told the outlet that not only did Trump shake his hand and thank him multiple times for coming to Mar-a-Lago, but he took him to the estate's shop to pick out some things.\n\nPeerce was then allowed to bill the items to Trump's account.\n\n'I've thoroughly enjoyed getting to know him over the last one or two years,' Pearce said. \n\n 10. The 19-year-old attended schools all throughout the country\n\nAlthough he's back in New York City for college, Barron actually attended elementary, middle and high schools in different locations across the country.\n\nThe youngest son of Trump started elementary school at Columbia Grammar & Preparatory School on Manhattan's Upper West Side.\n\nTuition at the elite school is billed at $64,340 per year, and increases by about $1,000 once you enter high school.\n\nHowever, when Barron was in fifth grade, his dad was elected as president, which meant that he and his mom had to uproot their lives to Washington, D.C.\n\nBut since his dad started his term halfway through the school year in January 2017, Barron remained with Melania in New York to finish up his time at Columbia.\n\nIn September 2017, he started sixth grade at St. Andrew's Episcopal in Potomac, Maryland - just about a 45 minute car drive from Washington.\n\nThe yearly middle school tuition at St. Andrew's cost $52,290.\n\nOnce Trump's first term was up in 2020, Barron moved back to Palm Beach and finished school there, at Oxbridge Academy in West Palm Beach. \n\n11. Barron helped his dad prepare for last year's presidential debate against Joe Biden\n\nBarron's close relationship with his father seems to extend further into the political arena than previously thought, as a recent report claimed that it was the teen who helped him out in preparing for his presidential debate against Joe Biden last year.\n\nIn Axios reporter Alex Isenstadt's book, Revenge: The Inside Story of Trump's Return To Power, he details the great lengths co-campaign managers Susie Wiles and Chris LaCivita went to ensure Trump had a successful debate - and how his son helped. \n\nPrep for the June 27 debate had started several weeks before - with Trump looking to improve upon his Cleveland performance.\n\n'Barron, now a teenager, told him he flapped his gums too much last time and needed to let Biden do more of the talking,' Isenstadt wrote.\n\n'Trump listened to his son, who was expressing some interest in politics and a willingness to be more public after being shielded from the cameras during the White House years,' the book continued.\n\nAnd, it looks like Barron's advice paid off, as Trump was subsequently elected as the president in the 2024 race against Kamala Harris.\n\n12. He likes to play video games, especially FIFA \n\nOne of Barron's hobbies seems to be playing video games, and it's apparently a pastime he is especially passionate about.\n\nAccording to TMZ, Barron has asked some of his fellow NYU classmates for their usernames on Discord - a chat app popular with gamers - so that they can play together.\n\nThe outlet also reported that one of his favorite games to play is FIFA, which allows you to play virtual soccer matches and build your own teams.\n\nThe hobby would mean he has something in common with his dad's friend, Tesla founder Elon Musk.\n\nThis year, Musk and his family joined the Trump's at Mar-a-Lago for Thanksgiving, where he was seated at the same table as Barron.\n\nThe large event resulted in tons of internet memes, and Musk even responded to one, revealing that he spoke to Barron about 'consciousness & video games' at their dinner table. \n\n 13. His zodiac sign is a Pisces\n\nBarron was born on March 20, 2006, which means that his Zodiac sign is a Pisces - a sign that's typically associated with being empathetic, mystical, and romantic, according to Cosmopolitan.\n\nAccording to the outlet, many Pisces are 'blessed with a natural-born empathy,' and have a large imagination.\n\nIn addition to their compassion, many who have the same sign as Barron are quite romantic.\n\nCosmopolitan described the sign as people who 'don't belong in the 21st century' when it comes to romance, and are more traditional in relationships.\n\n'They love to be in love, and don't like anything which shatters that rosy illusion and feeling,' the outlet described.\n\n14. Barron is in the 99th percentile for height \n\nBarron is above average in his height, as he comes in at a tall 6'7. \n\nAccording to a height calculator, his towering presence puts him in the 99th percentile.\n\nHis tall stature likely came from his dad, Donald, who measures in at 6'3.\n\nBut during a 2024 campaign rally, Trump joked that the reason for Barron's staggering height is because he was fond of the food made by his late grandmother, Amalija Knavs.\n\nKnavs is Melania's mother, and she passed away in January 2024 at the age of 78.\n\n'Great people, great parents to all of us, really. Great parents, but also to Barron. Boy, did she take care of Barron,' Trump said of Barron's grandparents while speaking in Des Moines, Iowa. \n\n'That's how he got so tall, he only ate her food,' he added to laughter in the crowd.\n\nHe also joked despite Barron's massive frame he prefers soccer to shooting hoops.\n\n'I said you're gonna be a basketball player. He said, \"well I like soccer dad, actually.\" I thought... at you're height I like basketball better but you can't talk them into everything,' Trump said, before adding that Barron was a 'special boy.'\n\n15. His mom, Melania, is extremely proud of him, and is his 'sounding board' \n\nBarron appears to be extremely close with his mother, Melania, and she even spoke about how proud she was of the teen during a December interview with Fox & Friends.\n\nShe also praised him for his hard work on his father's campaign last year. \n\n'He is a grown young man, I'm very proud of him about his knowledge, even about politics and giving advice to his father. He brought in so many young people, he knows his generation,' Melania said about the 19-year-old. \n\n'Because nowadays, the young generation, they don't sit in front of TV anymore, they're all on their tablets, they're on their phones and all of this these podcasts and streamers,' she continued.\n\n'He was very vocal and he gave advice to his father and was incredible how he brought in a success because he knew exactly who his father needs to contact and to talk to.'\n\nThat same month, a source also revealed to People that Melania has been a 'good sounding board' for the NYU student.\n\n'She is and has been a good sounding board for him. They talk about life as it is and how they are in the spotlight,' the source divulged at the time.\n\n'She tries to normalize his life. If that is even possible.'\n\n16. Chelsea Clinton once defended Barron from critics \n\n Although their parents have opposing political views, Hillary Clinton's daughter, Chelsea Clinton, once defended Barron from critics as his father was taking office in 2017.\n\nAt the time, 11-year-old Baron had been the subject of a piece in The Daily Caller titled, 'It's High Time Barron Trump Starts Dressing Like He's In the White House'.\n\nIn the article, Barron was criticized for his casual clothes after he was pictured in a T-shirt coming back from New Jersey to The White House on Air Force One with his parents in August 2017.\n\nBarron wore a red T-shirt, khaki shorts and suede loafers, the writer pointed out, while his father wore a suit and his mother wore 'an elegant dress'. \n\nClinton was not happy with the story, as she decided to respond to it on X, defending Barron.\n\n'It's high time the media & everyone leave Barron Trump alone & let him have the private childhood he deserves,' she wrote.\n\nA few months earlier, she had also defended Barron against internet trolls after he made an appearance at his father's inauguration. \n\nOn X, then Twitter, and on Facebook, she wrote: 'Barron Trump deserves the chance every child does-to be a kid.'\n\n'Standing up for every kid also means opposing @POTUS policies that hurt kids,' she added. \n\n17. The 19-year-old is 'far more politically interested' than some realize\n\nAccording to a source, Barron may be following in his father's footsteps in more ways than one, as he reportedly has political aspirations of his own.\n\nAnd, by the looks of it, the rumors could very well be true, considering how involved in his father's campaign he was over the past few years. \n\n'Barron is handsome, tall - taller even than his father - and very knowledgeable for someone his age. He's also far more politically interested than people realize,' an insider told DailyMail.com last May. \n\n'I see all the attributes of a future president if he has the appetite for it. And why not? He has the Trump genes.'\n\n18. He was once denied a bank account \n\nAccording to his mom, Melania, Barron was once denied from getting a bank account due to the 'cancel mob,' she claimed in her recent self-titled memoir.\n\nThe mom-of-one explained that this began just after the January 6 Capitol attack. \n\n'I was shocked and dismayed to learn that my long-time bank decided to terminate my account and deny my son the opportunity to open a new one,' Melania wrote.\n\n 'This decision appeared to be rooted in political discrimination, raising serious concerns about civil rights violations.'\n\nShe called it 'troubling' that a financial services institution could discriminate 'based on political affiliation.'\n\n19. This year, Barron's birthday falls one day before NYU's Spring break vacation\n\nIt looks like Barron's in luck, as his birthday falls on a Thursday this year - just one day before NYU's Spring Break is set to begin.\n\nIt's unclear exactly how Barron will be celebrating both spring break and his birthday, but according to The Palm Beach Post, his dad, Donald, is set to travel to his Bedminster Golf Club in New Jersey after the 19-year-old's special day.\n\nHe was at Mar-a-Lago in Palm Beach from March 14-16.","summary":"Donald Trump's youngest son, Barron, has turned 19 - and that's cause for celebration. DailyMail.com has gathered up 19 facts you may not know about the teen.","url":"https://www.dailymail.co.uk/femail/article-14499897/Barron-Trump-birthday-19-facts-surprising.html","image":"https://i.dailymail.co.uk/1s/2025/03/19/16/96326701-0-image-m-235_1742402070210.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/20/617172921696012330/1024x576_MP4_617172921696012330.mp4","publish_date":"2025-03-20 15:52:06","author":"Editor,Jane Herz","authors":["Editor","Jane Herz"],"language":"en","source_country":"gb","sentiment":0.494},{"id":302299080,"title":"JD Vance jokes Kamala Harris had ‘four shots of vodka’ before meetings while VP","text":"He’s serving up a double shot of shade.\n\nVice President JD Vance joked Thursday that his predecessor, Kamala Harris, drank hard liquor on the job — suggesting spirits may be to blame for her notorious “word salads.”\n\n“Well, I don’t have four shots of vodka before every meeting,” Vance laughed in an interview with radio host and Daily Caller editorial director Vince Coglianese.\n\n“That’s one way that I think Kamala really tried to bring herself into the role, is these word salads,” Vance added, “and I think that I would need the help of a lot of alcohol to answer a question like Kamala Harris answered a question.”\n\nHarris, 60, became infamous during her tenure for giving long, meandering answers that bordered on incoherence — with some critics comparing her to a student giving a book report on a book they haven’t read.\n\nHer latest public comments, delivered last week at an AI conference, included a rambling recollection of her ordering Doritos while watching the Oscars.\n\n“We did DoorDash ’cause I wanted Doritos. And the red carpet part was about to start and nobody wanted to leave to go to the grocery store. So it was DoorDash … So I was willing to give up whatever might be the tracking of Kamala Harris’ particular fondness for nacho cheese Doritos for the sake of getting a big bag of Doritos as I watched the Oscars,” she began.\n\n“And that’s right. But here’s the thing: At what point do we also uplift and highlight the consumer’s right to also expect — and you can debate with me if it should be a right — I think it should,” Harris concluded.\n\nThe confusing line of thought led some social media users to claim that she was “three glasses of wines deep” during her appearance.\n\nIn February, the failed presidential candidate attempted to deliver an inspirational speech to the cast of Broadway’s “A Wonderful World: The Louis Armstrong Musical.”\n\n“When we think about these moments where we see things that are being taken, but also let’s see it, you know, nature abhors a vacuum,” Harris told the cast.\n\nShe went on, “we’re seeing a U-turn right now. For those rights to be maintained which means we have to be vigilant. It’s just the nature of it.”\n\n“We have to be clear-eyed. And it doesn’t mean we don’t see the beauty in everything. These things all co-exist, but I believe we fight for something, not against something.”\n\nHarris has yet to officially announce her future political plans, but she is widely expected to run for governor of California in 2026 — and has set a self-imposed deadline of the end of summer to make a final decision.","summary":"\"I would need the help of a lot of alcohol to answer a question like Kamala Harris answered a question,\" Vance told radio host and Daily Caller editorial director Vince Coglianese.","url":"https://nypost.com/2025/03/20/us-news/jd-vance-jokes-kamala-harris-had-four-shots-of-vodka-before-meetings-while-vp/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100770774.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/SSGwgQEF-RyIcpnTz.mp4","publish_date":"2025-03-20 15:47:34","author":"Diana Glebova","authors":["Diana Glebova"],"language":"en","source_country":"zm","sentiment":0.137},{"id":302297422,"title":"Bizarre gift Netanyahu hands John Fetterman that's left liberals raging: 'I can't believe this!'","text":"Benjamin Netanyahu gifted a 'silver-plated beeper' to Senator John Fetterman during his visit to Israel this week.\n\nIsrael's Prime Minister presented Fetterman with the bizarre gift during an awkward exchange in his office in Jerusalem.\n\nIn an apparent move to double down on his support for Israel, Fetterman presented Netanyahu with a framed article from a Philadelphia newspaper that memorialized the PM's brother, an Israeli soldier who was killed in 1976 during an Israeli raid in Uganda.\n\nIn return, the Israeli leader offered Fetterman a gift of his own, jokingly asking: 'What can I give a man who has everything? How about giving him a beeper?'\n\n'This is a silver-plated beeper. The real beeper is, like, one-tenth the weight,' Netanyahu said as he handed the pager to the laughing senator. 'It's nothing, but it changes history.'\n\nThe gift is an apparent reference to the Israel's operation in Lebanon last September that saw the military detonate pagers that were used by members of Hezbollah. The explosive attack left 42 people dead and thousands injured.\n\nNetanyahu presented a golden pager to President Donald Trump in February when the pair met at the White House, but some have questioned why he would give this symbolic gift to a junior member of the senate.\n\nFetterman, however, has repeatedly voiced his support for Israel, despite his Democratic Party being highly critical of the offensive in Gaza.\n\nVideo of the exchange, posted online yesterday, shows how Fetterman laughed as Netanyahu presented him with the gift.\n\nHe appeared to admire the device before saying, 'When that story broke, I was like, 'Oh, I love it, I love it.' And now, it's like, thank you for this.'\n\n'Thank you,' he said again as he shook the prime minister's hand.\n\nFetterman on Tuesday doubled down his support for Israel after it shattered the tenuous ceasefire with Hamas by bombarding Gaza with air strikes.\n\n'Hamas does not want peace. I unapologetically, 100% stand with Israel, and demand the release of all remaining hostages,' he tweeted, noting that he was 'sending this from Israel'.\n\nBut his message and display of support for Netanyhu's troops has prompted backlash from liberals who have branded him the 'most despicable scum in Congress'.\n\n'I can't believe this man once conned progressives into campaigning for him and defending him,' one X user said of Fetterman. 'Forget pro Israel, he's pro Netanyahu, who just massacred over 100 kids to avoid going to court for his trial. Sick stuff.'\n\n'This despicable ghoul is a US senator. What a joke!' echoed another. \n\n'OMG. To be this cruel and this tacky all at the same time,' one user penned. \n\nAnother wrote: 'Who doesn't enjoy a gift from a criminal thug murderer?' \n\n'Proud of their terrorism. Sickos of the highest degree,' said another. \n\nOne added: 'Absolutely no way this is real… right???' \n\n'Why is the senator from Pennsylvania hanging out in Israel? And who's paying for it?' another asked. \n\nFetterman has broken with his party's liberal wing several times, including maintaining his staunch support for Israel and supporting the Laken Riley Act focused on illegal immigrants. \n\nThe outspoken senator also made headlines earlier this month when he criticized his party's response to Trump's address to Congress.\n\nDemocrats faced backlash for several stunts and protests during the address, including refusing to stand and clap for a young cancer survivor who was honored by Trump, while one congressman was even booted from the chamber for his antics. \n\n'I don't think that was the best look for our party last night,' Fetterman said when asked by Fox News for his reaction to how Democrats behaved during the speech. \n\nFetterman also took to X to share a more hostile take on his party's performance, which be branded a 'sad cavalcade of self owns and unhinged petulance.' \n\n'It only makes Trump look more presidential and restrained,' he said as he shared a Politico article that mocked Democrats who held up protest signs during the speech as 'giving bingo.' \n\n'We're becoming the metaphorical car alarms that nobody pays attention to — and it may not be the winning message,' Fetterman posted. \n\nDespite suffering health issues during his run for the senate in 2022, including having a stroke that impaired his speech, and his apparent break from his party, Fetterman has been floated by some as a potential Democtratic presidential candidate in 2028.\n\nFetterman was floated as a potential candidate as Democrats begin their search for a standard bearer to lead them into the 2028 election, following Kamala Harris' resounding defeat in November.\n\nComedian Bill Maher even called for him to run, saying 'Democrats need to find their Trump.' \n\nFetterman was previously asked about his White House ambitions in December 2023, to which he told Politico that he was 'not thinking about 2028'.\n\nDespite losing in a landslide to Trump, Harris surprisingly topped a post-election poll among Democrats, where she led the field with 41 per cent of the vote, according to a Puck News/Echelon Insights survey. \n\nThe rest of the pack combined - 13 Democratic politicians who all scored in the single digits - garnered 43 per cent, with 16 per cent of those surveyed saying they were 'unsure' to the question of who they would vote for if a party primary were held now.","summary":"Israeli Prime Minister Benjamin Netanyahu presented Sen. John Fetterman with the bizarre gift during an awkward exchange in his office in Jerusalem.","url":"https://www.dailymail.co.uk/news/article-14518839/Netanyahu-gift-John-Fetterman-liberals-raging.html","image":"https://i.dailymail.co.uk/1s/2025/03/20/15/96397549-0-image-a-84_1742483691782.jpg","video":null,"publish_date":"2025-03-20 15:31:27","author":"Editor,Natasha Anderson","authors":["Editor","Natasha Anderson"],"language":"en","source_country":"gb","sentiment":-0.228},{"id":302320956,"title":"GOP lawmakers have 'every incentive to back Trump' — even on ideas they 'privately disdain'","text":"When President Richard Nixon was facing Watergate-related articles of impeachment in 1974, he talked to Sen. Barry Goldwater (R-Arizona) to see how things might go in an impeachment trial. Goldwater, one of the most prominent figures in the conservative movement at the time, was blunt — letting Nixon know that he would likely be a \"guilty\" vote. Nixon, feeling that he had become politically toxic even in his own party, gave his resignation speech on August 8, 1974.\n\nIn contrast, the GOP rallied around Donald Trump in 2024 despite the fact that he was facing four criminal indictments in 2024 and had been convicted on 34 felony counts in one of the cases. And after Trump narrowly defeated Democratic nominee Kamala Harris in the election, his iron grip on the GOP was evident when Senate Republicans confirmed his most controversial nominees —including Defense Secretary Pete Hegseth, FBI Director Kash Patel, National Intelligence Director Tulsi Gabbard, and Health and Human Services Secretary Robert F. Kennedy Jr. \n\nThat iron grip, according to Axios reporters Jim VandeHei and Mike Allen, is underscored by the submission of GOP lawmakers.\n\nREAD MORE: 'The threat is extremely real': Critics sound alarm over Trump 'emergency'\n\nIn an article published on March 20, VandeHei and Allen explain, \"To fully appreciate President Trump's mesmerizing control over Republicans, consider their scant public dissent over ideas many of them privately disdain: (1) support for Vladimir Putin, (2) support for on-again, off-again tariffs, and a worsening economy, (3) support Elon Musk's haphazard budget-cutting, (4) making Canada the 51st state, (5) pardoning most January 6 defendants.\"\n\nThe Axios reporters continue, \"Why it matters: It's the worst-kept secret in town: Most elected Republicans are staying silent on issues they find dubious, dumb or destructive. In private, they're more forthcoming about their concerns and their mixed motivations for zipping their lips — genuine support for Trump and genuine fear of crossing him. Almost universally, Republicans have convinced themselves that by winning a second time, Trump earned whatever Cabinet he wants, and the freedom to pursue the policies of his choice.\"\n\nGOP lawmakers, according to VandeHei and Allen, \"see no upside\" to standing up to Trump — and the president and his close ally, billionaire Tesla/SpaceX/X.com leader Elon Musk, \"would torch them publicly and on social media, and almost certainly threaten a primary challenge.\"\n\nVandeHei and Allen note that Sen. Joni Ernst (R-Iowa) experienced \"constant harassment\" when she indicated that she might vote against confirming Hegseth, while Sen. Thom Tillis (R-North Carolina) received \"death threats.\" Ernst and Tillis both caved and voted \"yes\" on Hegseth.\n\nREAD MORE: Busted: Report exposes Musk operatives who infiltrated Social Security Agency\n\nVandeHei and Allen write, \"The bottom line: Politics is all about incentives. And every Republican incentive is to back Trump — and make sure he and MAGA media know it.\"\n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs","summary":"When President Richard Nixon was facing Watergate-related articles of impeachment in 1974, he talked to Sen. Barry Goldwater (R-Arizona) to see how things might go in an impeachment trial. Goldwater, one of the most prominent figures in the conservative movement at the time, was blunt — letting Nixon know that he would likely be a \"guilty\" vote. Nixon, feeling that he had become politically toxic even in his own party, gave his resignation speech on August 8, 1974.\n\nIn contrast, the GOP rallied around Donald Trump in 2024 despite the fact that he was facing four criminal indictments in 2024 and had been convicted on 34 felony counts in one of the cases. And after Trump narrowly defeated Democratic nominee Kamala Harris in the election, his iron grip on the GOP was evident when Senate Republicans confirmed his most controversial nominees —including Defense Secretary Pete Hegseth, FBI Director Kash Patel, National Intelligence Director Tulsi Gabbard, and Health and Human Services Secretary Robert F. Kennedy Jr.","url":"https://www.alternet.org/trump-axios-gop-lawmakers/","image":"https://www.alternet.org/media-library/image.jpg?id=58367874&width=1200&height=600&coordinates=0%2C143%2C0%2C144","video":null,"publish_date":"2025-03-20 15:25:58","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.233},{"id":302287888,"title":"Musk’s Tesla stock isn’t the only thing that’s tanking","text":"Shares for Elon Musk‘s Tesla have fallen since he’s taken an outsized role in President Donald Trump‘s administration. \n\nBut that’s not the only thing that’s plaguing the head of the Department of Government Efficiency.\n\nThe world’s richest man’s disapproval rating is on the rise and polling shows the billionaire underwater.\n\nAccording to the polling average among several surveys, more than 53% of people disapprove of him compared to 40% who approve. That’s more people who have soured on him compared to last month, when 50% disapproved and nearly 42% approved.\n\n“And that’s including Republican-aligned pollsters,“ former Democratic pollster Adam Carlson posted to X. ”If you limit it to non-partisan polls it would be -10 for February and -16 for March.”\n\nHe added: “That’s, uh, really bad.”\n\nNumerous auto industry analysts have also pointed to Musk’s close association with Trump and with far-right causes globally. Tesla showrooms in the U.S. have been besieged by protesters and its vehicles vandalized on the street. Tesla owners, perhaps in a bid to avoid being targeted, have placed bumper stickers on their cars with messages like, “I bought it before Elon went nuts.” \n\nShares have plummeted 45% in 2025 and tumbled more than 15% to $222.15 earlier this month, the lowest since late October, reflecting newfound pessimism as sales crater around the globe. \n\nMusk pumped $270 million into Trump’s campaign heading into the 2024 election, appeared on stage with him and cheered Trump’s victory over Democratic candidate Kamala Harris in November.\n\nThe Associated Press contributed to this report.","summary":"Shares for Elon Musk‘s Tesla have fallen since he’s taken an outsized role in Trump‘s administration.","url":"https://www.nj.com/politics/2025/03/musks-tesla-stock-isnt-the-only-thing-thats-tanking.html","image":"https://www.nj.com/resizer/v2/FQTTTP5D4ZFB5OCHND3TDQX2LY.jpg?auth=e81cbd7a419ecc7ef801ddcfff520b12617eb15825d3d07faf95c88f614768da&width=1280&quality=90","video":null,"publish_date":"2025-03-20 15:25:38","author":"Matt Arco","authors":["Matt Arco"],"language":"en","source_country":"us","sentiment":-0.192},{"id":302297414,"title":"JD Vance destroys Kamala Harris with stinging 'four shots of vodka' joke","text":"JD Vance destroys Kamala Harris with stinging 'four shots of vodka' joke\n\nPODCAST: All the latest headlines, including Trump’s bold move to void Biden’s pardons and Gavin Newsom’s unexpected statue plans\n\nBy CHARLIE SPIERING, SENIOR POLITICAL REPORTER, WASHINGTON, DC\n\nPublished: 15:17 GMT, 20 March 2025 | Updated: 15:24 GMT, 20 March 2025\n\nVice President JD Vance joked Thursday that he was a different vice president than Kamala Harris, because he was not drunk before he started speaking.\n\nVance spoke about his vice presidency in an interview with radio host Vince Coglianese who asked him how he was 'doing the job differently' than Harris\n\n’Well, I don’t have four shots of Vodka before every meeting, that’s one way I think that Kamala really tried to bring herself into the role is these word salads,' Vance said laughing.\n\n'I think I would need the help of a lot of alcohol to answer questions the way Kamala Harris answered questions,' he continued. \n\nHarris was famous for speaking in 'word salads' when talking to the public in interviews or unscripted settings, as she layered multiple dependent clauses to emphasize her points. \n\nVance said he believed that Harris did not enjoy the same level of trust from former President Joe Biden that he as vice president enjoyed with President Donald Trump. \n\n‘My sense is that there wasn’t a level of trust between Biden and Harris, she was just less empowered to do her job,’ Vance said. \n\nVance said he was grateful that Trump trusted him to do the job as he saw fit and did not try to 'micromanage' his vice presidency. \n\nU.S Vice President JD Vance joked about his predecessor Vice President Kamala Harris in a radio interview \n\nKamala Harris speaks onstage during the HumanX AI Conference 2025 at Fontainebleau Las Vegas\n\n‘I feel empowered in a way that a lot of vice presidents haven’t been but that’s all in the service of accomplishing the president’s vision,' he said. \n\n Vance also detailed the awkward transition between he and Harris prior to moving into the vice president's residence after the inauguration. \n\nHe indicated that his wife and three young children were interested in visiting the house before they moved in, in order to prepare for the transition. \n\nVance said he did not know whether it was a staff mixup or Harris' intention to block he and his family from the house, but the visit did not happen. \n\n‘They just would not, even with me not there, they would not allow the three kids to come by and see this place that they are going to live in,' he said. \n\nHe dismissed the apparent slight however, as 'all water under the bridge.’\n\n'The kids are living in the vice president's residence now, they all love it, there's a lot of space especially in Washington, DC and they're having a great time,' he said. \n\nMinnesota Gov. Tim Walz takes the stage in Des Moines, Iowa\n\nGov. Tim Walz speaks to Gov. Gavin Newsom about the Democrat struggle to reach out to young men \n\nVance also addressed comments from Kamala Harris' running mate Gov. Tim Walz of Minnesota, who recently said that his masculinity 'scared' the Trump-Vance team. \n\n‘I think I scare them a little bit, why they spend so much time on me,’ Walz said during a podcast interview with California Gov. Gavin Newsom, adding he felt he could 'kick all of their ass.' \n\nBut Vance said that was not the case. \n\n'I was never physically intimidated by Tim Walz,' he said, chalking up Walz's comment as posturing. \n\n'The Democrats have become so unpopular among young men in particular but really all men, I think they have to posture and pretend ... I just think its a guy who doesn't actually know how to relate, who's trying to say something.' \n\nVance said he knew that Democrats were talking about Walz possibly running for Senate of Minnesota or even looking to a bigger leadership role in 2028. \n\n'I'm not too worried about Tim Walz as a political talent. We're just going to focus on doing our job and when Tim Walz says something crazy we'll laugh at it and move on.' \n\nMinnesotaDonald TrumpTim WalzJD Vance\n\nShare or comment on this article:\nJD Vance destroys Kamala Harris with stinging 'four shots of vodka' joke\n\nAdd comment","summary":"Vice President JD Vance joked that he was a different vice president than Kamala Harris, because he was not drunk before he started speaking.","url":"https://www.dailymail.co.uk/news/article-14519835/JD-Vance-destroys-Kamala-Harris-stinging-four-shots-vodka-joke.html","image":"https://i.dailymail.co.uk/1s/2025/03/20/15/96396925-0-image-m-7_1742482858676.jpg","video":null,"publish_date":"2025-03-20 15:24:24","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":0.018},{"id":302283040,"title":"Musk eviscerates Tim Walz with savage clapback after failed VP candidate dissed Tesla","text":"Elon Musk slammed Tim Walz with a savage insult after the failed Democratic VP candidate mocked Tesla's tumbling stock value. \n\nThe Tesla chief was branded an 'un-elected, South African nepo-baby' by Walz this week at a town hall in Wisconsin titled 'The People vs Musk', where Walz took aim at the electric car maker's 41.4 percent stock fall as of March. \n\n'On the iPhone, they've got that little stock app. I added Tesla to it to give me a little boost during the day,' Walz said at the event. \n\nIn response, Musk ridiculed Walz over his heavy election defeat in November alongside Kamala Harris, saying he gets the same 'boost' when he remembers their drubbing. \n\n'Sometimes when I need a little boost, I look at the @JDVance portrait in the White House and thank the Lord,' Musk wrote on X. \n\nThe White House's 'Rapid Response' account piled on, adding in its own post alongside Vance and President Trump's official portraits: 'When we need a little boost during the day at the White House, we walk around the corner from our office and admire these beautiful portraits.' \n\nIt comes as Walz has faced backlash from conservatives for his remarks at the town hall, with some accusing him of celebrating the downfall of a key American-based company. \n\nThe GOP House Judiciary said the Minnesota Governor exhibited 'disgusting behavior', while Texas Senator Ted Cruz branded him a 'small, petty, vindictive, evil b***ard' who 'represents today's Democrats well.' \n\nWalz's remarks on Tesla's struggles come as some customers revolt against his intimate ties to the Trump White House, with liberal groups calling for a boycott of the electric car manufacturer. \n\nTesla vehicles and facilities across America have also been targeted by vandalism and attacks in recent weeks, including in Las Vegas this week where several of the vehicles were firebombed. \n\nThe FBI launched an investigation into the attack, and Attorney General Pam Bondi branded the incident 'nothing short of domestic terrorism.' \n\nWalz's speech aimed at Musk comes as the former VP candidate has been on a media blitz in recent weeks, fueling speculation that he is considering a run for president in 2028. \n\nWhen pressed by the New Yorker earlier this month, the 60-year-old did not rule out a run for the White House. \n\n'Look I never had an ambition to be President or Vice President. I was honored to be asked,' he said. \n\n'If I feel like I can serve, I will. And if nationally, people are like, \"Dude we tried you and look how that worked out,\" I'm good with that.'\n\nWhen the politician was then asked point-blank whether he would ever run for president, he replied: 'Well I had a friend tell me, \"Never turn down a job you haven't been offered.\"\n\n'If I think I could offer something... I would certainly consider that. I'm also, though, not arrogant enough to believe there's a lot of people that can do this.'\n\nHe then explained that if the circumstances are right in 2028 and he has the right 'skill set' for the moment, 'I'll do it.'\n\n'I'll do whatever it takes. I certainly wouldn't be arrogant enough to think that it needs to be me. \n\nWhile Walz weighs a run for president, he faces the prospect of the world's richest man dampening his hopes. \n\nMusk's insult hurled at Walz this week was far from his first, with the Tesla chief mocking Walz's November defeat last month as well. \n\nWalz said in an X post that 'the richest man in the world is sitting at the Resolute Desk, about to defund your public school. Trump should stop him.' \n\nMusk responded: 'What's your name again? I forgot.' \n\nIn another exchange days earlier, Musk mocked Walz's moves as Governor in Minnesota to allow tampons to be placed in boy's bathrooms in schools. \n\nAfter Walz said that Musk was 'a terrible president', Musk responded with a meme of an elderly character from the movie Up ridiculing Walz.","summary":"Elon Musk slammed Tim Walz with a savage insult after the failed Democratic VP candidate mocked Tesla's tumbling stock value.","url":"https://www.dailymail.co.uk/news/article-14519465/Musk-Tim-Walz-insult-Tesla.html","image":"https://i.dailymail.co.uk/1s/2025/03/20/14/96396171-0-image-m-23_1742482054594.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/19/3183036790082522685/1024x576_MP4_3183036790082522685.mp4","publish_date":"2025-03-20 15:11:09","author":"Editor,Will Potter","authors":["Editor","Will Potter"],"language":"en","source_country":"gb","sentiment":-0.045},{"id":302314512,"title":"GED Section: Societal Anger And The Need For Unity","text":"Source: boonchai wedmakawand / Getty In today’s “Notes From The GED Section,” D.L. Hughley shed light on the growing societal discontent and the fragmented perspectives that deepen division. He emphasized the selective nature of public outrage, explaining how people often only care when their own interests are threatened. “Everybody’s only angry about the things that affect them,” Hughley noted, identifying a key flaw in the pursuit of collective progress. MORE: ICYMI: D.L. Hughley Joined ‘The Don Lemon Show To Talk Kamala Harris, The Election And Diddy Hughley attributed much of this discontent to economic instability and unpredictable policies. He pointed out that consumer confidence has sunk to a four-year low, largely because “so many things are erratic.” From job losses among veterans and farmers to layoffs of federal employees, worries about economic livelihood are driving this wave of frustration. Yet, Hughley observed, these concerns often lack empathy for others’ struggles. “Farmers didn’t know it would be them,” he said, referencing how initial support for government program cuts shifted to outrage once the consequences became personal. CLICK HERE TO LISTEN TO THE DL HUGHLEY SHOW LIVE FROM 3-7PM ET Another critical issue Hughley highlighted was the fragmentation of societal responses. He called out the hypocrisy in how outrage is selectively applied. For instance, he noted the disparity in attitudes toward threats. “You don’t want terrorists with tans, but you don’t mind terrorists when they’re people you can use,” Hughley said, condemning the inconsistent reactions to domestic extremism versus external threats. Hughley made a compelling call for unity, stressing that addressing societal challenges requires people to care about issues beyond their own. “If you want to effect change, you have to be angry about things that have nothing to do with you,” he urged listeners. He also invoked the famous quote, “They came for the trade unionists, and I didn’t speak out because I was not a trade unionist,” to illustrate the dangers of selective empathy. Ultimately, Hughley argued for collective accountability and action, warning that without unity, no one will be left to “speak for you” when your time of need arrives. His message was clear: only solidarity can pave the way for a just and stable society. GED Section: D.L. Salutes The Men Who Shaped His Manhood GED Section: Why “Toxic Empathy” And Christianity Don’t Mix “Good Trouble”: Who Is Upholding John Lewis’ Voting Rights Legacy? 10 photos GED Section: Societal Anger And The Need For Unity was originally published on blackamericaweb.com","summary":"D.L. Hughley explores societal anger, fragmented perspectives, and the urgent need for unity to foster collective progress and accountability","url":"https://newsone.com/6015905/societal-anger-and-the-need-for-unity/","image":"https://blackamericaweb.com/wp-content/uploads/sites/10/2025/03/17423932995561.jpg?strip=all&amp;quality=80","video":null,"publish_date":"2025-03-20 15:00:31","author":"The D.l. Hughley Show","authors":["The D.l. Hughley Show"],"language":"en","source_country":"US","sentiment":0.105},{"id":302276596,"title":"Ellen DeGeneres and Portia de Rossi celebrate their 20-year anniversary after UK move","text":"Ellen DeGeneres and Portia de Rossi are celebrating their love.\n\nThe former talk show host, 67, and the actress, 52, who wed in 2008, celebrated 20 years together on Thursday. \n\nDeGeneres posted a photograph of her and de Rossi’s shadow on Instagram, captioning the sunset shot, “20 years together. Happy to be with you everywhere and always.”\n\nIn December, the couple acknowledged the day they started dating, with DeGeneres penning a heartfelt message to her wife.\n\n“20 years ago today we began this relationship not realizing what a long beautiful adventure this would be,” she wrote beneath the Instagram pic. “You are the best thing that ever happened in my life. You take care of me. You help me see the good in everything. You help to guide me and pick me up when I feel off or down.”\n\n“You are a beautiful soul that I am so very grateful to have as a partner to navigate this crazy life with. My wife. My best friend. The love of my life,” gushed DeGeneres. “Thank you for being you and loving me. So happy we get to travel and explore the world together in the next 20 years, and looking forward to our first snowy Christmas.”Leaving fans with an update after moving to the UK, she added: “P.S. for those of you concerned, our UK farmhouse did NOT flood.”\n\nDeGeneres and de Rossi fled the US in November, following Donald Trump’s election win.\n\nThe comedian and the “Arrested Development” alum put their Montecito, Calif., mansion on the market in an attempt to start over abroad, insiders told The Wrap.\n\nSeparate sources revealed to TMZ that the pair decided to “get the hell out” of the country immediately after Trump’s victory over former Vice President Kamala Harris, which left them feeling “very disillusioned.”\n\nDeGeneres and de Rossi will likely “never” return to the US on a permanent basis, the insider added.\n\nShortly after their move across the pond, the stand-up was spotted rocking brunette hair over her signature blonde, as seen in a video shared to The Farmer’s Dog’s Instagram page.\n\n“What a great night in the pub with @thecorrsofficial,” the caption read. “The way a good pub night should be … acoustic set, a few drinks, great friends.”\n\nAs the two continue to enjoy life in England, de Rossi gave the love right back to her partner in January, writing on Instagram, “My darling wife! You continue to amaze me and inspire me. Happy Birthday to the strongest, sweetest, most brilliant person I know. I’m so lucky to be standing next to you as we share this incredible life together. I love you.”","summary":"\"You help to guide me and pick me up when I feel off or down,\" the comedian gushed.","url":"https://nypost.com/2025/03/20/entertainment/ellen-degeneres-portia-de-rossi-celebrate-20-year-anniversary-after-uk-move/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100767275.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-20 15:00:28","author":"Alexandra Bellusci","authors":["Alexandra Bellusci"],"language":"en","source_country":"zm","sentiment":0.45},{"id":302283102,"title":"Leaders are not always nice people…","text":"By John Henwood \n\nIN a recent column I referred to the Lieutenant-Governor’s talk at a Leadership Jersey meeting. He covered a range of topics and, perhaps inevitably, he touched on political leadership (diplomatically avoiding local politics) and there was surprise among his audience when he said that Donald Trump had positive leadership qualities.\n\nIt was clear that Vice-Admiral Jerry Kyd was not endorsing Trump, and certainly not offering any judgment on his moral, ethical or intellectual attributes or his politics. Quite simply he was pointing out that Trump had recognisable leadership assets. Well, that is hard to dispute when the 47th President of the United States won not only the electoral college, an arcane system, but also the popular vote. Most voters wanted him and it seems highly unlikely that his scruples, integrity, or intellect were the decisive factors. So, what was it?\n\nNot many recent Republican presidents have won the popular vote. In America, with no tradition of nobility in the European sense, people relate wealth to class. The 19th-century robber barons like Carnegie, Rockefeller and Vanderbilt who amassed huge fortunes became the country’s social elite. Americans admire successful people and perhaps aspire to their wealth, but the majority are cautious about trusting them. According to Gallup, only two per cent of Americans regard themselves as upper class, 16% as upper-middle, 43% as middle class and 39% as working or lower class. Around 80% of Americans are not as well off as they aspire to be, so it is not surprising that, however the electoral college votes, the majority tends to vote Democrat, the party perceived as the one with an agenda to improve their lot. Democrat is as close to Britain’s Labour as America gets; indeed, the Labour Party sent people to help Kamala Harris become the first female president.\n\nHarris lost, badly. Those states which tend to switch between the parties voted for Trump. They did so because they could not stretch their imaginations far enough to see Harris as the leader who would make things better for them. On the other hand, Trump, with his battle cry “Make America Great Again”, was seen as the man who got things done, a strong leader, whether they agreed with his policies or not.\n\nLeaders are not necessarily good people. Among those who lived in my time, Josef Stalin (“Uncle Joe”) was responsible for the deaths of around 50 million of his own people, as was Mao Zedong; others including Pol Pot, Muammar Gaddafi and Francisco Franco had the blood of countless numbers on their hands. None would have been able to do what they did without leadership attributes. Goodness knows how an audience might react if a future speaker was bold enough to describe Adolf Hitler as a leader. Truth can be uncomfortable.\n\nIdeology imposed on the young is dangerous\n\nStalin’s ideology was Marxism-Leninism, while Franco’s was nationalism-authoritarianism; political opposites, both equally dangerous. One must be very cautious when approaching any form of ideology. It is the beginning of a path that leads to others, often in a minority, seeking to impose their views on the rest of us.\n\nThe so-called Unification Church, better known as the “Moonies”, is an example. Olympic gymnast Hiroko Yamasaki was drawn into the sect and got married in a Unification mass wedding. Then she vanished. Six weeks later she reappeared. Apparently reawakened, she explained: “I was in a world of delusion and mind control,” not knowing whether the affection she had felt for the man she married was real.\n\nLess extreme, but potentially equally detrimental, is current ideology around gender. Children as young as primary-school age are encouraged to explore whether the gender with which they were born is the right one for them. What damage might that do to young, impressionable minds?\n\nThere is an insidious school of thought that for children the notion of winning and losing should not exist. No one comes last; winners should not celebrate because it may offend the sensibilities of those who do not. Rather than encouraging kids to greater achievement it teaches them that it is OK to fail. If losers are rewarded, why bother to try?\n\nAs that great modern philosopher Charlie Brown wrote: “Kids don’t know what it’s like to feel pain when they do something stupid. Stupid should hurt.” There is nothing wrong in a child clambering up a climbing frame; if he or she falls and breaks an arm it will hurt. That is not a reason to close the adventure playground on health-and-safety grounds. They will be more careful next time; it is called learning and not all learning is easy. Nor should it be.\n\nWe have already developed a generation that has come to expect that society will support it whatever, will ignore failure, will downplay shows of independence, will devalue success and do everything possible to make everyone equal. It is Kurt Vonnegut’s nightmare, described in his short story Harrison Bergeron, come true: “Everybody was finally equal. They weren’t only equal before God and the law; they were equal every which way. Nobody was smarter than anybody else; nobody was better looking than anybody else; nobody was stronger or quicker than anybody else.”\n\nSo, how to turn things around? It is not going to be easy. At a government level it will require courage and determination such as we seldom see nowadays. Courage to repeal restrictive laws, even those designed to shield us from our own stupidity like some over-protective health-and-safety legislation. Back in the day ladders were perfectly adequate to reach high places, now we must have scaffolding. Why? Where’s the proportionality? And why should we pay people more than the market says their labour is worth? Wouldn’t it be better to encourage and help them to acquire greater skills?\n\nParents make the decision to bring children into the world; perhaps if they put more emphasis on personal liberty and freedom from controlling rules it would gradually return society to a more confident state. And perhaps if teachers concentrated more on equipping children to succeed in life rather than suggesting failure does not matter and promoting gender neutrality, children would be encouraged to think that it is more stimulating to win than lose and understand that life is not always fair. In short, a society in which children are encouraged to self-determine rather than be carelessly conforming.\n\nIf we can produce a generation that thinks for itself, is brought up to make its own decisions, to resist the notion that life can be de-risked, that success will be rewarded, then perhaps one day some of them will become the leaders who unravel the nanny knots with which we have become tied. Until then, a plea to those empowered to make decisions: stop introducing more restrictions on our lives. Let us make our own decisions and, yes, our own mistakes, even if they do hurt.\n\nBorn and educated in Jersey, John Henwood MBE had a career in broadcasting before tackling a range of other challenges. In 2016 he was honoured to become the second recipient of the Institute of Directors Lifetime Achievement Award, the only other being the late Colin Powell CBE.","summary":"By John Henwood IN a recent column I referred to the Lieutenant-Governor’s talk at a Leadership Jersey meeting. He covered a range of topics and, perhaps inevitably, he touched on political leadership (diplomatically avoiding local politics) and there was surprise among his audience when he said that Donald Trump had positive leadership qualities. It was [&#8230;]\n\n\nThe post Leaders are not always nice people… appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/voices/2025/03/20/leaders-are-not-always-nice-people/","image":"https://jerseyeveningpost.com/wp-content/uploads/2025/03/John-Henwood-scaled.jpg","video":null,"publish_date":"2025-03-20 14:36:11","author":"Voices","authors":["Voices"],"language":"en","source_country":"gb","sentiment":0.048},{"id":302288788,"title":"Tim Walz taunts and mocks Elon Musk, says he boosts mood by looking at Tesla stock; world's richest man responds, sets social media on fire","text":"Elon Musk and Minnesota Governor Tim Walz exchanged heated words online over Tesla's stock decline. Walz mocked Musk's financial losses, and the billionaire responded with a sarcastic rebuttal. As Tesla's value plummets, the billionaire's growing political power remains a source of contention.Why did Tim Walz mock Elon Musk?Tim Walz claims that looking at Tesla stock boosts mood. Speaking to a crowd in Wisconsin on Tuesday, Governor Tim Walz made fun of Elon Musk, the CEO of Tesla and the spokesperson for President Trump's polarizing cuts to government agencies, by saying that he finds that looking at Tesla stock improves his mood, as quoted in a report by The Hill. I know some of you are aware of this, but there's this thing on my iPhone. In a video he shared on social media site X, Walz stated, They have that little stock app, during an event on Tuesday night.To a chuckling audience, he remarked, I added Tesla to it to give me a little boost during the day. He went on, 225 and dropping! Since the beginning of the Trump administration, Musk has been under intense scrutiny because he is the head of the Department of Government Efficiency (DOGE) and frequently posts right-wing talking points and memes on X, which he owns.Walz's remarks coincide with a string of vandalism incidents against Tesla buildings and cars nationwide, most recently in Las Vegas, where the FBI opened an investigation after multiple electric cars were set on fire.How did Elon Musk respond?Tesla’s CEO responded to Tim Walz's joke in a post on X. I look at the @JDVance portrait in the @WhiteHouse and thank the Lord sometimes when I need a little boost, Musk wrote, adding an emoji of praying hands.Is Tesla’s stock in real trouble?As Trump's tariff plan trembles the stock market and increases fears of a recession, Tesla's stock has dropped 34.6 percent in the past month.The Nasdaq composite indicates that Tesla's stock closed Wednesday at $235 per share. Since last December, when it was trading at $479 per share, the company has experienced a substantial decline. In recent weeks, Elon Musk's political profile has increased, but his overall net worth has decreased, as quoted in a report by The Hill.ALSO READ: Biggest day of action looms as ‘Tesla Takedown’ protesters escalate campaign against Elon Musk’s controversial policies; here are date, venues and what they plan to do Tim Walz, who accompanied former Vice President Kamala Harris in the election, has started travelling the nation and giving speeches about the situation of the nation.In a recent interview with The New Yorker, the governor of Minnesota hinted at the possibility of running for president. After constituents voiced their dissatisfaction with the Trump administration and DOGE's workforce cuts, the National Republican Congressional Committee advised its members to refrain from in-person meetings.FAQsWhy did Tim Walz make a dig at Elon Musk?Tim Walz joked that watching Tesla's stock fall improves his mood, mocking Musk's leadership and political influence during the Trump administration.How did Elon Musk react?Elon Musk responded to X by saying he draws inspiration from a White House portrait of J.D. Vance, along with a sarcastic prayer emoji.","summary":"Elon Musk and Minnesota Governor Tim Walz had an online exchange over Tesla's declining stock value. Walz joked about the stock fall, while Musk responded sarcastically. Tesla's stock dropped 34.6 percent in the past month. Musk’s growing political influence and value loss were highlighted. Walz hinted at a potential presidential run in a recent interview.","url":"https://economictimes.indiatimes.com/news/international/us/tim-walz-taunts-and-mocks-elon-musk-says-he-boosts-mood-by-looking-at-tesla-stock-worlds-richest-man-responds-sets-social-media-on-fire/articleshow/119261314.cms","image":"https://img.etimg.com/thumb/msid-119262471,resizemode-4,width-1200,height-900,imgsize-571487,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-20 14:30:13","author":"The Feed","authors":["The Feed"],"language":"en","source_country":"in","sentiment":0.054},{"id":302284274,"title":"'Wow!' Fox News host shocked as Trump repeats debunked stolen election claim","text":"On Wednesday night, March 19, Fox News aired host Laura Ingraham's interview with President Donald Trump. \n\nThe far-right Ingraham is a vigorous defender of Trump's second presidency, but during the interview, Ingraham rolled her eyes when Trump repeated the debunked conspiracy theory that he won the United States' 2020 presidential election.\n\nIngraham discussed Trump's return to the White House after a four-year absence, asking him, \"So you thought there's no doubt…. You're coming back into office when you walked out of here?\"\n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs\n\nTrump responded, \"Well, I felt that, but I didn't know…. Let me say it: I didn't know if I was going to run, because I knew how much I won that election by. But if I thought I didn't win the election, I absolutely wouldn't have run.\"\n\nWhen Trump made that comment, Ingraham said, \"Wow,\" looked away from him and rolled her eyes. \n\nAfter losing both the popular vote and the electoral vote to Democrat Joe Biden in 2020, Trump falsely claimed that the election was stolen from him — a claim that was repeatedly debunked. Numerous vote recounts confirmed that Biden legitimately won the election. \n\nIn 2024, however, Trump defeated Democratic presidential nominee Kamala Harris by roughly 1.5 percent in the national popular vote and picked up 312 electoral votes. \n\nREAD MORE: Busted: Report exposes Musk operatives who infiltrated Social Security Agency\n\nAs Ingraham's interview with Trump continued, she discussed the legal problems he battled in 2024 — implying that they were politically motivated.\n\nTrump told Ingraham, \"They hated me. But they — you have to get on with your life.\" And the Fox News host responded, \"They would be on to the next target.\"\n\nREAD MORE: 'The threat is extremely real': Critics sound alarm over Trump 'emergency","summary":"Editor's Note: This headline has been updated.\n\nOn Wednesday night, March 19, Fox News aired host Laura Ingraham's interview with President Donald Trump. \n\nThe far-right Ingraham is a vigorous defender of Trump's second presidency, but during the interview, Ingraham rolled her eyes when Trump repeated the debunked conspiracy theory that he won the United States' 2020 presidential election.\n\nIngraham discussed Trump's return to the White House after a four-year absence, asking him, \"So you thought there's no doubt…. You're coming back into office when you walked out of here?\"\n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs\n\nTrump responded, \"Well, I felt that, but I didn't know…. Let me say it: I didn't know if I was going to run, because I knew how much I won that election by. But if I thought I didn't win the election, I absolutely wouldn't have run.\"\n\nWhen Trump made that comment, Ingraham said, \"Wow,\" looked away from him and rolled her eyes. \n\nAfter losi","url":"https://www.alternet.org/msn-uk/trump-ingraham-interview-fox-news/","image":"https://www.alternet.org/media-library/image.jpg?id=58367394&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-03-20 14:06:03","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.456},{"id":302292426,"title":"Is ‘Severance’ a Stealth Critique of the Pro-Choice Movement?","text":"Spoiler alert: This article will assume the reader has already seen the first season.\n\nIs hit series “Severance” subtly making the case we should consider what we owe to unborn babies?\n\nAppleTV+’s “Severance,”Ben Stiller’s darkly comedic psychological thriller starring Adam Scott (“Parks and Recreation,” “The Good Place”), lends itself to interpretations, most proposing some variant of the theory that the show is about the difficulty of finding the “work/life balance.” Others explain that it is about the dehumanizing character of corporations, and still others contend it is about the dangers of escapism and the desire to self-anesthetize to cope with trauma.\n\nThese “readings” of “Severance” are obviously sound—indeed, they’re right there on the surface, since the show is quite literally about Mark S. (Scott) and three other employees of a mysterious med-tech megacorporation (ironically called “Lumon,” suggesting light) that requires the surgical implantation of a chip that literally bifurcates—“severs”—one’s consciousness into a work-self (an “innie”) and a home-self (an “outie”). Scott, an alcoholic mourning the death of his wife, has undergone this irreversible procedure as a way to escape the pain for a few hours a day.\n\nInnies vs. Outies\n\nFor the innies, this means they literally never experience sleep, fresh air, sky, or leave—their life is nothing but work; thus newly-severed innie, Helly R. (Britt Lower), naturally asks Mark whether she’s dead and this is hell. So the unsustainable division and tension between innies and outies puts them on a collision course—this is the predictable direction of the series.\n\nDespite this, “Severance”is not predictable. It is instead full of seemingly random encounters, hilariously surreal dialogue, and often disturbing twists. The story follows the two interspersed plotlines: the literally above-ground interactions between the outies with the unsevered, and the subterranean interactions between the innies with each other and the unsevered running the “Severed floor” in the basement of Lumon.\n\nAs the first season unfolds, layers of an onion are slowly pulled back, whether regarding why the outies (aside from Mark) chose to undergo severance, or the significance of their “mysterious and important” work they perform on 80s-era computers by staring at and clicking on random “scary” numbers, or Lumon’s ultimate purpose in wanting severed employees.\n\nBut these mysteries, combined with the deeper, more existential themes that dominate the two plots as they unfold over nine episodes—a recurring question asked by different characters, and the opening line of the first episode, is “Who are you?”—together suggest that there’s something more interesting going on here. “Severance”may be pressing a hotter button than the canned moral lesson that we should all more carefully thread the needle between workaholism and the clock-watching of corporate drudgery. \n\nChildish Things\n\nAnyone paying attention will at some point notice an initial clue: The innies often wistfully reflect on the brevity of their memories—indeed, of their existence—spanning only a few years for some, a few days for others. Those in charge of Lumon’s Severed floor, Ms. Cobel and Mr. Milchick (Patricia Arquette and Tramell Tillman), often address the innies the way a kindergarten teacher does 4-year-olds. These overseers offer simple toys (finger traps and caricatures) or comfort-food prizes (waffles) and candy (popsicles, punch, and “spicy candy”) as incentives to an innie that does his work well. But they also restrict them all to their “room” as punishment for any sort of disobedience, or force them to apologize repeatedly until the overseers are satisfied that “they mean it.” Innie-Dylan, played by Zach Cherry, in a fit of anger, even bites Milchick.\n\nUnbidden, the thought occurs to the viewer that the four innies—the main protagonists of the series—are not merely childlike but in a real way are children, even infants.\n\nThis same suspicion takes on a more sinister shape when innie-Helly, after desperately trying and failing to escape Lumon—each time being sent back by outie-Helly—receives a recorded message from the latter telling her (in a firm “mom voice”) that “Eventually we all have to accept reality, so here it is: I am a person. You are not.”\n\nAt that point, especially if one has paid any attention to the abortion debate over the last half century, something clicks … and suddenly the recurring pregnancy subplot and even the umbilical language of “innie” and “outie” take on a whole new meaning. Outie-Helly continues: “I make the decisions. You do not.”\n\nWe almost expect outie-Helly to shout, “My body, my choice!” The innies are wholly dependent on and created by their parental outies—and are consequently treated by them as somewhat disposable property, without rights. Notice that the Severed floor of Lumon is windowless … perhaps a womb without a view?\n\nSimilarities to the Abortion Debate\n\nAt the center of “Severance” is what today we tend to call the “status” of the innie—his or her (its?) moral, legal, and metaphysical value or dignity. Is the innie, as outie-Helly coldly declares, not really a person? Or is the innie, as outie-Mark casually says at one point to a non-severed who tries to prick his conscience, just a part of the outie? Or, as innie-Mark insists to Ms. Casey (Dichen Lachman), the strange and spacey therapist to on the Severed floor, “We are people, not parts of people.” The opposed “talking points”—or really, first principles—of the abortion debate are obvious.\n\nAnd the drift of the season, as it unfolds, is that innie-Mark is in fact his own person, with his own (albeit limited) memories and (underdeveloped) personality—he doesn’t remember, much less feel the grieve of outie-Mark who is coping with his wife’s death, the trauma that he is trying to escape by being severed for half his life.\n\nSimilarly, innie-Helly shows her own uniqueness by ultimately trying to bring Lumon down literally from within. That’s an action outie-Helly, a propagandist for Lumon and the daughter of the company’s creepy CEO, would never condone.\n\nWhen a friend says she couldn’t undergo severance because she’d always be thinking about “the other one,” outie-Mark unconvincingly insists that “there is no ‘other one.’ It’s me. I do the work.” But of course it’s not, and he doesn’t.\n\nThe emotional—and perhaps ontological—wall between the two severed “halves” comes to the fore most forcefully when the fourth innie, Irv (John Turturro), who had until then been a devoted Lumon employee revering the memory of Kier Eagan, the founder and patriarch of Lumon, discovers that the outie of his friend and romantic interest. Burt (Christopher Walken), an innie in another department, is about to retire. Irv panics. While innie-Burt accepts with docility the fact that after he leaves work that day he will no longer exist, Irv tells it like it is, addressing innie-Burt’s coworkers: “You’re all going to stand here and let him die?”\n\nCursing at Mr. Milchick, he accuses him: “You’re not severed. . . No one can rip your memories away from you, snuff them out, like they never existed. Like you never existed!” When an outie quits Lumon, he doesn’t stop a beating heart, but he does end a life.\n\n“Severance” seems to be constantly provoking not only the rather personal question, “Would you ever get severed?” but also more worrisome prerequisite questions: “What kind of claim would I have over the life of my innie, once I have created him or her (or it)?” “My innie is in my body, but is what I do with it/she/he simply ‘my choice’?” “If I quit Lumon, am I not effectively committing murder?” “If I terminate my employment, aren’t I terminating my ‘pregnancy’?”\n\nChallenging the Pro-Choice Perspective\n\nThese questions, particularly for viewers sympathizing with innie-Helly’s defiance of outie-Helly, suggest that “Severance” is showing that just because you create doesn’t mean you control—or own.\n\nThe main reason the pro-choice perspective gets a foothold in us is that a pregnant woman and the father have no personal acquaintance with the fetus growing within her. (This is also why ultrasound machines are so dangerous to public opinion about abortion.) Like our readiness to say horrible things on internet message boards or in the comments section to faceless and nameless interlocutors, it’s far easier to “terminate a pregnancy” when the fetus is a perfect stranger, indeed almost a merely theoretical object.\n\n“Severance” seems to be asking, what if you knew personally the “thing” growing in your womb? What if you were friends with “it”? What if you were loved “it”? Wouldn’t you at least stop calling it an “it”?\n\nOf course, this is not to say that the directors and writers behind “Severance” intend it to be about the fetus and the morality of an abortion. Stiller himself was a frequent and high-profile endorser of abortion supporter Kamala Harris in her bid for the presidency last year, so there’s no reason to think he and creator/writer Dan Erickson are closet pro-lifers. No doubt—as one finds many online propose and Stiller himself has said in interviews—he is closer to thinking (consciously) about something more like the Jungian unconscious “shadow-self” and its opposition to one’s conscious persona.\n\nBut sometimes artists don’t fully grasp the meaning of their own creations, what their own concrete universals and symbols suggest, and the shadow-self might itself be at work in the writing of “Severance.” (What might the writers or the execs at Apple do to the show in future seasons, were they to read this article?)\n\nAs “Severance”concludes its second season in March 2025, presenting its own curveballs and revelations that deepen the intertwined narratives and start to answer our questions, we should be careful not to take the question about life in the womb as some sort of key to unlocking or predicting the story’s secrets. “Severance”is much more than a covert metaphorical defense of the pro-life thesis.\n\nEven if there’s allegory here—regardless what that allegory is—it would be foolish to look for symbolism and clues to the metaphor in every object and scene. Good art is not so simplistic, and “Severance”is nothing if not good art—arguably the best thing on television in recent years. Trying to decipher every element as “standing for” something else will inevitably interfere with the experience, to say nothing of the fact that one will start to see things that aren’t there.\n\nYet it’s also hard to unsee the pro-life angle once you see it.","summary":"Spoiler alert: This article will assume the reader has already seen the first season. Is hit series “Severance” subtly making the case we should consider... Read More\n\n\nThe post Is ‘Severance’ a Stealth Critique of the Pro-Choice Movement? appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/03/20/is-severance-a-stealth-critique-of-the-pro-choice-movement/","image":"https://www.dailysignal.com/wp-content/uploads/2025/03/Severance-scaled.jpeg","video":null,"publish_date":"2025-03-20 14:00:00","author":"Chris Decaen","authors":["Chris Decaen"],"language":"en","source_country":"us","sentiment":-0.019},{"id":302258022,"title":"CBS host Gayle King insists DEI means 'definitely earned it'","text":"CBS host Gayle King argued people didn’t understand what DEI, or diversity, equity and inclusion, really means during a Wednesday morning segment. \"CBS Mornings\" co-host Vladimir Duthiers introduced a recent report from the Washington Post that the U.S. Department of Defense (DOD) had removed several pages on minority servicemen, including one on Ira Hayes, a Native American Marine who helped raise the U.S. flag in the famous Iwo Jima photo taken during World War II. Duthiers described the move as part of President Donald Trump’s \"anti-DEI mandate,\" which offended King. 'THE VIEW' FUMES TRUMP IS HELPING RACISTS WITH DEI POLICIES \"It’s insulting to include that in DEI,\" King said. \"DEI to me means ‘definitely earned it.’ You know, people don’t understand exactly, I think, what DEI is. It’s really heartbreaking to see what’s happening here.\" Duthiers pointed out that some of the pages that were removed have since been restored. Another notable figure briefly removed from the DOD website included famous baseball player Jackie Robinson, who served as a second lieutenant during World War II. After some backlash to the move, the story was later restored on Wednesday. In a comment to Fox News Digital, Pentagon press secretary John Ullyot said that the department is pleased with efforts removing DEI content from its platforms and praised the service of people like Robinson and Hayes for characteristics outside of race. CBS HOST GAYLE KING, WHO DONATED TO KAMALA HARRIS IN 2010, SAYS DEM IS 'SO UNIQUELY QUALIFIED' TO BE PRESIDENT \"In the rare cases that content is removed – either deliberately or by mistake – that is out of the clearly outlined scope of the directive, we instruct the components and they correct the content so it recognizes our heroes for their dedicated service alongside their fellow Americans, period,\" the statement read. The Pentagon did not respond to questions about what other pages have been restored or whether deleting these pages was done on purpose or by mistake. CLICK HERE TO GET THE FOX NEWS APP King made a similar comment in 2023, decrying how the term \"wokeism\" became a pejorative for radical left-wing ideas. \"I know, it’s so sad to me now that the word ‘wokeism’ has now almost become weaponized,\" King said. \"It’s really missing the point about what’s being taught here. You know, I don’t look at it as ‘wokeism’ so much as ‘truthism.’\"","summary":"“CBS Mornings&quot; co-host Gayle King criticized the U.S. Department of Defense for briefly removing pages on minority figures in history during a DEI purge of its website.","url":"https://www.foxnews.com/media/cbs-host-gayle-king-insists-dei-means-definitely-earned-it","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/cbs-gayle-king-says-dei-means-definitely-earned-it.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-20 13:44:08","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"us","sentiment":-0.067},{"id":302247158,"title":"Mark Carney to call snap election in Canada","text":"HuffPost UKPutin's Response To Being Told He's Late To Speak To Trump Is Very TellingThe Russian president seemed pre-occupied by discussions with oligarchs.\n\nHuffPostKaroline Leavitt’s Briefing Blunder Accidentally Undoes Key Trump Policy, Sparks Mockery Online\"Hmm. It’s almost as if she’s completely unprepared and grossly incompetent,\" one critic said in roasting the Trump White House press secretary's gaffe on social media.\n\n Why this ad?Go ad-free* \n\nHuffPostDonald Trump Hints At Barron Trump's Future Career — And It May Surprise YouThe president discussed his youngest son's aptitude in a Fox News interview with Laura Ingraham.\n\nThe Northern EchoState Pension warning as thousands to be denied £470 payment increaseState Pension payments will increase by £470 in April, but nearly half a million pensioners are set to miss out on the boost\n\nThe TelegraphPutin’s key demand is designed to inflict maximum damage on UkraineVolodymyr Zelensky had just touched down in Kyiv after being told by Donald Trump that Ukraine “doesn’t have any cards” when the explosion happened.\n\n Why this ad?Go ad-free* \n\nBuzzFeedA Man Who Voted For Donald Trump Is Now Asking For Help After His Wife Was Detained By ICE“I knew they were cracking down. I guess I didn’t know how it was going down,” said Bradley Bartell, whose wife, Camila Muñoz, is an immigrant from Peru.\n\nHuffPostSteve Bannon Makes Unsettling Prediction For Trump In 2028The far-right former Trump adviser just scuttled reports of his own run with an even more ominous prediction.\n\nHuffPostThis Video Of Kamala Harris Warning About A Second Trump Presidency Is Going ViralMuch of what Harris predicted on the campaign trail has come to pass since Trump took office again.\n\n Why this ad?Go ad-free* \n\nThe TelegraphBankrupt council hits disabled residents with ‘blue badge tax’A bankrupt council has hit disabled drivers with a £25 parking charge as it struggles to plug a £2.1bn hole in its finances.\n\nEvening StandardRussian region declares state of emergency as Ukraine strikes military baseRussia and Ukraine have continued to exchange fire following calls agreeing to a limited ceasefire\n\nINSIDERWhite House press secretary Karoline Leavitt called her age-gap marriage an 'atypical love story.' Here's what to know about her life and career.Karoline Leavitt is the youngest-ever press secretary. Her husband Nicholas Riccio is 32 years older. Learn more about her education and career.\n\n Why this ad?Go ad-free* \n\nThe HillGOP chairs ‘very concerned’ over report of Trump changing military commandsThe Republican chairs of the House and Senate Armed Services committees issued a joint statement on Wednesday criticizing the idea of the U.S. drastically changing its military combatant command structure, saying they “will not accept” those changes without coordination with Congress and other agencies. The statement marks one of the first major instances of Republican…\n\nThe HillOpinion - Sadly, Trump is right on UkraineUkraine's President Volodymyr Zelensky provoked wider war by violating peace deals with Russia and seeking NATO military aid and membership, while Joe Biden also contributed crucially to the escalation and perpetuation of fighting by leaving the decision to Zelensky and pledging to respond \"swiftly and decisively\" if Russia invaded.\n\nFortuneEurope’s top court may soon halt a tiny country’s notorious ‘golden passport’ programA top court could soon put a stop to Europe's most notorious 'golden passport'\n\n Why this ad?Go ad-free* \n\nThe IndependentTrump is naive, delusional – and being played by PutinTHE INDEPENDENT VIEW: Editorial: The two leaders may say that they trust each other – but nobody else with any sense trusts either of them\n\nThe TelegraphEU shuts Britain out of €150bn rearmament fundBritish arms companies will be excluded from a €150 billion EU fund to boost European defence unless the Government signs a security pact with Brussels.\n\nYahoo News UKMajor PIP and universal credit benefits changes confirmed by DWP - what you missedExperts warn up to 1.2 million disability benefit claimants could lose out on thousands of pounds a year because of the cuts.\n\n Why this ad?Go ad-free* \n\nThe IndependentTrump whines about ‘absolutely terrible’ Fox News White House correspondent, says she should work for CNN‘I watched Jacqui Heinrich from Fox over the weekend and I thought she was absolutely terrible. She should be working for CNN, not Fox,” Donald Trump raged on Truth Social\n\nThe Daily BeastTrump Lays Into Senior Fox Reporter Who Dared to Speak OutDonald Trump on Wednesday criticized a senior Fox News reporter who recently took issue with the White House’s move to decide for itself which media outlets cover the administration. “I watched Jacqui Heinrich from Fox over the weekend and I thought she was absolutely terrible. She should be working for CNN, not Fox,“ Trump complained on Truth Social about the network’s Senior White House Correspondent, who filled in as host of Fox News Sunday. Trump added: ”Not surprisingly, I later found out t\n\nThe Daily BeastMusk’s DOGE Goon Accidentally Triggered Secret Service Alert in White House ComplexA DOGE employee working for Elon Musk found himself in a standoff with the Secret Service on the roof of the Eisenhower Executive Building while scouting locations for installing Starlink, The New York Times reports. Starlink, the satellite internet service owned by Musk’s SpaceX, is now accessible across the White House complex after it was “donated” to the U.S government by the MAGA billionaire, according to the Times. But the service, which beams internet signals to the user from low-orbiting","url":"https://uk.news.yahoo.com/mark-carney-call-snap-election-133710765.html","image":"https://s.yimg.com/ny/api/res/1.2/KnkQV7hgjkxJf7tk_fqZAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_telegraph_818/8b7ef6d1e647d6afcc54830e14bc4152","video":null,"publish_date":"2025-03-20 13:37:10","author":"Benedict Smith","authors":["Benedict Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.192},{"id":302264342,"title":"Irony alert: Fox News host tries to cancel late-night TV star after decrying cancel culture","text":"President Donald Trump confidant and popular Fox News host Sean Hannity has a long record of criticizing cancel culture.\n\nBut he appeared to take a swing at it Wednesday night against late-night comedian Jimmy Kimmel.\n\nThe host of “Jimmy Kimmel Live!” has repeatedly mocked billionaire Elon Musk over his Tesla shares falling and even joked about the recent violence at Tesla dealerships where vandals have lit vehicles on fire.\n\n“Well, let me see if I can explain it for you,” Kimmel said to Musk during a recent show, “When you pull out a chainsaw to celebrate firing thousands of people, they get mad.”\n\nHannity and other Trump supporters blasted the comic and all but called for him to be pulled off the air.\n\nHannity on Wednesday:\n\nJimmy Kimmel’s show is owned and run by ABC Disney, and Disney’s run by a guy by the name of Bob Iger. Bob, are you OK with this seeming glorification of violence? Is this the inclusive woke, DEI? The ABC Disney brand? \n\nNow think about it, Jimmy. He sobs, he weeps, when an election doesn’t go his way. He demands compassion if he’s having problems in his personal life. But yet, ABC Disney, Bob Iger allow a host, in my opinion, to be celebrating what has been happening to Tesla? Against regular Americans that drive Teslas? Making jokes about it all?\n\nBob Iger, you’re the CEO of Disney. Are you proud of this? Jimmy Kimmel is an unhinged loser. \n\nNumerous auto industry analysts have also pointed to Musk’s close association with Trump and with far-right causes globally. Tesla showrooms in the U.S. have been besieged by protesters and its vehicles vandalized on the street. Tesla owners, perhaps in a bid to avoid being targeted, have placed bumper stickers on their cars with messages like, “I bought it before Elon went nuts.” \n\nShares have plummeted 45% in 2025 and tumbled more than 15% to $222.15 earlier this month, the lowest since late October, reflecting newfound pessimism as sales crater around the globe. \n\nMusk pumped $270 million into Trump’s campaign heading into the 2024 election, appeared on stage with him and cheered Trump’s victory over Democratic candidate Kamala Harris in November.\n\nThe Associated Press contributed to this report.","summary":"Hannity and other Trump supporters blasted the comic and all but called for him to be pulled off the air.","url":"https://www.nj.com/politics/2025/03/irony-alert-fox-news-host-tries-to-cancel-late-night-tv-star-after-decrying-cancel-culture.html","image":"https://www.nj.com/resizer/v2/HFJ2JVXEFJDYZL2TI7PK4US5SQ.jpg?auth=8977306098a994de4a3379ca51478afbaaed920e1616c4d6c7ec1bbfd468c995&width=1280&quality=90","video":null,"publish_date":"2025-03-20 13:31:41","author":"Matt Arco","authors":["Matt Arco"],"language":"en","source_country":"us","sentiment":-0.264},{"id":302240400,"title":"Do as we say, not as we do? GOP defends Tesla while promoting other boycotts","text":"President Donald Trump himself and a long list of his supporters have attempted to come to the aide of world’s richest man Elon Musk in recent days as his company’s stocks and Tesla sales have slumped here and in Europe.\n\nThe president recently touted how great the vehicles were as they were on display outside of the White House and his own Commerce Secretary was on Fox News Wednesday night urging people to buy Tesla stock, for example.\n\nBut when a social media account run by the Republican House Committee on the Judiciary posted to X that “Democrats are cheering for American companies to fail,” calling it “disgusting behavior,” critics were quick to call out the hypocrisy.\n\n“Is this you?” author Shannon Watts posted to X, with an old tweet from the same account from 2023 that read, “Bud Light. Disney. Target. Go woke. Go broke.”\n\n“Hmmm, this you House Judiciary GOP 22 months ago?\" another X user commented.\n\nTesla has been pummeled this year under competition from rival electric vehicles, particularly out of China.\n\nNumerous auto industry analysts have also pointed to Musk’s close association with Trump and with far-right causes globally. Tesla showrooms in the U.S. have been besieged by protesters and its vehicles vandalized on the street. Tesla owners, perhaps in a bid to avoid being targeted, have placed bumper stickers on their cars with messages like, “I bought it before Elon went nuts.” \n\nShares have plummeted 45% in 2025 and tumbled more than 15% to $222.15 earlier this month, the lowest since late October, reflecting newfound pessimism as sales crater around the globe. \n\nMusk pumped $270 million into Trump’s campaign heading into the 2024 election, appeared on stage with him and cheered Trump’s victory over Democratic candidate Kamala Harris in November.\n\nThe Associated Press contributed to this report.","summary":"\"Is this you?\"","url":"https://www.nj.com/politics/2025/03/do-as-we-say-not-as-we-do-gop-defends-tesla-while-promoting-other-boycotts.html","image":"https://www.nj.com/resizer/v2/JWWSSOYX5ZCNJF6MEY2WOYUOIA.jpg?auth=fa51510d4bfa9ec05e5075b7fce140bf3bfca47189fca5203f4f683593938d21&width=1280&quality=90","video":null,"publish_date":"2025-03-20 13:15:32","author":"Matt Arco","authors":["Matt Arco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.118},{"id":302245860,"title":"CBS Paints Trump as Worse Than Venezuelan Gangs","text":"In the moral battle between President Donald Trump and the violent Venezuelan gang Tren de Aragua, the media have chosen a side. The foreign gangsters are less morally questionable than the president.\n\nThe Trump administration sent a plane stuffed with alleged Tren de Aragua members to El Salvador, which is apparently more of a crime than whatever the gangsters did in America.\n\nThere are legal issues here. A Barack Obama-appointed federal judge tried to order Trump not to send the plane. The administration didn’t release their names or their offenses, so some may not be gangsters. The flight can be debated. But in today’s media, the first objective is to present Trump as a malignant actor. The tone of his coverage should be all negative all the time. There’s nothing resembling an “achievement” on immigration.\n\nOn “CBS Mornings Plus,” co-host Adriana Diaz weirdly touted an upcoming segment to explain what “the Trump administration’s move to deport hundreds of Venezuelan immigrants using a law from 1798 could mean for you today.” It sounded like Whoopi Goldberg claiming on “The View” that any of us could be deported for being on the wrong side of Trump.\n\nThen came this false labeling. Diaz opened a segment this way: “Joining us now to break it all down is Katherine Yon Ebright, a lawyer with the nonpartisan Brennan Center for Justice. Her work focuses specifically on wartime powers and the constitutional separation of powers.”\n\nTo be blunt, this is a lie. This leftist group may be tax-exempt, but it’s not nonpartisan. Take a look at the OpenSecrets website for campaign contributions by employees of the Brennan Center for Justice. It lists hundreds of contributions–but only to liberal PACs and to Democrats, including Joe Biden and Hillary Clinton and Barack Obama for President. Four Brennan Center staffers donated to Kamala Harris’ presidential campaign last year.\n\nYou can also tell this is a Democrat episode on CBS when Diaz compared Trump’s flight of gangsters and their legal justification under a 1798 law to “the internment of 31,000 noncitizens of Japanese, German and Italian descent after the bombings of Pearl Harbor.” CBS mentioned Ronald Reagan apologized for it as a regrettable episode of “racial prejudice,” but they didn’t mention the president at that time was their Democrat hero Franklin Roosevelt.\n\n“Nonpartisan” Ebright played the same game: “(T)he internment of 31,000 noncitizens without due process and based principally on their ancestry was a shameful moment in American history. And so reviving the Alien Enemies Act to target new ethnic groups today is, frankly, un-American and it shows that we haven’t learned from the mistakes of our past.”\n\nSo FDR was “un-American”? It’s weird when the Left calls things “un-American,” since they generally hate nationalism and patriotism in all its forms. Any border enforcement against illegal aliens (even violent criminals) is “targeting ethnic groups,” as if it’s just like FDR interning actual American citizens.\n\nThe only balancing note was co-host Tony Dokoupil acknowledging these gangsters committed some crimes in America. He noted officials said the gangsters trade immigration paperwork and hide their gang affiliation: “So within the law, what can this government do to take care of the very real threat of violence without trampling on the civil liberties that you’re concerned about?”\n\nThe Left touts the “civil liberties” of illegal immigrants as if they were uniformly sympathetic Trump victims. When some of these people commit violent crimes–and the raped and/or murdered people lose their civil liberties–networks like CBS ignore or downplay them because that would feel like positive coverage for Trump, and that cannot be allowed.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"In the moral battle between President Donald Trump and the violent Venezuelan gang Tren de Aragua, the media have chosen a side. The foreign gangsters... Read More\n\n\nThe post CBS Paints Trump as Worse Than Venezuelan Gangs appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/03/20/cbs-paints-trump-worse-venezuelan-gangs/","image":"https://www.dailysignal.com/wp-content/uploads/2025/03/planeVene.jpg","video":null,"publish_date":"2025-03-20 13:00:00","author":"Its Homeless Problem,Tim Graham","authors":["Its Homeless Problem","Tim Graham"],"language":"en","category":"politics","source_country":"us","sentiment":-0.307},{"id":302246242,"title":"'Buyer’s remorse': These Trump voters are 'getting hit the hardest' by MAGA’s 'slow-motion train wreck'","text":"Although often critical of liberal and progressive policies, conservative opinion columnist Matt K. Lewis is no fan of President Donald Trump and the MAGA movement. Lewis, despite some policy disagreements, rooted for Democratic nominee Kamala Harris in the 2024 presidential election — and he has an extremely negative view of Trump's second term in the White House.\n\nIn his March 19 column, the Never Trump conservative lays out a variety of ways in which 2024 Trump voters are now \"getting hit the hardest\" by his policies.\n\n\"At some point,\" Lewis comments, \"you have to stop feeling bad for people who repeatedly stick their hand in the fire and act shocked when it burns. Come on, folks — how many times do you need to touch a stove before you realize it’s hot?\"\n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs\n\nThe columnist cites specific examples of Trump voters being harmed by the president's policies, including a Wisconsin man whose Peruvian wife is being detained by U.S. Immigration and Customs Enforcement (ICE) and a former U.S. Department of Veterans Affairs (VA) worker who lost her job because of the Trump Administration and the Elon Musk-led Department of Government Efficiency's (DOGE) mass layoffs.\n\n\"Take Bradley Bartell, a Wisconsin man who voted for Trump in 2024 and is now devastated because ICE has detained and may deport his Peruvian wife,\" Lewis explains. \"He 'knew they were cracking down,' he says. 'I guess I didn’t know how it was going down.' Really, Bradley? You voted for the guy who said he was going to round up immigrants, but somehow, you didn't get the memo?\"\n\nLewis continues, \"Then there's David Pasquino, a vet who worked for Veterans Affairs until Trump's so-called 'efficiency' cuts came around. Now, he's complaining about the 'chainsaw' they used instead of a 'scalpel.' Now, he feels 'betrayed.' Did you think being a veteran would save you from the guy who refers to fallen service members as 'losers' and 'suckers,' David?\"\n\nAnother example Lewis cites is Trump voter Jennifer Piggott, who was abruptly laid off from her job at the U.S. Treasury Department's Bureau of Fiscal Service and told Reuters, 'I feel a little bit betrayed.'\"\n\nREAD MORE: 'The threat is extremely real': Critics sound alarm over Trump 'emergency'\n\n\"These aren’t isolated incidents,\" Lewis argues. \"This is a self-inflicted catastrophe…. For those of us who spent years waving red flags, the temptation is to yell, 'Told ya so!'…. These are the folks who figured, 'What the heck, maybe he'll fix things.' Now, they're the ones getting hit the hardest and possibly regretting their decision.\"\n\nLewis adds, \"As buyer’s remorse starts to spread, it's like watching a slow-motion trainwreck.\n\nREAD MORE: Busted: Report exposes Musk operatives who infiltrated Social Security Agency\n\nMatt K. Lewis' full column for The Hill is available at this link.","summary":"Although often critical of liberal and progressive policies, conservative opinion columnist Matt K. Lewis is no fan of President Donald Trump and the MAGA movement. Lewis, despite some policy disagreements, rooted for Democratic nominee Kamala Harris in the 2024 presidential election — and he has an extremely negative view of Trump's second term in the White House.\n\nIn his March 19 column, the Never Trump conservative lays out a variety of ways in which 2024 Trump voters are now \"getting hit the hardest\" by his policies.\n\n\"At some point,\" Lewis comments, \"you have to stop feeling bad for people who repeatedly stick their hand in the fire and act shocked when it burns. Come on, folks — how many times do you need to touch a stove before you realize it’s hot?\"\n\nREAD MORE: Two Trump firings 'an illegal and outrageous affront to the American people': watchdogs\n\nThe columnist cites specific examples of Trump voters being harmed by the president's policies, including a Wisconsin man whose Peruvian wife is being deta","url":"https://www.alternet.org/matt-lewis-trump-voters-doge/","image":"https://www.alternet.org/media-library/image.jpg?id=58367272&width=1200&height=600&coordinates=0%2C106%2C0%2C107","video":null,"publish_date":"2025-03-20 12:59:47","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"us","sentiment":-0.407},{"id":302234744,"title":"Bad News, Democrats. Your Party Has Never Been More Unpopular","text":"According to a new poll, 27 percent of registered American voters have a positive view of the Democratic Party, the lowest level recorded since NBC News began asking the question in 1990.Newsweek contacted the Democratic Party for comment on Thursday via online contact form outside regular office hours.Why It MattersIn November, Donald Trump secured a convincing presidential election victory over then-Vice President Kamala Harris, receiving 312 electoral votes to his Democratic rival's 226 and also winning the popular vote for the first time. The Republican Party also flipped the Senate and held on to a narrow House majority.The scale of Trump's triumph has sparked widespread soul-searching within the Democratic Party over what went wrong and how to rebuild. Democratic Senate leader Chuck Schumer has come under sustained criticism from within his party after voting last week to advance a Republican funding bill in a bid to avoid a government shutdown. The fallout over the vote highlights divisions among Democrats over how to proceed under the Trump administration.What To KnowNBC News polled 1,000 registered American voters between March 7 and 11. While 55 percent of respondents said they had a negative view of the Democratic Party, 27 percent said they had a positive perception. The poll had a margin of error of 3.1 percentage points.The negative and positive figures for the Democrats were respectively the highest and lowest recorded since the network began its polling series more than three decades ago.The survey also found that 38 percent of voters had a \"very\" negative view of the Democrats, contrasting 7 percent who had a \"very\" positive perception. Among independent voters, 11 percent had a positive view of the Democrats, while 56 percent saw them negatively.There was also evidence of dissatisfaction with the party from its base, with 20 percent of Democratic voters viewing it negatively, twice as high as the figure for Republicans who had a negative view of their party.The Democrats' approval figure is still above the lowest recorded by Republicans in an NBC News survey. In 2013, during a government shutdown, the poll found that 22 percent of respondents had a positive view of the Republican Party.The survey, which was conducted before the Republican funding bill passed the Senate, showed that Democratic voters wanted their party to take a tougher position in Congress.Among Democratic voters, 65 percent said they wanted their congressional representatives to \"stick to their positions even if that means not being able to get things done in Washington,\" while 32 percent said they should \"make compromises with Trump to gain consensus on legislation.\"The findings represented a significant shift from Trump's first term. In April 2017, 59 percent of Democratic voters backed the compromise option.On March 14, Schumer and nine other Democratic senators backed the Republicans' spending bill in a procedural vote, reaching the 60-vote threshold that made it filibuster-proof. All but two of these lawmakers then voted against its final passage, at which point the Republican senators passed it—with only a simple majority being required.Ahead of Schumer's vote, thousands of people signed a Change.org petition created by a Democratic activist urging him to block the funding bill. His support of the bill has sparked not only backlash from within his party but also calls for him to face a primary challenge.What People Are SayingDemocratic pollster Jeff Horwitt of Hart Research Associates, which conducted the survey in collaboration with Republican pollster Public Opinion Strategies, told NBC News: \"With these numbers, the Democratic Party is not in need of a rebrand. It needs to be rebooted.\"MSNBC contributor Rotimi Adeoye wrote on X, formerly Twitter: \"I don't want a 'left v moderate' ideological primary for Schumer. I want Pat Ryan, AOC, Daniel Goldman, and anyone else with fresh energy to primary Schumer. We need a new generation of leaders, not someone who has imaginary friends and uses them to understand swing voters.\"Pam Keith, a former Democratic congressional candidate, wrote on X: \"Let it be known this Friday March 14, 2025 that if @AOC primaries @SenSchumer, she will have my unqualified and total support, starting with a significant donation. And let it also be known that I will NEVER donate another dime to any Senator who votes yes for cloture.\"What Happens NextThe Democrats face intense pressure to reorganize their party and policy platform ahead of next year's midterm elections, where they'll have the opportunity to seize control of either or both chambers of Congress.","summary":"Democratic voters want the party to take a firmer line in Congress, even if it leads to gridlock, according to a new poll.","url":"https://www.newsweek.com/bad-news-democrats-your-party-has-never-been-more-unpopular-2047720","image":"https://d.newsweek.com/en/full/2610992/chuck-schumer.jpg","video":null,"publish_date":"2025-03-20 12:41:06","author":"James Bickerton","authors":["James Bickerton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.331}]}