{"offset":0,"number":50,"available":5330,"news":[{"id":253846504,"title":"Traveling with Trump’s aggressive ally: JD Vance shares his weight loss journey, strategy against Kamala Harris, intention to meet Mike Pence, and current reading choice","text":"Donald Trump’s attack dog has two goals for the election campaign: Take the policy fight to Kamala Harris and to keep off the weight he lost since becoming a senator. On Tuesday, J.D. Vance managed the first with aplomb, crisscrossing two battleground states ahead of Harris (aides call it ‘bracketing’), generating headlines and made-for-social media memes as he tried to confront the vice president at a tiny regional airport in Wisconsin. But the latter may be harder as DailyMail.com discovered aboard Vance’s campaign plane, nicknamed Trump Force Two. Lunch was sandwiches and fries from Chick-Fil-A. In a wide-ranging interview, with wife Usha sitting beside him, Vance discussed everything from his role in the campaign, the work of J.R.R. Tolkien, adjusting to having a Secret Service detail and how much weight he lost after becoming a senator. A croissant sat untouched on the conference table, part of a breakfast-skipping regimen of frequent exercise and healthier eating. ‘I haven’t taken any drugs. Obviously, you eat a little bit less, but it’s also just eating better,’ he said. ‘I tend to skip breakfast, whereas before I would have, like, you know, three waffles and scrambled eggs and bacon.’ The catalyst was completing his successful Senate campaign two years ago and realizing that he was out of breath just horsing around with his three children. He started running and making sure he could fit the gym into his routine. The result was dropping 30lb, he said. The new svelte figure was noticed by Donald Trump. He told aides he was impressed by the way Vance’s suits were fitting better. ‘Time will tell man,’ said Vance. ‘In three months, maybe I’ll be a lot fatter.’ The first stop of the day is Shelby Township, in Michigan, giving Vance the chance to demonstrate his role. This is not a rally but a question-and-answer session with regional journalists. And Trump’s attack dog is like a canine with a bone. A question from a local Michigan reporter about terrorists from the Middle East, simply ‘highlights the weakness of the Kamala Harris administration,’ according to Vance. A question about why Donald Trump picked him as running mate brings a pivot to attack Harris for selecting Minnesota Gov. Tim Walz as hers, ‘bending the knee to the far left of the Democrat Party.’ And a question about whether Trump made a racist attack on Harris last week quickly becomes an attack on the vice president for ‘faking who she is depending on her audience.’ Some Trump insiders were unsure about the choice of Vance. Could the MAGA darling complement the former president’s hold on the base? His campaign team has come up with plan, devising events that contrast with Trump, generating headlines without hogging the limelight (the worst possible crime in Trump world). On Friday, Trump will address a very different audience in Montana: Thousands of supporters at one of his typically barnstorming rallies. So while the top of the ticket is riling up fans in arenas, Vance is leaning into his obsession with detail, honed at an Ivy League law school, to dissect the polices of Kamala Harris. ‘I think that one, I grew up in a town that was affected by very stupid policies,’ he told DailyMail.com, referring to his difficult upbringing in southern Ohio and Kentucky. ‘But two, just because because I like this stuff, and I like to get into the details, we can just highlight for the American people how bad she is on public policy, and how good Donald Trump is on public policy.’ He said it was important not to underestimate Harris but to unpick the meaning underneath her frequent waffling. ‘I actually don’t think she’s dumb,’ he said. ‘I think the word salad comes from she’s clearly hiding what she actually believes from the American people. ‘She’s a far left liberal who wants to take San Francisco liberalism nationwide.’ The former Marine seemed happy to be on the attack after two weeks of weathering incoming. News organizations had busied themselves sifting through old interviews and social media posts to attack him for comments about ‘childless cat ladies’ or inventing smears about couches. He expected that, he said, and has gone out of his way to engage with what he called the ‘hostile press.’ But other aspects of becoming Trump’s running mate meant more difficult adjustments. ‘The Secret Service thing is just weird. I don’t think we’ll ever get used to it,’ he said of the 24-hour protection given to presidential candidates and their VP picks. ‘I hate not driving. Our kids have finally kind of gotten used to it. They call them their police friends.’ The couple have three children all under the age of seven. Usha was engaged in a book as her husband chatted, but smiled occasionally at the questions and at his responses. Much has been made of Vance’s love of books by English author J.R.R. Tolkien. His venture capital firm is named Narya, after one of the rings featured in the “Lord of the Rings”. And he said there was no doubt it had inspired some of his thinking. ‘The fundamental implication, or the moral lesson, of “The Lord of the Rings” is that, compared to something like “Game of Thrones” or more modern novels, is that we often know the right from the wrong,’ he said. ‘The really important thing is whether you have the courage and the will to see the right through. I think that’s a very important moral lesson.’ Plus Tolkien was a thoughtful Catholic, added Vance, who officially converted to Catholicism in 2019. ‘There are, I’m sure, all these subtle ways in which has influenced me,’ he said. His current reading may surprise people: “Slouching Towards Bethlehem” by Joan Didion. Her 1968 collection of essays chronicles California counterculture of the time. Usha introduced him to her work when they were dating, he said, and he sees parallels between her takedown of Sixties hippy culture and today’s liberals. ‘There’s an essay where she’s basically criticizing a think tank. Like these people sit around and they used to be important, and now they just write s***ty articles. And I’m like, Oh, God … everything old is new again.’ The seatbelt signs come on as the plane, a chartered 737 decorated with campaign slogans (think ‘Drain the Swamp of Washington Corruption’), approaches Detroit airport about an hour after leaving Vance’s home base of Cincinnati. With Trump staying home for the early part of the week, it is up to Vance to lead the campaign attack. He knows that his boss will be watching and scoring his performance. But Vance played down the idea that Trump is a demanding or temperamental person to work for, playing up their rapport and his sense of humor. Only one other person knows what it is like to be Trump’s running mate. Mike Pence played a near perfect hand as the straight man to the president’s antics until falling out in spectacular style over Trump’s attempts to upend the Constitution and hold on to power after the 2020 election. ‘I do want to talk to Mike Pence, because obviously he was vice president for four years, said Vance, before adding: ‘but I haven’t spoken to him since I was asked to be the VP nominee.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump&#8217;s attack dog has two goals for the election campaign: Take&#8230;\n\n\nThis Post: Traveling with Trump&#8217;s aggressive ally: JD Vance shares his weight loss journey, strategy against Kamala Harris, intention to meet Mike Pence, and current reading choice first appeared on Internewscast Journal","url":"https://internewscast.com/politics/traveling-with-trumps-aggressive-ally-jd-vance-shares-his-weight-loss-journey-strategy-against-kamala-harris-intention-to-meet-mike-pence-and-current-reading-choice/","image":"https://i.dailymail.co.uk/1s/2024/08/08/13/88308171-13723407-image-a-1_1723121617076.jpg","video":null,"publish_date":"2024-08-11 00:02:23","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.024},{"id":253846522,"title":"Trump faces sinking ship jokes as Celine Dion jabs him for playing ‘Titanic’ song at rally","text":"Celine Dion took a jab at Donald Trump on Saturday for using at an election rally the song she wrote and sang for the disaster movie Titanic, about the ocean liner’s sinking. The Republican US presidential candidate has been lampooned on social media after playing the 1997 track “My Heart Will Go On” at a rally in the US state of Montana on Friday, as a video of Dion performing the song was shown on a big screen. Dion’s management team and her record label, Sony Music Entertainment Canada, said in a statement on X the use of the song and video was “in no way” authorised. “Celine Dion does not endorse this or any similar use... And really, THAT song?” it added. Users on social media have made analogies between Trump’s campaign and the sinking ship at the heart of the James Cameron film. Trump campaign plays the theme from the Titanic at his rally pic.twitter.com/lspVW1hA5I — Kamala HQ (@KamalaHQ) August 10, 2024 Trump has appeared on the back foot since Kamala Harris replaced US President Joe Biden in the US election race for the White House. The former president appeared on track to win back the White House before Biden dropped out of the race on July 21, but Harris has made big gains since replacing Biden at the top of the ticket and announcing Tim Walz, Minnesota’s governor, as her running mate. “My Heart Will Go On” was released on Dion’s album Let’s Talk About Love and the soundtrack to Cameron’s film Titanic. It became one of the biggest songs of all time, selling 18 million copies and earning Dion an Oscar, a Golden Globe and several Grammys. Dion, 56, was forced to cancel a string of shows in 2023 and 2024, saying she was not strong enough to tour after being diagnosed with an autoimmune disorder. But she delighted fans last month by singing from the Eiffel Tower at the opening of the Olympics in Paris.","summary":"‘Really, THAT song? The singer’s record label says the use of the tune by the US presidential candidate was ‘in no way’ authorised.","url":"https://www.scmp.com/news/world/united-states-canada/article/3274041/trump-faces-sinking-ship-jokes-celine-dion-jabs-him-playing-titanic-song-rally","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/11/e60ed5a1-65b0-40ac-8fd2-83a5844dcc6a_675f40e3.jpg","video":null,"publish_date":"2024-08-10 23:58:46","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"cn","sentiment":-0.018},{"id":253846414,"title":"Donald Trump hurls shocking fat-shaming insults at US senator over the size of his belly... after he was accused of repeatedly branding Kamala a 'b***h' in private","text":"Donald Trump launched a barrage of jibes at Montana Senator Jon Tester's weight during his rally on Friday night, just hours after he was accused of repeatedly calling Kamala Harris a 'b****.' The former president, 78, took aim at the Montana senator's largess as the Democrat faces a tough re-election fight in November for a race that could define who controls the upper chamber of Congress. 'I don't speak badly about somebody's physical disability,' Trump said, possibly noting that Tester lost three fingers on one hand in a meat-grinder accident when he was nine. 'But he's got the biggest stomach I've ever seen,' Trump added. Scrutiny has fallen on Trump's operation in recent days amid an apparent slow-down in campaigning, but the former president drew a huge crowd to Friday's event in Bozeman, Montana. Insiders told the New York Times that he has found the transformation after Biden dropped out as being disorientating. In response to the change in rivals, behind close doors, he has reportedly branded Harris a 'b****', two people told the outlet. His campaign denied that language in a statement, but his quickness to attack has reportedly left him open to manipulation. While attacking Tester's weight, Trump rallied his supporters by slamming the senator on issues from the southern border to his voting record. 'For years, Tester has been telling Montana that he’s a moderate,' he said. 'While he votes with Biden, Harris, and Bernie Sanders and Elizabeth Warren.' Trump's jab at Tester's 'biggest stomach' is not the first time he has attacked the Montana Democrat's weight. He reportedly said Tester 'looks pregnant' at a private fundraiser in May, according to Politico. He told attendees: 'Have you ever seen this guy? He doesn’t look like a fat guy, except that his stomach is out.' That fundraiser in May was in aid of Texas Congressman - and former White House physician - Ronny Jackson, who also spoke at the rally in Montana on Friday night. In his remarks in Bozeman, Jackson echoed Trump's attack on Tester's weight as he branded him a 'hippopotamus.' 'This man is a sleazy, disgusting swamp politician,' Jackson said. 'The end of Jon Tester's career starts tonight. 'We're going to bring (Tester's election opponent) Tim Sheehy to the Senate to replace this swamp hippopotamus Jon Tester. Trump's focus on Tester's weight comes as many have noticed the former president appeared to lose weight in recent years, sparking speculation from some that he joined a growing number of celebrities who take Ozempic. Tester is seen as one of the most vulnerable Democrats in the senate in this election cycle, as one of the leading incumbents in a state that Trump won handily in the 2020 presidential race. With control of the senate currently a 50-50 split only decided by Vice-President Kamala Harris, close senate elections are drawing the spotlight ahead of November. With Montana routinely a Republican supporting state, Tester's campaign has attempted to draw a clear line between him and the Biden-Harris administration. In a Tester campaign advert released earlier this year, it was claimed that he 'worked with Republicans fighting to shut down the border, target fentanyl traffickers, and add hundreds of new Border Patrol agents. 'And he fought to stop President Biden from letting migrants stay in America instead of remain in Mexico.' In contrast, Sheehy's remarks at Friday's event saw him attempt to lump Tester in with the liberal wing of the Democratic Party, branding him a 'rubber stamp for the Biden-Harris agenda every single time it matters.' 'Jon Tester couldn’t find the courage to say, \"I’m going to vote against these terrible policies that are bad for Montanans,''' said Sheehy, a former military officer and businessman. According to a Decision Desk HQ poll cited by The Hill, Sheehy is running slightly ahead of Tester heading into the election, at 49 percent to 45 percent.","summary":"Trump drew a large crowd to Bozeman, Montana on Friday night, where he focused his remarks on Democrat Senator Jon Tester - and launched several crude attacks on his weight.","url":"https://www.dailymail.co.uk/news/article-13731631/Donald-Trump-Jon-Tester-weight-fat-shaming-bozeman-montana.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/08/10/23/88393839-0-image-a-14_1723329210956.jpg","video":null,"publish_date":"2024-08-10 23:57:46","author":"Editor,Will Potter For","authors":["Editor","Will Potter For"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.358},{"id":253846352,"title":"Harris, Trump campaign for support in the West","text":"Harris, Trump campaign for support in the West Hundreds stood in the blistering desert heat in Las Vegas to show their support for Vice President Kamala Harris Saturday, a day after former President Donald Trump held an event in Bozeman, Montana, to boost the chances of Senate candidate Tim Sheehy. Willie James Inman reports from Las Vegas.","summary":"Hundreds stood in the blistering desert heat in Las Vegas to show their support for Vice President Kamala Harris Saturday, a day after former President Donald Trump held an event in Bozeman, Montana, to boost the chances of Senate candidate Tim Sheehy. Willie James Inman reports from Las Vegas.","url":"https://www.cbsnews.com/video/harris-trump-campaign-for-support-in-the-west/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/10/f30dfdf8-3fe3-4dea-8ba0-727fd74b3a5f/thumbnail/1200x630/088e2c012517f1cf529de2e116960e33/inman.jpg?v=0a0c17d349635d55704afd4e16e28fc6","video":null,"publish_date":"2024-08-10 23:54:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.428},{"id":253846308,"title":"Kamala Harris vows not to interfere with the Fed—unlike Trump","text":"Harris was asked about Trump’s recent comments that presidents should have some say over interest rates and monetary policy – a move that would upend the longstanding practice of Fed independence of political actors. Harris said she could not disagree “more strongly” with that stance. “The Fed is an independent entity, and as president, I would never interfere in the decisions that the Fed makes,” she told reporters Saturday in Phoenix at the end of a campaign stop in swing-state Arizona. Trump has long expressed frustration that the executive branch doesn’t have more sway over interest rates. At a press conference on Thursday, he criticized Fed Chairman Jerome Powell saying the central bank chief had been a “little bit too early and a little bit too late” in adjusting rates. The former president said he “made a lot of money,” was “very successful” and thought he had “a better instinct than, in many cases, people that would be on the Federal Reserve or the chairman.” Powell has pledged not to let political pressure influence decision-making at the central bank. US presidents for decades have traditionally avoided publicly criticizing the Fed over interest rates. Harris, the Democratic nominee, also said she plans to being rolling out her policy platform in the next week, with a focus on the economy and keeping costs down. Voter frustration with President Joe Biden’s handling of the economy is a major political liability for Harris’ campaign as high prices have battered American households and overshadowed the administration’s efforts to highlight policies aimed at bolstering domestic manufacturing and infrastructure spending. Harris held a rally on Friday in Arizona, one of the battleground states that will decide November’s election, before heading to an event in Las Vegas Saturday — part of a campaign swing with Minnesota Governor Tim Walz, her running mate, aimed at seizing on fresh momentum for her White House bid. Polls show that Harris has erased Trump’s polling lead that he held for much of the summer with the candidates off on a three-month sprint to Election Day.","summary":"“The Fed is an independent entity, and as president, I would never interfere in the decisions that the Fed makes.\"","url":"https://fortune.com/2024/08/10/kamala-harris-federal-reserve-independent-monetary-policy-interference-donald-trump/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/GettyImages-2165930426-e1723332894494.jpg","video":null,"publish_date":"2024-08-10 23:49:22","author":"Akayla Gardner,Bloomberg","authors":["Akayla Gardner","Bloomberg"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.128},{"id":253846186,"title":"Donald Trump Criticizes US Senator for His Belly Size Amid Accusations of Disrespectful Remarks toward Kamala","text":"Donald Trump launched a barrage of jibes at Montana Senator Jon Tester’s weight during his rally on Friday night, just hours after he was accused of repeatedly calling Kamala Harris a ‘b****.’ The former president, 78, took aim at the Montana senator’s largess as the Democrat faces a tough re-election fight in November for a race that could define who controls the upper chamber of Congress. ‘I don’t speak badly about somebody’s physical disability,’ Trump said, possibly noting that Tester lost three fingers on one hand in a meat-grinder accident when he was nine. ‘But he’s got the biggest stomach I’ve ever seen,’ Trump added. Scrutiny has fallen on Trump’s operation in recent days amid an apparent slow-down in campaigning, but the former president drew a huge crowd to Friday’s event in Bozeman, Montana. Insiders told the New York Times that he has found the transformation after Biden dropped out as being disorientating. In response to the change in rivals, behind close doors, he has reportedly branded Harris a ‘b****’, two people told the outlet. His campaign denied that language in a statement, but his quickness to attack has reportedly left him open to manipulation. While attacking Tester’s weight, Trump rallied his supporters by slamming the senator on issues from the southern border to his voting record. ‘For years, Tester has been telling Montana that he’s a moderate,’ he said. ‘While he votes with Biden, Harris, and Bernie Sanders and Elizabeth Warren.’ Trump’s jab at Tester’s ‘biggest stomach’ is not the first time he has attacked the Montana Democrat’s weight. He reportedly said Tester ‘looks pregnant’ at a private fundraiser in May, according to Politico. He told attendees: ‘Have you ever seen this guy? He doesn’t look like a fat guy, except that his stomach is out.’ That fundraiser in May was in aid of Texas Congressman – and former White House physician – Ronny Jackson, who also spoke at the rally in Montana on Friday night. In his remarks in Bozeman, Jackson echoed Trump’s attack on Tester’s weight as he branded him a ‘hippopotamus.’ ‘This man is a sleazy, disgusting swamp politician,’ Jackson said. ‘The end of Jon Tester’s career starts tonight. ‘We’re going to bring (Tester’s election opponent) Tim Sheehy to the Senate to replace this swamp hippopotamus Jon Tester. Trump’s focus on Tester’s weight comes as many have noticed the former president appeared to lose weight in recent years, sparking speculation from some that he joined a growing number of celebrities who take Ozempic. Tester is seen as one of the most vulnerable Democrats in the senate in this election cycle, as one of the leading incumbents in a state that Trump won handily in the 2020 presidential race. With control of the senate currently a 50-50 split only decided by Vice-President Kamala Harris, close senate elections are drawing the spotlight ahead of November. With Montana routinely a Republican supporting state, Tester’s campaign has attempted to draw a clear line between him and the Biden-Harris administration. In a Tester campaign advert released earlier this year, it was claimed that he ‘worked with Republicans fighting to shut down the border, target fentanyl traffickers, and add hundreds of new Border Patrol agents. ‘And he fought to stop President Biden from letting migrants stay in America instead of remain in Mexico.’ In contrast, Sheehy’s remarks at Friday’s event saw him attempt to lump Tester in with the liberal wing of the Democratic Party, branding him a ‘rubber stamp for the Biden-Harris agenda every single time it matters.’ ‘Jon Tester couldn’t find the courage to say, “I’m going to vote against these terrible policies that are bad for Montanans,”’ said Sheehy, a former military officer and businessman. According to a Decision Desk HQ poll cited by The Hill, Sheehy is running slightly ahead of Tester heading into the election, at 49 percent to 45 percent.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump launched a barrage of jibes at Montana Senator Jon Tester&#8217;s&#8230;\n\n\nThis Post: Donald Trump Criticizes US Senator for His Belly Size Amid Accusations of Disrespectful Remarks toward Kamala first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/donald-trump-criticizes-us-senator-for-his-belly-size-amid-accusations-of-disrespectful-remarks-toward-kamala/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Donald-Trump-hurls-shocking-fat-shaming-insults-at.jpg","video":null,"publish_date":"2024-08-10 23:47:33","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.358},{"id":253845970,"title":"Jesse Ventura defends Tim Walz amid ‘despicable’ military service record attacks","text":"Former Minnesota Gov. Jesse Ventura defended the man occupying his former office who has come under scrutiny since being selected as Vice President Kamala Harris’s running mate. Gov. Tim Walz (D-MN) served 24 years in the Army National Guard before retiring in 2005 to focus on his House bid. Sen. J.D. Vance (R-OH), running against Walz for the vice presidency, has led the charge in attacking his opponent for avoiding a deployment that was announced shortly after his retirement. A former Navy SEAL, Ventura described those attacks as “shameful,” “despicable,” and “hogwash” Friday on CNN. “They talk about him missing his deployment, well maybe Mr. Vance should ask the real question: What is the National Guard doing deploying to a foreign country in a foreign war?” Ventura said, criticizing former President George W. Bush and former Vice President Dick Cheney for entering the Iraq War “based on lies.” “They needed more bodies,” Ventura said. “They couldn’t implement the draft, that would be political suicide. So what George Bush did was sign an executive order sending the National Guard into foreign deployment. The National Guard is not for foreign deployment. Their name says what they do: They guard our nation from within.” Ventura said he never deployed with any E-9s, the highest rank an enlisted official can achieve, who “are not going to walk the point” or “be involved in any combat whatsoever.” “I think Vance is doing a disservice to himself and a disservice to the United States Marine Corps,” Ventura said. “I know a lot of great Marines, and Marines show respect. And Vance is not showing respect.” Ventura, a former professional wrestler, further criticized Vance for having respect for Republican presidential nominee Donald Trump, whom he called the “biggest draft dodger from the Vietnam War.” “It’s despicable on [Vance’s] behalf for doing that, and I hope all veterans feel like I do about it,” Ventura said. “You don’t criticize another veteran and how they served, whether they’re a cook or whatever they do, they all have a job to do, and if you’re going to be successful, everybody has to do their job and pitch in.” Despite his independent affiliation and rumored spot on presidential candidate Robert F. Kennedy Jr.’s vice presidential short list, Ventura also endorsed the Harris-Walz ticket because “it’s time for a woman president — we men have screwed it up enough.” “I want to be alive to see the first woman president of the United States of America and the first woman commander in chief, and we’ve got her right now,” Ventura, 73, said. Ventura previously endorsed Walz’s 2022 gubernatorial reelection bid, specifically hailing his stance on abortion rights and his work to contain the COVID-19 pandemic in Minnesota.","summary":"Former Minnesota Gov. Jesse Ventura defended the man occupying his former office who has come under scrutiny since being selected as Vice President Kamala Harris’s running mate. Gov. Tim Walz (D-MN) served 24 years in the Army National Guard before retiring in 2005 to focus on his House bid. Sen. J.D. Vance (R-OH), running against [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3117681/jesse-ventura-defends-tim-walz/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Jesse-Ventura-Tim-Walz.webp","video":null,"publish_date":"2024-08-10 23:41:14","author":"Robert Stewart","authors":["Robert Stewart"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.328},{"id":253845304,"title":"Trump speaking during his only campaign rally of the week, in Bozeman, Montana","text":"Trump speaking during his only campaign rally of the week, in Bozeman, Montana | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Trump speaking during his only campaign rally of the week, in Bozeman, Montana Natalie BEHRING Tags Partners/afp As featured on Harris takes rally blitz to Arizona, Trump holds first in a week Kamala Harris took her rapid tour of battleground states to Arizona on Friday, where she hammered opponent Donald Trump on his favorite issue of immigration, as the Republican used his only rally of the week to boost a Senate candidate. Facebook Twitter WhatsApp SMS Email Print Save Students protest delayed start of school Aug 8, 2024 Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Swanson: 1 week delay in GDOE classes, schools to open Aug. 15 Woman accused of ramming gate, damaging property with truck Man faces felony charge after Tumon bar fight Man, 53, charged after disturbance reported at daycare center UPDATED: Board declares state of emergency for GDOE, some classes could be further delayed to Aug. 22 or 23 Local Events","summary":"Trump speaking during his only campaign rally of the week, in Bozeman, Montana","url":"https://www.guampdn.com/news/national/trump-speaking-during-his-only-campaign-rally-of-the-week-in-bozeman-montana/image_292ce058-4fa5-5d31-b835-e301de69943b.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/2/92/292ce058-4fa5-5d31-b835-e301de69943b/66b72192f064e.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-10 23:03:41","author":"Natalie BEHRING","authors":["Natalie BEHRING"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.117},{"id":253845298,"title":"","text":"National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Harris's campaign said over 15,000 people attended the rally in Arizona Robyn Beck Tags Partners/afp As featured on Harris takes rally blitz to Arizona, Trump holds first in a week Kamala Harris took her rapid tour of battleground states to Arizona on Friday, where she hammered opponent Donald Trump on his favorite issue of immigration, as the Republican used his only rally of the week to boost a Senate candidate. Facebook Twitter WhatsApp SMS Email Print Save Students protest delayed start of school Aug 8, 2024 Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Swanson: 1 week delay in GDOE classes, schools to open Aug. 15 Woman accused of ramming gate, damaging property with truck Man faces felony charge after Tumon bar fight Man, 53, charged after disturbance reported at daycare center UPDATED: Board declares state of emergency for GDOE, some classes could be further delayed to Aug. 22 or 23 Local Events","summary":"Harris's campaign said over 15,000 people attended the rally in Arizona","url":"https://www.guampdn.com/news/national/image_88323e16-4c75-5bec-8858-92054db0de1d.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/8/83/88323e16-4c75-5bec-8858-92054db0de1d/66b6e99b76a14.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-10 23:03:40","author":"Robyn Beck","authors":["Robyn Beck"],"language":"en","source_country":"GU","sentiment":-0.142},{"id":253845306,"title":"","text":"National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save US Vice President and 2024 Democratic presidential candidate Kamala Harris waves on stage during a campaign event at Desert Diamond Arena in Glendale, Arizona, on August 9, 2024. Robyn Beck Tags Partners/afp As featured on Harris takes rally blitz to Arizona, Trump holds first in a week Kamala Harris took her rapid tour of battleground states to Arizona on Friday, where she hammered opponent Donald Trump on his favorite issue of immigration, as the Republican used his only rally of the week to boost a Senate candidate. Facebook Twitter WhatsApp SMS Email Print Save Students protest delayed start of school Aug 8, 2024 Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Swanson: 1 week delay in GDOE classes, schools to open Aug. 15 Woman accused of ramming gate, damaging property with truck Man faces felony charge after Tumon bar fight Man, 53, charged after disturbance reported at daycare center UPDATED: Board declares state of emergency for GDOE, some classes could be further delayed to Aug. 22 or 23 Local Events","summary":"US Vice President and 2024 Democratic presidential candidate Kamala Harris waves on stage during a campaign event at Desert Diamond Arena in Glendale, Arizona, on August 9, 2024.","url":"https://www.guampdn.com/news/national/image_90791bf4-d1e7-59c2-826a-df3ed92b727d.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/9/07/90791bf4-d1e7-59c2-826a-df3ed92b727d/66b6e99b4a364.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-10 23:03:39","author":"Robyn Beck","authors":["Robyn Beck"],"language":"en","source_country":"GU","sentiment":-0.081},{"id":253844550,"title":"Senate voting records reveal Harris less likely to reach across aisle than Vance","text":"Either Vice President Kamala Harris or Sen. J.D. Vance (R-OH) will be elevated to the highest-held position of their careers at the conclusion of the 2024 election season. Their voting records in the Senate provide telling insights into their ideological leanings and agendas. Harris, who represented California in the Senate from 2017 to 2021, has faced criticism from former President Donald Trump and others for being “the most liberal” member of the Senate. Vance, on the other hand, has only been on the job since 2023, but his limited record shows he has been more willing to vote across party lines than Harris was. In 2019, nonpartisan congressional tracker YouGov rated Harris the most liberal senator. She was also the sixth-least likely senator to vote across party lines in 2019, according to The Lugar Center’s McCourt School Bipartisan Index, and the 11th-least likely in 2017. Vance, by comparison, was the 22nd-least likely in 2023. On The Lugar Center’s index, a lower score indicates a lower willingness to vote across party lines. Harris scored -0.92670 in 2019 and -1.19719 in 2017. While Vance did not score high on the ranking, his -0.79354 score from 2023 indicates that he is more willing to cross party lines to pass legislation. Is Vance as conservative as Harris is liberal? Aside from YouGov’s now-deleted 2019 report card which rated Harris as the most liberal senator, the tracker graded her the second-most liberal senator on its 2020 report card and the fourth-most liberal on the 2018 edition. YouGov does not have data on Vance yet. Voteview, based out of the University of California, Los Angeles, also grades senators based on how ideologically extreme they are. Harris was the second-most liberal senator behind Sen. Elizabeth Warren (D-MA) in Voteview’s ratings in both 2017 and 2019. Vance was ranked the fifth-most conservative member in 2023, while Warren and Harris were ranked the most liberal by a notable margin in 2017 and 2019. Sens. Eric Schmitt (R-MO), Tommy Tuberville (R-AL), Rand Paul (R-KY), and Mike Lee (R-UT) all came in as more conservative than Vance. Harris received critical ratings from conservative grading organizations based on her Senate voting record, including a 0% score from Campaign for Working Families, another 0% from Heritage Action for America, a 9% from American Conservative Union, 10% from Eagle Forum, and 20% from Conservative Review. Left-leaning graders were far more favorable to Harris, including Americans for Democratic Action, which gave her a 90% rating, and Progressive Punch, which graded her at 86%. Vance received a 6% score from liberal Progressive Punch but was graded at 93% by right-leaning Heritage Action for America and 100% by Eagle Forum. Reaching across the aisle Both Harris and Vance have voted alongside members of the opposite party to pass legislation, although their scores on The Lugar Center’s McCourt School Bipartisan Index suggest that Vance is more willing to reach across the aisle. Vance, for example, worked with Sens. Sherrod Brown (D-OH), Bob Casey (D-PA), and John Fetterman (D-PA) to introduce the Railway Safety Act in 2023 after the East Palestine, Ohio, train derailment. Harris voted in favor of the 2018 First Step Act introduced by former Republican Rep. Doug Collins and signed by Trump. No Democratic senators voted against the bill, however, 12 Republicans did. There have also been numerous bills, motions, and nominations that passed with bipartisan support and little-to-no opposition that the pair voted with members of the opposite party to pass. What can Harris and Vance do with elevated power? Despite no longer serving as a senator, Harris has cast 33 votes in the Senate since becoming vice president, who casts the tiebreaking vote when there is gridlock in the upper chamber of Congress. That role will belong to Vance if Trump wins in November. There is no guarantee Vance would even have to cast a single vote if elected, as 12 vice presidents, including President Joe Biden, did not get a chance to break a Senate tie. Harris’s 33 votes rank as the most of any vice president, and she has done so in far less time than any of her predecessors who have come close. Democrats have a 51-49 Senate majority, so the only time Harris has to vote is when they cannot get a unanimous vote within the party. There are 33 seats up for election in 2024, 10 held by Republicans and 23 held by Democrats. If one party ends up with a multi-seat majority, the next vice president may not cast many votes. According to Cook Political Report, each GOP seat up for grabs is in a state that leans Republican. Four Democratic-held seats are rated as toss-ups and one is rated as being “Solid Republican.” The Hill’s 2024 election forecast gives the GOP a 78% chance to take control of the Senate, predicting a 51-47 majority with two independents caucusing with Democrats. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER If Harris wins in November, she would have the power to sign or veto bills that make it through Congress. She would also be able to issue executive orders to execute certain policies without being voted on by Congress. The Washington Examiner reached out to Harris and Vance for comment.","summary":"Either Vice President Kamala Harris or Sen. J.D. Vance (R-OH) will be elevated to the highest-held position of their careers at the conclusion of the 2024 election season. Their voting records in the Senate provide telling insights into their ideological leanings and agendas. Harris, who represented California in the Senate from 2017 to 2021, has [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3117671/harris-less-likely-reach-across-aisle/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/jd-vance-kamala-harris.webp","video":null,"publish_date":"2024-08-10 22:53:40","author":"Peter Cordi","authors":["Peter Cordi"],"language":"en","source_country":"US","sentiment":0.032},{"id":253844576,"title":"Harris campaign clarifies Walz’s statement about carrying ‘weapons of war’ in 2018","text":"PHOENIX – Minnesota Gov. Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday. Republicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday. Some of the criticism centers on comments by Walz in a 2018 video circulated on social media by the Harris campaign in which he speaks out against gun violence and says, “We can make sure that those weapons of war, that I carried in war, is the only place where those weapons are at.” The comment suggests that Walz portrayed himself as someone who spent time in a combat zone. Walz served 24 years in various Army National Guard units but he was never in a combat zone. Lauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video. “Governor Walz would never insult or undermine any American’s service to this country — in fact, he thanks Senator Vance for putting his life on the line for our country. It’s the American way,” Hitt said. “In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added. “He did handle weapons of war and believes strongly that only military members trained to carry those deadly weapons should have access to them, unlike Donald Trump and JD Vance who prioritize the gun lobby over our children.” Vance enlisted in the Marine Corps after graduating high school, serving four years as a combat correspondent, similar to a military journalist, and deploying to Iraq in that capacity in 2005.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPHOENIX – Minnesota Gov. Tim Walz, the Democratic candidate for vice president,&#8230;\n\n\nThis Post: Harris campaign clarifies Walz&#8217;s statement about carrying &#8216;weapons of war&#8217; in 2018 first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/harris-campaign-clarifies-walzs-statement-about-carrying-weapons-of-war-in-2018/","image":"https://www.clickorlando.com/resizer/btrqRapTAi_3j48FylymG3vsixY=/cloudfront-us-east-1.images.arcpublishing.com/gmg/TKRYFGIGRJHETPCOJ5RWSVURGA.jpg","video":null,"publish_date":"2024-08-10 22:50:51","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.05},{"id":253845310,"title":"Israeli strike on Gaza school used as shelter kills at least 80, Palestinian officials say","text":"An Israeli airstrike hit a school-turned-shelter in Gaza early Saturday, killing at least 80 people and wounding nearly 50 others, Palestinian health authorities said, in one of the deadliest attacks of the 10-month Israel-Hamas war. A witness said it struck during prayers at a mosque in the building. It was the latest of what the U.N. human rights office called “systematic attacks on schools” by Israel, with at least 21 since July 4 leaving hundreds dead, including women and children. “For many, schools are the last resort to find some shelter,” it said after Saturday’s attack. The Israeli military acknowledged it targeted the Tabeen school in central Gaza City, saying it hit a Hamas command center in a mosque in its compound and killed 19 Hamas and Islamic Jihad fighters. Izzat al-Rishq, a top Hamas official, denied there were militants in the school. Israel’s military also disputed the toll, saying the “precise munitions” used “cannot cause the amount of damage that is being reported” by the Hamas-run government. It said the steps it took to limit the risk to civilians included the use of a “small warhead,” aerial surveillance and intelligence information. Walls were blown out on the ground level of the large building. Concrete chunks and twisted metal lay on the floor. Bodies, some in shrouds, were placed shoulder to shoulder in makeshift graves, making room for more. Fadel Naeem, director of the al-Ahli hospital in Gaza City, told The Associated Press that it received 70 bodies along with the remains of at least 10 others. Gaza’s Health Ministry said that another 47 people were wounded. “We received some of the most serious injuries we encountered during the war,” he said, with many wounded having limbs amputated and some with severe burns. The strike hit without warning before sunrise as people prayed, according to witness Abu Anas. “There were people praying, there were people washing and there were people upstairs sleeping, including children, women, and old people,” he said, prayer beads in hand. “The missile fell on them without warning. The first missile, and the second.” Three missiles ripped through the two-story building – the first floor housed the mosque, and the second level had a school – where about 6,000 displaced people were taking shelter, said Mahmoud Bassal, a spokesperson for the Civil Defense first responders, who operate under the Hamas-run government. Many of the casualties were women and children, he said. A camera operator working for the Associated Press said a missile appeared to have penetrated the floor of the classrooms to the mosque below and exploded. The U.N. previously said that as of July 6, 477 out of 564 schools in Gaza had been directly hit or damaged in the war, adding that Israel has a duty under international law to provide safe shelter for the displaced. “There’s no justification for these massacres,” European Union foreign policy chief Josep Borrell said in a statement posted on X, referring to strikes on schools. U.K. Foreign Minister David Lammy said that he was “appalled.” France’s foreign ministry called the recent number of civilian victims in Israeli strikes on schools “intolerable.” The U.S. said it was deeply concerned about reports of civilians killed. “Far too many civilians continue to be killed and wounded,” U.S. National Security Council spokesperson Sean Savett said in a statement. Israel has blamed civilian deaths in Gaza on Hamas, saying the group endangers people by using schools and residential neighborhoods as bases for operations. The U.N. human rights office acknowledged that colocating combatants with civilians is a violation of international humanitarian law, but that Israel must also comply with the law’s principles of precaution and proportionality. The strike came as U.S., Qatari, and Egyptian mediators renewed their push for Israel and Hamas to achieve a cease-fire agreement that could help calm soaring tensions in the region following the assassination of Hamas political leader Ismail Haniyeh in Tehran and a senior Hezbollah commander in Beirut. Egypt, which borders Gaza, said that the strike on the school showed that Israel had no intention of reaching a cease-fire deal. Neighboring Jordan condemned the attack as a “blatant violation” of international law. Qatar demanded an international investigation, calling it a “heinous crime” against civilians. Vice President Kamala Harris, speaking to reporters traveling with her in Phoenix, Arizona, on Saturday, said of the Israeli strike in Gaza: “Yet again, far too many civilians have been killed.” “Israel has a right to go after the terrorists that are Hamas,” she said. “But as I have said many, many times they also have, I believe, an important responsibility to avoid civilian casualties.” Pressed on the fact that such comments have done little to lower the numbers of civilians in Gaza killed in recent months, Vice President Harris said, “First and foremost – and the president and I have been working on this around the clock – we need to get the hostages out.” “We need a hostage deal and we need a cease-fire,” she said. “And I can’t stress that strongly enough. It needs get to done. The deal needs to get done and it needs to get done now.” Late on Friday, two separate airstrikes in central Gaza killed at least 13 people, including three children and seven women, hospital authorities said. An Associated Press journalist counted the bodies at the al-Aqsa Martyrs hospital in the central city of Deir al-Balah. One strike hit a house in the Nuseirat refugee camp, killing seven people, all but one of them women, hospital officials said. Another hit a house in Deir al-Balah, killing six, including a woman and her three children, the hospital said. Israel’s campaign in Gaza has killed more than 39,790 Palestinians and wounded more than 92,000 others, according to the Health Ministry, which doesn’t distinguish between combatants and civilians in its tally. The war was triggered by Hamas’ Oct. 7 attack in which militants from Gaza stormed into southern Israel, killing around 1,200 people and abducting 250 others. Families of hostages demonstrated again Saturday night in Tel Aviv seeking a cease-fire deal to bring loved ones home. More than 1.9 million of Gaza’s prewar population of 2.3 million have been driven from their homes, fleeing repeatedly across the territory to escape offensives. Most are crowded into tent camps in an area of about 50 square kilometers (19 square miles) on the Gaza coast with few basic services or supplies. In the occupied West Bank, dozens of people gathered in Ramallah to protest the latest Israeli strike on a school. “The message that must be sent to the world, a numb world, a world that is not moving, is ‘How long will the war continue?’” asked one, Muin Barghouti. Samy Magdy reported from Cairo, and Will Weissert contributed from Washington. This story was reported by The Associated Press.","summary":"The strike came as U.S., Qatari, and Egyptian mediators renewed their push for Israel and Hamas to achieve a cease-fire agreement. The Israeli military says it hit a Hamas command center inside the compound. A top Hamas official denied there were militants in the school.","url":"https://www.csmonitor.com/World/Middle-East/2024/0810/Israeli-strike-on-Gaza-school-used-as-shelter-kills-at-least-80-Palestinian-officials-say?icid=rss","image":"https://images.csmonitor.com/csm/2024/08/0810%20GAZA%20SCHOOL.jpg?alias=standard_900x600","video":null,"publish_date":"2024-08-10 22:44:33","author":"Wafaa Shurafa and Samy Magdy","authors":["Wafaa Shurafa and Samy Magdy"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.299},{"id":253844580,"title":"– “Insights from Mayor Karen Bass: Paris Olympics, LA 2028, Kamala Harris, and Boosting Hollywood Production with Tax Credits”","text":"EXCLUSIVE: Karen Bass is about to make some history, again. The first woman elected Mayor of Los Angeles, the former Congresswoman is in Paris for Sunday’s Olympics Closing Ceremony and the handover to the City of Angels for the Games of the XXXIV Olympiad. In that handover from Paris Mayor Anne Hidalgo, Mayor Bass will be the first Black woman mayor to receive the Olympic flag in what will be the first female mayor to female mayor transfer. “I hope that it sends a message to girls in general around the world, but especially Black girls in the United States,” declares the first term mayor from the streets of the City of Light ahead of tomorrow’s closing ceremony in the 80,000-capacty Stade de France. Of course, in this year of a distinctly unpredictable election in the United States, a smart retail politician like Bass is in Paris to suss out what can be learned from the past two weeks of competition and culture for the next summer Olympics here in Los Angeles. In that context, the Mayor chatted with me about Paris 2024 and the closing ceremony, plus LA 2028. Mayor Bass also spoke about her efforts to help jump start the film and TV industry in Los Angeles after a hard past few years that have seen a pandemic, strikes, cuts galore and more belt tightening by the studios and streamers. And then there’s that matter of a certain history making Vice President and a certain convicted felon. DEADLINE: In taking the Olympic flag from Mayor Hidalgo in Sunday’s closing ceremony,, you will be the first black woman mayor ever to receive the flag. What does that mean to you as both the mayor of LA and as an individual? MAYOR KAREN BASS: Well, first of all, it is an incredible source. of pride. I am very excited about it and humbled by it. I hope that it sends a message to girls in general around the world, but especially Black girls in the United States. I mean, we’re on the verge of a Black female president. So, I think it’s just an exciting time. I’m always interested in young people feeling as though that they can do anything. But if I can make a small contribution to a young person feeling that way, then I will be very satisfied. DEADLINE: On the topic of the closing ceremony, there are a lot of rumors about what we are going to see from LA near the end. We reported on Tom Cruise swooping down. There’s talk of the likes of Billie Eilish, Snoop Dogg and others performing, and a big Hollywood production from LA 2028. Besides your own flag handover role, what else are we going to see? MAYOR BASS: (laughs) Very seriously, I don’t know. DEADLINE: C’mon … MAYOR BASS: I’m serious, I don’t know. DEADLINE: Okay, we’ll take your word for that, but staying on LA 2028 and the end of Paris 2024, looking at what we’ve seen over the past two weeks, what are the pros and cons for you looking forward four years from now? MAYOR BASS: Well, I think what we could learn from them pro is how to have a wonderful event that involves everybody, how to have a guarantee set aside for small businesses. And then I think on the con, I don’t know what is the con you know. DEADLINE: Really? MAYOR BASS: Perhaps how they did their opening ceremony. I think we would focus more on the athletes. I don’t think it’s a con or a criticism, just something we would choose to do. DEADLINE: The 2028 Olympics will occur halfway what through would be your second term, which means you will not only have a great deal of influence on the Games, but will be literally the host and the one handing over the flag to the Mayor of Brisbane . How will you use that influence? MAYOR BASS: I view it as a target date in which we need to address a number of challenges in our city. And I will tell you that I want to see the game take place and benefit the entire city. So, one of the things I’ve loved about being here is that even in neighborhoods where the games are not actually being played, there’s complete participation still with cultural events and fan festivals.. DEADLINE: How so? MAYOR BASS: I was in front of City Hall earlier this week and there were thousands of people out there watching one of the games on a big screen, I would like to see that same type of thing happen for or games. I want all of Los Angeles cooking, electric and involved. DEADLINE: Inside and outside the venues then? MAYOR BASS: Yes, because we’re so fortunate in LA to have so many venues. So, the Griffith Observatory could be one place for people. You know one of the things in terms of communities, I want to see us use the Greek Theatre, I want to see us use the Hollywood Bowl. We have the BMO Stadium. We have Exposition Park. Oh, my goodness, we are so fortunate. DEADLINE: I get those locations but I wonder what you feel about the sometimes overlooked parts of our city – South LA and some of the satellite cities that don’t get recognized as much or over in amazing Boyle Heights and East LA. We have the Watts Tower, a national landmark, that I know many people in LA have never seen in person. How do we bring those parts of the city in to play, so to speak, for 2028 to show the full, rich picture of LA? MAYOR BASS: Well, we are definitely going to do that because we’re going to have folks all over the place. So, the Watts Tower, absolutely, By then we will also have the open spaces of Destination Crenshaw We have the incredible murals of East L.A. and at the San Fernando Valley. I want to make sure that all of those neighborhoods are represented including our various ethnic neighborhoods like Little Ethiopia and Koreatown. Little Armenia, Little Bangladesh. DEADLINE: Madame Mayor, that all sounds both ambitious and great, but one of the biggest challenges LA faces now and heading towards 2028 is homelessness, both for the unhoused themselves and the tension have so many people on the streets has created in the city … MAYOR BASS: Yes.. DEADLINE: Governor Newsom recently signed a new order based on the Supreme Court’s ruling about homelessness and encampments. LA has made it pretty clear that they’re not going to take what some have called draconian measures, but I know that dealing with this crisis has been a major part of your administration. Talking to people, I hear a lot: “Oh, God, we can’t have an Olympics. There’s all these people on the street.” What would you say to those people? MAYOR BASS: First of all, Dominic you know I’m around for this, because that has been my focus, my passion, my concern, and I’ve worked on this night and day since even before I took office. So, for the first time in many years, we’ve actually had a decline in street homelessness. Where I agree with the governor and have worked in very close partnership with him, is we have been clearing out encampments, we’re going to continue to do that. The difference is that for us that is clearing out an encampment for us is defined by getting people housed. What I don’t think works is just telling people to move along. DEADLINE: On another local issue, you recently made moves to boost production here in the home of Hollywood, and put together an Entertainment Industry Cabinet, with the likes of MPA boss Charlie Rivkin, NBCU VP Yvette Estrada, ex-Film Czar Ken Ziffren, Netflix’s Amy Lemisch, and Jason Reitman in it. MAYOR BASS: Yes.. DEADLINE: When you and I spoke at the Shirley premiere on March 19 you mentioned to me about you were trying to see if the governor would even enlarge the state’s $300 million annual film and TV tax credits. So, coming out of the pandemic coming out of last year’s strikes, what do you think needs to be done that can really help to get the industry back on its feet, get production back to where it used to be and get people back to work? MAYOR BASS: First of all, on my end, as mayor, we can make filming much easier. We can make the development of soundstages much easier. We can expedite things. Then down the line when the economy is better I want us to consider A local tax credit. DEADLINE: For real? MAYOR BASS: Yes, and in Sacramento, and I do understand with the deficit this is not the year for it, but we have got to expand our tax credit. All these other states once again, are beating us and tits slowing our local industry. DEADLINE: And, let’s be honest, the city has become too damn expensive for many. We see that with the working homeless. We see that with people who have seen the bank accounts decimated by a lack of work, and leaving for greener pastures … MAYOR BASS: Absolutely, I agree. LA has become unaffordable. This is a problem for everyone. We want people to be able to live in LA, to work in the entertainment industry and to have a very fruitful life. DEADLINE: On the subject of a fruitful life in LA, it’s not a secret that a lot of people have said they want to leave America if Donald Trump is back in the White House. You mentioned Vice President Kamala Harris’ historic bid for the White House at the top of this conversation, so from your perspective over in France right now, what is the feeling over there about the presidential election? MAYOR BASS: Dominic, let me just say that the world is depending on us to get this election right. Also, I really want to see at the convention an incredible celebration of President Biden. He is going to have a legacy as President of accomplishments of monumental importance, like infrastructure, President Joe Biden came in and got it done. And I can’t wait next January to be at the inauguration of the first woman, first black Asian woman as our next president. And by the way, let me just say a word about our incoming vice president, Tim Walz. I served with him in Congress for eight years. I think the Vice President made a wonderful selection. I can only imagine the chemistry between the two, but his history of service then leaving the house and becoming such a great governor of Minnesota, I think this is a real winning ticket. DEADLINE: Gold medal winning? MAYOR BASS: (laughs) Of course.","summary":"Internewscast Journal\n\nInternewscast\n\n\nEXCLUSIVE: Karen Bass is about to make some history, again. The first&#8230;\n\n\nThis Post: &#8211; &#8220;Insights from Mayor Karen Bass: Paris Olympics, LA 2028, Kamala Harris, and Boosting Hollywood Production with Tax Credits&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/insights-from-mayor-karen-bass-paris-olympics-la-2028-kamala-harris-and-boosting-hollywood-production-with-tax-credits/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Mayor-Karen-Bass-On-Paris-Olympics-Closing.jpg","video":null,"publish_date":"2024-08-10 22:40:15","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.277},{"id":253844362,"title":"This Week in Texas: Replacing Sheila Jackson Lee on ballot, VP picks, and protesting protestors","text":"This week, the temperatures reached triple digits in southeast Texas, and the political season is reaching a fever pitch. In an all new-episode of This Week in Texas, ABC13 talks with several of the candidates seeking the nomination to replace the late Congresswoman Sheila Jackson Lee on the ballot. At least 17 people have thrown their name into the hat ahead of the vote on Aug. 13. ABC13's panel of political insiders weighs in on the process and the possible pick. \"For you to even be considered, you have to be nominated,\" Democrat political strategist Odus Evbagharu said. Then, ABC13 discusses the possibility of a restriction on where demonstrators can protest within the city of Houston. \"I proposed the idea,\" Houston mayor John Whitmire said. \"I take full ownership.\" And ABC13 talks about the plusses and minuses of the vice president choices for Donald Trump and Kamala Harris. \"The month of July has been a cataclysmic shift,\" Republican political strategist Court Koenning said. It's a red-hot edition of This Week in Texas. Stay on the pulse of Texas politics! Follow Tom Abrahams on Facebook, Twitter and Instagram.","summary":"In the latest This Week in Texas, the temperatures reached triple digits in southeast Texas and the political season is reaching a fever pitch.","url":"https://abc13.com/post/week-texas-replacing-sheila-jackson-lee-ballot-vp-choices-trump-harris-protesting-protestors/15170089/","image":"https://cdn.abcotvs.com/dip/images/15170327_081024-ktrk-this-week-in-texas-full-episode-TAB-justin-vid.jpg?w=1600","video":"https://vcl.abcotv.net/video/ktrk/081024-ktrk-this-week-in-texas-full-episode-TAB-justin-vid.mp4","publish_date":"2024-08-10 22:38:49","author":"Tom Abrahams","authors":["Tom Abrahams"],"language":"en","source_country":"us","sentiment":-0.091},{"id":253845710,"title":"Donald Trump's campaign says its emails were hacked","text":"CTVNews.ca Top Stories BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Man linked to four murders in Kirkland Lake, Ont., is dead, police say Ontario Provincial Police say Martyn Rosko, the main suspect in four homicides in Kirkland Lake, is dead. Want to move out of Canada? Experts explain everything you need to know If you're planning to leave Canada, there's a laundry list of things that need to be checked off. Experts explain all the steps you need to take before making the move. Colombian President Petro calls on Venezuela's Maduro to release detailed vote counts from election Colombian President Gustavo Petro on Wednesday called on his close ally, Venezuelan President Nicolas Maduro, to release detailed vote counts of the weekend election in which electoral authorities declared Maduro the winner. Starbucks sales tumble as customers reject high-priced coffee Fewer people are going to Starbucks and buying drinks and food, as last quarter was Starbucks' second straight with a sales decline. Vermont man evacuates neighbours during flooding, weeks after witnessing a driver get swept away Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains. Families seek answers after inmates' bodies returned without internal organs Six families whose loved ones died in Alabama prisons have filed lawsuits against the commissioner of the state's department of corrections, saying their family members' bodies were returned to them missing internal organs after undergoing state-ordered autopsies. Economy grew 0.2% in May, StatCan estimates 2.2% annualized growth in Q2 The Canadian economy continued to keep its head just above water in May, growing 0.2 per cent, led by expansions in manufacturing and the public sector. 'Severely hypothermic' sailor rescued after spending hours adrift off B.C. coast A sailboat captain was found alive but suffering from a severe case of hypothermia on Monday after spending up to five hours adrift in the ocean off British Columbia, according to the coast guard. Canada Murder-conspiracy trial tied to Coutts, Alta., COVID-19 blockade set to go to jury A jury is set to begin deliberating today the fate of two men accused of conspiring to kill police at the Coutts, Alta., blockade in 2022. Edmonton man sentenced to 5 years in prison in terrorism case in United Kingdom An Edmonton man has been sentenced to five years in prison after being convicted in the United Kingdom of being a member of a proscribed terrorist group. Man linked to four murders in Kirkland Lake, Ont., is dead, police say Ontario Provincial Police say Martyn Rosko, the main suspect in four homicides in Kirkland Lake, is dead. Convicted B.C. killer loses bid to have guitar in his prison cell A Federal Court judge has thrown out a convicted killer's challenge of a British Columbia prison warden's decision not to allow the inmate to have an electric guitar in his cell. Canadian civil liberties group fighting 'abuse' of notwithstanding clause in Sask. pronoun law The Canadian Civil Liberties Association (CCLA) says it’s intervening in a legal dispute over Saskatchewan’s controversial pronoun laws to prevent the “abuse” of the notwithstanding clause. Want to move out of Canada? Experts explain everything you need to know If you're planning to leave Canada, there's a laundry list of things that need to be checked off. Experts explain all the steps you need to take before making the move. World Two strikes on militant leaders risk inflaming a Middle East on edge The targeting of two senior militant leaders in two Middle Eastern capitals within hours of each other — with each strike blamed on Israel — risks rocking the region at a critical moment. Colombian President Petro calls on Venezuela's Maduro to release detailed vote counts from election Colombian President Gustavo Petro on Wednesday called on his close ally, Venezuelan President Nicolas Maduro, to release detailed vote counts of the weekend election in which electoral authorities declared Maduro the winner. About 8 in 10 Democrats are satisfied with Harris in stark shift after Biden drops out: AP-NORC poll U.S. Vice President Kamala Harris appears to have energized Democrats in the early days of her candidacy, with the surge in warm feelings extending across multiple groups, including some key Democratic constituencies that had been especially tepid about U.S. President Joe Biden, a new poll shows. U.K. leader accuses far right of hijacking a town's grief after killing of 3 children sparks violence Residents swept up broken bricks, shattered glass and burnt plastic on Wednesday after far-right protesters clashed with police outside a mosque in a northwest England town where three girls were fatally stabbed. Vermont man evacuates neighbours during flooding, weeks after witnessing a driver get swept away Weeks after Jason Pilbin witnessed a driver get swept away by floodwaters, his northeastern Vermont community was ravaged again by flooding from heavy rains. UN report says Palestinians detained by Israeli authorities since Oct. 7 faced torture, mistreatment The UN human rights office issued a report Wednesday saying Palestinians detained by Israeli authorities since the Oct. 7 attacks faced waterboarding, sleep deprivation, electric shocks, the release of dogs, and other forms of torture and mistreatment. Politics 'Sellout Singh': Conservatives take aim at NDP in new attack ad ahead of byelections The federal Conservatives are shifting their focus from the governing Liberals to take aim at the NDP in a new attack ad. Intelligence task force to monitor all future byelections for foreign interference The Liberal government says measures to monitor and assess foreign interference threats will be part of all future federal byelections, not just general elections. Conservative MP Karen Vecchio not seeking re-election, will finish out term Ontario Conservative MP Karen Vecchio says she will not be seeking re-election. Health 'Incredibly disappointing': Ontario halts wastewater testing for COVID, other viruses Ontario is officially ending its COVID-19 wastewater surveillance program today in a move some public health experts call shortsighted. Common mental health disorder may triple risk for developing dementia, study finds As if people with anxiety don’t have enough to worry about, a new study is adding to that list — suggesting the disorder may nearly triple the risk of developing dementia years later. More Listeria infections reported amid outbreak linked to plant-based milk recall The Public Health Agency of Canada is reporting six additional cases of listeriosis linked to a national recall of plant-based milk beverages. Sci-Tech Microsoft appears to have resolved Azure network problems Microsoft appears to have resolved the issues with its Azure network infrastructure that impacted users around the world on Tuesday. Meta agrees to US$1.4B settlement with Texas in privacy lawsuit over facial recognition Meta has agreed to a US$1.4 billion settlement with Texas in a privacy lawsuit over allegations that the tech giant used biometric data of users without their permission, officials said Tuesday. Animals, like those in Jasper, know how to dodge wildfires, say biologists Parks Canada wants everyone to know that despite the wildfire scorching Jasper National Park, Bear 222 is OK. Entertainment Washington, D.C., sues StubHub, saying the resale platform inflates ticket prices with deceptive fees The attorney general for Washington, D.C., sued StubHub on Wednesday, accusing the ticket resale platform of advertising deceptively low prices and then ramping up prices with extra fees. R. Kelly petitions U.S. Supreme Court to overturn sex crimes convictions based on statute of limitations R. Kelly – who is currently serving a more than a 30-year prison sentence in North Carolina – is asking the U.S. Supreme Court to hear an appeal of his federal sex crimes convictions. Ojibwe language version of Star Wars to hit Winnipeg theatres Star Wars: A New Hope is rocketing back into theatres – in a completely new way. Business Boeing names new CEO as it posts a loss of more than US$1.4 billion in second quarter Boeing lost more than US$1.4 billion in the second quarter and said a longtime industry executive will take over as chief executive of the troubled aircraft manufacturer next week. Jasper's fire-affected small businesses face rocky road ahead After labouring for months to bring one of Jasper's newest business concepts to life, the owners of The Peacock Cork & Fork never dreamed the young restaurant's run would be so short-lived. Economy grew 0.2% in May, StatCan estimates 2.2% annualized growth in Q2 The Canadian economy continued to keep its head just above water in May, growing 0.2 per cent, led by expansions in manufacturing and the public sector. Lifestyle 9 tips from decor experts for a comfortable and functional dorm room How do you turn one room into a work, sleep and hangout space? Manitoba golfers set unofficial record of 333 holes of golf in 12 hours, all for a good cause One golf course, two men, 12 hours and 333 holes of golf played. That's how the 13th annual Marathon Monday shaped up for Patrick Law and Dylan Thornborough, which ended up being an unofficial world record. An Italian Olympic athlete lost his wedding ring at the opening ceremony. Here's his heartfelt apology to his wife An Italian athlete made a public and heartfelt apology to his wife after losing his wedding ring at the Paris Olympics opening ceremony. Sports BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Canada's Caeli McKay and Kate Miller 4th in women's synchronized diving Canadian divers Caeli McKay and Kate Miller have finished in fourth in women's 10-metre synchronized platform at the Paris Olympics. Manitoba golfers set unofficial record of 333 holes of golf in 12 hours, all for a good cause One golf course, two men, 12 hours and 333 holes of golf played. That's how the 13th annual Marathon Monday shaped up for Patrick Law and Dylan Thornborough, which ended up being an unofficial world record. Autos Toyota acknowledges more certification cheating and apologizes Toyota reported Wednesday more cases of cheating on certification tests for new models required by the Japanese government, on top of those acknowledged earlier. Tesla in Seattle-area crash that killed motorcyclist was using self-driving system, authorities say Authorities in Washington have determined that a Tesla that hit and killed a motorcyclist near Seattle in April was operating on the company's 'Full Self Driving' system at the time of the crash. How a weather event in the U.S. can hurt western Canada's drivers at the pumps Drivers in Saskatoon have been hit with unwelcome news as gas prices soared to $1.68 per litre this week. The increase is not limited to Saskatoon; drivers throughout western Canada have experienced similar hikes. Local Spotlight Manitoba golfers set unofficial record of 333 holes of golf in 12 hours, all for a good cause One golf course, two men, 12 hours and 333 holes of golf played. That's how the 13th annual Marathon Monday shaped up for Patrick Law and Dylan Thornborough, which ended up being an unofficial world record. Montreal-area woman shocked to find family rented her pool without her consent A woman who lives east of Montreal in Repentigny came home to a pool party on Sunday after a family of five had rented it on the Swimply app without the consent of the homeowner. CFL fan breaks world record for visiting all 9 stadiums in fastest time A CFL fan has unofficially broken the world record for watching CFL home games at all nine of Canada’s stadiums in the shortest amount of time. 'I've done it': Anne Murray reminisces about successful career as her hometown centre marks 35 years The Anne Murray Centre in Springhill, N.S., marked its 35th anniversary over the weekend drawing dozens to the event from around the globe. Montreal hair salon caters to women with face or head coverings Imani Nadir says she looked high and low for a hairdresser when she moved to Montreal in 2022. Finally, after six months of making calls and sending emails, the 20-year-old came across Two Horses, a Montreal hair salon offering specialized services to women who wear face or head coverings. 'She led it the whole way': 18-year-old B.C. woman leads hikers to safety in Jasper National Park As fire threatened people in Jasper National Park, Colleen Knull sprung into action. 'There's mom and dad's house': New video appears to show destruction of Jasper neighbourhood Video posted to social media on Thursday morning appears to show the charred remains of a Jasper, Alta., neighbourhood. Sask. Second World War veteran, 103, receives France's highest national order A Saskatchewan-born veteran of the Second World War was recently presented with France's highest national order. Former First Nations chief voices Disney's first Ojibwe language Star Wars movie A local First Nations elder and veteran is helping to bring the Ojibwe language to a well-known film for the first time. Vancouver 'I absolutely felt threatened': Former VPD exec speaks out alleging workplace toxicity and complicity She spent nearly 20 years working for the Vancouver Police Department, and now the woman at the centre of a lawsuit is speaking publicly about the threatening environment she claims to have experienced, and the alleged inaction of management. West Vancouver mayor on deadline to enact new housing bylaws: 'The gun is to our head' Last Thursday, Housing Minister Ravi Kahlon gave West Vancouver's mayor and council 30 days to change the city's bylaws to comply with new provincial regulations allowing for the construction of multiple units on all single family lots. New poll shows BC Conservatives closing gap with NDP as BC United loses another MLA A poll released Tuesday shows the gap narrowing between the BC NDP and the BC Conservatives with the latter party trailing by just three points months before the provincial election. Toronto 'Incredibly disappointing': Ontario halts wastewater testing for COVID, other viruses Ontario is officially ending its COVID-19 wastewater surveillance program today in a move some public health experts call shortsighted. 'Do not approach him:' Police say Hamilton man facing 11-year prison sentence is at-large Hamilton police are appealing for information about the whereabouts of a 24-year-old man who is facing an 11-year prison sentence in connection with a fatal hit-and-run back in 2021. 2 youths charged after several people hit with gel bullets in Vaughan Two youths have been charged after several people were struck by gel bullets in Vaughan, prompting a police warning on the dangers of replica firearms. Calgary Alberta Day of Caring: Recycle empty bottles and cans to help Jasper wildfire evacuees It's the Alberta Day of Caring, a province-wide event to support Jasper wildfire evacuees. Murder-conspiracy trial tied to Coutts, Alta., COVID-19 blockade set to go to jury A jury is set to begin deliberating today the fate of two men accused of conspiring to kill police at the Coutts, Alta., blockade in 2022. Jasper's fire-affected small businesses face rocky road ahead After labouring for months to bring one of Jasper's newest business concepts to life, the owners of The Peacock Cork & Fork never dreamed the young restaurant's run would be so short-lived. Ottawa Pedestrian dies after being struck by a vehicle in Ottawa's south end Emergency crews responded to a collision involving a pedestrian on Albion Road, between Rideau Road and Mitch Owens Road, just before midnight. Ottawa sees rise in whooping cough cases Ottawa Public Health is reminding parents to add vaccinations to the back-to-school list for the fall, as the capital sees an increase in whooping cough cases. BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Montreal Quebec woman who allegedly posed as lawyer arrested after missing court A Quebec woman who allegedly pretended to be a lawyer and evaded the authorities for weeks has been arrested. 10-year-old boy missing in Montreal Montreal police is looking for 10-year-old Jordan Blessing Nkhingu. Quebec e-bus and truck company Lion Electric cuts its workforce again, this time by 30 per cent For the third time this year, Quebec manufacturer of electric medium- and heavy-duty urban vehicles, Lion Electric, is slashing its workforce, reducing its workforce by 30 per cent. Edmonton Jasper's fire-affected small businesses face rocky road ahead After labouring for months to bring one of Jasper's newest business concepts to life, the owners of The Peacock Cork & Fork never dreamed the young restaurant's run would be so short-lived. WEATHER WEATHER | Josh Classen's forecast: Warm with a late-day storm risk We should see afternoon highs in the mid to upper 20s through the rest of the week and the coming weekend in Edmonton. Edmonton man sentenced to 5 years in prison in terrorism case in United Kingdom An Edmonton man has been sentenced to five years in prison after being convicted in the United Kingdom of being a member of a proscribed terrorist group. Atlantic Average Canadian household spends almost half its income on taxes: Fraser Institute Taxes are the largest household expense for families in Canada. BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Sand from the Sahara Desert causing recent lull in the hurricane season: scientists Tiny grains of sand from the Sahara Desert are to blame for the almost month-long lull in this year's Atlantic hurricane season, scientists say. But it could soon come to an end. Winnipeg Bees, wasps to blame for wading pool closure There’s a buzz at the Braeside Park wading pool and it’s not the sound of kids splashing around. Remains believed to be missing man found in wooded area: Manitoba RCMP The remains of a missing Manitoba man were found in a wooded area on Monday. Rally for better bike safety blocks Winnipeg intersection Protestors shut down the Maryland Bridge on Tuesday as they called for better bike safety. Regina Sask. currently dealing with over 80 wildfires, none threatening communities, SPSA says As the devastating wildfire in Jasper National Park continues to burn, Saskatchewan is currently batting more than 80 active wildfires of its own. However, none are currently encroaching on any communities, the Saskatchewan Public Safety Agency said on Tuesday. Former Sask. MLA Lyle Stewart dead at 73 Former Saskatchewan Party MLA and provincial cabinet minister Lyle Stewart has died following a lengthy battle with cancer. 'It was a shock': Fire claims historic hotel and café in Radville, Sask. A long standing fixture in Radville, Sask. was destroyed by a fire in the early hours of Monday morning. Kitchener Death of neighbourhood deer sparks anger among Waterloo residents Waterloo residents are frustrated over the death of a wild deer that had been living in their neighbourhood, after repeated requests to help the animal were ignored. Guelph mayor calls out public drug use in city The Mayor of Guelph is speaking out about drug use in public spaces. Free little library destroyed in Kitchener Damaged books and bits of wood littered the ground on Wednesday after a free little library in Kitchener was destroyed. Saskatoon Pierre Poilievre spouts 'uneducated' opinions on safe consumption sites: Prairie Harm Reduction The executive director of a Saskatoon-based harm reduction group says federal Conservative leader Pierre Poilievre’s statements on supervised consumption sites are “uneducated.” Potentially toxic algae discovered in Saskatoon pond The City of Saskatoon has issued a warning to residents about the presence of toxic cyanobacteria in Briarwood Pond. Former Sask. MLA Lyle Stewart dead at 73 Former Saskatchewan Party MLA and provincial cabinet minister Lyle Stewart has died following a lengthy battle with cancer. Northern Ontario BREAKING BREAKING | Sudbury police investigating death at Bell Park Sudbury police say they are investigating a death at Bell Park and are asking the public to avoid it. Serious crash closes road at busy downtown Sudbury intersection Police are asking people to avoid the Lloyd Street area after a serious crash at a busy downtown Sudbury intersection Wednesday morning. Man linked to four murders in Kirkland Lake, Ont., is dead, police say Ontario Provincial Police say Martyn Rosko, the main suspect in four homicides in Kirkland Lake, is dead. London Back to work at IMT Defence in Ingersoll Workers voted to ratify a new four-year collective agreement that eliminates the two-tier wage system, they said discriminated against new hires and existing workers with limited seniority. Cyclist killed after being struck by transport truck One person has died after a crash Monday night in Lambton County. Around 10:05 p.m., crews responded to the area of London Line and Telfer road for the crash involving a transport truck and a cyclist. Intersection reopens following crash involving propane tanker truck Just after 12 p.m. on Tuesday, emergency crews rushed to the scene in Thames Centre after a transport carrying a full load of propane, collided with an SUV. Barrie Swim advisory for Couchiching Beach Couchiching Beach in Orillia has a swim advisory in place. Wasaga Beach calls for tent ban on beach Following reports of people defecating on the beach, Wasaga Beach Mayor Brian Smith passed a motion in council on Monday, formally requesting the province to ban four-sided tents on the beach. Rehabilitation centre for wildlife nears completion The National Wildlife Centre in Caledon Ont., has been helping sick and injured wildlife for 10 years and will soon offer its first permanent wildlife field hospital. Windsor Heat warning issued for Windsor-Essex Environment Canada has issued a heat warning for Windsor-Essex. High temperatures are expected to continue through Thursday. BREAKING BREAKING | Sport court dismisses Canada's appeal in women's soccer case The Court of Arbitration for Sport has dismissed Canada's appeal of a six-point penalty against its Olympic women's soccer team. Here’s when you can expect a settlement payment from Loblaw for admitting to bread price fixing A Windsor law firm has been working on the case since it first came to light nearly a decade ago. Vancouver Island Wildfire burning near Sooke, B.C., now being held A wildfire burning west of Victoria is no longer considered out of control, according to an update from the B.C. Wildfire Service Tuesday. New poll shows BC Conservatives closing gap with NDP as BC United loses another MLA A poll released Tuesday shows the gap narrowing between the BC NDP and the BC Conservatives with the latter party trailing by just three points months before the provincial election. 'Severely hypothermic' sailor rescued after spending hours adrift off B.C. coast A sailboat captain was found alive but suffering from a severe case of hypothermia on Monday after spending up to five hours adrift in the ocean off British Columbia, according to the coast guard. Kelowna B.C. tree fruit grower co-operative shuts down after 88 years, citing low volume A British Columbia co-operative that has been selling and promoting the province's fruit for the last 88 years is shutting down. Mounties say missing B.C. children, wanted father all found safe Police in the British Columbia Interior say a missing father and his four young children have been found safe after the man failed to surrender the children to their mother, in violation of a court order. Kamloops RCMP officer charged with assault, mischief A Kamloops Mountie has been charged with assault and mischief in connection to an incident that occurred last summer, Crown prosecutors announced Wednesday. Lethbridge Murder-conspiracy trial tied to Coutts, Alta., COVID-19 blockade set to go to jury A jury is set to begin deliberating today the fate of two men accused of conspiring to kill police at the Coutts, Alta., blockade in 2022. Lawyer for Coutts accused says client 'bit of a wing nut,' but not murder conspirator The defence lawyer for Chris Carbert says her client is “a bit of a wing nut” who fell down a conspiracy rabbit hole at the border blockade in Coutts, Alta., but that doesn’t make him guilty of conspiring to kill police. Fire crews respond to massive Coaldale recycling plant fire Just before 3 p.m. on Friday, workers at the 2Point0 recycling plant were running plastic material through a machine to be processed. Sparks flew off the machine, which started a fire. Sault Ste. Marie Torrential rain in community west of Sault Ste. Marie strands cottagers and residents Cleanup is underway more than 24 hours since Mother Nature opened up the skies and flooded much of Prince Township. Group Health Centre workers in the Sault ratify contract CUPE 894 in Sault Ste. Marie announced Tuesday that its members approved a new contract with the Group Health Centre. Impaired arrests in the Sault: Driving in reverse, on the wrong side of the road Sault police say recent impaired driving arrests in the city involved such dangerous acts as driving in reverse and driving on a sidewalk. N.L. N.L. university chair disciplined for sending pro-Palestinian email to alumnus's dad The chair of the board of regents at Memorial University in Newfoundland and Labrador has been asked to take privacy training after he forwarded an alumnus's pro-Palestinian campaign email to her father. After a harrowing rescue in the cold Atlantic, a fisherman wanted two things: A new guitar, and Nickelback tickets Newfoundland and Labrador Premier Andrew Furey gave a special gift to David Tiller, one of seven fishermen who survived 48 hours on a life raft in the Atlantic Ocean. Newfoundland and Labrador doubles funeral benefits after unclaimed bodies pile up The Newfoundland and Labrador government has more than doubled the financial assistance it offers low-income residents who need to pay for a burial or a cremation, as health officials scramble to deal with unclaimed bodies at the province's largest hospital. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks I'm Fairly Certain You’ll Never Drive Without This Car Phone Mount Again (And It's On Sale Right Now) If You Have No Idea What To Get Them For Their Birthday, Try One Of These Gifts Prime Day Is A Few Weeks Away, But You Can Already Snag These 30+ Deals On Amazon Canada Home 15 Home Products With Near-Perfect Reviews On Amazon Canada (And You'll Want Every Single One) These Budget-Friendly Patio Furniture Pieces Will Make You Want To Spend Every Second Outdoors 15 Of The Best Cookware Sets You Can Get In Canada Gifts 18 Birthday Presents They'll Love More Than A Gift Card 20 Brilliant Gifts You'll Want To Order For Yourself, Too 19 Foolproof Gifts For Kids That Cost Less Than $50 Beauty If You're On The Hunt For A Heat Protectant Spray, Here Are 14 That Reviewers Are Loving Right Now This Sally Hansen Instant Cuticle Remover Keeps Selling Out, And Here’s Why People Are Loving It The Best Hair Masks For Dry And Damaged Hair Deals From Lululemon to Amazon Canada: Here Are All The Best Sales, Deals, and Discounts You'll Find Online Right Now Amazon Prime Day May Be Over, But You Can Still Take Advantage Of These 70+ Amazing Deals Amazon Prime Day Is Almost Over — Here Are 100+ Of The Best Deals And Discounts You Can Still Snag Stay Connected","summary":"Former U.S. president Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents.","url":"https://www.ctvnews.ca/world/donald-trump-s-campaign-says-its-emails-were-hacked-1.6996395","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/10/trump-vance-emails-hacked-campaign-1-6996447-1723328990030.jpg","video":null,"publish_date":"2024-08-10 22:29:55","author":"Bill Barrow,The Associated Press","authors":["Bill Barrow","The Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.175},{"id":253845768,"title":"Donald Trump Reportedly Calls Kamala Harris a 'B****' in Private","text":"Now, Trump reportedly using a swear word to attack his opponent isn't unique ... remember, back in February reports came out that Joe Biden regularly refers to Trump as a \"sick f***.\" Video evidence seems to show him nearly doing it at a rally.","summary":"Donald Trump's name-calling is apparently getting aggressive in private ... 'cause a new report claims he's calling his presidential opponent a brutal name behind close doors. The New York Times published a piece today diving behind the scenes of&hellip;","url":"https://www.tmz.com/2024/08/10/donald-trump-calls-kamala-harris-bitch-private/","image":"https://imagez.tmz.com/image/45/4by3/2024/08/10/454a3a51ff8d4333bdc447d4b7fa3cb6_xl.jpg","video":null,"publish_date":"2024-08-10 22:28:19","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.654},{"id":253844370,"title":"Celine Dion blasts Donald Trump after discovering he used her iconic song at a campaign rally in Montana without permission","text":"Celine Dion blasts Donald Trump after discovering he used her iconic song at a campaign rally in Montana without permission READ MORE: Trump family member delivers shocking news to ex-president By Rachel Bowman and Nic White For Dailymail.Com Published: 21:15 BST, 10 August 2024 | Updated: 23:22 BST, 10 August 2024 e-mail 1.1k shares 554 View comments Celine Dion has mocked Donald Trump for playing the Titanic theme song at a campaign rally without her permission. Her voice could be heard wailing the 1998 classic 'My Heart Will Go On' over the speakers in Bozeman, Montana, shortly before Trump took the stage on Friday. Dion on Saturday made it clear that the use of 'video, recording, musical performance, and likeness of Celine Dion' was unauthorized. 'In no way is this use authorized, and Celine Dion does not endorse this or any similar use,' she said in a statement along with her record label, Sony. Dion then mocked Trump's choice, adding, '…And really, THAT song?' Celine Dion's iconic 'My Heart Will Go On' played at Donald Trump 's Montana rally Celine Dion, who sang at the Olympic Games opening ceremony, mocked Trump for choosing the song, and made clear it was unauthorized The epic ballad that conjures images of a doomed ship striking a massive iceberg, which is not the best comparison to a presidential campaign. Even worse, it was played just hours after Trump's plane was forced to divert to Billings while en route to Bozeman over a 'mechanical issue.' Be the first to commentBe one of the first to commentComments Is Trump's campaign going down like the Titanic? Comment now Some political pundits on social media felt the song was a metaphor for the Trump campaign's flagging momentum, which comes just weeks after a victory in November felt all but assured. One even suggested there could be a 'pro-Kamala Harris' mole secretly working to undermine Trump's re-election. One person said: 'Omg, Trump’s rally in Montana is showing a video of Celine singing \"My Heart Will Go On\" from the film Titanic. Is the rally coordinator trolling Trump?' Pictured: Celine Dion's full statement about Trump using her song The former president's plane was forced to divert to Billings while en route to event in Bozeman over a 'mechanical issue' on Friday 'Seems to me it’s a cry for help from a sinking ship. Has anyone checked on his campaign managers, are they being held hostage or maybe water boarded,' said another. Many people noted the irony in the theme song for a movie about a disaster being played at the event. 'Trump is saying he is going down like the Titanic,' said one person. 'The irony is not lost,' said another. 'How fitting because the Trump campaign right now is just like the titanic. Everyone’s in the bar drinking telling themselves the ship is not sinking,' a third person said. One person created a meme movie poster recreating a scene from James Cameron's 1997 film with Trump and Vance captioned, 'Collide with failure. This November.' Read More BREAKING NEWS Trump campaign is 'HACKED' - amid claims secret documents about JD Vance and court cases were leaked 'Bro, the Trump campaign keeps giving. These are real life SNL skits. Who the f**k plays a song famously associated with a sinking ship at a rally for a campaign that is sinking,' a person said. 'Is the Titanic metaphor a little on the nose, or what,' another said. Others questioned if the Canadian singer gave Trump's team permission to play her song.' 'Celine seems like a truly kind and compassionate legend, but you know she's on the couch at home saying, \"Yeah, f**k no!\" in French,' one person said. 'He can’t have Celine Dion, sorry,' a second person said. 'Celine Dion, are you getting paid for this? You might want to call your lawyer. There's a payday waiting for you right here,' another said. Celine's statement comes amid a tough day for the Trump campaign. A new poll by The New York Times released by the outlet on Saturday suggests that Harris has now moved ahead of Trump by four points in Michigan, Pennsylvania and Wisconsin - all vital battle ground states. Then hours later, the Trump campaign revealed it had been hacked, suggesting that they were targeted by Iran. The campaign blamed 'foreign sources hostile to the United States' and cited a Microsoft report on Friday that Iranian hackers attempted to hack a high-ranking official of a presidential campaign. Céline Dion and her late husband, René Angélil (pictured with Trump and Melania in 1999), frequently dined at Mar-a-Lago Trump has also spent part of the week fending off criticism of a story where he claimed to have almost been in a helicopter crash with former San Francisco Mayor Willie Brown. On Friday night, he was accused of mixing Brown up with another black lawmaker, former California State Senator Nate Holden. Holden told Politico he and Trump were almost in a chopper smash in 1990 and said: 'Willie is the short Black guy living in San Francisco. I’m a tall Black guy living in Los Angeles.' Laughing at the story, he jokingly added: 'I guess we all look alike.' Before the singer's response, Dion and her late husband, René Angélil, frequently dined at Trump's Mar-a-Lago in the 1990s. She was a fan of the French chef Bernard Goupy, especially his signature Caesar salad that was built in an edible cheese bowl. But one day, Trump decided he wasn't making a proper Caesar salad, tossing the salad himself and firing Goupy. However, Celine quickly snapped Goupy up to be her chef at her Jupiter, Florida, estate. Celine DionMontanaDonald Trump Share or comment on this article: Celine Dion blasts Donald Trump after discovering he used her iconic song at a campaign rally in Montana without permission e-mail 1.1k shares Add comment","summary":"A classic Celine Dion song was played at Trump's campaign rally in Bozeman, Montana, on Friday. The singer's management company has now posted a fiery response on Twitter.","url":"https://www.dailymail.co.uk/news/article-13731453/celine-dion-slams-trump-rally-twitter-Montana.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/08/10/06/88376133-0-image-a-66_1723266347264.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/08/10/7672172110688598311/1024x576_MP4_7672172110688598311.mp4","publish_date":"2024-08-10 22:22:42","author":"Editor,Nic White,Rachel Bowman","authors":["Editor","Nic White","Rachel Bowman"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.206},{"id":253843802,"title":"Trump campaign projects confidence, looks to young male voters for an edge on Harris","text":"AP – As Donald Trump adjusts to the reality of his new race against Kamala Harris, his campaign is counting on younger male voters to give him the edge in November in a presidential contest they insist is his to lose. Trump and his Republican campaign now face a dramatically different race than the one just three weeks ago, before United States President Joe Biden abandoned his bid. While they acknowledge polls have tightened with Harris as the Democratic nominee, they maintain that the fundamentals of the race have not changed, with voters deeply sour over the direction of the country, and particularly the economy. “What has happened is we are witnessing a kind of out-of-body experience where we have suspended reality for a couple of weeks,” Trump campaign pollster Tony Fabrizio told reporters during a briefing in West Palm Beach of the current state of the race. It was a message echoed by Trump during a news conference at his Mar-a-Lago club. “The honeymoon period’s gonna end,” he insisted while minimising the size of the crowds Harris has been drawing and lashing out at his new opponent. “Let me tell you: We have the enthusiasm.”","summary":"","url":"https://borneobulletin.com.bn/trump-campaign-projects-confidence-looks-to-young-male-voters-for-an-edge-on-harris/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/08/P19-AP-TRUMP_11082024.jpg","video":null,"publish_date":"2024-08-10 22:15:10","author":null,"language":"en","source_country":"bn","sentiment":-0.208},{"id":253845596,"title":"Donald Trump's campaign says its emails were hacked","text":"Former President Donald Trump's presidential campaign said on Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran's involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents' attempts to interfere in the US campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending \"a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor\". READ MORE: Woman in surgery after 'unprovoked glassing' in Perth pub Trump campaign spokesperson Steven Cheung blamed the hack on \"foreign sources hostile to the United States\". The National Security Council did not immediately respond to a request for comment on Saturday by The Associated Press. Politico first reported on Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as \"Robert\" — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Senator JD Vance. The document was dated February 23, almost five months before Trump selected Vance as his running mate. \"These documents were obtained illegally\" and \"intended to interfere with the 2024 election and sow chaos throughout our Democratic process,\" Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that \"Iranian hackers broke into the account of a 'high ranking official' on the US presidential campaign in June 2024, which coincides with the close timing of President Trump's selection of a vice presidential nominee\". \"The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,\" Cheung said, adding a warning that \"any media or news outlet reprinting documents or internal communications are doing the bidding of America's enemies and doing exactly what they want.\" In response to Microsoft's report, Iran's United Nations mission denied it had plans to interfere or launch cyberattacks in the US presidential election. Cheung did not immediately respond to questions about the campaign's interactions with Microsoft on the matter. Microsoft said on Saturday it had no comment beyond its blog post and Friday report. READ MORE: ﻿Girl, 14, charged with murder after alleged stabbing in Queensland Bizarre places becoming a hotbed of cybercriminalsView Gallery In that report, Microsoft stated that \"foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity\". The analysis continued: \"Iranian cyber-enabled influence operations have been a consistent feature of at least the last three US election cycles. Iran's operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.\" \"Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,\" Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. \"The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,\" the report states. Vice President Kamala Harris' campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee's cybersecurity protocols. Watch every moment, every medal of the Olympic Games Paris 2024 live and free on Channel 9 and 9Now. Plus, every event ad-free and in 4K on Stan Sport.","summary":"T﻿he campaign suggested Iranian actors were involved in stealing and distributing sensitive internal documents.","url":"https://www.9news.com.au/world/us-election-2024-donald-trumps-campaign-says-its-emails-were-hacked/de8bfff6-62a3-41d6-b638-ca7d0252dc64","image":"https://imageresizer.static9.net.au/kPrspVKBblWdgQ4FzUMe8M-KiHA=/0x18:1024x594/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fccb1579e-5c72-488b-8f07-0be83ecf7c98","video":null,"publish_date":"2024-08-10 22:13:07","author":"9News,Associated Press","authors":["9News","Associated Press"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.481},{"id":253843522,"title":"Donald Trump's Helicopter Claim Raises Questions From Critics","text":"Former President Donald Trump's claim that he almost died in a helicopter with Vice President Kamala Harris' ex-boyfriend Willie Brown recently raised questions from critics on social media.\"I went down in a helicopter with him. We thought maybe this was the end,\" the former president said during a press conference at his Mar-a-Lago estate in Florida on Thursday. \"We were in a helicopter going to a certain location together, and there was an emergency landing. This was not a pleasant landing.\"On Friday, Politico released an interview with Nate Holden, a former city council member and state senator from California, who claimed that he was the one on the helicopter with Trump, not Brown, a former San Francisco mayor.\"Willie is the short Black guy living in San Francisco,\" Holden told Politico. \"I'm a tall Black guy living in Los Angeles.\" He added with a laugh, \"I guess we all look alike.\"Trump, the GOP presidential nominee, doubled down on Friday, writing on his social media site, Truth Social, that it was indeed Brown on that helicopter ride.Brown told The New York Times on Friday, \"You know me well enough to know that if I almost went down in a helicopter with anybody, you would have heard about it!\"Holden claims that in 1990 he went on a helicopter with Trump to get to Atlantic City, New Jersey, to tour the real estate tycoon's Taj Mahal casino.Barbara Res, Trump's former executive vice president of construction and development who was also aboard the helicopter, according to Politico, wrote about the ordeal in her book, All Alone on the 68th Floor.\"The pilot let us know he had lost some instruments and we would need to make an emergency landing,\" she wrote in her book. \"By now, the helicopter was shaking like crazy.\"Res told Politico it was definitely Holden on the helicopter with them. After the considerable turbulence, the helicopter landed safely in New Jersey and within an hour, the group was in Atlantic City.Newsweek has reached out to Trump's communications director via email for comment on Saturday afternoon.Questions Are Raised About Trump's StoryU.S. Transportation Secretary Pete Buttigieg told Kaitlan Collins on CNN Friday night, \"You can just tell that [Trump's] lost a step. He's getting mushier, fuzzier, more confused.\"Buttigieg referenced Trump's helicopter story and said of the 78-year-old: \"It does raise some real concerns about what's happened to Donald Trump over the years. Is this a symptom of something? Is he struggling to maintain a grip on reality?\"The Times reported on Thursday that Trump mistakenly referred to former California Governor Jerry Brown as Willie Brown when telling the helicopter story.Trump took a helicopter ride with Jerry Brown and then-governor-elect of California Gavin Newsom in 2018 to survey wildfire damage in Sacramento, the newspaper reported.When MSNBC's Morning Joe reported on the Times' story, the newscasters laughed at the fact that Trump could confuse Jerry Brown, a white man, with Willie Brown, a Black man.Christopher Webb, a self-proclaimed Democrat, according to his X profile, shared a clip of the Morning Joe segment and wrote on X on Friday morning, \"Was it a lie or cognitive failure?\"In Trump's Truth Social post on Friday, he criticized the Times for its reporting and wrote, \"First of all, it was in New Jersey, not California, and it was Willie Brown, not former Governor Jerry Brown. So far they are about as accurate as they are with their other stories about me.\"Brian Krassenstein, who gained popularity on social media after trolling Trump on X, formerly Twitter, during his presidency, wrote on X on Saturday morning: \"Donald Trump recently made a claim about an emergency helicopter landing involving him and Willie Brown, which is either a blatant lie or a clear case of mistaken identity (confusing 2 black men).\"He continued: \"The real issue here is Trump's refusal to admit a mistake. Instead of acknowledging the error, he's doubling down on the falsehood, which highlights a concerning pattern...this behavior should alarm voters because a leader who cannot admit fault is likely to repeat mistakes—and in this case, he's doing so over something trivial yet insists on misleading the public.\"Meanwhile, Mike Rothschild, who describes himself as a \"conspiracy theory journalist and expert\" on X and who has made appearances on MSNBC, CNN and PBS News, wrote on X early Saturday morning, \"So the helicopter story was real, Trump just got every detail of it wrong other than it involved a helicopter and a Black politician. Maybe we shouldn't give him the nuclear codes again?\"","summary":"Trump recently claimed he and Willie Brown, a former San Francisco mayor, almost died in a helicopter. However, Brown said it wasn't him.","url":"https://www.newsweek.com/donald-trump-willie-brown-helicopter-claim-raises-questions-1937467","image":"https://d.newsweek.com/en/full/2447427/trump.jpg","video":null,"publish_date":"2024-08-10 22:10:44","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.041},{"id":253843762,"title":"Donald Trump’s campaign says its emails were hacked and points to Iran","text":"The campaign provided no specific evidence of Iran’s involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.” Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States.” The National Security Council did not immediately respond to a request for comment Saturday by The Associated Press. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee.” “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want.” In response to Microsoft’s report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election. Cheung did not immediately respond to questions about the campaign’s interactions with Microsoft on the matter. Microsoft said Saturday it had no comment beyond its blog post and Friday report. In that report, Microsoft stated that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.” The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three U.S. election cycles. Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.” “Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris’ campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee’s cybersecurity protocols.","summary":"The claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. campaign in 2024.","url":"https://fortune.com/2024/08/10/donald-trump-campaign-email-hack-iran-microsoft-cybersecurity-warning-jd-vance/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/AP24216803178703-e1723326882423.jpg","video":null,"publish_date":"2024-08-10 22:03:35","author":"Bill Barrow,The Associated Press","authors":["Bill Barrow","The Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.379},{"id":253843600,"title":"Trump campaign says it has been hacked","text":"Former President Donald Trump's presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents.The campaign provided no specific evidence of Iran's involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents' attempts to interfere in the U.S. campaign in 2024.In its report, Microsoft cited an instance of an Iranian military intelligence unit in June sending \"a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.\"Trump campaign spokesperson Steven Cheung blamed the hack on \"foreign sources hostile to the United States.\" A National Security Council spokesperson told CBS News that it was deferring to the Justice Department on the matter. \"As we have said many times, the Biden-Harris Administration strongly condemns any foreign government or entity who attempts to interfere in our electoral process or seeks to undermine confidence in our democratic institutions,\" the NSC spokesperson said in a statement. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as \"Robert\" — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Sen. JD Vance of Ohio. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate.\"These documents were obtained illegally\" and \"intended to interfere with the 2024 election and sow chaos throughout our Democratic process,\" Cheung said.He pointed to the Microsoft report issued Friday and its conclusions that \"Iranian hackers broke into the account of a 'high ranking official' on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump's selection of a vice presidential nominee.\"\"The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,\" Cheung said, adding a warning that \"any media or news outlet reprinting documents or internal communications are doing the bidding of America's enemies and doing exactly what they want.\"In response to Microsoft's report, Iran's United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election. In July, U.S. officials with the Office of the Director of National Intelligence, FBI and Department of Homeland Security indicated that Iran has started an influence campaign designed to undercut Trump's candidacy. Cheung did not immediately respond to questions about the campaign's interactions with Microsoft on the matter. Microsoft said Saturday it had no comment beyond its blog post and Friday report.In that report, Microsoft stated that \"foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.\"The analysis continued: \"Iranian cyber-enabled influence operations have been a consistent feature of at least the last three U.S. election cycles. Iran's operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.\"\"Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,\" Microsoft concluded.Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser.\"The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,\" the report states.Vice President Kamala Harris' campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee's cybersecurity protocols.","summary":"Without citing specific evidence, Trump campaign spokesperson Steven Cheung blamed the hack on \"foreign sources hostile to the United States.\"","url":"https://www.cbsnews.com/news/trump-campaign-says-it-has-been-hacked/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/10/fcaf0236-bcea-47fc-85c9-14f743378663/thumbnail/1200x630/5669683d0c8127b376e7a77a627c3730/gettyimages-2165592519.jpg?v=0a0c17d349635d55704afd4e16e28fc6","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3111376_hls/master.m3u8","publish_date":"2024-08-10 22:02:59","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.532},{"id":253845938,"title":"Kamala Harris makes an immigration pitch in Arizona as she fights to gain ground in the Sun Belt","text":"GLENDALE, Ariz. (AP) — Vice President Kamala Harris drew on her prosecutorial background to make her first expansive pitch on immigration to border-state voters as she and her new running mate, Minnesota Gov. Tim Walz, attracted thousands to a campaign rally in Arizona during their tour of battleground states. Harris, the former attorney general of California, reminded the crowd that she, as a law enforcement official, targeted transnational gangs, drug cartels and smugglers. “I prosecuted them in case after case, and I won,” Harris said in front of a crowd of more than 15,000 in Glendale, a suburb of Phoenix. “So I know what I’m talking about.” Harris promoted a border security bill that a bipartisan group of senators negotiated earlier this year, which Republican lawmakers ultimately opposed en masse at Republican nominee Donald Trump’s behest. “Donald Trump does not want to fix this problem,” Harris said. “Be clear about that: He has no interest or desire to actually fix the problem. He talks a big game about border security, but he does not walk the walk.” Her effort to address immigration — a political liability that has dogged Harris for most of her vice presidency — head-on in the critical battleground state is part of a broader push from her campaign to make gains in Sun Belt states that had become increasingly out of reach with Joe Biden at the top of the ticket. Trump and his allies, who had long hammered Biden over the influx of migrants during his term, are now shifting their attacks to Harris. Kari Lake, who is running against Democratic Rep. Ruben Gallego for the open Senate seat in Arizona, bashes Gallego in a recent ad for supporting Biden’s and Harris’ “radical border agenda,” featuring repeated clips of the vice president chortling. “It’s very easy for us to segue and switch our sights and focus on her,” said Dave Smith, Pima County’s Republican party chairman. But Harris has been courting the state’s fast-growing Latino population and released a new ad of her own, highlighting how Harris, the daughter of immigrants from India and Jamaica, rose to the highest echelons of American politics. And, as she has done in other campaign stops, Harris during the rally infused the theme of “freedom” throughout her remarks, especially as it came to voting rights, gun safety, LBGT rights and access to abortion. “Arizona, ours is a fight for the future and it is a fight for freedom,” Harris said, who had walked out on the stage as Beyonce’s “Freedom” blared throughout Desert Diamond Arena. Harris’ message on safety and gun restrictions resonated with Jen Duran, a 37-year-old mother and independent voter. “I have an elementary school daughter who has been going to this school since she was 4, and today we got a notification that there was a lockdown drill,” Duran said. “So safety for our kids is really important.” Phyllis Zeno, a 65-year-old grandmother from Maricopa, said she was thrilled to hear Harris’ message of unity and her policy positions, especially on affordable health care and reproductive rights. “Her message to me, it wasn’t just hope, but renewed faith in democracy, that we can do this,” Zeno said. Arizona is represented by Democrat Mark Kelly in the U.S. Senate, who has won two tough races in the politically divided states and whom Harris passed over as a running mate this week. In choosing Walz over Kelly, Harris may have lost the chance to win over people like Gonzalo Leyva, a 49-year-old landscaper in Phoenix. Leyva plans to vote for Trump but says he would have backed a Harris-Kelly ticket. “I prefer Kelly like 100 times,” said Leyva, a lifelong Democrat who became an independent at the beginning of Trump’s term in office. “I don’t think he’s that extreme like the other guys.” In Arizona, every vote will be critical. The state is no stranger to nail-biter races, including in 2020 when Biden bested Trump by fewer than 11,000 votes. Both parties are bracing for a similar photo finish this year. Harris acknowledged how tough the race will be as she and Walz toured a campaign office in North Phoenix Friday afternoon and thanked volunteers, who were making signs with sayings such as “This Mamala is Voting for Kamala” and “Kamala and the Coach.” (Walz has been a high school football coach.) She also emphasized it during the rally. “As exciting as this is, we cannot lose sight of a really important fact: We are definitely running as the underdog,” Harris said. Democrats are confident Harris is in solid shape in the state even without Kelly on the ticket. The senator plans to remain a strong advocate for Harris and is already mentioned for possible Cabinet posts or other prominent roles should the vice president ascend to the Oval Office. “What this is about is who works harder. That’s it,” Kelly said at the rally. “It is as simple as that.” Arizona is something of a magnet for Midwesterners seeking to escape the cold. So, several observers say, Walz may still play well there. The governor himself noted that during his opening remarks for Harris, saying: “I’m like a damn snowman, I’m melting here.” Scott Snyder, who moved to Phoenix three years ago from Detroit, wasn’t too familiar with Kelly’s background or his politics, but said Harris made the right choice with Walz. “He reminds me a lot of my dad,” said Snyder, an electrician. “You see pictures of him out there coaching high school football. That’s something that resonates with me. You see him out there duck hunting. Same thing. That’s fairly common in Michigan, where I’m from.” Arizona was reliably Republican until Trump’s combative approach to politics went national. In 2016, Trump won Arizona, then quickly started feuding with the late Republican Sen. John McCain, a political icon in the state. That sparked a steady exodus of educated, moderate Republicans from the GOP and toward Democrats in top-of-the-ticket contests. In 2018, Democrats won an open Senate race in the state, foreshadowing Kelly’s and Biden’s wins in 2020. In 2022, Kelly won again, and Democrats swept the top three statewide races for governor, attorney general and secretary of state, defeating Republican candidates who hewed to Trump’s style and his lies about fraud costing him the 2020 presidential election. Chuck Coughlin, a Republican strategist and former McCain staffer, said the same voters who tipped the state to Democrats in the past few cycles remain lukewarm, at best, on Trump. “Trump’s not doing anything to embrace that segment of the electorate,” he said. Meanwhile, there was a fresh reminder of yet another liability for Harris when she was interrupted by Gaza protesters. Harris said she has been clear that “now is the time to get a cease-fire deal” to end fighting between Israel and Hamas that has caused the deaths of tens of thousands of people in Gaza. She stressed that she and Biden “are working around the clock every day to get that cease-fire deal done and bring the hostages home.” Harris added, “I respect your voices, but we are here to now talk about this race in 2024.” She responded differently earlier this week when Gaza protesters interrupted her during a Detroit-area rally. She talked over the protesters. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"GLENDALE, Ariz. (AP) — Vice President Kamala Harris drew on her prosecutorial background to make her first expansive pitch on immigration to border-state voters as she and...","url":"https://wsvn.com/news/politics/kamala-harris-makes-an-immigration-pitch-in-arizona-as-she-fights-to-gain-ground-in-the-sun-belt/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/240810_Kamala_Harris_Arizona_rally.jpg?quality=60&strip=color","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/38015cad-7430-4569-b1b7-00c7fc33c104/c508b0fe-7008-407f-b5ce-0571a86ce397/main.mp4?fastly_token=NjZiODRlMDBfNTYwMmMyYzVlMWQ5NTgyMmMwYTEzZjA5YTZlMTM3MDFiZ","publish_date":"2024-08-10 22:00:24","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":0.197},{"id":253843714,"title":"New polls give Harris lead over Trump in three key states","text":"Kamala Harris now leads Donald Trump in three crucial battleground states, according to new polls published Saturday, apparently eroding the advantage the former president has enjoyed there over the past year. The polls of likely voters by The New York Times and Siena College showed Democratic presidential candidate Harris leading her Republican rival Trump by an identical 50 percent to 46 percent margin in Michigan, Pennsylvania and Wisconsin. Under the U.S. electoral college voting system, those three populous Midwestern states are considered key to victory for either party. Harris's apparent lead is within the polls' average margin of error of 4.5 points. Nevertheless, the polls show a shift compared to previous surveys in those states which for nearly a year had shown Trump either tied with or slightly leading Democratic President Joe Biden. Biden dropped out of the White House race last month and endorsed Harris instead. The polling also showed that voters still prefer Trump on the key issues of the economy and immigration, though Harris had a 24-point advantage when voters were asked whom they trust on the question of abortion. The Trump campaign pushed back against the new polls, questioning their methodology and suggesting they were released \"with the clear intent and purpose of depressing support for President Trump.\" Much can change in the nearly three months before the November 5 election. Democrats, in any case, have taken heart in the surge of enthusiasm that has greeted Harris's candidacy, with many expressing relief after 81-year-old Biden stepped aside. Her announcement Tuesday of Minnesota Governor Tim Walz as her running mate also appears to have energized Democrats. The Harris-Walz surge helped cut short a rise in support for Trump that followed the July 13 attempt on his life and the Republicans' successful national convention last month. But Harris has enjoyed an even bigger bump in favorability -- up 10 points among registered voters in Pennsylvania in just a month, the Times/Siena polling found. Voters said they saw her as more intelligent than Trump and having a better temperament to govern. Trump, his running mate J.D. Vance and other Republicans have tried an array of attacks meant to weaken Harris -- with Trump even questioning her racial identity. But the new polls show Democrats strongly supporting the younger and more vigorous Harris who, with Walz, has been campaigning at a furious pace this week in swing states. Among Democrats, voter satisfaction with their choice of candidates has shot up by 27 points in the three Midwestern states since May, the polls found. Three months ago, it was Republicans who expressed a higher level of satisfaction. The surveys were conducted between August 5 and 9, with at least 600 voters in each state. © 2024 AFP","summary":"Kamala Harris now leads Donald Trump in three crucial battleground states, according to new polls published Saturday, apparently eroding the advantage the former president has enjoyed there over…","url":"https://japantoday.com/category/world/new-polls-give-harris-a-lead-over-trump-in-three-key-states","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/a5/2b/ef316d21c3c234f2857c4fae7ff115b1b372/a52bef316d21c3c234f2857c4fae7ff115b1b372/_w1700.jpg","video":null,"publish_date":"2024-08-10 21:59:14","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","catgory":"politics","source_country":"jp","sentiment":-0.207},{"id":253843514,"title":"Why isn't the media reporting on Trump's increasing dementia?","text":"Today, Trump held an hourlong news conference in the main room at Mar-a-Lago. He insulted Kamala Harris’s intelligence, lied about the state of the U.S. economy, and claimed the country would be in mortal danger if he didn’t win the election. In other words, the usual Trump torrent of lies and insults. But what got my attention was his description of his departure from the White House as a “peaceful” transfer of power, his insistence that the group that mounted the assault on the Capitol was relatively small, and his boast that attendance at his January 6 rally preceding the assault was larger than the crowd Martin Luther King Jr. drew on the National Mall for his “I Have a Dream” speech. “If you look at Martin Luther King, when he did his speech, his great speech, and you look at ours — same real estate, same everything, same number of people, if not — we had more.” Friends, these are not the statements of a sane person. Trump is showing growing signs of dementia. In April, he spoke to a rally in Schnecksville, Pennsylvania, about the famed Civil War battle at Gettysburg. Trump told the audience: “Gettysburg, what an unbelievable battle that was. It was so much, and so interesting, and so vicious and horrible, and so beautiful in so many different ways— it represented such a big portion of the success of this country.\" Trump continued, “Gettysburg, wow — I go to Gettysburg, Pennsylvania, to look and to watch.\" During the last months of the Republican primaries, he repeatedly claimed that his opponent Nikki Haley was in charge of Capitol security on January 6. (Haley never had any connection to Capitol security.) He has repeatedly confused whom he ran against in the past, such as stating, “With Obama, we won an election that everyone said couldn’t be won.” (Trump defeated Hillary Clinton in 2016.) Last September, Trump suggested that the way to prevent wildfires in California’s forest lands is to keep them damp. Here are his words: “They say that there’s so much water up north that I want to have the overflow areas go into your forests and dampen your forests, because if you dampen your forests you're not gonna have these forest fires that are burning at levels that nobody’s ever seen.” In October, Trump warned his supporters that Biden will lead America into World War Two. Can I be frank? It appears that Trump — with a family history of dementia — is increasingly unhinged. He has claimed that Hezbollah, the Iranian-backed militant group, is “very smart.” That whales are being killed by windmills. That he won all 50 states in 2020. That he defeated Barack Obama in 2016. That the outgoing chair of the Joint Chiefs of Staff should be executed. The most telling evidence of Trump’s growing dementia is found in his paranoid thirst for revenge, on which he is centering his entire presidential campaign. On November 11, he pledged to a crowd of supporters in Claremont, New Hampshire, that: “We will root out the communists, Marxists, fascists and the radical left thugs that live like vermin within the confines of our country, that lie and steal and cheat on elections and will do anything possible — they’ll do anything, whether legally or illegally, to destroy America and to destroy the American dream.” Are these the words of a sane person? Or of an aging paranoid megalomaniac? Even if it’s unclear to which category Trump belongs, shouldn’t this question be central to the coverage of his campaign for reelection? I’m no physician, and I have no business providing a diagnosis, but the weight of the evidence suggests Trump is suffering from early dementia. So why isn’t the media covering this — at least with the same intensity they covered Biden’s apparent difficulties? When I’ve asked members of the media, they say Trump’s malfunctioning brain is “old news.” But just because Trump has shown mental instability in the past doesn’t make his mental problems any less relevant now. They’re more relevant. He appears even more delusional than before. If Biden’s difficulties were fair game, why isn’t Trump’s apparent mental decline front and center? The growing evidence of Trump’s dementia and paranoia poses a clear potential danger to the future of America — if he’s reelected. At the least, the media should be investigating and reporting on it. Right? Robert Reich is a professor of public policy at Berkeley and former secretary of labor. His writings can be found at https://robertreich.substack.com/.","summary":"Today, Trump held an hourlong news conference in the main room at Mar-a-Lago. He insulted Kamala Harris’s intelligence, lied about the state of the U.S. economy, and claimed the country would be in mortal danger if he didn’t win the election.\n\n\nIn other words, the usual Trump torrent of lies and insults.\n\nBut what got my attention was his description of his departure from the White House as a “peaceful” transfer of power, his insistence that the group that mounted the assault on the Capitol was relatively small, and his boast that attendance at his January 6 rally preceding the assault was larger than the crowd Martin Luther King Jr. drew on the National Mall for his “I Have a Dream” speech.\n\n“If you look at Martin Luther King, when he did his speech, his great speech, and you look at ours — same real estate, same everything, same number of people, if not — we had more.”\nFriends, these are not the statements of a sane person. \n\nTrump is showing growing signs of dementia. \n\nIn April, he spoke to a rally in Sch","url":"https://www.alternet.org/trump-dementia-2668942285/","image":"https://www.alternet.org/media-library/image.png?id=52063157&width=1200&height=600&coordinates=0%2C60%2C0%2C60","video":null,"publish_date":"2024-08-10 21:58:52","author":"Robert Reich","authors":["Robert Reich"],"language":"en","source_country":"US","sentiment":-0.23},{"id":253843220,"title":"Trump campaign accuses Iran of hacking its emails","text":"Former President Donald Trump's presidential campaign said Saturday (Aug 10) that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran's involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the US campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.” Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States.” The National Security Council did not immediately respond to a request for comment Saturday by The Associated Press. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source - an AOL email account identified only as “Robert” - passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance The document was dated Feb 23, almost five months before Trump selected Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the US presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee.” “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want.” In response to Microsoft's report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the US presidential election. Cheung did not immediately respond to questions about the campaign's interactions with Microsoft on the matter. Microsoft said Saturday it had no comment beyond its blog post and Friday report. In that report, Microsoft stated that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.” The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three US election cycles. Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.\" “Recent activity suggests the Iranian regime - along with the Kremlin - may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris' campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee's cybersecurity protocols.","summary":"","url":"https://www.channelnewsasia.com/world/trump-campaign-accuses-iran-hacking-its-emails-4540096","image":"https://onecms-res.cloudinary.com/image/upload/s--4U5oUAJJ--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/election_2024_trump_78703.jpg?itok=0ORlZVlH","video":null,"publish_date":"2024-08-10 21:57:45","author":null,"language":"en","catgory":"politics","source_country":"sg","sentiment":-0.447},{"id":253842878,"title":"Donald Trump’s team claims that their email accounts were compromised","text":"Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran’s involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.” Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States.” The National Security Council did not immediately respond to a request for comment Saturday by The Associated Press. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee.” “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want.” In response to Microsoft’s report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election. Cheung did not immediately respond to questions about the campaign’s interactions with Microsoft on the matter. Microsoft said Saturday it had no comment beyond its blog post and Friday report. In that report, Microsoft stated that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.” The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three U.S. election cycles. Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.” “Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris’ campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee’s cybersecurity protocols. ___ Associated Press writers Mae Anderson in New York and Fatima Hussein in Rehoboth Beach, Delaware, contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFormer President Donald Trump’s presidential campaign said Saturday that it has been&#8230;\n\n\nThis Post: Donald Trump&#8217;s team claims that their email accounts were compromised first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/donald-trumps-team-claims-that-their-email-accounts-were-compromised/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Donald-Trump039s-campaign-says-its-emails-were.jpg","video":null,"publish_date":"2024-08-10 21:50:29","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.439},{"id":253846692,"title":"Donald Trump’s campaign says emails were hacked","text":"It cited an instance in June of an Iranian military intelligence unit sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor”. Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States”. The National Security Council did not immediately respond to a request for comment. Politico first reported on the hack on Saturday. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Senator JD Vance. The document was dated February 23, almost five months before Mr Trump selected Mr Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Mr Cheung said. He pointed to the Microsoft report issued on Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the US presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee”. The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Mr Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want”. In response to Microsoft’s report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the US presidential election. Mr Cheung did not immediately respond to questions about the campaign’s interactions with Microsoft on the matter. Microsoft said on Saturday it had no comment beyond its blog post and Friday report. Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024 In that report, Microsoft stated that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity”. The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three US election cycles. “Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.” “Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris’ campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee’s cybersecurity protocols.","summary":"The campaign provided no specific evidence of Iran’s involvement, but Saturday’s claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the US campaign in 2024","url":"https://www.irishexaminer.com/world/arid-41453998.html","image":"https://www.irishexaminer.com/cms_media/module_img/8485/4242970_2_seoimage1x1_fe198d963fee4c0e8cfd490a8929d082.jpg.jpg","video":null,"publish_date":"2024-08-10 21:50:00","author":"Bill Barrow, Associated Press,Irishexaminer.com","authors":["Bill Barrow, Associated Press","Irishexaminer.com"],"language":"en","catgory":"politics","source_country":"ie","sentiment":-0.313},{"id":253842740,"title":"U.S. ambassador to Japan planning to leave post in November","text":"U.S. Ambassador to Japan Rahm Emanuel has told people around him of his intention to leave his post in November, government sources said. Emanuel, known for his tough stance on China, who has played an active role in deepening Washington-Tokyo ties, is considering leaving Japan before or after Thanksgiving on Nov 28, the U.S. sources said, adding he is hoping to be part of the transition if Vice President Kamala Harris wins the presidential election. If Donald Trump, a former president and the Republican nominee, wins the Nov 5 election, he will undoubtedly name a new ambassador to Japan. The sources said Emmanuel, 64, has no interest in staying in the post until the next envoy is selected as he wants to seek a new post in a Harris administration. U.S. online news site Axios recently reported that Emmanuel could be one of the candidates for Harris' national security adviser position. The ambassador arrived in Japan in January 2022, filling the post that had been vacant since his predecessor, William Hagerty, resigned in July 2019 to run for the Senate. Even before arriving in the Japanese capital, Emanuel suggested that an essential part of his job would entail countering China. Emanuel had indicated he would serve the post only during President Joe Biden's first term, saying the United States' posture for the next 30 years would be determined by what it could build in partnership with Japan over the next three years. From 2009 to 2010, Emanuel was chief of staff to President Barack Obama, whom Biden served as vice president. Emmanuel served as Chicago's mayor for two terms from 2011 to 2019 and was a member of the House of Representatives from 2003 to 2009. Biden abandoned his reelection bid last month, and Harris became the Democratic Party's nominee for president about a week ago. The 81-year-old president bowed out of the 2024 presidential race on July 21, following weeks of intraparty fighting over his fitness to serve another term and calls for him to pass the baton to a younger generation. In state primaries and caucuses earlier this year, Biden won enough delegates to clinch the Democratic nomination. However, pressure for the incumbent to exit the race quickly intensified after he delivered a shaky performance in a televised debate against Trump in late June. Harris, who is Black and Asian American, would be the first female U.S. president, as well as the first woman of color to hold the office. She has narrowed or erased Trump's lead in a number of national polls and appears to be more formidable than Biden in key battleground states. © KYODO","summary":"U.S. Ambassador to Japan Rahm Emanuel has told people around him of his intention to leave his post in November, government sources said.\nEmanuel, known for his tough…","url":"https://japantoday.com/category/politics/update1-u.s.-ambassador-to-japan-planning-to-leave-post-in-november","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/b6/8a/077171d3f34def294db883e0ecb15b1c59c5/AP24222186452684/_w1700.jpg","video":null,"publish_date":"2024-08-10 21:49:08","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","catgory":"politics","source_country":"jp","sentiment":-0.115},{"id":253844432,"title":"Trump is putting mass deportations at the heart of his campaign. Some Republicans are worried","text":"WASHINGTON (AP) — “Mass Deportation Now!” declared the signs at the Republican National Convention, giving a full embrace to Donald Trump’s pledge to expel millions of migrants in the largest deportation program in American history. Some Republicans aren’t quite ready for that. Lauren B. Peña, a Republican activist from Texas, said that hearing Trump’s calls for mass deportations, as well as terms like “illegals” and “invasion” thrown around at the convention, made her feel uncomfortable. Like some Republicans in Congress who have advanced balanced approaches to immigration, she hopes Trump is just blustering. “He’s not meaning to go and deport every family that crosses the border, he means deport the criminals and the sex offenders,” Peña said. But Trump and his advisers have other plans. He is putting immigration at the heart of his campaign to retake the White House and pushing the Republican Party towards a bellicose strategy that hearkens back to the 1950s when former President Dwight D. Eisenhower launched a deportation policy known by a racial slur — “Operation Wetback.” Trump, when pressed for specifics on his plan in an interview with Time Magazine this year, suggested he would use the National Guard, and possibly even the military, to target between 15 million and 20 million people — though the government estimated in 2022 there were 11 million migrants living in the U.S. without permanent legal permission. His plans have raised the stakes of this year’s election beyond fortifying the southern border, a longtime conservative priority, to the question of whether America should make a fundamental change in its approach to immigration. After the southern border saw a historic number of crossings during the Biden administration, Democrats have also moved rightward on the issue, often leading with promises of border security before talking about relief for the immigrants who are already in the country. And as the November election approaches, both parties are trying to reach voters like Peña, 33. Latino voters could be pivotal in many swing states. Trump won 35% of Hispanic voters in 2020, according to AP VoteCast, and support for stronger border enforcement measures has grown among Hispanic voters. But an AP analysis of two consecutive polls conducted in June by the AP-NORC Center for Public Affairs Research shows that about half of Hispanic Americans have a somewhat or very unfavorable view of Trump. Still, Peña, who described herself as a multiracial Hispanic person, has become a new and enthusiastic recruit for the GOP. She was drawn to Trump after seeing people debilitated by drugs in the public housing complex where she lives in Austin. She feels that government programs have failed low-income people and that the recent migration surge has put a pinch on public assistance like food stamps. But Peña said she also feels concern when her fellow Republicans discuss ideas like barring children who don’t have permanent legal status from public schooling. “Being Hispanic, it’s a difficult topic,” she said. “I feel like we need to give these people a chance.” Still, GOP lawmakers have largely embraced Trump’s plans. “It’s needed,” House Speaker Mike Johnson, R-La., said at a July interview at the conservative Hudson Institute. Some, however, have shown tacit skepticism by suggesting more modest goals. Sen. James Lankford, an Oklahoma Republican, pointed to over 1 million people who have already received a final order of removal from an immigration judge and said, “There’s a difference between those that are in the process right now and those that are finished with the process.” Lankford, who negotiated a bipartisan border package that Trump helped defeat earlier this year, added that it would be a “huge” task both logistically and financially just to target that group. Other Republicans, including Floridians Sen. Marco Rubio and Rep. Mario Diaz Balart, suggested Trump in the White House would prioritize migrants with criminal backgrounds. Indeed, Trump entered office in 2016 with similar promises of mass deportation but only succeeded in deporting about 1.5 million people. This time, though, there’s a plan. Trump has worked closely with Stephen Miller, a former top aide who is expected to take a senior role in the White House if Trump wins. Miller describes a Trump administration that will work with “utter determination” to accomplish two goals: “Seal the border. Deport all the illegals.” To accomplish that, Trump would revive travel bans from countries deemed undesirable, such as majority-Muslim countries. He would launch a sweeping operation by deputizing the National Guard to round up immigrants, hold them in massive camps and put them on deportation flights before they could make legal appeals. Beyond that, Trump has also pledged to end birthright citizenship — a 125-year-old right in the U.S. And several of his top advisers have laid out a sweeping policy vision through the Heritage Foundation’s Project 2025 that would choke off other forms of legal migration. The Trump administration, under those plans, could also grind to a halt temporary programs for over 1 million migrants, including recipients of the Deferred Action for Childhood Arrivals program, Ukrainians and Afghans who fled recent conflicts as well as others who receive temporary protection due to unrest in their home country. The policies would have far-reaching disruptions in major industries like housing and agriculture, including in key battleground states. “If the 75,000-plus immigrants who perform the hardest of work in Wisconsin’s dairy and agriculture were gone tomorrow, the state economy would tank,” said Jorge Franco, the CEO of the Hispanic Chamber of Commerce of Wisconsin. Rep. Maria Elvira Salazar, a Florida Republican who has pushed legislation that would allow a path to citizenship for longtime residents, argued that large-scale deportations were now necessary because of recent surges in border crossings under President Joe Biden. But she also hoped that Trump could see the difference between recent arrivals and longtime residents. “There is a group of congresspeople that will make sure that the new administration understands it because there’s another aspect: the business community,” she said. “The developers in construction … and the farmers, what are they going to say? They need hands.” Meanwhile, Democrats feel that Trump’s threats are now motivating Latino voters. “The mass deportation put a lot of people on high alert,” said María Teresa Kumar, the CEO of Voto Latino, a leading voter registration organization that is backing Democrat Kamala Harris. Like many other groups aligned with Harris, Voto Latino has seen an outpouring of interest since she rose to the top of the Democratic ticket. Kumar said the organization has registered nearly 36,000 voters in the weeks since Biden left the race — almost matching its tally from the first six months of the year. In a heavily Latino House district on the southern tip of Texas, Democratic Rep. Vicente Gonzalez said voters want to see better management of the border, but at the same time, many also have friends or family members who don’t have their immigration documentation in order. “Much more could be done, in terms of good policy, that would help control surges at the border,” Gonzalez said. “But mass deportation, it just gives people heartburn.” (Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — “Mass Deportation Now!” declared the signs at the Republican National Convention, giving a full embrace to&#160;Donald Trump’s pledge to expel&#160;millions of migrants...","url":"https://whdh.com/news/trump-is-putting-mass-deportations-at-the-heart-of-his-campaign-some-republicans-are-worried/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/07/image-17-3.jpg?quality=60&strip=color","video":null,"publish_date":"2024-08-10 21:48:30","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.14},{"id":253843848,"title":"Kamala Harris’ VP pick Tim Walz knows his way around farms, but his support in ag country continues to wane","text":"When Kamala Harris' VP pick Minnesota Gov. Tim Walz's name was mentioned onstage at Farmfest, the annual gathering of all things agriculture where Walz has perennially appeared over the years, boos rang out.","summary":"When Kamala Harris' VP pick Minnesota Gov. Tim Walz's name was mentioned onstage at Farmfest, the annual gathering of all things agriculture where Walz has perennially appeared over the years, boos rang out.","url":"https://www.bostonherald.com/2024/08/10/kamala-harris-vp-pick-tim-walz-knows-his-way-around-farms-but-his-support-in-ag-country-continues-to-wane/","image":"https://www.bostonherald.com/wp-content/uploads/2024/08/tim-walz.jpg?w=1024","video":null,"publish_date":"2024-08-10 21:43:56","author":"Star Tribune","authors":["Star Tribune"],"language":"en","source_country":"us","sentiment":-0.171},{"id":253842368,"title":"17-year-old saxophonist Ayo Brame from Oakland to perform at San Jose Jazz Summer Fest","text":"SAN JOSE, Calif. (KGO) -- The annual San Jose Jazz Summer Fest got underway Friday night in San Jose. It provides not only an economic boost, but a showcase for young musicians. Ayo Brame, 17, is a rising star in the jazz world. This weekend, the Oakland teen will hit the stage at the 34th annual San Jose Jazz Summer Fest. On Friday, he gave attendees a little show as they waited in line. \"I'm really just excited. I'm excited to share my music with the rest of the crowd,\" Brame said. On Monday, the saxophonist starts his senior year of high school and then takes off to headline a week-long show in Cuba. \"I mean it's cool being a trendsetter in a way specifically Oakland. I know there's a lot of different teens out there in the world, but specifically like Black teens there's not a lot of musicians picking up jazz and keeping it rolling within our community, so it's definitely cool to keep doing,\" Brame said. MORE: How a Palestinian Bay Area DJ is drawing attention to the crisis in Gaza through music The three-day festival branches out from Cesar Chavez Park. There are nine stages total, 5 that are outdoor and 4 indoor. We spoke with Executive Director Brendan Rawson. \"We have people from about 25 different states that travel to the festival each year,\" Rawson said. Rawson said last year, the San Jose Jazz Summer Fest brought in roughly 35,000 people. \"We generate about $17 million in economic impact in the city of San Jose with this event every year and we probably have 3,000 hotel rooms that are filled with guests for this, so the arts can be an important driver or economic driver for downtown,\" Rawson said. MORE: Beyoncé gives Kamala Harris permission to use her song 'Freedom' for presidential campaign Rawson said it's inspiring to have young talent coming through. \"With Ayo, he was featured as part of our Jazz Aid Fund commissioning project, we do grants every year to local musicians to create new work,\" Rawson said. We spoke with San Jose residents Toria Thomas and Marita Bolden, friends from college. San Jose Jazz Summer Fest is an event they make an effort to go to every year.","summary":"Rising Jazz Star: Oakland teen Ayo Brame hits the stage at San Jose Jazz Summer Fest. The 17-year-old saxophonist starts his senior year and then hits road to a headline a weeklong show in Cuba.","url":"https://abc7news.com/post/young-saxophonist-ayo-brame-oakland-perform-san-jose-jazz-summer-fest/15167598/","image":"https://cdn.abcotvs.com/dip/images/15170058_080924-kgo-san-jose-jazz-festival-Ayo-Brame-split-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/kgo/0810924-kgo-11p-san-jose-jazz-festival-vid.mp4","publish_date":"2024-08-10 21:42:08","author":"Lauren Martinez","authors":["Lauren Martinez"],"language":"en","source_country":"us","sentiment":0.278},{"id":253842716,"title":"Buttigieg blasts Trump for ‘lazy’ campaign attacks: ‘He’s lost a step’","text":"Transportation Secretary Pete Buttigieg wondered Friday if Republican presidential nominee Donald Trump’s heart was in the 2024 campaign anymore, calling his attacks on Democratic vice presidential candidate Tim Walz “pretty mushy and lazy.” Buttigieg, whose name was also speculated to be in the Democratic vice presidential conversation, appeared on CNN to discuss a range of topics, including Trump’s Thursday press conference at his Mar-a-Lago resort, which many critics described as “rambling.” The network played a clip of the former president’s remarks about Vice President Kamala Harris’s running mate. Harris “picked a radical left man that … has positions that … it’s just not even possible to believe that they exist,” Trump said. “He’s going for things that nobody’s ever even heard of, heavy into the transgender world, heavy into lots of different worlds.” The transportation secretary called that comment “another example of Trump’s inability to talk about what he is actually going to do to make anyone’s lives better.” “What Tim Walz focused on and focuses on as governor is just that,” Buttigieg said. “You look at the achievements in Minnesota, and you don’t have to be a Democrat or a progressive to be, I think, really impressed with what he’s done.” Buttigieg, a 2020 Democratic presidential candidate, listed examples of bills Walz signed during the 2023 Minnesota legislative session, including those that codified free school meals and paid family leave, and called the governor a “pretty commonsensical, middle-of-the-road Democrat.” “This is a playbook that is as unimaginative as it is unconvincing ‘cause this is what Republicans say about literally any Democrat running against literally any Republican,” Buttigieg said. “They always say that they’re too far left. It could be Joe Manchin running for president and they’d say he’s too far left, but it’s also pretty mushy and lazy for Donald Trump’s best attack to be, what was it, ‘He’s heavily into lots of different worlds’? You’d think he’d at least be able to point to a few more specifics.” The former mayor of South Bend, Indiana, said he gets the feeling that Trump’s “heart isn’t in this anymore,” to which CNN anchor Kaitlan Collins asked him if he thought the former president was a different candidate than he was during his past two bids for the White House. “Yeah, I mean you can just tell that he’s lost a step,” Buttigieg said. “He’s getting mushier, fuzzier, more confused,” referring to Trump’s claim that he “went down in a helicopter” with Willie Brown, which the former San Francisco mayor and ex-boyfriend of Vice President Kamala Harris rejected. “It does raise some real concerns about what’s happened to Donald Trump over the years, right?” Buttigieg said. “Is this a symptom of something, is he struggling to maintain a grip on reality or to tell the difference between dreams and what is real, or, best-case scenario, he’s just lying again.” Trump, 78, has come under more scrutiny over his mental acuity since President Joe Biden, 81, dropped out of the race after dealing with his own cognitive concerns. With Harris, 59, now the Democratic presidential nominee instead of her boss, the former president is the oldest major-party nominee. Harris and Trump have agreed to a Sept. 10 debate hosted by ABC News, which was originally scheduled with Biden as the Democratic participant. The June debate between the last two presidents catalyzed Biden’s exit from the race, and Trump appeared skeptical about going through with the agreement after Harris ascended to the top of the ticket. The former president committed to the original plan Thursday, additionally proposing one debate on either side of that date, to which Harris’s campaign has not agreed.","summary":"Transportation Secretary Pete Buttigieg wondered Friday if Republican presidential nominee Donald Trump’s heart was in the 2024 campaign anymore, calling his attacks on Democratic vice presidential candidate Tim Walz “pretty mushy and lazy.” Buttigieg, whose name was also speculated to be in the Democratic vice presidential conversation, appeared on CNN to discuss a range of [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3117667/buttigieg-blasts-trump-lazy-campaign-attacks/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/ap-pete-buttigieg-press-conference-073024.webp","video":null,"publish_date":"2024-08-10 21:41:00","author":"Robert Stewart","authors":["Robert Stewart"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.12},{"id":253842206,"title":"Celine Dion slams Trump campaign for ‘unauthorized usage’ of ‘Titanic’ song","text":"Canadian singer Celine Dion on Saturday bashed former President Donald Trump for using her song \"My Heart Will Go On\" at his Montana campaign rally without her permission or endorsement. \"In no way is this use authorized, and Celine Dion does not endorse this or any similar use,\" the singer's management team said in a statement, which she posted to her X account. \"...And really, THAT song?\" Dion's management team quipped, spurring mocking social media posts about the Trump campaign using music from a movie about a sinking ship. Dion's management and Sony Music Entertainment Canada Inc. became aware of the campaign's using the song on Saturday, according to the statement. The Trump campaign did not immediately respond to a request for comment. Trump used the song as an interlude at his rally in Bozeman, Montana on Friday where he repeatedly went after his Democratic opponent, Vice President Kamala Harris, who has been gaining on him in the polls. Harris has been using Beyoncé's song \"Freedom\" during her campaign rallies, which the pop star reportedly gave the vice president permission to use.","summary":"Celine Dion on Saturday bashed former President Donald Trump for using her song \"My Heart Will Go On\" without her permission.","url":"https://www.cnbc.com/2024/08/10/celine-dion-trump-rally-song-titanic.html","image":"https://image.cnbcfm.com/api/v1/image/102025431-Celine.jpg?v=1532564417","video":null,"publish_date":"2024-08-10 21:39:54","author":"Rebecca Picciotto","authors":["Rebecca Picciotto"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.001},{"id":253842728,"title":"Donald Trump’s campaign says its emails were hacked","text":"Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran’s involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.” Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States.” The National Security Council did not immediately respond to a request for comment Saturday by The Associated Press. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee.” “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want.” In response to Microsoft’s report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election. Cheung did not immediately respond to questions about the campaign’s interactions with Microsoft on the matter. Microsoft said Saturday it had no comment beyond its blog post and Friday report. In that report, Microsoft stated that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.” The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three U.S. election cycles. Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.” “Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris’ campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee’s cybersecurity protocols. Associated Press writers Mae Anderson in New York and Fatima Hussein in Rehoboth Beach, Delaware, contributed to this report.","summary":"Former President Donald Trump’s presidential campaign says it has been hacked and is blaming Iranian actors for stealing and distributing sensitive internal documents.","url":"https://www.centralmaine.com/2024/08/10/donald-trumps-campaign-says-its-emails-were-hacked/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2024/08/Election_2024_Trump_78703_a36803-1723326161.jpg?w=1000","video":null,"publish_date":"2024-08-10 21:38:43","author":"Bill Barrow,BILL BARROW - Associated Press","authors":["Bill Barrow","BILL BARROW - Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.439},{"id":253842010,"title":"Ex-Minnesota bar owner whose family-run business was torched in 2020 riots rips ‘criminal’ Gov. Tim Walz: ‘Complete loss of leadership’","text":"MINNEAPOLIS — A bar owner whose nearly century-old watering hole was torched by rioters during the 2020 George Floyd riots slammed Minnesota Gov. Tim Walz as a “criminal” who let the city descend into a lawless hellscape by refusing to immediately call in the National Guard. Bill Hupp, who owned the Hexagon Bar in the Seward neighborhood, roared that the fiery destruction of his family-run business rested on Walz’s shoulders. “It’s just complete neglect of the people you are supposed to represent,” the 74-year-old father of six said of Walz’s actions at the time. “He could have called [the guardsmen] in [but] he didn’t,” Hupp added. “I didn’t have a drop of water put on my place. Not a drop of water for those three and a half days! Crazy. It’s [a] complete loss of leadership, totally.” As mayhem coursed through the state’s largest capital, with rioters looting businesses and setting storefronts aflame, Walz, a 24-year National Guard veteran who took office the year before, waited an astonishing 18 hours after Minneapolis Mayor Jacob Frey pleaded for at least 600 guardsmen before finally sending in the troops. The frightening chaos had ripped through the Twin Cities after local police officer Derek Chauvin killed George Floyd on May 25, 2020. When Walz finally acted, on May 28, 2020, he sent just 100 guardsmen, according to a damning post-mortem from the state’s Senate and Minneapolis residents. Those that did arrive did little to control the damage ripping through the city — including the destruction of the Hexagon Bar. On May 28, 2020, Hupp said he, along with his son and a few of his son’s friends, had been boarding up the bar’s windows around 6:30 p.m. when roughly 300 people surrounded the venue. The rioters began throwing frozen water bottles and shoes at them, while refusing to let the group leave, and calling them “white privilege.” “We thought they were going to kill us. They pretty much kidnapped us,” he said, adding, “We didn’t know if we were going to get out of there.” The group eventually managed to make their way home, but in the early morning hours of May 29, 2020, the 92-year-old venue erupted in flames after an arsonist and his two accomplices chucked Molotov cocktails at the back of the building. “All of a sudden everything went bright white,” said Hupp, who saw the devastation on his surveillance camera. All that remained were the charred brick walls. “It completely burned my place exactly to the ground.” Walz’s leadership during one of the worst crises to roil Minneapolis in modern history has come under renewed scrutiny since Vice President Kamala tapped him as her running mate on the Democratic ticket this week. Beyond dragging his heels on sending in the National Guard, Walz also has been accused of sharing confidential information with his then-teenage daughter, including law enforcements’ plans and the troops’ response times. Hupp, who demanded an apology from Walz for the community, called Harris’ decision to pick him as her Vice Presidential candidate “absolute insanity,” and decried the state’s governor as “a criminal.” “It’s crazy,” he said. “Why? Because of [his] total ineptness of leadership…[his] absolute ignorance of safety for people and the way of handling it properly.” “He should have never been in the position he was in.” Walz’s office did not respond to a request for comment.","summary":"Bill Hupp, who owned the Hexagon Bar in the Seward neighborhood of Minneapolis, roared that the fiery destruction of his family-run business rested on Gov. Tim Walz's shoulders.","url":"https://nypost.com/2024/08/10/us-news/ex-minnesota-bar-owner-whose-family-run-business-was-torched-in-2020-riots-rips-inept-gov-tim-walz-complete-loss-of-leadership/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/photo-hexagon-bar-fire-night-87572515.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/1lgXysIS-RyIcpnTz.mp4","publish_date":"2024-08-10 21:34:37","author":"Matthew Sedacca,Steven Vago","authors":["Matthew Sedacca","Steven Vago"],"language":"en","source_country":"us","sentiment":-0.388},{"id":253842796,"title":"Celine Dion jabs Trump for playing ‘Titanic’ song at rally","text":"Celine Dion took a jab at Donald Trump on Saturday for using at an election rally the song she wrote and sang for the disaster movie “Titanic,” about the ocean liner’s sinking. The Republican presidential candidate has been lampooned on social media after playing the 1997 track “My Heart Will Go On” at a rally in the US state of Montana on Friday, as a video of Dion performing the song was shown on a big screen. Dion’s management team and her record label, Sony Music Entertainment Canada, said in a statement on X the use of the song and video was “in no way” authorized. “Celine Dion does not endorse this or any similar use… And really, THAT song?” it added. Users on social media have made analogies between Trump’s campaign and the sinking ship at the heart of the James Cameron film. Trump has appeared on the back foot since Kamala Harris replaced President Joe Biden in the US election race for the White House. The former president appeared on track to win back the White House before Biden dropped out of the race on July 21, but Harris has made big gains since replacing Biden at the top of the ticket and announcing Tim Walz, Minnesota’s governor, as her running mate. “My Heart Will Go On” was released on Dion’s album “Let’s Talk About Love” and the soundtrack to Cameron’s film “Titanic.” It became one of the biggest songs of all time, selling 18 million copies and earning Dion an Oscar, a Golden Globe and several Grammys. Dion, 56, was forced to cancel a string of shows in 2023 and 2024, saying she was not strong enough to tour after being diagnosed with an autoimmune disorder. But she delighted fans last month by singing from the Eiffel Tower at the opening of the Olympics in Paris. AFP","summary":"Celine Dion took a jab at Donald Trump on Saturday for using at an election rally the song she wrote and sang for the disaster movie &#8220;Titanic,&#8221; about the ocean liner&#8217;s sinking. The Republican presidential candidate has been lampooned on social media after playing the 1997 track &#8220;My Heart Will Go On&#8221; at a rally \n\n\n \n Read More","url":"https://punchng.com/celine-dion-jabs-trump-for-playing-titanic-song-at-rally/","image":"https://cdn.punchng.com/wp-content/uploads/2021/02/01101831/a3.jpg","video":null,"publish_date":"2024-08-10 21:30:47","author":"Makua Ubanagu","authors":["Makua Ubanagu"],"language":"en","source_country":"ng","sentiment":-0.058},{"id":253842538,"title":"Democrats Seek to Unseat Texas Senator Ted Cruz","text":"When Rep. Colin Allred (D-Texas) announced his candidacy in May 2023 to unseat Sen. Ted Cruz (R-Texas), Cruz was considered in some quarters to be the most vulnerable GOP Senate incumbent in the 2024 election. Now, 15 months later, amid the August heat and with the campaign about to enter the decisive post-Labor Day phase, Cruz is maintaining a consistent lead of five to seven points among surveys of Texas voters while Allred, the former NFL linebacker with the Tennessee Titans, has been unusually quiet. The race remains among the most watched because, with the Senate presently divided 51–49, Republicans need only gain a couple of seats to regain a majority. Twelve incumbent GOP senators—including Cruz—must face voters in November, and losing just one seat could make the difference for Republicans. The Dallas Democrat has been silent during a dramatic past month, in which President Joe Biden dropped his reelection effort following a lackluster debate performance against former President Donald Trump, who subsequently survived an assassination attempt, and Vice President Kamala Harris quickly got the top spot on the Democratic ticket. Democratic strategist Antjuan Seawright said that Allred is doing exactly what he should be at this stage of the campaign, contending that Republicans would make a serious mistake by getting over-confident. “A quiet campaign is a great campaign. I think you don’t want the national situation to define a Texas race,” Seawright told The Epoch Times. “Allred has, and he is building the right infrastructure, he is focusing with the right messaging, and I think he’s doing the smart thing of introducing himself to the voters, and in some cases re-introducing himself, so his opposition cannot define him by a certain position.” Asked about recent surveys showing Cruz with a significant lead, Seawright dismissed them as too early in the campaign. “This roller coaster ride that we’re all going to experience between now and November is going to change the race dramatically,” he said. Texas-based GOP campaign strategist and Must Read Texas founder Matt Mackowiak sees the contest as “close” but believes that “Cruz reflects the policy views of a majority of our voters, and in a presidential election year, that will be enough.” Mackowiak told The Epoch Times that “Cruz is taking the race deadly seriously, and he expects to be outspent two to one.” In the 2018 contest, Cruz did well across the vast reaches of rural Texas, but O'Rourke was strong in urban areas including Houston, Dallas, and San Antonio and came closer than expected in suburban precincts surrounding the big cities. Democrat strategists think the more moderate image projected by Allred could put him across the finish line in 2024. O'Rourke’s attempt to unseat Cruz was among the most well-funded statewide efforts ever by Texas Democrats. The last Democrat to win a statewide office in Texas was Lt. Gov. Bob Bullock in his 1994 reelection bid, and former President Jimmy Carter was the last national Democrat to carry the Lone Star State, in 1976. Rice University political science professor Mark Jones told The Epoch Times, that a statewide effort like Allred’s get-out-the-vote campaign was also mounted in 2018 and again in 2022 by O'Rourke, although the latter effort was not nearly as successful as the former. Democrats also see an advantage in Allred’s portrayal of himself as a moderate Democrat. That image has been bolstered via immigration issues, particularly a January House vote in which Allred was joined by two other Texas Democrats, Rep. Henry Cuellar and Rep. Vicente Gonzalez, in supporting a Republican resolution condemning Biden’s border policies. In assessing the comparative strengths and weaknesses of the two Senate candidates, Jones said that Cruz “doesn’t have 100 percent of the Trump voters locked down. There are still maybe one in 10 Trump voters who isn’t a Cruz voter right now.” By contrast, Jones said, “Allred would have gotten all of the Biden vote; now he'll get all of the Harris vote, whereas a non-trivial slice of the Trump vote is either undecided or going to Allred.” The Rice scholar was referring to Cruz’s being the last Republican presidential aspirant to drop out of the 2016 primaries and concede the GOP nomination to former President Donald Trump. The Texas senator has been a vocal Trump backer in the years since then. “Trump will defeat Harris by a bigger margin than Ted Cruz will beat Colin Allred, if he does,” Jones said. “Right now, we’re still not in a situation where I would predict that Allred will defeat Cruz, but I think he is better positioned to make it a much closer race than Kamala Harris is vis-a-vis Donald Trump.”","summary":"Republicans enter the 2024 Senate races needing to pick up two seats to regain control, but a loss in the Lone Star State could threaten their prospects.","url":"https://www.theepochtimes.com/us/democrats-seek-to-unseat-texas-senator-ted-cruz-5700657","image":"https://img.theepochtimes.com/assets/uploads/2024/08/10/id5703530-Ted-Cruz-Colin-Allred-300x180.jpg","video":null,"publish_date":"2024-08-10 21:24:30","author":"Mark Tapscott","authors":["Mark Tapscott"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.088},{"id":253846582,"title":"Donald Trump’s campaign says its emails were hacked","text":"Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran’s involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.” Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States.” The National Security Council did not immediately respond to a request for comment Saturday by The Associated Press. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee.” “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want.” In response to Microsoft’s report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election. Cheung did not immediately respond to questions about the campaign’s interactions with Microsoft on the matter. Microsoft said Saturday it had no comment beyond its blog post and Friday report. In that report, Microsoft stated that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.” The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three U.S. election cycles. Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.” “Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris’ campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee’s cybersecurity protocols. Associated Press writers Mae Anderson in New York and Fatima Hussein in Rehoboth Beach, Delaware, contributed to this report.","summary":"“Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded.","url":"https://www.stripes.com/theaters/us/2024-08-10/donald-trump-campaign-hacked-claims-14824400.html","image":"https://www.stripes.com/incoming/q2ff72-ap24216803178703.jpg/alternates/LANDSCAPE_480/AP24216803178703.jpg","video":null,"publish_date":"2024-08-10 21:23:11","author":"BILL BARROW","authors":["BILL BARROW"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.439},{"id":253842130,"title":"Celine Dion's team denounces use of \"My Heart Will Go On\" at Trump rally","text":"In a strongly worded statement on 11 August, Celine Dion's management team and record label, Sony Music Entertainment Canada Inc., condemned the unauthorized use of her iconic song My Heart Will Go On at a Donald Trump and J.D. Vance campaign rally in Montana. The statement, shared on Dion's official X (formerly Twitter) account, made it clear that the artist does not endorse the use of her music for political purposes, stating, \"In no way is this use authorized, and Celine Dion does not endorse this or any similar use.\" The incident adds Dion to a growing list of artists who have spoken out against the Trump campaign's use of their music without permission. As reported by The Hollywood Reporter, other notable musicians who have faced similar situations include Rihanna, Axl Rose, The Rolling Stones, and Neil Young, with the latter even taking legal action against the former president. The estates of Prince and Sinead O'Connor have also disavowed the use of their artists' songs at Trump events. What sets this particular case apart is the team's pointed comment about the choice of song itself. The statement concluded with a wry observation: \"…And really, THAT song?\" This sentiment was echoed across social media, with many pointing out the irony of using a song from a movie about one of history's most famous maritime disasters at a political rally. As noted by Deadline, even Democratic Presidential candidate Kamala Harris' team seized the opportunity to comment on the viral video of the performance. Interestingly, this is not the first time \"My Heart Will Go On\" has been featured at a Trump event. Deadline reports that the song was played at rallies in November 2020 and June 2021, as well as at the January 6, 2021 MAGA rally in Washington DC. Each instance has drawn attention and criticism, with commentators like Whoopi Goldberg on The View remarking on the \"magnificent\" irony of the song choice. As the 2024 campaign season heats up, it remains to be seen how candidates will navigate the choppy waters of music licensing and artist endorsements. (Sources: The Hollywood Reporter, Deadline)","summary":"","url":"https://tribune.net.ph/2024/08/10/celine-dions-team-denounces-use-of-my-heart-will-go-on-at-trump-rally","image":"https://media.assettype.com/tribune/2024-08-10/1ggcibcp/Celine Dion statement.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2024-08-10 21:21:46","author":"TDT","authors":["TDT"],"language":"en","source_country":"ph","sentiment":0.551},{"id":253841842,"title":"Two Russians Walk Into a Bar…","text":"To the Editor: Having blogged often about the Russian mafiocracy’s expert use of troll (or bot) farming techniques, I was surprised to happen upon an entry in the Gazette’s May 14 edition’s this-day-in-history section. Under the heading “Tuesday, May 21” for 2016 it noted that, “In Houston, hundreds rally to support Islam. Hundreds more rally, armed, to oppose it. All have been duped by a Russian troll farm.” A quick search revealed many accounts of the incident. How on Earth did I miss that? I thought I was on top of all the nefarious activities of the Russian trolls to get us to believe whatever they want us to believe! The Houston incident illustrates an important point about the modus operandi of Yevgeny Prigozhin’s successors in utterly forming and controlling the public debate about culture and politics in the West: they provoke both sides. There is no more left vs. right, liberal vs. conservative, Democrat vs. Republican. Replacing those dichotomies is the one invented by the (allegedy!) late Prigozhin and carried on by his heirs. It consists of two cults that were created using gobbelsology techniques to maximize the potential of civil war. Uncovering just one little snippet of evidence among thousands, recall that BP (before Prigozhin) the debate about abortion centered on questions such as “when does life begin” and “how do we quantify the level of threat to mother and fetus from different pregnancy anomalies?” The St. Petersburg team found in that debate exactly the kind of fodder that, with a little social media trolling and provocation, could be turned into a flaming war. Now of course one must be either vehemently “pro-life” or “pro-right-to-choose.” To say it’s a complex issue with no easy answers would be like a Connecticut resident saying “both the Sox and the Yankees have their plusses and minuses… .” Using the same playbook but this time just for sport, the pregozhia amused themselves by creating a flame war between those who are intimidated by science and those who are not. I imagined how that one was concocted in a Russian bar in this script for a very short play: “Yuri, that is half liter of vodka speaking. You are full of it.” “Evgeny, I tell you I can do it.” “OK, Yuri, let us make interesting. I bet you hundred thousand rubles, even money.” “Evgeny, you are on.” “Good. You shall see… Um… what was it again I am going to get them to believe? (You are right, I am drunk.)” “(sigh) You were going to get ten thousand Americans to believe world is flat.” “Da. That. I start tomorrow. Get ready to pay, Evgeny.” “Yuri. Please. Americans not that gullible. You get ready to pay.” Wes Kussmaul New Castle, N.H. Wes: We’re always happy to hear someone has found page eight of interest. While we have no doubt as to the Rooskies’ evil intentions towards us, or their history of using our social media addictions against us, we’d dispute your contention that Prigozhin and his successors have displaced our own native animosities. Read a few newspapers published during John Adams’ administration—those roots run deep! The Editor –=≈=– Focus on the Working Class To the editor; The past several weeks have produced a series of remarkable events in the runup to the 2024 presidential election. A cluster of court decisions virtually assured that Trump would not be prosecuted for crimes committed during his presidency before the November election. Then came the incomprehensible Supreme Court decision that granted him immunity from prosecution for a wide range of presidential actions which called into question whether Trump could be put on trial at all. Biden’s disastrous debate caused many to ask whether he could effectively complete another term. These events seemed to ensure that Trump was on a glidepath to reelection. Even the attempted assassination had the effect of making Trump an iconic hero to the far right. Prospects for the Democrats looked dim and a fractious debate among the Democratic elite regarding whether Joe Biden should remain the presidential candidate appeared to further jeopardize their election chances. Then, like a plotline from a B movie, Biden’s dramatic decision to withdraw from the election and his endorsement of Kamala Harris changed everything. Democrats were re-invigorated and Republican strategists were befuddled. Surprisingly, the presidential race was competitive once again. The Dems should be excited about the opportunity presented by the selection of Harris but should not be deceived that the current euphoria will guarantee her election. The U.S. electorate has polarized into two large, loyal blocs. MAGA Republicans comprise one bloc and Democratic Progressives the other. In a democracy, political factions should be motivated by the search for a common good and engage in respectful bargaining with those of different views. This norm has been discarded by both voting blocs, each seeking to impose their will on the other. Each bloc is united in sectarian solidarity that will ensure unwavering support for their Party’s candidate in 2024. Although the Progressive base is more fragmented than MAGA around various identity issues (especially Israel’s conduct of the war in Gaza), the selection of Harris is likely to solidify their support. The bottom line is that the nomination of Harris will motivate both bases but neither base is sufficient to elect a president in a national election. Reliable red states are likely to remain red and reliable blue states remain blue, leaving the election to be decided by independent or non-aligned voters from the battleground states. If Harris is to win, Democrats must devise a campaign that will attract independents. The independent voter is issue oriented. They vote on items that directly affect them or their families rather than on ideology or emotion. Independents also tend to be younger and more moderate than members of established parties, disliking the extremism of both parties. Recent polls indicate that the primary issue for this group is economic, especially inflations and its effect on their buying power. To win the independents, Democrats must devise a campaign strategy that demonstrates understanding of their issues and empathy for their plight as well as specifying how they will solve their problems (especially economic concerns). In the elation following the Harris nomination, some Progressives suggested that the campaign was now focused on race and gender. Identitarian ideology contributed to Hillary Clinton’s loss in 2016. A focus on these issues is not likely to bring Harris a victory in 2024. Working class voters are suffering. The independents in this group seek elected officials that will pay attention to their economic plight, not fight culture wars. Democrats should let Trump and Vance spew misogynistic and sexist comments and concentrate on how to raise up middle and working-class Americans. Robert D. Russell, Ph.D. Harrisburg, Pa. Robert: Would that the Clintons had done as you suggest…. The Editor –=≈=– Cui Bono? Dear Editor: NPR interviewed a former Democrat (man) who switched away from the party on the grounds of inflation, transgender school athletes, immigrants at our border with Mexico. He’s going to keep up his “Let’s Go Brandon” yard sign. Inflation—we may feel effects of COVID limiting supply lines for longer than we’d like. And when do businesses / corporations ask for less when they can command more? Trans students in school athletic games—allow a new “norm” to happen—these are games. When has musculature ever been evenly spread? Immigrants—around the planet war-persecution and climate-disasters create refugees. These families at our border are our Western hemisphere refugees. Kamala Harris made a strong statement of caring for the suffering of the Gazan people while Israel under Netanyahu decimates a population that is not military. Remember when Pres. George H.W. Bush had a brief war with Iraq, deliberately out in the desert because urban war (that his son later ran) would inhumanely destroy civilians and their lives, in Baghdad? That higher standard of behavior was disregarded by his son and is worlds better than Netanyahu’s so-low behavior now. Not that war is ever the “brightest-bulb” solution. War is cruelly best for munitions-makers’ profits. Lynn Rudmin Chong Sanbornton, N.H. Lynn: We blame that hotbed of rivalry, violence, and patriotism known as the Pentagon-Football complex. Why jack up naturally-occuring levels of tribalism? The better to divide and conquer. That time-honored method isn’t just for conquering neighbors. It’s probably most often used by rulers to control their subjects. American citizens, for example. What dividing line is most vulnerable? The color line. Again, maybe we’re just paranoid, but it seems to us that one reason for racism’s persistence is its usefulness to those at the top of the food chain. As Lyndon B. Johnson said, “If you can convince the lowest white man he’s better than the best colored man, he won’t notice you’re picking his pocket. Hell, give him somebody to look down on, and he’ll empty his pockets for you.” As for those munition-makers, you have to admit, they’ve got a perfect product. Talk about “planned obsolescence”—their products are designed to destroy themselves! The Editor –=≈=– It’s Who He Is Dear Editor: The most important and vital aspect of maintaining a democracy is the ability for citizens to vote in fair and open elections. In a frightening speech to Christians in Florida last week Donald Trump stated, “Get out and vote. Just this time. You won’t have to do it anymore… Get out, you’ve got to get out and vote. In four years, you don’t have to vote again, we’ll have it fixed so good you’re not going to have to vote.” Donald Trump is actually telling people that if you vote for him and he is reelected, voting will be eliminated in four years. He is going to “fix” the country so that we will have a dictator in charge and voting will just be an obsolete memory of our former democratic republic. These comments by Trump should alone disqualify him from being president. It is amazing to think that people would actually use their democratic right to vote to vote for a man who is telling them that this vote will be the last time they will need to vote. Imagine all those who fought and died to preserve and protect our precious right to vote having their sacrifices and service so grossly disparaged by a man who called them “losers and suckers” and took every means possible to avoid military service. Trump has already stated that he will be a dictator “on day one,” now he is telling us that after day one you will never need to vote again. As Maya Angelou said, “when someone tells you who they are, believe them.” Donald Trump has clearly told us who he is, and we better believe him. Rich DiPentima Portsmouth, N.H. Rich: It was bad enough the first time around, worrying about what would happen if a puffed-up con man somehow finagled his way into the Oval Office. That turned out worse than anyone could have imagined. Who had “Trump presides over the hanging of his own Vice President” on his Bingo card? Yet somehow here we are again—and it looks like it could be decided by a few thousand votes in a handful of states. The nation deserves a ruler across the knuckles from a mean schoolmarm. Call us vicious, call us cruel, but the Sweetheart of the Newsroom these days is the old, white-haired Scottish woman in a YouTube video who, interviewed on the day of Margaret Thatcher’s funeral, said, “I’d put a stake through her heart, and garlic ’round her neck, to make sure she never comes back.” The Editor –=≈=– Harris Terrifies Ewing To the Editor: Democrat [sic] Party elites rejected 14 million primary voters and themselves installed VP Kamala Harris as the Democrat Party Presidential Candidate. [We deleted the rest of Don’s letter, some 268 words, because, like the sentence above, it was all either untrue, or misleading. – The Ed.] Don Ewing Meredith, N.H. Don: You—a stalwart of the party whose members have been videotaped groveling before a gold-plated idol representing an ignorant, racist, bankrupt goon—have the gall to question the procedures of a political party the name of which you cannot properly spell? Right. Let’s move on. Why are Americans pissed about the economy? Because the corporations that back Republicans have jacked up their profits behind the screen of inflation, the better to afford yachts the size of naval destroyers. Your claims about crime are, as usual, utter BS. You’re lying about Harris’ proposals, which is to say, you’re running true to form. Your connection to reality is as tenuous as that of your gibbering champion. The Editor –=≈=– Let’s Take a Look At The Other Old Guy To the Editor: Biden did such a poor job at the June 27th debate that few remarked on Trump’s incredibly poor showing. Now that Biden is out of the race, it’s time to take a closer look. I watched the whole debate. OK, I’m a masochist. I do not remember Trump actually answering any questions that were posed. He deflected every question with an answer about the border! Numerous times the hosts pointed out that he hadn’t answered what they asked. He still couldn’t answer. Besides that, fact checkers indicated that he lied 30+ times. It really isn’t hard to prepare for a debate when you don’t answer the questions or just lie about everything! Now Trump has pulled out of the scheduled debate in September with the less-than-compelling excuse that “the Democrats don’t really know who their candidate will be.” Yes they do! It’s Harris. She already has more than enough convention delegates pledged to her to win. She has $ Millions pouring in and is on the campaign trail. Trump knows in a debate with Harris he can’t get away with simply deflecting and lying. After all, she is a prosecutor used to dealing with felons. The country needs to see this debate. Michael Frandzel Portsmouth, N.H. Michael: Hear hear. Republicans love to cite the Founding Fathers as role models. We’d love to see what George Washington might have to say about Trump running away from a black woman. The Editor –=≈=– Who Needs a Surrenderer-in-Chief? To the Editor: Donald has said multiple times he could end the war in Ukraine in a day. Why hasn’t he done so? How would he do it? Russia is clearly not going to surrender or withdraw. He must be planning to force Ukraine to give up all the territory Russia has taken. Just as Trump surrendered Afghanistan to the Taliban, he wants to surrender Ukraine to Russia. What will be next, surrendering Europe to Russia and Taiwan to China? This November do not put the Surrenderer-in-Chief in charge of this country. Walter Hamilton Portsmouth, N.H. Walter: You know what this country really needs? A former president surrendering to whoever Kamela Harris appoints to be Attorney General. The Editor –=≈=– Sanctioning Israel To the Editor: The UN may be gearing up to place sanctions on Israel, as the International Court of Justice (ICJ) has ruled that the Occupation is illegal (let alone deadly) and that Israel must exit Palestine, including Israeli settlements. How will the U.S.A. react to that? Meanwhile, China has brought the various Palestinian factions to the bargaining table so they now stand united. Can the U.S.A. handle a Free Palestine, free of Israeli and American interference? Or will we continue to support Israel’s caging of Palestinians behind checkpoints, in military prisons, and within closed borders as well as their daily massacres in Gaza? As the Pope stated during the Christmas blockade and bombings, Israel is the terrorist. And frankly, America is too for funding the illegal Occupation and Gaza genocide. Our behavior towards Palestine is not what the Founding Fathers had in mind when they declared all are created equal. By supporting Israeli aggression, we are straying dangerously away from our founding principles and George Washington’s admonishment to avoid foreign entanglements. Genevieve Harris-Fraser Orange, Mass. Genevieve: It’s shocking to think of the U.S. as a terrorist regime, and yet, if the combat boot fits… . The Editor –=≈=– Netanyahu’s Outrageous Hypocrisy Dear Editor, After the Hezbollah attack on the soccer field in Israel’s Golan Heights, Israel released a statement saying, “We will not tolerate harm to civilians.” (PBS, July 30, 2024) This is outrageous hypocrisy given the fact Netanyahu’s war policy in Gaza has been to drop dumb bombs on civilian buildings there. Israel lost 12 young civilians in that recent Golan attack, but Israel’s far-right government wants the world to overlook the 12,000 or more children whose lives have been sacrificed by Mr. Netanyahu in Gaza. Meanwhile, American politicians continue to spew out the knee-jerk slogan, “Israel has a right to defend itself.” No, silly people, Israel does not have the right to take over 20 civilian lives in Gaza as restitution for each and every Jewish civilian life taken on October 7th. This is not a tooth for a tooth, an eye for an eye, or a life for a life that Israel’s own Hebrew Bible says is the proportional restitution standard for evil. Is there a politician anywhere in Washington D.C. or in Tel Aviv who has an actual human conscience or respects the Bible today? Kimball Shinkoskey Woods Cross, Utah Kimball: We’re not particularly worried about what the Bible says. For example, we’d have no qualms about wearing a garment made of a mixture of linen and wool. It is clear, though, that Israel is acting in complete disregard to the laws of warfare, and brazenly lying about it every day. The Editor –=≈=– Don Old Grump, Champion Hypocrite Dear Editor, During the National Association of Black Journalists’ interview of The Former Guy, the criminal candidate’s complaining accusations against immigrants became wilder, weirder, and more exaggerated. We could see him making up more and more ominous lies as his hands played an invisible accordion. The fact that crime statistics for immigrants are far lower than for the general population didn’t retard his fire-hose of lies. But one fact should be repeated, over and over, until the public fully realizes how cynical and destructive the whining Grump’s mendacity is. A bi-partisan bill to allocate more resources to our borders—for both enforcement and for more judges to determine whose claims for asylum are valid—had passed the Senate and was scheduled to pass the House of Representatives. Then Don Old Grump told his Republicans to kill the bill because he didn’t want the problem solved while Biden was President. Bruce Joffe Piedmont, Calif. Bruce: At least Dolt #45 made puerile ad hominem attacks fun again. We’re stealing your “Don Old Grump.” The Editor –=≈=– Dear Compatriots… To the Editor: The events are coming fast and furious on the world stage… where to begin? Well, I will begin and end with one event: the attempted assassination of one of the U.S. presidential candidates in mid-July. This has led to a number of opinion pieces: was former President Trump truly shot, or grazed, or hit by bullet shrapnel? Is there no alternative to covering the wound in the world of modern bandagery besides a white pad stuck to the side of the head? Is the sight of convention attendees sporting their own versions of white ear bandages weird or heart-warming? How many seconds before the assassin aimed his weapon was that person spotted? Who was responsible for security at the rally? Motives?? Maybe ban outdoor rallies? Maybe ban roofs near rallies? As often happens, people in charge of security have been “hauled up” before the congressional committee to do some explaining. However, there’s little comment about the urgent necessity for people to purchase, own, and march around with long-range assault rifles. Because, you know, the Second Amendment. We are assured that even though the Founding Fathers had no knowledge of such weaponry, they definitely wanted such things to be freely and zealously marketed. It’s all perfectly normal business as usual, right? Alas, Beth McCarthy Tamworth N.H. Beth: Oh, it’s normal all right. Normal, though, is context-dependent. In Dodge City, Kansas and Tombstone, Arizona, back in the 1880s, normal meant handing over your six-shooters to the marshal upon entering town. Over the past century and a half, due to sophisticated lawyering, improved manufacturing techniques, and the evolution of capitalism, now every citizen is on his or her best behavior, because there is scarcely anyplace left in the country where you won’t be under the benign protection of some random fellow citizen packing heat. The Editor –=≈=– How to Solve Our Supreme Problem Sir or Madam, It dawned on me shortly after the former president had his way stacking the Supreme Court his way, as the radio announcer declared the Court was now a republican court. This wasn’t news; I’d learned many years ago how the three branches of government could be, indeed are, motivated, ruled, by the party majority of its members… . But the last time I checked, the Statue of Justice wore a blindfold, because justice is supposed to be blind, not republican or democrat. I feel it’s time for a change (and we’ll talk about the un-democratic Electoral College another time) and submit that the court should not be selected by the president, whatever party he or she is a member of. In fact, I even believe the court should be completely anonymous, unknown to us, and elected for a six- or eight-month session, by lottery (or other means), of perhaps graduate law students or other professionals. Their politics should be unknown. They should serve much as a Grand Jury serves, and be released at the end of their term, a new ‘jury’ selected for the next session. We have had trial and criminal cases of all kinds and types, including capital, forever, with those rulings being decided by ‘a jury of one’s peers.’ Yes, life or death issues, decided by common folks released from their service at trial’s end. Why would this not work at the Supreme level? Anthony Prizio Windham, Maine Anthony: The Supreme Court, as it is, presents problems so grave that we welcome any suggestions for its improvement. It’s not that we think anything in these pages is ever likely to effect any changes to that august body. It’s just that we’d like like to hear more discussion of this crucial problem, while it’s still legal for such discussions to be held. The Editor –=≈=– This Time We Can Believe Him To the Editor, Donald Trump’s message to Christians urging them to “vote for the last time,” thus announcing his intention, if elected, to eliminate elections and “reign” for life, was strange and unusual in more ways than one. Not only because no other American politician has ever made that proposal in the history of our democracy, but also because this consummate liar was for once telling the truth. We can believe him this time. A vote for the Republican candidate for the presidency of our democracy is a vote for autocracy—a system of government by one person with absolute power. Would you want Donald Trump (or any other person) to take away your freedom and have absolute power over your life? Cynthia Muse Rye, N.H. Cynthia: That’s a hard “No.” The Editor –=≈=– Recent Item of “Other Correspondence” A woman driving a pickup truck, while turning from Middle onto State Street at about 1:50 p.m. on Saturday, July 27th, volubly yelled the following question at our Wandering Photographer: “What the f___ is up with this? Elon Musk gets more sex than me.” We are unable to provide a definitive answer to this question. Our best guess is that it must be the money. – The Ed.","summary":"To the Editor: Having blogged often about the Russian mafiocracy’s expert use of troll (or bot) farming techniques, I was surprised to happen upon an entry in the Gazette’s May 14 edition’s this-day-in-history section. Under the heading “Tuesday, May 21” for 2016 it noted that, “In Houston, hundreds rally to support Islam. Hundreds more rally, armed, to oppose it. All have been duped by a Russian troll farm.” A quick search revealed many accounts of the incident. How on Earth did I miss that? I thought I was on top of all the nefarious activities of the Russian trolls to get us to believe whatever ... Read more","url":"https://www.nhgazette.com/2024/08/10/two-russians-walk-into-a-bar/","image":"https://www.nhgazette.com/wp-content/uploads/2020/06/nhgazette-social-fallback.jpg","video":null,"publish_date":"2024-08-10 21:16:48","author":"admin","authors":["admin"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.092},{"id":253842164,"title":"Donald Trump’s campaign says its emails were hacked","text":"Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran’s involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. campaign in 2024. It cited an instance of an Iranian military intelligence unit in June sending “a spear-phishing email to a high-ranking official of a presidential campaign from a compromised email account of a former senior advisor.” Trump campaign spokesperson Steven Cheung blamed the hack on “foreign sources hostile to the United States.” The National Security Council did not immediately respond to a request for comment Saturday by The Associated Press. Politico first reported Saturday on the hack. The outlet reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. “These documents were obtained illegally” and “intended to interfere with the 2024 election and sow chaos throughout our Democratic process,” Cheung said. He pointed to the Microsoft report issued Friday and its conclusions that “Iranian hackers broke into the account of a ‘high ranking official’ on the U.S. presidential campaign in June 2024, which coincides with the close timing of President Trump’s selection of a vice presidential nominee.” “The Iranians know that President Trump will stop their reign of terror just like he did in his first four years in the White House,” Cheung said, adding a warning that “any media or news outlet reprinting documents or internal communications are doing the bidding of America’s enemies and doing exactly what they want.” In response to Microsoft’s report, Iran’s United Nations mission denied it had plans to interfere or launch cyberattacks in the U.S. presidential election. Cheung did not immediately respond to questions about the campaign’s interactions with Microsoft on the matter. Microsoft did not immediately respond to a request for comment Saturday from the AP. Microsoft stated in its report Friday that “foreign malign influence concerning the 2024 US election started off slowly but has steadily picked up pace over the last six months due initially to Russian operations, but more recently from Iranian activity.” The analysis continued: “Iranian cyber-enabled influence operations have been a consistent feature of at least the last three U.S. election cycles. Iran’s operations have been notable and distinguishable from Russian campaigns for appearing later in the election season and employing cyberattacks more geared toward election conduct than swaying voters.” “Recent activity suggests the Iranian regime — along with the Kremlin — may be equally engaged in election 2024,” Microsoft concluded. Specifically, the report detailed that in June 2024, an Iranian military intelligence unit, Mint Sandstorm, sent a phishing email to an American presidential campaign via the compromised account of a former adviser. “The phishing email contained a fake forward with a hyperlink that directs traffic through an actor-controlled domain before redirecting to the listed domain,” the report states. Vice President Kamala Harris’ campaign did not immediately respond to a request for comment on the reported hacking or on the Democratic nominee’s cybersecurity protocols. ___ Associated Press writers Mae Anderson in New York and Fatima Hussein in Rehoboth Beach, Delaware, contributed to this report. Bill Barrow, The Associated Press","summary":"Former President Donald Trump’s presidential campaign said Saturday that it has been hacked and suggested Iranian actors were involved in stealing and distributing sensitive internal documents. The campaign provided no specific evidence of Iran&#8217;s involvement, but the claim comes a day after Microsoft issued a report detailing foreign agents’ attempts to interfere in the U.S. [&#8230;]","url":"https://toronto.citynews.ca/2024/08/10/donald-trumps-campaign-says-its-emails-were-hacked/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/7138238bdc10d612fcbada0090ec2e0df4fc52172c7476fc65fe937c1c3f6ff3.jpg","video":null,"publish_date":"2024-08-10 21:15:09","author":"Bill Barrow,News Staff","authors":["Bill Barrow","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.438},{"id":253841020,"title":"Celine Dion Denounces Donald Trump Rally Playing Her Song","text":"Following Donald Trump's campaign rally in Montana on Friday, French Canadian singer Celine Dion denounced it on Saturday for playing her award-winning song from the Titanic soundtrack, \"My Heart Will Go On.\"The former president's visit to Montana marks his first rally in a week that has seen the Democratic ticket of Vice President Kamala Harris and Minnesota Governor Tim Walz make multiple campaign stops in swing states amid this year's election. It also follows Trump's press conference that he held at his Mar-a-Lago estate in Florida.Videos of the song being played at the former president's rally on Friday have made its way across X, formerly Twitter.As supporters waited for Trump, the GOP's presidential nominee, to speak at the rally, the crowd can be seen listening to \"My Heart Will Go On,\" which brought Dion Grammy awards, an Oscar and a Golden Globe, as a video of her performing the song was displayed on a big screen above the stage.In a statement posted to X, Dion and her team acknowledged the use of her song at Trump's rally and denounced it.\"Today, Celine Dion's management team and her record label, Sony Music Entertainment Canada Inc., became aware of the unauthorized usage of the video, recording, musical performance, and likeness of Celine Dion singing \"My Heart Will Go On\" at a Donald Trump / JD Vance campaign rally in Montana. In no way is this use authorized, and Celine Dion does not endorse this or any similar use,\" Dion wrote.\"And really, THAT song?\"Newsweek has reached out to Trump's campaign via email for comment.The song, written by -composer James Horner, was created for the film adaptation Titanic, which follows the tragic love story of Jack and Rose on the Titanic, a British ocean liner that sank in 1912 as a result of striking an iceberg.The song became a classic in Dion's repertoire after the film's success when it was released in 1997.Dion previously spoke on what the song meant to her when she played the song at the Billboard Music Awards in 2017, marking the film's 20th anniversary.\"This song means a lot to me, and it has played such a huge role in my career,\" she said. \"I'm so grateful to the late James Horner, and to Will Jennings, for writing it and creating the opportunity for me to be part of Titanic, an amazing film whose legacy will continue for generations to come.\"This is not the first time artists have objected to their songs being played at Trump's rallies.In 2023, the disco group Village People sent Trump a cease-and-desist letter contesting a recent performance of one of their songs, \"Macho Man,\" at Mar-a-Lago. In the letter sent by band manager Karen Willis, the Village People alleged Trump \"allowed a group of individuals dressed as Village People\" to perform that song and others. Videos of the performance began spreading on social media, leading some to \"mistakenly believe\" that the group itself performed at the event, the letter said.Village People alleged the \"imitation performance\" violated U.S. trademark law and asked Trump's campaign to stop using the band's image moving forward. If the campaign did not oblige, the band said it would pursue legal action.Several other artists have also previously objected to Trump's use of their music including Neil Young, Adele, Rihanna and Elton John who asked Trump during his 2016 and 2020 presidential campaigns to stop playing their music at campaign events. Some objected because their political views opposed those held by Trump; others said their music simply had no place in American politics.However, Trump recently had a wave of public figures show their support for his reelection campaign during the Republican National Convention (RNC) last month. Model and rapper Amber Rose gave a passionate speech endorsing Trump on the first day of the convention, and singer and rapper Kid Rock performed his hit \"American Bad Ass\" before the former president gave his keynote address on the last day of the event.Since joining the Democratic race following President Joe Biden stepping down last month, Harris has continued to galvanize support including a featured performance by rapper Megan Thee Stallion at a rally in Georgia late last month.Megan Thee Stallion joins a host of musicians who have recently come out in support of Harris as she has also earned endorsements from several pop-culture stars, including British artist Charli XCX, whose latest album brat has become a branding tool for the vice president's campaign.","summary":"This is not the first time artists have objected to their songs being played at one of the former president's rallies.","url":"https://www.newsweek.com/celine-dion-denounces-donald-trump-rally-playing-song-1937468","image":"https://d.newsweek.com/en/full/2447418/celine-dion-donald-trump.jpg","video":null,"publish_date":"2024-08-10 21:11:02","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.504},{"id":253841838,"title":"Once More Unto the Breach","text":"by W.D. Ehrhart I have just returned from the most relaxing, refreshing, rejuvenating, restorative, happy, stress-free four days I’ve experienced in many years. Decades even. Maybe in my entire life. There are not enough superlatives to describe it. My wife and I had driven up to the Adirondacks to visit old college friends of mine. They live on top of a hill in the midst of 134 acres of forested land surrounded by mountains. You can’t see it from their porch, but there’s a beaver pond down below them in the valley. You can see the hummingbirds that come to their feeders. And the blue birds that come and go from the two box nests on poles in their yard. One morning, three adult female turkeys and four youngsters slowly ambled through the yard between the house and the garage. That evening, they were slowly grazing their way through the tall grass on the opposite side of the house. To reach the house, you turn off I-87 near Warrensburg, then work your way from one two-lane highway to another, each getting more narrow until you finally end up on an unpaved road going up a hill. And then you turn onto their even narrower lane for another mile or so to the top of the hill. You see the four large solar panel arrays about the same moment you see the house in the midst of a wild meadow. You don’t see the geothermal system that is buried beneath the meadow. You park next to the canoe under several trees that produce apples good for making pies. Our friends are not entirely “off the grid.” They do have electricity, though they use it sparingly. They drive an electric car, and have an electric utility vehicle. They use the utility vehicle to haul logs they get from the trees that fall in their forest, though most of the deadfall is left to rot because that’s good for the soil, the insects, and the whole environment. Did I mention that our friends have spent their entire lives and careers immersed in conservation, working in Africa for many years, and eventually working all over the world? The four of us spent one morning splitting and stacking wood for the winter of 2025-26. It will need to dry for a year, but the wood for this coming winter is already drying and stacked in the woodshed. I don’t know if I’ve ever engaged in that kind of activity before in my life, certainly not to that extent or to supply wood that will actually be used for real home heating. Our friends kept apologizing for putting us to work, but Anne and I were happy to contribute a little something in return for their hosting us, and the company and conversation were fun, and the exercise was really good for my 75-year-old body. Our friends are not total isolationists or fanatical ecologists. They both use laptop computers constantly for their work. And we watched Katy Ledecky on television winning a bronze medal in the 400 freestyle—not her strongest event—and the women’s and men’s 4×100 freestyle relays. Amy and Bill teach together every spring semester at a university. It’s not like they’ve withdrawn from civilization. But they do live an unusual life that is much farther off the beaten path than most of us live. During our entire visit, I saw exactly one airplane pass overhead, and it was just a tiny dot in the night sky so high up that you could hear nothing. Indeed, except for the sounds the four of us made, there was no noise at all: no car engines, no train whistles, no police sirens, no gas-powered leaf-blowers; just the wind in the trees, the rustling of leaves. And for me, the most amazing thing of all was no news. None. Nada. Zip. Though my wife brought her laptop (an instrument far too sophisticated for me with that damned finger mouse I’ve never mastered), I don’t know my e-mail password—I didn’t even know I have one; it comes up automatically on my ancient desktop machine—and therefor I had no access to my e-mail during the entire trip. I never touched the computer. Nor did we watch any television news, or listen to the radio, or see a daily newspaper. Not a word about Trumpelstiltskin or Hillbilly Vance or Uncle Joe or Kamala Harris (my daughter likes cats and she doesn’t have children, and I like my daughter, so I’ve got no problem with Harris). No news about Ukraine or Palestine or the U.S. Supremely Reactionary Court or the latest murder in Philadelphia. Talk about ignorance being bliss. Okay, I know I can’t keep up that wonderful level of detachment. In the long run, it’s not even desirable or good for me. Much as I dislike it, I have no choice except to engage with the world around me. Locally, I—we—need to fight to preserve the 500 old-growth trees at Oakwell. We Pennsylvanians need to help Senator Bob Casey defeat his super-rich Connecticut hedge-fund manager opponent. We Americans need to keep the White House out of the hands of the MAGAMonster. But those four days of near-total isolation in the Adirondacks were really, really wonderful while they lasted. I’m almost ready to dive back into the fray. –=≈=– W. D. Ehrhart is a retired Master Teacher of History & English, and author of a Vietnam War memoir trilogy published by McFarland.","summary":"by W.D. Ehrhart I have just returned from the most relaxing, refreshing, rejuvenating, restorative, happy, stress-free four days I’ve experienced in many years. Decades even. Maybe in my entire life. There are not enough superlatives to describe it. My wife and I had driven up to the Adirondacks to visit old college friends of mine. They live on top of a hill in the midst of 134 acres of forested land surrounded by mountains. You can’t see it from their porch, but there’s a beaver pond down below them in the valley. You can see the hummingbirds that come to their feeders. And the blue ... Read more","url":"https://www.nhgazette.com/2024/08/10/once-more-unto-the-breach/","image":"https://www.nhgazette.com/wp-content/uploads/2020/06/nhgazette-social-fallback.jpg","video":null,"publish_date":"2024-08-10 21:10:42","author":"W.D. Ehrhart","authors":["W.D. Ehrhart"],"language":"en","source_country":"US","sentiment":0.048},{"id":253840976,"title":"Empty Seats at Kamala Harris Rally Concealed by Black Curtains","text":"Last Updated on August 10, 2024 Black curtains were draped over empty sections of seats at the Kamala Harris-Tim Walz campaign rally outside Phoenix, Arizona, where Democrats say they attracted their biggest crowd yet. Related: Jon Voight Says America Must Stop Cackling Hyena War Criminal Kamala Harris The Harris campaign claims that the rally in Arizona is their biggest yet, with The New York Times reporting that it drew over 15,000 people. For comparison, the Trump campaign has routinely pulled audiences well into the tens of thousands at campaign rallies and attracted over 100,000 supporters in Wildwood, New Jersey earlier this year. Related: Tim Walz Replaced MN State Flag with Somali Symbolism In a post he made to Truth Social the day before the Arizona rally, President Trump slammed the media’s crowd size coverage and accused Harris of paying for her ‘crowd.’ In previous election cycles, Democrats have been caught red-handed paying Craigslist users at an hourly rate to show up to campaign rallies and pretend to be enthusiastic. Thus far in 2024, the Harris campaign has relied on musical and dance performances by celebrities to attract supporters. Related: Trump Continues To Hilariously Troll Kamala’s Portrayal of Herself As An African-American","summary":"Internewscast Journal\n\nInternewscast\n\n\nLast Updated on August 10, 2024 Black curtains were draped over empty&#8230;\n\n\nThis Post: Empty Seats at Kamala Harris Rally Concealed by Black Curtains first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/empty-seats-at-kamala-harris-rally-concealed-by-black-curtains/","image":"https://nationalfile.com/wp-content/uploads/2024/08/emptyseats-505x600.jpg","video":null,"publish_date":"2024-08-10 21:09:04","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.045},{"id":253840798,"title":"Kamala Harris Now Leads Donald Trump in Six Different Polling Averages","text":"As of Saturday, Vice President Kamala Harris is leading former President Donald Trump in six national aggregate polls for the extremely tight 2024 U.S. presidential election.Harris joined the campaign trail after President Joe Biden's unprecedented exit from the race on July 21 and has since garnered widespread support from the Democratic party. As of Saturday, six national aggregate polls place her in the lead in presidential polls, with margins ranging from .5 to 2.5 percentage points.Aggregate polls are consistently updated as new polling data is added, shifting the averages in real time.The following percentages are as of Saturday afternoon.RealClearPolitics shows Harris ahead by the smallest margin of the six polls, placing her .5 percentage points ahead of Trump—47.6 percent to 47.1 percent.With a margin of 1 percentage point, The New York Times aggregate poll shows Harris at 48 percent and Trump at 47 percent. When independent candidate Robert F. Kennedy Jr. is factored in, the gap between the Democratic and Republican candidates widens to 2 percentage points, with Harris at 45 percent, Trump at 43 percent, and Kennedy at 5 percent.Race to the WH's aggregate shows Harris leading by 1.6 percentage points, 48.3 percent to Trump's 46.7 percent. In a race with third-party candidates, both Democratic and Republican candidates lose votes, with Harris garnering 45.7 percent, Trump 43.5 percent, Kennedy 5.4 percent, and Cornel West at .5 percent.FiveThirtyEight puts Harris ahead by 2 percentage points, 45.6 percent to Trump's 43.5 percent, with Kennedy garnering 5.1 percent of the vote. Similarly, 270toWin also shows a 2-percentage point margin, showing Harris garnering 47.5 percent of the vote and Trump 45.5 percent.Statistician Nate Silver's Silver Bulletin aggregate poll shows the greatest margin for Harris, with a 2.5 percentage point lead at 46.5 percent to Trump's 44 percent.However, The Hill shows Harris trailing Trump by .2 percentage points, 47.2 percent to 47.4 percent.All of the aggregate polls reveal a close presidential election where candidates are constantly inching up or down within the margin of error based on new poll inclusions.Even though the aggregate polls take the temperature of voters nationwide, the presidential election is determined by individual states and Electoral College votes. Candidates must secure 270 electoral votes to win the presidency, which is not always accurately reflected by the nationwide popular vote, as state-specific victories are necessary to secure electoral votes.Polls from battleground states, which are crucial for securing key electoral votes, reveal a closely contested race between Trump and Harris, with Harris outperforming Biden's previous numbers in most cases.In Wisconsin—a state with 10 Electoral College votes—Harris is leading, with The Hill's state aggregate showing her ahead at 48.9 percent to Trump's 47.4 percent, while FiveThirtyEight puts her at 46.7 percent compared to Trump's 44.4 percent.Meanwhile, The Hill puts Trump ahead by 1 percentage point in Pennsylvania, which has 19 Electoral College votes, with 48 percent to Harris' 47 percent. As of Saturday, The New York Times puts the two candidates in a complete deadlock in the state, both with 48 percent, as of yesterday it had Trump ahead by 2 percentage points.Newsweek reached out to Trump and Harris' campaign for comment via email on Saturday.","summary":"The aggregate polls reveal a close presidential election where Trump and Harris are inching up or down within the margin of error.","url":"https://www.newsweek.com/kamala-harris-now-leads-donald-trump-six-national-poll-averages-1937465","image":"https://d.newsweek.com/en/full/2447408/kamala-harris-donald-trump.png","video":null,"publish_date":"2024-08-10 21:06:55","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.07},{"id":253840792,"title":"Celine Dion Criticizes Donald Trump for Playing Her Song Without Permission at Montana Rally","text":"Celine Dion has mocked Donald Trump for playing the Titanic theme song at a campaign rally without her permission. Her voice could be heard wailing the 1998 classic ‘My Heart Will Go On’ over the speakers in Bozeman, Montana, shortly before Trump took the stage on Friday. Dion on Saturday made it clear that the use of ‘video, recording, musical performance, and likeness of Celine Dion’ was unauthorized. ‘In no way is this use authorized, and Celine Dion does not endorse this or any similar use,’ she said in a statement along with her record label, Sony. Dion then mocked Trump’s choice, adding, ‘…And really, THAT song?’ The epic ballad that conjures images of a doomed ship striking a massive iceberg, which is not the best comparison to a presidential campaign. Even worse, it was played just hours after Trump’s plane was forced to divert to Billings while en route to Bozeman over a ‘mechanical issue.’ Some political pundits on social media felt the song was a metaphor for the Trump campaign’s flagging momentum, which comes just weeks after a victory in November felt all but assured. One even suggested there could be a ‘pro-Kamala Harris’ mole secretly working to undermine Trump’s re-election. One person said: ‘Omg, Trump’s rally in Montana is showing a video of Celine singing “My Heart Will Go On” from the film Titanic. Is the rally coordinator trolling Trump?’ ‘Seems to me it’s a cry for help from a sinking ship. Has anyone checked on his campaign managers, are they being held hostage or maybe water boarded,’ said another. Many people noted the irony in the theme song for a movie about a disaster being played at the event. ‘Trump is saying he is going down like the Titanic,’ said one person. ‘The irony is not lost,’ said another. ‘How fitting because the Trump campaign right now is just like the titanic. Everyone’s in the bar drinking telling themselves the ship is not sinking,’ a third person said. One person created a meme movie poster recreating a scene from James Cameron’s 1997 film with Trump and Vance captioned, ‘Collide with failure. This November.’ ‘Bro, the Trump campaign keeps giving. These are real life SNL skits. Who the f**k plays a song famously associated with a sinking ship at a rally for a campaign that is sinking,’ a person said. ‘Is the Titanic metaphor a little on the nose, or what,’ another said. Others questioned if the Canadian singer gave Trump’s team permission to play her song.’ ‘Celine seems like a truly kind and compassionate legend, but you know she’s on the couch at home saying, “Yeah, f**k no!” in French,’ one person said. ‘He can’t have Celine Dion, sorry,’ a second person said. ‘Celine Dion, are you getting paid for this? You might want to call your lawyer. There’s a payday waiting for you right here,’ another said. Celine’s statement comes amid a tough day for the Trump campaign. A new poll by The New York Times released by the outlet on Saturday suggests that Harris has now moved ahead of Trump by four points in Michigan, Pennsylvania and Wisconsin – all vital battle ground states. Then hours later, the Trump campaign revealed it had been hacked, suggesting that they were targeted by Iran. The campaign blamed ‘foreign sources hostile to the United States’ and cited a Microsoft report on Friday that Iranian hackers attempted to hack a high-ranking official of a presidential campaign. Trump has also spent part of the week fending off criticism of a story where he claimed to have almost been in a helicopter crash with former San Francisco Mayor Willie Brown. On Friday night, he was accused of mixing Brown up with another black lawmaker, former California State Senator Nate Holden. Holden told Politico he and Trump were almost in a chopper smash in 1990 and said: ‘Willie is the short Black guy living in San Francisco. I’m a tall Black guy living in Los Angeles.’ Laughing at the story, he jokingly added: ‘I guess we all look alike.’ Before the singer’s response, Dion and her late husband, René Angélil, frequently dined at Trump’s Mar-a-Lago in the 1990s. She was a fan of the French chef Bernard Goupy, especially his signature Caesar salad that was built in an edible cheese bowl. But one day, Trump decided he wasn’t making a proper Caesar salad, tossing the salad himself and firing Goupy. However, Celine quickly snapped Goupy up to be her chef at her Jupiter, Florida, estate.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCeline Dion has mocked Donald Trump for playing the Titanic theme song&#8230;\n\n\nThis Post: Celine Dion Criticizes Donald Trump for Playing Her Song Without Permission at Montana Rally first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/celine-dion-criticizes-donald-trump-for-playing-her-song-without-permission-at-montana-rally/","image":"https://i.dailymail.co.uk/1s/2024/08/10/06/88376133-13729961-image-a-71_1723266359636.jpg","video":null,"publish_date":"2024-08-10 21:00:52","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.047},{"id":253846560,"title":"The United States of Aunties: The culture powering the Harris campaign","text":"by Shefali Luthra for The 19th For Hillary Clinton’s 2016 campaign, it was “grandmother” — the label she frequently turned to when defining herself to voters, attempting to show them who she was apart from her work in politics. For Kamala Harris, it might be “auntie.” Harris’s presidential nomination has made history several times over. She is the second woman, the first Black woman and the first South Asian woman ever nominated for president by a major party. Now, as she pushes to break the nation’s highest glass ceiling, women — and especially Black and South Asian women, who already lean Democratic — have mobilized, donating to her campaign in record-breaking numbers, including the $1.6 million raised by Win With Black Women only hours after Harris declared her candidacy. For those who, like Harris, claim the label of “auntie” — a term rich with meaning, particularly in the South Asian and Black communities in which Harris grew up — the moment is particularly resonant. “Auntie” is an honorific with a flexible definition, a word that’s used to define not just blood relatives, but older women in the community who help shoulder caregiving responsibilities, in a role that’s a lot like that of a surrogate or extra parent. Harris claims that identity proudly in her social media bios, calling herself “Wife, Momala, Auntie.” Friends and family have been known to use the “auntie” label in addressing her. References to aunties — including “Auntie Kamala” herself — pepper Harris’ 2019 memoir, “The Truths We Hold.” “In cultures where it’s not just the nuclear family, but more an extended family or even neighborhood kinds of community relationships, aunts play a really important role,” said Patricia Sotiriin, a professor emerita at Michigan Technological University, who has written several books on the role of aunts in America. “In terms of the vice president, it’s a really interesting identity to claim. When you claim the role of auntie, it’s a very empowered role.” An “auntie” has a role less defined than a mother, Sotirilin noted. An auntie can have a career, be childless, be the keeper of family lore — or none of the above. But critically, she said, “aunts are makers of community. They hold the bonds of community together.” Now Harris, in claiming that identity, is energizing voters who do the same. Padma Lakshmi, the Indian-American writer and model, posted a photo to Instagram of herself with Harris soon after the vice president announced her campaign, using the hashtag “#auntiepower.” In a Zoom call targeted at South Asian women, Mini Timmaraju, president of the advocacy group Reproductive Freedom for All, characterized Harris’ laugh — one her opponent Donald Trump has singled out in his efforts to criticize her — as “an auntie’s laugh.” In the same call, Pramila Jayapal, the first South Asian American woman elected to the House of Representatives, said she had received repeated texts from her own aunties about Harris’ ascent. “She is many things to many people,” Timmaraju, who, like Harris, is of South Indian descent, told The 19th. “She’s the first Gen X, she’s the first multiracial, she’s the first Black woman, she’s the first person of South Asian descent. Kamala Harris throughout her career has embodied these different entities.” The term “auntie” is, to be sure, a complex label, in part because of the widespread cultural stigma against older women. Republican vice presidential candidate JD Vance attempted to weaponize this stigma when he mocked “childless cat ladies,” directing the barb at Harris and other Democratic party leaders. His point was that people without biological children don’t have a “direct stake” in the nation’s future. (Harris has two stepchildren and has talked about helping raise her niece.) Oprah Winfrey and Ava DuVernay have both expressed their distaste for being addressed as aunties. Harris has also had her moments of reticence: In a 2019 video, she instructed actress and writer Mindy Kaling, who is 14 years younger, not to call her “auntie.” “I think of [Harris] as a big cousin, because I refuse to say that we are aunties at this point,” said Melissa Murray, a legal scholar at New York University who is a Black Gen X woman. (Harris was born after the end of the baby boom but during the baby boomer years, so she probably misses Gen X, but just barely.) Still, numerous women who identify as aunties — particularly South Asian American and Black women — said they are newly energized by Harris’ ascent. She feels like one of their own, many said, someone who will listen to and understand their concerns. “There’s a different kind of euphoria,” said Deepali Gulati, 59, who lives just outside of Boston and works at a support organization for South Asian and Arab survivors of domestic violence and sexual assault. “I had stopped watching the news because it’s the same thing over and over again. I’m interested now.” When Ardeana Scott-Yon, a P.E. teacher and athletic department administrator, attended a recent Harris rally in Atlanta, she brought her 6-year-old niece with her. “I want my baby to see this,” said Scott-Yon, who is Black. She hoped that letting her see the vice president speak would teach her “that she’s able to do whatever she wants to do. Nothing is off limits.” The latest polling shows the election remains a virtual coin-flip; Black women and South Asian women both were already more likely to vote for Democrats, even without Harris on the ticket. Women across all racial groups, but especially Black women, are more likely to say they prioritize protecting abortion and reproductive rights, an issue Harris has emphasized in her campaign. Some self-described “aunties,” like Sarbani Hazra, a 41-year-old woman of Bengali origin from Philadelphia, had already planned to campaign for Democrats. But watching Harris’ candidacy, she said, has encouraged her to do more: She’s considering applying for jobs with the campaign, or even running for local office herself. Then there are women like Iram Khan, 44, a first-time voter who recently moved from California to Raleigh, North Carolina, where she will be casting her ballot. Because California is solidly Democratic, Khan didn’t feel as if voting there would carry a lot of weight. That’s not the case in North Carolina, a battleground state. She planned to vote for President Joe Biden, though half-heartedly. “I would have had to drag myself to the polls,” she said. But when Khan, who is of Pakistani descent, learned that Biden would not run for a second term and that Harris would take his place in the race, her stance changed. Within 24 hours, she said, she went from fearing that voters would not support Harris to being excited in ways she hadn’t felt since former President Barack Obama’s first campaign. Khan is already trying to get more involved by sharing voting resources on social media to help mobilize other Asian American voters in her state, especially those who are also South Asian. To her, it’s moving to see a woman close to her age and background be touted as possibly presidential. “For Kamala, if she’s the president? I have two daughters. They’ll be looking at that, saying, ‘The president looks like me.’” Jennifer Gerson contributed to this report.","summary":"by&nbsp;Shefali Luthra for&nbsp;The 19th\n\n\n\n\n\n\n\nFor Hillary Clinton’s 2016 campaign, it was “grandmother” — the label she frequently turned to when defining herself to voters, attempting to show them who she was apart from her work in politics.\n\n\n\nFor Kamala Harris, it might be “auntie.”\n\n\n\nHarris’s presidential nomination has made history several times over. She is the second woman, &nbsp;the first Black woman and the first South Asian woman ever nominated for president by a major party. Now, as she pushes to break the nation’s highest glass ceiling, women — and especially Black and South Asian women, who already lean Democratic — have mobilized, donating to her campaign in record-breaking numbers, including the $1.6 million raised by Win With Black Women only hours after Harris declared her candidacy.\n\n\n\nFor those who, like Harris, claim the label of “auntie” — a term rich with meaning, particularly in the South Asian and Black communities in which Harris grew up — the moment is particularly resonant. “Aunt","url":"https://www.dailykos.com/story/2024/8/10/2261636/-The-United-States-of-Aunties-The-culture-powering-the-Harris-campaign?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1331764/story_image/GettyImages-2165793993.jpg?1723131505","video":null,"publish_date":"2024-08-10 21:00:02","author":"Jennifer Gerson,The19th","authors":["Jennifer Gerson","The19th"],"language":"en","source_country":"US","sentiment":0.432},{"id":253846580,"title":"Walz ‘misspoke’ in 2018 reference to ‘weapons of war, that I carried in war,’ Harris campaign says","text":"PHOENIX — Minnesota Gov. Tim Walz, the Democratic candidate for vice president, “misspoke” in a 2018 video about “weapons of war that I carried in war,” a Harris-Walz campaign spokesperson said Saturday. Republicans, including the vice presidential nominee, Ohio Sen. JD Vance, began questioning Walz’s military record after Vice President Kamala Harris, the Democratic candidate for president, named the governor as her running mate on Tuesday. Some of the criticism centers on comments by Walz in a 2018 video circulated on social media by the Harris campaign in which he speaks out against gun violence and says, “We can make sure that those weapons of war, that I carried in war, is the only place where those weapons are at.” The comment suggests that Walz portrayed himself as someone who spent time in a combat zone. Walz served 24 years in various Army National Guard units but he was never in a combat zone. Lauren Hitt, a spokesperson for the Harris-Walz campaign, said Saturday in a statement that Walz misspoke in the 2018 video. “Governor Walz would never insult or undermine any American’s service to this country — in fact, he thanks Senator Vance for putting his life on the line for our country. It’s the American way,” Hitt said. “In making the case for why weapons of war should never be on our streets or in our classrooms, the Governor misspoke,” Hitt added. “He did handle weapons of war and believes strongly that only military members trained to carry those deadly weapons should have access to them, unlike Donald Trump and JD Vance who prioritize the gun lobby over our children.” Vance enlisted in the Marine Corps after graduating high school, serving four years as a combat correspondent, similar to a military journalist, and deploying to Iraq in that capacity in 2005.","summary":"“Governor Walz would never insult or undermine any American’s service to this country — in fact, he thanks Senator Vance for putting his life on the line for our country. It’s the American way,” Hitt said.","url":"https://www.stripes.com/theaters/us/2024-08-10/walz-video-misspoke-harris-campaign-14823997.html","image":"https://www.stripes.com/incoming/o8kcj9-ap24221532399830.jpg/alternates/LANDSCAPE_480/AP24221532399830.jpg","video":null,"publish_date":"2024-08-10 20:55:18","author":"Darlene Superville","authors":["Darlene Superville"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.05}]}