{"offset":0,"number":50,"available":229,"news":[{"id":383744234,"title":"Trump Responds to Democrats&#039; Demands to Release MRI","text":"President Donald Trump said Sunday he would release the results of an MRI test he received in October, responding to mounting demands from Democrats for transparency about his health. \n\nThe president made the announcement while traveling back to Washington from Florida, telling reporters the test results were “perfect.” Trump also stated he has no knowledge of which body part was examined, saying it was not his brain because he took and passed a cognitive test. \n\nNewsweek previously reached out to the White House outside via email on Sunday for comment.\n\nWhy It Matters\n\nThere has been increased scrutiny around the health of Trump in recent months. He was diagnosed with chronic venous insufficiency, a condition that is common in older adults, in July. There have been instances of bruises being visible on the president’s hands, which have in turn sparked concern and questions over his health.\n\nTrump confirmed that he had received an MRI at Walter Reed National Military Medical Center in October as part of what the White House described as a routine physical. However, Trump told reporters he had “no idea what they analyzed.”\n\nAt 78 years old, Trump was the oldest man to assume the office of president, followed by Joe Biden. He turned 79 in June, and speculation about his health continues, particularly as this issue led to Biden’s exit from the race for president in 2024.\n\nThe President is unwell. Release the MRI results. pic.twitter.com/Kw9RGEjLmL— Tim Walz (@Tim_Walz) November 30, 2025\n\nWhat To Know\n\nDemocratic calls for the MRI results intensified after Minnesota Governor Tim Walz posted on X demanding their release, a message that garnered 8 million views. \n\nThe Minnesota governor, who served as Vice President Kamala Harris‘ running mate in 2024, amplified his concerns during a Sunday appearance on NBC’s Meet the Press, questioning whether anyone has ever received an MRI without knowing its purpose. The demands followed a late-night post from Trump criticizing immigration policy and using inflammatory language against Walz and Somali American Democratic Minnesota Representative Ilhan Omar. \n\nOther democratic figures including CNN commentator Adam Kinzinger, political influencer Harry Sisson, and the Democratic Governors Association have also joined the chorus calling for disclosure. \n\nWhite House Press Secretary Karoline Leavitt previously stated Trump remains in “exceptional physical health” based on the imaging results. In August, Vice President JD Vance spoke about Trump’s health, telling USA Today, “I feel very confident the president of the United States is in good shape, is going to serve out the remainder of his term and do great things for the American people.”\n\nPresident Donald Trump speaks with reporters while in flight on Air Force One from his Mar-a-Lago estate in Palm Beach, Fla., to Joint Base Andrews, Sunday, Nov. 30, 2025. (AP Photo/Alex Brandon)\n\nWhat People Are Sying \n\nPresident Donald Trump, in response to reporters Sunday: “If you want to have it released, I’ll release it. What part of the body? It wasn’t the brain because I took a cognitive test and I aced it.”\n\nAdam Kinzinger, a commentator for CNN, in a post on X: “Release the MRI results.”\n\nPresident Trump previously responded to rumors about his health, writing: “NEVER FELT BETTER IN MY LIFE.”\n\nMinnesota Governor Tim Walz said during an appearance on NBC News’ Meet the Press on Sunday: “Here we got a guy on Thanksgiving where we spent time with our families, we ate, we played Yahtzee, we cheered for football or whatever. This guy is, apparently, in a room ranting about everything else. This is not normal behavior. It is not healthy. And presidents throughout time have released a couple things. They’ve released their tax returns, not Donald Trump, and they’ve released their medical records, not Donald Trump….The president’s fading physically, I think the mental capacity, again, ranting, you know, crazily at midnight on Thanksgiving about everything else. There are reasons for us to be concerned. This is a guy that randomly says the airspace over Venezuela is closed. He’s ruminating on if you could win a nuclear war. Look, this is a serious position. It’s the most powerful position in the world, and we have someone at midnight throwing around slurs that demonize our children. And at the same time, he’s not solving any of the problems. I’m deeply concerned that he is incapable of doing the job.”\n\nWhat Happens Next?\n\nThe White House has yet to provide a timeline for the release of the MRI results. \n\nReporting from the Associated Press contributed to this article.","summary":"President Donald Trump offers to release October MRI results amid Democratic demands.","url":"https://www.newsweek.com/trump-responds-to-democrats-demands-to-release-mri-11132809","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/AP25334809405658.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-12-01 01:08:15","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"politics","source_country":"US","sentiment":-0.068},{"id":383738472,"title":"How a French \"whale\" made over $80M on Polymarket","text":"This week, 60 Minutes correspondent Anderson Cooper reported on Polymarket, a prediction market where users can bet against each other on the outcome of future events like football games, political elections, or even celebrity pregnancy announcements.The Polymarket website features up to 15 categories of markets that users can bet on. The markets are often presented as questions, like \"#1 Searched Actor on Google this year?\" or \"Xi Jinping out before 2027?\" Bettors can bet \"Yes\" or \"No\" on an outcome. The betting odds – or predictions – are prominently displayed next to each question, and also presented below on a graph, showing how the odds change over time. Rules for each market are spelled out too. Polymarket bettors can potentially win — or lose — serious money by betting on political elections around the world, one of the biggest draws of the platform. In 2024, the presidential race between then-Vice President Kamala Harris and President Trump attracted a \"whale,\" or a high-stakes bettor.An anonymous man living in France placed substantial bets on Polymarket in early October 2024 that Mr. Trump would win the election. Most pollsters thought the race was too close to call.\"Everyone said, 'He's an idiot and he doesn't know what he's talking about,' people thought he just liked Trump… and he actually commissioned a ton of private polls,\" Polymarket CEO Shayne Coplan explained to Cooper. Send a secure tip to 60 Minutes: Here's how to confidentially share information with our journalists\"He did something called neighbor polling, which is you ask people who they think their neighbors are likely to vote for… [in] an election where there's a stigma to saying you're gonna vote for somebody and people feel some sort of social awkwardness.\" The \"French Whale,\" as he has now become known, contracted polls in battleground states, Pennsylvania, Michigan, and Wisconsin, using global research data and analytics group YouGov, which also conducts polls for CBS News.In addition to a more traditional poll that asks the participant which candidate they would vote for, the \"French Whale\" requested a so-called \"neighbor poll,\" where respondents were asked which candidate people in their \"social circle\" would vote for. The results showed a significant discrepancy: the neighbor polls showed much more support for Mr. Trump than the traditional poll. The \"French Whale\" then raised his stake in Mr. Trump winning the election to $80 million, using several different accounts, about three weeks before Election Day. \"He thought Trump was undervalued… and they were confident in their research that Trump was likely to win,\" Coplan told 60 Minutes. When Mr. Trump won the 2024 presidential election, the \"French Whale\" made over $80 million from his wager. The Polymarket CEO said the \"French Whale\" story highlights how Polymarket bettors are financially incentivized to find cutting-edge information.\"If this guy was not able to make [over] $80 million, but rather able to make $80,000, he would've never gone through the hassle,\" Coplan explained.\"But when you get markets that are big enough… you create this incentive for people to go above and beyond to try and find truth.\"Cooper asked Coplan if election betting markets on Polymarket are vulnerable to influence: \"If people are looking… and they see, 'Oh, there's somebody who's betting huge amounts that Trump is gonna win, does that influence the market?\"\"It definitely puts people on alert. But at the same time, if they think that some guy, some French whale is just buying like crazy and he's out of his mind… that's an incentive for all the smart money to take the other side,\" Copaln said. On Polymarket, bettors take both sides of the bet— \"yes\" and \"no.\" You can sell shares to other bettors anytime. But when an event is over and the market resolves, holders of winning shares win everything, each receives $1 per share, while losing shares are worthless.For some users to profit, others have to lose.\"The people who were on the other side of [the \"French Whale\"] obviously didn't fare well,\" Coplan said. The video above was produced by Will Croxton. It was edited by Patrick Lee.","summary":"Polymarket founder and CEO Shayne Coplan spoke with 60 Minutes about an anonymous Frenchman who made over $80 million betting on President Trump to win the 2024 presidential election.","url":"https://www.cbsnews.com/news/french-whale-made-over-80-million-on-polymarket-betting-on-trump-election-win-60-minutes/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/11/30/3166e1b5-a9f9-4bac-947f-ef7ce0504160/thumbnail/1200x630/e4d1dda237fabad129f3c194d6ada327/ot-polymarketfd.jpg","video":null,"publish_date":"2025-12-01 00:30:52","author":"Will Croxton","authors":["Will Croxton"],"language":"en","category":"politics","source_country":"US","sentiment":0.068},{"id":383738322,"title":"Michelle Obama Has Produced the Most Important Book of the Century","text":"If they go by what the establishment media says, future ages will regard our lucky times as the days when veritable gods in human form walked among us, and lo, their names were Barack and Michelle Obama. The media is unstinting and unembarrassed in its fawning over the sainted couple, no matter how ludicrous its adulation gets. \n\nThese days, Michelle Obama seems determined to test the limits of that ludicrousness, and to push her media sycophants to ever-greater heights of feigned ecstasy at her endless victimhood posturing and mundane pronouncements dressed as wisdom. Her latest book, a heavy $50 coffee-table doorstop entitled The Look, is all about how she became a fashion trendsetter, and look, the easy marks are falling for it, as she knew they would.\n\nThe Washington Free Beacon noted Sunday that The Look “hit stores earlier this month and became an instant bestseller.” As of this Sunday evening, three weeks after its release, it was still number one in Amazon’s Women in History and Black & African American Biographies categories, and number two in Women's Biographies. It’s a big book full of glossy glamor shots of Michelle showing off her alleged trail-blazing fashion sense, but to hear the media tell it, it’s much, much more than just a book about clothes.\n\nThe New York Times grants that it is a “meditation on the power of clothes,” but works hard to make you think it belongs in the literary pantheon, cheek-by-jowl with The Adventures of Huckleberry Finn and Moby Dick and all the other books with which dead white male authors have plagued English classes: “But most of all,” the Times states rhapsodically, “it is a historical document, capturing a pivotal moment in the evolution of the role of first lady when clothing became an even bigger part of communication. When, in other words, dress became an officially recognized part of the job. That’s a bigger deal than it might appear.” You’ll just have to take the Times’ word on that. \n\nNot to be outdone, the farther-than-far-left Guardian gives us a taste of how Michelle uses The Look to indulge her never-ending desire to portray herself, despite the fantastic success she has enjoyed and immense wealth she has amassed, as a helpless victim of Whitey. “Now,” the Guardian announces, “16 years since Michelle Obama appeared in hers wearing a black sleeveless shift dress from the American designer Michael Kors, the former first lady has spoken about the particular outrage caused by her bare arms. Writing in The Look, a new photo book released on Tuesday that documents her style throughout her time in the White House, Obama describes how the media and public’s ‘fascination’ with her bare arms was used as a tool to ‘otherize’ her.”\n\nGood gravy. Were you ever “fascinated” with Michelle Obama’s bare arms? Neither was I. Do you even know anyone who was “fascinated” with Michelle Obama’s bare arms? Neither do I. But do we both know plenty of leftists who are determined to see racism wherever they look, no matter what is really there? Oh, yes. And here we go again: the Guardian goes on to assert that “although previous first ladies, including Jacqueline Kennedy, had worn sleeveless dresses, Obama notes that they never caused what she calls an ‘uproar’. ‘While I am certainly not the only First Lady to get scrutinized – Hillary was constantly dinged for her preference for pantsuits, and Nancy Reagan was lambasted for her love of haute couture – this felt different.’” Of course it did.\n\nAnd it still does. Farah Jasmine Griffin, who is, like Zohran Mamdani’s father, a Columbia University professor, writes in the book’s foreword that Michelle’s sleeveless outfit at the 2024 Democratic National Convention was more history being made before our very eyes: “The look, like the woman, was bold, powerful, forward-thinking, visionary, and empowering for everyone who dares to believe in the possibility of better tomorrows.”\n\nRelated: Kamala Harris and the Left’s Flight From Decency and Reality\n\nAnd so when we arrive at that better tomorrow, that sunny future of diversity and socialist equity, we will look back on these days when there was one woman of courage, Michelle Obama, with her sleeveless arms revealing her well-toned biceps as she took on the plutocrats and racists (but I am redundant) and destroyed them by the sheer power of her fashion sense.\n\nIs all this twaddle setting Michelle up for a presidential run in 2028? Sure looks like it.\n\nNow through Monday night, you can get 60% OFF on an annual VIP, VIP Gold, or VIP Platinum membership with promo code FIGHT. And if you join PJ Media VIP Platinum during this promotion, you get a chance to win one of five LIFETIME Platinum memberships. Already a VIP? Spread the joy and gift one!","url":"https://pjmedia.com/robert-spencer/2025/11/30/michelle-obama-has-produced-the-most-important-book-of-the-century-n4946576","image":"https://media.townhall.com/cdn/hodl/2024/182/f5ea9860-416d-4a5e-a58d-893632883a39.jpg","video":null,"publish_date":"2025-12-01 00:03:00","author":"Robert Spencer","authors":["Robert Spencer"],"language":"en","category":"politics","source_country":"us","sentiment":0.474},{"id":383743200,"title":"Biden, Harris screwed our...' says Trump as US admin enhances vetting measures for immigrants","text":"Amid the ongoing chaos over the shooting of two West Virginia National Guard members near the White House, US President Donald Trump on Sunday (local time) lambasted the previous Joe Biden administration, accusing its leaders of \"screwing the country\" by admitting \"unchecked and unvetted\" immigrants.\n\nThe President also hit out at former Vice President Kamala Harris for letting \"anyone and everyone come in\" to the US, who was responsible for overseeing country's border security policies and immigration enforcement efforts.\n\n\"Crooked Joe Biden, Mayorkas, and so-called 'Border Czar' Kamala Harris really screwed our Country by letting anyone and everyone come in totally unchecked and unvetted,\" Trump posted on Truth Social.\n\nThe Department of Homeland Security (DHS) also accused the previous Biden administration of committing an \"act of national self-sabotage\" by letting immigrants like Lakanwal into the country. The department further stated that immigration requests for Afghan nationals have been suspended indefinitely.\n\n\"The monster who carried out the attack in DC should never have been in this country. The Biden Administration let him--and countless others--in, an act of national self-sabotage. Effective immediately, processing of all immigration requests relating to Afghan nationals has been stopped indefinitely pending further review of security and vetting protocols,\" Homeland Security said.\n\nKristi Noem, Secretary at the DHS, has held the previous Joe Biden administration responsible for the killing of National Guard member Spec. Sarah Beckstrom in the White House shooting.\n\n\"This individual's application to be in this country started under the Joe Biden administration. The consequences of the shooting and the death of Sarah are directly on the shoulders of Joe Biden and his administration,\" Noem said while referring to suspect Rahmanullah Lakanwal being charged with first-degree murder after one of the two severely wounded National Guard members died.\n\nStaff Sergeant Andrew Wolfe (24), the other National Guard member, battles for his life as he recovers from severe injuries from the shooting.\n\nLakanwal (29), who migrated from Afghanistan in 2021 under \"Operation Allies Welcome\" during Joe Biden's tenure, after the chaotic withdrawal of US forces in Afghanistan.\n\nSpeaking on the migration from Afghanistan, Neom argued that the Joe Biden administration didn't conduct a thorough investigation and was lackadaisical in the vetting process.\n\n\"If you remember, during that operation, when Afghanistan was abandoned, people were just put on aircraft and brought to the United States. The administration at that time said that they would vet them, but didn't do a thorough investigation,\" the DHS Secretary said.\n\nHowever, Neom said, the Trump administration has put in place extensive measures to vet immigrants, including scrutiny of their social media platforms and communications. She stated that it was never done before, and thus, incidents like the Wednesday White House shooting occur.\n\n\"They only checked names and a few data points, but President Trump has put in place biometric information, checking social media platforms, communications, and contacts. The Biden administration never did that. He brought them in and said we would vet them later. This is how things like these happen,\" she added. \n\n(This story has not been edited by DNA staff and is published from ANI)","url":"https://www.dnaindia.com/world/report-biden-harris-screwed-our-country-says-trump-as-us-admin-enhances-vetting-measures-for-immigrants-3191278","image":"https://cdn.dnaindia.com/sites/default/files/styles/full/public/2025/12/01/2733074-image-13.jpg","video":null,"publish_date":"2025-12-01 00:00:00","author":"Am Ist","authors":["Am Ist"],"language":"en","category":"politics","source_country":"in","sentiment":-0.586},{"id":383731756,"title":"Trump Administration Launches ‘Media Offender of the Week’ Tracker","text":"The White House unveiled a new website section on Friday titled “Media Offender of the Week,” dedicated to identifying what it describes as misleading coverage by news organizations. \n\nThe page features a “Hall of Shame” spotlighting major outlets, including CNN, MSNBC, The Washington Post, and CBS News, along with claims the administration labels as biased or false reporting. Announced by White House press secretary Karoline Leavitt, the new site feature promises to chronicle what it calls false and misleading stories flagged by the administration.\n\nNewsweek reached out to the White House via email on Sunday for comment.\n\nWhy It Matters\n\nThis initiative represents an unprecedented formalization of President Donald Trump’s decades-long campaign against mainstream media outlets he frequently labels as “fake news.”\n\nThe launch comes amid heightened scrutiny of Trump’s treatment of journalists, including a November 14 incident where he told a female Bloomberg reporter “quiet, piggy” and appeared to wave a finger in her face when she attempted to ask about the Jeffrey Epstein files.\n\nThe move also intensifies concerns about press freedom and the traditional relationship between the White House and news media, particularly as it targets outlets owned by figures across the political spectrum—from Jeff Bezos‘s Washington Post to David Ellison’s CBS News, despite Trump previously praising Ellison’s Paramount acquisition as beneficial for press freedom.\n\nThe Trump @WhiteHouse is holding the Fake News accountable like never before. VISIT ➡️ https://t.co/9HDwjCK9dw pic.twitter.com/fuFYCKRIKP— Karoline Leavitt (@PressSec) November 28, 2025\n\nWhat To Know\n\nThe website features multiple sections categorizing media coverage under labels including “Bias,” “Lie,” “Malpractice,” and “Left-wing Lunacy.” This week’s focus centers on coverage of Trump’s response to a video where six Democratic members of Congress, including Senator Mark Kelly of Arizona, urged service members to refuse illegal orders and remember their constitutional oath. Trump responded on Truth Social, stating “SEDITIOUS BEHAVIOR, punishable by DEATH!” and reposting another comment declaring “HANG THEM.”\n\nThe administration argues media outlets mischaracterized Trump’s posts as calling for executions. According to the White House, the “truth” is that Trump called for accountability for what he describes as incitement of military insubordination, with talking points emphasizing that “President Trump has never issued an illegal order.”\n\nThe site lists numerous outlets as “repeat offenders,” including The New York Times, Axios, Politico, ABC News, The Hill, and The Associated Press. The Wall Street Journal appears on the “leaderboard” despite Trump’s $10 billion lawsuit against the Murdoch-owned outlet over coverage allegedly connecting him to Epstein, a convicted sex offender. Notably absent from all lists is Fox News. The site features detailed listings of dozens of TV segments and articles, along with a word cloud visualization of alleged offenders.\n\nCBS News appears prominently despite Trump’s recent praise for the network under new leadership. Following Ellison’s summer takeover of Paramount and Bari Weiss’s appointment as editor-in-chief, Trump called the changes beneficial for press freedom and described Weiss as “a great person” during a recent 60 Minutes interview—his first since receiving a $16 million settlement over a pre-election interview the program did with then-Vice President Kamala Harris.\n\nThe Pentagon announced Monday it may recall Kelly, a retired U.S. Navy captain, to active duty for potential court-martial proceedings under the Uniform Code of Military Justice (UCMJ).\n\nWhite House press secretary Karoline Leavitt watches as President Donald Trump speaks aboard Air Force One on October 29. (Photo by ANDREW CABALLERO-REYNOLDS/AFP via Getty Images)\n\nWhat People Are Saying\n\nWhite House’s statement on the new website tracker: “The media misrepresented President Trump’s call for Members of Congress to be held accountable for inciting sedition by saying that he called for their ‘execution.’ The Democrats and Fake News Media subversively implied that President Trump had issued illegal orders to service members. Every order President Trump has issued has been lawful. It is dangerous for sitting Members of Congress to incite insubordination in the United States’ military, and President Trump called for them to be held accountable.”\n\nFormer CNN anchor Jim Acosta told MS NOW, formerly MSNBC, on Saturday: “I think Donald Trump has cracked the code on how to hurt the press in this country with these lawsuits that have been settle...","summary":"The new website features sections categorizing media coverage under labels including &quot;Bias,&quot; &quot;Lie&quot; and &quot;Left-wing Lunacy.&quot;","url":"https://www.newsweek.com/trump-administration-launches-media-offender-of-the-week-tracker-11132376","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-2243431256.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-30 23:28:07","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"politics","source_country":"US","sentiment":0.087},{"id":383742616,"title":"29 times Fox News made us cringe in disgust this year","text":"President Donald Trump is attached at the hip to Fox News, the right-wing propaganda network. The relationship goes back more than a decade, when Fox held a regular commentary slot open for Trump to promote the racist birther conspiracy about then-President Barack Obama.\n\nIn that time, Fox has been a ceaseless promoter of Trump, his ideas, and his rhetoric while serving as a weapon to attack his enemies and the truth. Fox’s devotion to Trump runs so deep that the network paid out nearly $800 million because it pushed his lies about winning the 2020 presidential election.\n\nTrump and Fox may have the occasional public disagreement, but at the end of the day, they are unified. The past year has seen Trump back in the White House—and Fox News was with him every step of the way.\n\nHere are the 29 most cringe-inducing moments of Fox working in service of Trump in 2025.\n\n1. Praised Trump for his lack of inauguration diversity\n\nFox’s Jesse Watters apparently has had enough of past inauguration ceremonies that looked like America—you know, diverse. In January, he praised the choice of singer Carrie Underwood to sing “America the Beautiful,” remarking, “I'm just happy Carrie Underwood is performing. When a straight, blonde female is singing at the inauguration, I think we're back. I think we're definitely back.”\n\n2. Promoted a ridiculous list of Trump “accomplishments”\n\nA hundred days into Trump’s second term, the results were underwhelming. Trump had taken a battering ram to multiple agencies and imposed tariffs that were increasing costs, but he had accomplished few of his campaign promises, so Fox made up a list of weak wins and inflated their significance.\n\nThe network hailed Trump for ending production of the penny, establishing the destructive so-called Department of Government Efficiency, appointing members of a pro-pollution “energy dominance council,” creating a “strategic Bitcoin reserve,” renaming the Gulf of Mexico, and getting his Cabinet confirmed (which is something every president does).\n\n3. Got mad at Gavin Newsom for trolling Trump\n\nCalifornia Gov. Gavin Newsom emerged as one of Trump’s highest-profile detractors in 2025. Newsom and his team endlessly mocked Trump on social media, using graphics and videos to deflate Trump’s grandiose self-image.\n\nFox was mad about it. According to an analysis of Fox content conducted for Daily Kos by Media Matters for America, Fox went on and on (and on) about Newsom for 2 hours and 33 minutes across 71 segments over about a two-week period. For cable news, this is an exhaustive amount of attention.\n\nPro-Trump host Greg Gutfeld whined that a “team of dorks” was mocking Trump, while Sean Hannity’s show claimed the funny Newsom posts were proof the governor is “angry.”\n\n4. Influenced Trump’s decision to bomb Iran\n\nIn June, Trump bombed three Iranian nuclear sites in what Democratic Rep. Alexandria Ocasio-Cortez described as a “grave violation of the Constitution.”\n\nTrump’s habitual viewing of Fox reportedly played a role. The network hyped up the need to get into a conflict with Iran, telling viewers a conflict would “be over within two days.” At the same time, a delegation of hawkish conservative activists—including Fox host Mark Levin—visited the White House to push for an attack. Soon, bombs were falling.\n\n5. Got sued by Newsmax for bullying\n\nThe lesser-known Newsmax channel is in line with Fox’s promotion of right-wing causes and misinformation, such as pushing election lies. But in September, Newsmax sued Fox News.\n\nNewsmax’s complaint alleges that Fox used its influence to bully cable and satellite providers away from carrying Newsmax. Newsmax accused it of exercising a “monopoly” for right-wing audiences and alleged that the network was incapable of operating on a level playing field.\n\n6. Handed a TV show to a racist\n\nFox has spent years platforming bigots of all sorts. In September, former Trump press secretary Kayleigh McEnany, a Fox pundit, was given her own show, “Saturday In America.”\n\nLike Trump, McEnany had pushed the racist “birther” conspiracy and argued—with a straight face—that Trump “doesn’t lie.” At the point in his presidency that she’d said that (2020), Trump had racked up at least 16,241 falsehoods, according to The Washington Post.\n\n7. Slobbered over Trump’s unhinged U.N. speech\n\nTrump gave a widely panned, aggressive speech to the United Nations in September. Most world observers found Trump’s rhetoric insulting and littered with lies.\n\nFox loved it. Seconds after Trump finished speaking, Fox host Harris Faulkner proclaimed to her viewers he had been delivering “raw truth.” Fact-checkers following along with the speech in real time determined that much of it was false.\n\n8. Turned an escalator malfunction into a scandal\n\nDuring that same U.N. appearance, Trump was embarrassed when an elevator malfunctioned while he rode it. Fox News saw this basic mechanical failure as a more sinister development. Soon, the network was asking conspiracy-laden questions about “Escalatorgate.”\n\n9. Gave Stephen Miller a safe space\n\nSenior White House aide and longtime racist Stephen Miller was the recipient of pointed criticism from New York Rep. Alexandria Ocasio-Cortez in October. Discussing his anti-immigrant policies, Ocasio-Cortez said “he is so mad that he is 4 [foot] 10 [inches tall] that he’s taking that anger out at any other population possible.”\n\nHours later, Miller was booked on Laura Ingraham’s show so he could express his anger at the congresswoman. His retort? “Her eyes don’t work.\n\n10. Pushed racist anti-Mamdani smears\n\nAlong with its sister outlet, The New York Post, Fox aired segment after segment falsely connecting New York City mayoral candidate Zohran Mamdani to terrorism and communism. Fox even raised the notion that Mamdani should be deported.\n\nThe campaign didn’t work and Mamdani easily won, but Fox gave it their all.\n\n11. Tried to hide the Epstein story\n\nThe Trump administration’s decision to hide files related to accused sex trafficker Jeffrey Epstein angered even some on the right. But Fox News was there to show loyalty to Trump and Epstein instead of to the women who say they were victimized by Epstein.\n\nEven when their sister publication, the Wall Street Journal, reported that Trump’s name was purportedly included in Epstein documents, Fox went silent. Instead of reporting news affecting the highest levels of the government, Fox effectively ignored the story for days. Again, the furor still hasn’t died down, but Fox is part of the effort to make it go away.\n\n12. Tried to make viewers care more about jeans instead of sex trafficking\n\nWhile in the throes of covering for Trump on the Epstein issue, Fox figured its audience needed to hear about designer jeans instead.\n\nInstead of the Epstein story, which dominated coverage elsewhere, Fox focused on a purported controversy over an advertisement for American Eagle by Sydney Sweeney. Fox covered 1 hour and 25 minutes on Sweeney’s jeans ad, compared with 3 minutes of Trump-Epstein.\n\n13. Praised Trump for walking\n\nIn August, Trump suddenly appeared on the White House roof, walking around aimlessly. To most of the world, this was a cringe-inducing moment, lending credence to the idea of Trump’s mental decline.\n\nOn Fox, the odd walk was a triumph. Hannity insisted it was “amazing,” while Watters claimed it was evidence Trump is a “political giant.” Pundit Jimmy Failla insisted the weird moment was “historic.”\n\n14. Saw their election deception exposed\n\nAs part of its ongoing lawsuit against Fox for election lies, voting-machine company Smartmatic uncovered internal Fox messages that further revealed the depths of the network’s deception. The messages show Fox personalities and producers aware that they were telling election lies.\n\nAnchor Bret Baier admitted in a message that Fox Business host Maria Bartiromo was peddling “crap” about the election. Both are still employed at Fox.\n\n15. Asked Trump to prosecute CNN for journalism\n\nIn July, after CNN reported on an app that warned people of nearby immigration raids, Fox legal analyst Emily Compagno called for federal intervention into CNN. Compagno argued that Attorney General Pam Bondi would have a “strong case” against CNN if her department chose to press charges against the network—for doing basic journalism.\n\n16. Melted down over a bishop calling for mercy\n\nFox’s coverage in the week following Trump’s inauguration pushed the idea that his narrow victory over former Vice President Kamala Harris meant everyone had to get in line with his unpopular agenda.\n\nThe network directed its ire against Right Rev. Mariann Budde, an Episcopal bishop who delivered the national prayer service following Trump’s swearing-in. Budde invoked the church’s teachings on mercy, urging the administration to demonstrate the Christian value toward migrants and the LGBTQ+ community. \n\nIn response, Fox spent hours attacking Budde, questioning her religious standing, criticizing her gender and her rhetoric. The woman they described as a “woke bishop” was not hailing Trump—and that made her the enemy.\n\n17. Saw Fox hosts elevated to disaster response officials\n\nTrump’s first month in office saw the worst commercial jet crash in 15 years, and the officials tasked with responding had been, mere weeks before, part of the team on Fox News.\n\nTransportation Secretary Sean Duffy spent years at Fox after performing as a contestant on MTV’s “Road Rules,” while Defense Secretary Pete Hegseth became infamous as a Fox host for pushing sexism and bragging about never washing his hands.\n\nThe two men being the lead federal responders to the disaster emphasized how much Trump relies on Fox as his staffing agency, resulting in senior leaders more familiar with makeup and teleprompters than how to respond to an emergency.\n\n18. Saw former Fox host fumbling justice\n\nSpeaking of former Fox News personalities littered throughout the Trump administration: Jeanine Pirro. Trump recruited the host, who has written multiple sycophantic pro-Trump books, to serve as his U.S. attorney for the District of Columbia.\n\nPirro has not covered herself in glory. Grand juries have refused to follow Pirro’s lead with partisan indictments, while her office failed to convict the now-famous “sandwich guy” protester. The jury did not buy Pirro’s over-the-top argument that one thrown sandwich was a harbinger of terror.\n\n19. Lied about Jan. 6 rioters\n\nWhen Fox isn’t paying through the nose for its lies about the 2020 election, the network is part of Trump’s disinformation campaign about the conservative attack in response to losing the election.\n\nThis past January, during a discussion of the Capitol insurrection, Fox host Rachel Campos-Duffy argued that the attackers were “political dissidents.” Dissidents usually don’t try to overturn perfectly legal elections while wearing absurdist cosplay, for the record.\n\n20. Hired Trump’s daughter for her latest nepo job\n\nLara Trump served as co-chair of the Republican Party because she is Trump’s daughter-in-law, not for her supposed political insight. Largely for this same reason, Fox announced in February that she would be the network’s newest host. As predicted at the time, “My View with Lara Trump has been another venue for pro-Trump propaganda and not much else.\n\n21. Hosted a Musk-Trump lovefest\n\nBefore Trump and his billionaire benefactor Elon Musk were sniping at each other in the press, both men appeared on Fox in February for a chummy interview with Hannity.\n\nThe pair all but held hands as they gushed about each other, with Trump making it clear that Musk could use DOGE to unethically aid the fortunes of his companies. He did just that.\n\n22. Whined about lying, despite its own history of lying\n\nHannity has spent nearly 30 years at Fox News, lying about issues big and small. He earns millions of dollars forwarding lies about liberals, Democrats, and anyone else who doesn’t march in lockstep with his ideology.\n\nAnd yet, in a February interview, Hannity complained about his supposed pet peeve: lying. \n\n“That’s why legacy media is dead. They don’t know it yet because they don’t tell the truth,” Hannity said. \n\n23. Defended economy-harming tariffs\n\nBusinesses tend to oppose tariffs since they increase the costs of goods and lead consumers to hold back on spending. On paper, this would put Fox Business in opposition to tariffs, but the network exists largely to prop up conservatism and the Republican Party.\n\nThat leads to moments like the roundtable on Fox Business in March, where panelists had to twist themselves into knots to be pro-tariff. For instance, contributor Charles Payne claimed that tariffs have “been associated with some of the biggest boom times we’ve ever had” and cited the 1920s. Of course, that boom led right to the Great Depression, but Fox didn’t bother to mention that.\n\n24. Said leaking war plans is good, actually\n\nSecretary of Defense Pete Hegseth and other senior members of the Trump administration were in hot water in March after it was discovered that military plans were inadvertently leaked to a reporter.\n\nBut for Fox host Will Cain, this was a great moment. Cain argued, “After years of secrecy and incompetence, if you read the content of these messages, I think you will come away proud that these are the leaders making these decisions in America.” \n\nSee? Disclosing information that could harm the military and civilians is good—but only when Republicans do it.\n\n25. Said Elon Musk and Trump backing losing candidates is also good\n\nTrump backed the conservative candidate in Wisconsin’s Supreme Court election in April, and the candidate lost. But not in Fox world.\n\nSteve Doocy, co-host of “Fox & Friends” saw a silver lining after the liberal candidate won. “The Democrats ran against Elon Musk, they said he’s the world’s richest man and he can’t buy an election, so it wasn’t about Trump as much as it was about Musk,” Doocy said.\n\nThe election was about both Musk and Trump attempting to influence the state, along with the voter support for a progressive candidate. Doocy’s spin was in direct contrast to reality.\n\n26. Smeared Obama as antisemitic for backing free speech\n\nObama is one of Fox’s favorite targets. Despite him leaving office nearly nine years ago, Fox still relishes a chance to go after the former president.\n\nAfter Obama criticized efforts by the Trump administration to suppress speech in colleges, host Harris Faulkner made a ridiculous leap in logic. “Would that put former President Obama and others in his political camp—by the way, he went to Harvard Law School—you know, pushing against, are they antisemitic?” she asked. \n\nFox has often defended Trump, who traffics in antisemitism, but in the eyes of the network, speech they don’t like is “antisemitic.”\n\n27. Hid its own poll that were bad for Trump\n\nIn spite of their partisan content, Fox has sponsored accurate polls about public sentiment. This fact led to a strange moment in April when Fox’s own poll showed Trump falling to a then-new low approval rating, 44%.\n\nInstead of highlighting its own findings, Fox buried the poll. On “Fox & Friends” and on the Fox website, the network ignored the poor finding for Trump and instead hyped up more favorable findings. Fox showed it is willing to mute even itself in service of the right.\n\n28. Replaced a mild Trump critic with a rabid Trump fan\n\nLongtime Fox host Neil Cavuto used his show to offer up conservative commentary and often misleading pro-conservative content. But he occasionally committed the sin of mildly criticizing Trump.\n\nWhen Cavuto abruptly left the network in December 2024, Fox made sure that wouldn’t happen again. In January, Cavuto was replaced by pro-MAGA commentator Will Cain, a reliably pro-Trump voice who praised the Supreme Court for shutting down affirmative action and called Democratic Rep. Ilhan Omar, who is Black and Muslim, a “parasite.”\n\nThe hire made it clear that anything less than full MAGA support would not be tolerated.\n\n29. Argued it’s okay for Trump to demolish part of the White House since Obama played basketball\n\nThe public outcry after Trump demolished the East Wing of the White House was loud and clear. To defend Trump and his plans for a gold-encrusted ballroom, the White House absurdly claimed that the construction was in line with other past renovations.\n\nFox parroted those talking points, arguing that Trump was justified in his massive construction project because Obama had once modified a tennis court to also be used for basketball. In Fox’s coverage, that slight change was on par with massive destruction. \n\nFox has spent the past year in total spin mode, and it won’t ever stop. The network is happy to be dishonest and ridiculous as long as it can defend Trump, conservatism, and the Republican Party while attacking liberals and the Democrats. This is just what they do.","summary":"President Donald Trump is attached at the hip to Fox News, the right-wing propaganda network. The relationship goes back more than a decade, when Fox held a regular commentary slot open for Trump to promote the racist birther conspiracy about then-President Barack Obama.\n\n\n\nIn that time, Fox has been a ceaseless promoter of Trump, his ideas, and his rhetoric while serving as a weapon to attack his enemies and the truth. Fox’s devotion to Trump runs so deep that the network paid out nearly $800 million because it pushed his lies about winning the 2020 presidential election.\n\n\n\nTrump and Fox may have the occasional public disagreement, but at the end of the day, they are unified. The past year has seen Trump back in the White House—and Fox News was with him every step of the way.\n\n\n\nHere are the 29 most cringe-inducing moments of Fox working in service of Trump in 2025.\n\n\n\n1. Praised Trump for his lack of inauguration diversity\n\nFox’s Jesse Watters apparently has had enough of past inauguration ceremonies that ","url":"https://www.dailykos.com/story/2025/11/30/2354470/-29-times-Fox-News-made-us-cringe-in-disgust-this-year?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1402388/story_image/AP23164123140936.jpg?1740517231","video":null,"publish_date":"2025-11-30 22:00:04","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","source_country":"US","sentiment":0.003},{"id":383720578,"title":"Is Gretchen Whitmer Backing Down From 2028?","text":"California Gov. Gavin Newsom’s roaring start to the 2028 presidential election may already be scaring away potential competitors.\n\nThat could be true when it comes to the candidate who possibly looks the best on paper: Gretchen Whitmer. As the center-left governor of a critical swing state who held major roles in the Joe Biden and Kamala Harris campaigns and who has managed to retain strong approval ratings, Whitmer seems to have everything going for her. (RELATED: Whitmer Says America Is Ready for a Female President)\n\nAnd yet, Michigan’s governor has numerous times in recent months suggested that she may not wage a presidential bid.\n\nSpeculation that she may pass on the race kicked off in April when she responded to the question of what she is looking forward to in 2026 by saying, “Retiring.”\n\nThis year, her appearances on national news shows have grown few and far between, leading many to conclude that she is stepping away from the limelight. Some also view her decision to prioritize working with President Donald Trump on Michigan’s needs — such as securing a new fighter jet mission at Selfridge Air National Guard Base — rather than fighting him at every turn, à la Newsom, as a retreat from a national political future. This term in office, Trump has, in appreciation of her strategy, called her “a very good person” and said she is doing an “excellent job.”","url":"https://hotair.com/headlines/2025/11/30/is-gretchen-whitmer-backing-down-from-2028-n3809378","image":null,"video":null,"publish_date":"2025-11-30 22:00:00","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","source_country":"us","sentiment":0.176},{"id":383707090,"title":"\"Biden, Harris screwed our country,\" says Trump as US admin enhances vetting measures for immigrants","text":"Washington, DC, [US], December 1 (ANI): Amid the ongoing chaos over the shooting of two West Virginia National Guard members near the White House, US president Donald Trump on Sunday (local time) lambasted the previous Joe Biden administration, accusing its leaders of \"screwing the country\" by admitting \"unchecked and unvetted\" immigrants. The President also hit out at former Vice President Kamala Harris for letting \"anyone and everyone come in\" to the US, who was responsible for overseeing country's border security policies and immigration enforcement efforts.\"Crooked Joe Biden, Mayorkas, and so-called 'Border Czar' Kamala Harris really screwed our Country by letting anyone and everyone come in totally unchecked and unvetted,\" Trump posted on Truth Social.The Department of Homeland Security (DHS) also accused the previous Biden administration of committing an \"act of national self-sabotage\" by letting immigrants like Lakanwal into the country. The department further stated that immigration requests for Afghan nationals have been suspended indefinitely.\"The monster who carried out the attack in DC should never have been in this country. The Biden Administration let him--and countless others--in, an act of national self-sabotage. Effective immediately, processing of all immigration requests relating to Afghan nationals has been stopped indefinitely pending further review of security and vetting protocols,\" Homeland Security said.Kristi Noem, Secretary at the DHS, has held the previous Joe Biden administration responsible for the killing of National Guard member Spec. Sarah Beckstrom in the White House shooting.\"This individual's application to be in this country started under the Joe Biden administration. The consequences of the shooting and the death of Sarah are directly on the shoulders of Joe Biden and his administration,\" Noem said while referring to suspect Rahmanullah Lakanwal being charged with first-degree murder after one of the two severely wounded National Guard members died.Staff Sergeant Andrew Wolfe (24), the other National Guard member, battles for his life as he recovers from severe injuries from the shooting.Lakanwal (29), who migrated from Afghanistan in 2021 under \"Operation Allies Welcome\" during Joe Biden's tenure, after the chaotic withdrawal of US forces in Afghanistan.Speaking on the migration from Afghanistan, Neom argued that the Joe Biden administration didn't conduct a thorough investigation and was lackadaisical in the vetting process.\"If you remember, during that operation, when Afghanistan was abandoned, people were just put on aircraft and brought to the United States. The administration at that time said that they would vet them, but didn't do a thorough investigation,\" the DHS Secretary said.However, Neom said, the Trump administration has put in place extensive measures to vet immigrants, including scrutiny of their social media platforms and communications. She stated that it was never done before, and thus, incidents like the Wednesday White House shooting occur. \"They only checked names and a few data points, but President Trump has put in place biometric information, checking social media platforms, communications, and contacts. The Biden administration never did that. He brought them in and said we would vet them later. This is how things like these happen,\" she added. (ANI)","url":"https://aninews.in/news/world/us/biden-harris-screwed-our-country-says-trump-as-us-admin-enhances-vetting-measures-for-immigrants20251201020533","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251130192353.jpg","video":null,"publish_date":"2025-11-30 20:35:33","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.567},{"id":383708890,"title":"\"Biden, Harris screwed our country,\" says Trump as US admin enhances vetting measures for immigrants","text":"Washington, DC, [US], December 1 (ANI): Amid the ongoing chaos over the shooting of two West Virginia National Guard members near the White House, US president Donald Trump on Sunday (local time) lambasted the previous Joe Biden administration, accusing its leaders of \"screwing the country\" by admitting \"unchecked and unvetted\" immigrants. The President also hit out at former Vice President Kamala Harris for letting \"anyone and everyone come in\" to the US, who was responsible for overseeing country's border security policies and immigration enforcement efforts.\"Crooked Joe Biden, Mayorkas, and so-called 'Border Czar' Kamala Harris really screwed our Country by letting anyone and everyone come in totally unchecked and unvetted,\" Trump posted on Truth Social.The Department of Homeland Security (DHS) also accused the previous Biden administration of committing an \"act of national self-sabotage\" by letting immigrants like Lakanwal into the country. The department further stated that immigration requests for Afghan nationals have been suspended indefinitely.\"The monster who carried out the attack in DC should never have been in this country. The Biden Administration let him--and countless others--in, an act of national self-sabotage. Effective immediately, processing of all immigration requests relating to Afghan nationals has been stopped indefinitely pending further review of security and vetting protocols,\" Homeland Security said.Kristi Noem, Secretary at the DHS, has held the previous Joe Biden administration responsible for the killing of National Guard member Spec. Sarah Beckstrom in the White House shooting.\"This individual's application to be in this country started under the Joe Biden administration. The consequences of the shooting and the death of Sarah are directly on the shoulders of Joe Biden and his administration,\" Noem said while referring to suspect Rahmanullah Lakanwal being charged with first-degree murder after one of the two severely wounded National Guard members died.Staff Sergeant Andrew Wolfe (24), the other National Guard member, battles for his life as he recovers from severe injuries from the shooting.Lakanwal (29), who migrated from Afghanistan in 2021 under \"Operation Allies Welcome\" during Joe Biden's tenure, after the chaotic withdrawal of US forces in Afghanistan.Speaking on the migration from Afghanistan, Neom argued that the Joe Biden administration didn't conduct a thorough investigation and was lackadaisical in the vetting process.\"If you remember, during that operation, when Afghanistan was abandoned, people were just put on aircraft and brought to the United States. The administration at that time said that they would vet them, but didn't do a thorough investigation,\" the DHS Secretary said.However, Neom said, the Trump administration has put in place extensive measures to vet immigrants, including scrutiny of their social media platforms and communications. She stated that it was never done before, and thus, incidents like the Wednesday White House shooting occur. \"They only checked names and a few data points, but President Trump has put in place biometric information, checking social media platforms, communications, and contacts. The Biden administration never did that. He brought them in and said we would vet them later. This is how things like these happen,\" she added. (ANI)","url":"https://www.aninews.in/news/world/us/biden-harris-screwed-our-country-says-trump-as-us-admin-enhances-vetting-measures-for-immigrants20251201020533","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251130192353.jpg","video":null,"publish_date":"2025-11-30 20:35:33","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.567},{"id":383702206,"title":"Tim Walz responds ‘as a parent’ to Trump’s slur: ‘This is cruelness’","text":"Minnesota Gov. Tim Walz responded to President Donald Trump calling the former vice presidential candidate a slur typically used for people with disabilities in a shocking rant on Thanksgiving.\n\nWalz appeared on Meet the Press on Sunday to speak about Trump’s comments, describing them as an example of the commander-in-chief’s “cruelness.”\n\n“But I think we all know, both as an educator for a couple of decades and as a parent, using that term is just so damaging,” Walz told Kristen Welker.\n\nBefore entering politics, Walz worked as a teacher and spoke to The Independent in May about the ways he accommodated students with disabilities in his classroom.\n\nTrump delivered a blistering and rage-fueled message this past Thursday, where he railed against immigrants from Somalia in Minnesota and blamed Walz, calling him “seriously r*****ed.”\n\n“He's normalized this type of hateful behavior and this type of language,” Walz said. And mainly, look, at first, I think it's just because he's not a good human being, but secondly to distract from using competency. “\n\nWalz’s son Gus also has nonverbal learning disorder, attention deficit hyperactivity disorder, and anxiety disorder. In 2024, Kamala Harris selected Walz as her running mate.\n\nAt the Democratic National Convention, Gus Walz received worldwide attention when he emotionally expressed his pride in his father and said, “That’s my dad.”\n\n“This is what Donald Trump has done,” he said. “He's normalized this type of hateful behavior and this type of language. And mainly, look, at first, I think it's just because he's not a good human being, but secondly, to distract from using competency.”\n\nTrump’s words came ahead of the 50th anniversary of the Individuals with Disabilities Education Act, which said that students with disabilities are entitled to a “free appropriate public education.”\n\nDuring the government shutdown, the Trump administration eliminated most of the staff at the Office of Special Education and Rehabilitative Services, though they were later reinstated after the shutdown.\n\nWalz also responded to the idea that Democrats are policing language when they criticize the use of slurs against people with disabilities.\n\n“You can use that word, sure,” Walz said. “You can use that language. But you shouldn't. And that's something that Donald Trump fails to realize. But again, Kristen, this is cruelness. This is meanness, it's aimed at a broader community.”\n\nIn addition, Walz responded to his tweet, posted in response to Trump’s original post, calling for Trump to release the results of his MRI.\n\n“Here we got a guy on Thanksgiving where we spent time with our families, we ate, we played Yahtzee, we cheered for football or whatever,” he said. “This guy is apparently in a room ranting about everything else. This is not normal behavior. It’s not healthy.”\n\nWalz and Trump have clashed in the past, and he served as Harris’s main attack dog during the 2024 election, famously calling Republicans “weird.” But he received criticism for his cordial approach to Trump’s running mate, JD Vance, in their sole debate last year.","url":"https://uk.news.yahoo.com/tim-walz-responds-parent-trump-195502760.html","image":"https://s.yimg.com/ny/api/res/1.2/Kl8QrSHJeX7LQNrZTpwAwg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/b17168c0884072dc9822e2cb21c77886","video":"","publish_date":"2025-11-30 19:55:02","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.173},{"id":383700996,"title":"Tim Walz responds ‘as a parent’ to Trump’s slur: ‘This is cruelness’","text":"Minnesota Gov. Tim Walz responded to President Donald Trump calling the former vice presidential candidate a slur typically used for people with disabilities in a shocking rant on Thanksgiving. \n\nWalz appeared on Meet the Press on Sunday to speak about Trump’s comments, describing them as an example of the commander-in-chief’s “cruelness.” \n\n“But I think we all know, both as an educator for a couple of decades and as a parent, using that term is just so damaging,” Walz told Kristen Welker. \n\nBefore entering politics, Walz worked as a teacher and spoke to The Independent in May about the ways he accommodated students with disabilities in his classroom.\n\nTrump delivered a blistering and rage-fueled message this past Thursday, where he railed against immigrants from Somalia in Minnesota and blamed Walz, calling him “seriously r*****ed.” \n\n“He's normalized this type of hateful behavior and this type of language,” Walz said. And mainly, look, at first, I think it's just because he's not a good human being, but secondly to distract from using competency. “\n\nWalz’s son Gus also has nonverbal learning disorder, attention deficit hyperactivity disorder, and anxiety disorder. In 2024, Kamala Harris selected Walz as her running mate. \n\nAt the Democratic National Convention, Gus Walz received worldwide attention when he emotionally expressed his pride in his father and said, “That’s my dad.”\n\n“This is what Donald Trump has done,” he said. “He's normalized this type of hateful behavior and this type of language. And mainly, look, at first, I think it's just because he's not a good human being, but secondly, to distract from using competency.”\n\nTrump’s words came ahead of the 50th anniversary of the Individuals with Disabilities Education Act, which said that students with disabilities are entitled to a “free appropriate public education.” \n\nDuring the government shutdown, the Trump administration eliminated most of the staff at the Office of Special Education and Rehabilitative Services, though they were later reinstated after the shutdown. \n\nWalz also responded to the idea that Democrats are policing language when they criticize the use of slurs against people with disabilities. \n\n“You can use that word, sure,” Walz said. “You can use that language. But you shouldn't. And that's something that Donald Trump fails to realize. But again, Kristen, this is cruelness. This is meanness, it's aimed at a broader community.”\n\nIn addition, Walz responded to his tweet, posted in response to Trump’s original post, calling for Trump to release the results of his MRI. \n\n“Here we got a guy on Thanksgiving where we spent time with our families, we ate, we played Yahtzee, we cheered for football or whatever,” he said. “This guy is apparently in a room ranting about everything else. This is not normal behavior. It’s not healthy.”\n\nWalz and Trump have clashed in the past, and he served as Harris’s main attack dog during the 2024 election, famously calling Republicans “weird.” But he received criticism for his cordial approach to Trump’s running mate, JD Vance, in their sole debate last year.","summary":"Walz has a son with multiple disabilities and Trump’s words came on the anniversary of the law that requires students with disabilities to receive a free appropriate public education","url":"https://www.independent.co.uk/news/world/americas/us-politics/tim-walz-trump-slur-disability-b2875295.html","image":"https://static.independent.co.uk/2025/07/29/23/20/Tim-Walz.jpeg?crop=6000,4000,x0,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/oR3dQjMZ-4VHSaSK0.mp4","publish_date":"2025-11-30 19:55:02","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.173},{"id":383695974,"title":"Walz reveals whether he'd support Kamala Harris in presidential bid","text":"Walz reveals whether he'd support Kamala Harris in presidential bid\n\n Republican strategist Mehek Cooke joins ‘Fox News Live’ to discuss Tennessee’s special congressional election, Gov. Tim Walz’s support for Vice President Kamala Harris’s potential 2028 run and the impact of socialism on the Democratic Party.","summary":"Republican strategist Mehek Cooke joins ‘Fox News Live’ to discuss Tennessee’s special congressional election, Gov. Tim Walz’s support for Vice President Kamala Harris’s potential 2028 run and the impact of socialism on the Democratic Party.","url":"https://www.foxnews.com/video/6385767780112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b655d30d-2695-4569-a043-e00880233ace/fbf0467f-e0b0-4972-a267-5b6cfc25d0b6/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-11-30 19:11:18","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.199},{"id":383722154,"title":"Documenting media lies: It’s a dirty little job but White House web site steps up","text":"by WorldTribune Staff, November 30, 2025 Real World News\n\nThe Biden Administration went to great lengths, as WorldTribune.com can attest, to censor and suppress media reports it knew to be true.\n\nThe Trump Administration has launched a new initiative to highlight media reports it knows to be false.\n\n“The Trump @WhiteHouse is holding the Fake News accountable like never before,” White House Press Secretary Karoline Leavitt announced on Friday.\n\nA new White House website lists CBS News, The Boston Globe, and The Independent as the “Offenders of the Week” for their coverage of President Donald Trump calling out a video by the “Seditious Six” congressional Democrats who apparently called on military members and intelligence agents to defy the chain of command if so-called “illegal” orders were issued.\n\n“The media misrepresented President Trump’s call for Members of Congress to be held accountable for inciting sedition by saying that he called for their “execution,’ ” the site stated.\n\n“The Democrats and Fake News Media subversively implied that President Trump had issued illegal orders to service members,” the site adds. “Every order President Trump has issued has been lawful. It is dangerous for sitting Members of Congress to incite insubordination in the United States military, and President Trump called for them to be held accountable.\n\n“President Trump has never issued an illegal order. The Fake News knew that, but ran with the story anyway.”\n\nThe new website also includes a “Hall of Shame” which calls out other media outlets whose reporting the White House considered to suffer from a range of deficiencies such as “left-wing lunacy,” “mischaracterization,” “circular reporting,” “bias,” and “false claims.”\n\nListed in the “Hall of Shame” are MS NOW (formerly known as MSNBC), CNN, The Washington Post, CBS News, The New York Times, and USA Today.\n\nMultiple legacy media outlets have settled with the president after being confronted with lawsuits.\n\n• The BBC came under fire after The Telegraph obtained a dossier detailing how the network used spliced clips of Trump’s Jan. 6, 2021, speech that were 54 minutes apart during a documentary to make it appear he encouraged protesters to riot at the Capitol building later that day. The BBC apologized to Trump in a Nov. 13 letter from chairman Samir Shah after two top officials at the company resigned following the dossier’s release, saying the documentary would not air again.\n\n• Trump also secured a $15 million settlement with ABC in December 2024 after he filed a defamation lawsuit against the outlet on March 19, 2024. ABC’s “This Week” host George Stephanopoulos falsely stated Trump was found “liable for rape” during a contentious March 10, 2024 appearance by Republican South Carolina Rep. Nancy Mace.\n\n• Paramount announced on July 2 of this year that it had settled a $10 billion lawsuit filed by Trump over the editing of an October 2024 “60 Minutes” interview with Democrat presidential candidate Kamala Harris.\n\nSupport Free Press Foundation\n\n Documenting media lies: It’s a dirty little job but White House web site steps up, WorldTribune.com","summary":"by WorldTribune Staff, November 30, 2025 Real World News The Biden Administration went to great lengths, as WorldTribune.com can attest, to censor and suppress media reports it knew to be true. The Trump Administration has launched a new initiative to highlight media reports it knows to be false. “The Trump @WhiteHouse is holding the Fake [&#8230;]","url":"https://worldtribune.com/documenting-media-lies-its-a-dirty-little-job-but-white-house-web-site-steps-up/","image":"https://worldtribune.com/wp-content/uploads/2025/11/whmedia.jpg","video":null,"publish_date":"2025-11-30 19:10:07","author":"Editor Two","authors":["Editor Two"],"language":"en","category":"politics","source_country":"us","sentiment":-0.21},{"id":383697350,"title":"Walz, Klobuchar hit back against Trump’s attacks on Minnesota","text":"He added: “The seriously retarded Governor of Minnesota, Tim Walz, does nothing, either through fear, incompetence, or both,” while also taking swings at progressive Rep. Ilhan Omar (D-Minn.), criticizing her Muslim faith and speculating falsely that she may have entered the country illegally.\n\n“We have fought three decades to get this out of our school. Kids know better than to use it,” Walz told Welker. “But look, this is what Donald Trump has done. He’s normalized this type of hateful behavior and this type of language. And mainly, look, at first, I think it’s just because he’s not a good human being, but secondly to distract from his incompetency.”\n\nDemocratic politicians roundly renounced Trump’s use of the word, widely regarded as a derogatory slur for people with intellectual disabilities, and one Republican lawmaker in Indiana withdrew his support from the GOP’s redistricting plan in the state in response to the post.\n\nThe White House has ramped up its crackdown on immigration in the wake of a deadly shooting in Washington that left one National Guard member dead and another critically injured. Trump pledged to “permanently pause migration from all Third World Countries” after law enforcement identified the suspect as an Afghan national who came to the U.S. in 2021 following the Biden administration’s withdrawal from the country.\n\nIn a Sunday morning interview with CNN’s Dana Bash on “State of the Union,” Klobuchar accused the president of trying to “stoke division and make people hate each other.”\n\n“Every state has a problem with crime,” Klobuchar said. “But what the president has done here is taken a horrific crime that occurred in Washington, D.C., where one beloved guard member is still struggling for his life, another was shot and killed. … He took that case, and then he went 2,400 miles away to Somalia and somehow indicted an entire group of people.”\n\nWalz, who ran on the Democratic ticket with former Vice President Kamala Harris last year, has repeatedly drawn the ire of the Trump administration, with the Justice Department suing his state and launching a probe into allegations of hiring discrimination.\n\nFederal prosecutors have brought charges against dozens of Somali Americans over the last three years in a wide-ranging corruption investigation into the social services system in Minnesota, which is home to nearly 80,000 members of the Somali diaspora.\n\nThe scandal has rocked Walz’s administration, with the state’s Department of Human Service Employees alleging the governor “betrayed Minnesota and caused some of the worst inequities Minnesota has ever seen, hurting the most vulnerable and needy” in a Sunday statement.\n\n“Those people are going to jail and we are doing everything we can, but to demonize an entire community on the actions of a few, it’s lazy,” Walz said on NBC.","url":"https://www.politico.com/news/2025/11/30/walz-klobuchar-trump-attack-minnesota-00671132","image":"https://www.politico.com/dims4/default/8a4b33d/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F60%2F50%2Fb11349264a60bd60a2751c581143%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2232777516","video":null,"publish_date":"2025-11-30 19:02:00","author":"Jacob Wendler","authors":["Jacob Wendler"],"language":"en","category":"politics","source_country":"us","sentiment":-0.414},{"id":383678580,"title":"Dems shockingly competitive in deep-red House district Trump won by 22 percent","text":"When Tuesday night, November 4 arrived, Democratic strategists were on pins and needles as they awaited returns in 2025's off-year elections. And there was a lot of good news for Democrats, from double-digit victories in gubernatorial races in Virginia and New Jersey to landslide wins in three Pennsylvania Supreme Court retention votes. \n\nThose elections were widely viewed as a referendum on Donald Trump's second presidency, giving Democrats some optimism about the 2026 midterms.\n\nNow, Democratic and GOP strategists are paying close attention to a U.S. House special election in Tennessee that will be held this Tuesday, December 2. With former Rep. Mark Green having retired from Congress, the election finds Democratic State Rep. Aftyn Behn up against Republican Matt Van Epps.\n\nReporting for USA Today in late November, reporters Joey Garrison and Zac Anderson explain, \"Fresh off Democrats' domination in the off-year elections, a congressional race in Tennessee has become an unlikely test for whether a national blue wave is building that could produce a seismic shakeup in next year's midterm election.\"\n\nBehn and Van Epps are competing in a very GOP-leaning congressional district. Yet Behn is surprisingly competitive in polls.\n\n\"Tennessee's 7th Congressional District was never supposed to be competitive,\" Garrison and Anderson report. \"It's the creation of Tennessee's Republican-controlled legislature, which drew its boundaries in 2022 by splitting Democrat-stronghold Nashville into three districts, each dominated by conservative rural counties and different Middle Tennessee suburbs. One was District 7, which includes parts of Nashville's Davidson County and 13 other countries.\"\n\nThe USA Today reporters add, \"Trump won Tennessee's Congressional District 7 by 22 percentage points over Kamala Harris in the 2024 election. But both Democrats and Republicans are bracing for a close election next week. A poll from Emerson College Polling/The Hill found Van Epps leading by only 2 percentage points, 48 percent to 46 percent, within the survey's margin of error. Even if Behn doesn't win the race — something that would have been unthinkable a few weeks ago — a defeat by single-digits could signal major trouble for Republicans in the 2026 midterms.\"\n\nRead the full USA Today article at this link.","summary":"When Tuesday night, November 4 arrived, Democratic strategists were on pins and needles as they awaited returns in 2025's off-year elections. And there was a lot of good news for Democrats, from double-digit victories in gubernatorial races in Virginia and New Jersey to landslide wins in three Pennsylvania Supreme Court retention votes. \n\nThose elections were widely viewed as a referendum on Donald Trump's second presidency, giving Democrats some optimism about the 2026 midterms.\n\nNow, Democratic and GOP strategists are paying close attention to a U.S. House special election in Tennessee that will be held this Tuesday, December 2. With former Rep. Mark Green having retired from Congress, the election finds Democratic State Rep. Aftyn Behn up against Republican Matt Van Epps.\n\nReporting for USA Today in late November, reporters Joey Garrison and Zac Anderson explain, \"Fresh off Democrats' domination in the off-year elections, a congressional race in Tennessee has become an unlikely test for whether a national ","url":"https://www.alternet.org/trump-midterms-tennessee/","image":"https://www.alternet.org/media-library/image.jpg?id=62259076&width=1200&height=600&coordinates=0%2C166%2C0%2C167","video":null,"publish_date":"2025-11-30 17:55:52","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.246},{"id":383684918,"title":"Democrats Demand Donald Trump Release MRI Results","text":"Democrats are demanding that President Donald Trump release the results of a recent MRI test, drawing renewed attention to questions around the health of the president.\n\nNewsweek contacted the White House outside of normal business hours for comment.\n\nWhy It Matters\n\nThere has been increased scrutiny around the health of the president in recent months. He was diagnosed with chronic venous insufficiency, a condition that is common in older adults, in July. There have been instances of bruises being visible on the president’s hands, which have in turn sparked concern and questions over his health.\n\nTrump confirmed that he had received an MRI at Walter Reed National Military Medical Center in October as part of what the White House described as a routine physical. However, Trump told reporters he had “no idea what they analyzed.”\n\nAt 78 years old, Trump was the oldest man to assume the office of president, followed by Joe Biden. He turned 79 in June, and speculation about his health continues, particularly as this issue led to Biden’s exit from the race for president in 2024.\n\nU.S. President Donald Trump arrives on the South Lawn of the White House on November 22, 2025, in Washington, D.C.\n\nWhat To Know\n\nThe calls appear to have come after Trump published a late-night tirade against immigration, in which he used a slur against Minnesota’s Democratic Governor Tim Walz.\n\nIn the lengthy post, Trump criticized Walz and Somali American Democratic Minnesota Representative Ilhan Omar, pushed unsubstantiated claims about Somali immigrants and slammed immigration.\n\nFollowing this, Walz wrote on X, “Release the MRI results,” in a post viewed 8 million times.\n\nSince Walz’s post, social media has been flooded with people, mostly Democrats, demanding that the MRI results be released. Given the governor’s high profile—he was Vice President Kamala Harris’ running mate in the 2024 presidential election—it is likely that his post has helped to influence this.\n\nHarry Sisson, an influencer and Democrat with a prominent social media following, shared a recent photo of Trump on X and wrote, “This photo of Trump was taken today. He’s clearly not well. I don’t even think MAGA can pretend like he is. Release the MRI results.”\n\nThe social media account for the Democratic Governors Association also posted “Release the MRI results,” in a post viewed over 50,000 times.\n\nIn August, Vice President JD Vance spoke about Trump’s health, telling USA Today, “I feel very confident the president of the United States is in good shape, is going to serve out the remainder of his term and do great things for the American people.”\n\nWhat People Are Saying\n\nAdam Kinzinger, a commentator for CNN, in a post on X: “Release the MRI results.”\n\nPresident Trump previously responded to rumors about his health, writing: “NEVER FELT BETTER IN MY LIFE.”\n\nWhat’s Next\n\nWhether Trump will go on to release the results remains to be seen, but speculation over the president’s health is likely to continue.","summary":"Calls for the results of an MRI test which the president is known to have taken, have flooded social media.","url":"https://www.newsweek.com/donald-trump-mri-results-democrats-11131901","image":"https://assets.newsweek.com/wp-content/uploads/2025/11/GettyImages-2247391327.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-11-30 17:40:14","author":"Marni Rose McFall","authors":["Marni Rose McFall"],"language":"en","category":"politics","source_country":"US","sentiment":-0.398},{"id":383697054,"title":"Walz: Harris would be good 2028 candidate, but not only one","text":"Walz: Harris would be good 2028 candidate, but not only one\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\nWalz: Harris would be good 2028 candidate, but not only one\n\nNov. 30, 202501:08\n\nNoem says decisions about deportation ops are hers\n\nNew FDA vaccine rules planned amid Covid shots claim\n\nNow Playing\n\nWalz: Harris would be good 2028 candidate, but not only one\n\nTrump: Venezuelan airspace should be deemed 'closed'\n\nSec. Noem says all asylum claims in U.S. to be reviewed\n\nWinter weather causes massive pileup on Indiana highway\n\nNoem: Suspect in D.C. attack was ‘radicalized’ in U.S.\n\nWinter storm threatens post-holiday travel\n\nPeople arrested during anti-ICE demonstration in NYC\n\nTwo sisters die saving disabled dad from Thanksgiving fire\n\nPhotographer explains how 'Icarus' photo was caught\n\nScaffolding comes down from Rockefeller Christmas tree\n\nThree injured in Black Friday shooting at Bay Area mall\n\nTrump administration vows for immigration changes\n\nMan repeatedly rams rideshare with partner inside\n\nAirbus issues recall of A320 for software issues\n\nZelenskyy chief of staff resigns amid corruption probe\n\nTrump 'cancelling' Biden orders signed by autopen\n\nDozens killed by floods and landslides in Sri Lanka\n\nMaasai leader files lawsuit over luxury safari camp\n\nWalz: Harris would be good 2028 candidate, but not only one\n\nGov. Tim Walz (D-Minn.) says his former running mate Kamala Harris would be a good presidential candidate in 2028 — but adds that \"there'll be a lot of folks throwing their hat into the ring.\"Nov. 30, 2025\n\nGet more newsLiveon\n\nNoem says decisions about deportation ops are hers\n\nNew FDA vaccine rules planned amid Covid shots claim\n\nNow Playing\n\nWalz: Harris would be good 2028 candidate, but not only one\n\nTrump: Venezuelan airspace should be deemed 'closed'\n\nSec. Noem says all asylum claims in U.S. to be reviewed\n\nWinter weather causes massive pileup on Indiana highway\n\nGet more newsLiveon\n\nBest of NBC News\n\nNoem says decisions about deportation ops are hers\n\nMeet the Press\n\nNov. 30 — Sec. Kristi Noem, Sen. Mark Kelly and Gov. Tim Walz\n\nNew FDA vaccine rules planned amid Covid shots claim\n\nWalz: Harris would be good 2028 candidate, but not only one\n\nTrump: Venezuelan airspace should be deemed 'closed'\n\nSec. Noem says all asylum claims in U.S. to be reviewed","summary":"Gov. Tim Walz (D-Minn.) says his former running mate Kamala Harris would be a good presidential candidate in 2028 — but adds that \"there'll be a lot of folks throwing their hat into the ring.\"","url":"https://www.nbcnews.com/video/shorts/walz-harris-would-be-good-2028-candidate-but-not-only-one-253309509945","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_11/walz_thumb-ireziq.jpg","video":null,"publish_date":"2025-11-30 17:07:46","author":null,"language":"en","source_country":"us","sentiment":-0.557},{"id":383685920,"title":"Tim Walz says Kamala Harris would be a good 2028 candidate, but not the only one","text":"Tim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nNov. 30, 202502:41\n\nKristi Noem blames Biden Afghanistan ‘abandonment’ for National Guard shooting: Full interview\n\nKristi Noem says she allowed deportation flights to continue, despite court order\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nNow Playing\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\n‘Transcends party identification’: Bipartisan lawmakers on addressing opioid epidemic among veterans\n\nIowa Senate candidate ‘laser focused’ on addressing affordability & political corruption\n\nKornacki: Polls don't show 'huge gap' in favorability between Democrats & Republicans\n\nVoters in key swing states raise concerns over high prices and affordability\n\nWhite House keeping draft Ukraine peace plan 'very close to its chest'\n\nHealth care subsidies shouldn’t be extended without ‘serious reform’: House Republican\n\nAmy Klobuchar slams 'dangerous' Trump posts threatening Democratic lawmakers: Full interview\n\nAmy Klobuchar says Trump’s Ukraine peace plan ‘very favorable to Russia’\n\nScott Bessent says U.S. will not enter recession despite some sectors showing warning signs\n\nBessent says inflation ‘has nothing to do with tariffs’ as U.S. rolls them back: Full interview\n\nZohran Mamdani says he’s open to an ‘alternative’ to new taxes to fund his plans\n\nZohran Mamdani says he still believes Trump a ‘fascist’ after meeting: Full interview\n\nTrump rolls back Brazil tariffs as U.S. faces higher grocery prices\n\nHow Mamdani went from 'Trump's worst nightmare' to a ‘potential dream partnership’\n\nMeet the Press\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nIn an exclusive interview with Meet the Press, Gov. Tim Walz (D-Minn.) weighs in on the future of the Democratic Party, saying his former running mate Kamala Harris would be a good presidential candidate in 2028 — but emphasizing that \"there'll be a lot of folks throwing their hat into the ring.\"Nov. 30, 2025\n\nGet more newsLiveon\n\nKristi Noem blames Biden Afghanistan ‘abandonment’ for National Guard shooting: Full interview\n\nKristi Noem says she allowed deportation flights to continue, despite court order\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nNow Playing\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nGet more newsLiveon\n\nBest of NBC News\n\nMeet the Press\n\nNov. 30 — Sec. Kristi Noem, Sen. Mark Kelly and Gov. Tim Walz\n\nNew FDA vaccine rules planned amid Covid shots claim\n\nWalz: Harris would be good 2028 candidate, but not only one\n\nTrump: Venezuelan airspace should be deemed 'closed'\n\nSec. Noem says all asylum claims in U.S. to be reviewed\n\nWinter weather causes massive pileup on Indiana highway","url":"https://www.nbcnews.com/meet-the-press/video/tim-walz-says-kamala-harris-would-be-a-good-2028-candidate-but-not-the-only-one-253309509708","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_11/1764515035115_mtp_clip_walz2028_251130_1920x1080-f063ul.jpg","video":null,"publish_date":"2025-11-30 15:04:00","author":null,"language":"en","source_country":"us","sentiment":-0.25},{"id":383647464,"title":"Unseen Chinese Claws in Every Call: Massive Hacking Attack Exposed","text":"In the latest episode of \"China is not a close friend of the United States,\" on Sunday, we learned that a Chinese state-sponsored cyberattack may have affected many, perhaps most Americans, from President Trump right down to regular folks across the fruited plain.\n\nThis was audacious; it was carefully planned and executed, and it may still be ongoing.\n\nA former FBI official claims that it's likely every American has been impacted by a Chinese-state-sponsored cyberattack.International law enforcement agencies, including the FBI and National Security Agency, issued a joint advisory in September warning the public that CCP-sponsored actors are \"targeting\" many aspects of American lives, including telecommunications, government, transportation, lodging and military infrastructure networks.The cyberattack wasn't limited to the U.S. and targeted many countries around the globe, according to the advisory. According to the international agencies, the three Chinese companies believed to be behind Salt Typhoon work for China's intelligence services, which include units in the People’s Liberation Army and Ministry of State Security.\n\nSo, this would be a cyber-attack conceived and approved at the very highest levels of the Chinese government; that is to say, the Chinese Communist Party. And this is a manifestly unfriendly act.\n\nThis isn't the first such incursion linked to China in recent months.\n\nRead More: US-China Air War: Control of the Pacific Now Hangs in the Balance\n\nWhat's interesting about this attack is that it included what was basically a population-wide wiretap. What could China gain by listening in on the phone conversations of ordinary Americans? That's not clear, but that seems to be what may have happened. \n\nPete Nicoletti, chief information security officer at Check Point, told Fox News Digital that those behind the Salt Typhoon cyberattack had unprecedented access to phone calls being placed by Americans.\"They had full rein access,\" Nicoletti, said. \"So, you know, your grandmother calling you to remind you to pick up groceries was not a targeted person and they're gonna listen into that call. But Trump, Vance, Kamala Harris, and dozens of other U.S. government officials were specifically targeted.\"Nicoletti said the Salt Typhoon hackers \"established a foothold and exfiltrated data for five years,\" which is \"almost unprecedented.\"\n\nWe should note that not even a nation as populous as China has enough people to monitor the phone calls of a few hundred million Americans, so any such monitoring would by necessity be focused, but the people that they seem to have access to are alarming: Current and former elected officials, right up to and including the president and vice president.\n\nIf China had anyone listening to Kamala Harris's telephonic word salads, it seems that would qualify them for hazardous duty pay.\n\nIf anyone needed a reminder that China is the United States' primary geopolitical rival, this should do the job. With this, with recent AI-directed cyberattacks, with the purchase and occupation of agricultural lands strangely located near major U.S. military bases, China seems to be engaging in intelligence-gathering on a vast scale.\n\nAs to what purpose China might have in gathering intelligence on the United States, I think we can presume the worst. China is a nation with a long, long history. They have historically thought in the long term, not in terms of decades, but centuries. But as I'm continually pointing out, they no longer have that luxury. The Middle Kingdom is facing a major demographic crisis. They may well be running out of time; if they are going to act, they have to act within the next couple of decades.\n\nEditor’s Note: Thanks to President Trump and his administration’s bold leadership, we are respected on the world stage, and our enemies are being put on notice.\n\nHelp us continue to report on the administration’s peace through strength foreign policy and its successes. Join [Insert Site] VIP and use promo code FIGHT to get 60% off your VIP membership.","url":"https://redstate.com/wardclark/2025/11/30/unseen-chinese-claws-in-every-call-massive-hacking-attack-exposed-n2196669","image":"https://media.townhall.com/cdn/hodl/2024/274/678e938a-0476-4698-9e13-79db499b123c.jpg","video":null,"publish_date":"2025-11-30 14:46:29","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":383648654,"title":"Mark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview","text":"Mark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nNov. 30, 202510:30\n\nKristi Noem blames Biden Afghanistan ‘abandonment’ for National Guard shooting: Full interview\n\nNow Playing\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\n‘Transcends party identification’: Bipartisan lawmakers on addressing opioid epidemic among veterans\n\nIowa Senate candidate ‘laser focused’ on addressing affordability & political corruption\n\nAmy Klobuchar slams 'dangerous' Trump posts threatening Democratic lawmakers: Full interview\n\nBessent says inflation ‘has nothing to do with tariffs’ as U.S. rolls them back: Full interview\n\nZohran Mamdani says he still believes Trump a ‘fascist’ after meeting: Full interview\n\nHouse Democrat demands release of 'shocking' Trump call with Saudi crown prince\n\n'We have joined forces': Bipartisan lawmakers find common ground on health care proposal\n\nJasmine Crockett calls on blue states not to ‘abandon’ redistricting fight\n\nPrice of 'almost every product' at grocery stores is coming down: Agriculture secretary\n\nSen. Barrasso says Epstein vote a Democratic attempt to make Trump a ‘lame duck’: Full interview\n\nRo Khanna says shutdown was ‘final straw’ for Schumer, calls for ouster: Full interview\n\nTim Kaine defends switching his 'no vote to yes' on ending the shutdown: Full interview\n\nRubio ‘denied’ plans for regime change in Venezuela during briefing: Top Armed Services Democrat\n\n‘10 years later’ Trump ‘still has no health care plan’: Obama HHS secretary\n\nUkrainian ambassador tells Rubio 'there's definitely room' for more Russia sanctions\n\n‘I'm pissed as hell about how it went down’: House Democrat on shutdown\n\nGOP Rep. Bacon urges Speaker Johnson to ‘find a bipartisan plan’ on health care\n\nMeet the Press\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nIn an interview with Meet the Press, Sen. Mark Kelly (D-Ariz.) responds to President Trump’s decision to pause immigration from “all third world countries.”Nov. 30, 2025\n\nGet more newsLiveon\n\nKristi Noem blames Biden Afghanistan ‘abandonment’ for National Guard shooting: Full interview\n\nNow Playing\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\n‘Transcends party identification’: Bipartisan lawmakers on addressing opioid epidemic among veterans\n\nIowa Senate candidate ‘laser focused’ on addressing affordability & political corruption\n\nAmy Klobuchar slams 'dangerous' Trump posts threatening Democratic lawmakers: Full interview\n\nGet more newsLiveon\n\nBest of NBC News\n\nNoem: Suspect in D.C. attack was ‘radicalized’ in U.S.\n\nMeet the Press\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nMeet the Press\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\nMeet the Press\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nMeet the Press\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nMeet the Press\n\nKristi Noem says she allowed deportation flights to continue, despite court order","url":"https://www.nbcnews.com/meet-the-press/video/mark-kelly-says-trump-migrant-crackdown-shows-they-don-t-want-brown-people-coming-full-interview-253311045529","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_11/1764513036852_mtp_full_kelly_251130_1920x1080-y9l066.jpg","video":null,"publish_date":"2025-11-30 14:30:44","author":null,"language":"en","source_country":"us","sentiment":-0.32},{"id":383660798,"title":"Mark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe","text":"Mark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nIE 11 is not supported. For an optimal experience visit our site on another browser.\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nNov. 30, 202506:42\n\nKristi Noem blames Biden Afghanistan ‘abandonment’ for National Guard shooting: Full interview\n\nKristi Noem says she allowed deportation flights to continue, despite court order\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\nNow Playing\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\n‘Transcends party identification’: Bipartisan lawmakers on addressing opioid epidemic among veterans\n\nIowa Senate candidate ‘laser focused’ on addressing affordability & political corruption\n\nKornacki: Polls don't show 'huge gap' in favorability between Democrats & Republicans\n\nVoters in key swing states raise concerns over high prices and affordability\n\nWhite House keeping draft Ukraine peace plan 'very close to its chest'\n\nHealth care subsidies shouldn’t be extended without ‘serious reform’: House Republican\n\nAmy Klobuchar slams 'dangerous' Trump posts threatening Democratic lawmakers: Full interview\n\nAmy Klobuchar says Trump’s Ukraine peace plan ‘very favorable to Russia’\n\nScott Bessent says U.S. will not enter recession despite some sectors showing warning signs\n\nBessent says inflation ‘has nothing to do with tariffs’ as U.S. rolls them back: Full interview\n\nZohran Mamdani says he’s open to an ‘alternative’ to new taxes to fund his plans\n\nZohran Mamdani says he still believes Trump a ‘fascist’ after meeting: Full interview\n\nTrump rolls back Brazil tariffs as U.S. faces higher grocery prices\n\nHow Mamdani went from 'Trump's worst nightmare' to a ‘potential dream partnership’\n\nMeet the Press\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nSen. Mark Kelly (D-Ariz.) joins Meet the Press as the Pentagon investigates him for a video he recorded with other Democratic lawmakers urging service members to disobey illegal orders. Kelly defends the message but does not specify any orders he believes President Trump has already given that were unlawful.Nov. 30, 2025\n\nGet more newsLiveon\n\nKristi Noem blames Biden Afghanistan ‘abandonment’ for National Guard shooting: Full interview\n\nKristi Noem says she allowed deportation flights to continue, despite court order\n\nMark Kelly says Trump migrant crackdown shows ‘they don't want Brown people coming’: Full interview\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview\n\nNow Playing\n\nMark Kelly says troops ‘can tell’ what orders are illegal amid Pentagon probe\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nGet more newsLiveon\n\nBest of NBC News\n\nTrump: Venezuelan airspace should be deemed 'closed'\n\nSec. Noem says all asylum claims in U.S. to be reviewed\n\nWinter weather causes massive pileup on Indiana highway\n\nNoem: Suspect in D.C. attack was ‘radicalized’ in U.S.\n\nMeet the Press\n\nTim Walz says Kamala Harris would be a good 2028 candidate, but not the only one\n\nMeet the Press\n\nTim Walz says Trump slurs ‘demonize our children’: Full interview","url":"https://www.nbcnews.com/meet-the-press/video/mark-kelly-says-troops-can-tell-what-orders-are-illegal-amid-pentagon-probe-253310021977","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2025_11/1764512840853_mtp_clip_kellyorders_251130_1920x1080-8bbsg5.jpg","video":null,"publish_date":"2025-11-30 14:27:27","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.25},{"id":383633458,"title":"Mamdani Spoke to Our Common Humanity, While Cuomo Represented the Status-Quo Regime of Entrenched Theft and Wanton Corruption - Part 3","text":"The immitigably pivotal and the Richter-Scale epochal significance of the massive “Electoral Earthquake” and “Tsunami”-inflected victory registered by the Ugandan-born and Indian-descended 34-year-old American Zohran “The Shining Star” Kwame Mamdani, partially named after Ghana’s late former President Kwame Nkrumah, could only be aptly likened to such psychologically pivotal and paradigmatic resetting of the “Corporate and the Crony-Capitalist Clock” of American Revolutionary History since the Emancipation of Continental Africans from the at once horrific and inexcusably barbaric and morally primitive and irredeemable institutional establishment of Chattel Slavery. But, of course, not very many of the shameless symbolic and the veritable representatives of the Old Postcolonial American Regime of Capitalist Slavocracy readily recognized this most epiphanic and prophetic fact of inevitable ultimate reality.\n\nAnd, of course, absolutely no studious and levelheaded observer or critic of contemporary American Civilization and Culture could even have half expected them to. You see, so unspeakably comfortable and socioeconomically insulated, and isolated as well, had the surrogate likes of disgraced former New York State Governor Andrew Mark Cuomo and morally degenerate and unregenerate status-quo kingpins like President Donald John Trump, the Make America Great Again (MAGA) Pontiff of the New Whites-Only World Order, at least by many media accounts, become that they had facilely and cavalierly expected to backhandedly quench the apocalyptic revolutionary inferno roaring all over the streets and the highways of the New York Cosmopolis and, to be certain, a significant portion of the vast Imperial Nation-State that is the United States of America, by simply feeding the unslakeable flames of widespread popular dissent by obscenely dollarizing the ab-initio irredeemably doomed mayoral campaign of the most expensive and “taxpayer-redeemed” sexual harasser former Governor in the history of New York State. Perhaps even in the entire history of the United States of America itself.\n\nAlready, Multi-Billionaire Entrepreneur and Media Mogul Michael Rubens Bloomberg, putatively among the vanguard ranks of the most humanitarian and philanthropic prime beneficiaries of the old decidedly effete and moribund Robber-Baron Aristocracy, had, by dozens of media accounts, poured in at least Eight-and-Half-Million Dollars into the electioneering-campaign warchest of a Political Action Committee (PAC) treasury account almost exclusively earmarked for the benefit of the beef-rotten and rancid electioneering campaign of Candidate Andrew Mark Cuomo, and helplessly and hopelessly witnessed the 67-year-old son of the late thrice-elected former Governor Mario Matthew Cuomo severely beaten in the polls, in what some critics and observers described as “well beyond recognition.”\n\nBut, of course, like pathologically venal corporate systems rigged up for widespread extortion of the nation’s commonwealth, the prime beneficiaries of these diehard, jaded and shamelessly parasitic systems of capitalist vampirism were not bound to peacefully and quietly dismantle themselves; they had to be virulently and volcanically and rudely pushed off the scene and the rails from the outside. In other words, there is absolutely no reason or historically existent record that could lead any critically thinking observer or studious student of history to expect or suppose that these imperiously and intransigently self-entitled aristocratic robber-barons would wisely come to the obvious understanding that the proverbial game was irredeemably out of gas and decidedly kaput and over with.\n\nYou see, self-entitled socioeconomic parasites of the breed being spoken of and about here do not simply get up one day, after such a seismic Mamdanian Fall or crushing to pumice - our profound apologies to Nigeria’s Prof. Wole Soyinka - and bashfully dust themselves up with the all too crystal “stair” understanding - another round of profound apologies to the immortalized Bard-of-Harlem, New York, Mr. James Langston Hughes - that the game is finally over - as some system-conditioned fools have almost naturally wised up to recognize and accept in the past in other places and regimes, in order to pick up the broken pieces and more productively and progressively regroup and/or discover other more humane and charitable ways of living high on the proverbial hog, by allowing other equally significant and perhaps even more labor-relevant and productive humans far less fortunate than themselves have the chance to diligently eke out their fair share of the metaphorical National Cake or Muffin, whatever the real case scenario may be.\n\nWhich is essentially and fundamentally what the Mamdanian Credo or Creed of AFFORDABILITY is squarely and unmistakably about. Which is also why in the wake of the catastrophic defeat of a morally and a psychologically deranged Candidate Cuomo, he would woefully and heretically underestimate the intelligence and the common sense of the overwhelming majority of New York City’s Voters and decide to, once again, quixotically challenge Candidate Mamdani whose name, by the way, the quaintly contemptuous Third-Generation Sicilian-Descended New Yorker never learned to correctly pronounce or perhaps, very likely, deliberately chose to comically mispronounce as “Mamdamni” or “Mamdami,” in hopes of making the inimitably eloquent graduate of the globally renowned Bronx High School of Science seem like the stereotypical “Outsider” to Mainstream American Society.\n\n“Mamdamni” and “Mamdami,” Candidate Cuomo, who had decided to run against his much younger and far better Democratic Party political opponent and Nominee for the November 4, 2025 New York City Mayoral General Election, would impudently and imprudently ride roughshod over established party protocol to run for the mayoralty as an Independent Candidate. Once again, 83-year-old Mr. Michael Rubens Bloomberg would reportedly pour nearly a couple of million dollars into the veritable electioneering-campaign wastepaper basket of a royally and an irredeemably failed Candidate Andrew Mark Cuomo and, predictably, end up with the same dismal result as before in the 2025 Democratic Party’s New York City Mayoralty Primary.\n\nThe fact of the matter, and one which none of the mainstream American media, both conservative and liberal or progressive, seems to be either interested in pointing out or underscoring for the political and the ideological edification of both the New York City general public and the larger and greater American Society at large, is the fact that Michael Bloomberg has some of the same “socialist” tendencies that have been widely and pejoratively associated with Mayor-Elect Zohran Kwame Mamdani, when it comes to Mr. Bloomberg’s well-known remarkably generous philanthropic distribution of huge chunks of his personal and private wealth and earnings in support of organizations and institutional establishments oriented towards the material uplift and the socioeconomic advancement of the woefully underprivileged in American Society.\n\nBut, of course, the very obvious argument that is likely to be made to forcefully counter the foregoing observation is the fact that in the case of Mr. Bloomberg, the policy initiative is decidedly voluntary and personal, whereas in the case of Mayor-Elect Mamdani it is purely political and one that almost exclusively revolves around and is dependent on the invidiously targeted taxation of New York City’s filthy rich and powerful and almost invariably the most selfish and amorally self-righteous and most miserly citizens of American Society, whose humongous accumulation of wealth is, by the way, not vastly different from that which has been proposed by Mr. Mamdani, which is incontrovertibly that, by and large, the richest and the most powerful in American Society acquired both their wealth and their disproportionate power via the corporate and collusively “legalized criminality” of public extortion of largely the lumpen-poor and the underprivileged working class, the very core of the generation of America’s wealth whom former Vice-President Kamala Devi Harris curiously and cavalierly shied away from in the runup to America’s 2024 Presidential Election, and therefore ought to be made to pay their fair share of taxes earmarked for the development of both New York City and American Society at large.\n\nIt is, however, self-entitlement poseurs like Tesla’s Elon Musk who are most likely to pose the greatest threat and danger to the “Mamdani Revolution” and, by extension, the socioeconomically and the sociopolitically constructive and the progressive and the salutary rejuvenation and prolongation of contemporary Western Civilization. Which is why it could only come as great news, if one of these days the Apartheid South Africa-born Mr. Musk announced the discovery of a habitable region on the Planet Mars by the scientists at work at his Spacex Silicon Valley Laboratory where he had decided to relocate.\n\nBy Kwame Okoampa-Ahoofe, Jr., PhDProfessor Emeritus, Department of EnglishSUNY-Nassau Community CollegeGarden City, New YorkE-mail: okoampaahoofekwame@gmail.com","url":"https://www.modernghana.com/news/1452529/mamdani-spoke-to-our-common-humanity-while-cuomo.html","image":"https://cdn.modernghana.com/images/content/1130202521916-l5gsj7u3i1-zohran-kwame-mamdani-andrew-mark-cuomo-and-michael-rubens-bloomberg.jpg","video":null,"publish_date":"2025-11-30 13:25:00","author":"Kwame Okoampa","authors":["Kwame Okoampa"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.198},{"id":383606682,"title":"Massive Chinese Cyberattack Allegedly Affects Every American, Claims Ex-FBI Official","text":"An alarming revelation from a former FBI official suggests that nearly every American has likely been affected by a cyberattack orchestrated by Chinese state-sponsored actors. This assertion underscores the widespread reach of these cyber activities, which have permeated various facets of American life.\n\nIn September, a coalition of international law enforcement agencies, including the FBI and the National Security Agency, issued a comprehensive advisory. The warning highlighted that actors backed by the Chinese Communist Party are actively targeting critical sectors in the United States. These sectors span telecommunications, government operations, transportation systems, lodging, and military infrastructure, painting a concerning picture of the potential vulnerabilities.\n\nThe advisory further indicated the global nature of these cyberattacks, which have not been confined to American borders. The coordinated efforts are believed to involve three Chinese companies, allegedly operating under the aegis of China’s intelligence apparatus, including the People’s Liberation Army and the Ministry of State Security. This collaboration facilitates the gathering of sensitive information, enabling Chinese intelligence to monitor and trace their targets’ communications and movements worldwide.\n\nCynthia Kaiser, who previously held a pivotal role within the FBI’s cyber division, emphasized the magnitude of the breach in an interview with the New York Times. She stated that it is challenging to imagine any American remaining untouched by the fallout from this extensive hack.\n\nCynthia Kaiser, a former high-ranking official in the FBI’s cyber division, told the New York Times it’s hard to envision a scenario where any American wasn’t impacted by the hack.\n\n“I can’t imagine any American was spared given the breadth of the campaign,” she said.\n\nThose directly impacted by the cyberattack include senior U.S. government officials and prominent political figures whose communications were accessed, according to the FBI.\n\nPete Nicoletti, chief information security officer at Check Point, told Fox News Digital that those behind the Salt Typhoon cyberattack had unprecedented access to phone calls being placed by Americans.\n\n“They had full reign access,” Nicoletti, said. “So, you know, your grandmother calling you to remind you to pick up groceries was not a targeted person and they’re gonna listen into that call. But Trump, Vance, Kamala Harris, and dozens of other US government officials were specifically targeted.”\n\nNicoletti said the Salt Typhoon hackers “established a foothold and exfiltrated data for five years,” which is “almost unprecedented.”\n\nYet the cybersecurity expert says his greatest concern is not what Salt Typhoon may target in the future, but whether the group remains embedded inside companies and agencies that still haven’t discovered the intrusion.\n\n“My biggest concern is they’re still in various organizations and undetected,” he said. “So the thing that I worry about is not the next time that these guys hack somebody, it’s what they’re doing currently and who they’re in.”\n\nWhen discussing the cyberattack in December 2024, then-deputy national security adviser Anne Neuberger said the hackers worked to identify the owners of various devices, then spy on phone calls and text messages if they were “government targets of interest.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nAn alarming revelation from a former FBI official suggests that nearly every&#8230;\n\n\nThis Post: Massive Chinese Cyberattack Allegedly Affects Every American, Claims Ex-FBI Official first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/massive-chinese-cyberattack-allegedly-affects-every-american-claims-ex-fbi-official/","image":"https://internewscast.com/wp-content/uploads/2025/11/Chinese-cyberattack-campaign-likely-impacted-every-American-former-FBI-official.jpg","video":null,"publish_date":"2025-11-30 12:02:20","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.075},{"id":383638248,"title":"2 AZ Republicans urge Trump to reject Mamdani's security clearance","text":"Two U.S. House Republicans from Arizona are urging President Donald Trump to deny New York City Mayor-elect Zohran Mamdani a federal security clearance, a credential typically given to the head of the nation's biggest city.\n\nReps. Andy Biggs and Eli Crane are among eight Republicans accusing Mamdani, the 34-year-old democratic socialist whom Trump last week warmly welcomed to the White House, of \"a well-documented record of conduct that raises serious national security concerns.\"\n\nA letter signed by Biggs and Crane notes Mamdani co-founded a chapter of the youth pro-Palestinian group, Students for Justice in Palestine, his previous remarks calling to defund New York police, and, while campaigning, declined to condemn the phrase \"Globalize the Intifada,\" among other actions they deem disqualifying for a security clearance.\n\n“Security clearances are reserved for individuals who can be trusted with the nation’s most sensitive materials — a standard Mamdani doesn’t come close to meeting,\" Biggs said in a written statement. \"His record is a bold red warning flag. DHS (the Department of Homeland Security) must reject his request without hesitation.”\n\nBiggs and Crane are sticking to that demand even after a surprisingly friendly meeting between Trump and Mamdani that saw the two men genially take questions from the press and hold a photo shoot in the White House.\n\nThe president, who had previously referred to the mayor-elect as a \"communist lunatic\" and suggested he may be in the country illegally, waved away a question asking Mamdani whether he still considers Trump a \"fascist.\"\n\n\"That's OK. You can just say yes,\" Trump said. \"I don't mind.\"\n\nMamdani had told reporters earlier: “It was a productive meeting focused on a place of shared admiration and love, which is New York City, and the need to deliver affordability to New Yorkers.”\n\n\"We agree on a lot more than I would have thought,\" Trump said.\n\nTrump, an exceptional figure in American politics, has come to enjoy a striking degree of loyalty from the GOP rank-and-file. His volatile leadership style can at times create uncomfortable circumstances for other Republican elected officials, who regularly defend his decisions and statements even when they are outlandish, seemingly contradictory, or politically risky.\n\nThrough an aide, Biggs, who is running for governor of Arizona, didn't answer a question about whether it was a mistake for Trump to warmly receive someone who Biggs believes \"has a well-established pattern of siding with extremists, undermining U.S. counterterrorism efforts, demonizing law enforcement, and legitimizing violent movements.\"\n\nInstead, Biggs took the opportunity to criticize how the state's economy is shaping up under Gov. Katie Hobbs, a Democrat.\n\n\"President Trump is working to deliver lower costs for Americans and as a true statesman, he's willing to work with elected officials from across the political spectrum to get the job done,\" Biggs said in a written statement. Hobbs \"should take a lesson from President Trump and start putting people ahead of politics.\"\n\nThe visit didn't change \"any of the underlying issues,\" such as Mamdani's \"views, affiliations, and actions,\" wrote Greg Smith, Crane's chief of staff.\n\nThe White House and Mamdani's team did not return requests for comment.\n\nIt's typical for New York City mayors to have security clearances, which allow them to be briefed on threats to the city, Politico has reported.\n\nTrump has previously used security clearances as a way to target his political enemies. In March, he announced he was prohibiting a list of top Democrats and other rivals, including former President Joe Biden, former Vice President Kamala Harris, former Rep. Liz Cheney and New York Attorney General Letitia James, from accessing classified information.\n\nBut he's given no indication that he plans to do the same for Mamdani. It would mark an escalation in their relationship which, days ago, seemed friendly.\n\nWhat we know: Kyrsten Sinema, psychedelic advocate, now a devotee of RFK's agenda?","url":"https://eu.azcentral.com/story/news/politics/arizona/2025/11/30/az-republicans-urge-trump-to-reject-zohran-mamdani-security-clearance/87482848007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/11/21/USAT/87402191007-getty-images-2247216825.jpg?auto=webp&crop=4792,2696,x0,y0&format=pjpg&width=1200","video":null,"publish_date":"2025-11-30 12:02:06","author":"The Arizona Republic","authors":["The Arizona Republic"],"language":"en","category":"politics","source_country":"us","sentiment":0.171},{"id":383603016,"title":"Republicans started the redistricting war, but will they win it?","text":"Riding high into his second term after defeating Kamala Harris and winning the popular vote, President Donald Trump claimed Republicans were \"entitled to five more seats\" in Congress from Texas – setting off a campaign to redraw the congressional map at the expense of Democrats.\n\nThe comments marked the start of a high-stakes, nationwide redistricting fight before next year’s elections, with Republicans looking for opportunities to insulate their majority from the typical headwinds the president’s party faces in midterm elections.\n\nThe map battle may not be over, but heading into 2026, what appeared to be a Republican advantage may be moving closer to a wash between both parties.\n\nAt first glance, Trump and Republicans appeared to have the upper hand: the GOP controlled the levers of power in more states than Democrats – who, for years, have championed nonpartisan redistricting measures and constitutional amendments in blue states.\n\n\"Initially, it looked pretty good for Republicans to gain some seats,\" Shawn Donahue, a redistricting expert at the University of Buffalo, told ABC News. \n\nHeading into the fall, Texas Republicans adopted a map that could net the GOP as many as five new seats next year, while a legally required effort in Ohio and a review of North Carolina and Missouri’s maps resulted in the potential to flip a couple more Democrat-held seats.\n\nTogether, more than half-a-dozen dozen pickup opportunities appeared ready to insulate what was House Speaker Mike Johnson’s three-seat margin -- and potentially raising the hurdle Democrats would have to clear in 2026 to recapture the House.\n\nWith Republicans in Florida, Indiana and Nebraska also exploring their possibilities, the GOP seemed to have the wind at its back.\n\nBut after November’s elections and a flurry of court activity, the GOP may no longer be in the driver’s seat.\n\nTheir momentum was blunted by Gov. Gavin Newsom’s efforts in California, where a seemingly long-shot bid to get voters to approve a new map until the end of the decade passed with overwhelming support – shoring up a handful of purple seats for Democrats, putting up to five Republican-held districts in play next year, and raising Newsom’s national profile.\n\nDemocrats’ strong performances in Virginia and New Jersey also raised new questions about the durability of the Republican support among Latinos in the new districts in Texas.\n\nAt the same time, Virginia’s legislature approved a new constitutional amendment that would allow Democrats to redraw the state’s maps next year, in a move that could result in as many as three new Democratic seats.\n\nIn Utah, a state judge rejected a GOP redistricting plan, paving the way for a new map with a solidly Democratic seat in Salt Lake City, absent any successful challenges from Republicans in the state.\n\nDemocrats in New York also filed a lawsuit to challenge what appeared to be an insurmountable hurdle of a state constitutional amendment. If successful, that effort could help Democrats flip an additional House seat around New York City.\n\nIn Indiana, where Trump has, so far unsuccessfully, pressed Republicans to adopt new congressional maps, state Sen. Mike Bohacek announced he would vote against the Trump-backed proposal over the president's use of an offensive term for people intellectual disabilities in a social media post, ahead of the legislature reconsidering redistricting early next month.\n\nIn Wisconsin, the state supreme court is taking up two redistricting cases that could potentially lead to a new map that could favor Democrats in up to two House districts.\n\n\"Maybe there is still a chance to gain some seats but Democrats could come out ahead,\" Donahue said. \"There’s still a lot of uncertainty going into 2026.\"\n\nThe Texas plan has also been caught up in court: After a lower court judge struck down the map as an illegal gerrymander, Texas Gov. Greg Abbott appealed to the Supreme Court where Justice Samuel Alito temporarily paused the lower court ruling -- keeping the map in place for the time being -- as the entire court decides in the coming days whether to give the green light for 2026.\n\nThe high court also has a pending decision in a case from Louisiana that could roll back section 2 of the Voting Rights Act, potentially allowing states to eliminate majority-minority districts currently held by Democrats.\n\nHow the court rules in that case, could further scramble the congressional map, according to analysts, which could eliminate many Democratic districts in southern states.\n\nJonathan Cervas, a redistricting expert at Carnegie Mellon University who was appointed by a court to draw New York state’s current congressional map amid a legal dispute, told ABC News that at this point, Republicans may only realize “minimal gains” from the White House-led redistricting fight when the dust settles.\n\n\"Even without Texas map being overturned, the Democrats are probably winning this war\" at this point, he said.\n\nCervas also criticized both parties for revisiting maps for political gain in ways that could leave voters with fewer competitive districts in which to cast votes.\n\n\"The people are losing. Every time we gerrymander for partisan gain, voters are worse off,\" he added. \"A minus plus a minus is a bigger minus.\"\n\nTo be sure, the fight is not over: Florida Republicans could revisit the issue next year in the GOP-leaning state. And President Trump can still make-or-break political careers of Republicans across the country who push back on efforts to reshape the midterm battlefield.\n\n\"The moral of the story is once you open a can of worms, you never really know what you're going to get,\" Donahue said of the redistricting battle. \"Or like Forrest Gump said, it's 'like a box of chocolates.'\"","summary":"\"There's still a lot of uncertainty going into 2026,\" one analyst told ABC News.","url":"https://abcnews.go.com/Politics/republicans-started-redistricting-war-win/story?id=127962734","image":"https://i.abcnewsfe.com/a/793ee738-159f-4a89-a007-849be6aefde6/redistricting-map-texas-gty-jt-251129_1764430532205_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-11-30 11:02:16","author":"Benjamin Siegel","authors":["Benjamin Siegel"],"language":"en","category":"politics","source_country":"us","sentiment":0.041},{"id":383595820,"title":"Chinese cyberattack campaign likely impacted every American, former FBI official says","text":"A former FBI official claims that it's likely every American has been impacted by a Chinese-state-sponsored cyberattack. International law enforcement agencies, including the FBI and National Security Agency, issued a joint advisory in September warning the public that CCP-sponsored actors are \"targeting\" many aspects of American lives, including telecommunications, government, transportation, lodging, and military infrastructure networks. The cyberattack wasn't limited to the U.S. and targeted many countries around the globe, according to the advisory. According to the international agencies, the three Chinese companies believed to be behind Salt Typhoon work for China's intelligence services, which include units in the People’s Liberation Army and Ministry of State Security. Through the information gathered during the cyberattacks, the Chinese intelligence services can \"identify and track their targets’ communications and movements around the world.\" FBI DIRECTOR PATEL LEADS CHARGE TO ROOT OUT CHINESE INFLUENCE ON US SOIL Cynthia Kaiser, a former high-ranking official in the FBI's cyber division, told the New York Times it's hard to envision a scenario where any American wasn't impacted by the hack. \"I can’t imagine any American was spared given the breadth of the campaign,\" she said. Those directly impacted by the cyberattack include senior U.S. government officials and prominent political figures whose communications were accessed, according to the FBI. TRUMP-APPOINTED FCC CHAIRMAN PROBES BIDEN CYBERSECURITY PROGRAM OVER CHINA CONCERNS Pete Nicoletti, chief information security officer at Check Point, told Fox News Digital that those behind the Salt Typhoon cyberattack had unprecedented access to phone calls being placed by Americans. \"They had full reign access,\" Nicoletti, said. \"So, you know, your grandmother calling you to remind you to pick up groceries was not a targeted person and they're gonna listen into that call. But Trump, Vance, Kamala Harris, and dozens of other US government officials were specifically targeted.\" Nicoletti said the Salt Typhoon hackers \"established a foothold and exfiltrated data for five years,\" which is \"almost unprecedented.\" Yet the cybersecurity expert says his greatest concern is not what Salt Typhoon may target in the future, but whether the group remains embedded inside companies and agencies that still haven’t discovered the intrusion. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"My biggest concern is they're still in various organizations and undetected,\" he said. \"So the thing that I worry about is not the next time that these guys hack somebody, it's what they're doing currently and who they're in.\" When discussing the cyberattack in December 2024, then-deputy national security adviser Anne Neuberger said the hackers worked to identify the owners of various devices, then spy on phone calls and text messages if they were \"government targets of interest.\" Fox News Digital's Landon Mion contributed to this report.","summary":"Former FBI official says likely every American impacted by Chinese Salt Typhoon cyberattack targeting US telecommunications networks in massive breach.","url":"https://www.foxnews.com/us/chinese-cyberattack-campaign-likely-impacted-every-american-former-fbi-official-says","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/xi-jinping-army.jpg","video":null,"publish_date":"2025-11-30 11:00:26","author":"Adam Sabes","authors":["Adam Sabes"],"language":"en","category":"politics","source_country":"us","sentiment":-0.047},{"id":383612506,"title":"Tennessee congressional race becomes unlikely test of blue wave","text":"Fresh off Democrats' domination in the off-year elections, a congressional race in Tennessee has become an unlikely test for whether a national blue wave is building that could produce a seismic shakeup in next year's midterm election.\n\nThe special election to fill the seat of retired Republican Rep. Mark Green, set for Tuesday, Dec. 2, was hardly on the national radar a month ago.\n\nNow, the race between Democrat Aftyn Behn, a 36-year-old liberal state representative, and Republican Matt Van Epps, a combat veteran, has Democrats dreaming of an unexpected House pickup. Meanwhile, top Republicans ‒ including President Donald Trump ‒ are circling the wagons and pumping in millions to try to stop a disaster.\n\nTennessee's 7th congressional district was never supposed to be competitive. It's the creation of Tennessee's Republican-controlled legislature, which drew its boundaries in 2022 by splitting Democrat-stronghold Nashville into three districts, each dominated by conservative rural counties and different Middle Tennessee suburbs. One was District 7, which includes parts of Nashville's Davidson County and 13 other countries.\n\nTrump won Tennessee's congressional District 7 by 22 percentage points over Kamala Harris in the 2024 election. But both Democrats and Republicans are bracing for a close election next week. A poll from Emerson College Polling/The Hill found Van Epps leading by only 2 percentage points, 48% to 46%, within the survey's margin of error.\n\nMore: 'A lifelong Girl Scout' from Knoxville to the statehouse, who is Aftyn Behn?\n\nEven if Behn doesn't win the race ‒ something that would have been unthinkable a few week ago ‒ a defeat by single-digits could signal major trouble for Republicans in the 2026 midterms.\n\n\"It's a sign of just how far the Republican Party has fallen and how much trouble they're in, not only in this election, but as we head into the midterms next year,\" Democratic campaign strategist Simon Rosenberg said. \"This is a weakened and struggling political party.\"\n\nRepublicans unleash last-minute attack blitz against Behn\n\nDemocratic hopes in reliably red Tennessee come as an NPR/PBS News Marist Poll taken Nov. 10 to 13 found Democrats have opened a sizeable 14-point lead nationally, 55%-41%, when voters are asked which party they plan to back in the midterms. It's the largest Democratic lead in the poll's so-called \"generic ballot\" since 2017, which came during Trump's first term.\n\nThe Nov. 4 off-year election, in which Democrats swept race in Virginia, New Jersey, New York and elsewhere, was widely interpreted as repudiation of Trump and his handling of inflation and the economy. Trump's approval rating has since dropped to a second-term low 36%, according to a Gallup poll released Nov. 28.\n\nIn response to a tighter-than-expected race, the main political action committee linked to Trump, MAGA Inc., has spent more than $1 million to boost Van Epps, with millions more coming from PACs tied to the Club for Growth and other conservative groups. The Democratic-backed House Majority PAC last week dropped a $1 million ad buy in the race.\n\nIn recent weeks, Republicans have unleashed an onslaught of attacks on Behn to try to paint her as a \"far-left lunatic\" they've labeled the \"AOC of Tennessee.\" That includes highlighting past social media posts from Behn questioning whether police should be dissolved, remarks that religion being prominent in the state legislature makes her \"uncomfortable,\" and commenting that \"men and women\" can give birth.\n\nMore: 'We sent a message.' 5 takeaways from Democrats' 2025 elections sweep\n\nTrump has held a pair of tele-town halls for Van Epps, and used his X account and its 109 million followers to urge Tennessean to vote for the GOP candidate. House Speaker Mike Johnson plans to campaign with Van Epps in the district on Dec. 1, the eve of Election Day.\n\nRepublicans fear their voters sleep-walking through an election that comes right after the Thanksgiving holiday, when Americans often tune out of politics.\n\n\"The RNC has made a targeted investment to ensure Republicans turn out and keep this Trump district red,\" Republican National Committee spokeswoman Kiersten Pels said in a statement. \"Aftyn Behn is a radical candidate wildly out of touch with TN-07, and with staff on the ground, an aggressive GOTV program, and nearly half a million dollars in this race, we're confident Matt Van Epps will hold the seat and Democrats won't gain an inch of momentum heading into 2026.\"\n\nOn the Democratic side, former Vice President Kamala Harris attended Nov. 18 rally in Nashville to urge supporters to vote for Behn, marking the 2024 Democratic nominee for president's return to the campaign trail.\n\nJane Kleeb, a vice chair of the Democratic National Committee, called the Tennessee congressional race \"an uphill battle\" for Democrats as she knocked on doors for Behn in Nashville recently. But she pointed to the recent off-year elections, which saw Democrats outperform Republicans with independent voters and win big in some down down-ballot races.\n\n“If this trend line continues, we'll be able to say that we have not only overperformed for Democrats ‒ we got Democrats off the couch who were frustrated with us and didn't vote in ‘24 ‒ but we're now changing the hearts and minds of independents and Republicans to be with us,” Kleeb said. \"So this is a critical race for our party.\"\n\nDems look to unabashed progressive to win red district\n\nBehn, a former community organizer and social worker, doesn't fit the same centrist profile as Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey, who helped deliver Democrats' strong performance on Nov. 4 with their lopsided, double-digit victories in gubernatorial races.\n\nNor does Behn match the typical southern Democrat trying to win a conservative seat.\n\nBefore she was elected to her Nashville state House seat in 2023, Behn burst onto the political scene as a a progressive activist. She was forcibly removed from Tennessee Republican Gov. Bill Lee's office in 2019 when she and others staged a sit-in to demand the resignation of a Republican lawmaker accused of sexual assault. She was also booted from the House chambers for interrupting proceedings.\n\nMore: 'Big tent': Democrats get mixed messages in 2025 election wins in NJ, VA, NYC\n\nIn her congressional race Behn has leaned into a similar affordability theme that carried Democrats in the off-year elections, highlighting her support to end the state's grocery tax and campaigning on lowering health cost. She has embraced a pragmatic slogan: \"feed kids, fix roads, and fund hospitals.\"\n\nBehn has an enthusiastic base of young, progressive voters and a robust social media presence, often posting videos from the front seat of her Jeep Wrangler.\n\n\"We are so close to winning this race, which is why these rumors are getting more wild, so I can't wait to see what they come up with next,\" Behn said in a recent video taken from her Jeep as she addressed some of the recent attacks.\n\nThe Trump-backed Van Epps, a West Point graduate and former lieutenant colonel in the Tennessee Army National Guard, is a former commissioner of the Tennessee Department of General Services.\n\nVan Epps has touted his endorsement from Trump and committed to \"advancing President Trump's America First agenda.\" It's a strategy that typically works in districts that voted overwhelmingly for Trump. However, the Emerson College poll found Trump's job approval is suddenly underwater in the district, with more voters disapproving of his job performance than approving by a 49%-47% margin.\n\nMore: From a wealthy Cleveland suburb to Afghanistan to Nashville, who is Matt Van Epps?\n\nRepublican political consultant Mike DuHaime, a former RNC political director, said Trump’s low approval rating is a big concern for Republicans in swing districts. Many Republicans are tying themselves closely to the president, and “In a red state it’ll work, in a red congressional district it’ll work,” DuHaime said.\n\n“But if you get into these swing districts you have to look at where Trump’s approval number is,” DuHaime said, adding: “All politics has become national and that’s very difficult in a swing area if the president loses popularity.”\n\nNathan Gonzales, who runs the nonpartisan election handicapping service Inside Elections, said it’s likely that the Behn overperforms but unlikely that she wins based on how Democrats have performed in other elections this year and the margin that Trump carried the district.\n\nBut even a close defeat could buoy Democrats, providing more evidence that the GOP is struggling to match Trump’s margins without him on the ballot. \n\n“The ingredients are in place for a good Democratic cycle,\" Gonzales said, adding: “When you look at what’s happened over the last 11 months, I’m not sure what the good news is for Republicans.\"\n\nRosenberg said a 10-point electoral shift in the national landscape in favor of Democrats could not only flip the House to Democratic control, but also open a path for Democrats to regain control of the Senate, which previously seemed a longshot. Republicans currently hold a 53-47 seat advantage in the Senate.\n\n\"This Tennessee race being competitive is confirmation that Republicans are now playing defense while we're playing offense,\" Rosenberg said. \"We're playing on their side of the field in a way that makes it far more likely that the House is going to flip and the Senate will be competitive next year.\"\n\nContributing: Vivian Jones of the Tennessean","url":"https://eu.usatoday.com/story/news/politics/2025/11/30/tennessee-congressional-race-becomes-unlikely-test-of-blue-wave/87481674007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/09/16/PNAS/86187787007-forum-02.JPG?auto=webp&crop=4678,2632,x0,y193&format=pjpg&width=1200","video":null,"publish_date":"2025-11-30 10:04:58","author":"Usa Today","authors":["Usa Today"],"language":"en","source_country":"us","sentiment":-0.293},{"id":383584344,"title":"White House Launches ‘Media Offender Of The Week’ Website Targeting ‘Fake News’","text":"The White House debuted a new page on its website Friday aimed at lambasting media outlets over “fake news” coverage of Trump administration actions.\n\nWhite House Press Secretary Karoline Leavitt announced the new website with a Friday post on X. “The Trump @WhiteHouse is holding the Fake News accountable like never before,” she said. (RELATED: Democrat Who Pushed Video Telling Troops To Disobey Trump Forced To Admit She Can’t Name One Illegal Order)\n\n The Trump @WhiteHouse is holding the Fake News accountable like never before. VISIT ➡️ https://t.co/9HDwjCK9dw pic.twitter.com/fuFYCKRIKP — Karoline Leavitt (@PressSec) November 28, 2025 \n\nThe website lists CBS News, The Boston Globe, and The Independent as the “Offenders of the Week” for their supposedly biased coverage of Trump calling out a video by the “Seditious Six” congressional Democrats who apparently sought to undermine the military’s chain of command if so-called “illegal” orders were issued.\n\nMichigan Sen. Elissa Slotkin and five other congressional Democrats who served in military or intelligence agencies appeared in a Nov. 18 video urging members of those services to disregard supposedly “illegal” orders issued by President Donald Trump.\n\nThe White House website claims the outlets failed to include context and misrepresented Trump’s calls for accountability over the video, which he said was trying to induce insubordination among military personnel.\n\n“The media misrepresented President Trump’s call for Members of Congress to be held accountable for inciting sedition by saying that he called for their “execution,'” the site stated.\n\n“The Democrats and Fake News Media subversively implied that President Trump had issued illegal orders to service members,” the site adds. “Every order President Trump has issued has been lawful. It is dangerous for sitting Members of Congress to incite insubordination in the United States’ [sic] military, and President Trump called for them to be held accountable.”\n\nThe site also includes a “Hall of Shame” listing other media outlets whose reporting the White House considered to suffer from a range of deficiencies such as “left-wing lunacy,” “mischaracterization,” “circular reporting,” “bias,” and “false claims.” Among outlets listed in the “Hall of Shame” are MSNBC (now known as MSNOW), CNN, The Washington Post, CBS News, The New York Times, and USA Today.\n\nMultiple corporate media outlets have faced trouble over flawed coverage of Trump in recent years, with some settling with the president after being confronted with lawsuits. The British Broadcasting Corporation (BBC) came under fire after The Telegraph obtained a dossier detailing how the network used spliced clips of Trump’s Jan. 6, 2021, speech that were 54 minutes apart during a documentary to make it appear he encouraged the riot at the Capitol building later that day.\n\nThe BBC apologized to Trump in a Nov. 13 letter from chairman Samir Shah after two top officials at the company resigned following the dossier’s release, saying the documentary would not air again. (RELATED: Journalist Dissects How Democrats Are Playing Games With Epstein Files To Smear Trump)\n\nTrump also secured a $15 million settlement with ABC in December 2024 after he sued the outlet March 19, 2024, for defamation. ABC’s “This Week” host George Stephanopoulos falsely stated Trump was found “liable for rape” during a contentious March 10, 2024, appearance by Republican South Carolina Rep. Nancy Mace.\n\nParamount also announced July 2, 2025 it had settled a $10 billion lawsuit filed by Trump over the editing of an October 2024 “60 Minutes” interview with then-Vice President Kamala Harris.\n\nThe Daily Caller News Foundation does not appear on the website at the time of publication.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Holding the Fake News accountable like never before'","url":"https://dailycaller.com/2025/11/30/white-house-launches-offender-week-site-targeting-biased-media-fake-news/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F11%2FDCNF-Media-Bias-Leavitt-Exposed-Featured.jpg","video":null,"publish_date":"2025-11-30 09:57:45","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","category":"politics","source_country":"US","sentiment":-0.341},{"id":383505800,"title":"Americans Pivot Left Amid Affordability Crisis as Trump’s Billionaire Focus Faces Backlash","text":"As the festive season approaches, many Americans are feeling increasingly disenchanted with the current occupant of the White House. They perceive him as prioritizing relationships with billionaires over addressing the inflationary pressures that are squeezing household finances.\n\nPresident Donald Trump frequently touts securing trillions in fresh investments from thriving tech companies, yet this achievement seems disconnected from the reality most Americans face: escalating grocery bills. His focus on deal-making appears misaligned with their immediate concerns.\n\nAccording to a recent online survey conducted by Daily Mail and J.L./Partners, which included approximately 1,250 registered U.S. voters, inflation and the rising cost of living top the list of grievances against Trump’s administration.\n\nThese issues, along with healthcare, pose significant challenges as Trump’s second term progresses into its second year, potentially undermining his tenure.\n\nSarah Selip, founder of 917 Strategies and a former GOP House aide, remarked to the Daily Mail that “affordability will be the buzzword of the 2026 election cycle.”\n\nConversely, respondents showed the least concern for issues such as cryptocurrency, small business regulations, artificial intelligence, and energy policy, despite these being areas where the president has heavily invested his time and resources.\n\nThe reticence over the lack of cash comes as the interests of blue-collar and white-collar workers have largely been replaced with those of tuxedo-wearing titans who get invited to White House soirees.\n\nSince September, the president has had at least four executive actions related to AI; he has also attended at least three tuxedo-laden dinner parties with executives like Meta’s Mark Zuckerberg and Apple’s Tim Cook and world leaders such as Saudi Arabia’s Mohammed bin Salman and the UK’s King Charles.\n\nBut voters don’t care about AI, crypto, small business regulations or infrastructure, the Daily Mail/JL Partners survey found. Those initiatives rank as the four lowest priorities among survey respondents.\n\n‘Voters are frustrated,’ Brittany Martinez, executive director of the right-leaning political firm Principles First, told the Daily Mail. ‘While the administration touts billion-dollar announcements and high-profile corporate deals, most Americans are focused on far more basic needs: whether they can afford groceries, gas, and a good life.’\n\nHowever, the White House was quick to blame the previous Democratic administration for consumer pricing woes.\n\n‘After four years of economic calamity under Biden, American families will continue to feel economic relief in the months ahead as the positive effects of massive tax cuts, deregulation, and energy dominance continue to materialize,’ White House spokeswoman Taylor Rogers told the Daily Mail. \n\nThe Daily Mail/J.L. Partners survey also found several other critical signals that may spell concern for Republicans with a year until the midterms.\n\nTrump matched his worst disapproval rating so far, 55 percent, as Vice President JD Vance and the rest of the Cabinet all saw declines in favorability.\n\n‘Through a combination of the shutdown, and one year on from the election, voters seem to have turned around and asked: ‘am I better off than I was a year ago?’. The answer for many – going by this poll – is no, or even that things have got worse,’ J..L. Partners founder James Johnson told the Daily Mail. \n\nMeanwhile, the approval rating for the Democratic Party and its top 2028 champions, like California Governor Gavin Newsom, Congresswoman Alexandria Ocasio-Cortez and former VP Kamala Harris, has ticked up.\n\nAll three of the aforementioned liberals would, at least at this moment, beat Vance or Secretary of State Marco Rubio in a hypothetical 2028 head-to-head matchup, the poll data showed.\n\n‘When families feel squeezed and Washington seems disconnected from their day-to-day reality, they naturally start exploring alternatives,’ Martinez said. ‘The growing openness to progressive candidates in this poll is beyond ideology — it’s about urgency.’\n\nIf the GOP takes its eyes off the proverbial affordability ball, it could strike out during the midterms. Democrats only need to flip three seats in the House and four in the Senate to take control of Congress. \n\n‘American families across the political spectrum are experiencing a growing sense of economic hopelessness,’ Republican strategist Tristan Shakespeare told the Daily Mail.\n\n‘When the average household can no longer afford groceries, housing, healthcare, and other basic essentials without falling further behind, it’s inevitable that people start searching for alternatives. Many feel abandoned by a system that claims to prioritize the broad public but consistently fails to deliver.’\n\nAnd that, he says, is leading to a rise in dissident political figures on the left and right.\n\n‘This disillusionment is fueling demands for systemic change—manifesting as calls for National Socialism from figures like Nick Fuentes on the right and Democratic Socialism from leaders like Zohran Mamdani on the left.’\n\nThe president’s 2024 campaign focused heavily on driving down prices that ticked up under former President Joe Biden, but so far, consumers have yet to register the savings. The poll found that Democrats are more trusted on cost-of-living policies than Republicans.\n\n‘He made massive, huge promises that everything was going to get better and that everything was Joe Biden’s everything was Joe Biden’s fault, that over the course of the last year, people have watched him spend more time on vanity projects and enriching himself than actually delivering for the American people,’ said Democratic strategist Mike Nellis. \n\nWhile the White House adds a new massive ballroom to host larger parties for its tuxedo-wearing allies, at a cost estimated to be around $300 million, voters remain frustrated with everyday prices.\n\nThe White House did not return the Daily Mail’s request for comment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAs the festive season approaches, many Americans are feeling increasingly disenchanted with&#8230;\n\n\nThis Post: Americans Pivot Left Amid Affordability Crisis as Trump&#8217;s Billionaire Focus Faces Backlash first appeared on Internewscast Journal","url":"https://internewscast.com/politics/americans-pivot-left-amid-affordability-crisis-as-trumps-billionaire-focus-faces-backlash/","image":"https://internewscast.com/wp-content/uploads/2025/11/Trumps-billionaire-obsession-backfires-as-Americans-turn-LEFT-to-rescue.jpg","video":null,"publish_date":"2025-11-30 02:40:10","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.153},{"id":383504942,"title":"White House Forced to Correct Childish Anti-Media Site","text":"undefinedRead MoreundefinedSettingsundefinedFull Screen (F)undefinedPlay (SPACE)\n\nHowever, the site was briefly taken down before reappearing with alterations. In the update, Fox News was removed as an “offender” after the White House incorrectly attributed questions asked in a press conference to a Fox News reporter.\n\n“Fox News asked the White House to correct it and now there’s a 404 error where the page once was,” Washington Post media reporter Scott Nover wrote on X. \n\nThe site, which is once again live, currently includes 31 “fake news offenses” from 21 publications, with The Washington Post, CBS News and MSNBC at the top of the leaderboard. \n\nTrump sued The Washington Post for defamation in 2020, but the case was dismissed by a federal judge in 2023. In July, the president received a $16 million settlement from CBS News over the editing of a 60 Minutes interview with Kamala Harris from 2024.\n\nThe new tracker is the latest move in the Trump administration’s anti-media campaign. Since January, journalists have been suspended from the Pentagon, removed from the White House press pack for critical coverage and news outlets have come under legal attack. \n\nStories logged on the site which the White House has taken objection to include: “Italian Pasta Is Poised to Disappear From American Grocery Shelves” from The Wall Street Journal, \"The View’s Whoopi Goldberg Makes Up a Song to Slam Trump for Building White House Ballroom\" from ABC News and “Republicans are Losing the Political Battle Over the Shutdown” from MSNBC. \n\n“The Trump White House is holding the Fake News accountable like never before,” White House Press Secretary Karoline Leavitt wrote a post announcing the site’s launch.\n\nThe site uses free infographics from Flourish, a data visualization app owned by U.K. graphic design company Canva, to illustrate its messaging.\n\nThe website is an inversion of the media’s historical attempts to track false and misleading claims made by President Donald Trump during his time in office.","summary":"Photo Illustration by Victoria Sunday/The Daily Beast/Getty Images/The White HouseThe White House has launched a new web page aimed at tracking what it deems “media bias” and inaccuracies—which itself contained inaccuracies.\n\nThe new “Media Bias” page went live on Friday, with the White House claiming it would help to expose “fake news.”\n\n“Tired of the Fake News? We’ve got the place for you,” the official White House X account wrote. “Get the FACTS. Track the worst offenders. See the Fake News EXPOSED.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/white-house-forced-to-correct-childish-anti-media-site/","image":"https://www.thedailybeast.com/resizer/v2/IFYDSPRJIJHMZPX2U5O3KT4BNU.jpg?smart=true&auth=a37a5334f94c0f7b19748e52007c0651c56c0d0be4de1d745cb4046ebf7474a2&width=1440&height=1080","video":null,"publish_date":"2025-11-30 02:21:55","author":"Jack Revell","authors":["Jack Revell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.436},{"id":383503178,"title":"The Media’s Double Standard on Presidential Age Is Crumbling","text":"That same playbook continues into Trump’s second term, as there’s a concerted effort to turn Trump into the next Joe Biden. The difference is that the facts won't cooperate this time, and even the media can't ignore the obvious contrast between the two men.\n\nFor years, the press insisted Biden was sharp and energetic, dismissing what Americans could plainly see with their own eyes. That charade finally collapsed during his disastrous June 2024 debate performance, forcing the media to admit what had been obvious all along — at least in conservative media. \n\nI get why the left is furious about Joe Biden. They blame him for Kamala Harris’s failed campaign, and insist that if he’d bowed out earlier or skipped a second-term bid, the outcome would look very different. Now they’re convinced they can turn the age issue into a weapon against Trump and squeeze some political advantage out of it. The New York Times published a hit piece arguing that Trump's second-term schedule is lighter and starts later in the day, suggesting that he is experiencing age-related fatigue.\n\nThe problem with this strategy is that Trump remains constantly available to the press, and frequently engages with reporters in ways Biden never did. Even MS NOW host Katy Tur, obviously no fan of the president, felt compelled to push back against the Times' characterization during an appearance on The Daily Beast Podcast. \"I think — not to get on the bandwagon and to push back a little bit — he is doing much more than, certainly Joe Biden did,\" Tur said. She added that Trump \"is out there in a way that past presidents haven't even been out there. He does give access. He's constantly on television.”\n\nICYMI: Trump’s Tariff Bombshell Is the Most Exciting News I’ve Heard\n\nTur acknowledged that Trump \"might be slowing down for him, and slowing down because he's getting up there in age,\" but she emphasized that \"he is still very much mobile.”\n\nHer conclusion was clear: Trump \"is very much still engaged.” The fact that Tur felt compelled to defend how much Trump accomplishes in a single day shows just how badly this new anti-Trump narrative is going to fail.\n\nThe contrast with Biden couldn't be starker. Biden's team was constantly calling early lids and shipping him off to Delaware for days at a time to recover. Tur herself recounted attending a Christmas party during the Biden years, where the former president addressed journalists around eight o'clock at night. \"You could not understand a word he was saying,\" she said flatly. \"It's different.”\n\nMS Now’s Katy Tur concedes: President Trump is “doing much more than Joe Biden did. He is out there in a way that past Presidents haven’t been out there. He does give access, he’s constantly on television.” pic.twitter.com/iQMqEErzMi— TV News Now (@TVNewsNow) November 28, 2025\n\nTrump may have surpassed Biden's record as the oldest elected president, but his energy level and accessibility are in a whole other league compared to Biden, and his critics in the media can’t deny it.\n\nIt was obvious from the beginning that the media’s attempt to portray Trump as the next Biden would fail. Voters notice the difference. Even his harshest critics acknowledge that the president demonstrates real stamina and maintains a full schedule, which undermines the story before it gains momentum. The public sees what is right in front of them, and no spin from the New York Times can change that reality.","url":"https://pjmedia.com/matt-margolis/2025/11/29/the-medias-double-standard-on-presidential-age-is-crumbling-n4946549","image":"https://media.townhall.com/cdn/hodl/2024/318/5a7d8348-eda9-4d3d-8913-fc5884e742a1.png","video":null,"publish_date":"2025-11-30 02:11:00","author":"Matt Margolis","authors":["Matt Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.375},{"id":383498874,"title":"'Things have to change, Britain is a mess. Trump is throwing his full weight behind Nigel': Inside the MAGA plot to make Farage Prime Minister... and why it could happen sooner than anyone thinks","text":"Donald Trump has vowed to ‘throw his whole weight’ behind Nigel Farage to help him to become Prime Minister by 2027, sources on both sides of the Atlantic have told The Mail on Sunday.\n\nThe level of co-operation between President Trump’s Maga (Make America Great Again) movement and Mr Farage’s Reform UK has ramped up significantly in recent months, adding discreet organisation and ‘synergies’ to the two leaders’ years-long friendship.\n\nAccording to the sources, Mr Trump does not expect Keir Starmer’s Government to last beyond 2027, and wants Mr Farage to be in place in Downing Street while he is still serving out his second term in the White House, due to end in January 2029.\n\nLast week’s tax-raiding, welfare-raising Budget has only cemented that view.\n\nA Reform UK source said: ‘The President thinks that the money markets will soon slam the door on Starmer, after concluding that Britain is a bad bet. When that happens the Government will fall and there will be a general election. He wants to do all he can behind the scenes to ensure that Nigel wins and gets a grip on the country’.\n\nThose synergies between the two camps were on display on Thursday at 5 Hertford Street, a private members’ club in London’s Mayfair which is the unofficial headquarters for Mr Farage, his moneymen and disaffected Tories flirting with the idea of defecting.\n\nA Reform-organised breakfast meeting to discuss the fallout from the Budget included both Mr Farage and his adviser James Orr, a Cambridge professor who has been described as a ‘Sherpa’ for US Vice-President JD Vance.\n\nDiscussions between the Trump and Farage camps have centred on how to turn Reform’s opinion poll lead into a Commons majority – and how to turn that into effective government. Senior figures in Reform, including financier Nick Candy, are focused on raising funds for an election campaign and emulating the US system, under which incoming presidents have a three-month transition period to prepare for government.\n\nA source said: ‘We need someone to head up a proper transition office so that we are ready to hit the ground running from day one.’\n\nSubstantial funds – up to £100 billion – are also being sought from ‘tech titans’ which would be used to stabilise the markets in the early days of a Farage administration.\n\nA source close to Mr Trump said: ‘The President believes Nigel Farage can – and will – be the UK’s next Prime Minister. This past week has been indicative of the mess Britain is in. Things have to change and Nigel is the man who can bring that change.\n\n‘The President has enormous respect for Nigel and has given him his full backing. His inner circle know him well and believe he represents the future for your country. Vice-President Vance thinks very highly of him.\n\n‘The President is prepared to throw his whole weight, and that of the Maga machine, to help Nigel win the next election. The view is that will come much sooner than 2029 and there has been constant dialogue between Farage, his team and the President and his advisers.’\n\nMr Farage last visited President Trump’s Florida base at Mar-a-Lago on November 7 when he received a Patriot Award – and a standing ovation as he collected it. The source said: ‘Nigel always gets a warm welcome here. It was only a flying visit but he met with the President privately. \n\n'The one thing President Trump values above all is loyalty. Nigel has been a loyal ally from day one.’ \n\nThe source added that Mr Trump ‘has not forgotten’ that Labour sent volunteers to the US to help Democrat rival Kamala Harris during last November’s election.\n\nMr Trump and his advisers watched Rachel Reeves’ Budget from Mar-a-Lago. An insider said: ‘There was dismay at what unfolded. This is a woman who tried to blame everyone, including Donald Trump, for the fact she was going to have to raise taxes. Now she’s been exposed as a liar.\n\n‘The issues facing the UK are the same issues Donald Trump campaigned on so successfully: unchecked migration, the cost of living, public safety. We have a team who can help Nigel win.’\n\nA source said it was ‘no coincidence’ that Dr Orr – who joined Vance’s family holiday to the Cotswolds this summer – is now a senior adviser to Farage. ‘Things are stepping up a gear,’ they said. ‘Nigel is the way forward and he has Trump’s full support.’","summary":"Donald Trump has vowed to 'throw his whole weight' behind Nigel Farage to help him to become Prime Minister by 2027, sources on both sides of the Atlantic have told The Mail on Sunday.","url":"https://www.dailymail.co.uk/news/article-15338249/Britain-Trump-throwing-weight-Nigel-MAGA-plot-Farage-Prime-Minister.html","image":"https://i.dailymail.co.uk/1s/2025/11/29/20/104300697-0-image-a-81_1764449570648.jpg","video":null,"publish_date":"2025-11-30 01:34:01","author":"Editor,Glen Owen","authors":["Editor","Glen Owen"],"language":"en","category":"politics","source_country":"gb","sentiment":0.113},{"id":383487410,"title":"After Prop. 50, San Diego may lose its only Republican in Congress as Democrats target Issa","text":"Eleven Democrats are vying to unseat Rep. Darrell Issa, a San Diego Republican, after California’s redistricting measure turned his reliably red district into a slightly blue one that will be a key swing race in next year’s midterm elections. Rep. Mike Levin, a San Clemente Democrat, can breathe easier, as Proposition 50 carves out new boundaries that make his swing district more safely Democratic. The new voting map reflects California’s bid to offset Texas’ effort to secure control of the House by adding five Republican seats in November. California voters approved the redistricting plan proposed in Proposition 50 by nearly 20 points in a special election this month. Both redistricting efforts are embroiled in litigation. On Tuesday a federal court blocked Texas from using its new maps, finding that they would harm Black and Latino voters in that state. Last week the U.S. Department of Justice sued to overturn California’s maps, arguing that they unlawfully considered Latino voters in the new districts. If California’s redistricting plan withstands that challenge, the new voting map could help Democrats flip the lone Republican seat in San Diego. The 48th Congressional District, represented by Issa, will switch from a 12-point Republican advantage to a 4-point Democratic lead, based on voter registration. The more favorable odds have drawn a wide field of challengers, including Issa’s former opponent, Ammar Campa-Najjar, who lost to Issa in a previous version of the district in 2020, San Diego City Council Member Marni von Wilpert, and several contenders from the Coachella Valley. The passage of the redistricting measure triggered a statewide game of musical chairs, setting in motion the chairs as well as the players. The current 48th District covers conservative East County San Diego communities. The new district moves west and north, losing much of that backcountry and adding the North County San Diego cities of Escondido, San Marcos and Vista. It also includes ultra-liberal Palm Springs in Riverside County, where Democratic voters outnumber Republicans by more than 4 to 1. Those new lines absorb part of the current 41st District in Riverside County, represented by longstanding Republican Rep. Ken Calvert. His current district will move entirely to Los Angeles and Orange County, so Calvert plans to run in the new 40th District in Riverside and Orange County against fellow Republican Rep. Young Kim. Meanwhile, three Coachella Valley Democrats who were among eight challengers against Calvert for his Riverside County district have now jumped into the race against Issa. Attorney Anuj Dixit, school board member Abel Chavez and entrepreneur Brandon Riker all switched gears to campaign for the new 48th District. Another Palm Springs candidate, Marc Iannarino, a Navy veteran and bartender, threw his hat in the ring. Political observers note that the Coachella Valley candidates come from a smaller and more liberal portion of the new district. “These are three candidates who really know Palm Springs, but they’ve got to reach out to moderate, purplish voters and to know who San Diego voters are,” said Dan Rottenstreich, campaign manager for von Wilpert. “This is not a deep blue seat,” Rottenstreich said. “This is going to be among the top five heavily contested races in the country.” Von Wilpert and Campa-Najjar, the two highest profile contenders, each argue they’re the best candidate to navigate the slim partisan advantage. Both have prominent endorsements. Former Sen. Barbara Boxer, numerous state and local leaders and the Democratic women’s political action committee Emily’s List are supporting von Wilpert. A slate of congress members including San Diego Reps. Mike Levin, Scott Peters and Sara Jacobs have weighed in for Campa-Najjar. All the challengers face a well-established incumbent for a district that — despite its partisan shift — will still be a toss-up. Von Wilpert, a former prosecutor in the San Diego city attorney’s office, won her City Council seat in 2020, running against a Republican opponent in a conservative-leaning district, Rottenstreich said. “With these new lines, CA-48 becomes one of the most competitive races in America, and a must-win seat to flip the House,” von Wilpert said in a statement on election day. “I’m the only candidate in this race who’s proven I can win tough elections, flip red seats blue, and deliver results for working families.” Campa-Najjar, a Navy officer and former Obama campaign official, argues that his experience running against Issa in 2020 positions him to win Democratic and independent votes in the new district. “I see it as a rematch between me and Darrell Issa, with 10 other candidates,” he said. “I’m not running against them. I have great respect for them, but only one of us will win.” Although he lost in 2020, Campa-Najjar said he gained a foothold in the conservative district, getting more votes than expected in the majority Republican district. Issa has served in Congress for more than 20 years in different districts. He originally held the 49th District — now represented by Levin — from 2001 through 2019, and retired when that district became competitive. In 2020, he won his current seat, holding it for the next two terms after it was redrawn during statewide redistricting in 2021. Issa declined to answer questions from CalMatters, but in a statement he called Proposition 50 an “unprecedented purely partisan campaign that pitted neighbor against neighbor and divided the state as never before.” Despite that, Issa said he plans to run again: “I’m not going anywhere. I’ll continue to represent the people of California — regardless of their party or where they live.” The general election will reflect voters' opinions about President Trump; historically the president’s party usually loses ground in the midterms. Issa, a close Trump ally who has supported the president’s policies and nominated him for a Nobel Peace Prize, will have to lean into that record, Kousser said. “He has to embrace him with his base and make the case to the middle that the Trump presidency has been good for their district,” he said. The crowded field of Democrats could thwart some candidates in the primary, Kousser said. But it will likely benefit the party in the general election next November, forcing challengers to campaign early and gain traction with voters. “Whoever emerges as the Democratic candidate is going to be battle-tested in that district,” he said. The redistricting measure also shored up vulnerable Democratic seats, including Levin’s 49th District. It shifts south, adding coastal San Diego communities of La Jolla and Torrey Pines. Now 65% of the current district is in San Diego County; in the new district that climbs to 81%, Levin said. With that come more Democratic voters, and even more left-leaning voters. The current district has a 2% margin of Democratic voter registration, which jumps to 4% under the new lines. But the Democratic advantage jumps to 12% when you compare the number of votes for former Vice President Kamala Harris vs. Trump in last year’s election. That positions Levin more securely in his reelection race. He faces Republican San Diego County Supervisor Jim Desmond, along with two other Republicans and a nonpartisan candidate. “The southern shift of that district makes it more blue in terms of the democratic registrations, and the political leanings of the independents,” said Paul Mitchell, the political data expert who drew California’s new voting lines. “So that district for him is a big improvement.” Sullivan Brennan writes for CalMatters.","summary":"Eleven Democrats are vying to unseat Rep.","url":"https://www.latimes.com/california/story/2025-11-29/after-prop-50-san-diego-may-lose-its-only-republican-in-congress-as-democrats-target-issa","image":"https://ca-times.brightspotcdn.com/dims4/default/0741101/2147483647/strip/false/crop/4896x3264+0+0/resize/1486x991!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F14%2F14%2F6c809bf50ce95fe05e3303b8b089%2Fimg-sd-2948100-la-pol","video":null,"publish_date":"2025-11-29 22:31:05","author":"Deborah Sullivan Brennan","authors":["Deborah Sullivan Brennan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.113},{"id":383478944,"title":"Trump, Thank God","text":"This year, I’m thanking God for Donald Trump. Imagine a world without him.\n\nPresident Kamala Harris would be ordering 100,000 American soldiers to defend the front lines in Ukraine this winter. Wars would be raging around the world. She’d have removed any remaining barriers to entry for the entirety of the world’s poorest and most culturally alien immigrants. All pushback against sexual medical mutilations of minors would cease, and trans pediatric clinics would be awash in federal funds. DEI rules would increase institutional racism at every federal institution, university, and corporation.\n\nMassive tax increases would make today’s inflated prices look good. The constant sight of Vice President Tim Walz on TV would catastrophically lower national testosterone reserves dramatically. The birth rate would enter an unrecoverable spiral, and Alejandro Mayorkas would spike the football and declare victory on the completion of the Great Migration. Meanwhile, Donald Trump would be in prison for life as a political enemy. In protest, there would be mass disengagement from civic life as people who realized their country was gone quit the military, quit law enforcement, and quit even identifying as American.\n\nIt would have been the end of the end of the end.\n\nAnd yet: prices are still too high. The birth rate isn’t bouncing back. DOGE has been defunded. Around 2 million illegals have been deported or left voluntarily since January. At that rate, we may see a total of 8 million deported in four years — which is mind-bogglingly good, but far from the 20–50 million entrants who should not be here. The H-1B visa program is still being abused to ruin citizens’ working lives. Our biggest cities remain unrecognizable to those who grew up in them. Local crime — not really under the jurisdiction of the president — produces lurid and insane murder stories that involve felons with dozens and dozens of arrests allowed to roam the streets freely by woke DEI judges who continue to practice “sentencing reform” religiously.","url":"https://hotair.com/headlines/2025/11/29/trump-thank-god-n3809355","image":null,"video":null,"publish_date":"2025-11-29 22:00:00","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.389},{"id":383496328,"title":"Volkswagen launches pickup with popular feature that's been ripped from trucks for a decade","text":"Volkswagen launches pickup with popular feature that's been ripped from trucks for a decade\n\nREAD MORE: Sports cars are dying - I checked the pulse of survivors\n\nBy BEN SHIMKUS, US CONSUMER REPORTER\n\nPublished: 13:07 GMT, 29 November 2025 | Updated: 19:38 GMT, 29 November 2025\n\nVolkswagen builds a slate of fun-loving, trendy vehicles — like the Taos SUV, Golf hatch, or ID. Buzz electric van. \n\nBut in America, where the Ford F-150 and Chevy Silverado pickups have maintained sales dominance for decades, VW doesn't make a single truck for the consumer market. \n\nScout is supposed to change that. \n\nVolkswagen bought the rights to revive the iconic Scout brand in 2021, and the first models — the Traveler SUV and Terra pickup — are expected to hit driveways in late 2027. \n\nOriginally built by International Harvester, the mid-century Scout was a boxy, go-anywhere truck that looked like early Ford Broncos and Chevy Blazers. \n\nIt faded out in the 1980s, but VW is bringing it back, with a unique twist to the engine, in hopes of finally getting a foothold in America's truck-obsessed market. \n\nAnd this month, VW showed off the final prototype, and one throwback detail instantly stood out. \n\nThe front row has a three-seat bench. It looks like the kind of bench that used to be standard in classic American trucks, with room for a driver and two adults. \n\nPickup trucks, which used to have bench seats with largely flat floors, have turned to more captain's chairs and easily-accessible cupholders\n\nScout has two seating arrangements in its pickup: two captain's chairs or a three-seater bench (pictured above)\n\nTim Walz, Kamala Harris' pick for second in command during the 2024 election, owns a Scout. He gave car tips from his YouTube while fixing the truck during the campaign \n\nOver the past decade, giant consoles, knobby gear selectors, and captain's chairs pushed the classic seating option out of trucks. \n\nPickups that maintained the bench often forced mid-seat riders to straddle floor-mounted cupholders. \n\nScout thinks it cracked the space problem. \n\nBy using the truck's battery setup to keep the floor perfectly flat, VW managed to fit an optional bench in the front and a flat floor in the second row, seating six in total.\n\nAnd that retro touch seems to be hitting a nerve.\n\nScout CEO Scott Keogh says he's received more than 130,000 non-binding reservations so far — each costing $100. \n\nAnd nearly eight out of 10 of those potential buyers aren't asking for full EVs. \n\nThey want extended-range electric vehicles, or EREVs: trucks that drive on electricity but use a gas engine as an onboard generator to recharge the battery on long trips.\n\nScout is planning two versions of the truck: a dedicated EV and a battery-powered truck with a gas generator on board\n\nThe Scout brand was popular in the 1960s as an alternative to Jeep, Chevy, and Ford\n\nBLACK FRIDAY SALE\n\nLucrative jobs you can walk into today with NO experience and NO degree - and some pay over $100,000\n\n'The market clearly has spoken, without a doubt, and they like the EREV technology, full stop,' Keogh told Bloomberg, noting the system gives the truck enough juice for 500 miles and increases towing capacity. 'This is EV without the drama.'\n\nThat preference is part of a global trend. \n\nChinese automakers are already selling EREVs at a massive scale, European sales are climbing, and US buyers have cooled on pure EVs since losing access to the $7,500 federal tax credit.\n\nAnd that political shift is reshaping Scout itself.\n\nThe brand that VW originally pitched as a pure electric revival is now being repositioned as a mostly hybrid lineup. \n\nKeogh told Bloomberg the company isn't dropping the roughly $60,000 starting price to compensate for the missing tax credit and doesn't think it needs to.\n\nThe pivot also reflects the broader EV slowdown. Ford is reportedly weighing whether to kill the F-150 Lightning, Tesla's Cybertruck has struggled to convert hype into mass sales, and Dodge nixed its electric truck plans altogether.\n\nScout's CEO is confident in his company's approach to combine a gas generator with a battery engine: 'They like the EREV technology, full stop'\n\nScout is planning on rolling out its first two vehicles from its South Carolina plant in 2027 \n\nIndependent automotive analysts said automakers made a mistake when rolling out pickup trucks as their first all-electric vehicles, because batteries still struggle with common truck activities like rugged terrain, towing, and inclement weather. \n\nKeogh also said he's open to killing the Terra if sales don't pick up.\n\nEven so, VW is betting big. \n\nA new $2 billion factory in South Carolina will build the SUV and pickup, with room to potentially assemble Audi models on the same platform. \n\nScout is targeting the heart of the US profit pool — truck and SUV segments that make up roughly 40 percent of industry earnings — and leaning heavily into the idea of an American-made truck built for American buyers.\n\nShare or comment on this article:\nVolkswagen launches pickup with popular feature that's been ripped from trucks for a decade\n\nAdd comment","summary":"Americans are excited about the feature coming back, with more than 130,000 non-binding reservations made so far.","url":"https://www.dailymail.co.uk/yourmoney/cars/article-15329139/volkswagen-scout-pickup-bench-seat.html","image":"https://i.dailymail.co.uk/1s/2025/11/26/20/104219309-0-image-a-23_1764189744815.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/07/3837730750279731089/1024x576_MP4_3837730750279731089.mp4","publish_date":"2025-11-29 19:38:55","author":"Ben Shimkus,Editor","authors":["Ben Shimkus","Editor"],"language":"en","source_country":"gb","sentiment":0.046},{"id":383454468,"title":"'Damn Him!': Rosie O'Donnell Claims Her Autistic Child Blames Trump For 'Forcing' Them To Move to Ireland","text":"Rosie O'Donnell has claimed that her autistic child is furious at Donald Trump, blaming him for 'forcing' their family to leave the United States. Speaking on CNN's Jim Acosta Show, the actress and comedian said her youngest child Clay, who is non‑binary, slammed their hand on the table and shouted: 'Damn him. Damn Trump.'O'Donnell explained that her child believed Trump had 'made us move in order for our own safety' and was now 'destroying the country'. The 63‑year‑old former talk show host relocated to Ireland in January 2025, days before Trump's inauguration, describing the move as a 'self‑imposed exile' after his landslide victory over Kamala Harris.Family Impact and Celebrity ExileO'Donnell told the CNN host that she did not 'want to give' her defiance of Trump to her child, adding: 'I did 22 years. I don't really need to do [it] anymore, and I don't want my kid to be so affected by it.' She acknowledged that her child's autism made their reaction more intense, but also said they 'recognise what's going on'.Her decision to leave the US reflects a broader trend of celebrities relocating abroad in response to political shifts. She has described life in Ireland as 'pretty wonderful', praising the kindness and warmth of locals, while also admitting she misses aspects of the US.Online BacklashThe comments quickly went viral, drawing widespread criticism on social media. One user wrote: 'Rosie can't even take responsibility for her own decision to move to Ireland. Her therapist deserves hazard pay.' Another said: 'Trump didn't make them move anywhere. Rosie O'Donnell needs to get checked out for the blatant case of TDS she has,' a reference to the acronym for 'Trump Derangement Syndrome'.Others accused her of projecting political anger onto her child, with one remarking: 'She needs to take responsibility for her parental decisions. She has free will and she used it to uproot her family in a fit of pique.'Longstanding Feud With TrumpO'Donnell's remarks are the latest chapter in her long feud with Trump, which dates back nearly two decades. She has often been singled out by him in speeches and social media posts, claiming that he 'sort of uses me as a punchline whenever he feels the need'.In September, Trump threatened to revoke her US citizenship, writing on Truth Social: 'She is not a Great American and is, in my opinion, incapable of being so.' He later escalated by calling her 'a Threat to Humanity' and suggesting she should 'remain in the wonderful Country of Ireland, if they want her'.The feud has also spilt into diplomatic moments. During a meeting with Irish Taoiseach Micheál Martin in Washington, Trump joked: 'Did you know you have Rosie O'Donnell? You're better off not knowing.' O'Donnell later said she was troubled by the remark, arguing that it disrespected Ireland's leader.A Personal Feud in the Political ArenaO'Donnell's claim resonates because it combines personal family struggles with political polarisation. Her child's anger, expressed in the phrase 'Damn him!', has become a viral soundbite, fuelling debate about whether celebrities should frame political decisions as forced exile.The backlash underscores how celebrity political statements can spark intense reactions, especially when they involve children. Social media users accused O'Donnell of projecting her political anger onto her family, while others mocked her decision to relocate abroad.The controversy has kept her long-running feud with Mr Trump firmly in the spotlight. Her latest comments, tied to her child's frustration, have reignited that feud and ensured her move abroad remains a trending topic in both US and Irish media, highlighting the impact of political decisions on families.","url":"https://www.ibtimes.co.uk/damn-him-rosie-odonnell-claims-her-autistic-child-blames-trump-forcing-them-move-ireland-1758969","image":"https://d.ibtimes.co.uk/en/full/1736987/rosie-odonell.png?w=1600&h=900&q=88&f=5b7c8c14ad5a012e098a1f76f49aa133","video":null,"publish_date":"2025-11-29 19:04:06","author":"Bernadette B. Tixon","authors":["Bernadette B. Tixon"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.009},{"id":383492930,"title":"GOP State Senator Balks at Redistricting After Trump Again Uses the R-Word","text":"On Thursday, President Donald Trump once again found it acceptable to use the r-word, directing it towards Minnesota Governor Tim Walz, in a Truth Social post which also attacked Somali immigrants in the state. \n\n“The seriously [r-tarded] Governor of Minnesota, Tim Walz, does nothing, either through fear, incompetence, or both,” Trump posted.\n\nFor Republican Indiana State Senator Michael Bohacek, Trump’s most recent use of this anti-disability slur was “the final straw” in his decision not to support Indiana redistricting in support of Republicans winning more seats. On Friday, Rep. Bohacek posted the following on Facebook:\n\nMany of you have asked my position on redistricting. I have been an unapologetic advocate for people with intellectual disabilities since the birth of my second daughter. Those of you that don’t know me or my family might not know that my daughter has Down Syndrome. This is not the first time our president has used these insulting and derogatory references and his choices of words have consequences. I will be voting NO on redistricting, perhaps he can use the next 10 months to convince voters that his policies and behavior deserve a congressional majority.\n\nIn a Facebook comment, Bohacek’s wife, Melissa, said she supported her husband, writing, “for families like ours, hearing the same mocking, derogatory language from our president isn’t abstract. He didn’t almost say or do something hurtful, he did.”\n\nAccording to the Indy Star, the Indiana State House of Representatives is set to meet on December 1 to discuss a redistricting map, and the Indiana State Senate is supposed to vote on the map on December 8. \n\nAs I’ve previously outlined, Trump has a long history of making ableist statements and holding deeply harmful ideas about disability. In October 2024, at a dinner for Republican donors, Trump referred to then-Democratic Presidential nominee Kamala Harris the r-word. He also has a pattern of referring to people he doesn’t like as “intellectually disabled” in a negative way, underlining his ableist views.\n\nThe National Down Syndrome Society also condemned Trump’s latest use of the r-word, writing that “as the language used by our leaders carries significant weight in shaping actions and societal attitudes toward individuals with disabilities, we are dismayed and disheartened that President Trump used this harmful term in a recent social media post.”","summary":"On Thursday, President Donald Trump once again found it acceptable to use the r-word, directing it towards Minnesota Governor Tim Walz, in a Truth Social post which also attacked Somali immigrants in the state. &#8220;The seriously [r-tarded] Governor of Minnesota, Tim Walz, does nothing, either through fear, incompetence, or both,&#8221; Trump posted. For Republican Indiana [&#8230;]","url":"https://www.motherjones.com/politics/2025/11/gop-state-senator-balks-at-redistricting-after-trump-again-uses-the-r-word/","image":"https://www.motherjones.com/wp-content/uploads/2025/11/20251125_znp_l312_043.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-11-29 18:42:50","author":"Julia Métraux,Katherine Dailey","authors":["Julia Métraux","Katherine Dailey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.161},{"id":383449240,"title":"How fraud swamped Minnesota’s social services system on Tim Walz’s watch","text":"The fraud scandal that rattled Minnesota was staggering in its scale and brazenness.\n\nFederal prosecutors charged dozens of people with felonies, accusing them of stealing hundreds of millions of dollars from a government program meant to keep children fed during the COVID-19 pandemic.\n\nAt first, many in the state saw the case as a one-off abuse during a health emergency. But as new schemes targeting the state’s generous safety net programs came to light, state and federal officials began to grapple with a jarring reality.\n\nOver the last five years, law enforcement officials say, fraud took root in pockets of Minnesota’s Somali diaspora as scores of individuals made small fortunes by setting up companies that billed state agencies for millions of dollars’ worth of social services that were never provided.\n\nFederal prosecutors say 59 people have been convicted in those schemes so far and that more than $1 billion in taxpayers’ money has been stolen in three plots they are investigating.\n\nOutrage has swelled among Minnesotans, and fraud has turned into a potent political issue in a competitive campaign season. Gov. Tim Walz and fellow Democrats are being asked to explain how so much money was stolen on their watch, providing Republicans, who hope to take back the governor’s office in 2026, with a powerful line of attack.\n\nMany Somali Americans in Minnesota say the fraud has damaged the reputation of their entire community, around 80,000 people.\n\nDebate over the fraud has opened new rifts between the state’s Somali community and other Minnesotans, and has left some Somali Americans saying they are unfairly facing a new layer of suspicion against all of them, rather than the small group accused of fraud. Critics of the Walz administration say the fraud persisted partly because state officials were fearful of alienating the Somali community in Minnesota. Walz, who has instituted new fraud prevention safeguards, defended his administration’s actions.\n\nThe episode has raised broader questions for some residents about the sustainability of Minnesota’s Scandinavian-modeled system of robust safety net programs bankrolled by high taxes. That system helped create an environment that drew immigrants to the state over many decades, including tens of thousands of Somali refugees after their country descended into civil war in the 1990s.\n\n“No one will support these programs if they continue to be riddled with fraud,” Joseph H. Thompson, the federal prosecutor who has overseen the fraud cases, said in an interview.\n\nThe first public sign of a major problem in the state’s social services system came in 2022, when federal prosecutors began charging defendants in connection to a program aimed at feeding hungry children. The prosecutors focused on a Minneapolis nonprofit organization called Feeding Our Future, which became a partner to dozens of local businesses that enrolled as feeding sites.\n\nState agencies reimbursed the group and its partners for invoices claiming to have fed tens of thousands of children. In reality, federal prosecutors said, most of the meals were nonexistent, and business owners spent the funds on luxury cars, houses and even real estate projects abroad.\n\nBehind the scenes, as federal investigators sifted through bank records and interviewed witnesses, they said they realized the meals fraud was not an isolated incident. In September, prosecutors charged nine people in two new plots tied to public funds meant for those in need.\n\nIn one case, hundreds of providers were reimbursed for assistance they claimed to have provided to people at risk for homelessness, though federal authorities said services weren’t provided.\n\nThe program’s annual cost ballooned to more than $104 million last year, authorities said, from a budgeted projection of $2.6 million when it began in 2020. Two of eight people charged in the scenario have pleaded guilty; six others have pleaded not guilty and are awaiting trial.\n\nIn another program, aimed to provide therapy for autistic children, prosecutors said providers recruited children in Minneapolis’ Somali community, falsely certifying them as qualifying for autism treatment and paying their parents kickbacks for their cooperation.\n\nProsecutors have so far charged one provider, Asha Farhan Hassan, 29, with wire fraud. They say she and business partners stole $14 million.\n\nHassan is of Somali ancestry, as are all but eight of the 86 people charged in the meals, housing and autism therapy fraud cases, according to prosecutors. A vast majority are American citizens, by birth or naturalization.\n\nA report by Minnesota’s nonpartisan Office of the Legislative Auditor about the lapses that enabled the meals fraud later found the threat of litigation and of negative press affected how state officials used their regulatory power.\n\nKayseh Magan, a Somali American who formerly worked as a fraud investigator for the Minnesota attorney general’s office, said elected officials in the state were reluctant to take more assertive action in response to allegations in the Somali community.\n\n“There is a perception that forcefully tackling this issue might cause political backlash among the Somali community, which is a core voting bloc” for Democrats, Magan said.\n\nThompson said he believed race sensitivities had played a major role in the rise of fraud. As pandemic assistance was disbursed, the state was also reeling from the killing of George Floyd by a Minneapolis police officer in May 2020, he said.\n\n“This was a huge part of the problem,” Thompson said during an interview. “Allegations of racism can be a reputation or career killer.”\n\nWalz, Minnesota’s second-term governor, who gained national attention last year as Kamala Harris’ running mate in a White House bid, said claims of racism did not hinder his administration’s response to fraud.\n\nWalz has said his administration may have erred on the side of generosity during the pandemic as the state pushed out large sums of money quickly, seeking to keep Minnesotans housed, fed and healthy.\n\n“The programs are set up to move the money to people,” Walz said in an interview. “The programs are set up to improve people’s lives, and in many cases, the criminals find the loopholes.”\n\nWalz, who is seeking a third term next year, has created a new task force to pursue fraud cases; made it easier for state agencies to share information with one another; and announced plans for new technology, including artificial intelligence tools, to spot suspicious billing practices.\n\n“The message here in Minnesota,” Walz said, “is if you commit a crime, if you commit fraud against public dollars, you are going to go to prison.”\n\nSomali residents’ experiences have been challenging at times, as many in the community contended with poverty, unemployment and language barriers. Few episodes have left fissures as deep as the fraud scandal.\n\nAhmed Samatar, a professor at Macalester College who is a leading expert in Somali studies, said a reckoning over the fraud and its consequences for Minnesota was overdue. Samatar said Somali refugees who came to the United States after their country’s civil war were raised in a culture in which stealing from the country’s dysfunctional and corrupt government was widespread. Minnesota, he said, proved susceptible to rampant fraud because it is “so tolerant, so open and so geared toward keeping an eye on the weak.”\n\nBut some Somali Americans who have nothing to do with social service agencies said they had come to feel under siege amid all the fraud allegations and political accusations.\n\n“The actions of a small group have made it easier for people already inclined to reject us to double down,” said Abdi Mohamed, a filmmaker in Minneapolis. “The broader Somali community — hardworking, family-oriented, deeply committed to Minnesota — is left carrying that burden.”\n\nThis article originally appeared in The New York Times.","summary":"The fraud scandal that rattled Minnesota was staggering in its scale and brazenness.","url":"https://www.twincities.com/2025/11/29/how-fraud-swamped-minnesotas-social-services-system-on-tim-walzs-watch-2/","image":"https://www.twincities.com/wp-content/uploads/2025/11/unnamed-file-2193.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-29 18:34:01","author":"Ernesto Londoño","authors":["Ernesto Londoño"],"language":"en","source_country":"us","sentiment":-0.354},{"id":383372994,"title":"Trump's billionaire obsession backfires as Americans turn LEFT to rescue them from affordability crisis","text":"As the holidays roll in, Americans are feeling less jolly about the man in the White House who they see as spending more time cozying up to billionaires than dealing with an inflation crunch that's draining family budgets.\n\nWhile President Donald Trump brags about locking down trillions in new investments from booming tech corporations, most Americans are experiencing sticker shock at the grocery store. Trump's deal-making is less of their concern. \n\nInflation and the cost of living are the leading sources of dissatisfaction for Trump’s administration, according to the latest Daily Mail/J.L./Partners online poll of roughly 1,250 US registered voters.\n\nThose twin issues, along with healthcare, are threatening to unravel Trump's second term as it head into its second year. \n\n'Affordability will be the buzzword of the 2026 election cycle,' 917 Strategies founder and former GOP House aide Sarah Selip told the Daily Mail. \n\nInversely, respondents were least concerned with cryptocurrency, small business regulations, artificial intelligence and energy policy - all of which the president has spent significant time and effort on.\n\nThe reticence over the lack of cash comes as the interests of blue-collar and white-collar workers have largely been replaced with those of tuxedo-wearing titans who get invited to White House soirees.\n\nSince September, the president has had at least four executive actions related to AI; he has also attended at least three tuxedo-laden dinner parties with executives like Meta’s Mark Zuckerberg and Apple’s Tim Cook and world leaders such as Saudi Arabia’s Mohammed bin Salman and the UK’s King Charles.\n\nBut voters don’t care about AI, crypto, small business regulations or infrastructure, the Daily Mail/JL Partners survey found. Those initiatives rank as the four lowest priorities among survey respondents.\n\n‘Voters are frustrated,' Brittany Martinez, executive director of the right-leaning political firm Principles First, told the Daily Mail. 'While the administration touts billion-dollar announcements and high-profile corporate deals, most Americans are focused on far more basic needs: whether they can afford groceries, gas, and a good life.'\n\nHowever, the White House was quick to blame the previous Democratic administration for consumer pricing woes.\n\n'After four years of economic calamity under Biden, American families will continue to feel economic relief in the months ahead as the positive effects of massive tax cuts, deregulation, and energy dominance continue to materialize,' White House spokeswoman Taylor Rogers told the Daily Mail. \n\nThe Daily Mail/J.L. Partners survey also found several other critical signals that may spell concern for Republicans with a year until the midterms.\n\nTrump matched his worst disapproval rating so far, 55 percent, as Vice President JD Vance and the rest of the Cabinet all saw declines in favorability.\n\n'Through a combination of the shutdown, and one year on from the election, voters seem to have turned around and asked: ‘am I better off than I was a year ago?’. The answer for many – going by this poll – is no, or even that things have got worse,' J..L. Partners founder James Johnson told the Daily Mail. \n\nMeanwhile, the approval rating for the Democratic Party and its top 2028 champions, like California Governor Gavin Newsom, Congresswoman Alexandria Ocasio-Cortez and former VP Kamala Harris, has ticked up.\n\nAll three of the aforementioned liberals would, at least at this moment, beat Vance or Secretary of State Marco Rubio in a hypothetical 2028 head-to-head matchup, the poll data showed.\n\n‘When families feel squeezed and Washington seems disconnected from their day-to-day reality, they naturally start exploring alternatives,' Martinez said. 'The growing openness to progressive candidates in this poll is beyond ideology — it’s about urgency.'\n\nIf the GOP takes its eyes off the proverbial affordability ball, it could strike out during the midterms. Democrats only need to flip three seats in the House and four in the Senate to take control of Congress. \n\n‘American families across the political spectrum are experiencing a growing sense of economic hopelessness,’ Republican strategist Tristan Shakespeare told the Daily Mail.\n\n‘When the average household can no longer afford groceries, housing, healthcare, and other basic essentials without falling further behind, it’s inevitable that people start searching for alternatives. Many feel abandoned by a system that claims to prioritize the broad public but consistently fails to deliver.’\n\nAnd that, he says, is leading to a rise in dissident political figures on the left and right.\n\n‘This disillusionment is fueling demands for systemic change—manifesting as calls for National Socialism from figures like Nick Fuentes on the right and Democratic Socialism from leaders like Zohran Mamdani on the left.’\n\nThe president’s 2024 campaign focused heavily on driving down prices that ticked up under former President Joe Biden, but so far, consumers have yet to register the savings. The poll found that Democrats are more trusted on cost-of-living policies than Republicans.\n\n‘He made massive, huge promises that everything was going to get better and that everything was Joe Biden's everything was Joe Biden's fault, that over the course of the last year, people have watched him spend more time on vanity projects and enriching himself than actually delivering for the American people,' said Democratic strategist Mike Nellis. \n\nWhile the White House adds a new massive ballroom to host larger parties for its tuxedo-wearing allies, at a cost estimated to be around $300 million, voters remain frustrated with everyday prices.\n\nThe White House did not return the Daily Mail's request for comment.","summary":"Americans are feeling less jolly about the man in the White House, who, as inflation bites at their gift budgets, has been cozying up with billionaires while Democrats scream affordability.","url":"https://www.dailymail.co.uk/news/article-15335111/trump-billionaire-backfire-americans-democrats.html","image":"https://i.dailymail.co.uk/1s/2025/11/28/19/104276755-0-image-a-31_1764359527974.jpg","video":null,"publish_date":"2025-11-29 13:06:35","author":"Editor,Jon Michael Raasch","authors":["Editor","Jon Michael Raasch"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.079},{"id":383383074,"title":"'Hypnotized by ... state-run media': Charlie Sheen reveals to Megyn Kelly his political shift after doing his own research","text":"Charlie Sheen, who has historically been known for having more than a mild case of Trump derangement syndrome, recently opened up about changing his political views after taking a long look at the media he consumed. \n\nThe famous actor joined Megyn Kelly in an interview published last Friday to discuss his turn away from the left and his embrace of the right. \n\n'I'm going to do my own research like I've done with everything my entire life. I'm going to listen to other voices.'\n\nKelly asked Sheen if he was getting more comfortable with expressing his political views, to which he replied: \"I had to feel something different. Because I think we all, or a lot of us, remain beholden to the structure of the house that we were raised in with politics, with religion, with the arts, with culture.\" \n\nRELATED: Video: Joe Rogan shaken by Charlie Kirk's murder, warns against celebrating his death; Charlie Sheen says it's a 'dark day'\n\n Photo by John Nacion/Getty Images\n\nTo a round of applause from the audience, Sheen then explained his shift in political views: \"And I thought, 'All right, I'm going to conduct an experiment.' Literally, I'm going to change the channel. I'm going to do my own research like I've done with everything my entire life. I'm going to listen to other voices.\" \n\nSheen continued: \"I'm going to explore just hearing both sides of the goddamn story.\" \n\nDuring this process, Charlie Sheen realized the problem with the media he was consuming: \"What I was so hypnotized by, in some ways, can be described as state-run media. I'm sorry, but it can. Legacy media is very much like that.\" \n\nAfter months of listening to alternative voices outside legacy media and doing his own research, Sheen had to admit that he had been stuck in an echo chamber. \n\nThen came his moment of realization: \"I felt really stupid. Just some of the stuff I'd bought into and some of the stuff I was worshipping and some of the people I was hating because I was told I was supposed to hate them.\" \n\nThough Sheen voted for Kamala Harris in 2024, he said it was a vote he wishes he could \"have back\" following his shift to the right. \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","url":"https://www.theblaze.com/news/hypnotized-by-state-run-media-charlie-sheen-reveals-to-megyn-kelly-his-political-shift-after-doing-his-own-research","image":"https://www.theblaze.com/media-library/hypnotized-by-state-run-media-charlie-sheen-reveals-to-megyn-kelly-his-political-shift-after-doing-his-own-research.jpg?id=62239426&width=1200&height=600&coordinates=0%2C85%2C0%2C86","video":null,"publish_date":"2025-11-29 13:00:00","author":"Cooper Williamson","authors":["Cooper Williamson"],"language":"en","source_country":"us","sentiment":-0.041},{"id":383502230,"title":"‘Married to Medicine’: Dr. Jackie Walters Opens Up About Quad’s IVF Journey & Season 12 Drama","text":"It’s never just another day at the office on Married to Medicine for Dr. Jackie Walters. The OB/GYN has been a longtime staple of the Bravo reality series since the show began in 2013. Her calming presence is especially needed when Season 12 premieres on November 30 as the group remains fractured. Drama spilled over between Dr. Simone Whitmore and Quad Webb from the last season’s reunion. \n\nThat puts the returning Dr. Contessa Metcalfe, Toya Bush Harris, Dr. Mimi Sanders, and Walters in the middle of it. Entering the mix to shake things up is Webb’s bestie Angel Love Davis, a registered nurse and entrepreneur, and Whitmore’s girl Brandi Milton, a board-certified family nurse practitioner. Episodes to come will also chronicle Dr. Heavenly Kimes’ run for Georgia State Representative and how she dealt with Damon Jr.’s arrest. \n\n“You’ll get to see Married to Medicine in ways you’ve never seen before,” Walters teased. Here the longtime cast member previews what’s to come. \n\nYou’ve been on the show since the beginning and always seem to be caught in the middle. When we start the season, we’re picking up with Quad and Simone. How was it weathering through that? \n\nDr. Jackie Walters: Yes, Married to Medicine does start where we left off. I just keep moving forward trying to give them positive input and showing them why each of them is important to the other. You’ll get to see this journey throughout the season between Quad and Simone, how they break up to make up to make up. We’ll see how that ends. It’s not hard for me anymore because I learned by now to keep myself out of it. Get the facts, tell them which is right and keep moving. \n\nSpeaking of Quad, you are helping her through her IVF journey. When it’s someone close to you, does it feel different? \n\nIt does hit differently when it’s someone you’re close to because it’s not like you have an office appointment and it’s over to the next appointment. It’s actually a friend. Friends get home and they think of questions they didn’t ask or they have meltdowns at home and talk to you about it. This one was particularly hard because I had gone through the journey. It was reliving that journey and pulling that scab off and starting all over. It was hard. I didn’t want to be selfish and make it about me. I just wanted to be there as Quad’s doctor and friend. This one was hard. \n\nIt seems there are more resources out there. What’s it like going through this with someone these days? \n\nIf you get me at the wrong time, you get tears over again. I don’t think it’s something you forget. You are right. We have a lot of resources. The hard part is it’s not free. When we are talking to women, we have to be honest with them in that the fertility journey is a costly journey mentally, physically, and financially. But we are honest, very honest. That’s the beauty of Married to Medicine. You get to see a real life story. This wasn’t just made up for TV. It was real and happening and you got to see what Quad was going through with every visit with the good, bad, and the ugly. \n\nLateasha “Sweet Tea” Lunceford has faced her own hurdles. She decided not to return to the series. Were you surprised about that? \n\nWell, we are all on the show and whatever producers bring we go with it. Surprised? I don’t know. She is a sweet girl. \n\nWhat can we expect from the Med Gala this season? \n\nThis is our third annual Med Gala. We initially started the Med Gala because we had all been sheltered from the pandemic and wanted to bring the medical community back out together. It was such a hit, we thought let’s do it again. Toya made such a fuss during the first one that we didn’t have a cause. The second year we had a cause. This year Toya is our chairperson. You’ll get to see me work very closely with Toya. I still have hair on my head after , and it’s going to be great. The cause for this year, I want you to wait and see because it’s so important in this culture and this environment. I hope this keeps going and just blossoms and goes all over the world. \n\nWhat do you think Angel and Brandi bring to the group? \n\nThese ladies are actually medical providers. That made it different. We have medical providers who understand the day-to-day life of other medical providers. It’s just the firestorm that comes with Angel. It was a trial by fire, and she stood up. Brandi comes in as a busy woman who is a mom of many and a business entrepreneur with a med spa, which was good for me because I also have a med spa. So we can learn from each other. Then she has a husband who travels, so it’s about learning to balance life. We’ve enjoyed them. \n\nYou’ve been so close to Heavenly. How is it for you to be there for her after her son was arrested? What did you make of her ambitions to enter the political arena? \n\nThat one was like, “What?” When I got the phone call that we’re now into politics. I was like don’t do this. When I heard her explain why and how that parlayed into the son, it made sense to me that she starts out running for state representative, and you’ll see that grow. Heavenly is a smart girl and up for the fight. We’re in a political climate right now. \n\nI was wondering if she was inspired after she went with you to meet Kamala Harris. \n\nWhen Vice President Kamala Harris was running for president, I think Heavenly had the bug. She got the bug. I think she got infected when she went to Washington where she thought, “we need more of me here.” Yeah, I think that did something for her, but also her son. The story you’ll get to hear throughout drove her to be involved in the process. \n\nWhat can you say we’ll see in terms of your marriage to Curtis [Berry]? The guys look to get more vocal with every season. \n\nWe’ll be the ones sitting behind them during the reunions soon. No, Curtis is so chill. That’s what I love about my husband is he tries to stay out of the drama with the women especially, whether he is pulled into it or not. He definitely works very hard not to have an opinion. This year he had opinions. I was like, “where did that come from? Why do you have an opinion on that? “ We do well together because both of us are pretty chill and laidback and enjoy the simpler things in life. \n\nYou know when he speaks, it’s something serious. \n\nYeah, but sometimes it’s like, “we don’t want to see your serious Curtis.” He had so much to say this season we were like whose husband was that. Whenever Curtis and Dr. Damon have much to say, but this year it’s like they had a lot to say. \n\nHow would you describe the dynamic among the ladies this season and how you play into that? \n\nThis season I’ve been given the title of mother. As a mother, sometimes it was mutha, I’m not sure you don’t take sides. You just let everyone process what makes sense, but I stood 10 toes down for what is right is right and I’m not going to bend on it. \n\nWhat kind of impact do you think the show has after all these years? \n\nWe have put our lives on display for everyone. I always tell everyone we show you what to do and sometimes our show shows you what not to do. But the beauty of Married to Medicine is we give you real life stories. Whether it’s in our homes, kids, spouses, whether we want to show you what is happening with them or not, but we also get to show you what is happening in medicine. The beauty is that a woman comes up to you and says you saved my life. I had a monogram and found out I had breast cancer or with Quad’s story, millions and millions of women will be able to relate to what Quad is going through. I think the show is one of those where we are truly saving lives with this show. \n\nTell me about your DUES brand? \n\nI’ve been a part of creating a scrub line with another doctor, and we really wanted the fashion savvy scrubs. We didn’t want the plain old box scrubs you put on and look like everyone else in it. We wanted a fashion look where you can go to work, feel comfortable, functional and go out and put on heels and throw on a jacket and still look good and nobody really knows you have on scrubs. You’ll see more of that this season. \n\nWhat would you say you want to see the show tackle that it really doesn’t do currently? \n\nI wish we could take you into the OR [operating room]. We haven’t done that too much, but I really wish we could bring cameras into the OR where you get to see surgery and us in real life situations where the life of the patient is in our hands. We haven’t graduated yet to actually bringing the cameras into the OR. Not because the show won’t do it but because I don’t know if the hospitals will allow it. \n\nMarried to Medicine Season 12 premiere, November 30, 9/8c, Bravo (Next Day Peacock)\n\nMore Headlines:\n\n‘Married to Medicine’: Dr. Jackie Walters Opens Up About Quad’s IVF Journey & Season 12 Drama‘Gold Rush’: Familiar Face Makes Unexpected Return to Join Kevin Beets & Reveals Bold New Look‘Brilliant Minds’: Brian Altemus Teases ‘Explosive’ Stuff to Come With Wolf & Charlie‘The Night Manager’ Season 3: Everything We Know About the Next Chapter of Tom Hiddleston’s DramaDaniel Goddard Thanks Fans Amid ‘General Hospital’ Exit & Major Family Loss","summary":"Plus, new cast members, Heavenly's political ambitions, and more.","url":"https://www.guampdn.com/lifestyle/entertainment/married-to-medicine-dr-jackie-walters-opens-up-about-quad-s-ivf-journey-season-12/article_e2283191-2560-5d88-9621-3fb50244b578.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/custom/image/d1d0565a-bcb2-11eb-8535-ab06d41ce483.jpg?resize=600%2C315","video":null,"publish_date":"2025-11-29 11:16:29","author":"Michael Serine,Scott Fishman,TV Insider","authors":["Michael Serine","Scott Fishman","TV Insider"],"language":"en","source_country":"gu","sentiment":0.087},{"id":383349454,"title":"Klein: Here’s how bad the U.S. housing crisis is — and what can be done about it","text":"The housing market keeps getting worse. Home prices have risen more than 50% since the pandemic. About a third of American households now spend more than 30% of their income on housing. In 2014, the median age of a first-time homebuyer was 31. In 2025, it was 40 — the highest on record.\n\nThe core of the problem is simple: Too much money chasing too few homes. How many more homes does America need? I’ve seen estimates ranging from 2 million to 5 million. It’s a shortage decades in the making — and one we’re nowhere near on track to solving. In 2025, America built fewer homes per 100,000 people than it did in 2005, 1995, 1985 or 1975.\n\nEvery White House since President Barack Obama’s administration has recognized the need to build more homes but the results, under both Democrats and Republicans, have been anemic. Housing is a hard problem to solve from the Oval Office. Zoning and building rules are set at the state and local levels. Interest rates are set by the Federal Reserve. In 2024, Kamala Harris promised to build 3 million new homes and released a plan that no housing expert I spoke to thought could come anywhere near achieving that goal.\n\n“ The thing that I think we learned is that federal housing policy is stuck in a really weak equilibrium,” said Jared Bernstein, who led President Joe Biden’s Council of Economic Advisers. “There is just far too little asked of cities and states. They won’t do much to push back on the barriers that are blocking affordable housing.”\n\nBernstein, who is now a senior fellow at the Center for American Progress, wants to change that. He’s among the authors of a new housing plan that tries to deliver the next administration a set of solutions nearer to the scale of the problem.\n\nFederal incentives\n\nAt the core of the center’s plan is an idea it calls “Rent Relief for Reform.” I don’t love the name, but I like the idea: Places with a housing shortage — and that’s a lot of them — get a choice. Build the housing and the federal government will give all the renters in the city up to $1,000 off their rent — or don’t build the housing and lose access to certain federal grants.\n\nThe Searchlight Institute, a new Democratic think tank, recently proposed a similar idea. In that version, cities and other places that hit ambitious housing targets would qualify for a federal rebate that would give every household — so both homeowners and renters — a check equal to the average increase in rent over the last year. In other words, build enough housing and the federal government will give the people who live near that housing money.\n\nBoth those ideas are trying to solve the hard problem at the heart of housing politics: It’s the people who already have homes who have a voice in local politics and planning. They often like their neighborhood the way it is. They don’t want more traffic or new neighbors or the hassle of nearby construction. What’s in it for them?\n\n“You can put this kind of crassly as you’re incentivizing renters to show up at local elections and push their elected officials to do things that are renter-friendly, which I don’t hate as a strategy,” said Jenny Schuetz, who leads housing policy at Arnold Ventures. “If most renters showed up in the primaries and demanded that their mayor and City Council actually do good things, we could have some pretty different outcomes. But mostly renters don’t show up — particularly in the primary — and so you get these homeowner-dominated coalitions in cities that make it hard to build.”\n\nModular housing\n\nThe other big idea in the Center for American Progress plan is to change the way we build housing in America. “If you go back to 1910, somebody showed up with a toolbox and a hammer to build a house,” Bernstein said. “And if you go to 2025, it’s the same damn thing. This is the one sector where productivity has been literally falling for five decades while everything else has been going up.”\n\nThe comparison that often gets made here is to manufacturing. Between 1950 and 2020, productivity in the manufacturing sector — how much you could produce with the same number of workers — rose by more than 900%. That’s a big part of why everything from tables to televisions is cheaper today than decades ago. But over the same period, productivity in the construction sector has fallen. That’s not the only reason housing is so expensive today, but it’s part of it.\n\nBut you can manufacture housing — constructing homes in an off-site factory much the way we construct cars and then shipping them for final assembly. This is technology pioneered in the United States when George Romney, Mitt Romney’s father, served as secretary of housing and urban development during the Nixon administration. But the United States never figured out the rules nor the financing to make an industry out of it. Instead, it’s taken hold elsewhere. In Sweden, for example, more than 40% of new homes — and more than 80% of single-family homes — are fabricated off-site.\n\nThe Center for American Progress’s plan proposes a slew of projects to take this industry America invented and make it one where America is a leader. They want the government to seed a major research program to fund innovation in housing construction. They want to have the federal government leverage its purchasing power to become an initial buyer for modular housing — one idea here would be to have the Department of Defense upgrade its military base housing using modular construction. They want to modernize building codes to make modular easier — removing, for instance, an outdated federal requirement to attach a permanent steel chassis to all modular construction — and updating federal insurance and financing rules to make sure modular production qualifies.\n\nUnaffordable housing\n\nYou could imagine states and cities acting even before the federal government does. “New York was once a beacon of creative, public sector-led, affordable housing production,” says Mayor-elect Zohran Mamdani’s housing plan. “But decades of disinvestment and shrinking government capacity have left us waiting on the real estate industry to solve a housing crisis from which they profit.”\n\nLeft unsaid in his plan is that publicly subsidized, affordable housing has become monstrously expensive to construct because the public money triggers rules and process and reviews and negotiations that market-rate housing doesn’t contend with. A Rand study found that, per square foot, affordable housing cost more than 1.5 times as much to build in California as market-rate housing; a Washington Post investigation revealed an affordable housing development in D.C. where the units cost $800,000 each to build, even as the same developer was building market-rate units for $350,000 next door. One reason we don’t build enough affordable housing is we’ve made affordable housing unaffordable to build.\n\nMamdani proposed investing $100 billion to build 200,000 “publicly subsidized, permanently affordable, union-built, rent-stabilized homes” over the next decade. That works out to $500,000 per unit — if all goes well. What if New York City became a test case for how modular construction could allow public housing, ordered and built at massive scale, in unionized factories, to become cheaper and faster to build than market-rate housing? If it was only $350,000 per unit, that would mean building almost 300,000 units for the same cost.\n\nOne problem the modular housing industry has faced is the absence of steady demand to keep the factories running and work out the kinks of construction. A place like New York City that wanted to build public housing at scale, over a long period of time, could create that steady demand and use it to seed an industry — New York could become America’s leader in modular construction.\n\nPerhaps that’s fanciful. But our thinking on housing — both public and private — has been far too small for far too long. We’ve accepted shocking cost increases paired with stagnating productivity. We’ve made it impossible for tens of millions of families to build the lives they want in the cities they’d ideally choose. At this point, making it possible to build more housing just isn’t enough. We need to change how we build housing. I don’t know if modular housing is really the answer. But it’s worth trying.\n\nEzra Klein is a New York Times columnist.","summary":"Between 1950 and 2020, productivity in the manufacturing sector rose by more than 900% while it fell for homebuilding.","url":"https://www.mercurynews.com/2025/11/29/klein-heres-how-bad-the-u-s-housing-crisis-is-and-what-can-be-done-about-it/","image":"https://www.mercurynews.com/wp-content/uploads/2021/11/OCR-L-PALOMA-0910-JG-02-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-29 11:15:01","author":"Ezra Klein","authors":["Ezra Klein"],"language":"en","source_country":"us","sentiment":-0.384},{"id":383273778,"title":"White House Launches “Media Offender of the Week” Section on Its Website","text":"Skip to main content\n\nNovember 28, 2025 9:31pm\n\nShare on Facebook\n\nGoogle Preferred\n\nShare to Flipboard\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nSend an Email\n\nPrint the Article\n\nPost a Comment\n\nDonald Trump\n\nAnna Moneymaker/Getty Images\n\nShare on Facebook\n\nGoogle Preferred\n\nShare to Flipboard\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nSend an Email\n\nPrint the Article\n\nPost a Comment\n\nThe White House on Friday debuted a new section on its website dedicated to what it’s dubbing the “Media Offender of the Week.”\n\nThe page features the heading “Misleading. Biased. Exposed.” followed by a list of outlets and reporters who made the list. CBS News, The Boston Globe and The Independent were the first news outlets cited on the new web page.\n\nThe site claimed that the news organizations were cited for reporting that “misrepresents and exaggerates President Trump’s calls for Democrat accountability.” Specifically, the White House is accusing the outlets for misrepresenting “Trump’s call for members of Congress to be held accountable for inciting sedition by saying that he called for their ‘execution.'” \n\nRelated Stories\n\nRyan Lizza Claims Olivia Nuzzi Would Share \"Opposition Research\" With Robert F. Kennedy Jr.\n\nFox News Promotes Bill Melugin to Congressional Correspondent\n\nThe coverage in question centered on a video in which Sen. Mark Kelly and five other members of Congress told troops they can disobey illegal orders and reminded them they had sworn to uphold the Constitution.\n\nIn response, Trump posted on Truth Social that was “SEDITIOUS BEHAVIOR AT THE HIGHEST LEVEL.” He added: “Each one of these traitors to our Country should be ARRESTED AND PUT ON TRIAL.” He also posted that their comments were “punishable by DEATH!” and declared: “HANG THEM GEORGE WASHINGTON WOULD !!”\n\nThe new White House page claims that the truth is as follows: “The Democrats and Fake News Media subversively implied that President Trump had issued illegal orders to service members. Every order President Trump has issued has been lawful. It is dangerous for sitting Members of Congress to incite insubordination in the United States’ military, and President Trump called for them to be held accountable.”\n\nIt went on to add two key points: \n\n“Democrats released a video calling for service members to disobey their chain of command, and in turn, implied President Trump had issued illegal orders.”\n\n“President Trump has never issued an illegal order. The Fake News knew that, but ran with the story anyway.”\n\nThe page also features an “Offender Hall of Shame” that includes The Washington Post, CBS News (again), CNN and MSNBC (recently rebranded as MS NOW), citing their coverage of various events. In its coverage of the new webpage, The Washington Post quoted an internal spokesperson who said: “The Washington Post is proud of its accurate, rigorous journalism.” The Hollywood Reporter has reached out to CBS News for comment.\n\nThe page also names several “repeat offenders” who “don’t just get it wrong – they do it over and over again.” This section includes the likes of Axios, The New York Times, KTLA Los Angeles, People, Politico, The Los Angeles Times, The Daily Beast, The Hill, BBC, ABC News, USA Today and more. There’s also a section where readers can select one of those outlets from a drop-down menu to see the specific “offense” of which they are being accused.\n\nInterestingly, the admonishment of CBS News comes just a few weeks after Trump praised the company’s new leadership — CBS News editor-in-chief Bari Weiss and Paramount CEO David Ellison — in a 60 Minutes interview. In the interview, he alluded to his recent lawsuit against Paramount Global over the editing of a 60 Minutes interview with 2024 Democratic presidential candidate Kamala Harris. The lawsuit resulted in Paramount Global settling in a $16 million payout. Part of the settlement agreement included stipulations for Paramount to release 60 Minutes transcripts of interviews with presidential candidates post-air.\n\n“And actually 60 Minutes paid me a lotta money,” Trump said in the interview. “And you don’t have to put this on, because I don’t wanna embarrass you, and I’m sure you’re not — you have a great — I think you have a great, new leader, frankly, who’s the young woman that’s leading your whole enterprise is a great, from what I know. I don’t know her, but I hear she’s a great person. But 60 Minutes was forced to pay me a lot of money because they took her answer out that was so bad, it was election-changing, two nights before the election. And they put a new answer in. And they paid me a lot of money for that. You can’t have fake news. You’ve gotta have legit news. And I think that it’s happening.… I see good things happening in the news. I really do. And I think one of the best things to happen is this show and new ownership, CBS and new ownership. I think it’s the greatest thing that’s happened in a long time to a free and open and good press.”\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nGuy Pearce Apologizes After Reportedly Sharing Antisemitic Posts on Social Media \n\nFuzzy Zoeller, Golf Champion Haunted by Racist Joke About Tiger Woods, Dies at 74\n\nRobert F. Kennedy Jr.\n\nRyan Lizza Claims Olivia Nuzzi Would Share “Opposition Research” With Robert F. Kennedy Jr.\n\nInside the Star-Studded F1 Las Vegas Grand Prix\n\nWomen in Entertainment 2025\n\nTHR’s Women in Entertainment Gala Adds Dakota Johnson, Goldie Hawn, Rachel Sennott, Regina Hall, Chase Infiniti, Jimmy Kimmel and Molly McNearney to Speaker Lineup\n\nBAFTA Breakthroughs Talk ‘Atomic People,’ ‘Harvest,’ ‘Mr Loverman,’ ‘Grand Theft Hamlet’\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"CBS News, The Boston Globe and The Independent were cited on the web page, which debuted Friday.","url":"https://www.hollywoodreporter.com/news/politics-news/white-house-trump-media-offender-of-the-week-website-1236437600/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/07/GettyImages-2225249310-H-2025.jpg","video":null,"publish_date":"2025-11-29 05:31:07","author":"Kimberly Nordyke","authors":["Kimberly Nordyke"],"language":"en","category":"politics","source_country":"us","sentiment":-0.288},{"id":383270180,"title":"Republican Lawmaker, Whose Daughter Has Down Syndrome, Condemns Trump's Use of the R-Word","text":"Republican Sen. Mike Bohacek is speaking out against President Donald Trump after he called Minnesota Gov. Tim Walz “seriously r-------.”\n\n On Friday, Nov. 28, Bohacek shared a post to Facebook condemning Trump’s use of the ableist term, which was written in a Thanksgiving post on Truth Social the evening prior, to insult Walz, 61, and his stance on immigration.\n\n “Many of you have asked my position on redistricting,\" Bohacek began. \"I have been an unapologetic advocate for people with intellectual disabilities since the birth of my second daughter.\" \n\n His message included a screenshot of a Newsweek article published Friday morning. \n\n “Tim Walz Responds to Donald Trump Calling Him ‘Seriously R-------,’” was the headline of the article.\n\n Bohacek continued, “Those of you that don’t know me or my family might not know that my daughter has Down Syndrome.”\n\n “This is not the first time our president has used these insulting and derogatory references and his choices of words have consequences,” Bohacek. The Republican Senator has represented Indiana's District 8 since 2016, according to the Indiana Senate's website.\n\n In September 2024, Trump reportedly called then Vice-President Kamala Harris the same ableist slur during a dinner with billionaire donors, according to The New York Times.\n\n “Donald Trump’s ableist comments yesterday say far more about him and his inaccurate, hateful biases against disabled people than it does about Vice President Harris, or any person with a disability. Trump holds the ableist, false belief that if a person has a disability, they are less human and less worthy of dignity,” the American Association of People with Disabilities (AAPD) said in a statement at the time.\n\n Trump also faced backlash for mocking a disabled journalist on his 2015 campaign trail.\n\n Bohacek said his “consequences” for Trump would include “voting NO on redistricting,\" referring to an ongoing battle in the state's legislature over the redrawing of congressional district maps.\n\n “Perhaps he can use the next 10 months to convince voters that his policies and behavior deserve a congressional majority,” he concluded.\n\n PEOPLE reached out to the White House for comment, but did not immediately receive a response. \n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n Along with Walz, Trump’s lengthy Thanksgiving message also took aim at Somali-American Democratic Minnesota Representative Ilhan Omar, who Trump described as “always wrapped in her swaddling hijab, and who probably came into the U.S.A. illegally.”\n\n The president also called out “citizens” and “patriots” who he claims have been “just plain STUPID” when it comes to immigration. He said Walz “does nothing, either through fear, incompetence, or both.”\n\n Walz responded to Trump's remarks in a social media post of his own, simply writing, “Release the MRI results.”","summary":"“This is not the first time our president has used these insulting and derogatory references and his choices of words have consequences,” Mike Bohacek said","url":"https://people.com/republican-lawmaker-mike-bohacek-whose-daughter-has-down-syndrome-condemns-trump-use-of-the-r-word-11858822","image":"https://people.com/thmb/9pfhJiNbra5_K3Wo0Loc_djlHCU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(740x260:742x262)/donald-trump-mike-bohacek-112825-4f15a941189e42108b76f9f22ffcd737.jpg","video":null,"publish_date":"2025-11-29 05:10:15","author":"Angel Saunders","authors":["Angel Saunders"],"language":"en","category":"politics","source_country":"US","sentiment":-0.327},{"id":383481930,"title":"Five North Texas law enforcement agencies have agreements with ICE","text":"AUSTIN — Partnerships between local and state law enforcement agencies and Immigration and Customs Enforcement have increased dramatically in the first year of President Donald Trump’s second term. \n\nThe program, known as 287(g), gives certain law enforcement officers the authority to question an individual’s immigration status — and, in some cases, arrest someone if the officer believes they don’t have the proper legal authority to be in the country. \n\nThe program has expanded to law enforcement agencies in North Texas and it comes amid separate but parallel efforts by federal and state officials to arrest undocumented migrants. \n\nThe Trump administration wants more agencies to have partnerships with ICE so there are more officers that can arrest migrants. \n\nAt the state level, Gov. Greg Abbott signed Senate Bill 8 into law, which requires every Texas sheriff’s office with a jail to sign a 287(g) agreement with the federal government. Sheriff’s offices must sign into the agreement by Dec. 1, 2026, under the bill. \n\nFive law enforcement agencies in North Texas have joined the program. Statewide, at least 169 agencies have signed such agreements. \n\nHere is a list of North Texas agencies who have 287(g) agreements. \n\nDenton County sheriff’s office \n\nThe Denton County sheriff’s office entered into the agreement with ICE on July 29. \n\nDenton County joined the jail enforcement model, allowing selected officers to investigate, interview and detain individuals who are at the jail after being charged with a crime. \n\nDenton County Sheriff Tracy Murphree spoke in front Denton County Commissioner’s Court on Feb. 11 as commissioners considered whether they should approve an agreement. \n\nMurphree said he attempted to join the 287(g) program a few years ago. However, after President Joe Biden was elected in 2020, his administration stopped approving agencies from partnering with the federal government. \n\nShortly after Trump defeated Vice President Kamala Harris in last year’s election, Murphree said he was approached to ask if the sheriff’s office would like to join the program. Without the agreement, Murphree said, a sheriff’s deputy would have to call an ICE employee if someone who is arrested for a local crime is also an undocumented immigrant. \n\n“My folks will be able to put that detainer on them because they’ll have access to them immediately when they come in because they’ll have access to all those records,” Murphree told commissioners. \n\nEllis County sheriff’s office \n\nThe sheriff’s office joined the jail enforcement model on April 16. \n\nWhile a candidate for sheriff in 2020, Brad Norman told a local media outlet he would sign a 287(g) agreement in order to help find undocumented migrants. \n\n“I do not support illegal immigration,” Norman told The Waxahachie Sun. “If you came into this country illegally and you have broken the law, you should be removed.” \n\nNorman acknowledged that enforcing federal immigration laws was the primary responsibility of the federal government, he believed the Sheriff’s Office could “be part of the regional solution to a National problem without undue burden to the taxpayers” by checking an individual’s immigration status when they are booked into the jail. \n\nNorman did not respond to an email and phone call seeking comment. \n\nKeller Police Department \n\nOne of the few police departments in Texas to have a 287(g) agreement, Keller police joined the program following unanimous approval from the City Council in August. \n\nKeller Mayor Armin Mizani, who is running for the Texas House, wrote in a July 17 letter that public safety in Keller was not “up for negotiation.” \n\nThe City Council approved the jail enforcement agreement on Aug. 5. Multiple residents at the meeting spoke in opposition to the agreement. The program is only enforced at the Keller Regional Detention Center, a holding facility for Keller and other surrounding cities. \n\nAfter the City Council approved the program, the Police Department released a statement saying its employees were committed to “enforcing the rule of law” and they would need to make minor adjustments. \n\n“Opting into this program will mean minor adjustments to the responsibilities of our detention officers, but our department’s priorities and philosophies will remain unchanged,” the statement said. \n\nRockwall County sheriff’s office\n\nRockwall County sheriff’s office first joined the 287(g) program in June 2020 — toward the end of Trump’s first term. They agreed to implement the jail enforcement model. \n\nOnce Trump took office for his second term, the sheriff’s office joined the warrant service officer model and task enforcement model. \n\nThe warrant officer model is also only enforced at jails and limits local officers to serving immigration warrants to prisoners. Officers cannot investigate an individual’s immigration status.\n\nThe third model the sheriff’s office joined was the task force model. That model was ended in 2012 by the Obama administration. A 2011 Justice Department investigation into the Maricopa County sheriff’s office, in Arizona, found that the department had engaged in “unconstitutional policing” by unfairly targeting Latinos. \n\nThe task force model authorizes assigned patrol officers to question and arrest individuals suspected of violating immigration laws. ICE is responsible for training the officers.\n\nReached for comment, Rockwall County Sheriff Terry Garrett said in an email that all three models “provide tools useful at various levels of an investigation.” \n\nTarrant County sheriff’s office\n\nTarrant County also joined the program during the first Trump administration. \n\nTarrant County Sheriff Bill Waybourn was among the sheriffs who testified in front of the Texas Senate State Affairs Committee earlier this year when lawmakers were considering SB 8. \n\n“The jail model does make our communities safer,” Waybourn said. “It does get another set of eyes on things to make sure people don’t slip through the cracks and that it is targeting criminals. It has worked out very well for us.”","url":"https://www.dallasnews.com/news/immigration/2025/11/25/here-are-the-north-texas-law-enforcement-agencies-that-have-agreements-with-ice/","image":"https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/WMPEFSE4SFBCTEE4ZHUB22D7JA.jpg?auth=e34f83d9961135e929c456883aa4768850c529c71e0dd1282607d1381d465503&quality=80&width=1200&height=630&smart=true","video":null,"publish_date":"2025-11-29 03:03:26","author":"Aarón Torres","authors":["Aarón Torres"],"language":"en","category":"politics","source_country":"us","sentiment":-0.41},{"id":383254330,"title":"Katy Perry Gets $2 Million After Suing Dying 85-Year-Old Veteran Over Real Estate Dispute","text":"Pop superstar Katy Perry has won $2 million in a protracted property battle by filing a lawsuit against 85-year-old Army veteran Carl Westcott, who is now bedridden with Huntington's disease and receiving hospice care.\n\nPerry's legal action, detailed in court filings reviewed by the New York Post, sought more than $8 million in damages from Westcott, including $3.25 million for lost rental income during the litigation, $2.2 million for property renovations and $3 million in attorney fees. The dispute centers on an eight-bedroom estate in the celebrity enclave of Montecito, where Perry and her then-boyfriend, actor Orlando Bloom, acquired the property in July 2020 for $15 million.\n\nPerry and Bloom penned a personal note to Westcott imploring him to accept their bid.\n\n\"We're expecting a baby next month and think this home is the perfect place to welcome her,\" the couple wrote, according to court documents. Days after signing, Westcott, then 81 and recovering from back surgery on pain medication, attempted to rescind the deal, claiming diminished mental capacity. Westcott's condition has deteriorated sharply since, with the neurodegenerative Huntington's disease eroding his cognitive functions and confining him to bed.\n\nHis son, Court Westcott, blamed the stress of the litigation for accelerating his father's decline, saying the case has \"devastated his health and spirit.” However, a Santa Barbara County Superior Court judge rejected that argument in 2023, ruling that Westcott failed to substantiate his incapacity.\n\nPerry's legal team further alleged that Westcott had entertained a competing offer from Maria Shriver, the former wife of Arnold Schwarzenegger.\n\nRuling in her favor, LA County Superior Court Judge Joseph Lipner awarded Perry $2.8 million for lost rental value and $260,000 for repair of water damage and fallen trees - but deducted $1 million from the total award because he said Perry could have invested her money elsewhere, while Westcott lost interest on the same amount. \n\n“The optics of a millionaire pop star demanding hefty damages from a very ill man are terrible,” PR strategist Abesi Manyando told The Telegraph. “This isn’t just a lawsuit, it’s now a David and Goliath narrative – a global superstar with wealth, legal resources and leverage versus an elderly, declining veteran who already lost his home. And that dynamic carries emotional weight.”\n\nIt is not the first time Perry has been embroiled in a high-profile legal fight involving real estate. In 2018, Sister Catherine Rose Holzman, an 89-year-old nun, collapsed and died in a Los Angeles courtroom during a hearing tied to Perry’s attempted purchase of a former convent from the Archdiocese of Los Angeles. The nuns had opposed the sale to the singer, arguing the property belonged to their order; Holzman’s last public words before her fatal collapse were directed at Perry were, “To Katy Perry, please stop.”\n\nPerry, a prominent Democrat supporter who performed at President Joe Biden’s 2021 inauguration and campaigned for Vice President and failed presidential candidate Kamala Harris in 2024, has recently been linked romantically to former Canadian Prime Minister Justin Trudeau.","url":"https://www.zerohedge.com/political/katy-perry-gets-2-million-after-suing-dying-85-year-old-veteran-over-real-estate-dispute","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-11/katy%20perry%201.jpg?itok=jjFdokJ2","video":null,"publish_date":"2025-11-29 02:30:00","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","source_country":"us","sentiment":-0.186},{"id":383240764,"title":"Letters: We must keep pressure on lawless ICE agents","text":"Keep pressure on\nlawless ICE agents\n\nMany of us are sickened by the ongoing inhumane treatment of immigrants and others by ICE.\n\nEvery day, there are headlines about ICE’s violent treatment of innocent people. Anyone who still believes these assaults are directed toward criminals is choosing to remain ignorant. There’s overwhelming evidence that ICE routinely detains people solely due to the color of their skin, and without warrants. The trauma and destruction caused by these unconstitutional detainments include deaths, sexual abuse and neglect in ICE custody; denial of due process rights; the disappearances of hundreds after the closure of ‘Alligator Alcatraz’; and assaults on peaceful protesters.\n\nAs a Catholic, I note that Pope Leo XIV stated that being “pro-life” should include opposition to the inhumane treatment of immigrants. The pope called for reflection on the treatment of detained migrants. It’s imperative that people of goodwill do everything we can to stop ICE’s aggressive and criminal behavior.\n\nLaura Murray\n\nSJ must make sure\nprogress includes all\n\nAs an African American student at Evergreen Valley College, I see our community’s future being priced out.\n\nMany of us, especially from Black and Brown neighborhoods, are watching our families get squeezed by rising rents while new tech jobs pour in. This isn’t just about buildings; it’s about people. We need the city to ensure that new corporate growth directly funds affordable housing and protects tenants from unfair rent hikes and evictions.\n\nWe can’t create a vibrant San Jose if the people who make it diverse and strong themselves can’t even afford to stay here. Let’s make sure progress includes everyone.\n\nDemari Agbulos\n\nDOJ won’t prosecute\nMAGA lawbreakers\n\nRe: “Justice demands prosecuting fake electors” (Page A7, Nov. 21).\n\nIn his column, Mark Barabak quotes Derek Muller, a Notre Dame law professor (and a long-time member of the Federalist Society, the judicial arm of the anti-democracy MAGA movement).\n\nRegarding fake electors, Muller suggests that “the ballot box — rather than a courtroom — may be the better venue to litigate the matter.”\n\nApparently, Muller attended the “Alice In Wonderland Law School” where he undoubtedly received an A+ in circular logic.\n\nIt is against the law to overturn the outcome of a presidential election; it is idiotic to say that when a bunch of MAGA criminals break election laws, we should rely on another election (in which MAGA operatives are hard at work illegally suppressing the votes of millions of likely Democratic voters), instead of prosecuting MAGA criminals to the full extent of the law.\n\nNo wonder people distrust lawyers — especially when they promote excusing law-breaking instead of prosecuting the lawbreakers.\n\nBill Charleston\n\nVictory more important\nthan female president\n\nRe: “How long until we elect a female president” (Page A7, Nov. 20).\n\nA half-page column in the Mercury News asks, “How long until we elect a female president?” The author finds it “kind of depressing” that this January, the country will have reached “the historic moment when 28% of its governors are female.” I’m old enough to be impressed, not depressed, by this statistic.\n\nMore importantly, I implore Democrats to focus on the much more important goal of defeating the Republicans in 2028. In both 2016 and 2024, we elected Donald Trump over much more experienced women, who believed in the rule of law and our democracy. While I volunteered for the Kamala Harris campaign in 2024, our country is simply not yet ready for a woman leader, as more enlightened countries such as India, Pakistan, Germany, Israel and Great Britain have shown themselves to be.\n\nGiven the apparent misogynistic nature of the American voters, let’s not repeat the mistakes of 2016 and 2024.\n\nUkraine peace plan\nfavors the invaders\n\nRe: “Trump offers a Ukraine peace plan Kremlin can love” (Page A4, Nov. 23).\n\nThe word is that Russia is in on a full war production level and showing it by an atmospheric rain of drones on civilian and energy targets. I have never understood the timid arms policy that forbids Ukraine from having weapons with mileage into Russia. Vladimir Putin understands force only. Is Donald Trump so dazzled by the vision of a Nobel Peace Prize that the art of the deal and the cards Trump holds created this outrageous peace plan?\n\nThis is worse than the Munich Deal that led to WWII. To give up even more land on its Black Sea ports, considering Russia’s efforts to blockade grain shipments, would be disastrous. To limit its army to 600,000, forbid NATO membership, and not allow long-range weapons is another gift to dictator Putin, who feeds on such rewards, like Crimea he took in 2014.\n\nIt’s time for Congress to wake up.\n\nDavid Eisbach","summary":"Also: Include all &#124; Prosecute lawbreakers &#124; Put victory first &#124; Favoring Putin. Mercury News reader letters to the editor for Nov. 30, 2025.","url":"https://www.mercurynews.com/2025/11/28/letters-keep-pressure-lawless-ice-agents/","image":"https://www.mercurynews.com/wp-content/uploads/2025/11/SJM-L-EDIT-ENOUGH-1109-ICE-AGENTS-EDITORIAL-JPEG.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-29 00:00:49","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.197},{"id":383365096,"title":"The Somalians in Minnesota haven’t stolen millions, they’ve stolen Billions from American taxpayers","text":"The Somalians in Minnesota haven’t stolen millions, they’ve stolen Billions from American taxpayers\nNews Nation went to the federal courthouse in Minneapolis and learned from Federal sources\n\n News on the Net -- Wall Street Apes——Bio and Archives--November 29, 2025\nNews in Brief—News Headlines | CFP Comments | Reader Friendly | Subscribe | Email Us\n\nNews Nation went to the federal courthouse in Minneapolis and learned from Federal sources that the Somalians in Minnesota haven’t stolen millions, they’ve stolen BILLIONS from American taxpayers\n“We're at the federal courthouse where that 78th indictment came down just a few hours ago, all of it tied to feeding our future, that's the corrupt nonprofit at the center of all of this fraud. We spoke with current and former federal sources and they say, they tell us billions have been stolen since 2019\nMinnesota is just riddled with fraud and that a lot of this money goes back to Somalia and a cut of all that money has gone to the Al-Qaeda linked terror group”\n\nRecommended by Canada Free Press\n\nSupport Canada Free Press\n\n View Comments \nNews on the Net——Bio and Archives\nNews from around the world\n\nAround The WebHere's The Estimated Cost of a 1-day Walk-in Shower UpgradeHomeBuddyTake a Look Inside Keanu Reeves's Mansion in Council BluffspowerplaygamesBillionaire Spends $1.7 Million on Motorhome With Its Own GarageViralnovaThis Household Trick Removes All Parasites in Your Body Overnight!ParatoxilHair Grows Back in A Few Days! At Any Stage of BaldnessHaloGrowHair Will Grow Back! No Matter How Severe The BaldnessHaloGrowTake A Deep Breath Before You See Kamala Harris' HouseHealth Trition23 Ridiculously Cool Gadgets You'll Want to Buy ImmediatelyTrending Gadget1 Simple Hack to Save on Your Electric Bill (Try Tonight)GadgetCyno\n\nundefinedThis is the most jaw-dropping 4 minutes and 21 seconds you will watch this year....BIack Fatigue Friday! Mark Dice...Dramatic Moment Hero National Guardsman Opens Fire on Afghan Terror Suspect in DC...Walmart Customers RAGE On Black Friday As Depressing Scene Is an Ominous Warning For America...Let me get that straight Piers Morgan: You’re witnessing the rape, replacement and murder of your ...College grads are turning into communists. Angry communists.... \n\nElon Musk Confirms Sad News Live Today\n\nNo One Expected This!\n\nwww.canadafreepress.com","url":"https://www.canadafreepress.com/article-headline-news/the-somalians-in-minnesota-havent-stolen-millions-theyve-stolen-billions-from-american-taxpayers","image":"https://canadafreepress.com/images/uploads/somalis112925.jpg","video":null,"publish_date":"2025-11-29 00:00:00","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.004},{"id":383220904,"title":"Trump Rages at 'Seriously Retarded' Walz: President's Slur Sparks Outcry","text":"In a volatile holiday message that shattered the typical Thanksgiving spirit, President Donald Trump unleashed a torrent of personal insults and racial slurs, targeting Minnesota Governor Tim Walz and the state's Somali community.The furious post, shared late at night on his Truth Social platform, marks a sharp escalation in rhetoric, moving beyond political disagreement into personal attacks on mental capacity and citizenship. Trump, 79, did not mince words as he directed a slur at Walz and questioned the legal status of Representative Ilhan Omar, sparking immediate backlash from leaders and residents across the state.Trump's 'Retarded' Slur Sparks OutrageThe President's message centred on a direct and offensive attack against Tim Walz, the Democratic governor who recently ran alongside Kamala Harris in her failed presidential bid. In a statement that stunned political observers for its crudeness, Trump referred to the governor as 'seriously retarded', a slur widely condemned by disability advocates. He accused Walz of negligence, claiming the governor allowed 'Somalian gangs' to terrorise residents.'The seriously retarded Governor of Minnesota, Tim Walz, does nothing, either through fear, incompetence, or both,' Trump wrote in the blistering post.This language marks a significant departure from standard political discourse, using a term that has long been recognised as hate speech against people with intellectual disabilities. The attack appears to be part of a broader strategy to delegitimise Walz's leadership in Minnesota, a state Trump has frequently targeted in his political rallies.Attacks on Ilhan Omar and Somali ResidentsTrump's invective did not stop at Tim Walz; he also launched a racially charged attack on Representative Ilhan Omar and the broader Somali community in Minnesota.He described Omar, a frequent target of his ire, as the 'worst \"Congressman/woman in our country and mocked her religious attire, stating she is 'always wrapped in her swaddling hijab. Going further, Trump cast doubt on her citizenship without evidence, claiming the Somali-born lawmaker probably came into the USA illegally'.These comments were paired with baseless assertions about the safety of Minnesota's streets. Trump painted a dystopian picture of the state, alleging that 'Somalian gangs are roving the streets looking for \"prey\" as our wonderful people stay locked in their apartments and houses hoping against hope that they will be left alone'.This rhetoric comes just days after Trump ordered a review of all green cards from Somalia and 18 other nations. He also threatened to terminate temporary protected status for Somalis in Minnesota, a move that would affect thousands of legal residents in a state that is home to roughly 80,000 Somali people—the largest such population in the US.Walz Hits Back at Mental FitnessGovernor Tim Walz wasted little time in responding to the insults, though he chose to pivot the conversation away from the slur and towards Trump's own fitness for office. Rather than engaging in a war of words over the specific insults, Walz challenged the transparency of Trump's recent medical claims.'Release the MRI results,' Walz posted on X, a direct reference to Trump's recent assertion that a medical checkup had returned 'perfect' results.This retort highlights a growing Democratic strategy of questioning the 79-year-old president's cognitive health, turning his own attacks on competency back against him. When reached for further comment by local media, Walz's office directed reporters back to this social media post, letting the brevity of the response speak for itself.Immigration Policy Shifts and 'Reverse Migration'The context for this outburst appears to be a recent violent incident in Washington, DC, involving a 29-year-old Afghan national accused of shooting two National Guard members.The suspect, who had previously worked with the CIA during the Afghanistan War, has been charged in an attack that left one service member dead and another critically wounded.Seizing on this tragedy, Trump used his Thanksgiving message to call for drastic changes to US immigration policy. He vowed to 'permanently pause migration' from poorer nations and introduced the concept of 'reverse migration' as a necessary solution.'Only REVERSE MIGRATION can fully cure this situation,' Trump declared.He later expanded on this threat, stating he would suspend immigration 'from all Third World Countries to allow the US system to recover fully'.However, the President provided no details on how such a sweeping policy would be implemented, nor did he specify which nations would be classified under this designation.The message concluded with a jarring shift in tone, offering a holiday greeting that excluded his political enemies. 'Other than that, HAPPY THANKSGIVING TO ALL, except those that hate, steal, murder, and destroy everything that America stands for — You won't be here for long!","url":"https://www.ibtimes.co.uk/trump-rages-seriously-retarded-walz-presidents-slur-sparks-outcry-1758847","image":"https://d.ibtimes.co.uk/en/full/1772170/donald-trump-called-tim-walz-retarded-x-post.png?w=1600&h=900&q=88&f=2c0c1183546ecf41b28cbf02a0ee0a2d","video":null,"publish_date":"2025-11-28 22:41:58","author":"Daniel Joshua Flores","authors":["Daniel Joshua Flores"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.15},{"id":383218934,"title":"Political turkeys of 2025: Blunders of 2025 that will never be pardoned by the public","text":"With the year winding down, 2025 has left many top Democratic figures wishing things had turned out differently — or maybe that the public had put its focus elsewhere. Here are the top political turkeys ripped by conservatives in the past year. Chuck Schumer Senate Minority Leader Chuck Schumer, D-N.Y., has received scorching criticisms from Republicans and Democrats alike in the wake of a 43-day government shutdown that left Democrats empty-handed. Democrats led by Schumer and House Minority Leader Hakeem Jeffries, D-N.Y., had refused to advance spending legislation to keep the government open past Oct. 1 without first considering extensions to supplemental funding for Obamacare. But by the end of a painful and highly visible shutdown — the longest in the country’s history — Republicans had rebuffed efforts to negotiate over the subsidies. Without an off-ramp or negotiating strategy, even the chamber’s most progressive members expressed doubts about continuing the shutdown. \"I just don’t get what the point is of delaying even longer,\" Sen. Elizabeth Warren, D-Mass., said just moments after a key vote to reopen the government cleared the Senate. Many Democrats in and out of Congress blamed Schumer for failing to either keep Democrats united in their standoff over the subsidies or for failing to deliver on some other sort of concession. Across both chambers on Capitol Hill, Schumer faces questions about his continued role as the party's leader in the Senate. CHUCK SCHUMER BECOMES TOP TARGET FROM MEDIA PERSONALITIES AMID SHUTDOWN FALLOUT Kamala Harris The country’s worst kept secret got a fresh coat of paint in 2025 when a groundbreaking book by CNN’s Jake Tapper and Axios reporter Alex Thompson took readers behind the scenes of President Joe Biden’s physical decline — and the effort to hide it. Questions about what Vice President Kamala Harris knew about Biden’s cognitive state rebounded in the wake of the book’s publication. Harris — who maintains that Biden could have served out another term — would eventually take his place as the Democrat on the ticket in 2024. At the time, Harris’ stand-in for Biden was seen by many in the party as the obvious choice. But that view soured later when President Donald Trump stormed to victory in November and questions arose about whether Harris should have joined the calls for Biden to step down. KAMALA HARRIS DOESN'T RULE OUT ANOTHER PRESIDENTIAL RUN IN NEW INTERVIEW: ‘I AM NOT DONE’ The autopen The presidential walk of fame at the White House features portraits of every president — except one. Instead of President Joe Biden, the Trump administration put up a picture of an autopen, a device used to mimic the signature of someone else, symbolizing President Joe Biden’s reliance on his inner circle to make presidential-level decisions. The House of Representatives launched an investigation into just how much of his power Biden decided to delegate. In a report put out in October, the House Oversight Committee slammed the Biden administration for what it called \"invalid executive actions.\" \"The report exposes how President Joe Biden’s top advisors, political operatives, and personal physician concealed the President’s mental and physical decline from the American people. The findings reveal that as President Biden’s condition deteriorated, his aides exercised presidential authority and facilitated executive actions without his direct authorization,\" the report states. Questions remain about just how far Biden's use of the autopen went and whether the legal standing of sensitive decisions like pardons could receive a second look. Andrew Cuomo The former governor of New York attempted a political comeback in 2025 by running for New York City mayor. The bid, which came after disastrous management of the state’s nursing home facilities during the COVID-19 pandemic and sexual harassment allegations during his time as governor, did little to improve his political standing. Cuomo failed to capture the Democratic Party nomination, ultimately losing out to Zohran Mamdani by 7.7 percentage points. Refusing to call it quits, Cuomo launched an independent campaign. There, Cuomo again fell behind Mamdani — this time by almost nine points. In addition to a personal loss, Cuomo’s defeat dovetails with questions about whether more traditional Democrats can still compete with the vision offered by far-left figures in the party. \"This campaign was necessary to make that point – a caution flag that we are heading down a dangerous, dangerous road,\" Cuomo said in his concession speech. \"Well, we made that point, and they heard us, and we will hold them to it.\" FROM AOC TO ZOHRAN MAMDANI, THE DEMOCRATS ARE PEDDLING FAR-LEFT POLITICS Chuck Schumer — again Schumer’s woes over the shutdown weren’t the only sore spot for the Senate minority leader in the last few months. The meteoric rise of Zohran Mamdani put this year’s biggest political turkey in a pressure cooker he could not escape. He first faced questions about Mamdani in the lead up to the New York mayoral primary. Then reporters began to ask him if he would endorse Mamdani after the self-proclaimed socialist secured the Democratic nomination. And even in the closing days of the race, Schumer faced questions about whether he had made a decision to support the race’s clear front-runner. Through it all, Schumer gave the same non-answer. \"Look, the bottom line is very simple. I have a good relationship with him, and we’re continuing to talk,\" Schumer told reporters less than a week out from the election. While other Democrats, including Jeffries, also delayed in giving responses about Mamdani, Schumer’s refusal to speak on the New York City Mayoral race stands out. Schumer’s dismissal of the topic fueled questions about the direction of the Democratic Party and whether its congressional factions could play along with the momentum of its leftward flank. CLICK HERE TO DOWNLOAD THE FOX NEWS APP That — coupled with questions about his management of the shutdown — has resulted in some Democrats wondering if the Senate’s top Democrat should make way for someone new.","summary":"From Kamala Harris to Chuck Schumer, here are the politicians roasted in 2025 over the 2024 campaign, shutdown and other blunders.","url":"https://www.foxnews.com/politics/political-turkeys-2025-blunders-2025-never-pardoned-public","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/chuck-schumer-with-his-arms-up.jpg","video":null,"publish_date":"2025-11-28 22:00:18","author":"Leo Briceno","authors":["Leo Briceno"],"language":"en","category":"politics","source_country":"US","sentiment":-0.199}]}