{"offset":0,"number":50,"available":328,"news":[{"id":394351530,"title":"Trump promised an economic boom. That’s not quite what has happened","text":"Among them were pledges to close the border and deport illegal immigrants, end inflation, lower interest rates, revive US manufacturing, particularly the auto industry, unwind Biden’s green energy initiatives, reduce US deficits and debt, lower the US trade deficit, spark a boom in the oil and gas industry that would lead to lower petrol prices and end the “affordability” crisis that played a major role in discrediting the Biden administration and in Kamala Harris’ loss.\n\nHe hasn’t conquered inflation, although it has declined, slightly. When Joe Biden left office the US inflation rate was 2.9 per cent. The most recent data says it is now 2.7 per cent.\n\nFood inflation, however, has picked up and is now 3.1 per cent and rising, which feeds into the affordability issue that is front of mind for US households and voters and helps explain why Trump’s popularity has fallen over the year.\n\nWhile his tariffs haven’t done what most economists expected and fed into inflation, yet, that may be because their imposition was delayed, which gave importers time to build inventories and caused companies to absorb their cost until the regime settled.","url":"https://www.smh.com.au/world/north-america/trump-promised-an-economic-boom-that-s-not-quite-what-has-happened-20260120-p5nvcn.html","image":"https://static.ffx.io/images/$zoom_0.1864%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/e08019383cdc8bc60450fa30d0153d9eb75f99f4","video":null,"publish_date":"2026-01-20 00:56:02","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":0.012},{"id":394347062,"title":"Kamala Harris aides grilled Tim Walz on China ties during running mate vetting process: report","text":"Campaign aides to former Vice President Kamala Harris quizzed Minnesota Gov. Tim Walz on whether he was an agent for the Chinese Communist Party before selecting him as her running mate, according to a report.\n\nThe intense vetting of Walz, which was reported by CNN, came about after Harris aides dug into the governor’s past, including the several trips he took to China before entering politics.\n\nWalz’s China ties stem from his years as a teacher before entering politics.\n\nHe taught in China in the late 1980s shortly after the Tiananmen Square crackdown and later returned multiple times, leading student trips to the country over the years, according to accounts reviewed during the vetting process.\n\nThose past visits, Harris aides said, prompted questions about whether he had ever acted on behalf of a foreign government, which Walz denied.\n\nAn aide for Harris, who became the Democratic Party’s de facto nominee after then-President Joe Biden dropped out of the 2024 race, also asked Josh Shapiro if he had ever been an “agent of the Israeli government” while vetting him as her possible No. 2, the Pennsylvania governor wrote in his memoir.\n\nShapiro, the charismatic 52-year-old who is Jewish, wrote in his upcoming memoir that he took offense to the suggestion that he may hold “dual loyalty” — an accusation that many consider to be antisemitic.\n\nDana Remus, a former White House counsel under Biden who was assigned to the vetting team by Harris, asked Shapiro in the summer of 2024: “Have you ever been an agent of the Israeli government?”\n\n“Was she kidding?” Shapiro wrote in his book, “Where We Keep the Light: Stories From a Life of Service.”\n\n“I told her how offensive the question was.”\n\nShapiro wrote that he grew more agitated as Remus continued her line of questioning.\n\n“Well, we have to ask,” Remus reportedly told the Pennsylvania governor. “We just wanted to check.”\n\nShe is then reported to have asked: “Have you ever communicated with an undercover agent of Israel?”\n\n“If they were undercover, I responded, how the hell would I know?” Shapiro wrote in the memoir, an excerpt of which was obtained by CNN.\n\n“I calmly answered her questions. Remus was just doing her job. I get it. But the fact that she asked, or was told to ask that question by someone else, said a lot about people around the VP.”\n\nIn his younger years, Shapiro spent time on an Israeli kibbutz and also volunteered on an Israeli army base.\n\nProminent Jewish figures including Deborah Lipstadt, the Holocaust expert who served as special envoy for antisemitism during the Biden administration, denounced the insinuations of dual loyalty.\n\nLipstadt said the questions posed to Shapiro were “classic antisemitism.”\n\nHarris also pressed Shapiro during vetting about his outspoken denunciations of antisemitism on college campuses, including his public criticism of the University of Pennsylvania over its handling of anti-Israel protests, according to accounts of the process. \n\nThe questioning focused on whether his forceful stance could become a political flashpoint on the national stage, sources familiar with the vetting said, as the war in Gaza fueled tensions within the Democratic coalition.\n\nHarris ultimately passed over Shapiro, a decision that came after a fraught vetting process and lingering tensions between the two camps. \n\nIn her own campaign account of the 2024 race, Harris suggested she worried Shapiro would struggle to accept a supporting role and could chafe as vice president — claims the Pennsylvania governor later angrily rejected through aides as “simply ridiculous.”\n\nInstead, Harris selected Walz as her running mate, touting the Minnesota governor’s Midwestern roots, military service and ability to connect with working-class voters as assets on the ticket. \n\nThe pairing, however, failed to stop Donald Trump’s return to power, with Harris losing the general election by a large margin — a defeat that has since fueled renewed scrutiny of the rushed vetting process and the decisions that shaped the Democratic ticket.\n\nThe Post has sought comment from Remus, who is currently a partner at the powerhouse law firm Covington & Burling.\n\nReps for Harris, Shapiro and Walz were not immediately available for comment.\n\nShapiro’s memoir was published by Harper, an imprint of HarperCollins, which shares common ownership with The Post. The book is due out on Jan. 27.","summary":"The intense vetting of Walz came about after Harris aides dug into the governor's past, including the several trips he took to China before entering politics.","url":"https://nypost.com/2026/01/19/us-news/kamala-harris-aides-grilled-tim-walz-on-china-ties-during-vetting-process-report/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/01/119241671.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/VXooliAe-RyIcpnTz.mp4","publish_date":"2026-01-19 23:46:47","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","source_country":"us","sentiment":0.247},{"id":394348038,"title":"Too Fun to Check: Kamala's an 'Exalted' Frontrunner for 2028!","text":"Exalted'? For what? Blowing through $1.5 billion and leaving the DNC in a debt crater while failing to win a single swing state from a former president who Kamala Harris insisted was \"disqualified\"?\n\nAxios reports that certain demos might exalt Harris for this performance. And that might be enough to vault her into the 2028 presidential sweepstakes ... at least in the beginning:\n\nMany Democratic powerbrokers in D.C. are done with Kamala Harris. They see the former vice president as a politically toxic reminder of an unpopular president, Joe Biden.But among lots of Democratic voters — particularly Black voters crucial in a Democratic primary — Harris is an exalted, historic figure.Driving the news: This past week put the party's divide over Harris into focus:In a swing through the deep South, she was greeted like a rock star by enthusiastic crowds of mostly Black men and women, and white women. Many told Axios they want her to run again in 2028.Harris' appearances — like early polling for the 2028 race — defied top Democrats' belief that she isn't popular with the party's base, and that people blame her for Donald Trump's 2024 victory.\n\nEr ... oooookay. How did that work out 14 months ago? Yes, Harris got 75 million votes, but most of those were from coastal states that would vote Democrat even if a corpse sat on top of the ticket. (And one nearly did, let us not forget.) In 2024, Harris got the nomination without any sort of competition at all, strictly on her \"exalted\" place as Joe Biden's VP, arranged to appease these same groups when the Great Biden Cover-Up got exposed on national television. \n\nWas that enough to win an election? Not in 2024, when Democrats had as their opponent the most polarizing figure in the Republican Party. So much for an \"exalted\" status. Marshaling women and black voters isn't a bad strategy, but Harris was and is too inept to take advantage of it, as she proved in the election despite being given a head start and $1.5 billion. \n\nNevertheless, some Democrats see Harris drawing crowds on her book tour and want to translate that \"energy\" as populist support. Axios calls it a \"campaign-in-waiting\":\n\nTraveling by bus, she drew thousands of people to packed auditoriums in New Orleans, Jackson, Miss., and Memphis as part of her recently expanded book tour.In New Orleans she got a standing ovation when she was introduced to swear in new Mayor Helena Moreno, a longtime friend and ally.\n\nEr ... oooooookaaaaaay. Axios realizes that Kamala had an actual campaign in 2024, right? She drew thousands to her events during those 107 days too. How did that \"energy\" work out? \n\nAnd for that matter, has Kamala and the DNC retired her debt from that campaign yet? Harris barely lifted a finger in dealing with that debt last year. Will Democrats really want to cosign on Kamala 2028, too?\n\nThis may be what Josh Shapiro is targeting with the upcoming release of his own book. The Pennsylvania governor made no secret of his discomfort with the Harris team during and after the election, but the publication of Harris' memoir angered him, and he's getting the last word on the radical and anti-Semitic nature of her campaign. Shapiro may want to position himself for a 2028 presidential primary run too, and it would make sense to set Harris up as a piñata for that purpose. \n\nThe truth, however, is that Harris has been a piñata all along. She's utterly inept on the campaign trail. She proved that in 2019, when the nomination was hers for the taking, and she word-saladed her way out of the race two full months before the Iowa caucuses. She got a head start and a massive fortune in 2024 without competing for the nomimation at all, and she lost to the Democrats' bete noire while barely landing a punch on him. Trump became the first Republican to win the popular vote in 20 years against Harris. If she runs again, the momey will go elsewhere, and Harris likely will talk herself out of competition even before that. I'm not sure which sources are whispering into the ear of Axios, but they don't come from Reality USA. \n\nEditor’s Note: Every single day, here at Hot Air, we will stand up and FIGHT, FIGHT, FIGHT against the radical left and deliver the conservative reporting our readers deserve. Sometimes, however, we just point and laugh, and let the radical Left embarrass itself. This is one of those times.\n\nHelp us continue to point, laugh, and expose the idiocy of progressive elites. Join Hot Air VIP and use promo code FIGHT to get 60% off your membership!","url":"https://hotair.com/ed-morrissey/2026/01/19/too-fun-to-check-kamalas-an-exalted-frontrunner-for-2028-n3810999","image":"https://media.townhall.com/cdn/hodl/2025/304/971a5fa0-863a-455b-b915-b95c317fcfc8.jpg","video":null,"publish_date":"2026-01-19 23:40:27","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","source_country":"us","sentiment":0.058},{"id":394346320,"title":"Josh Shapiro says Kamala Harris’ team asked if he was an Israeli agent during vetting process (Video)","text":"Pennsylvania Gov. Josh Shapiro says former Vice President Kamala Harris' team asked him if he was a double agent for Israel while he was being vetted to be her running mate. Political strategists John McCarthy and Lance Trover join with analysis.\n\nCBS News 24/7 is the premier anchored streaming news service from CBS News and Stations that is available free to everyone with access to the internet and is the destination for breaking news, live events, original reporting and storytelling, and programs from CBS News and Stations' top anchors and correspondents working locally, nationally and around the globe. It is available on more than 30 platforms across mobile, desktop and connected TVs for free, as well as CBSNews.com and Paramount+ and live in 91 countries.\n\nSubscribe to the CBS News YouTube channel: https://youtube.com/cbsnews\nWatch CBS News 24/7: https://cbsnews.com/live/\nDownload the CBS News app: https://cbsnews.com/mobile/\nFollow CBS News on Instagram: https://instagram.com/cbsnews/\nLike CBS News on Facebook: https://facebook.com/cbsnews\nFollow CBS News on X: https://twitter.com/cbsnews\nSubscribe to our newsletters: https://cbsnews.com/newsletters/\nTry Paramount+ free: https://paramountplus.com/?ftag=PPM-05-10aeh8h\n\nFor video licensing inquiries, contact: licensing@veritone.com","summary":"Pennsylvania Gov. Josh Shapiro says former Vice President Kamala Harris' team asked him if he was a double agent for Israel while he was being vetted to be her running mate. Political strategists John McCarthy...\n\n\nThe post Josh Shapiro says Kamala Harris&#8217; team asked if he was an Israeli agent during vetting process (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2026/01/19/josh-shapiro-says-kamala-harris-team-asked-if-he-was-an-israeli-agent-during-vetting-process-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2026/01/19/maxresdefault-49.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1768866679","video":null,"publish_date":"2026-01-19 23:21:20","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","category":"politics","source_country":"in","sentiment":0.196},{"id":394340350,"title":"Fox News guest says Democrats have a ‘Jewish problem’","text":"Hugh Hewitt, a conservative political commentator and radio host, claimed “the Democratic Party has a Jewish problem” on Monday, in response to Pennsylvania Governor Josh Shapiro’s recent admission that the Harris campaign asked him if he was a “double agent for Israel.”\n\nIn an excerpt of Shapiro’s upcoming memoir, published in the New York Times on Sunday, the governor revealed that the Harris campaign asked him the question and others like it while vetting him to be Vice President Kamala Harris’s running mate.\n\nHewitt, who has long accused Democrats of being anti-religion in general, claimed on Fox News’s “America Reports” that Shapiro’s revelation means the entire Democratic Party doesn’t like Jewish people \n\n“It’s astonishing to me that the Democratic Party has a Jewish problem,” Hewitt said, making a generalized statement. \n\n“They don’t like them and the left wing is ascendant in the Democratic Party and it’s a burden that the Democratic Party candidates in 2028 are going to share with Governor Shapiro.”\n\nIn his book, Shapiro recounted how Harris’s team focused on his views of Israel. In addition to asking if he was a “double agent,” a member of the Harris team also reportedly asked the governor if he had ever “communicated with an undercover agent.” \n\nHewitt explained that the question about a Jewish person’s loyalty to Israel was a “classic trope” of the “ancient evil” – or the antisemitic conspiracy that all Jewish people are allied only to other Jewish people and thus cannot be trusted. \n\nThe recent disclosure has shocked political commentators and lawmakers. \n\nDemocratic Rep. Josh Gottheimer said if Shapiro’s recount is true, then the Harris campaign should explain why they asked the question.\n\n“That kind of insinuation and targeting is antisemitism, plain and simple. No one should be judged or discriminated against because of their faith. We must do better,” Gottheimer said. \n\nShapiro, widely considered a Democratic presidential contender in 2028, says in his memoir that Harris’s team brushed aside his remarks about the question being “offensive.” \n\n“Well, we have to ask,” the questioner responded before continuing. \n\nShapiro was among three contenders to run alongside Harris in the election. Ultimately, Harris chose Minnesota Governor Tim Walz, but some political commentators questioned whether Shapiro was not chosen because he was Jewish.\n\nHewitt told “America Reports” that he believes the team asked Shapiro the question knowing it would elicit a negative reaction.\n\n“ I think they were trying to drive Josh Shapiro off the ticket,” Hewitt theorized.","summary":"Hugh Hewitt has accused Democrats of being anti-religion for years","url":"https://www.independent.co.uk/news/world/americas/us-politics/hugh-hewitt-fox-news-democrats-jewish-b2903520.html","image":"https://static.independent.co.uk/2026/01/19/21/26/Screenshot-2026-01-19-at-4-57-25-PM.png?crop=1028,685.3,x0,y18.6&trim=18,0,98,0&width=1200","video":"https://cdn.jwplayer.com/videos/eA6LxJNQ-OhrQWqOm.mp4","publish_date":"2026-01-19 22:29:17","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.317},{"id":394327446,"title":"2028 Democrat Hopefuls: 19 Out of 20 Think Biology's Just a Suggestion","text":"The Democrat hopefuls for 2028 are already starting to try to make sure all of their web-footed fowl are arranged in a linear fashion. Now, that's going to take a lot of work - these are Democrats, after all, and sometimes it seems like they can't agree on the color of the sky without first consulting to see what the terminally woke, far-left voters are saying. \n\nThat doesn't bode well for their chances in any national elections. But then, for many Democrats, if reality is over here, then they are miles away, over there. Case in point: Axios, in a recent questionnaire, asked \"almost 20\" Democrats if it was possible for a man to become a woman. All but one of them declined to answer. I never thought I'd give Rahm Emanuel any props for anything, but he was the only one who said \"no.\"\n\nAxios questioned top Democrats who are considered possible 2028 hopefuls on trans issues, and found that \"most didn’t want to talk,\" including former Vice President Kamala Harris, New York Rep. Alexandria Ocasio-Cortez, Illinois Gov. JB Pritzker, and California Gov. Gavin Newsom.The questions were whether transgender girls who were born male should participate in girls' sports, whether transgender youths under 18 should be allowed to be placed on puberty blockers and hormones, and, \"Can a man become a woman?\"Only former Chicago Mayor Rahm Emanuel would definitively answer, saying his responses were unchanged from an interview last year when he said a man can't become a woman and biological boys shouldn't play in girls' sports.\n\nI'd like to see the breakdown on who answered what on the \"Can a man become a woman\" question. A \"yes\" answer is a stark denial of reality - hint, a man can't become a woman, nor vice versa; a man is a man and a woman is a woman, and ne'er the twain shall meet. That's Reproductive Biology 101, which apparently none of these Democrats have bothered with. Either that, or the hyper-woke have laid such an emotional beat-down of these Democrats that they are now afraid to acknowledge reality.\n\nTwo other Democrats tried to split the baby.\n\nPennsylvania Gov. Josh Shapiro and former Transportation Secretary Pete Buttigieg also responded to the questions.Shapiro doubled down on his previous comments that local sports officials should be the ones in charge of determining the participation of transgender athletes in sports, but his personal view was that trans youths don't deserve an \"unfair advantage on the playing field.\"A spokesperson for Buttigieg referred Axios to an NPR interview he gave last year, where he acknowledged \"serious fairness issues\" in the trans athlete sports debate and called for compassion for transgender people.\n\nThat's better, I suppose; at least they are leaning in the right direction where sports are concerned.\n\nRead More: Plaintiff's Attorney Tops KBJ's Bizarre Word Salads in SCOTUS Trans Athletes Case\n\nThis is an issue in which the Republican Party has been handed a big, heavy cudgel to beat the Democrats with. This should be a debate question every time any Republican candidate faces any Democratic opponent; the Republican Party should insist on it. Put them on the record. Make them alienate either their hyper-woke constituents or the rest of America. I know which side a voting majority is going to come down on.\n\nMost of us know the real deal - boys will be boys, men will be men, and girls and women will be girls and women. These are the options. And to that, all I have to say is, vive la difference!\n\nEditor's Note: This article was updated post-publication for clarity. \n\nEditor’s Note: Do you enjoy RedState's conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin RedState VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://redstate.com/wardclark/2026/01/19/2028-democrat-hopefuls-19-out-of-20-think-biologys-just-a-suggestion-n2198306","image":"https://media.townhall.com/cdn/hodl/2023/93/4ad7c350-455f-4507-8ed4-a54fa7edfbc2.jpg","video":null,"publish_date":"2026-01-19 22:11:58","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"politics","source_country":"us","sentiment":-0.331},{"id":394322732,"title":"Newsom Strains To Flip Script On California's Failures","text":"It’s an odd predicament for a leading Democratic presidential contender. \n\nGavin Newsom’s biggest strength—political spin and performance come almost second nature to him—could also be his biggest liability as he strains to remake the tarnished image of the state he has governed for the last seven years.\n\nNewsom, with his smooth-talking, rapid-fire responses and his attempt to out-Trump Trump on social media aggression, is everything Kamala Harris wasn’t in 2024. But neither Californian can easily shake the biggest millstone dragging down their White House ambitions. Their failed progressive policies have sullied the Golden State’s image, driving up prices, homelessness, and mismanagement. The failures have not only driven citizens away but are also likely to turn off voters in swing battleground districts as well.\n\nCalifornia’s failures weren’t Harris’ biggest weakness in 2024—her word salads were. But the Golden State’s downward spiral was a close second.\n\nAs wildfire victims held vigils and prayer circles on the anniversary of the devastating Palisades and Eaton fires, Newsom on Thursday attempted to flip the script on California’s role as a GOP punchline.\n\nIn his final State of the State address after years of releasing videotaped remarks, Newsom cast Trump’s control of Washington as a “carnival of chaos” amid the Democratic furor over an ICE agent shooting and killing a woman in Minnesota. He then positioned California as a “beacon” of fairness and resistance to Trump’s heavy-handed rule.\n\nAddressing the California legislature, which had just observed a moment of silence for the slain Minnesota woman, Renee Nicole Good, Newsom repeatedly pointed to Trump as a power-hungry threat to democracy who abused his power to call in the National Guard to quell unrest over ICE arrests and raids.\n\n“The president believes that might makes right, that the courts are simply speed bumps, not stops. That democracy is a nuisance to be circumvented. Secret police, businesses being raided, windows smashed, citizens detained, citizens shot, masked men snatching people in broad daylight, people disappearing,” Newsom charged.\n\n“None of this is normal,” he added.\n\nAfter throwing out the red meat for the Democratic base, Newsom then set out to normalize California’s dizzying array of failures under his watch.\n\nhe told state lawmakers.\n\nNewsom’s defiant defense of his state as a shining example for others to emulate may come as a shock for those who haven’t been watching his reinvention as a social media agitator and leader of the national redistricting battle.\n\nBut Newsom’s attempt to go on offense on his biggest weakness—his policy failures—was his most audacious and sweeping thus far. \n\nAfter mimicking Trump’s belligerent social media style, Newsom stole another Trump play, labeling the state’s critics as suffering from “California Derangement Syndrome,” a revision of the “Trump Derangement Syndrome,” which MAGA deploys to brush off condemnation.\n\n“The declinists,” the pundits and conservative critics, simply don’t know the updated facts, Newsom asserted, arguing that they are working to “tear down, to try to attack all of our progress.”\n\nEarly data for 2025, he said, indicate a 9% decline in homelessness, the first drop after an explosion of unsheltered people in California. He failed to mention that from 2019 to 2024, under his watch, homelessness rose to 188,000, a net increase of 37,000, or 24%, even though the state spent roughly $24 billion trying to curb it.\n\n“So, our investments paid off,” he claimed without an explanation.\n\nNewsom acknowledged that the decline was “not good enough,” and more work needs to be done as long as big homeless encampments still exist in major cities around the state. He failed to mention the high number of homelessness deaths across the state that could be contributing to the 9% decline, as well as the danger of allowing any encampments to remain.\n\nJust hours after the speech, a fire at a homeless camp in a Los Angeles suburb broke out, the second in the last two weeks.\n\nNewsom also claimed credit for “double-digit decreases in crime” across California, without acknowledging that those figures are still higher than pre-pandemic levels in some areas and that property crime continues to plague major cities such as San Francisco and Los Angeles.\n\nWhile touting minor California successes, he often followed up by acknowledging that there is still “work to do” when it comes to bringing down housing costs, overall “affordability,” lowering crime rates, and improving fire insurance coverage.\n\nThough he noted that he had debated whether or not to mention high-speed rail, another frequent target for fiscal conservative attacks, he hailed the $13.8 billion spent so far and progress on projects in the state’s agricultural Central Valley as one of the “great economic investments” in the region. Those lines, he said, “will make commute times shorter and make life more affordable.” He failed to mention that the project was launched in 2008, and more than 17 years later, no trains are running.\n\nNewsom even touted California’s status as having the highest taxes of any state in the country, stressing that Democrats in the state had designed the most “progressive” system in the country, which he argued is far fairer for middle-class and low-wage earners.\n\n“So, the question to all of you—who are the high-tax states? Just consider Texas. Just consider Florida, the two most regressive tax states in America,” Newsom said. “They’re hammering their low-income earners. They’re hammering them more than their wealthiest. Who are the high-tax states? California stands for fairness.”\n\nCalifornia Republican Party Chairwoman Corrin Rankin, responding to the address, cast Newsom as not only out of touch but also deranged.\n\n“Governor Newsom told Californians that homelessness is down, crime is at record lows, schools are improving, and Los Angeles is recovering after the Palisades fires,” she said. \n\nRep. Kevin Kiley, a Republican representing parts of Sacramento in Congress, assailed the address as pure gaslighting.\n\n“For once, Newsom is right,” he said. \n\n“California has led the nation during his tenure in homelessness, unemployment, poverty, illiteracy, gas prices, electricity costs, debt, and outmigration. That is the true state of our state.”\n\nKiley also provided a preview of the conservative line of attack that could haunt the governor leading into the 2028 presidential race.\n\n“California, also, of course, leads the nation in fraud … Minnesota’s fraud scandals have just ended Tim Walz’s political career,” Kiley said.\n\n“California’s should likewise end Gavin Newsom’s.”","url":"https://www.zerohedge.com/political/newsom-strains-flip-script-californias-failures","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2026-01/2026-01-19_13-28-11.jpg?itok=jsryMxGA","video":null,"publish_date":"2026-01-19 22:10:00","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.201},{"id":394320852,"title":"Mexico using 'weaponized immigration' to undermine US sovereignty, author of new book alleges","text":"Investigative author Peter Schweizer alleges the Mexican government is operating a coordinated influence effort inside the United States, using diplomatic missions, education programs and migrant outreach initiatives in ways he argues go far beyond traditional diplomacy. In an interview with Fox News Digital, Schweizer said his forthcoming book, \"The Invisible Coup,\" available Tuesday, documents what he describes as \"weaponized immigration,\" a strategy he claims Mexican officials view as a means to exert political leverage inside the U.S. \"Foreign powers are using migration as a weapon to undermine American sovereignty,\" Schweizer said. \"Mexico is a clear example of this.\" Schweizer pointed to Mexico’s expansive diplomatic footprint in the United States, noting that the country operates 53 consulates nationwide — far more than most U.S. allies. US EMBASSIES IN THE WESTERN HEMISPHERE DIRECTED TO REPORT ON HUMAN RIGHTS VIOLATIONS TIED TO MASS MIGRATION \"Those consular officials have been tied up in organizing political activity in the United States, which is a clear violation of their diplomatic status,\" Schweizer, investigative journalist and founder of the Government Accountability Institute (GAI), said. Schweizer alleged that Mexican consular officials have supported or encouraged anti-ICE protests in the U.S., pointing to what he described as instances in which officials praised or took credit for community mobilization following immigration enforcement actions. Mexican consulates routinely provide legal assistance and outreach to migrant communities after ICE raids, which Mexican officials characterize as consular protection duties, though critics argue the efforts blur the line between assistance and political activism. Schweizer also cited the role of Mexico’s so-called \"migrant legislators\" — elected Mexican officials who reside in the United States and represent Mexicans living abroad — as evidence of cross-border political engagement. While those officials do not hold U.S. office, some have participated in advocacy events in the United States, raising questions among critics about the scope of foreign political activity on American soil. Schweizer further claimed the Mexican government is actively discouraging assimilation among migrants living in the U.S., pointing to government-produced Spanish-language textbooks distributed to American school districts. STATE DEPARTMENT YANKS VISAS FROM MEXICAN EXECUTIVES IN MIGRANT SMUGGLING CRACKDOWN \"The Mexican government gives textbooks to school districts in the United States from Los Angeles to Orlando,\" Schweizer said. \"Those textbooks are designed to make sure that migrant children view themselves as Mexican first, not as Mexican–American.\" Mexican government–produced textbooks are distributed inside the United States through Mexico’s consular network, primarily as donated supplemental materials. The books are published by Mexico’s state textbook authority and are typically made available through consulates, libraries, community centers and, in some cases, schools that request them for Spanish-language or heritage instruction. According to Schweizer, the textbooks present what he described as a highly politicized version of American history, including depictions of the Mexican–American War that frame the United States as an adversary. \"The textbook describes the United States as the enemy,\" he said, adding that school districts may be accepting the materials without closely reviewing their content. Schweizer also alleged coordination between Mexican diplomatic missions and U.S.-based advocacy groups that he said crosses into American electoral politics. He referenced a 2024 meeting held at the Mexican consulate in Oklahoma City that he said included Mexican diplomatic officials and Democratic Party activists. \"The conversation was about how California had been turned from red to blue, Arizona had been turned from red to blue, and how Republicans were going to ‘find out’ that they were planning to turn the whole country blue,\" Schweizer said, citing what he described as a transcript of the meeting. \"That’s not what diplomatic officials should be engaged in,\" he added. Asked whether such conduct would violate U.S. law, Schweizer said foreign diplomats are prohibited from participating in American elections and argued that expulsion of involved officials would be an appropriate response. \"We need a zero-tolerance policy,\" he said. \"We’re gearing up for midterm elections, and based on their history, this should not be tolerated.\" Schweizer also pointed to a Mexican government–backed streaming platform known as Migrant TV, which he said was created to communicate with migrants living in the United States. \"When you look at the content, it was extremely pro-Kamala Harris and very anti-Trump,\" Schweizer said, adding that the platform has portrayed ICE officials as Nazis and fascists. The Mexican government launched TV Migrante, a channel dedicated to giving voice to migrants, in March 2025. The channel is available across Mexico and in the U.S. on digital platforms and some cable packages that include international channels. Schweizer argued that Mexico’s approach should be viewed in a broader geopolitical context, drawing comparisons to China’s use of diplomatic missions and affiliated activist groups in the United States. \"The question is why are we tolerating this?\" he said. \"I think it’s high time to say enough is enough.\" The allegations come as relations between Washington and Mexico are under strain, with President Trump warning of tougher action against Mexican drug cartels and border security failures. Trump has said the U.S. is prepared to escalate its posture, while Mexican President Claudia Sheinbaum has emphasized cooperation and respect for sovereignty. Sheinbaum has highlighted what she describes as progress cracking down on cartels, declining migration flows and joint security efforts with U.S. officials, while warning against any violation of Mexico’s territorial integrity. Schweizer said he remains skeptical of those assurances, arguing that migration provides Mexico with both economic and political leverage. \"More than $60 billion flows from the United States to Mexico in remittances,\" he said. \"That’s a crucial lifeline.\" In 2024 Mexico received around $62.5 billion from remittances sent from the U.S, according to economists with BBVA Research group. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"They view (immigration) as an opportunity to exert influence and sovereignty into the United States.\" Mexican officials have previously said their consulates exist to provide services and protect the rights of Mexican nationals abroad, and the Mexican government has emphasized its partnership with Washington on security and border enforcement. The Mexican embassy could not be reached for comment on Schweizer's claims.","summary":"Author alleges Mexico uses consulates and migrant programs to influence U.S. politics, claiming &quot;weaponized immigration&quot; undermines American sovereignty.","url":"https://www.foxnews.com/politics/mexico-using-weaponized-immigration-undermine-us-sovereignty-author-new-book-alleges","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/us-mexico-flag.jpg","video":null,"publish_date":"2026-01-19 21:58:14","author":"Morgan Phillips","authors":["Morgan Phillips"],"language":"en","category":"politics","source_country":"us","sentiment":0.217},{"id":394308538,"title":"How Trump’s first-year victories tee up affordability wins in year 2","text":"Twelve months ago, Americans were rightfully angry about record inflation under Joe Biden and Kamala Harris — with rates that reached nearly 9% in mid-2022. \n\nWhat a difference a year makes.\n\nToday, as President Donald Trump marks the one-year anniversary of his second inauguration, we’re at the lowest inflation rate in five years, down 70% from that painful peak under Biden.\n\nHere in New York, the cost-of-living crunch has been exacerbated by the high-tax, big-spending policies of Gov. Kathy Hochul and Albany Democrats, who continue to nickel-and-dime working people with tax, toll, fare, fee and utility increases at every turn.\n\nAnd with Zohran Mamdani at the helm in New York City, there’s no end in sight: Despite the city’s $12 billion budget gap, the new mayor is pledging to raise taxes and increase spending even further, with Hochul’s help.\n\nAll this Democratic mismanagement is why I was proud to lead the fight in Washington to win a massive working-families tax cut, standing up to leaders in both parties to achieve a quadrupling of the SALT deduction.\n\nThat reform means 90% of Hudson Valley residents can deduct their state and local taxes on their federal tax return — easing the burdens imposed by Albany. \n\nThe Republican tax cut the president signed last year means a $3,293 average tax savings for the typical Hudson Valley family of four; a new $6,000 tax deduction for our seniors; an average $3,350 savings for workers earning tips and overtime; and a $2,200 per-child tax credit for 87,770 families in my district.\n\nThanks to Trump’s commonsense economic policies and determined leadership, years of economic chaos and energy policies that punished production are in the past, and Americans are finally starting to feel some real relief.\n\nAcross the country, the cost of living is no longer spiraling upward, wages are rising, the job market is stabilizing, and perhaps most notably, gas prices are coming down.\n\nWe all remember that under Joe Biden just a short while ago, gas prices were at all-time record highs, our strategic petroleum reserve was depleted, and energy producers were handcuffed by unnecessary, burdensome regulations.\n\nTrump and congressional Republicans reversed that failed approach immediately.\n\nIndustry leaders have responded to the president’s pro-growth, pro-energy actions, and Americans are now seeing results in their paychecks and at the pumps.\n\nIn Trump’s second term, gas prices have fallen to the lowest average price in more than four years and Americans are on track to spend the lowest amount of their disposable income on gas in the last two decades.\n\nIn addition to falling gas prices, cars have become more affordable and easier to manufacture here in America, due in part to the swift elimination of radical and costly electric-vehicle mandates that jacked up prices and reduced safety. \n\nGrocery prices, too, are coming down, with the cost of eggs, dairy, produce and prescription drugs all declining.\n\nFurthermore, housing affordability is finally trending in the right direction, with the average 30-year fixed mortgage rate sitting 12% lower than when Trump began his second term — saving Americans $3,000 per year on new mortgages.\n\nAll these results are creating a renewed spirit of optimism for hardworking Americans: At last, this country is headed in the right economic direction.\n\nYet even with all this progress, there’s important work ahead to ensure every one of us feels the full benefit of this president’s pro-worker, pro-family, pro-business, pro-senior agenda.\n\nTrump’s first year has been a victory not just for sound economic policy, but also for economic prosperity.\n\nAs we enter Year 2 of Republican leadership in Washington, our focus will remain on affordability.\n\nWe’ll work on critical health-care reforms: reining in health-care costs by taking on the insurance companies; enacting “most favored nation” status with the pharmaceutical companies to ensure Americans pay lower prices rather than subsidize other countries; expanding access to health savings accounts to put money in the hands of the people, not the insurance companies, and more.\n\nWe’ll reduce housing costs by cutting red tape, increasing access to capital for building new housing, cutting taxes on capital gains from home sales, and preventing investors from gobbling up the housing market.\n\nFinally, we’ll enact long-sought permitting reforms to increase domestic energy production and rebuild critical infrastructure, driving down utility costs.\n\nIn the year ahead, I look forward to working with President Trump and my colleagues to deliver for the Hudson Valley, and for all of New York.\n\nAs he says, the best is yet to come. \n\nMike Lawler represents New York’s Hudson Valley area in the US House of Representatives.","summary":"What a difference a year makes: From taming inflation to boosting wages, Trump’s first year has brought sound economic policy — and accelerating prosperity.","url":"https://nypost.com/2026/01/19/opinion/how-trumps-first-year-gains-tee-up-affordability-wins-in-year-2/","image":"https://nypost.com/wp-content/uploads/sites/2/2026/01/newspress-collage-oqv78pb94-1768858162074.jpg?quality=75&strip=all&1768840183&w=1200","video":null,"publish_date":"2026-01-19 21:30:17","author":"Mike Lawler","authors":["Mike Lawler"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.201},{"id":394323338,"title":"Ellen DeGeneres draws criticism for comments on Minneapolis protests","text":"Ellen DeGeneres weighed in on the unrest roiling Minneapolis as she remembered the Midwestern city as the \"happiest in America.\" Daily protests have been ongoing throughout January since the Department of Homeland Security ramped up immigration enforcement in the Twin Cities of Minneapolis and St. Paul by bringing in more than 2,000 federal officers. The operation has become more confrontational since the fatal shooting of Renee Good on Jan. 7. \"I just wanted to say I am so sorry for what is happening in Minneapolis and our country, really, but specifically Minneapolis right now,\" DeGeneres began in her video. \"Because it's where I shot my last stand-up special, and everybody there couldn't have been more lovely.\" \"I shot it there because they say it's the happiest city in America. And I found that to be true,\" the comedian added. \"So my thoughts and my prayers are going out to everyone. And I'm proud of everyone who's protesting peacefully, and I am sorry for anyone who has been hurt just for protesting, for doing what you should be doing.\" ELLEN DEGENERES SHOWS OFF COUNTRY LIFE IN UK AFTER FLEEING US FOLLOWING TRUMP'S 2024 PRESIDENTIAL WIN Her post drew mixed reactions, as some shared support while others criticized DeGeneres' choice to share the video. \"Love will always outweigh hate!\" a user said. \"Wow, I agree with you on this even though we differ politically! Peace through unity,\" another added. \"As a Minnesotan, thank you. It’s rough here,\" someone else said. \"Ellen has no clue what’s going on out there,\" one user wrote. \"Ellen you should ask these illegal immigrants to cooperate with ICE so no one has to protest,\" another commented. \"I am so sorry too ! Why don’t these people stay home and let ICE do the job we as a country voted for,\" another user wrote. \"You really think anyone cares what you think now? Dream on,\" another user added, seemingly referencing DeGeneres' decision to leave the U.S. after Trump's re-election in 2024. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS DeGeneres traded Hollywood glitz for the English countryside after President Donald Trump's return to the White House in November 2024. After Trump's re-election, DeGeneres and her partner, Portia de Rossi, left California for a life in the U.K. Shortly after news of the couple's big move broke, the two were spotted out with a group of friends at The Farmer's Dog in the Cotswolds, a countryside region in England. It is unclear where in the U.K. they relocated to, but they are rumored to live in the English countryside. DeGeneres and de Rossi sold their Montecito home in August 2024, Fox News Digital previously confirmed with the couple's realtor, Riskin Partners. DeGeneres had publicly supported Vice President Kamala Harris to become the next president of the United States by re-sharing Taylor Swift's social media endorsement. CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER \"The Ellen DeGeneres Show\" star has largely kept out of the spotlight after allegations of a toxic workplace led to the show's demise. Renamed \"The Ellen Show,\" the program ended after 19 seasons, with the last episode airing on May 26, 2022. DeGeneres spoke about how she now spends her time after being \"kicked out of show business\" in her comedy special, \"For Your Approval.\" \"I decided to take up gardening,\" DeGeneres said, according to The Wrap. \"I got chickens. Let me see what else I can tell you about what’s been going on. . . . Oh yeah, I got kicked out of show business. . . . Yeah, the ‘be kind’ girl wasn’t kind. That was the headline.\" \"Had I ended my show by saying, ‘Go f--- yourselves,’ people would have been pleasantly surprised to find out I’m kind,\" the comedian added. CLICK HERE TO DOWNLOAD THE FOX NEWS APP DeGeneres isn't the only celebrity to speak out against U.S. Immigration and Customs Enforcement (ICE). Bruce Springsteen called out ICE during his show Saturday. He told ICE to \"get the f--- out\" of Minneapolis and dedicated a song to Renee Good, according to reports. \"Wonder Woman\" actress Lynda Carter shared an anti-ICE cartoon featuring her iconic character. \"Wonder Woman did this in 1940 as well…,\" Carter captioned the post, which featured the comic book character pointing a finger at an ICE agent cowering in fear. Rosie O'Donnell has also joined the conversation, saying it's been \"really unbelievable\" to see ICE being \"out of control\" in the U.S. \"You know, since when do we have a militarized army conducted by the President of the United States without due process?\" she questioned in a TikTok video. \"I didn't see all of the clips, because I don't watch the news here. I just see it on TikTok or Instagram, but very disturbing, very disturbing. And the amount of deaths that have happened in ICE custody since this whole charade began.\" The Associated Press contributed to this report.","summary":"Ellen DeGeneres voices support for peaceful protesters in Minneapolis amid immigration enforcement unrest, calling it the &quot;happiest city in America&quot; from her U.K. home.","url":"https://www.foxnews.com/entertainment/ellen-degeneres-draws-criticism-comments-minneapolis-protests","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/ellen-degeneres-protests.jpg","video":null,"publish_date":"2026-01-19 21:22:18","author":"Lauryn Overhultz","authors":["Lauryn Overhultz"],"language":"en","category":"politics","source_country":"us","sentiment":0.199},{"id":394310544,"title":"Gov. Shapiro alleges in memoir that Harris' team asked if he had been Israeli agent","text":"Pennsylvania Gov. Josh Shapiro, in a forthcoming memoir, claimed that the running mate vetting team for Vice President Kamala Harris during her 2024 run for the presidency asked him if he were ever an agent of the Israeli government, ABC News has confirmed.\n\nThe New York Times first reported Shapiro's claim.\n\nShapiro writes in his memoir \"Where We Keep the Light,\" which is set to be released on Jan. 27, that he was asked last minute by Dana Remus, a former White House counsel and member of the vetting team, if he had ever been an agent for Israel. He said that told Remus he found the question offensive, according to excepts reported by The New York Times.\n\nHe wrote that he was also asked by Remus if he ever spoke with an undercover Israeli agent, to which Shapiro said he responded in part, that if they had been undercover, \"how the hell would I know?\"\n\nShapiro wrote in his memoir that he understood Remus had to do her job, but criticized the line of questioning, according to the excerpts.\n\nShapiro -- who is Jewish and has been outspoken about his religion, as well as his support of Israel and criticism of the current Israeli government -- said he was also asked more general vetting questions about Israel and his handling of campus protests about Gaza.\n\n\"I wondered whether these questions were being posed to just me — the only Jewish guy in the running — or if everyone who had not held a federal office was being grilled about Israel in the same way,\" Shapiro wrote, according to the excepts.\n\nABC News has reached out to spokespeople for Shapiro and Harris, and to Remus about the questions she allegedly asked Shapiro.\n\nWhile Shapiro was a reported contender for Harris' running-mate spot, amid major debates within the Democratic Party over the Israel-Hamas war and the U.S.-Israel relationship given Israel's conduct in Gaza, he faced scrutiny from progressives over his pro-Israel views, as well as some previous time spent volunteering in Israel, including on an Israeli army base. \n\nHe also faced questions over his college writing on the Israeli-Palestinian conflict where he expressed doubts that Palestinians could come to a peace agreement with Israel.\n\nShapiro and his spokespeople said at the time that his time volunteering did not include military activity, and that his views on the conflict had evolved to support a two-state solution to the conflict between Israelis and Palestinians.\n\nThe vetting process for running mates is known to be intensive and often tries to get ahead of questions that may be asked publicly of candidates.\n\nHarris, in her memoir \"107 Days,\" wrote that during the vetting process for running mates, she spoke with Shapiro \"about how to handle the attacks he'd confronted on Gaza and what effect it might have on the enthusiasm we were trying to build,\" and that they discussed the opinion piece Shapiro wrote in college.\n\n\"He said he felt he’d been able to deal with critics by stating clearly that his youthful opinion had been misguided and that he was fully committed to a two-state solution. He had also publicly called Netanyahu 'one of the worst leaders of all time,'\" Harris wrote.\n\nShe also framed the decision against Shapiro as more about his ambition and fears that he would be frustrated with the vice presidential role -- claims Shapiro has rebuffed. Shapiro campaigned as a Harris surrogate even after not getting the running-mate nod.\n\nSome Jewish officials who served in President Joe Biden and Harris' administration have slammed the alleged vetting question, saying that it ties into antisemitic tropes that American Jews have dual loyalties between the United States and Israel. \n\nPresident Donald Trump faced similar, separate allegations of conflating Israel and Jews during his 2024 presidential campaign.\n\nAaron Keyak, former deputy special envoy to monitor and combat antisemitism at the State Department and a board member of the Combat Antisemitism Movement, told ABC News on Monday that he was surprised at \"how blatant the rhetoric was when it comes to playing into antisemitic tropes.\"\n\n“What's even the point of asking that question in that way? Were they trying to send some sort of message to Gov. Shapiro? Were they trying to intimidate him?” Keyak said.\n\nKeyak, who is Jewish, said he had also been asked questions during the vetting process for his own Biden administration State Department role that he later heard non-Jewish appointees were not. He said he was not able to share the specifics of the questions, but that the implications of the questions were similar to what Shapiro had allegedly been asked.","summary":"Josh Shapiro, in a forthcoming memoir, claimed that the running mate vetting team for Kamala Harris asked him if he was ever an agent of the Israeli government.","url":"https://abcnews.go.com/Politics/gov-josh-shapiro-alleges-memoir-kamala-harris-team/story?id=129352759","image":"https://i.abcnewsfe.com/a/5dc51f0d-6612-4548-8d44-0d595b73d16d/josh-shapiro-gty-jef-260119_1768844315200_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2026-01-19 20:40:00","author":"Oren Oppenheim","authors":["Oren Oppenheim"],"language":"en","category":"politics","source_country":"us","sentiment":0.026},{"id":394321120,"title":"Hugh Hewitt accuses Democrats of hating Jewish people: ‘It’s astonishing’","text":"to top close Video This video is playing in picture-in-picture.\n\nAmerica Reports January 19, 2026 04:40 \n\n Hugh Hewitt accuses Democrats of hating Jewish people: ‘It’s astonishing’ \n Fox News contributor Hugh Hewitt assesses the offensive questions Pennsylvania Gov. Josh Shapiro was asked by former Vice President Kamala Harris’ vetting team on ‘America Reports.’\n Tags POLITICSSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRAMERICA REPORTSPERSONALITIESV-VIDEO","summary":"Fox News contributor Hugh Hewitt assesses the offensive questions Pennsylvania Gov. Josh Shapiro was asked by former Vice President Kamala Harris’ vetting team on ‘America Reports.’","url":"https://www.foxnews.com/video/6387954037112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2bd69b08-972c-4486-823f-51e33318b92a/e0ebe5fb-97c9-42fe-9cbf-1e7b9e604c63/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2026-01-19 20:29:43","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.624},{"id":394291324,"title":"Right-Wing Influencers Caught Flooding Social With Near-Identical Posts On Obscure Bill Hated By Tech Giant","text":"A wave of right-wing social media accounts launched near-identical attacks against a little-known Republican-backed bill aimed at restricting the export of advanced AI chips to adversaries, raising questions about whether the effort was coordinated to derail legislation publicly opposed by Nvidia.\n\nThe AI OVERWATCH Act was introduced on Dec. 18, but seemingly out of nowhere on Thursday, a group of influencers and X accounts — including Laura Loomer, Ryan Fournier, Wall Street Mav and Defiant L’s — launched a barrage of attacks against the bill, ModelRepublic first reported. The timing, language and even shared errors across the posts prompted some to question whether the messaging may have been coordinated.\n\nDespite posts characterizing the bill as an effort led by Democrats and “Never-Trumpers,” the legislation was introduced by Republican Rep. Brian Mast of Florida, who chairs the House Foreign Affairs Committee, and has no Democratic sponsors.\n\n“You and your paid minions are fighting to sell millions of advanced AI chips to Chinese military companies like Alibaba and Tencent. I’m trying to stop that from happening,” Mast wrote on X in a message directed at Nvidia CEO Jensen Huang, after the revelations came to light. (RELATED: Feds Bust Ring Smuggling Next-Gen Chips To China On Same Day Trump Opens Export Floodgates) \n\n Jensen Huang, since you’re not on X, I’ll tag your company @nvidia. You and your paid minions are fighting to sell millions of advanced AI chips to Chinese military companies like Alibaba and Tencent. I’m trying to stop that from happening. Jensen, if you ever feel like debating…— Rep. Brian Mast (@RepBrianMast) January 17, 2026 \n\nThe bill, which has the backing of multiple Republican-led committees, as well as hawkish think tanks like the Foundation for Defense of Democracies, would require notification to Congress before the administration approves exports of advanced AI chips to adversarial nations such as China, Cuba, Iran, North Korea and Russia.\n\nIt also mandates safeguards to ensure that AI chip exports do not enhance the military, intelligence, surveillance or cyber capabilities of U.S. adversaries, while fast-tracking exports to allies and partners for trusted U.S. companies that meet security and ownership standards.\n\n“The American people want American AI to boost economic growth at home, and around the world for our allies, friends, and partners, but they do not want American AI to contribute to China’s relentless military expansion and economic aggression,” Rep. John Moolenaar of Michigan, chairman of the Select Committee on the Chinese Communist Party, said in December. “This legislation takes decisive action to strike that balance and safeguard American AI dominance into the future.”\n\nDespite the bill’s stated goal of preventing advanced AI chips from bolstering U.S. adversaries, multiple posts suggested the bill is intended to help China or that it would “greenlight” the sale of advanced AI chips to China.\n\n“The AI Overwatch Act (H.R. 6875) may sound like a good idea, but when you examine it closely, it’s pro-China sabotage disguised as oversight,” Loomer wrote on Thursday. “It yanks control of advanced AI chip exports away from President Trump… and instead hands veto power to Congress. When the Democrats take back the House in 2026, Hakeem Jeffries could greenlight sales of these chips to China.”\n\nThe similarities shared by the accounts were striking as seven claimed the bill “strips Trump” of his power, four invoked Trump’s authority as “Commander in Chief,” four mentioned giving Democrats or Congress a “veto,” and two used the exact phrase “Democrats and their Deep State partners,” according to ModelRepublic. Two posts even contained the same unusual typo, referring to the “Al OVERWATCH Act” using a lowercase “L” in “AI” instead of an uppercase “I,” the outlet found, suggesting text may have been copied from the same source.\n\nWhile there is no direct evidence linking the influencers to a paid campaign, the striking similarities in framing and repeated errors suggest the posts may have originated from a shared source, according to ModelRepublic. (EXCLUSIVE: Sen. Banks ‘Very Suspicious’ Of Nvidia Opposition To Bill Restricting Chip Sales To China)\n\n“[E]very so-called MAGA influencer being paid to push this garbage should be embarrassed. You all copied NVIDIA talking points so much that you all made the same spelling error!” Mast wrote on X. “But worse, you’re siding with a woke DEI company with transgender bathrooms, and by the way, is the biggest financial supporter of Ilhan Omar. Pathetic.”\n\n Probably the same company that was donating to Kamala Harris in the 2024 election. https://t.co/ivgLiMli0i pic.twitter.com/cGebLd7rrG — Rep. Brian Mast (@RepBrianMast) January 17, 2026 \n\nThe messaging surge began the day after President Donald Trump formally approved Nvidia’s sale of its advanced H200 AI chips to China.\n\nNvidia has lobbied aggressively against additional export restrictions, arguing that tighter controls could cost the company billions and that allowing its chips to be exported around the world will help establish American AI and technology as the global standard.\n\nSome security experts decried the decision — first announced in early December — as a strategic miscalculation that risks playing into Beijing’s hand. The H200 is six times more powerful, and China is not expected to produce a comparable chip domestically until late 2027 at the earliest, according to the non-partisan Institute for Progress.\n\nHuang met with Trump in December and publicly opposed the AI OVERWATCH Act in January.\n\n“Export control has been assigned to Commerce for good reason,” Huang said in early January, according to Punchbowl News. “One source in the government to enforce laws I think is plenty.”\n\nNvidia did not respond to the Daily Caller News Foundation’s request for comment.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Paid minions'","url":"https://dailycaller.com/2026/01/19/right-wing-influencers-caught-flooding-social-with-near-identical-posts-on-obscure-bill-hated-by-tech-giant/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-2212178877-e1768847475990.jpg","video":null,"publish_date":"2026-01-19 20:15:03","author":"Melissa O'rourke","authors":["Melissa O'rourke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.074},{"id":394320344,"title":"Trump, 79, Launches Deranged Attack on American Elections","text":"President Donald Trump has attacked the U.S. electoral system in a furious tirade, reiterating one of his favorite claims that rigging is “common.” \n\nIn the early Monday rant, the 79-year-old called for voter identification as part of his crusade against Minnesota, which does not require citizens to bring documentation when exercising their democratic rights. \n\nThe article claims Republicans are investigating an alleged ploy to swamp key electoral districts with noncitizens to give Democrats an advantage. The conspiracy theory, long prevalent in more extreme MAGA circles, posits that Democrats exploit apportionment rules that do not discriminate between citizens and non-citizens to assess a Congressional district’s population. The Democrats, claim adherents of the theory, bring in illegal immigrants to make it easier to get districts drawn in their favor. Then, according to the theory, the illegal immigrants vote, exploiting the lack of voter I.D. laws. The theory does not address how the supposed illegal voters always vote against Republicans, or why they are never caught.\n\nThe convoluted and entirely unproven theory echoes Trump’s relentlessly repeated claims of election fraud during the 2020 election.\n\nTrump and his loyal stooges alleged 2020 was stolen by Joe Biden, an accusation that has been consistently debunked but which preceded the January 6 insurrection that saw MAGA fans storm the Capitol building in Washington D.C.\n\nTrump’s rant also comes against the backdrop of his race-centric vendetta against the Somali community in Minnesota and key political figures there. \n\nIn December, his xenophobic crusade saw him call the state’s sizeable Somali community “garbage” before surging an immigration crackdown, despite the majority of the 84,000 Somalians there being U.S. citizens. \n\nHe is also waging a war against Minnesota Democratic representative Ilhan Omar, which has been playing out over the course of several years, saying she should be arrested or deported despite being a U.S. citizen who arrived in the country as a child fleeing civil war. \n\nIn a Sunday night rant where he mispelled her name, Trump fumed, “There is 19 Billion Dollars in Minnesota Somalia Fraud. Fake ‘Congresswoman’ Illhan Omar, a constant complainer who hates the USA, knows everything there is to know. \n\n“She should be in jail, or even a worse punishment, sent back to Somalia, considered one of the absolutely worst countries in the World. She could help to MAKE SOMALIA GREAT AGAIN!”\n\n“ICE is removing some of the most violent criminals in the World from our Country, and bring them back home, where they belong. Why is Minnesota fighting this? Do they really want murderers and drug dealers to be ensconced in their community? The thugs that are protesting include many highly paid professional agitators and anarchists. Is this really what Minnesota wants?”\n\nThen, referring to Minnesota governor Tim Walz, he added, “The crooked Governor and ‘Congresswoman’ Omar, who married her brother, don’t mind because it keeps the focus of attention off the 18 Billion Dollar, Plus, FRAUD, that has taken place in the State! Don’t worry, we’re on it!”\n\nWalz, who ran on Kamala Harris’s unsuccessful ticket for the 2024 election, has also become a key target in Trump’s attack on the state. \n\nFollowing a viral video by conservative content creator Nick Shirley that zeroed in on allegations of fraud in daycare centers, Walz announced he would not run for re-election and would instead devote his energy to governing for the remainder of his term. \n\nA federal investigation into alleged fraud in Minnesota has been ongoing for years, with authorities reporting that over 80 people have been charged in relation to efforts to extract cash from social service programs. All the charges were brought under Joe Biden. Now, since Shirley’s video, the issue has been adopted and amplified by MAGA. \n\nDespite Trump’s deportation push, the fact that most members of the Minnesota Somali community are U.S. citizens led Minneapolis mayor Jacob Frey to tell the Guardian that deportation operations in the city had been “both scattered and even chaotic. “It’s not like there’s a factory or meat packing plant where they’re able to detain a large number of Somali immigrants,” he added. \n\nTrump’s pearl-clutching about the sanctity of democracy comes after he moaned to Republican lawmakers that he would be called a dictator if he tried to cancel the midterm elections, despite saying he didn’t think the Democratic Party was worth running against. \n\nSpeaking at the Kennedy Center in January, he said, “I won’t say cancel the election, they should cancel the election because the fake news will say ‘he wants the elections canceled. He’s a dictator.’ They always call me a dictator.”","summary":"Win McNamee / Getty ImagesPresident Donald Trump has attacked the U.S. electoral system in a furious tirade, reiterating one of his favorite claims that rigging is “common.” \n\nIn the early Monday rant, the 79-year-old called for voter identification as part of his crusade against Minnesota, which does not require citizens to bring documentation when exercising their democratic rights. \n\n“Rigged Elections are common in the U.S., with the Presidential Election of 2020 being the Granddaddy of them all. WE DEMAND VOTER I.D.” he said, sharing a link to an article titled, “In Somali fraud scandal, Republicans probe evidence of a blue state election scheme.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-79-launches-deranged-attack-on-american-elections/","image":"https://www.thedailybeast.com/resizer/v2/SW6VYW7COZDLTIWYAS7HZBIRIM.jpg?smart=true&auth=995ab9dfcd4668edb264d4589073ad26a186e5950c7ed4af8c06ee8e9f8aebd2&width=1440&height=1080","video":null,"publish_date":"2026-01-19 20:01:45","author":"Harry Thompson","authors":["Harry Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.258},{"id":394315046,"title":"Bruce Springsteen Slams Donald Trump’s ICE At Light Of Day Festival","text":"During Bruce Springsteen’s set at the Light of Day Festival in New Jersey, he made a dedication to slain protester, Renee Nicole Good.\n\nIn recent years, the Boss has spoken up against Donald Trump and his administration, and this time he made a bold political statement at the Light of Day Festival. On Saturday, January 17, Springsteen dedicated his performance of The Promised Land to the late Renee Nicole Good and her home city of Minneapolis at the music festival.\n\nBruce Springsteen slammed ICE, while urging his audience to protest and defend American values at a time where those values are at stake. Meanwhile, Donald Trump had previously attacked the rock icon on social media, but so far, the president has not responded to this incident at the music festival.\n\nBruce Springsteen: “If you stand against heavily armed masked federal troops invading an American city using Gestapo tactics against our fellow citizens. If you believe you don’t deserve to be murdered for exercizing your American right to protest, then send a message to this… pic.twitter.com/9DguCi8UJ6\n— Marco Foster (@MarcoFoster_) January 18, 2026\n\nSpringsteen said firmly that the actions of ICE have resulted in a climate where US citizens can be “murdered for exercising your American right to protest.” He then urged his fans to uphold what he believes are core American values and make their voices heard, saying:\n\nSend a message to this president. And as the mayor of that city has said, ICE should get the f*** out of Minneapolis. So this one is for you, and the memory of the mother of three and American citizen Renee Good.\n\nSpringsteen then launched into one of his most iconic songs, The Promised Land, which he introduced to his audience as “probably one of my greatest songs.” Bruce further said why he wrote the song, saying he created it “as an ode to American possibility, both to the beautiful but flawed country that we are, and to the country that we could be,” adding:\n\nNow, right now, we are living through incredibly critical times. The United States, the ideals and the values for which it stood for the past 250 years, is being tested as it has never been in modern times. Those values and those ideals have never been as endangered as they are right now.\n\nMeanwhile, the rock icon has vocally criticized the Trump administration on several occasions while touring over the summer, calling the current president “corrupt, incompetent and treasonous.”\n\nBruce Springsteen on Trump: “I couldn’t care less what he thinks about me. He’s the living personification of what the 25th Amendment and impeachment were for. If Congress had any guts, he’d be consigned to the trash heap of history.”\nRETWEET if you stand with @Springsteen! pic.twitter.com/T28sZ8LcWN\n— Protect Kamala Harris (@DisavowTrump20) January 14, 2026\n\nWhile Springsteen has been slamming Donald Trump on a regular basis over the last few years, last year, his words got to the president. In response, Trump took to his Truth Social page writing a condemnation about Springsteen and the comments he made on his music tour.\n\n“I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States. Never liked him, never liked his music, or his Radical Left Politics and, importantly, he’s not a talented guy – Just a pushy, obnoxious JERK… This dried out ‘prune’ of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country. That’s just standard fare. Then we’ll all see how it goes for him!” the US President wrote.\n\nReturning to the recent story, Trump has yet to comment about Springsteen’s words at the Light of Day Festival.","summary":"Bruce Springsteen featured at the Light of Day Festival, where he slammed ICE and made a dedication to Renee Nicole Good.","url":"https://www.inquisitr.com/bruce-springsteen-slams-donald-trumps-ice","image":"https://www.inquisitr.com/wp-content/uploads/2026/01/bruce-springsteen-1.jpg","video":null,"publish_date":"2026-01-19 19:42:33","author":"Anne Sewell","authors":["Anne Sewell"],"language":"en","category":"politics","source_country":"us","sentiment":0.055},{"id":394269486,"title":"Only one out of nearly 20 surveyed Democrats who may run in 2028 says a man cannot become a woman","text":"Only one out of nearly 20 Democrats who may run for president would say definitively that a man cannot become a woman, according to a new report. Axios questioned top Democrats who are considered possible 2028 hopefuls on trans issues, and found that \"most didn’t want to talk,\" including former Vice President Kamala Harris, New York Rep. Alexandria Ocasio-Cortez, Illinois Gov. JB Pritzker, and California Gov. Gavin Newsom. The questions were whether transgender girls who were born male should participate in girls' sports, whether transgender youths under 18 should be allowed to be placed on puberty blockers and hormones, and, \"Can a man become a woman?\" TOP DEMS SILENT AFTER TRANS ATHLETE THEY BACKED IN SCOTUS CASE IS ACCUSED OF SEXUAL HARASSMENT, INTIMIDATION Only former Chicago Mayor Rahm Emanuel would definitively answer, saying his responses were unchanged from an interview last year when he said a man can't become a woman and biological boys shouldn't play in girls' sports. Pennsylvania Gov. Josh Shapiro and former Transportation Secretary Pete Buttigieg also responded to the questions. Shapiro doubled down on his previous comments that local sports officials should be the ones in charge of determining the participation of transgender athletes in sports, but his personal view was that trans youths don't deserve an \"unfair advantage on the playing field.\" A spokesperson for Buttigieg referred Axios to an NPR interview he gave last year, where he acknowledged \"serious fairness issues\" in the trans athlete sports debate and called for compassion for transgender people. THE ATHLETES, COACHES, LAWMAKERS AND OFFICIALS WHO HAVE PICKED A SIDE IN THE SCOTUS WOMEN'S SPORTS BATTLE Newsom spoke on his podcast last week with conservative commentator Ben Shapiro on the subject, with Shapiro accusing him of dodging the question of \"whether boys can become girls.\" Newsom stumbled upon answering, saying, \"Yeah, I just don't — Well, I think, for the grace of God. Yeah.\" As Shapiro asked why it was hard to answer, Newsom said they were talking about \"so few people.\" \"We're talking about so few people that are struggling with gender identity issues. A lot of remarkable people, a lot of wildly successful people, and they've gone on in their life to have incredible lives. I don't know. There's so much hate and bigotry, so much condemnation.\" Shapiro said it wasn't an act of bigotry to declare boys cannot become girls. 'SAVE WOMEN'S SPORTS' 2025 CULTURE WAR TIMELINE — THE YEAR THE TIDES TURNED Newsom, widely considered a frontrunner if he makes an expected bid for the 2028 nomination, said during a discussion last year with Charlie Kirk that it was \"deeply unfair\" for transgender females to compete in girls' sports. CLICK HERE TO DOWNLOAD THE FOX NEWS APP","summary":"Only one of nearly 20 top Democrats who may run for president in 2028 was willing to definitively answer whether a man could become a woman.","url":"https://www.foxnews.com/media/only-one-out-nearly-20-surveyed-democrats-who-may-run-2028-says-man-cannot-become-woman","image":"https://static.foxnews.com/foxnews.com/content/uploads/2020/11/Rahm-Emanuel-REUTERS.jpg","video":null,"publish_date":"2026-01-19 19:18:54","author":"Alba Cuebas-Fantauzzi","authors":["Alba Cuebas-Fantauzzi"],"language":"en","source_country":"us","sentiment":0.103},{"id":394305282,"title":"Ed Markey calls to ‘invoke the 25th Amendment’","text":"Sen. Ed Markey (D-MA) called to remove President Donald Trump from office via the 25th Amendment due to Trump’s recent efforts to acquire Greenland. \n\nMarkey was responding to the letter Trump sent to Norwegian Prime Minister Jonas Gahr Støre. This letter included complaints that Trump’s ambitions to take over Greenland were partially because he was rejected for the Nobel Peace Prize last year.\n\nThe 25th Amendment establishes procedures for the transfer of presidential power and provides a means for the president to be removed from office if they are incapable of serving. This amendment was ratified in 1967 following the assassination of President John F. Kennedy.\n\nWhile the amendment was invoked when President Richard Nixon resigned in 1974, it has only been used temporarily four other times in history, when presidents underwent medical procedures. The most recent example was November 2021, when then-President Joe Biden transferred power to Vice President Kamala Harris for 85 minutes while he underwent a colonoscopy.\n\nUnder Section 4, the vice president and a majority of the Cabinet may notify the president pro tempore of the Senate and the speaker of the House that the president is “unable to discharge the powers and duties of the office,” in which case the vice president becomes acting president. This section of the amendment has never been used against a president. \n\nDemocrats last pushed to invoke the amendment in the wake of the Jan. 6 Capitol attack in 2021. Markey has served in the Senate since winning his first election in 2012.\n\nRepublican lawmakers were alone when they called for Harris to invoke the amendment in February 2024 after a special counsel report described the president as a “well-meaning elderly man with a poor memory.”\n\nTrump’s effort to make Greenland U.S. territory has split lawmakers. While Trump has the support of some within the GOP, Sen. Tim Kaine (D-VA) previously foreshadowed another resolution to curb Trump’s war powers, this time with Greenland. Sen. Rand Paul (R-KY) also revealed on Sunday that the acquisition effort has little Republican support.\n\n“On the war powers, or on militarily invading Greenland, I’ve heard of no Republican support for that,” Paul said on NBC News’s Meet the Press. “Even the most hawkish members of our caucus have said they won’t support that.”\n\nThe Washington Examiner has reached out to the White House for comment.","summary":"Sen. Ed Markey (D-MA) called to remove President Donald Trump from office via the 25th Amendment due to Trump’s recent efforts to acquire Greenland.&#160; Markey was responding to the letter Trump sent to Norwegian Prime Minister Jonas Gahr Støre. This letter included complaints that Trump’s ambitions to take over Greenland were partially because he was [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/4424090/ed-markey-calls-invoke-25th-amendment-trump-greenland/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/AP25154619925536.jpg?w=696","video":null,"publish_date":"2026-01-19 19:13:31","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","category":"politics","source_country":"US","sentiment":-0.128},{"id":394281610,"title":"Score! Press Secretary of Alleged Democracy Threatens News Network; Finds It’s Already Spineless","text":"Welcome back to Monday Barf Bag.\n\nIn the latest chapter of Bari Weiss running CBS News into the ground, the New York Times on Saturday revealed the details of a conversation between White House Propaganda Press Secretary Karoline Leavitt and the network’s new MAGA-thumping anchor, Tony Dokoupil.\n\n“He [Trump] said, ‘Make sure you guys don’t cut the tape, make sure the interview is out in full,’” Leavitt told Dokoupil and his colleagues on Tuesday, minutes after they finished filming a 13-minute interview with the president. They discussed Iran, grocery prices, and why Trump is suing former Fed Chair Jay Powell.\n\n“Yeah, we’re doing it, yeah,” Dokoupil replied, to which Leavitt responded, “He said, ‘If it’s not out in full, we’ll sue your ass off.’” Executive Producer Kim Harvey then replied, “Oh, great, OK!” and Dokoupil said, “He [Trump] always says that!” Nothing says we live in a healthy and functioning democracy like the president and White House press secretary openly threatening the media!\n\nNYT: Karoline Leavitt warned Tony Dokoupil and the CBS News team to air their Donald Trump interview in full, or “we’ll sue your ass off.”\n\n— Olga Nesterova (@onestpress.onestnetwork.com) January 18, 2026 at 12:33 AM\n\nThe NYT writes that some of the CBS staffers thought Leavitt was joking, but while you can hear some nervous chuckles in the recording, she remains silent. (Not to be that person… but can she laugh? Like, will her face physically let her?)\n\nAnd barring the fact that normally, it’d be incredibly alarming for an administration to be caught red-handed threatening big media, these threats feel stupidly unnecessary for CBS, which—since Weiss took over as editor-in-chief in October—has proven more than happy to become a state-sponsored news network. Last week, the outlet published a piece claiming that the ICE agent who shot and killed Renee Nicole Good suffered internal injuries, only citing two anonymous “US officials” as the source. While other networks and publications treated the administration’s propaganda with skepticism, CBS published it as breaking news. The Guardian reported that the decision drew “huge internal concern.” \n\nLeavitt, for her part, and like everyone else in MAGA, has always hated the press. During an interview with TikTok creator Kate Mackz in October, she showed off a meme hanging in her office of a man refusing a brain and saying, “No thanks, I won’t be needing that. I believe everything the legacy media shows.” Some of her latest hits include giving MAGA activist Riley Gaines a seat in the Press Briefing Room on Friday, defending Trump when he called a journalist “piggy” for asking about the Epstein files, and going off on a columnist at The Hill, and calling him a “left-wing hack” after he asked a question about Good’s death.\n\nCurrently, Trump is embroiled in lawsuits against the NYT, the Wall Street Journal, and the BBC. He infamously sued CBS’ parent company, Paramount, in 2024, over a 60 Minutes interview with Kamala Harris—they settled with him for $16 million in July.\n\nIn a statement to the NYT, Leavitt defended the threats to CBS by saying, “The American people deserve to watch President Trump’s full interviews, unedited, no cuts. And guess what? The interview ran in full.” CBS also defended its spinelessness, saying in a separate statement, “The moment we booked this interview, we made the independent decision to air it unedited and in its entirety.” Sure, Jan.\n\nNick Fuentes, Andrew Tate, and other manosphere losers carpooled to a party in Miami, Florida, over the weekend. On their aux? Kanye West’s “Heil Hitler.” [Miami Herald]\nElon Musk funneled $10 million into Kentucky’s Senate race. [Axios]\nICE is using a new AI tool. Somehow, it’s even stupider than the recruits. [NBC News]\nTrump has added Secretary of State Marco Rubio, Tony Blair, and Jared Kushner to his “Board of Peace,” whatever that means. [The Times]\nUnder Kash Patel, the FBI has “added payback to its portfolio,” and agents are asked to find negative information on Trump’s enemies. Great. [The New York Times]\nHouse Speaker Mike Johnson, worried about the slipping majority, told GOP representatives to show up unless it’s a matter of “life and death.” [NBC News]\nThe White House hasn’t shut up about whole milk all weekend. [The Hill]\nSecretary of Homeland Security Kristi Noem scolded a news anchor for revealing the name of the ICE agent who shot and killed Renee Nicole Good. The name was already public. [CBS]\nFDA Commissioner Marty Makary suggested more drugs should be “over the counter.” [AP News]","url":"https://www.jezebel.com/score-press-secretary-of-alleged-democracy-threatens-news-network-finds-its-already-spineless","image":"https://img.pastemagazine.com/wp-content/juploads/2026/01/leavittmain.jpg","video":null,"publish_date":"2026-01-19 19:06:00","author":"Danielle Han","authors":["Danielle Han"],"language":"en","category":"politics","source_country":"us","sentiment":0.002},{"id":394291302,"title":"‘Ungrateful Piece Of Sh*t’: Kara Swisher Berates Californians Fleeing New Wealth Tax","text":"Left-wing podcaster Kara Swisher said on Thursday that billionaires who departed from California to avoid a proposed wealth tax were “ungrateful” and instead should figure out how to come up with the funds to pay it.\n\nSeveral Democratic gubernatorial candidates, as well as Democratic Gov. Gavin Newsom of California, declared their opposition to a ballot measure backed by the state’s chapter of the Service Employees International Union (SEIU) that would impose a one-time 5% tax on billionaires. Swisher told Democratic Rep. Ro Khanna of California during the episode of her podcast, “On with Kara Swisher,” how she responded to an opponent of the measure. (RELATED: Charles Payne Outlines What It Will Take To Get Venezuela Back On Its Feet After Socialism Wrecked Country)\n\n“It specifically targets about a hundred people, I think it is, who are threatening to leave California, except for Jensen Hong, who’s apparently staying,” Swisher said. “I am of two minds of this. One is you made your, and I said it to one this weekend, I said, you made all your money in California, you ungrateful piece of shit, you could figure out a way to get pay more taxes and… we deserve the taxes from you given you made your wealth here.”\n\nKhanna, who told Swisher he backed a wealth tax, told her there could be constitutional hurdles to such a measure.\n\n“I think that we should have it at a federal level. There’s a constitutional challenge at the federal level. You have in the constitution that you can’t have a disproportionate burden on a particular state in terms of revenue,” Khanna said. “The 16th amendment got around that for income tax. It’s unclear what the constitutionality will be on the wealth tax. I think it’s constitutional, but I support it at a federal level and it would be easier to administer at a federal level.”\n\n“At a state level, I’d like the idea, like I said, the cleanest idea is to have loans taxed on the estate, and if we’re going to do it at a state level, doing it maybe 1% a year on public stock,” Khanna continued.\n\nDuring the 2024 presidential campaign, then-Vice President Kamala Harris supported taxing unrealized capital gains for those worth $100 million or more at a rate of 25%, similar to a proposal made by the Biden White House in a March 2024 fact sheet, according to NBC News. Khanna criticized the proposal during a September 2024 appearance on CNBC’s “Squawk Box,” saying it would crush start-ups and force their sale to private equity firms.\n\n“This is not the right way to do it and also, 95 percent of investments in startups fail, and so you’re going to disincentivize investments in those startups,” Khanna told CNBC host Joe Kernen.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'We deserve the taxes from you'","url":"https://dailycaller.com/2026/01/19/ungrateful-piece-of-sht-kara-swisher-berates-californians-fleeing-new-wealth-tax/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FDCNF-Swisher-Khanna-California-Wealth-Featured.jpg","video":null,"publish_date":"2026-01-19 18:43:20","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","source_country":"US","sentiment":-0.158},{"id":394291322,"title":"Josh Shapiro Gives Clearest Indication Yet That Kamala May Have Snubbed Him Because He’s Jewish","text":"Former Vice President Kamala Harris’ campaign asked Democratic Pennsylvania Gov. Josh Shapiro if he had ever worked with the Israeli government during his vetting process to be her 2024 running mate, the governor wrote in his upcoming book.\n\nIn his memoir, “Where We Keep the Light,” Shapiro wrote that attorney Dana Remus, a senior member of Harris’ vice presidential vetting team, asked if he had been “a double agent for Israel” and if he had “ever communicated with an undercover agent of Israel,” multiple outlets reported.\n\n“If they were undercover, I responded, how the hell would I know?” the governor wrote in his book, according to the New York Times (NYT).\n\nShapiro added that the Harris team’s questions regarding Israel left him “wondering whether these questions were being posed to just me, the only Jewish guy in the running, or if everyone who had not held a federal office was being grilled about Israel in the same way,” the Jerusalem Post reported. (RELATED: ‘Ninety-Nine Problems, And My VP Can’t Be One’: Kamala Unloads On Why She Jilted Josh Shapiro)\n\nAfter saying the question was offensive, Shapiro was told by the Harris team, “Well, we have to ask,” according to his book, the NYT reported. This line of questioning “said a lot about some of the people around the VP [Harris],” Shapiro wrote, according to the Jerusalem Post.\n\nAccording to NYT the governor wrote in his book that Harris herself asked him whether he “would be willing to apologize for the statements I had made,” concerning comments he made on pro-Palestinian protests taking place at the University of Pennsylvania.\n\n“Most of the speech on campus, even that which I disagreed with, was peaceful and constitutionally protected,” Shapiro wrote, the outlet reported. “But some wasn’t peaceful.”\n\nHarris and Shapiro did not respond to requests for comment by the Daily Caller News Foundation.\n\nThe Pennsylvania Democrat was one of the leading candidates to become Harris’ running mate before she ultimately chose Democratic Minnesota Gov. Tim Walz, who is not Jewish, in August 2024.\n\nPro-Palestinian activist groups strongly objected to Shapiro as Harris’ potential vice presidential pick due to his support for Israel and criticism of protests following the Oct. 7, 2023, attacks by Hamas. Shapiro has previously described himself as a Zionist according to the NYT, and wrote that Pennsylvania “stands with Israel against Iran” in an April 2024 post to X following Iranian strikes against Israel.\n\nShapiro also studied in Israel for five months and volunteered “in the Israeli army,” according to a 1993 essay he wrote for the University of Rochester’s Campus Times. In the essay, the governor wrote that Palestinians were “too-battle minded to be able to establish a peaceful homeland of their own,” drawing criticism during the 2024 presidential election from pro-Palestinian organizations.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'the only Jewish guy in the running'","url":"https://dailycaller.com/2026/01/19/josh-shapiro-kamala-harris-israel-book-election-vp/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-2163831817-scaled-e1768839904170.jpg","video":null,"publish_date":"2026-01-19 18:42:48","author":"Jack Cowhick","authors":["Jack Cowhick"],"language":"en","source_country":"US","sentiment":-0.314},{"id":394261010,"title":"Gov. Shapiro reveals Kamala Harris’ team asked him about Israeli ties during VP vetting","text":"to top close Video This video is playing in picture-in-picture.\n\nAmericas Newsroom January 19, 2026 04:31 \n\n Gov. Shapiro reveals Kamala Harris’ team asked him about Israeli ties during VP vetting \n Fox News host Kayleigh McEnany discusses Pennsylvania Gov. Josh Shapiro’s memoir and new details about former Vice President Kamala Harris’ 2024 presidential campaign on ‘America’s Newsroom.’\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRAMERICA'S NEWSROOMV-VIDEOGOVERNORSKAMALA HARRISMIDDLE EAST POLICIESJUDAISMDEMOCRAT ELECTIONS","summary":"Fox News host Kayleigh McEnany discusses Pennsylvania Gov. Josh Shapiro’s memoir and new details about former Vice President Kamala Harris’ 2024 presidential campaign on ‘America’s Newsroom.’","url":"https://www.foxnews.com/video/6387950137112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f849b3d0-1fd3-4a95-80b8-7aa27ee19a43/5031fd68-16cf-4d19-b201-dbd9772c662c/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2026-01-19 18:19:05","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.309},{"id":394291310,"title":"Bill Maher, Dana Carvey Torch Woke Elitists For Lecturing Everyday Americans","text":"Comedians Bill Maher and Dana Carvey criticized far-left celebrities and elitists on Monday for lecturing everyday Americans about how they should vote.\n\nMaher argued on the “Club Random Podcast” that Americans were turned off by millionaire elitists telling them to vote for former Vice President Kamala Harris during the 2024 election. Carvey added that the celebrities’ constant talks about politics hurt the Democrats since their commentary was a turnoff to the everyday American.\n\n“[Celebrities] just make it worse. They just make it worse, celebrities do, when they speak and they’re almost always on one side of the political divide,” Maher said. “And that’s basically the side that I vote for. You know, as I always say to my woke friends, we voted for the same person, you’re just why [former Vice President Kamala Harris] lost. I could gather, and I think I will because it will be funny, just the incredibly stupid things that celebrities say about politics or finance or something. So then if you’re the person out there going, ‘how could you live on $100 million a year. Vote Kamala Harris!’ It’s like, that’s game over.”\n\n“You can’t have movie stars and politicians that we know have hundreds of millions of dollars lecturing you. It’s just the elitist thing that came out of all that, you know, the Democrats. It wasn’t a positive thing, they’re not gonna do that in 2028. I’ll bet they’ll have real people,” Carvey said. (RELATED: 5 Times Bill Maher Broke With Democrats In 2025)\n\nHarris’ campaign raked in millions with the help of celebrities and spent $1 million to have a sit-down interview with Oprah Winfrey. Celebrities including Stevie Wonder, Jessica Alba, Demi Lovato and Lily Tomlin attended a fundraiser for Harris held in Los Angeles in October 2024, which helped raise millions of dollars for the campaign.\n\nThe campaign also spent roughly $100,000 to build a custom set for Harris’ interview on the “Call Her Daddy” podcast.\n\nPresident Donald Trump appeared on podcasts that largely reach young listeners, including “The Joe Rogan Experience” and Theo Von.\n\nMaher has been critical of the modern Democratic Party, particularly on their shift to the far-left. He told actor-comedian Patton Oswalt in November 2025 that Democrats have broken away from science by promoting gender ideology and argued in an April 2025 interview with the late Turning Point USA founder Charlie Kirk that they will continue to lose elections if they support biological males competing in women’s sports.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'That's game over'","url":"https://dailycaller.com/2026/01/19/bill-maher-dana-carvey-elitists-everyday-americans/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FScreenshot-2026-01-19-at-1.03.31%E2%80%AFPM-e1768845870590.png","video":null,"publish_date":"2026-01-19 18:16:06","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","category":"politics","source_country":"US","sentiment":-0.05},{"id":394226510,"title":"Gov. Shapiro, a top 2028 contender, recounts chat with Trump, beef with Harris in new book","text":"In his new memoir, Pennsylvania Gov. Josh Shapiro writes in deeply personal terms about the 2025 arson attack on his home, a conversation he had with President Donald Trump after the incident and the intense vetting he underwent when Vice President Kamala Harris was considering him as her running mate.","url":"https://www.washingtonpost.com/politics/2026/01/19/shapiro-memoir-2028-harris-trump/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GCCPPTFYBKMA62NM3XCKAKOAZE_size-normalized.jpg&w=1600&h=900","video":null,"publish_date":"2026-01-19 17:43:37","author":"Colby Itkowitz,Yasmeen Abutaleb","authors":["Colby Itkowitz","Yasmeen Abutaleb"],"language":"en","source_country":"us","sentiment":-0.32},{"id":394291306,"title":"Only One Democratic White House Hopeful Is Willing To Say The Truth About Trans People","text":"When Axios asked about the transgender athletes debate — an issue that has haunted the party for the last year — only one Democrat offered a straight answer.\n\nAxios asked 20 potential Democratic contenders for the 2028 presidential race to respond to three questions: “Should transgender girls be able to participate in girls’ sports?” “Do you believe transgender youths under age 18 should be able to be placed on puberty blockers and hormones?” And what is your response to the question: “Can a man become a woman?” Most did not respond, and of the three who did, only one was straightforward.\n\nFormer Chicago Mayor Rahm Emanuel told Axios that his position is the same as it was when Megyn Kelly interviewed him. Emanuel had told Kelly he didn’t think a man could become a woman or that men should play in women’s sports. (RELATED: Harris’ VP Pick Said It Was ‘Completely Unacceptable’ For Trump To Bar Transgender People From Military)\n\nHe also told Kelly that children under 18 are too young to decide whether they should receive sex transition procedures and treatments. The former mayor added that he didn’t think biological males should be in women’s prisons.\n\nFormer Vice President Kamala Harris, New York Rep. Alexandria Ocasio-Cortez, Illinois Gov. JB Pritzker, New Jersey Sen. Cory Booker, Kentucky Gov. Andy Beshear, Connecticut Sen. Chris Murphy, California Rep. Ro Khanna and California Gov. Gavin Newsom either declined to comment or did not respond to Axios.\n\nFormer Transportation Secretary Pete Buttigieg responded by referring Axios to his remarks on an NPR podcast, where he had commented on Emanuel’s interview with Kelly.\n\n“I think the approach starts with compassion — compassion for transgender people, compassion for families, especially young people who are going through this — and also empathy for people who are not sure what all of this means for them, like wondering, wait a minute; I got a daughter in a sports league. Is she going to be competing with boys right now?” Buttigieg said in July. “And I think when you do that, that does call into question some of the past orthodoxies in my party, for example, around sports, where I think most reasonable people would recognize that there are serious fairness issues if you just treat this as not mattering when a trans athlete wants to compete in women’s sports.”\n\nButtigieg’s spokesperson did not answer Axios’ other questions.\n\nA spokesperson for Pennsylvania Gov. Josh Shapiro also responded, referring Axios to Shapiro’s December interview with The Atlantic.\n\nWhen asked about Emanuel’s comments opposing men in women’s sports, The Atlantic notes that Shapiro rolled his eyes.\n\n“I think you gotta go meet people where they are. I’ve been very clear with that. I’ll go on anything; I’ll talk to anybody. But you also have to, like, remain true to yourself,” Shapiro told The Atlantic. “Just ’cause you go on a conservative podcast doesn’t mean that you can cosplay a conservative politician. You gotta remain true to your values.”\n\nSports officials, not politicians, should make the rules, he added.\n\n“Look, I think it’s a tough deal being born into the wrong body. And I don’t think these kids deserve to be persecuted and bullied by the president of the United States. I also don’t think they deserve an unfair advantage on the playing field,” he told the outlet when pressed on whether his personal views differed from his political ones.\n\nThe transgender issue, widely seen as an 80-20 political loser, cost Harris votes during the 2024 presidential election, multiple reports claimed. Trump spent at least $17 million on an ad highlighting her position with the tagline, “Kamala is for they/them. I am for you.” Since then, Democrats have yet to offer a firm stance on the issue.","summary":"Didn't think a man could become a woman","url":"https://dailycaller.com/2026/01/19/democrat-transgender-issue-rahm-emanuel-pete-buttigieg-josh-shapiro/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F01%2FGettyImages-2250815825-scaled-e1768839978859.jpg","video":null,"publish_date":"2026-01-19 17:35:36","author":"Reagan Reese","authors":["Reagan Reese"],"language":"en","category":"politics","source_country":"US","sentiment":-0.114},{"id":394283234,"title":"Oh My: Josh Shapiro Reveals Disturbing Question the Harris Team Asked Him During Vetting","text":"It probably would have helped Kamala Harris during her presidential campaign if she had chosen Pennsylvania Gov. Josh Shapiro as her running mate. At least it might have helped in that all-important state. I think she still would have lost, though. \n\nInstead, she picked Minnesota Gov. Tim Walz, who was a complete mess or, in his own words, a \"knucklehead.\" Walz is beset by a fraud scandal and anti-ICE chaos that he helped to create. He's now under investigation by the DOJ over that incitement. \n\nREAD MORE: Update: Walz, Frey Now Being Investigated by DOJ Over Anti-ICE Actions - MN Gov Is Not Happy\n\nWild: Anti-ICE Activists Disrupt Church Service Because They Think One of the Pastors Is an ICE Agent\n\nThere were already questions about whether Shapiro wasn't picked because he was Jewish and supported Israel, and that his pick might offend the far-left base because of their pro-Palestinian stance. Now Shapiro is dropping more information about that vetting in his new book, and it's pretty disturbing. Unbelievably, they asked him if he had ever been a \"double agent for Israel\":\n\n“Had I been a double agent for Israel?” wrote Mr. Shapiro, describing his incredulous response to a last-minute question from the vetting team. He responded that the question was offensive, he wrote, and was told, “Well, we have to ask.”“Have you ever communicated with an undercover agent of Israel?” the questioner, Dana Remus, a former White House counsel, continued, according to Mr. Shapiro, who recounted, “If they were undercover, I responded, how the hell would I know?”\n\nHe said Harris herself asked him if he would “be willing to apologize” for statements criticizing antisemitic demonstrations on college campuses. He said he responded that he defended the right to protest, but some of these actions weren't peaceful. \n\nHarris has indicated in her account of the vetting that Shapiro wanted to be in the room on all the decisions and seemed interested in the perks of the job. “Her accounts are just blatant lies,” Mr. Shapiro told The Atlantic last year. Don't hold back, Josh. \n\nREAD MORE: New Book Reveals the Backstory on Harris Picking Walz - It's As Bad As You Think\n\nHoo Boy: Josh Shapiro Has the Perfect Question for Kamala After She Disses Him in Her Book\n\nShapiro also revealed Harris didn't seem to like the office she was occupying.\n\n“She noted that her chief of staff would be giving me my directions, lamented that the Vice President didn’t have a private bathroom in their office and how difficult it was for her at times not to have a voice in decision making,” he wrote.\n\nRemus also appeared to discourage him. \n\n“She said that she knew we didn’t have a lot of money, and that [Shapiro's wife] Lori was going to have to get all new clothes and pay for people to do her hair and makeup,” he wrote, saying that while he held no grudge against Ms. Remus, the comments left him “a little slack-jawed.”\n\nNo wonder he didn't want the job. These are the folks who claim that they are the party of tolerance? Did they ask Tim Walz about his connections to China? \n\nThis indicates how completely in control of their radical left wing they are, if they go over the edge like this. \n\nBut then, too, Shapiro still endorsed her, even after this question. \n\nAll of which goes to show how lost they are as a party, and how fortunate we are that they lost. \n\nEditor’s Note: Do you enjoy RedState’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin RedState VIP and use the promo code FIGHT to receive 60% off your membership.","url":"https://redstate.com/nick-arama/2026/01/19/oh-my-josh-shapiro-reveals-disturbing-question-the-harris-team-asked-him-during-vetting-n2198284","image":"https://media.townhall.com/cdn/hodl/2024/214/56c5a166-434c-49fd-bbc0-35cfed975464.jpg","video":null,"publish_date":"2026-01-19 17:15:00","author":"Nick Arama","authors":["Nick Arama"],"language":"en","source_country":"us","sentiment":-0.387},{"id":394237892,"title":"Elon Musk pours a staggering $10M into Kentucky Senate race, backing pro-Trump business outsider","text":"EXCLUSIVE — Nate Morris says that a staggering contribution by Elon Musk in support of his Republican bid for the Senate in Kentucky \"certainly gives us the firepower and the ammo to go the distance, to be able to get out our message.\" Morris, a businessman and political outsider who's showcasing his support for President Donald Trump and the MAGA movement as he runs for the Senate, spoke first with Fox News Digital after Musk cut a $10 million check to the pro-Morris Fight for Kentucky super PAC. The contribution by Musk, the world's wealthiest person, was his largest ever in a U.S. Senate race. Morris is one of the top three contenders, along with Rep. Andy Barr and former Kentucky Attorney General and 2023 gubernatorial nominee Daniel Cameron, among a dozen Republican candidates, running to succeed retiring Sen. Mitch McConnell, the former longtime Senate GOP leader. PRO-TRUMP POLITICAL OUTSIDER JUMPS INTO 2026 RACE TO SUCCEED SEN. MITCH MCCONNELL \"Elon picks winners. Elon has been the greatest entrepreneur in the history of our world, and people are going to be talking about him for 1,000 years. And he knows success. He knows leadership, and I think this is another example of him putting his money where his mouth is.\" Morris noted that to date, he's \"financed most of the campaign myself, and also with help from small dollars from all over the country that want to stop the McConnell machine and want to send a pro-Trump outside business person to the U.S. Senate.\" ‘AMERICA FIRST’ ATTORNEY GENERAL DISTANCES HIMSELF FROM MCCONNELL — HIS FORMER BOSS — AS KENTUCKY RACE DEFINES GOP FUTURE But he emphasized that \"this investment from Elon Musk is going to give our message, our campaign, the opportunity to continue to amplify why we should be the U.S. senator here in Kentucky, and the kind of senator we're going to be.\" Asked why he thought Musk decided to support him, Morris, who had a recent conversation with the CEO of Tesla and SpaceX, said, \"I think he saw an outside business guy and someone that was willing to take on the Mitch McConnell machine, and someone that's going to tell it like it is, and has experience creating jobs, and I think also, a really tough, hard-line immigration policy.\" Musk is also close with Vice President JD Vance, who counts Morris as a personal friend. The donation, which was first reported by Axios earlier on Monday, came last week, according to sources. It's Musk's largest single donation he has spent supporting a candidate for federal office, except for Trump. Musk went all in for Trump in the 2024 election, dishing out nearly $300 million in support of Trump's bid through America PAC, a Trump-aligned super PAC. Much of the money was used for get-out-the-vote efforts and ads in the crucial battleground states as Trump and Vice President Kamala Harris faced off for the presidency. But Trump and Musk had a major falling out last year, with Musk threatening to form a third party, before patching up their relationship the past couple of months. FINAL SENATE CANDIDATE CHARLIE KIRK ENSORSED BEFORE HIS ASSASSINATION: ‘WE HAVE TO WIN’ Following a November dinner with the president at Trump's Mar-a-Lago club in Palm Beach, Florida, Musk gave major contributions to the leading GOP-aligned super PACs supporting House and Senate Republicans. Morris, who launched his Senate bid in June during an interview on Donald Trump Jr.'s podcast, held a rally kicking off his campaign with conservative leader and Turning Point USA co-founder Charlie Kirk. Morris was the final Senate candidate endorsed by Kirk prior to his assassination a couple of months later. Morris has also been endorsed by a number of other leading MAGA figures, including Sens. Bernie Moreno of Ohio and Jim Banks of Indiana, and Steve Bannon, a one-time leading Trump political strategist and host of the popular \"War Room\" podcast. Barr campaign manager Blake Gober, responding to the news of the Musk donation, said in a statement, \"The more money Nate Morris spends, the more Kentuckians get to see him and the worse he does.\" \"Nate Morris spending money made this a two-man race between Andy Barr and Daniel Cameron. Nate Morris spending more money will cement it that way,\" Gober argued. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Eight Democrats, including 2020 Senate nominee Amy McGrath, are running for their party's nomination in the Senate race in Kentucky. The primary is scheduled for May 19, and the eventual GOP nominee will likely be considered the clear favorite in November's general election. Fox News' Paige Dukeman contributed to this report.","summary":"Pro-Trump outsider Nate Morris says Musk&apos;s staggering donation gives his Kentucky Senate campaign firepower to compete against establishment Republicans.","url":"https://www.foxnews.com/politics/elon-musk-pours-staggering-10m-kentucky-senate-race-backing-pro-trump-business-outsider","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/musk.jpg","video":null,"publish_date":"2026-01-19 17:13:59","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"us","sentiment":0.238},{"id":394267028,"title":"We Knew Kamala's VP Search Was Bad. Turns Out, It Was Straight-Up Unhinged.","text":"Of all the dumb decisions Kamala Harris made in 2024, choosing Tim Walz as her running mate was probably the dumbest. \n\nI can't remember why she said she picked him — something about vibes, I think — but Walz has said that he was chosen because \"I could code talk to white guys watching football, fixing their truck, doing that, that I could put them at ease. I was the permission structure to say, 'Look, you can do this and vote for this.'\"\n\nHe later spoke about his \"masculinity\" on Gavin Newsom's podcast, stating that \"I think I scare them a little bit. No, I'm serious, because I can fix a truck. They know I'm not bulls**tting.\" \n\nSure, Timmy. If you have to declare how masculine you are, you aren't really all that masculine. \n\nTim Walz fixes trucks with those jazz hands?Not buying it. https://t.co/GA3Vg72Z2L pic.twitter.com/8iUsqvV9Af— Ryan Wilson (@RyanDWilsonMN) December 10, 2025\n\nWe also know that she really wanted Pete Buttigieg but decided he was too gay, though, ironically, he comes across as less gay than Tampon Tim. \n\nAnd now Pennsylvania Gov. Josh Shapiro is talking about his time on her short list, but, as we always suspected, he was apparently too Jewish or something along those lines. \n\nIn his upcoming memoir, Where We Keep the Light: Stories from a Life of Service, Shapiro recalls the moment when Team Kamala vetted him for the VP spot on the Democrat ticket, and honestly, it sounds like Candace Owens conducted the interview. \n\nIn a process that he called \"unnecessarily contentious,\" he said that Joe Biden’s former White House counsel Dana Remus asked, \"Have you ever been an agent of the Israeli government?\" \n\n\"Had I been a double agent for Israel? Was she kidding? I told her how offensive the question was,\" the pro-Israel governor wrote, adding, \"Remus was just doing her job. I get it. But the fact that she asked, or was told to ask that question by someone else, said a lot about some of the people around the VP.\" (I would say it says a lot about the Democrat Party in general, not just the people around the VP, but this is not my book.) \n\nHe said he was also asked whether he would \"apologize for some of his comments about protesters at the University of Pennsylvania who had built encampments to decry Israel’s military campaign in Gaza and, in some cases, intimidated Jewish students.\" \n\n\"It nagged at me that their questions weren’t really about substance,\" he wrote. \"Rather, they were questioning my ideology, my approach, my world view.\" \n\nApparently, Remus eventually told him that the vice presidency \"might be a financial burden for him and his wife,\" to which he responded, \"Are you trying to convince me not to do this?\" He also says that the statement was his final straw, and he decided he wanted nothing more to do with the situation. \n\nFor what it's worth, Harris has not spoken favorably about Shapiro in the months following the 2024 elections. In her own book, 107 Days, she claimed that he wanted to be too involved in the presidency should they win. \"I told him bluntly that was an unrealistic expectation,\" she wrote. \"A vice president is not a co-president. I had a nagging concern that he would be unable to settle for a role as number two and that it would wear on our partnership.\" \n\nUpon learning about that passage during an interview late last year, Shapiro replied, \"She wrote that in her book? That’s complete and utter bulls**t.\" He added, \"I can tell you that her accounts are just blatant lies.\" \n\nDuring the same interview, he also accused Harris of \"trying to sell books and cover her ass\" before backtracking and saying that his words were inappropriate. \n\nWant to support conservative media? You can do so by becoming a PJ Media VIP member. It's less than $20 for the entire year, and you get some cool perks too. Come join us!","url":"https://pjmedia.com/sarah-anderson/2026/01/19/we-knew-kamalas-vp-search-was-bad-turns-out-it-was-straight-up-unhinged-n4948468","image":"https://media.townhall.com/cdn/hodl/2024/220/38b20b74-df2f-43d0-97f6-969e70617c19.jpg","video":null,"publish_date":"2026-01-19 16:39:00","author":"Sarah Anderson","authors":["Sarah Anderson"],"language":"en","source_country":"us","sentiment":-0.183},{"id":394192094,"title":"Shapiro says possibly being Harris' VP pick 'just didn't feel right'","text":"In his forthcoming book, \"Where We Keep the Light,\" Pennsylvania Gov. Josh Shapiro writes that the prospect of becoming the vice president for Kamala Harris did not \"feel right,\" Politico Playbook reported. \"I knew that despite the honor of it, it just didn’t feel right for some reason,\" Shapiro noted, according to the outlet. Regarding the vetting to potentially become Harris' 2024 running mate, he wrote that \"all of the questioning felt unnecessarily contentious,\" according to the report, which also noted that he indicated that Harris' team \"didn’t understand where the people who would decide this presidential election really were.\" JOSH SHAPIRO CLAIMS KAMALA HARRIS' TEAM ASKED IF HE WAS A 'DOUBLE AGENT FOR ISRAEL \"If we had door A and door B as options, and she was for door A and I was for door B, I just wanted to make sure that I could make the case for door B, and if I didn’t convince her, then I’d run right through a brick wall to support her decision,\" he notes in the book, according to The New York Times. \"She was crystal clear that that was not what she was looking for.\" Shapiro was \"surprised\" by the extent to which Harris \"seemed to dislike the role\" she held as vice president, he indicated in the book, Politico Playbook reported. SHAPIRO KICKS OFF 2026 RE-ELECTION CAMPAIGN AS 2028 WHITE HOUSE BUZZ SWIRLS \"She noted that her chief of staff would be giving me my directions, lamented that the Vice President didn't have a private bathroom in their office and how difficult it was for her at times not to have a voice in decision making,\" Shapiro wrote, according to the Times. The outlet reported that Shapiro opted to withdraw himself from consideration, and requested to get in touch with Harris to deliver his decision, but was told that \"the VP would not handle bad news well and that I shouldn't push.\" OBAMA WINGMAN ERIC HOLDER DEFENDED WALZ'S VETTING — THEN MINNESOTA'S FRAUD SCANDAL ERUPTED CLICK HERE TO GET THE FOX NEWS APP Harris ultimately tapped Minnesota Gov. Tim Walz as her 2024 running mate, but the two were soundly defeated by the Republican ticket featuring Donald Trump and JD Vance.","summary":"A report indicates that Pennsylvania Gov. Josh Shapiro noted in his forthcoming book that the idea of becoming Kamala Harris&apos;s vice president &quot;just didn’t feel right for some reason.&quot;","url":"https://www.foxnews.com/politics/shapiro-says-possibly-being-harris-vp-pick-just-didnt-feel-right","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/kamala-harris-josh-shapiro.jpg","video":null,"publish_date":"2026-01-19 15:48:37","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","source_country":"us","sentiment":-0.51},{"id":394194788,"title":"DOJ Abandons Probe of Fatal ICE Shooting of Renee Good","text":"A lot of things happened. Here are some of the things. This is TPM’s Morning Memo.\n\nGet Your Tickets Now!\n\nWe’re hosting our first Morning Memo Live event on Jan. 29 in Washington, D.C. Find details and tickets here — and TPM members should look out for a special discount code in your inboxes. Reach out to talk@talkingpointsmemo.com if you didn’t receive or can’t find it.\n\nFeds Investigate Everyone Except ICE\n\nThe only people the Justice Department is investigating for the fatal ICE shooting of Renee Good are her widow, the governor of Minnesota, and the mayor of Minneapolis. \n\nIn a staggering admission over the weekend, Deputy Attorney General Todd Blanche, the former personal criminal defense lawyer for President Trump, confirmed that the Justice Department is no longer investigating the shooting:\n\nIt’s not clear when the federal investigation into the Jan. 7 shooting was suspended. It came sometime after Minnesota U.S. Attorney Daniel Rosen reportedly squeezed state investigators out of the federal probe, a move announced by state officials on Jan. 8. \n\nThe best evidence suggests that the suspension of the federal probe may have been the same week as the shooting, around the time that Harmeet Dhillon, the assistant attorney general for civil rights, decided the DOJ Civil Rights Division would not investigate the Good shooting. That prompted half a dozen career lawyers in that division to resign, a move that was first reported by MSNow on Jan. 12.\n\nThe FBI did conduct an “initial review” of the shooting and “determined that sufficient grounds existed to open a civil rights probe,” the WaPo reports. That was presumably before Dhillon shut it all down. \n\nInstead of probing the shooting, higher-ups at DOJ ordered an investigation into the political activities of Good’s wife, which prompted another half dozen resignations in the Minnesota U.S. Attorney’s Office last week, including several senior career officials in the office. \n\nThen on Friday, news came that the Trump DOJ had launched a criminal investigation into Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey for allegedly conspiring to impede federal immigration agents. “[A] U.S. official … said the investigation stems from statements that Walz and Frey have made about the thousands of Immigration and Customs Enforcement officers and Border Patrol agents deployed to the Minneapolis region in recent weeks. CBS News reported. For its part, the WaPo originally reported that subpoenas had already been issued to the two Minnesota elected officials, before backing away from that reporting and saying that subpoenas were only planned. \n\nNews of the federal criminal investigation into the constitutionally protected political activities of Walz and Frey came two days after Blanche accused them of “terrorism” on social media: “Walz and Frey – I’m focused on stopping YOU from your terrorism by whatever means necessary. This is not a threat. It’s a promise.”\n\nIt was clear from the outset that the Trump DOJ was already too corrupted and compromised by the erosion of its independence from the White House to credibly investigate the shooting of Good. It was obvious that cutting state investigators out was part of a larger cover-up of the shooting to avoid accountability. But the larger cover-up apparently meant trying to shut down the state investigation because it was the only investigation that was going to be conducted. The highest officials at the Justice Department have simply walked away from scrutinizing the shooting.\n\nTroops Prepped For Minnesota\n\nWith President Trump threatening to invoke the Insurrection Act in Minnesota, the Pentagon has issued prepare-to-deploy orders to 1,500 troops in two infantry battalions of the Army’s 11th Airborne Division, which is based in Alaska and specially trained for cold-weather operations. \n\nTrump did appear to pull back on Friday from an immediate Insurrection Act invocation: “I don’t think I need it right now,” he said. \n\nJudge Blocks DHS From Arresting Peaceful Protestors\n\nIn a ruling Friday, U.S. District Judge Katherine Menendez of Minneapolis barred federal agents from arresting peaceful protesters and retaliating against them with nonlethal munitions and crowd control tools them. While the judge basically ordered DHS to follow existing law, she catalogued in great detail from the case record some of the DHS abuses recorded in Minnesota.\n\nMeanwhile, DHS admitted in a social media post that speaking Spanish and having a Mexican accent is a sufficient basis for federal agents to demand proof of U.S. citizenship. \n\nQuote of the Day\n\n“One ICE agent said if we let you see your clients, we would have to let all the attorneys see their clients, and imagine the chaos. And I said to that person, yeah, you do have to let all the attorneys see their clients. You do have to accommodate that. That’s the Constitution. You chose to put them here. I didn’t bring this guy here, you did.”—an unnamed attorney in an ABC News report on DHS denying legal counsel to ICE detainees in Minnesota\n\n60 Minutes Finally Airs CECOT Segment\n\nThe core of the original 60 Minutes segment on the Alien Enemies Act detainees unlawfully shipped off to CECOT remained when it was finally broadcast last evening, but the report was lengthened and padded on either side with softening additions after CBS News editor-in-chief Bari Weiss held up the piece for nearly a month beyond its advertised air date. \n\nOne irony of this mess: Weiss had insisted on adding to the segment an on-camera interview with a Trump official even though the administration initially refused to participate, so Weiss reportedly took it upon herself to arrange such an interview, but failed.\n\nIn related news, after President Trump completed a 13-minute taped interview Tuesday with CBS Evening News anchor Tony Dokoupil, he conveyed a threat through his press secretary about what would happen if the interview wasn’t run in it entirety without any edits: “If it’s not out in full, we’ll sue your ass off.”\n\nSome witnesses took it as a joking reference to CBS’ absurd $16 million settlement last year with Trump for running an edited video of Kamala Harris during the 2024 campaign. However the remark may have been intended, the Trump interview did run in full, which CBS said was its plan all along. \n\nNEWSFLASH: Greenland is NATO\n\nThe absurdity of President Trump’s Greenland threats should not obscure that he is mounting a direct U.S. attack on the NATO alliance, an outcome that would positively thrill Russia’s Vladimir Putin. The current eruption of U.S. expansionism comes after years of Trump threats to withdraw from NATO and his numerous overt efforts, rhetorically and otherwise, to weaken, undermine, and disdain the trans-Atlantic alliance that has been a stalwart of the post-World War II geo-strategic configuration of which the United States has been the primary beneficiary.\n\nAmong the latest developments:\n\nTrump bluntly threatened new tariffs over Greenland unless the U.S. could buy the territory, and the Europeans weighed whether to negotiate or retaliate. \n\nIn a letter to Prime Minister Jonas Gahr Store of Norway — that was forwarded to European ambassadors in Washington – President Trump connected his threats against Greenland (which is Danish) on Norway’s failure to award him the Nobel Peace Prize (which is not awarded by the Norwiegan government).\n\nThe threat the United States poses to Denmark prompted a small European military exercise in Greenland as a show of support. \n\nWhat the Europeans Are Saying …\n\n“When I took my post as secretary general of the Council of Europe just over a year ago, I did not think that I would ever have to write about the possibility of the United States taking military action against a member state. Yet here we are.”—Alain Berset \n\n“There is extreme consternation that your president appears completely immune to data, facts, arguments and common knowledge. He continues to state what is obviously, factually wrong. This seems unbelievable to many people in this country. We cannot understand what is happening. We wonder what is next.”—Danish journalist and Arctic expert Martin Breum\n\nU.S. Poised To Resume Unlawful Boat Attacks\n\nThe FAA issued seven alerts Friday warning civilian aviation of the potential for increased military activity in the Eastern Pacific off Latin America. \n\nThe Corruption: Pardon Edition\n\nPresident Trump granted clemency for the second time to a convicted fraudster who re-frauded after he released her from prison at the end of his first term. Adriana Camberos was convicted for a new and different fraud in 2024, but Trump pardoned her again last week, freeing her from prison, where she was serving 12 months on the new conviction plus additional months for violating probation on her earlier conviction, the NYT reports. \n\n2026 Ephemera\n\nIn a rare move against an incumbent senator of the same party, President Trump publicly endorsed Rep. Julia Letlow (R-LA) to challenge Sen. Bill Cassidy (R-LA). Letlow, who has yet to formally declare her candidacy, has served in the House since a 2021 special election called after her husband was elected to the seat but died of COVID before he was sworn into office. \n\nThe Promised Land\n\nIn a surprise performance Saturday in New Jersey, Bruce Springsteen dedicated his anthem “The Promised Land” to Renee Good as he implored ICE to “get the fuck out of Minneapolis”:\n\nHot tips? Juicy scuttlebutt? Keen insights? Let me know. For sensitive information, use the encrypted methods here.","summary":"Get Your Tickets Now! We&#8217;re hosting our first Morning Memo Live event on Jan. 29 in Washington, D.C. Find details...","url":"https://talkingpointsmemo.com/morning-memo/doj-abandons-probe-of-fatal-ice-shooting-of-renee-good","image":"https://talkingpointsmemo.com/wp-content/uploads/2026/01/GettyImages-2255109761.jpg?w=2048","video":null,"publish_date":"2026-01-19 15:41:30","author":"David Kurtz","authors":["David Kurtz"],"language":"en","source_country":"US","sentiment":-0.426},{"id":394290750,"title":"Ah, So That's Why Kamala Harris Didn't Choose Josh Shapiro As Her Running Mate","text":"Pennsylvania Gov. Josh Shapiro spilled some interesting tea on former Vice President Kamala Harris’ 2024 presidential campaign’s vetting process. In a new book, he said the campaign asked whether he was a “double agent” working for Israel while he was being vetted as Harris’ potential running mate.\n\nShapiro was one of several contenders for the position, which ultimately went to Minnesota Gov. Tim Walz.\n\nFrom The New York Times:\n\nGov. Josh Shapiro of Pennsylvania, a prominent Democrat who was a top contender to serve as former Vice President Kamala Harris’s running mate in 2024, offered his most detailed accounting to date of the vice-presidential search process in his new memoir, which was obtained by The New York Times.In short: He suggests that it was far uglier than is commonly known.In Mr. Shapiro’s book, “Where We Keep the Light,” the governor is measured in describing his interactions with Ms. Harris herself. But Mr. Shapiro, who is Jewish, details a contentious vetting process in which Ms. Harris’s team focused intensely on his views on Israel — so much so that at one point, he wrote, he was asked if he had ever been an agent of the Israeli government.“Had I been a double agent for Israel?” wrote Mr. Shapiro, describing his incredulous response to a last-minute question from the vetting team. He responded that the question was offensive, he wrote, and was told, “Well, we have to ask.”“Have you ever communicated with an undercover agent of Israel?” the questioner, Dana Remus, a former White House counsel, continued, according to Mr. Shapiro, who recounted, “If they were undercover, I responded, how the hell would I know?”Mr. Shapiro wrote that he understood that Ms. Remus was “just doing her job.” But the fact that he was asked such questions, he wrote, “said a lot about some of the people around the VP.”\n\nShapiro, who is Jewish, became one of several Democratic politicians who spoke out against the wave of antisemitism that arose after Hamas attacked Israel on October 7, 2023, killing over one thousand people.\n\nThe governor said that Harris asked if he “would be willing to apologize for the statements I had made, particularly over what I saw happening at the University of Pennsylvania,” he wrote, according to The New York Times.\n\nShapiro refused to apologize, saying that while he supports constitutionally protected free speech, he noted that many pro-Hamas agitators were not peaceful. He said he “wondered whether these questions were being posed to just me — the only Jewish guy in the running — or if everyone who had not held a federal office was being grilled about Israel in the same way.”\n\nAnd this, ladies and gentlemen, shows exactly how a Harris administration would have responded to the widespread vitriol against Jewish people that permeated college campuses for more than a year. While many of the demonstrations were peaceful, there were plenty of incidents in which members of the pro-Hamas crowd targeted Jewish students with threats and violence.\n\nThere was absolutely nothing Shapiro said that he should apologize for. Apparently, Harris did not want anyone in her administration who would speak out against anti-Jewish bigotry, which tells us exactly what we need to know about where Harris and her comrades stand on the issue.\n\nEditor’s Note: Do you enjoy Townhall’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin Townhall VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://townhall.com/tipsheet/jeff-charles/2026/01/19/kamala-harris-campaign-questioned-whether-josh-shapiro-was-a-double-agent-for-israel-n2669698","image":"https://media.townhall.com/cdn/hodl/2024/214/ecde0dbb-2727-457a-a973-2348f8c13dac.jpg","video":null,"publish_date":"2026-01-19 15:15:00","author":"Jeff Charles","authors":["Jeff Charles"],"language":"en","source_country":"us","sentiment":-0.261},{"id":394256218,"title":"Republican pollster corrects misconception about independent voters","text":"For independents, lack of party loyalty can be a badge of honor. Independents often say that they are focused on issues, not whether one is a Republican or a Democrat. And in a close election, they can make or break a campaign.\n\nBut conservative GOP pollster Kristen Soltis Anderson, in an op-ed published by the New York Times on January 19, emphasizes that lack of party affiliation doesn't necessarily mean that one is centrist or moderate.\n\n\"In 2004, the percentage of Americans identifying as political independents hit the lowest point since Gallup began regularly tracking party identification in 1988,\" Anderson explains. \"That year, only 31 percent said they were independent, while Republicans and Democrats were evenly matched among those choosing a party. That percentage has risen from that record low in 2004 to a record high today — a whopping 45 percent, according to Gallup.\"\n\nAccording to Anderson, it is \"important to first remember what the word independent is not.\"\n\n\"These days, it does not necessarily signify moderation or centrism,\" Anderson notes. \"Less than half of independents today consider themselves moderate in the Gallup data, with 27 percent identifying as conservative or very conservative and 24 percent identifying as liberal or very liberal. Plenty of people who are independent declare themselves as such because they find both parties ideologically unsatisfactory, not because they feel they fit somewhere in the middle.\"\n\nThe GOP pollster points out that according to the Pew Research Center, many of the independents who voted in the 2024 presidential election \"acknowledged they generally leaned more toward one party or another.\" And that included both Donald Trump voters and Kamala Harris voters.\n\n\"Of those who said they leaned more toward the GOP,\" Anderson observes, \"87 percent voted for Mr. Trump, while 91 percent of Democratic-leaning independents voted for Ms. Harris. Each voter may initially tell a pollster like me that they are an independent, but in truth, they behave much more like their Republican and Democratic brethren when they get to the ballot box.\"\n\nAnderson adds, \"In my own surveys, most voters who identify as independents do go on, when pressed, to say they lean more toward one party than the other. Ultimately, I find only that only 9 percent of voters firmly insist they do not pick one side more often than the other.\"\n\nKristen Soltis Anderson's full op-ed for the New York Times is available at this link (subscription required).","summary":"For independents, lack of party loyalty can be a badge of honor. Independents often say that they are focused on issues, not whether one is a Republican or a Democrat. And in a close election, they can make or break a campaign.\n\nBut conservative GOP pollster Kristen Soltis Anderson, in an op-ed published by the New York Times on January 19, emphasizes that lack of party affiliation doesn't necessarily mean that one is centrist or moderate.\n\n\"In 2004, the percentage of Americans identifying as political independents hit the lowest point since Gallup began regularly tracking party identification in 1988,\" Anderson explains. \"That year, only 31 percent said they were independent, while Republicans and Democrats were evenly matched among those choosing a party. That percentage has risen from that record low in 2004 to a record high today — a whopping 45 percent, according to Gallup.\"\n\nAccording to Anderson, it is \"important to first remember what the word independent is not.\"\n\n\"These days, it does not necessarily","url":"https://www.alternet.org/independent-voters-trump/","image":"https://www.alternet.org/media-library/image.jpg?id=62832702&width=1200&height=600&coordinates=0%2C167%2C0%2C167","video":null,"publish_date":"2026-01-19 15:05:19","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.401},{"id":394167744,"title":"Josh Shapiro Alleges Harris' Team Fixated on His Jewish Identity During VP Vetting","text":"Pennsylvania Democratic Governor Josh Shapiro revealed in his new memoir, \"Where We Keep the Light,\" which is set to be released later this month, that during his 2024 vetting as a potential vice presidential nominee for Kamala Harris, he was asked whether he was an Israeli agent. The disclosure has fueled further evidence and renewed speculation that Shapiro, widely viewed as a stronger electoral choice than Minnesota Governor Tim Walz, was ultimately passed over because he is Jewish.\n\nJosh Shapiro Writes That Harris Team Asked if He Had Ever Been an Israeli AgentIn his new memoir, the Pennsylvania governor suggests that when Kamala Harris's team vetted him to be her running mate, aides focused on Israel to an extent he found offensive.Full Story:… pic.twitter.com/mnc070LdXu— Yashar Ali 🐘 (@yashar) January 19, 2026\n\n“Have you ever been an agent of the Israeli government?”The question came from President Biden’s former White House counsel Dana Remus, who was a key member of Harris’s vice-presidential search team.Governor Josh Shapiro, one of the most well-known Jewish elected officials in… pic.twitter.com/zs60CSimfw— Rabbi Poupko (@RabbiPoupko) January 19, 2026\n\nGov. Shapiro said that throughout the vetting process, Harris’ team fixated on his views on Israel. At one point, a member of the former vice president’s team even asked whether Shapiro had ever been a double agent for Israel.\n\n“Had I been a double agent for Israel?” Gov. Shapiro wrote, recalling his incredulous reaction. He said he told the team the question was offensive, only to be met with a blunt response: “Well, we have to ask.”\n\n“Have you ever communicated with an undercover agent of Israel?” the questioner, Dana Remus, who was once a White House counsel, continued. \n\n“If they were undercover, I responded, how the hell would I know?” Shapiro replied.\n\nThe Pennsylvania governor wrote that he knew Remus was “just doing her job.” But he indicated that the types of questions relating to his Jewish identity and his support for Israel, “said a lot about some of the people around the VP.”\n\n“I believe in free speech, and I’ll defend it with all I’ve got,” he wrote. “Most of the speech on campus, even that which I disagreed with, was peaceful and constitutionally protected. But some wasn’t peaceful.”\n\nShapiro pointed directly to the demonstrations that swept the United States in the aftermath of October 7, 2023, when Hamas carried out the deadliest attack on the Jewish people since the Holocaust. In the weeks that followed, protests and encampments erupted across American universities, not to condemn Hamas, but to denounce Israel for fighting back, accusing the Jewish state of committing “genocide,” and of confining Gazans to what protesters described as an open-air prison.\n\n\"I wondered whether these questions were being posed to just me — the only Jewish guy in the running — or if everyone who had not held a federal office was being grilled about Israel in the same way,\" Shapiro continued.\n\nThe revelation comes shortly after the release of Kamala Harris’ memoir, \"107 Days,\" which recounts her short-lived and ultimately unsuccessful presidential campaign. In the book, Harris argues that Shapiro was not a strong choice for vice president, contending that he harbored political ambitions of his own and that her team frequently had to remind him he would be second in command. Harris ultimately selected Walz, writing that he lacked those ambitions and was easier to manage. She also claimed Walz would help her appeal to white male voters, a theory that ultimately proved unsuccessful.\n\nEditor’s Note: Do you enjoy Townhall’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin Townhall VIP and use promo code FIGHT to receive 60% off your membership.","url":"https://townhall.com/tipsheet/dmitri-bolt/2026/01/19/josh-shapiro-kamala-harris-n2669681","image":"https://media.townhall.com/cdn/hodl/2024/234/83c4b1d9-0b47-4302-9729-4fdc301ad3de.jpg","video":null,"publish_date":"2026-01-19 15:00:00","author":"Dmitri Bolt","authors":["Dmitri Bolt"],"language":"en","source_country":"us","sentiment":-0.022},{"id":394178134,"title":"Jewish Pennsylvania governor claims Harris campaign team asked if he was ‘Israeli double agent’","text":"Kamala Harris' team asked Pennsylvania Governor Josh Shapiro whether he had ever been an \"agent\" of Israel during the vetting process for her potential running mate ahead of the 2024 election, according to an advance copy of his memoir obtained by The New York Times on Sunday. In Where We Keep the Light, Shapiro, who is Jewish and whose official residence in Harrisburg was targeted in an antisemitic arson attack last year, claimed Harris' team focused heavily on his views on Israel during the selection process. \"Had I been a double agent for Israel?\" Shapiro wrote, per the Times, describing an eleventh-hour question from the vice president's team. Shapiro was said to have responded that the question was offensive, but was apparently met with the response: \"Well, we have to ask.\" He wrote that, while he understood that the aide was \"just doing her job,\" the fact that he, \"the only Jewish guy” in the running, was asked such questions \"said a lot\" about some on Harris' team. \"These sessions were completely professional and businesslike,\" the governor wrote. \"But I just had a knot in my stomach through all of it.\" A representative for Harris did not immediately respond to a request for comment, the Times said. Shapiro's book is due to be published on January 27. Shapiro was ultimately passed over for Harris’ running mate, with the former vice president picking Minnesota Governor Tim Walz, who praised anti-Israel protesters for \"speaking out for all the right reasons\" and called for a Palestinian state. But, in her 2025 memoir, 107 Days, Harris referred to Shapiro facing attacks tied to Israel's actions in the Gaza Strip. She said he vocalised criticism of Israeli Prime Minister Benjamin Netanyahu, while also expressing concerns that he would not be satisfied as the number two on the ticket. Aaron Keyak, a former deputy special envoy to monitor and combat antisemitism in the State Department in Joe Biden's administration, told JNS on Sunday that Shapiro had faced an \"antisemitic inquiry.\" \"The minimum demand of Jews in the United States and our allies – even those in public service – is to simply be treated like any other American, regardless of religion, ethnicity or race,\" said Keyak. \"While we can safely assume that asking all potential vice presidential picks if they are an Israeli double agent is not included on the standard list, the obvious question is why it was Governor Shapiro who was targeted by the staff of the presumptive Democratic presidential nominee, Kamala Harris, in particular,\" the ex-envoy told JNS. \"Unfortunately, this is not the first time the US government or a presidential campaign has applied a double standard to American Jews during the vetting process for a wide range of officials,\" he stated. Keyak concluded by stating that \"antisemitic questions are anti-American and do not represent the best that the Democratic Party offers. Now, and especially during the next presidential campaign, we must demand better\".","summary":"‘I just had a knot in my stomach through all of it’, wrote Josh Shapiro in his upcoming memoir","url":"https://www.thejc.com/news/usa/jewish-pennsylvania-governor-claims-harris-campaign-team-asked-if-he-was-israeli-double-agent-btzi7l0o","image":"https://api.thejc.atexcloud.io/image-service/view/acePublic/alias/contentid/1om7qd8qmk1ciasso4y/0/gettyimages-2224585269-jpg.webp","video":null,"publish_date":"2026-01-19 14:46:16","author":"Jc Reporter,Jewish News Syndicate","authors":["Jc Reporter","Jewish News Syndicate"],"language":"en","category":"politics","source_country":"gb","sentiment":0.013},{"id":394267862,"title":"Josh Shapiro says Kamala Harris campaign asked if he had 'been a double agent for Israel' during VP vetting","text":"Officials in former Vice President Kamala Harris' 2024 presidential campaign asked Pennsylvania Governor Josh Shapiro whether he had ever been an agent of Israel during his vetting for vice president, the Jewish Democrat writes in a new book obtained by The New York Times.","summary":"Shapiro, the pro-Israel governor of Pennsylvania and runner-up to be Harris' running mate, wrote in an upcoming memoir that he 'wondered whether these questions were being posed to just me – the only Jewish guy in the running – or if everyone was being grilled about Israel'","url":"https://www.haaretz.com/us-news/2026-01-19/ty-article/.premium/josh-shapiro-says-harris-team-asked-if-he-was-double-agent-for-israel-during-vp-vetting/0000019b-d614-d2f8-af9b-f7d7bedd0000","image":"https://img.haarets.co.il/bs/0000019b-d62d-dd98-a7df-fe7f16a40001/ff/79/bae5b34d4e828f370d721749a6cf/276178.jpg?precrop=1603,1603,x303,y0","video":null,"publish_date":"2026-01-19 14:40:50","author":"Ben Kroll","authors":["Ben Kroll"],"language":"en","category":"politics","source_country":"il","sentiment":0.539},{"id":394200816,"title":"Josh Shapiro: Team Kamala Asked If I Was an Israeli Double Agent; UPDATE: Biden Advisor Erupts","text":"\"Well, we have to ask,\" Josh Shapiro recalls being told. No, you really didn't.\n\nOne of the greatest mysteries of the most disastrous 107 days in the Democrat Party gets a little more clarity in a new book from the Pennsylvania governor. Choosing Shapiro as a running mate should have been a slam-dunk decision for Kamala Harris. Democrats needed to hold the Keystone State, and Shapiro was and is a popular leader in his state. Shapiro could have appealed to other swing-state voters in Michigan and Wisconsin, at least, and would have lent his considerable political talent to an anointee who notably lacked them. Instead, Harris chose Tim Walz, who turned out to be even more inept than the anointee herself.\n\nIn his new book, the New York Times reports, it becomes clear that Shapiro made that choice rather than Harris. Shapiro also ensures that the reason for his choice is that the Democrats have allowed anti-Semitism to rise to the top ranks of its leadership:\n\nIn Mr. Shapiro’s book, “Where We Keep the Light,” the governor is measured in describing his interactions with Ms. Harris herself. But Mr. Shapiro, who is Jewish, details a contentious vetting process in which Ms. Harris’s team focused intensely on his views on Israel — so much so that at one point, he wrote, he was asked if he had ever been an agent of the Israeli government.“Had I been a double agent for Israel?” wrote Mr. Shapiro, describing his incredulous response to a last-minute question from the vetting team. He responded that the question was offensive, he wrote, and was told, “Well, we have to ask.”“Have you ever communicated with an undercover agent of Israel?” the questioner, Dana Remus, a former White House counsel, continued, according to Mr. Shapiro, who recounted, “If they were undercover, I responded, how the hell would I know?”Mr. Shapiro wrote that he understood that Ms. Remus was “just doing her job.” But the fact that he was asked such questions, he wrote, “said a lot about some of the people around the VP.”\n\nIt certainly says something about Dana Remus. It also speaks volumes about former Attorney General Eric Holder, who ran the search committee to vet potential running mates for Kamala Harris. And that in turn speaks volumes about Holder's former boss Barack Obama, who kept trying to cut deals with Iran and repeatedly involved Rob Malley in those efforts, who had to quit Obama's initial campaign when his contacts with Hamas got exposed in early 2008. \n\nIt also has something to say about the progressives that control the Democrat Party of today. This query relies on an old and bigoted trope about Jews being inherently disloyal to their own countries, a claim that long predates the establishment of the state of Israel. In Germany, political leaders blamed Jews for the collapse in World War I that led to their defeat, using the same ugly claim, which got amplified and then industrialized by the Nazis. No one asks that question about being an Israeli double-agent out of the blue without having bought into that anti-Semitic mindset. \n\nShapiro lets Remus off the hook for \"just doing her job,\" which may be too gracious by half. Shapiro doesn't need to target Remus; he's telling the story to expose Harris, Holder, and the rest of the anti-Semitic, radical progressive Left. That's understandable in terms of judicious target selection, and also to make sure readers don't miss the Kamala/progressive forest for the Remus trees, so to speak. But it's the Remuses that perform this kind of sanctioned bigotry for the Kamalas and the Holders, and she could have just as easily declined to ask this question and found work elsewhere. \n\nThe fact that she didn't makes it pretty clear that she was comfortable with this line of inquiry, in which she impugned the loyalty of Pennsylvania's governor for no other reason and on no other evidence than that he is a Jew. That speaks to the comfort level of this anti-Semitism all the way up the food chain in the Democrat Party. One has to wonder whether Remus and others of her ilk could find work within the Democrat Party without first being comfortable with assuming all Jews may be disloyal double agents ... while embracing the \"free Palestine\" activists that regurgitate Hamas' Islamist propaganda on college campuses and in the streets, \n\nShapiro strips the mask off the Left with this revealing episode in the saga of Kamala Of The 107 Days. Let's see whether the Protection Racket Media connects those dots, or simply refuses to acknowledge them. Kudos to the NYT for at least making it public. \n\nUpdate: Joe Biden's White House advisor on anti-Semitism didn't mince words:\n\nAaron Keyak, the Biden WH deputy antisemitism envoy, out with a new statement on Kamala Harris 2024 vetting process: \"That Governor Josh Shapiro wrote that he was asked if he was a double agent of the world’s only Jewish state is an antisemitic inquiry.\"Strong words.— Josh Kraushaar (@JoshKraushaar) January 19, 2026\n\nNeither did the Jerusalem Post:\n\nNot: Have you ever lobbied for a foreign government? Not: Do you have undisclosed financial interests? Those are normal vetting questions.This was different. This was: Are you secretly working for the Jewish state?Shapiro writes about this moment in his new memoir, and the sentence lands like a tracer round. Because every Jew in America, whether they’ve been near a VP vetting room or not, recognizes the temperature of that moment. ...Here’s what the question really says:You can be Jewish, but only the right kind of Jewish. The private kind. The kind that doesn’t connect to anything outside yourself. You can have a religion. You can have a grandmother who makes brisket. You can even have opinions about Israeli policy.But the moment your Jewishness links to a people, a history, a homeland, the moment it becomes something more than a personal quirk, we need to know: Are you loyal to us, or to them?\n\nThat's a question that speaks far more to the questioner than the questioned. The Left treats Christians in a similar manner, but not to the point of disloyalty to foreign governments. They reserve that treatment for the Jews, and this episode proves that comes from the highest levels of the progressive elite. \n\nEditor’s Note: Every single day, here at Hot Air, we will stand up and FIGHT, FIGHT, FIGHT against the radical left and deliver the conservative reporting our readers deserve. \n\nHelp us continue to expose the radical nature of progressive elites. Join Hot Air VIP and use promo code FIGHT to get 60% off your membership!","url":"https://hotair.com/ed-morrissey/2026/01/19/josh-shapiro-team-kamala-asked-if-i-was-an-israeli-agent-n3810992","image":"https://media.townhall.com/cdn/hodl/2024/214/ecde0dbb-2727-457a-a973-2348f8c13dac.jpg","video":null,"publish_date":"2026-01-19 14:20:19","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129},{"id":394118822,"title":"Caleb Williams being \"Pro-Kamala\" is why Bears lost in playoffs, claims right-wing commentator","text":"Caleb Williams and the Chicago Bears suffered a 20-17 loss in overtime to the LA Rams in the divisional round of the playoffs on Sunday. Williams' final pass of the game was an interception to Rams safety Kam Curl in overtime, giving LA an opening to get the win.After the Bears' playoff exit, right-wing commentator Nick Adams appeared to aim a dig at Williams for being a Kamala Harris supporter, while suggesting that the four other quarterbacks remaining in the playoffs support US President Donald Trump.\"Matthew Stafford: Pro-Trump. Sam Darnold: Pro-Trump. Drake Maye: Pro-Trump. Bo Nix: Pro-Trump. Caleb Williams: Pro-Kamala. This is not a coincidence,\" Adams tweeted on Sunday.Nick Adams @NickAdamsinUSALINKMatthew Stafford: Pro-Trump Sam Darnold: Pro-Trump Drake Maye: Pro-Trump Bo Nix: Pro-Trump Caleb Williams: Pro-Kamala This is not a coincidence.Williams had a mixed game against the Rams. He went 23 of 42 for 257 yards with two touchdowns and three interceptions while adding 40 yards on five carries.After the game, Williams explained that he had a breakdown in communication with wideout DJ Moore in overtime, which caused an interception.“I’ve got to go back and watch it, obviously haven’t seen it. ... Had D.J. going over the top over all of it,\" Williams said, \"Just a miscommunication between him and I. Tried to flatten him off under the safety and he kept it vertical, from what I saw in the moment.”The loss to the Rams will sting Williams and the Bears, who were tipped to make a deep run in the playoffs.ALSO READ: \"Brock Purdy is huge Trump supporter. Jalen Hurts was big Kamala supporter\": Right-wing commentator claims political allegiance helped 49ers' winCaleb Williams led the Chicago Bears to the NFC North crown this seasonNFL: Chicago Bears QB Caleb Williams - Source: GettyCaleb Williams led the Chicago Bears to the NFC North title this season. In doing so, the Bears won the divisional crown for the first time since the 2018 season.The Bears took Williams with the top pick in the 2024 NFL draft. The QB led Chicago to a 5-12 record in his rookie season.This season, the Bears were much-improved. They beat the Green Bay Packers in the wild-card round, but fell to the Rams in the divisional round.","summary":"Caleb Williams and the Chicago Bears suffered a 20-17 loss in overtime to the LA Rams in the divisional round of the playoffs on Sunday.","url":"https://www.sportskeeda.com/nfl/news-caleb-williams-pro-kamala-bears-lost-playoffs-claims-right-wing-commentator","image":"https://staticg.sportskeeda.com/editor/2026/01/36083-17688291415508-1920.jpg","video":null,"publish_date":"2026-01-19 14:18:37","author":"Arnold","authors":["Arnold"],"language":"en","source_country":"in","sentiment":-0.302},{"id":394224074,"title":"‘What are Democrats doing?’: Political strategists break down where the resistance to Trump went wrong","text":"A year ago, President Donald Trump kicked off his nonconsecutive second term in office and the Republican Party took control of both chambers of Congress.\n\nTo say Democrats suffered an epic defeat in November 2024 would be an understatement. But even allowing for a couple of months of wound licking, more than a year later, polls show Democratic lawmakers are now more unpopular than ever.\n\nFor the better part of this past year, strategists and pundits have been saying the opposition party needs to change its approach. But experts say it hasn’t, and now the call to action is taking on a tone of both urgency and panic.\n\nSusan Del Percio, a Republican political strategist who has never endorsed Trump, says Democratic lawmakers are “fractured” and need to start presenting a vision of what they’ll do for voters.\n\n“At the end of the day, people are still trying to figure out ... what are Democrats really doing?” Del Percio told The Independent. \n\n“How are you helping? What are you proposing? Give me something,” she added.\n\nHere’s why political strategists say the resistance to Trump struggled last year — and what the party needs to change in 2026:\n\nSupport for Democratic lawmakers is falling — and some surveys even indicate their approval rating is at a record low.\n\nA December Gallup poll showed congressional Democrats have just a 24 percent job approval rating, which is ”lower than any prior Gallup measurement.” Quinnipiac University’s December poll revealed an 18 percent approval rating for congressional Democrats, which is a “record low,” the organization said.\n\nDemocratic political strategist Christy Setzer told The Independent that the public is unhappy with lawmakers because they are “not going far enough,” and that Democrats may be “demoralized by the lack of action.”\n\n“You know, I would imagine there's going to be a fight next week about whether or not to give ICE even more money, and Democrats will probably be split on that,” Setzer said. \n\n“It blows the minds of regular people who think that there's no way that Chuck Schumer and Hakeem Jeffries could possibly understand America right now, if those are the decisions they're making,” she added.\n\nSchumer has been criticized for his leadership over the last year, even by his fellow Democrats.\n\nIn April, Schumer told CNN’s Dana Bash he sent Trump a “very strong letter ... asking eight very strong questions” about the Harvard University federal funding freeze — a comment which was mocked at the time, including by former White House press secretary Jen Psaki during an appearance on The Late Show with Stephen Colbert. Comedian Jon Stewart also slammed Schumer’s comments and impersonated the Democratic leader saying what he told Bash on an April episode of The Daily Show. \n\nFor many Americans, the image stuck.\n\n“The best thing Schumer could do for Democratic leadership in the Senate is announce that he's not seeking reelection in 2028,” Del Percio said. \n\nA spokesperson for Schumer told The Independent: “Democrats are in a stronger position to win the Senate in 2026 than we were a year ago because of the work Leader Schumer has done to recruit strong candidates and set the right agenda to win in key battleground races.”\n\nThe Independent has contacted Jeffries for comment. \n\nDemocrats are also preparing for the 2026 midterm elections and hoping to take control of the House and Senate. Historical trends show that the president’s party typically loses ground in midterm elections, but it’s still unclear how many seats Democrats can expect to flip in November. \n\nRecent polling shows Democrats running for Congress have a modest advantage over Republicans, according to The New York Times’ poll aggregator. Meanwhile, the Cook Political Report has moved 18 House races in favor Democrats, according to an analysis released January 15.\n\nFor their part, Democrats have also touted electoral victories in the last year. In a November memo, Democratic National Committee Chair Ken Martin highlighted victories by Zohran Mamdani in New York, Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey. He noted the party strives to focus on “health care, groceries, housing, and jobs.” \n\nDel Percio argues that Democrats must identify the issues that resonate the most with voters.\n\n“If you want me to vote for you, Democrat, A, B and C, why? Don’t tell me it's because you're going to take Trump's name off of the Kennedy Center. Don’t tell me it's because you won't let a ballroom be built. … Tell me what you're going to do about prices,” she explained.\n\nMeanwhile, Trump is garnering support in big tech and Hollywood. \n\nSeveral major companies, including Google and Meta, donated to Trump’s inaugural fund shortly after the 2024 election. Several tech leaders attended his inauguration, including Meta’s Mark Zuckerberg, Amazon’s Jeff Bezos and Google’s Sundar Pichai. Later in the year, when Trump announced plans for his $400 million ballroom addition to the White House, many of those same companies were quick to donate to the project.\n\nDozens of big-name and a few has-been celebrities also have voiced their support for Trump, including rapper Nikki Minaj, actor Sylvester Stallone and singer Kid Rock. Trump himself has even weighed in on Hollywood controversies — including the headline-making American Eagle jeans advertisement featuring Sydney Sweeney.\n\nMore celebrities may be aligning themselves with Trump because of the rise of “cancel culture,” Del Percio said.\n\n“Trump and Trumpers are much more forgiving of people, especially if they deserve it, and I think that's where his support has gained in that celebrity star power arena — it has nothing to do with his policies,” she added.\n\nEven those who don’t back the president appear to be toning down their rhetoric against him and his supporters. Compared to last year, celebrities appeared more comfortable — or obligated to — speak out against the president during his first term, The Guardian reports. \n\nSome celebrities, like actor Hunger Games star Jennifer Lawrence, have recently expressed doubt about Hollywood political activism. Lawrence, who has previously voiced opposition to Trump, told The New York Times in November she feels that “celebrities do not make a difference whatsoever on who people vote for.”\n\nWhen asked how she feels about speaking out against Trump now, Lawrence responded: “I don’t really know if I should.” \n\nSetzer said celebrities may be questioning “how they can be most effective with their platform.”\n\nMeanwhile, several individual Democratic lawmakers — including potential 2028 presidential candidates California Gov. Gavin Newsom and Illinois Gov. JB Pritzker — have waged individual battles with the Trump administration in the last year.\n\nNewsom has used social media to hit out at the administration over a wide range of issues, including immigration and the Jeffrey Epstein files. He’s also taken to mimicking Trump’s online posting style, including by using all-caps and coining nicknames.\n\nPritzker has repeatedly criticized the Trump’s Department of Homeland Security, particularly after the agency launched Operation Midway Blitz in the Chicago area.\n\nNewsom and Pritkzer are among the Democrats who many speculate could be positioning themselves for a presidential bid in 2028. Others include far-left Rep. Alexandria Ocasio-Cortez, Sen. Mark Kelly and former Vice President Kamala Harris.\n\nBut Del Percio warns Democrats should remain focused on the midterms for now.\n\n“I highly recommend: don’t talk about 2028 right now. I’d stick to 2026 if I were the Democrats,” she said.","summary":"Democrats suffered from a ‘fractured’ party and a lack of a clear message throughout Trump’s first year back in office, political strategists tell Katie Hawkinson","url":"https://www.independent.co.uk/news/world/americas/us-politics/democratic-party-political-strategy-trump-b2900781.html","image":"https://static.independent.co.uk/2025/11/11/14/44/GettyImages-2241445503.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/oAeR1hBh-OhrQWqOm.mp4","publish_date":"2026-01-19 14:11:46","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.414},{"id":394148892,"title":"Mother of British toddler who vanished without trace on Greek holiday island 35 years ago reveals what she thinks happened to missing son","text":"SHARE SELECTION\n\nDonald Trump\n\nPolitics Newsletter\n\nLatest Headlines\n\nPrivacy Policy\n\nMonday, Jan 19th 2026\n\n5-Day Forecast\n\nAdvertisement\n\nFive white men eating lunch in Minnesota bullied by surging mob who mistook them for ICE agents\n\nOne of America's worst airports continues to live up to its bad reputation as homeless people give tourists a ghastly welcome to the US\n\nThe death of Davos: Trump prepares to 'punch allies in the head' as Greenland threat hangs over gathering of global elite\n\nWe were $460,000 in debt. Now we're millionaires. We weren't high earners and paid it off using simple but life-changing tricks... anyone can do it\n\nIdyllic city was hit by a surge in cancers and miscarriages when Trump's 'beautiful baby' arrived. Millions across America may be next\n\nThe Kristi Noem photo that reveals why anti-ICE mob stormed Minnesota church as terrified child worshipper sobbed in father's arms\n\nJoseph Gordon-Levitt was the hottest actor in Hollywood... then vanished: Unearthing family tragedy that sparked disappearance and has left 'lasting' scars\n\nIs Jennifer Lopez the biggest diva in Hollywood? The bizarre demands and meltdowns that cemented her prima donna status - as she's branded 'rude' over red carpet exchange\n\nDesperate Broncos sign new quarterback who was caught drowning his sorrows after preseason setback\n\nBuffalo Bills FIRE Sean McDermott after playoff loss to Denver Broncos\n\nWife of Broncos back up Jarrett Stidham sends message to Bo Nix as husband prepares to replace him in AFC Championship showdown\n\nBella Hadid publicly calls out Dolce & Gabbana for 'years of racism, sexism, bigotry and xenophobia' after the brand was blasted for 'only casting white models' in their Milan show\n\nSpanish train disaster victims flew through windows and were found hundreds of yards away, with more than 39 feared dead - as mystery over what caused 'truly strange' crash grows\n\nKiefer Sutherland allegedly punched and tried choking Uber driver as new details emerge on case against 24 star\n\nDark side of America's favorite vacation hotspot... where women are subjected to the most horrific sex attacks imaginable\n\nDietitian reveals the game-changing supplements that work like Ozempic... and will super-charge your weight loss without side-effects\n\nAdored ABC presenter Jim Vargas dies age 78 as tributes pour in\n\nPierce Brosnan fans defend star's wife Keely Shaye Smith, 62, after cruel troll posts a photo of her when she met the 72-year-old Bond star alongside a recent snap as a 'reminder to avoid marriage'\n\nMy husband was acting odd for months. But nothing prepared me for what was hidden under the couch... undeniable proof of my worst fear\n\nTrump says he 'no longer feels an obligation to think purely of peace' after being refused Nobel Peace Prize in extraordinary Greenland letter\n\nMoment Macron wakes up Trump to reveal breakthrough in Ukraine truce talks with gleeful US President replying 'oh good, Nobel Prize for this'\n\nTwo-time Super Bowl champion dies aged 60 after losing battle with cancer\n\nNFL fans go wild as reporter shares stunning sideline video of Caleb Williams' touchdown pass\n\nTrump anoints Putin to Gaza peace board as he pushes NATO to breaking point with shock demand\n\nMother of British toddler who vanished without trace on Greek holiday island 35 years ago reveals what she thinks happened to missing son\n\nDo YOU have a story? Email freya.barnes@dailymail.co.uk \nBy FREYA BARNES, NEWS REPORTER \n Published:06:47 EST, 19 January 2026 |Updated:08:59 EST, 19 January 2026 \n\nThe mother of a British toddler who vanished without a trace on a Greek holiday island 35 years ago has revealed what she thinks happened to her missing son.\nBen Needham vanished from the island of Kos at just 21 months old on July 24, 1991, after he was last seen playing outside his grandparents' run-down farmhouse.\nIn 2012, a theory emerged that he had been killed when a digger accidentally crushed him in an olive grove behind the farmhouse.\n\nundefinedundefined\n\nMoreundefined\nSettingsundefined\nFull Screen (F)undefined\nPause (SPACE)undefined\nRead More (Shift + O)?lit$116635009$?\n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nThree years later, an anonymous tip came in from a man who said digger driver Konstantinos 'Dino' Barkas had told him on his death bed he had been responsible and buried Ben's body.\nHowever, his mother Kerry Needham, 53, does not believe this theory and finds it frustrating so many people do. \nMs Needham has now revealed she believes her son could have been the victim of a gypsy trafficking gang who then sold him for illegal adoption - with a man who believes he could be Ben set to take a DNA test.\nSpeaking from her home in Antalya, Turkey, where she relocated around two years ago, Ms Needham said she received an email last week from a woman who is convinced her boyfriend is Ben, writing that there are 'a lot of coincidences' and 'a lot of things don't add up from his past'.\nBut the mother, who has never given up hope her son is still alive, said she did not 'jump for joy' when she received the message because she has not yet seen a picture of the man and has 'very little information'.\n\nView gallery\n\nBen Needham vanished from the island of Kos at just 21 months old on July 24, 1991, after he was last seen playing outside his grandparents' run-down farmhouse\n\nView gallery\n\nBen's mother Kerry Needham, 53, believes her son may have been abducted by a gypsy trafficking ring and sold on for illegal adoption\n\nView gallery\n\nSouth Yorkshire Police officers investigate an olive grove near the scene where Ben went missing in Kos, Greece, in September 2016 after a theory suggested he may have been accidentally crushed and killed by a digger\n\nShe has forwarded the information she does have on to South Yorkshire Police, which has led the investigation on the British side alongside Greek authorities.\nThe force plans to conduct a DNA test to determine whether the man is a match for Ben.\nMs Needham told the Sun that people began coming forward with information once the case gained widespread publicity.\nShe recounted how a Greek man contacted Ben's grandfather Eddie, telling him he needs to start looking into gypsies 'because there's a gang, a line, he didn't call it trafficking, he said sold for illegal adoption'.\nChillingly, the stranger added that Ben's blonde hair and blue eyes means he would 'fetch more money'.\nBen's mother said it 'sounded impossible' at first but the tip-off sent her looking into the idea. \nShe praised South Yorkshire Police for always being open-minded about possible theories of trafficking, but added she does not feel Greek authorities ever considered it seriously.\nBut some years later, two former Kos police officers allegedly told journalists they had information that Ben had been 'taken off the island' via a port soon after he vanished - however, Ms Needham said this was never investigated.\nOver the years, the mother threw herself into researching human trafficking and its links to the island of Kos.\nShe never found any proof other children had been taken from Kos, but child trafficking was 'absolutely rife throughout the whole of Greece' between the 1950s and 1990s.\n\nView gallery\n\nAn age progression facial depiction of what Ben Needham may look like as an adult. He would now be 36\n\nView gallery\n\nKerry Needham, mother of missing Ben Needham, holding up a newspaper showing a photo of her missing son in 1991\n'By the mid-1990s, things were getting more difficult,' she said.\nMs Needham tracked down an elderly man who claims he was trafficked as a baby from Greece to New York.\nShe said the US city appears to be the 'massive epicentre' of illegal adoption, adding this is how 'children disappear without a trace' because the gangs are so 'well-organised'.\nIn the summer of 1991, Ms Needham, who was just 19 at the time, moved herself and Ben from Sheffield, South Yorkshire, to the village of Iraklis, near Kos town, to begin a new life with her parents who were already living there.\nOn July 24 the same year, she left 21-month-old Ben with his grandparents, Eddie and Christine, at their farmhouse which was undergoing renovations while she went to complete her shift at the hotel she was working in.\nLittle Ben had been coming in and out of the home, but at 2.30pm they realised he had vanished.\nAfter searching for him for two hours, the family assumed Ben was with his teenage uncle, Stephen, who had been helping his father with the renovation works before driving home on his moped.\nBut panic fully set in when Stephen was found alone at the family's apartment and Ben was nowhere to be found.\nGreek police were called and later that night, at around 10pm, Christine went to the hotel to tell her daughter her son was missing.\nInitially, the pace of investigation was slow, with Ms Needham later explaining how the family were convinced Ben would turn up.\nShe said they 'never thought for one minute' he had been abducted or an accident had occurred, adding: 'We thought someone must have found him, he must have got further down that lane than my mum thought he could have done in that time.\n'We thought someone's found him, taken him in, got him a drink, don't forget it's 90 degrees.\n'All these logical things - maybe they'll hand him into a police station afterwards or at the hospital, maybe he was dehydrated.'\nMs Needham said she doesn't know when the idea Ben could have been kidnapped 'dawned' on them.\n'We're not stupid but abductions and kidnappings, they happen in films,' she said.\n\nView gallery\n\nPolice at the scene in Kos, Greece, as officers from South Yorkshire Police began excavations in relation to the missing toddler Ben Needham in September 2016\n\nView gallery\n\nIn the summer of 1991, Ms Needham (pictured), who was just 19 at the time, moved herself and Ben from Sheffield, South Yorkshire, to the village of Iraklis, near Kos town, to begin a new life with her parents who were already living there\nThe idea he could have been taken 'didn't enter' their heads because they didn't know anything about human trafficking at the time.\n'We were thinking why would anyone want to abduct Ben? We didn't have any money for a ransom, which is what we thought a kidnapping was,' she said.\nIt was only when there was still no sign of her son and nobody had handed him into the police or hospital the family properly considered the possibility of an abduction - but even then, they still wondered what the motive would be.\nThe digger theory that emerged in 2012 was extensively probed, with multiple deep excavations taking place at all the sites digger driver Konstantinos 'Dino' Barkas was allowed to dump rubble and waste on around the island of Kos.\nDespite digging so deep into the ground that they unearthed an ancient burial ground, they found nothing in relation to Ben.\n'So I'm sure they can find one fragment of a child or a drop of blood, anything. They found nothing,' Ms Needham said.\nDino had worked with her father Eddie before, and even visited him and his wife at the farmhouse at around 5.30pm on the day Ben went missing, to discuss the renovation work he had been carrying out.\nMs Needham said the fact Dino visited her parents that day a few hours after allegedly accidentally killing her son leads her to further believe the digger theory cannot be true.\nShe added if the digger driver had run Ben over by mistake, there would be no need to cover it up as the family would have been blamed for not watching him more carefully.\nThe mother said if she thought for one minute her child had died, she would stop putting herself through all the 'stress, trauma and heartbreak' of searching for him.\nDespite the 'massive toll' it has taken on her mental health, she said 'something is pushing' her to keep looking for her son - a 'mother's instinct' - that makes her believe there 'must be something else' she hasn't yet come across.\n\n Pictured: How missing Ben Needham would look now 30 years after he vanished as his mother refuses to believe police theory that he was killed by a digger on Greek island \nA couple of years ago, Ms Needham moved to Antalya and says her 'simple life' with the partner she met there helps her 'remain focussed'.\nShe has since set up a website for her campaign to find her son which details the events since his disappearance and is trying to raise funds to increase the £7,500 reward for information.\nThe latest incident in which a woman came forward to say her boyfriend is convinced he is Ben is not the first time someone has contacted her believing they are the missing child.\nLast year, she opened up about being harassed for two years by a man who was 'absolutely adamant' he was Ben.\nThe man made Facebook posts asking the family to meet him, but she refused and a DNA test by South Yorkshire Police came up negative.\nMs Needham also voiced frustrations over the stark difference in public funding and attention Ben's case received compared to the extensive support given to the McCann's after their three-year-old daughter Madeleine went missing from Praia da Luz in Portugal in 2007.\n'I'm not being offhand with the McCanns, they deserve the help as much as I do, it just seems help wasn't readily available for me in the beginning or throughout,' she said.\nComparing the authority's efforts in both cases, she said a lot of mistakes were made by the British Embassy in Athens and the British Government after Ben went missing, whereas the McCanns received 'all the help and resources'.\n'What I find very insulting was I was never given the same amount,' she said.\nNow, Ms Needham's main concern is being able to access the full case files on Ben's disappearance from Kos police which would allow her to pursue any strands of enquiry that may have been forgotten or dropped.\n\nView gallery\n\nMs Needham also voiced frustrations over the stark difference in public funding and attention Ben's case got compared to the extensive support given to the McCann's since their three-year-old daughter Madeleine (pictured) went missing from Praia da Luz in Portugal in 2007\n\nView gallery\n\nComparing the authority's efforts in both cases, she said a lot of mistakes were made by the British Embassy in Athens and the British Government after Ben went missing, whereas the McCanns (pictured) received 'all the help and resources'\nUnfortunately, statute of limitations in Greece mean some witnesses cannot be interrogated because too much time has passed.\nMs Needham is also aware of new witnesses that have been passed on to police but said she has heard nothing on them.\nThere are 'a lot of unanswered' questions about the investigation into her son's case that need answering and she hopes someone will eventually let her look at the files.\nShe wants pressure to be put on the Greek police to do something, but said they are 'only bothered when you're actually on the island'.\nA South Yorkshire Police spokesman said: 'We recently received a report of a woman who believes her partner to be missing person Ben Needham.\n'Enquiries are ongoing into the report. Ben's family are aware of this report, and we will continue to keep them up to date with our enquiries.\n'We will continue to support them in their endeavour to discover the truth of what happened on 24 July 1991.'\n\nShare or comment on this article: \nMother of British toddler who vanished without trace on Greek holiday island 35 years ago reveals what she thinks happened to missing son\n\nAdd comment\n\nComments (0)\n\nComments are subject to our House rules and Terms\n\nLog in to comment\n\nWorst rated\n\nNo one seems to have shared their thoughts on this topic yet\nLeave a comment so your voice will be heard first.\nTerms | Privacy | Feedback\n\nAdvertisement\n\nTOP STORIES\n\nOne of America's worst airports continues to live up to its bad reputation as homeless people give tourists a ghastly welcome to the US\n\nFive white men eating lunch in Minnesota bullied by surging mob who mistook them for ICE agents\n\nEXCLUSIVEJoseph Gordon-Levitt was the hottest actor in Hollywood... then vanished: Unearthing family tragedy that sparked disappearance and left 'lasting' scars\n\nTaylor Swift and 'defeated' Travis Kelce are facing 'first real test' in their relationship... as insiders say 'things are changing'\n\nAdvertisement\n\nHow J Lo went from Jenny On The Block to Hollywood's biggest diva: The bizarre demands and meltdowns that have cemented her prima donna status\n\nDesperate Broncos sign new quarterback who was caught drowning his sorrows after preseason setback\n\nPierce Brosnan fans defend star's wife after cruel troll posts a photo of her when she met the Bond star alongside a recent snap as a 'reminder to avoid marriage'\n\nI was 28 weeks pregnant with twins when I found out my then-husband was a paedophile. These are the signs every woman needs to know, why I slapped his mother ac...\n\nChristopher Reeve's lookalike son Will weds Amanda Dubin in Miami after yearlong engagement\n\nAdvertisement\n\nBuffalo Bills FIRE Sean McDermott after playoff loss to Denver Broncos\n\nMy husband was acting odd for months. But nothing prepared me for what was hidden under the couch... undeniable proof of my worst fear\n\nDietitian reveals the game-changing supplements that work like Ozempic... and will super-charge your weight loss without side-effects\n\nThe Kristi Noem photo that reveals why anti-ICE mob stormed Minnesota church as terrified child worshipper sobbed in father's arms\n\nCountry singer Karley Scott Collins responds to rumors she's living with Keith Urban after Nicole Kidman split\n\nAntiques Roadshow guest apologises for 'nearly swearing' as she learns eye-watering value of collection mistaken for costume jewellery which made BBC expert's '...\n\nPrince Harry and Meghan Markle's bold response when the late Queen stopped them from using their HRH titles\n\nMoment Macron wakes up Trump to reveal breakthrough in Ukraine truce talks with gleeful US President replying 'oh good, Nobel Prize for this'\n\nAdored ABC presenter Jim Vargas dies age 78 as tributes pour in\n\nBella Hadid publicly calls out Dolce & Gabbana for 'years of racism, sexism, bigotry and xenophobia' after the brand was blasted for 'only casting white models' in Milan show\n\nAdvertisement\n\nEXCLUSIVESad disappearance of iconic '90s femme fatale Men In Black star who hasn't been seen in 16 years... as the Daily Mail reveals her mountain of STORE CARD debt\n\nNever-before-seen pictures of wild Golden Globes afterparty take over the internet… and the sinister truth behind them\n\nThe home cleaning revolution: Smart ways to keep your house in order, without spending all weekend doing it\n\nTrump anoints Putin to Gaza peace board as he pushes NATO to breaking point with shock demand\n\nThe death of Davos: Trump prepares to 'punch allies in the head' as Greenland threat hangs over gathering of global elite\n\nDark side of America's favorite vacation hotspot... where women are subjected to the most horrific sex attacks imaginable\n\nThey're the picture perfect family. But behind the photo lies a $6bn industry full of creeps... they're one of the lucky ones\n\n'Work maintained my sense of self': How one woman's cancer journey inspired her company to give back\n\nNFL risks Trump fury again with controversial choice of Super Bowl performer after Bad Bunny rage\n\nEXCLUSIVENick Reiner's disturbing behavior that led to him being put under conservatorship... and the decision that could have prevented bloodshed\n\nAdvertisement\n\nBen Affleck gives rare insight into raising his three children with ex-wife Jennifer Garner - and shares details about their 'complicated' upbringing\n\nNFL fans go wild as reporter shares stunning sideline video of Caleb Williams' touchdown pass\n\nSpanian reveals more than he bargained for at the beach as his girlfriend helps him cover up... and the new tattoos proving their romance is getting serious soo...\n\nFans claim college football is RUINED as Miami QB Carson Beck reveals he graduated two years before title game\n\nHorrendous footage captures man beating up toddler on doorstep\n\nTwo-time Super Bowl champion dies aged 60 after losing battle with cancer\n\nEXCLUSIVENicole Kidman's subtle but devastating digs at Keith Urban revealed... as insiders claim country star has MOVED IN with new squeeze\n\nSecret ranking of NFL WAGs revealed: From a 'jealous' ex-cheerleader to the 'annoying queen'... meet the stunning sideline spouses raking in MILLIONS\n\nEXCLUSIVELion King co-director Rob Minkoff breaks silence on Roger Allers' death and reveals they had lunch just WEEKS ago: 'He was in fine health'\n\nEXCLUSIVEMandy Moore performs with husband Taylor Goldsmith in first public outing since Ashley Tisdale's toxic mom group drama\n\nBankruptcy threatens 130 Popeyes as operator collapses under mountain of debt\n\nIdyllic city was hit by a surge in cancers and miscarriages when Trump's 'beautiful baby' arrived. Millions across America may be next\n\nElizabeth Hurley, 60, flaunts her incredible figure in a tiny leopard print bikini for sizzling social media post amid avish getaway to the Maldives\n\nREVEALED: The sorry trail of half-truths, controversies and crankery now threatening Diary Of A CEO host Steven Bartlett. As the Dragons' Den star prepares to w...\n\nWife of Army reservist detained by ICE during routine check-in at immigration office just HOURS after getting married\n\nAdvertisement\n\nIconic Chicago White Sox pitcher Wilbur Wood dies aged 84\n\nI judged Erika Kirk for being too put together at Charlie's funeral... now I get it after my husband died and left me and our 7 children\n\nThe Osteopenia Plague: Almost HALF of over-50s now have the dreaded bone disease. But science now shows it IS reversible - if you follow this step-by-step guide...\n\nEXCLUSIVEAmanda Bynes's secret boyfriend: How he calms her erratic 'moods'... and her radical new Ozempic side effect\n\nLara Trump blasted for cringe dancing in her new music video filmed at Trump's golf estate\n\nGreenland is only the beginning: MARK HALPERIN reveals the full scope of Trump's global 'disruption' plan... and its secret architects\n\nCalifornia man skis down Everest's treacherous North Face years after watching as avalanche swept his partner to her death\n\nEXCLUSIVE80s police drama icon who was voted 'most beautiful woman in TV' looks glamorous at 69 on rare outing... can you guess who?\n\nEmilly went from size 30 to size 6 on fat jabs, then they stopped working. 85% of users have the same problem. Here's exactly how she beat the dreaded 'Ozempic ...\n\nAmazon delivery driver is shot and killed by homeowner who thought he was his daughter's boyfriend, prosecutors say\n\nAdvertisement\n\nWife of Broncos back up Jarrett Stidham sends message to Bo Nix as husband prepares to replace him in AFC Championship showdown\n\nKiefer Sutherland allegedly punched and tried choking Uber driver as new details emerge on case against 24 star\n\nAs Dan Walker is spotted 'arm in arm' with young golf pro, KATIE HIND reveals all on the 'happily married Christian' she's known since they were teenagers and h...\n\nBritney Spears flashes her nipple in sheer plunging bodysuit as she twerks to Cardi B in racy new video\n\nExtreme measures Rams players took to stay warm during ice-cold Bears game are revealed\n\nCanadian woman is found dead surrounded by dingoes on K'gari\n\nLooking back at these pictures of a typical day in Britain in the 1970s, one single detail stands out. Here is the REAL truth about why life looked so very diff...\n\nKylie Jenner is red-hot in a plunging PVC dress as she continues to plug new fragrance\n\nTrump says he 'no longer feels an obligation to think purely of peace' after being refused Nobel Peace Prize in extraordinary Greenland letter\n\nEXCLUSIVEPlastic surgeons weigh in on Jimmy Kimmel's rumored cosmetic work\n\nAdvertisement\n\nRare 'Purple Star Sapphire' weighing 3,563 CARATS is discovered in Sri Lanka - and it could be worth over £220 million\n\nEXCLUSIVEI've been waiting decades for Timothy Busfield's arrest. Thirty years ago I represented one of his accusers... then he tried to destroy me\n\nInside Andrew's life in exile: His 'poky' new home, no space for staff or a proper garage... and the biggest humiliation of all. As the ex-prince downsizes, why...\n\nEXCLUSIVEAmy Schumer's friends reveal true meaning of thin bikini pictures and why they're 'monitoring her'... as depth of ex Chris Fischer's heartbreak is laid bare\n\nSpanish train disaster victims flew through windows and were found hundreds of yards away, with more than 39 feared dead - as mystery over what caused 'truly st...\n\nTom Brady flashes another ultra-rare watch in NFL commentary booth worth up to $1million\n\nWe were $460,000 in debt. Now we're millionaires. We weren't high earners and paid it off using simple but life-changing tricks... anyone can do it\n\n'It's tragic. We don't know how long she'll be around for': Heartbreaking words of Katie Price's friends who reveal sad truth about painful picture, fears about...\n\nPennsylvania boy, 11, facing homicide charges 'after shooting father dead when he took his Nintendo Switch away'\n\nCollege football set to ride NFL's coattails to London in 2026 with inaugural Union Jack Classic\n\nAdvertisement\n\nWinter blast puts 18 states on snow alert including Florida and Georgia as 6 INCHES hit New England\n\nTess Crosley's husband breaks his silence on his wife's affair with AFL star Lachie Neale - as we reveal the lovers' brazen act before they were caught\n\nMeghan Markle posts videos of her dancing with Prince Harry and sweet clip of Lilibet and Archie feeding animals at the zoo\n\nJustin Bieber sparks a social media frenzy as he is accused of 'liking' a 2016 photo of him kissing ex Selena Gomez - before 'unliking' post amid flurry of fanfare\n\nHollywood heartthrob looks unrecognizable as scrawny teen in his debut TV role on Law & Order... can you guess who he is?\n\nGwyneth Paltrow reveals VERY racy Valentine's Day gift list for GOOP - including $800 sex dice, a $229 sex toy and intimate lubrication\n\nGlambot director reveals what REALLY happened with Jennifer Lopez after star was slammed for 'rude' attitude at Golden Globes\n\nFans can't believe Rocky icon Sylvester Stallone is almost 80 as he shares gym video: 'Sly never ages!'\n\nViolet Affleck dons mask as she enjoys NYC trip with dad Ben three months after bravely advocating for safety mandates at UN\n\nColin Jost reacts to wife Scarlett Johansson losing her title as 'highest-grossing Hollywood star' to Zoe Saldana\n\nAdvertisement\n\nA$AP Rocky carries a bottle of Casamigos tequila as he leaves date night with stylish Rihanna in New York\n\nAshton Kutcher says he was fired by Gucci for being 'too fat' during his early career as a model\n\nGwyneth Paltrow, 53, says she 'worried' about her sex scenes with Timothée Chalamet, 30, in Marty Supreme because she thought their age gap would be 'really weird'\n\nGame of Thrones star Sophie Turner discovers a chronic health issue amid gruelling Tomb Raider training\n\nCardi B trolls ESPN analysts after they all snubbed boyfriend Stefon Diggs' Patriots before their win over Texans\n\nBikini-clad Nicola Peltz shares poignant message for the Beckhams with 'family first' tattoo amid feud after it emerged she's grown 'obsessed' with driving the rift\n\nEXCLUSIVEBaby-faced former '80s child star who pivoted to Stranger Things seen in extremely rare public outing\n\nRihanna is effortlessly chic in a bold double denim look as she steps out in NYC\n\nGleb Savchenko kisses mystery woman at LA farmers market after Brooks Nader split\n\nAthleta just slashed even more off its already huge sale - hurry to save big on the most comfortable lounge and workout essentials\n\nAdvertisement\n\nTeddi Mellencamp enjoys family outing with boyfriend in first public sighting after famous father's concerning update on her cancer battle\n\nMickey Rourke goes for a night jog in LA after eviction and GoFundMe drama\n\nThe delicious, metabolism-boosting collagen shake that helps you shed pounds in just 28 days - and the before and after pictures are stunning\n\nEXCLUSIVEMichael Jackson's chimp Bubbles used to party with rock stars all night but new photos show him enjoying quiet retirement in Florida\n\nBringing Up Bates' Travis Clark confesses to affair after wife Katie revealed devastating pregnancy loss\n\nFashion experts swear by Aspinal of London handbags and the brand is quietly having a major sale right now\n\nNicole Kidman sells three-bedroom Sydney apartment with views following divorce from Keith Urban\n\nBringing Up Bates' Travis Clark praised wife Katie months before shock cheating reveal\n\nCharli XCX and Kylie Jenner send pulses racing in skimpy black bikinis as they promote their new mockumentary The Moment\n\nJodie Turner Smith dresses down in a white T-shirt and stylish bandana as she pays a visit to Studio City Farmers Market in Los Angeles\n\nAdvertisement\n\nShoppers are racing to this viral wearable blanket brand's winter clearance with styles available for shocking prices\n\nReese Witherspoon reveals close friend Jennifer Garner has a 'dark side'\n\nNicola Peltz puts on a sultry display in a blue bikini amid claims she's 'obsessed' with driving the rift between husband Brooklyn Beckham and his family\n\nDownton Abbey star Hugh Bonneville, 62, says he feels 'blessed to start a new chapter' after split from wife of 25 years and heartbreaking family losses\n\nThe rich cream that firms the dreaded 'turkey neck' and erases visible signs of aging is a great price at Target - and it works in just weeks\n\nHoda Kotb reveals how she really feels watching Sheinelle Jones and Jenna Bush Hager host Today... over a year after her departure\n\nOlivia Rodrigo spends quality time with her parents over family dinner in LA... weeks after Louis Partridge 'split'\n\nRoger Allers dead at age 76: Tributes pour in for co-director of The Lion King and a 'true pillar of Disney Animation renaissance'\n\nThe View hosts stun audience by telling Clintons they SHOULD testify before Congress after pair defied Epstein subpoena\n\nBen Affleck was VOMITING filming heart-wrenching scene with Bruce Willis in Armageddon\n\nAdvertisement\n\n'Had the best trip and left pregnant!' Rosie Huntington-Whiteley recalls conceiving son Jack in New Zealand while Jason Statham filmed The Meg\n\nRosamund Pike makes rare appearance with son Atom, 11, as they attend star-studded NBA game\n\nProud Rihanna celebrates A$AP Rocky's SNL performance at star-studded afterparty with Sabrina Carpenter and Finn Wolfhard\n\nEXCLUSIVEBravo star reveals secret health battle after losing 20lbs in less than two weeks\n\nSydney Sweeney's most scandalous outfits revealed ahead of Euphoria returning to screens\n\nViewers scorch SNL after Stranger Things actor makes vulgar joke about women's bodies: 'Is it always this terrible?'\n\nInside Orlando Bloom's wild 49th birthday as actor 'revels in his single status at a swanky private members club in Aspen'\n\nGwyneth Paltrow talks empty nest syndrome after her kids Apple, 21, and Moses, 19, left for college\n\nActor siblings Maya and Levon Hawke are the spitting image of their famous parents as they enjoy the Prada show during Milan Fashion Week\n\nMatt Damon suggests some stars would rather go to JAIL than be victim of 'cancel culture'\n\nAdvertisement\n\nLily Rose Depp is crowned the highest earning Gen Z nepo baby - as the staggering sum young influencers can make online is revealed\n\nInsider reveals all on loved-up Tiger Woods and Vanessa Trump at golf icon's 50th birthday bash\n\nBrooklyn Beckham and wife Nicola Peltz pack on the PDA as they kiss in front of the Los Angeles skyline amid ongoing family feud\n\nThe glamorous nepo-verse of Camila Morrone: The Night Manager star boasts an A-list girl squad and counts Leonardo DiCaprio as an ex \n\nHumiliated reality TV star drops mayoral campaign after making embarrassing blunder live on air\n\nA-list pop star is unrecognizable in Saturday Night Live cameo... can YOU guess who she is?\n\nRihanna bundles up in a $3,200 designer windbreaker and fur coat to support boyfriend A$AP Rocky at SNL\n\nJane Fonda, 88, is pushed in wheelchair at airport after Reiner murders left her 'reeling'\n\nFinn Wolfhard's SNL episode ROASTS Will's Stranger Things coming out scene that was blasted by fans\n\nRead Melissa Gilbert's begging letter in defense of husband Timothy Busfield as she claims West Wing star is 'honorable and compassionate' despite child sex allegations\n\nAdvertisement\n\nAnsel Elgort becomes first time dad as he's seen carrying newborn baby in New York\n\nChristie Brinkley, 71, shows off cleavage in red bikini top during tropical getaway\n\nKourtney Kardashian declares she's three years sober... after ditching Botox and makeup\n\nNickelodeon ex-child star dad says 'my baby' was run over 'like roadkill'... amid hunt for hit-and-run driver\n\nReality TV star reveals pregnancy loss in heartbreaking video: 'I just lost my baby'\n\nLuann de Lesseps, 60, flashes her booty in tiny black bikini while doing handstands on the beach in Mexico\n\n90 Day Fiance star Leida Margaretha faces 24 new felony charges after multiple arrests last year\n\nEXCLUSIVETitanic star with a link to Clint Eastwood emerges on rare outing in LA... can you guess who she is?\n\nHilary Duff touches down in London ahead of her nostalgic concert amid Ashley Tisdale's 'toxic mom group' drama\n\nEx-NBA star Lamar Odom arrested in Las Vegas on suspicion of DUI\n\nAdvertisement\n\nTimothy Busfield claims there is 'no proof' for child sex abuse charges as wife pleads for his 'protection' in jail\n\nAstrologer names the NFL power couples destined to split... including the QB and his 'freakier' girlfriend\n\nEXCLUSIVENicole Richie seen for first time since daughter Harlow, 18, revealed new name as star says family is 'great'\n\nHollywood stars DEFEND Timothy Busfield after child abuse claims as he reveals sex life with Melissa Gilbert\n\nLarsa Pippen, 51, addresses rumors she's dating basketball star, 27, after romance with Michael Jordan's son\n\nNickelodeon star desperately sought help for Kianna Underwood years prior to All That actress's tragic hit-and-run death\n\nKanye West's wife Bianca Censori reveals another unexpected talent after Korean art installation\n\nBen Affleck gives awkward response as he's dragged into Real Housewives drama: 'I don't want to get anybody in trouble'\n\nMy Best Friend's Wedding star Dermot Mulroney finalizes divorce from Prima Apollinaare\n\nHGTV star sets record straight on her relationship with husband after announcing engagement to new man\n\nSelena Gomez stuns fans by sharing rare makeup-free selfie\n\nElizabeth Hurley, 60, goes topless as she shows off her incredible figure in a racy bath snap while soaking up the sun in the Maldives\n\nTeddi Mellencamp's father John is begging the 'really sick' star to leave Hollywood amid cancer battle\n\nThe celebrity kids who have had their names changed as Nicole Richie's daughter, 18, unveils her new moniker\n\nMeghan shares intimate footage of her and Harry dancing in video filmed by Princess Lilibet - as Duchess hops on viral 2016 throwback trend\n\nRihanna looks stylish as she supports A$AP Rocky ahead of his SNL performance in New York as the rapper rolls out his new album\n\nTimothée Chalamet's nepo baby dating history from Lourdes Leon to Lily-Rose Depp after actor made the ultimate declaration of love for Kylie Jenner\n\nShannen Doherty's ex-husband attempts to block divorce deal as battle over actress' estate rages on 2 years after her death\n\nTeyana Taylor's remarkable rise from reality TV as she's tipped for Oscar glory despite just 20 minutes of screen time in One Battle After Another\n\nJennifer Garner recalls 'surviving' Ben Affleck's obsession with Beyonce as she spills on what really went down during his intense Halo phase\n\nEx-Nickelodeon child star, 33, is killed in horrific hit-and-run as urgent hunt for driver is launched\n\nMegan Fox and Machine Gun Kelly are 'done' romantically and relationship is 'just about co-parenting' after split\n\nCeline Dion pays tribute to late husband Rene Angelil on what would have been his 84th birthday\n\nEXCLUSIVEWidower of Freddie Mercury's 'secret' daughter vows to release pictures of her with the singer after star's ex cast doubt on claim he was her father\n\nMickey Rourke's dog needs $10k heart surgery... as he tries to return $100k donation from fans\n\nZachery Ty Bryan's ex sentenced after trying to run him over as she pleads guilty to DUI while he faces his own legal woes\n\nMichelle Randolph breaks silence on her new relationship with Glen Powell amid three-month romance\n\nLola Sheen struggles juggling water bottles in Malibu amid red hot social media feud with sister Sami\n\nNepo baby says she was 'offended' by Cindy Crawford setting her up on 'blah' date with 'grandpa' George Clooney decades ago\n\nMelissa Gilbert being forced to kiss an older actor when she was 15 on Little House On The Prairie goes viral after husband Timothy Busfield's arrest\n\nKylie Kelce makes raunchy reference to her and Jason's sex life after his post-NFL glow up\n\nIsla Fisher wraps up warm as she walks her dog in London with her mother after 'challenging' split from Sacha Baron Cohen\n\nThe most haunted celebrity houses revealed... including terrifying 'torture mansion'\n\nOne Tree Hill star and wife split after 10 years of marriage\n\nBruno Mars breaks record for most tickets sold in a single day ahead of his hotly-anticipated new tour\n\nGene Hackman's Santa Fe mansion listed for over $6M... one year after he died in the home with his wife\n\nMatt Damon mercilessly mocked after making language faux pas during red carpet interview in Spanish\n\nCringiest celeb 2016 throwback posts... as Mindy Kaling, Amy Schumer and Eva Longoria join the popular trend\n\nKim Kardashian's daughter North West raps about body piercings, tattoos and skipping school\n\nLindsey Vonn posts naked throwback picture as Winter Olympics star takes part in viral 2016 trend\n\nHailey Bieber sweetly kisses husband Justin in 2016 throwback photo... after denying posting marital 'abuse' video\n\nBella Hadid wants to become a movie star... after making a splash with her sexy role in Yellowstone\n\nMickey Rourke is trying to return $100K raised for him as he calls GoFundMe a 'cruel embarrassment'\n\nHome Alone's Daniel Stern suffers major career blow after allegedly soliciting prostitution\n\nResurfaced video of Cameron Diaz seemingly being forcibly kissed by Chris Isaak at awards show sparks outrage\n\nJamie-Lynn Sigler talks 'emotional' portrayal of doctor with MS on Grey's Anatomy... 25 years after diagnosis with the disease\n\nFresh Prince Of Bel-Air mansion Will Smith acted in is listed for $30million as it hits market for first time in 50 years\n\nHeather Graham, 55, kicks off 2026 with striking bikini flashback photo that drives fans wild\n\nJennifer Aniston's bundled-up winter look is a 180 from her Instagram image\n\nHilary Duff gets steamy in racy new Roommates music video after 'toxic' mom group drama\n\nForgotten NFL quarterback escapes to Cabo with his glamorous wife after anonymous season\n\nBlake Lively hires the lawyer of Jeffrey Epstein victims ahead of Justin Baldoni trial\n\nMichelle Pfeiffer and Kurt Russell are seen for the first time in Yellowstone spinoff\n\nMadonna, 67, and boyfriend Akeem Morris, 29, return to the US after family trip to Morocco as she voices support for Iran protesters\n\nKylie Jenner's best friend Stassi copies Kanye's wife Bianca Censori in black panties and ripped stockings... after BBL reduction\n\nEmily Ratajkowski sends temperatures soaring as she poses in sexy red lingerie and suspenders for barefoot home shoot\n\nDakota Johnson seen on romantic dinner date with much younger singer... after Chris Martin split\n\nSharon Stone blasts 'kids' who accused her of stealing seat at awards show in profane rant\n\nFind out how much Nikki Glaser got paid to babysit Judd Apatow and Leslie Mann's children almost 20 years ago\n\nTom Hiddleston looks dapper as he joins Liam Hemsworth and Nick Jonas at Milan Fashion Week Ralph Lauren Menswear show\n\nTimothy Busfield's wife Melissa Gilbert receives outpouring of support in wake of his arrest\n\nPamela Anderson claims Tommy Lee's wife has caused their estrangement... 28 years after divorce: 'I don't like it'\n\nEmily in London! Lily Collins joins her co-star Ashley Park for a stroll in the park with her rarely-seen baby daughter Tove during wholesome day out\n\nReturn of the Mac-ron! French First Lady Brigitte shows off her DJ skills and dance moves\n\nTop Stories\n\nLIVE TOP STORIES\n\nStarmer Breaks With Trump Over 'Completely Wrong' Threats\n\nTime·3hrs ago\nSee more versions\n\nDOJ launches civil rights investigation after Minnesota agitators storm church\n\nFox News·3hrs ago\nSee more versions\n\nWhat we know about Spain's worst train disaster in over a decade\n\nBBC.com·4hrs ago\nSee more versions\n\nJosh Shapiro claims Kamala Harris' team asked if he was a 'double agent for Israel'\n\nFox News·3hrs ago\nSee more versions\n\nPrince Harry says Daily Mail \"driving me paranoid\" in hacking case\n\nNewsweek·2hrs ago\nSee more versions\n\nTrump invites Putin to join Gaza peace board: Russia\n\nNewsweek·5hrs ago\nSee more versions\n\nShark mauls surfer in Sydney one day after boy bitten, critically injured while swimming with friends\n\nCBS News·4hrs ago\nSee more versions\n\nKiefer Sutherland allegedly ‘punched and tried to choke Uber driver before arrest’\n\nThe Independent·31mins ago\nSee more versions\n\nBody of Canadian woman, 19, found surrounded by dingoes on Australian island\n\nAOL·41mins ago\nSee more versions\n\nKurdish-led force clashes with Syrian troops near ISIS detainee prison\n\nNBC News·2hrs ago\nSee more versions\nClick here to view more \n\n@dailymailuk\n\nHarry Styles' new album gets the seal of approval from his girlfriend Zoe Kravitz's father Lenny\n\nAndrew Garfield and Jude Law seen in first look as Las Vegas act Siegfried & Roy\n\nThe Hills and Laguna Beach alum Lo Bosworth gives birth to baby girl as she reveals touching name\n\nJason Momoa, 46, packs on the PDA with stunning girlfriend Adria Arjon, 33, at the New York premiere of his new movie The Wrecking Crew\n\nParis Jackson shows off her toned legs in a chic brown mini dress as she attends Bulgari rooftop party\n\nHollywood bad boy Sean Penn, 65, reemerges with much younger love, 30, after flouting anti-smoking rule at Golden Globes \n\nTom Brady opens up on the toll his divorce from Gisele Bundchen took on him in his final NFL season\n\nAshton Kutcher, 47, makes rare comment on ex-wife Demi Moore, 63, after she savaged him in memoir\n\nTeddi Mellencamp's rocker father John shares concerning update about 'really sick' reality star amid her stage 4 cancer battle\n\nDavid and Victoria Beckham 'FINALLY win war against their neighbors' over plans for a new access road at their $16m country home\n\nMindy Kaling addresses her major weight loss transformation as she shares throwback photos from past decade\n\nKylie Jenner accused of 'copying' boyfriend Timothee Chalamet's ex Lily-Rose Depp\n\nRihanna looks sensational in a low-cut satin gown as she supports A$AP Rocky at his album release party amid music comeback claims\n\nPierce Brosnan, 72, and his model son Dylan, 29, enjoy a stroll out in Majorca as the actor continues to film Mobland\n\nDakota Johnson flashes her toned midriff in a white sports bra as she leaves the gym after intense workout\n\n'I don't know what I would do without your love': Nicola Peltz shares pointed tribute to mum Claudia and says 'there is no one like you' amid Beckham feud\n\nBillie Eilish looks ultra-casual in an oversized hoodie and shorts as she visits her brother Finneas in Los Feliz\n\nNicole Richie addresses her daughter's new identity for the first time after teen unveiledtransformation on her 18th birthday\n\nHarry Styles' fans are convinced they have uncovered secrets about upcoming tour to accompany his new music after unveiling fourth album\n\nMadonna, 67, joins boyfriend Akeem Morris, 29, and son Rocco Ritchie, 25, racing horses in the desert as she shares impassioned political post \n\nJessie Buckley wears oversized shirt and asymmetric skirt as she arrives at Jimmy Kimmel Live after scooping a Golden Globe for her Hamnet role\n\nKim Kardashian celebrates daughter Chicago's 8th birthday as she posts tribute to her 'sweet baby girl'\n\nGame Of Thrones stars Jason Momoa and Emilia Clarke reunite 15 years after starring on iconic HBO series\n\nEXCLUSIVEJacob Elordi and Olivia Jade back together AGAIN after actor's cozy display with Ana de Armas\n\nEXCLUSIVEInside Tiger Woods' A-list 50th birthday bash as he cozies up to girlfriend Vanessa Trump to watch acoustic Bon Jovi set\n\nChristie Brinkley, 71, shows off amazingly toned figure in a bikini top and shorts on Turks and Caicos\n\nPamela Anderson BLASTS Seth Rogen after awkward Golden Globes run-in that left her 'p**sed off'\n\nCandy Spelling, 80, breaks silence over THAT age-defying photo amid airbrushing accusations\n\nJames Van Der Beek ditches 'impossible' New Year's resolutions amid cancer battle as fans hail actor's 'healthy' appearance in new video\n\nBethenny Frankel blames facial infection on hotel TOWELS after she had to cut St. Barts trip short\n\nCountry star who vanished from the spotlight 25 years ago RESURFACES with viral Jessie James Decker duet\n\nDenise Richards's daughter Lola Sheen slams sister Sami for 'spreading rumors' about her amid wild feud over an ex-boyfriend\n\nTimothee Chalamet topples Leonardo DiCaprio at the box office... after thrashing him during awards season\n\nWorld's sexiest hockey star and OnlyFans star Mikayla Demaiter spills out of little black dress in latest post\n\nMelissa Leo says winning an Oscar for The Fighter was 'not good' for her career as she slams Hollywood for offering her 'older, nasty women' roles\n\nTimothy Busfield told cops he wanted a 'playful environment' on set after arrest for child sex crimes\n\nRyan Lochte moves in with stunning new girlfriend after newly sober Olympian's bombshell divorce\n\n'Finally I can be insufferable again': Harry Styles' fans are hysterical as singer unveils his fourth studio album after months of speculation\n\nKate Moss's secret weapon as she turns 52: How supermodel is ageing backwards after her wild party girl era\n\nAimee Lou Wood shares sweet snap with her hero and 'the ultimate human' Julia Roberts after meeting Hollywood star at The Golden Globes\n\nTop Stories\n\nLIVE TOP STORIES\n\nStarmer Breaks With Trump Over 'Completely Wrong' Threats\n\nTime·3hrs ago\nSee more versions\n\nDOJ launches civil rights investigation after Minnesota agitators storm church\n\nFox News·3hrs ago\nSee more versions\n\nWhat we know about Spain's worst train disaster in over a decade\n\nBBC.com·4hrs ago\nSee more versions\n\nJosh Shapiro claims Kamala Harris' team asked if he was a 'double agent for Israel'\n\nFox News·3hrs ago\nSee more versions\n\nPrince Harry says Daily Mail \"driving me paranoid\" in hacking case\n\nNewsweek·2hrs ago\nSee more versions\n\nTrump invites Putin to join Gaza peace board: Russia\n\nNewsweek·5hrs ago\nSee more versions\n\nShark mauls surfer in Sydney one day after boy bitten, critically injured while swimming with friends\n\nCBS News·4hrs ago\nSee more versions\n\nKiefer Sutherland allegedly ‘punched and tried to choke Uber driver before arrest’\n\nThe Independent·31mins ago\nSee more versions\n\nBody of Canadian woman, 19, found surrounded by dingoes on Australian island\n\nAOL·41mins ago\nSee more versions\n\nKurdish-led force clashes with Syrian troops near ISIS detainee prison\n\nNBC News·2hrs ago\nSee more versions\nClick here to view more \n\nFrom the Makers of Candy Crush\nFarm Heroes Saga, the #4 Game on iTunes. Play it now!\n\nNEW ARTICLESHomeTop\n\nFollow us on: \n\nBack to top\n\nLeadership Team\nThis is Money\n\nMail Travel\nAbout Daily Mail\n\nReal Estate\n\nTerms of Use\n\nWebsite Terms\nPrivacy Policy\nSubscription Terms & Conditions\nDo not sell or share my personal information\nContributors\nAdditional Cookie Information\n\nGet in Touch\n\nHow to complain\nWork with us\nAdvertise with us\nDaily Mail Subscriptions Help & FAQs\n\nTopics Index\nText-Based Site\n\n© 2026 Associated Newspapers Limited\n\nAdvertisement\n\nAdvertisement\n\nDMG Media and its partners use cookies and other technologies to collect user data \n\nTypes of data being accessed\n\nUnique identifiers for the device using the site\nBrowser information\n\nActivities such as pages visited\nLocation of where the site is used from your device, so that:\n\nWe can deliver content and advertising that's relevant to you \n\nWays in which we use your data for advertising purposes\n\nInformation storage and access\nPersonalisation\nAd selection, delivery, reporting\nContent selection, delivery, reporting\nMeasurement\nWe give you the best experience\n\nControl how your data is used and view more info at any\ntime via the Cookie Settings link in our Privacy Policy\n\nView more info\n\nTo view this video please enable JavaScript, \nand consider upgrading to a web browser that supports HTML5 video\n\nVideo Player is loading.\n\nCurrent Time 0:09\n\nDuration 0:32\n\nLoaded: 100.00%\n\nAdvertisement\n\nStream Type LIVE\nSeek to live, currently behind liveLIVE\n\nRemaining Time -0:23\nFull Window\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nTextColorOpacity\nText BackgroundColorOpacity\nCaption Area BackgroundColorOpacity\n\nText Edge Style\nFont Family\n\nReset restore all settings to the default values\n\nClose Modal Dialog\nEnd of dialog window.\n\nAdvertisement","summary":"Ben Needham vanished from the island of Kos at just 21 months old on July 24, 1991, after he was last seen playing outside his grandparents' run-down farmhouse.","url":"https://www.dailymail.co.uk/news/article-15476533/mother-ben-needham-vanished-greek-island-reveals-thinks-happened-missing-son.html","image":"https://i.dailymail.co.uk/1s/2026/01/19/11/105626193-0-image-m-23_1768822278928.jpg","video":null,"publish_date":"2026-01-19 13:59:07","author":"Editor,Freya Barnes","authors":["Editor","Freya Barnes"],"language":"en","source_country":"gb","sentiment":-0.212},{"id":394209494,"title":"Shapiro says Harris’ vetting team asked whether he was ‘an agent of the Israeli government’","text":"A number of forces on the left questioned Josh Shapiro’s ties to Israel during Kamala Harris’ rushed running mate selection process in 2024. In his new memoir out next week, the Pennsylvania governor says the former vice president and her vetting team were among them.\n\nSo much so, Shapiro writes in a copy obtained by CNN, that Dana Remus, a former White House counsel under President Joe Biden who became a senior member of Harris’ VP vetting team, asked him, “Have you ever been an agent of the Israeli government?”\n\n“Was she kidding?” Shapiro writes. “I told her how offensive the question was.”\n\n“‘Well, we have to ask,’” Remus, a former White House counsel under President Joe Biden, said, according to his book. “‘We just wanted to check.’ She added: ‘Have you ever communicated with an undercover agent of Israel?’”\n\nShapiro’s anger was clearly rising.\n\n“If they were undercover, I responded, how the hell would I know?” he wrote. “I calmly answered her questions. Remus was just doing her job. I get it. But the fact that she asked, or was told to ask that question by someone else, said a lot about people around the VP.”\n\nShapiro, an observant Jew and a proud Zionist, was critical of some protests proliferating on college campuses as tensions rose following Hamas’ Oct. 7, 2023, attack and the Israeli military’s response, warning that some of those demonstrations seemed to tip into antisemitism. Despite his condemnation of Israeli Prime Minister Benjamin Netanyahu’s government, some voices on the left called him “Genocide Josh,” which they didn’t do with other politicians.\n\nShapiro spent time in high school working on an Israeli kibbutz and as a volunteer on an Israeli army base. He also wrote an op-ed in college saying Palestinians “do not have the capabilities to establish their own homeland and make it successful even with the aid of Israel and the United States,” and had a brief stint in the Israeli Embassy’s public affairs division at the beginning of his career.\n\nHis staff has previously downplayed the volunteer work in Israel and work at the embassy, and he has said that his writing as college student does not reflect his current views.\n\nHarris had her own questions in their interview at the Naval Observatory, which Shapiro writes that he was heading to when he got the call. He writes that she asked him whether he would apologize for statements he made condemning the campus protests at the University of Pennsylvania.\n\n“‘No,’ I said flatly,” he writes. But he says he told her he felt he could still make the case for her, even in places like Dearborn, Michigan, where there is a sizable Arab American population and where the state’s “Uncommitted” movement during the 2024 Democratic primary took off.\n\n“She heard me and expressed how bad she felt that I had been getting hammered with the antisemitic attacks that she had witnessed throughout the process,” Shapiro writes.\n\nDays after Harris became the nominee in 2024, a top aide opted not to answer directly when asked whether the vice president still considered herself a Zionist.\n\nThe New York Times first reported on the details from the memoir.\n\nShapiro spokesman Manuel Bonder pointed out that this material is only one chapter of a larger memoir prompted by the firebomb attack on the governor’s mansion in Harrisburg last year on the first night of Passover.\n\n​​“Gov. Shapiro wrote a very personal book about his faith, his family, and the people of Pennsylvania he has learned from and fought for throughout his life in public service,” Bonder said Sunday.\n\nA spokesperson for Harris did not respond when asked for comment. Remus could not be reached for comment.\n\nDeborah Lipstadt, the former U.S. special envoy to monitor and combat antisemitism during the Biden administration, wrote in a social media post that the more she reads about Shapiro’s “treatment in the vetting process, the more disturbed (I) become.”\n\n“The questions to him, I repeat, are why they needed a Special Envoy on antisemitism. These questions were classic antisemitism,” she wrote.\n\nAaron Keyak, who is the former deputy special envoy to monitor and combat antisemitism at the State Department during the Biden administration and currently sits on the Combat Antisemitism Movement board, called the questioning “an antisemitic inquiry” in a statement.\n\n“I have heard from too many being asked similar questions over many years and I can speak from personal experience,” he added.\n\nHarris and Shapiro have known each other for 20 years, since they were part of the same fellowship for up-and-coming politicians, but they were never close. That relationship only got rockier over the vetting process, with aides at the time complaining about each other. Harris took some shots at him in her post-election memoir; he responded that she was lying.\n\nWith both now looking at potential 2028 presidential runs, another moment clearly reverberated for Shapiro too.\n\n“Could she win Pennsylvania without me? she asked. Maybe, I said. I didn’t really know,” he writes.\n\nHarris picked Minnesota Gov. Tim Walz instead. She lost Pennsylvania by about 120,000 votes.\n\nBy Edward-Isaac Dovere","url":"https://www.ctvnews.ca/world/article/shapiro-says-harris-vetting-team-asked-whether-he-was-an-agent-of-the-israeli-government/","image":"https://www.ctvnews.ca/resizer/v2/A5FMOM2Y75F7TCRAQN4GI4BEQM.JPG?auth=f9873f926121e39b1992ce812701826c79cef1f0986dbb9f799729a9e83b7ead","video":null,"publish_date":"2026-01-19 13:56:42","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.353},{"id":394144698,"title":"'Double agent for Israel': Pennsylvania governor Josh Shapiro drops bombshell about Kamala Harris campaign","text":"When Pennsylvania governor Josh Shapiro revealed that he was asked whether he had ever been a “double agent for Israel” during the 2024 vice-presidential vetting process, it was not just an explosive anecdote. It became a window into the internal anxieties of the Democratic Party at a moment when it was deeply divided over identity, foreign policy, and electoral pragmatism.Shapiro’s disclosure, drawn from his forthcoming memoir, landed with particular force because it cut across three unresolved Democratic debates: how Jewish Democrats are treated within the party, how the Gaza war reshaped campaign decision-making, and whether the party misread what it needed in a bruising national contest against Donald Trump and his running mate JD Vance.This is not simply a story about one offensive question. It is about how a campaign’s internal logic may have sidelined one of its most electorally effective figures — and whether that decision cost Democrats dearly.The question that changed the toneAccording to Shapiro, the vice-presidential vetting process took a sharp turn when Harris’s team began pressing him repeatedly on Israel. The questioning culminated in a blunt and, in his telling, deeply unsettling query: had he ever acted as an agent, or even a “double agent,” for Israel?Shapiro writes that he pushed back immediately, calling the question offensive and absurd. What troubled him more than the question itself was what it suggested about the assumptions being made. He wondered whether similar scrutiny was being applied to non-Jewish contenders, or whether he was being treated as a unique risk because of his identity and his outspoken criticism of antisemitism on US college campuses after the October 7 attacks.Importantly, Shapiro has been careful not to accuse Kamala Harris herself of antisemitism. His criticism is directed instead at the culture and instincts of the campaign apparatus around her. But the damage was done. The episode reinforced a perception that, at a moment of intense pressure from the party’s progressive flank over Gaza, Jewish politicians who were publicly firm about antisemitism had become liabilities rather than assets.What Harris’s camp was worried aboutFrom Harris’s perspective, the concern appears to have been political, not personal. In her own memoir, she alludes to worries about how Shapiro’s record on Israel and campus protests might dampen enthusiasm among younger and progressive voters already alienated by US policy in Gaza. She also suggests that Shapiro might have struggled to accept the constraints of the vice-presidential role, hinting at differences in temperament and expectations.Taken together, these explanations point to a campaign operating in defensive mode. The Harris team was trying to hold together a fragile coalition that included pro-Palestinian activists, progressive lawmakers, and a Democratic base increasingly sceptical of US support for Israel. In that environment, Shapiro’s clarity on antisemitism and law-and-order issues looked, to some strategists, like a risk.The irony is that these very qualities had made Shapiro one of the party’s most successful statewide politicians.Why Shapiro was electorally valuableShapiro was not just another governor on the shortlist. He was the governor of Pennsylvania — the ultimate swing state — with a proven ability to win over moderates, independents, and even some Republican voters. He had built a reputation as a disciplined communicator, a tough but careful executive, and a Democrat who could speak fluently about public safety without alienating the base.In a race that ultimately came down to razor-thin margins in a handful of battleground states, Shapiro represented something Democrats have often struggled to find: a figure who could bridge cultural divides without sounding scripted or apologetic.Just as importantly, he was a sharp debater. Comfortable with policy detail and adversarial questioning, Shapiro had spent years handling hostile legislatures, court battles, and national media scrutiny. That skill set mattered more than many in the party were willing to admit.The Walz pick and the debate problemInstead of Shapiro, Harris chose Tim Walz, a likeable Midwestern governor with a folksy style and a solid progressive record. The rationale was clear: Walz was seen as less polarising, less threatening to the party’s activist base, and more aligned with Harris’s political instincts.But the vice-presidential debate exposed the limits of that choice.Walz was earnest and disciplined, but he struggled to match JD Vance’s fluency and aggression. Vance, a trained lawyer and seasoned culture-war combatant, repeatedly dictated the terms of the exchange, forcing Walz into defensive explanations rather than offensive challenges. While the debate did not produce a single catastrophic moment, it reinforced a broader impression that Democrats were being outmanoeuvred rhetorically.This is where the counterfactual becomes unavoidable. Shapiro, with his prosecutorial instincts and comfort with confrontation, would almost certainly have taken a more assertive approach. He had the ability to expose inconsistencies, press vulnerabilities, and turn policy arguments into moral ones — a skill Vance used to great effect.Identity, Gaza, and internal party fearAt the heart of the Shapiro episode is a deeper Democratic unease about identity politics in the post-Gaza landscape. The party has long prided itself on being a broad church, but the Israel-Hamas war fractured that coalition in unprecedented ways. Jewish Democrats found themselves under pressure to qualify their positions, while Muslim and progressive activists demanded sharper breaks from traditional US policy.Rather than confronting those tensions head-on, the Harris campaign appeared to manage them through risk avoidance. That meant steering away from candidates who might provoke internal backlash, even if those candidates offered clear electoral advantages.Shapiro’s experience suggests that, in moments of crisis, the party’s commitment to pluralism can give way to a narrower calculus driven by fear of social media outrage and activist discontent.What the episode reveals about Democratic decision-makingThe question Democrats now have to ask is not whether the “double agent” question was inappropriate — most agree that it was — but what it symbolises.It symbolises a campaign that prioritised internal harmony over external combativeness. It symbolises a reluctance to trust voters with complexity, opting instead to manage perceptions through candidate selection. And it symbolises a broader discomfort with leaders who do not fit neatly into ideological boxes.Shapiro’s sidelining did not lose Democrats the election on its own. But it reflects a pattern of cautious, inward-looking choices that left the party poorly equipped for a brutal general election fight.The larger lessonAs Democrats look ahead to the next cycle, the Shapiro episode will linger as a cautionary tale. Winning national elections requires more than avoiding offence. It requires candidates who can argue, persuade, and withstand scrutiny from opponents who have no such inhibitions.The uncomfortable possibility is that, in trying so hard not to upset itself, the Democratic Party passed over one of its most effective political weapons — and paid the price for it.","url":"https://timesofindia.indiatimes.com/world/us/double-agent-for-israel-pennsylvania-governor-josh-shapiro-drops-bombshell-about-kamala-harris-campaign/articleshow/126685264.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126685295/126685295.jpg","video":null,"publish_date":"2026-01-19 13:36:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.214},{"id":394117174,"title":"Springsteen tells ICE to 'get the f--- out of Minneapolis,' slams 'Gestapo' tactics at concert","text":"Bruce Springsteen called out U.S. Immigration and Customs Enforcement (ICE) during a show in New Jersey on Saturday and told the agency to \"get the f--- out\" of Minneapolis, according to reports, dedicating a song to Renee Good. \"If you believe in democracy, in liberty, if you believe that truth still matters, that it’s worth speaking out, that it is worth fighting for, if you believe in the power of the law and no one stands above it, if you stand against heavily armed masked federal troops invading American cities and using Gestapo tactics against our fellow citizens, if you believe you don’t deserve to be murdered for exercising your American right to protest, then send a message to this president,\" Springsteen told the crowd, according to NJArts.net. Springsteen performed at the Light of Day festival in New Jersey on Saturday night. Quoting Minneapolis Mayor Jacob Frey, he added, \"and as the mayor of that city has said, ‘ICE should get the f--- out of Minneapolis.'\" EX-NBC NEWS HOST CHUCK TODD LAMENTS DEMOCRATIC PARTY A 'COLLECTION OF PEOPLE THAT DON'T LIKE TRUMP' The rock legend went on to dedicate his song \"The Promised Land\" to Renee Good, who was fatally shot by an ICE agent in Minneapolis earlier this month. \"So this one is for you, and the memory of the mother of three and American citizen Renee Good,\" Springsteen said. Springsteen, a longtime Democrat, has campaigned for then-Vice President Kamala Harris in 2024, then-candidate Joe Biden in 2020, former Secretary of State Hillary Clinton in 2016 and President Barack Obama in 2012 and 2008. SPRINGSTEEN SAYS DEMS TOO FAR-LEFT FOR AMERICA, BUT TRUMP STILL BELONGS IN 'TRASH HEAP OF HISTORY' In a September interview with Time magazine, Springsteen said he is among several left-leaning figures who believe the Democratic Party has lost touch with everyday Americans. \"We’re desperately in need of an effective alternative party or for the Democratic Party to find someone who can speak to the majority of the nation. There is a problem with the language that they’re using and the way they’re trying to reach people,\" he said. Time magazine noted the irony in that left-leaning Springsteen appeals to working-class fans while being wealthy, particularly as many of his core audience have \"flocked to Trump.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Springsteen criticized Trump during a June 2025 concert in Germany as well. \"The America that I love, the America that I sung to you about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration,\" he told the crowd during his set with the E Street Band. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Fox News' Alexander Hall contributed to this report.","summary":"Bruce Springsteen told ICE to &quot;get the f--- out&quot; of Minneapolis during a New Jersey concert on Saturday, criticizing federal tactics and defending protest rights.","url":"https://www.foxnews.com/media/springsteen-tells-ice-get-f-out-minneapolis-slams-gestapo-tactics-concert","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/01/bruce-springsteen-ice-nj.jpg","video":null,"publish_date":"2026-01-19 13:31:02","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":0.163},{"id":394181572,"title":"White House Warned CBS It Would 'Sue Your A-- Off' Over Donald Trump Interview","text":"The White House has warned CBS News it would sue the network if it edited an interview with President Donald Trump, a blunt legal ultimatum that underscores the administration's increasingly aggressive approach to press coverage.\n\nMoments after President Donald Trump's interview with anchor Tony Dokoupil in Michigan on 13 January 2026, press secretary Karoline Leavitt warned the network that any attempt to edit the footage would result in a massive lawsuit. 'If it's not out in full, we'll sue your a-- off,' Leavitt told CBS staffers, according to leaked audio obtained by The New York Times.\n\nThe threat highlights the administration's aggressive new strategy to bypass traditional editorial gatekeeping. While some CBS employees reportedly initially thought the remark was made in jest, the network took no chances, airing the full 13-minute segment later that night.\n\nLeavitt later defended the move, stating that the American people deserve to watch the President's interviews 'unedited' and with 'no cuts'.\n\nThe Shadow of Legal War: White House vs CBS\n\nThe administration's litigious posture is rooted in a previous battle. Trump recently settled a multi-billion-pound lawsuit against CBS over the alleged 'deceptive' editing of a 60 Minutes interview with Kamala Harris.\n\nThat settlement, tied to the merger between Paramount and Skydance Media, appears to have emboldened the White House to demand total control over how the President is presented on broadcast television.\n\nBy securing an unedited broadcast, the White House has effectively turned a standard news interview into a direct-to-consumer platform. This shift undermines the traditional role of news editors, who typically condense hours of footage into the most relevant soundbites.\n\nFor the Trump administration, however, any edit is viewed as a potential act of 'election interference' or 'media bias'.\n\nEconomic Jabs and the Future of Media Jobs\n\nBeyond the legal threats, the interview itself featured a combative Trump spar with Dokoupil over the 'hottest economy in the world'. In a characteristic display of brinkmanship, the President told the anchor that he would likely be out of a job, or at least earning a 'lesser salary', if the 2024 election had gone the other way.\n\nTrump also pointedly mentioned Dokoupil's new boss, David Ellison, the billionaire owner of Skydance Media, who recently acquired Paramount. 'Your boss, who's an amazing guy, might be bust, OK?' Trump suggested, implying that his administration's economic policies are the only thing keeping the media industry afloat.\n\nDokoupil maintained his composure, concluding the interview by stating he believed he would still have a job regardless of the election outcome. The President's parting shot, 'Yeah, but at a lesser salary, served as a final reminder of the power dynamics at play. As the administration continues to demand 'unfiltered' airtime, the very foundations of broadcast journalism are being tested by a White House that views an edit as a cause for war.\n\nOriginally published on IBTimes UK","url":"https://www.ibtimes.com/white-house-warned-cbs-it-would-sue-your-off-over-donald-trump-interview-3795630","image":"https://d.ibtimes.com/en/full/4640865/donald-trump.jpg","video":null,"publish_date":"2026-01-19 13:30:53","author":"The New York","authors":["The New York"],"language":"en","category":"politics","source_country":"us","sentiment":0.126},{"id":394224196,"title":"EXCLUSIVE: Trump’s Border Wins Can’t Overcome Economic Anxiety in Key Battleground, Poll Shows","text":"FIRST ON THE DAILY SIGNAL—New polling from North Carolina reveals that while President Donald Trump scores his highest marks on border security and immigration enforcement, economic anxiety is threatening to undermine the GOP’s efforts to retain a U.S. Senate seat in the battleground state.\n\nThe survey of 1,512 registered voters, conducted Jan. 12-15 by the League of American Workers, shows Trump underwater on nearly every economic metric.\n\nTrump’s approval rating on inflation sits at just 30%, with 59% disapproving. Overall economic performance fares only slightly better at 35% approval, while his handling of the budget and federal spending draws 34% approval against 53% disapproval.\n\nFor the first time in state history, there are more voters registered as Republicans (30.24%) compared to Democrats (30.21%). Most of North Carolina’s 7.7 million registered voters are unaffiliated (38.89%).\n\nThat might be an encouraging sign for Republican Michael Whatley, who is attempting to retain Sen. Thom Tillis’ seat for the GOP. But the polling tells a different story.\n\nCooper’s Commanding Lead\n\nDemocrat Roy Cooper, the state’s former governor, has a commanding 48% to 24% lead, with 27% still undecided.\n\nCooper remains popular with voters: 54% view him favorably compared to 31% unfavorably. A plurality has no opinion of Whatley: 43% said they weren’t sure, with 25% viewing him favorably and 32% unfavorably.\n\nVoters ranked health care as the highest priority for North Carolina’s next senator. It topped the list at 50%, followed by inflation at 43%, and economic growth at 31%.\n\nAfter serving two terms as North Carolina’s governor, Cooper entered the Senate race in July. Senate Majority Leader Chuck Schumer considers him as a top-tier recruit as he attempts to win control of the upper chamber from Republicans in November.\n\nWhatley, the former Republican National Committee chairman, received Trump’s endorsement. He previously led the state Republican Party.\n\nNow, as he makes a statewide run, Whatley is facing an electorate deeply concerned about the economy. The gap between Republican strength on immigration and weakness on the economy couldn’t be starker.\n\nTrump’s Strongest Marks\n\nTrump received 50% approval on border control and 44% on immigration enforcement—his only policy areas in positive or near-positive territory. But those numbers are overshadowed by voters’ economic concerns, with 76% citing grocery prices as a top inflation worry.\n\nThe political environment remains challenging for both parties.\n\nNearly six in 10 voters say the country is headed in the wrong direction, and independents are particularly pessimistic—just 32% believe things are on the right track.\n\nTrump’s overall approval in North Carolina stands at 39%, with 53% disapproving. In 2024, Trump won North Carolina by a margin of 51% to 47.8% for Democrat Kamala Harris.\n\nToday, Democrats fare even worse at 30% approval and 54% disapproval.\n\nComplex Terrain for GOP\n\nDespite the high disapproval for his party, Democrat Gov. Josh Stein enjoys 48% approval against 22% disapproval, a 26-point net positive.\n\nThe poll also reveals a sharp generational split on national security. Half of voters support U.S. disengagement from Ukraine if no peace deal is reached, and the divide by age is striking: Gen Z supports withdrawal by a 42-point margin, while seniors oppose it by 11 points.\n\nThe survey, conducted with a margin of error of plus or minus 2.7 percentage points, underscores the complex political terrain facing Republicans.","summary":"FIRST ON THE DAILY SIGNAL—New polling from North Carolina reveals that while President Donald Trump scores his highest marks on border security and immigration enforcement,... Read More\n\n\nThe post EXCLUSIVE: Trump’s Border Wins Can’t Overcome Economic Anxiety in Key Battleground, Poll Shows appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2026/01/19/exclusive-economy-remains-gops-biggest-vulnerability-in-north-carolina-new-poll-shows/","image":"https://www.dailysignal.com/wp-content/uploads/2026/01/260118_DonaldTrump.jpg","video":null,"publish_date":"2026-01-19 13:00:00","author":"Rob Bluey","authors":["Rob Bluey"],"language":"en","category":"politics","source_country":"us","sentiment":0.18},{"id":394256206,"title":"Trump’s greatest strength in 2024 is now a debilitating weakness: poll","text":"The United States 2024 presidential election was a real horserace, with GOP nominee Donald Trump ultimately defeating the Democratic nominee, then-Vice President Kamala Harris, by roughly 1.5 percent in the national popular vote. And according to polls, the economy — especially frustration over inflation — was the thing that did the most to give him a narrow victory in the end. \n\nBut a new CBS News/YouGov poll shows that what was Trump's greatest strength in 2024 is now a major weakness.\n\nThe poll, released on Sunday, January 18, found that 74 percent of Americans believe that Trump isn't focused enough on inflation.\n\nNJ Advance Media/NJ.com reporter Lauren Sforza explains, \"Despite Trump's promises to bring down costs, 76 percent of Americans said their income is not keeping up with inflation. Just 24 percent reported that their income was keeping up with inflation, according to the poll. Trump repeatedly pledged throughout his 2024 campaign to end inflation and lower the cost of living for Americans. However, Trump's widespread tariffs on imported goods have increased prices for U.S. consumers despite Trump claiming that it was boosting revenue for the country.\"\n\nCBS News/YouGov found that only 39 percent of Americans approve of Trump's handling of the economy, while his overall approval is at 41 percent.\n\nThe poll comes almost a year after Trump's return to the White House and nine and one-half months before the 2026 midterms.","summary":"The United States 2024 presidential election was a real horserace, with GOP nominee Donald Trump ultimately defeating the Democratic nominee, then-Vice President Kamala Harris, by roughly 1.5 percent in the national popular vote. And according to polls, the economy — especially frustration over inflation — was the thing that did the most to give him a narrow victory in the end. \n\nBut a new CBS News/YouGov poll shows that what was Trump's greatest strength in 2024 is now a major weakness.\n\nThe poll, released on Sunday, January 18, found that 74 percent of Americans believe that Trump isn't focused enough on inflation.\n\nNJ Advance Media/NJ.com reporter Lauren Sforza explains, \"Despite Trump's promises to bring down costs, 76 percent of Americans said their income is not keeping up with inflation. Just 24 percent reported that their income was keeping up with inflation, according to the poll. Trump repeatedly pledged throughout his 2024 campaign to end inflation and lower the cost of living for Americans. Howeve","url":"https://www.alternet.org/trump-inflation-yougov/","image":"https://www.alternet.org/media-library/image.jpg?id=62832305&width=1200&height=600&coordinates=0%2C167%2C0%2C167","video":null,"publish_date":"2026-01-19 12:50:58","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","source_country":"US","sentiment":-0.267},{"id":394117166,"title":"Josh Shapiro claims Kamala Harris' team asked if he was a 'double agent for Israel'","text":"Pennsylvania Gov. Josh Shapiro claimed that former Vice President Kamala Harris' election team asked whether he was an \"agent of the Israeli government\" while discussing his potential as a vice presidential candidate. In a preview for Shapiro's upcoming book, \"Where We Keep the Light,\" published Sunday, The Atlantic reported a section devoted to what he described as \"unnecessarily contentious\" questions from Harris' team — particularly former Biden aide Dana Remus. One question he said he received during the vetting process included: \"Have you ever been an agent of the Israeli government?\" JOSH SHAPIRO DEFENDS CLAIM THAT KAMALA HARRIS TRYING TO ‘COVER HER A--’ WITH CRITICAL BOOK EXCERPT \"Had I been a double agent for Israel? Was she kidding? I told her how offensive the question was,\" Shapiro wrote. \"Remus was just doing her job. I get it. But the fact that she asked, or was told to ask that question by someone else, said a lot about some of the people around the VP,\" he added. Shapiro described further probing about his views on political topics — such as whether he'd be willing to \"apologize for some of his comments about protesters at the University of Pennsylvania who had built encampments to decry Israel’s military campaign in Gaza and, in some cases, intimidated Jewish students.\" \"It nagged at me that their questions weren’t really about substance,\" Shapiro wrote. \"Rather, they were questioning my ideology, my approach, my world view.\" RACHEL MADDOW REGRETS NOT PRESSING KAMALA HARRIS MORE DURING INTERVIEW ABOUT '107 DAYS' MEMOIR The Pennsylvania governor added that he eventually decided against becoming Harris' running mate after Remus suggested the position \"might be a financial burden for him and his wife.\" \"Are you trying to convince me not to do this?\" Shapiro wrote. Harris' team and Remus did not immediately respond to Fox News Digital's request for comment. Harris criticized Shapiro in her own book, \"107 Days,\" claiming that he wanted to be involved with every decision and that she needed to remind him \"a vice president is not a co-president.\" JOSH SHAPIRO SAYS HARRIS IS 'GOING TO HAVE TO ANSWER' FOR WHY SHE NEVER RAISED CONCERNS OVER BIDEN'S HEALTH In interviews following the book's publication, Shapiro called the accusation \"complete and utter bull----.\" \"I mean, she’s trying to sell books and cover her a--,\" he said, before backtracking. \"I shouldn’t say ‘cover her a--.’ I think that’s not appropriate.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"She’s trying to sell books. Period,\" he concluded.","summary":"Pennsylvania Gov. Josh Shapiro wrote that he was asked whether he was an &quot;agent of the Israeli government&quot; by former Vice President Kamala Harris&apos; vetting team.","url":"https://www.foxnews.com/media/josh-shapiro-claims-kamala-harris-team-asked-he-double-agent-israel","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/shapiro-harris-book-1.jpg","video":null,"publish_date":"2026-01-19 12:38:06","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"us","sentiment":0.131},{"id":394233516,"title":"Karoline Leavitt Threatens To Sue CBS Over Editing Trump’s Interview — Demands Full Release","text":"Donald Trump’s love to present himself as the perfect President on television is a well-known fact. Trump loves the camera on him, and it is only natural that his administration also does its best to ensure that the President is always portrayed in a favorable light.\n\nKeeping in line with the thought, Press Secretary Karoline Leavitt recently threatened CBS News’ Tony Dokoupil and executive producer Kim Harvey over the former’s interview with Trump. She asked the duo to make sure the interview is released as a whole.\n\nIn the audio evidence, which was first obtained by The New York Times, Leavitt can be heard saying, “He said, ‘Make sure you guys don’t cut the tape. Make sure the interview is out in full.’ … He said, ‘If it’s not out in full, we’ll sue your a– off.” \n\nDokoupil also could be heard on the audio, saying, “Yeah, we’re doing it, yeah.” He also humorously added, “He always says that!” referring to Trump and his recurrent threats to the media.\n\nLeavitt was reached out by The New York Times to comment on the audio and the demands made, to which she said, “The American people deserve to watch President Trump’s full interviews, unedited, no cuts.”\n\nView this post on Instagram\n\nThe channel, however, aired the full interview, which they clarified was their intention all along and was not a result of the Trump administration’s threat. In a statement on Saturday, the company said, “The moment we booked this interview, we made the independent decision to air it unedited and in its entirety.”\n\nThe interview with CBS focused on a huge range of topics including protests happening in Iran to the criminal investigation into Jerome Powell, the Federal Reserve Chair.\n\nThe President also warned that the US “will take very strong action” if Iran hangs protesters. Moreover, a The Guardian reported, “He also called Jerome Powell a ‘lousy’ US Federal Reserve chairperson and defended the actions of the ICE agent who fatally shot Renee Good in Minneapolis on 7 January.”\n\nIt is important to note here that Paramount Skydance now controls CBS and the network agreed to a $16m settlement with Trump in July for editing a 60 Minutes interview with Trump’s 2024 opposition, Kamala Harris.\n\nThe interview aired before the race and Trump had filed a lawsuit, claiming the segment was edited to “confuse, deceive, and mislead the public.”\n\nCBS countered that the answers were edited only for time, a customary practice in television journalism, but nonetheless settled what many believed was an exceedingly “winnable case,” as The Guardian reported. \n\nWow this is an audio recording of Karoline Leavitt threatening to sue CBS News if they don’t air Trump’s Interview in Full! So they think they can just threaten and sue anyone for anything now! 🤬 pic.twitter.com/aXqWjpZfl8\n— Suzie rizzio (@Suzierizzo1) January 18, 2026\n\nLeavitt’s threats would have been shocking if this was happening under any other Presidency. However, under Trump’s governance there have been multiple instances of the administration suing and getting into fights with media houses that essentially do not align with their ideologies or date question them.\n\nTrump has personally spoken against comedians and the networks that broadcast their shows if they showed courage enough to critique him. Therefore, it is only natural that his Press Secretary is openly threatening media personalities over featuring a full interview of the President without any cuts, even if they are required in regard to TV journalism.","summary":"Trump administration threatens CBS over unedited presidential interview release.","url":"https://www.inquisitr.com/karoline-leavitt-threatens-to-sue-cbs-over-editing-trumps-interview-demands-full-release","image":"https://www.inquisitr.com/wp-content/uploads/2026/01/Leavitt-threatened-CBS-News.jpg","video":null,"publish_date":"2026-01-19 12:02:50","author":"Pramila Tripathi","authors":["Pramila Tripathi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.049},{"id":394112272,"title":"‘I was afraid for my life’: the transgender refugees fleeing Trump’s America","text":"Ter Apel, a small, unassuming Dutch town near the German border, is a place tourists rarely have on their itinerary. There are no lovely old windmills, no cannabis-filled coffee shops and on a recent visit it was far too early for tulip season.\n\nWhen foreigners end up there, it is for one reason: to claim asylum at the Netherlands’ biggest refugee camp, home to 2,000 desperate people from all around the world.\n\nSome, like the Eritreans and Somalis, are fleeing war; the Syrians insist it remains unsafe for them to return home after the fall of Assad. But in the last year they have been joined by a curious new cohort: a bunch of Americans, who say they have feared for their lives ever since Donald Trump returned to the White House.\n\nTheir presence has surprised many of the camp’s residents. “My dream is to go to America or the UK. America for me is the paradise,” said Usama, a 21-year-old Libyan-Algerian hanging around the main gate. “You can work, you can make a million if you have a good idea. Why they come here?”\n\nIt is a fair question. Last year, 76 Americans claimed asylum in the Netherlands, according to the Dutch asylum and immigration ministry, up from nine in 2024. Unlike the UK, the Netherlands does not rent out hotels or houses for asylum seekers, instead housing them in fenced-off camps, officially called reception centres, dotted around the country.\n\nMany of the American refugees, like Jane-Michelle Arc, a 47-year-old software engineer from San Francisco, are transgender. In April last year she flew into Schiphol airport in Amsterdam and, sobbing, asked a customs officer how to claim asylum. “And they laughed because: what’s this big dumb American doing here asking about asylum? And then they realised I was serious.”\n\nArc said the US had become such a hostile environment for trans people that she had stopped leaving the house “unless there was an Uber waiting outside”. She said she had been abused on the street and using the ladies’ toilets, and resolved to leave the country after a frightening incident when she feared a woman was going to run her over with her truck.\n\nThe customs officer gave her a train ticket to Ter Apel and told to report to the Immigration and Naturalisation Service (IND). The first few days were hard, holed up in a 2 metre-square room covered with graffiti and what she feared were body fluids on the walls. In some ways she was lucky to be indoors: at least once in recent years the camp has been so overcrowded that new arrivals have had to sleep in tents outside.\n\nTer Apel is not a prison, but it looks a little bit like one, surrounded by fences, with guards on every gate. Residents are free to come and go but must be in their rooms each morning for a bed check. After their first few days in the central reception area, asylum seekers are dispersed to different low-rise blocks, where they are given a small food allowance so they can cook their own meals.\n\nFor Arc, that meant being transferred to what she calls “the queer block”, rather like a student halls of residence where all the LGBT asylum seekers are placed. There, she insists, sharing meals in the communal kitchens and over cigarettes outside, she found common ground.\n\nThey all feared the police as well as their governments and fellow citizens, she said. “We were in danger from the people around us. And in fact, all of us thought of America as a place we wanted to live in – a beautiful country of opportunities. And that’s all still true, but it was surprising and sad and validating that the people there – a trans dude from Tehran and a trans woman from Libya – our stories were so similar.”\n\nArc knows how that might sound. “I hear a lot of people saying: ‘You are an idiot. You came here from America.’ People will tell me: ‘Did you think about moving to California?’ And then I say: ‘Well, I lived in San Francisco’ and then they go: ‘Oh, that’s a heaven for gay people.’ But it’s different for trans people, particularly for trans women, to the extent that my experience in San Francisco, robot taxis aside, was indistinguishable from [that of] the people that I knew from Libya and Iran and Morocco and Algeria.”\n\nTrans men are also unsafe in the US, according to Ashe Wilde, another American who has been living in Ter Apel since the end of October. He transitioned in 2019 and anti-trans hate has only grown since then, he said, particularly with the return of Trump, who was re-elected using the attack ad: “Kamala Harris is for they/them. Trump is for you.”\n\nIn his very first speech on inauguration day, Trump declared: “As of today, it will henceforth be the official policy of the US government that there are only two genders – male and female.” He signed an executive order denouncing “ideologues who deny the biological reality of sex”, which effectively erased federal recognition of transgender identities.\n\n“That was hugely shocking,” said Wilde, 40, “because Massachusetts is one of the most liberal states and one of states that’s really trying to preserve our identities across the queer spectrum, and I was still met with pushback.” People increasingly equated transgenderism with paedophilia, he said: “I was called a paedo and a groomer.” There were physical altercations too, he claimed.\n\nArc began to transition at the end of 2012, changing her ID to female the following year and having bottom surgery in Thailand in 2014. Yet Trump’s re-election meant no more anti-discrimination protections in their employment, housing, and healthcare. When her passport ran out, a new one would declare her a man again. So she left.\n\n“This is the dumbest thing I’ve ever done,” she said in a Ter Apel cafe. “And I did it because I was afraid for my life. I didn’t do this in secret. I talked to everybody I knew. I said: ‘I am planning to do this wildly stupid thing.’ Everybody said: ‘I don’t love this for you, but there is no other option.’”\n\nShe could have applied for a tech job in the Netherlands and then a work visa. But that would have taken too long, she said. Hence choosing the nuclear option of asylum, leaving everything behind to live in a grubby refugee camp. She estimates there are between 35 and 50 other trans asylum seekers from the US in the Netherlands, though the Dutch government does not keep statistics on transgender applicants.\n\nThe chances of Americans actually being granted asylum are very low, according to Marlou Schrover, a professor of economic and social history at Leiden University, who studies the Dutch immigration system.\n\nThe UN refugee convention has very strict conditions, said Shrover. Not only must a refugee prove that they faced persecution in their home country, but they must also show that they tried to get help from the local authorities but were denied protection. “And after that, you have to see if there is a safe flight alternative within your country.”\n\nEven getting beaten up by the police is not enough: “Of course Afro-Americans might say: ‘Look, I’m beaten up in the street by police officers, so I can claim refugee status in the Netherlands’ based on this. So the claim has to be really strong.”\n\nFor a claim to be successful, the US would have to start detaining trans people for their gender identity, suggested Shrover: “If the US moves towards putting people in prison, treating them really, really bad because of their [gender identity], and with no other claim added to the reasons why they’re in prison, then the situation would definitely change.” But simply denying someone the right to put their chosen gender on their passport is nowhere near enough, she added.\n\nThe Dutch authorities are also very wary about declaring the US an unsafe country and provoking Trump, said Shrover. They think: ‘How will it look? How will the Americans respond to that? We can’t do this to our most important ally, saying that they don’t have a functioning democracy.’”\n\nOnly in exceptional cases have US passport holders been granted asylum, according to the Dutch ministry of asylum and migration. In recent years “a few dozen” children with US passports have been granted asylum in the Netherlands, mostly dependents of Yemeni, Turkish, and Syrian parents, a government spokesperson said.\n\nSo far, no American has been successful since arriving during Trump’s second term. Among those refused and earmarked for deportation is Lisa Gayle Carter-Stewart, who fled Montana with her transgender teenager, 14-year-old Nox, last April.\n\n“It was automatically rejected because America is considered a safe country of origin,” said Carter-Stewart. “Nox even told the IND during their interview when they asked, what will you do if you have to return to America? Nox told them: ‘I will kill myself.’ None of that was considered in their decision-making process.”\n\nNox has tried to take their own life three times at Ter Apel, said Carter-Stewart. “They are not getting on well. Nox stays in our room 24-7. They don’t go outside, not even on sunny days.” Still, she insists, Nox doesn’t want to go home: “Nox has said they’re glad we’re not in the US any more.”\n\nEarlier this month, they were moved to a more family-friendly refugee camp near Leiden as they await their appeal hearing. “I would love if we did get a residence permit, and I could work again, and we could get back to living a normal life, and want them to feel like it’s OK for them to be themselves and to not feel judged every time they walk through a door,” she said.\n\nTrans women fear a terrible fate if they are sent back to the US, said Arc. “My guess is that re-entering the US, we would be detained by ICE, or customs, we would be put into detention with men, and then that would lead to us being harmed or killed. And the method of execution is incarceration. I don’t think that the US government wants to murder me specifically. I think that they don’t care if I am murdered, and I think they think that I deserve it if I’m murdered in custody.”\n\nFor Wilde, a forced return means a forced detransition. Access to hormones has already become fraught in the US, he said: “Come 2027, there won’t be access to it via government healthcare, so you’d only have it through private providers. So without the hormones, you’re basically forced to de-transition. I can’t go back to that … I’ve been free for the last five years, almost six years. I can’t imagine trying to stuff myself back into that person that I used to be … I don’t know about physically, but emotionally, mentally, spiritually, I would absolutely be dead.”","summary":"Fear, abuse and eroding rights for trans people have created a hostile environment in the US – can they claim asylum in the Netherlands?\n\n\nThe transgender refugees fleeing the US – podcast\n\n\n\nTer Apel, a small, unassuming Dutch town near the German border, is a place tourists rarely have on their itinerary. There are no lovely old windmills, no cannabis-filled coffee shops and on a recent visit it was far too early for tulip season.\n\nWhen foreigners end up there, it is for one reason: to claim asylum at the Netherlands’ biggest refugee camp, home to 2,000 desperate people from all around the world.\n\n Continue reading...","url":"https://www.theguardian.com/world/2026/jan/19/i-was-afraid-for-my-life-the-transgender-refugees-fleeing-trumps-america","image":"https://i.guim.co.uk/img/media/22c295c8f42ddfe8d52464b3210a261f265bb4bc/560_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2026-01-19 12:00:23","author":"Eli Block,Helen Pidd","authors":["Eli Block","Helen Pidd"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.355},{"id":394226550,"title":"Trump was right about price controls, until he embraced them","text":"Brian Albrecht is chief economist at the International Center for Law & Economics and co-writes the newsletter Economic Forces.\n\nOn the 2023 campaign trail, Vice President Kamala Harris’s first major economic speech included proposing a ban on so-called “price gouging.” Jason Furman, a top economist in the Obama administration, said it was “not sensible policy.” As economists across the political spectrum will tell you, capping prices would discourage new companies from ramping up supply, invariably creating shortages. Donald Trump called the plan “SOVIET Style price controls.” He was right, if overly dramatic.","url":"https://www.washingtonpost.com/opinions/2026/01/19/price-contols-rent-caps-trump/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RDA7QDK6ARGHNFXXJ7TC7OZLPM.jpg&w=1600&h=900","video":null,"publish_date":"2026-01-19 11:00:31","author":"Brian Albrecht","authors":["Brian Albrecht"],"language":"en","source_country":"us","sentiment":0.027},{"id":394269514,"title":"Racism Is The Only Campaign Promise Trump Has Kept","text":"When Donald Trump most recently ran for president, he made scores of promises to the American people — but he’s only kept one.\n\nIn 2024, political pundits and operatives saw affordability as the key issue of the presidential campaign. Trump certainly played it up: On the campaign trail, he pledged that he would bring down inflation and make groceries cheaper again, and when he won, observers credited that strategy for his victory. \n\nOne year into his second term, his approval numbers are in the tank, and inflation persists.\n\nBut that’s because the president’s real campaign promise wasn’t about the economy. Instead, it was all about racism. \n\nHe spouted dehumanizing lies about immigrants, dabbled in eugenics and pledged to conduct mass deportations. “When I win on November 5, the migrant invasion ends, and the restoration of our country begins,” Trump said at a rally in October 2024.\n\nWhen he got back to the White House, he immediately began delivering on both the explicit promises and the tacit implications.\n\nIn the last year, Trump has deported immigrants without so much as a trial, defunded government programs dedicated to diversity and inclusion, and deployed thousands of federal agents to blue cities to wreak havoc on people of color and their allies. \n\n“This is the government weaponizing the social and political views of the president,” William Roberts, the senior vice president for rights and justice at the Center for American Progress, a think tank that promotes liberal policies, told HuffPost.\n\n“It’s not just ‘Donald Trump is a racist,’” Roberts said. “It’s Trump’s government engaging in policy-making to harm certain people.”\n\nThere has been a clear through-line between Trump’s campaign rhetoric and the worst excesses of his second term: During the 2024 presidential campaign, a viral claim about Haitians in Springfield, Ohio — where approximately 10,000 Haitians had arrived in recent years — also caught Trump’s attention. He repeated the racist rumor during a presidential debate with his Democratic opponent Kamala Harris.\n\n“In Springfield, they’re eating the dogs,” Trump said. “The people that came in, they’re eating the cats. They’re eating the pets of the people that live there.”\n\nTrump’s running mate, JD Vance, repeated the rumor and added claims of his own, including saying Haitians were bringing diseases to Ohio. But Vance also essentially admitted that he was lying.\n\n“If I have to create stories so that the American media actually pays attention to the suffering of the American people, then that’s what I’m going to do,” he said in a September 2024 interview with CNN.\n\nSuddenly, Haitian immigrants across the U.S. were targets. Springfield, Ohio, school children were subjected to bomb threats, and in small towns in Pennsylvania and Alabama with significant Haitian populations, residents worried for their safety.\n\nThe fact that Trump faced no consequences and instead was rewarded with another shot at the presidency has enabled even more blatant lies about marginalized, often immigrant, populations — with deadly results.\n\nIn December 2025, a viral video alleging fraud at Somali-run day cares in the Minneapolis area caught the attention of the Trump administration. Nick Shirley, the right-wing agitator who made the video, claimed that he had uncovered $100 million worth of fraud. (Minnesota officials investigated his claims and, during surprise inspections, found that all the day cares featured in his videos were operating as expected.) But still, Trump sent federal officers to “investigate.”\n\nBefore the surge of federal agents into Minnesota, Trump had been referring to Somalis, including Rep. Ilhan Omar (D-Minn.), as “garbage.”\n\n“We could go one way or the other, and we’re going to go the wrong way if we keep taking in garbage into our country,” he said at a Cabinet meeting last November.\n\nBut as president, Trump doesn’t merely have to pay lip service to racist internet rumors. He can use the full force of the federal government. \n\nThe Department of Homeland Security deployed thousands of immigration agents to Minneapolis, which has the largest Somali population in the U.S. Just two days into what DHS referred to as its largest immigration operation ever, 37-year-old Renee Good, a white mother of three who appeared to be engaging in protest, was shot and killed by Jonathan Ross, an Immigration and Customs Enforcement officer, while sitting in her car. \n\nShe was only the latest person to be shot by federal officers — joining people like Kevin Porter, who was fatally shot in Los Angeles, and Marimar Martinez, who survived a shooting in Chicago — but her death sparked widespread protests in Minneapolis and beyond. \n\nICE doubled down after Good was killed. Federal agents have been spotted all over Minneapolis, targeting people, dragging them from their cars and using pepper spray and other chemical irritants. The city’s public school system shut down for two days and is now offering remote learning for any families who are too fearful to send their children to school.\n\nAnd the government does not make any secret of the philosophy behind the crackdown. The official X account of the Department of Homeland Security regularly posts memes and songs popular with white nationalists and Nazis.\n\n“Calling everything you dislike ‘Nazi propaganda’ is tiresome,” a DHS spokesperson told HuffPost in an emailed statement. “DHS will continue to use all tools to communicate with the American people and keep them informed on our historic effort to Make America Safe Again.”\n\n“The administration wants this country to be more white,” Seth Levi, the chief strategy officer at the Southern Poverty Law Center, told HuffPost. “These are white nationalist beliefs that we’ve seen in the fringes going back decades but it’s becoming mainstream thought by the administration.”\n\nIn Los Angeles, Chicago, Washington, D.C., and Charlotte, immigrant communities and their allies have also been subjected to an unprecedented blitz, all previewed by Trump on the campaign trail.\n\nIn 2024, Trump said that Aurora, Colorado, a Denver suburb, was a “war zone” being run by members of Tren de Aragua, a Venezuela-based criminal organization. But even Republican officials in the city said that the claims were false and that Aurora was safe for families.\n\n“It’s like an invasion from within, and we’re going to have the largest deportation in the history of our country,” Trump said in September of that year. “And we’re going to start with Springfield and Aurora.”\n\nTrump continued on with the fiction in his second term by targeting Latino men across the country and accusing them of being gang members, even if the evidence was thin. In March, the Department of Homeland Security sent hundreds of mostly Venezuelan men to a prison in El Salvador known for its human rights abuses. The men had not received trials or sentences, and many had no criminal records. \n\nWhen advocates filed a lawsuit accusing immigration officers of illegally targeting people based on their race, the Supreme Court — where a full one-third of the justices have been appointed by Trump — ruled 6-3 to allow it. Ethnicity, wrote Justice Brett Kavanaugh in his opinion, “can be a ‘relevant factor’ when considered along with other salient factors.”\n\nBeyond the violence that Trump has the power to enable as president, there are trickle-down effects. \n\n“It does create a permission structure to say these things out in the open,” Levi said. “These aren’t new feelings or beliefs, but people used to recognize them as taboo and kept them to themselves.”\n\nThere’s evidence that racist rhetoric from the upper echelons of government can influence the average American as well. Hateful and bigoted rhetoric online increased after the 2024 election, and a December 2025 Gallup poll found that most Americans believe that political rhetoric has gone too far. \n\nAs Trump ramps up his deportation efforts, everyday people are trying to aid him. There have been multiple instances of people publicly helping deportation officers, including by directing them toward immigrants.\n\n“Jim Crow wasn’t held up only with policy but also by regular people,” Roberts said, referring to the set of racially discriminatory laws, violence and social structures that oppressed Black people in the U.S. South for nearly 100 years after the abolition of slavery.\n\nIn many ways, it may be too late to put this genie back in the bottle. Immigration enforcement is only the most visible and most recent manifestation of the administration’s agenda. \n\nDuring his first days in office, Trump signed an executive order banning diversity, equity and inclusion in the federal government. The administration quickly went to work to fire employees who did diversity work and dismantle programs that didn’t align with their worldview.\n\nAlthough the executive order didn’t apply to private companies, leaders in the sector followed suit and began pulling back from their DEI pledges as well.\n\nThe assault on the government dealt an especially big blow to Black workers, who are overrepresented as federal employees because public sector jobs have been traditionally more welcoming to people of color.\n\nTrump also signed orders that dismantled DEI in K-12 public schools and higher education institutes, while demanding elite colleges turn over their race and admissions data. The administration has been using allegations of antisemitism or claims race is being illegally used as an admissions factor to pressure schools into favoring a more right-wing agenda, even as it puts similar pressures on students themselves. Thousands of international students have lost their ability to study in the U.S. \n\nAnd DHS officials began targeting college students with opinions it didn’t like, including Mahmoud Khalil, a Columbia University graduate student who led pro-Palestinian protests on campus and was arrested over his beliefs last March.\n\nIt’s all happening with at least the excuse, if not genuine belief, that Trump has a mandate from the people. He made it very clear throughout his campaign that mass deportations, demonizing the other and accepting bigotry would dominate his second term. \n\nThis is what they voted for. And that is what has happened.\n\n“It’s really emboldening people to treat folks however they want to,” Roberts said. “[His policies] will resurrect a lot of the racial animus that has always lived in America.”\n\nDespite his lofty promises about the economy, affordable groceries and ushering in a new golden age, there appears to be only one true constant of the Trump administration.\n\n“People sometimes have a tendency to overthink and overanalyze because we don’t want to accept the most obvious explanation that’s right in front of us,” Levi said. \n\n“But when the administration is tweeting out Nazi memes and songs, I don’t really think there’s a nuanced hot take on that,” he continued. “They’re being pretty clear about what some of their beliefs are.”","url":"https://www.huffpost.com/entry/trump-campaign-promise-racism_n_696aabbfe4b084474f12aded?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/696ab6dd1400000fb364c6f3.jpg?ops=1778_1000","video":null,"publish_date":"2026-01-19 11:00:17","author":"Nathalie Baptiste","authors":["Nathalie Baptiste"],"language":"en","category":"politics","source_country":"us","sentiment":-0.215},{"id":394119040,"title":"Racism Is The Only Campaign Promise Trump Has Kept","text":"When Donald Trump most recently ran for president, he made scores of promises to the American people — but he’s only kept one.\n\nIn 2024, political pundits and operatives saw affordability as the key issue of the presidential campaign. Trump certainly played it up: On the campaign trail, he pledged that he would bring down inflation and make groceries cheaper again, and when he won, observers credited that strategy for his victory. \n\nOne year into his second term, his approval numbers are in the tank, and inflation persists.\n\nBut that’s because the president’s real campaign promise wasn’t about the economy. Instead, it was all about racism. \n\nHe spouted dehumanizing lies about immigrants, dabbled in eugenics and pledged to conduct mass deportations. “When I win on November 5, the migrant invasion ends, and the restoration of our country begins,” Trump said at a rally in October 2024.\n\nWhen he got back to the White House, he immediately began delivering on both the explicit promises and the tacit implications.\n\nIn the last year, Trump has deported immigrants without so much as a trial, defunded government programs dedicated to diversity and inclusion, and deployed thousands of federal agents to blue cities to wreak havoc on people of color and their allies. \n\n“This is the government weaponizing the social and political views of the president,” William Roberts, the senior vice president for rights and justice at the Center for American Progress, a think tank that promotes liberal policies, told HuffPost.\n\n“It’s not just ‘Donald Trump is a racist,’” Roberts said. “It’s Trump’s government engaging in policy-making to harm certain people.”\n\nThere has been a clear through-line between Trump’s campaign rhetoric and the worst excesses of his second term: During the 2024 presidential campaign, a viral claim about Haitians in Springfield, Ohio — where approximately 10,000 Haitians had arrived in recent years — also caught Trump’s attention. He repeated the racist rumor during a presidential debate with his Democratic opponent Kamala Harris.\n\n“In Springfield, they’re eating the dogs,” Trump said. “The people that came in, they’re eating the cats. They’re eating the pets of the people that live there.”\n\nTrump’s running mate, JD Vance, repeated the rumor and added claims of his own, including saying Haitians were bringing diseases to Ohio. But Vance also essentially admitted that he was lying.\n\n“If I have to create stories so that the American media actually pays attention to the suffering of the American people, then that’s what I’m going to do,” he said in a September 2024 interview with CNN.\n\nSuddenly, Haitian immigrants across the U.S. were targets. Springfield, Ohio, school children were subjected to bomb threats, and in small towns in Pennsylvania and Alabama with significant Haitian populations, residents worried for their safety.\n\nThe fact that Trump faced no consequences and instead was rewarded with another shot at the presidency has enabled even more blatant lies about marginalized, often immigrant, populations — with deadly results.\n\nIn December 2025, a viral video alleging fraud at Somali-run day cares in the Minneapolis area caught the attention of the Trump administration. Nick Shirley, the right-wing agitator who made the video, claimed that he had uncovered $100 million worth of fraud. (Minnesota officials investigated his claims and, during surprise inspections, found that all the day cares featured in his videos were operating as expected.) But still, Trump sent federal officers to “investigate.”\n\nBefore the surge of federal agents into Minnesota, Trump had been referring to Somalis, including Rep. Ilhan Omar (D-Minn.), as “garbage.”\n\n“We could go one way or the other, and we’re going to go the wrong way if we keep taking in garbage into our country,” he said at a Cabinet meeting last November.\n\nBut as president, Trump doesn’t merely have to pay lip service to racist internet rumors. He can use the full force of the federal government. \n\nThe Department of Homeland Security deployed thousands of immigration agents to Minneapolis, which has the largest Somali population in the U.S. Just two days into what DHS referred to as its largest immigration operation ever, 37-year-old Renee Good, a white mother of three who appeared to be engaging in protest, was shot and killed by Jonathan Ross, an Immigration and Customs Enforcement officer, while sitting in her car. \n\nShe was only the latest person to be shot by federal officers — joining people like Kevin Porter, who was fatally shot in Los Angeles, and Marimar Martinez, who survived a shooting in Chicago — but her death sparked widespread protests in Minneapolis and beyond. \n\nICE doubled down after Good was killed. Federal agents have been spotted all over Minneapolis, targeting people, dragging them from their cars and using pepper spray and other chemical irritants. The city’s public school system shut down for two days and is now offering remote learning for any families who are too fearful to send their children to school.\n\nAnd the government does not make any secret of the philosophy behind the crackdown. The official X account of the Department of Homeland Security regularly posts memes and songs popular with white nationalists and Nazis.\n\n“Calling everything you dislike ‘Nazi propaganda’ is tiresome,” a DHS spokesperson told HuffPost in an emailed statement. “DHS will continue to use all tools to communicate with the American people and keep them informed on our historic effort to Make America Safe Again.”\n\n“The administration wants this country to be more white,” Seth Levi, the chief strategy officer at the Southern Poverty Law Center, told HuffPost. “These are white nationalist beliefs that we’ve seen in the fringes going back decades but it’s becoming mainstream thought by the administration.”\n\nIn Los Angeles, Chicago, Washington, D.C., and Charlotte, immigrant communities and their allies have also been subjected to an unprecedented blitz, all previewed by Trump on the campaign trail.\n\nIn 2024, Trump said that Aurora, Colorado, a Denver suburb, was a “war zone” being run by members of Tren de Aragua, a Venezuela-based criminal organization. But even Republican officials in the city said that the claims were false and that Aurora was safe for families.\n\n“It’s like an invasion from within, and we’re going to have the largest deportation in the history of our country,” Trump said in September of that year. “And we’re going to start with Springfield and Aurora.”\n\nTrump continued on with the fiction in his second term by targeting Latino men across the country and accusing them of being gang members, even if the evidence was thin. In March, the Department of Homeland Security sent hundreds of mostly Venezuelan men to a prison in El Salvador known for its human rights abuses. The men had not received trials or sentences, and many had no criminal records. \n\nWhen advocates filed a lawsuit accusing immigration officers of illegally targeting people based on their race, the Supreme Court — where a full one-third of the justices have been appointed by Trump — ruled 6-3 to allow it. Ethnicity, wrote Justice Brett Kavanaugh in his opinion, “can be a ‘relevant factor’ when considered along with other salient factors.”\n\nBeyond the violence that Trump has the power to enable as president, there are trickle-down effects. \n\n“It does create a permission structure to say these things out in the open,” Levi said. “These aren’t new feelings or beliefs, but people used to recognize them as taboo and kept them to themselves.”\n\nThere’s evidence that racist rhetoric from the upper echelons of government can influence the average American as well. Hateful and bigoted rhetoric online increased after the 2024 election, and a December 2025 Gallup poll found that most Americans believe that political rhetoric has gone too far. \n\nAs Trump ramps up his deportation efforts, everyday people are trying to aid him. There have been multiple instances of people publicly helping deportation officers, including by directing them toward immigrants.\n\n“Jim Crow wasn’t held up only with policy but also by regular people,” Roberts said, referring to the set of racially discriminatory laws, violence and social structures that oppressed Black people in the U.S. South for nearly 100 years after the abolition of slavery.\n\nIn many ways, it may be too late to put this genie back in the bottle. Immigration enforcement is only the most visible and most recent manifestation of the administration’s agenda. \n\nDuring his first days in office, Trump signed an executive order banning diversity, equity and inclusion in the federal government. The administration quickly went to work to fire employees who did diversity work and dismantle programs that didn’t align with their worldview.\n\nAlthough the executive order didn’t apply to private companies, leaders in the sector followed suit and began pulling back from their DEI pledges as well.\n\nThe assault on the government dealt an especially big blow to Black workers, who are overrepresented as federal employees because public sector jobs have been traditionally more welcoming to people of color.\n\nTrump also signed orders that dismantled DEI in K-12 public schools and higher education institutes, while demanding elite colleges turn over their race and admissions data. The administration has been using allegations of antisemitism or claims race is being illegally used as an admissions factor to pressure schools into favoring a more right-wing agenda, even as it puts similar pressures on students themselves. Thousands of international students have lost their ability to study in the U.S. \n\nAnd DHS officials began targeting college students with opinions it didn’t like, including Mahmoud Khalil, a Columbia University graduate student who led pro-Palestinian protests on campus and was arrested over his beliefs last March.\n\nIt’s all happening with at least the excuse, if not genuine belief, that Trump has a mandate from the people. He made it very clear throughout his campaign that mass deportations, demonizing the other and accepting bigotry would dominate his second term. \n\nThis is what they voted for. And that is what has happened.\n\n“It’s really emboldening people to treat folks however they want to,” Roberts said. “[His policies] will resurrect a lot of the racial animus that has always lived in America.”\n\nDespite his lofty promises about the economy, affordable groceries and ushering in a new golden age, there appears to be only one true constant of the Trump administration.\n\n“People sometimes have a tendency to overthink and overanalyze because we don’t want to accept the most obvious explanation that’s right in front of us,” Levi said. \n\n“But when the administration is tweeting out Nazi memes and songs, I don’t really think there’s a nuanced hot take on that,” he continued. “They’re being pretty clear about what some of their beliefs are.”","url":"https://www.huffpost.com/entry/trump-campaign-promise-racism_n_696aabbfe4b084474f12aded?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/696ab6dd1400000fb364c6f3.jpg?ops=1778_1000","video":null,"publish_date":"2026-01-19 11:00:17","author":"Nathalie Baptiste","authors":["Nathalie Baptiste"],"language":"en","category":"politics","source_country":"us","sentiment":-0.215}]}