{"offset":0,"number":50,"available":625,"news":[{"id":398777932,"title":"Bill &amp; Hillary Clinton agree to testify in House Epstein investigation ahead of contempt vote","text":"APFILE - Former President Bill Clinton, left, and former Secretary of State Hillary Clinton listen as Vice President Kamala Harris delivers a eulogy for U.S. Rep. Sheila Jackson Lee, Aug. 1, 2024, in Houston. \n\nFormer President Bill Clinton and Hillary Clinton, the 2016 Democratic ⁠presidential nominee, will testify in a congressional investigation into the late sex offender Jeffrey Epstein, a staffer said on Monday. The decision could ‌head off ‌a planned vote in the Republican-led House of Representatives to hold the ‌two prominent Democrats in contempt, which could lead to criminal charges.Budget 2026 Highlights: Here's the fine print The House Oversight Committee recommended last week that they be held in contempt for refusing to testify about their relationship with Epstein. The Clintons had offered to cooperate with the panel but had refused to appear in ‌person, saying ‍the investigation was a partisan exercise aimed ‍at protecting Republican President Donald Trump. \"They told you under ‌oath what they know, but you don't care. But the former President and former Secretary of State will be there. They look forward to setting a precedent that applies to everyone,\" the Clintons' deputy chief of staff, Angel Urena, said in a post on ‍social media. House Speaker Mike Johnson welcomed the news but did not say whether the chamber ‍would drop ⁠its planned ⁠contempt vote.Live Events \"That's a good development,\" he said. \"We expect everyone to comply with Congress's subpoenas.\" Bill Clinton flew on Epstein's plane several times in the early 2000s after leaving office. He has expressed regret about the relationship and said he knew nothing about Epstein's criminal activity.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onJeffrey Epstein investigationClintons testify in Epstein investigationBill Clinton Epstein relationshipHillary Clinton congressional testimonyEpstein criminal chargesHouse Oversight Committee contempt voteClintons cooperation with CongressMike Johnson House SpeakerDonald Trump\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onJeffrey Epstein investigationClintons testify in Epstein investigationBill Clinton Epstein relationshipHillary Clinton congressional testimonyEpstein criminal chargesHouse Oversight Committee contempt voteClintons cooperation with CongressMike Johnson House SpeakerDonald Trump","summary":"Former President Bill Clinton and Hillary Clinton will testify in a congressional probe concerning sex offender Jeffrey Epstein. This decision could prevent a contempt vote in the House of Representatives. The Clintons had previously refused in-person testimony, calling the investigation partisan. House Speaker Mike Johnson welcomed the development, expecting compliance with subpoenas.","url":"https://economictimes.indiatimes.com/news/international/global-trends/bill-hillary-clinton-agree-to-testify-in-house-epstein-investigation-ahead-of-contempt-vote/articleshow/127873732.cms","image":"https://img.etimg.com/thumb/msid-127873738,width-1200,height-630,imgsize-218770,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2026-02-03 01:01:37","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.286},{"id":398768228,"title":"Winning in Trump’s backyard and raking in money: Democrats begin 2026 with warning to Republicans","text":"A shock election victory for Democrats in deep-red Texas on Saturday is giving the opposition party a jolt of momentum to begin 2026 — a year that will decide the fate of Donald Trump’s twin congressional majorities, and possibly his presidency.\n\nDemocrats elsewhere are seeing other signs, too, that the various dynamics that kept voters at home or willing to consider voting for Trump in 2024 are shifting. Despite being shy of the majority, members in both chambers are brimming with optimism and are beginning to talk openly about the possibility of pulling off a clean sweep of the GOP in November.\n\nSaturday’s runoff election in the Fort Worth area put a northern Texas district that voted for Donald Trump by 17 points in 2024 into the hands (briefly) of a Democrat, Taylor Rehmet, who supports statewide rent stabilization, vows to halt the sale of public lands, and end charter school voucher programs. It’s a potential sign not only of the appeal of a message akin to Zohran Mamdani’s in what is thought of as a much more conservative area, but also the rejuvenation of the Democratic brand in the wake of Kamala Harris and Joe Biden’s campaign and administration.\n\nRehmet, who credited “everyday working people” in his victory speech, took money from the DNC during his election bid and was still outspent by his conservative opponent. His campaign, the Texas Tribune reported, began in part after Rehmet was introduced to a state representative who later became one of his top Latino backers at a fundraiser for the Harris campaign.\n\nThe lesson here is not that Texas has suddenly jolted blue, or that Sen. John Cornyn’s seat will change hands next year. The Texas Senate race remains favorable ground for Republicans, not least given that an ugly dispute between top Democrats vying for the seat emerged on Monday, endangering party unity and risking hurt feelings among the eventual loser’s camp. But evidence is growing to support the idea that Democrats have recaptured the enthusiasm and anger against the status quo one year into Trump’s second term, following a series of victories for the party in hotly contested statewide races.\n\nThat enthusiasm can be measured in more than just polling. It can also be measured in dollars, where Republicans are seeing their foes raise alarming sums in key races and putting their candidates at an early advantage. That reality is evident in Ohio, where Sherrod Brown is running laps around incumbent Republican Sen. Jon Husted in fundraising totals as he seeks his old job; Brown was a victim of the GOP-led wipeout in 2024. Sen. Jon Ossoff has a staggering fundraising lead of roughly $9m over any of his Republican competitors, according to Roll Call. \n\nAnd in Maine, both of Susan Collins’s would-be challengers outraised her in the last quarter of 2024, though the longtime incumbent retains a cash-on-hand advantage. The real success story in the race is Graham Platner, who is outraising both the sitting senator and sitting governor, Janet Mills, as he seeks the Democratic nomination. In Alaska, former Rep. Mary Peltola said she outraised incumbent GOP Sen. Dan Sullivan’s Q4 fundraising total in a single 24-hour period after launching her bid for Senate.\n\nIn short: Democrats are in the money. And the party’s leadership is even recovering from some of the malaise it suffered under through 2025, when leaders like Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries were faulted by some members for insufficient resistance to the Trump administration and Elon Musk’s DOGE initiative.\n\nJeffries was positively glowing on Monday as he spoke to reporters about the five congressional seats changed by Texas Republicans in a controversial mid-decade redistricting project aimed at giving the GOP more seats in the House: \"The Republicans done effed up in Texas and they know it.” He added that he saw a path for Democrats to win all five of the newly-drawn seats.\n\nHe added that Rehmet’s victory was “a shellacking for Republicans in Texas” over the weekend.\n\nDemocrats are clearly entering the 2026 primary season with optimism and the wind at the party’s back. In Washington, Trump’s mass deportation chaos is eroding support for Republicans on one of their strongest issues, while the party offers little in the way of a unified response on the issue of affordability.\n\nAnd last week, a Florida Republican congressman announced his impending retirement. It’s a reminder that, as troubling as the map looks for Republicans now, it could look a whole lot worse if more key GOP incumbents tire of abuse from the White House and the president.\n\n“We have a clear and strong path to winning back the Senate. A year ago, no one thought that,” the Democratic senate leader told Politico last month in an interview. Since January of 2025, a GOP incumbent in North Carolina, Thom Tillis, had a public break-up with Trump over the president’s legislative agenda and announced his plans to retire. Democrats are now favored to win his seat.\n\nHe added: “Our north star is winning the Senate. That’s what motivates what we do in each thing.”","summary":"Another win for Democrats in Trump territory comes as the party is building a number of powerful campaign war chests, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/texas-democrats-fundraising-republicans-midterms-b2912617.html","image":"https://static.independent.co.uk/2026/02/02/0/39/Election-2026-Texas-Legislature-doqdufvx.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/di2odxdc-4VHSaSK0.mp4","publish_date":"2026-02-02 23:55:11","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.114},{"id":398771676,"title":"'Get Ready': Trump to Sue Trevor Noah Over False 'Epstein Island' Claim","text":"🚨 NEW: Trevor Noah makes a defamatory joke about Trump going to Epstein’s Island: “What are you to do about it?”President Trump responds almost immediately saying he’s going to sue to sh!t out of him: “Get ready Noah, I’m going to have some fun with you!”🔥🍿🤣🤣 pic.twitter.com/djE6uyzAf9— Chief Nerd (@TheChiefNerd) February 2, 2026\n\nNOAH: That is a Grammy that every artist wants, almost as much as Trump wants Greenland. Which makes sense, I mean, because Epstein's island is gone. He needs a new one to hang out with Bill Clinton, so. Oh, I told you it's my last year. What are you going to do about it?\n\nAhem. Trump had never been to Epstein's Island, although Clinton has been rumored to have been there. In fact, it's not clear whether Epstein had the facilities for that kind of entertainment before his big construction push in 2007, well after Trump had stopped engaging with him in 2004. No evidence has emerged – either in records or in testimony – that Trump ever set foot on Little St. James Island while Epstein owned it. Not only has no evidence emerged for that speculation, but Trump has also repeatedly and publicly denied it whenever it came up. \n\nSo for the answer to Noah's question, Trump supplied the obvious answer on Truth Social:\n\nThe Grammy Awards are the WORST, virtually unwatchable! CBS is lucky not to have this garbage litter their airwaves any longer. The host, Trevor Noah, whoever he may be, is almost as bad as Jimmy Kimmel at the Low Ratings Academy Awards. Noah said, INCORRECTLY about me, that Donald Trump and Bill Clinton spent time on Epstein Island. WRONG!!! I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight’s false and defamatory statement, have never been accused of being there, not even by the Fake News Media. Noah, a total loser, better get his facts straight, and get them straight fast. It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$. Ask Little George Slopadopolus, and others, how that all worked out. Also ask CBS! Get ready Noah, I’m going to have some fun with you! President DJT\n\nOne has to wonder whether Noah will be the only respondent in a potential Trump lawsuit. The Recording Academy of America hired Noah to host the awards, and CBS broadcast them. They could share some liability for Noah's allegedly defamatory remarks if Trump wants to push it, and he's been wanting to \"push it\" ever since Democrats launched their warfare strategy to derail a return to the White House. CBS and Paramount have already paid Trump an estimated $16 million to settle an election-interference lawsuit over their cooked 60 Minutes interview with Kamala Harris, and ABC/Disney paid Trump another eight-figure settlement of about the same range for George Stephanopoulos' false claim that Trump had been convicted of rape. \n\nThese situations are not entirely analogous, however. Both CBS and ABC had to defend news reports, while Noah's remark was intended as comedy and entertainment. That doesn't create a full immunity from defamation, but it does change the legal framework for it. Jerry Falwell learned that the hard way in attempting to sue Hustler and Larry Flynt over a satirical Campari ad that depicted him as a drunkard who had sex with his mother in an outhouse. \n\nHowever, this too has an important caveat. In its unanimous ruling in Hustler Magazine v Falwell in 1988, the Supreme Court noted that the satire was broad enough to ensure that it did not lend itself to a serious factual claim. The final paragraph makes that distinction clear as to the adjudication of both defamation and of intentional emotional distress, bold emphases mine:\n\nHere it is clear that respondent Falwell is a \"public figure\" for purposes of First Amendment law. [Footnote 5] The jury found against respondent on his libel claim when it decided that the Hustler ad parody could not \"reasonably be understood as describing actual facts about [respondent] or actual events in which [he] participated.\" App. to Pet. for Cert. C1. The Court of Appeals interpreted the jury's finding to be that the ad parody \"was not reasonably believable,\" 797 F.2d at 1278, and, in accordance with our custom, we accept this finding. Respondent is thus relegated to his claim for damages awarded by the jury for the intentional infliction of emotional distress by \"outrageous\" conduct. But, for reasons heretofore stated, this claim cannot, consistently with the First Amendment, form a basis for the award of damages when the conduct in question is the publication of a caricature such as the ad parody involved here. The judgment of the Court of Appeals is accordinglyReversed.\n\nJustice Byron White also hit this point in his concurrence:\n\nAs I see it, the decision in New York Times Co. v. Sullivan, 376 U. S. 254 (1964), has little to do with this case, for here the jury found that the ad contained no assertion of fact.\n\nThis differentiates Noah's 'joke' from the Hustler Campari ad. No one really could believe that Falwell had sex with his mother in an outhouse, and so this crude joke didn't rise to the level of a factual claim that could be found false and defamatory. Noah, on the other hand, clearly made a joke based on a factual assertion that also intended to defame Trump (and Clinton, for that matter, assuming it's false with him as well). That negates the satire shield of Hustler Magazine v Falwell, because Noah's joke was not only not wrapped in recognizable and exaggerated satire, the claim was made for an audience who would find it \"reasonably believable.\" The point of Noah's remark would be to make that claim even more reasonably believable. \n\nWill that allow Trump to win a defamation suit against Noah et al? He'd still have to deal with the Sullivan doctrine, which also came up in the Falwell case. The Supreme Court's decision that no defamation took place negated any application of Sullivan, but since that doesn't apply here, it will become relevant in any action Trump takes. That was also true of Trump's lawsuit against ABC, though, and ABC/Disney tossed in the towel, perhaps in part to keep the case from potentially limiting or overturning Sullivan. However, given all of the debate over the Epstein files and Trump's connections to it, it would be tough for Noah to argue that he didn't deliberately lie or act with reckless disregard for the truth when claiming that Trump went to Epstein's island. And he would have to spend a lot of money on lawyers to fight on that basis. \n\nGet ready for a climbdown, in other words. I'd be surprised if it takes more than today before Noah starts backpedaling.","url":"https://hotair.com/ed-morrissey/2026/02/02/get-ready-trump-to-sue-trevor-noah-over-false-epstein-island-claim-n3811456","image":"https://media.townhall.com/cdn/hodl/2022/122/0433edcc-c74d-41a4-ae5e-863f3d29e071.jpg","video":null,"publish_date":"2026-02-02 23:40:00","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.359},{"id":398760500,"title":"Popular left-wing podcast hosts push conspiracy theory that Trump staged assassination attempt on himself","text":"Co-hosts of the \"I’ve Had It\" podcast on Saturday agreed in their belief that the assassination attempt on President Donald Trump’s life in Butler, Pennsylvania, was staged. Thomas Crooks opened fire at a Trump rally last year, firing eight shots, killing a man, critically wounding two others and grazing the president’s ear, according to authorities. Crooks, 20, killed a 50-year-old father of two named Corey Comperatore and sent David Dutch, 57, and James Copenhaver, 74, to the hospital with gunshot wounds. It was one of the most dramatic moments of the 2024 Trump campaign, with Trump ducking for cover with blood visible on the side of his face, as he got back up and yelled \"Fight! Fight! Fight!,\" with a defiant fist in the air. Jennifer Welch, who famously laughed as she saw a left-wing activist take joy in TPUSA founder Charlie Kirk’s death, spoke about the Butler, PA assassination attempt with co-host Angie \"Pumps\" Sullivan. Welch argued that the goodwill Trump earned from that moment has not only worn itself out, but that the whole affair was likely staged. FAR-LEFT PODCAST HOST JENNIFER WELCH CLAIMS CHARLIE KIRK 'JUSTIFIED' HIS OWN DEATH \"Obviously, a lot of people are late to the party on this. A lot of people during the last presidential campaign got intoxicated by Trump's campaign. They got intoxicated by the ‘Fight! Fight! Fight!’ photo, which I'm now going to go on the permanent record. I think he totally staged the assassination,\" Welch said. \"I do too,\" Pumps replied. \"I've watched it. I think he staged it. They lowered the flag. They let the press go in. I think he staged the whole thing,\" Welch continued. \"That's just my opinion. Maybe I'm going BlueAnon. I don't care. F--- it. We're in the middle of Trump's 2.0.\" BlueAnon is a catchphrase that parodies the QAnon genre of conspiracy theories, and is used to describe liberals embracing similarly outlandish conspiracy theories about Republicans. She went on to criticize podcast host and comedian Andrew Schulz as one of the many male-oriented podcasters who have only recently begun to criticize Trump. WHITE HOUSE RESPONDS TO LIBERAL PODCAST HOST CALLING STEPHEN MILLER A 'NAZI JEW' \"But a lot of people like Andrew Schulz fell for all that crap, and Donald Trump is a lot of these guys’ idealized form of masculinity, and they submit to him, they’re submissive to this man. They don’t stand on anything on their own,\" Welch said. The host of the \"I’ve Had It\" podcast proceeded to play multiple clips of Schulz complaining that only a small number of the deportations were violent/sexual offenders, and that the Trump administration had failed to release the Epstein list. \"If you bring up another f------ pedophile about deporting, and you’re not releasing the Epstein list, just shut the f--- up all of you,\" he said. \"I don’t want to hear anything else about ‘Oh we gotta deport the pedophiles!’ They’re right here! There are a list of them and you’re not exposing it.\" A White House spokesperson said the Welch and Pumps are suffering from \"Trump Derangement Syndrome.\" \"’I’ve had it’ [with] hearing sick conspiracies from no-name liberal podcast hosts who clearly suffer from a severe case of Trump Derangement Syndrome,\" the spokesperson said. Fox News Digital also reached out to Schulz and did not receive an immediate reply. Welch has become a significant voice in Democratic circles. She has been outspoken about her belief that Democrats need to be more aggressive in their fight against Trump and his supporters. She has also hosted numerous top Democrats on her podcast, like former President Barack Obama, Sen. Elizabeth Warren, New York City mayor Zohran Mamdani, and former Vice President Kamala Harris. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP","summary":"Left-wing podcasters Jennifer Welch and Angie Sullivan said they believe Trump&apos;s assassination attempt was staged, with Welch quipping she was embracing &quot;BlueAnon&quot; conspiracies.","url":"https://www.foxnews.com/media/popular-left-wing-podcast-hosts-push-conspiracy-theory-trump-staged-assassination-attempt-himself","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/trump-butler.jpg","video":null,"publish_date":"2026-02-02 23:11:48","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.472},{"id":398775888,"title":"Trump’s huge cash haul gives GOP chance to defy history","text":"Yet, money only matters if Trump chooses to deploy it, something the president has been criticized for not doing for GOP candidates in the past. Last year, there were even questions regarding whether Trump planned to endorse the 2025 Virginia GOP gubernatorial nominee, Winsome Earle-Sears.\n\nA party strategist close to the White House was adamant that Trump would spend this year, even if history were against Republicans.\n\nIn conversations with the Washington Examiner, the source also cited Trump super PAC Make America Great Again Inc., for example, spending last year on Rep. Matt Van Epps’ (R-TN) special election win in Tennessee’s 7th Congressional District.\n\nA second Republican strategist who was granted anonymity to speak candidly quipped that the GOP would “love” for Trump “to spend all this money” after the president last weekend endorsed the likes of former Sen. John Sununu for New Hampshire’s open Senate race.\n\n“I don’t think we’d turn down any funding for House races, that’s for sure,” the source told the Washington Examiner. “But in all seriousness, I think we’re very encouraged by the amount of money that is in the ecosystem. And that’s something that we’ve never really had before.”\n\n“It puts us in a really good position,” he added. “If we were able to win last cycle being outspent as much as we did, then imagine what we can do when we actually have the cash advantage.”\n\nWhen pressed on MAGA Inc.’s plans for this year after the super PAC raised an unparalleled $289 million in 2025, spokesman Alexander Pfeiffer declined to provide specific details. \n\nPfeiffer did say that thanks to Trump’s leadership, the super PAC has “the resources to help candidates who support President Trump’s America First agenda of securing our border, keeping our streets safe, supercharging our economy, and making life more affordable for all Americans.”\n\nFor Republican National Committee spokeswoman Kiersten Pels, Trump’s “record is driving historic grassroots support and giving Republican candidates the opportunity to defy history in the midterms.” \n\nThe RNC had $95 million cash on hand as of Dec. 31. 2025, compared to the Democratic National Committee’s $14 million, excluding the DNC’s $17 million in debt after former Vice President Kamala Harris’s failed 2024 presidential campaign.\n\n“Democrats and their left-wing allies are preparing to flood the midterms with outside money, which is exactly why the RNC has built this war chest — to go toe-to-toe with that spending, conduct targeted voter outreach, and support President Trump and our candidates nationwide,” Pels told the Washington Examiner. “This momentum puts Republicans in a strong position heading into 2026.”\n\nTo that end, both Democrats and Republicans are preparing in case the Supreme Court this summer decides that the Federal Election Campaign Act of 1971 unconstitutionally restricts how political committees coordinate regarding campaign advertising for their party’s candidates. \n\nSuch a Supreme Court decision, expected before July, would essentially do away with the demarcations among the different committees, solidifying Trump and Republicans’ advantage. \n\nNevertheless, Democratic strategist Christopher Hahn underscored that Texas Democratic state Senate candidate Taylor Rehmet last weekend defeated Trump-endorsed Leigh Wambsganss in a district that Trump won by 17 percentage points in 2024, with $380,000 to Wambsganss’ $2.5 million.\n\n“Money won’t save Republicans in 2026,” Hahn told the Washington Examiner.\n\nDemocratic strategist Stefan Hankin agreed, but acknowledged that Democrats need money to compete against Republicans, especially if the party does not make donors “feel good about opening up the checkbook” after declining to disclose its 2024 election review.\n\n“We want to be able to compete in as many of those districts as humanly possible because this could be the year where we steal a bunch of seats that we really have no business winning, in theory, while Trump’s still in office,” Hankin told the Washington Examiner. “We want to be able to expand the playing field as much as humanly possible and, if the money’s not there, if we’re not organized to do this, we’re going to fall short of winning the majority, at least in the House, the way things look right now.”\n\nIn response, the DNC emphasized Trump’s lack of popularity and claimed that “the writing is on the wall in the midterms” as many Democratic candidates in toss-up races outraised their Republican opponents. \n\n“The American people want change from the broken, billionaire-first agenda that Trump and Republicans are offering, and no matter how much rich donors spend trying to keep them in office, working families know that their bills are too high, their healthcare is too expensive, and it’s Republicans’ fault,” DNC spokeswoman Nina Raneses told the Washington Examiner.\n\nHankin, the strategist, did echo that Democratic talking point, contending that he is “hard pressed to come up with a way that the Republicans are going to, all of a sudden, polish that turd.” \n\n“How are they going to make voters feel better about things other than their pure base?” he asked. “Yes, you need money to turn out your base, but in general, I don’t see this as being like, ‘Oh, with $50 million, $100 million, you can come up with the messaging that’s going to change the hearts and minds of where Americans are given everything that’s going on.”\n\nDespite the fundraising gap, Democrats have a slight polling advantage ahead of the midterm elections, averaging a 5-percentage-point edge over Republicans in generic congressional ballot polls, at least according to RealClearPolitics.\n\nRepublicans, too, are on defense in the House, as 14 of the 18 races Cook Political Report deems toss-ups are held by GOP lawmakers. \n\nBut the Senate toss-up races are more evenly split between Democrats and Republicans – the parties hold two of the four toss-up seats apiece, with the GOP having a three-seat majority even without Vice President JD Vance.\n\nTrump has repeatedly complained about Republicans’ prospects in the midterm elections as he is simultaneously poised to make weekly campaign trips.\n\nOf last Saturday’s Texas state Senate race, Trump downplayed his participation to reporters and classified the contest as being “local” and not national.\n\n“I’m not on the ballot,” the president said. “So you don’t know whether or not it’s transferable, but you put the Democrats in, you’ll end up with open borders again.”\n\nEven so, history remains against Trump and Republicans. An incumbent president’s party has not retained unilateral control of Congress in its first midterm elections since Jimmy Carter in 1978.","summary":"An incumbent president’s party usually loses seats in the House and Senate during midterm elections, but President Donald Trump is sitting on a $375 million political war chest that Republicans believe could blunt — or even upend— that pattern if he spends it aggressively. Trump’s fundraising committees and allied PACs have stockpiled the massive sum [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/4443476/trump-huge-cash-haul-gop-chance-defy-history/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2026/02/AP26033772203103.jpg?w=696","video":null,"publish_date":"2026-02-02 22:56:58","author":"Naomi Lim","authors":["Naomi Lim"],"language":"en","category":"politics","source_country":"US","sentiment":0.01},{"id":398754282,"title":"New Poll Shows Top 2028 Presidential Candidates","text":"A new Harvard Harris poll released this week shows the potential top candidates for 2028, with former Vice President Kamala Harris leading Democrats and Vice President JD Vance outpacing the Republican field. Newsweek reached out to political analysts via email for comment. Why It Matters Early polls have gained significance as potential contenders for the 2028 presidential election begin to emerge. Even with the election still years away, polling offers insight into candidate viability, voter sentiment and evolving party dynamics, particularly after the pivotal 2024 election cycle. What To Know According to the poll, Harris leads the pack for Democrats with 39 percent, ahead of California Governor Gavin Newsom with 30 percent, U.S. Representative Alexandria Ocasio-Cortez of New York with 12 percent, Pennsylvania Governor Josh Shapiro's 9 percent and Illinois Governor JB Pritzker's 7 percent. The survey shows that 4 percent say someone else. For Republicans, Vance has a commanding 53 percent of the potential vote, leading Donald Trump Jr. with 21 percent, U.S. Secretary of State Marco Rubio's 17 percent and former Fox News anchor Tucker Carlson's 5 percent. Three percent of poll respondents say someone else. The poll surveyed 2,000 registered voters on January 28 and January 29 and has a margin of error of 1.99 percent. The survey also shows Vance with a 38 percent favorability rating versus Rubio's 34 percent, Newsom and Ocasio-Cortez's 32 percent and Tucker Carlson's 27 percent. Outgoing Vice President Kamala Harris, left, stands with incoming Vice President JD Vance ahead of Inauguration ceremonies at the White House on January 20, 2025, in Washington, D.C. (Photo by Anna Moneymaker/Getty Images) What People Are Saying Trump, in August during a news conference when asked if Vance is the MAGA successor: “Well, I think most likely in all fairness, he's the vice president. I think Marco [Rubio] is also somebody that maybe would get together with JD in some form. I also think we have incredible people, some of the people on the stage right here, so it's too early obviously to talk about it but certainly he's doing a great job, and he would be probably favored at this point.“ Robert Y. Shapiro, political science professor at Columbia University, to Newsweek via email in August: “The Democratic primary polling is much too early and all we are seeing is name recognition for past presidential candidates and ones in the news lately in a visible way. On the Republican side, DeSantis and Rubio are damaged goods as past losers in the past Republican primaries in 2016 and 2024. Vance is on the rise by virtue of being Vice President and visible when he echoes or advocates more strongly Trump's MAGA positions and what Trump—and he—have done. He has not been defeated in any past major election so untarnished in that respect.“ What Happens Next Polls surveying Americans on potential 2028 candidates are expected to continually get released.","summary":"Even with the election still years away, polling offers insight into candidate viability and voter sentiment.","url":"https://www.newsweek.com/new-poll-shows-top-2028-presidential-candidates-11454936","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/GettyImages-2194897505.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-02 22:43:43","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"US","sentiment":-0.424},{"id":398759862,"title":"Turning Point USA announces Kid Rock as rival headliner to Bad Bunny’s Super Bowl halftime show","text":"The announcement from Turning Point USA, founded by Charlie Kirk and helmed by his wife Erika Kirk after his assassination, quickly drew attention from Trump officials, including Defense Secretary Pete Hegseth, who wrote, “Hey [Turning Point USA], how can [the Defense Department] get in on this?” in a post on X following the lineup’s release.\n\nLast fall, the NFL faced backlash from Trump after tapping Bad Bunny to headline the Super Bowl LX halftime show, where the Seattle Seahawks will face off against the New England Patriots.\n\n“I think it’s absolutely ridiculous,” Trump told Newsmax of the selection of Bad Bunny, adding that he’d “never heard of” the artist.\n\nThe global pop star is set to make history as the first male Latin performer to headline the iconic halftime show. He has a massive global audience and was Spotify’s most streamed artist in 2025.\n\nBad Bunny, who recently won album of the year at the 2026 Grammy Awards, has been outspoken in his opposition to the Trump administration’s immigration crackdown and has been branded a “Trump hater” by MAGA influencers. He excluded the U.S. from his current world tour out of fear of ICE raids potentially targeting fans, and he endorsed former Vice President Kamala Harris during the 2024 presidential campaign.\n\nBad Bunny reignited that political tension Sunday night at the Grammys, using his acceptance speech to condemn the nationwide immigration crackdown.\n\n“Before I say thanks to God, I’m going to say: ICE out,” he said. “We’re not savages. We’re not animals. We’re not aliens. We are humans, and we are Americans.”\n\nThe Trump administration has intensified immigration enforcement nationwide, expanding Immigration and Customs Enforcement operations in major cities as part of a broader effort to reverse Biden-era immigration policies. The increase in raids and arrests sparked widespread protests and clashes between citizens and federal immigration agents, with some taking a violent turn, such as the shooting deaths of U.S. citizens Renee Good and Alex Pretti in Minneapolis by federal agents on separate occasions.","url":"https://www.politico.com/news/2026/02/02/turning-point-usa-super-bowl-halftime-show-00761040","image":"https://www.politico.com/dims4/default/4324a1b/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F37%2F91%2Fb9aeabd64431a5f72986f49f829f%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2207380502","video":null,"publish_date":"2026-02-02 22:38:00","author":"Finya Swai","authors":["Finya Swai"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.048},{"id":398769752,"title":"From Bad Bunny to Billie Eilish, the Celebrities Who Took a Stand Against Trump’s Immigration Crackdown at the Grammys","text":"Bad Bunny’s comments come a week before he is set to headline the Super Bowl LX halftime show. \n\n“I think it’s a terrible choice,” Trump said of the selections of Bad Bunny and Green Day, both of whom have been critical of him, to perform at the event. “All it does is sow hatred. Terrible.” Speaking to right-wing podcast host Benny Johnson after the NFL’s announcement, Homeland Security Secretary Kristi Noem said that ICE agents would be \"all over\" the Super Bowl. \"I think people should not be coming to the Super Bowl unless they're law-abiding Americans who love this country,\" she said.\n\nBad Bunny, who endorsed Kamala Harris in the 2024 presidential race, did not include any U.S. locations in his 2025-2026 tour, citing fears that ICE would raid the concert venues. \n\n“People from the US could come here to see the show. Latinos and Puerto Ricans of the United States could also travel here, or to any part of the world,” he told i-D magazine. “ICE could be outside. And it’s something that we were talking about and very concerned about.”","summary":"From Bad Bunny to Billie Eilish, a number of artists made a statement against the Trump Administration's immigration crackdown.","url":"https://time.com/7364632/grammys-2026-trump-ice-out-immigration/","image":"https://api.time.com/wp-content/uploads/2026/02/GettyImages-2258958804.jpg?w=1200&h=675","video":null,"publish_date":"2026-02-02 21:42:56","author":"Connor Greene","authors":["Connor Greene"],"language":"en","category":"politics","source_country":"us","sentiment":-0.31},{"id":398741102,"title":"Texas Special Election: Latino Voter Shift Drives 31-Point Flip Against GOP - Bloomberg","text":"Big shifts among Latino voters fueled a Texas Democrat’s upset victory in a state senate district in the Fort Worth area that’s been dominated by Republicans for more than three decades, according to an analysis of results from the Jan. 31 election. \n\nIn one precinct of the city’s heavily Latino Northside neighborhood, 81% of voters picked Democrat Taylor Rehmet, a labor union leader. In the same precinct in 2024, by contrast, 51% chose President Donald Trump, who praised Rehmet’s GOP rival before the Jan. 31 vote. Several nearby precincts backed Rehmet at 90% or more compared with about 60% for Kamala Harris in 2024. \n\n“The Hispanic vote really locked in,” said Matt Angle, founder of the Lone Star Project, a Democratic consultancy. “It’s clear that they overwhelmingly supported Taylor Rehmet.”\n\nThe electoral result is leaving Republicans searching for answers as Texas voters prepare to choose a US senator this year and pick congresspeople based on redrawn maps designed to favor the GOP. With Trump’s immigration crackdown dominating headlines nationwide, Rehmet won by 14 points against conservative firebrand Leigh Wambsganss in the state senate district, which supported the president by a 17-point margin in 2024. That’s a 31-point shift. \n\n“Did the Hispanic Trump voters automatically vote R?” asked Vinny Minchillo, a Texas-based Republican consultant at Glass House Strategy. “It doesn’t look like it.”\n\nRead more: Democrat Clinches Shock Win in Texas State Senate Runoff\n\nThe election was a run-off to fill a state senate seat vacated by Kelly Hancock, a more moderate Republican who left office to become the state’s acting comptroller. Wambsganss, a longtime conservative activist, has been embroiled in hot-button social issues in the district, which includes ritzy suburbs in addition to working-class areas of Fort Worth. \n\n“This was a great misread of an electorate in that district,” Minchillo said. \n\nJust 15% of registered voters turned out for Saturday’s election, a weekend contest that came after a brutal cold snap that made campaigning difficult. The amount either party can glean from such a unique situation is limited but the warning signs are flashing, Minchillo said. \n\nLieutenant Governor Dan Patrick, a Republican who endorsed Wambsganss, blamed low voter turnout and called the race a “wake-up call for Republicans across Texas” in a post on X. John Huffman, the former mayor of Southlake, Texas, who ran against Wambsganss in the first round of voting in November, faulted her for pursuing too narrow and ideological a coalition of voters.\n\nThe GOP will soon get a chance for revenge: Rehmet will serve out the remainder of Hancock’s term, and face Wambsganss again in November for a full four-year term. \n\nAs chief communications officer of Patriot Mobile, a cell phone company, and executive director of its political action committee, Wambsganss supported conservative school board candidates who aimed to eliminate certain race and gender teachings from classrooms and became embroiled in debates over the contents of public school libraries.\n\nWambsganss leaned on national Republican figures like Trump for support and appeared on Steve Bannon’s War Room show to encourage voters to turn out.\n\nRehmet, a US Air Force veteran and machinist at a Lockheed Martin Corp. factory in Fort Worth, eschewed culture-war issues to focus on the cost of living. He also talked about the union benefits he has received from working at the facility. \n\nTexas Republicans were already wary of this year’s midterm congressional elections, which will be the first to use the state’s revamped congressional districts. The new maps, which were strongly backed by Trump, are meant to net Republicans as many as five new seats in the US House of Representatives. But political analysts have cautioned that Republican leaders may have left too thin a margin if Democrats make major gains. \n\nThe state will also vote for a US senator. The Republican incumbent, Senator John Cornyn, is locked in a close primary with Texas Attorney General Ken Paxton, an outspoken conservative, and US Representative Wesley Hunt. \n\nDemocrats, meanwhile, are choosing between Texas State Representative James Talarico, a Presbyterian seminarian who touts his crossover appeal, and US Representative Jasmine Crockett, who’s known for her fundraising skill and ability to create viral moments on social media from her confrontations with Republicans.","url":"https://www.bloomberg.com/news/articles/2026-02-02/latino-shift-drives-31-point-flip-against-gop-in-texas-district?srnd=homepage-asia","image":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iezrWW0UygAA/v1/1200x900.jpg","video":null,"publish_date":"2026-02-02 21:21:05","author":"Joe Lovinger","authors":["Joe Lovinger"],"language":"en","category":"politics","source_country":"us","sentiment":-0.236},{"id":398735922,"title":"Peggy Flanagan’s Chances in Minnesota Senate Race as Tina Smith Endorses","text":"Minnesota Democrat Tina Smith endorsed Lieutenant Governor Peggy Flanagan over Representative Angie Craig to succeed her in the U.S. Senate on Monday in a race Republicans are hoping to make competitive in the midterm elections later this year. Flanagan said in a press release that she “would be deeply honored to carry her work forward in the United States Senate.” In a statement to Newsweek, a Craig spokesperson said the congresswoman would be “the best candidate to keep this seat blue.” Newsweek also reached out to the campaigns of Republicans Michele Tafoya, David Hann and Royce White for comment via email. Why It Matters Republicans are hoping to make the Senate race competitive later this year, though Minnesota has generally leaned toward Democrats in recent years. Smith opted against running for another term and chose to endorse Flanagan, viewed as the more progressive candidate, over Craig, who has built a more moderate reputation in the House of Representatives, in the Democratic primary. Minnesota has become the epicenter of the Trump administration’s ramped-up immigration enforcement. Two American citizens, Renee Nicole Good and Alex Pretti, were fatally shot by immigration officers in January amid protests in the city, and Department of Homeland Security (DHS) agents have faced growing scrutiny over their tactics in immigration operations. What To Know Smith, who previously indicated she would not endorse a candidate, unveiled her endorsement of Flanagan on X on Monday, stating that there is “no one” she trusts more to stand with Minnesotans than the state’s lieutenant governor. “Peggy has served this state so well,” Smith said. “She has delivered results for Minnesotans and she understands that right now what we need are fierce fighters—people who are willing to stand up to the status quo. People who won’t be intimidated.” Minnesota Lieutenant Governor Peggy Flanagan speaks at the Democratic National Convention in Chicago on August 19, 2024. Smith’s endorsement gives her support from a prominent Minnesota official in her primary race against Craig. She has also received support from Senator Bernie Sanders, a Vermont independent, and former Senator Al Franken, a Minnesota Democrat. Craig, meanwhile, has support from former Transportation Secretary Pete Buttigieg and House Minority Leader Hakeem Jeffries of New York. Polls have given Flanagan a lead in the primary. A Public Policy Polling survey from last month gave Flanagan a 12-point lead (40 percent to 28 percent), with nearly one-third of voters (31 percent) still being undecided about who they would support in the primary. “Both candidates have net-positive favorability ratings, though Flanagan’s is much higher: 70% view her favorably while just 7% view her unfavorably for a +63 net favorability rating. Angie Craig is viewed favorably by 59% and unfavorably by 12% for a +47 net favorability rating,” the polling memo reads. It surveyed 976 likely voters from January 16-17, 2026 and had a margin of error of plus or minus 3.1 percentage points. The latest poll from Impact Research showed a tight race but gave Flanagan a three-point lead over Craig (45 percent to 42 percent). It surveyed 600 likely voters from January 13-15, 2026 and had a margin of error of plus or minus 4 percentage points. Polling on the general election is more sparse. Several Republicans are running, including former Minnesota Senate Minority Leader David Hann, retired broadcaster Michele Tafoya and former NBA player Royce White, who unsuccessfully challenged Minnesota Democratic Amy Klobuchar in the 2024 Senate race. An Impact Research poll, conducted from July 8-11, 2025, showed Craig with a 4-point lead over Tafoya (49 percent to 45 percent) and Flanagan with a 3-point lead over Tafoya (48 percent to 45 percent). It surveyed 604 likely voters and had a margin of error of plus or minus four percentage points. David Schultz, a professor of political science at Hamline University, told Newsweek there are a few reasons Flanagan may be leading. She may have more statewide name recognition as lieutenant governor, and the ICE surge in the state could also cause voters to embrace a more progressive politician. The ICE surge may also be galvanizing Democratic support and alienating swing voters from the GOP, Schultz said. “A race that I would have thought maybe if the Republicans had picked the right candidate would be competitive, I’m starting to shift it to being less competitive depending on who the Democratic candidate is also,” he said. Craig, who has represented a competitive district, is viewed as the stronger Democrat for the general election, he said, noting that Flanagan positioning herself as more progressive may not benefit her in the more conservative, rural parts of the state. Still, Democrats can win without those voters but cannot get “blown away,” Schultz added. “That becomes the question. Can Flanagan get enough support among liberal and progressive voters while potentially losing support in rural Minnesota?” he said. Minnesota last backed a Republican presidential candidate in 1972, but it has still only been light blue in recent elections. Former Vice President Kamala Harris won the state by only 4 percentage points in the 2024 presidential election. Former President Joe Biden carried it by about 7 points in 2020, while former Secretary of State Hillary Clinton won it by less than 2 points in 2016. What People Are Saying Minnesota Lieutenant Governor Peggy Flanagan said in a statement: “Tina is an unapologetic progressive champion for working people who has delivered real results for Minnesotans all across the state. I’ve learned so much from her over the years and I would be deeply honored to carry her work forward in the United States Senate.” A spokesperson for Representative Angie Craig’s campaign told Newsweek: “At her core, Angie Craig is a fighter. She is the only candidate who has proven she can both win tough, competitive races against a Republican and go toe-to-toe with the Trump administration. From voting to impeach Donald Trump twice and now taking on Kristi Noem and ICE, to writing the law that capped the cost of insulin at $35 for seniors and banning members of Congress from trading stocks, Angie Craig has shown she’s the fighter Minnesotans need to hold the powerful accountable. As Republicans attack the Lt. Governor over fraud, it’s clear that the best candidate to keep this seat blue is Angie Craig.” Kyle Kondik of Sabato’s Crystal Ball wrote in a January 29 update: “Democrats do have to navigate a fraud scandal that contributed to Gov. Tim Walz’s (D) recent decision not to seek a third term, and Flanagan (as a current state-level official) would be easier for Republicans to tie to that scandal. But the recent, horrific events in Minneapolis, with Renee Good and Alex Pretti being killed by federal immigration agents, are likely to nationalize the Minnesota races in favor of Democrats, and Sen. Amy Klobuchar’s (D-MN) entrance into the gubernatorial race is also likely to be helpful to the eventual Democratic Senate nominee.” What Happens Next Forecasters give Democrats an advantage. Both the Cook Political Report and Sabato’s Crystal Ball classify the race as Likely Democratic. The primary is set for August 11, 2026, according to the Minnesota Secretary of State’s office.","summary":"Smith backed Lt. Governor Flanagan over Representative Angie Craig in the Democratic primary to replace her on Monday.","url":"https://www.newsweek.com/peggy-flanagan-chances-minnesota-senate-race-tina-smith-endorses-11455022","image":"https://assets.newsweek.com/wp-content/uploads/2026/02/GettyImages-2166796276.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2026-02-02 21:19:05","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":0.051},{"id":398779288,"title":"Laughter","text":"In Time Enough for Love, Robert Heinlein dropped a significant remark about laughter. “When apes learn to laugh, they’ll be people.” Laughter is what makes us human. But there are different kinds of laughter, and different ways of being human. The best kind of laughter reinforces our deeper or richer humanity, creating a sense of empathy with others. Other types of laughter, on the other hand, create division and express what we recognize as inhumanity. \n\nSome laughter responds to clever wordplay, sharp irony, unexpected consequences, and, of course, a touch of warmth; it reflects shared cohesion or mutual understanding. Other kinds of laughter violate these norms and criteria, suggesting a propensity for causing discomfort or harm. Such laughter is an expression of malevolence and sadistic violence, of mental unbalance or even outright madness.\n\nNervous laughter and phatic laughter are a rather different genre of expostulation, having nothing to do with humor or aggression. They are forms of deflecting attention from ill-at-ease-ness or what we might call flow-stall, that is, when a thought or phrase embarrassingly fails to complete itself via misspeaks, accidental interruptions, and brain freeze.\n\nThe timbre or quality of laughter is also important. The laughter of certain public figures is famously a symptom of some form of cerebral vertigo. One thinks of the high-pitched shriek of Tucker Carlson, a cross between the screech of a howler monkey in distress and a badly oiled gate hinge. There is definitely something wrong there. Kamala Harris for her part has become notorious for what has been described as a cackle, a disquieting morphic meld between the creepy vocalizations of a hyena and the readle-eak of a grackle, with maybe a chicken thrown into the pot for good measure. We should be thankful she does not yelp, bark, roar or grunt, or the force of her laughter might then be threatening rather than comical or immiserating. I have a friend who laughs like a magpie in a belfry, which makes it impossible to take even the good things he says seriously, and compels me to wonder about his internal balance. Nail-on-chalkboard laughter is often taken as a symptom of incipient derangement, and perhaps rightly so.\n\nWe have many qualifiers for different kinds of laughter: hearty laughter, sarcastic laugher, cruel laughter, evil laughter, and so on. The heh heh of the Grinch stealing Christmas signifies the joy of causing pain or discomfort, the gritch of motiveless sadism. The guffaw or vocal explosives of Mafia goon laughter in films indicates the pleasure of subcortical ferocity. The peals and arc-like gales or insidious titters is the stock in trade of the infernal demon. The belly-laugh of the good-natured companion is the Falstaffian sonic surround of camaraderie. One thinks of the Jewish expression, carried over into many other languages: das mentsh trakht un got lakht (man proposes and God laughs). But what is the laughter of God? Is it affectionate? Is it imperial? Here we admit our ignorance.\n\nIn her study of Jewish humor, No Joke, Ruth Wisse speaks of laughter’s salvific properties, a special instance of humor that releases a special kind of laughter. Jewish jokes and the laughter they provoke, typically self-deprecating, have multiple functions: they are expressions of humility and modesty; a recognition of the absurdity of the world, and a coping mechanism “transmuting humiliation, subjugation, and dread into funniness.” It’s a bad joke that induces a good joke, the laughter of incredulity and the preposterous fun of verbal, half-unserious self-immolation. It is redemptive laughter in the midst of adversity. As Freud marvelled in Jokes and their Relation to the Unconscious, “I do not know whether there are many other instances of a people making fun to such a degree of its own character.” \n\nOne cannot go any further unless one asks what all these species of laughter have in common. This brings up the more genetic question about laughter, in short, what is this weird, cascading outburst in the first place? We are all, at least to some extent, Tucker Carlson or Kamala Harris. When one becomes clinically aware of laughter, one realizes the absolute eerieness of our condition as something other than mere animals capable of some degree of thought. \n\nGelotology—which AI confuses with Gelatology or the making of ice cream, and which is unintentionally funny in itself—is the science of laughter, a recognized field of study featuring many excellent researchers. In my estimation, one of the best books on the subject is Scott Weems’ HA! Weems views laughter as arising from a contest or squabble in the brain—tension in the mind is probably a better description—accompanied by surprise and joy at the moment of reconciliation. \n\nMax Nieuwdorp in The Power of Hormones provides a clinical analysis of endocrinological paradigms largely in the support of laughter in the quarrel between happy endorphins and angry cortisols. \n\nWilliam Fry in Sweet Madness investigates humor and laughter from a transactional standpoint, as something that is most effective and vivid in social contexts to establish a feeling of complicity or simple entertainment for a society of equals that binds them together. He does not, unfortunately, examine the mechanics of laughter in profound detail. \n\nIn The Act of Creation, Arthur Koestler sees laughter as arising from a “collision of matrices” or frameworks that release tension in staccato gusts of breath, a clash of referential schemata or cognitive grids he calls “bisociative events.” It is a creative leap “that gives rise to new and startling perceptions and glimpses of reality.” Laughter detaches us from disturbing feelings, releasing stress or agitation or psychic pressure in a burst of innocent humor, followed by an access of relief. These puffs, blasts and eruptions of air and CO2 from the lungs, this collapsing diaphragm allowing for a fresh intake of oxygen, helps to restore equilibrium after the stress of what we might call anxious patience, waiting for the punch line, hovering before the contrast represented by the unexpected or the eventual and yet sudden fulfillment of desire. The hidden metaphor is that of a tightly coiled spring.\n\nLike the flow of tears, which no other creature shares, and which can be intimately associated with laughter and caused by the same phenomena, laughter is both a mechanism—analogically, a tightly wound spring packed with kinetic energy—and a spiritual or pneumatic (quite literally) mystery of attitude, flair and conscious anticipation, a numinous quality that connects us to something other than the physical. Nobody really knows what it is, but it is surely an imprint of something alien and unsettling. \n\nSpend a little time just observing oneself or others caught up in a snort or a squall of laughter, the throwing back of the head, the shaking of the physique, the cataract of clipped or amorphous sound that has no relation to speech, and simply register what is occurring. One should feel a state of bafflement infused with self-consciousness—and at the same time discover something rather astounding about ourselves. The bizarre, alveolar expulsion of breath, which seems frankly grotesque when we become aware of it, is an uncanny mix of the natural and the unnatural, a sign that we are both in and out of the predictable, customary world. Whether benign or foolish or spiteful, it resembles a form of dyskinesia, the flux of involuntary gestures, almost a kind of disorder.\n\nBut laughter may also be the incursion of the transcendent realm or dimension, of the strangely noetic, whether admirable or discreditable, into the material element of our being. The phenomenon comes from elsewhere, as if from a region of existence that Saint Paul describes in his letter to the Ephesians as the realm of the Spirit, that is, of Powers and Fiends from whom we descend in equal parts. It is not an abstract concept but an authentic reality. Angels sing. Demons howl. And we laugh. \n\nEditor’s Note: Support and follow PJ Media’s coverage of leftist corruption and other key news in this new year. Join PJ Media VIP and use promo code FIGHT to get 60% off your membership.","url":"https://pjmedia.com/david-solway-2/2026/02/02/laughter-n4949037","image":"https://media.townhall.com/cdn/hodl/2025/304/e2c9b9ce-7c4c-486d-bc39-d98ba6cd7f01.jpg","video":null,"publish_date":"2026-02-02 21:00:18","author":"David Solway","authors":["David Solway"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.314},{"id":398713436,"title":"Headlines Are Calling the Melania Movie a Surprise Box-Office “Success.” Don’t Believe Them.","text":"Third-place opening weekends are not usually the stuff of box-office headlines, but on Saturday, you couldn’t pick up your phone without reading that Melania, Brett Ratner’s gauzy, glad-handing portrait of the first lady, was doing much better than expected. Deadline called its opening the strongest for a documentary in a decade, and the New York Times wrote that its $8 million opening was 60 percent above industry predictions. By Sunday, however, the latter number had been revised drastically downward, from $8 million to barely over $7 million, and as for the former statistic, it only holds if you don’t categorize concert movies as nonfiction, since it’s nowhere in the ballpark of The Eras Tour’s $123 million.\n\nIn the days leading up to Melania’s release, Bluesky was filled with gloating screenshots of ticketing sites showing mostly empty theaters, not to mention a widely recirculated Craigslist post purportedly offering $50 to anyone who attended a screening. (The post was real, although there’s no indication that the offer was genuine.) But it doesn’t seem far-fetched, even with Donald Trump’s poll numbers cratering, that a small fraction of his 77 million voters would turn out for the film—either out of genuine interest or simply as a show of support—and although there wasn’t a single theater showing Melania in the city of Philadelphia, the Friday matinee I attended in a South Jersey suburb was mostly full.\n\nThe audience—perhaps 70 people or so—wasn’t especially vocal, although there was a smattering of applause at the closing credits, and one person repeatedly clapped during the footage of Trump’s second inauguration. But I heard appreciative murmurs on the way out, and one person said, loud enough for the entire theater to hear, “That was a good movie.” Critics, perhaps needless to say, did not agree: Metacritic characterizes their response as “overwhelming dislike,” with one particularly scathing pan calling it “a gilded trash remake of The Zone of Interest.”\n\nWhat struck me most powerfully about Melania is how overwhelmingly dull it is. As Slate’s Heather Schwedel pointed out, the media landscape is teeming with low-stakes celebrity docs, skin-deep forays into their personal lives that offer a carefully managed sense of intimacy. But even by the standards of those personal-brand advertorials, Ratner’s movie is an utter bust. If its purpose is to offer an unprecedented glimpse into its subject’s humanity, the only conclusion to be drawn is that its subject has no humanity to uncover.\n\nThere is, of course, another theory about Melania’s purpose: that it is, effectively, a bribe. As one documentary expert told the Times, the $40 million Amazon paid to acquire the film has “no correlation to the marketplace,” and though the camera doesn’t linger on company founder Jeff Bezos, you can clearly make him out on the dais during Trump’s inauguration, mere feet from the woman his company paid $28 million of that $40 million for her participation. It’s true that Melania’s opening weekend is unusually large for a (non-concert) documentary, but that’s in large part because most documentaries don’t open with $35 million in marketing. In Hollywood, there’s a term for what happens when a movie you’ve spent $75 million on opens with $7 million in box office: It’s a flop.\n\nAmazon executives, who vastly outbid competing offers from Disney and Netflix, have insisted it will find its real audience when it’s released on Prime Video in a few weeks, and they wouldn’t be the first streaming company to lose money on a theatrical release in the name of building their subscriber base. But coming the same week as the Bezos-owned Washington Post announced plans to gut its coverage of international affairs, along with sports and local issues, it’s hard not to imagine the other uses that $75 million could have been put to.\n\nAlthough Melania ends with a typed-out list of the first lady’s purported political accomplishments—some of which, like the claim that she is the first presidential spouse to contribute the “core elements” of an executive order, seem unlikely to stand up to rigorous fact-checking—the movie spends precious little time dramatizing them. There’s a brief Zoom with Brigitte Macron about joint messaging on cyberbullying, and a meeting with Aviva Siegel, a former Hamas hostage whose husband was still being held captive. But Ratner and his legendary cinematographer, Dante Spinotti, spend more time watching her hash out the hemline of her inaugural dress and fretting over the five-hour window the Trumps have to move their furnishings into the White House after Joe Biden vacates it. Even when she’s performing quasi-official duties, like attending Jimmy Carter’s funeral, her focus never widens beyond herself. Carter’s funeral happens to fall on the first anniversary of her mother’s death, and while it’s natural that the personal loss would strike her more acutely, it’s striking that her voiceover, which was presumably scripted and recorded long after the fact, never spares so much as a thought for the late president.\n\nThat lack of self-awareness runs all through Melania. Ratner is unable to coax so much as a flicker of feeling from his immaculately composed, dead-eyed subject, often jockeying to catch a glimpse of her as she vanishes into an elevator or an SUV, surrounded by a forbidding phalanx of Secret Service agents. And when he finally does manage to make his way into the passenger seat, he sounds less like a documentarian probing his subject than a nervous date making awkward small talk. (He doesn’t even follow up when he asks Melania for her favorite recording artists and she responds with Michael Jackson, settling for getting her to sing a few notes of “Billie Jean.”) The movie is threaded with pricey but inapt music cues, like the doomy strains of “Gimme Shelter” that accompany its opening drone shots, although Ratner has enough presence of mind to mute the lyrics of “Everybody Wants to Rule the World” as Melania rolls toward the inaugural ball. (The Stones’ “rape, murder” stays in.) After Melania lights a candle for her late mother at St. Patrick’s Cathedral, Ratner blithely cuts from an upward-gazing shot of its Gothic exterior to the gleaming black obelisk of Trump Tower, which would be a blasphemous equation even if it wasn’t scored to Aretha Franklin’s “Amazing Grace.” (Cinephiles may have similar objections to the way Ratner ganks excerpts from the scores for Midnight Express and Phantom Thread.)\n\nBut while Melania tells us almost nothing about its ostensible subject, it is, at least in brief moments, a fascinating study of sycophancy. In the lead-up to the inauguration, which provides the closest thing the movie has to a narrative arc, Melania is surrounded by designers and decorators and event planners, each more obsequious than the next. Hervé Pierre, the designer charged with making and modifying her inaugural gown, fields even impossible requests with an eager nod, sights set squarely on having his work preserved in the Smithsonian, while the functionary assigned to planning the candlelight ball on the eve of the inauguration makes a big show of unveiling the color of the invitations: “Not even the president has seen this,” he confides, as if the particular shade of red were a closely guarded secret.\n\nTrump himself makes only a few appearances, and while it would strain the word to say their back-and-forths display anything like intimacy, he’s clearly more attuned to the cameras than she is. But the only unguarded moment in all of Melania comes from his former opponent. As Trump prepares to assume the presidency, the cameras capture Joe Biden emerging from a room behind the dais. He’s followed by Kamala Harris, who wears a look that’s difficult to describe, a combination of dread and anxiety and the desire to, at that precise moment, be anywhere other than where she is. In the theater behind me, I swore I could feel the audience savoring her discomfort, or maybe I just imagined the hint of a chuckle. But it felt, for the first and only time, as if I was watching something real.","summary":"The first lady has entered her flop era.","url":"https://slate.com/culture/2026/02/melania-movie-box-office-trump-documentary-amazon-prime.html?via=rss","image":"https://compote.slate.com/images/b88ea536-c47a-42a2-bd59-0e8bc9621f46.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2026-02-02 19:51:15","author":"Sam Adams","authors":["Sam Adams"],"language":"en","source_country":"US","sentiment":-0.159},{"id":398752376,"title":"Donald Trump Threatens to Sue Trevor Noah Over Epstein Grammys Joke","text":"In his Truth Social post, Trump called the Grammy ceremony “virtually unwatchable” and threatened legal action against Noah: “I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C.”\nNoah returned to host the Grammys for a sixth consecutive time on CBS. During the ceremony, Noah shared that it would be the Grammys’ last one on CBS—the event is moving to Disney+ and Hulu—and his last appearance as the show’s host as well, at least for the foreseeable future. After this disclosure, Noah exhibited a bit more of a devil-may-care attitude with his jokes, aiming one about the coveted song-of-the-year award at Trump and his well-documented relationship with deceased convicted sex offender Epstein.\nThat prize, said Noah, “is a Grammy that every artist wants almost as much as Trump wants Greenland. Which makes sense because Epstein’s island is gone. He needs a new one to hang out with Bill Clinton.” After the joke got a sustained laugh, Noah noted again that this was his last ceremony as host; as such, he had nothing to lose. (Both Trump and Clinton have denied having any connection to Epstein’s crimes.)\nNeedless to say, Trump was not a fan of the joke—or of Noah’s hosting ability writ large. “The Grammy Awards are the WORST, virtually unwatchable!” he posted on Truth Social at 1:01 a.m. He then shouted out CBS—now run by David Ellison, the son of billionaire longtime Trump supporter Larry Ellison—for no longer airing the Grammys going forward, writing that the network was “lucky not to have this garbage litter their airwaves any longer.”\nTrump turned his attention to Noah while also getting in a dig at another comedian enemy of his: Jimmy Kimmel. “The host, Trevor Noah, whoever he may be, is almost as bad as Jimmy Kimmel at the Low Ratings Academy Awards,” Trump wrote, claiming to be unfamiliar with Noah’s work. For what it’s worth, Trump pulled the same move with album-of-the-year winner and Super Bowl halftime headliner Bad Bunny in October, claiming that he had “never heard of” the global Latin-music superstar before ripping his Super Bowl selection apart.\nTrump then turned his attention to Noah’s insinuation that he had spent time on Epstein’s island. “Noah said, INCORRECTLY about me, that Donald Trump and Bill Clinton spent time on Epstein Island. WRONG!!!” Trump continued. “I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight’s false and defamatory statement, have never been accused of being there, not even by the Fake News Media.”\nUltimately, Trump threatened to get litigious with Noah for his Greenland crack. “Noah, a total loser, better get his facts straight, and get them straight fast,” Trump added. “It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$.”\nConsidering how regularly comedians joke about Trump and his Epstein connection—see, for instance, any given episode of Saturday Night Live of late—it’s a bit surprising for Trump to react so strongly to Noah’s dig at the Grammys. Then again, it seems Trump has become emboldened by his recent wins against the media. In 2024, ABC News settled a defamation lawsuit with Trump for $15 million over anchor George Stephanopoulos’s claim that Trump had been found “liable for rape” in his E. Jean Carroll case. (Trump was technically found liable for sexual abuse; he has denied the allegation.) Paramount reached a $16 million settlement with Trump last year to resolve a 2024 lawsuit against CBS regarding the editing of a 60 Minutes interview with Kamala Harris ahead of the election. Trump mentioned both victories in his Truth Social post: “Ask Little George Slopadopolus, and others, how that all worked out. Also ask CBS!”\nTrump ended his rant with a foreboding message to the South African comedian: “Get ready Noah, I’m going to have some fun with you!”\nVanity Fair has reached out to Noah for comment.","summary":"While hosting the Grammys on Sunday, the former Daily Show host made a dig implying that Trump and Bill Clinton had hung out on Jeffrey Epstein’s notorious island. Trump laid into Noah on Truth Social: “I’ll be sending my lawyers.”","url":"https://www.vanityfair.com/culture/story/donald-trump-threatens-to-sue-trevor-noah-over-epstein-grammys-joke","image":"https://media.vanityfair.com/photos/6980fd29656834c976707276/16:9/w_4864,h_2736,c_limit/2258839311","video":null,"publish_date":"2026-02-02 19:43:36","author":"Chris Murphy","authors":["Chris Murphy"],"language":"en","category":"politics","source_country":"US","sentiment":-0.449},{"id":398702354,"title":"Lemon Laws","text":"He was released without bail, and maintains he was acting in the capacity of a journalist.\n\nI can't help but notice a difference in how conservatives, both journalists and civilians, are treated versus the way Lemon has been treated.\n\nJust last January, independent journalists David Daleiden and Sandra Merritt finally settled a yearslong case with the state of California after then-Attorney General Kamala Harris charged the two with multiple crimes in relation to their reporting that exposed Planned Parenthood illegally selling the body parts of aborted babies. That process lasted almost a decade, during which the pair were fined hundreds of thousands of dollars by the courts, in addition to any legal fees they racked up defending themselves. Merritt had to post $75,000 for bail in the California case, and I'm sure Daleiden did, too, although I cannot find a credible number on that. To top it off, the state of California lied after Daleiden and Merritt entered their \"no contest\" plea deals, and California Attorney General Rob Bonta secured a “felony conviction” of the two. Instead, under the plea deal, Daleiden and Merritt received \"no jail time, no fines, no admission of wrongdoing, and no probation,\" according to the National Catholic Register.\n\nThat's an admission the state of California didn't have a case against the pair, and a judge even ruled in 2019 that only nine of the 15 charges could be brought to trial.\n\nWhen Steven Baker covered the events of January 6 as a journalist, he was not informed of the charges against him by the Biden DOJ until he turned himself in. Baker did, and he was placed in handcuffs and leg irons and transported by armed agents. Some media outlets cheered Baker's arrest, with places like The Hill asking if Baker was a \"journalist, advocate, or advocacy journalist.\"\n\nNEW: Blaze News Investigative Journalist, Steve Baker Arrested by FBI for January 6 Riot Reporting.The federal agencies are weaponized by the government to go after anyone who dares to report the truth. pic.twitter.com/UOM2KoE4Mh— I Meme Therefore I Am 🇺🇸 (@ImMeme0) March 1, 2024\n\nBaker pled guilty to the charges in November, 2024. He was later pardoned by President Trump.\n\nBut the process was the punishment.\n\nThe same can be said for Mark Houck, the pro-life husband and father who woke up to the Biden FBI raiding his home on the morning of September 23, 2022. The agents were armed and pointed their weapons at the Houck family before taking Mark into custody. Like Lemon, Houck was charged under the FACE Act after confronting an abusive abortion activist outside of a clinic in 2021 — Houck was not tried in state court, and the activist's lawsuit against Houck failed, too. But the Biden DOJ wanted to put Houck behind bars for 11 years and $350,000 in fines. Houck was acquitted in January 2023.\n\nNearly a dozen other pro-life activists faced similar charges under the FACE Act. Several, including Jean Marshall and Joan Bell, were convicted under the FACE Act. So was Paula Harlow, who was convicted for praying in the doorway of an abortion clinic. She was sentenced to two years in prison at the age of 76, with the judge mockingly telling Harlow to \"pray\" over her health concerns.\n\nNot one person currently screaming about the FACE Act being used to rightly charge Don Lemon and his pals cared a bit about Daleiden, Merritt, Baker, Houck, and the rest. Many of them cheered those prosecutions, because their preferred ox (abortion) was being gored or, in Baker's case, their false narratives were being exposed.\n\nMeanwhile, Don Lemon hasn't been asked to surrender his passport (he even gets to take his summer vacation to France), and he showed up at the Grammys last night, too.\n\nDon Lemon steps out at the Grammys days after being taken into custody by federal agents. https://t.co/BK9E6u63mE📸 Getty pic.twitter.com/KUuwwPlctN— TMZ (@TMZ) February 2, 2026\n\nHave you spotted the difference? Lemon gets to go about his life as if he did nothing wrong. Meanwhile, the lives of other journalists and average Americans are thrown into chaos, using the full weight of the federal government. And I suspect if Democrats get back into power, we'll see more Bakers and Houcks than we will Lemons.\n\n \"For my friends, everything. For my enemies, the law.\"","url":"https://townhall.com/tipsheet/amy-curtis/2026/02/02/vip-don-lemon-treatment-n2670472","image":"https://media.townhall.com/cdn/hodl/2020/153/a347680f-b1e3-438a-abf9-270dbd4ec6de.jpg","video":null,"publish_date":"2026-02-02 19:00:00","author":"Amy Curtis","authors":["Amy Curtis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.272},{"id":398696006,"title":"How Nicki Minaj Took MAGA by the Hand","text":"“She reached out to me and she said she’s been praying about it,” Bruesewitz said last week, “and it’s been on her heart that she wants to speak out.”\nIn November, Bruesewitz and Minaj strode into the United Nations together, with paparazzi on hand to document his neatly cropped suit and her dramatic fur coat. Following an introduction from UN ambassador Mike Waltz, Minaj and Adonu appeared at an event about Nigeria. After Minaj joined Erika Kirk onstage at Turning Point USA’s annual convention the following month, JD Vance described her comments at the event as “really profound.” The emergence of MAGA’s new, preeminent pop-culture avatar reached its apex on Wednesday, when Minaj stood palm in palm with Trump at an event for a new savings and investment program for children, her long nails grazing over the president’s much-studied hand makeup.\nFrom one vantage, it is unlikely that the majority of the Barbz, the devout community of Minaj fans who are surely aware of her prior criticisms of Trump on social media, would have seen such an arc coming. But in Bruesewitz’s view, the alliance was no great surprise, nor did it warrant the eyebrows raised across the mainstream press. “I think they are very similar people,” he says, noting that the rapper and the president were both raised in Queens. And then there was what he saw as their outsider status, a sense of persecution perpetuated by a sweeping, Democrat-aligned entertainment and media apparatus—he emphasized that Minaj has never won a Grammy.\n“New York Times, CNN, MSNBC,” Bruesewitz says, “they treat Nicki the way that Trump is treated by those places.”\n“The hate or what people have to say, it does not affect me at all,” Minaj said as Trump smiled behind her on Wednesday. “It actually motivates me to support him more.” It was, despite the online outcry, a natural attitudinal fit: Her career has been powered in part by her appetite for protracted public feuds with her fellow female rappers, Megan Thee Stallion and Cardi B among them, both of whom endorsed Kamala Harris during the 2024 campaign. “You look pretty good behind the seal, by the way,” Bruesewitz told Minaj during a fireside chat. “I must admit: Your competition, which really isn’t competition, didn’t really look good behind the seal when they were with Kamala Harris.”\nTrump’s affiliation with hip-hop more broadly dates back to his time in New York’s nightclubs during the ’90s, a history evoked by his answers to recent questions about whether he would consider pardoning Sean “Diddy” Combs. After inspiring countless rap lyrics in the decades to follow, his 2024 campaign advisers figured they could lean into the outlaw credibility accrued by the criminal charges he faced and the attempt on his life. As Bruesewitz spent time in Los Angeles in recent years, building ties with entertainers, athletes, and influencers, he started talking with Amber Rose, the model and hip-hop personality who dated Kanye West before marrying Wiz Khalifa. (She and the Pittsburgh rapper divorced in 2016.) Rose, who announced her support for Trump shortly before speaking at the Republican National Convention during the campaign, started adding Bruesewitz to group chats with her rapper friends and introduced him to Minaj.\nAt the RNC, Rose also met Florida congresswoman Anna Paulina Luna. At 36, Luna, a former model, has described herself as “one of the OG politicos on Instagram”—it was Charlie Kirk, with his own emphasis on the importance of social media in politics, who first encouraged her to pursue this path—and since her election in 2023, has helped foster ties between Republicans and rappers including 50 Cent and Tory Lanez. “When they tried to take [Trump’s] mugshot,” Luna said last week, “that actually was the biggest backfire in American history.”\nRose eventually put Luna in touch with Minaj as well, and in July, months before any of Minaj’s recent Trump-affiliated appearances, she and the congresswoman were tweeting at each other about Minaj’s claim that an associate of a rival’s record label was threatening her.\n“Please text my cell,” Luna wrote. “I will forward this to law enforcement immediately.”\nLuna declined to go into details about “potentially illegal activity” that she said Minaj was facing, but the union was solidified: They talked backstage at Minaj’s Turning Point appearance.\n“Obviously we’ve seen that Hollywood has increasingly, for those that are conservative,” Luna says, “been more accepting and changed its perspective.” She believes that Minaj’s Republican affinities signal a broader shift in the works.\n“I look forward to seeing who else comes out as a conservative,” Luna says. “I hear there’s a lot.”\nMinaj sat by Trump at the premiere of Melania on Thursday night, and Katie Miller will release a podcast interview with her on Tuesday. As it happens, Bruesewitz’s wedding took place on Saturday at Trump’s National Doral golf resort in Miami, and the guest list demonstrated some of the overlap between MAGA’s A-list—Don Jr., Karoline Leavitt—and the entertainment world—Mike Tyson, St. Louis rapper Sexyy Red. When Rose discussed the occasion during a recent livestream, she said that during the 2024 campaign, she and Minaj would talk about their mutual support of Trump, but Minaj kept it quiet at the time. Now the secret was out.\n“She’s sitting next to me at the wedding,” Rose explained.","summary":"Jarring as the alliance has seemed, it grew from a certain attitudinal resonance between the rapper and the president, each raised in Queens and bearing a sense of persecution, as well as some increasingly overlapping social circles.","url":"https://www.vanityfair.com/style/story/nicki-minaj-maga-trump-alliance","image":"https://media.vanityfair.com/photos/6980ee31e6c090bec7779d3a/16:9/w_4640,h_2610,c_limit/2258679012","video":null,"publish_date":"2026-02-02 18:48:41","author":"Dan Adler","authors":["Dan Adler"],"language":"en","source_country":"US","sentiment":0.282},{"id":398696742,"title":"CNN Data Guru Hits Trump With Major Midterm Warning After Humiliating GOP Defeat","text":"CNN data guru Harry Enten has issued a severe warning to President Donald Trump after Republicans were thrashed in a special election in the heart of MAGA country. \n\nDemocratic candidate Taylor Rehmet, 33, swept to victory in Texas State Senate District 9, a ruby-red district that Trump handily won by 17 points in 2024, in a state Senate runoff on Saturday.\n\nSpeaking on CNN News Central, Enten called out GOP Florida Governor Ron DeSantis, who largely dismissed special elections as “quirky” in a post on X, saying he felt Republicans needed only to be “clear-eyed about the political environment heading into the midterms.”\n\n“What happened in Texas 9, it didn’t just swing to the left, it took a rocket ship to the left,” Enten said, suggesting it could be part of a wider trend. “My goodness gracious, the Texas 9 Senate district election margins; this was a district that Donald Trump won by 17 points in 2024.\n\n“For the Democratic candidate in the special election on Saturday—hello, won it by 14 points. That’s an over 30-point shift to the left. Any Republican—unlike Ron DeSantis, who doesn’t take this seriously—they should realize that this is very perilous. They ignore this result at their own peril. Ron DeSantis is right to say, ‘Hey, special elections can be quirky,’ but this ain’t no quirk.”\n\nThe victory saw Rehmet win 57 percent of the runoff vote to overcome Republican Leigh Wambsganss, despite her having Trump’s endorsement and what the Texas Tribune described as a “furious funding push in a bid to tilt the election in [her] favor in the final days.”\n\nWhen it was raised that the storm that gripped much of the U.S. last week could have been to blame for the special election’s result, Enten was unconvinced. “No, that ain’t no ice storm,” he said. “If you ignore this, you’re going to ice yourself out of a majority come the midterms.”\n\nHe continued, “So, you know, you see this 31-point shift to the left, right? If this were just one election, that would be one thing. But it’s the slew of special elections that together paint a picture, and it’s a picture that Democrats should love and a picture that Republicans should be really worried about, because what are we talking about here? \n\n“The average 2025-2026 special elections Democrats are doing, get this, 12 points better—12 points better—than Kamala Harris did in 2024. And that was a state special election that happened in Texas on Saturday. If you look at the federal special elections, this 12 points is actually north of 15 points on average,” Enten continued.\n\nEnten said that it paints a gloomy picture for the GOP heading into the midterms.","summary":"CNN / CNNCNN data guru Harry Enten has issued a severe warning to President Donald Trump after Republicans were thrashed in a special election in the heart of MAGA country. \n\nDemocratic candidate Taylor Rehmet, 33, swept to victory in Texas State Senate District 9, a ruby-red district that Trump handily won by 17 points in 2024, in a state Senate runoff on Saturday.\n\nThe first-time candidate’s victory is being heralded as a coup for Democrats and a major red flag for the GOP ahead of this year’s midterms, and CNN numbers wiz Enten thinks Republicans should be very worried.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/cnn-data-guru-harry-enten-hits-trump-with-major-midterm-warning-after-humiliating-gop-defeat/","image":"https://www.thedailybeast.com/resizer/v2/RXT57C3XEVCVRPDX6GPNK2IHZA.jpg?smart=true&auth=891b2e05bfad83242c180d13bb600510c07944719fe297cea30d533b3a1aa4e4&width=1440&height=1080","video":null,"publish_date":"2026-02-02 18:20:36","author":"Harry Thompson","authors":["Harry Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.252},{"id":398684646,"title":"Trump denies Epstein island visits, vows to sue over Trevor Noah’s Grammys joke","text":"Donald Trump raged on Truth Social early Monday after Grammy Awards host Trevor Noah cracked a joke about the president’s friendship with Jeffrey Epstein, implying that he and former President Bill Clinton were regular visitors to Epstein’s notorious Caribbean island.\n\nTrump also threatened to sue the “talentless” Noah over the joke, saying the comedian “better get his facts straight, and get them straight fast. It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$.”\n\nNoah, hosting the the Grammy Awards for the sixth and final time Sunday, incited Trump’s outrage after delivering the joke after Billie Eilish won Song of the Year for her hit, “Wildflower,” according to the Daily Beast and Politico.\n\n“Song of the year, congratulations Billie Eilish, wow,” the South African comedian said. “That is a Grammy that every artist wants, almost as much as Trump wants Greenland.”\n\n“Which makes sense, I mean, because Epstein’s island is gone, he needs a new one to hang out with Bill Clinton,” came Noah’s punchline. As the audience reacted to his joke, Noah reminded the crowd, “I told you it’s my last year! What are you gonna do about it?”\n\nBut an outraged Trump had something he wanted to do about it. On Truth Social, the president said: “Noah said, INCORRECTLY about me, that Donald Trump and Bill Clinton spent time on Epstein Island.WRONG!!! I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close.”\n\nTrump also said that “until tonight’s false and defamatory statement, (I) have never been accused of being there, not even by the Fake News Media.”\n\nTrump has denied any wrongdoing in relation to the Epstein sex trafficking allegations, according to Politico and the Daily Beast. There’s also no evidence that Trump ever visited Little Saint James, the small island in the U.S. Virgin Islands that Epstein owned and allegedly used as the base of his trafficking of underaged girls.\n\nIt’s been known that Trump and Epstein regularly socialized and were even said to be good friends for about 15 years until they had a falling out in the mid-2000s, according to the Daily Beast. A 2000 email from the Southern District of New York, which was included in a December release of Epstein documents released by the Justice Department, also revealed that Trump traveled on Epstein’s private jet “many more times than previously has been reported (or that we were aware),” the Daily Beast also reported. \n\nIn threatening to unleash his lawyers on Noah, Trump did not indicate whether he also planned to sue CBS Television Network or streamer Paramount+, which aired the awards show, Politico reported. But Trump raised the specter of his successful lawsuits against ABC News George Stephanopoulos and against CBS News, the latter over a 2024 “60 Minutes” interview with Kamala Harris.\n\n“Ask Little George Slopadopolus, and others, how that all worked out,” Trump said on Truth Social. “Also ask CBS! Get ready Noah, I’m going to have some fun with you! President DJT.”\n\nIn both lawsuits, which legal experts said the networks could have won, the networks agreed to pay multimillion-dollar settlements to the president, paid as donations to a future Donald Trump library.\n\nPrior to his Epstein island joke, Noah also angered the White House by commenting on the president’s curious friendship with 43-year-old rapper Nicki Minaj, the Daily Beast reported.\n\n“Nicki Minaj is not here. She is not here,” Noah said, which prompted loud cheers and applause from the Grammys audience. “She is still at the White House with Donald Trump discussing very important issues.”\n\nBreaking into an impression of Trump, Noah continued: “Actually Nicki, I have the biggest (expletive). I have it. Everybody’s saying it Nicki, I know they say it’s you but it’s me. Wap, wap, wap, look at it baby.”\n\nIn response, White House Communications Director Steven Cheung complained about the joke on X, writing in response to a Variety post: “And Trevor Noah is still a giant loser who will be forever known for being unceremoniously kicked off The Daily Show for being a complete psychopath, only to be replaced by a rotating cast of even bigger snowflakes.”","summary":"The president raised the specter of lawsuits against ABC and CBS as he fumed over comedian's Jeffrey Epstein joke at Grammy Awards.","url":"https://www.mercurynews.com/2026/02/02/trump-epstein-island-joke/","image":"https://www.mercurynews.com/wp-content/uploads/2026/01/What_3_million_new_documents_tell_us_about_Trump8217s_ties_to_Jeffrey_Epstein1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2026-02-02 18:11:34","author":"Martha Ross","authors":["Martha Ross"],"language":"en","category":"politics","source_country":"us","sentiment":-0.208},{"id":398713548,"title":"Trump threatens to sue Grammys host Trevor Noah over Epstein joke","text":"President Donald Trump on Monday threatened to sue Trevor Noah after the comedian joked about Trump during the Grammy Awards.In an early-morning post on Truth Social, Trump said he would be “sending my lawyers to sue this poor, pathetic, talentless dope,” without specifying what legal claims he would pursue.Noah, who hosted the Grammy Awards on Sunday night, referenced Trump while joking about the late financier and convicted sex offender Jeffrey Epstein.RELATED STORIES | Bad Bunny wins album of the year at the 2026 Grammy Awards, a first for a Spanish-language album“Song of the Year — congratulations, Billie Eilish. Wow,\" Noah said during the broadcast. \"That is a Grammy that every artist wants — almost as much as Trump wants Greenland, which makes sense because Epstein’s island is gone, he needs a new one to hang out with Bill Clinton.\"Trump has repeatedly sought to distance himself from Epstein. The two were photographed together socially in the late 1990s and early 2000s before an apparent falling out. Trump has said he never visited Epstein’s private island, where prosecutors say Epstein trafficked and sexually abused underage girls.RELATED STORY | Jimmy Kimmel returns to ABC; Trump threatens network with legal actionA potential lawsuit against Noah would not be Trump’s first legal clash tied to media coverage of him. Trump has frequently criticized late-night comedians, including Jimmy Kimmel, over jokes and political commentary.Trump has also pursued lawsuits against news organizations. In one case, he sued ABC News over comments made by anchor George Stephanopoulos. ABC agreed to a $15 million settlement, with the money designated for Trump’s future presidential library. More recently, Paramount, the parent company of \"60 Minutes,\" agreed to pay $16 million to settle a lawsuit filed by Trump over the editing of an interview with former Vice President Kamala Harris, then the Democratic presidential nominee. Trump alleged the interview was edited to make Harris appear more favorable. Paramount did not admit wrongdoing as part of the settlement and said the funds would also go toward Trump’s presidential library.","summary":"President Donald Trump on Monday threatened to sue Trevor Noah after the comedian joked about Trump during the Grammy Awards.","url":"https://www.scrippsnews.com/politics/the-president/trump-threatens-to-sue-grammys-host-trevor-noah-over-epstein-joke","image":"https://ewscripps.brightspotcdn.com/dims4/default/1352afe/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F67%2F80%2F08a0bb4341018297209b5ffd653a%2Ftwo-slot-1.png","video":null,"publish_date":"2026-02-02 17:59:13","author":"Scripps News Group","authors":["Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.447},{"id":398684804,"title":"A Republican turned Democrat, Geoff Duncan runs for Georgia governor","text":"MARIETTA, Ga. (AP) — Under the fluorescent lights of an American Legion hall near Atlanta, in front of more than a dozen Democratic activists, Geoff Duncan apologized for all the things that he did as a Republican. \n\nHe regrets opposing gun control. He’s sorry for fighting the expansion of Georgia’s Medicaid program. And he’s most remorseful about supporting some of the strictest abortion rules in the country. \n\n“Unlike most folks in politics, I’m willing to say I’m sorry for that,” Duncan said.\n\nHe’s doing a lot of apologizing these days because the former Republican is running for governor as a Democrat, trying to win over members of his newly-adopted party in a crowded primary in a critical battleground state. Although some view Duncan as an interloper, he’s pitching himself as Democrats’ best chance to break their 24-year losing streak for Georgia’s highest office. \n\n“You’ve got to win more than your base,” Duncan said. “And so I’m the only one that shows up in this Democratic primary that’s building a big enough coalition of Democrats, independents, and this growing batch of disgusted Republicans.”\n\nDuncan was a standard-issue suburban Republican serving as lieutenant governor until the 2020 election, when he rejected President Donald Trump’s false claims about fraud. His stand earned him the respect of many Democrats, and he campaigned for Kamala Harris in 2024. Now he’s testing whether that can translate into votes in the party’s primary. \n\nHe’s not the only one. Former Republican congressman David Jolly is running for governor in Florida and former Republican lawyer George Conway is running for Congress in New York City, both as Democrats. \n\nTheir success or failure could provide lessons for the national party as it debates whether to focus on progressive ideas or court moderates and even conservatives turned off by Trump. Some still question why Harris barnstormed with Liz Cheney, a former Republican congresswoman, rather than focusing on motivating liberal voters during her failed presidential campaign. \n\n“The question for the Democratic Party is, which kind of church do you want to be?” asked Democratic commentator and political consultant Paul Begala. ”Do you want to be a church that hunts down heretics, or do you want to be a church that seeks out converts?”\n\nDemocrats are curious\n\nThere are six other people seeking the Democratic nomination as Georgia prepares to choose a successor to Republican Gov. Brian Kemp, who has served two terms and can’t run again. \n\nOther candidates include former Atlanta Mayor Keisha Lance Bottoms, former state Sen. Jason Esteves, former elected state Labor Commissioner Michael Thurmond, and state Reps. Ruwa Romman and Derrick Jackson.\n\nSome Democrats are at least curious about Duncan, a perpetually tanned former minor-league baseball player. Tamara Stevens, a Democratic activist in Forsyth County north of Atlanta, said Esteves is her “ideal candidate.” But she’s considering Duncan because she’s seeking the most likely winner. \n\n“I don’t have to agree with him on every issue. I don’t have to like him personally,” Stevens said. “I want a candidate that can win. Because we’ve been on the losing end far too long, and it’s been devastating to our community.”\n\nMindy Seger, a prominent Cobb County Democrat who attended Duncan’s meeting at the American Legion hall, described him as “relatable” but had her doubts. \n\n“I think people have trust issues,” she said. “I do.”\n\nFred Hicks, a Democratic strategist in Georgia, noted Duncan kept identifying as a Republican, even while campaigning for Kamala Harris, until finally converting last August. He said some Democrats fear Duncan could be “a Trojan horse.”\n\n“It looks like he just wants to be in power and he couldn’t get there by being a Republican” Hicks said.\n\nPurity or pragmatism for primary voters?\n\nDuncan’s challenge was clear when he was campaigning at a coffee shop in Atlanta on the day after he announced his candidacy in September. While talking to reporters, he stood under a mural of civil rights icons and Democratic politicians — including Bottoms, one of Duncan’s primary opponents. \n\nBlack voters are typically the majority of the Democratic primary electorate in Georgia, with Black women having particular influence. Hicks said it’s a “bit of reach” to believe they’ll choose Duncan over Bottoms, Esteves and Thurmond, who are all Black.\n\n“I think he’s going to really struggle with that when you have different types of Democrats who have been Democrats for their entire life who are running,” Hicks said.\n\nDuncan’s message about transcending partisanship could attract donors. He said in Marietta that he had already received 8,900 contributions from all 50 states, although he didn’t say how much he’d raised.\n\nOne option in Georgia — which doesn’t register voters by party — is for Duncan to court independents and Republicans to cross over into the Democratic primary on May 19. Two years ago, more than 37,000 typically Democratic voters voted in the Republican primary to help Secretary of State Brad Raffensperger defeat Trump’s handpicked candidate.\n\nDuncan said he’s building “big enough a coalition that we can not only win a primary, but we can win a general election.”\n\nBegala said Democrats alarmed by the Trump administration may look past purity tests in 2026.\n\n“Electability is a more potent message in a primary this year than I have ever seen,” he said.\n\nHe said converting former Republicans will be key to any Democratic victories in states like Georgia, Texas or Alaska.\n\n“You actually have to get people coming over to your side who used to be on the other side,” Begala said.\n\nWhit Ayres, a longtime Republican pollster and consultant, estimates around 10% of Republicans remain deeply opposed to Trump, not counting those who already left the party. But they may already be voting in Georgia’s Republican primary, where Raffensperger is running for governor. \n\nHe’s skeptical that Democratic primary voters will think strategically about a general election, rather than just seek out the candidates who most closely align with their own views. \n\n“Donald Trump has changed so many things about American politics that I think we need to keep an open mind about other things that might be changed,” Ayres said. “But we’re going to have to have the folks like the Liz Cheneys, the Geoff Duncans, the George Conways prove that they can be successful as Democrats before many of us will believe.”","url":"https://apnews.com/article/geoff-duncan-republican-democrat-georgia-governor-trump-f82bcb8f4f07d7586509f5c3b24614c1","image":"https://dims.apnews.com/dims4/default/069a316/2147483647/strip/false/crop/5397x3598+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F47%2Fa08a4871358fcc25b2a319c7f606%2F875768b323a041e8b4673b30cc3f780f","video":null,"publish_date":"2026-02-02 17:52:34","author":"Jeff Amy","authors":["Jeff Amy"],"language":"en","category":"politics","source_country":"us","sentiment":0.047},{"id":398713080,"title":"Melania has nothing to tell us","text":"“All I did is marry him. You are the ones who gave him power,” Curtis Sittenfeld wrote in American Wife, her 2008 fictionalised study of Laura Bush. Sittenfeld lingered on the contradiction: a socially liberal Democrat, supportive of abortion rights and same-sex marriage, married to the most powerful conservative man in America. It was, in the end, a story about love and about the quiet erasure that marriage can demand – a story, too, about America. “She wondered who she was becoming in his shadow.”\n\nIt would be generous to assume Melania Trump exists in similar political tension with her husband. Across her on-again, off-again decade in public life, she has remained curiously opaque: at best a meme, at worst a grift. Yet the bare facts of her biography remain inherently cinematic. Childhood in communist Yugoslavia. The glamour and precarity of the 1990s modelling circuit. Marriage to a reality-TV tycoon who would go on to reshape not only American politics but global political culture. “Everyone wants to know my story,” she announces in the opening voiceover of her new, self-titled film. “Well, here it is.”\n\nExcept, it’s not. Here is absolutely nothing. Seventy-five million dollars (Amazon reportedly paid $40m for rights and another $35m on marketing) for two hours of almost pure absence. Melania glides, stern-faced and silent, through Trump Tower, Mar-a-Lago, and into the official corridors of power in Washington. Heels high. Hair lacquered. Sunglasses fixed. The project, which is director Brett Ratner’s first feature film since sexual assault allegations made against him in 2017, has been widely slated as propaganda. But propaganda needs a message, and there isn’t one.\n\nInstead, we trail her through the 20 days preceding last January’s inauguration: gilded penthouse to gilded jet to gilded Florida club. A flat, affectless narration, backed by relentless 1980s pop, delivers corporate-brochure platitudes: “Mar-a-Lago is more than a home. It’s warmth, family and friends.” “I will move forward with purpose and, of course, style.” Melania’s central tension, improbably, becomes whether the top of her now-famous inauguration hat can be made “less wibbly-wobbly”. When Donald Trump finally appears, it comes almost as a relief. Ah, a face that moves. A man without an internal edit button. Maybe his fresh appeal is the true point of the propaganda: after all, the president had tight editorial control over the project. In it’s opening weekend the film has exceeded box office predictions, bringing in $7m, but remains unlikely to turn a profit.\n\nFirst Lady is less a job than a full-time performance: professional wife, brand custodian, symbolic citizen. It requires the surrender of identity, privacy and ambition to the mythology of the presidency. The work is aesthetic: hosting, dressing, endorsing causes sufficiently universal to offend no one. Jill Biden’s decision to continue teaching in 2021 was a historical first. Michelle Obama’s post-White House career reads like an extended exhale. Melania has occasionally acknowledged the transactional nature of her marriage, but accidental global symbolism is a long way from Manhattan society appearances.\n\nWas this film an attempt to seize control of her own narrative? It gestures lamely towards the American dream: work hard enough, and you too might float, like Melania, inside a baroque penthouse in the sky. Hamfistedly, we hear that the US took in Tham Kannalikham, Melania’s Laotian interior designer, when she was two years old, giving her a place to dream and flourish. Hamfisted, as I say, at the best of times. But these are increasingly looking like some of the worst times for immigrants, or people who look like they could be immigrants, in America. Ice (Immigration and Customs Enforcement) continues to terrorise streets across the nation, leaving communities too afraid to leave their homes. Last year, the federal force detained around 70,000 people, roughly 4,000 of whom were children, some as young as one and two. In 2025, 32 people died in Ice facilities.\n\nThe climax, late in the film, is Trump’s second inauguration, which feels like lifetimes ago. On 20 January 2025, Joe Biden smiles with polite vacancy while Kamala Harris checks her watch. Waiting to enter the Rotunda for her husband’s swearing-in, Melania looks directly into the camera. “Here we go again.”\n\nAnd again. And again. And again.\n\nDonald Trump’s shadow will continue to fall across America and the world for years after his presidency ends. But the narrative of Melania Trump is less clear. For all the money spent attempting to tell her story, it is still, conspicuously, unwritten.","summary":"The First Lady's documentary gestures lamely toward the American dream","url":"https://www.newstatesman.com/culture/2026/02/melania-has-nothing-to-tell-us","image":"https://dl6pgk4f88hky.cloudfront.net/2026/02/02/gettyimages-2256971448.jpg","video":null,"publish_date":"2026-02-02 17:47:47","author":"Catharine Hughes","authors":["Catharine Hughes"],"language":"en","category":"politics","source_country":"gb","sentiment":0.234},{"id":398687364,"title":"Even CNN Admits That Democrats Are Screwed","text":"CNN’s Chief Data Analyst Harry Enten may have just done the unthinkable — he admitted to his network’s leftist audience what Republicans have known for a long time: Democrats are in serious trouble.\n\nAs PJ Media previously reported, Democrats are facing an existential crisis with the forthcoming 2030 census. On Sunday, Enten broke down those population trends that spell disaster for the left, and he wasn’t offering a friendly warning, but more like an electoral obituary.\n\n“Look, in politics, we often lose sight of the long term because we’re so focused in on the short term,” he said. “So today I wanted to take a look at some long-term population trends that really should set off a flashing red siren to Democrats nationwide, while bringing a big smile to the faces of Republicans nationwide.”\n\nAnd with that, Enten launched into what might be the most brutal wake-up call for the left CNN has ever aired. “According to the latest population estimates that take into account the population mid-2025, the biggest population growth this decade — all five of the states, states that Donald John Trump won. Donald John Trump won in 2024 — Texas, Florida, North Carolina, Georgia, and of course, the great State of Arizona, where I spent my New Year’s Eve.”\n\nThen came the gut punch for the Democrats. “These were the biggest gainers,” he said. “We’re looking at a red state boom here. But it is not just a red state boom. We’re also looking at what I would dare call a blue-state depression.”\n\nRecommended: Democrats Plan to Cosplay Project 2025 With Their Own ‘Project 2029,’ and I Can't Even\n\n“The lowest domestic net migration this decade — all five of the states that were won by Kamala Harris in 2024,” Enten noted. “Look at this: California, Harris’ home state; New York, where I’m coming from right now; of course, Illinois, New Jersey, and of course the great Commonwealth of Massachusetts, which is a bastion of blue liberalism.” These, he emphasized, “are the states that folks in the United States are moving away from and into the red states, which is propelling a red state boom.”\n\nIf that wasn’t enough bad news for the Democrats, Enten turned to the political fallout. “Now, this is interesting, right? But it could also have major political ramifications if it holds for 2030, the next census,” he warned. “If, in fact, the 2025 population shifts hold for the 2030 census, look at this. Look at the House seat shifts by state.” Then he delivered the line that surely made Democratic strategists choke on their avocado toast. “If, in fact, the 2025 population shifts hold for 2030, states that Kamala Harris won, they would lose. They would lose seven seats in the United States House of Representatives. The states that Donald Trump won in 2024, they would gain; they would gain seven seats.”\n\nWhen you think about how close the House of Representatives is now, you know this is a huge deal. That CNN is admitting all of this is also quite significant.\n\nBut Enten wasn’t done rubbing salt in the wound. The shift doesn’t just hit Congress; it impacts the entire Electoral College. “Because the number of electoral votes that each state gets is equal to the number of senators, plus the number of House seats,” he said. “If you remember back in 2024, right, it was all about the blue wall... If Kamala Harris could win the baseline Democratic states and then add in the blue wall states of Michigan, the Commonwealth of Pennsylvania and Wisconsin, she would get to 270 electoral votes.”\n\nThen came the bomb: “If all of a sudden, we, in fact, have applying the 2025 estimates, the population estimates to the Electoral College, the blue states, plus the blue wall of Michigan, Pennsylvania, and Wisconsin would no longer be enough,” Enten said flatly. “Under the current estimates, you get to exactly 270 electoral votes, the minimum needed to win the Electoral College. If, in fact, you apply the 2025 estimates, look at that — you would only get to 263 electoral votes if you were a Democrat, which would mean a Republican victory.”\n\nEnten concluded with a warning that sounded almost like a eulogy. “We’re still a number of years away from reapportionment,” he said, “but what we can say so far is we got a red state boom going on, a blue state depression going on, people moving from the blue states to the red states. And if it holds for 2030, well, it would make the Democratic nominee for President’s job of winning the Electoral College that much more difficult.”\n\n🚨NEW: Enten *SOUNDS ALARM* over Dems' long-term political odds🚨\"The biggest population growth this decade: All 5 of the states are states that Trump won! ... But it's not just a red state boom. We’re looking at what I would dare call a blue state depression.\" @DailyCaller pic.twitter.com/XidlrPHb97— Jason Cohen 🇺🇸 (@JasonJournoDC) February 2, 2026\n\nAnd that’s a rather long-winded way of Enten saying that the Democrats are screwed.\n\nThank you for your attention to this matter.\n\nWant to support fearless journalism that exposes the Left and tells the stories the media won’t? PJ Media delivers the truth and holds the powerful accountable. Become a VIP member today—your support fuels our mission and unlocks exclusive content, podcasts, an ad-free experience, and more.\n\nUse code FIGHT for 60% off. It's a great time to join our movement. Join now and stand for America-first journalism!","url":"https://pjmedia.com/matt-margolis/2026/02/02/even-cnn-admits-that-democrats-are-screwed-n4949015","image":"https://media.townhall.com/cdn/hodl/2025/87/e9316abe-0d77-47f9-818f-21c47992a249.png","video":null,"publish_date":"2026-02-02 17:46:00","author":"Matt Margolis","authors":["Matt Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.181},{"id":398684338,"title":"Democrats must ignore the witterings of Billie Eilish","text":"Awarded Song of the Year at Sunday night’s Grammys, ‘Wildflower’ singer Billie Eilish forwent the customary shout-outs to manager, agent and God (in that order) to condemn Donald Trump’s immigration enforcement. The 24-year-old announced that ‘no one is illegal on stolen land’, rambled for a few solipsistic sentences (‘I just feel really hopeful in this room… our voices really do matter’), before concluding with: ‘Fuck Ice.’ Safe to say the Gettysburg Address isn’t getting knocked off its perch any time soon.\n\nAirhead celebrity inarticulately repeats fashionable views heard on TikTok — stunning and brave, no doubt, but hardly original. ‘No one is illegal’ has become a standard rhetorical trick in the debate over illegal immigration, and if you want to have some fun I suggest asking if that applies to Israeli settlers living in the West Bank. Be prepared for your green-haired interlocutor to leap from ‘it’s all just lines on a map’ to a sudden zeal for national borders that even Pat Buchanan would deem a bit intense.\n\nAlso, a point we have to keep going over: the land upon which European settlers built the United States was not stolen but conquered — land fought for and won. The colonisation of North America was hardly a workshop on human rights observance but, by the standards of such enterprises, far, far from the most brutal or bloody. The life of the average native American is immeasurably better — in health, education, income, almost any metric you consider — than would have been the case had the colonists remained in Europe.\n\nSingers and actors have been saying dumb or obnoxious things about politics for as long as journalists have tried to engage them on the subject. During the first Trump administration Madonna admitted to having ‘thought an awful lot about blowing up the White House’. John Wayne infamously told Playboy: ‘I believe in white supremacy until the blacks are educated to a point of responsibility.’ Silent-era star Adolphe Menjou, once asked about Canadian communists visiting the United States, retorted: ‘I hope they go to Texas. The Texans will kill them.’ Interventions like Eilish’s are less shocking because they reflect a broader escalation in polarised political rhetoric.\n\nIt is of trifling significance that a pop singer speaks in these terms. It is of much greater import that mainstream public figures talk like this now too. Shortly after Joe Biden entered the Oval Office, federal agencies were instructed to stop using the term ‘illegal alien’. His vice president Kamala Harris once said: ‘An undocumented immigrant is not a criminal.’ Democrat congresswoman Ayanna Pressley says: ‘We are all on stolen land.’ Last year, the Democrat National Committee opened its annual summer meeting with a land acknowledgment: ‘This land was not claimed, or traded – it’s a part of a history of broken treaties and promises. And, in many ways, we still live in a system built to suppress Indigenous peoples’ cultural and spiritual history.’\n\nThese comments are no less mush-brained than Eilish’s Grammy witterings. The difference is that when the Democrats meme and vibe themselves ever further left in reaction to Donald Trump’s authoritarian populism they ask independent and moderate voters to choose between two extremes: vote here if you think your country is a racist, genocidal endeavour; vote there if you want more soccer moms and ICU nurses gunned down in the street. Your average celebrity, journalist, academic or other progressive activist cannot fathom why anyone wouldn’t gladly agree to the former, which is exactly why such people should be locked in a basement between now and the November midterms.\n\nThe Democrats need a position on immigration that is distinct from Trump’s wild west posse raiding and rounding up peaceful, otherwise law-abiding illegal migrants, but which also acknowledges the virtue of borders, undertakes to enforce them, and directs federal agencies to focus on removing violent and dangerous aliens and disrupting workplaces where illegal migrants are being exploited. The Democrats can win in November, but if they want to parlay congressional gains into 270 or more electoral college votes in 2028, thus locking JD Vance out of the Oval Office, they have to return to the national mainstream on illegal immigration and much else besides. Billie Eilish doesn’t need a political party, ordinary Americans do.","url":"https://spectator.com/article/democrats-must-ignore-the-witterings-of-billie-eilish/","image":"https://spectator.com/wp-content/uploads/2026/02/GettyImages-2258921737.jpg","video":null,"publish_date":"2026-02-02 17:40:12","author":"Stephen Daisley","authors":["Stephen Daisley"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.122},{"id":398689636,"title":"Trump threatens to sue Trevor Noah over ‘false and defamatory’ Epstein jab at Grammy Awards","text":"President Donald Trump on Monday blasted the Grammy Awards as \"virtually unwatchable\" and threatened legal action against host Trevor Noah over what he called a \"defamatory\" Jeffrey Epstein jab. Noah hosted the politically charged event Sunday evening, when several liberal musicians criticized the Trump administration’s immigration policies. At one point, Noah suggested Trump wanted Greenland because he needed a new island to \"hang out with Bill Clinton\" on, since the disgraced, deceased financier’s private island is no longer available. \"The Grammy Awards are the WORST, virtually unwatchable! CBS is lucky not to have this garbage litter their airwaves any longer. The host, Trevor Noah, whoever he may be, is almost as bad as Jimmy Kimmel at the Low Ratings Academy Awards. Noah said, INCORRECTLY about me, that Donald Trump and Bill Clinton spent time on Epstein Island. WRONG!!! I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight’s false and defamatory statement, have never been accused of being there, not even by the Fake News Media,\" Trump posted on Truth Social. EXCLUSIVE: EPSTEIN EMAILS RELEASED AS DOJ SAYS NO CRIMINAL OR INAPPROPRIATE CONDUCT BY TRUMP \"Noah, a total loser, better get his facts straight, and get them straight fast. It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$. Ask Little George Slopadopolus, and others, how that all worked out,\" Trump continued. \"Also ask CBS! Get ready Noah, I’m going to have some fun with you! President DJT.\" A representative for Noah did not immediately respond to a request for comment. In November, the Epstein Files Transparency Act passed, requiring the government to release within 30 days all unclassified material in its possession related to Epstein's and associate Ghislaine Maxwell’s sex trafficking cases. Trump signed the bill into law that month. JUSTIN BIEBER STUNS GRAMMYS BY PERFORMING IN UNDERWEAR; TREVOR NOAH JOKES ABOUT NICKI MINAJ IN MONOLOGUE The Justice Department released more than 3 million Epstein records, including his personal emails, on Friday. Deputy Attorney General Todd Blanche told Fox News Digital that \"in none of these communications, even when doing his best to disparage President Trump, did Epstein suggest President Trump had done anything criminal or had any inappropriate contact with any of his victims.\" Trump’s threat to sue Noah comes as the president pursues multiple ongoing lawsuits, including legal action against the BBC, The Des Moines Register, veteran pollster Ann Selzer, the IRS and the Treasury Department. In December 2024, ABC News reached a $16 million settlement with Trump and issued an apology after anchor George Stephanopoulos wrongly claimed that Trump was found \"liable for rape\" in the former president’s civil case against columnist E. Jean Carroll. In fact, a New York jury found him liable for sexual abuse. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE In July, Paramount reached a multimillion-dollar settlement with Trump after he accused CBS News of \"election interference\" over its handling of a \"60 Minutes\" interview with then-Vice President Kamala Harris in the lead-up to the 2024 election. The Grammy Awards will move to Disney networks and streaming services in 2027 after 54 years on CBS. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital’s Brooke Singman contributed to this report.","summary":"President Donald Trump on Monday threatened legal action against Grammy Awards host Trevor Noah over a &quot;false and defamatory&quot; Jeffrey Epstein joke.","url":"https://www.foxnews.com/media/trump-threatens-sue-trevor-noah-over-false-defamatory-epstein-jab-grammy-awards","image":"https://static.foxnews.com/foxnews.com/content/uploads/2026/02/donald-trump-mar-a-lago.jpg","video":null,"publish_date":"2026-02-02 17:04:46","author":"Brian Flood","authors":["Brian Flood"],"language":"en","category":"politics","source_country":"us","sentiment":-0.592},{"id":398678376,"title":"Guest Commentary: This Unfortunate State of Affairs","text":"By Mark W. Fowler\n\n“Ignorance like this cheapens the horror of the Holocaust.” —Rabbi Yehuda Kaploun\n\nThe good rabbi was speaking of the ignorant and outrageous statements of Minnesota Governor Tim Walz, who compared the work of Immigration and Customs Enforcement (ICE) agents in Minneapolis to the horror visited on Jews. Well, the governor missed the whole point. Anne Frank was a law-abiding citizen persecuted and imprisoned only because of her religion and race. ICE agents are arresting those with orders of deportation and a history of violent crime. They are not picking up gardeners, maids, and nannies. If they were, the ACLU would have filed a writ of habeas corpus by now, and we would have heard that story in endless detail. It has not happened.\n\nWalz and his sidekick, Mayor Jacob Frey, bear significant responsibility for the violence in Minneapolis. Their sanctuary policies make it impossible for ICE to obtain custody of illegal immigrants in the criminal justice system for other reasons. If that were possible, one or two ICE agents could corral the people they seek within the safe confines of the jail. But Walz and Frey made that impossible.\n\nNot only did they make it impossible, but they also fanned the flames of violence and heated rhetoric. When you repeatedly claim ICE officers are acting like Nazis, you create an atmosphere of hatred that impairs judgment and feeds passion. The two individuals killed by ICE agents were killed because they and others were violent and/or reckless. Whether or not they deserved to be killed is something judges and juries will ultimately determine, hopefully in the confines of a safe courthouse.\n\nIt is preposterous to requires law enforcement officers to ignore their own safety and to make fine distinctions between what is and is not life-threatening in a fraction of a second. All of this could be avoided if Walz and Frey would cooperate with law enforcement. They prefer to protect lawlessness and criminals.\n\nIn addition to the fiasco described above, Walz presided over Minnesota while Somalis stole billions of dollars.\n\nWalz and Frey join California Governor Gavin Newsom, Minnesota Congresswoman Ilhan Omar, Texas Senate candidate Jasmine Crockett, former Vice President Kamala Harris, and Supreme Court Justice Ketanji Brown Jackson as examples of people who should not be allowed in government under any conceivable circumstances.\n\nNewsom has presided over billions of excessive spending. California has gone from having a budget surplus to having billions of debt, in part due to mismanagement and in part due to providing healthcare, housing, and economic assistance to illegal immigrants. Thousands of homes and billions of dollars of property were lost in a fire, now determined to be wholly preventable if the reservoir had been filled and organic debris cleared from power line right of ways.\n\nIlhan Omar has managed to turn her congressional career into lucrative opportunities for her husband’s consulting service and is now reporting an increase in net worth of 3,500% over where she started. She has ties to some of the individuals implicated in the fraud in Minnesota. Do the math.\n\nCrockett is running for the Senate in Texas, and her only qualification is an uncanny ability to speak gibberish in front of television cameras.\n\nHarris, whose incompetence is demonstrable every time she speaks, has claimed that many have said she was the most qualified person ever to run for president, an absurd claim she believes despite the obvious credentials of Washington, Jefferson, Lincoln, both Roosevelts, Eisenhower, and Kennedy, all of whom were far more qualified than she will ever be.\n\nDEI hire Supreme Court Justice Ketanji Brown Jackson, the same person who could not define a woman because she’s not a biologist, has a reputation for speaking the most in oral arguments and comprehending the least. Her comments are frequently peppered with, “I don’t understand.” Indeed.\n\nThe list of fools and knaves goes on: Karen Bass, mayor of Los Angeles, felt compelled to travel out of the country at the peak of fire season to attend an inaugural ceremony in Ghana. Because Ghana is so critical to … something undefined in Los Angeles. To her credit, she had the integrity to admit it was a mistake. Governor and possible presidential contender JB Pritzker of Illinois faces a $3 billion shortfall in the 2026 budget, on top of a pension deficit, which is estimated to be $141 billion. Illinois has the poorest performing pension of any state in the country. Potential pension beneficiaries are in for a rude awakening. Spending under Pritzker’s tenure has increased by over 40%.\n\nH. L. Mencken, an American pundit, once observed, “Democracy is the theory that the common people know what they want and deserve to get it good and hard.” Minnesota and Illinois prove him right.","url":"https://patriotpost.us/opinion/124777-this-unfortunate-state-of-affairs-2026-02-02","image":"https://img.patriotpost.us/01GR4QNK1K7PV7B16TYRNJ89RV.jpeg","video":null,"publish_date":"2026-02-02 17:00:14","author":"Mark W. Fowler","authors":["Mark W. Fowler"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.628},{"id":398666150,"title":"Donald Trump Threatens To Sue Trevor Noah Over 'Epstein Island' Joke","text":"The sun had scarcely risen on Monday morning when President Donald Trump erupted on Truth Social, hurling insults at Trevor Noah and pledging legal action against the Grammy Awards host over a joke made during Sunday's ceremony.The jab was brief — just a few seconds of stage banter during the 68th annual Grammy Awards — but it has now triggered another salvo in Trump's aggressive litigation campaign against media entities and personalities.Noah, hosting the event for what he announced would be his sixth and final year, made a quip suggesting Trump desired Greenland 'almost as much' as he wanted Jeffrey Epstein's private island to spend time with Bill Clinton. Trump responded by labelling Noah 'a total loser' and declaring: 'It looks like I'll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$.'The threat arrives amid a broader pattern of Trump weaponising the courts against journalists and entertainers. In July, Paramount agreed to pay Trump $16 million to settle a lawsuit over CBS's editing of a Kamala Harris interview.Last December, ABC News settled a dispute with Trump for $15 million, to be donated to his presidential library, over comments made by anchor George Stephanopoulos. Trump's reference in his Truth Social post to 'Little George Slopadopolus' signals his intention to follow the same playbook against Noah and CBS.'I have never been to Epstein Island, nor anywhere close, and until tonight's false and defamatory statement, have never been accused of being there, not even by the Fake News Media,' Trump wrote. Yet the Justice Department's release of 3 million additional pages of Epstein investigation documents on 30 January names Trump more than 3,000 times — although, as Deputy Attorney General Todd Blanche noted on State of the Union, some tips involving Trump relied on anonymous and second-hand information that cannot be practically investigated.Noah's Epstein Quip Amid Broader Grammy Political Moment And CBS's ExitNoah also deployed darker humour about Trump's litigation record during the ceremony. 'The Grammys are airing completely live,' he announced, 'because if we edited any of the show, the president would sue CBS for $16 billion.'The remark drew audible gasps and laughter, acknowledging what has become an uncomfortable reality in American entertainment — the occupant of the Oval Office has become a constant threat to broadcast networks.Sunday's ceremony marked CBS's final year broadcasting the Grammys after 26 years; ABC will take over next year. Noah also used his opening to announce what he called his 'term limit' philosophy, saying: 'I believe in term limits. I want to set an example for anyone watching this show. Leave when your time is up.' The quip appeared directed at Trump, who has openly discussed seeking a third presidential term.Bad Bunny's Grammy Victory Overshadowed By Trump's Epstein FuryThe political tensions at the Grammys extended beyond Noah's monologue. Bad Bunny won Album of the Year for Debí Tirar Más Fotos, becoming the first Latin artist in the ceremony's 68-year history to claim the award.Yet his acceptance speech pivoted immediately to immigration: 'Before I say thanks to God, I'm going to say: ICE out. We're not savages, we're not animals, we're not aliens. We are humans, and we are Americans.'​​The remark drew a standing ovation, but it also underscored the real human stakes beneath the entertainment spectacle. Dozens of artists wore 'ICE OUT' pins throughout the evening, protesting the administration's deportation crackdowns.Bad Bunny, who was born in Puerto Rico and holds American citizenship, recalled announcing in 2024 that he would not perform on mainland America due to fears his concerts could become sites of ICE raids.Now, accepting music's highest honour, he stood on the Grammy stage to claim his people's humanity before the nation.​Yet Trump's overnight fury consumes the narrative, reducing a night of musical celebration to another chapter in his vendetta against perceived slights. Noah, unflinching, closed his remarks with a knowing smirk: 'I told you it's my last year. What are you going to do about it?","url":"https://www.ibtimes.co.uk/donald-trump-threatens-sue-trevor-noah-over-epstein-island-joke-1775753","image":"https://d.ibtimes.co.uk/en/full/1787942/donald-trump.jpg?w=1600&h=900&q=88&f=71716b1dc8b559f3ae8ab18f411fd654","video":null,"publish_date":"2026-02-02 16:52:16","author":"Jaja Agpalo","authors":["Jaja Agpalo"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.534},{"id":398684340,"title":"When will celebrities stop moralising?","text":"When hosting the Golden Globes in 2020, Ricky Gervais delivered a delicious demolition of Hollywood’s political pretensions, telling his A-list audience: ‘if you do win an award tonight, don’t use it as a platform to make a political speech. You’re in no position to lecture the public about anything. You know nothing about the real world. Most of you spent less time in school than Greta Thunberg. So, if you win, come up, accept your little award, thank your agent, and your God, and fuck off’. Sadly, it seems the message didn’t sink in.\n\nAwards season is upon us once again, meaning saturated coverage of Tinseltown. The self-congratulatory tone of it all is bad enough, but somehow these overpaid luvvies can’t resist using award ceremonies as a chance to lecture us mere mortals.\n\nAt last night’s Grammy awards, the singer Billie Eilish, after winning Song of the Year, bleated ‘as grateful as I feel, I honestly don’t feel like I need to say anything but that no one is illegal on stolen land’. A teary-eyed Sabrina Carpenter nodded and applauded as if she’d just witnessed Martin Luther King’s ‘I Have a Dream’ speech. Joni Mitchell, Kehlani and Justin Bieber wore ‘ICE out’ pin badges in protest at the Trump administration’s immigration policies.\n\nAh yes, the awards season pin badge. At this year’s Golden Globes, the US talk show host Bill Maher was asked on the red carpet why he wasn’t wearing a lapel pin in honour of Renee Good, who had recently been shot dead by ICE agents in Minneapolis. At the time, he responded: ‘It was a terrible thing that happened and it shouldn’t have happened and, if they didn’t act like such thugs, it wouldn’t have had to happen, but I don’t need to wear a pin about it.’\n\nA decent enough response in the moment. But on the most recent episode of his Real Time show on Friday, Maher devoted an entire monologue to the question, railing ‘I hope I didn’t spoil the perfect record of pins and ribbons solving all the world’s problems. I mean you can’t name a problem from guns to Aids, from bullying to breast cancer, that still exists after people wore a ribbon for it. Except all of them you fucking posers.’ Like Gervais, Maher is one of the few celebrities to fully appreciate the absurdity of Hollywood’s performative moralising.\n\nIs it that overpaid luvvies genuinely feel they are swaying hearts and minds to the liberal cause? If so, their delusion has reached new levels. At the last election, Kamala Harris won endorsements from Beyoncé, Oprah Winfrey, Taylor Swift, Megan Thee Stallion, George Clooney, Leonard DiCaprio, Bruce Springsteen, Ariana Grande, Barbra Streisand, Olivia Rodrigo, Charli XCX, and many, many more. And a fat lot of good it did her – she lost every single swing state.\n\nIn fact, an October 2024 survey of registered voters in Ohio found that 24 per cent of respondents said Taylor Swift’s endorsement of Harris made them less enthusiastic of her, compared to 14 per cent who said it made them more enthusiastic. So Tay-Tay’s primary contribution to the presidential election was to motivate Republican voters in the rust belt. Perhaps she was a sleeper agent for Trump?\n\nThankfully, there are still some celebrities with the intellectual humility to stay in their lane. In a recent interview with Vanity Fair, The Crown actress Claire Foy said ‘what I believe and who I am and where I stand on things is constantly in flux, as much as it is for everyone else, and I have absolutely no authority to discuss or proclaim about anything other than what I do as an actor.’ She concluded, ‘if you’re just making noise for the sake of it, then you should probably shut up – so I tend to shut up’. Hear, hear!\n\nIs it any wonder the viewing figures for awards shows are in long-term decline, when the Hollywood elite use them as a platform for political preening? Conan O’Brien is scheduled to host the Oscars next month. He’s a fine comedian, but unlikely to offend the liberal sensibilities of his audience. So here’s an idea – pay him off, and get Ricky Gervais to host the proceedings again, with Bill Maher reporting from the red carpet while forcibly removing every virtue-signalling lapel badge. Maybe they can even find a gong for Claire Foy. I’d be stunned if that didn’t get more viewers.","url":"https://spectator.com/article/when-will-celebrities-stop-moralising/","image":"https://spectator.com/wp-content/uploads/2026/02/GettyImages-2259492750.jpg","video":null,"publish_date":"2026-02-02 16:40:57","author":"James Hanson","authors":["James Hanson"],"language":"en","source_country":"gb","sentiment":-0.046},{"id":398694436,"title":"Barron Trump's Safety Fears Exposed: The Don's Son, 19, 'Uncomfortable' Exiting Vehicles in Public After Assassination Attempts of Prez","text":"Barron Trump's safety fears were exposed in his mother, Melania Trump's, new documentary film, Melania, RadarOnline.com can reveal.\n\nWhile not a ton was divulged about Barron in the movie, Melania did open up about his reaction to the assassination attempts made on the teen's father, Donald Trump.What Is Barron Trump Afraid of?According to the first lady, after the assassination attempt was made on the Prez's life, Barron became uncomfortable getting out of cars in public view.\n\n\"I respect that,\" she says in the film. \"It's his decision.\" \n\nIn other parts of the movie, Melania described her son as being a \"confident man.\" She also was seen giggling when CNN's Jake Tapper commented on Barron's height and fondly reminisced on swimming lessons he took at Mar-a-Lago with her father. \n\nBarron's voice is interestingly not heard throughout the film aside from one muffled piece of audio.What Did the Film Say About Donald Trump's Other Children?While Melania openly discussed Barron in the film, Donald's other children also appeared in it. \n\nMelania was not seen interacting with any of them, though, as they only appeared in the documentary at various events with their own families. \n\nAside from Barron, Donald, and her father, Melania is not seen having exchanges with any other family members at any part of the documentary.Donald Trump's Reaction to Having to Ride to the Inauguration With Joe BidenOne interesting moment in Melania with Donald is when he and Melania are briefed that they're going to have to ride to the inauguration with former president Joe Biden and his wife, Jill.\n\n\"That's interesting,\" Donald says. \"That'll be an interesting drive.\"\n\nWhile the Trumps don't say anything negative about the Bidens on Inauguration Day in the movie, he did not hold back on his thoughts when he gave his public inauguration speech. \n\n\"From this moment on, America's decline is over,\" Trump shared, clearly showing his belief that Biden was an incompetent president. \n\nKamala Harris was also seen briefly in the film right before she and Joe were welcomed into the Capitol Rotunda to see the transition of power from Joe to Donald. Harris, whom Trump defeated in the 2024 election, appeared uneasy and was captured sighing prior to walking through the curtains.Jimmy Carter's Funeral Was a Focal Point of the DocumentaryFormer President Jimmy Carter's funeral was also a focal point of the documentary. \n\nThe memorial service took place on January 9, 2025, and Melania was open about the fact the date was significant to her due to her mom dying one year earlier on the same date. \n\nAfter his funeral service, she explained she was caught up thinking about her deceased and beloved mother. \n\nWhen she returned to New York City following the funeral, camera crews followed her into Saint Patrick's Cathedral as she lit a candle in memory of her mom.\n\nMelania officially premiered in theaters last Friday.","summary":"Barron Trump's safety fears have been exposed in his mother, Melania Trump's, new film.","url":"https://radaronline.com/p/barron-trump-safety-fears-donald-assassination-attemps-exposed-melania-film/","image":"https://media.radaronline.com/brand-img/qP14vLRln/0x0/barron-trump-safety-fears-exposed-melania-film-1770046156814.jpg","video":null,"publish_date":"2026-02-02 16:08:40","author":"Matt Richards","authors":["Matt Richards"],"language":"en","category":"politics","source_country":"us","sentiment":-0.164},{"id":398651594,"title":"Previously undisclosed UAE stake in Trump company sparks new controversy","text":"In mid-September 2024, Donald Trump had plenty on his plate. He was the Republican Party’s presidential nominee in a competitive race with roughly seven weeks until Election Day; he had just lost a debate against then-Vice President Kamala Harris; and he was maintaining an active travel and media schedule.\n\nBut on Sept. 16, literally one day after an apparent assassination attempt, Trump did something unheard of in American politics: He launched a cryptocurrency business, called World Liberty Financial.\n\nControversies soon followed. Trump faced awkward questions, for example, about the curious group of business partners with whom he had linked arms. A year later, in one of the most scandalous presidential pardons in American history, Trump pardoned Changpeng Zhao, the convicted founder of the crypto exchange Binance, which just so happened to have struck a lucrative business deal with World Liberty Financial.\n\nThe broader story, however, hasn’t hit rock bottom just yet. The Wall Street Journal reported:\n\nFour days before Donald Trump’s inauguration last year, lieutenants to an Abu Dhabi royal secretly signed a deal with the Trump family to purchase a 49% stake in their fledgling cryptocurrency venture for half a billion dollars, according to company documents and people familiar with the matter. The buyers would pay half up front, steering $187 million to Trump family entities.\n\nThe deal with World Liberty Financial, which hasn’t previously been reported, was signed by Eric Trump, the president’s son. At least $31 million was also slated to flow to entities affiliated with the family of Steve Witkoff, a World Liberty co-founder who weeks earlier had been named U.S. envoy to the Middle East, the documents said.\n\nThe deal, the Journal added, “marked something unprecedented in American politics: a foreign government official taking a major ownership stake in an incoming U.S. president’s company” — which, at the time, “had no products.”\n\nAlthough the reporting wasn’t independently verified by MS NOW, a spokesperson for World Liberty Financial confirmed the investment to The New York Times.\n\nThe Journal added that the investment “was backed by Sheikh Tahnoon bin Zayed Al Nahyan, an Abu Dhabi royal who has been pushing the U.S. for access to tightly guarded artificial intelligence chips.” Tahnoon, brother to the United Arab Emirates’ president, is also sometimes referred to as the “spy sheikh.”\n\nThe UAE had initiated related efforts to obtain AI chip information during the Biden administration, which resisted for national security reasons, including concerns about the technology reaching China. But at about the time that the UAE struck a deal with the Trump-owned company, the Trump administration also approved an export deal for the AI technology the Emirati government wanted.\n\nImagine that.\n\nThe latest details led Democratic Sen. Chris Van Hollen of Maryland to argue: “Foreign countries are bribing our president to sell out the American people.”\n\nIan Bassin, a veteran of the Obama administration, added: “I was a White House ethics lawyer. I used to advise people not to even accept a free cup of coffee from someone who had interests before them. And staff followed those rules. I can’t even find the words to describe the scale of Trump’s corruption here.”\n\nIn the president’s first term, there was considerable interest in the emoluments clause and foreign interests renting rooms at Trump-owned properties. In his second term, the seeming corruption is spectacularly worse.\n\nhttps://bsky.app/profile/atrupar.com/post/3mdsqoobv5v2u\n\nOn ABC News’ “This Week,” host George Stephanopoulos asked Deputy Attorney General Todd Blanche about the burgeoning scandal. Blanche, a former Trump defense counsel, replied: “I love it when these papers talk about something being unprecedented or never happening before, as if the Biden family and the Biden administration didn’t do exactly the same thing, and they were just in office.”\n\nBlanche, referring to the Journal’s reporting, added: “Look, I saw that article. I don’t have a comment on it beyond President Trump has been completely transparent when his family travels for business reasons.”\n\nThere are a few elements to this that are worth keeping in mind. First, never in American history has a foreign country bought a stake in a company owned by the American president, even as the president negotiated foreign policy matters with the other country. The idea that Joe Biden did “exactly the same thing” is plainly ridiculous.\n\nSecond, if Trump had been “completely transparent” about all of this, the Journal’s reporting would have been old news. It wasn’t — because all of this had been secret from the public up until now.\n\nAnd third, let’s not overlook the fact that Blanche was offered an opportunity to offer his best possible defense of the president. Evidently, he couldn’t think of anything persuasive.\n\nI guess that’s not too surprising, given how difficult it is to defend the indefensible.","url":"https://www.ms.now/rachel-maddow-show/maddowblog/previously-undisclosed-uae-stake-in-trump-company-sparks-new-controversy","image":"https://res.cloudinary.com/msnow/images/f_auto,q_auto/v1770044267/260202-donald-trump-tahnoun-bin-zayed-al-nahyan-zz_11648680d82e_11648682297b/260202-donald-trump-tahnoun-bin-zayed-al-nahyan-zz_11648680d82e_11648682297b.jpg?_i=AA&w=1200&h=630&crop=1","video":null,"publish_date":"2026-02-02 16:02:56","author":"Sydney Carruth","authors":["Sydney Carruth"],"language":"en","source_country":"us","sentiment":-0.272},{"id":398651976,"title":"CNN’s Harry Enten Says Democrats Will Have Tough Time Taking Back White House","text":"CNN senior data reporter Harry Enten said on Sunday that Democrats may struggle to win the Electoral College in the upcoming presidential elections as more people move to red states.\n\nThe U.S. Census Bureau found that states that President Donald Trump won in 2024, including Texas, Arizona and Florida, have witnessed the biggest population growth throughout this decade, while states won by former Vice President Kamala Harris have seen the lowest domestic net migration, Enten said on “CNN Newsroom.” If current trends hold through the 2023 census, it could mean that blue states, plus the blue wall states of Michigan, Wisconsin and Pennsylvania, would no longer be enough for a Democratic candidate to win the White House.\n\n“Well, if you remember back in 2024, right, it was all about we were talking about the blue wall of Kamala Harris could win the baseline democratic states, and then add in the blue wall states of Michigan, the Commonwealth of Pennsylvania and Wisconsin, she would get to 270 electoral votes,” Enten said. “But if all of a sudden, we in fact, have applying the 2025 estimates, the population estimates to the electoral college, the blue states, plus the blue wall of Michigan, Pennsylvania, and Wisconsin would no longer be enough.” (RELATED: The US Is Undergoing A Massive Population Shift And It’s Bad News For Dems)\n\nIf Harris had won Pennsylvania, Michigan and Wisconsin, along with the Democratic strongholds, she would have secured the needed 270 electoral votes and won the 2024 election. However, if the 2030 census undergoes these drastic population changes, a Democratic candidate would hypothetically only win 263 electoral votes, which would not be enough to win the election.\n\n“Under the current estimates, you get to exactly 270 electoral votes, the minimum needed to win the electoral college. If in fact, you apply the 2025 estimates, look at that, you only get to 263 electoral votes, if you were a Democrat, which would mean a Republican victory. Now, of course, we’re still a number of years away from reapportionment, right? We take the census come 2030,” Enten continued.\n\nBetween 2020 and 2024, the population decline in blue states like California, Illinois and Massachusetts is projected to shift roughly 8 to 12 electoral votes away from Democratic strongholds in the 2032 election. The population growth in Texas, Florida and other red states will also help Republicans gain seats in the House of Representatives, as states won by Harris are projected to lose around a dozen House seats.\n\nDemocrats and Republicans have undergone major redistricting efforts, particularly in Texas and California, ahead of the 2026 midterm elections.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Michigan, Pennsylvania, and Wisconsin would no longer be enough'","url":"https://dailycaller.com/2026/02/02/cnn-harry-enten-democrats-electoral-college-blue-state-migration/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2026%2F02%2FScreenshot-2026-02-02-at-10.49.22%E2%80%AFAM-e1770047404443.png","video":null,"publish_date":"2026-02-02 16:02:23","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","category":"politics","source_country":"us","sentiment":-0.022},{"id":398637260,"title":"Americans’ gun rights under threat by Trump, allies fear","text":"Gun rights are at risk under Donald Trump, allies of the US president fear.\n\nMr Trump has repeatedly said Alex Pretti, an anti-immigration protester shot to death by federal agents, should not have been carrying a firearm at the demonstration Minneapolis in January.\n\nPro-gun groups say Pretti, who did not draw his weapon and appeared to have been disarmed before he was shot, was acting within the law, and fear the president’s comments could signal a clampdown on Second Amendment rights.\n\nQuestions have been raised by powerful gun lobbies – who are usually allies of Maga – over whether Mr Trump is as instinctively pro-gun as other Republicans.\n\nSince Pretti was shot dead, the president has sought to lessen tensions in Minneapolis, sacking Gregory Bovino, the border patrol commander who had been tasked with spearheading his mass deportation programme.\n\nDespite saying Pretti was not an “assassin”, as senior officials have claimed, Mr Trump repeatedly criticised the 37-year-old nurse for carrying a gun even though he was legally licensed to do so.\n\n“He shouldn’t have been carrying a gun,” he told reporters on Tuesday, adding: “I don’t like that he had a gun. I don’t like that he had two fully loaded magazines. That’s a lot of bad stuff.”\n\nOutside the White House the same day, he claimed: “You can’t have guns. You can’t walk in with guns. You just can’t.”\n\nBryan Strawser, the chairman of the Minnesota Gun Owners Caucus (MGOC), said he was “concerned about the president’s comments”.\n\n“We’re hoping that this doesn’t indicate a new shift in direction from the administration on the Second Amendment,” he added, while noting the Trump administration had been broadly supportive of gun rights.\n\nOther senior government figures have echoed the president’s comments. Kash Patel, the FBI director, prompted outrage when he claimed Pretti broke the law by bringing a gun to a protest.\n\n“You cannot bring a firearm, loaded, with multiple magazines to any sort of protest that you want. It’s that simple. You don’t have a right to break the law,” he told Fox News, suggesting Pretti had tried to “incite violence”.\n\nMr Strawser went on to note that while Mr Trump’s sons, Donald Jr and Eric Trump, were vocal supporters of the Second Amendment, “that’s not [the president’s] style”.\n\n“Having been a creature of New York City, it’s really just not a place you see a lot of pro-Second Amendment activism language coming out of,” he said.\n\nIn 2000, Mr Trump supported a ban on assault weapons and a “slightly longer waiting period to purchase a gun”. He abandoned those stances more than a decade later when he ran for the Republican presidential nomination.\n\nHe had a concealed carry licence in New York, but it was suspended in 2023, following his indictment on criminal charges.\n\nThis also meant that two of his three licensed guns were surrendered to the authorities, while the third was moved to Florida, according to CNN.\n\nAidan Johnston, the federal affairs director of Gun Owners of America (GOA), said he “disagreed” with Mr Trump’s comments following the Minneapolis shooting and accused the justice department of mishandling a number of Second Amendment disputes.\n\nAlthough Mr Trump pledged to tear up restrictions on gun ownership brought in by his predecessor, Joe Biden, the administration has “continued to fight” the GOA, he said.\n\nFor example, the justice department opposed repealing registration requirements on suppressors and short-barreled firearms last year.\n\nNevertheless, Mr Johnston said: “By and large, President Trump has taken some of the most pro-gun actions in recent history to help gun owners.”\n\nKostas Moros, a director with the Second Amendment Foundation (SADF), said Mr Trump’s comments were “definitely a concern”.\n\n“Sometimes the president… will say things, but that doesn’t actually mean there’s been any policy shift, so that’s what we’re hoping happened here,” he said.\n\n“That said, it is still important when the president says something, it creates impressions, it’s detrimental. So we weren’t happy to hear what he said, and we also believe, of course, it’s factually just incorrect.”\n\nMr Moros called on Mr Trump to “retract or clarify what he meant”, but noted other members in the administration were strong defenders of the Second Amendment. “I don’t have reason to believe yet that there’s any policy shift,” he said.\n\nKaroline Leavitt, the White House press secretary, insisted on Monday there had “been no greater supporter or defender of the right to bear arms than President Donald J Trump”.\n\nThe gun rights groups did not specifically endorse Mr Trump in the 2024 election, but all of them were much more closely aligned with the president’s stance on the Second Amendment than his Democratic opponent, Kamala Harris.\n\nMs Harris, herself a gun owner, had backed a ban on assault weapons, expanding background checks and “red-flag” gun confiscation laws.\n\nSome have accused Democrats of seeking to exploit Pretti’s death for political advantage, despite their previous attempts to impose gun restrictions.\n\nGavin Newsom, who has rebuked Mr Trump for eroding Second Amendment rights, was accused of “blatant hypocrisy” by Mr Moros.\n\n“Nothing is sacred in Trump’s America; not the First Amendment, not the Second, not even life itself,” the California governor said on Tuesday.\n\nHowever, Mr Moros claimed that: “Everything Alex Pretti was doing at that event, [Mr Newsom] tried to ban. The magazines over 10 rounds, the gun with the threaded barrel, and carrying at a public gathering.”\n\n“Both sides definitely deserve some criticism.”\n\nMinneapolis, where it is legal to carry a gun openly or concealed, has seen surge in armed citizens in the past several years, initially spurred by the murder of George Floyd and riots that followed.\n\nThe applications for permits to carry guns nearly tripled by 2021 in the Blue City and surrounding areas, including many first-time firearm owners, such as Pretti would be a few years later.\n\nIt reflects a broader trend of an increase in gun ownership in Liberal areas.\n\nWith ICE agents still deployed in the Midwestern city, there has been a surge of interest in gun licenses amid the unease, fear and clashes.\n\n“People tend to panic and want to run out to get their permits,” one firearms instructor told NBC News.\n\nAfter Renee Good, a mother-of-three was shot dead by ICE agents on Jan 7, the Minnesota chapter of the Socialist Rifle Association told its members to reach out to local “ICE watch groups”.\n\nIn the wake of Pretti’s killing three weeks later, the Liberal Gun Club, released a statement calling for a through investigation, calling “the right to keep and bear arms is fundamental”.\n\nHundreds of residents are now rushing to obtain permits, according to firearms instructors in the city.","url":"https://uk.news.yahoo.com/americans-gun-rights-under-threat-153740502.html","image":"https://s.yimg.com/ny/api/res/1.2/WsrSAh5wwDO9QexD2_IumA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNTAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_telegraph_818/4f113c3e8b810e84577024345d27bdc9","video":null,"publish_date":"2026-02-02 15:37:40","author":"Benedict Smith","authors":["Benedict Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.301},{"id":398664886,"title":"Does it matter when celebrities like Bad Bunny castigate Trump and ICE at the Grammys? You bet! | Jason Okundaye","text":"One of the most discordant and yet banal things about looking to the US today is how celebrity, its greatest cultural output, largely carries on as normal amid scenes of profound distress. Award ceremonies are televised, bespoke couture is pulled for the red carpet, some new film fills your social media timeline. It feels galling that a country can encompass such a sense of anguish at the same time as such glamour and wonder. And given that we are condemned to witness ICE’s transformation into a lethal, paramilitary force, such an event as the 68th Grammy awards, broadcast last night, feels at once insignificant and more important than ever as all the world watches.\n\nThe Grammys saw perhaps the most uninhibited and genuinely furious rebuke of ICE and Donald Trump that we have seen so far from celebrity figures – particularly considering that just last month, the Golden Globes was viewed as having largely ignored politics, save for a few “ICE Out” pins worn by stars including Ariana Grande and Mark Ruffalo. Grammy attendees went further. Billie Eilish followed up her call for celebrities to speak up against ICE, saying that “no one is illegal on stolen land … I feel that we just need to keep fighting and speaking up and protesting, our voices do matter and the people matter.” Perhaps most movingly, considering his stated concern around the mass deportation of Latino people, album of the year winner Bad Bunny said: “ICE out. We’re not savages, we’re not animals, we are humans and we are Americans … the only thing that is more powerful than hate is love.” These came alongside celebrations of immigration from Olivia Dean and Shaboozey.\n\nThere is the blunt question of how consequential any kind of celebrity political activism is. Celebrities speaking on mass platforms can, of course, help to normalise a discourse and unveil what is occurring to those whose engagement with the news may only be through culture. Yet it has always been viewed as a limited approach. In 2024, Saturday Night Live mocked the “teeny tiny statement pin” favoured by celebrities on the red carpet, skewering it for evidencing a commitment to saying something while saying as little as possible. But even when the statements are loud and unequivocal, there is still the same chorus: why should any of us care about what celebrities have to say?\n\nCynicism is warranted, considering how American spectacle has functioned more as a redirection of interest away from atrocity rather than a tool for politicisation: consider the Rafah airstrikes two years ago in Gaza, which occurred as millions of Americans celebrated the Super Bowl, which had run ads from the Israeli government. There is also the fact that celebrity enthusiasm for Kamala Harris – from “Kamala is brat”, to Taylor Swift’s “childless cat lady” post, to Megan Thee Stallion’s rally performance in Atlanta, Georgia – now figures prominently in diagnoses of why the campaign was a complete failure.\n\nYet in spite of all of this, celebrity voices against ICE feel important. The terror inflicted by ICE is a far more visceral subject than an election campaign. ICE’s expansion has outpaced mechanisms to check its power, making all forms of resistance more urgent. It is not necessarily that anti-ICE activists need Hollywood’s seal of approval. But Trump evidently does – he recognises that art and culture are crucial frontiers in his bid for domination. It is one that will never succeed, no matter how many acolytes he sends to infiltrate the renamed Trump-Kennedy Center, despite his attempts to make an event of Melania’s trashy documentary, and even if he’s managed to win over rapper Nicki Minaj.\n\nWriting on Truth Social after the event, Trump said: “The Grammy Awards are the WORST, virtually unwatchable! CBS is lucky not to have this garbage litter their airwaves any longer”, and added that he would instruct lawyers to sue host Trevor Noah over his joke that “Trump wants Greenland … because Epstein’s island is gone he needs a new one to hang out with Bill Clinton”. He is probably due another tantrum after this Sunday’s Super Bowl half-time show.\n\nClearly, for the Puerto Rican Bad Bunny or the Nigerian Shaboozey, the tyranny of ICE is deeply personal, and they have a right, like anyone, to make their views known. Indeed, Bad Bunny’s NUEVAYoL is a tribute to the Puerto Rican diaspora in New York City, with the accompanying music video criticising anti-immigrant sentiment. So perhaps it is something of a misnomer to reduce this to “celebrity” activism when these people, really, are speaking as artists. Art has always had a core, contested function in politics. And who wants artists to put up and shut up more than Trump?\n\n Jason Okundaye is an assistant opinion editor at the Guardian","summary":"Famous people who speak out are often derided, but throughout time artists have used the platform they have. And if not now, when?\n\nOne of the most discordant and yet banal things about looking to the US today is how celebrity, its greatest cultural output, largely carries on as normal amid scenes of profound distress. Award ceremonies are televised, bespoke couture is pulled for the red carpet, some new film fills your social media timeline. It feels galling that a country can encompass such a sense of anguish at the same time as such glamour and wonder. And given that we are condemned to witness ICE’s transformation into a lethal, paramilitary force, such an event as the 68th Grammy awards, broadcast last night, feels at once insignificant and more important than ever as all the world watches.\n\nThe Grammys saw perhaps the most uninhibited and genuinely furious rebuke of ICE and Donald Trump that we have seen so far from celebrity figures – particularly considering that just last month, the Golden Globes was","url":"https://www.theguardian.com/commentisfree/2026/feb/02/grammys-bad-bunny-donald-trump-ice-artists","image":"https://i.guim.co.uk/img/media/39e9df92fecca2c76f62882a13e631c5cb388f0b/122_0_3785_3028/master/3785.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2026-02-02 15:07:33","author":"Jason Okundaye","authors":["Jason Okundaye"],"language":"en","source_country":"gb","sentiment":0.16},{"id":398636566,"title":"Trump threatens to sue Trevor Noah over Epstein island joke at Grammys","text":"WASHINGTON — President Donald Trump threatened to sue Trevor Noah after the comedian joked during the Grammys about Trump and former President Bill Clinton visiting the private island of accused sex trafficker Jeffrey Epstein.\n\nTrump denied ever visiting Epstein's Little St. James island in the U.S. Virgin Islands in an early morning Feb. 2 post on Truth Social.\n\n\"I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight’s false and defamatory statement, have never been accused of being there, not even by the Fake News Media,\" Trump said. \"Noah, a total loser, better get his facts straight, and get them straight fast. It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$.\"\n\nMore: Musk exchanged emails with Epstein about partying on private island\n\nNoah, who hosted the 68th Grammy Awards on Feb. 1, made the remarks in a monologue after congratulating singer Billie Eilish on winning the Grammy for song of the year.\n\n\"That is a Grammy that every artist wants almost as much as Trump wants Greenland, which makes sense, I mean, because Epstein’s island is gone, he needs a new one to hang out with Bill Clinton,\" Noah said. \"Oh, I told you it's my last year. What are you going to do about it?\" the comedian added as the crowd roared.\n\nEarlier in the show, Noah, a native of South Africa who has hosted the past six Grammy Awards, said it would be his last time hosting the Grammys as he took another jab at Trump. \"I believe in term limits. I want to set an example for anyone watching the show. Leave when your time is up,\" he said.\n\nThe Grammys aired on CBS. Trump's latest legal threat comes after Paramount in July agreed to pay Trump $16 million to settle a lawsuit against CBS over the editing of an interview with former Vice President Kamala Harris. In December 2024, ABC News agreed to give $15 million to Trump's future presidential library to settle a lawsuit over comments from anchor George Stephanopoulos on the civil case brought against Trump by writer E. Jean Carroll.\n\n\"Ask Little George Slopadopolus, and others, how that all worked out,\" Trump wrote in his post. \"Also ask CBS! Get ready Noah, I’m going to have some fun with you!\"\n\nNoah's Epstein joke followed the the Justice Department's Jan. 30 release of 3 million additional pages of documents from the Epstein investigation that mention many powerful men including Trump, billionaire tech executive Elon Musk and Microsoft co-founder Bill Gates. The documents don't support Trump or Clinton visiting Epstein's island.\n\nTrump, however, has previously accused Clinton and others of visiting Epstein's island despite a lack of evidence. Epstein, in a 2015 email released in November by the House Oversight Committee, said Clinton never visited the island. \"Clinton was NEVER EVER there, never,\" Epstein wrote.\n\nMore: 3 million more Epstein pages with 2,000 images publish, ending review\n\nEpstein owned two islands, Little St. James and Great St. James, both in the U.S. Virgin Islands. Much of Epstein's alleged trafficking of underage girls reportedly occurred at his compound on Little St. James.\n\nDrawing criticism from Epstein survivors, the Justice Department withheld about 2.5 million documents in its possession, citing privacy concerns of victims, depictions of child sexual abuse, active federal investigations and various privileges such as legally-protected communications between a lawyer and a client.\n\nDeputy Attorney General Todd Blanche pushed back at any assertions that the department tried to protect powerful men. \"We did not protect President Trump,\" Blanche said. \"We didn't protect or not protect anybody.\"\n\nReach Joey Garrison on X @joeygarrison.","url":"https://eu.usatoday.com/story/news/politics/2026/02/02/trump-threatens-lawsuit-trevor-noah-epstein-island-grammys/88472753007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2026/02/02/USAT/88473285007-2259495165.jpg?auto=webp&crop=4999,2812,x0,y0&format=pjpg&width=1200","video":null,"publish_date":"2026-02-02 14:58:18","author":"Usa Today","authors":["Usa Today"],"language":"en","category":"politics","source_country":"us","sentiment":-0.237},{"id":398638998,"title":"'The Hunger Games' Star Billy Porter Attacks Nicki Minaj Over Trump Support: 'F**k Her'","text":"Actor Billy Porter attacked rap megastar Nicki Minaj over her support for President Donald Trump, repeatedly declaring, “Fuck her.”\n\n“Fuck her,” Porter said after being asked about Minaj and her support for President Trump during an interview on the red carpet at the MusiCares gala in Los Angeles, California, on Friday.\n\n“Fuck her,” the Cinderella star reiterated. “When people show you who they are, believe them the first time.”\n\n“Fuuuuck herrrr,” Porter added for a third time, in an exaggerated hiss.\n\nPorter, who has joined the cast of the upcoming The Hunger Games prequel, The Hunger Games: Sunrise on the Reaping, is also known for going on tirades over his left-wing political views.\n\nLast summer, the Pose actor — who, during the 2024 election said he wanted Kamala Harris to go even “further” on the transgender agenda and wanted the news media to censor Trump’s opposition to sex-change procedures for children — attacked the United States as a “racist” country that he claims is just like “Nazi Germany.”\n\nAs for Minaj, she has been increasingly outspoken about political issues in recent months, praising President Trump for intervening and taking the “mass slaughter” of Christians in Nigeria by radical Islamists “seriously,” and blasting California Gov. Gavin Newsom (D) over his stance on making children transgender.\n\nThose sentiments were followed by the “Super Bass” singer appearing at Turning Point USA’s America Fest conference in December, where she elaborated on her views onstage and announced she is speaking out politically because she “got tired of being pushed around,” adding, “I’m not going to back down ever again.”\n\nMinaj also said that being able to speak at AmericaFest was more important than any concert she has ever performed anywhere in the world, because slain conservative icon Charlie Kirk’s organization is “a direct link between young people and God.”\n\nLast month, the “Starships” singer called for disgraced former CNN anchor Don Lemon to be thrown in jail after he and his film crew joined a group of anti-ICE agitators who stormed into a Minnesota church during service where they chanted “Hands up, Don’t shoot,” and “ICE out.”\n\nLast week, Minaj appeared at the Trump Accounts Summit, where she promoted the president’s new $1,000 tax-advantaged investment accounts program and proclaimed, “I am probably the president’s number one fan, and that’s not going to change.”\n\nAlana Mastrangelo is a reporter for Breitbart News. You can follow her on Facebook and X at @ARmastrangelo, and on Instagram.","summary":"Actor Billy Porter attacked rap megastar Nicki Minaj over her support for President Donald Trump, repeatedly declaring, \"F**k her.\"\n\n\nThe post &#8216;The Hunger Games&#8217; Star Billy Porter Attacks Nicki Minaj Over Trump Support: &#8216;F**k Her&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2026/02/02/the-hunger-games-star-billy-porter-attacks-nicki-minaj-over-trump-support-fk-her/","image":"https://media.breitbart.com/media/2026/02/billyporter-640x335.jpg","video":null,"publish_date":"2026-02-02 14:57:29","author":"Alana Mastrangelo","authors":["Alana Mastrangelo"],"language":"en","category":"politics","source_country":"US","sentiment":0.171},{"id":398628204,"title":"Why Netflix’s deal with the Obamas could put its bid to buy Warner Bros. at risk","text":"Netflix heads to Washington, DC, this week to testify about the streamer’s proposed acquisition of Warner Bros. Discovery — a couple weeks after President Trump posted an opinion piece on Truth Social headlined, “Stop the Netflix Cultural Takeover.”\n\nSources tell Page Six Hollywood that besides Trump wanting his ally Larry Ellison to win the bid for the famed studio, another reason the president is sour on the Netflix deal is, in part, because it’s been the home of the Obamas, insiders say.\n\nThe Obamas signed an exclusive deal with Netflix for their Higher Ground production company in 2018, during Trump’s first term. In 2019, Trump called for a financial investigation into the Obamas’ Netflix pact, asking Democrats to “look at the Obama book deal, or the ridiculous Netflix deal.” Insiders tell us that the Obamas’ deal with Netflix remains a major sticking point for Trump. “If Trump does put his fingers on the scale for Paramount, it’s going to be because of the Obamas,” said a source.\n\nHowever, sources tell us, the Obamas no longer have an overall deal at Netflix — and have also been making projects for other studios. But that hasn’t stopped those in the MAGA orbit from calling for Trump to block the Warner Bros. takeover.\n\nThere’s no love lost between the former first couple and Trump — particularly after Michelle skipped Trump’s second inauguration, even as Barack seemed friendlier with the Donald. “She showed up reluctantly for the election. They were united, but she doesn’t have to unify around [Trump]. She doesn’t have to say anything. Her absence speaks volumes,” an insider told Page Six at the time. (Barack attended the inauguration and was seen smiling and chatting with the president at Jimmy Carter’s funeral while Michelle also stayed away on a Hawaiian vacay.)\n\nConservatives have long been critical of Netflix’s programming for pushing progressive themes.\n\nAdding to the intrigue, Netflix CEO Ted Sarandos’ wife, Hollywood insider Nicole Avant, was named by Obama as Ambassador to the Bahamas. Then again, Netflix has been cozying up to Trump, including Sarandos. An insider told The Post’s Charlie Gasparino, “That meeting was key to getting our side of the story, how the antitrust implications are overblown… It lasted two hours because Ted (Sarandos) and the president got along great.”\n\nNicole is the daughter of late philanthropist Jacqueline Avant and famed music exec Clarence Avant. She’s also a top Democratic donor and raised more than $500M as a bundler for Obama’s campaign in 2012. She has also raised money for Kamala Harris, Joe Biden and California Gov. Gavin Newsom. (Then again, she told Dems after Trump won, “Don’t be whining all the time.”)\n\nTrump has said he’ll play an active role in how the White House views WBD’s future as it houses his nemesis news channel CNN, as well as HBO’s programming and other assets.\n\nA Netflix rep did not comment.","summary":"Sources say that another reason Trump is sour on the Netflix deal is because it's been the home of the Obamas.","url":"https://pagesix.com/2026/02/02/hollywood/why-netflixs-deal-with-the-obamas-could-imperil-its-bid-to-buy-warner-bros/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/12/Untitled-1-copy-40.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2026-02-02 14:45:00","author":"Ian Mohr,mliss1578","authors":["Ian Mohr","mliss1578"],"language":"en","source_country":"us","sentiment":-0.04},{"id":398611902,"title":"Bill Maher Torches Virtue-Signaling Lefty Celebs For Ditching Causes Once They're Not The 'Current Thing'","text":"After another awards show shitshow of anti-Trump-ism at The Grammy's, Bill Maher has had it with Hollywood’s relentless virtue signaling, and during his latest monologue on his HBO show Real Time with Bill Maher.\n\nAnd he really let the glitterati have it. \n\nMaher, a leftist liberal himself, began with mock enthusiasm for the endless parade of political posturing that now infects every red-carpet event.\n\n“How about everybody drop the politics for a couple of hours,” he quipped, “and just enjoy these happy, dopey celebrations of show business?” \n\nAt last month’s Golden Globes awards, a number of celebrities wore small, stylized pins tied to the Renee Good shooting, including vague slogans like and \n\n\"Of course, this is for the mother who was murdered by an ICE agent, and it's really sad. I know people are out marching and all today, and we need to speak up,\" actress Wanda Sykes told Variety on the red carpet before the award show. \"We need to be out there and shut this rogue government down, because it's just awful what they're doing to people.\" \n\nMaher, who was also at the event, recalled a reporter asking him why he wasn’t wearing a lapel pin at the Golden Globes last month for the shooting of Renee Good in Minneapolis. At the time, he said, “Well, it was a terrible thing that happened, and it shouldn’t have happened, and if they didn’t act like such thugs, it wouldn’t have had to happen. But I don’t need to wear a pin about it.” He then added, “If I had the chance to think about it, my answer would be exactly the same.”\n\nMaher then skewered the hysteria that followed his comments at the Golden Globes, where critics accused him of “refusing to join Golden Globes activism.” \n\nHis reply dripped with sarcasm.\n\nHe mocked the self-congratulation behind Hollywood’s symbolic gestures. “I hope I didn’t spoil the perfect record of pins and ribbons solving all the world’s problems. You can’t name a problem, from guns to AIDS to bullying to breast cancer, that still exists after people wore a ribbon for it—except all of them.”\n\nThe old liberal crusaders took a hit next. “You fucking posers. Three years ago, everybody was all into Ukrainian flags. What happened to that? Another cause tossed into the junk drawer with yesterday’s choke collar?” He called virtue signaling “body ornaments” and delivered one of his trademark zingers: “They’re just crucifixes for liberals. Because every time I see one, I think, ‘Jesus Christ.’”\n\nMaher gave a nod to Ricky Gervais’s now-legendary roast of Hollywood’s award show activism during the 2020 Golden Globe awards, when he said,\n\nMaher, of course, agreed with Gervais, adding, “Celebrities absolutely do have a right to speak out. I’m just saying: Don’t. It’s having the opposite effect of what you want.”\n\nMaher then pointed to the 2024 election cycle, where “every big name in show business came out for Kamala Harris, from Oprah to Clooney to Beyoncé, and she lost every swing state.”\n\nMaher highlighted data showing that Taylor Swift’s political endorsement actually drove voters away. \n\nThe problem, he argued, is that stars are the least relatable people in the country at a time when affordability dominates public concern, pointing out that “celebrities don’t strike people as relatable or in touch. What their activism mostly activates is eye rolls.”\n\nCelebrities, I know it’s very important to you that you feel that you’re making a difference, and you are, you’re making independents vote Republican. pic.twitter.com/EozEfoF8OZ\n— Bill Maher (@billmaher) January 31, 2026\n\nHollywood's fake activism has a short shelf life. Stars slap on pins and flags to look good, then ditch the cause when the spotlight moves on because their activism is more about making them look good than about the cause they’re promoting. Maher nailed it—these celebs treat virtue like cheap jewelry, shiny for one night, trash the next. People are sick of it. \n\nMaher ended the tirade with a final swipe at celebrity activism. “Democrats, it’s great you have all the big celebs, but people see them as an arm of the Democratic Party, which they already suspect for lacking common sense. I know celebrities mean well, and we thank them for having their heart in the right place.”\n\nHe added, “Just do you. Use your extraordinary talents for the noble cause of bringing relief from the problems that ribbons and pins can’t fix. I know it’s very important to you that you feel that you’re making a difference... so let me assure you, you are. You’re making independents vote Republican.”","url":"https://www.zerohedge.com/political/bill-maher-torches-virtue-signaling-lefty-celebs-ditching-causes-once-theyre-not-current","image":"https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2026-02/2026-02-02_05-43-11.jpg?itok=gcyvUTky","video":null,"publish_date":"2026-02-02 13:55:48","author":"Tyler Durden","authors":["Tyler Durden"],"language":"en","source_country":"us","sentiment":-0.311},{"id":398606052,"title":"Trump threatens to sue ‘total loser’ Trevor Noah over Grammys Epstein island joke","text":"Trump ended his post by mentioning his successful lawsuits against ABC News, over inaccurate on-air assertions by anchor George Stephanopoulos, and CBS, after the network deceptively edited an interview with Kamala Harris that aired on 60 Minutes.\n\n“Ask Little George Slopadopolus, and others, how that all worked out. Also ask CBS! Get ready Noah, I’m going to have some fun with you!”\n\nPop stars get political\n\nAs the Trump administration continues its immigration crackdown across parts of the U.S. that saw the killings of Renee Good and Alex Pretti in Minnesota, several pop stars got political while accepting awards onstage.\n\nAfter accepting his Grammy for best musica urbana album, Bad Bunny lashed out at anti-immigrant policies being overseen by Trump.\n\n“Before I say thanks to God, I’m going to say, ‘ICE out,'” Bad Bunny, whose real name is Benito Antonio Martínez Ocasio, said. “We’re not savage. We’re not animals. We’re not aliens. We are humans, and we are Americans.”","summary":"The president lashed out on Truth Social at Sunday night's Grammys host","url":"https://torontosun.com/news/world/grammys-trump-threatens-trevor-noah-epstein-island-joke","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2026/02/2259519086_301107483.jpg?quality=100&strip=all","video":null,"publish_date":"2026-02-02 13:54:09","author":"Mark Daniell","authors":["Mark Daniell"],"language":"en","category":"politics","source_country":"ca","sentiment":0.423},{"id":398610394,"title":"Trump threatens to sue Trevor Noah over Grammys Epstein Island joke","text":"Trump ended his post by mentioning his successful lawsuits against ABC News, over inaccurate on-air assertions by anchor George Stephanopoulos, and CBS, after the network deceptively edited an interview with Kamala Harris that aired on 60 Minutes.\n\n“Ask Little George Slopadopolus, and others, how that all worked out. Also ask CBS! Get ready Noah, I’m going to have some fun with you!”\n\nPop stars get political\n\nAs the Trump administration continues its immigration crackdown across parts of the U.S. that saw the killings of Renee Good and Alex Pretti in Minnesota, several pop stars got political while accepting awards onstage.\n\nAfter accepting his Grammy for best musica urbana album, Bad Bunny lashed out at anti-immigrant policies being overseen by Trump.\n\n“Before I say thanks to God, I’m going to say, ‘ICE out,'” Bad Bunny, whose real name is Benito Antonio Martínez Ocasio, said. “We’re not savage. We’re not animals. We’re not aliens. We are humans, and we are Americans.”","url":"https://calgarysun.com/news/world/grammys-trump-threatens-trevor-noah-epstein-island-joke","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2026/02/2259519086_301107483.jpg","video":null,"publish_date":"2026-02-02 13:54:09","author":"Mark Daniell","authors":["Mark Daniell"],"language":"en","category":"politics","source_country":"ca","sentiment":0.423},{"id":398613542,"title":"Trump threatens to sue Trevor Noah over Grammys Epstein Island joke","text":"Trump ended his post by mentioning his successful lawsuits against ABC News, over inaccurate on-air assertions by anchor George Stephanopoulos, and CBS, after the network deceptively edited an interview with Kamala Harris that aired on 60 Minutes.\n\n“Ask Little George Slopadopolus, and others, how that all worked out. Also ask CBS! Get ready Noah, I’m going to have some fun with you!”\n\nPop stars get political\n\nAs the Trump administration continues its immigration crackdown across parts of the U.S. that saw the killings of Renee Good and Alex Pretti in Minnesota, several pop stars got political while accepting awards onstage.\n\nAfter accepting his Grammy for best musica urbana album, Bad Bunny lashed out at anti-immigrant policies being overseen by Trump.\n\n“Before I say thanks to God, I’m going to say, ‘ICE out,'” Bad Bunny, whose real name is Benito Antonio Martínez Ocasio, said. “We’re not savage. We’re not animals. We’re not aliens. We are humans, and we are Americans.”","url":"https://ottawasun.com/news/world/grammys-trump-threatens-trevor-noah-epstein-island-joke","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2026/02/2259519086_301107483.jpg","video":null,"publish_date":"2026-02-02 13:54:09","author":"Mark Daniell","authors":["Mark Daniell"],"language":"en","category":"politics","source_country":"ca","sentiment":0.423},{"id":398614842,"title":"Trump threatens to sue Trevor Noah over Grammys Epstein Island joke","text":"Trump ended his post by mentioning his successful lawsuits against ABC News, over inaccurate on-air assertions by anchor George Stephanopoulos, and CBS, after the network deceptively edited an interview with Kamala Harris that aired on 60 Minutes.\n\n“Ask Little George Slopadopolus, and others, how that all worked out. Also ask CBS! Get ready Noah, I’m going to have some fun with you!”\n\nPop stars get political\n\nAs the Trump administration continues its immigration crackdown across parts of the U.S. that saw the killings of Renee Good and Alex Pretti in Minnesota, several pop stars got political while accepting awards onstage.\n\nAfter accepting his Grammy for best musica urbana album, Bad Bunny lashed out at anti-immigrant policies being overseen by Trump.\n\n“Before I say thanks to God, I’m going to say, ‘ICE out,'” Bad Bunny, whose real name is Benito Antonio Martínez Ocasio, said. “We’re not savage. We’re not animals. We’re not aliens. We are humans, and we are Americans.”","url":"https://edmontonsun.com/news/world/grammys-trump-threatens-trevor-noah-epstein-island-joke","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2026/02/2259519086_301107483.jpg","video":null,"publish_date":"2026-02-02 13:54:09","author":"Mark Daniell","authors":["Mark Daniell"],"language":"en","category":"politics","source_country":"ca","sentiment":0.423},{"id":398599606,"title":"Gary Bauer: The Laken Riley Act","text":"Thursday marked the one-year anniversary of the Laken Riley Act—the first bill President Trump signed into law in his second term. The law is named after the Georgia nursing student who was brutally attacked and murdered in 2024 by an illegal alien from Venezuela, Jose Ibarra. This thug was allowed into our country by Joe Biden.\n\nLaken Riley was just one of many American victims of the Left’s insane open border and sanctuary city policies. Those policies allow illegal foreign nationals to rob, rape, and murder American citizens. Jose Ibarra had multiple run-ins with law enforcement in New York and in Georgia, but he was released each time.\n\nIf our immigration laws had been enforced during the Biden/Harris years, Laken Riley would be alive today. If sanctuary cities cooperated with federal immigration police, Laken Riley would be alive today.\n\nThe Laken Riley Act requires illegal foreign nationals charged with violent crimes to be detained by federal immigration police—the very thing that Democrats in Minnesota and other sanctuary jurisdictions refuse to do.\n\nSince President Trump signed the Laken Riley Act into law on January 29, 2025, more than 21,000 illegal aliens have been arrested by federal authorities under this act. Think about that—21,000 in just one year!\n\nIf Kamala Harris had won the 2024 election, she would have vetoed the Laken Riley Act, and those 21,000 criminal foreign nationals would still be free and terrorizing innocent Americans.\n\nAs a reminder, nearly 75% of House and Senate Democrats opposed the Laken Riley Act. They voted “no” on a commonsense measure to protect our daughters, sisters, and mothers from being raped and murdered by criminal illegal aliens who shouldn’t be here.\n\nThe Fanatical Mayor Frey\n\nMinneapolis Mayor Jacob Frey addressed the U.S. Conference of Mayors in Washington, D.C., Thursday. On the one-year anniversary of the Laken Riley Act, Frey denounced the enforcement of federal immigration law in his city as “an invasion of our democracy.” He urged other mayors to resist the Trump administration, or the “invasion” would come to their cities.\n\nNo, it won’t because many cities are cooperating with the administration. But what jumped out at me was his use of the word “invasion.” Well, let’s talk about invasions.\n\nWe don’t know how many illegal foreign nationals crossed our border during the Biden years—10 million, 12 million, 20 million. But there were also 2 million “gotaways.”\n\nRather than surrendering at the border and being welcomed in by the Biden administration, these people paid more to avoid being caught. Why? There is every reason to assume they are among the worst of the worst.\n\nThis may be unprecedented in world history—millions and millions of people crossing the border of a major world power. That is an invasion! And the Biden/Harris regime didn’t try to stop it—they facilitated it.\n\nConservatives were condemned when we used the word “invasion” to describe the record daily violations of our southern border. We were accused of spreading “conspiracy theories” and of being “white supremacists.”\n\nDemocrats and their media allies insisted that every one of these “migrants” were future doctors or entrepreneurs we just couldn’t live without.\n\nBut when we send federal agents to enforce the laws of the United States to get gang members, drug dealers, child molesters, rapists, and murderers out of our country, that’s an “invasion.”\n\nMinnesota Musings\n\nMinnesota Senator Amy Klobuchar (D) announced Thursday that she is running for governor. She does not have to resign until she wins, meaning she can still serve in the Senate while campaigning for governor.\n\nThe day before, scandal-plagued Governor Tim Walz announced, “I will never run for an elected office again. Never again.” The timing of these announcements is curious.\n\nMany insiders believe Klobuchar will likely win her race for governor, as she remains popular in the state. There is speculation that when she takes the oath as governor, she will appoint Walz to her Senate seat.\n\nIf there is any truth to this scheme, every decent citizen in Minnesota ought to be outraged.\n\nBy the way, I was reminded this week that the left-wing violence we’re seeing in Minneapolis right now is nothing new. The city hosted the 2008 Republican National Convention, which I attended.\n\nNot only were there daily riots resulting in more than 800 arrests, but law enforcement agencies also conducted several preemptive raids prior to the convention and uncovered a plot by dozens of Marxist revolutionaries to disrupt and even bomb the convention. (Here and here.)\n\nA Spanish Lesson\n\nSpain is currently ruled by a coalition between the Socialist Party and the far-left Podemos Party. This left-wing coalition just announced that it is granting amnesty to 500,000 illegal aliens who walked into the country.\n\nSpain’s populist conservative Vox Party strongly opposes the amnesty, but no one is voting on it. The radical left-wing coalition is going to ram it through by government edict, and they are not shy about their reasons. Podemos Secretary General Ione Belarra declared, “Fascism is stopped with more rights.”\n\nIn other words, Spanish leftists are going to stop the “fascist” Vox party by creating new voters.\n\nNow, if you say that open borders Democrats are doing the same here—trying to replace the electorate and create a new electorate—you’re accused of spreading “white supremacist conspiracy theories.” But the lesson from Spain is that it’s no conspiracy theory. It is exactly what the globalist Marxist Left is doing.\n\nThe Famine Lie\n\nThe Israel Defense Forces released a new report on casualties in the Hamas war. It found no evidence of a single death caused by famine. In fact, the Gaza Strip received 1,700,000 tons of food during the war.\n\nIn addition, 600,000 Palestinian children were vaccinated against polio during the war. There were also 60,000 live births recorded in Gaza last year, more than in 2022 before the war. How does all that happen during a “famine” and a “genocide”? (If only birth rates in the United States were as high as they are in Gaza!)\n\nThe few times the media tried to show us starving children, it was discovered that the children were seriously ill with diseases that were killing them before the war started.\n\nIf the Israelis are so “evil” and “control everything,” they’re really not good at this “genocide” business.\n\nLemon Gets Squeezed\n\nWe were ecstatic to see the news that pretend “journalist” Don Lemon was arrested Thursday night in Los Angeles for his role in the attack on Cities Church in St. Paul, Minnesota. Three other radical leftists were also arrested.\n\nLemon and his attorney claim that he is protected by the First Amendment as a reporter covering the event. All you have to do is look at the video. He wasn’t “covering” the event. He got into the pastor’s face and argued with him in the middle of the service.\n\nIf any conservative commentator—Laura Ingraham, Sean Hannity, or Mark Levin—stormed a mosque with a group of committed Christians, disrupted the service, and got in the face of the imam, do you think anyone would defend that commentator as being protected by the First Amendment? Of course not.\n\nWhat if one of the left’s sacred spaces was invaded by Christians? We don’t have to guess at the reaction. It already happened.\n\nWhen pro-life activists, including elderly men and women, blocked the entrance of an abortion clinic in Washington, D.C., they were treated like mass murderers by the Biden/Harris regime. They were arrested, prosecuted, and jailed. Even when one pro-life activist was suffering from serious health issues, the judge showed no mercy.\n\nVirtually no one knows about this incident, except for those of us in the pro-life movement. It happened. It was a disgusting violation of the First Amendment, but the media doesn’t care if the rights of pro-life Christians are violated.\n\nTrump’s Pick\n\nPresident Trump nominated Kevin Warsh to be the next chairman of the Federal Reserve. Warsh previously served on the Federal Reserve Board from 2006 to 2011.\n\nBut here’s the disturbing thing: Sen. Thom Tillis (R), who praised Warsh’s qualifications, said he won’t confirm any nominee to the Federal Reserve until the investigation of Federal Reserve Chairman Jay Powell is ended. Without Tillis’s vote, the Senate Banking Committee would be split 12 to 12, and nominations do not advance on tied votes.\n\nThere is a wide consensus in the business community that the Federal Reserve should be insulated from political pressure regarding interest rates. But Tillis and other senators aren’t just saying the Federal Reserve should be independent.\n\nThey’re really saying there can’t be any oversight of the Federal Reserve. No investigations to see if fraud has been committed or if Federal Reserve employees violated the laws of the United States.\n\nOnce again, we see the establishment wing of the Republican Party siding with Democrats to thwart Trump’s agenda.\n\nSummit Ministries\n\nYoung Americans are veering left at an alarming rate. They are increasingly embracing socialism. Few are proud to live in America. And even fewer have a biblical worldview. That’s where Summit Ministries comes in. \n\nStudents hear from respected experts and learn conversational techniques to articulate the truth. After two weeks at Summit, 94% report a better understanding of the Christian worldview and feel better prepared to defend their faith.\n\nIf you have a child or grandchild in high school or college, I highly recommend Summit Ministries! Their Student Conferences are filling up fast, so please take a few minutes right now to reserve a seat for a young adult you love.\n\nUse code AMERICANVALUES26 to get a $250 discount.\n\nThanks to President Trump’s policies, tax refunds will be $1,000 larger this year. That’s real help for Americans struggling with the affordability crisis created by the inflationary policies of Joe Biden and congressional Democrats. \n\nThe Trump administration repealed a Biden-era rule forcing 60,000 retail pharmacies to sell abortion-inducing pills to “pregnant persons” if the pharmacies did any business with any federally funded program, including Medicare and Medicaid. The Trump administration said the Biden rule violated laws against federal funding of abortion and also clarified that “only women and girls can be pregnant.” \n\nBank of America, JPMorgan Chase, Steak N’ Shake, and Turning Point USA announced they will match the $1,000 federal contribution for their employees who set up Trump Accounts for their children. Hopefully other businesses will follow their example. \n\nThanks to President Trump’s policies, U.S. steel companies outproduced their Japanese competitors for the first time in 25 years.","url":"https://patriotpost.us/opinion/124760-the-laken-riley-act-2026-02-02","image":"https://img.patriotpost.us/01HQR4741X3X5EMM58FSBF51ZK.jpeg?w=1200&h=630","video":null,"publish_date":"2026-02-02 12:54:39","author":null,"language":"en","source_country":"us","sentiment":-0.375},{"id":398637990,"title":"Will Bad Bunny call out ICE at the Super Bowl?","text":"Fresh off his historic Album of the Year win at the 2026 Grammys for DeBÍ TiRAR MáS FOToS, Bad Bunny is set to headline the Super Bowl LX halftime show on Feb. 8 — a performance poised to become yet another culture-shifting moment on the world's biggest stage. At the Grammys, the Puerto Rican superstar didn't shy away from politics, directly calling out U.S. Immigration and Customs Enforcement with a pointed \"ICE out\" during his acceptance speech for Música Urbana Album. Now, as he prepares for one of the most-watched performances in the world, the question remains: Will Bad Bunny bring that same unapologetic message to the Super Bowl?Bad Bunny's history of speaking out against ICEIf Benito does take on ICE at the Super Bowl, it wouldn’t be the first time. In a September 2025 interview with i-D magazine, he said concerns over potential ICE raids and the safety of his Latino and Puerto Rican fans were a key reason he excluded the United States from his 2025–2026 DeBÍ TiRAR MáS FOToS World Tour. \n\n Bad Bunny slams ICE during Grammys speech\n\n\"People from the U.S. could come here to see the show. Latinos and Puerto Ricans of the United States could also travel here, or to any part of the world,\" he said. \"But there was the issue that … ICE could be outside (my concert venue). And it’s something that we were talking about and very concerned about.\"Instead, the artist staged a historic 31-date residency in Puerto Rico — one intentionally designed to prioritize local fans, keep ticket prices accessible, and inject more than $400 million into the island's economy. The decision underscored not only his connection to the island but also his ongoing concern for the communities most affected by immigration enforcement.That awareness surfaced again during the Grammys telecast, when host Trevor Noah joked, \"If things keep getting worse in America, can I come live with you in Puerto Rico?\" Bad Bunny gently corrected him: \"Puerto Rico is part of America.\" The moment landed lightly, but its implications were a reminder of Puerto Rico's complicated political status and the way Latinx communities are often treated as both central to and peripheral within American life. His criticism of ICE has been consistent. Last June, Bad Bunny shared a video on his Instagram Story condemning federal agents operating in Puerto Rico, urging them to stop harassing people who were simply trying to work. With ICE operations intensifying under the Trump administration, his past comments suggest this activism is not a fleeting statement but a throughline in his career. And as a Puerto Rican artist whose music openly celebrates the island, it wouldn’t be surprising if the Super Bowl stage became yet another place where he chooses to make that message heard.Has Bad Bunny ever criticized President Trump?While Bad Bunny has rarely named Donald Trump outright, his criticism of the former president — and the policies of his administration — has been clear. In 2024, the artist endorsed Kamala Harris for U.S. president, citing frustration with the Trump administration’s handling of Hurricane Maria and its devastating impact on Puerto Rico. He made the public endorsement in the wake of comedian Tony Hinchcliffe’s racist remarks about Puerto Rico at a Trump rally at Madison Square Garden, where the island was referred to as a \"floating island of garbage.\"His commentary has also surfaced through his music. On this past Fourth of July, Bad Bunny released the music video for \"NUEVAYoL,\" a salsa tribute to the Puerto Rican diaspora in New York. \n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KGFF0XVHQ2APXP79YDDZ8MQK',\n data: {\"slug\":\"KU5V5WZVcVE\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=KU5V5WZVcVE\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nThe visual features the singer perched atop the Statue of Liberty, who wears a Puerto Rican flag across her forehead like a bandanna. In the final moments, a Trump-like voice plays over a radio broadcast, issuing an imagined apology to immigrants. \"This country is nothing without the immigrants,\" the voice says, naming Mexicans, Dominicans, Puerto Ricans, Colombians, Venezuelans, and Cubans in an unmistakable rebuke of Trump-era immigration rhetoric.Tensions escalated further after the NFL announced Bad Bunny as the Super Bowl LX halftime performer. U.S. Secretary of Homeland Security Kristi Noem publicly criticized the decision, saying ICE agents would be \"all over\" the Super Bowl and suggesting the event should be reserved for \"law-abiding Americans who love this country.\"The following night, Bad Bunny addressed the backlash during his Saturday Night Live monologue. Speaking first in English, then in Spanish, he framed the moment as a collective victory for Latino communities in the United States, emphasizing their labor and cultural impact. \"Our footprints and our contribution in this country,\" he said, \"no one will ever be able to take that away or erase it.\" He closed with a pointed aside in English: \"And if you didn’t understand what I just said, you have four months to learn.\"Trump himself responded dismissively when asked about Bad Bunny in October, telling NewsMax he had \"never heard of him\" and questioning why the NFL selected him as the halftime performer. Just last month, he told the New York Post that he would not attend Super Bowl LX, citing Bad Bunny and opening act Green Day as reasons. \"I'm anti-them,\" Trump said, \"I think it's a terrible choice. All it does is sow hatred. Terrible.\"We'll have to wait until Super Bowl Sunday to see if Benito responds. So, will Bad Bunny mention ICE or Trump at the Super Bowl?Whether or not Bad Bunny directly addresses politics at Super Bowl LX, the act of bringing Puerto Rican culture and its history to the world's biggest stage is itself a statement. For Bad Bunny, music and identity have always been inseparable, and this halftime show will surely be no exception.","summary":"Bad Bunny has long criticized U.S. immigration policy and Trump-era politics. Will he speak out at Super Bowl LX?","url":"https://mashable.com/article/bad-bunny-super-bowl-ice-trump","image":"https://helios-i.mashable.com/imagery/articles/00Xr2cE1RHlfCYcTIAVtAF8/hero-image.fill.size_1200x675.v1769984413.jpg","video":null,"publish_date":"2026-02-02 12:46:59","author":"Crystal Bell","authors":["Crystal Bell"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.089},{"id":398610032,"title":"Black Coaches Shut Out Of Hiring Cycle And Enraged Media Will Make Goodell Answer For It As A Result","text":"SAN FRANCISCO – NFL Commissioner Roger Goodell will have his annual state of the league press conference Monday, and after the final job of the latest head coach hiring cycle was filled over the weekend, we already know what a significant number of questions from the 100 or so invited reporters will be: Why weren't any black head coach hired? This is not a guess. It's a virtual certainty the race of the coaches hired will dominate this press conference. Sunday afternoon on X already showed ample evidence of reporters of all shades voicing their distaste for the hiring of nine white men and one man of Lebanese descent, while black men were somehow unfairly excluded. Reporter Uses Racist ‘Good Ol’ Boys' Trope At least one of those reporters even gave a preview to the coming anger by sharing a theory (without evidence) that the hiring of white coaches came as a result of a \"good ol' boy club\" – a racist trope as unfair as claiming black coaches are all DEI hires. Nine of the 10 teams that replaced coaches this cycle hired white men. Robert Saleh, whose parents emigrated from Lebanon, was the lone non-white coach hired this cycle when he accepted the job with the Tennessee Titans. And as two of the candidates that either lost their job (Raheem Morris in Atlanta) or stepped down (Mike Tomlin in Pittsburgh) are black, that means there will be two fewer black head coaches in the NFL in 2026 than there were in 2025. There will be three black NFL head coaches in 2026. Those are Todd Bowles in Tampa Bay, Aaron Glenn in New York and DeMeco Ryans in Houston. And during Monday's press conference, it will seem from the questioning as if the net loss is clearly Goodell's fault. And he must answer for it. NFL Can't Tell Teams Who To Hire But what just happened across the league is not Goodell's doing. And it's not the NFL's doing. The NFL doesn't run head coach searches. Or coordinator searches. Or assistant coach searches. The league doesn't make the final calls on those hires. Multiple NFL sources made the point to OutKick in recent weeks that while the NFL hopes for the best outcome to all job searches, and that includes \"the hiring of outstanding diverse candidates,\" the league cannot mandate who teams hire. That's done at the club level by owners who pick the coach they're probably going to fire within a four- or five-year span if recent history is any measure – because teams generally fail spectacularly at this hiring coach thing. This is who the individual clubs hired this cycle: Left Leaning Blank, Rooney Racists? There is no way to guarantee some team owners don't have some bias or perhaps even prejudices in their hearts. But it is a leap to believe, for example, that … The Falcons, owned by Kamala Harris supporter and President Trump dissenter Arthur Blank, fired a black coach in Morris and hired a white coach because a two-time coach of the year named Stefanski is part of some good ol' boy club. Blank, by the way, hired Ian Cunningham as his new general manager. Cunningham is black. The Steelers, owned by Art Rooney II, were going to keep Tomlin against considerable public outcry in Western Pennsylvania. So did the family who authored the NFL's Rooney Rule, the family that served Barack Obama in an ambassador role to Ireland, make a decision to hire a past Super Bowl winner with strong ties to Aaron Rodgers because they're racists? It's hard to believe the Bills, who wanted to keep some sense of continuity for quarterback Josh Allen, hired Brady merely because he's white. Because maybe, just maybe, he was a hot prospect throughout the league and was the Bills offensive coordinator that helped Allen win the MVP in 2024. Multiple White Candidates Earned Jobs It's hard to believe Kubiak wasn't attractive to the Raiders based on the fact he runs an offense in Seattle that has Sam Darnold starting at quarterback in Super Bowl LX. Kubiak has Darnold starting the Super Bowl is a phrase that would've gotten him the keys to New York City in 2018-2020. John Harbaugh to the Giants? What black, brown, orange or green coach should be hired ahead of the best available coach in the cycle? Jesse Minter replaced Harbaugh in Baltimore. And the Ravens beat out the Falcons, Browns, Raiders, Dolphins, Steelers, and Titans who also had interest in Minter. So was this a good ol' boy hire? Because that would mean the club is massive. LaFleur was hired by the Cardinals. Even the hapless Cardinals recognized that LaFleur's older brother is a successful head coach in Green Bay, and the younger brother is the latest offensive coordinator to emerge from a Sean McVay coaching tree that also produced Jaguars coach Liam Coen, Vikings coach Kevin O'Connell, and the older LaFleur. Goodell Will Virtue Signal The amazing thing about these facts is that Goodell will almost definitely virtue signal that the NFL wants more diverse (black) candidates even though it's not within the league's reach to guarantee that. In that regard, Goodell will look as woke as media members demanding more black coaches be hired without addressing every situation individually to outline where an actual wrong was done.","summary":"","url":"https://www.outkick.com/sports/black-coaches-shut-out-hiring-cycle-enraged-media-make-goodell-answer-result","image":"https://static.outkick.com/www.outkick.com/content/uploads/2024/02/GettyImages-1988727657-1.jpg","video":null,"publish_date":"2026-02-02 12:29:38","author":null,"language":"en","source_country":"us","sentiment":-0.248},{"id":398603072,"title":"Trump Torches Grammys, Threatens to Sue ‘Talentless Dope’ Host Trevor Noah Over Epstein Comments","text":"President Trump may have had the misfortune of being one of the few people taking in the Grammy Awards last night, and frankly, he didn't like what he saw. He posted his thoughts in a late-night screed on Truth Social.\n\n\"The Grammy Awards are the WORST, virtually unwatchable!\" he wrote. \"CBS is lucky not to have this garbage litter their airwaves any longer.\"\n\nThe only thing one might quibble with in that assessment is the word \"virtually.\" The Grammy Awards, like any vanity project for the entertainment elite, are flat-out always unwatchable. Unbearable even.\n\nThe President then took aim at host Trevor Noah, the failed former host of the \"Daily Show,\" over what he described as a \"defamatory\" joke at his expense involving Jeffrey Epstein. In fact, he strongly hinted that Noah could expect a George \"Slopadopolus\"-level lawsuit on the horizon.\n\n\"The host, Trevor Noah, whoever he may be, is almost as bad as Jimmy Kimmel at the Low Ratings Academy Awards,\" Trump said. \n\n\"I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight’s false and defamatory statement, have never been accused of being there, not even by the Fake News Media,\" he continued, referencing the host's joke. \"Noah, a total loser, better get his facts straight, and get them straight fast.\"\n\n\"It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$. Ask Little George Slopadopolus and others how that all worked out. Also, ask CBS!\" added Trump. \"Get ready, Noah, I’m going to have some fun with you!\n\nREAD MORE: Failed ‘Daily Show’ Host Faces Backlash After Stand-Up Bit Mocking Kirk’s Assassination\n\nNoah and the CBS network (the Grammys move to Disney/ABC in 2027) might want to start prepping. Trump's threats against defamation do not typically ring hollow. And he has a track record of winning.\n\nABC News and Slopadopolus were forced to settle a defamation lawsuit brought by the President the previous December after the \"This Week\" co-host falsely accused him of rape. The network agreed to pay $15 million in damages and apologized. He won a $16 million payout from CBS for their deceptive interview with Kamala Harris. He recently filed a $10 billion lawsuit against the BBC for deceptively editing his remarks on January 6th.\n\nHe's not one to be trifled with. What did Noah do that set him off? Lumped him into the same category as former President Bill Clinton when it comes to Epstein's island.\n\nFollowing the announcement that Billie Eilish had won for Song of the Year, Noah joked, “That’s a Grammy that every artist wants — almost as much as Trump wants Greenland.\"\n\n“Which makes sense because, since Epstein’s gone, he needs a new island to hang out with Bill Clinton,\" he added. \"I told you, it’s my last year! What are you going to do about it?”\n\nAside from the fact that Noah is desperately trying to copy an actual comedian in Ricky Gervais with the shtick, it looks like the President has already decided exactly what he's going to do about it.\n\nTrev, buddy, Gervais already did the 'it's my last year' routine and nailed it. Meaning much of your career has been spent trying to be a carbon copy of more accomplished comedians like him and Jon Stewart.\n\nNoah recently raised the ire of conservatives over a stand-up bit in which he joked about what he found to be humorous about the Charlie Kirk assassination.\n\n\"I'm sure there's something funny about it. The guy was shot while defending guns. I'm not even writing that as a joke, as a human, you have to admit that is an incongruous, funny thing that happens,\" he said.\n\nDesperately seeking attention by playing Barney Rubble to Stewart's Fred Flintstone, driving the \"Daily Show\" ratings into the toilet, then not having enough material to come up with anything original as host of the Grammys, all while setting yourself up for a career-ending lawsuit—Now that's funny.\n\nEditor’s Note: Do you enjoy RedState’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin RedState VIP and use the promo code FIGHT to get 60% off your VIP membership!","url":"https://redstate.com/rusty-weiss/2026/02/02/trump-torches-grammys-threatens-to-sue-talentless-dope-host-trevor-noah-over-epstein-comments-n2198739","image":"https://media.townhall.com/cdn/hodl/2022/122/d48847fa-d269-485e-a93e-13629a7cc281.jpg","video":null,"publish_date":"2026-02-02 12:15:00","author":"Rusty Weiss","authors":["Rusty Weiss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.479},{"id":398572782,"title":"Donald Trump threatens to sue comedian Trevor Noah over Grammys Epstein joke","text":"President Donald Trump has threatened to sue Grammys host Trevor Noah after a joke he made about Jeffrey Epstein on stage.\n\nThe US President blasted the comedian as a “total loser”, adding: “It looks like I’ll be sending my lawyers to sue this poor, pathetic, talentless, dope of an M.C., and suing him for plenty$.”\n\nMr Trump criticised Noah’s joke, made after the song of the year gong was handed out.\n\nWriting on Truth Social, in a post strewn with uppercase words, Mr Trump: “Noah said, INCORRECTLY about me, that Donald Trump and Bill Clinton spent time on Epstein Island. WRONG!!!\n\n“I can’t speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight’s false and defamatory statement, have never been accused of being there, not even by the Fake News Media.\n\n“Noah, a total loser, better get his facts straight, and get them straight fast.”\n\nHe added: “Get ready Noah, I’m going to have some fun with you!”\n\nMr Trump also blasted the ceremony saying: “The Grammy Awards are the WORST, virtually unwatchable! CBS is lucky not to have this garbage litter their airwaves any longer.”\n\nThis is an apparent reference to Disney taking over the broadcast rights for the award ceremony starting next year.\n\nMr Trump is famously litigious and has taken legal action against the BBC over the editing of a Panorama programme.\n\nHe has also engaged in legal action with the New York Times, Associated Press and the Wall Street Journal.\n\nLast July, US media giant Paramount, which owns CBS, agreed to pay Mr Trump 16 million dollars (£13.5 million) to settle a lawsuit over a 2024 CBS interview with Kamala Harris, the former vice-president and 2024 Democratic presidential nominee.\n\nNoah, 41, is a South African-born comedian and TV personality who hosted The Daily Show on Comedy Central in the US for seven years.","summary":"He also blasted the ceremony as ‘unwatchable’.","url":"https://www.standard.co.uk/showbiz/celebrity-news/donald-trump-trevor-noah-grammys-paramount-noah-b1269214.html","image":"","video":null,"publish_date":"2026-02-02 12:02:53","author":"Laura Harding","authors":["Laura Harding"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.238},{"id":398585712,"title":"The voters who could decide Texas’ top races","text":"What the voters campaigns are chasing say matters in this year’s election.\n\nOn the border\n\nLaredo native Alex Méndez’s voting record zigzags between parties, with years of sitting out elections.\n\nThe 50-year-old tech professional voted Republican in 2016, skipped 2020 and voted Democratic in 2024, rarely participating in midterms.\n\nHe blames the Democratic Party’s decision to switch Joe Biden with Kamala Harris for alienating voters and helping Donald Trump return to office.\n\n“That was a big, big mistake,” he said.\n\nThis year, Méndez said anger over immigration enforcement will drive him to vote in both the primary and general election for candidates who support an end to the immigrant-targeting raids on Texans’ homes.\n\n“That’s what’s really bothering me right now, all the ICE actions,” he said. “Separating families, deporting people, going into people’s homes.”\n\nThe suburbs\n\nCoppell entrepreneur Pam Varnell, 63, has voted Republican in every election since turning 18 years old. \n\nVarnell is upset by what she sees as overspending on social programs, fraud in public benefits and tax cuts that fail to meaningfully lower costs for homeowners and small businesses.\n\n“You can have empathy and provide support but also demand that the government do its job,” she said.\n\nMuch of her irritation is aimed at local government but she’s tired of the stalemates caused by extremes at all levels, particularly in Washington.\n\n“There are a lot of common sense things out there that could be voted on, but nobody wants to take the hit,” she said. “Everybody wants the win.”\n\nRural Texas\n\nIn the tiny town of Axtell, northeast of Waco, Jermane Burks teaches English at a public high school and worries the state is failing to support rural schools.\n\nLike many in both parties in rural Texas, Burks is wary that private school vouchers will undercut schools and local jobs. \n\nThough he doesn’t claim a party, the 44-year-old said his voting leans Democratic, and this year he’s focused less on labels than on where candidates stand.\n\n“I’m going to make sure I do my best due diligence,” he said. \n\nHe said Republican policies and messages have deepened tensions between parents and teachers and weakened trust in public education.\n\n“What they’re saying out loud is not what’s happening in classrooms,” he said.\n\nRepublican country\n\nBill Finstad, 56, is a GOP precinct chair in North Richland Hills, referred to by its mayor as “the largest conservative city in Tarrant County.” \n\nFinstad said he was inspired to take on the partisan role last year out of frustration with what he views as unresponsive elected officials and growing bureaucracy.\n\n“The excessive and clearly avoidable bureaucracy… prompted me to get more involved,” Finstad said.\n\nOn the ground, he said many voters are worried about housing costs, the power grid and taxes, and they aren’t seeing enough action.\n\nThey also are increasingly tired of political division, he said.\n\n“People are hungry for genuine leadership,” he said.\n\nDemocratic country\n\nAs a freshly minted Democratic precinct chair in Southeast Texas, Amber Delaune is marking little victories. \n\nA 34-year-old bookkeeper and married mother of a 4-year-old, Delaune cited volunteer efforts in her rural Hardin County precinct near Beaumont. \n\nThat outreach has brought about 100 voters into the party in a district that voted nearly 90% Republican in the last election.\n\nShe said concerns about public education, property taxes, child care, health care and limited social services motivating voters looking for change.\n\n“They’ve had 30 years to make this better. And it’s worse,” she said of Texas Republicans. “If your big plan is to lower property taxes, how are you going to fund our schools?”","url":"https://www.dallasnews.com/news/politics/2026/02/02/the-voters-who-could-decide-texas-top-races/","image":"https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/SUTOQRCVKRGAFDJBFZUZADPU3I.jpg?auth=d03650775e7d1ca2f2ee775359f97299b3322bc5a40b70c72c615ccd0d26112b&quality=80&width=1200&height=630&smart=true","video":null,"publish_date":"2026-02-02 12:00:01","author":"Karen Brooks Harper","authors":["Karen Brooks Harper"],"language":"en","source_country":"us","sentiment":-0.066},{"id":398585606,"title":"No 'Republican is safe right now': How MAGA lost a district Trump carried by 17 points","text":"In September 2024, Texas Rep. Ramón Romero was at a fundraiser in Fort Worth for Kamala Harris when he met a young labor leader named Taylor Rehmet.\n\nThe Air Force veteran and union machinist told Romero he was mulling a run for public office. A lot of people think about running, Romero recounted telling him, but he offered to help should Rehmet actually file. \n\nThe two stayed in touch, and Rehmet decided last summer to run in a special election for a ruby red Texas Senate district in Tarrant County that no Democrat had represented in nearly half a century and that President Donald Trump won by more than 17 points in 2024. When Romero mobilized to help Rehmet court Latino voters — many of them from the same Fort Worth neighborhoods he represents in the House — he saw a serious first-time candidate meeting power brokers, talking to voters on front porches and running a long-shot bid like he could win it. \n\nOn Saturday, Rehmet did win it, in part thanks to a spike in support from the Latino vote. \n\nHe defeated conservative activist Leigh Wambsganss — whose campaign far outspent Rehmet — by a decisive 14-point margin in a stunner that reverberated from Texas to Mar-a-Lago, refreshing Democrats’ dreams of a blue Texas and rattling Republicans as they brace for more aftershocks in November. \n\nRehmet’s upset victory, according to interviews Sunday with half a dozen people who supported or worked on his campaign, is explained by a variety of factors, including the combination of Latino and suburban backlash to once-fringe conservative policies that have taken root in Tarrant County and Washington; a MAGA opponent who drove some of those policies and embraced them on the campaign trail; and a message from Rehmet, centered on his union background, that won over working-class voters, independents and even some moderate Republicans. \n\nInstrumental to Rehmet’s victory was the backing he received from Hispanics, who account for slightly more than one in five eligible voters in the district. One analyst found that Rehmet outperformed Harris, the 2024 Democratic presidential nominee, by more than 50 points in some of the largely Hispanic areas of Fort Worth. The remarkable shifts occurred as those voters witnessed immigration agents in recent weeks kill two Americans while trying to carry out the president’s promised mass deportations. And those same voters, some observers noted, believed Trump would help their financial standing more than what he has delivered in his first year in office. \n\nUp against Rehmet was a ferocious campaign fueled by some of the GOP’s biggest heavyweights — Lt. Gov. Dan Patrick and Trump among them. They backed Wambsganss, who’s set to get a rematch against Rehmet in November for a four-year term, as Rehmet’s victory was only to complete the remaining 11 months in a term Republican Kelly Hancock left to become Texas’ acting comptroller.\n\n“He is a hard worker. People think that you can just win elections. You’re gonna have to really work it, and he did,” Romero, who block-walked for Rehmet, said in an interview Sunday. “I had more Republicans — people calling me saying, ‘I voted for Rehmet.’ ‘I voted for Rehmet.’ ‘Hey, I just want you to know — I voted for Rehmet.’”\n\nTo be sure, the election was unique. It was held on a Saturday in January, with no other candidates on the ballot, following a cold snap that affected campaigning and early voting. The singularity limits what can be gleaned from Rehmet’s stunning upset. But as the blame game among Republicans grew louder on Sunday, it also became clear that the 32-point swing for Democrats could not be simply dismissed as irrelevant. \n\nStill, some Democrats counseled restraint in interpreting the results. \n\n“I don't think that Democrats should think that just because Taylor won last night, that it’s New York City time. It's not New York City time. It's not Vermont time. It's not LA time,” said U.S. Rep. Marc Veasey, a Fort Worth Democrat, noting that Texas is far from becoming one of the country’s liberal bastions. “If you are a candidate running in a tough race in a place like Texas, it does not mean that you can start California dreaming.”\n\nBy numerous indications, the election should have been a sleepy one. Aside from Trump’s margin in 2024, the district has been reliably red: Per one analysis, Republicans have carried it by an average of nearly 19 points in 44 state and federal contests since 2018. \n\nThe first indication that the race would be a live one arrived in November, when Rehmet finished three points shy of winning the seat outright. \n\nIn both rounds, but especially in the runoff, Texas GOP leaders went to bat for Wambsganss, tapping into their own funds, block-walking the district and ringing alarms about the race, saying they needed to keep the seat red and away from a radical Democrat. \n\nIn all, Wambsganss’ campaign reported raising $2.6 million, almost two-thirds — $1.6 million — of which came from three of the most powerful and loaded groups in Texas GOP politics. Texans United for a Conservative Majority, started by right-wing West Texas oil billionaires Tim Dunn and Farris Wilks, gave her campaign nearly $603,000 — more than Rehmet’s entire campaign haul of some $570,000.\n\nThe Texas Senate Leadership Fund, a PAC started by Patrick, who oversees the state Senate, added $463,250. And the influential tort reform group Texans For Lawsuit Reform PAC added $550,000.\n\nRehmet’s campaign knew it simply could not raise the same amount of money, his campaign strategist Jake Davis said in an interview Sunday. \n\nBut the camp was also not interested in a strategy that involved matching Wambsganss dollar for dollar, Davis said. Knowing they would be outgunned on the advertising airwaves, Davis instead sought out to assemble a staff of Texans from across the state, based them in Tarrant County and identified a north star of knocking on 40,000 doors. \n\nEvery week, they worked backward from that target — spending time with people in their living rooms, kitchens and driveways. The staff received training on active listening, Davis said. If a voter had a question the volunteer did not have an answer for, Rehmet’s team would run it down — sometimes calling the candidate himself in front of the voter. \n\n“We had to stay relentlessly disciplined,” Davis said. “Every single dollar, every hour, every volunteer shift, had to have a purpose. There were so many un-sexy decisions that we had to make.”\n\nOf course, the campaign received help, like from Romero — as well as from Beto O’Rourke, the Democratic darling who shattered fundraising goals and expectations in 2018 when he almost unseated U.S. Sen. Ted Cruz. \n\nO’Rourke’s political group, Powered by People, helped register people to vote in the district, stayed in touch with them to encourage them to vote and called and texted 30,000 voters eligible to vote by mail. In an interview Sunday, the former El Paso congressman credited Rehmet’s campaign for the victory — and struck an optimistic tone for Democrats in November. \n\n“I don't think any Republican is safe right now,” O’Rourke said. “I think the people of Texas have absolutely had it and are looking for change.”\n\nBo French, until recently the Tarrant County GOP chair, blamed poor turnout among Republican voters.\n\n“I see a lot of Republicans blaming everyone from the Governor to the county party,” French wrote on social media. “Republicans need to wake up. When you stay home during local elections and special elections, Democrats win. You can't blame others for your failure to vote.”\n\nSome party superiors see a serious threat. In an early Sunday social media post, Patrick vowed to keep fighting and take the seat back in November.\n\n“Low turnout special elections are always unpredictable,” Patrick wrote. “The results from SD 9 are a wake-up call for Republicans across Texas. Our voters cannot take anything for granted.”\n\nTrump, for his part, distanced himself from the loss, spinning heads in the process after he had posted three different get-out-the-vote messages in the 48 hours leading up to the election. \n\n“I’m not involved in that,” Trump told reporters at his Mar-a-Lago estate in Florida. “That’s a local Texas race.”\n\nAs political observers tried to make sense of the upset, a range of theories emerged to explain what still remained inexplicable to many as the dust settled: It was a referendum on Trump, it was a response to socially conservative policies, it was a response to the hard-right turn of local GOP leaders, it was a poorly run GOP campaign, and onward.\n\nJohn Huffman, the Republican former Southlake mayor who finished a distant third in the November election, chalked it up to “failed opportunities to unify.”\n\n“There was no outreach to the 19,000 voters who supported our campaign in November,” Huffman wrote on social media. “Nor did Leigh's campaign reach out to me until days before early voting began, leaving no time to unify Republicans or broaden the coalition. When she and I finally did meet, she ended the conversation almost as soon as it started.”\n\nOn paper, Wambsganss’ envious conservative bona fides were unmatched by many GOP candidates seeking office in Texas. \n\nShe is the chief communications officer for Patriot Mobile, a cellphone company that has helped back the Christian conservative school board candidates who overhauled libraries, curricula and raised hell in board meetings across the state about what children are taught.\n\nShe had the backing of party state leaders and the district’s former state senator.\n\n“They could have built her in their garage,” veteran Texas Democratic operative Matt Angle said. “Taylor Rehmet is just an absolute reflection of that district. Leigh Wambsganss is an absolute reflection of national MAGA. The voters decided which one they like, and it wasn't a close call.”\n\nStill, political observers reiterated the uniqueness of the election and the challenges of trying to draw conclusions from an election that only drew a sliver of registered voters. \n\nJason Villalba, a former Republican state representative who now leads the Texas Hispanic Policy Foundation, predicted Latinos — “the most important swing vote in the country,” he said — will continue to vote in surprising ways in coming elections. He cautioned that such voting trends “in today’s climate move at light speed.”\n\n“I don't think you can take what happened last night and say, that's gonna hold into November, and these numbers are now static and nothing’s going to change,” Villalba said. “It’s early. This was a strong indicator that Hispanics are moving back toward Democrats.”\n\nThis article first appeared on The Texas Tribune.","summary":"In September 2024, Texas Rep. Ramón Romero was at a fundraiser in Fort Worth for Kamala Harris when he met a young labor leader named Taylor Rehmet.\n\nThe Air Force veteran and union machinist told Romero he was mulling a run for public office. A lot of people think about running, Romero recounted telling him, but he offered to help should Rehmet actually file. \n\nThe two stayed in touch, and Rehmet decided last summer to run in a special election for a ruby red Texas Senate district in Tarrant County that no Democrat had represented in nearly half a century and that President Donald Trump won by more than 17 points in 2024. When Romero mobilized to help Rehmet court Latino voters — many of them from the same Fort Worth neighborhoods he represents in the House — he saw a serious first-time candidate meeting power brokers, talking to voters on front porches and running a long-shot bid like he could win it. \n\nOn Saturday, Rehmet did win it, in part thanks to a spike in support from the Latino vote. \n\nHe defeated ","url":"https://www.alternet.org/texas-district-flip/","image":"https://www.alternet.org/media-library/texas-gov-greg-abbott-with-president-donald-trump-and-first-lady-melania-trump-in-kerrville-texas-on-july-11-2025-official-w.jpg?id=63612679&width=1200&height=600&coordinates=0%2C166%2C0%2C167","video":null,"publish_date":"2026-02-02 11:35:01","author":"Alejandro Serrano,The Texas Tribune","authors":["Alejandro Serrano","The Texas Tribune"],"language":"en","category":"politics","source_country":"us","sentiment":-0.283},{"id":398550476,"title":"Gaga slammed over concert rant","text":"“I want to take a second to talk about something that is extremely important to me, something important to people all over the world, and especially in America right now,” the 39-year-old singer said in the middle of her Mayhem Ball concert on Thursday.\n\n“In a couple of days, I’m going to be heading home, and my heart is aching thinking about the people, the children, the families all over America who are being mercilessly targeted by ICE. I’m thinking about all of their pain and how their lives are being destroyed right in front of us.”\n\nThe law enforcement agency has been under scrutiny for the last few weeks after two people were shot and killed by ICE agents in separate incidents in Minneapolis this month.\n\n“I’m also thinking about Minnesota and everyone back at home who is living in so much fear and searching for answers on what we all should do,” the Oscar winner continued. “When entire communities lose their sense of safety and belonging, it breaks something in all of us. I hope that you’ll all stand with us tonight. I know we’re not in America right now, but we are with our community, and we love you.”\n\nThe singer went on to dedicate her song Come to Mama to “everyone who is suffering, to everyone who is feeling alone and helpless, anyone who’s lost a loved one, and is having a difficult time, an impossible time, seeing when the end will be near.”\n\nShe added, “We need to get back to a place of safety and peace and accountability. Good people shouldn’t have to fight so hard and risk their life for wellbeing and respect. And I hope our leaders are listening, I hope you are listening to us, asking you to change the course of action swiftly, and have mercy on everyone in our country. And in a time where it doesn’t feel like it’s easy to have hope, it is my community and my friends, my family that hold me up. So, I would like to sing a song that does have some hope in it, to try to give us a little bit tonight.”\n\nWhile her audience wholeheartedly applauded her commentary, reaction was mixed on social media.\n\n“Could not care less,” one person wrote under a video posted to X of her comments.\n\n“She is such a loser,” a second person wrote, with a third adding, “Gaga is an anti-American psycho.”\n\nA fourth said, “If I came to Lady Gaga’s concert and heard her spew politics, I would yell out, ‘I came for a concert, not a political rally.’ Then, demand my money back.”\n\n“Stay you’re a** there you are not welcomed in our United States. Not wanted,” another wrote.\n\nThe singer had plenty of support on X as well.\n\n“I love her so much,” one fan said, while another admitted they “cried my eyes out” listening to her speech.\n\n“I’m so happy my favourite is someone I never have to worry about being on the wrong side of history,” a third added.\n\nA fourth said, “Well said. Powerful words.”\n\nGaga has been outspoken about her political beliefs in the past. \n\nShe endorsed former Vice President Kamala Harris in 2024 and told Elle UK after the election she had “prayed” for President Donald Trump to lose. She is also a vocal advocate for the LGBTQ community. \n\nThis story originally appeared on Fox News and is republished here with permission.","summary":"Grammy winner Lady Gaga is facing backlash on social media after pausing her latest concert to slam the US government and ICE.","url":"https://www.news.com.au/entertainment/lady-gaga-slammed-after-pausing-concert-to-slam-ice/news-story/46001185242b6b3a138c4bacd847cbb5?from=rss-basic","image":"https://content.api.news/v3/images/bin/73705df115ca3f46708d3adcc8a52908","video":null,"publish_date":"2026-02-02 11:12:09","author":"Copy Link Share Via Email Share On X Share On Facebook Share On Whatsapp","authors":["Copy Link Share Via Email Share On X Share On Facebook Share On Whatsapp"],"language":"en","category":"politics","source_country":"au","sentiment":0.135},{"id":398549520,"title":"Bad Bunny wins top Grammy prize in a first for a Spanish-language album","text":"LOS ANGELES, (Reuters) – Bad Bunny, the Latino rap star whose forthcoming Super Bowl gig has ignited a culture wars controversy, won the top Grammy prize yesterday, a first for a Spanish-language album, with “Debí Tirar Más Fotos,” a celebration of his Puerto Rican roots.\n\nThe 31-year-old performer-producer edged out fellow megastars Kendrick Lamar and Lady Gaga in what amounted to a three-way race to clinch his first album-of-the-year Grammy, considered the pinnacle of the music industry’s highest honors.\n\n“I want to dedicate this award to all the people who had to leave their homeland, their country to follow their dreams,” the Puerto Rican artist said in his acceptance speech, tapping into expressions of solidarity for immigrants evident throughout the show.\n\n“Debí Tirar Más Fotos,” a musical tribute to Bad Bunny’s Caribbean island homeland, marked his sixth studio set and was heavily favored after winning the Latin Grammys’ album of the year award in November.\n\nRECOGNITION OF BAD BUNNY CARRIES POLITICAL OVERTONES\n\nGrammy recognition of Bad Bunny, born Benito Antonio Martinez Ocasio, carried strong political overtones given his outspoken criticism of the Immigration and Customs Enforcement sweeps ordered by U.S. President Donald Trump in cities across the country.The singer-producer skipped the continental United States on his recent concert tour, saying he feared federal immigration agents would show up to arrest his fans.\n\nThe Grammy accolades also burnished his reputation ahead of a wider introduction to a mainstream English-speaking U.S. audience next Sunday when he is due to headline the National Football League’s Super Bowl halftime show.\n\nHis selection for one of the marquee live sports and entertainment events on U.S. television has rankled some traditionalists, including Trump, who called it “absolutely ridiculous” and said he had never heard of Bad Bunny.\n\nBad Bunny openly supported Trump’s Democratic opponent Kamala Harris in the 2024 presidential race.\n\n“ICE out,” he declared from the stage as he accepted the award for best Latin urban music album for “Debí Tirar Más Fotos,” one of five awards he received.\n\nOpposition to Trump’s deportation drive emerged as a recurring theme throughout the three-hour-plus live Grammy telecast, in which many attendees, including Justin Bieber, were seen sporting “ICE Out” buttons.\n\nBEST NEW ARTIST OLIVIA DEAN\n\nAccepting her award as best new artist, British soul-pop singer Olivia Dean paid tribute to a grandmother who immigrated to Britain from Guyana as a teenager seeking a new life.\n\n“I must say I’m up here as a granddaughter of an immigrant,” she said, evoking cheers from the star-studded audience. “I am a product of bravery and I think those people deserve to be celebrated. We’re nothing without each other.”\n\nLamar, the chart-topping hip-hop sensation who led the field of Grammy contenders going into Sunday’s show with nine nominations, came away with five awards, including best rap album for his latest studio set “GNX” and a shared award for record of the year for “luther,” his wistful duet with R&B singer-songwriter SZA.\n\nThe award for song of the year, honoring composers, went to Billie Eilish and her brother Finneas O’Connell, for her hit single “Wildflower.”\n\n“Golden,” the smash hit from the Netflix NFLX.O animated movie “KPop Demon Hunters,” made history during the non-televised portion of the awards when it was named best song written for visual media, marking the first time the KPop music genre has ever earned Grammy glory.\n\nThe song was performed in the film by a fictional band called HUNTR/X, voiced by real-life vocalists EJAE, Audrey Nuna and Rein Ami.\n\nLady Gaga won Grammys for best pop vocal album with “Mayhem,” and best dance-pop recording for “Abracadabra.”\n\nTrevor Noah returned to host the festivities for a sixth time, which he had said would be his last Grammys gig. The show aired live on the CBS network from the Crypto.com Arena in downtown Los Angeles.\n\nLegendary filmmaker Steven Spielberg, 79, achieved EGOT status — one of the rarest honors in the entertainment industry — after winning his first Grammy award for best music film for “Music by John Williams,” which he produced. EGOT stands for Emmy, Grammy, Oscar and Tony.\n\nGrammy winners are chosen by the roughly 15,000 voting members of the Recording Academy — industry peers including artists, songwriters, producers and engineers — whose ranks have been revamped over the past seven years to increase diversity. About 1,000 Latin Grammys voters became eligible to vote this year, and 73% of members have joined since 2019.","summary":"LOS ANGELES, (Reuters) &#8211; Bad Bunny, the Latino rap star whose forthcoming Super Bowl gig has ignited a culture wars controversy, won the top Grammy prize yesterday, a first for a Spanish-language album, with &#8220;Debí Tirar Más Fotos,&#8221; a celebration of his Puerto Rican roots.\n\n\nThe article Bad Bunny wins top Grammy prize in a first for a Spanish-language album appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2026/02/02/entertainment/bad-bunny-wins-top-grammy-prize-in-a-first-for-a-spanish-language-album/","image":"https://www.stabroeknews.com/images/2026/02/IMG_4302.jpeg","video":null,"publish_date":"2026-02-02 11:09:34","author":"Staff Editor","authors":["Staff Editor"],"language":"en","source_country":"gy","sentiment":0.362},{"id":398760814,"title":"How Taylor Rehmet upset a MAGA candidate to flip a North Texas Senate district","text":"In September 2024, Texas Rep. Ramón Romero was at a fundraiser in Fort Worth for Kamala Harris when he met a young labor leader named Taylor Rehmet.\n\nThe Air Force veteran and union machinist told Romero he was mulling a run for public office. A lot of people think about running, Romero recounted telling him, but he offered to help should Rehmet actually file. \n\nThe two stayed in touch, and Rehmet decided last summer to run in a special election for a ruby red Texas Senate district in Tarrant County that no Democrat had represented in nearly half a century and that President Donald Trump won by more than 17 points in 2024. When Romero mobilized to help Rehmet court Latino voters — many of them from the same Fort Worth neighborhoods he represents in the House — he saw a serious first-time candidate meeting power brokers, talking to voters on front porches and running a long-shot bid like he could win it. \n\nOn Saturday, Rehmet did win it, in part thanks to a spike in support from the Latino vote. \n\nHe defeated conservative activist Leigh Wambsganss — whose campaign far outspent Rehmet — by a decisive 14-point margin in a stunner that reverberated from Texas to Mar-a-Lago, refreshing Democrats’ dreams of a blue Texas and rattling Republicans as they brace for more aftershocks in November. \n\nRehmet’s upset victory, according to interviews Sunday with half a dozen people who supported or worked on his campaign, is explained by a variety of factors, including the combination of Latino and suburban backlash to once-fringe conservative policies that have taken root in Tarrant County and Washington; a MAGA opponent who drove some of those policies and embraced them on the campaign trail; and a message from Rehmet, centered on his union background, that won over working-class voters, independents and even some moderate Republicans. \n\nInstrumental to Rehmet’s victory was the backing he received from Hispanics, who account for slightly more than one in five eligible voters in the district. One analyst found that Rehmet outperformed Harris, the 2024 Democratic presidential nominee, by more than 50 points in some of the largely Hispanic areas of Fort Worth. The remarkable shifts occurred as those voters witnessed immigration agents in recent weeks kill two Americans while trying to carry out the president’s promised mass deportations. And those same voters, some observers noted, believed Trump would help their financial standing more than what he has delivered in his first year in office. \n\nUp against Rehmet was a ferocious campaign fueled by some of the GOP’s biggest heavyweights — Lt. Gov. Dan Patrick and Trump among them. They backed Wambsganss, who’s set to get a rematch against Rehmet in November for a four-year term, as Rehmet’s victory was only to complete the remaining 11 months in a term Republican Kelly Hancock left to become Texas’ acting comptroller.\n\n“He is a hard worker. People think that you can just win elections. You’re gonna have to really work it, and he did,” Romero, who block-walked for Rehmet, said in an interview Sunday. “I had more Republicans — people calling me saying, ‘I voted for Rehmet.’ ‘I voted for Rehmet.’ ‘Hey, I just want you to know — I voted for Rehmet.’”\n\nTo be sure, the election was unique. It was held on a Saturday in January, with no other candidates on the ballot, following a cold snap that affected campaigning and early voting. The singularity limits what can be gleaned from Rehmet’s stunning upset. But as the blame game among Republicans grew louder on Sunday, it also became clear that the 32-point swing for Democrats could not be simply dismissed as irrelevant. \n\nStill, some Democrats counseled restraint in interpreting the results. \n\n“I don’t think that Democrats should think that just because Taylor won last night, that it’s New York City time. It’s not New York City time. It’s not Vermont time. It’s not LA time,” said U.S. Rep. Marc Veasey, a Fort Worth Democrat, noting that Texas is far from becoming one of the country’s liberal bastions. “If you are a candidate running in a tough race in a place like Texas, it does not mean that you can start California dreaming.”\n\nBy numerous indications, the election should have been a sleepy one. Aside from Trump’s margin in 2024, the district has been reliably red: Per one analysis, Republicans have carried it by an average of nearly 19 points in 44 state and federal contests since 2018. \n\nThe first indication that the race would be a live one arrived in November, when Rehmet finished three points shy of winning the seat outright. \n\nIn both rounds, but especially in the runoff, Texas GOP leaders went to bat for Wambsganss, tapping into their own funds, block-walking the district and ringing alarms about the race, saying they needed to keep the seat red and away from a radical Democrat. \n\nIn all, Wambsganss’ campaign reported raising $2.6 million, almost two-thirds — $1.6 million — of which came from three of the most powerful and loaded groups in Texas GOP politics. Texans United for a Conservative Majority, started by right-wing West Texas oil billionaires Tim Dunn and Farris Wilks, gave her campaign nearly $603,000 — more than Rehmet’s entire campaign haul of some $570,000.\n\nThe Texas Senate Leadership Fund, a PAC started by Patrick, who oversees the state Senate, added $463,250. And the influential tort reform group Texans For Lawsuit Reform PAC added $550,000.\n\nRehmet’s campaign knew it simply could not raise the same amount of money, his campaign strategist Jake Davis said in an interview Sunday. \n\nBut the camp was also not interested in a strategy that involved matching Wambsganss dollar for dollar, Davis said. Knowing they would be outgunned on the advertising airwaves, Davis instead sought out to assemble a staff of Texans from across the state, based them in Tarrant County and identified a north star of knocking on 40,000 doors. \n\nEvery week, they worked backward from that target — spending time with people in their living rooms, kitchens and driveways. The staff received training on active listening, Davis said. If a voter had a question the volunteer did not have an answer for, Rehmet’s team would run it down — sometimes calling the candidate himself in front of the voter. \n\n“We had to stay relentlessly disciplined,” Davis said. “Every single dollar, every hour, every volunteer shift, had to have a purpose. There were so many un-sexy decisions that we had to make.”\n\nOf course, the campaign received help, like from Romero — as well as from Beto O’Rourke, the Democratic darling who shattered fundraising goals and expectations in 2018 when he almost unseated U.S. Sen. Ted Cruz. \n\nO’Rourke’s political group, Powered by People, helped register people to vote in the district, stayed in touch with them to encourage them to vote and called and texted 30,000 voters eligible to vote by mail. In an interview Sunday, the former El Paso congressman credited Rehmet’s campaign for the victory — and struck an optimistic tone for Democrats in November. \n\n“I don’t think any Republican is safe right now,” O’Rourke said. “I think the people of Texas have absolutely had it and are looking for change.”\n\nBo French, until recently the Tarrant County GOP chair, blamed poor turnout among Republican voters.\n\n“I see a lot of Republicans blaming everyone from the Governor to the county party,” French wrote on social media. “Republicans need to wake up. When you stay home during local elections and special elections, Democrats win. You can’t blame others for your failure to vote.”\n\nSome party superiors see a serious threat. In an early Sunday social media post, Patrick vowed to keep fighting and take the seat back in November.\n\n“Low turnout special elections are always unpredictable,” Patrick wrote. “The results from SD 9 are a wake-up call for Republicans across Texas. Our voters cannot take anything for granted.”\n\nTrump, for his part, distanced himself from the loss, spinning heads in the process after he had posted three different get-out-the-vote messages in the 48 hours leading up to the election. \n\n“I’m not involved in that,” Trump told reporters at his Mar-a-Lago estate in Florida. “That’s a local Texas race.”\n\nAs political observers tried to make sense of the upset, a range of theories emerged to explain what still remained inexplicable to many as the dust settled: It was a referendum on Trump, it was a response to socially conservative policies, it was a response to the hard-right turn of local GOP leaders, it was a poorly run GOP campaign, and onward.\n\nJohn Huffman, the Republican former Southlake mayor who finished a distant third in the November election, chalked it up to “failed opportunities to unify.”\n\n“There was no outreach to the 19,000 voters who supported our campaign in November,” Huffman wrote on social media. “Nor did Leigh’s campaign reach out to me until days before early voting began, leaving no time to unify Republicans or broaden the coalition. When she and I finally did meet, she ended the conversation almost as soon as it started.”\n\nWambsganss pushed back on Huffman’s statement during an interview Monday morning with conservative radio host Mark Davis. She blamed Republicans who did not turn out to vote but said the weather also affected some voters. She also said it was time for the GOP to unite, adding Tarrant County is not as red as it once was.\n\n“I think this is a really good wake up for Texas that Texas needed,” she said. “Republicans have to stop the infighting and move on and do what’s best [for] keeping Texas conservative and free.”\n\nOn paper, Wambsganss’ conservative bona fides were unmatched by many GOP candidates seeking office in Texas.\n\nShe is the chief communications officer for Patriot Mobile, a cellphone company that has helped back the Christian conservative school board candidates who overhauled libraries, curricula and raised hell in board meetings across the state about what children are taught.\n\nShe had the backing of party state leaders and the district’s former state senator.\n\n“They could have built her in their garage,” veteran Texas Democratic operative Matt Angle said. “Taylor Rehmet is just an absolute reflection of that district. Leigh Wambsganss is an absolute reflection of national MAGA. The voters decided which one they like, and it wasn’t a close call.”\n\nStill, political observers reiterated the uniqueness of the election and the challenges of trying to draw conclusions from an election that only drew a sliver of registered voters. \n\nJason Villalba, a former Republican state representative who now leads the Texas Hispanic Policy Foundation, predicted Latinos — “the most important swing vote in the country,” he said — will continue to vote in surprising ways in coming elections. He cautioned that such voting trends “in today’s climate move at light speed.”\n\n“I don’t think you can take what happened last night and say, that’s gonna hold into November, and these numbers are now static and nothing’s going to change,” Villalba said. “It’s early. This was a strong indicator that Hispanics are moving back toward Democrats.”","summary":"Observers of the race said Rehmet’s working-class appeal, along with Latino and suburban backlash to GOP policies, fueled his win in a district Donald Trump carried by 17 points.","url":"https://www.texastribune.org/2026/02/02/texas-senate-district-9-special-election-taylor-rehmet-upset-latino-suburban-backlash/","image":"https://i0.wp.com/www.texastribune.org/wp-content/uploads/2026/02/20260131_Shawzen-Election-Day-9-copy.jpg?fit=2560%2C1707&quality=89&ssl=1","video":null,"publish_date":"2026-02-02 11:00:00","author":"Alejandro Serrano","authors":["Alejandro Serrano"],"language":"en","source_country":"us","sentiment":-0.283},{"id":398576534,"title":"A new poll shows Trump&#8217;s core base is shrinking","text":"President Donald Trump appears to have lost a significant amount of support from a critical sector of his own party since last year. It’s a bad sign for his maximalist governing strategy — and a hopeful bit of news for those organizing a coalition against his autocratic agenda.\n\nAccording to the Pew Research Center, which surveyed more than 8,000 U.S. adults between Jan. 20 and Jan. 26, Trump’s approval rating has dropped from 40% in the fall to 37% today, and 50% say that the Trump administration’s actions have been worse than they expected, versus 21% who say they’re better than expected. But here’s where it gets strikingly bad for the president: “Only about a quarter of Americans today (27%) say they support all or most of Trump’s policies and plans, down from 35% when he returned to office last year. That change has come entirely among Republicans,” Pew reported.\n\nThat response — whether you support all or most of the president’s plans — is a decent proxy for the president’s core base, the swath of the public that’s likely to sign off on anything he does. Considering that Trump is showing fascistic ambition with the way he’s transforming Immigration and Customs Enforcement, or ICE, into a rogue paramilitary force, seeking to annex foreign territories and suppressing free speech, that’s an uncomfortably large swath of the population for a country that prides itself on being the oldest democracy in the world.\n\nTrump’s approval on immigration has plummeted across many surveys over the past year.\n\nBut combined with the roughly 10-percentage-point decline in his overall approval ratings since getting elected, it’s clear that Trump has markedly less political capital than during the pro-Trump “vibe shift” that took place when Trump narrowly won the popular vote, and an Electoral College landslide, in the 2024 election.\n\nPart of what’s driving it appears to be Trump’s failure to address the affordability crisis. In November, a Politico poll, conducted by Public First, found that a majority of Trump voters believed he was partially or entirely responsible for an economy that many of them believe suffers from an unprecedented cost-of-living crisis. A Reuters-Ipsos survey conducted Jan. 12-13 found Trump’s economic approval rating at 34%, and only 30% approval of his handling of the cost of living.\n\nAnother likely factor is the salience of Trump’s aggressive immigration enforcement agenda, which has resulted in the killing of two U.S. citizens in brutal shootings. Trump’s approval on immigration has plummeted across many surveys over the past year, and “abolish ICE” has skyrocketed in popularity. Kristen Soltis Anderson, a Republican pollster, wrote in The New York Times on Thursday that her polling showed that Trump’s immigration rating had flipped from 55% approval to 55% disapproval in the past year. \n\n“On one side of the ledger, there is a decreasing sense that roundups and deportations by federal agents are focused on true security threats,” Anderson wrote. “On the other, there is rising anxiety that the presence of an armed federal force in cities is actively making daily life less safe for people who live there.” \n\nNotably, the economy and immigration were widely considered to be Trump’s winning issues in the 2024 election — the key reasons he prevailed over former Vice President Kamala Harris. Now that he’s lost his footing on those issues, his support within his party is ebbing back toward his most die-hard supporters, the ones who Trump famously boasted would support him even if he shot someone on Fifth Avenue. Given the way the Trump administration has tried to defend ICE acting as a secret police force with their approval, he’s probably right. But he doesn’t have anywhere close to the backing of the whole party on everything he wants to do.\n\nTrump’s de-escalation in Minnesota shows he knows this, and that he’s wary of burning too much political capital on any specific controversial operation. But he also probably overestimates his ability to recover the kind of support he briefly held around his election. \n\nThe president’s growing unpopularity is a major opportunity for the pro-democracy coalition on the left to expand and contain Trump’s power. That could come in the form of persuading disenchanted Republicans to flip toward Democrats during the midterms, or building broader backing for protest movements against Trump’s assaults on democratic features of the country — many of which are surely yet to come.","url":"https://www.ms.now/opinion/trump-polls-approval-ratings-republican-support","image":"https://res.cloudinary.com/msnow/images/t_nbcnews-fp-1200-630/f_auto,q_auto/v1769795533/260130-donald-trump-zz_116363165e97_11636315b106_1163631b185a/260130-donald-trump-zz_116363165e97_11636315b106_1163631b185a.jpg?_i=AA","video":null,"publish_date":"2026-02-02 11:00:00","author":"Ja’han Jones","authors":["Ja’han Jones"],"language":"en","category":"politics","source_country":"us","sentiment":-0.178}]}