{"offset":0,"number":50,"available":445,"news":[{"id":293073784,"title":"George Clooney Reveals Shocking Moment Joe Biden Lost His Support After Actor Was Blamed for Donald Trump Seizing Power Again","text":"George Clooney has opened up about the moment his allegiance for Joe Biden changed after he was blamed for Donald Trump's election win, RadarOnline.com can reveal. \n\nThe longtime, outspoken Democratic supporter attended a re-election campaign fundraiser for Biden, 82, in Los Angeles last June – and then dropped a bombshell op-ed in the New York Times weeks later entitled, \"I Love Joe Biden. But We Need a New Nominee.\"In a recent interview for the Broadway adaptation of his hit film, Good Night and Good Luck, Clooney, 63, addressed what lead him to writing the controversial op-ed less than four months before the historic election. \n\nClooney revealed the moment his support for Biden shifted took place at the fundraiser he attended shortly before the piece was released, when he noticed the former president \"was less sharp\" and watched him be led off stage by ex-President Barack Obama.He noted how he had spoken with Biden for hours at a Kennedy Center in Washington D.C. a year prior, but while speaking with the then-81-year-old at the event in Hollywood, he realized \"saw someone much less sharp.\" \n\nClooney additionally placed blame on the press, saying: \"The media, in many ways, dropped the ball.\" \n\nWhile he reiterated, \"I've always liked Joe Biden and I like him still,\" he doubled-down on how he the incapacities he saw made it difficult for him to continue defending his record and publicly supporting his campaign.The Oscar-winner continued: \"The Biden administration was terrible at explaining that we're a world economy, where we were actually doing better than all the other G7 countries. \n\n\"They were bad at telling the story because their messenger was not working at his best, to say the least.\" \n\nLater in the interview, Clooney addressed meeting Trump earlier in his career – and compared him to Ebenezer Scrooge. \n\nHe said: \"He was a New York guy. He'd be at a restaurant and he'd be like, 'What's the name of that cocktail waitress?'\"Clooney also said he hopes Trump will experience a \"Scrooge\" moment and change course on his policies.\n\nHe said: \"We've got to hope that he can have that Scrooge night where he wakes up and there are some ghosts of Christmas there that say, 'There's some good things you can do for people.'\"\n\nThis was not the first time Clooney has issued a message for Trump in recent weeks. During an appearance on Stephen Colbert's late night show, the movie star spoke openly about his political beliefs and Kamala Harris losing the presidential election.While discussing his feelings on Trump seizing power again, he referenced the January 6 insurrection as he joked: \"Well I don't know, what am I supposed to do? Storm the f------ Capitol?\"\n\nHe then sent other message to Trump, saying: \"Good for you. I hope you do well because our country needs it, and we will meet you in 3.5 years and see where we go next.\"","summary":"George Clooney recalled seeing 'someone much less sharp' when speaking with now former president Joe Biden at a fundraiser.","url":"https://radaronline.com/p/george-clooney-joe-biden-reveals-moment-support-shifted-donald-trump/","image":"https://media.radaronline.com/brand-img/0qRAP2ZBO/0x0/hollywood-turns-back-george-clooney-joe-biden-op-ed-pp-1721077738387.jpg","video":null,"publish_date":"2025-02-21 23:45:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.022},{"id":293075186,"title":"National anthem enthusiasm and the speed of wokeness","text":"Part of this was catharsis: For a while, one would be hard pressed to find a crowd singing along in full to the U.S. National Anthem five years ago. Such a move was socially unacceptable. Kneeling, too, was a prominent reaction. \n\nAfter all, 2020 was not all that long ago:\n\nWith real patriotism on the rise, it feels like a different world. Five years prior, the country’s most prominent concerns were Black Lives Matter riots and efforts to impeach President Donald Trump. COVID-19, of course, colored every impression of everything, and usual left-wing sexuality interests dominated the societal landscape.\n\nDemocrats moved dizzyingly fast into all this, and now, we can be a little bit grateful for it.\n\nSure, gay and transgender items have been in steady incline over many decades. But the LGBT movement is distinct from its actual effects, in that each advance has confused society’s relationship with the concept more and more. “Marriage” rights once catapulted from non-existent to undeniable. The year 2016 is when most people can remember the beginning of transgender advocacy, at which point in-group and out-group dynamics placed instant pressure on conformists. It has only become crazier, as we well know in the present.\n\nThe transformation was quick, but its quickness was able to stay somewhat under the surface. Not so with racial matters: It erupted, literally, with George Floyd’s death in May of 2020 after building since Trayvon Martin’s death in 2012. The violence was one aspect of the riots, and deep shame followed. White liberals reacted instantly with shows of anti-racist intent, almost as instantly as black liberals called out the perceived injustice.\n\nWe are in the process of undoing a left-wing normal these days. It highlights just how recent were the events of 2020, how ever-changing it all is — and much of that has to do with how open to transformation the Left was in the first place.\n\nCANADA WASN’T READY FOR TRUMP\n\nOf course, the same applies to the Right: We are snapping back, currently on an election high. That is just how political reactions work. Yet for some reason, Democrats are clinging to what helped them lose. As former Vice President Kamala Harris polls best among Democratic frontrunners for the next election, it seems that her party of progress wants no leftward slow-down. \n\nSuch speed landed them in a disaster most recently, and conservatives can be glad it all went by pretty quickly. Hopefully, the same result will occur, and keep occurring, until it is safe to calm things down.","summary":"Even if most people had not heard of the 4 Nations hockey tournament that concluded this week, they were thrilled by the national anthem faceoff that accompanied the matches. Part of this was catharsis: For a while, one would be hard pressed to find a crowd singing along in full to the U.S. National Anthem [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/3326513/national-anthem-enthusiasm-and-the-speed-of-wokeness/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/canadian-fans-booinig.webp","video":null,"publish_date":"2025-02-21 23:21:36","author":"Emma Fuentes","authors":["Emma Fuentes"],"language":"en","source_country":"us","sentiment":0.033},{"id":293070236,"title":"Even neo-Nazis say it’s getting a ‘little excessive’ following Steve Bannon’s CPAC salute","text":"After Steve Bannon was accused of wrapping up his CPAC speech with a Nazi salute, prompting one far-right French politician to cancel his appearance at the conservative confab, prominent white nationalists said that the gesture has gotten “a little excessive” even for them.\n\nA month after “first buddy” Elon Musk sparked intense outrage for empathically throwing up his right arm during his Inauguration Day speech, provoking loud denunciations across the world over what many felt was a “Sieg Heil,” Bannon appeared to replicate the gesture from the CPAC stage.\n\nCalling for Donald Trump to run for a third term, the former Trump strategist yelled “fight, fight, fight” while the audience cheered. He then quickly flashed his stiff arm out in an angular fashion with his palm down before ending his speech with an “amen.” \n\nNick Fuentes, an influential neo-Nazi activist whose followers call themselves “Groypers,” reacted to Bannon’s speech by calling it “crazy” that suddenly the fascist gesture was “in now” among conservatives.\n\n“Elon threw up a Roman salute, and then the other thing at CPAC – Bannon gets up there – this was some sick s***,” Fuentes said on his Thursday night podcast. “Bannon gets up there and says, ‘Trump’s gonna run in ‘28!’ He goes, ‘We want Trump!’ Then he throws up a straight-up Roman salute! It's getting a little uncomfortable even for a guy like me! Even I’m starting to feel like that guy in that picture who wouldn't Heil Hitler!”\n\nFuentes went on to note how ironic it was for him to say how “uncomfortable” he was getting with the increased number of salutes occurring at conservative events, pointing out that he was the one who’d written “policy for Supreme Leader Kanye West” based on Adolf Hitler’s ideology.\n\n“It’s getting even a little excessive for me,” he added. “I don’t know. It’s getting a little too real. I was just kidding, for the most part. I was kidding, largely.”\n\nRichard Spencer, a notorious white supremacist who infamously shouted “Hail Trump” and threw up a Nazi salute following Trump’s 2016 election, also took issue with Bannon’s gesture and felt he was just trying to get a reaction.\n\n“Steve Bannon is a Roman Catholic Irishman ... a nationalist and populist ... a self-described Christian-Zionist ... a man who denounces racism and demands greater representation of African-Americans at tech companies ... and a man who lazily initiates a ‘Hitler Gruß’ just before saying ‘Amen,’” Spencer tweeted on Friday afternoon.\n\n“The Manson Family had a more coherent ideology than MAGA. And the liberal criticism that American \"fascism\" is merely a personality cult around Trump seems justified,” he added. “At least Elon—an atheist eugenicist obsessed with rockets—seems to have really meant it!”\n\nSpencer, perhaps best known for helping lead the Unite the Right rally in Charlottesville in 2017, has since claimed that his views have moderated. He even surprisingly endorsed Kamala Harris in the last election.\n\nFollowing Bannon’s speech, Jordan Bardella – the president of France’s far-right National Rally – pulled out of his planned CPAC appearance because “one of the speakers provocatively made a gesture referring to Nazi ideology.” \n\nAsked by the New York Times to react to Bardella’s remarks, Bannon denied making a Nazi salute, claiming he merely “waved to the MAGA movement as I always do in my motivational speeches.” He also lashed out at Bardella, calling him “too weak to govern France” and asserting that “the leaders of this worldwide revolution gathered @ CPAC consider him a coward.”\n\nMeanwhile, another CPAC speaker – Sound of Freedom producer Eduardo Verástegui – also replicated the gesture on Friday morning, saying his “heart goes out to all of you” while drawing applause as he held his right arm out in the familiar position. Other copycat incidents have occurred in recent weeks at right-wing conferences, prompting outcry and repercussions for the speakers.","summary":"‘The Manson Family had a more coherent ideology than MAGA. And the liberal criticism that American ‘fascism’ is merely a personality cult around Trump seems justified,’ notorious white supremacist Richard Spencer said on Friday","url":"https://www.independent.co.uk/news/world/americas/us-politics/nick-fuentes-steve-bannon-cpac-salute-b2702639.html","image":"https://static.independent.co.uk/2025/02/21/4/39/Steve-Bannon-salute.png?trim=0,193,0,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/qytRDyo2-4VHSaSK0.mp4","publish_date":"2025-02-21 22:51:56","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.381},{"id":293075942,"title":"Courageous governor tells Trump to stick it ... to his face","text":"She defied him. To his face. Imagine that, GOP lawmakers. Imagine that.\n\nIn a meeting with governors on Friday at the White House, President Donald Trump was bragging about how he made everyone back down with his executive order banning transgender athletes from women’s sports.\n\n“Every state [has complied],” Trump said. “The NCAA has complied immediately, by the way. That’s good. But I understand Maine ... is Maine here, the governor of Maine?”\n\n“Yeah,” Gov. Janet Mills answered from the side of the room. “I’m here.”\n\n“Are you not going to comply?” Trump asked.\n\n“I’m complying with the state and federal laws,” she said defiantly.\n\nTrump insisted, “We are the federal law” and added, “You better do it,” or he would withhold funding from her state. \n\nHe said that even though her state was liberal, he did “very well” there during the presidential election (he lost to Kamala Harris, 52%-45%), and insisted that most people in her state didn’t want transgender female athletes — those who were male at birth — competing in women’s sports. \n\n“You better comply, you better comply,” Trump said, “because otherwise you’re not getting any federal funding.”\n\n“See you in court,” she fired back.\n\n“Good,” he said. “I’ll see you in court. I look forward to that. That should be a real easy one.” \n\nOf course, Trump is losing more often than he’s been winning in court over immigration, citizenship and other issues.\n\nTrump paused and added, “And enjoy your life after governor, because I don’t think you’ll be in elected politics.”\n\nWhich, of course, is curious coming from a lame-duck president.\n\nThe standoff between the administration and Maine’s leaders continued to escalate Friday. Shortly after Mills’s exchange with Trump, the U.S. Department of Education sent a letter to the state’s education commissioner, Pender Makin, notifying her that it was initiating a “directed investigation” of Maine’s Education Department. The letter singled out one school in particular, citing reports that it had allowed “at least one male student to complete in girls’ categories.”\n\nHawaii’s Democratic governor, Josh Green, was at the meeting at the White House, too. “Several of the governors I talked to were a little bit distressed by that back and forth,” he said afterward, “because it seemed it was a little bit harsh — and it wasn’t yelling, but it was unnecessary conflict.”\n\nIt was just “a moment,” he added, “but she stood firm against him.”","summary":"Presidents doesn't take it well","url":"https://www.nj.com/politics/2025/02/fearless-governor-tells-trump-to-stick-it-to-his-face-he-doesnt-take-it-well.html","image":"https://www.nj.com/resizer/v2/BPKUZJEIJRDJLDT3PWCKISDZXA.jpg?auth=e9526bb7c3aa1fbe0903e0cad6e890e9833ce6d545decb41eede0a7600eea947&width=1280&quality=90","video":null,"publish_date":"2025-02-21 22:42:21","author":"Kevin Manahan","authors":["Kevin Manahan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.064},{"id":293050942,"title":"Ric Grenell Says He Will Run for Governor of California on Only One Condition","text":"OXON HILL, Md.—Ric Grenell, former ambassador to Germany and acting director of national intelligence in the first Trump administration, said he might run for governor of California, but only under one condition.\n\nDasha Burns, the White House bureau chief for Politico, interviewed Grenell on the main stage at the Conservative Political Action Conference on Friday. \n\n“While we’re on California, since you have so many ideas for the state, are we going to see Richard Grenell run for governor of California?” Burns asked.\n\nGrenell, who now serves as president of the John F. Kennedy Center for the Performing Arts, said he likely won’t run.\n\n“Honestly, it’s not in my plan unless Kamala Harris runs for governor,” he replied.\n\n“I mean, here’s the thing: We already know who she is,” Grenell explained. “We’ve spent hundreds of millions of dollars to define who Kamala Harris is. If she thinks that she’s going to run for governor of California, a Republican is going to win, and I might not be able to resist trying to run against her.”\n\nGrenell, who became the first openly gay Cabinet-level official when he became acting director of national intelligence, had previously been floated as a California gubernatorial candidate. He expressed interest in running in the 2021 recall election against Gov. Gavin Newsom, but he announced he would not do so on July 15 that year.\n\nCalifornia has many conservatives, but it is typically considered a deep blue state. Newsom, a Democrat, won reelection in 2022 with 59.2% of the vote, beating his Republican opponent by nearly 20 points.\n\nCelebrating Jesus’ Birth\n\nGrenell now leads the Kennedy Center, Washington, D.C.’s arts center. He announced that the Kennedy Center will celebrate Jesus’ birth at Christmastime, and the crowd applauded loudly.\n\n“We are doing a big huge celebration of the birth of Christ at Christmas,” he announced. “How crazy is it to think that we’re going to celebrate Christ at Christmas with a big traditional production to celebrate what we are all celebrating in the world during Christmastime?”\n\nTrump Meeting With Putin\n\nBurns asked Grenell about President Donald Trump’s recent meeting with Russian leader Vladimir Putin. Grenell emphasized that while Trump left the world safer as he exited office, former President Joe Biden left his successor a more dangerous world, and Trump has to deal with the world as it is.\n\n“Remember that we handed Joe Biden total peace in the Middle East and total peace in Europe,” he said. “He handed us a war in the Middle East and a war in Europe, and we can never forget that. So, I do get a little bit frustrated with reporters when they say, ‘Your decision now isn’t perfect,’ and I’m like, ‘Yeah, we were put in a hole, we were put in a terrible situation.’”\n\nHe also insisted that Trump has met with Ukrainian President Volodymyr Zelenskyy and his team up to 10 times. “I never once heard from the media an outrage that the Russians weren’t invited to those talks,” he said. “However, the one time that the Trump team reaches out to say, ‘How about we talk to the Russians?’ there’s this hue and cry from the Europeans and everybody to say, ‘Why aren’t the Ukrainians involved?’”","summary":"OXON HILL, Md.—Ric Grenell, former ambassador to Germany and acting director of national intelligence in the first Trump administration, said he might run for governor... Read More\n\n\nThe post Ric Grenell Says He Will Run for Governor of California on Only One Condition appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/21/ric-grenell-says-will-run-governor-california-only-one-condition/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/Ric-Grenell.jpg","video":null,"publish_date":"2025-02-21 21:37:18","author":"Tyler O,Tyler O'Neil","authors":["Tyler O","Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":-0.291},{"id":293050948,"title":"The One-Sidedness of ‘60 Minutes’: Liberal Bias Taints What Once Was Gold Standard of Broadcast Journalism","text":"There was a time, not all that long ago, that CBS’ “60 Minutes” was widely regarded as the gold standard of broadcast journalism. Regrettably, not so much anymore.\n\nWith the luxury of being able to do long-form, in-depth reporting, rather than the typical mainstream media hit-and-run headline-and-sound-bite journalism, “60 Minutes” could and did present thorough, thoughtful, and evenhanded reports on controversial topics.\n\nIt still does from time to time, notably just two months ago on Dec. 15, when it aired a pair of riveting reports: One about life in post-Assad Syria, now that it’s no longer under the boot of deposed dictator Bashar Assad; the other exposing how artificial intelligence-powered dark-web sites are enabling the deepfake “pornification” of photos of teenage girls.\n\nThose reports represent what journalism could be—and should be.\n\nBut in the past several years, “60 Minutes” has all-too-often aired reports with a left-wing bias nearly indistinguishable from what you would find on MSNBC.\n\nThis past Sunday night, for example, correspondent Scott Pelley narrated a 13-minute segment, titled “28 Days,” about the first four weeks of President Donald Trump’s second term.\n\nThe show’s opening tease—with its trademark stopwatch ticking, in this case almost as if it was a time bomb—previewed the ominous tone of the report this way: “It’s too soon to tell how serious President [Donald] Trump is in defiance of the Constitution, but in just 28 days, he’s reinterpreted the 14th Amendment and closed agencies that Congress mandated by law.”\n\nIt was all downhill from there, beginning with two federal contractors lamenting how they had been dismissed with little notice from their jobs at the U.S. Agency for International Development. USAID was the first federal department to be targeted for downsizing and ridding of waste by Trump and Elon Musk’s Department of Government Efficiency.\n\nBut Pelley devoted not so much as a single word to the widely publicized list of USAID programs that have squandered hundreds of millions of dollars on wasteful and fraudulent programs abroad, many of them promoting radical DEI and LGBTQ agendas. He then doubled down by letting leftist Georgetown law professor Steve Vladeck dismiss what he called Trump and Musk’s “claims of fraud” to be just “fig leafs” to mask a power grab on their part.\n\nPelley, a former “CBS Evening News” anchor also failed to identify one of the two distraught, dismissed USAID consultants he interviewed as Kristina Drye. Drye was a speechwriter for President Joe Biden’s USAID chief, Samantha Power—hardly an objective source.\n\nBoth were examples of blatant bias by omission.\n\nIt was clear that the “60 Minutes” producers and CBS had learned nothing from the lawsuit filed against them in late October by Trump, who sued over the program’s deceptive editing of its preelection interview of then-Vice President Kamala Harris.\n\nRequired by the FCC to release an unedited transcript and the raw footage of the Oct. 7 interview after Trump’s complaint, it was revealed it had been edited in such a way as to make Harris’ answers to correspondent Bill Whitaker’s questions sound more concise and coherent than they actually were.\n\nTrump has sued CBS for $20 billion, accusing it of “partisan and unlawful acts of election and voter interference” intended to “mislead the public and attempt to tip the scales” of the Nov. 5 presidential election in Harris’ favor—albeit unsuccessfully.\n\nAll of that called to mind a masterstroke move by Trump four years earlier, when on Oct. 22, 2020, he released on Facebook his own 37-minute videotaped version of a highly contentious “60 Minutes” preelection interview ahead of its network airing three days later. That presumably was intended to preempt any chance of correspondent Lesley Stahl excerpting and presenting questions and answers out of context to make him look bad.\n\nAnd that was hot on the heels of Stahl’s “60 Minutes” report two weeks earlier on Oct. 11, 2020, “Inside the Lincoln Project’s Campaign Against President Trump,” which portrayed the rabidly anti-Trump group of Republican-in-Name-Only (RINO) grifters in the most favorable light possible. CBS should have been required to file a report with the Federal Election Commission for what amounted to an in-kind contribution to Joe Biden’s campaign a little more than three weeks before the presidential election.\n\nThen, on Nov. 8, 2020, just five days after Biden’s election, Whitaker’s report dismissive of Republican charges of voter fraud in Philadelphia was shameless in its one-sidedness and anti-Trump bias.\n\nThe liberal, pro-Democrat slant of “60 Minutes” has not been directed solely at Trump, however. On April 5, 2021, correspondent Sharyn Alfonsi presented a hit piece on Republican Florida Gov. Ron DeSantis, pointedly accusing him of a “pay-for-play” campaign contribution scheme involving state COVID-19 vaccination contracts.\n\nThe report was deceptively edited to omit almost all of DeSantis’ lengthy, detailed explanation at a news conference attended by Alfonsi, in which he thoroughly refuted the specifics of her accusation.\n\nThat detailed explanation wound up on the cutting-room floor at “60 Minutes,” but conservative podcaster Dave Rubin used video footage from The Florida Channel, which had carried the news conference live, to show how egregiously misleading Alfonsi’s report was.\n\nIt was another case of bias by omission.\n\nAlfonsi’s attempted takedown of DeSantis contrasted sharply with a 12-1/2-minute glowing puff-piece profile of Sen. Angus King of Maine by correspondent Jon Wertheim that aired three months earlier on Jan. 10, 2021. King, now in his third term, claims to be an independent, but caucuses with Democrats and votes almost invariably in lockstep with the ultraliberal Democratic Party line, as I documented in great detail in this space on Feb. 5.\n\nNor is the liberal bias of “60 Minutes” limited to politicians it favors or disfavors.\n\nPelley’s Jan. 2, 2023, report on global warming (aka climate change) was apocalyptic in its hand-wringing. But he made no mention at all of the innumerable times the climate alarmists have been completely wrong in their prior doomsday predictions dating back to 1967, as Zerohedge.com painstakingly detailed in a report just two days earlier on Dec. 31, 2022: “2022, Same Sh**, Different Year: 55 Years of Failed Eco-pocalyptic Predictions.”\n\nThere are several other examples of the liberal bias of “60 Minutes” that I could have included here, but won’t, mostly for fear of belaboring the point. But we shouldn’t fail to mention then-correspondent Steve Kroft’s Dec. 11, 2011, softball interview with then-President Barack Obama. \n\nIt was Kroft’s seventh “60 Minutes” interview of the liberal Illinois Democrat in less than three years, and the program’s (at least) 11th since Obama first emerged on the national political scene in 2004. No other president has enjoyed that kind of “man crush” from Kroft or “60 Minutes” in its 57 seasons on the air.\n\nIt’s regrettable that “60 Minutes,” once the gold standard of broadcast news, has become liberal fool’s gold. The public’s trust in the legacy media as a whole has cratered, with an October 2024 Gallup poll showing just 31% of respondents expressing a “great deal” or “fair amount” of confidence in the media to report the news “fully, accurately, and fairly.” Some 36% of U.S. adults have no trust at all in the media, and 33% of Americans expressed “not very much” confidence.\n\nAs a result, more people than ever are getting their news from other sources, and that’s due in no small part to “60 Minutes.”\n\nOriginally published at The Washington Times","summary":"There was a time, not all that long ago, that CBS’ “60 Minutes” was widely regarded as the gold standard of broadcast journalism. Regrettably, not... Read More\n\n\nThe post The One-Sidedness of ‘60 Minutes’: Liberal Bias Taints What Once Was Gold Standard of Broadcast Journalism appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/21/the-one-sidedness-of-60-minutes-liberal-bias-taints-what-once-was-gold-standard-of-broadcast-journalism/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/2025022_60MinutesLogo.jpg","video":null,"publish_date":"2025-02-21 21:18:38","author":"Peter Parisi","authors":["Peter Parisi"],"language":"en","source_country":"us","sentiment":-0.275},{"id":293048678,"title":"Democrats silent on Patel as first ‘person of color’ FBI director despite previous DEI emphasis","text":"Democrats have remained notably silent since Kash Patel became the first \"person of color\" to head the FBI, after previously emphasizing diversity and representation on the campaign trail and during the Biden era. Patel, a fervent Trump ally, underwent a rocky path to confirmation, with Democrats on the panel attempting to delay the vote earlier this month and continuing to protest his nomination into Thursday. Despite the criticism, Democrats have yet to make note of Patel, who is Indian-American, making history as the first \"person of color\" FBI director. KASH PATEL LAYS OUT FBI'S TOP TWO PRIORITIES IN LETTER TO SUBORDINATES Senate Judiciary Committee Democrats, including ranking member Dick Durbin, D-Ill., Richard Blumenthal, D-Conn., and Adam Schiff, D-Calif., protested Patel's confirmation outside the FBI headquarters in Washington, D.C., on Thursday morning. Sen. Sheldon Whitehouse, D-R.I., in particular, drew criticism from conservatives on social media after saying, \"Kash Patel, mark my words, will cause evil in this building behind us, and Republicans who vote for him will rue that day.\" \"Did Sheldon Whitehouse come up with this pathetic line of attack at his all-white beach club?\" asked conservative commentator and longtime Trump adviser Steve Cortes, referencing Whitehouse's membership in an exclusive beach club that has a controversial history. Whitehouse’s office previously denied that the club was all-White. FBI DIRECTOR KASH PATEL VOWS TO RESTORE TRUST IN BUREAU, HUNT DOWN BAD ACTORS 'IN EVERY CORNER OF THIS PLANET' \"President Trump nominated Kash Patel because of his qualifications and commitment to restoring integrity to the Federal Bureau of Investigation. In contrast to the picture the media tries to paint, President Trump wants equality for all Americans regardless of skin color, which is why he eliminated unfair DEI policies and is restoring common sense to our country,\" Harrison Fields, Principal Deputy Press Secretary, told Fox News Digital. Democrats notably emphasized diversity and representation during both the 2020 and 2024 campaign trails as well as during the Biden era. Prior to his 2020 win, former President Joe Biden committed to naming a woman as his running mate and noted during the run-up to his decision that Black women were among his finalists. Likewise, upon taking her post as White House Press Secretary in 2022, Karine Jean-Pierre pointed to her race and sexual orientation during her first opening remarks on the job, thanking those who had fought for the progress that allowed her to fill her new role. HERE'S WHAT KASH PATEL'S FORMER COLLEAGUES ARE SAYING ABOUT HIM \"I am obviously acutely aware that my presence at this podium represents a few firsts. I am a black, gay, immigrant woman, the first of all three of those to hold this position,\" Jean-Pierre said during her first briefing. \"I would not be here today if it were not for generations of barrier-breaking people before me. I stand on their shoulders.\" Biden also announced that same year that he was committing to nominate a Black woman to the Supreme Court after Justice Stephen Breyer announced his retirement. While on the 2024 campaign trial, Democrats made notable efforts to increase support among Black men for then-Vice President Kamala Harris, who would have made history if she had been elected as the nation's first female president. CLICK HERE TO GET THE FOX NEWS APP Former President Barack Obama rebuked Black voters during a Pittsburgh campaign event, saying he couldn't understand why Harris wasn't enjoying the same level of enthusiasm, noting that the hesitation was \"more pronounced with the brothers.\" Speaking directly to Black males, Obama said that \"part of it makes me think that, well, you just aren’t feeling the idea of having a woman as president, and you’re coming up with other alternatives and other reasons for that.\" Fox News Digital's Adam Shaw, Michael Lee, and Paul Steinhauser contributed to this report.","summary":"Democrats have stopped short of commenting on Kash Patel become the first &quot;person of color&quot; to head the FBI despite the party&apos;s previous emphasis on representation and diversity.","url":"https://www.foxnews.com/politics/democrats-silent-patel-first-person-color-fbi-director-despite-previous-dei-emphasis","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/harris_patel_pierre.png?ve=1&tl=1","video":null,"publish_date":"2025-02-21 20:53:10","author":"Haley Chi-Sing","authors":["Haley Chi-Sing"],"language":"en","source_country":"US","sentiment":0.083},{"id":293043458,"title":"Tension mounting at ‘The View’ as hosts asked to dial back Trump criticisms, layoffs: ‘Morale is low’","text":"The talk show hosts on “The View” are being pressured to tone down their criticism of President Trump after ABC’s latest round of layoffs, The Post reported Friday.\n\nAn insider close to Whoopi Goldberg, Joy Behar, Sunny Hostin, Sara Haines, Alyssa Farah Griffin and Ana Navarro exclusively told The Post that “morale is low” as cost-cutting continues.\n\nSources also disclosed that the mood on set is growing tense after the show’s executive producer, Brian Teta, asked staffers to go “easy” on Trump-related conversations ahead of the 47th president’s inauguration last month. \n\nDespite the show’s nearly 2.6 million total viewers in the last four weeks, staffers are terrified for their jobs after Teta laid off at least nine workers including two senior female producers, Jamie Hammer and Audrey Jones, one insider shared.\n\n“People were shocked that he’d fire such experienced, well-respected producers,” the source said, adding, “Morale is low.”\n\nThe insider claimed that “everybody is waiting for the other shoe to drop” despite the firings being part of parent company Disney’s wider cost-cutting initiative in October. \n\n“There’s a lot of anxiety even though they just went through layoffs,” said the source. \n\nMeanwhile, The Post has learned that the show’s co-hosts are disgruntled over the fact that they are sharing a studio and dressing room with Tamron Hall’s eponymous show in ABC’s new headquarters. \n\nAn insider close to the situation said the ladies of “The View” are unhappy that their guests have to share a dressing room with the other show’s guests and that the set must be treated as a shared space.\n\nStaffers, therefore, cannot leave their belongings in the studio overnight as they could at their previous workspace. Furthering anxieties, the shows have allegedly been quarreling over taping schedules, which are sometimes known to overlap. \n\n“Tamron Hall thinks she’s Oprah. She is very demanding,” the source said. “She doesn’t realize she’s playing second fiddle to ‘The View.’”\n\nAnother source familiar with both show’s production teams told The Post: “Kudos to both productions for seamlessly working together to bring our viewers several hours of television each week.”\n\nAs Page Six previously reported, ABC News has moved the majority of its shows to New York City’s downtown Hudson Square neighborhood — dubbed by staffers as “no man’s land.” \n\nOn top of having to share the space, employees must deal with the heavy traffic surrounding the nearby Holland Tunnel. \n\n“There are not a lot of desks. People just get drawers, and they are assigned lockers,” an insider shared. “The new office is very basic. There isn’t enough space or offices. There are no executive suites, just regular-sized offices.”\n\nA network source denied the claim, telling us there are “plenty of desks” and spaces to “accommodate everyone.”\n\n“The building is gorgeous,” the network source said, though the first source asserted, “Everyone at ABC News hates the studio downtown.”\n\nReps for ABC News and Tamron Hall declined to comment to The Post.\n\n“The View” co-hosts have become more cautious about the way they discuss politics when it comes to Trump.\n\nLast month, Haines said she felt out of touch with her viewers because she and her co-hosts didn’t vote for Trump.\n\nGriffin, a former Donald Trump staffer who ended up endorsing Kamala Harris in the 2024 presidential race, also clashed with Goldberg when she tried to convince her to be more open to engaging in conversations with the other side.\n\n“Democrats have to be willing to go to uncomfortable spaces,” Griffin said at the time, admitting to agreeing with some of Trump’s policies.","summary":"“There’s a lot of anxiety even though they just went through layoffs,\" a source told The Post, adding “Everybody is waiting for the other shoe to drop.\"","url":"https://pagesix.com/2025/02/21/entertainment/tension-mounting-at-the-view-as-hosts-asked-to-dial-back-trump-criticisms-layoffs-morale-is-low/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/02/98939637.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/rrbxz3OR-guILbWnz.mp4","publish_date":"2025-02-21 20:46:17","author":"Leah Bitsky","authors":["Leah Bitsky"],"language":"en","source_country":"us","sentiment":0.026},{"id":293041176,"title":"Joe Biden administration was terrible: George Clooney explains why Donald Trump won US election","text":"Oscar-winning actor-filmmaker George Clooney has shared his views on why Donald Trump won the 2024 presidential election in the US against Kamala Harris. According to the Ocean’s Eleven actor, former US president Joe Biden's administration was terrible in explaining that we’re a world economy .Last year, Biden had opted out of the presidential race and announced then US Vice President Kamala Harris as his replacement as the Democratic presidential nominee.George Clooney’s comments on Joe BidenIn his explanation about why Trump won the 2024 presidential polls, Clooney told The New York Times, The Biden administration was terrible at explaining that we’re a world economy, where we were actually doing better than all the other G7 countries”.He added that the Democrats were bad at telling the story because their messenger was not working at his best, to say the least.”George Clooney's op-edIn July last year, Clooney in an op-ed had urged Joe Biden to drop out of the US presidential election. Back then, this was looked upon as a major turning point in Biden's campaign as he eventually announced his exit and got replaced by Harris.In his op-ed for The New York Times, Clooney called himself a lifelong Democrat and said he was proud of what the party represents and stands for. He shared how he co-hosted a fund-raiser a month before that in support of Biden’s re-election. Although Clooney said that he loved Biden and considered him a friend, the actor noted one battle which Biden cannot win is the fight against time. He added that it was devastating to see that the Biden he saw at the fund-raiser last year was not the Biden of 2010. Also Read : Montana lawmakers tighten rules on hiring illegal immigrants: What you need to knowBesides Biden, Clooney has also led fund-raisers for Hillary Clinton in 2016 and Barack Obama in 2012.What happened at the fund-raiser?At the fund-raiser event in Los Angeles in June last year, Clooney and Obama were present on stage in support of Joe Biden. However, when Biden appeared to freeze, Clooney was left gobsmacked as Obama took the then-president away. Talking about the event, which raised $28 million, Clooney said that he saw Biden for hours the year before that at the Kennedy Center, while he saw someone much less sharp” that night.However, Clooney added that he has always liked Joe Biden and still does.The 63-year-old, who is married to human rights lawyer Amal Clooney, is currently gearing up for his Broadway debut in March. In the show, which is a stage adaptation of his 2005 film Good Night, and Good Luck, Clooney will be seen essaying the role of CBS newsman Edward Murrow.Also Read : Austin FC vs Sporting Kansas City on February 23: Match preview, prediction, head-to-head and key statsFAQs1. When did George Clooney and Amal Clooney get married?The couple got married in 2014.2. What happened during the 2024 presidential election in the US?Trump claimed 312 electoral votes against Harris' 226, besides winning the popular vote and sweeping across battleground states.","summary":"Months ahead of the November 5 US presidential election last year, George Clooney's op-ed played a key turning point in Joe Biden's campaign and played a part in his exit from the presidential race. Clooney now says that the Biden administration was \"terrible\" in explaining that the US is a world economy since their \"messenger was not working at his best\".","url":"https://economictimes.indiatimes.com/news/international/us/joe-biden-administration-was-terrible-george-clooney-explains-why-donald-trump-won-us-election/articleshow/118462124.cms","image":"https://img.etimg.com/thumb/msid-118462125,resizemode-4,width-1200,height-900,imgsize-1493718,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-21 20:06:12","author":"The Feed","authors":["The Feed"],"language":"en","category":"politics","source_country":"in","sentiment":0.038},{"id":293027984,"title":"Trump loyalist announces first major production for new-look Kennedy Center and names his dream performer","text":"Trump loyalist announces first major production for new-look Kennedy Center and names his dream performer\n\nRic Grenell was installed by Trump as interim executive director of the arts center\n\nBy ROB CRILLY, CHIEF U.S. POLITICAL CORRESPONDENT FOR DAILYMAIL.COM AT CPAC IN NATIONAL HARBOR, MARYLAND\n\nPublished: 19:16 GMT, 21 February 2025 | Updated: 19:25 GMT, 21 February 2025\n\nThe man placed in charge of one of the nation's most prestigious arts institutes offered his vision for its future Friday, promising to clean up the Kennedy Center's finances and to put on events with mass appeal.\n\nTrump confidant Ric Grenell announced plans for a production telling the story of Christ in time for Christmas.\n\n'We have to do the big productions that the masses in the public want to see,' he told a gathering of conservatives just outside Washington, D.C.\n\n'We want to have really good programming. \n\n'So the first thing that we're doing, I think the big change is for everybody to know ... you've got to be at the Kennedy Center in December, because we are doing a big, huge celebration of the birth of Christ at Christmas.'\n\nTrump launched a purge of the center's board earlier this month after denouncing its programing choices.\n\n“Just last year, the Kennedy Center featured Drag Shows specifically targeting our youth — THIS WILL STOP,' he posted on Truth Social\n\nHe then installed Grenell as interim executive director, alongside his role as special presidential envoy for special missions.\n\n'Ric Grenell: 'We are doing a big, huge celebration of the birth of Christ at Christmas'\n\nPresident Donald Trump installed Grenell as interim executive director of the Kennedy Center\n\nA traditional nativity scene showing three kings visiting Jesus on the night of his birth\n\nIt shows how Trump has waged a culture war alongside his political campaign, targeting hotbeds of opposition to him.\n\nActs have already reportedly canceled appearances at the Kennedy Center, as arts aficionados wait to see what the new administration does with it.\n\nGrenell, speaking at the Conservative Political Action Conference, said he had inherited an institution that was going further into debt to pay salaries, despite taking $40 million of public money each year.\n\n'And so what we're going to say at the Kennedy Center is, first of all, we got to clean up the financial situation,' he said.\n\nHe also said it was not true to say that the Gay Men's Chorus had canceled its performance, or been canceled by the new leadership, and that it was a decision taken before Trump took charge. \n\nNor was anyone worrying that big acts would no longer want to perform there,' he said.\n\n'We don't, because we already have them, and I think it's a real misnomer,' he said.\n\nGrenell appeared with Politico's Dasha Burns who asked him who he would most like to see appear at the Kennedy Center. \n\nDolly Parton onstage at \"Dolly: An Original Musical\"Fireside Chat. 28 Jan 2025\n\nDolly Parton, he replied. \n\nGrenell also teased a possible run for governor of California, repeating his line last week that if former Vice President Kamala Harris entered the race then the deep blue state could become winnable for the Republican candidate. \n\n'If she thinks that she's going to run for governor of California, a Republican is going to win, and I may not be able to resist trying to run against her,' he said.\n\nA day earlier, Trump ally Steve Bannon said he had been told the J6 Prison Choir, made up of people jailed for the roles in the 2021 assault on the U.S. Capitol building, would perform at the center.\n\n'I talked to Ambassador Ric Grenell last night, and — the J6 choir is going to play the Kennedy Center for a night in honor of their families,' he said.\n\nWashington DCPoliticsDolly PartonChristmas\n\nShare or comment on this article:\nTrump loyalist announces first major production for new-look Kennedy Center and names his dream performer\n\nAdd comment","summary":"The man placed in charge of one of the nation's most prestigious arts institutes offered his vision for its future Friday, promising to clean up the Kennedy Center's finances.","url":"https://www.dailymail.co.uk/news/article-14422487/trump-kennedy-center-ric-grennel.html","image":"https://i.dailymail.co.uk/1s/2025/02/21/19/95456997-0-image-a-25_1740165365050.jpg","video":null,"publish_date":"2025-02-21 19:25:07","author":"Editor,Rob Crilly","authors":["Editor","Rob Crilly"],"language":"en","category":"politics","source_country":"gb","sentiment":0.133},{"id":293019044,"title":"Haitian Migrants Targeted for Removal Fear Death Back Home","text":"Fears are growing within the Haitian community as thousands face deportation after President Donald Trump revoked Temporary Protected Status (TPS) for Haitian immigrants.With 500,000 people at risk of being forced back to a country plagued by political instability and gang violence, advocates warned that the move is not only inhumane but describe by some as \"mass murder.\"Department of Homeland Security (DHS) Secretary Kristi Noem announced on Thursday a rollback of deportation protections and work permits for Haitian TPS holders.The protections, now set to expire in August, overturned a Biden administration decision that had extended them until February 2026.The department said that one reason for allowing the protections to expire was the inclusion of people who entered the country illegally.Tessa Petit, executive director of the Florida Immigration Coalition and a Haitian immigrant, warned that the move will have dire consequences.\"Sending Haitians back to Haiti, over 500,000 of them, that it is inhumane and it's practically mass murder,\" Petit told Newsweek. \"I have friends and family who have that status. I've spoken to some advocates who are community leaders who have expressed the concern that has already been growing in the Haitian community.\"Gepsie M. Metellus, co-founder and executive director of the Haitian Neighborhood Center Sant La, said the overwhelming emotions of Haitian TPS holders are a \"combination of anger, fear, disappointment and disenchantment.\"For more than a decade, Haitian TPS holders have been legally living and working in the U.S. following the devastating 2010 earthquake in Haiti. Many have established deep roots, opening businesses, purchasing homes and contributing to the economy in essential sectors. Perhaps most crucially, thousands of them have American-born children who could now face the prospect of losing their parents to deportation.\"People have had their world turned upside down. It's like having the rug pulled from under them,\" Metellus told Newsweek. \"I think the vast majority of TPS holders of Haitian descent, you know, have been living and working legally in the United States because that's what the TPS status offers.\"We'll also continue to increase the pressure on the administration to at least help them to understand, at least in the cases of Venezuela and Haiti, why this is not warranted, why it doesn't serve the security interests of the United States, why it doesn't serve the economic interests of the United States, and certainly does not reflect the humanitarian tradition of the American people, you know, the generosity of the American people.\"The Trump administration's move to revoke TPS for Haitian immigrants is part of a broader effort to roll back Biden-era immigration policies. During the 2024 campaign, Trump and Vice President JD Vance targeted TPS and a now-terminated humanitarian parole program, arguing that they were misused and potentially unlawful.The decision to end TPS for Haitian immigrants has sparked widespread criticism from immigrant rights groups, and lawmakers who argue that removing legal workers from the economy could create labor shortages and economic instability in many sectors.Florida Democratic Representative Sheila Cherfilus-McCormick, the daughter of Haitian immigrants, slammed the Trump administration's decision to revoke TPS for nearly a half-million Haitian workers. She warned that the abrupt removal of these workers would have \"an immense and irreparable impact on businesses across the country and our economy at large.\"She emphasized that Haitian TPS holders have been vital contributors to the U.S. economy, working legally and paying taxes while strengthening key industries such as health care, aviation, small businesses and education.\"Haitians with TPS status legally work and pay taxes in the U.S.,\" she said. \"Across the country, they have strengthened our workforce, supporting our airports, our hospitals, our small businesses and our schools.\"This decision will jeopardize our national security and significantly affect and damage the economies of numerous communities nationwide. I urge the administration to revisit and reverse this decision.\"A DHS spokesperson said in a statement: \"Biden and Mayorkas attempted to tie the hands of the Trump administration by extending Haiti's Temporary Protected Status by 18 months—far longer than justified or necessary.\"We are returning integrity to the TPS system, which has been abused and exploited by illegal aliens for decades. President Trump and Secretary Noem are returning TPS to its original status: temporary.\"Democratic Representative Ayanna Pressley of Massachusetts also condemned the decision, calling it \"shameful\" and a potential \"death sentence\" for thousands of Haitian nationals living in the U.S.\"With Haiti continuing to grapple with unspeakable violence and a horrific humanitarian, political and economic crisis, this is a shameful decision that could be a death sentence for more than 500,000 Haitian nationals living in the United States,\" Pressley said.\"Haitians who have lived in the United States for up to 15 years, raised children, started businesses and contributed to their communities are at risk of deportation for no reason other than being Haitian. We should be doing everything possible to save lives and bring stability and safety to Haiti—not throwing vulnerable people in harm's way. We urge the Trump Administration to immediately reverse this cruel and callous decision.\"Noem this month revoked Biden-era TPS extensions for 600,000 Venezuelans. Protections for a large percentage of that group will now expire in April.During the campaign, Vance spread a widely debunked claim that Haitian immigrants in Springfield, Ohio, were eating local residents' pets—the unsubstantiated claim was echoed by Trump during his September debate with Vice President Kamala Harris. While the influx of new arrivals had already caused some tension in the community, Trump's remarks fueled further unrest, leading to multiple bomb threats against schools, health care facilities and other buildings in Springfield.Haiti is currently grappling with extreme political instability and a surge in gang violence, leaving much of the country in crisis. Armed gangs now control about 80 percent of the capital, Port-au-Prince, engaging in kidnappings, extortion and deadly clashes with security forces.The 2021 assassination of President Jovenel Moïse further deepened the country's turmoil, creating a power vacuum that remains unresolved. Widespread poverty, food shortages and a collapsing health care system have exacerbated the humanitarian crisis, forcing more than a million people to flee their homes in search of safety.As Haitians are thrust into the national conversation surrounding U.S. immigration, uncertainty looms for thousands of people.\"There are conversations about what are the options that are out there because going back to Haiti is not an option,\" Petit said. \"So what are the other countries that could be welcoming to Haitians?\"","summary":"Tessa Petit, executive director of the Florida Immigration Coalition and a Haitian immigrant, warned the move will result in \"mass murder.\"","url":"https://www.newsweek.com/haitian-migrants-targeted-removal-fear-death-back-home-2034572","image":"https://d.newsweek.com/en/full/2593232/migrants.jpg","video":null,"publish_date":"2025-02-21 19:03:43","author":"Billal Rahman","authors":["Billal Rahman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.066},{"id":293021860,"title":"Trump tussles with Maine governor at White House event over transgender sports","text":"During a lengthy speech to a bipartisan group of governors, Trump began touting his ban on transgender athletes in women’s sports before asking if Gov. Janet Mills (D-ME) was in attendance. \n\n“Is Maine here? There governor of Maine?” Trump called out. “Are you not going to comply with it?”\n\nAfter confirming her presence, Mills said flatly that she would “comply with state and federal law.”\n\nThings escalated quickly from there. \n\n“You better do it because you’re not going to get any federal funding,” Trump shot back. “By the way, your population may be somewhat liberal — although I did very well there — your population doesn’t want men playing in women’s sports.”\n\n“We’re going to follow the law,” Mills repeated. “See you in court.”\n\nTrump, refusing to give Mills the final word, continued on.\n\n“I look forward to that, that should be a real easy one,” he said. “And enjoy your life after governor because I don’t think you’ll be an elected official afterward.”\n\nA handful of states have refused to follow Trump’s executive order, which his administration said bans men from playing women’s sports. Maine is one of them, with the Maine Principal’s Association saying transgender athletes can still compete.\n\nTrump’s order seeks to force compliance by withholding federal funds under Title IX, which bans sex discrimination. \n\nMills, 77, previously said she would not give into Trump’s “threat,” which is likely why Trump asked if she was in the room.\n\n“If the president attempts to unilaterally deprive Maine school children of the benefit of federal funding, my administration and the attorney general will take all appropriate and necessary legal action to restore that funding and the academic opportunity it provides,” Mills said. “The State of Maine will not be intimidated by the president’s threats.”\n\nTrump anoints former inmate Alice Johnson as new ‘pardon czar’\n\nNow, it appears that legal action may be more likely.\n\nTrump won 45% of the vote in Maine last fall, but he lost the state to former Vice President Kamala Harris. Mills is in her second term as Maine governor and cannot seek a third term under state law.","summary":"President Donald Trump got into a brief spat with the governor of Maine during a speech at the White House, with the Democrat promising to &#8220;see you in court.&#8221; During a lengthy speech to a bipartisan group of governors, Trump began touting his ban on transgender athletes in women&#8217;s sports before asking if Gov. Janet [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3326183/trump-tussles-maine-governor-janet-mills-transgender-sports/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/Donald-Trump-Maine-governor-Janet-Mills.webp","video":null,"publish_date":"2025-02-21 18:44:03","author":"Haisten Willis","authors":["Haisten Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.166},{"id":293020514,"title":"Trump Will Create 520,000 More Illegal Immigrants by Undoing Haitians' Protected Status","text":"During what was probably the low point of the 2024 presidential campaign, Vice President J.D. Vance falsely accused Haitian immigrants living in his home state of Ohio of kidnapping, killing, and eating pets. He then doubled down by challenging the legal status of those same immigrants.\n\n\"I'm still going to call them an illegal alien,\" Vance said defiantly in late September, despite the fact that many Haitian immigrants in the U.S. have legal status under a federal policy called Temporary Protected Status (TPS), which is granted to migrants who cannot return safely to their home countries due to natural disasters or conflicts. At the time, Vance argued that TPS for Haitians was illegitimate because \"Kamala Harris waves the wand illegally and says these people are now here legally.\"\n\nIn reality, the TPS program for Haitians had been in place since the Obama administration, when it was implemented in response to a devastating earthquake. President Joe Biden extended TPS status for Haitians—legally, despite what Vance claimed—last year.\n\nThe Trump administration is now partially reversing that extension and retconning reality to match Vance's politically motivated delusions. On Thursday, Homeland Security Secretary Kristi Noam announced that TPS for Haitian immigrants will expire in August, potentially leaving more than 520,000 of those immigrants eligible for deportation later this year.\n\nTessa Petit, a Haitian American who is executive director of the Florida Immigrant Coalition, termed the policy change \"utterly inhumane\" in comments to the Associated Press.\n\nIt is unclear whether the Trump administration has the legal authority to partially vacate the Biden administration's extension. Lawsuits have already been filed to challenge the Trump administration's attempts to end a similar protected immigration status for Venezuelan refugees, and more lawsuits challenging the revocation of TPS status for Haitian immigrants are likely.\n\nIt's worth noting the law governing TPS status allows the secretary of homeland security to terminate a TPS status, but only after determining that a certain country no longer meets the requirements for that designation. For now, the Trump administration has not published such a determination.\n\nFor the more than half-million Haitian immigrants who could see their legal status revoked later this year, there is \"almost no option to transition to another lawful status,\" David Bier, an immigration policy expert at the Cato Institute, tells Reason via email.\n\nThat doesn't mean they will be immediately subject to deportation, however. After their TPS status expires, the Trump administration will have to seek removal orders from immigration courts—though, as Bier notes, the administration seems to be seeking more powers to deport illegal immigrants without waiting for court orders.\n\nRegardless of how it plays out, the attempt to target Haitians seems like an escalation in the Trump administration's war on immigrants of all kinds—despite promises that it would be focused on illegal immigrants who had committed violent crimes.\n\nInstead, the imagined offenses attributed to a few fictional Haitians living in Ohio have somehow metastasized into an indiscriminate attack on the legal status of hundreds of thousands of people—the vast majority of whom have committed no crimes, not even civil immigration violations.","summary":"The move effectively retcons J.D. Vance's claim that legal Haitian immigrants were actually here illegally.","url":"https://reason.com/2025/02/21/trump-will-create-520000-more-illegal-immigrants-by-undoing-haitians-protected-status/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/02/upiphotosthree053656-scaled.jpg","video":null,"publish_date":"2025-02-21 18:40:09","author":"Eric Boehm","authors":["Eric Boehm"],"language":"en","category":"politics","source_country":"us","sentiment":-0.578},{"id":293012910,"title":"Angry crowd confronts Republican in deep-red Georgia with ‘boos and catcalls’ over support for Trump’s agenda","text":"U.S. Representative Rich McCormick was met with a hostile reception during a Thursday town hall in Georgia, with the Republican facing boos and angry questions over his support for the Trump administration and its Department of Government Efficiency (DOGE) initiative with Elon Musk to drastically cut federal spending.\n\nOne questioner asked McCormick what he was going to do to “rein in the megalomaniac in the White House,” prompting the attendees in Roswell to stand and applaud.\n\nAnother accused the congressman, who was elected in 2022, of “doing us a disservice” by supporting DOGE, which has targeted the Atlanta-based Centers for Disease Control and Prevention among other agencies for sweeping job cuts, with as many as 1 in 10 CDC staff on the chopping block. \n\nThe Republican legislator, who initially backed Ron DeSantis in the 2024 election then later endorsed Trump, pushed back against the criticisms.\n\n“When you talk about tyranny, when you talk about presidential power, I remember having the same discussion with Republicans when Biden was elected,” he told the crowd.\n\nMcCormick, a Marine Corps veteran and emergency room physician, drew examples from his background to try and defend the White House’s approach. \n\n“I happen to be a doctor, I know a few things,” McCormick said, arguing agencies “can do more with less, just like the Marine Corps and everyone else does when you have to do more with less to survive.”\n\n“Trying to do more with less, that’s reasonable,” a community member responded, adding, “what’s not reasonable is taking this chainsaw approach.”\n\nIt wasn’t all confrontational.\n\nMcCormick earned a smattering of applause when he said, “I respect the difference of opinion, and this will continue to be an honest discussion,” while the crowd reacted angrily when he compared them to the insurrectionists from the January 6 Capitol riot, who were “yelling just as loud as you,” and many groaned when the representative said much of the CDC’s work “is duplicitous with AI.”\n\nSuch a reception for McCormick and the wider Trump agenda isn’t exactly a surprise in Fulton County, which voted overwhelmingly for Kamala Harris in the 2024 election, but the outrage at the town hall could signal that some voters aren’t up for DOGE’s slash-and-burn spending cuts.\n\nA Reuters/Ipsos poll released Thursday found that 58 percent of respondents were worried social programs like student financial aid and Social Security payments could face delays, and a 53 percent majority do not support the DOGE effort.\n\nA separate poll, released this week from YouGov, found 39 percent of respondents had a favorable view of DOGE, compared with 36 percent who saw it unfavorably, while 52 percent said they are worried DOGE leader Musk is using his influence to benefit his companies and personal interests.","summary":"Crowd accused GOP rep of ‘doing us a disservice’","url":"https://www.independent.co.uk/news/world/americas/us-politics/rich-mccormick-trump-doge-musk-b2702511.html","image":"https://static.independent.co.uk/2025/02/21/17/36/GettyImages-2158759186.jpg?width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/AORXWUWQ-4VHSaSK0.mp4","publish_date":"2025-02-21 18:36:06","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":0.14},{"id":293011952,"title":"Renowned Author Stephen King Makes Unexpected Turn Three Months after Expressive Statement","text":"Stephen King made an abrupt return to X Thursday after leaving the platform in protest of Elon Musk.\n\n‘I’m baaaack! Did you miss me?’ joked the author in his return post, before immediately honing in on the Tesla boss.\n\nThe follow-up also saw the writer slam Donald Trump, who is in the midst of diplomacy talks with Russian dictator Vladimir Putin surrounding the latter’s ongoing invasion of Ukraine.\n\n‘Just wanted to say that Trump is a traitorous, Putin-loving dips**t! Goes double for Elon!’ King, 77, sniped, before being met with a reply from Musk who apparently clocked his tweet.\n\n‘I did tbh,’ the tech billionaire wrote, in response to King’s initial post.\n\nMeanwhile, a pinned tweet seen atop The Shining author’s account reminded onlookers of a vow he made a mere three months ago – seemingly in contradiction to the return of the King.\n\n‘I’m leaving Twitter. Tried to stay, but the atmosphere has just become too toxic,’ he wrote a few days after the election. ‘Follow me on Threads, if you like.’\n\nFollowing his return, King quickly flocked back to Mark Zuckerberg’s Threads where fellow X haters like Joy Reid, who swore off Musk’s social media platform the same day, have congregated.\n\nBlueSky, started by original Twitter boss Jack Dorsey, has surfaced as another haven – one that X user repeatedly brought up in a stream of merciless replies to King’s posts.\n\n‘BlueSky not doing it for you huh?’ wrote one tweeter, in a post viewed 87,000 times.\n\n‘What made you return? Maybe because Bluesky sucks?’ sniped another.\n\nSomeone else scathingly wrote: ‘Legitimately didn’t even know you were gone.’\n\nA fourth person offered a screenshot framed as ‘A Short Story Called Hypocrisy’; a grab of King’s recent tweets sat below the seemingly contradictory one pinned above.\n\n‘Be Stephen… Constantly makes negative posts… Gets trolled because of it… Then complains about negativity,’ said someone else.\n\n‘Leaves… Comes back… asks if people missed him… makes more negative posts.’\n\nAs others speculated as to the reason for his return, one user declared: ‘Stephen King is back on X because he knows this is the best social platform on the planet.’ King, however, did not offer an explanation.\n\nInstead, within hours of penning both posts, he was back on Threads – this time to offer a diagnosis on the website he had just visited.\n\n‘After a brief check-in with Twitter, I can confirm it’s worse than ever,’ he wrote.\n\n‘[N]o longer a social gathering place but a propaganda organ, George Orwell’s Ministry of Truth,’ he added, drawing a comparison between the novel 1984’s Big Brother and the DOGE boss.\n\nTwo days before, he replied to a post from CNN Senior Political Commentator Adam Kinzinger – one that questioned Musk’s motives with his new place in the federal government. \n\n‘Is Elon a govt employee?’ Kinzinger asked after Musk’s multiple appearances alongside Trump in the Oval Office this and last week.\n\n‘If he is, he needs to be held responsible for the intense and number lies he is putting out with constant “if true then…”\n\n‘If he isn’t then he needs to get the hell away from my govt.’\n\nKing, who swore of Twitter on November 14, replied: ‘Amen.’\n\nThe same day he left, Reid did the same – just weeks before throwing a fit over Zuckerberg’s U-turn on Meta’s fact-checking programs following Trump’s win over Kamala Harris.\n\n‘Hey guys, today I did something I’ve been meaning to do for a while,’ Reid said.\n\n‘And the reason for doing it, and kissing goodbye my 1.9 million followers over there,’ she explained. ‘I hadn’t been posting for a long time – I just didn’t want to contribute content once it was purchased by its present owner.’\n\n‘But, just having it there – I was only holding onto it because, I, you know, really didn’t want someone trying to take over that name and use it for nefarious purposes,’ she continued, at this point letting out a laugh. \n\n‘I was a little bit worried about that.’\n\n‘And also, every so often, I was just using it to look at news that was trending, what’s happening, and I just sort of used it as an aggregator,’ she added, more serious.\n\n‘But I just realized it’s not really worth it. \n\n‘Because in order to do the news aggregation and just look at all, you have to wade through a lot of dreck and a lot of, just, abuse, and a lot of just, negativity.\n\n‘And it’s just not worth it.’ \n\nThe same day, Lizzo took took to Instagram to reveal she was headed to Dorsey’s site, declaring, ‘I hate the internet… I joined bluesky cus[sic] we’re leaving toxicity in 2024.’ \n\nSimilar sentiments were aired by ousted CNN star Lemon the same day as well, in what amounted to a mass exodus and boycott of the site. \n\n‘I have loved connecting with all of you on Twitter and then on X for all of these years, but it’s time for me to leave the platform,’ the former CNN anchor, 58, in – ironically – an X video.\n\n‘I once believe that it was a place for honest debate and discussion, transparency, and free speech, but I now feel that it does not serve that purpose.’ \n\nSince the election, all four stars have relentlessly complained about the result, using all of their remaining socials – and in Reid’s case, MSNBC – as a platform.\n\nKing – who repeatedly clashed with Musk following his $44 billion acquisition of the company – is the first to return.","summary":"Internewscast Journal\n\nInternewscast\n\n\nStephen King made an abrupt return to X Thursday after leaving the&#8230;\n\n\nThis Post: Renowned Author Stephen King Makes Unexpected Turn Three Months after Expressive Statement first appeared on Internewscast Journal","url":"https://internewscast.com/celeb/celeb-news/renowned-author-stephen-king-makes-unexpected-turn-three-months-after-expressive-statement/","image":"https://i.dailymail.co.uk/1s/2025/02/21/16/95451985-14421801-Stephen_King_made_an_abrupt_return_to_X_Thursday_after_leaving_i-m-67_1740157078604.jpg","video":null,"publish_date":"2025-02-21 18:15:48","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.352},{"id":293011876,"title":"House GOP elections chair makes explosive prediction despite Dems' heavier cashflow","text":"EXCLUSIVE: The chairman of House Republicans' campaign arm is dismissing potential \"headwinds\" against the GOP in its fight to keep control of the chamber for President Donald Trump's entire second term. National Republican Congressional Committee (NRCC) Chair Richard Hudson, R-N.C., expressed confidence Republicans would keep the House in 2026 after the group's Democratic counterpart out-raised the NRCC in the first month of 2025. \"Despite the national narrative and headwinds, House Republicans once again delivered and earned the votes of the American people,\" Hudson told Fox News Digital of the prior election cycle. He pledged Republicans would \"raise the funds necessary to retain and grow this majority.\" SCOOP: KEY CONSERVATIVE CAUCUS DRAWS RED LINE ON HOUSE BUDGET PLAN \"Last cycle, the NRCC used every dollar to maximize turnout, support our candidates, and secure 74.5 million votes cast for a Republican for Congress,\" Hudson said. \"I'm confident in our plan to win again in 2026.\" The Democratic Congressional Campaign Committee (DCCC) announced earlier this week that it raised over $9 million in the month of January, its best ever total for that month in a non-election year. \"Only one month into the Republican trifecta and it’s clear House Republicans have no plans to lower costs or address issues that matter to everyday Americans, instead choosing to cater to their billionaire benefactors,\" DCCC Chair Suzan DelBene, D-Wash., said in a press release. \"House Democrats will hold House Republicans accountable for their failure to deliver on their campaign promise.\" The NRCC raised just under $6 million in the same period, according to financial data viewed by Fox News Digital. NONCITIZEN VOTER CRACKDOWN LED BY HOUSE GOP AHEAD OF 2026 MIDTERMS It is not uncommon for the minority party in the House or Senate to outraise the party in power, particularly in the months immediately after an election. The national Democratic Party also notably outraised the GOP in the election period from Jan. 2023 through Sept. 2024, according to federal election data. The DCCC outraised the NRCC by roughly $78 million in that period. Despite that, Republicans kept the House and flipped control of the White House and Senate. Political history dictates that the trifecta will not hold for long – the first midterm after the White House changes hands traditionally sees a political backlash against the president's party, particularly if they held Congress for their first two years. However, Hudson told Fox News Digital that he sees Republicans breaking that trend in an interview during the annual House GOP retreat in Miami late last month. Trump is in his second term, and Hudson argued that the 2024 presidential race was a referendum between two clear White House records. CLICK HERE TO GET THE FOX NEWS APP \"He has a mandate that I think is unique in history. And so this isn't a first-term president going into his first midterm. I mean, this is someone the American people know, and they've chosen,\" Hudson said. He also pointed out that Democrats will be defending 13 lawmakers whose districts Trump won, while Republicans only had to hold onto three seats that voted for former Vice President Kamala Harris in 2024. \"The battlefield out there for us going into 2026 favors Republicans,\" Hudson said. An internal GOP memo shared with Fox News Digital shows the NRCC nearly doubled its grassroots fundraising from $1.7 million in January 2023 to $3.2 million in January 2025. \"Comparing January 2025 to previous cycles, the NRCC is in the top half for fundraising and the bottom half for spending,\" the memo said.","summary":"House Democrats outraised House Republicans in the first month of 2025, but NRCC Chairman Richard Hudson believes the GOP is still on track to win.","url":"https://www.foxnews.com/politics/house-gop-elections-chair-makes-explosive-prediction-despite-dems-heavier-cashflow","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/trump-congress.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-21 18:12:00","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"US","sentiment":-0.396},{"id":293016114,"title":"George Clooney Explains Why He Thinks Trump Won the Election","text":"George Clooney‘s op-ed urging Joe Biden to drop out of the 2024 presidential election was considered a major turning point in the beleaguered former president’s campaign.\n\n Now the veteran actor is explaining why he thought Donald Trump won instead of Biden’s top-of-the-ballot replacement, Vice President Kamala Harris.\n\n His explanation reflects a common refrain among Democratic supporters since November: It wasn’t the policies that were unpopular, it was the messaging that was ineffective. \n\n “The Biden administration was terrible at explaining that we’re a world economy, where we were actually doing better than all the other G7 countries,” Clooney told The New York Times in a profile published online late Thursday. “They were bad at telling the story because their messenger was not working at his best, to say the least.”\n\n Gallup polling months before the election however, showed that issues like immigration, crime, homelessness and inflation were the top four concerns among voters, and Trump’s rival Kamala Harris had modest polling numbers before Biden dropped out. Also, the most effective ad spot during the campaign was said to be a Trump ad that weaponized the debate over trans rights. \n\n Clooney also weighed in on CBS considering settling Trump’s lawsuit against 60 Minutes, noting such a move would have “a chilling effect on the press” and agreed with CNN anchor Jake Tapper’s comment that a settlement “would be the network of Edward R. Murrow at the behest of its owners saying ’We will not speak truth to power. We will acquiesce to power at the expense of truth.'”\n\n Expanding a bit on his decision to write the Times op-ed calling for Biden to drop out, Clooney explained, “I saw him for hours a year earlier at the Kennedy Center, and I saw someone much less sharp.” With Clooney adding, “I’ve always liked Joe Biden, and I like him still.”\n\n Clooney spoke to the publication ahead of his Broadway debut in March — a stage adaptation of his 2005 movie, Good Night, and Good Luck, with Clooney playing CBS newsman Murrow.","summary":"Clooney breaks down why he thinks Kamala Harris lost in 2024 and talks other political issues.","url":"https://www.hollywoodreporter.com/news/politics-news/george-clooney-why-trump-won-1236142927/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2023/10/George-Clooney-Lotterie-Charity-Gala-Carpet-GettyImages-1492951525-H-2023.jpg","video":null,"publish_date":"2025-02-21 18:10:31","author":"James Hibberd","authors":["James Hibberd"],"language":"en","category":"politics","source_country":"US","sentiment":-0.303},{"id":292999570,"title":"VA gubernatorial candidate mocks Carville for saying she’ll lose, reminds him of failed 2024 prediction","text":"Republican Virginia Lt. Gov. Winsome Earle-Sears hit back at Democratic Party strategist James Carville after he declared she will lose her upcoming gubernatorial race in the state. The state leader ridiculed Carville’s prediction on \"Fox & Friends\" Friday, reminding the hosts of his failed predictions around the 2024 presidential race. \"James, my man, do you have some lottery numbers for me? Because you seem so certain,\" Earle-Sears quipped. \"Except, you weren’t certain before with Biden and look where that got you.\" On October 24, 2024, Carville wrote an op-ed for The New York Times entitled, \"James Carville: Three Reasons I’m Certain Kamala Harris Will Win.\" WINSOME EARLE-SEARS ANNOUNCES VA GOV BID TO BUILD ON YOUNGKIN RECORD: IT'S ‘ALL ABOUT BUSINESS’ The Democratic strategist made his predictions during the Thursday night episode of \"Hannity\", telling Fox News Channel host Sean Hannity, \"The Democrats are almost certain to win the Virginia governor’s race – no, not almost – they are certain to win it.\" Recent polling out of Virginia showed that Sears is trailing Rep. Abigail Spanberger, D-Va., in the contest that will be decided in November. A Mason-Dixon Poll from late January revealed a tight race, with Earle-Sears trailing the congresswoman 44% to 47%. A poll from Virginia Commonwealth University (VCU) in January showed a less close race, with Earle-Sears trailing Spanberger by 10 points. GOV. GLENN YOUNGKIN TOUTS SUPREME COURT RULING: ‘VICTORY FOR COMMON SENSE’ Still, Earle-Sears cited polling showing her and Spanberger \"neck and neck,\" telling Fox News Channel host Lawrence Jones III that her opponent is \"worried\" about voters choosing Earle-Sears to \"continue\" the \"successes\" of the Youngkin administration. \"We’re going to have more job creation, parents are still going to matter in their education, women will be women and men will be men, and our children will be safe – more money in your wallet,\" she declared. Earle-Sears – who was elected Lt. governor alongside Gov. Glenn Youngkin, R-Va., in 2021 – found it fair to question Carville’s predictive abilities, as he had been forced to eat crow over the party’s defeat in the presidential election. Though she called out Carville’s prediction surrounding Biden’s re-election campaign, his actual blunder was insisting that then-Vice President Kamala Harris was going to beat Trump in the presidential election after she replaced Biden. \"She’s got more money, got more energy, has a more united party, has better surrogates and he’s stone a-- nuts,\" he told MSNBC’s \"Morning Joe\" on the day before Trump beat Harris. HOW TRANSGENDERISM IN SPORTS SHIFTED THE 2024 ELECTION AND IGNITED A NATIONAL COUNTERCULTURE Carville had even written an op-ed in \"The New York Times\" days prior to the election, in which he provided three reasons why he was \"certain\" that Harris would win. After Harris’ stunning electoral defeat, Carville wrote another piece for The Times admitting he was wrong. \"I thought Kamala Harris would win. I was wrong. While I’m sure we Democrats can argue that the loss wasn’t a landslide or take a little solace in our House performance, the most important thing for us now is to face that we were wrong and take action on the prevailing ‘why.’\" \"We lost for one very simple reason: It was, it is and it always will be the economy, stupid,\" the strategist declared. Elsewhere during the \"Hannity\" interview, Carville added that the Democratic Party will retake the House of Representatives in the 2026 midterm elections and predicted that President Trump’s support will continue to implode. Trump disputed Carville directly on Friday with a Truth Social post. It read, \"I won the Presidential Election in a landslide, won ALL SEVEN SWING STATES, THE POPULAR VOTE, AND ALL FIFTY STATES SHIFTED REPUBLICAN, a record, and now I have the best polling numbers I’ve ever had. The Democrats, run by broken down losers like James Carville, whose weak of mind and body, are going crazy, and just don’t know what to do. They have lost their confidence and spirit - They have lost their minds!\" Trump added, \"We are going to have big WINS for our Country, and MAKE AMERICA GREAT AGAIN. It’s already happening, and will get bigger and better than ever before!\" CLICK HERE TO GET THE FOX NEWS APP","summary":"After pundit James Carville predicted she will lose the Virginia governor&apos;s race, Lt. Gov. Winsome Earle-Sears, R-Va., reminded him how wrong his 2024 presidential prediction was.","url":"https://www.foxnews.com/media/va-gubernatorial-candidate-mocks-carville-saying-shell-lose-reminds-him-failed-2024-prediction","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/earle-sears-carville.png?ve=1&tl=1","video":null,"publish_date":"2025-02-21 17:50:03","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":-0.279},{"id":293043154,"title":"Kamala Harris’ Rise to Power—The Untold Struggles Behind Her Historic Career","text":"Former President Kamala Harris needs no introduction! Known for her fierce fighter personality, she is mostly regarded as enterprising, headstrong, and decisive, with a sharp intellect and a strong sense of justice. She believes in breaking traditions and taking a stand for things that matter. Owing to her successful career trajectory, she has built a reputation for being tough yet charismatic and balancing warmth with authority. What makes her story more empowering is the fact that, as a mixed-race immigrant, she has cemented her name in the complex world of American politics. \n\nHer journey from childhood to the halls of power has been extraordinary. Although she did not win the elections this time and lost to Republican opponent Donald Trump, speculation suggests that she might run for government in 2026 for her home state, California. Nonetheless, her life’s story still has plenty of pages yet to be filled. Are you curious to know more? Grab a snack and read ahead to find out some amazing facts about her. \n\nKamala Harris was raised by her single mother after her parents split \n\nView this post on Instagram\n\nA post shared by Kamala Harris (@kamalaharris) \n\nAs per the outlet, Nicki Swift and her parents—Shyamala Gopalan, a cancer researcher who’d immigrated from India, and Donald Harris, a native of Jamaica who was studying economics. The duo met in America while studying in college, and Kamala Harris was born in 1964, followed two and a half years later by her younger sister Maya. Her parents divorced when she was just 7. She was raised by her mother, whom she credited for her robust upbringing. Although she admitted that her father was present while she and her sister grew up, it was her mother who was primarily involved in her childhood. \n\nKamala Harris had a mixed religious background of Baptist and Hindu religions\n\nView this post on Instagram\n\nOwing to being of a mixed race during a time when America was not very culturally open-minded, Kamala’s mother knew they would be perceived as outsiders. It was important to educate them about the Indian half of their heritage. That included trips to India. Furthermore, her mother also made sure Harris and her sister attended Baptist church services and worshipped at a Hindu temple. Her mother also noted that she introduced Kamala to Hinduism as she believed that the religion glorified strong women. \n\nKamala Harris was an activist as a child \n\nView this post on Instagram\n\nNow we know where Kamala’s strong nature came from, owing to her childhood roots that were deep into civil rights and activism; she grew up and quickly developed a reputation as an activist. Harris’ longtime friend, Areva Martin, told The Guardian. As the Los Angeles Times recalled, during one civil rights march, the pint-sized protester’s mother asked her what she wanted: “FEE-DOM!” declared the little girl. Perhaps this was where her ambition to pursue politics came from.\n\nKamala Harris was elected as California’s first female attorney\n\nView this post on Instagram\n\nKamala Harris’ proved that she was a star when she became a prosecutor to the San Francisco District Attorney and continued to drive her forward as she pursued the role of California’s Attorney General. The 2010 election became an intense battle between Harris and Los Angeles DA Steve Cooley.\n\nOn election night, with 99% of precincts reporting, Cooley prematurely declared victory despite Harris leading by more than 20,000 votes. Yet, when the results of the votes came through, Kamala Harris officially won by a margin of 74,000 votes out of 9.6 million cast. This heartfelt victory made her California’s first female attorney general and the first woman of color to hold the position. However, the win was a narrow one, with Kamala Harris securing victory by less than a single percentage point.","summary":"Former Vice President Kamala Harris has built a reputation for being tough yet charismatic and balancing warmth with authority. Take a look at four extraordinary facts that make her a high-value woman who cemented her name in American politics.","url":"https://www.inquisitr.com/kamala-harris-ris-to-power-the-untold-struggles-behind-her-historic-career","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/Kamala-Harris-.jpg","video":null,"publish_date":"2025-02-21 17:44:44","author":"Sweta Choudhury","authors":["Sweta Choudhury"],"language":"en","category":"sports","source_country":"us","sentiment":0.18},{"id":292997138,"title":"Bestselling author Stephen King performs hilarious U-turn three months after spectacular woke flounce","text":"Stephen King made an abrupt return to X Thursday after leaving the platform in protest of Elon Musk.\n\n‘I’m baaaack! Did you miss me?’ joked the author in his return post, before immediately honing in on the Tesla boss.\n\nThe follow-up also saw the writer slam Donald Trump, who is in the midst of diplomacy talks with Russian dictator Vladimir Putin surrounding the latter's ongoing invasion of Ukraine.\n\n'Just wanted to say that Trump is a traitorous, Putin-loving dips**t! Goes double for Elon!' King, 77, sniped, before being met with a reply from Musk who apparently clocked his tweet.\n\n'I did tbh,' the tech billionaire wrote, in response to King's initial post.\n\nMeanwhile, a pinned tweet seen atop The Shining author's account reminded onlookers of a vow he made a mere three months ago - seemingly in contradiction to the return of the King.\n\n'I'm leaving Twitter. Tried to stay, but the atmosphere has just become too toxic,' he wrote a few days after the election. 'Follow me on Threads, if you like.'\n\nFollowing his return, King quickly flocked back to Mark Zuckerberg's Threads where fellow X haters like Joy Reid, who swore off Musk's social media platform the same day, have congregated.\n\nBlueSky, started by original Twitter boss Jack Dorsey, has surfaced as another haven - one that X user repeatedly brought up in a stream of merciless replies to King's posts.\n\n'BlueSky not doing it for you huh?' wrote one tweeter, in a post viewed 87,000 times.\n\n'What made you return? Maybe because Bluesky sucks?' sniped another.\n\nSomeone else scathingly wrote: 'Legitimately didn’t even know you were gone.'\n\nA fourth person offered a screenshot framed as 'A Short Story Called Hypocrisy'; a grab of King's recent tweets sat below the seemingly contradictory one pinned above.\n\n'Be Stephen... Constantly makes negative posts... Gets trolled because of it... Then complains about negativity,' said someone else.\n\n'Leaves... Comes back... asks if people missed him... makes more negative posts.'\n\nAs others speculated as to the reason for his return, one user declared: 'Stephen King is back on X because he knows this is the best social platform on the planet.' King, however, did not offer an explanation.\n\nInstead, within hours of penning both posts, he was back on Threads - this time to offer a diagnosis on the website he had just visited.\n\n'After a brief check-in with Twitter, I can confirm it’s worse than ever,' he wrote.\n\n'[N]o longer a social gathering place but a propaganda organ, George Orwell’s Ministry of Truth,' he added, drawing a comparison between the novel 1984's Big Brother and the DOGE boss.\n\nTwo days before, he replied to a post from CNN Senior Political Commentator Adam Kinzinger - one that questioned Musk's motives with his new place in the federal government. \n\n'Is Elon a govt employee?' Kinzinger asked after Musk's multiple appearances alongside Trump in the Oval Office this and last week.\n\n'If he is, he needs to be held responsible for the intense and number lies he is putting out with constant “if true then…”\n\n'If he isn’t then he needs to get the hell away from my govt.'\n\nKing, who swore of Twitter on November 14, replied: 'Amen.'\n\nThe same day he left, Reid did the same - just weeks before throwing a fit over Zuckerberg's U-turn on Meta's fact-checking programs following Trump's win over Kamala Harris.\n\n'Hey guys, today I did something I've been meaning to do for a while,' Reid said.\n\n'And the reason for doing it, and kissing goodbye my 1.9 million followers over there,' she explained. 'I hadn't been posting for a long time - I just didn't want to contribute content once it was purchased by its present owner.'\n\n'But, just having it there - I was only holding onto it because, I, you know, really didn't want someone trying to take over that name and use it for nefarious purposes,' she continued, at this point letting out a laugh. \n\n'I was a little bit worried about that.'\n\n'And also, every so often, I was just using it to look at news that was trending, what's happening, and I just sort of used it as an aggregator,' she added, more serious.\n\n'But I just realized it's not really worth it. \n\n'Because in order to do the news aggregation and just look at all, you have to wade through a lot of dreck and a lot of, just, abuse, and a lot of just, negativity.\n\n'And it's just not worth it.' \n\nThe same day, Lizzo took took to Instagram to reveal she was headed to Dorsey's site, declaring, 'I hate the internet... I joined bluesky cus[sic] we’re leaving toxicity in 2024.' \n\nSimilar sentiments were aired by ousted CNN star Lemon the same day as well, in what amounted to a mass exodus and boycott of the site. \n\n'I have loved connecting with all of you on Twitter and then on X for all of these years, but it's time for me to leave the platform,' the former CNN anchor, 58, in - ironically - an X video.\n\n'I once believe that it was a place for honest debate and discussion, transparency, and free speech, but I now feel that it does not serve that purpose.' \n\nSince the election, all four stars have relentlessly complained about the result, using all of their remaining socials - and in Reid's case, MSNBC - as a platform.\n\nKing - who repeatedly clashed with Musk following his $44 billion acquisition of the company - is the first to return.","summary":"'I'm baaaack! Did you miss me?' joked the author in his return post to X, before immediately honing in on Elon Musk.","url":"https://www.dailymail.co.uk/news/article-14421801/stephen-king-twitter-donald-trump-elon-musk.html","image":"https://i.dailymail.co.uk/1s/2025/02/21/16/95451985-0-image-a-66_1740157067852.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/14/5937989529437974644/1024x576_MP4_5937989529437974644.mp4","publish_date":"2025-02-21 17:39:08","author":"Alex Hammer,Editor","authors":["Alex Hammer","Editor"],"language":"en","source_country":"gb","sentiment":-0.28},{"id":292996128,"title":"Senate GOP Blocks Dem Effort to Make Immigration Enforcement Package About Anything Other Than Border Security","text":"DAILY CALLER NEWS FOUNDATION—Senate Republicans blocked nearly 30 amendments from Democrats intended to derail the upper chamber’s budget blueprint to fund President Donald Trump’s border security agenda during an overnight session that concluded early Friday morning.\n\nThe Senate took the first step in unlocking more than $340 billion in spending to fund the president’s border security and deportation efforts, which will allow the administration’s illegal immigration crackdown to be executed at full force. Though Senate Democrats attempted to put their Republican colleagues on the spot by holding votes on dozens of amendments intended to exact political pain, Democrats had little to say about the actual purpose of the budget resolution: funding the president’s border security agenda.\n\nThe Senate ultimately approved the border security-focused budget resolution in vote of 52 to 48 shortly before 5 a.m. after nearly a ten-hour slog. Republican Kentucky Sen. Rand Paul opposed the resolution, citing concerns that the forthcoming budget bill would fail to completely offset the spending increases unlocked with passage of the budget resolution.\n\nNo Senate Democrat voted to advance the budget resolution that would unlock money to fund the president’s illegal immigration crackdown efforts. Senate Republicans’ budget proposal provides instructions to fund $175 billion in immigration enforcement money in addition to an increase in defense spending and policy changes to spur energy production in a forthcoming budget bill.\n\n“If you listen to Senate Democrats, it’s abundantly clear that they do not support these goals,” Senate Majority Whip John Barrasso said on the Senate floor Thursday. “Democrats are opposed to securing our border, rebuilding our military, and unleashing American energy.”\n\nThe budget resolution stage of the reconciliation process allows any senator to propose an unlimited number of budget-related amendments that are voted on in a marathon process known as a “vote-a-rama.” The unique rules of the reconciliation process allowed Senate Democrats to delay passage of the budget resolution until they lost steam voting on amendments. Every Democrat-sponsored amendment failed to be adopted.\n\nSenate Democrats’ opposition to funding border security and defense spending comes as their approval rating plummets to an all-time-low. Just two in ten Americans approve of congressional Democrats’ job performance, according to Quinnipiac polling released Wednesday.\n\nDemocrats debated the border security package by harping on taxes, appearing to view attacking Senate Republicans for allegedly giving tax cuts to billionaires as a political lifeline to a party widely viewed as struggling to craft a strategy back to electoral success.\n\n“Nothing criticizes the broken core of Republicans’ agenda better than their tax cuts for the ultra-wealthy,” Senate Democratic leader Chuck Schumer said on the Senate floor prior to introducing an amendment to stop a budget bill from providing a tax cut to individuals earning more than $1 billion per year.\n\nRepublicans countered that the budget bill was not a tax-focused bill, but a border security-focused bill. Senate Republicans plan to take up the president’s tax priorities in a separate budget package later in the year.\n\nDemocrats also alleged that Senate Republicans were seeking to cut popular entitlement programs despite the budget resolution not providing instructions to do so, and widespread opposition in the Republican conference to achieve significant spending reform by cutting into entitlements.\n\nTrump has also repeatedly said he would not support a budget package that cuts Medicare or Medicaid— barring instances of waste, fraud and abuse.\n\n“The Democrats know very well that this targeted budget blueprint does not cut Medicaid or Medicare,” Senate Finance Committee Mike Crapo of Idaho said on the Senate floor Thursday evening. \n\n“The claims we’ve heard continuously tonight, to me, seem just to be the politics of fear in the face of trying to deal with our nation’s critical issues,” Crapo said later in the evening.\n\nRepublican Sens. Susan Collins of Maine and Josh Hawley of Missouri occasionally voted for Democrat-backed amendments seeking to forestall hypothetical cuts to entitlement programs in a forthcoming budget bill.\n\nCollins, the most moderate member of the Senate Republican conference, could face a competitive reelection in a state former Vice President Kamala Harris won. Hawley appeared to be concerned about how hypothetical cuts to entitlement programs could impact working class Americans throughout the night.\n\nDespite staying up until the early morning hours to advance a budget resolution, the Senate’s version may face immediate roadblocks if the House refuses to consider the upper chamber’s slimmed-down budget approach.\n\nSpeaker Mike Johnson has said the Senate’s budget proposal is dead on arrival in his chamber. House Republicans could pass a competing budget resolution as early as next week incorporating all of the president’s tax and spending priorities into “one, big beautiful bill.”\n\nThough Trump threw his weight behind the House version, the president appeared to give Senate Republicans the green light to continue advancing their own budget plans Thursday prior to the vote-a-rama.\n\n“Thank you to Majority Leader John Thune, and the Republican Senate, for working so hard on funding the Trump Border Agenda,” Trump wrote on Truth Social. “Your work on funding this effort is greatly appreciated!”\n\nHawley told reporters Trump still wants one comprehensive bill Thursday.\n\nAs Trump moves to stem the influx of illegal migrants into the United States—lowering border encounter numbers to levels not seen since the 1960s—key administration officials are begging Congress to provide additional funding to go full throttle on the president’s immigration crackdown.\n\nSenate Republican leadership is adamant that their budget plan is the right vehicle to do just that.\n\n“After four years of high prices and open borders, Americans deserve a path to safety and prosperity,” Barrasso said Thursday. “Starting with the Republican budget, they will finally get it.”\n\nOriginally published by the Daily Callers News Foundation","summary":"DAILY CALLER NEWS FOUNDATION—Senate Republicans blocked nearly 30 amendments from Democrats intended to derail the upper chamber’s budget blueprint to fund President Donald Trump’s border... Read More\n\n\nThe post Senate GOP Blocks Dem Effort to Make Immigration Enforcement Package About Anything Other Than Border Security appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/21/senate-gop-blocks-dem-effort-make-immigration-enforcement-package-about-anything-other-than-border-security/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/GettyImages-2199896401.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-02-21 16:33:58","author":"Adam Pack","authors":["Adam Pack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.329},{"id":292978248,"title":"Trump's art of war, Kamala goes Hollywood, and more from Fox News Opinion","text":"Welcome to the Fox News Opinion Newsletter. HANNITY – Fox News host discusses President Donald Trump's first whirlwind month in the White House. Continue watching… HUGH HEWITT – The last temptation of a grant maker. Continue reading… GIT-R-DONE – I helped Trump get his first tax cut bill through Congress. Failure is not an option this time. Continue reading… DIE DEI – Lawfare and the death of DEI and affirmative action. Continue reading… SEC. SEAN DUFFY – America’s air traffic systems need an urgent upgrade. Continue reading… RAYMOND ARROYO – Fox News contributor reacts to former Vice President Kamala Harris going 'Hollywood'. Continue watching… GOV. BRIAN KEMP – Republican governors ready to work alongside President Trump and bring back commonsense leadership. Continue reading… ONE MONTH IN – One month of Trump reminds Americans what we’ve been missing. Continue reading… TRUMP'S ART OF WAR – Win without fighting. Continue reading… CARTOON OF THE DAY – Check out all of our political cartoons…","summary":"Read the latest from Fox News Opinion &amp; watch videos from Sean Hannity, Raymond Arroyo &amp; more.","url":"https://www.foxnews.com/opinion/trumps-art-war-kamala-goes-hollywood-more-from-fox-news-opinion","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/6ef011e2-19c7-49cd-843c-e56b1cc106ce/cc30423a-e8de-4284-9cdd-cdec5df6099c/1280x720/match/896/500/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-21 16:18:52","author":null,"language":"en","source_country":"US","sentiment":0.181},{"id":292984936,"title":"Barron Trump's path to politics? US President's son hailed as 'future of conservative movement' for key reason","text":"Barron Trump, the youngest son US President Donald Trump and Melania Trump remains elusive at New York university, but he's already managed to cause drama among collegiate Republicans. In a Vanity Fair report published last year, Kaya Walker, the president of the NYU College Republicans, remarked that Barron is “sort of like an oddity on campus.” “He goes to class, he goes home,” she added. She also brought up a joke from one of her professors that “he doesn’t really belong here.” The president of the NYU chapter of the College Republicans of America was forced to resign over comments she made about the president’s son who is a freshman at the university. And now days after this incident, Barron Trump has accomplished a unique feat.ALSO READ: 'Scared to death': Fired FAA employee working on secret defense project has a warning for AmericansIs Barron future of the conservative movement?Without even uttering a single word in public or having any social media accounts, the 18-year-old son of Trump was anointed as the future of the conservative movement by the president of the College Republicans of America, reports The USA Today. Barron Trump has been labelled as the future of the conservative movement in the United States by the president of the College Republicans of America, amid reports that US voters are gearing up to potentially elect Barron Trump, in two decades' time. Kaye Walker's remarks were disapproved by the leadership of the College Republicans, a national organization, who refuted the description of Barron, saying it “does not align with the values and principles upheld by our organization.”In a letter posted to X, the College Republicans of America not only slammed the comments but also praised Barron as the future of the conservative movement. The letter, signed by President Donahue, said: “Barron Trump represents the future of the conservative movement, and we would be honored to have him join the College Republicans of America. ALSO READ: Trump removes iconic 145-year old resolute desk days after Elon Musk, son visited Oval Office. Here's whySpeaking to USA Today, Donahue, who also said his group had broken a 100-year-old precedent by endorsing Trump before the Republican primaries, expanded on why he felt Barron would play a prominent future role in US politics.“We believe that MAGA is the future of the conservative movement, and that the youth will spearhead the institutionalization of Trump's policies in our politics, Donahue said. Donahue also said that the MAGA policies chimed with what young people in the United States want, despite voters between the ages of 18 and 24 supporting Kamala Harris over Trump by 10 points, with the same cohort supporting Joe Biden by 29 points in the 2020 election.“Young people want fair trade, reasonable immigration policy, and no new wars, and that is what MAGA offers,” Donahue said. However, despite the praise lavished on Barron, he still hasn't joined the College Republicans. “We have not yet heard from Barron,” Donahue admitted.ALSO READ: Will US citizens get a refund of $5000 from Elon Musk? Know about 'DOGE dividend' planWho is Barron Trump?Barron, 18, has sparked buzz around the college’s Washington Square Park campus ever since he enrolled in the Stern School of Business this past fall. Barron's sudden thrust into the public eye was almost as quick as his retreat from fame in 2016 after his dad became president. Donald Trump welcomed Barron with his third wife, Melania Trump, while he was in the midst of running his real estate empire. According to Barron's fellow NYU classmates, however, he prefers to stay in his room and play video games rather than socializing with his fellow students. Multiple students at the college told TMZ that they said the teen 'spends little time on campus,' always sits in the back of classrooms, and 'moves quickly' from the school buildings to his waiting SUV.ALSO READ: Donald Trump Jr shares video of Volodymyr' dancing' after father's 'dictator, comedian' jibe. Watch'He hardly exists,' one student told the publication. They added that he was always surrounded by Secret Service members, which likely makes it difficult for Barron to have a normal college experience. A separate source described Barron as a 'ladies man' to People magazine. 'He's a ladies' man for sure. He's really popular with the ladies,' they dished.","summary":"Barron Trump continues to gather attention at the New York University. After Kaya Walker, president of the NYU College Republicans, resigned after making bizarre remarks about US President Donald Trump's youngest son, College Republicans hailed him as 'future of the conservative movement'. Barron Trump raised eyebrows due to his mysterious behaviour at the NYU campus.","url":"https://economictimes.indiatimes.com/news/international/global-trends/us-latest-news-barron-trumps-path-to-politics-us-presidents-son-hailed-as-future-of-conservative-movement-for-key-reason/articleshow/118457400.cms","image":"https://img.etimg.com/thumb/msid-118457546,resizemode-4,width-1200,height-900,imgsize-48846,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-21 16:13:48","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":0.012},{"id":293015472,"title":"Anti-Trump conservative summit charts alternative to CPAC Maga-fest","text":"While Donald Trump and his acolytes take a victory lap at the Conservative Political Action Conference this week, some of the president’s staunchest right-leaning critics will convene for their own event just 10 miles away.\n\nThe Principles First summit, which will be held in Washington from Friday to Sunday, has become a venue for anti-Trump conservatives to voice their deep-seated concerns about the “Make America great again” faction of the Republican party, and the gathering has now grown in size and scope. As its organizers confront another four years of Trump’s leadership, they are stretching beyond party lines with speakers such as the billionaire Mark Cuban and Jared Polis, the Democratic governor of Colorado, to craft their vision for a new approach to US politics.\n\nThat vision looks quite different than it did six years ago, when the conservative attorney Heath Mayo founded Principles First. At the time, Mayo, formerly a rank-and-file Republican who supported the presidential campaigns of Mitt Romney and Marco Rubio, hoped to present an anti-Trump alternative to fellow conservatives.\n\n“It started as disgruntled Republicans and conservatives, but that was back in 2019 when that objective seemed to be perhaps more realistic or people were holding out hope that the party would come to its senses,” Mayo said. “Over the years, it’s grown.”\n\nThe group’s first summit attracted just a couple of hundred attenders in 2020, but the guest count at this year’s sold-out event has increased to about 1,100.\n\n“We’ve been surprised actually with the number of people that have signed up to come,” Mayo said. “I think it’s this hunger for new spaces in our politics – new ideas, new faces.”\n\nThose new faces include Cuban, who plans to address the summit on Saturday as his name has been floated as a potential presidential candidate in 2028. A vocal supporter of Kamala Harris’s campaign for the White House last year, Cuban might seem like an unorthodox choice for a presidential candidate, as he has never served in public office, but the same was said of Trump 10 years ago.\n\n“Clearly we live in a moment of disruption. Things are changing really fast … Democrats may have learned that lesson the hard way in November,” Mayo said. “That’s what I hope the weekend will be – a time for people to set aside the party labels and really ask where we’re going as a country.”\n\nThe summit’s list of speakers reflects that mission, ranging from John Bolton, Trump’s former national security adviser, to Polis, the Colorado governor who has occasionally clashed with fellow Democrats over how to navigate the new Trump era. Other speakers include Chris Christie, the former Republican governor of New Jersey who has become a fierce critic of Trump, and four of the police officers who responded to the Capitol on 6 January 2021, as a group of the president’s supporters attempted to disrupt the congressional certification of Joe Biden’s electoral victory.\n\n“I feel like character and integrity are two non-negotiable, key components of Principles First,” said Rich Logis, founder of a group called Leaving Maga and a speaker at the summit. “If you look at the attendees, it’s a large, diverse swath of authors, thinkers and former elected officials. It doesn’t skew rightwing. It doesn’t skew leftwing. But what they all share in common is that they’re devoted to truth, democracy, liberal democracy and the rule of law.”\n\nKyle Sweetser, another speaker at the summit and a former Trump supporter who voted for Harris in November, hopes that the event can offer an example of productive political discourse to fellow voters.\n\n“I think it’s more crucial than ever to offer some sort of platform, at least to reaffirm our commitment to core democratic values and principles,” Sweetser said. “And I’m really looking forward to some good discussion and hopefully some exchange of ideas that will strengthen our democracy.”\n\nSweetser knows firsthand how difficult it can be to reach Trump supporters who have embraced the Maga movement. He voted for Trump twice before starting to question that loyalty, prompting him to diversify his media diet and seek out more information about the president’s record. He considers himself proof that Trump supporters can change their ways, a message he wants to bring to the Principles First summit.\n\n“I want some of the Democrats to understand that there’s a lot of Republicans out there that are good people, and if Democrats work for those people, then they will be able to pull some of those people over to their side,” Swisher said. “But unfortunately, it’s going to be a heavy lift. It’s going to take a lot of work, and it’s going to take patience.”\n\nSweetser and Logis both predicted that Trump’s eventual failure to follow through on key campaign promises, like addressing the high inflation seen in recent years, would chip away at the president’s base and perhaps spur some of his supporters to reconsider their political identity.\n\nSome early examples of this trend may already be emerging. In Sweetser’s home state of Alabama, about 250 customers of a public utility company based in Huntsville just learned they would see a $100 surcharge on their energy bills after one of Trump’s executive orders paused a program aimed at lowering heating costs for low-income households.\n\n“I am wagering a bet that many in the Maga community right now are going to realize that the president is not going to fix anything for them,” Logis said. “When the scales start to fall a bit from the eyes, I want them to know that there’s an exit ramp.”\n\nThat exit ramp eventually brought Logis to the Democratic national convention, where he was featured in a video explaining his transformation from a diehard Trump supporter to a Harris voter. Harris may not have been successful in November, but Mayo still sees a potential path to victory for a pro-democracy candidate who can unify the ideologically diverse group represented at Principles First.\n\n“There’s still a broad coalition out there that can be assembled, and it has got to be constructive. It’s got to have ideas and solutions for the challenges that Americans face, like the affordability crisis,” Mayo said. “At a time when it feels hopeless, it feels like there is a reason to be hopeful when you see that many people coming together to talk about these things.”","summary":"Principles First has become a venue for anti-Maga conservatives and hopes to be a rightwing ‘exit ramp’\n\nWhile Donald Trump and his acolytes take a victory lap at the Conservative Political Action Conference this week, some of the president’s staunchest right-leaning critics will convene for their own event just 10 miles away.\n\nThe Principles First summit, which will be held in Washington from Friday to Sunday, has become a venue for anti-Trump conservatives to voice their deep-seated concerns about the “Make America great again” faction of the Republican party, and the gathering has now grown in size and scope. As its organizers confront another four years of Trump’s leadership, they are stretching beyond party lines with speakers such as the billionaire Mark Cuban and Jared Polis, the Democratic governor of Colorado, to craft their vision for a new approach to US politics.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/feb/21/principles-first-summit-republicans-anti-maga","image":"https://i.guim.co.uk/img/media/43490295d83c91715c4c9160e5dd1ccdcaf44a9f/0_220_2935_1760/master/2935.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-02-21 16:00:42","author":"Joan E Greve,Joan E Greve in Washington","authors":["Joan E Greve","Joan E Greve in Washington"],"language":"en","category":"politics","source_country":"us","sentiment":-0.064},{"id":293043152,"title":"Doug Emhoff Acts Single as Divorce Rumors with Kamala Harris Surface","text":"Former U.S. Vice President Kamala Harris’s personal life still seems to be downhill. The potential candidate who lost to her opponent, Donald Trump, for the position of president on November 6, 2024, reportedly blamed her husband, Doug Emhoff, for the unexpected loss. Reports suggest that there is a lot of blaming between the two, as Kamala Harris is now reconsidering her marriage with Doug Emhoff.\n\nAccording to her, Dough was of no help during her time in office. However, recent reports further suggest that Doug Emhoff has been acting like he is single and merrily enjoying his life! Moreover, there’s been speculation that Harris and Emhoff have been living separately owing to the strain in their union.\n\nView this post on Instagram\n\nApparently, Emhoff has accepted a job offer in New York, and Kamala Harris has planned to move back to her home state of California. She wants to run for governor of California in 2026. Meanwhile, as per Page Six, Emhoff had a blast as he hung out with celebrities in the Big Apple on Thursday night. Moreover, he reportedly partied with singer Beck as he celebrated his Bowery Ballroom show with a bash at the Mulberry.\n\nSadly, Dough’s recent spottings have fueled the speculation that Kamala and Dough are completely done with each other. Meanwhile, Harris has been in a low space since she lost the elections for which she truly worked hard. Sources as per RADAR said, “Doug did Kamala no favors during the election—frankly, he looked like a hypocritical a– after the bombshells that he had got his child’s nanny pregnant while married to his first wife and assaulted his ex-girlfriend on the heels of his ‘I am woman’ crusade.'”\n\nFurthermore, very few are aware of this fact, but when Harris met Emhoff, he was divorced with two young kids, who were sharing custody with his first wife, Kerstin. As per VOUGE, the duo met on a blind date arranged by Harris’s friend, Chrisette Hudlin. The two were involved in a whirlwind romance before they married. \n\nView this post on Instagram\n\nInterestingly, as mentioned by VOUGE, the morning after their first date, Emhoff reportedly wrote Harris an email. “I’m too old to play games or hide the ball,” it said. “I really like you, and I want to see if we can make this work.” While neither of the two have confirmed any of the above speculation, Dugh did post a sweet tribute for Harris on Valentine’s Day on Instagram.\n\nHarris was previously in a relationship with San Francisco mayor Willie Brown before she married Doug. She met Brown in 1994, while he was legally married at the time. Still, he had reportedly been estranged from his wife, Blanche Brown, since 1981, as reported by PEOPLE Magazine.\n\nWhat do you think might have gone wrong between the two? Can career ambitions outweigh love? One thing is for sure: Kamala has gone through a tough time and is surely unhappy with the situation. Stay tuned for the next updates.","summary":"Amidst the ongoing speculation of a possible marriage strain between former Vice President Kamala Harris and her husband, Dough Emhoff, reports suggest Emhoff has been acting like he is single and merrily enjoying his life.","url":"https://www.inquisitr.com/doug-emhoff-acts-single-as-divorce-rumors-with-kamala-harris-surface","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/Doug-Emhoff-and-Kamala-Harris-experience-a-rough-patch-in-their-marriage-1.png","video":null,"publish_date":"2025-02-21 15:55:02","author":"Sweta Choudhury","authors":["Sweta Choudhury"],"language":"en","source_country":"us","sentiment":0.03},{"id":292955376,"title":"The Donald Trump curse? Fans spread wild conspiracy theory after president's failed sports predictions","text":"The Donald Trump curse? Fans spread wild conspiracy theory after president's failed sports predictions\n\nREAD MORE: Fans blast 'embarrassing' Canadian singer for anthem swipe\n\nPODCAST: Trump and Musk’s bromance and JD Vance’s strong words for Zelensky – on Welcome to MAGAland\n\nBy ISABEL BALDWIN\n\nPublished: 14:43 GMT, 21 February 2025 | Updated: 15:30 GMT, 21 February 2025\n\nDonald Trump made a rallying call to Team USA Thursday morning just hours before their Four Nations showdown against Canada, but rather than inspiration, he may have spread bad luck.\n\nThe President may have been victorious at the ballot box last November with his election win over Kamala Harris but his sporting predictions haven't been so triumphant. \n\nWith tensions between the two countries at a boiling point thanks to Trump's recent threats to impose tariffs on their neighbors and ceaseless taunting, the USA clashed with Canada in a battle for the ultimate bragging rights at TD Garden, Boston on Thursday.\n\nBut it was the Canadians who skated away with the last laugh as Connor McDavid's overtime winner silenced the mocking President. \n\nAnd, following the Kansas City Chiefs' Super Bowl defeat earlier this month, fans are convinced that every sports team the Commander-in-Chief touches turns to dust. \n\n'And just like that tRump (sic) screws over yet another team…..everything he touches dies!' one fan wrote on X, formerly known as Twitter, following the Four Nations final. \n\nUS sports fans are convinced that Donald Trump has cursed the teams he has supported\n\nCanada triumphed over the USA in the Four Nations final, despite Trump's taunting \n\n'TRUMP PICKS CHIEFS: CHIEFS LOSE. TRUMP PICKS TEAM USA: USA LOSE,' another posted, spelling out the latest conspiracy theory. \n\n'Everything Trump Touches Dies,' a third chimed in, alongside a GIF of fans waving a Canadian flag. \n\nIn the buildup to Thursday's showdown, Trump, who was unable to attend the game, declared in a Truth Social post that he would call Mike Sullivan's team. \n\nHowever, his pep talk turned sour as he seized the opportunity to launch another attack on punching bag Justin Trudeau, referring to the Canadian Prime Minister as 'Governor' and again threatening to annex '51st state' Canada. \n\nTrump's comments have led to frayed relations between the two countries, with Canada booing the American national anthem in Montreal during the tournament.\n\nAmerican fans returned the favor to 'O Canada' at the 4 Nations Face-Off final in Boston Thursday, which itself was altered by a Canadian singer as a form of protest against Trump.\n\nYet the rivalry - the biggest in international hockey - isn't the only sporting affair the President has waded into in recent weeks. \n\nAhead of attending Super Bowl LIX in New Orleans, Trump predicted that the Chiefs would emerge victorious to seal a historic three-peat.\n\nFollowing the Canadians' victory, fans took to social media to share their conspiracy theory \n\nThe USA, captained by Auston Matthews (R), were beaten 3-2 in overtime in Boston \n\nThe President picked the Kansas City Chiefs to win the Super Bowl before their humiliation \n\nBREAKING NEWS\n\nCanadian national anthem singer shares bizarre photo revealing her plot to insult Trump\n\nYet, Patrick Mahomes and co. went on to be humiliated by the Philadelphia Eagles in a 40-22 defeat. \n\nTrump's attendance at the Big Game had been described as an 'honor' by Travis Kelce, but following the demolition of Andy Reid's side, many fans claimed it was a case of Big Easy voodoo. \n\nOthers believed the curse struck again just one week later when the President attended NASCAR's Daytona 500. \n\nTrump hit the track at NASCAR's Daytona 500, marking a second straight weekend of high-profile appearances at sporting events after Super Bowl LIX.\n\nThe President's motorcade drove straight onto the track in Florida and traveled a short distance in front of the NASCAR fans packed into the stands before it entered a secure area. He later returned onto the track, with his motorcade doing two laps before the race started, where he spoke to the drivers over the radio.\n\nAs Trump's limousine paced the track, he told the drivers: 'This is your favorite President. I'm a big fan, a really big fan of you people. How you do this, I don't know.\n\n'But I just want you to be safe. You are talented people and you are great people and great Americans. Have a good day, have a lot of fun and I will see you later.'\n\nHowever, just hours later, that same track witnessed a horror crash when driver Ryan Preece was sent flying through the air upside down.\n\nHis car flipped over and came crashing back down on to the track - as sparks flew everywhere - during the scary wreck.\n\nKamala HarrisDonald TrumpTeam USACanada\n\nShare or comment on this article:\nThe Donald Trump curse? Fans spread wild conspiracy theory after president's failed sports predictions\n\nAdd comment","summary":"Donald Trump made a rallying call to Team USA Thursday morning just hours before their Four Nations showdown against Canada, but rather than inspiration, he may have spread bad luck.","url":"https://www.dailymail.co.uk/sport/othersports/article-14421601/Donald-Trump-curse-usa-canada-chiefs-super-bowl.html","image":"https://i.dailymail.co.uk/1s/2025/02/21/14/95445999-0-image-m-18_1740148812498.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/02/21/9210838323545588184/1024x576_MP4_9210838323545588184.mp4","publish_date":"2025-02-21 15:30:03","author":"Editor,Isabel Baldwin","authors":["Editor","Isabel Baldwin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.096},{"id":293043126,"title":"Why Is It Called the White House? The Surprising History Behind the Iconic Name","text":"The White House, which is one of the most iconic buildings in the world, has been serving as the official residence and the workplace of the US President for more than 200 years now. President-elect Donald Trump recently moved into the White House with his family in January this year. The 78-year-old defeated Democrat Kamala Harris in elections held on November 5.\n\nOne of the most famous locations in the world is the White House, which is situated at 1600 Pennsylvania Avenue NW, Washington, DC 20006 and serves as the president of the United States’ official residence and place of employment.\n\nIT HAS A NAME. IT’S THE WHITE HOUSE.\n“this incredible house or building or whatever you want to call it because there really is no name for it. It is special. And we keep it in tip top shape. We call it sometimes ‘tippy top’ shape.” pic.twitter.com/KMT90m0oAT\n— tobra (@tobraavery) April 2, 2018\n\nThe White House has six floors to accommodate its numerous occupants and employees, and it covers 18 acres. There are 132 rooms, 32 bathrooms, 412 entrances, 147 windows, 28 fireplaces, 7 stairs and 3 lifts in the old structure.\n\nWhy this iconic structure has been dubbed “The White House” is a question that is frequently asked. Although many people assume that it must be because it is white, this does not adequately explain the reasoning.\n\nThe impacts the War of 1812 had on tribes were simply devastating. Afterwards, the United States was firmly established as the preeminent power in North America, growing in size and power each passing year.\nWith a military force at its disposal and an expanding need for land,… pic.twitter.com/ZdbxaUBSDq\n— History Photographed (@HistoryInPics) November 4, 2023\n\nThe War of 1812\n\nThere is a widespread misconception that the building was painted white for the very first time to cover up the marks left by the British soldiers. They had burned the White House down on August 24, 1814, almost two years after the war broke out.\n\nThe story that is often suggested is that the building was painted white to hide these marks. Even though it makes an impressive story, it is not at all true.\n\nThe color of the White House has been white color since the very beginning when the first ever President George Washington of the US selected the location for the White House in 1719. The cornerstone was actually laid that year after with its design being done by Irish-born architect James Hoban. After about eight years of construction, President John Adams and Abigail, his wife, became the first Presidential couple to move in, even though it was still unconstructed at that time.\n\nAs per the White House Historical Association, the iconic building received a lime-based whitewash in 1797 for protecting its “sandstone exterior from moisture and cracking during winter freezes.”\n\n“The White House” was the official name given to the Executive Mansion by new President Theodore Roosevelt today 1901: pic.twitter.com/Z3E3rgHx0B\n— Michael Beschloss (@BeschlossDC) October 12, 2024\n\nThe Official Name\n\nIt’s interesting to know that there was actually no official name given to the building in the initial days. The term “White House” was used occasionally by several throughout the 19th century, besides other names being used like “President’s House” and the “Executive Mansion.”\n\nThis term was used officially on October 17, 1901, when then US President Theodore Roosevelt’s secretary George Cortelyou was the one who sent a letter to the Secretary of State John Hay. It was in Roosevelt’s direction, the official was then asked to change headings and date lines of all official documents and papers that required the president’s signature. Which changed from ‘Executive Mansion’ to ‘White House’. Since then, the official name of the US President’s residence was changed to the “White House.”\n\nThe White House has been the residence of every U.S. president since John Adams in 1800 pic.twitter.com/9RnQoN2rwu\n— 包养 包养学生 北京包养 上海包养 广州包养 深圳包养 金主爸爸 (@realtimehistry) July 24, 2021\n\nThere are a number of fascinating historical facts about the White House. Both free and enslaved African Americans worked to build it; although the government did not own slaves, officials did recruit them from their owners. Although he never resided there, President George Washington oversaw its construction. 570 gallons of paint are needed to cover the White House’s façade.\n\nUp to 140 people can be served dinner in the White House kitchen, which employs five full-time chefs. US presidents have mostly worked from the Oval Office since 1909, however they previously used other parts of the White House prior to Theodore Roosevelt’s West Wing enlargement.","summary":"A lot of people believe that the White House is named because of its ‘white’ color. However, how true is that?","url":"https://www.inquisitr.com/why-is-it-called-the-white-house-the-surprising-history-behind-the-iconic-name","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/The-White-House.png","video":null,"publish_date":"2025-02-21 15:29:08","author":"Shrobana Rakshit","authors":["Shrobana Rakshit"],"language":"en","source_country":"us","sentiment":0.074},{"id":292984000,"title":"James Carville Deflects When Sean Hannity Calls Out Dems’ ‘Bad Strategy’ On ‘Key Issues’","text":"Democratic strategist James Carville on Thursday largely avoided directly answering Fox News host Sean Hannity’s critiques of his party’s stance on illegal immigration, government spending and males competing in women’s sports.\n\nHannity suggested on “Hannity” that Democrats have positioned themselves against popular public opinion by supporting males in female sports, prioritizing illegal immigrants over U.S. citizens and resisting efforts to cut government waste. Carville deflected on immigration and spending while insisting he was unaware of any Democratic support for male athletes competing in female divisions. (RELATED: ‘Two Thumbs Up’: CNN’s Harry Enten Says ‘Americans Are In Love’ With Trump’s Transition Moves)\n\n“To me, if you want to be the party where the Democrats defend men playing in women’s sports, if you want to be the party that stands up for illegal immigrants’ rights over safety and security of Americans — because they let millions of unvetted illegals in this country, including terrorists and cartel members and murderers — if you want to be the party that is going to fight against spending hundreds of billions of dollars in waste, fraud, and abuse, I think it’s a bad strategy,” Hannity said. “And as somebody — I respect you —I would think you would agree with me that Democrats should stand with [President] Donald Trump on getting rid of that waste, fraud and abuse.”\n\nDemocrats have been critical of Trump and Department of Government Efficiency (DOGE) head Elon Musk’s effort to eliminate government waste, protesting their actions to reduce the abuse of taxpayer funds within the United States Agency for International Development (USAID) and the Department of Education.\n\nCarville did not address the subjects Hannity raised, instead pivoting to criticize what he considers to be the Republican Party’s platform.\n\n“I think the Republican Party is against a minimum wage. I think the Republican Party stands for more tax cuts for people making over $400,000 a year,” Carville said. “I think the Republican Party wants to get rid of a woman’s right to choose. I think the Republican Party wants to destroy Medicaid. I think the Republican Party would like to get rid of Medicare if it possibly can.”\n\n“I think the Republican Party supports Vladimir Putin. I think the Republican Party is weak when it comes to Communist China,” he continued. “So there are a lot of issues of which I have profound and deep disagreements with the Republican Party on. I must tell you that in all honesty. And there are many things that the Democrats want to do that I really believe in.”\n\nHannity began to call Carville out for what he “didn’t answer,” but the Democratic strategist interrupted him to say he was unaware of a single Democrat who campaigned on the issue of which sexes can compete in sports. Hannity retorted that there are Democrats “out there advocating for” males to play in female sports.\n\nCarville repeated that he is unaware of any.\n\nOnly two House Democratic lawmakers voted against the Protection of Women and Girls in Sports Act in January that would bar males from competing in female sports.\n\n“I hear a lot of Democrats standing up for illegal immigrants. And they don’t want to deport them,” Hannity said. “They want to have sanctuary states and cities. I hear a lot of Democrats like [former Vice President] Kamala [Harris] saying she’s against fracking and drilling until she’s running for election. I see a lot of Democrats do support men, their rights to play women’s sports. You’re not addressing those key issues that are —” he said, before being cut off.\n\nCarville interrupted to dispute whether males playing in female sports is indeed a “key issue.” He suggested the real important issues are health care, social security and the economy, for which he asserted Democratic presidents are better stewards.\n\n“I don’t know of anybody that’s sitting there worrying about who plays in the high school track meet,” the Democratic strategist said. “I really don’t.”\n\nHannity then moved to the issue of DOGE identifying billions of dollars in waste, fraud and abuse in the federal government, including “on the radical Green New Deal, DEI, wokeism, transgenderism, LGBTQ+.” He showed a graphic that scrolled through examples, which particularly focused on USAID.\n\n“With the exception of [Democratic Pennsylvania Sen.] John Fetterman, I don’t hear Democrats saying, ‘You know what? We ought not be spending the American people’s money this way.’ What say you?” Hannity asked.\n\nCarville responded by minimizing the effect of cutting funds USAID spends because of how small of a percentage it makes up of the entire federal budget. “They [USAID] spend $41 billion … the federal budget is $6 trillion, I did the math, Sean, it comes to something like .014 %,” he claimed.\n\n“But James, you’re smarter than this. Because I’m listening really closely to you. And USAID is 1% of what they’re finding and they’re finding it in every department of government … And what’s happening is we’re seeing the biggest, I think, corruption, scandal, abuse of taxpayers in my life,” Hannity said. “Now, I hear you, and I hear James Carville circa 1990s, and it’s like you don’t want to address what Americans seem to say are their top priorities. Illegal immigration, they want lower energy prices, they want the economy fixed.”\n\nCarville then touted former President Joe Biden’s administration for having “the most domestic energy production production in American history.” Hannity agreed, but gave Trump some of the credit for it.\n\n“James, I think you need a new playbook. I really do,” Hannity said. “But I still love you.”\n\n“I’m not too worried about the high school track meet. But I am worried about people having affordable health care. And that’s the difference between our two parties,” Carville responded. “You go and worry about the high school track meet. I’ll worry about people getting good health care, okay? We’ll agree to disagree.”\n\nHannity asserted Carville might care about the issue of males playing women’s sports if it affected his daughter.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'You don’t want to address'","url":"https://dailycaller.com/2025/02/21/james-carville-deflects-sean-hannity-democratic-strategy/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/02/Screenshot-2025-02-21-9.47.46-AM-e1740149352369.png","video":null,"publish_date":"2025-02-21 15:08:50","author":"Jason Cohen","authors":["Jason Cohen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.31},{"id":292984002,"title":"VICTOR DAVIS HANSON: Tom Hanks, Margaret Brennan, And The European Ministers — Reveal It All","text":"Three recent but completely unrelated events illustrate the deranged hatred of President Donald Trump and his supporters continuing now even into a second decade. And yet the venom only further marginalizes the left.\n\nIn its too-long 50th anniversary spectacle, Saturday Night Live offered a skit in which marquee actor Tom Hanks did an impression of what the left thinks is a supposedly Neanderthal Trump supporter.\n\nThe episode was NBC’s tele-version of the recent Obama-Hillary Clinton-Biden vocabulary of cheap MAGA disparagement: clingers, deplorables, irredeemables, chumps, dregs, semi-fascists, and ultra-MAGAs. (RELATED: VICTOR DAVIS HANSON: Mythologies About Musk)\n\nMost of those stereotyped props were evident in Hanks’ character. He was wearing a red MAGA hat (real and not the fake version of Jussie Smollett’s wild and sinister imagination).\n\nHanks sounded off as a superstitious evangelical, a slow-speaking Southern twanger, and a poorly dressed slob.\n\nAnd of course, the SNL writers insisted that he play the gratuitous racist. So, Hanks, as a clueless Black Jeopardy contestant, initially refused to even shake the hand of the African-American, assumed intellectually and morally superior, game show host.\n\nWe are supposed to believe the Hanks caricature is in contrast with progressives — usually represented in society as the bi-coastal enlightened, well-spoken, and snappily dressed.\n\nPerhaps the SNL crowd thought the counterpart to Hanks’ MAGA sluggard was the recent hard-left, Democratic standard-bearer — the eloquent former Vice President Kamala Harris of mesmerizing word-salad fame?\n\nAside from the reality that Trump captured a record number of African-American male voters, nearly split the Hispanic vote, and made gains with Asian- and Jewish-Americans, he also won massive defections from Wall Street and Silicon Valley entrepreneurs.\n\nSo, does SNL, Tom Hanks, or the left have any idea why it lost the popular vote due to such a diverse group of Democrat apostates?\n\nDemocrats should ask: Who is truly slow-witted? Is it the stumbling Tom Hanks caricature or the real Joe Biden and his ilk?\n\nThe latter bequeathed Americans an open border, 12 million illegal aliens, hyperinflation, two theater wars abroad, mega-trillion-dollar deficits, and the Green New Deal that impoverished the middle classes of all races.\n\nAt about the same time, Secretary of State Marco Rubio appeared on CBS’s Face the Nation. He was immediately pressed by host Margaret Brennan, the epitome of the supposedly sophisticated, hip, left-wing journalist, and thus the converse of the Hanks caricature.\n\nYet when pressing Rubio about the recent dress-down speech of Vice President JD Vance to the European ministers, Brennan thought she would draw on her historical wisdom to confound the supposed Trump megaphone.\n\nDid Vance not know, Brennan demanded of Rubio, that he was lecturing Europeans about their unfortunate abandonment of free expression and speech? And in Germany of all places, she intoned — the very place, she insisted, where the Nazis once weaponized free speech to conduct the genocide!\n\nIt took Rubio about a nanosecond to clue the historically illiterate Brennan that the Nazis never allowed any free speech.\n\nIt was not excessive or even crude free speech that caused the Holocaust, but precisely the complete absence of all sorts of dissenting views in the marketplace of ideas.\n\nIronically, it was precisely Brennan’s own defense of censoring “hate speech,” “disinformation,” and “misinformation” that the Nazis used to brand as extreme and unacceptable any view contrary to their own. (VICTOR DAVIS HANSON: Are Trump’s Tariffs Really Tariffs?)\n\nNext, the stunned European ministers in Munich, of course, sat aghast at Vance’s tutorial.\n\nNone refuted what he was saying, namely that European elites’ efforts to delay or cancel elections that might bring national conservative populists to power are contrary to the European enlightenment.\n\nThe use of weaponized, selective law enforcement to go after peaceful anti-abortion protestors, but not known violent Muslim illegal immigrants, is not only contrary to a free society but suicidal.\n\nBut Vance had a deeper subtext to his remarks.\n\nThe left-wing European elite fear even more than they hate the rising populist pushback.\n\nThe European apparat knows their own past two decades of massive illegal alien influxes, disarmament, deindustrializing, crashing fertility, green mandates, high taxes, crushing regulations, asymmetrical trade tariffs, and suppression of free speech and dissent were precisely what created the populist backlash.\n\nThe growing counter-revolution was not because of bogeyman charges of “racism,” “Islamophobia,” or “xenophobia,” much less “hate speech.”\n\nThe real culprit was bankrupt policies that not only did not work but impoverished the entire European Union middle classes.\n\nSo, the cure to restore European influence and prestige abroad and prosperity and security at home is not more censorship but more debate, dissent, and fresh ideas.\n\nAll that transparency might jump-start the economy, encourage entrepreneurialism, ensure national security, and return Europe to a civil, safe — and influential — society.\n\nSometimes Trump haters prove to be his best allies. Their venom shows us they either lack common sense or intelligence or both.\n\nSuch was the case with Tom Hanks, Margaret Brennen, and the European ministers.\n\nABOUT THE WRITER\n\n(Victor Davis Hanson is a distinguished fellow of the Center for American Greatness. He is a classicist and historian at the Hoover Institution, Stanford University, and the author of “The Second World Wars: How the First Global Conflict Was Fought and Won,” from Basic Books. You can reach him by e-mailing authorvdh@gmail.com.)","summary":"'And yet the venom only further marginalizes the left.'","url":"https://dailycaller.com/2025/02/21/victor-davis-hanson-tom-hanks-margaret-brennan-saturday-night-live-european/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/02/GettyImages-2199725701-scaled-e1740147905338.jpg","video":null,"publish_date":"2025-02-21 15:08:30","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":-0.129},{"id":293043130,"title":"Barack and Michelle Obama Already ‘Dividing $70M in Assets’ as Power Couple Nears Divorce—Insider Reveals!","text":"Former President Barack Obama and Michelle Obama are secretly approaching towards splitting up their $70 million fortune and are coming closer to the end of their 32-year marriage. As per sources, their sensational split could be the first-ever post-White House divorce to occur between a former president and first lady.\n\nHard-nosed mediators and lawyers for the former Democratic Party power couple are trying to come to terms and dividing their assets and dollars before the estranged spouses come out clean with the people of America later this year, claimed sources.\n\nNEW: Michelle Obama, who has a net worth of about $70 million, says her parents were always suspicious of people who took more than they needed.\n“[My mom] and my father didn’t aspire to be wealthy. In fact, they were suspicious of folks who took more than they needed.”\n“They… pic.twitter.com/cpIlzV1PW7\n— Collin Rugg (@CollinRugg) August 21, 2024\n\n“They want to have everything ironed out in advance,” an insider who had knowledge of the deliberations said. “The last thing they want is an ugly fight with lots of nasty legal filings.”\n\nIt seems like the romance between Barack, 63, and Michelle, 61, has finally hit the rocks. It also looks like this news comes as no surprise to our readers.\n\nAs reported previously, according to a political expert the couple’s partnership has turned pretty “venomous” after the Republican Donald Trump’s glorious victory over democrat Kamala Harris in the presidential election of 2024.\n\nSources claim that after Joe Biden abruptly withdrew from the run for the presidency in July, Barack requested that the mother of his two adult children, Malia, 26, and Sasha, 23, adopt the Democratic Party’s standard.\n\nHowever, according to insiders, the Harvard-trained lawyer who is now a Tinseltown producer rejected her husband’s demand and decided to go after her Hollywood goals through their joint venture, Higher Ground Productions.\n\n“They’d already been living separate lives on opposite coasts for some time, but that was no longer an option after Michelle refused to run and Barack was forced to back Kamala,” a source told. “That was a total humiliation for him – especially since she lost.”\n\nEven though Barack Obama took to social media in January to wish his wife Michelle a happy birthday in an overwhelming X post. Sources have claimed that a public statement about their marriage’s end is likely to be issued after the summer. Because it is likely to take almost months to sort out their intermingled mountain of fortune.\n\nThe Barack and Michelle Obama Divorce Rumors Are Getting Even CRAZIER😵‍💫 pic.twitter.com/96tbRofz61\n— Unusual Suspects (@VT_Unusuals) January 27, 2025\n\n“They have homes in D.C., Martha’s Vineyard and Chicago-plus a stock portfolio in excess of $25million,” our insider said. “There are also substantial revenue streams from their various media projects to divide and manage going forward.\n\n“It’s far from easy to untangle a life of three decades with someone, but maintaining the illusion of a happy and stable marriage is no longer a solution. They both are of the mind that they will be better off on their own.”","summary":"Former President Barack Obama and Michelle Obama are reportedly splitting up their $70 million fortune as they come close to their divorce, sources say.","url":"https://www.inquisitr.com/barack-and-michelle-obama-already-dividing-70m-in-assets-as-power-couple-nears-divorce-insider-reveals","image":"https://www.inquisitr.com/wp-content/uploads/2025/02/Barack-and-Michelle-Obama-‘Dividing-70M-as-Power-Couple-Nears-Secret-Split-1.jpg","video":null,"publish_date":"2025-02-21 14:47:50","author":"Shrobana Rakshit","authors":["Shrobana Rakshit"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.26},{"id":292935900,"title":"Senate GOP Blocks Dem Effort To Make Immigration Enforcement Package About Anything Other Than Border Security","text":"Senate Republicans blocked nearly 30 amendments from Democrats intended to derail the upper chamber’s budget blueprint to fund President Donald Trump’s border security agenda during an overnight session that concluded early Friday morning.\n\nThe Senate took the first step in unlocking more than $340 billion in spending to fund the president’s border security and deportation efforts, which will allow the administration’s illegal immigration crackdown to be executed at full force. Though Senate Democrats attempted to put their Republican colleagues on the spot by holding votes on dozens of amendments intended to exact political pain, Democrats had little to say about the actual purpose of the budget resolution: funding the president’s border security agenda. (RELATED: Tim Walz Could End Up Facing Off Against An Even More Radical Version Of Himself In Senate Race)\n\nThe Senate ultimately approved the border security-focused budget resolution in vote of 52 to 48 shortly before 5 a.m. after nearly a ten-hour slog. Republican Kentucky Sen. Rand Paul opposed the resolution, citing concerns that the forthcoming budget bill would fail to completely offset the spending increases unlocked with passage of the budget resolution.\n\nNo Senate Democrat voted to advance the budget resolution that would unlock money to fund the president’s illegal immigration crackdown efforts. Senate Republicans’ budget proposal provides instructions to fund $175 billion in immigration enforcement money in addition to an increase in defense spending and policy changes to spur energy production in a forthcoming budget bill.\n\n“If you listen to Senate Democrats, it’s abundantly clear that they do not support these goals,” Senate Majority Whip John Barrasso said on the Senate floor Thursday. “Democrats are opposed to securing our border, rebuilding our military, and unleashing American energy.\n\n Senate Republicans are focused on securing the border, rebuilding our defense, and unleashing American energy. Senate Democrats are focused on getting in the way. — Leader John Thune (@LeaderJohnThune) February 21, 2025 \n\nThe budget resolution stage of the reconciliation process allows any senator to propose an unlimited number of budget-related amendments that are voted on in a marathon process known as a “vote-a-rama.” The unique rules of the reconciliation process allowed Senate Democrats to delay passage of the budget resolution until they lost steam voting on amendments. Every Democrat-sponsored amendment failed to be adopted.\n\nSenate Democrats’ opposition to funding border security and defense spending comes as their approval rating plummets to an all-time-low. Just two in ten Americans approve of congressional Democrats’ job performance, according to Quinnipiac polling released Wednesday.\n\nDemocrats debated the border security package by harping on taxes, appearing to view attacking Senate Republicans for allegedly giving tax cuts to billionaires as a political lifeline to a party widely viewed as struggling to craft a strategy back to electoral success.\n\n“Nothing criticizes the broken core of Republicans’ agenda better than their tax cuts for the ultra-wealthy,” Senate Democratic leader Chuck Schumer said on the Senate floor prior to introducing an amendment to stop a budget bill from providing a tax cut to individuals earning more than $1 billion per year.\n\nRepublicans countered that the budget bill was not a tax-focused bill, but a border security-focused bill. Senate Republicans plan to take up the president’s tax priorities in a separate budget package later in the year.\n\nDemocrats also alleged that Senate Republicans were seeking to cut popular entitlement programs despite the budget resolution not providing instructions to do so, and widespread opposition in the Republican conference to achieve significant spending reform by cutting into entitlements.\n\nTrump has also repeatedly said he would not support a budget package that cuts Medicare or Medicaid — barring instances of waste, fraud and abuse.\n\n“The Democrats know very well that this targeted budget blueprint does not cut Medicaid or Medicare,” Senate Finance Committee Mike Crapo of Idaho said on the Senate floor Thursday evening. \n\n“The claims we’ve heard continuously tonight, to me, seem just to be the politics of fear in the face of trying to deal with our nation’s critical issues,” Crapo said later in the evening.\n\nRepublican Sens. Susan Collins of Maine and Josh Hawley of Missouri occasionally voted for Democrat-backed amendments seeking to forestall hypothetical cuts to entitlement programs in a forthcoming budget bill.\n\nCollins, the most moderate member of the Senate Republican conference, could face a competitive reelection in a state former Vice President Kamala Harris won. Hawley appeared to be concerned about how hypothetical cuts to entitlement programs could impact working class Americans throughout the night.\n\nDespite staying up until the early morning hours to advance a budget resolution, the Senate’s version may face immediate roadblocks if the House refuses to consider the upper chamber’s slimmed-down budget approach.\n\nSpeaker Mike Johnson has said the Senate’s budget proposal is dead on arrival in his chamber. House Republicans could pass a competing budget resolution as early as next week incorporating all of the president’s tax and spending priorities into “one, big beautiful bill.”\n\nThough Trump threw his weight behind the House version, the president appeared to give Senate Republicans the green light to continue advancing their own budget plans Thursday prior to the vote-a-rama.\n\n“Thank you to Majority Leader John Thune, and the Republican Senate, for working so hard on funding the Trump Border Agenda,” Trump wrote on Truth Social. “Your work on funding this effort is greatly appreciated!”\n\nHawley told reporters Trump still wants one comprehensive bill Thursday.\n\nAs Trump moves to stem the influx of illegal migrants into the United States — lowering border encounter numbers to levels not seen since the 1960s — key administration officials are begging Congress to provide additional funding to go full throttle on the president’s immigration crackdown.\n\nSenate Republican leadership is adamant that their budget plan is the right vehicle to do just that.\n\n“After four years of high prices and open borders, Americans deserve a path to safety and prosperity,” Barrasso said Thursday. “Starting with the Republican budget, they will finally get it.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'They do not support these goals'","url":"https://dailycaller.com/2025/02/21/senate-gop-democrats-immigration-enforcement-package-border-security/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/02/Thune-1-scaled-e1740111738680.jpg","video":null,"publish_date":"2025-02-21 14:27:07","author":"Adam Pack","authors":["Adam Pack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.285},{"id":292939956,"title":"Trump administration abandons Biden-era TPS extensions for Haitian migrants","text":"Homeland Security Secretary Kristi Noem vacated a decision made by the Biden administration to extend TPS for 18 months, meaning it will now expire on Aug. 3, adding a new wrinkle to a saga that played a big role in last year’s presidential election.\n\n“Biden and [former DHS secretary Alejandro] Mayorkas attempted to tie the hands of the Trump administration by extending Haiti’s Temporary Protected Status by 18 months—far longer than justified or necessary,” a DHS spokeswoman said.\n\n“We are returning integrity to the TPS system, which has been abused and exploited by illegal aliens for decades,” she added. “President Donald Trump and Secretary Noem are returning TPS to its original status: temporary.”\n\nTPS allows migrants from designated countries to remain in the U.S. even if they originally entered the country illegally, and it is typically used if there is a war or environmental disaster in their home country.\n\nHaiti has been designated for TPS since a massive earthquake hit the country 15 years ago, allowing hundreds of thousands of people to move to the U.S. However, the vast majority entered during the Biden administration, according to DHS. The agency estimates that 57,000 Haitians were eligible in 2011, a number that reached 155,000 in August 2021 and then jumped to 520,694 by July 2024.\n\nThe problem reached a fever pitch last fall when the Trump campaign amplified claims that Haitian migrants in Springfield, Ohio, were eating dogs and cats.\n\n“A lot of towns don’t want to talk about it because they’re so embarrassed by it,” Trump said during his only presidential debate with Democratic nominee Vice President Kamala Harris. “In Springfield, they’re eating the dogs, the people that came in, they’re eating the cats. They’re eating — they’re eating the pets of the people that live there.”\n\nWhile that claim was unfounded, it spotlighted the fact that up to 20,000 people from Haiti had been allowed to move into the mid-sized city, causing disruption and concern among many of the city’s residents.\n\nTrump won the city of Springfield for the first time last year and improved his margins in Clark County, where the city is located.\n\nNow, those migrants could be forced to return home later this year, though the move is likely to face legal challenges. \n\nVice President JD Vance, an Ohio native and former U.S. Senator, praised the administration’s immigration stance during remarks on Thursday without mentioning Springfield specifically.\n\nWhite House says ‘DOGE dividend’ checks wouldn’t spur inflation\n\n“It’s simple: American tax dollars should go to American citizens, not to illegal aliens,” he posted on X. “The Trump Administration is getting control of the border and stopping this insanity in its tracks.”\n\nThe news follows an announcement last month that Noem was rescinding TPS for Venezuela.","summary":"The Trump administration has announced it will remove temporary protected status for thousands of Haitian migrants, putting them on track for removal from the United States. Homeland Security Secretary Kristi Noem vacated a decision made by the Biden administration to extend TPS for 18 months, meaning it will now expire on Aug. 3, adding a [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3325956/trump-administration-abandons-biden-era-tps-extensions-haitian-migrants/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/DHS-Haitian-migrants-TPS.webp","video":null,"publish_date":"2025-02-21 14:25:01","author":"Haisten Willis","authors":["Haisten Willis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.086},{"id":292940898,"title":"Professor calls on Democrats to stop using term 'people of color' as Latino and Black voters side with Trump","text":"University of California, Berkeley professor Jerel Ezell argued that Democrats should stop relying on traditional racial politics to win elections. In a Politico opinion piece published Friday, Ezell noted that Democrats, despite their continued reliance on Black, Latino, Indigenous and Asian voters, found themselves surprised by President Donald Trump's gains with some of those groups in the 2024 presidential election. \"The 2024 presidential election left the Democrats’ multiracial coalition in tatters,\" Ezell wrote. \"Nonwhite people voted in higher percentages for Trump in 2024 than they did in 2020, in some cases by double-digit increases. Democrats are now in the thick of a come-to-Jesus reckoning over these losses, and it should begin with this obvious truth: There is no deep cultural, social, economic or political linkage between Black, Latino, Indigenous and Asian Americans — at least not one that can be leveraged by the party for votes.\" BLACK CAUCUS CHAIR ACCUSES TRUMP OF 'PURGE' OF 'MINORITY' FEDERAL WORKERS \"In November, Latinos swung hard for Trump, and the former president had a notable hike in support from Asians,\" Ezell continued. \"Indigenous voters, crucial in helping Biden win Arizona and Wisconsin in 2020, had no such effect in the vital swing states this go-round, although a majority still voted for Democrats. Black voters remained Democrats’ bulwark, albeit a compromised one, with Kamala Harris netting 8 out of 10 Black voters, down from Biden’s 9 out of 10 in 2020.\" Ezell wrote that if Democrats were at all \"surprised\" by those poll results, it may be because liberals who use the term \"people of color\" have learned to think that \"nonwhite voters are far more culturally alike — and politically aligned — than they actually are or have been in recent memory.\" \"The bottom line is that the Democratic Party’s ‘people of color’ rhetoric overplays solidarity between different racial groups, a solidarity that reached its height in the civil rights era but has long been on the wane,\" Ezell wrote. TRUMP'S BIG TENT: PRESIDENT-ELECT IMPROVED ON 2020 PERFORMANCE IN 4 COUNTIES WITH BIG MINORITY POPULATIONS A Fox News Voter Analysis showed Trump's crossover appeal to traditional Democratic constituencies was foundational to his victory over former Vice President Kamala Harris. He improved on his 2020 numbers among Hispanics (41%, +6 points), Black voters (15%, +7 points), and young voters (46%, +10 points). These rightward shifts were particularly notable among Hispanic men (+8 points), Black men (+12 points), and men under 30 (+14 points) from 2020. CLICK HERE TO GET THE FOX NEWS APP Fox News' Chris Pandolfo contributed to this report.","summary":"University of California, Berkeley professor Jerel Ezell argued in a Politico op-ed that Democrats should stop relying on traditional racial politics to win elections.","url":"https://www.foxnews.com/media/professor-calls-democrats-stop-people-color-latino-black-voters-side-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/05/931/523/Donald-Trump-RNC-retreat-Palm-Beach-FL-May-4-2024.jpg?ve=1&tl=1","video":null,"publish_date":"2025-02-21 14:23:28","author":"Jeffrey Clark","authors":["Jeffrey Clark"],"language":"en","category":"politics","source_country":"US","sentiment":-0.423},{"id":292994718,"title":"Carville: Trump 'Collapse' Is Already Underway","text":"During an appearance on Thursday’s broadcast of Fox News Channel’s “Hannity,” long-time Democrat strategist and media commentator James Carville declared the collapse of President Donald Trump to be underway already.\n\nCarville, who predicted former Vice President Kamala Harris would be elected to the presidency last November, cited polling and urged Democrats to “just sit back” and let the so-called “collapse” take place.\n\n“[L]et me back up,” he said. “We went with our seven-string quarterback, and we lost by a point and a half, and we actually picked up a congressional seat. So, if you’re asking me, did I think that she was going to win and she didn’t win? Yes, all the polling showed it even it turned out to be a point and a half race, but — and you lost seats, but if you have — and I’m telling the Democrats just sit there, play possum, let them go, let them go, let them go.\n\nCarville added, “Poll numbers are declining. The collapse is already underway. Let’s see when they put the Medicaid budget, where they put the tax, the $4.5 trillion of tax cuts to wealthy people. Just let the ball come to you. We don’t need to be aggressive now. We can just sit back.”\n\nFollow Jeff Poor on X @jeff_poor","summary":"During an appearance on Thursday's broadcast of Fox News Channel's \"Hannity,\" long-time Democrat strategist and media commentator James Carville declared the collapse of President Donald Trump to be underway already.\n\n\nThe post Carville: Trump &#8216;Collapse&#8217; Is Already Underway appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/02/21/carville-trump-collapse-is-already-underway/","image":"https://media.breitbart.com/media/2025/02/Carville2212025-640x335.jpg","video":null,"publish_date":"2025-02-21 14:15:20","author":"Jeff Poor","authors":["Jeff Poor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.462},{"id":292955152,"title":"9 out of 10 Best States for Families Are Conservative: Study","text":"When it comes to family flourishing, not every state is created equal. Nine of the top 10 states with the healthiest families are conservative, according to a new study released this week.\n\nThe 2025 Family Structure Index ranks all 50 states based on three criteria: the percentage of married adults between the ages of 25 to 54, the average number of lifetime births per woman, and the percentage of children aged 15 to 17 who are living with their married parents. \n\nThe outcomes tracked closely with conservative political ideology, especially in states with a strong religious base, according to Brad Wilcox, professor of sociology at the University of Virginia and a fellow at the Institute for Family Studies.\n\nThe state of Utah scored the highest rating on two out of three measures: the marriage rate and the percentage of persistent, intact families.\n\nNot one of the 50 states has a birthrate that meets the replacement level of 2.1. The closest, South Dakota, has a fertility rate of 2.01. Every other state’s birthrate falls below 2.0.\n\nAmong those on the wrong side of the spectrum, Vermont has the lowest fertility rate at 1.35. The state with the lowest percentage of married adults is New Mexico, at 49.5%, the only state where married people represent a minority in the prime age demographic.\n\nThe majority of teenagers in 17 states are raised in broken or single-parent homes. In Louisiana, barely one in three teens (35.9%) lives with his or her own parents. The state with the fewest teenagers being raised by intact families, Kentucky (41.2%), scored well on other measures, ranking 13 overall.\n\nThe top 10 states on the Family Structure Index are:\n\nSouth Dakota\n\nNorth Dakota\n\nThe 10 worst states on the Family Structure Index are:\n\nMassachusetts\n\nRhode Island\n\nFamily advocates nationwide began analyzing the results—and presenting policies to restore the health of families.\n\n“At the root of what is hurting our communities is broken families,” Aaron Baer, president of the Center for Christian Virtue, which commissioned Institute for Family Studies to carry out the family structure study, told The Washington Stand.\n\nCenter for Christian Virtue released its own analysis, “The Hope and a Future Report,” to further examine the outcomes on a state level. \n\n“The Hope and a Future Report reveals some devastating realities about the challenges our children face, but also provides real solutions about righting the course in Ohio and America,” Baer told The Washington Stand. For instance, “The average number of lifetime births per Ohio woman (the Total Fertility Rate) has declined by 11%, from 1.9 births per woman in 2010 to 1.7 births per woman in 2022.”\n\nStruggling families and single-parent homes correlate with malign social outcomes, Center for Christian Virtue found.\n\nAreas with fewer intact families experienced more violence. Canton, where two out of three children are raised outside wedlock, has 12 times the level of violent crime as the Columbus suburb of Dublin, where 84% of teens live with their parents.\n\nChildren raised in areas with fewer strong families and a robust culture of marriage were also less likely to graduate high school. “Comparatively high family instability across the state is undoubtedly one reason Ohio ranked 28th in on-time high school graduation,” said the Center for Christian Virtue. “We know that states with a greater share of married parents have substantially higher graduation rates, even after controlling for states’ median income, race/ethnicity, education level, and age composition.”\n\nThe results hold true from coast to coast. The Institute for Family Studies study’s data prove that “family structure is a key driver of economic well-being, and our state is failing to provide the conditions for strong, stable marriages and families,” Michael Geer, president of the Pennsylvania Family Institute, told The Washington Stand. The Keystone State “should be a national leader in family stability” yet it is “shockingly underperforming.”\n\n“States that support strong family structures reap the rewards of lower poverty rates, better educational outcomes, and economic prosperity,” Tom Shaheen, vice president of Policy for the Pennsylvania Family Institute, told The Washington Stand. \n\n“If we continue down this path, we will see increased poverty, declining social mobility, and long-term damage to Pennsylvania’s communities,” said Geer. “Pennsylvania must take immediate action to strengthen marriage and family life or risk further decline.”\n\nIn a separate report, the Institute for Family Studies found red states that voted for Republican President Donald Trump in the 2024 election have a higher fertility level than blue states that supported Democrat Kamala Harris.\n\n“Those counties that voted for Trump tended to have much higher fertility rates than those that did not,” wrote Grant Bailey and Lyman Stone of Institute for Family Studies late last year. “Counties that had less than 25% of their vote share for Trump, such as D.C., had a median total fertility rate of 1.31. In contrast, counties that had more than 75% of their vote share for Trump had a median total fertility rate of 1.84.”\n\nThe partisan childbearing gap is strong and growing, having increased 85% between 2012 and 2024. “Over a quarter of the variance in county fertility rates can be accounted for by political partisanship. Essentially, the parties are divided by family,” found Bailey and Stone. “Republican counties do not significantly differ from Democratic counties in the proportion of babies born to married parents, contrary to years past.”\n\nHow Church and State Can Strengthen the Family\n\nSimple voting patterns cannot change demographic trends. Center for Christian Virtue offers three concrete plans to strengthen families—and, unlike other think tanks, some of the steps can only be implemented by the church.\n\n“Restoring a Hope and a Future for our children is possible. It starts with a commitment to addressing the root cause driving the challenges in our communities. Changing course will require both Church and State solutions,” says the report.\n\nThe state should eliminate marriage penalties, teach the Success Sequence in school, and promote marriage broadly in the public imagination, say experts.\n\nThe Success Sequence, created by scholars at the Brookings Institution, found that if young people graduate high school, get a job, and get married before having kids, “it is nearly impossible to live in poverty,” in Center for Christian Virtue’s words. \n\nThey also found those at the bottom of the socioeconomic ladder saw the greatest gains from following those steps, which sometimes lifted 99% of the population out of poverty. \n\n“Ohio should require public schools to teach the Success Sequence as part of their curriculum,” says the Center for Christian Virtue report. “Ohio should create a public education and media campaign focused on increasing the marriage rate and promoting strong and stable marriages,” it adds.\n\nChurches should “emphasize marriage and family,” underscore the “value of a faith-based marriage and family life,” and encourage couples to cast the burdens of marriage on Christ.\n\n“Couples who attend religious services together are significantly more likely to be happily and stably married,” notes Center for Christian Virtue. “Churches must routinely proclaim an inspiring vision of marriage where the beauty, goodness, power, and difficulties of marriage and family life can be shared in age-appropriate ways to the entire congregation.’\n\nThe title of “The Hope and a Future Report” comes from Jeremiah 29:11: “For I know the thoughts that I think toward you, says the Lord, thoughts of peace and not of evil, to give you a future and a hope.” The self-affirming verse has displaced the gospel message of John 3:16 as the most popular Bible verse in America.\n\nOriginally published by The Washington Stand","summary":"When it comes to family flourishing, not every state is created equal. Nine of the top 10 states with the healthiest families are conservative, according... Read More\n\n\nThe post 9 out of 10 Best States for Families Are Conservative: Study appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/02/21/9-out-of-10-best-states-for-families-are-conservative-study/","image":"https://www.dailysignal.com/wp-content/uploads/2025/02/wedding.jpg","video":null,"publish_date":"2025-02-21 14:00:00","author":"Ben Johnson,The Washington Stand","authors":["Ben Johnson","The Washington Stand"],"language":"en","category":"politics","source_country":"us","sentiment":0.441},{"id":292931832,"title":"Stephen King returns to X months after leaving ‘toxic’ site to condemn Trump and Musk","text":"Stephen King is back! Did you miss him? (Picture: Mathew Tsang/Getty)\n\nStephen King has returned to the social media site X just three months after shutting his account down.\n\nIn November 2024, the famous horror author, 77, slammed the Elon Musk-owned platform for being ‘too toxic’ and deleted a number of his tweets.\n\nKing, who famously wrote It, The Shining, and Carrie, had previously been critical of SpaceX owner Musk, 53, and current American President Donald Trump, 78.\n\nAnd it appears that President Trump and the Department of Government Efficiency head Musk are still the target of King’s ire despite the three-month hiatus.\n\nMaking his first tweets since the middle of November, he said ‘I’m baaaack! Did you miss me?’ and then followed up with another attack on Trump and Musk.\n\nThe American novelist wrote: ‘Just wanted to say that Trump is a traitorous, Putin-loving d*****t! Goes double for Elon!’\n\n He’s returned to the platform after three months away (Picture: Stephen King/X)\n\nTrump and Musk have been closely associated since the former’s victory in the November 2024 election, with Musk being described by some as Trump’s ‘right-hand man’.\n\nIn an interview broadcast on Thursday, Musk, sitting next to Trump, said he ‘loved the President’ and declared his belief that Trump is a ‘good man’.\n\n‘At this point, I have spent a lot of time with the president, and not once have I seen him do something that was mean or cruel or wrong. Not once.’\n\nKing moved over to other social media websites after leaving X, including Threads and BlueSky, where he continued to make accusations against Trump and Musk in relation to Russian President Vladimir Putin.\n\n‘You can’t call Elon Musk the President-elect, because he wasn’t elected. In fact, having been born in Pretoria, he is ineligible to become president. \n\nHe continued, arguing that Trump isn’t really in charge despite his title: ‘Nonetheless, [Musk] is running the show. You know that, but it bears repeating.’\n\nEver since his first Presidential term started in 2016, Trump has been accused by Democrats – and Democrat-voting celebrities – of having close ties to Putin and Russia.\n\n King has been critical of Donald Trump and Elon Musk in the past (Picture: REUTERS)\n\n King supported Kamala Harris’ 2024 campaign (Picture: NGAN/AFP/Getty)\n\nIn the run-up to the 2024 US Presidential election, King was a vocal supporter of former Vice President Kamala Harris’ campaign.\n\n‘Last tweet from me (probably not from the Musk-Man) before Election Day: If you love democracy, please vote for Kamala Harris.’\n\nIt’s not the first time King has come to blows with Musk on X, saying in 2022 that he would quit if the platform would charge users $20 (£16) to use a blue verification tick.\n\nAlso in 2022, the Cujo author referred to Trump as a ‘horrible President’ and a ‘horrible person,’ alleging that he ‘engaged in criminal behaviour’.\n\nIn 2016, he said that listening to Trump’s speeches made him feel like he was listening to a ‘piano falling down the stairs,’ but admitted that he had a ‘real shot’ of winning that year’s election.\n\n King originally left the platform in November 2024 and moved to Threads and BlueSky (Picture: Disney/Getty)\n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nTrump was victorious over Hillary Clinton in 2016, but lost the 2020 election to Joe Biden, starting his second term after defeating Harris in the most recent Presidential vote in 2024.\n\nKing returned to X on the eve of the release of horror film The Monkey, directed by Osgood Perkins, which is based on a 1980 short story King wrote.\n\nThe comedy horror has been celebrated by critics, with its Rotten Tomatoes score currently standing at an impressive 80% after its release.\n\nJames Bond contender Theo James stars as twins Bill and Hal in the blood-soaked film that turns deadly when the twins find their father’s old toy in the attic.\n\nWhen the trailer dropped on YouTube, Petro Kruczynski enthused: ‘It’s gonna be crazy and awesome! Pure horror film magic from Perkins.’ \n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"The novelist has been critical of Elon Musk before.","url":"https://metro.co.uk/2025/02/21/stephen-king-returns-x-months-leaving-toxic-site-condemn-trump-musk-22601514/","image":"https://metro.co.uk/wp-content/uploads/2025/02/GettyImages-2170597222-31d2.jpg?quality=90&strip=all","video":null,"publish_date":"2025-02-21 13:31:02","author":"Robert Oliver","authors":["Robert Oliver"],"language":"en","source_country":"gb","sentiment":-0.41},{"id":292910390,"title":"Rumble Stock Price Prediction: 2025, 2026, 2030","text":"Rumble, Inc. has emerged as a key player in the video platform space, positioning itself as an alternative to more traditional platforms with stricter content policies. While it has seen significant user growth, particularly around political events, its stock performance has been volatile. Investors are now focused on where Rumble’s stock might be heading over the next few years. Here’s the current state of Rumble’s stock, future predictions and whether it’s a good buy for the long term.\n\nCurrent Overview of Rumble Stock\n\nRumble Inc. (RUM) has a market capitalization of approximately $3.16 billion and is currently trading at $11.16 per share. After achieving significant milestones, including setting records for concurrent viewers during the U.S. presidential debate in 2024, Rumble's stock experienced remarkable growth, reaching new highs the same year. Over the last six months, the stock has surged by around 77%, and it has skyrocketed by more than 54% year-over-year.\n\nOne key driver of the company’s performance is its association with political events and figures. For example, Rumble’s stock tends to correlate with U.S. political events, particularly those involving figures such as President Donald Trump. The stock experienced a decline following the debate between Trump and Vice President Kamala Harris, even as Rumble set records for live viewers during the event.\n\nAnother concern for investors is the trend of insider selling. Notably, Robert Arsov, a director at Rumble, sold 27,500 shares at $5.31. Over the past year, there have been 20 insider sales and no insider purchases, signaling potential concerns about the company's stock trajectory among its leadership.\n\nMethodology for Stock Price Prediction\n\nPredicting Rumble’s future stock price involves a combination of technical analysis, fundamental analysis and expert insights:\n\nTechnical analysis: Rumble’s stock has been volatile, with significant drops in recent months. The stock is trading below key moving averages, which suggests potential bearish momentum in the short term. Price volatility, recently recorded at 6.73%, reflects this uncertain market sentiment.Fundamental analysis: Rumble has grown significantly in terms of user engagement and platform usage, particularly during politically charged events. Its revenue growth and profitability are still in question. Metrics like price-to-earnings ratios and price-to-sales ratios provide insights into whether the stock is overvalued or undervalued at its current price. The company does not pay dividends, meaning shareholders rely entirely on stock price appreciation for returns.Expert opinions: While Rumble has carved out a niche in the video platform space, analysts are divided on its long-term potential. Some believe that the platform could continue to grow as it attracts more content creators, while others are cautious due to insider selling and broader market volatility.\n\nRumble Stock Price Prediction for 2025\n\nLooking ahead to 2025, Rumble’s stock price is projected to rise to $22.36 representing a 101.10% increase from its current price of $11.16. This prediction is based on recent trends, such as increased insider selling and broader market sentiment around tech and media stocks.\n\nRumble’s focus on providing a platform for creators outside traditional social media restrictions gives it a unique position in the market. However, this niche may not translate to significant revenue growth in the short term, especially as competitors dominate the space. Volatility driven by political events could continue to weigh on the stock’s performance in 2025.\n\nRumble Stock Price Prediction for 2026\n\nBy 2026, Rumble’s stock is predicted to stabilize, with projections placing its price at $21.52, reflecting a 93.48% increase. This suggests that the stock may regain momentum, despite the ongoing challenges with monetization and user growth.\n\nInvestors should watch for developments in Rumble’s business model, particularly its ability to attract advertisers and diversify revenue streams. While the platform has seen user growth, its financial performance has yet to improve. A lack of insider buying and continued sales by major stakeholders are also key factors contributing to the bearish outlook for 2026.\n\nRumble Stock Price Prediction for 2030\n\nThe long-term outlook for Rumble’s stock is more optimistic. By 2030, the stock is expected to climb to $37.90, representing a significant 240.84% decline from its current value. This projection reflects potential long-term optimism about the company’s ability to sustain growth, maintain profitability and fend off competition in the crowded digital platform space.\n\nAlthough Rumble continues to attract users, particularly those seeking alternatives to mainstream platforms, the financial viability of its business model remains in question. Rumble could face continued challenges over the next decade without a strong, diversified revenue model or significant changes in its financial performance.\n\nAgree with these predictions? Trade futures on this stock with Plus500 in the US and CFDs internationally. Sign up now for a $200 bonus.* \n\nFrequently Asked Questions \n\n* Plus500 is a Benzinga Partner and the promotion of this offer was sponsored by the Partner. This does not impact the content at all.","summary":"The post Rumble Stock Price Prediction: 2025, 2026, 2030 by Ryan Peterson appeared first on Benzinga. Visit Benzinga to get more great content like this.\n\n\nRumble, Inc. has emerged as a key player in the video platform space, positioning itself as an alternative to more traditional platforms with stricter content policies. While it has seen significant user growth, particularly around political events, its stock performance has been volatile. Investors are now focused on where Rumble’s stock might be heading over &#8230; Continued\n\n\nThe post Rumble Stock Price Prediction: 2025, 2026, 2030 by Ryan Peterson appeared first on Benzinga. Visit Benzinga to get more great content like this.","url":"https://www.benzinga.com/money/rumble-stock-price-prediction","image":"https://cdnwp-s3.benzinga.com/wp-content/uploads/2024/10/09074842/IMG_5487-768x603.png?width=1200&height=800&fit=crop","video":null,"publish_date":"2025-02-21 13:06:26","author":"Ryan Peterson","authors":["Ryan Peterson"],"language":"en","source_country":"US","sentiment":0},{"id":292941938,"title":"McConnell’s war on Trump is far from over","text":"Kentucky’s Mitch McConnell (R), the longest-serving party leader in Senate history, announced his retirement Thursday afternoon to cheers and jeers (but \n mostly cheers). The ailing senator has spent much of the goodwill he might have acquired in his twilight years as an elder statesman on fighting his own party’s popular president.\n\n Thus far, his lonely resistance to Donald Trump has been ineffective, but don’t count the old man out just yet. He’s still very powerful. And now, he really has nothing to lose.\n\nHe may have been forced by colleagues to step down from leadership and forced by failing health to announce his coming retirement, but Mitch McConnell is still a powerful and dangerous player.\n\n The past month has not gone as McConnell planned or how he’s used to things going. When he pledged at the American Enterprise Institute’s gala to resist the president’s foreign policy agenda from inside the Senate (just one week after Trump won the popular vote), he did not envision that playing out as a lonely protest vote from the back benches.\n\n He almost always gets his way — and he rarely has to do his own dirty work. His ally Sen. Joni Ernst (R-Iowa) led the charge against Secretary of Defense Pete Hegseth. But the Republican resistance underestimated the swift and ferocious backlash. Ernst quickly backed down.\n\n Next, Sen. Thom Tillis (R-N.C.), his closest ally, secretly funneled abuse allegations against Hegseth from a disgruntled former in-law. The White House responded with a charm offensive, and Tillis caved. He didn’t have the cojones to be the fourth decisive vote after all.\n\n Then came former Rep. Tulsi Gabbard (D-Hawaii), nominated for director of national intelligence. Gabbard should have been a layup for the neocons, but when it came down to it, the president’s popularity won the day.\n\n Now comes the fight over Elbridge Colby, who has been nominated to return for the second administration as undersecretary of defense for policy. Sen. Tom Cotton (R-Ark.) has taken the lead in opposing Colby, but if the vice president’s \n public beatdown of other anti-Colby voices is any indication, the White House isn’t planning to let the Senate’s duty to “advise and consent” present as the power to control the executive branch.\n\n The Republican resistance imagines it has that power — just ask Sen. Bill Cassidy (R-La.), whose \n cringeworthy speech detailed the concessions he demanded to support Robert F. Kennedy Jr. for health and human services secretary.\n\n But McConnell isn’t finished with Trump. He failed to block the president’s nominees, but as America’s least popular senator, he still wields significant influence. As head of the subcommittee on defense appropriations, he controls how funds are allocated — and for what. Expect him to use that power.\n\n The Senate has surrendered many of its duties but still jealously guards appropriations. The chairwoman of the full appropriations committee is Sen. Susan Collins (R-Maine), a friend of McConnell from a state Kamala Harris won by more than seven points. You can expect both to work to tie the president’s hands on funding the Ukraine war, regardless of White House foreign policy or personnel.\n\n He may have been forced by colleagues to step down from leadership and forced by failing health to announce his coming retirement, but Mitch McConnell is still a powerful and dangerous player. Remember: Trump’s first impeachment was over Ukraine funding. The \n Grim Reaper’s time in the Senate may be coming to a close, but his battle is far from over.\n\nBeltway Brief: Mitch McConnell’s secret war on Trump\n\nBlaze News: The GOP whisper campaign against Tulsi Gabbard\n\nThe Federalist:McConnell’s retirement marks the end of the disastrous Bush era\n\nSign up for Bedford’s newsletterSign up to get Blaze Media senior politics editor Christopher Bedford's newsletter.","summary":"Kentucky’s Mitch McConnell (R), the longest-serving party leader in Senate history, announced his retirement Thursday afternoon to cheers and jeers (but \n\tmostly cheers). The ailing senator has spent much of the goodwill he might have acquired in his twilight years as an elder statesman on fighting his own party’s popular president.\n\n\n\n\tThus far, his lonely resistance to Donald Trump has been ineffective, but don’t count the old man out just yet. He’s still very powerful. And now, he really has nothing to lose.\n\n\nHe may have been forced by colleagues to step down from leadership and forced by failing health to announce his coming retirement, but Mitch McConnell is still a powerful and dangerous player.\n\n\n\n\tThe past month has not gone as McConnell planned or how he’s used to things going. When he pledged at the American Enterprise Institute’s gala to resist the president’s foreign policy agenda from inside the Senate (just one week after Trump won the popular vote), he did not envision that playing out as a lo","url":"https://www.theblaze.com/columns/opinion/mcconnells-war-on-trump-is-far-from-over","image":"https://www.theblaze.com/media-library/mcconnells-war-on-trump-is-far-from-over.jpg?id=56565443&width=1200&height=600&coordinates=0%2C85%2C0%2C86","video":null,"publish_date":"2025-02-21 12:50:32","author":"Christopher Bedford","authors":["Christopher Bedford"],"language":"en","category":"politics","source_country":"US","sentiment":-0.323},{"id":292915446,"title":"Has the Imperial Presidency Arrived?","text":"I've always enjoyed movies and TV shows about parallel universes, where the protagonists somehow enter another world that looks just like the real one but is fundamentally different and usually quite twisted. Perhaps my favorite of the genre is The Man in The High Castle, where the alternative universe is one in which the Nazis triumphed in World War II. It's a great way to explore ideas and think about history.\n\nAlong those lines, let's say some weird vortex blows in from the, er, Gulf of America and we suddenly find that instead of losing the election, Kamala Harris won a solid victory. Democrats control both houses of Congress and the Supreme Court has a progressive majority. We also find that the Democratic base has a cult-like commitment to the former vice president and the media are acting like lapdogs. It's preposterous (except for the media part), but we're talking science fiction.\n\nInstead of governing in the typical misguided way that every presidential administration has operated in the post-war era, President Harris decides to echo the approach of Real World President Donald Trump and govern by edict. Spare me the \"whataboutism.\" Yes, I know that all presidents have abused their executive-order authority, have defied the Constitution's clear words, and have used the administrative state to advance some dubious ends.\n\nBut there's little question that Trump is taking the concept of the imperial presidency to its apogee. The term refers to the vast expansion of presidential authority—and the process whereby a president uses supposed national-security emergencies to justify far-reaching policies that evade the scrutiny of Congress and the courts. Everyone has done it. George W. Bush used the War on Terror to justify everything. Barack Obama used the financial crisis as an excuse.\n\nBut the situation is more perilous in our current dystopian world. First, Trump is more brazen than anyone since FDR in exerting presidential muscle. Second, some in the Trump orbit suggest the courts have no check on the executive branch. Third, the self-appointed defenders of the Constitution (conservatives) no longer are complaining about these power grabs. In the old days (before January 20), they would have publicly decried the actions of elected dictators.\n\nThe separation of powers embodies the essence of our Constitution. \"The Framers' experience with the British monarchy informed their belief that concentrating distinct governmental powers in a single entity would subject the nation's people to arbitrary and oppressive government action,\" explains the official congressional website. Former Chief Justice William Rehnquist rightly said \"the creation of an independent constitutional court…is probably the most significant contribution the United States has made to the art of government.\"\n\nApparently, this reflects a dying art. While I agree with some of Trump's stated goals in slashing the federal behemoth, it's crucial that such efforts—and I do believe most of these current efforts are flashes in the pan or attempts to replace civil servants with MAGA loyalists—follow proper legal procedures. Perhaps Trump's most blatantly unconstitutional action was his attempted abolition of birthright citizenship. Hint: One cannot change the Constitution by executive order. Fortunately, the courts have so far blocked this dictatorial impulse.\n\nWhat would conservatives say had Alternative Universe President Harris created new agencies by decree? And what if she threatened to defy court oversight? Toward the end of the Biden administration, the former president and Harris foolishly claimed the Equal Rights Amendment was ratified (it wasn't). People laughed. But if Harris were in charge, wouldn't conservatives hope for judicial scrutiny?\n\nYet Vice President J.D. Vance argued recently on X: \"If a judge tried to tell a general how to conduct a military operation, that would be illegal. If a judge tried to command the attorney general in how to use her discretion as a prosecutor, that's also illegal. Judges aren't allowed to control the executive's legitimate power.\" Fortunately, Trump just said that he will abide by court rulings but appeal them, so there is some hope for maintaining judicial review.\n\nIf he doesn't stick to that, why not just make the president a king and be done with it? Law professor Ilya Somin puts it more eloquently: \"If the president is able to defy or ignore court orders against him, then the executive branch would be effectively free of legal constraints…It could violate constitutional rights, usurp the authority of Congress (as Trump is trying to do with his wide-ranging assault on the spending power), and more…(W)e would no longer have a constitutionally constrained federal government, except perhaps in name only.\"\n\nOne of my oft-repeated maxims: Never support new government powers that you wouldn't trust in the hands of your enemies. Perhaps Republicans figure Democrats will never win again—and the president continues to toy with running for a third term—but that seems unlikely. In an alternative world where Harris or Gavin Newsom were president, would you be comfortable with this kind of imperial presidency?\n\nThis column was first published in The Orange County Register.","summary":"There's little question that Trump is taking the concept of the imperial presidency to its apogee.","url":"https://reason.com/2025/02/21/has-the-imperial-presidency-arrived/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/02/zumaamericasfortysix135062-scaled.jpg","video":null,"publish_date":"2025-02-21 12:30:13","author":"Steven Greenhut","authors":["Steven Greenhut"],"language":"en","category":"politics","source_country":"us","sentiment":0.3},{"id":292997824,"title":"George Clooney: 'No Rules Count Anymore' Under Trump","text":"Actor and Democrat activist George Clooney recently lamented that “no rules count anymore” under President Trump.\n\nSpeaking with the New York Times’ Maureen Dowd, Clooney said that Americans have fallen for made up narratives divorced from facts.\n\n“You take a narrative, you make it up, don’t worry about facts, don’t worry about repercussions,” Clooney said.\n\nClooney even said that the election of Trump is a backlash to the first black presidency of Barack Obama.\n\n“No rules count anymore,” Clooney added. “It’s like letting an infant walk across the 405 freeway in the middle of the afternoon. I believe that whole idea of the arc of history bending toward justice, and I know it doesn’t feel that way right now. I think there are always these pendulum swings. The first Trump election was, I believe, a result of eight years of a Black president.”\n\nClooney also criticized the previous Biden administration for its messaging.\n\n“The Biden administration was terrible at explaining that we’re a world economy, where we were actually doing better than all the other G7 countries. They were bad at telling the story because their messenger was not working at his best, to say the least,” Clooney said.\n\nGeorge Clooney engendered severe backlash after Trump defeated Kamala Harris in the election, with Democrats squarely placing the blame on him for encouraging former President Joe Biden to drop from the race. Reports later indicated that the actor felt he was being used as a “scapegoat.”\n\n“George Clooney feels he is being used as a ‘scapegoat’ in the furious blame game over who could have cost Kamala Harris the election – and will now take a step back from politics,” reported the Daily Mail.\n\nPaul Roland Bois directed the award-winning Christian tech thriller, EXEMPLUM, which has a 100% Rotten Tomatoes critic rating and can be viewed for FREE on YouTube, Tubi, or Fawesome TV. “Better than Killers of the Flower Moon,” wrote Mark Judge. “You haven’t seen a story like this before,” wrote Christian Toto. A high-quality, ad-free rental can also be streamed on Google Play, Vimeo on Demand, or YouTube Movies. Follow him on X @prolandfilms or Instagram @prolandfilms.","summary":"Actor and Democrat activist George Clooney recently lamented that \"no rules count anymore\" under President Trump.\n\n\nThe post George Clooney: &#8216;No Rules Count Anymore&#8217; Under Trump appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/02/21/george-clooney-no-rules-count-anymore-under-trump/","image":"https://media.breitbart.com/media/2025/02/GeorgeClooney-1-640x335.jpg","video":null,"publish_date":"2025-02-21 12:03:36","author":"Paul Bois","authors":["Paul Bois"],"language":"en","category":"politics","source_country":"US","sentiment":-0.147},{"id":292889634,"title":"The ‘Gulf of America’ feud is about something bigger: Trump wants to control the media | Margaret Sullivan","text":"It might seem like a small matter, just a disagreement over whether a body of water should be called one name or another.\n\nBut it’s really about much bigger things: Trump-style intimidation, a clear violation of the first amendment – and the extent to which news organizations will stick together in each other’s defense, or will comply with the powerful for the sake of their own access.\n\nEven more broadly, it is about Donald Trump’s wide-ranging effort to control the media and be able to spread propaganda and interfere with the flow of accurate information.\n\nThe disagreement started soon after the president decided unilaterally that the Gulf of Mexico was to be called the Gulf of America. The executive order was one more display of Trump’s capricious and imperious way of doing things; his first month has been a relentless exercise in chaos and norm-destruction.\n\nAfter the Associated Press, the global news organization, decided to stick with using the long-established name which makes sense to its international readership, the Trump White House determined that punishment was in order.\n\nAn AP reporter was barred from a White House press event, and since then, things have only escalated. More AP reporters barred from briefings and from the president’s plane. Access denied.\n\nWhat’s happening is ugly. In the US, the government doesn’t get to dictate the language journalists use in their stories. There’s a little thing called the first amendment to the US constitution that prohibits this. But the Trump administration, as usual, has its own – often unconstitutional and sometimes illegal – ideas.\n\nThe actions against the AP are “retribution, plain and simple, and a shameful attempt to bully the press into ideological compliance”, said Tim Richardson of PEN America.\n\nOn Thursday, the Reporters Committee for Freedom of the Press sent a letter to the White House signed by 30 news organizations, and the White House Correspondents Association is similarly registering its displeasure.\n\nBut letters – even signed by many and ever so strongly worded – are easy to ignore. The solution, if there is one, will require more forceful measures: lawsuits and journalistic solidarity that might include a widespread boycotting of White House press briefings.\n\nAfter all, compliance is a slippery slope. What happens, for example, when Trump proclaims that Ukraine is no longer Ukraine, but to be simply called Russia? Do news organizations politely accept the rewriting of history?\n\n“What do the media do then,” queried the longtime environmental journalist Andrew Revkin, “agree to those terms so they can stay in the briefing room?”\n\nWhy stop there? How about declaring by fiat that the Washington monument is now to be called the Trump monument? Why not chisel another presidential face onto Mount Rushmore and call it Mount Donald?\n\nThe great renaming has begun, and George Orwell would understand exactly what’s going on.\n\nA few days ago, a media leader I admire – Jim Friedlich, CEO of the Lenfest Institute, a non-profit organization which owns the Philadelphia Inquirer – proposed a notion that deserves serious consideration. There should be, he wrote, a “NATO for News,” in which every legitimate news organization formally pledges to defend the others. This happens now, from time to time, but Friedlich has something more deliberate in mind, he wrote in the Inquirer.\n\nAll of this is happening within a larger and quite alarming anti-press context.\n\nTrump’s sidekick Elon Musk recently fantasized about a “long prison sentence” for journalists on CBS’s 60 Minutes, which has been under fire for its (normal and conventional) editing of a pre-election interview with Kamala Harris.\n\nTrump has sued the Pulitzer Prize board for statements in defense of its awards to the Washington Post and the New York Times for their coverage of Trump’s relationship with Russia; he’s sued the Des Moines Register over a pre-election public opinion poll. And the Pentagon recently tossed eight traditional news organizations from office spaces to make room for pro-Maga outlets.\n\n“The Trump administration has decided that it will actively wield access as a tool to reshape the media landscape in its favor,” Oliver Darcy wrote in his media newsletter, Status. It surely will also use more legal threats and actions.\n\nGiven that we’re only a month into this brave new world, some unity and stiff-spined resolve are very much in order.\n\nThat won’t be easy. Getting journalists together is like herding pigeons. And no journalist wants to lose access to sources and to being where news is made. But in this era, it couldn’t be more important to push back hard.\n\nThe free press may be going down, but if so, we should go down swinging.\n\n Margaret Sullivan is a Guardian US columnist writing on media, politics and culture","summary":"The president punished the AP for choosing its own language, but that’s just the tip of the iceberg. The press must show unity\n\nIt might seem like a small matter, just a disagreement over whether a body of water should be called one name or another.\n\nBut it’s really about much bigger things: Trump-style intimidation, a clear violation of the first amendment – and the extent to which news organizations will stick together in each other’s defense, or will comply with the powerful for the sake of their own access.\n\n Continue reading...","url":"https://www.theguardian.com/commentisfree/2025/feb/21/trump-media-rename-gulf-of-mexico","image":"https://i.guim.co.uk/img/media/27a92260a1d519c7014a05fe1e110527731cac56/0_459_6882_4129/master/6882.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3B","video":null,"publish_date":"2025-02-21 12:00:36","author":"Margaret Sullivan","authors":["Margaret Sullivan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.176},{"id":292994722,"title":"Waltz: 'Hamas Has to Be Destroyed', Those Who Wanted Ceasefire Are Mad About Trump Trying to End Ukraine War","text":"On Thursday’s broadcast of the Fox News Channel’s “Ingraham Angle,” White House National Security Adviser Michael Waltz said that those who wanted a ceasefire in Gaza are “now completely opposed to President Trump being the president of peace and ending the war in Ukraine.” And “Hamas has to be destroyed.”\n\nWaltz said, “[T]he same party that has been pounding the table and waving their hands in the air for a ceasefire, demanding it, including Kamala Harris, Joe Biden, what have you, in Gaza, is now completely opposed to President Trump being the president of peace and ending the war in Ukraine.”\n\nWaltz added that there were no invasions during the first Trump term, “Putin is clearly emboldened by perceived weakness and deterred by strength. And he understands President Donald J. Trump will go toe-to-toe with him, with Xi, with Kim Jong-un, or anyone else. But President Trump also prefers diplomacy.”\n\nAfter the discussion turned to the Middle East, Waltz stated, “Hamas has to be destroyed. We’ll continue to enter into some type of negotiation to get as many hostages out, but, at the end of the day, Gaza will be ruled by Hamas no more, who has repeatedly said their full intent is to have more October 7ths, more attacks, they fully intend to continue to attack Israel if allowed to remain in place. And we stand with Israel in making sure that doesn’t happen.”\n\nLater, during an interview on NewsNation’s “On Balance,” host Leland Vittert asked, “You say Hamas has got to go. That’s only going to happen with military force. Are we to understand that…the United States supports Israel if they want to restart the war and go after Hamas or the United States is encouraging Israel to restart the war and go after Hamas?”\n\nWaltz responded, “Well, there [are] a number of options, and those discussions are ongoing. Heck, somewhere in between. Maybe some of their senior leadership sees now that they have no option, Hezbollah is not coming to save them, Iran is in a weakened state, Assad has fallen, they are completely isolated. Perhaps, they go to Iran, go to some other place. But, at the end of the day, they won’t rule Gaza. And we will certainly support Israel in that regard.”\n\nFollow Ian Hanchett on Twitter @IanHanchett","summary":"On Thursday&#8217;s broadcast of the Fox News Channel&#8217;s &#8220;Ingraham Angle,&#8221; White House National Security Adviser Michael Waltz said that those who wanted a ceasefire in Gaza are &#8220;now completely opposed to President Trump being the president of peace and ending\n\n\nThe post Waltz: &#8216;Hamas Has to Be Destroyed&#8217;, Those Who Wanted Ceasefire Are Mad About Trump Trying to End Ukraine War appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/02/21/waltz-hamas-has-to-be-destroyed-those-who-wanted-ceasefire-are-mad-about-trump-trying-to-end-ukraine-war/","image":"https://media.breitbart.com/media/2025/02/Mike-Waltz-on-Zelensky-Minerals-640x335.jpeg","video":null,"publish_date":"2025-02-21 11:21:02","author":"Ian Hanchett","authors":["Ian Hanchett"],"language":"en","category":"politics","source_country":"US","sentiment":-0.314},{"id":293080840,"title":"Former White House chief strategist Steve Bannon appears to give ‘Nazi salute’ at CPAC","text":"Steve Bannon has been accused of making a Nazi-style salute during his speech at the Conservative Political Action Conference (CPAC) in Washington DC on Thursday (20 February).\n\nDuring the speech, Bannon stated “we want Trump in ’28” – a call for Trump to run for an unconstitutional third term. Then, near the end of his speech he said “the only way we lose is if we quit” and that they will never “surrender.” He then chanted “fight, fight, fight” before giving what appeared to be a Nazi salute.\n\nHere's video of Steve Bannon doing a Sieg Heil today at CPAC. It is what it is and it's what Bannon intended. Don't let yourself be gaslit. pic.twitter.com/LDT2kU43ZV— Aaron Rupar (@atrupar) February 21, 2025\n\nBannon, 71, served as the White House’s chief strategist for the first seven months of Donald Trump’s first administration. Trump fired him after Bannon gave a candid interview to journalist Robert Kuttner, in which Bannon criticized some of his rivals and contradicted Trump’s North Korea policy.\n\nBannon now devotes the majority of his time to running his podcast, War Room, which streams to hundreds of thousands of MAGA loyalists six days a week. \n\nDuring CPAC, Bannon hosted a War Room party attended by several people wearing lederhosen and low-collared vests; one of whom, Gregory Conte, identified himself to the New York Times as a National Socialist.\n\nThe National Socialist Movement (NSM or NSM88) is a Neo-Nazi organization based in the United States.\n\n“Nazism has officially taken over the GOP”\n\nClips of Bannon’s salute quickly went viral on X and other platforms, with multiple people condemning the podcast host. Political commentator Brian Krassenstein posted on X: “Steve Bannon does a NAZI salute at the end of his CPAC speech. Someone try and convince me that he didn’t.”\n\nJoshua Reed Eakle, president of the Project Liberal organization, tweeted: “Steve Bannon, after calling for Trump to be president for life, did a Nazi salute on stage at CPAC. Nazism has officially taken over the GOP. The few remaining conservatives have a choice: either leave the party and obstruct it – or choose to be complicit.”\n\nSteve Bannon’s controversial gesture at CPAC follows a similar incident involving Elon Musk during an inauguration event in Washington DC, on Monday 20 January.\n\nTelling voters “thank you for making it happen”, in reference to Trump’s victory over Democrat Kamala Harris, Musk placed one hand on his chest before thrusting the other towards the crowd, his fingers together and palm turned down. He then turned and performed the same salute to the American flag.\n\n“My heart goes out to you,” Musk continued. “It is thanks to you that the future of civilisation is assured. Thanks to you we’re gonna have safe cities, secure borders, sensible spending. Basic stuff. And we’re gonna take DOGE to Mars.”\n\nSharing a clip of the gesture, Democratic strategist Sawyer Hackett alleged: “Our new co-president Elon Musk gives a Nazi salute on day one of Trump presidency.”\n\nIn response on his social media platform, X/ Twitter, Musk reshared a post from 2022 where he proclaimed that he would no longer vote Democrat and was waiting for the party’s “dirty tricks”.\n\nAlongside the post, he wrote: “Frankly, they need better dirty tricks. The ‘everyone is Hitler’ attack is so tired.”\n\nIn another post, Musk reshared one X user asking: “Can we retire the calling people a Nazi thing?” to which the tech billionaire responded: “Yeah exactly”, with a yawning emoji.\n\nBannon has yet to publicly address to the “Nazi salute” allegations or respond to multiple requests for comment from various news publications, including Newsweek.","summary":"Steve Bannon has been accused of making a Nazi-style salute during his speech at the Conservative Political Action Conference (CPAC) in Washington DC on Thursday (20 February). During the speech, Bannon stated &#8220;we want Trump in &#8217;28&#8221; &#8211; a call for Trump to run for an unconstitutional third term. Then, near the end of his speech he [&#8230;]\n\n\nThe post Former White House chief strategist Steve Bannon appears to give &#8216;Nazi salute&#8217; at CPAC appeared first on PinkNews | Latest lesbian, gay, bi and trans news | LGBTQ+ news.","url":"https://www.thepinknews.com/2025/02/21/steve-bannon-nazi-salute-heil-cpac/","image":"https://www.thepinknews.com/wp-content/uploads/2025/02/a812a60cf14a4644477239542f868ddc.jpg","video":null,"publish_date":"2025-02-21 11:01:27","author":"Hilary Mitchell","authors":["Hilary Mitchell"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.083},{"id":292869276,"title":"Florence Pugh Dazzles on the Runway at the Harris Reed Show in London, Plus Kate Hudson, Ewan McGregor and More","text":"Model Actress \n\n Florence Pugh shines in a striking black gown on the runway of the Harris Reed show during London Fashion Week on Feb. 20.\n\n In the Hot Seat \n\n Ewan McGregor grins while filming The Graham Norton Show with Kate Hudson, Naomie Harris, Chris O'Dowd, and Self Esteem (not pictured) in London on Feb. 20.\n\n Strut Her Stuff \n\n A smiley Kate Hudson steps out in feathers and leather for dinner in London on Feb. 19.\n\n Bag of Tricks \n\n Awkwafina has fiery red hair and turquoise eyeshadow as she hefts a red stocking on the set of The Man with the Bag in N.Y.C. on Feb. 20.\n\n Sidewalk Style \n\n Edward Burns arrives at the Today show in New York City on Feb. 20 to chat about his new film Millers in Marriage.\n\n Jenna Dewan rocks a glamorous red gown while out in Los Angeles on Feb. 19.\n\n L.A. Lady \n\n Jennifer Garner keeps it casual in a sweater, jeans and shades while out for lunch in Los Angeles on Feb. 19.\n\n Suited for the Stage \n\n Paul Anka performs during his All The Hits: His Way Tour in Fort Lauderdale, Florida, on Feb. 19.\n\n Couple on the Carpet \n\n Lily Anne Harrison and Peter Facinelli match in black at The Unbreakable Boy premiere in New York City on Feb. 19.\n\n All Business \n\n Tim Daly, actor and president of The Creative Coalition, sits during the National Arts Advocacy Summit in Las Vegas on Feb. 13.\n\n Networking Chat \n\n WNBA star Sabrina Ionescu speaks at a special device distribution event in Oakland, California, on Feb. 13.\n\n Well-Crooned \n\n Jonathan Groff performs with Valeria Yamin, Christine Cornish and Julia Grondin at the Hell's Kitchen piano bar So & So's in New York City.\n\n Do the Can-Can \n\n Real Housewives of Miami's Guerdy Abraira hosts An Evening of Hydration & Libations with Icelandic Glacial at Loews Miami Beach in Florida during SOBE Wine & Food Festival.\n\n That's Our Olivia Benson! \n\n Mariska Hargitay sports a puffer on the set of Law & Order: SVU in New York City on a chilly Feb. 19.\n\n Family Outing \n\n Zoe Saldaña and her husband of 12 years Marco Perego arrive at the 10th Annual Filming Italy Los Angeles Festival with their kids Cy, Bowie, both 10, and Zen, 8, on Feb. 19.\n\n Whole Lotta Red \n\n Ayo Edebiri and Juliette Lewis glow together on the red carpet of the Opus premiere in Los Angeles on Feb. 19.\n\n Timeless Leading Man \n\n Harrison Ford steps out for the season 2 premiere of 1923 in Los Angeles on Feb. 19.\n\n Heart to Hearts \n\n Naomi Ackie, Mark Ruffalo and Steven Yeun are showing the love at the Mickey 17 press conference in Seoul, South Korea, on Feb. 20.\n\n Style Superstar \n\n Colman Domingo looks dapper (as usual!) at the 16th annual African American Film Critics Association Awards in Beverly Hills, California, on Feb. 19.\n\n Rising Star \n\n Malcolm Washington speaks at the African American Critics Association Awards in Beverly Hills, California, on Feb. 19.\n\n It Suits Her \n\n Amber Ruffin carries a mini handbag to the AAFCA Awards in Beverly Hills, California, on Feb. 19.\n\n Think Pink \n\n Also at the AAFCA Awards, Aunjanue Ellis-Taylor and Kym Whitley pop in pink in Beverly Hills, California, on Feb. 19.\n\n Lean and Green \n\n John Malkovich shows off a bobblehead version of himself at the Opus premiere in Los Angeles on Feb. 19.\n\n Talk that Talk Show \n\n Anthony Mackie appears on The Jennifer Hudson Show in Burbank, California, on an episode airing Feb. 20.\n\n She's an Icon, She's the Moment \n\n Kylie Minogue commands the crowd at Rod Laver Arena in Melbourne, Australia, on Feb. 20.\n\n Broadway, Baby \n\n Kelsie Watts and Joey Fatone celebrate her casting in Six: The Musical at a dinner in New York City on Feb. 19.\n\n Wingardium Leviosa! \n\n Ariana Madix casts a spell with a wand at the opening night performance of Harry Potter and the Cursed Child in Hollywood, California, on Feb. 19.\n\n Dancing Duo \n\n Derek Hough and Hayley Erbert contrast in black and white outfits at the opening night performance of Harry Potter and the Cursed Child in Hollywood, California, on Feb. 19.\n\n Gryffindor Red \n\n Also at the Harry Potter and the Cursed Child opening night performance, Rico Rodriguez beams on the carpet on Feb. 19.\n\n Be Spectacled \n\n Skylar Astin is all smiles at the opening night performance of Harry Potter and the Cursed Child in Hollywood, California, on Feb. 19.\n\n It's All Staged \n\n Damian Lewis keeps it simple in a coat and jeans at the press night for the Jamie Lloyd Company's Much Ado About Nothing in London on Feb. 19.\n\n Party People \n\n At the after party for the Jamie Lloyd Company's Much Ado About Nothing, Tom Hiddleston and his fiancée, actress Zawe Ashton, enjoy their night in London on Feb. 19.\n\n Woman in Black \n\n Katie Cassidy steps out in a skin-baring outfit and a long black coat at the 1923 premiere in Los Angeles on Feb. 19.\n\n There's a Twist \n\n Jennifer Carpenter rocks a white gown and two brooches at the 1923 season 2 premiere in Los Angeles on Feb. 19.\n\n Prints and Patterns \n\n Kate Flannery and Mary Lynn Rajskub bring florals and leopard print to the red carpet at the 1923 season 2 premiere in Los Angeles on Feb. 19.\n\n Shimmering Skin \n\n Also at the 1923 premiere in Los Angeles, Francesca Eastwood serves face on the red carpet on Feb. 19.\n\n Simple in Snakeskin \n\n The Unbreakable Boy costars Zachary Levi and Patricia Heaton attend the film's premiere in New York City on Feb. 19.\n\n Front Row View \n\n Tyga and Madelaine Petsch watch a game between the Lakers and the Charlotte Hornets in Los Angeles on Feb. 19.\n\n Put a Ring on It \n\n Kyra Sedgwick arrives in style to the Bad Shabbos premiere at the Atlanta Jewish Film Festival on Feb. 19.\n\n Music Man \n\n Rick Springfield sparkles in a sequin jacket onstage at a show in Nashville on Feb. 19.\n\n 'Pump' It Up \n\n Vanderpump Rules alumni Jax Taylor and Tom Schwartz attend the opening night premiere party for the 2025 LA Art Show on Feb. 19.\n\n Star Power \n\n Hailey Bieber steps out for dinner with husband Justin Bieber and friends on Feb. 19 in Beverly Hills.\n\n Party Time \n\n Will Smith flashes a smile while cohosting an event with Groot OTH at Gekko in Miami on Feb. 19.\n\n The Moment \n\n Tate McRae steps out for an exclusive Spotify listening party of her upcoming album So Close to What on Feb. 18 at The Living Room in L.A.\n\n Top of the Morning \n\n Tamron Hall stops by Good Morning America on Wednesday morning in New York City.\n\n Chilly Day \n\n Sarah Hyland throws on a pair of dark sunglasses while out in New York City on Feb. 19.\n\n On Top of the World \n\n Troian Bellisario takes a trip to the top of the Empire State Building to celebrate the new series On Call on Feb. 19 in New York City.\n\n What a Racket \n\n Gavin Rossdale heads to the tennis courts in Los Angeles on Feb. 19.\n\n For the Kids \n\n Kenan Thompson joins Julian Shapiro-Barnum at PS 321 in New York City for a new episode of Celebrity Substitute. \n\n To the Nines \n\n Gwendoline Christie sports a retro hairdo for the premiere of After This Death during Berlinale at Zoo Palast in Berlin on Feb. 19.\n\n Power Stance \n\n Charles Barkley, Shaboozey and Ghazi Shami join Kenny \"The Jet\" Smith at his Empire 2025 NBA All-Star Weekend party on Feb. 14 in San Francisco.\n\n Good Hair Day \n\n Xochitl Gomez rides shotgun as she celebrates the launch of the Nutrisse Ultra Color Caramelo Blonde collection by Garnier on Feb. 19 in Miami.\n\n Lots to Celebrate \n\n Willam Belli, Constantine Rousouli, Aubrey Shea, Kit Williamson, Briana Venskus, Laith Ashley and James Bland attend the premiere of Revry's Unconventional at Renberg Theatre in L.A. on Feb. 10.\n\n Broadway Bound \n\n George Clooney is out and about in New York City on Feb. 18 ahead of his Broadway debut in Good Night, and Good Luck next month.\n\n Power Couple \n\n Ashanti and Nelly bring date night to the L.A. premiere of No Address at DGA Theater Complex on Feb. 18.\n\n Old Friends \n\n Lana Condor and Noah Centineo have a To All the Boys I've Loved Before reunion at the SAG Awards Spotlight Dinner hosted by Chef David Chang on Feb. 18 in L.A.\n\n Royal Encounter \n\n King Charles greets the crowd following a visit to Injury Studies at the Imperial College London's White City Campus on Feb. 19 in London.\n\n Dynamic Duo \n\n Angela Bassett and Robert De Niro pose together at the world premiere of Zero Day on Feb. 18 at The Plaza Hotel in New York City. \n\n Shimmer and Shine \n\n Claire Danes shimmers at Tuesday's premiere of Zero Day at The Plaza Hotel in New York City on Feb. 18.\n\n Leading Lady \n\n Margaret Qualley sports a buttoned-up look for the premiere of Blue Moon at the Berlinale on Feb. 18 in Berlin.\n\n Classic Style \n\n SAG Awards Ambassador Sofia Carson is giving Old Hollywood glam for Tuesday's SAG Awards Spotlight Dinner at Majordomo in Los Angeles.\n\n Theater Buff \n\n Jonathan Bailey is in his theatre era as he poses following the press night performance of Richard II at The Bridge Theatre in London on Feb. 18.\n\n Special Guest \n\n Mikey Madison stops by The Jennifer Hudson Show in Burbank, California for an episode airing on Feb. 19.\n\n Premiere Outing \n\n Matthew Broderick sports a pop of purple at the premiere of Zero Day at The Plaza Hotel in New York City on Feb. 18.\n\n Feeling Blue \n\n Andrew Scott rocks blue for the premiere of Blue Moon on Feb. 18 during the Berlinale.\n\n Monochrome Moment \n\n Benedict Cumberbatch attends the premiere of Blue Moon during the Berlinale on Feb. 18 in Berlin.\n\n Ladies' Night \n\n Connie Britton and Carla Gugino smile together at the premiere of Zero Day on Feb. 18 in New York City.\n\n Sleek Style \n\n H.E.R. is wrapped up in a Matrix-coded jacket at the Bose and The h.Wood Group Culture Jam event during NBA All-Star Weekend on Feb. 15 in San Francisco.\n\n By Your Side \n\n Tom Riley and Lizzy Caplan are hand-in-hand at the world premiere of Zero Day on Feb. 18 in New York City.\n\n High Fashion \n\n Rose Byrne gives us a cloak moment at the premiere of Blue Moon during Berlinale on Feb. 18 in Berlin.\n\n City Nights \n\n James Marsden celebrates the premiere of Zero Day on Feb. 18 in New York City.\n\n On the Go \n\n Halle Berry rocks pinstripes and lace during an outing in New York City on Feb. 18.\n\n Man of the Hour \n\n Ethan Hawke plays with patterns at the premiere of Blue Moon during the Berlinale on Feb. 18 in Berlin.\n\n Picture Perfect \n\n Jackie Tohn poses is houndstooth at the SAG Awards Spotlight Dinner on Feb. 18 in L.A.\n\n Flower Power \n\n Emily Osment adds a pop of pink to her look for Tuesday's SAG Awards Spotlight Dinner at Majordomo in L.A.\n\n Good to Go \n\n Alex Cooper attends the \"Date Night With Daddy\" event at Avalon Hollywood on Feb. 13 in L.A.\n\n Model Behavior \n\n Brooks Nader is on the move in all-black in L.A. on Feb. 18.\n\n With two puppies in tow, Emma Hernan sports a Barbie-inspired look while out in L.A. on Feb. 18.\n\n Party Time \n\n Jadakiss steps out for SB Nation x Sei Less x Lo Kee's The After Party in San Francisco on Feb. 15.\n\n Pink and Poised \n\n Saweetie rocks a pink ensemble as NYX Professional Makeup celebrates the the launch of NYXTAPE on Feb. 13 in West Hollywood.\n\n Strike a Pose \n\n Shaboozey smiles beneath his fluffy hat at the Bose and The h.Wood Group present Culture Jam event during All-Star Weekend on Feb. 15 in San Francisco.\n\n Milestone Moment \n\n B.J. Novak supports longtime friend Mindy Kaling at her Hollywood Walk of Fame star ceremony on Feb. 18 in Hollywood.\n\n Star Power \n\n Brenda Song and Macaulay Culkin step out together to support Mindy Kaling at her Hollywood Walk of Fame star ceremony on Tuesday in Hollywood.\n\n In Character \n\n Ethan Slater is on set with Carrie Preston while filming Elsbeth in New York City on Feb. 18.\n\n Race to the Finish \n\n Machine Gun Kelly attends F1 75 Live at The O2 Arena in London on Feb. 18.\n\n Royal Greeting \n\n Queen Camilla chats with Andrew Garfield during a reception for staff, actors and supporters of the National Theatre at Buckingham Palace in London on Feb. 18.\n\n Pedal to the Metal \n\n Sporting his red Scuderia Ferrari uniform, Lewis Hamilton waves to the crowd during F1 75 Live at The O2 Arena in London on Feb. 18.\n\n Power Duo \n\n Sabrina Ionescu and Naomi Osaka attend the Boardroom x Coinbase brunch hosted by Rich Kleiman and Kevin Durant at Terrene at 1 Hotel San Francisco on Feb. 15.\n\n Need for Speed \n\n Patrick Schwarzenegger throws on a pair of Brooks Running shoes for a run in Bangkok, Thailand on Feb. 14.\n\n Rolling Along \n\n Christian Bale hops a ride on a bike in L.A. on Feb. 17.\n\n Puppy Love \n\n Margaret Qualley holds tight to a four-legged companion at the 75th Berlinale on Feb. 18 in Berlin.\n\n Jetsetter \n\n Ariana Grande flashes a smile as she touches down in Tokyo on Feb. 18.\n\n Making the Rounds \n\n Keke Palmer is radiant at the 7th annual American Black Film Festival Honors at the SLS Hotel in L.A on Feb. 17.\n\n Music Man \n\n Shaboozey attends the Jeff Hamilton x Billionaire Boys Club All-Star after party at The Hibernia in San Francisco on Feb. 16.\n\n Surprise Visitor \n\n Kamala Harris poses backstage with Audra McDonald following a performance of Gypsy on Broadway this weekend.\n\n Going Green \n\n Yvette Nicole Brown poses at the 7th annual American Black Film Festival Honors on Feb. 17 at SLS Hotel in L.A.\n\n Under the Sea \n\n Toni Collette wears a pink sea creature themed gown for the premiere of Mickey 17 on Feb. 16 in Paris.\n\n Personal Style \n\n Tika Sumpter opts for a plunging neckline at the 7th annual American Black Film Festival Honors at the SLS Hotel in L.A. on Feb. 17.\n\n By Your Side \n\n Sunrise Coigney and Mark Ruffalo attend the premiere of Mickey 17 hand-in-hand on Feb. 16 in Paris.\n\n Pretty in Pink \n\n Rose Byrne opts for a monochrome look at the photocall for If I Had Legs I'd Kick You photocall at the 75th Berlinale on Feb. 17 in Berlin.\n\n Like Mother, Like Daughter \n\n Marla Gibbs is accompanied by her daughter Angela Elayne Gibbs for the 7th annual American Black Film Festival Honors at the SLS Hotel in L.A. on Feb. 17.\n\n All in the Details \n\n Kelly Rutherford rocks dazzling jewelry at the BAFTA 2025 Don Julio winners party on Feb. 16 in London.\n\n Dapper Dude \n\n Sans his usual facial hair, Aaron Pierre hits the red carpet at the attends the American Black Film Festival Honors at SLS Hotel in L.A. on Feb. 17 in L.A.\n\n To the Nines \n\n Anthony Mackie and Giancarlo Esposito pose together at the American Black Film Festival Honors at the SLS Hotel on Feb. 17 in L.A.\n\n On the Move \n\n Kaia Gerber throws on a cap and a jean jacket while out and about in L.A. on Feb. 16.\n\n Something to Celebrate \n\n Ethan Hawke sports a checkered shirt as he attends the 75th Berlinale on Feb. 18 in Berlin.\n\n On the Town \n\n Camila Cabello steps out for the British Vogue x GQ BAFTA party in London on Feb. 17.\n\n Signature Smile \n\n Andrew Scott smiles during a photocall for Blue Moon during the 75th Berlinale at Grand Hyatt Hotel in Berlin on Feb. 18.\n\n Golden Girl \n\n Keke Palmer tosses her hair for the perfect shot at the SNL50: The Anniversary Special afterparty in New York City on Feb. 17.\n\n Afterparty Vibes \n\n Adam Sandler and Rob Schneider are in their best black tie attire at the SNL50: The Anniversary Special afterparty in New York City on Feb. 17.\n\n What a Jewel \n\n Cynthia Erivo smiles from ear to ear at British Vogue and GQ's Celebration of Fashion and Film with Tiffany & Co. in London on Feb. 16.\n\n Premiere Queen \n\n Glen Powell heads around London in a loose tie and dress shirt after a BAFTAs party on Feb. 16.\n\n Houndstooth and Hats \n\n Jason Momoa wears a quirky hat and an eye-catching trench coat around East Village in New York City on Feb. 17.\n\n Patterns and Plates \n\n Mary Bronstein and Rose Byrne rock their own styles at the If I Had Legs I'd Kick You premiere at the 75th Berlinale International Film Festival in Berlin on Feb. 17.\n\n Pretty in Pink \n\n Jessica Chastain sparkles in a pink gown with feathers around her arms at the Dreams premiere during the 75th Berlinale International Film Festival in Berlin on Feb. 15.\n\n Champion's Mentality \n\n PlayersTV investor Chris Paul honors HCBU students at the inaugural OwnersFest and Honors in San Francisco on Feb. 16.\n\n Beat of His Own Strum \n\n Noah Kahan performs at the NBA on TNT American Express All-Star Celebration at Pier 48 in San Francisco on Feb. 15.\n\n Old Souls \n\n Sabrina Carpenter and Paul Simon sing a special rendition of \"Homeward Bound\" for SNL50 on Feb. 16 in New York City.\n\n Crowd Favorite \n\n Timothée Chalamet holds onto Kylie Jenner's hand at their seats during the 2025 BAFTAs in London on Feb. 16.\n\n Oscar Sandwich \n\n Meryl Streep, Amy Schumer and Emma Stone — who has popcorn in her dress and hands — hang out at SNL50: The Anniversary Special in N.Y.C. on Feb. 16.","summary":"From Hollywood to New York and everywhere in between, see what your favorite stars are up to","url":"https://people.com/star-tracks-friday-february-21-2025-new-celebrity-photos-updated-daily-11683843","image":"https://people.com/thmb/OxdDVSeI6AhoGQFG6lM1fo4Taf4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(677x238:679x240)/florence-pugh-022025-f034100e02a749cd943c61044429a2f7.jpg","video":null,"publish_date":"2025-02-21 11:00:00","author":"Alexandra Schonfeld,Brendan Le,Colson Thayer,Justine Fisher,Stephanie Sengwe","authors":["Alexandra Schonfeld","Brendan Le","Colson Thayer","Justine Fisher","Stephanie Sengwe"],"language":"en","source_country":"US","sentiment":0.97},{"id":292866406,"title":"EXCLUSIVE: 'Divorcing' Barack and Michelle Obama 'Already Dividing Up $70MILLION In Assets' — as 'Fallen' Power Couple 'Edge Closer to Confirming Secret Split'","text":"Barack and Michelle Obama are quietly carving up their $70million empire and edging closer to confessing that their 32-year marriage is kaput, RadarOnline.com can reveal – with their sensational split set to be the first-ever post-White House divorce between a former president and first lady.\n\nHard-nosed lawyers and mediators for the former Democratic Party power couple are attempting to come to terms and divvy up their dollars and assets before the estranged spouses come clean with the American people later this year, said sources. \n\n\"They want to have everything ironed out in advance,\" an insider with knowledge of the deliberations said. \"The last thing they want is an ugly fight with lots of nasty legal filings.\"News the romance between Barack, 63, and Michelle, 61, has hit the rocks comes as no surprise to our readers. \n\nAs previously reported, a political expert told us the pair's partnership had turned \"venomous\" following Republican Donald Trump's landslide victory over Democrat Kamala Harris in the 2024 presidential contest.\n\nAccording to sources, Barack demanded the mother of his two adult daughters – Malia, 26, and Sasha, 23 – take up the Democratic Party's standard following Joe Biden's abrupt exit from the Oval Office race in July. \n\nBut insiders said the Harvard-trained lawyer turned Tinseltown producer balked at her hubby's ultimatum and chose to further pursue her Hollywood ambitions through the duo's company Higher Ground Productions.\"They'd already been living separate lives on opposite coasts for some time, but that was no longer an option after Michelle refused to run and Barack was forced to back Kamala,\" a source added. \"That was a total humiliation for him – especially since she lost.\"\n\nAlthough Barack took to social media in January to wish his wife happy birthday in a lovey-dovey X post, sources said a public statement regarding their marriage's end will likely be Issued after the summer – as it will take months to sort out their intermingled mountain of holdings.\"They have homes in D.C., Martha's Vineyard and Chicago-plus a stock portfolio in excess of $25million,\" our insider added. \"There are also substantial revenue streams from their various media projects to divide and manage going forward.\n\n\"It's far from easy to untangle a life of three decades with someone, but maintaining the illusion of a happy and stable marriage is no longer a solution. They both are of the mind that they will be better off on their own.\"","summary":"Barack and Michelle Obama are said to be frantically dividing their $70million in assets as rumors grow they are about to announce their secret 'divorce.'","url":"https://radaronline.com/p/barack-michelle-obama-allegedly-splitting-70-million-dollars-assets-amid-divorce-rumors/","image":"https://media.radaronline.com/brand-img/S2vkIlNRy/0x0/barack-michelle-obama-splitting-70m-divorce-rumors-1739914620841.jpg","video":null,"publish_date":"2025-02-21 11:00:00","author":"Radar Staff","authors":["Radar Staff"],"language":"en","source_country":"us","sentiment":-0.037},{"id":292998444,"title":"WHOA: Politico Calls Out Dems for Doing the Switcheroo on Economy to Get Trump","text":"Politico either advertently or inadvertently just exposed the Democrats’ grotesque hypocrisy in trying to yoke President Donald Trump to the inflation-plagued economy that his predecessor's insane spending policies created. \n\n Politico State Policy reporter Liz Crampton managed to call out Democrat governors for doing an immediate switcheroo on the economy they just finished celebrating under former President Joe Biden.\n\n“Democrats spent the last four years defending the economy. Now they’re turning it into a cudgel,” Crampton scolded in her lede paragraph. “It’s a dramatic swerve for a party that insisted for years that the economy was doing well and that Joe Biden had pulled off a soft landing on inflation.” In other words, this is a textbook case of what happens when you show your hand too early.\n\nPerhaps Politico, which itself was adamant in October 2024 that Vice President Kamala Harris was riding, er, a “dream economy” into the 2024 presidential election, is still doing public relations penance for the scandal of taking millions in subscription payments by the U.S. government it was reporting on. Journalistic ethics be damned!\n\nCrampton’s reporting follows a devastating admission published in Politico Magazine February 11 that “Voters Were Right About the Economy. The Data Was Wrong.” Crampton, apparently continuing the outlet’s mea culpa trend, conceded that this deceptive maneuver was political in nature: “[f]or Democrats, the turn to hammering on the economy is in part opportunistic — the luxury of governing as the party out of power in Washington.” She continued: “But it also is an acknowledgment that voters last year were far more frustrated with rising prices than many in the party anticipated.” That’s putting it mildly, to say the least.\n\nCrampton implied that all this disingenuous economic posturing by left-wing politicos were just early attempts to kickstart their potential campaigns off for the 2028 presidential elections:\n\nDemocratic governors across the country in recent weeks have been using their state of the state addresses to empathize with Americans who say housing, groceries and child care have grown too expensive — and to blame Republicans for it one month into the president’s second term. It’s an effort by state leaders — whose class include many with 2028 presidential ambitions — to weaponize an issue that worked against Democrats in the 2024 elections.\n\nOne thing’s for sure: Despite Crampton having a red-pill moment by admitting the obvious about the left’s playbook to gaslight Americans on the disaster Bidenomics inflicted on the economy, Politico has a very long way to go before anyone takes it seriously again.","summary":"Politico either advertently or inadvertently just exposed the Democrats’ grotesque hypocrisy in trying to yoke President Donald Trump to the inflation-plagued economy that his predecessor's insane spending policies created. \n\n Politico State Policy reporter Liz Crampton managed to call out Democrat governors for doing an immediate switcheroo on the economy they just finished celebrating under former President Joe Biden.\n\n“Democrats spent the last four years defending the economy. Now they’re turning it into a cudgel,” Crampton scolded in her lede paragraph. “It’s a dramatic swerve for a party that insisted for years that the economy was doing well and that Joe Biden had pulled off a soft landing on inflation.” In other words, this is a textbook case of what happens when you show your hand too early.\n\nPerhaps Politico, which itself was adamant in October 2024 that Vice President Kamala Harris was riding, er, a “dream economy” into the 2024 presidential election, is still doing public relations penance for the ","url":"https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/02/21/whoa-politico-calls-out-dems-doing-switcheroo-economy-get","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-02/Screenshot%202025-02-21%20102331.png?itok=1HVICo6b","video":null,"publish_date":"2025-02-21 10:51:00","author":"Joseph Vazquez","authors":["Joseph Vazquez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.434},{"id":292879064,"title":"Pillars of SALT: These House Republicans from purple districts will help decide how much, if at all, a deduction in state and local taxes rises","text":"The district backed Trump in 2024, giving him 49.50% of the vote to 47.18% for his Democratic rival, then-Vice President Kamala Harris. At the same time, Rep. Young Kim (R-CA) easily won reelection, extending a congressional career that began in 2020 when she beat a Democratic incumbent.\n\nKim has largely joined fellow House Republicans in backing Trump’s agenda during his second, nonconsecutive White House term. But she is at odds with the House GOP majority on how much to raise the deduction level for state and local taxes on federal tax returns — or whether to do so at all. This SALT deduction is a major intra-Republican sticking point as lawmakers debate what legislation should look like to extend the 2017 Tax Cuts and Jobs Act, Trump’s signature domestic achievement during his first White House stint.\n\nIf nothing is done, taxes will rise on many people and businesses. So, the big question now is what should and should not be included in the eventual legislation.\n\nMost House Republicans don’t want much change in the SALT provision that became law with the TCJA. It capped SALT deductions at $10,000 for single and joint filers who itemize their income tax deductions. The SALT deduction used to be unlimited.\n\nThat’s a big problem for voters in Kim’s district, where the median household income is $127,956 and the median property value is $878,300.\n\nEconomic statistics are similar in the districts of other House colleagues vocally pushing to change the SALT deduction law, such as Reps. Andrew Garbarino (R-NY), Tom Kean Jr. (R-NJ), Nick LaLota (R-NY), and Mike Lawler (R-NY). Like Kim, each won reelection in 2024 without breaking too much of a sweat, but these GOP lawmakers in an unfavorable political environment could become major Democratic targets.\n\nThe House GOP quintet possibly has significant leverage to get its way on SALT as negotiations progress. House Republicans will have a maximum 220-215 majority over Democrats when current vacancies are filled by special elections. Until that happens in May or June, margins will be even tighter.\n\nIntra-GOP differences of opinion\n\nWhile the five House Republicans, joined by other GOP colleagues who haven’t been as vocal, want to raise the SALT tax deduction significantly, many in the majority party aren’t interested. The deduction cap was put in place during negotiations on the 2017 tax law intentionally to hit people in blue states hard. It limits a popular tax deduction that often has the biggest effects on people with high property taxes and expensive homes while living in states with Democratic tax-and-spend supermajorities in state government, such as California, Maryland, and New York.\n\nPut another way, in this view, well-off people who choose to live in profligate spending states shouldn’t get to deduct state and local taxes on their federal returns, saving large amounts of money ahead of each April 15.\n\nYet the SALT Five don’t represent deep-red districts where such a view would prevail. Take LaLota, who was first elected in 2022 in New York’s 1st Congressional District, covering eastern Long Island and the north shore of Suffolk County. In the district, which includes the Hamptons but also several decidedly middle-income and working-class communities, Trump prevailed over Harris by 54%-44%.\n\nGarbarino, in the neighboring 2nd Congressional District, covering the South Shore of Long Island, saw Trump win over Harris by 56%-42%. Trump also prevailed in New Jersey’s 7th Congressional District, taking in the southwestern New York City suburbs and exurbs, which has been represented by Kean since January 2023.\n\nThe toughest SALT Republican constituency politically is New York’s 17th Congressional District, based in the lower Hudson Valley. Lawler won reelection relatively easily, but in the presidential race, the district narrowly supported Harris over Trump, 49.91% to 49.35%. That made the district one of only three out of 435 to elect a Republican House member and not give a majority of its support to Trump.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nThese lawmakers will likely get a lot more attention in the coming weeks and months as TCJA extension talks intensify. While their House Republican colleagues push for a dash of SALT deduction increase at most, they’re seeking a shaker’s worth.\n\nIt’s a fight that will reverberate from the sunny, rolling hills of Kim’s district east and north of Los Angeles to the eastern tip of Long Island, a continent away in the constituency represented by LaLota.","summary":"ORANGE, California — Southern California voters in the eastern Orange County 40th Congressional District like President Donald Trump well enough, with one major policy exception. The district backed Trump in 2024, giving him 49.50% of the vote to 47.18% for his Democratic rival, then-Vice President Kamala Harris. At the same time, Rep. Young Kim (R-CA) [&#8230;]","url":"https://www.washingtonexaminer.com/premium/3317169/house-republicans-purple-districts-help-decide-how-much-deduction-state-and-local-taxes-rises/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/WB.Campaign.022625.webp","video":null,"publish_date":"2025-02-21 10:50:00","author":"David Mark","authors":["David Mark"],"language":"en","category":"politics","source_country":"US","sentiment":-0.45},{"id":292861182,"title":"Musk accuses Ukraine leader Zelensky of ‘feeding off the dead bodies of soldiers’ in vicious rant on X","text":"Elon Musk has accused Volodymyr Zelensky of “feeding off the dead bodies of Ukrainian soldiers” as the Trump administration continues ferociously lashing out at the Ukrainian president.\n\nThe Tesla owner wrote on his X site, without evidence, that Zelensky is “despised by the people of Ukraine” in a post that refuted Kyiv’s claims that the president has a 57 per cent approval rating. Earlier this week Trump had claimed that the Ukraine leader had an approval rating of ‘4 per cent’.\n\n“If Zelensky was actually loved by the people of Ukraine, he would hold an election. He knows he would lose in a landslide, despite having seized control of ALL Ukrainian media, so he canceled the election,” the tech billionaire wrote. \n\n“In reality, he is despised by the people of Ukraine, which is why he has refused to hold an election,” he continued. “I challenge Zelensky to hold an election and refute this. He will not.\n\n“President Trump is right to ignore him and solve for peace independent of the disgusting, massive graft machine feeding off the dead bodies of Ukrainian soldiers,” he added, appearing to echo Trump’s accusation that he wants to use the war to keep foreign aid coming into Ukraine.\n\nThe war of words first erupted on Tuesday, after Trump said Ukraine should “never have started” the war with Russia, before Ukraine’s president accused him of being clouded by misinformation sowed by Russia. Trump later said Zelensky was a “dictator” who had “better move fast or he is not going to have a Country left”.\n\nMusk’s post also vowed to “fix” X’s Community Notes feature, after accusing “governments and legacy media” of gaming the crowd-sourced fact-checking feature.\n\nHis comments came in response to a post from an anonymous X account, taking issue with the fact that the polling quoted by Mr Zelensky had been published by the Kyiv International Institute of Sociology. \n\nThe post claimed that “U.S. intelligence” suggests the Ukrainian leader only has four percent support, a differential the poster claimed was because the institute was funded by the U.S. Agency for International Development (USAID), the foreign aid agency that Musk has repeatedly claimed without evidence is a “criminal organization.”\n\nThe sociology institute has in fact received past support from USAID, an agency Musk’s company Starlink also once collaborated with in Ukraine.\n\nOn Thursday Musk took to the stage with Argentinian president Javier Milei at the Conservative Political Action Conference, where he held up a chainsaw - replicating a previous stunt by Milei to represent the cuts he planned to government spending.\n\nTrump and Musk have been accused of playing into Russia’s heavily distorted narrative of its invasion of the country. Their comments represent the growing distance between Ukraine and the U.S., which has begun negotiating over the war with Russia without Ukraine, including a high-level meeting this week in Saudi Arabia.\n\nThe US president’s claim that Zelensky started the war with Russia, despite the reality of Moscow’s illegal invasion of Ukraine in February 2022, prompted European leaders to reiterate their support for Ukraine’s president. It was in the same press conference that he stated the four per cent figure.\n\nZelensky responded: “We have evidence that these figures are being discussed between America and Russia. That is, President Trump... unfortunately lives in this disinformation space.” \n\nExperts, including those at the sociology institute, have found that Zelensky has greater than majority support, with a recent survey finding that 57 percent of Ukrainians trusted the president.\n\nKeith Darden, an American University professor who studies Ukraine, told CNN the private institute is considered “the best and most reliable survey organization in Ukraine,” and its findings are quoted in U.S. and Ukrainian media.\n\nProfessor Olga Onuch of The University of Manchester, who regularly conducts survey work in Ukraine, including alongside the sociology institute, has said Trump and Musk’s claims do not reflect the leader’s current support in Ukraine.\n\n“Trump’s claim is not only factually incorrect, but also irresponsible and anti-democratic – Zelensky remains a fairly popular political leader in Ukraine,” she said in an interview with the university’s website. “Spreading misinformation about his legitimacy directly aids Kremlin propaganda and undermines the Ukrainian people’s right to determine their own future.”\n\nZelensky said on Wednesday that claims he’s a dictator are “coming from Russia.”\n\n“If anyone wants to replace me right now, then it just isn’t going to happen,” he said at a news conference. “I wish Trump’s team had more truth. Because none of this is having a positive effect on Ukraine.” \n\nIndeed, Russian leaders have praised the White House, with Russian Foreign Minister Sergei Lavrov saying that Trump “understands our position.”\n\n“A Dictator without Elections, Zelenskyy better move fast or he is not going to have a Country left.’ If you'd told me just three months ago that these were the words of the US president, I would have laughed out loud,” former Russian president Dmitry Medvedev wrote on X. “@realDonaldTrump is 200 percent right. Bankrupt clown…”\n\nUkrainian and international leaders expressed their support for Zelensky after the claims from Trump and Musk, and argued the White House is playing into Putin’s hands.\n\n“We may like Zelensky, or we may not. We may scold him, or we may praise him. We may condemn his actions, or we may applaud them. Because he is OUR president, as he is,” Borys Filatov, mayor of the city of Dnipro, wrote on Facebook. “It makes no difference whether he is bad or not. And no lying creature, neither in Moscow, nor in Washington, nor anywhere, has the right to open his mouth against him.”\n\nFormer Lithuanian foreign minister Gabrielius Landsbergis told The Washington Post the White House’s stance sounds like a “handout” prepared by Lavrov.\n\nFollowing Trump’s comments, UK Prime Minister Keir Starmer affirmed his position that Zelensky is the country’s \"democratically elected leader,” and argued it is \"perfectly reasonable to suspend elections during wartime as the U.K. did during World War II.” Britain did not hold elections between 1935 and 1945 because of the Second World War.\n\nUkraine declared martial law in 2022 when Russia invaded, and the country’s laws prevent it from holding elections when in this emergency status. \n\nThere’s little chance the country could hold a free and representative election in its current state, given that Russia occupies nearly a fifth of the country, millions of Ukrainians have fled the nation, and tens of thousands of citizens are deployed to the frontlines.\n\nInternational observers noted it is Russia that is the true dictatorship, not Ukraine.\n\n\"We have a fairly straightforward and clear position on this: President Zelensky was legitimately elected in free, fair and democratic elections,\" EU spokesman Stefan de Keersmaecker told reporters this week.\n\n\"Ukraine is a democracy, Putin's Russia is not.\"\n\nVladimir Putin has ruled Russia for the past quarter-century, and has engineered changes to the constitution to remain in power until at least 2036. His political opponents are routinely jailed or even killed, such as Alexei Navalny and Boris Nemtsov.\n\nOthers took issue with Musk’s intention to change Community Notes, a popular fact-checking feature.\n\n“The entire point of the community notes system is that it's independent of the personal views of the people running this platform,” Shayan Sardarizadeh, from the BBC’s Verify team, wrote on X. “If you start tampering with the system because you personally dislike some notes, then how could users continue to trust it?”\n\nThe Independent has contacted X for comment.\n\nMusk, who has long framed himself as a champion of online free speech, has touted Community Notes as an effective tool to maintain factual discourse on X without resorting to top-down speech guidelines.\n\n“Community Notes aims to help all people better understand issues discussed in posts, including people who may hold different viewpoints,” the company’s website reads. “Contribute in a way that even those who may disagree with you might find helpful and respectful. Avoid hateful, derogatory, or inflammatory language.”\n\nAs The Independent has reported, in practice, Musk’s commitment to free speech and fact-based discussion only goes so far. \n\nThe billionaire has called for a boycott of Wikipedia in protest at a change to his page regarding his alleged Nazi salute at the Trump inauguration, and he frequently traffics in inaccurate, unsourced, or fully untrue claims on his own X account. This week he said that journalists working on CBS News’s 60 Minutes “deserve a long prison sentence” because of edits to an interview with Kamala Harris that industry insiders say were routine.\n\n“He is the world’s leading free speech hypocrite,” Seth Stern, director of advocacy at the Freedom of the Press Foundation, recently told The Independent. “And his actions with respect to Wikipedia are further evidence of that.","summary":"Musk also threatened changes to Community Notes on X as Trump administration has sought to falsely portray Ukrainian president as a ‘dictator’","url":"https://www.independent.co.uk/news/world/americas/us-politics/elon-musk-x-ukraine-trump-zelensky-b2702216.html","image":"https://static.independent.co.uk/2025/02/19/13/07/SEI239777834.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/g61sGECO-OhrQWqOm.mp4","publish_date":"2025-02-21 10:26:43","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.284},{"id":292852554,"title":"Expert believes that Trump has high chances of success in Ukrainian settlement","text":"WASHINGTON, February 21. /TASS/. US President Donald Trump is highly likely to succeed in resolving the Ukrainian crisis, according to Colonel Richard Black (retired), a former senator in the Virginia state legislature, who spoke to TASS.\n\n\"Trump will quickly end the war in Ukraine,\" Black noted, expressing his belief that the US president views Ukraine \"as a minor player with an illegitimate, unelected president at the helm.\" He highlighted that Vladimir Zelensky has contributed to the spread of misinformation about Russia, propagated by representatives of the US Democratic Party, and that he \"badly miscalculated\" by supporting Kamala Harris in her presidential campaign against Trump.\n\n\"Zelensky's foolish attempt to influence the U.S. presidential election will cost Ukraine dearly now,\" Black emphasized. According to him, Trump considers Zelensky a \"dictator\" with a support rating of 4% and holds him responsible for initiating the conflict. Black advised Zelensky \"to move quickly to secure peace, or he risks losing his country.\"\n\n\"President Trump initiated peace talks after a 90-minute phone call with President Putin,\" Black remarked. In this context, discussions have begun in Saudi Arabia. \"Discussions are rapidly moving toward establishing new boundaries for Ukraine,\" Black stated. He also suggested that Ukraine \"will be required to withdraw from Kursk, while Russia will retain all the territories it currently occupies.\"\n\nBlack underscored that Moscow has made it clear that the presence of NATO peacekeepers in Ukraine is unacceptable. \"France and Great Britain seem anxious to insert troops into Ukraine, perhaps hoping to revive the conflict when the time was right, just as they once did with the failed Minsk peace accords.\"\n\n\"He [Trump] intends for the war to end once and for all. There is little doubt that he will succeed,\" Black concluded.\n\nNegotiations in Saudi Arabia\n\nOn February 18, Russian and American delegations convened in Riyadh for 4.5 hours of discussions. The Russian delegation included Foreign Minister Sergey Lavrov, Presidential Aide Yury Ushakov, and Kirill Dmitriev, CEO of the Russian Direct Investment Fund (RDIF). The U.S. delegation comprised Secretary of State Marco Rubio, National Security Adviser Mike Waltz, and Special Envoy for the Middle East Steven Witkoff.\n\nAccording to Ushakov, the delegations engaged in serious discussions covering all intended issues, including the alignment of positions between Russia and the U.S., as well as communication regarding Ukraine. Lavrov described the conversation with Washington’s representatives as very constructive, stating that both Russia and the United States had agreed to expedite the appointment of ambassadors in their respective capitals. The State Department noted that Lavrov and Rubio agreed to establish negotiating groups focused on Ukraine and on future cooperation regarding issues of mutual geopolitical interest.","summary":"\"Trump will quickly end the war in Ukraine,\" Colonel Richard Black noted, expressing his belief that the US president views Ukraine \"as a minor player with an illegitimate, unelected president at the helm\"","url":"https://tass.com/world/1916967","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-02-21 10:10:55","author":"Tass","authors":["Tass"],"language":"en","source_country":"RU","sentiment":0.094},{"id":292852580,"title":"Trump holds Black History Month event as some agencies skip recognition after anti-DEI order","text":"President Donald Trump marked Black History Month at the White House on Thursday by making an appearance at a celebratory reception with a surprise guest, golf legend Tiger Woods, while calling out other athletes in attendance and marveling at the size of the crowd. Trump also announced he planned to bring Alice Johnson, a prison reform advocate whom he pardoned in 2020, into his administration to work on clemency issues. The White House's Black History Month reception preserved a tradition, but it comes in the wake of Trump issuing a wide-ranging executive order ending the federal government's diversity, equity and inclusion programs has disrupted its observance elsewhere. Today, we pay tribute to the generations of Black legends, champions, warriors and patriots who helped drive our country forward to greatness. And you really are great, great people, Trump said. Trump didn't mention his anti-DEI crusade in as he addressed hundreds of guests in a reception in the East Room, though he did make a brief reference of the The New York Times' 1619 Project, which highlights the lasting consequences of slavery in America. Trump objected to the project during his first term, and in response created a commission to promote so-called patriotic education dubbed the 1776 Commission. The last administration tried to reduce all of American history to a single year, 1619. But under our administration, we honor the indispensable role black Americans have always played in the immortal cause of another day, 1776, Trump said. We like 1776. Trump has called DEI programs discrimination and pushed to eradicate diversity programs from the government, directed that DEI workers eventually be laid off and exerted similar pressure on the private sector to shift to an exclusive focus on merit. The sweeping effort has sown discord and confusion across federal agencies, which have variously interpreted the order to limit how they can acknowledge race in history and culture or report demographic data on race and gender. Joining Trump were Black political figures and activists who have been his vocal supporters. Invited guests, according to a White House official, included Republican Sen. Tim Scott of South Carolina; Republican Rep. John James of Michigan; Alveda King, a niece of civil rights leader Martin Luther King Jr.; Herschel Walker, the football legend who is Trump's choice as U.S. ambassador to the Bahamas; and prison reform advocate Alice Johnson, whom he pardoned in 2020. Other invited guests included figures from sports and entertainment, including former ESPN host Sage Steele; former NFL player Jack Brewer; and rap stars Kodak Black, Lil Boosie and Rod Wave, according to the official, who was not authorized to speak publicly and spoke on condition of anonymity. In the wake of his executive order, the Defense Department issued guidance declaring identity months dead and said that working hours would no longer be used to mark cultural awareness months such as Black History Month, Women's History Month and National Disability Employment Awareness Month. That seemed to clash with a National Black History Month proclamation signed the same day by Trump, which called for public officials, educators, librarians, and all the people of the United States to observe this month with appropriate programs, ceremonies, and activities. While the White House has issued its position, agencies of the government have discretion on whether to continue to recognize Black History Month, according to the official. On Feb. 1, the first day of Black History Month, Transportation Secretary Sean Duffy announced that his department will no longer participate in celebrations based on immutable traits or any other identity-based observances. And in a diplomatic cable, Secretary of State Marco Rubio said the agency's removal of DEI policies would dovetail with eliminating our focus on political and cultural causes that are divisive at home and deeply unpopular abroad. The administration has issued a deadline to schools and universities to eliminate diversity initiatives or risk losing federal money. Major corporations have backtracked on DEI policies in hiring, promotion and workplace culture in recent months, with many citing potential legal challenges from the administration. Black History Month has been recognized by every U.S. president since 1976, including Trump during his first term. Black History is American history. And similar to the story of our nation, it is a story of strength, resilience, and dogged perseverance, said CJ Pearson, a national co-chair of the Republican National Committee's youth advisory council. Pearson, who is Black, has been an outspoken defender of Trump against Black civic leaders, civil rights advocates and Democrats who lambast the president as racist. President Trump's anti-DEI policies aren't promoting racism but what they are doing is manifesting the dream of the great Martin Luther King, Jr.: a nation where one isn't judged by the color of their skin but instead by the content of their character, said Pearson, who will attend the White House event. Other Black Republicans aren't so sanguine about the administration's current course or what it portends for the GOP's nascent inroads with Black voters or other communities of color. Trump can build upon the coalition he pulled together in November with Blacks and Asians and Hispanics and young folks, said Raynard Jackson, a Republican strategist. But if they leave it the way it stands right now, Trump is going to destroy the very coalition he so marvelously brought to the table in November. To Jackson, DEI is a catch-all for liberal policies that are unrecognizable from the original intent of civil rights laws meant to promote the social and economic progress of Black Americans. But in removing and denigrating the policies, Jackson said, the White House risked being labeled as discriminatory by offering no alternative framework for how disadvantaged communities can get ahead. How do you have diversity without it being a mandated bean-counting situation? Jackson asked. They've done a masterful job at telling me what they're against. I'm waiting to hear what they're for. During the 2024 campaign, Trump tried to reach Black voters through in-person events in Atlanta, Chicago and New York. His campaign courted Black celebrities and media personalities to boost his message. Trump's Black conservative allies, including Rep. Byron Donalds, R-Fla., conducted roundtables at Black barbershops and bus tours through majority-Black cities. But Trump also frequently denigrated Black communities in his pitch and made claims that pitted voters of color against immigrants, who he said were taking Black jobs and Hispanic jobs. The efforts to boost support among Black voters seemed to have some success. He won a larger share of Black voters than he did in 2020, particularly among young Black men, according to AP VoteCast, a nationwide survey of more than 120,000 voters in the 2024 election. Overall, about 16% of Black voters supported Trump in November, while about 8 in 10 voted for Democrat Kamala Harris. But that represented an improvement for Trump from 2020, when only 8% of Black voters backed him and about 9 in 10 went for Democrat Joe Biden.","summary":"President Donald Trump celebrated Black History Month at the White House, announcing Alice Johnson's appointment and expressing gratitude to Black leaders. His anti-diversity executive order, which challenges DEI programs, caused mixed reactions. While the White House promotes equality, Trump's policies face scrutiny.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-holds-black-history-month-event-as-some-agencies-skip-recognition-after-anti-dei-order/articleshow/118448496.cms","image":"https://img.etimg.com/thumb/msid-118448517,resizemode-4,width-1200,height-900,imgsize-177714,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-02-21 10:09:36","author":null,"language":"en","source_country":"in","sentiment":0.231}]}