{"offset":0,"number":50,"available":327,"news":[{"id":333586776,"title":"RFK Jr’s Proposed Menu Overhaul at Popular Breakfast Chain Sparks Outrage Among Fans","text":"America’s largest coffee chain is set to ‘further MAHA’ its menu, Robert F Kennedy Junior has said.\n\nStarbucks CEO Brian Niccol told the HHS secretary he was planning to change its recipes, during a meeting on Tuesday, which the coffee chain described as ‘productive’.\n\nThe specific changes were not revealed, but Niccol has previously said he wants his chain’s drinks to contain less sugar and to include health-promoting ingredients — potentially including protein powder.\n\nRevealing the meeting on X, RFK Jr said he was ‘pleased to learn’ that Starbucks menus ‘already avoid artificial dyes, artificial flavors, high fructose corn syrup, artificial sweeteners and other additives’.\n\nLast week, the chain revealed it was testing a sugar-free vanilla latte topped with protein banana cold foam, and earlier this year it removed sugar from its matcha powder — after which sales of the drink spiked 40 percent. \n\nThe chain has also dropped the 80-cent surcharge on its nondairy milks — which they said was to improve customer experience.\n\nStarbucks is the largest coffee chain in the US, with nearly 17,000 stores nationwide — although it has seen sales decline recently.\n\nIts proposed changes come amid a ‘MAHA-isation’ of America’s food supply, with major corporations rushing to remove additives and artificial dyes from their products to fall more in line with the new administration’s Make America Healthy Again initiative.\n\nA spokesperson for Starbucks described the meeting between RFK Jr and the chain’s CEO as ‘productive’.\n\nThey added: ‘At Starbucks, we believe choice should come with confidence. \n\n‘Our diverse menu of high-quality foods and beverages empowers customers to make informed nutritional decisions, with transparency on ingredients, calories and more.’\n\nRFK Jr’s supporters were quick to react angrily to the move, however, accusing the HHS Secretary of ‘propping up’ a big corporation and saying Starbucks’ move was ‘too little, too late’.\n\nOne commenter on X said: ‘Sir. Why are you doing this? There are 81 grams of sugar in Starbucks’ most popular drink.\n\n‘Cool they’re not using dyes, or high fructose corn syrup, I’m happy about that. But, this is not what we’re here to prop up. These companies should be shamed for driving the chronic disease epidemic.’\n\nA second said: ‘Mr Kennedy, that’s all great and all, but you do realize those drinks have an enormous amount of calories, which will do more harm than dyes and sweeteners.’\n\nOthers shared the long list of ingredients in Starbucks’ staples like the sausage, cheddar and egg sandwich, which included Maltodextrin and Xanthan Gum, emulsifiers linked to a higher risk of colon cancer, and ammonium sulfate, an inorganic salt often used as a fertilizer. \n\nStarbucks has regularly faced criticism over the high calorie and sugar content of its drinks — with high consumption of these linked to weight gain.\n\nIts summer menu includes a berry iced drink called Summer Skies, which has 26 grams of sugar per 16-ounce serving, and a Summer-Berry Lemonade Refresher, which contains 33 grams of sugar in a 16-ounce serving.\n\nThe American Heart Association recommends that men consume no more than 36 grams of added sugar a day, and women no more than 25 grams per day.\n\nDuring the 2024 election, Starbucks spent more than $1.5million on political lobbying efforts, donating $11,118 to the Trump campaign, records suggest, and more than $488,000 to Democrat candidates — including $158,365 to then-vice president Kamala Harris.\n\nThe coffee behemoth is far from the only one making radical changes. \n\nEarlier this week, Kraft Heinz — the company behind Kraft Mac and Cheese and Heinz Ketchup — revealed it would remove artificial colors from its products by 2027.\n\nAnd General Mills, which produces Cheerios, also said it would banish artificial colors from its foods by the same year.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAmerica&#8217;s largest coffee chain is set to &#8216;further MAHA&#8217; its menu, Robert F&#8230;\n\n\nThis Post: RFK Jr&#8217;s Proposed Menu Overhaul at Popular Breakfast Chain Sparks Outrage Among Fans first appeared on Internewscast Journal","url":"https://internewscast.com/health/rfk-jrs-proposed-menu-overhaul-at-popular-breakfast-chain-sparks-outrage-among-fans/","image":"https://internewscast.com/wp-content/uploads/2025/06/rewrite-this-title-RFK-Jr-plans-major-menu-changes-to.jpg","video":null,"publish_date":"2025-06-20 22:09:29","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.113},{"id":333589716,"title":"Mark Cuban reveals why he passed on being 2nd in command with Kamala Harris","text":"Before the 2024 presidential election solidified into a Kamala Harris versus Donald Trump showdown, Mark Cuban considered stepping into the political arena himself, per TheSpun. The billionaire entrepreneur and former Dallas Mavericks owner commissioned a poll to see how he’d fare running as an independent. The results weren’t strong enough to sway his family or his own gut. Still, it sparked conversations that few business moguls ever find themselves in.\nCuban eventually voiced support for Harris leading up to Election Day and often took shots at Trump online. But what shocked many this week is Cuban’s claim that Harris’s team actually reached out to him to be her potential running mate.\n\nJUST IN: Mark Cuban CONFIRMS he TURNED DOWN Kamala Harris’ VP offer after her team requested vetting materials for him to be considered for VP.\n“I’m not very good as the number two person. And so if the last thing we need is me telling Kamala, you know, the president that, nah,… pic.twitter.com/Rxx2bkf4lV\n— Brandon Tatum (@TheOfficerTatum) June 20, 2025\n\nOn The Bulwark podcast with Tim Miller, Cuban revealed that the Harris campaign asked him to submit vetting materials. He declined. The reason? It wasn’t about policy. It was about fit. “I’m not very good as the No. 2 person,” Cuban said. “The last thing we need is me telling Kamala, you know, the president, that, no, that’s a dumb idea.” He added, “I’m not real good at the shaking hands and kissing babies.”\nWhy He Turned It Down\nCuban, known for speaking bluntly and thinking fast, wasn’t interested in playing second fiddle. Miller pointed out that Cuban might have brought more energy and reach to the Harris ticket than Governor Tim Walz, who was ultimately chosen. Cuban didn’t argue that point. “Obviously it would have been different,” he said. “My personality is completely different than Tim’s. My experiences, my background are completely different.”\nHe acknowledged that while his style may have stood out in a race that needed disruption, it likely would have clashed with the structure and diplomacy the role demands. “I think I’ve cut through the sh–t more directly,” he added. “I’m not a politician. And so, it would have been different, but it would have been awful.”\nMiller pushed back, suggesting Cuban’s impact could’ve been bigger than he realized. At one point, he even said Cuban might have been “better than the present situation”—a reference to the current Trump-Vance administration that swept the 2024 election.\nCould Mark Cuban have changed the outcome? That’s a question for political theorists. But it’s clear he was closer to the White House than most ever imagined.","summary":"Before the 2024 presidential election solidified into a Kamala Harris versus Donald Trump showdown, Mark Cuban considered stepping into the political arena himself, per TheSpun. The billionaire entrepreneur and former Dallas Mavericks owner commissioned a poll to see how he’d fare running as an independent. The results weren’t strong enough to sway his family or [&#8230;]\n\n\nThe post Mark Cuban reveals why he passed on being 2nd in command with Kamala Harris appeared first on ClutchPoints.","url":"https://clutchpoints.com/celebrity/mark-cuban-reveals-why-he-passed-on-being-2nd-in-command-with-kamala-harris","image":"https://wp.clutchpoints.com/wp-content/uploads/2025/06/Mark-Cuban-reveals-why-he-passed-on-being-2nd-in-command-with-Kamala-Harris.jpg","video":null,"publish_date":"2025-06-20 21:55:18","author":"Burtland Dixon","authors":["Burtland Dixon"],"language":"en","source_country":"us","sentiment":-0.286},{"id":333572586,"title":"'The View' host Ana Navarro pleads for Obama to speak out against Trump's 'American nightmare'","text":"\"The View\" co-host Ana Navarro called Friday on former President Barack Obama to publicly condemn President Donald Trump, saying we are living in \"an American nightmare\" in his second term and it was his duty to take a stand. After Sunny Hostin and Sara Haines largely defended Obama’s right to stay out of the limelight after recent media discussions about his role in the Democratic Party, Navarro pushed for Obama and other past presidents to use their platforms to fight against the Trump administration. \"In normal times, former presidents would remain quiet and not criticize or attack the current president, particularly in year one when it was the honeymoon period. Well, this isn’t the honeymoon period. It’s a nightmare. It’s an American nightmare. These are not normal times,\" she said. Navarro referenced the \"No Kings\" protests across the nation last weekend where an estimated 5 million people took to the streets to protest the president and his agenda, as Trump held a military parade in Washington, D.C., to mark the Army’s 250th birthday. JOY BEHAR HOPES TO 'ACTUALLY INFLUENCE PEOPLE'S THINKING' WITH HER CRITICISM OF THE TRUMP ADMINISTRATION \"The American people are taking it upon themselves. They’re not waiting for a leader,\" Navarro continued. \"They’re not waiting for a great White knight or a Black knight or Latino knight to drive them out of the forest into the wilderness. They're doing it upon themselves.\" Navarro said she loved that Obama was \"happy\" and enjoying life out of the political spotlight by \"making money\" and \"making movies.\" But she insisted it was his obligation to speak out against Trump for endangering the country. \"America is in danger. Our democratic values are in danger. I think if you feel that way, each and every one of us has to do everything we absolutely can,\" she said. \"Some of us have a bigger voice. Some of us have a smaller voice.\" Navarro suggested all the living presidents could come out and make a unified public declaration rebuking the sitting president. DEMOCRATIC STRATEGISTS QUESTION INFLUENCE OF OBAMA-ERA CAMPAIGN OPERATIVES IN PARTY'S FUTURE Some progressives shared their disappointment that Obama hasn’t been more outspoken in his criticism of Trump during the president's second term. \"There are many grandmas and Rachel Maddow viewers who have been more vocal in this moment than Barack Obama has,\" co-founder of the Progressive Change Institute, Adam Green, told The Atlantic in a report published earlier this month. \"It is heartbreaking,\" Green said, \"to see him sacrificing that megaphone when nobody else quite has it.\" Obama campaigned alongside former President Joe Biden before he dropped out of the race and also stumped for former Vice President Kamala Harris when she became the nominee last year. The former president spoke out against Trump in April at an event in New York, but has largely remained out of the spotlight since Trump won. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE This week in remarks in Connecticut, Obama took veiled shots at Trump but never mentioned him by name. He chided affluent liberals that they might have to go to uncomfortable places if they wanted to be truly progressive in this new era. Obama's office didn't return a request for comment. Fox News’ Hanna Panreck contributed to this report.","summary":"Ana Navarro argued former presidents like Barack Obama should break the tradition of silence, claiming America faces a crisis under President Trump that requires everyone to speak out.","url":"https://www.foxnews.com/media/the-view-host-ana-navarro-pleads-obama-speak-out-against-trumps-american-nightmare","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/06/navarro3.gif","video":null,"publish_date":"2025-06-20 20:34:28","author":"Kristine Parks","authors":["Kristine Parks"],"language":"en","category":"politics","source_country":"us","sentiment":-0.033},{"id":333568466,"title":"Byrd Bath: Senate Referee Could Overhaul ‘Big, Beautiful Bill’","text":"The “big, beautiful bill” is going through some massive changes as the Senate Parliamentarian—the chamber’s referee and rule keeper—decides on whether or not to strike provisions that Democrats claim do not belong in a budgetary bill.\n\nIt was announced Friday that Parliamentarian Elizabeth MacDonough had already nixed a number of provisions, and more are likely to be struck this coming weekend.\n\nThe “big, beautiful” budget reconciliation bill is a 10-year fiscal framework that would fulfill a number of President Donald Trump’s campaign promises, such as funding border security and extending his 2017 tax cuts.\n\nThe Senate’s Byrd Rule, established in 1985, forbids Congress from including provisions that are not primarily budgetary. \n\nThe Senate parliamentarian is essentially the referee who decides on whether or not these provisions follow Senate rules.\n\nIn order to bring a provision to be put in the “Byrd bath,” as it is colloquially known, a senator has to raise a point of order.\n\nProvisions Already Struck\n\nSenate Budget Committee Democrats announced Friday that MacDonough has already struck a few provisions from the bill.\n\nBanking provisions were particularly hard hit.\n\nAmong these was a provision to cut the Consumer Financial Protection Bureau’s funding down to zero, effectively eliminating the agency.\n\nSen. Elizabeth Warren, D-Mass., who originally proposed the bureau’s creation, applauded this move.\n\n“These proposals are a reckless, dangerous attack on consumers and would lead to more Americans being tricked and trapped by giant financial institutions and put the stability of our entire financial system at risk,” she said.\n\n“Democrats fought back, and we will keep fighting back against this ugly bill.”\n\nOne struck provision would have reduced the salaries of Federal Reserve employees, and another would have repealed Environmental Protection Agency emissions standards for vehicles.\n\nArtificial Intelligence Deregulation\n\nA provision to watch is the big, beautiful bill’s 10-year moratorium on most state regulation of artificial intelligence—which is meant to support the White House’s goal of competitiveness in AI.\n\nAfter the bill’s passage through the House, Rep. Marjorie Taylor Greene, R-Ga., who was not familiar with this provision in the 1,000-page mega-bill, said she would not have voted yes if she had known about it.\n\nSpeaker of the House Mike Johnson, R-La., however, told The Daily Signal he wanted it to stay in order to support the industry and compete with rivals such as China.\n\n“We have to be careful not to have 50 different states hyperregulating AI, because it has national security implications,” he said.\n\nGreene, however, told The Daily Signal she “will have no part of destroying state rights” to regulate industries.\n\nShe did, however, indicated it might not pass Senate Byrd Rule muster.\n\n“What I have heard is that it—the Byrd Rule—it might be taken out in the Senate,” she said. “I’ve heard that, but we’ll see if it happens. That’s what they’ve said, but it’s yet to be seen.”\n\nThe provision has proven just as controversial in the Senate, where Sen. Ed Markey, D-Mass., has filed a motion to the parliamentarian to strike it.\n\nSen. Ted Cruz, R-Texas, a supporter of the moratorium, has used his Senate Commerce Committee chairmanship to tweak it so that it will be resistant to the Byrd Rule. \n\nHe did this by tying compliance with AI deregulation to federal broadband funding. Whether or not this deregulation—a priority for the White House—survives remains to be seen.\n\nGun Rights Protections\n\nDeregulations and tax breaks for firearms will be an important issue for the parliamentarian to examine.\n\nIn May, Rep. Andrew Clyde, R-Ga., who appeared to be a last-minute holdout, managed to secure the elimination of taxes on suppressors—an important issue to him as a gun rights advocate.\n\nNow, the parliamentarian will decide whether or not this provision can stay. \n\nIf MacDonough nixes a provision that helped win the vote of a possible holdout in the House, it could be a problem for Republicans.\n\nPlanned Parenthood\n\nMacDonough will likely also be taking a close look at Republican attempts to defund abortion provider Planned Parenthood.\n\nShe ruled against similar provisions in 2017 during Republicans’ attempt to replace the Affordable Care Act\n\nIs a Parliamentarian’s Ruling Final?\n\nThe Senate parliamentarian’s rulings are something of a setback to Republicans, but they are not necessarily final.\n\nA simple option is to amend and resubmit the provision so that the parliamentarian no longer considers it in violation.\n\nThe Senate can also motion to waive the parliamentarian’s ruling, which requires 60 votes—an unlikely outcome given Republicans’ 53-seat majority and Democrats’ unanimous opposition to the bill.\n\nThere is also the option of having the presiding officer of the Senate—in this case Vice President JD Vance—choose to ignore the parliamentarian’s rulings. This would send an earthquake through Washington and shatter precedent.\n\nFor context, back in 2021, Rep. Ro Khanna, D-Calif., urged Vice President Kamala Harris to overrule MacDonough striking a $15 minimum wage provision in the American Rescue Act, a reconciliation package.\n\n“I’m sorry—an unelected parliamentarian does not get to deprive 32 million Americans the raise they deserve,” Khanna said at the time. “This is an advisory, not a ruling. VP Harris needs to disregard and rule a $15 minimum wage in order.” Harris ultimately did not pursue this.\n\nThere is also the option of removing a parliamentarian, which Senate Majority Leader Trent Lott, R-Miss., did with Parliamentarian Robert Dove in 2001.\n\nThese last two options are extremely unlikely, but they are in the Republicans’ toolbox if MacDonough does considerable damage to the main legislative vehicle for enacting Trump’s agenda.","summary":"The “big, beautiful bill” is going through some massive changes as the Senate Parliamentarian—the chamber&#8217;s referee and rule keeper—decides on whether or not to strike... Read More\n\n\nThe post Byrd Bath: Senate Referee Could Overhaul &#8216;Big, Beautiful Bill&#8217; appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/20/byrd-bath-senate-referee-could-overhaul-big-beautiful-bill/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/ThuneByrd.jpg","video":null,"publish_date":"2025-06-20 19:33:44","author":"George Caldwell","authors":["George Caldwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.336},{"id":333559486,"title":"Melinda French Gates has some words for CEOs cozying up to Trump","text":"Melinda French Gates has some thoughts on Silicon Valley's rightward turn.\"What I have seen in the last six months to a year is many people who used to say one thing, have absolutely shifted,\" the billionaire philanthropist said in an interview with Bloomberg published this week.French Gates also suggested that the tech billionaires who lined up behind President Donald Trump at his second inauguration weren't following their own values.\"Look, a democracy is made up by our beliefs and our investments and our values, and we, of all times right now, should be living those values out, not pivoting to what some comms person tells us is the right thing to do,\" she said.It's not the first time French Gates has criticized tech billionaires in recent months.In May, she said that Elon Musk — then the de facto head of the White House DOGE Office — should \"go out and actually see what's going on in the world today\" before shuttering the US Agency for International Development, or USAID.The billionaire philanthropist supported Vice President Kamala Harris during the 2024 election and has committed $1 billion to supporting women's issues and reproductive rights.\"I really want to make sure that women can step into their full power and advance in society in both the US and globally,\" French Gates later said in the Bloomberg interview. \"For a woman to have her full power, she needs to be able to voice what she thinks is true, make her own decisions about herself and her family, and have her own resources that she can decide where and how to spend them.\"","summary":"\"Many people who used to say one thing, have absolutely shifted,\" French Gates said in an interview this week.","url":"https://www.businessinsider.com/melinda-french-gates-criticizes-tech-billionaires-trump-pivot-2025-6","image":"https://i.insider.com/6855ae4285e81483682c7d00?width=1200&format=jpeg","video":null,"publish_date":"2025-06-20 19:33:13","author":"Bryan Metzger","authors":["Bryan Metzger"],"language":"en","category":"politics","source_country":"us","sentiment":0.209},{"id":333543828,"title":"Democrats Chances of Flipping Virginia as Spanberger Gets Fundraising Boost","text":"Democrat Abigail Spanberger has built up a fundraising and polling advantage over Republican Winsome Earle-Sears in Virginia's gubernatorial race.Newsweek reached out to the Spanberger and Earle-Sears campaigns for comment via email.Why It MattersVirginia's gubernatorial race will be one of the first major electoral tests for Republicans during the Trump 2.0 era. Once a major battleground, Virginia has shifted toward Democrats over the past 20 years, though Republicans have proved competitive in the state's off-year gubernatorial races.The election will measure whether Republicans can hold onto people who shifted toward President Donald Trump in 2024, including Latino, Asian American and younger voters—or whether Democrats are winning them back before the 2026 midterms, when a third of senators and all members of the House of Representatives are up for reelection.What to KnowSpanberger, a former member of Congress, is set to face off against Earle-Sears, the state's lieutenant governor, in the November race. Republican Governor Glenn Youngkin, who narrowly won four years earlier, is ineligible to run for reelection due to term limits.Spanberger raised more than $6.5 million from April to June and still has $14 million in the bank, according to data from the Virginia State Board of Elections. During that same period, Earle-Sears raised about $3.5 million with a closing balance of just under $3 million.Both were unopposed for their party's nomination. Primary elections were held on Tuesday for other offices such as lieutenant governor and attorney general. State Senator Ghazala Hashmi and former Delegate Jay Jones won the Democratic nominees for lieutenant governor and attorney general.Incumbent Republican Attorney General Jason Miyares did not face a primary challenge for his reelection. WRVA radio host John Reid was unopposed in the Republican lieutenant governor primary.Polls have shown Spanberger with a lead over Earle-Sears for the general election.A poll conducted by co/efficient for Founders Insight earlier this month showed Spanberger with a 3-point lead over Earle-Sears (46 percent to 43 percent).Spanberger was viewed favorably by 45 percent of respondents, compared to 40 percent who viewed Earle-Sears favorably. Twenty-seven percent of respondents viewed each unfavorably. Seventeen percent were unsure of how they felt about Spanberger, while 11 percent said they had not heard of her. Meanwhile, 20 percent were unsure of their feelings toward Earle-Sears, and 13 percent had never heard of her, the poll found.It surveyed 1,127 likely voters from June 8 to June 10, 2025 and had a margin of error of plus or minus 3.12 percentage points.Some polls have suggested Spanberger has a more substantial lead in the race.A Roanoke College poll found that 43 percent of respondents were planning to vote for Spanberger, compared to 26 percent leaning toward Earle-Sears. It still found that 28 percent were undecided, meaning it could narrow depending on how that sizable chunk of voters skews.An earlier Roanoke poll found Spanberger with 39 percent, with Earle-Sears receiving support from 24 percent. It surveyed 690 residents from February 17 to February 20, 2025 and had a margin of error of plus or minus 4.66 percentage points.It surveyed 609 registered voters from May 12 to May 19, 2025 and had a margin of error of plus or minus 5.3 percentage points.Virginia backed Vice President Kamala Harris by nearly six percentage points in the 2024 presidential race, a slightly stronger showing for Trump than against Biden in 2020, when he lost by about 10 points. The state also has two Democratic senators. Historically, the party that loses the presidency gets a boost in the following gubernatorial race, but how strong that may be for Spanberger could depend on Trump's approval.What People Are SayingPeyton Vogel, an Earle-Sears spokesperson, told The Associated Press: \"Clearly the Spanberger campaign needs a lot of help attempting to erase Abigail's bad voting record on issues that actually matter to Virginians. This race isn't being bought—it's being built on a message that matters.\"Veteran political scientist Larry Sabato previously told Newsweek: \"The early bet is on Spanberger but it's way too early to bet unless you have money to burn—or extra eggs to give away. Too many things can happen. If Trump is very unpopular as he was in 2017, it's bound to help Spanberger as it helped [Former Governor Ralph] Northam in 2017. Just like Youngkin was assisted by Biden's unpopularity in 2021.\"What Happens NextThe general election in Virginia is set for November 4, 2025. The Cook Political Report classifies the race as Lean Democrat, meaning it is \"considered competitive races,\" but that Spanberger \"has an advantage.\"","summary":"Democrat Abigail Spanberger is outraising Republican Lt. Governor Winsome Earle-Sears in the critical gubernatorial race.","url":"https://www.newsweek.com/democrats-chances-flipping-virginia-abigail-spanberger-fundraising-boost-2088558","image":"https://d.newsweek.com/en/full/2667985/abigail-spanberger-fundraising-boost.jpg","video":null,"publish_date":"2025-06-20 18:21:23","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.145},{"id":333543076,"title":"Four plead guilty in massive bribery scheme at agency Democrats fought to protect from DOGE","text":"The United States Agency for International Development (USAID), an agency essentially dismantled by DOGE amid complaints from Democrats that cutting waste would harm impoverished countries, is at the center of a massive bribery scandal. A federal contracting officer and three businessmen have pleaded guilty in a scheme involving bribes like cash, NBA tickets, and a country club wedding in a scandal the Department of Justice (DOJ) said was part of a $550 million scam, Fox News Chief Washington Correspondent Mike Emanuel reported Friday. Roderick Watson, 57, worked as a USAID contracting officer, according to a DOJ press release, and pleaded guilty to \"bribery of a public official.\" According to the DOJ, Watson sold his influence starting in 2013, with contractors Walter Barnes, owner of Vistant, and Darryl Britt, owner of Apprio, funneling payoffs through subcontractor Paul Young to hide their tracks. RISCH URGES 'TOP TO BOTTOM' USAID SPENDING REVIEW AFTER WASTE, FRAUD EXPOSED \"During the scheme, Britt and Barnes paid bribes to Watson that were often concealed by passing them through Young, who was the president of another subcontractor to Apprio and Vistant,\" the press release explained. \"Britt and Barnes also regularly funneled bribes to Watson, including cash, laptops, thousands of dollars in tickets to a suite at an NBA game, a country club wedding, downpayments on two residential mortgages, cellular phones, and jobs for relatives. The bribes were also often concealed through electronic bank transfers falsely listing Watson on payroll, incorporated shell companies, and false invoices. Watson is alleged to have received bribes valued at more than approximately $1 million as part of the scheme.\" THOUSANDS OF USAID TERMINATIONS TO TAKE EFFECT BY SEPTEMBER IN AGENCY'S FINAL LEG OF 'DRAWDOWN' Vistant was awarded in November 2023, as part of a joint venture, a contract worth up to $800 million with one of the focuses of that contract being to address \"a variety of issues affecting the root causes of irregular migration from Central America to the United States,\" an issue that President Joe Biden tasked then-Vice President Kamala Harris with during his presidency. Several days later, that contract was canceled after USAID published a notice that said Vistant was excluded from government contracting due to \"evidence of conduct of a lack of business honesty or integrity.\" The joint venture then successfully sued the government over being put on that exclusion list and was re-awarded the contract and given a $10,000 payment in August 2024. \"Corruption in government programs will not be tolerated. Watson abused his position of trust for personal gain while federal contractors engaged in a pay-to-play scheme,\" Acting Assistant Inspector General for Investigations Sean Bottary of the USAID Office of Inspector General (USAID-OIG) said in the press release. \"USAID-OIG is firmly committed to rooting out fraud and corruption within U.S. foreign assistance programs. Today’s announcement underscores our unwavering focus on exposing criminal activity, including bribery schemes by those entrusted to faithfully award government contracts. We appreciate our longstanding partnership with the Department of Justice in holding accountable those who defraud American taxpayers.\" CLICK HERE TO GET THE FOX NEWS APP USAID was one of the public faces and most drastic examples of DOGE's efforts to cut waste, fraud, and abuse in government, and the effort resulted in the agency's programs being cut by 83%, while the programs deemed vital were moved to the State Department. USAID's website went dark, and employees were barred from entering its headquarters on Feb. 3, while others had their work put on hold. The Trump administration then announced that all USAID direct-hire personnel would be put on administrative leave. The agency came under fire for many funding choices, including allocating $1.5 million for a program that sought to \"advance diversity, equity and inclusion in Serbia’s workplaces and business communities\" and a $70,000 program for a \"DEI musical\" in Ireland. During DOGE's sweep, it was revealed that U.S. dollars were ending up in the hands of terror-linked groups, such as funds reportedly providing \"full funding\" for al-Qaeda terrorist Anwar al-Awlaki to attend college in Colorado, Fox News Digital previously reported. As DOGE was dismantling USAID, many Democrats and media outlets blasted the cuts, claiming they would harm impoverished recipients of aid across the globe and some, including U2 frontman Bono, who said the cuts would lead to over 300,000 deaths. Several House and Senate Democrats protested outside of USAID's headquarters in early February, expressing outrage over the layoffs and cuts, The Hill reported. \"Anybody who cares about good and effective government should be concerned about the waste, fraud, and abuse in government agencies, including USAID,\" Matthew R. Galeotti, head of the Justice Department’s Criminal Division, said in the DOJ's press release. Fox News Digital's Diana Stancy and Rachel Wolf contributed to this report.","summary":"A former USAID official and three businessmen have plead guilty to their involvement in a $550 million bribery scandal, according to the Justice Department.","url":"https://www.foxnews.com/politics/four-plead-guilty-massive-bribery-scheme-agency-democrats-fought-protect-from-doge","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/02/931/523/65854b26-usaid-protest.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-20 18:00:33","author":"Andrew Miller,Mike Emanuel","authors":["Andrew Miller","Mike Emanuel"],"language":"en","category":"politics","source_country":"us","sentiment":-0.306},{"id":333542110,"title":"Trump extends TikTok sale deadline in the US yet again, leaving the whole situation feeling 'less like a ticking clock and more like a looped ringtone… political Groundhog Day'","text":"Skip to main content\n\nPC Gamer THE GLOBAL AUTHORITY ON PC GAMES\n\nSearch PC Gamer\n\nView Profile\n\nMovies & TV\n\nGaming Industry\n\nPC Gaming Show\n\nNewsletter Signup\n\nCommunity Guidelines\n\nAffiliate Links\n\nMeet the team\n\nAbout PC Gamer\n\nPC Gamer Magazine Subscription\n\nWhy subscribe?\n\nSubscribe to the world's #1 PC gaming mag\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£35.99View\n\nEssential Hardware\nPC Gaming Show\n\nDune: Awakening\n\nRecommended reading\n\nMore tariff chaos: Donald Trump pauses tariffs for most countries at the last minute but jacks them up to 125% against China, 'effective immediately,' because of their 'lack of respect'\n\nGaming Industry\nNever mind, President Trump truths on Truth Social that electronics (including from China) are still subject to tariffs\n\nYes a US court has blocked Trump's tariffs but PC hardware isn't out of the water just yet\n\nTrump administration exempts phones and most computing hardware from tariffs and then says they're not really exempt, just being lined up for a very special tariff 'bucket' of their own\n\nTrump's AI czar echoes Jen-Hsun, says China's AI models are 'maybe three to six months' behind the US—while also arguing for ever fewer AI regulations in the US\n\nGaming Laptops\nFramework is 'temporarily pausing US sales' on some of its laptops due to Trump's tariffs: 'At a 10% tariff, we would have to sell the lowest-end SKUs at a loss'\n\nHere's how US tariffs have affected PC gaming hardware, from paused shipments to new investments\n\nGaming Industry\n\nTrump extends TikTok sale deadline in the US yet again, leaving the whole situation feeling 'less like a ticking clock and more like a looped ringtone… political Groundhog Day'\n\nRich Stanton \n\n20 June 2025\n\nTrump has previously said \"I have a warm spot in my heart for TikTok.\"\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: NurPhoto via Getty Images)\n\nUS President Donald Trump has once again pushed back a deadline requiring TikTok to be sold by its Chinese owner, Bytedance. Last year the US passed a law requiring either a sale or that the app be banned. This marks the third time that Trump has extended the deadline.\n\nTrump signed the executive order yesterday, which does raise the question of whether TikTok will ever be forced into the sale: under this administration, at least. Trump did try to force TikTok's sale during his first term, in 2020, but late last year decided it was great, actually: \"I have a warm spot in my heart for TikTok, because I won youth by 34 points.\"\nTrump is here referring to TikTok's impact on the US Presidential election, which remains unclear. His claim to have won \"youth by 34 points\" has been debunked by multiple fact-checkers: Trump obviously won the election overall, but Democratic candidate Kamala Harris outperformed him among younger voters.\n\nRelated Articles\n\nMore tariff chaos: Donald Trump pauses tariffs for most countries at the last minute but jacks them up to 125% against China, 'effective immediately,' because of their 'lack of respect'\n\nNever mind, President Trump truths on Truth Social that electronics (including from China) are still subject to tariffs\n\nYes a US court has blocked Trump's tariffs but PC hardware isn't out of the water just yet\n\nAnyway. Following Trump's decision, TikTok issued this statement: \"We are grateful for President Trump's leadership and support in ensuring that TikTok continues to be available for more than 170 million American users and 7.5 million U.S. businesses that rely on the platform as we continue to work with Vice President Vance's Office.\"\n\nAll sounds very cosy. US Lawmakers had argued that TikTok posed a threat to national security, and that Bytedance could be forced to hand over data on US users to Beijing (both of which TikTok denies). The ban was first passed by Congress before being upheld by the Supreme Court: Trump extended the ban on January 20, again in April, and the third extension pushes the date for a deal or sale back to September 17. Any deal is likely to need Beijing's approval.\n\n(Image credit: Anna Moneymaker via Getty Images)\n\"[Trump's] making an extension so we can get this deal done,\" White House press secretary Karoline Leavitt told reporters. \"It’s wildly popular. He also wants to protect Americans’ data and privacy concerns on this app. And he believes we can do both at the same time.\"\nThe decision has been criticised by Democrats. \"Once again, the Trump administration is flouting the law and ignoring its own national security findings about the risks posed by a PRC-controlled TikTok,\" said Senate Select Committee on Intelligence Vice Chairman Mark Warner. \"An executive order can't sidestep the law, but that's exactly what the president is trying to do.\"\n\nThe biggest gaming news, reviews and hardware deals\nKeep up to date with the most important stories and the best deals, as picked by the PC Gamer team.\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\nWith this third delay, the Tiktok situation is now a \"deadline purgatory,\" analyst Jeremy Goldman told the AP, \"starting to feel less like a ticking clock and more like a looped ringtone. This political Groundhog Day is starting to resemble the debt ceiling drama: a recurring threat with no real resolution.\"\n\n2025 games: This year's upcoming releases\nBest PC games: Our all-time favorites\nFree PC games: Freebie fest\nBest FPS games: Finest gunplay\nBest RPGs: Grand adventures\nBest co-op games: Better together\n\nRich Stanton\n\nSenior Editor\n\nRich is a games journalist with 15 years' experience, beginning his career on Edge magazine before working for a wide range of outlets, including Ars Technica, Eurogamer, GamesRadar+, Gamespot, the Guardian, IGN, the New Statesman, Polygon, and Vice. He was the editor of Kotaku UK, the UK arm of Kotaku, for three years before joining PC Gamer. He is the author of a Brief History of Video Games, a full history of the medium, which the Midwest Book Review described as \"[a] must-read for serious minded game historians and curious video game connoisseurs alike.\"\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nMore tariff chaos: Donald Trump pauses tariffs for most countries at the last minute but jacks them up to 125% against China, 'effective immediately,' because of their 'lack of respect'\n\nNever mind, President Trump truths on Truth Social that electronics (including from China) are still subject to tariffs\n\nYes a US court has blocked Trump's tariffs but PC hardware isn't out of the water just yet\n\nTrump administration exempts phones and most computing hardware from tariffs and then says they're not really exempt, just being lined up for a very special tariff 'bucket' of their own\n\nTrump's AI czar echoes Jen-Hsun, says China's AI models are 'maybe three to six months' behind the US—while also arguing for ever fewer AI regulations in the US\n\nFramework is 'temporarily pausing US sales' on some of its laptops due to Trump's tariffs: 'At a 10% tariff, we would have to sell the lowest-end SKUs at a loss'\n\nLatest in Gaming Industry\n\nGOG now accepts donations when you buy a game, like it's a charity or something\n\nSteam adds more accessibility features and Valve says it's just the start, wants players with disabilities to provide more feedback and suggestions\n\nHideo Kojima says the Clair Obscur: Expedition 33 development team is his 'ideal' size: 'They only have like 33 team members and a dog'\n\nWhatsApp really is good, so Meta's had enough of that and is now 'monetising the periphery' with new ads that try to make it more like Instagram\n\nWarner Bros Games restructures, all the better to drown us in Batman and Harry Potter games\n\nD&D's Jeremy Crawford and Chris Perkins un-retire, change teams to Critical Role's Darrington Press after a combined 46 years at Wizards of the Coast, leaving jaws dropped\n\nLatest in News\n\nBalatro creator gets 'a taste of my own medicine' as he struggles in vain to score the game's hardest achievement\n\nLenovo might have just leaked the more powerful Legion Go 2's release date for September\n\nNo, 16 billion passwords didn't just get exposed in a mega-hack, but you should get with the program and stop reusing passwords anyways\n\nFinal Fantasy 14 is making it easier to enter its latest dungeon so you can stop spending half an hour playing 'instance gacha'\n\nDespite bankrolling Square Enix, 'cost' is somehow the reason Final Fantasy 14's newest raid (which has only been cleared 400 times in 23 days) wasn't given an easier version\n\nAMD just mentioned an as yet unreleased Ryzen X3D chip that could become the budget gaming CPU of champions\n\nHARDWARE BUYING GUIDES\nLATEST GAME REVIEWS\n\nBest Steam Deck accessories in Australia for 2025: Our favorite docks, powerbanks and gamepads\n\nBest graphics card for laptops in 2025: the mobile GPUs I'd want in my next gaming laptop\n\nBest mini PCs in 2025: The compact computers I love the most \n\nBest 14-inch gaming laptop in 2025: The top compact gaming laptops I've held in these hands\n\nBest Mini-ITX motherboards in 2025: My pick from all the mini mobo marvels I've tested \n\nSanDisk Extreme Pro 2 TB external SSD review\n\nTurtle Beach Stealth 600 (Gen 3) review\n\nGamakay TK75HE V2 review\n\nRaidou Remastered review: Not the best Atlus RPG on PC, but a fascinating artefact that's mostly fun to play\n\nGamakay x NaughShark NS68 review\n\nPC Gamer is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...","summary":"Trump has previously said \"I have a warm spot in my heart for TikTok.\"","url":"https://www.pcgamer.com/gaming-industry/trump-extends-tiktok-sale-deadline-in-the-us-yet-again-leaving-the-whole-situation-feeling-less-like-a-ticking-clock-and-more-like-a-looped-ringtone-political-groundhog-day/","image":"https://cdn.mos.cms.futurecdn.net/gjMpPNa5vA24CL2eRyUJjR.jpg","video":null,"publish_date":"2025-06-20 16:48:39","author":"Rich Stanton","authors":["Rich Stanton"],"language":"en","source_country":"us","sentiment":0.092},{"id":333580580,"title":"Sunny Hostin: 'I Feel Terrible' About Taking Down Kamala’s Campaign","text":"ABC’s Behind the Table\nJune 18, 2025\n\nBRIAN TETA: The last time we sat down for a live podcast, it was October 8th of last year. It feels like longer. But it happened to be, it was a month before the presidential election. It happened to be the day that former Vice President Kamala Harris joined our table for an interview.\n\nJOY BEHAR: Oh!\n\nTETA: It made quite a bit of news, created some viral moments. Um, I guess I'll start with Sunny.\n\nBEHAR: Sunny ruined it. It's Sunny's fault she didn't win!\n\nTETA: Sunny. We can't ignore the fact that you may have single-handedly taken down the Democratic Party - some would say democracy itself - with one question that you asked Vice President Harris about what you would do differently than President Biden, what, how a president –\n\nSUNNY HOSTIN: Do y’all remember that?\n\nAUDIENCE: Yes!\n\n[Hostin recoils]\n\nALYSSA FARAH GRIFFIN: Hard to forget.\n\nTETA: Take me back to that moment and –\n\nSARA HAINES: How hard did you think that question was gonna be?\n\nTETA: Well, did you know instantly that this was gonna be meaningful the way she answered it?\n\nHOSTIN: I knew it instantly when she answered it, which is why I asked the follow up question. ‘Is there one thing?’ You know, because I – I – I knew I – I just, I could see the sound bite and I knew what was gonna happen, but I thought it was a really fair question, and I thought it was a question that she would expect.\n\nTETA: It wasn't a gotcha question.\n\nFARAH GRIFFIN: By any means.\n\nHAINES: It shouldn’t have been a gotcha question.\n\nHOSTIN: That’s never my intention, but I think we ask tough questions because I think our viewers want to hear those answers.\n\nHOSTIN: Right? And Barbara Walters asked tough questions. And so, I just felt that that's something that she needed to do differentiate what a Harris administration would look like as opposed to a Biden administration and she didn't have the answer that I expected.\n\nI expected her answer to be something like, “We have won. We have this win, this win, this win, this win. We've been more successful than any other administration in decades, and so I intend to build on those wins. But of course, I'm gonna be different because I'm a woman of color. I'm a child of immigrants. I'm gonna – I'm a lawyer. I'm going to do things differently through the my life experience.’\n\nBut – I mean, doesn't that sound like a good answer? Like, I just assume that was the answer and then I- I didn't get that. And now Jake Tapper wrote it in his book.\n\nFARAH GRIFFIN: It's honestly in every 2024 recap book as kind of the moment, but it speaks – \n\nHOSTIN: I feel terrible.\n\nHAINES: Sunny, you’re in the history books.\n\nFARAH GRIFFIN: It speaks to how – you are in the history books.\n\nTETA: The relevance of The View.\n\nFARAH GRIFFIN: Speaks to how important this show is though. It is where presidential candidates come and make their way or they fail and don't meet the moment.\n\nTETA: Yeah, I don't really –\n\nHOSTIN: Thanks for bringing that up, Brian.\n\nTETA: No problem! Do you – Here's another question. Do you guys believe that really did change the election? I don't think so.\n\nHAINES: I don't think it was the, I think it was –\n\nHOSTIN [to the audience]: No, right?\n\nAUDIENCE: No.\n\nFARAH GRIFFIN: I think it – I think it played a role. They put so much – the Trump campaign put so much ad money behind that specific clip. And what they were trying to do is tie her to Biden's unfavorabilities, but more than that just simply the right track, wrong track of the election.\n\nSo, even people who might be kind of neutral on Biden, that – it was something like 67 percent of the country felt like the country was going the wrong way. So, they used it to say, ‘well, she's not gonna do anything different.’ It wasn't any one thing, but they use – they really were able to use it.\n\nHAINES: It was not only separating her – didn't separate her from Biden. It also was fueling the narrative like she doesn't know what she's doing, like what does she stand for? She doesn't think it and it just like gave them the commercial.\n\nHOSTIN: Thanks Sarah.","summary":"It’s been haunting her months. Just weeks before Election Day 2024, Kamala Harris fangirl and co-host of ABC’s The View, Sunny Hostin accidentally torpedoed the Democratic ticket with a simple question to distinguish herself from President Biden. During a live recording of their The View’s Behind the Table podcast on Wednesday, executive producer Brian Teta and rest of the cast poked fun at her for finally getting in the history books, as Hostin squirmed.\n\nAs NewsBusters reported at the time, Hostin’s question was simple but Harris whiffed in spectacular fashion (Click “expand”):\n\n\nHOSTIN: And he said there wasn't a single thing that he did that you could not do. What do you think would be the biggest specific difference between your presidency and a bidency -- a Biden presidency?\n\nHARRIS: Well obviously, we're two different people.\n\n(…)\n\nHOSTIN: If anything, would you have done something differently than President Biden during the past four years?\n\nHARRIS: There is not a thing that comes to mind in terms of ","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/06/20/sunny-hostin-i-feel-terrible-about-taking-down-kamalas","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-06/2025-06-20-ABC-TV-BTT-Hostin-Questioned-About-Sinking-Kamala-Campaign.jpg?itok=iyY9o7g2","video":null,"publish_date":"2025-06-20 16:33:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","source_country":"US","sentiment":-0.28},{"id":333515514,"title":"Gavin Newsom's Chances of Beating Kamala Harris in 2028","text":"California Governor Gavin Newsom faces a steep uphill battle against former Vice President Kamala Harris in a potential 2028 Democratic Presidential Primary matchup, according to a new poll.According to the latest McLaughlin and Associates poll, conducted among 1,000 voters, including 434 Democratic voters, between June 10 and June 15, Harris holds a comfortable lead over the rest of the field.As of June 25, Harris garners 30 percent support among voters, while Newsom sits at just 8 percent, trailing not only Harris but also former Transportation Secretary Pete Buttigieg (10 percent) and Senator Cory Booker (7 percent) and Representative Alexandria Ocasio-Cortez (7 percent).Newsweek has contacted representatives of Newsom and Harris for comment via email.Why It MattersNewsom and Harris have not said whether they plan to run for the White House, but have long been considered Democratic contenders for 2028.For Newsom, the low support in the poll could show that his political brand—closely associated with California's liberal policies—may not be resonating more broadly as he struggles to separate himself from Democrats like Buttigieg and Ocasio-Cortez.Following election losses across the board in 2024, the Democratic Party has gone through public infighting and struggled to unify around a clear successor at the top leading to some calls to rally behind a new generation of leadership.What To KnowNewsom's polling numbers have remained relatively flat in recent months, fluctuating between 4 percent and 8 percent in the McLaughlin and Associates Poll since February. Meanwhile, Harris has consistently polled between 29 percent and 36 percent, suggesting a solid and stable base of support.Among specific demographic groups such as moderates and voters under 55—Newsom has also lagged behind. Among moderates, he holds only 7 percent of the vote, compared to Harris's 31 percent. Among younger voters, Harris leads with 30 percent, while Newsom trails at just 8 percent.Harris also dominates key demographic segments that are crucial in Democratic primaries. She has overwhelming support among Black voters (44 percent), Hispanic voters (36 percent), and women (36 percent). Newsom polls at just 9 percent, 11 percent, and 6 percent in those groups, respectively.His strongest demographic performance is among white voters (9 percent) and men (11 percent), but even there, he is far behind Harris, who gets 25 percent of white voters and 21 percent of men.It comes as Newsom has attempted to increase public visibility in recent months, launching a podcast featuring conversations with conservative figures like Charlie Kirk and Steve Bannon, signaling an attempt to broaden his appeal beyond traditional Democratic bases. He also announced that he would sue the Trump administration over the so-called \"Liberation Day\" tariffs, which ignited stock market volatility.He has also shifted some of his rhetoric toward the political center, including proposing cuts to health care for immigrants without legal status, and revealing that he is against transgender athletes competing in women's events, both of which drew backlash from other members of his party.Despite these moves, his national profile has not surged, with some polls showing little appetite for a 2028 bid from Newsom.An Emerson College Polling/Inside California Politics/The Hill survey, conducted between April 12 and April 14 among 1,000 California registered voters, found that 59 percent of respondents said they don't think that Newsom should run for president in 2028, with 41 percent supporting a bid for the Oval Office.Meanwhile, a poll, conducted by co/efficient between May 7 and May 9 among 1,462 likely voters, found that just 2 percent of voters see Newsom as the face of the Democratic Party.The poll showed that Ocasio-Cortez is viewed by more Democratic voters as the face of the party than any other figure, with 26 percent naming her—matching the 26 percent who said \"no one\" currently holds that title.Ocasio-Cortez has not formally announced a presidential bid for 2028.In a recent interview, Newsom expressed ambivalence about a presidential bid, telling the Los Angeles Times: \"I have to have a burning why, and I have to have a compelling vision that distinguishes myself from anybody else. Without that, without both...I don't deserve to even be in the conversation.\"What Happens NextIt is not clear when presidential hopefuls will begin announcing their bids for 2028.The Democratic Primary to challenge for the White House in 2028 is likely to be a crowded field. In 2020, the last time Democrats had an open primary, more than a dozen Democrats launched White House bids.","summary":"Newsom has long been considered a potential 2028 White House contender, but his polling has remained relatively flat in recent months.","url":"https://www.newsweek.com/kamala-harris-gavin-newsom-2028-poll-2088476","image":"https://d.newsweek.com/en/full/2667866/harris-newsom.png","video":null,"publish_date":"2025-06-20 16:32:32","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","source_country":"US","sentiment":-0.034},{"id":333496066,"title":"National Republicans Commit $2 Million to Regain Virginia House as Democrats Hold Fundraising Lead","text":"Last week, the national organization dedicated to electing Republicans to state offices announced that it was committing $2 million to Republicans in the Virginia House of Delegates to use toward taking back the House majority. What will that Republican State Leadership Committee money do, and will it be enough to help overcome Democrats’ already substantial fundraising lead?\n\nAccording to the Virginia Public Access Project, Republicans raised roughly $2.2 million less than Democrats for House races in the first quarter of the year.\n\nThe Daily Signal spoke to Republican Party chair state Sen. Mark Peake, who told us that the state party was hoping to use that money to target three or four seats that it hopes to flip from the Democrats based on President Donald Trump’s electoral performance in 2024.\n\nHowever, Republicans are also faced with a Democratic Party campaign to flip 12 House seats to them, meaning Republicans will need to “play defense” for those seats, which will also cost a good deal of that money.\n\nA party insider told us that realistically, the number of seats they will have to defend is closer to six or seven, but we have already seen that the Democratic Party war chest is likely going to be much bigger than the GOP’s.\n\nRepublican Del. Kim Taylor from the 82nd District (parts of Petersburg and Prince George County) will be one of the most targeted seats by the Democrats because she won the newly redrawn district in 2023 by just 54 votes and Vice President Kamala Harris carried the district in 2024 with 51.5% of the vote.\n\n>>> Sign up for our Virginia email newsletter\n\nTaylor’s campaign has already spent the second highest amount of all House races of either party in the second quarter, only behind her opponent, Democrat Kimberly Adams. Adams has outraised Taylor 3-to-1 already this year. Two years ago, this district saw one of the top three most expensive House races in recent Virginia history, and it appears to be on track to top that, despite Taylor’s huge disadvantage in fundraising.\n\nOne veteran Virginia politician told The Daily Signal that “it’s way early to be burning through campaign money” like Taylor is, since early voting in the general election is not scheduled until September.\n\nIronically, Democrat U.S. Sens. Tim Kaine and Mark Warner have played a role in this, whether intentionally or not, when they recommended House of Delegates Minority Leader Todd Gilbert for the position of U.S. attorney for the Western District of Virginia, leading to Gilbert’s decision to step down from Republican caucus leadership while the vetting process is occurring.\n\nDel. Terry Kilgore has taken the reins of the caucus. Kilgore is who will determine the distribution of the Republican State Leadership Committee contribution.\n\nWhen contacted about that, Kilgore’s office told The Daily Signal that it wouldn’t discuss those matters, which certainly makes tactical sense. With the Democratic Party claiming to target 12 House seats, the concern is that Democrats will dictate what strategy the GOP takes.\n\nPolitical resource management has historically been a touchy business among the Virginia GOP. With a scarcity of funds, comparatively good candidates often fall prey to decisions on things like “likelihood of winning” when the party and political action committees decide where to direct money and other resources.\n\nThe “likelihood of winning” factor frequently looks at a campaign’s internal fundraising, and if the numbers aren’t meeting expectations, resources may be directed elsewhere.\n\nThat is where the fundraising numbers paint a less rosy picture for candidates like Taylor who have not had the fundraising success that a campaign like former Republican Del. Tim Anderson from Virginia Beach has had or a war chest like Republicans Carrie Coyner in Chesterfield or Amanda Batten in Williamsburg have.\n\nKilgore’s question will have to be, if they had more money, would it help them to raise more money?","summary":"Last week, the national organization dedicated to electing Republicans to state offices announced that it was committing $2 million to Republicans in the Virginia House... Read More\n\n\nThe post National Republicans Commit $2 Million to Regain Virginia House as Democrats Hold Fundraising Lead appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/20/national-republicans-commit-million-regain-virginia-house-democrats-hold-fundraising-lead/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/Virginia-elections.jpg","video":null,"publish_date":"2025-06-20 15:48:43","author":"Joe Thomas","authors":["Joe Thomas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.321},{"id":333494134,"title":"Gavin Newsom's Chances of Being 2028 Nominee Jump in Two Polls in One Week","text":"California Governor Gavin Newsom's chances of winning the 2028 Democratic primary increased in a second poll following the Los Angeles protests over President Donald Trump's immigration policies.Newsweek reached out to Newsom's team for comment via email.Why It MattersNewsom has not formally said he's planning to run in the primary, which could draw other high profile names including former Vice President Kamala Harris and former Transportation Secretary Pete Buttigieg. But he is viewed as a potential candidate by Democrats. The governor has cast himself as a foil to President Donald Trump following his return to office, and has attracted national attention over his opposition to the president's policies.Newsom and Trump have sparred over the California protests after the president federalized National Guard troops, arguing local officials were not doing enough to quell demonstrations that at times grew violent, though most protesters were peaceful. Newsom, however, said Trump sending in the National Guard only escalated the situation and cast the move as an abuse of power.Newsom sued to block the federalization, though the 9th U.S. Circuit Court of Appeals has temporarily blocked another judge's order to return the troops to Newsom's control. Newsom has earned praise from some Democrats for taking on Trump.What to KnowA McLaughlin poll released this week shows Newsom's support against other potential 2028 candidates doubling from May, though Harris and Buttigieg are still the candidates preferred by most Democrats. Eight percent said they would cast their ballot for Newsom, up from four percent in May.Harris had support from 30 percent of Democrats, while 10 percent said they planned to back Buttigieg. Newsom surpassed New Jersey Senator Cory Booker and New York Representative Alexandria Ocasio-Cortez, both of whom received 7 percent in the latest poll.The poll surveyed 1,000 general election voters from June 10 to June 15, 2025.The poll likely says more about the mood of voters than Newsom's chances, Anne Danehy, senior associate dean and associate professor of the practice at Boston University's College of Communications, told Newsweek. Democratic voters, many of whom have been frustrated by their party's approach to Trump, may be responding to Newsom \"taking an active stand against Trump,\" she said.\"Voters always like candidates that take tough stands, take tough positions and are vocal about standing up for what they believe in. It's part of the appeal with Donald Trump, honestly. He says it as it is. He doesn't sugar coat things,\" she said. \"What we saw with Newsom is that Newsom is doing the same thing. People feel like he is standing up in sharp juxtaposition to Trump.\"It's now the second public opinion survey to show Newsom's support surge.A Morning Consult poll released earlier this week showed that 11 percent of Democrats planned to back Newsom—compared to 5 percent in March. Harris and Buttigieg both saw their share of the vote decline from 36 percent to 34 percent and 10 percent to seven percent, respectively.That poll surveyed 1,000 Democrats and Democratic-leaning independents from June 13 to June 15, 2025.While Newsom's message may be resonating with Democratic voters, a challenge for him would be to show he is not a \"California liberal\" or \"coastal elite,\" attacks that Republicans are likely to throw at him if he becomes the nominee, Danehy said.He needs to show voters how he has improved peoples' lives on a personal level to counter that narrative, she said.Protests began after U.S. Immigration and Customs Enforcement (ICE) began conducting raids in Los Angeles earlier in June to fulfill Trump's promise of mass deportations. The raids are following legal directives from federal authorities, but critics have raised concerns about the treatment of migrants by federal authorities as well as the tactics used by immigration agents during the raids.Amid the protests, Trump deployed about 4,000 members of California's National Guard and the 700 U.S. Marines to assist in stopping violence, despite objections from Newsom and other local officials.What People Are SayingNewsom told The Wall Street Journal earlier in June: \"I'm not thinking about running, but it's a path that I could see unfold.\"Lakshya Jain of Split Ticket wrote on X (formerly Twitter) on June 12: \"This whole ridiculous and completely unnecessary situation in Los Angeles has been good for only one thing: Gavin Newsom's 2028 campaign.\"What Happens NextThe Democratic primaries won't be held until 2028, so plenty could change between now and then. Candidates typically start announcing presidential bids after the midterms wrap up.","summary":"California Governor's stand against President Trump over immigration protests cited as giving him a boost.","url":"https://www.newsweek.com/gavin-newsom-chances-being-2028-nominee-jump-two-polls-2088447","image":"https://d.newsweek.com/en/full/2667821/gavin-newsom-2028-primary-polls.jpg","video":null,"publish_date":"2025-06-20 15:24:55","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.017},{"id":333530280,"title":"RFK Jr plans major menu changes to America's favorite breakfast chain... and is met with fan fury","text":"RFK Jr plans major menu changes to America's favorite breakfast chain... and is met with fan fury\n\nREAD MORE: Starbucks dumps 13 coffees amid plans to streamline its menu\n\nBy LUKE ANDREWS SENIOR HEALTH REPORTER FOR DAILYMAIL.COM\n\nPublished: 15:59 BST, 20 June 2025 | Updated: 16:04 BST, 20 June 2025\n\nAmerica's largest coffee chain is set to 'further MAHA' its menu, Robert F Kennedy Junior has said.\n\nStarbucks CEO Brian Niccol told the HHS secretary he was planning to change its recipes, during a meeting on Tuesday, which the coffee chain described as 'productive'.\n\nThe specific changes were not revealed, but Niccol has previously said he wants his chain's drinks to contain less sugar and to include health-promoting ingredients — potentially including protein powder.\n\nRevealing the meeting on X, RFK Jr said he was 'pleased to learn' that Starbucks menus 'already avoid artificial dyes, artificial flavors, high fructose corn syrup, artificial sweeteners and other additives'.\n\nLast week, the chain revealed it was testing a sugar-free vanilla latte topped with protein banana cold foam, and earlier this year it removed sugar from its matcha powder — after which sales of the drink spiked 40 percent. \n\nThe chain has also dropped the 80-cent surcharge on its nondairy milks — which they said was to improve customer experience.\n\nStarbucks is the largest coffee chain in the US, with nearly 17,000 stores nationwide — although it has seen sales decline recently.\n\nIts proposed changes come amid a 'MAHA-isation' of America's food supply, with major corporations rushing to remove additives and artificial dyes from their products to fall more in line with the new administration's Make America Healthy Again initiative.\n\nPictured above is Robert F Kennedy Junior with Starbucks CEO Brian Niccol (right)\n\nSunscreens RANKED - from best buys to those to avoid at all costs...\n\n4k viewing now\n\nLisa thought itch was an allergy. But it was a common liver problem\n\n37.1k viewing now\n\nRevealed: Popular supplement GP never takes increases risk of death\n\n1.9k viewing now\n\nA spokesperson for Starbucks described the meeting between RFK Jr and the chain's CEO as 'productive'.\n\nStarbucks is training its baristas to de-escalate conflict after taking away popular perk\n\nThey added: 'At Starbucks, we believe choice should come with confidence. \n\n'Our diverse menu of high-quality foods and beverages empowers customers to make informed nutritional decisions, with transparency on ingredients, calories and more.'\n\nRFK Jr's supporters were quick to react angrily to the move, however, accusing the HHS Secretary of 'propping up' a big corporation and saying Starbucks' move was 'too little, too late'.\n\nOne commenter on X said: 'Sir. Why are you doing this? There are 81 grams of sugar in Starbucks' most popular drink.\n\n'Cool they're not using dyes, or high fructose corn syrup, I'm happy about that. But, this is not what we're here to prop up. These companies should be shamed for driving the chronic disease epidemic.'\n\nA second said: 'Mr Kennedy, that's all great and all, but you do realize those drinks have an enormous amount of calories, which will do more harm than dyes and sweeteners.'\n\nOthers shared the long list of ingredients in Starbucks' staples like the sausage, cheddar and egg sandwich, which included Maltodextrin and Xanthan Gum, emulsifiers linked to a higher risk of colon cancer, and ammonium sulfate, an inorganic salt often used as a fertilizer. \n\nStarbucks has faced regular criticism over the amount of calories in its coffee and their sugar content\n\nStarbucks has regularly faced criticism over the high calorie and sugar content of its drinks — with high consumption of these linked to weight gain.\n\nIts summer menu includes a berry iced drink called Summer Skies, which has 26 grams of sugar per 16-ounce serving, and a Summer-Berry Lemonade Refresher, which contains 33 grams of sugar in a 16-ounce serving.\n\nThe American Heart Association recommends that men consume no more than 36 grams of added sugar a day, and women no more than 25 grams per day.\n\nDuring the 2024 election, Starbucks spent more than $1.5million on political lobbying efforts, donating $11,118 to the Trump campaign, records suggest, and more than $488,000 to Democrat candidates — including $158,365 to then-vice president Kamala Harris.\n\nThe coffee behemoth is far from the only one making radical changes. \n\nEarlier this week, Kraft Heinz — the company behind Kraft Mac and Cheese and Heinz Ketchup — revealed it would remove artificial colors from its products by 2027.\n\nAnd General Mills, which produces Cheerios, also said it would banish artificial colors from its foods by the same year.\n\nShare or comment on this article:\nRFK Jr plans major menu changes to America's favorite breakfast chain... and is met with fan fury\n\nAdd comment","summary":"One of America's largest breakfast chains is set to 'further MAHA' its menu, Robert F. Kennedy Junior has said, making major changes to its decades-old recipes.","url":"https://www.dailymail.co.uk/health/article-14831843/starbucks-menu-change-maha-kennedy.html","image":"https://i.dailymail.co.uk/1s/2025/06/20/14/99569053-0-image-a-10_1750424954270.jpg","video":null,"publish_date":"2025-06-20 15:04:42","author":"Editor,Luke Andrews Senior","authors":["Editor","Luke Andrews Senior"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.264},{"id":333475486,"title":"Joy Behar hopes to ‘actually influence people’s thinking’ with her criticism of the Trump administration","text":"“The View” co-host Joy Behar said she felt an obligation to speak out about President Donald Trump’s administration on Wednesday and said she hoped to influence people’s thinking during a “Behind the Table” discussion.\n\nProducer Brian Teta asked Behar, who has been with the show for 26 years, what she likes about doing the ABC talk show and why she’s been on it for so long.\n\n“It’s because of the freedom to speak my mind, that has always been the attraction,” she responded, before talking about other parts of her career. “I like the people I work with, number one, I like everybody.”\n\n“I also feel an obligation to speak about the administration that we’re in the midst of, and I feel like we’re in a privileged position to say certain things and that we, you know, we can actually influence people’s thinking sometimes, even if it’s a little bit, that we’re in a lot of trouble in this country right now, and that I like the idea that we can say stuff that people will listen to,” she said.\n\nBehar was also asked about the many political figures she’s gotten to interview on the show and about why politicians come on the talk show.\n\n“We can show them the way they are in real life, the way they really are,” Behar said. “I’ve met Hillary Clinton many times. She’s different when she’s running for office, and she’s all scared to make a mistake. When she’s herself, she’s very funny. She should have come on ‘The View’ more, I think at that time. In fact, somebody screwed her up, somebody in her campaign said, ‘don’t go on,’ and it was a big mistake.”\n\nBehar said Clinton was a grandma, wife and mother and was much more than just someone who ran for office.\n\nThe co-hosts also talked about Sunny Hostin’s viral question posed to former Vice President Kamala Harris last year during the 2024 campaign, as Teta joked that the liberal co-host had “single-handedly taken down the Democratic Party” when Harris’ bungled answer went viral.\n\nHostin defended her question about whether Harris would have acted differently at any point during President Joe Biden’s first term, saying it was one Harris should have expected. Harris memorably said she couldn’t think of anything she’d have done differently than the unpopular Biden, and the soundbite became fodder for the Trump campaign that Harris was more of the same.\n\n“I knew it instantly when she answered it,” Hostin said during the podcast conversation, when asked by Teta if she knew it would be a viral moment. “Which is why I asked the follow-up question, ‘is there one thing?’ Because I knew, I could see the soundbite and I knew what was going to happen, but I thought it was a really fair question and I thought it was a question that she would expect.”\n\nEvery morning, the NY POSTcast offers a deep dive into the headlines with the Post’s signature mix of politics, business, pop culture, true crime and everything in between. Subscribe here!\n\nBiden appeared on the show in May for one of his first interviews since leaving the White House.\n\nThe former president blamed racism and sexism for Harris’ loss during the conversation.\n\n“I wasn’t surprised, not because I didn’t think the vice president was the most qualified person to be president,” Biden said. “She is. She’s qualified to be President of the United States of America. I was surprised because they went the route of, the sexist route, the whole route. I mean, this is a woman, she’s this, she’s that. \n\n“I mean, I’ve never seen quite as successful and a consistent campaign undercutting the notion that a woman couldn’t lead the country, and a woman of mixed race.”","summary":"Behar and her fellow 'View' co-hosts discussed the show on 'Behind the Table' podcast.","url":"https://nypost.com/2025/06/20/media/joy-behar-hopes-to-actually-influence-peoples-thinking-with-her-criticism-of-the-trump-administration/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/106824130.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/mPsYcESA-RyIcpnTz.mp4","publish_date":"2025-06-20 14:23:21","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":-0.082},{"id":333476472,"title":"Chuck Todd claims Biden's team set him up on purpose to fail at debate","text":"Chuck Todd says he’ll never be able to shake the belief that former President Joe Biden’s team purposefully set him up to fail against Donald Trump during last summer’s campaign-altering presidential debate. During the latest episode of \"The Chuck Toddcast,\" the ex-NBC anchor told The Atlantic's Mark Leibovich that he’s sure that Biden’s inner circle scheduled the first presidential debate last year in June so that the former president would look bad and the party would ditch him in time to run his replacement. \"Look, I will go to my grave believing that the debate was intentional for that,\" the host said. NEW BOOK REVEALS BIDEN'S INNER CIRCLE WORRIED ABOUT HIS AGE YEARS BEFORE BOTCHED DEBATE PERFORMANCE Biden’s disastrous performance in last summer’s presidential debate is widely seen as the death knell for the former president’s re-election campaign. Less than a month after the spectacle, where Biden looked weak and cognitively challenged, he announced his withdrawal from the campaign and endorsed then-Vice President Kamala Harris to replace him as the nominee. Biden’s cognitive decline has been under more scrutiny in recent months as CNN anchor Jake Tapper and Axios reporter Alex Thompson’s newly published book, \"Original Sin,\" alleged that members of Biden’s White House engaged in a cover-up of the president’s condition. In the clip flagged by The Daily Caller, Leibovich prompted Todd’s declaration by bringing up a previous conversation they had about some members of Biden’s inner circle using the debate as an opportunity to punch through the cover-up and show the world that Biden was unfit for office. CHUCK TODD BLAMES SCHUMER, DEMOCRATS' SILENCE ON BIDEN DECLINE FOR PARTY'S CREDIBILITY COLLAPSE The journalist mentioned \"the idea that there were actually people within the White House, within the Biden campaign who thought it would be a good thing to create some kind of daylight for the world to see what they were dealing with on a day-to-day basis.\" Todd followed up by saying that no matter what Biden’s former senior adviser Anita Dunn and campaign co-chair Jen O’Malley Dillon say, he thinks they were trying to expose his frailties. \"Anita Dunn and Jen O’Malley Dillon will deny it till they’re blue in the face, and if I were in their shoes and I did it, I’d deny it until I was blue in my face, okay?\" Todd said. \"Of course, you’d deny that,\" Leibovich agreed. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Todd added, \"It’s like whoever the hell helped Reagan delay the hostage release, okay? It’s never going to be admitted. It’s too convenient,\" referring to the January 1981 release of American hostages held by Iran, after Jimmy Carter had already lost his re-election effort to Reagan. Going back to the alleged plot to expose Biden, Todd continued, \"There was no other reason. This idea, ‘Well, we needed to shake up the race.’ In late June? Who shakes up a race in late June?\" \"They knew when the nomination was going to be and they knew they needed to deal with this with an opportunity to make a change if it was necessary,\" Todd added. \"I will always believe this.\" Reps for the former president did not immediately reply to Fox News Digital's request for comment. CLICK HERE TO GET THE FOX NEWS APP","summary":"Former &quot;Meet The Press&quot; anchor Chuck Todd said he believes Biden&apos;s team deliberately set up the disastrous debate that led to the former president&apos;s withdrawal from the 2024 election.","url":"https://www.foxnews.com/media/chuck-todd-claims-bidens-team-set-him-up-purpose-fail-debate","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/ToddBiden.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-20 14:07:37","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":-0.283},{"id":333462606,"title":"NBA legend Vlade Divac, 57, has emergency surgery after motorcycle accident","text":"BREAKING NEWSNBA legend Vlade Divac, 57, has emergency surgery after motorcycle accident\n\nREAD MORE: Indiana Pacers star Pascal Siakam caught in scary pregame ritual\n\nBy OLIVER SALT and ASSOCIATED PRESS\n\nPublished: 14:35 BST, 20 June 2025 | Updated: 14:50 BST, 20 June 2025\n\nFormer NBA center Vlade Divac underwent emergency surgery after breaking a hip in a fall from his motorcycle in Montenegro, doctors said Friday.\n\nThe accident happened Thursday on a road near the Montenegrin Adriatic Sea coast. Hospital officials said the 57-year-old Divac, who enjoyed two stints with the Los Angeles Lakers, sustained a fracture and that an artificial hip was implanted.\n\n'During the day, a surgical procedure was performed,' said Ljubica Mitrovic, a spokeswoman of the hospital in the town of Risan.\n\n'He is in a stable general and physical condition and is under a careful supervision of the medical staff.'\n\nDivac spent 16 years in the NBA after being selected by the Lakers with the 26th pick in the first round of the 1989 draft.\n\nThe 7-foot-1 player started and ended his NBA career in LA. He also played for the Charlotte Hornets and Sacramento Kings. \n\nNBA icon Vlade Divac has had emergency surgery after breaking a hip in a motorcycle accident\n\nDivac, best known for his stints with the Kings (pictured) and Lakers, is in a stable condition\n\nMAGA-hating NBA owner Mark Cuban reveals he rejected stunning offer from Kamala Harris\n\nWhile playing for Sacramento, Divac was named an All-Star for the first and only time in 2001. He later served as general manager of the Kings, who retired his No. 21 jersey.\n\nWhen he joined the Lakers in 1989, he was among the first group of European players to transfer to the NBA.\n\nDivac was also the first player born and trained outside the United States to play in over 1,000 games in the NBA. \n\nHe was elected to the Naismith Memorial Basketball Hall of Fame in 2019.\n\nDivac served two terms as head of Serbia's Olympic Committee and also spent time as an adviser to his country's deputy prime minister.\n\nCharlotte HornetsNBASacramento Kings\n\nShare or comment on this article:\nNBA legend Vlade Divac, 57, has emergency surgery after motorcycle accident\n\nAdd comment","summary":"Hospital officials said the former center, who enjoyed two stints with the Los Angeles Lakers, sustained a fracture and that an artificial hip was implanted after he fell from his motorcycle.","url":"https://www.dailymail.co.uk/sport/nba/article-14832049/nba-vlade-divac-emergency-surgery-motorcycle-accident.html","image":"https://i.dailymail.co.uk/1s/2025/06/20/14/99569893-0-image-a-41_1750426391522.jpg","video":null,"publish_date":"2025-06-20 13:50:43","author":"Associated,Editor,Oliver Salt","authors":["Associated","Editor","Oliver Salt"],"language":"en","source_country":"jp","sentiment":0.364},{"id":333463258,"title":"Democrats wrestle over chance to kill the ban on transgender care in Trump’s ‘Big, Beautiful Bill’","text":"Despite being in the minority, Democrats have a chance to remove a provision from President Donald Trump’s “One Big, Beautiful Bill” that would prevent Medicaid dollars from being used to cover gender-affirming care.’\n\nThe questions is, will they?\n\nThe issue emerges more than eight months after a 2024 election from which Democrats are still digging out and also working out their messaging about how to defend the rights of transgender people without being painted as too radical by Republicans. \n\nIn the presidential race, Trump and his associated super PACS hit Kamala Harris in ads for supporting taxpayer-funded gender transition surgeries for inmates, ending the ad by saying “Kamala is for They/Them. President Trump is for you.” \n\nRepublicans also hit Democrats in down-ballot races specifically on the subject of allowing transgender athletes to compete in women’s sports. \n\nThat might be why when The Independent asked some top Democratic senators about whether they would try to strike the language from Republicans’ bill, even some of the most liberal voices said they did not know . \n\n“I don’t know,” Sen. Chris Murphy told The Independent last week when asked if it could the strict criteria the Senate Parliamentarian would subject the bill to.\n\nSen. Patty Murray, the vice chairwoman of the Senate Appropriations Committee, simply told The Independent, “I haven’t seen the language.”\n\nMurray later clarified on Bluesky that she opposed the ban in Medicaid. \n\n“I had not seen the language but let me be clear: I support stripping out as much from the bill as Democrats can, including this ban.”\n\nBut even liberal Democrats like Sen. Elizabeth Warren dodged the question.\n\n“I haven’t seen it, “ she told The Independent last week when asked if she would raise a point of order on it. When asked if she was worried about it, she repeated, “I haven’t seen it.”\n\nThe avoidance shows how Democrats are in the position of being on the defensive on an issue where Republicans think they can win against Democrats, while at the same time defending a vulnerable population the party has long said it would support.\n\nSome Democrats have said they would support efforts to challenge the language. Sen. Tammy Baldwin of Wisconsin, who is the first openly gay person elected to the Senate, told The Independent earlier this month that she assumed Democrats would but that she had not seen the details of the legislation\n\n“What I would say substantively is that, this is, again, talking about taking away people's health care, and taking parents’ ability to decide what kind of health care their children need,” she said.\n\nThe Republican bill in the House that passed through the House Energy & Commerce Committee banned Medicaid and Children’s Health Insurance dollars from being used to provide gender-affirming care for minors. In a last-minute addition before the bill went to a vote on the floor, an amendment struck the term “for minors” from the legislation, meaning it would put in place a blanket ban on gender-affirming care for all transgender people. \n\nThe legislation would also prohibit coverage of gender transition care as an “essential health benefit” offered by health care exchanges created in the 2010 Affordable Care Act signed by former president Barack Obama. The Senate Finance Committee released the health care part of its version that is almost identical to the House version except it does not include the “essential health benefit” provision. \n\n“I obviously think these issues are private and personal,” Sen. Ron Wyden of Oregon, the top Democrat on the Finance Committee which is in charge of health care, told The Independent. \n\nRepublicans, who have only 53 seats in the Senate, plan to pass the bill through the process of budget reconciliation. That would allow them to pass the bill with a simple majority and avoid a filibuster as long as the legislation relates to the budget and federal spending. \n\nAs part of the process, the legislation goes through the “Byrd Bath,” named for late Senator Robert Byrd, where the Senate Parliamentarian determines whether parts of the legislation relate directly to the budget or are “merely incidental.” \n\nRepublican Rep. Dan Crenshaw of Texas, who sponsored the amendment, told The Independent that he believes it will comply with the rules because it saves taxpayer dollars. \n\nBut if the the Senate parliamentarian rules that part of the legislation does not comply with reconciliation rules, the majority party can still bring the amendment on the floor, but the minority party can raise a point of order. If Republicans want to waive the point of order, it would require three-fifths of the Senate, or 60 votes, vote to waive it.\n\nSen Jeff Merkley, the top Democrat on the Senate Budget Committee, said that he thought Democrats would likely challenge it.\n\n“Well, we're certainly taking a look at all of the pieces of policy that don't belong in this type of bill,” he told The Independent. “You don't put policy in there. That sure sounds like policy to me.”\n\nIt also comes after when Republicans regularly criticized Democrats in campaign advertisements about allowing transgender athletes in women’s sports. \n\nSen. Ruben Gallego of Arizona, who recently told The Dispatch that he opposes allowing transgender athletes in some women’s sports, told The Independent he thought that Democrats would challenge the Medicaid ban. \n\n“I think it's outside the boundaries of reconciliation,” Gallego told The Independent. \n\nMady Castigan, independent journalist and advocate who has published updates on the bill and urged people to call their lawmakers about it, has been pushing for people to make calls to lawmakers to oppose the bill. \n\n“I really doubt there's a ton of people calling and asking their senators to vote for this specific provision,” she said. “But I guarantee you, there's a ton more calling in to oppose it, and whenever something like that happens, you know, it definitely swings the political calculations.” \n\nBut as of right now, much of the future of the legislation is unclear because Senate Republicans have yet to release the tax and health care aspects of their bill.\n\n“I would assume so, but I haven't seen the details of it,” Sen. Tina Smith of Minnesota, who is retiring, told The Independent about whether Democrats would challenge the ban. \n\nBut other Democrats avoided the question. \n\n“There’s a whole list of stuff that's being scrubbed there. Both in the privilege scrub now and in the later point of order challenges, and I can't say any more than that,” Sen. Sheldon Whitehouse of Rhode Island told The Independent. \n\nThis would not be the first time that Democrats and supporters of transgender rights pushed back on anti-transgender legislation. Earlier this year, Senate Democrats blocked legislation that would have banned transgender athletes from women’s sports.","summary":"Democrats have an opportunity to protect transgender people’s health care. It also comes at a time when Republicans see anti-trans policies as a winning issue, Eric Garcia writes","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrats-transgender-care-medicaid-trump-bill-b2771029.html","image":"https://static.independent.co.uk/2025/06/19/14/01/GettyImages-2220821596.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/UrgHdH1r-OhrQWqOm.mp4","publish_date":"2025-06-20 13:15:55","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.348},{"id":333493696,"title":"Why men are a problem for Democrats—and what we can do about it","text":"Men are a serious problem for Democrats—and for our hopes of building a more progressive America. That’s not a shocking revelation. The gender gap between men and women has been widening election after election.\n\nSo what are we going to do about it?\n\nIn 2024, President Donald Trump beat Vice President Kamala Harris among men by 12 points, 55-43, while losing among women by 8 points, 45-53. He won among married men by a staggering 60-38, and he even won among Latino men by 10 points, 54-44. And while only 21% of Black men voted for Trump, that’s a world away from the 92-7 margin Black women gave Harris.\n\nMost alarming? Trump won men aged 18-29, 49-48, while young women in the same age bracket backed Harris 61-38.\n\nWe have a problem.\n\nA must-read article in The Economist dug into this global phenomenon. In Poland, rural men used to count on marrying women who’d handle domestic duties. But those women are moving to cities like Warsaw to become lawyers and professionals. That “loss of status” has fueled support for right-wing nationalist parties, making feminism the enemy and “traditional values” the solution.\n\nIt’s the same story in the United Kingdom, South Korea, China—pretty much everywhere. \n\nWhat is going on? The most likely causes of this growing division are education (young men are getting less of it than young women), experience (advanced countries have become less sexist, and men and women experience this differently) and echo chambers (social media aggravate polarisation). Also, in democracies, many politicians on the right are deftly stoking young male grievances, while many on the left barely acknowledge that young men have real problems.\n\nLet that sink in: Many on the left barely acknowledge young men have real problems.\n\nWe can cite toxic masculinity and the many challenges women face in a patriarchal society—and we’d be right. But what good is that if we keep losing elections to Trump and his reactionary cabal?\n\nA new study by Equimundo, an organization working to engage young men as allies for gender equality, explores the alienation American men are feeling and the very real threat that poses to our democracy.\n\n“The intersection of economic precarity and masculinity creates a complex terrain where traditional notions of male identity—being a provider—confront increasingly unstable economic realities,” the report says.\n\nThat anxiety feeds support for authoritarianism, worsens mental health, and reinforces restrictive ideas of manhood. \n\nIn other words, when men can’t fulfill what society says is their primary role as provider, it cuts to the core of their identity. And that opens the door to despair, rage, and right-wing strongman fantasies.\n\nSome findings from the report:\n\n 75% of men say it’s harder for their generation to feel financially secure than their father’s\n\n More than half of men believe that home ownership is out of reach\n\n Half of men say that the only way to be successful is to be born into wealth\n\nWomen face all of these same challenges, but they’re not weighed down by the same cultural expectation to be “the provider,” which makes the mental toll on men—especially around self-worth, suicide risk, and parenting stress—distinctly intense.\n\nAdd to that fast-growing “Man Box” notion of masculinity built around stoicism, dominance, and self-reliance. \n\n“The confluence of these factors – economic precarity undermining traditional provider expectations, restrictive masculine norms preventing help-seeking behavior, and systemic inequities compounding stress for marginalized men – creates what can only be described as a perfect storm for masculine mental health crisis,” the report states. “Without deliberate intervention to redefine masculine success beyond economic provision and to challenge the Man Box's emotional restrictions, we risk losing an entire generation of men to depression, anxiety, and despair.”\n\nWithout urgent action to redefine masculinity beyond economic provision, we risk losing an entire generation of men to depression, anxiety, and political nihilism.\n\nAnd yes, we’re going backward: In 2017, just 34% of men believed that a man should have the final say in a relationship. Now it’s up to 42%. Similarly, 29% believed that a gay man isn’t a “real man,” while now 38% do.\n\nEven more concerning? Black and Latino men are the most likely to support these “Man Box” ideas, explaining Trump’s big gains among those voters last year. \n\nSocial media only pours gasoline on the fire. Scrolling through feeds full of steroid-pumped fitness gurus and red-pilled influencers, 63% of men say they wish they were more masculine. Gen Z men are the most likely to feel inadequate—and the most likely to fall under the sway of reactionary influencers offering them purpose and identity. And when those influencers—say, Joe Rogan—tell them to vote fascist, they listen.\n\nThis becomes a vicious cycle. Young men feel unmoored, unvalued, and unwanted, so they look for control. That leads to nihilism and authoritarianism. A stunning 57% of men (and 51% of women) say that they’d prefer a strong leader who doesn’t bother with elections. Another 39% of men say that voting doesn’t matter.\n\nThat’s how Trump wins. And when he’s gone, someone worse will be waiting in the wings ready to take advantage of these young men.\n\n“Men who endorse manosphere beliefs that they are exposed to online are three times as likely to endorse strongman politics,” the Equimundo report says.\n\nAnd it’s no surprise: Those “Man Box” traits—stoicism, dominance, self-reliance—are the opposite of what progressivism offers: collaboration, empathy, and community. The more men feel trapped in this toxic Man Box masculinity, the more they drift toward fascism.\n\nBut here’s the glimmer of hope: Men want to be caregivers.\n\n 87% support subsidized child care\n\n 85% back a four-day workweek\n\n 84% want financial support for family caregivers\n\n 83% support paid leave for childcare\n\nThese men aren’t unreachable. They’re looking for purpose and connection.\n\n“It’s easy to read this study and panic,” the report states. “Yet there are many glimmers of hope… This is the time to promote a caring version of manhood—one that values healthy connection, men’s mental health, and a shared agenda with women and girls.”\n\nTrump’s unprecedented assault on U.S. institutions led many of us to reflexively defend them. But let’s be honest: Those same institutions—government, media, corporations—aren’t working for most Americans. The economic divide has become a chasm. The gap between those who can shop without checking prices and those who can’t isn’t just financial—it’s political.\n\nWe were quick to write off toxic men as a fringe problem, but clearly they’re not fringe. They’re growing in number, and their despair is being weaponized.\n\nMaybe the lesson here is that everyone—men included—is overwhelmed by the seismic shifts of this era. And if we want to win, we need to extend the same compassion and understanding to these men that we rightly extend to marginalized groups.\n\nThe enemy isn’t young men trying to find their place; it’s those manipulating their pain into hate.\n\nLet’s be smarter, and more empathetic, about how we fight back.","summary":"Men are a serious problem for Democrats—and for our hopes of building a more progressive America. That’s not a shocking revelation. The gender gap between men and women has been widening election after election.\n\n\n\nSo what are we going to do about it?\n\n\n\nIn 2024, President Donald Trump beat Vice President Kamala Harris among men by 12 points, 55-43, while losing among women by 8 points, 45-53. He won among married men by a staggering 60-38, and he even won among Latino men by 10 points, 54-44. And while only 21% of Black men voted for Trump, that’s a world away from the 92-7 margin Black women gave Harris.\n\n\n\nMost alarming? Trump won men aged 18-29, 49-48, while young women in the same age bracket backed Harris 61-38.\n\n\n\nWe have a problem.\n\n\n\nA must-read article in The Economist dug into this global phenomenon. In Poland, rural men used to count on marrying women who’d handle domestic duties. But those women are moving to cities like Warsaw to become lawyers and professionals. That “loss of status” has fueled","url":"https://www.dailykos.com/story/2025/6/20/2328818/-Why-men-are-a-problem-for-Democrats-and-what-we-can-do-about-it?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1446779/story_image/AP912751489533.jpg?1750289297","video":null,"publish_date":"2025-06-20 13:00:03","author":"kos","authors":["kos"],"language":"en","category":"politics","source_country":"US","sentiment":0.145},{"id":333554742,"title":"Some US restaurants and servers oppose Republicans' 'no tax on tips' budget proposal","text":"Some segments of the U.S. restaurant industry don't support President Donald Trump's proposal to eliminate federal taxes on tips, saying it would help too few people and obscure bigger issues in the way tipped workers are paid.\n\nThe Independent Restaurant Coalition, which represents nearly 100,000 restaurant and bars, has appealed to Congress to reconsider the proposal, which is part of the president's spending bill. Even some workers who rely on tips say they oppose making them tax-deductible.\n\n\"I think there's a huge hole in this concept of 'no tax on tips' because a lot of restaurant workers aren't receiving tips in the first place,\" said Elyanna Calle, a bartender in Austin, Texas, and president of the Restaurant Workers United union. \"It's not helping most kitchen workers, and oftentimes those are the people who are being paid the least.\"\n\nTips included in sprawling tax cuts package\n\nFor now, making tips tax-free appears to have broad support among lawmakers. Both Trump and his Democratic rival in last year's U.S. presidential election, former Vice President Kamala Harris, campaigned on the concept.\n\nThe House included it in a tax cuts package approved last month. The bill would eliminate federal income taxes on tips for people working in jobs that have traditionally received them as long as they make less than $160,000 in 2025.\n\nThe Senate Finance Committee passed a modified version on Monday. Senators capped deductions at $25,000 and want to phase them out for individuals whose income exceeds $150,000. Eligibility would be based on earnings as of Dec. 31, 2024.\n\nBoth the House and Senate committee measures would apply through the 2028 tax year. The Finance Committee specified that \"cash tips\" qualify but said the term applied to tips paid in cash, charged to credit cards or received from other employees under a tip-sharing arrangement.\n\nMain industry trade group supports tax-free tips\n\nWary of wading into politics, many restaurant chains contacted by The Associated Press about tax-free tips didn't respond or referred questions to the National Restaurant Association, including Waffle House, The Cheesecake Factory, First Watch and the parent companies of Olive Garden, Applebee's and Chili's.\n\nThe National Restaurant Association, a trade organization that represents nearly 500,000 U.S. restaurants and bars, applauded the House's passage of Trump's spending bill and said it wants to see tax-free tips. The association estimates the measure would benefit more than 2 million servers and bartenders.\n\nBut the U.S. restaurant industry has more than 12 million workers, including dishwashers and chefs, according to government data. The Independent Restaurant Coalition says the \"no tax on tips\" proposal leaves out too many of those workers.\n\nA push to eliminate taxes on service charges\n\nThe coalition wants Congress to eliminate taxes on service charges, which are being used to compensate employees at an increasing number of restaurants. Around 15% of U.S. restaurants add some form of service charge to customers' bills, according to the National Restaurant Association.\n\nGeorge Skandalos, a pizza restaurant owner in Moscow, Idaho, was tired of seeing servers count out hundreds of dollars of tips at the end of the night while people in the kitchen scrubbed the floor on their hands and knees. So he started experimenting with different compensation models.\n\nSkandalos tried pooling servers' tips and distributing them but ran into rules preventing that. He tried raising his menu prices and explaining that a percentage of each order was going to employee compensation, but customers didn't understand and kept tipping.\n\nSkandalos now has a gratuity-free policy at his restaurant, Maialina. He charges a 20% service fee that is distributed to all employees and helps pay for benefits like paid vacation and parental leave. The vast majority of customers appreciate the effort, he said.\n\nSkandalos said \"no tax on tips\" doesn't acknowledge restaurants like his that are trying to distribute pay more equally. He would like to see service charges exempted from taxes.\n\n\"This bill is a very good start in terms of trying to leave more money in people's pocketbooks, but now let's finish what we started and make it a great thing for the restaurant industry overall,\" he said.\n\nTipped workers seek higher wages\n\nBut Ted Pappageorge, the secretary-treasurer of the Culinary Workers Union Local 226 in Las Vegas, said restaurants should just pay their kitchen workers more to compensate for servers earning tips.\n\n\"'No tax on tips' is an opportunity for Republicans and Democrats to deliver something to working class folks,\" he said.\n\nPappageorge wants Congress to take up a separate bill introduced by Nevada Democrat Steven Horsford that would eliminate taxes on tips but also require restaurants to pay workers at least the federal minimum wage of $7.25 per hour. In 43 states, restaurants are currently allowed to pay tipped workers as little as $2.13 per hour.\n\nYolanda Garcia, a barista at Resorts World in Las Vegas and a member of the Culinary Workers Union, also supports Horsford's bill. Garcia said she makes $33,000 a year, including up to $600 per month in tips. Tips are never guaranteed, she said, but if they were tax-free, it would help make up for that uncertainty.\n\n\"It would help me get more groceries. Right now, the price of everything has gone up,\" Garcia said.\n\nCalle, the Austin bartender and union leader, said she also benefits from tips, but they're inconsistent. She suspects tipping would decline if the tax-free provision passes, because customers will resent it.\n\nFor Calle, the underlying problem that must be solved is low base pay.\n\n\"I think that if we continue to make the shift into relying on tips for people, it gives incentives for companies to not raise wages,\" she said.","summary":"Some segments of the U.S. restaurant industry say \"no tax on tips\" would help too few people and obscure bigger issues in the way tipped workers are paid.","url":"https://buffalonews.com/news/nation-world/article_f30f94bf-cecd-53a1-830e-b705bfe4e469.html","image":"https://bloximages.chicago2.vip.townnews.com/buffalonews.com/content/tncms/assets/v3/editorial/f/30/f30f94bf-cecd-53a1-830e-b705bfe4e469/685546e5dbf59.preview.jpg?crop=1738%2C912%2C10%2C49&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-06-20 12:30:00","author":"Dee-Ann Durbin,DEE-ANN DURBIN AP Business Writer","authors":["Dee-Ann Durbin","DEE-ANN DURBIN AP Business Writer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.172},{"id":333516094,"title":"Digested week: Climate warning provides more fuel for Brits to talk about weather | Emma Brockes","text":"The best descriptions of summer heat, in my view, come from Carson McCullers’s The Member of the Wedding, a novel in which, “the world seemed to die each afternoon and nothing moved any longer … like a silent crazy jungle under glass.” Or Muriel Spark, in her short story The Seraph and the Zambezi, set in southern Africa in 1946, where “the heat distorted every word” and sound, writes Spark, “reached my ears a fraction behind time”. Of a bunch of white settlers enjoying pink gins on the terrace, she writes, “the glasses made a tinkle that was not of the substance of glass, but of bottles wrapped in tissue paper. Sometimes, for a moment, a shriek or a cackle would hang torpidly in space, but these were unreal sounds as if projected from a distant country.”\n\nThis week, much of Britain enjoyed an unbroken run of 30C days and we were all yanked back to that distant country – the one in which we sat in hot classrooms clad head to toe in polyester, wilting to LP Hartley’s The Go-Between. “In the heat,” wrote Hartley, “the commonest objects changed their nature,” and no matter how many summers we’ve been through, this fact seems to surprise every time.\n\nWhat struck me this week as temperatures soared was how particular each heatwave is to its locality. In New York, summer comes with light as harsh and unshaded as fluorescent strip lighting and the sky is an angry blue. In the southern hemisphere, where the sun is at its strongest, you can walk down the street and feel the heat on your back like a hand, pushing. In Britain, however, the country remains pale and watery in even the hottest weather, an apparent mildness of light and sky that somehow makes the trees seem more green, the effect of high temperatures more surreal and the people, after three consecutive days of hot weather, inclined to completely lose our minds.\n\nThe English dream is not of nice weather but of any weather that provides a pretext to talk about it. This week, on top of the thrill of the heatwave, the Met Office gave the nation more fuel for its pastime with a warning that in the current climate, the chances of Britain experiencing 45C heat in the next 12 years have risen to 50/50. (In 2022, temperatures hit 40C for the first time on record.)\n\nYou could talk about the terrible consequences of this, or the failures to date of world leaders to staunch global heating, but really what most of us wanted to do was to say “45 degrees!” and pull a series of cor-blimey faces. There was more: in what pushes us close, surely, to a record-breaking week in opportunities for weather chat in this country, the Met Office went on to issue an invitation to the public to come up with suggestions for storm names for the 2025/26 season.\n\nLast year, you may recall, Storm Bert wreaked havoc on the west coast, and there was also Storm Darragh and a series of storm backup names, such as Storm Conall, Mavis and Tilly. But precedent won’t help us here. Opening up submissions to the public this year is a terrible idea given how hilarious everyone in this country finds themselves and we all know how this ends: with Storm Stormy McStormface and Storm Stormzy.\n\nCommentary around the joint appearance of Donald Trump and Keir Starmer in Canada this week focused on the dismaying optics of our prime minister scrabbling about on the ground to pick up papers the more powerful leader had dropped. What better illustration of the literal grovelling required to get on the American president’s good side?\n\nIt was a little mortifying to watch, I agree. But when you stop to think about it, what strikes me about this vignette from the G7 is Starmer’s entirely normal human instinct, when someone standing beside you drops their papers, to bend to the floor to help pick them up. It’s not Starmer’s subservience that stands out in this scene, but Trump’s psychopathy as he stands there like a boulder, not helping to clear up his own mess.\n\nOf course it was only about the fourth weirdest thing the American president did this week, as he continues to extemporise and jazz-hand his way to the brink of war with Iran. A clear winner was the message Trump put out on Truth Social about Iran’s leader: “We know exactly where the so-called ‘Supreme Leader’ is hiding … We are not going to take him out (kill!), at least not for now.” A thoughtful clarification, here, for Trump’s slowest followers, that “take out” in this context doesn’t indicate the president’s desire to buy the Ayatollah dinner.\n\nWoo, a hatchet job of a superstar novelist beloved by everyone in Gen Z and above! If you are someone who takes an interest in other people’s bad reviews, you will probably already have received, from multiple sources, a link to Tom Crewe’s amazingly unequivocal takedown of Ocean Vuong in this week’s London Review of Books.\n\n“I groaned my way through The Emperor of Gladness,” writes Crewe of Vuong’s new novel, a prequel to his million-selling debut On Earth We’re Briefly Gorgeous and an Oprah Book Club pick that is selling very briskly. “I writhed. I felt real despair every time I forced myself to open the covers. It was one of the worst ordeals of my reading life.” He went on: “This is because, while it is bad in all the ways that On Earth We’re Briefly Gorgeous was bad, it is also bad in new and unexpected ways.”\n\nFor example, wrote Crewe, this novel, “has a much higher proportion of dialogue, for which Vuong has no talent. It tries, and fails, to be funny.”\n\nIt is also, he writes, “inordinately long and almost entirely filler”. I haven’t read the new book, but I thoroughly enjoyed Vuong’s debut and disagree with much of this 5,000 word review. Although not enough, of course, to undermine the pleasure of reading an example of a critic telling us what he really thinks.\n\nLet’s end the week in a happy place, with the wedding of Alex Soros, one of the five children of billionaire George Soros, and Huma Abedin, former political aide to Hillary Clinton whose wretched ex-husband, Anthony Weiner, arguably bears a greater responsibility for putting Trump in the White House than any other individual. (It was Weiner sending crotch photos to young women that, in a series of unlikely events, delivered a hard drive with Hillary’s emails to the FBI boss, James Comey).\n\nBut after all, here’s a fairytale ending – or, depending on your view, the kind of nightmare that wakes you up at 2am in a cold sweat: you are getting married in a huge tent in the Hamptons in the presence of 500 people including Kamala Harris, Anna Wintour, Hillary Clinton and – the icing on it – Jimmy Fallon, who will be making some jokes. Cheers!","summary":"Heatwave and an invitation to name storms created record-breaking opportunities to indulge nation’s favourite pastime\n\nThe best descriptions of summer heat, in my view, come from Carson McCullers’s The Member of the Wedding, a novel in which, “the world seemed to die each afternoon and nothing moved any longer … like a silent crazy jungle under glass.” Or Muriel Spark, in her short story The Seraph and the Zambezi, set in southern Africa in 1946, where “the heat distorted every word” and sound, writes Spark, “reached my ears a fraction behind time”. Of a bunch of white settlers enjoying pink gins on the terrace, she writes, “the glasses made a tinkle that was not of the substance of glass, but of bottles wrapped in tissue paper. Sometimes, for a moment, a shriek or a cackle would hang torpidly in space, but these were unreal sounds as if projected from a distant country.”\n\n Continue reading...","url":"https://www.theguardian.com/environment/2025/jun/20/digested-week-climate-warning-heatwave-brits-talk-about-weather","image":"https://i.guim.co.uk/img/media/4cbe71108e961dcef672045139791613549bcc12/247_0_5273_4219/master/5273.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3B","video":null,"publish_date":"2025-06-20 10:42:11","author":"Emma Brockes","authors":["Emma Brockes"],"language":"en","source_country":"gb","sentiment":-0.173},{"id":333491312,"title":"POLL: What Was the Worst Media Take of the Week?","text":"POLL: What was the worst media take of the week? (Vote below)\n\n1. Jim Acosta Bashes Trump’s “Kim Jong-Un Birthday Parade” \n\n“The President of the United States is a danger to this country. Full stop….Even people in the Republican party were afraid to show up at his birthday parade, the dictator Kim Jong-Un birthday parade that he tried to have….One of the images I took away from the weekend that really stayed with me were those military veterans....who had fought in World War II and said, ‘we defeated fascism the last time. I’m here to do it this time.’”— Former CNN anchor Jim Acosta at Center for American Progress, June 17.\n\n2. Whoopi Goldberg: It’s Worse to Be Black in America Than Live in Iran\n\nCo-host Alyssa Farah Griffin: “I think it’s very different to live in the United States in 2025 than it is in Iran.”Co-host Whoopi Goldberg: “Not if you’re black!”— ABC’s The View, June 18. \n\n3. Eugene Robinson: “No Mandate” For Trump’s “Proto-Fascism”\n\n“You had 5 million people in demonstrations around the country against what President Trump is doing. What it brought to mind to me was a number that….Joe Scarborough mentioned earlier, 1.5 percent. That was the margin between the 77 million votes that Donald Trump got and the 75 million that Kamala Harris got. And it’s not this overwhelming mandate for proto-fascism.”— MSNBC analyst Eugene Robinson on MSNBC’s Morning Joe, June 17. \n\nFunded by James P. Jimirro","summary":"POLL: What was the worst media take of the week? (Vote below)\n\n \n\n\n\n\n\n \n\nNOMINEES: \n\n \n\n1. Jim Acosta Bashes Trump’s “Kim Jong-Un Birthday Parade” \n\n“The President of the United States is a danger to this country. Full stop….Even people in the Republican party were afraid to show up at his birthday parade, the dictator Kim Jong-Un birthday parade that he tried to have….One of the images I took away from the weekend that really stayed with me were those military veterans....who had fought in World War II and said, ‘we defeated fascism the last time. I’m here to do it this time.’”— Former CNN anchor Jim Acosta at Center for American Progress, June 17.\n\n \n\n2. Whoopi Goldberg: It’s Worse to Be Black in America Than Live in Iran\n\nCo-host Alyssa Farah Griffin: “I think it’s very different to live in the United States in 2025 than it is in Iran.”Co-host Whoopi Goldberg: “Not if you’re black!”— ABC’s The View, June 18. \n\n \n\n3. Eugene Robinson: “No Mandate” For Trump’s “Proto-Fascism”\n\n“You had 5 million people in dem","url":"https://www.newsbusters.org/blogs/nb/geoffrey-dickens/2025/06/20/poll-what-was-worst-media-take-week","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-06/WorstMediaMoments_6-19-25.jpg?itok=EUG6yuVp","video":null,"publish_date":"2025-06-20 09:53:00","author":"Geoffrey Dickens,James P. Jimirro","authors":["Geoffrey Dickens","James P. Jimirro"],"language":"en","source_country":"US","sentiment":-0.215},{"id":333356086,"title":"Mark Cuban reveals why he turned down Kamala Harris’s VP offer in 2024","text":"Billionaire entrepreneur Mark Cuban has revealed that Kamala Harris invited him to submit vetting materials in order to be considered as her running mate last year, but he declined. \n\nIn an interview with The Bulwark’s Tim Miller on Thursday, the host asked the former Shark Tank reality TV personality about rumors linking him to the failed Harris campaign.\n\n“There was some green room gossip at MSNBC,” Miller said. “You ready for this? You ready? I wouldn’t tell you this if it wasn’t pretty good. Somebody I kind of trust said that they asked you to send in VP vetting papers and you said, ‘No, the list would be too long.’ Is that true?”\n\n“It is true,” replied Cuban, who once supported Donald Trump but remained a prominent Harris supporter throughout the 2024 campaign while denying harboring any ambition to serve in her cabinet should she win.\n\n“Why didn’t you consider, I mean, you ended up there campaigning with her, advising her,” Miller asked.\n\nThe Dallas Mavericks owner replied: “The second part of that, my response was I’m not very good as the number two person. And so if the last thing we need is me telling Kamala, you know, the president that, no, that’s a dumb idea. Right. And I’m not real good at the shaking hands and kissing babies.”\n\nHarris ultimately chose Minnesota Gov. Tim Walz as her vice presidential nominee from a final three that also included Pennsylvania Gov. Josh Shapiro and Arizona Senator Mark Kelly.\n\nWalz initially enjoyed success with his attack on Trump and JD Vance, labeling them as “weird,” and offering a friendly, folksy, blue-collar alternative that ultimately proved insufficiently appealing to prevent a Republican win.\n\nMiller told Cuban that he had sold himself short with that negative assessment of his own qualities.\n\n“I don’t know about that. I mean, I was talking to Pete Buttigieg a couple of weeks ago and I was like… I want to, you know, give you a time machine. We’re going to go back in a DeLorean. Like, what can we do different?” he said.\n\n“So I want to ask you that same question, but also in the context, like if it was you instead of Tim Walz, who the hell knows? I don’t know. It feels maybe different. It feels maybe different.”\n\nCuban responded: “I mean, obviously it would have been different. My personality is completely different than Tim’s. My experiences, my backgrounds are completely different. I think I’ve cut through the s*** more directly. I’m not a politician. And so it would have been different, but it would have been awful.\n\n“She would have fired me within six days!” he joked.\n\n“It would have been better than the present situation, you know?” Miller insisted.\n\n“Well, yes, that’s true. But, you know, I really thought she was going to win,” Cuban answered.\n\nThe interviewer concluded: “Here’s why I want to pick on that. And I know you don’t want the clip here. You’re like, ‘We would have won if Mark Cuban was VP.’ And I get that. I don’t even know if I believe that, but maybe. \n\n“I think it would have been meaningfully different in a way that like picking Josh Shapiro or whatever wouldn’t have been meaningfully different in a way that’s kind of hard to predict.”","summary":"‘She would have fired me within six days!’ the billionaire joked","url":"https://www.independent.co.uk/news/world/americas/us-politics/mark-cuban-kamala-harris-running-mate-b2773652.html","image":"https://static.independent.co.uk/2025/06/20/8/07/Mark-Cuban.png?width=1200","video":"https://cdn.jwplayer.com/videos/1vO7MlHs-OhrQWqOm.mp4","publish_date":"2025-06-20 08:26:45","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","source_country":"gb","sentiment":-0.31},{"id":333300240,"title":"Trump is silent about Juneteenth on a day he previously honored as president","text":"WASHINGTON — President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it \"very famous.\"\n\nBut on this year's Juneteenth holiday on Thursday, the usually talkative president kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again.\n\nNo words about it from his lips, on paper or through his social media site.\n\nAsked whether Trump would commemorate Juneteenth in any way, White House press secretary Karoline Leavitt told reporters: \"I'm not tracking his signature on a proclamation today. I know this is a federal holiday. I want to thank all of you for showing up to work. We are certainly here. We're working 24/7 right now.\"\n\nAsked in a follow-up question whether Trump might recognize the occasion another way or on another day, Leavitt said, \"I just answered that question for you.\"\n\nOn Wednesday, Black community leaders from across the country, senior Trump administration officials and other individuals met at the White House to discuss improving coordination between the leaders and federal, state and local partners, according to a senior White House official. Housing Secretary Scott Turner and Lynne Patton, director of minority outreach, were among those who attended, said the official, who insisted on anonymity to discuss a private gathering.\n\nThe Republican president's silence was a sharp contrast from his prior acknowledgement of the holiday. Juneteenth celebrates the end of slavery in the United States by commemorating June 19, 1865, when Union soldiers brought the news of freedom to enslaved Black people in Galveston, Texas. Their freedom came more than two years after President Abraham Lincoln liberated slaves in the Confederacy by signing the Emancipation Proclamation during the Civil War.\n\nTrump's quiet on the issue also deviated from White House guidance that Trump planned to sign a Juneteenth proclamation. Leavitt didn't explain the change. Trump held no public events Thursday, but he shared statements about Iran, the TikTok app and Fed chairman Jerome Powell on his social media site.\n\nIn the evening, Trump complained on the site about \"too many non-working holidays\" and said it is \"costing our Country $BILLIONS OF DOLLARS to keep all of these businesses closed.\" But most retailers are open on Juneteenth while most federal workers get a day off because the government is closed.\n\nHe had more to say about Juneteenth in yearly statements in his first term.\n\nIn 2017, Trump invoked the \"soulful festivities and emotional rejoicing\" that swept through the Galveston crowd when a major general delivered the news that all enslaved people were free.\n\nHe told the Galveston story in each of the next three years. \"Together, we honor the unbreakable spirit and countless contributions of generations of African Americans to the story of American greatness,\" he added in his 2018 statement.\n\nIn 2019: \"Across our country, the contributions of African Americans continue to enrich every facet of American life.\" In 2020: \"June reminds us of both the unimaginable injustice of slavery and the incomparable joy that must have attended emancipation. It is both a remembrance of a blight on our history and a celebration of our Nation's unsurpassed ability to triumph over darkness.\"\n\nIn 2020, after suspending his campaign rallies because of the coronavirus pandemic, Trump chose Tulsa, Oklahoma, as the place to resume his public gatherings and scheduled a rally for June 19. But the decision met with such fierce criticism that Trump postponed the event by a day.\n\nBlack leaders had said it was offensive for Trump to choose June 19 and Tulsa for a campaign event, given the significance of Juneteenth and Tulsa being the place where, in 1921, a white mob looted and burned that city's Greenwood district, an economically thriving area referred to as Black Wall Street. As many as 300 Black Tulsans were killed, and thousands were temporarily held in internment camps overseen by the National Guard.\n\nIn an interview with The Wall Street Journal days before the rally, Trump tried to put a positive spin on the situation by claiming that he had made Juneteenth \"famous.\" He said he changed the rally date out of respect for two African American friends and supporters.\n\n\"I did something good. I made it famous. I made Juneteenth very famous,\" Trump said. \"It's actually an important event, it's an important time. But nobody had heard of it. Very few people have heard of it.\"\n\nGenerations of Black Americans celebrated Juneteenth long before it became a federal holiday in 2021 with the stroke of President Joe Biden's pen.\n\nLater in 2020, Trump sought to woo Black voters with a series of campaign promises, including establishing Juneteenth as a federal holiday.\n\nHe lost the election, and that made it possible for Biden, a Democrat, to sign the legislation establishing Juneteenth as the newest federal holiday. Shortly after being sworn in for his second term in January, Trump signed an executive order ending diversity, equity and inclusion initiatives across the federal government, calling them \"illegal and immoral discrimination programs.\"\n\nBiden issued annual Juneteenth proclamations during his four years in office, and observed some of the holidays with large concerts on the South Lawn. Biden's final observance in 2024 featured performances by Gladys Knight and Patti LaBelle. Vice President Kamala Harris danced onstage with gospel singer Kirk Franklin.\n\nBiden spent this year's holiday in Galveston, Texas, where he spoke at a historic African Methodist Episcopal church.","summary":"President Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. On this year's Juneteenth holiday on Thursday, the president kept silent.","url":"https://www.npr.org/2025/06/20/g-s1-73675/trump-silent-about-juneteenth","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5594x3729+0+0/resize/5594x3729!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd0%2Fdd%2F127a20304ce7984c0279161186ec%2Fap25170634836087.jpg","video":null,"publish_date":"2025-06-20 05:30:21","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.258},{"id":333284342,"title":"Mark Cuban says Kamala Harris' campaign courted him for VP, but he turned them down","text":"Billionaire Mark Cuban said the presidential campaign team for Kamala Harris had asked him to submit vetting papers for the vice president position, which he declined.In a video clip published on Thursday, Cuban was asked by political commentator Tim Miller, who'd heard a rumor of the exchange, if the former Dallas Mavericks owner was really courted by the Harris campaign for the role.\"Yeah,\" Cuban said, nodding.\"The second part of my response was: 'I'm not very good as the number two person,'\" he added. \"And so the last thing we need is me telling Kamala, you know, the president, that: 'No, that's a dumb idea.'\"Cuban said he's also \"not real good at the shaking hands and kissing babies\" bit of a vice president's role.He mused that the Harris campaign would have looked \"different\" with him as a vice presidential pick instead of Tim Walz, the Minnesota governor who joined Harris on the ticket.\"My personality is completely different than Tim's, my experiences, my backgrounds are completely different. I think I cut through the shit more directly, I'm not a politician,\" said Cuban, who fiercely backed Harris' campaign in 2024.But he said a Harris run or administration with him as VP would have ended disastrously.\"It would have been awful. She would have fired me within six days,\" Cuban said.\"It would have been better than the present situation,\" Miller said.\"Yes, that's true,\" Cuban replied. \"But, you know, I really thought she was going to win.\"When former President Joe Biden abruptly dropped out of the running post-nomination in July 2024, Cuban was one of the earliest and most vocal private-sector supporters for Harris, appearing at her events in swing states and fielding press calls.During that period, he suggested that Harris could appoint him to lead entities such as the Federal Trade Commission or the Securities and Exchange Commission.\"It's something I could do to have an impact,\" he told Business Insider in September.But he's also said at the time that he wasn't keen on a Cabinet position, telling ABC a month later that he preferred to be a \"disruptor as an entrepreneur.\"Cuban and the press office for Harris did not immediately respond to requests for comment sent outside regular business hours by Business Insider.","summary":"The billionaire said a Harris campaign with him on the ticket would have felt \"different\" but would likely have also ended in disaster.","url":"https://www.businessinsider.com/mark-cuban-kamala-harris-vice-president-vetting-papers-declined-2025-6","image":"https://i.insider.com/6854d8873d5881a51c1bbfff?width=1200&format=jpeg","video":null,"publish_date":"2025-06-20 04:09:28","author":"Matthew Loh","authors":["Matthew Loh"],"language":"en","source_country":"us","sentiment":-0.192},{"id":333276138,"title":"Mark Cuban reveals Kamala Harris considered him as a potential VP — but turned her down","text":"Mark Cuban revealed that former Vice President Kamala Harris had considered him as a potential running mate in her bid for the White House last year – but he turned her down. \n\nThe billionaire entrepreneur, who served as a high-profile surrogate for Harris’s failed campaign, made the shocking admission in a sneak preview of “The Bulwark” podcast after host Tim Miller pressed him about “some green room gossip at MSNBC” related to the request.\n\nThe former “Shark Tank” judge said the Democrat’s team had reached out to ask him to submit vetting materials – but he felt a review of his extensive background would be a waste of time. \n\n“My response was I’m not very good as the number two person,” Cuban told Miller in a clip of Friday’s episode. \n\n“And so if the last thing we need is me telling Kamala, you know, the president that, no, that’s a dumb idea. And I’m not real good at the shaking hands and kissing babies.”\n\nMiller responded by telling the Dallas Mavericks minority owner that he may have been a bigger – and “meaningfully different” – asset to Harris’s campaign than Minnesota Gov. Tim Walz, who she ultimately chose to join her losing ticket. \n\n“I mean, obviously it would have been different,” Cuban said, noting that he’s not a politician. \n\n“My personality is completely different than Tim’s. My experiences, my backgrounds are completely different. I think I’ve cut through the sh–t more directly. I’m not a politician. And so, it would have been different, but it would have been awful.”\n\nThe businessman joked that Harris probably would have fired him within six days. \n\nMiller pushed back, saying that Cuban joining the presidential ticket would have been “better than the present situation,” referring to President Trump and Vice President JD Vance, who overwhelmingly won the election last November. \n\n“Well, yea, that’s true. But, you know, I really thought she was going to win,” Cuban replied.\n\nCuban actively campaigned for Harris on the trail, even facing some backlash after claiming Trump does not surround himself with “strong, intelligent women” during an appearance on “The View.”\n\nHe immediately regretted his careless remarks and tried to clear them up — later congratulating the commander in chief for winning the election “fair and square.”","summary":"“My response was I’m not very good as the number two person,” Cuban told Miller in a clip of Friday’s episode. ","url":"https://nypost.com/2025/06/19/us-news/mark-cuban-reveals-kamala-harris-considered-him-as-a-potential-vp-but-turned-her-down/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/last-summer-height-presidential-campaign-106802769.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/pfxSJc0r-RyIcpnTz.mp4","publish_date":"2025-06-20 03:47:09","author":"Anna Young","authors":["Anna Young"],"language":"en","source_country":"zm","sentiment":-0.301},{"id":333590060,"title":"Trump confirms further delay to TikTok ban or sale deadline","text":"President Donald Trump has extended the deadline for TikTok’s sale in the US for a further 90 days.\n\nThe video-sharing app has faced questions over its future after the US passed a law last year requiring the app to be banned unless sold by its Chinese parent company, ByteDance.\n\nLawmakers said it posed a risk to national security – something TikTok denies.\n\nTrump, who vowed to save TikTok during his presidential campaign, signed an executive order on Thursday which has delayed the date for enforcing the law for a third time.\n\nIn a statement, TikTok said it was “grateful for President Trump’s leadership and support” in keeping the app online for its 170m US users.\n\n“We continue to work with Vice President Vance’s Office,” it added.\n\nA deal for the sale of TikTok in the US by ByteDance must now be reached by 17 September, Trump said in a post on his platform Truth Social.\n\nThe further delay was an expected development in the long-running process of securing a buyer for TikTok.\n\nIt is thought the authorities in Beijing will need to approve any sale or part sale of the app by its parent company.\n\nThe law was prompted by fears in the US that TikTok or ByteDance could be forced to hand over data on US users by the Chinese government.\n\nTrump said on Tuesday he expected there would be a further delay.\n\nWhite House press secretary Karoline Leavitt said on Wednesday that a further 90-day extension would “ensure this deal is closed so that the American people can continue to use TikTok with the assurance that their data is safe and secure.”\n\n‘Flouting’ the law\n\nTrump tried to force a sale of TikTok to an American buyer in 2020, during his first term in office.\n\nBut last year, he signalled he’d had a change of heart, saying the platform had helped him win the 2024 presidential election.\n\n“I have a warm spot in my heart for TikTok, because I won youth by 34 points,” Trump said in December, although most young voters backed the Democratic candidate Kamala Harris.\n\nThe law was supposed to take effect on 19 January, a day before Trump’s inauguration to a second term in office.\n\nTikTok challenged its constitutionality in the courts. The Supreme Court upheld the law days before it was due to take effect.\n\nSenate Select Committee on Intelligence Vice Chairman Mark Warner, a Democrat, criticized Trump’s decision.\n\n“Once again, the Trump administration is flouting the law and ignoring its own national security findings about the risks posed by a PRC-controlled TikTok,” Warner said in a statement.\n\n“An executive order can’t sidestep the law, but that’s exactly what the president is trying to do,” Warner added.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"President Donald Trump has extended the deadline for TikTok&#8217;s sale in the US for a further 90 days. The video-sharing app has faced questions over its future after the US passed a law last year requiring the app to be banned unless sold by its Chinese parent company, ByteDance. Lawmakers said it posed a risk [&#8230;]\n\n\nThe post Trump confirms further delay to TikTok ban or sale deadline appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/06/20/trump-confirms-further-delay-to-tiktok-ban-or-sale-deadline/","image":"https://www.ghanamma.com/wp-content/uploads/2025/06/image-791-1068x712.png","video":null,"publish_date":"2025-06-20 03:31:37","author":"Ghana News","authors":["Ghana News"],"language":"en","source_country":"gh","sentiment":0.018},{"id":333269518,"title":"NBA team owner Mark Cuban reveals he rejected stunning offer from Kamala Harris ahead of election loss to Trump","text":"NBA team owner Mark Cuban reveals he rejected stunning offer from Kamala Harris ahead of election loss to Trump\n\nREAD MORE: NBA owner Mark Cuban fires back at former employee\n\nBy ISABEL BALDWIN\n\nPublished: 03:35 BST, 20 June 2025 | Updated: 03:39 BST, 20 June 2025\n\nNBA team minority owner Mark Cuban has revealed that Kamala Harris' ticket for last November's election could have looked very different. \n\nThe former Shark Tank personality, who owns a 27 percent stake in the Dallas Mavericks, has shared that the former Vice President had reached out to him amid last year's Race to the White House. \n\nThe 66-year-old claimed that Harris' team had asked him to submit vetting materials to be considered for her running mate in the 2024 campaign.\n\nBut Cuban, despite being outspoken in his opposition of Donald Trump, surprisingly turned the Democratic hopeful down. \n\nThe Bulwark's Tim Miller quizzed Cuban on the rumor Thursday, asking: 'Somebody I kind of trust said that they asked you to send in VP vetting papers and you said, \"No, the list would be too long.\" Is that true?'\n\nCuban, who campaigned for Harris, admitted that it was before going on to explain why he passed over the offer. \n\nTalked to @mcuban for tomorrow’s pod and he tells me he declined an offer to be vetted for Kamala VP. What might have been!\n\nWe also discuss the fallout of his decision to sell the Mavs but gotta wait til tomorrow for that. https://t.co/tqcc93IxmO pic.twitter.com/hVrpeFYsSL\n— Tim Miller (@Timodc) June 20, 2025\n\nMark Cuban revealed that Kamala Harris asked him to be her running mate last year\n\n'The second part of that, my response was I'm not very good as the number two person. And so if the last thing we need is me telling Kamala, you know, the president that, no, that's a dumb idea. Right. And I'm not real good at the shaking hands and kissing babies,' Cuban added. \n\nHarris ultimately selected Minnesota Governor Tim Walz as her running mate but was defeated at the ballot box by Trump and Vice President JD Vance. \n\n'I mean, obviously it would have been different,' Cuban added. 'My personality is completely different than Tim's. My experiences, my backgrounds are completely different. \n\n'I think I've cut through the s*** more directly. I'm not a politician. And so it would have been different, but it would have been awful,' Cuban joked, 'She would have fired me within six days.'\n\n'It would have been better than the present situation, you know?' Miller retorted. \n\n'Well, yes, that's true. But, you know, I really thought she was going to win,' Cuban replied. \n\nCuban hit out at Trump in the build up to last year's election, taking aim at the president's golf game in an email to DailyMail.com. \n\n'I can out drive him by 100 yards,' the 66-year-old Cuban wrote of the 78-year-old Trump in an email to DailyMail.com.\n\nThe former Shark Tank personality was openly critical of the president during the election \n\nIt came after Trump had bizarrely claimed that Cuban has 'really low clubhead speed' and is 'a total non-athlete.'\n\nTypically Cuban has attacked Trump's business acumen, understanding of tariffs, and his failure to hold his 2016 campaign promise of building a border wall and making Mexico pay for it.\n\n'This man has so little understanding of tariffs, he thinks that China pays for that. This is the same guy who also thought that Mexico would pay for the wall,' Cuban told an audience in the battleground state of Wisconsin.\n\n'Did Mexico pay for that wall?,' Cuban asked the crowd, who responded, 'no.'\n\nIn addition to his bitter tiff with the president over their golf games last October, Cuban has been highly critical of Trump.\n\nThe entrepreneur campaigned for Harris in the buildup to her ultimate defeat at the ballot box last November and took aim at Trump's inner circle.\n\n'Donald Trump – you never see him around strong, intelligent women, ever. It's just that simple,' Cuban said on The View last November.\n\n'It's just that simple. They're intimidating to him. He doesn't like to be challenged by them,' Cuban added.\n\nCuban openly supported the former Vice President, speaking at rallies along the campaign trail\n\nTrump's national press secretary Karoline Leavitt said the comments were 'extremely insulting to the thousands of women who work for President Trump, and the tens of millions of women who are proudly voting for him.'\n\nCuban later apologized, saying he 'didn't get it out exactly the way I thought I did.'\n\nIn August of last year, the wealthy 'shark' made it clear that his support had shifted from Trump to Harris after 'he got to know him,' according to Business Insider.\n\n'I actually started off supporting Donald, and then I got to know him better,' Cuban told Vivek Ramaswamy, a former Republican presidential candidate, during an interview last year.\n\n'I was like, he's great - he's not a typical Stepford candidate. I thought that was a positive,' he added. 'But then I got to know him.'\n\nHowever, he was one of the first members of Camp Kamala to publicly concede defeat on election night, sending a message of congratulations to Trump\n\nThe businessman sold a majority ownership of the Mavericks for $3.5 billion to the Adelson family in December 2023. Cuban still holds a 27 percent stake in the team.\n\nShare or comment on this article:\nNBA team owner Mark Cuban reveals he rejected stunning offer from Kamala Harris ahead of election loss to Trump\n\nAdd comment","summary":"The former Shark Tank personality, who owns a stake in the Dallas Mavericks, has shared that the former Vice President had reached out to him amid last year's Race to the White House. ","url":"https://www.dailymail.co.uk/sport/nba/article-14830561/nba-mark-cuban-offer-kamala-harris-trump.html","image":"https://i.dailymail.co.uk/1s/2025/06/20/03/99555457-0-image-m-18_1750386785029.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/10/20/2591833746178748737/1024x576_MP4_2591833746178748737.mp4","publish_date":"2025-06-20 02:39:33","author":"Editor,Isabel Baldwin","authors":["Editor","Isabel Baldwin"],"language":"en","source_country":"jp","sentiment":-0.517},{"id":333267436,"title":"How Black conservative leaders aim to build the next generation in Washington","text":"Seeking to harness what it sees as the momentum of the 2024 presidential election, the Black Conservative Federation is launching a two-day summit in Washington, D.C., next month aimed at bringing together Black conservatives and cultivating the next generation of leaders.\n\nThe inaugural Black Conservative Federation Solution Summit will be held July 11-12, bringing together elected officials, influencers, policy experts and strategists for what organizers hope will be a series of \"bold, solution-driven conversations\" on the most urgent issues facing Black America today.\n\n\"In this spirit of forward momentum during the Trump Administration, we are investing in the next generation of Black leaders who will define the future of our communities, our culture, and our country,\" Diante Johnson, the group's president and founder, said in a statement to ABC News.\n\nJohnson previously served as the Trump campaign’s North Carolina regional field director in 2016 and was a member of the Black Voices for Trump Advisory Board during the 2020 campaign.\n\nThe summit comes after President Donald Trump made modest gains with Black voters nationwide in 2024, especially among young Black men, a key demographic for Democrats, according to the Associated Press. Black voters made up about 1 in 10 voters nationally in the last 2024 presidential election.\n\nAlthough roughly 8 in 10 Black voters supported Vice President Kamala Harris, that marked a dip from the roughly 9 in 10 who backed President Joe Biden just four years earlier. Trump, meanwhile, nearly doubled his support from 2020 among Black men under the age of 45 -- with about 3 in 10 backing him in 2024, compared to just 1 in 10 in 2020.\n\nThe summit will focus on six key topics: artificial intelligence and its role in shaping the future; criminal justice reform and policy transformation; cryptocurrency and Black economic empowerment; strengthening the Black family; navigating modern cultural debates; and Gen Z's influence in politics and media.\n\nWhile several members of the Black Conservative Federation have gone on to work in the Trump administration and the broader conservative movement, organizers say the event is about more than short-term wins. It is designed to foster long-term talent and leadership development across the country, they say.\n\n\"We are not only honoring the legacy of freedom, we're building on it. By mentoring emerging voices and expanding access to civic engagement, we're carrying the torch of progress with purpose,\" Johnson said.\n\nAmong the featured speakers at the summit are Lynne Patton, deputy assistant to the president and director of minority outreach at the White House; Rep. Wesley Hunt of Texas; Anne Marie Wiley, former cast member of \"The Real Housewives of Beverly Hills\"; Alex Smith, deputy assistant secretary at the U.S. Treasury Department; and Janiyah Thomas, former Black media director for the Trump campaign.\n\nThe Trump \"pardon czar\" Alice Johnson will also be speaking to the group as will Death Row Records founder Michael Harris.\n\nSeveral high-profile Black conservative influencers are also slated to participate, including CJ Pearson, Xavier DuRousseau and members of The Carter Family, who stream videos on YouTube.\n\nThe Black Conservative Federation was initially founded as a political networking group for Black conservatives but has since expanded its mission to focus on diversifying the conservative movement and promoting conservative principles. The group emphasizes its work in political advocacy, outreach and civic engagement.\n\nTrump addressed the group during a Black History Month event in 2024, signaling a rise in the group’s visibility within MAGA-era Republican circles.\n\nIts leadership includes Rep. Byron Donalds, who serves as chairman, and former NFL player Jack Brewer, the organization’s current co-chairman.","summary":"The Black Conservative Federation is launching a two-day summit in Washington, D.C., next month aimed at uniting and elevating Black conservatives.","url":"https://abcnews.go.com/Politics/black-conservative-leaders-aim-build-generation-washington/story?id=123024284","image":"https://i.abcnewsfe.com/a/c53b0e33-81dd-49fc-804c-b8b9540168fa/lynnpatton2_1750382042958_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-06-20 02:32:37","author":"Beatrice Peterson","authors":["Beatrice Peterson"],"language":"en","category":"politics","source_country":"us","sentiment":0.114},{"id":333258152,"title":"Report: Gavin Newsom’s Actions During the Initial Days of the LA Riots","text":"Governor Gavin Newsom has been a prominent figure in California’s political landscape since the late 1990s. He started as a member of the San Francisco Board of Supervisors from 1997 to 2004, then served as the Mayor of San Francisco from 2004 to 2011. After his mayoral term, Newsom was elected as California’s Lieutenant Governor, a role he held for eight years until he assumed office as the state’s Governor in January 2019.\n\nAs his current term limits conclude, with the next gubernatorial election slated for 2026, speculation grows around potential successors, including former Vice President Kamala Harris as a possible contender. However, Newsom appears uninterested in the prevailing conjectures or endorsements. Instead, there are whispers that his aspirations stretch towards the highest political office—the presidency of the United States.\n\nIn reference to Newsom’s recent controversial speech amid the LA riots, my colleague Bob Hoge opined, “This wasn’t truly a California-focused address. Given his track record, he seems to show little interest in his own state—this was more like his initial move towards the 2028 presidential race. Understanding that his prospects are as volatile as a malfunctioning electric car in downtown Los Angeles, he attempted this speech in a desperate bid to salvage his political ambitions.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nGovernor Gavin Newsom has been a prominent figure in California&#8217;s political landscape&#8230;\n\n\nThis Post: Report: Gavin Newsom&#8217;s Actions During the Initial Days of the LA Riots first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/report-gavin-newsoms-actions-during-the-initial-days-of-the-la-riots/","image":"https://internewscast.com/wp-content/uploads/2025/06/Report-Here039s-What-Gavin-Newsom-Was-Doing-in-the-Early.jpg","video":null,"publish_date":"2025-06-20 01:47:31","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.469},{"id":333271308,"title":"Trump confirms further delay to TikTok ban or sale deadline","text":"President Donald Trump has extended the deadline for TikTok's sale in the US for a further 90 days.\n\nThe video-sharing app has faced questions over its future after the US passed a law last year requiring the app to be banned unless sold by its Chinese parent company, ByteDance.\n\nLawmakers said it posed a risk to national security - something TikTok denies.\n\nTrump, who vowed to save TikTok during his presidential campaign, signed an executive order on Thursday which has delayed the date for enforcing the law for a third time.\n\nIn a statement, TikTok said it was \"grateful for President Trump's leadership and support\" in keeping the app online for its 170m US users.\n\n\"We continue to work with Vice President Vance's Office,\" it added.\n\nA deal for the sale of TikTok in the US by ByteDance must now be reached by 17 September, Trump said in a post on his platform Truth Social.\n\nThe further delay was an expected development in the long-running process of securing a buyer for TikTok.\n\nIt is thought the authorities in Beijing will need to approve any sale or part sale of the app by its parent company.\n\nThe law was prompted by fears in the US that TikTok or ByteDance could be forced to hand over data on US users by the Chinese government.\n\nTrump said on Tuesday he expected there would be a further delay.\n\nWhite House press secretary Karoline Leavitt said on Wednesday that a further 90-day extension would \"ensure this deal is closed so that the American people can continue to use TikTok with the assurance that their data is safe and secure.\"\n\n'Flouting' the law\n\nTrump tried to force a sale of TikTok to an American buyer in 2020, during his first term in office.\n\nBut last year, he signalled he'd had a change of heart, saying the platform had helped him win the 2024 presidential election.\n\n\"I have a warm spot in my heart for TikTok, because I won youth by 34 points,\" Trump said in December, although most young voters backed the Democratic candidate Kamala Harris.\n\nThe law was supposed to take effect on 19 January, a day before Trump's inauguration to a second term in office.\n\nTikTok challenged its constitutionality in the courts. The Supreme Court upheld the law days before it was due to take effect.\n\nSenate Select Committee on Intelligence Vice Chairman Mark Warner, a Democrat, criticized Trump's decision.\n\n\"Once again, the Trump administration is flouting the law and ignoring its own national security findings about the risks posed by a PRC-controlled TikTok,\" Warner said in a statement.\n\n\"An executive order can't sidestep the law, but that's exactly what the president is trying to do,\" Warner added.","summary":"President Donald Trump has extended the deadline for TikTok's sale in the US for a further 90 days.","url":"https://www.myjoyonline.com/trump-confirms-further-delay-to-tiktok-ban-or-sale-deadline/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/06/image-791.png","video":null,"publish_date":"2025-06-20 01:43:00","author":"Abubakar Ibrahim,Bbc 43am","authors":["Abubakar Ibrahim","Bbc 43am"],"language":"en","source_country":"gh","sentiment":-0.038},{"id":333256796,"title":"Trump issues ominous warning to workers on Juneteenth as president claims country is wasting 'billions of dollars' on unnecessary benefit","text":"Working-class Americans received a stark warning from President Trump as he celebrated Juneteenth by complaining about the excessive amount of federal holidays. \n\nTrump issued a directive Thursday night that declared the country is wasting too much money on closing business and said he has considered axing future celebrations. \n\n'Too many non-working holidays in America,' he wrote on Truth Social. \n\n'It is costing our Country $BILLIONS OF DOLLARS to keep all of these businesses closed. The workers don’t want it either!' \n\nThe president then speculated that the holiday madness could have a negative impact on the country if something isn't done. \n\n'Soon we’ll end up having a holiday for every once working day of the year,' he said. 'It must change if we are going to, MAKE AMERICA GREAT AGAIN!' \n\nBefore this year's holiday post - which failed to mention Juneteenth - Trump spent years commemorating the day which celebrates the freedom of enslaved African Americans.\n\nHe even once claimed to have made Juneteenth 'very famous.'\n\nTrump honored the holiday in each of his first four years as president, even before it became a federal holiday in 2021. \n\nBut this year, Trump kept silent about the holiday other than his late Truth Social post, despite the significance of the day for black Americans. \n\nAsked whether Trump would commemorate Juneteenth in any way, White House press secretary Karoline Leavitt told reporters: 'I'm not tracking his signature on a proclamation today. \n\n'I know this is a federal holiday. I want to thank all of you for showing up to work. We are certainly here. We're working 24/7 right now.' \n\nJuneteenth, also referred to as Freedom Day or Emancipation Day, commemorates June 19, 1865, when Union soldiers brought the news of freedom to enslaved Black people in Galveston, Texas. \n\nTheir freedom came more than two years after President Abraham Lincoln liberated slaves in the Confederacy by signing the Emancipation Proclamation during the Civil War. \n\nIn 2020, Trump sought to woo black voters with a series of campaign promises, including vowing to establish Juneteenth as a federal holiday.\n\nAfter he lost the election, Biden went on to sign the legislation declaring Juneteenth the newest federal holiday.\n\nIn the past week, Trump has in some way acknowledged Father's Day, Flag Day, National Flag Week and the 250th anniversary of the Battle of Bunker Hill.\n\nNone of these days are among of the 11 national holidays: New Year's Day, Martin Luther King Jr.'s Birthday, Presidents' Day, Memorial Day, Juneteenth, Independence Day, Labor Day, Columbus Day, Veterans Day, Thanksgiving Day, and Christmas Day.\n\nIn 2017, Trump celebrated the 'soulful festivities and emotional rejoicing' when in 1865 a major general delivered the news to a Galveston crowd that all enslaved people were free.\n\nHe told the Galveston story in each of the next three years.\n\n'Together, we honor the unbreakable spirit and countless contributions of generations of African Americans to the story of American greatness,' he said in his 2018 statement.\n\nA year later, he said: 'Across our country, the contributions of African Americans continue to enrich every facet of American life.'\n\nHis 2020 statement read: 'June reminds us of both the unimaginable injustice of slavery and the incomparable joy that must have attended emancipation. \n\n'It is both a remembrance of a blight on our history and a celebration of our Nation's unsurpassed ability to triumph over darkness.'\n\nIn 2020, however, Trump chose the controversial location of Tulsa, Oklahoma, as the place to hold a rally following the Covid pandemic. That decision for that venue met with fierce criticism. \n\nIn Tulsa in 1921, a white mob looted and burned that city's Greenwood district, an economically thriving area referred to as Black Wall Street.\n\nAs many as 300 Black Tulsans were killed, and thousands were temporarily held in internment camps overseen by the National Guard. \n\nBlack leaders argued it was offensive for Trump to choose June 19 and Tulsa for a campaign event. \n\nDays before the rally, Trump tried to put a positive spin on the situation by claiming that he had made Juneteenth 'famous.' \n\nHe said he changed the rally date out of respect for two African American friends and supporters.\n\n'I did something good. I made it famous. I made Juneteenth very famous,' Trump said. \n\n'It's actually an important event, it's an important time. But nobody had heard of it. Very few people have heard of it.'\n\nGenerations of Black Americans celebrated Juneteenth long before it became a federal holiday in 2021. \n\nBiden issued annual Juneteenth proclamations during his four years in office, and observed some of the holidays with large concerts on the South Lawn. \n\nBiden's final observance in 2024 featured performances by Gladys Knight and Patti LaBelle. Vice President Kamala Harris danced onstage with gospel singer Kirk Franklin. \n\nTrump, menawhile, has made sweeping orders ending diversity, equity and inclusion initiatives across the federal government, calling them 'illegal and immoral discrimination programs.","summary":"Working class Americans received a stark warning from President Trump as he celebrated Juneteenth.","url":"https://www.dailymail.co.uk/news/article-14830329/trump-juneteenth-warning-national-holidays-canceled.html","image":"https://i.dailymail.co.uk/1s/2025/06/20/01/99552705-0-image-a-212_1750378433078.jpg","video":null,"publish_date":"2025-06-20 01:39:43","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.065},{"id":333530278,"title":"The View host reveals wild new details about Kamala Harris interview that 'took down the Democratic Party'","text":"Sonny Hostin said she feels 'terrible' that she 'took down the Democratic Party' by asking Kamala Harris to name what she would have done different to Joe Biden in the White House. \n\nHarris infamously told the liberal gabfest that there was nothing she would change from how her boss governed.\n\n'There is not a thing that comes to mind,' Harris said.\n\nHarris justified her reason for keeping to Biden's record by noting: 'I've been a part of most of the decisions that have had impact.'\n\nSpeaking to the show's producer Brian Teta on its 'Behind the Table' podcast, Hostin claimed she was right to ask the question but hated the impact it had on the election. \n\nTeta asked if she expected it to become a viral moment, to which Hostin answered: 'I knew it instantly when she answered it.'\n\nThe left-leaning host admitted she desperately flailed to try and save Harris with another question on the subject. \n\n'Which is why I asked the follow-up question, 'is there one thing?' Because I knew, I could see the soundbite and I knew what was going to happen, but I thought it was a really fair question and I thought it was a question that she would expect.' \n\nHostin, who was openly rooting for Harris, felt even worse when she learned the anecdote ended up in Jake Tapper's bombshell book about the cover-up of Biden's senility. \n\n'And now Jake Tapper wrote it in his book? I feel terrible.'\n\nHostin refused to say it cost Harris the election but Alyssa Farah Griffin, one of the show's conservative panelists, disagreed.\n\n'The Trump campaign put so much ad money behind that specific clip and what they were trying to do is tie her to Biden's unfavorabilities, but more than that, just simply the right-track, wrong-track of the election… They used it to say, 'Well, she's not going to do anything different,'' Griffin said. \n\nAppearing on the popular daytime show just a month before the elections during her truncated campaign, Harris was unsteady in several of her media appearances.\n\nHer comments were made to the hosts of ABC's The View when she appeared on the show in October for a softball interview where she was fawned over. Whoopi Goldberg introduced her as 'the next president of the United States.'\n\nThe Democratic nominee was just as friendly, posing for pictures with the hosts during commercial breaks. \n\nOn the view, her advisor Stephanie Cutter was floored when Harris got asked if there was anything she would have done differently than Biden.\n\n'What the hell was that?' Cutter said she thought at the time. 'That's not what we practiced.'\n\nHer response was also chronicled in the new book Fight: Inside the Wildest Battle for the White House, by reporters Jonathan Allen and Amie Parnes.\n\nIt also tells of other key moments, like a 'cringe' video clip where Harris had to feign surprise at picking up the endorsement of Barack and Michelle Obama. \n\nFailing to identify a single issue where she parted with Biden yoked her even more to the president, who had bowed out after his debate disaster but was also unpopular in opinion polls going back years.\n\nIt denied her the opportunity to hold up a policy difference that might define her as something different beyond being a younger alternative.\n\n'It provided the money shot' for negative ads that would tie link Harris and Biden. 'And it was her own bad moment.' \n\n'When she gave us the gift of the View interview, we were able to anchor her to the Biden administration in her own words, which is something we were trying to do anyway,' a Trump advisor told the authors.\n\nDonald Trump, Jr. was even more forceful, as DailyMail.com reported at the time.\n\n'And just like that, Kamala's entire bull**** campaign about being a 'change agent' collapses. You can't call yourself a change agent when you not only agree with every single disaster Joe Biden is responsible for, but you brag about being involved in all those decisions!,' he wrote on X. \n\nAides had given Harris a list of items that made her 'proud of her work with Biden.'\n\nIt came as party leaders were in a bind, feeling the need to build up Biden for having relinquish power, even while racing to build up Harris's bio for her run on her own after a brief and unsuccessful primary campaign in 2020.\n\nMany of Biden's top aides remained on the campaign, as Harris brought in some of her own people, partly to accommodate the lack of time to set up a new one.","summary":"Harris infamously told the liberal gabfest that there was nothing she would change from how her boss governed.","url":"https://www.dailymail.co.uk/media/article-14830359/The-View-Sonny-Hostin-Kamala-Harris-interview.html","image":"https://i.dailymail.co.uk/1s/2025/06/20/01/99552915-0-image-a-5_1750380595690.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/10/09/6464813919648004523/1024x576_MP4_6464813919648004523.mp4","publish_date":"2025-06-20 01:11:14","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.446},{"id":333252450,"title":"Rod Stewart reveals why he no longer considers Donald Trump a friend","text":"Rod Stewart can't call Donald Trump his friend.\n\n The \"Do Ya Think I'm Sexy\" singer, who has palled around with the president on many occasions as his neighbor in Florida, recently told Radio Times that there's one policy decision that he cannot abide.\n\n When asked if he still considers the 47th president a friend, Stewart responded, \"No, I can't any more. As long as he's selling arms to the Israelis, and he still is. How's that war ever gonna stop?\"\n\n The \"I Don't Want to Talk About It\" musician sharply condemned Israeli President Benjamin Netanyahu's violent campaign in Gaza. \"Someone's gotta do something,\" Stewart said. \"What Netanyahu is doing to the Palestinians is exactly what happened to the Jews. It's annihilation, and that's all he wants to do — get rid of them all. I don't know how they sleep at night.\"\n\n Stewart explained that his home in Palm Beach, Fla., is within spitting distance of Trump's Mar-a-Lago resort. \"I live literally half a mile away,\" the singer said. \"We're both on the beach. I used to go to his Christmas parties. He's always been a bit of a man's man. I liked him for that.\"\n\n However, Stewart noted that some of Trump's behavior alarmed him. \"He didn't, as far as I'm concerned, treat women very well,\" he said. \"But since he became president, he became another guy. Somebody I didn't know.\"\n\n Stewart previously mocked Trump during a 2024 concert in Las Vegas, displaying four photos of his onetime chum with increasingly orange complexions and a message on screen: \"I didn't know he was Orange until a number of years ago, when he happened to turn Orange. I respect either one but he obviously doesn't because all of a sudden he made a turn and he went – he became an Orange person. I think somebody should look into that.\"\n\n The \"orange\" joke came in response to Trump falsely claiming that Kamala Harris \"became Black\" using similar phrasing.\n\n In the Radio Times interview, Stewart said the gag didn't go over well with his audience. \"I had a little joke about him when he had all the tan, you know, the Orange Man. And: 'Boooo!'\"\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n After being knighted by Prince William in 2016, Stewart said he didn't think Trump was cut out for the Oval Office. \"Although he's sort of a friend of mine, I don't think he's presidential,\" he said, according to the Daily Mail. \"I don't think he's made to be a president.\"\n\n After the United States exited the Paris Agreement — the international agreement designed to help curb climate change — Stewart had harsher words for the president.\n\n \"That prick in the White House, pulling out of the Paris Accord is terrible,\" the singer said on the How to Wow podcast in 2020. \"I think the good Lord's intent on wiping us all out because we've spoiled the Earth. We've spoiled it. I think it's too late to turn back now.\"","summary":"The president's Florida neighbor said he cannot make amends with Trump \"as long as he's selling arms to the Israelis, and he still is.\"","url":"https://ew.com/rod-stewart-reveals-why-he-no-longer-considers-donald-trump-a-friend-11758097","image":"https://ew.com/thmb/JPjBD9phDHntlLjxPVqqpwqt6YI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/rod-stewart-donald-trump-1-061925-85d4839663fe47f8942e1d789073b640.jpg","video":null,"publish_date":"2025-06-20 00:39:56","author":"Wesley Stenzel","authors":["Wesley Stenzel"],"language":"en","category":"politics","source_country":"US","sentiment":0.02},{"id":333368074,"title":"How the four tempers of Trump-era news media are hurting Australia","text":"Like all wannabe autocrats, Donald Trump has made it a priority to whip America’s oligarch-owned media into line with a frolicking mix of woe, dread and malice — mobilising their audiences against them, appealing to their billionaire class solidarity, and threatening them with targeted prosecutorial lawfare.\n\nDuring Trump’s last presidential term, most media pushed back, as did The Washington Post, with its declaratory “democracy dies in the darkness”. This time? Outlets, including the once proudly independent, now Jeff Bezos-owned WaPo, are busy adjusting what is (and isn’t) news, moderating their commentary, flattening their journalism, and obeying in advance in the face of the president’s criticisms.\n\nIn both Australia and the United States, legacy media are playing it safe, studiously looking the other way as the Trump administration becomes inexorably more authoritarian. Australia’s media commentariat are (still!) sane-washing the president. They’re eager to get the government into line too, insisting for the past week that the traditional prime-minister-to-president sit-down is the defining test for the Albanese government.\n\nThe conflict-as-news addiction of television news boosts Trump’s rhetoric and the street clashes over large-scale deportations onto high rotation. Occasional violence — like the sporadic moments in the Los Angeles protests — gets coverage in both Australia and the US disproportionate to its scale.\n\nAcross Australia’s legacy media, the “news” of the moment is the almost wholly Murdoch-media-confected panic about defence spending, manufactured in a line that runs directly from former Fox News host (and now “angry, unkempt, and tentative” US Defense Secretary) Pete Hegseth. \n\nThis runs through The Australian all the way to the masthead’s Greg Sheridan on Insiders this past weekend, helped along with uncritical reporters straight-facedly quoting the self-interested rhetoric from the defence establishment’s astroturfed front group, the Australian Strategic Policy Institute. It’s all good fun until it crashes into the Canberra media’s obsessive budget deficit fetishism — the result being a guns-not-butter wedging of the government.\n\nFor much of Australian media, it’s just “streamlined corporate alignment”, as the suits would say. Most of our commercial media is owned or controlled by Trump-dependent US oligarchs — like the Murdochs or Ten’s owner, Paramount Global president Shari Redstone. For the rest, it’s the legacy media spinning in a steady-state orbit, trapped by the gravitational force of the“news values” set in the imperial centre.\n\nJust how are the once strutting media moguls being pulled into line? As ever, under reality TV star Trump, life imitates art. Think of the streaming hit Severance and the show’s tempers: woe, frolic, dread and malice. For the Murdochs, it’s the woe of losing their cultural and political power over their right-wing audience to Trump — and of the US$787 million they’ve already had to pay for amplifying Trump’s stolen election trope under fear of losing that audience back in 2020.\n\nLast week came suggestions of more woe to come, with speculation that the drop-in from Vice President JD Vance at Rupert’s Montana hideaway came with Trump complaints about the “China-oriented” Wall Street Journal.\n\nFor the owner of Paramount (and Ten) Shari Redstone, it’s the dread of the demand for damages over a CBS Kamala Harris interview last year that her own board fear could look like a bribe (according to a report in the Murdochs’ New York Post) — all while she’s attempting to pull off the sale of her company to Trump-friendly billionaire David Ellison’s Skydance. A similar complaint from Trump about Disney’s ABC network won him a quick US$16 million payout late last year.\n\nParamount’s dread resulted in the broadcaster sacking White House reporter Terry Moran last week for a post that said the driver of the administration’s deportations, Trump offsider Stephen Miller, “is a man who is richly endowed with the capacity for hatred”. No wonder Paramount’s Ten Network decided to get out of the commentary game last week by closing The Project.\n\nJust a month back, Elon Musk thought it was all a frolic, as he played with the anti-migrant semiotics of the Nazi-saluting right (on his personal network, formerly known as Twitter); and malice (that’s Trump himself, of course, demanding the US oligarchs follow along in his vendettas).\n\nWith last week’s grovelling apology to Trump with “my posts … went too far”, Musk had to demonstrate that he’s discovered the malice at the heart of the authoritarian mindset that can flip even the world’s richest man from all-but co-ruling oligarch to pandering courtier.\n\nIt’s not just the news choices that are changing. It’s journalistic style, too, with directness eviscerated with the blunt knife of the passive voice that dictates a reporter “is shot”, or a senator “is wrestled” to the ground. As every baby journalist is taught, the passive voice misses the key news point of power; just “who” was it that did the “what” to “whom”?\n\nBut for a cowed legacy media, that grammatical looseness brings a benefit: if we don’t know “who”, we can’t ask: “why?”","summary":"The Trump administration's masterful manipulation of the US' legacy media maligns Australian news and throws us all into the dark.\n\n\nThe post How the four tempers of Trump-era news media are hurting Australia appeared first on Crikey.","url":"https://www.crikey.com.au/2025/06/20/donald-trump-news-media-severance-tempers-news-corp/","image":"https://www.crikey.com.au/wp-content/uploads/sites/3/2025/06/Trump-tempers_1680x945.jpg?quality=70&w=1024","video":null,"publish_date":"2025-06-19 22:56:17","author":"Christopher Warren","authors":["Christopher Warren"],"language":"en","source_country":"au","sentiment":0.031},{"id":333231584,"title":"Paramount stalls $35 million '60 Minutes' settlement, slowing merger","text":"June 19 (UPI) -- Paramount has pulled back on a $35 million settlement with President Donald Trump after he sued the media company over a segment on CBS' News' \"60 Minutes.\"\n\nThe lawsuit alleges that the program edited an interview with Democratic presidential nominee Kamala Harris ahead of the 2024 election to change how she would appear to viewers.\n\nThe stalled settlement is holding up a potential $8 billion takeover of Paramount by Skydance, a deal that the two companies negotiated over a year ago.\n\nDespite the legal wrangling, Trump has said he is encouraged by the proposed merger in its current form, and endorsed the deal proposed by Skydance's David Ellison.\n\n\"Ellison is great,\" Trump told reporters on the White House lawn Wednesday. He'll do a great job with it.\"\n\nTrump seemed to have connected the delay in the deal to his Paramount lawsuit.\n\nThe internal debate over the Trump lawsuit and the way it was being handled prompted CBS News President Wendy McMahon to resign in May, saying in a memo that she and the company could not agree on a path forward.\n\nThe Paramount-Skydance deal has been pending review by the Federal Communications Commission since last fall.","summary":"Paramount has pulled back on a $35 million settlement with President Donald Trump after he sued the media company over a segment on CBS' News' \"60 Minutes.\"","url":"https://www.upi.com/Top_News/US/2025/06/19/paramount-stalles-35m-trump-settlement/7591750371277/","image":"https://cdnph.upi.com/ph/st/th/7591750371277/2025/upi/340867f7b2dafbac74b9e989100e878b/v1.2/Paramount-stalls-35-million-60-Minutes-settlement-slowing-merger.jpg","video":null,"publish_date":"2025-06-19 22:50:17","author":"Mark Moran","authors":["Mark Moran"],"language":"en","source_country":"us","sentiment":-0.26},{"id":333221448,"title":"Trump is silent about Juneteenth on a day he previously honored as president","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it “famous.”\n\nBut on this year’s Juneteenth holiday on Thursday, the usually talkative president kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again.\n\nNo words about it from his lips, on paper or through his social media site.\n\nAsked whether Trump would commemorate Juneteenth in any way, White House press secretary Karoline Leavitt told reporters: “I’m not tracking his signature on a proclamation today. I know this is a federal holiday. I want to thank all of you for showing up to work. We are certainly here. We’re working 24/7 right now.”\n\nAsked in a follow-up question whether Trump might recognize the occasion another way or on another day, Leavitt said, “I just answered that question for you.”\n\nTrump’s silence was a sharp contrast from his prior acknowledgement of the holiday. Juneteenth celebrates the end of slavery in the United States by commemorating June 19, 1865, when Union soldiers brought the news of freedom to enslaved Black people in Galveston, Texas. Their freedom came more than two years after President Abraham Lincoln liberated slaves in the Confederacy by signing the Emancipation Proclamation during the Civil War.\n\nTrump’s quiet on the issue also deviated from White House guidance that Trump planned to sign a Juneteenth proclamation. Leavitt didn’t explain the change. Trump held no public events Thursday, but he shared statements about Iran, the TikTok app and Fed chairman Jerome Powell on his social media site.\n\nHe had more to say about Juneteenth in yearly statements in his first term.\n\nIn 2017, Trump invoked the “soulful festivities and emotional rejoicing” that swept through the Galveston crowd when a major general delivered the news that all enslaved people were free.\n\nHe told the Galveston story in each of the next three years. “Together, we honor the unbreakable spirit and countless contributions of generations of African Americans to the story of American greatness,” he added in his 2018 statement.\n\nIn 2019: “Across our country, the contributions of African Americans continue to enrich every facet of American life.” In 2020: “June reminds us of both the unimaginable injustice of slavery and the incomparable joy that must have attended emancipation. It is both a remembrance of a blight on our history and a celebration of our Nation’s unsurpassed ability to triumph over darkness.”\n\nIn 2020, after suspending his campaign rallies because of the coronavirus pandemic, Trump chose Tulsa, Oklahoma, as the place to resume his public gatherings and scheduled a rally for June 19. But the decision met with such fierce criticism that Trump postponed the event by a day.\n\nBlack leaders had said it was offensive for Trump to choose June 19 and Tulsa for a campaign event, given the significance of Juneteenth and Tulsa being the place where, in 1921, a white mob looted and burned that city’s Greenwood district, an economically thriving area referred to as Black Wall Street. As many as 300 Black Tulsans were killed, and thousands were temporarily held in internment camps overseen by the National Guard.\n\nIn an interview with The Wall Street Journal days before the rally, Trump tried to put a positive spin on the situation by claiming that he had made Juneteenth “famous.” He said he changed the rally date out of respect for two African American friends and supporters.\n\n“I did something good. I made it famous. I made Juneteenth very famous,” Trump said. “It’s actually an important event, it’s an important time. But nobody had heard of it. Very few people have heard of it.”\n\nGenerations of Black Americans celebrated Juneteenth long before it became a federal holiday in 2021 with the stroke of President Joe Biden’s pen.\n\nLater in 2020, Trump sought to woo Black voters with a series of campaign promises, including establishing Juneteenth as a federal holiday.\n\nHe lost the election, and that made it possible for Biden to sign the legislation establishing Juneteenth as the newest federal holiday.\n\nLast year, Biden spoke briefly at a holiday concert on the South Lawn that featured performances by Gladys Knight and Patti LaBelle. Vice President Kamala Harris danced onstage with gospel singer Kirk Franklin.\n\nBiden was spending this year’s holiday in Galveston, Texas, where he was set to speak at a historic African Methodist Episcopal church.\n\nAssociated Press writer Calvin Woodward contributed to this report.","summary":"He even claimed once to have made Juneteenth “famous.”","url":"https://www.sandiegouniontribune.com/2025/06/19/trump-juneteenth/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/06/Trump_85127-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-19 20:56:24","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.119},{"id":333219950,"title":"Trump is silent about Juneteenth on a day he previously honored as president","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it “famous.”\n\nBut on this year’s Juneteenth holiday on Thursday, the usually talkative president kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again.\n\nNo words about it from his lips, on paper or through his social media site.\n\nAsked whether Trump would commemorate Juneteenth in any way, White House press secretary Karoline Leavitt told reporters: “I’m not tracking his signature on a proclamation today. I know this is a federal holiday. I want to thank all of you for showing up to work. We are certainly here. We’re working 24/7 right now.”\n\nAsked in a follow-up question whether Trump might recognize the occasion another way or on another day, Leavitt said, “I just answered that question for you.”\n\nTrump’s silence was a sharp contrast from his prior acknowledgement of the holiday. Juneteenth celebrates the end of slavery in the United States by commemorating June 19, 1865, when Union soldiers brought the news of freedom to enslaved Black people in Galveston, Texas. Their freedom came more than two years after President Abraham Lincoln liberated slaves in the Confederacy by signing the Emancipation Proclamation during the Civil War.\n\nTrump’s quiet on the issue also deviated from White House guidance that Trump planned to sign a Juneteenth proclamation. Leavitt didn’t explain the change. Trump held no public events Thursday, but he shared statements about Iran, the TikTok app and Fed chairman Jerome Powell on his social media site.\n\nHe had more to say about Juneteenth in yearly statements in his first term.\n\nIn 2017, Trump invoked the “soulful festivities and emotional rejoicing” that swept through the Galveston crowd when a major general delivered the news that all enslaved people were free.\n\nHe told the Galveston story in each of the next three years. “Together, we honor the unbreakable spirit and countless contributions of generations of African Americans to the story of American greatness,” he added in his 2018 statement.\n\nIn 2019: “Across our country, the contributions of African Americans continue to enrich every facet of American life.” In 2020: “June reminds us of both the unimaginable injustice of slavery and the incomparable joy that must have attended emancipation. It is both a remembrance of a blight on our history and a celebration of our Nation’s unsurpassed ability to triumph over darkness.”\n\nIn 2020, after suspending his campaign rallies because of the coronavirus pandemic, Trump chose Tulsa, Oklahoma, as the place to resume his public gatherings and scheduled a rally for June 19. But the decision met with such fierce criticism that Trump postponed the event by a day.\n\nBlack leaders had said it was offensive for Trump to choose June 19 and Tulsa for a campaign event, given the significance of Juneteenth and Tulsa being the place where, in 1921, a white mob looted and burned that city’s Greenwood district, an economically thriving area referred to as Black Wall Street. As many as 300 Black Tulsans were killed, and thousands were temporarily held in internment camps overseen by the National Guard.\n\nIn an interview with The Wall Street Journal days before the rally, Trump tried to put a positive spin on the situation by claiming that he had made Juneteenth “famous.” He said he changed the rally date out of respect for two African American friends and supporters.\n\n“I did something good. I made it famous. I made Juneteenth very famous,” Trump said. “It’s actually an important event, it’s an important time. But nobody had heard of it. Very few people have heard of it.”\n\nGenerations of Black Americans celebrated Juneteenth long before it became a federal holiday in 2021 with the stroke of President Joe Biden’s pen.\n\nLater in 2020, Trump sought to woo Black voters with a series of campaign promises, including establishing Juneteenth as a federal holiday.\n\nHe lost the election, and that made it possible for Biden to sign the legislation establishing Juneteenth as the newest federal holiday.\n\nLast year, Biden spoke briefly at a holiday concert on the South Lawn that featured performances by Gladys Knight and Patti LaBelle. Vice President Kamala Harris danced onstage with gospel singer Kirk Franklin.\n\nBiden was spending this year’s holiday in Galveston, Texas, where he was set to speak at a historic African Methodist Episcopal church.\n\nAssociated Press writer Calvin Woodward contributed to this report.","summary":"He even claimed once to have made Juneteenth “famous.”","url":"https://www.ocregister.com/2025/06/19/trump-juneteenth/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/Trump_85127-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-19 20:56:24","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.119},{"id":333432506,"title":"Trump is silent about Juneteenth on a day he previously honored as president","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it “famous.”\n\nBut on this year’s Juneteenth holiday on Thursday, the usually talkative president kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again.\n\nNo words about it from his lips, on paper or through his social media site.\n\nAsked whether Trump would commemorate Juneteenth in any way, White House press secretary Karoline Leavitt told reporters: “I’m not tracking his signature on a proclamation today. I know this is a federal holiday. I want to thank all of you for showing up to work. We are certainly here. We’re working 24/7 right now.”\n\nAsked in a follow-up question whether Trump might recognize the occasion another way or on another day, Leavitt said, “I just answered that question for you.”\n\nOn Wednesday, Black community leaders from across the country, senior Trump administration officials and other individuals met at the White House to discuss improving coordination between the leaders and federal, state and local partners, according to a senior White House official. Housing Secretary Scott Turner and Lynne Patton, director of minority outreach, were among those who attended, said the official, who insisted on anonymity to discuss a private gathering.\n\nThe Republican president’s silence was a sharp contrast from his prior acknowledgement of the holiday. Juneteenth celebrates the end of slavery in the United States by commemorating June 19, 1865, when Union soldiers brought the news of freedom to enslaved Black people in Galveston, Texas. Their freedom came more than two years after President Abraham Lincoln liberated slaves in the Confederacy by signing the Emancipation Proclamation during the Civil War.\n\nTrump’s quiet on the issue also deviated from White House guidance that Trump planned to sign a Juneteenth proclamation. Leavitt didn’t explain the change. Trump held no public events Thursday, but he shared statements about Iran, the TikTok app and Fed chairman Jerome Powell on his social media site.\n\nHe had more to say about Juneteenth in yearly statements in his first term.\n\nIn 2017, Trump invoked the “soulful festivities and emotional rejoicing” that swept through the Galveston crowd when a major general delivered the news that all enslaved people were free.\n\nHe told the Galveston story in each of the next three years. “Together, we honor the unbreakable spirit and countless contributions of generations of African Americans to the story of American greatness,” he added in his 2018 statement.\n\nIn 2019: “Across our country, the contributions of African Americans continue to enrich every facet of American life.” In 2020: “June reminds us of both the unimaginable injustice of slavery and the incomparable joy that must have attended emancipation. It is both a remembrance of a blight on our history and a celebration of our Nation’s unsurpassed ability to triumph over darkness.”\n\nIn 2020, after suspending his campaign rallies because of the coronavirus pandemic, Trump chose Tulsa, Oklahoma, as the place to resume his public gatherings and scheduled a rally for June 19. But the decision met with such fierce criticism that Trump postponed the event by a day.\n\nBlack leaders had said it was offensive for Trump to choose June 19 and Tulsa for a campaign event, given the significance of Juneteenth and Tulsa being the place where, in 1921, a white mob looted and burned that city’s Greenwood district, an economically thriving area referred to as Black Wall Street. As many as 300 Black Tulsans were killed, and thousands were temporarily held in internment camps overseen by the National Guard.\n\nIn an interview with The Wall Street Journal days before the rally, Trump tried to put a positive spin on the situation by claiming that he had made Juneteenth “famous.” He said he changed the rally date out of respect for two African American friends and supporters.\n\n“I did something good. I made it famous. I made Juneteenth very famous,” Trump said. “It’s actually an important event, it’s an important time. But nobody had heard of it. Very few people have heard of it.”\n\nGenerations of Black Americans celebrated Juneteenth long before it became a federal holiday in 2021 with the stroke of President Joe Biden’s pen.\n\nLater in 2020, Trump sought to woo Black voters with a series of campaign promises, including establishing Juneteenth as a federal holiday.\n\nHe lost the election, and that made it possible for Biden to sign the legislation establishing Juneteenth as the newest federal holiday.\n\nLast year, Biden spoke briefly at a holiday concert on the South Lawn that featured performances by Gladys Knight and Patti LaBelle. Vice President Kamala Harris danced onstage with gospel singer Kirk Franklin.\n\nBiden was spending this year’s holiday in Galveston, Texas, where he was set to speak at a historic African Methodist Episcopal church.\n\nAssociated Press writer Calvin Woodward contributed to this report.","summary":"He even claimed once to have made Juneteenth “famous.”","url":"https://www.bostonherald.com/2025/06/19/trump-juneteenth/","image":"https://www.bostonherald.com/wp-content/uploads/2025/06/Trump_85127-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-06-19 20:56:24","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.396},{"id":333411352,"title":"Report: CBS delays settling Trump lawsuit over possible ‘legal backlash’","text":"A newly published report says that CBS parent Paramount is hesitating to settle a lawsuit brought by President Donald Trump over the network’s decision to edit a Kamala Harris interview during last year’s presidential race, eliminating her word salad response and inserting a coherent statement.\n\nThe report in the New York Post confirms it’s because the corporation fears accusations of bribery should Democrats take over the U.S. House in the 2026 elections.\n\nThat fear is because there have been charges, without evidence, that the Trump administration’s Federal Communications Commission may not approve a pending merger involving Paramount absent a settlement.\n\nThe report said, “Approval of the deal by Trump’s regulators at the Federal Communications Commission is seen as contingent on settlement of the case, people at Paramount tell The Post. Trump legal reps and officials deny that the two issues are related, but Paramount executives are concerned that any large settlement would be considered a bribe since the fate of the $8 billion Paramount-Skydance merger is at stake.”\n\nThe report said Trump’s legal team had tried to settle for $50 million, but then reportedly agreed to the slightly lower figure.\n\n“(The Trump people) appeared to be willing to settle for less, but even that amount worries the Paramount people,” one deal insider was quoted in the Post report.\n\nMeanwhile, the report said a source close to the Trump legal team denied the $35 million figure was acceptable.\n\n“CBS has denied the charges and the main allegation that it purposely edited the Kamala Harris interview to edit out her famous ‘word salad’ vernacular to make her sound more presidential,” the report said.\n\nMedia heiress Shari Redstone is wanting to sell Paramount to independent studio Skydance, and she has indicated previously her willingness to pay as much as $50 million to end the case.\n\nShe’s wants to “preserve some semblance of her inheritance from her late father, media mogul Sumner Redstone.”\n\nEarlier, the Disney-owned ABC settled a Trump lawsuit, over anchor George Stephanopolous’ claims Trump was guilty of “rape,” paying $15 million.\n\n“Skydance is run by movie maven David Ellison, the son of Trump friend and Oracle co-founder Larry Ellison, who is worth approximately $250 billion,” the report said.\n\nThe report noted, “A Paramount spokesman declined comment. A legal rep for Trump didn’t return a request for comment. A Redstone rep didn’t return a request for comment.”\n\nDemocrats in Congress already have “raised the bribery issue and the worry is that a state attorney general or Congress — if it changes hands in the midterms — could launch an investigation,” the report said.","summary":"Fight is over network's editing of Kamala Harris' interview to remove meandering 'word salad'","url":"https://www.wnd.com/2025/06/report-cbs-delays-settling-trump-lawsuit-possible-legal/","image":"https://www.wnd.com/wp-content/uploads/2024/10/kamala-harris-upset-sad-distressed-jpg.jpg","video":null,"publish_date":"2025-06-19 20:54:16","author":"Bob Unruh","authors":["Bob Unruh"],"language":"en","category":"politics","source_country":"us","sentiment":-0.109},{"id":333373892,"title":"Trump is silent about Juneteenth on a day he previously honored as president","text":"WASHINGTON (AP) — President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it “very famous.” \n\nBut on this year’s Juneteenth holiday on Thursday, the usually talkative president kept silent about a day important to Black Americans for marking the end of slavery in the country he leads again.\n\nNo words about it from his lips, on paper or through his social media site. \n\nAsked whether Trump would commemorate Juneteenth in any way, White House press secretary Karoline Leavitt told reporters: “I’m not tracking his signature on a proclamation today. I know this is a federal holiday. I want to thank all of you for showing up to work. We are certainly here. We’re working 24/7 right now.”\n\nAsked in a follow-up question whether Trump might recognize the occasion another way or on another day, Leavitt said, “I just answered that question for you.” \n\nOn Wednesday, Black community leaders from across the country, senior Trump administration officials and other individuals met at the White House to discuss improving coordination between the leaders and federal, state and local partners, according to a senior White House official. Housing Secretary Scott Turner and Lynne Patton, director of minority outreach, were among those who attended, said the official, who insisted on anonymity to discuss a private gathering. \n\nThe Republican president’s silence was a sharp contrast from his prior acknowledgement of the holiday. Juneteenth celebrates the end of slavery in the United States by commemorating June 19, 1865, when Union soldiers brought the news of freedom to enslaved Black people in Galveston, Texas. Their freedom came more than two years after President Abraham Lincoln liberated slaves in the Confederacy by signing the Emancipation Proclamation during the Civil War. \n\nTrump’s quiet on the issue also deviated from White House guidance that Trump planned to sign a Juneteenth proclamation. Leavitt didn’t explain the change. Trump held no public events Thursday, but he shared statements about Iran, the TikTok app and Fed chairman Jerome Powell on his social media site.\n\nIn the evening, Trump complained on the site about “too many non-working holidays” and said it is “costing our Country $BILLIONS OF DOLLARS to keep all of these businesses closed.” But most retailers are open on Juneteenth while most federal workers get a day off because the government is closed.\n\nHe had more to say about Juneteenth in yearly statements in his first term. \n\nIn 2017, Trump invoked the “soulful festivities and emotional rejoicing” that swept through the Galveston crowd when a major general delivered the news that all enslaved people were free.\n\nHe told the Galveston story in each of the next three years. “Together, we honor the unbreakable spirit and countless contributions of generations of African Americans to the story of American greatness,” he added in his 2018 statement.\n\nIn 2019: “Across our country, the contributions of African Americans continue to enrich every facet of American life.” In 2020: “June reminds us of both the unimaginable injustice of slavery and the incomparable joy that must have attended emancipation. It is both a remembrance of a blight on our history and a celebration of our Nation’s unsurpassed ability to triumph over darkness.”\n\nIn 2020, after suspending his campaign rallies because of the coronavirus pandemic, Trump chose Tulsa, Oklahoma, as the place to resume his public gatherings and scheduled a rally for June 19. But the decision met with such fierce criticism that Trump postponed the event by a day. \n\nBlack leaders had said it was offensive for Trump to choose June 19 and Tulsa for a campaign event, given the significance of Juneteenth and Tulsa being the place where, in 1921, a white mob looted and burned that city’s Greenwood district, an economically thriving area referred to as Black Wall Street. As many as 300 Black Tulsans were killed, and thousands were temporarily held in internment camps overseen by the National Guard.\n\nIn an interview with The Wall Street Journal days before the rally, Trump tried to put a positive spin on the situation by claiming that he had made Juneteenth “famous.” He said he changed the rally date out of respect for two African American friends and supporters.\n\n“I did something good. I made it famous. I made Juneteenth very famous,” Trump said. “It’s actually an important event, it’s an important time. But nobody had heard of it. Very few people have heard of it.”\n\nGenerations of Black Americans celebrated Juneteenth long before it became a federal holiday in 2021 with the stroke of President Joe Biden’s pen.\n\nLater in 2020, Trump sought to woo Black voters with a series of campaign promises, including establishing Juneteenth as a federal holiday. \n\nHe lost the election, and that made it possible for Biden, a Democrat, to sign the legislation establishing Juneteenth as the newest federal holiday. Shortly after being sworn in for his second term in January, Trump signed an executive order ending diversity, equity and inclusion initiatives across the federal government, calling them “illegal and immoral discrimination programs.” \n\nBiden issued annual Juneteenth proclamations during his four years in office, and observed some of the holidays with large concerts on the South Lawn. Biden’s final observance in 2024 featured performances by Gladys Knight and Patti LaBelle. Vice President Kamala Harris danced onstage with gospel singer Kirk Franklin.\n\nBiden spent this year’s holiday in Galveston, Texas, where he spoke at a historic African Methodist Episcopal church. \n\nAssociated Press writer Calvin Woodward contributed to this report. \n\nDarlene Superville, The Associated Press","summary":"WASHINGTON (AP) — President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday. He even claimed once to have made it “very famous.” But on this year&#8217;s Juneteenth holiday on Thursday, the usually talkative president kept silent about a day important to Black Americans [&#8230;]","url":"https://toronto.citynews.ca/2025/06/19/trump-is-silent-about-juneteenth-on-a-day-he-previously-honored-as-president/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/06/701984f77021c8c8c33be11244b7171239da79a1ee01d9c60a6312b45bc354b8.jpg","video":null,"publish_date":"2025-06-19 20:45:40","author":"Darlene Superville,News Staff","authors":["Darlene Superville","News Staff"],"language":"en","category":"politics","source_country":"ca","sentiment":0.258},{"id":333215426,"title":"SALT cap in limbo as House and Senate GOP fail to reach deal on ‘big, beautiful bill’","text":"The House-passed version of the legislation quadruples the cap to $40,000 and only limits deductions for households making more than $500,000 per year.\n\nMullin, a key mediator between House SALT Republicans and Senate Republicans, floated keeping the $40,000 cap but lowering the income limit, according to a source familiar. However, no deal was made, and the SALT Republicans told Mullin they wanted the original deal they negotiated in “good faith” with House Speaker Mike Johnson (R-LA).\n\nIf no deal is reached and the end-of-year tax deadline passes, the SALT cap will be eliminated and expire along with the other 2017 Tax Cuts and Jobs Act provisions that apply to households.\n\nKim told the Washington Examiner ahead of the call with Mullin that she is worried the Republican conference may be heading down the same path it did in 2017 when Congress passed the Tax Cuts and Jobs Act with a low SALT cap.\n\n“When we got this portion of the tax bill wrong in 2017 … and as I reminded our House leadership during the House negotiation times, that we lost a few of our Republican colleagues, especially where I am in Orange County, because we didn’t do this right,” Kim told the Washington Examiner ahead of the call with Mullin. “We reminded the speaker and the leadership that that is the fate that we may be committing if the SALT Caucus does not get a win on this one and we do not get this right.”\n\nKim added that part of the deal made between the SALT Caucus and Johnson included the speaker supporting it in the Senate. Johnson told Senate Republicans he hoped they would make minimal changes to the reconciliation legislation so it could get to President Donald Trump’s desk by July 4.\n\nHowever, the Senate is not as keen on SALT as the House is, and a drop in the cap is expected once it hits the upper chamber. However, reverting to the current $10,000 level has angered many in the SALT Caucus, including Lawler and Rep. Nick LaLota (R-NY).\n\nBoth have said they are “done negotiating” and that if the reconciliation bill comes back to the House without the negotiated $40,000 cap, it is “DEAD ON ARRIVAL.” \n\nSome Republicans, including the hard-right House Freedom Caucus and its like-minded Senate counterparts, have argued against raising the SALT cap, accusing it of subsidizing blue states and wasting federal money.\n\nHowever, New York and California Republicans have pushed back on this.\n\n“What we’ve asked for was something that was reasonable and fair, that focused on middle-class families and is supported by the Republican principle of allowing taxpayers to keep more of their hard-earned money,” Rep. Nicole Malliotakis (R-NY) told the Washington Examiner. \n\n“This idea of subsidizing blue, poorly-run blue states is a fallacy,” Malliotakis added. “It’s a fallacy. Why? Because New Yorkers pay more to the federal government in taxes than they receive. The people who are being subsidized are the ones who are receiving refundable tax credits, which are still in this bill. So, if we’re going to be doing that, then we should be doing the SALT relief.”\n\nLawler, who represents a swing district won by former Vice President Kamala Harris in the 2024 election, has said over the last few months that Republicans should remember that they wouldn’t even be in the majority without seats such as his.\n\nThough the Freedom Caucus is typically the rabblerousers in the House, the SALT Caucus stepped up during the reconciliation process and has the ability to demand significant legislative changes.\n\nREPUBLICANS FRUSTRATED AS TRUMP IGNORES TIKTOK LAW AGAIN \n\nBecause of the House’s razor-thin margins, the SALT and Freedom caucuses have the numbers to essentially tank the entire bill if they don’t get what they want. \n\nCurrently, Johnson can afford to lose three seats to pass the legislation along party lines, with that number fluctuating depending on Democrats’ attendance.","summary":"House and Senate Republicans are not close to a deal on raising the state and local tax deductions, leaving the fate of the “one big, beautiful” reconciliation bill up in the air as the lower chamber’s razor-thin margins give SALT Republicans the upper hand. The Washington Examiner confirmed that GOP SALT Caucus co-chairs Young Kim [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3447790/salt-cap-gop-limbo-congress-one-big-beautiful-bill/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/06/AP25155716365872.webp","video":null,"publish_date":"2025-06-19 20:41:49","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","category":"politics","source_country":"US","sentiment":-0.532},{"id":333216106,"title":"New York Times Can’t Contain Itself In Gushing Profile Of Two Of The Democratic Party’s Most Powerful Players","text":"What could be more inspiring than two ultra-wealthy Democrats finding love? Or at least, throwing a wedding.\n\nHuma Abedin, veteran Democratic operative, and Alex Soros, son of leftist megadonor George Soros, tied the knot in a glitzy ceremony on “No Kings Day.” But their romance is more than a romance – it’s a blueprint for brokering peace between Israel and Palestine. That’s the degree of significance you might be inclined to heap on the Abedin-Soros union after reading The New York Times’ gushing coverage of their wedding. (RELATED: Cash-Strapped Democrats Call For Regime Change – But Not In Iran)\n\nThe details of their star-studded love story are laid bare in a profile from the outlet. Wedding guests included Democrats such as former President Bill Clinton, and his wife Hillary, former Vice President Kamala Harris, and her husband Doug Emhoff, and former Speaker Nancy Pelosi. Anna Wintour, Jennifer Lawrence, and Jimmy Fallon numbered among the celebrity attendees. \n\n Alex Soros and Huma Abedin first met at a birthday party for a Rothschild family heiress, according to this NYT puff piece about the wedding they had on “No Kings” day pic.twitter.com/5C1U9Avu4P — Chuck Ross (@ChuckRossDC) June 19, 2025\n\nAbedin had her first substantial conversation with Soros at a birthday party for heiress Nicky Hilton Rothschild held Oct. 13, 2023. Both Abedin and Soros’ moods were soured by the events of Oct. 7. “Ms. Abedin is Muslim; Mr. Soros is Jewish,” The New York Times reminds us. \n\nAbedin had been “mostly single” since her high-profile divorce from disgraced politician Anthony Weiner. Their interaction “left [Abedin] with no reason to think that pattern was about to change.” Abedin did not recognize Soros. When he offered to drive her home, she opted for an Uber instead. When he followed her on Instagram, she did not follow him back. When he direct messaged her, she did not respond. \n\nEvery great romance begins with a string of firm rejections. Maybe Soros charmed her with his adroit DoorDash skills. \n\n“And on Sunday night, I cooked,” Soros said of a shared meal with his future wife. “That means I ordered from Nobu.” At 39, Soros is a millennial, meaning “quirky” haplessness is a native skill. The elder Abedin, 49, was no doubt spellbound.\n\n 🚨EXCLUSIVE PICS: While thousands of leftists protested Trump’s agenda across the country on Saturday, many top Democrats were celebrating the lavish wedding of former Hillary Clinton aide Huma Abedin and Alex Soros, the son of left-wing megadonor George Soros. https://t.co/kr0ySWZuvi pic.twitter.com/SKI6acVuf3 — Daily Caller (@DailyCaller) June 15, 2025\n\nAbedin “brings out a much more joyful, loving side of me,” Soros said, according to The New York Times. “I’m completely vulnerable with her, and she’s kind and warm and nonjudgmental. I’m at the point where she’s a part of me.” Abedin’s public persona does much to conceal her kindness. A recent photoshoot with her then-fiance in The New Yorker elicits not warmth, but arctic frigidity. Maybe she learned it from Hillary Clinton, whom she served as top aide for years. (RELATED: Liberals Squander First Chance To Learn From 2020 Mistakes)\n\nRegardless, the couple has made it work. Religious differences and all. “Ms. Abedin and Mr. Soros signed the ketubah in honor of Mr. Soros’s Jewish faith and the nikah in honor of Ms. Abedin’s Muslim faith in an intimate, interfaith ceremony,” The New York Times writes. Their ceremony was officiated by both a rabbi and a trustee at Muslims for Progressive Values. The trustee is a “certified life cycle celebrant,” according to the outlet. I have many questions. The least of which being: Does this Muslim for Progressive Values celebrate all life cycles, or just human ones? Can I book him for a salmon running ceremony?\n\nPutting aside my ignorance in these matters, I encourage readers to look to Abedin and Soros as an example of intra-faith, intra-generational bridge-building. \n\n“With so much hardship and violence across the world today, it wasn’t an obvious time for a wedding party. But as so many friends shared in their toasts, gathering to celebrate joy and love felt not only right, but necessary,” Abedin said in a wedding speech, according to The New York Times. If two high-powered liberals can put aside their differences and throw a lavish ceremony full of Democrat A-listers, why can’t the nations of Israel and Palestine? \n\nFollow Natalie Sandoval on X: @NatalieIrene03","summary":"Every great romance begins with a string of firm rejections","url":"https://dailycaller.com/2025/06/19/huma-abedin-hillary-clinton-alex-soros-george-soros-democrat-wedding-party-new-york-times/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/06/GettyImages-2216172557-scaled-e1750361759717.jpg","video":null,"publish_date":"2025-06-19 20:19:23","author":"Natalie Sandoval","authors":["Natalie Sandoval"],"language":"en","category":"politics","source_country":"US","sentiment":0.426},{"id":333437176,"title":"What if Kamala Harris had won? | Letter","text":"Every morning, I pick up the paper at my front door, scan the headlines, and put it aside in disgust. Then in the evening I watch the world news and again feel the same hopeless despair. The news is not good and doesn’t appear to be getting any better.\n\nRecently, though, I’ve been wondering: What if Kamala Harris had won the 2024 election?\n\n• Would we be reading every day about the snarky exchanges between her and her best friends?\n• Would she hold press conferences to display her signature on some scary, new directive that might negatively affect huge numbers of innocent, powerless people – the immigrants, the elderly, the uninsured, the homeless?\n• Would there be major rallies every weekend around the world protesting her policy decisions?\n• Would we, as a nation, have lost our positive standing and influence as a world leader?\n• Would we be ridiculed and ignored by leaders of other, more powerful nations?\n• And, seriously, would Kamala Harris have celebrated her birthday with a multimillion-dollar military parade?\n\nI miss her positive optimism, her smile, her infectious laugh. I miss her thoughtful, intelligent ideas for implementing sound domestic programs that would benefit those most needy among us. I miss her firm, unwavering position towards foreign leaders who aim to overthrow and defeat their less powerful neighbors. But most of all I miss her forward-thinking, joyful vision for this country going forward.\n\nLet’s hope that, the next time around, we have presidential candidates who can deliver on those same policies and promises.\n\nRuth Covell","summary":"Every morning, I pick up the paper at my front door, scan the headlines, and put it aside in disgust. Then in the evening I watch the world news and again feel the same hopeless despair. The news is not good and doesn’t appear to be getting any better. Recently, though, I’ve been wondering: What [&#8230;]","url":"https://www.centralmaine.com/2025/06/19/what-if-kamala-harris-had-won-the-2024-election-letter/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2023/10/CMlogo_white.png","video":null,"publish_date":"2025-06-19 20:00:20","author":"Deb Sayer","authors":["Deb Sayer"],"language":"en","source_country":"US","sentiment":0.418},{"id":333213090,"title":"White House has suggestion for Jasmine Crockett after Dem calls Trump supporters 'sick'","text":"White House Press Secretary Karoline Leavitt clapped back against Rep. Jasmine Crockett, D-Texas, after she accused President Donald Trump supporters of being \"sick\" and mentally ill. Speaking with reporters in the White House briefing room on Thursday, Leavitt said, \"It's incredibly derogatory to accuse nearly 80 million Americans of mental illness.\" \"The last time I checked, Jasmine Crockett couldn't dream of winning such a majority of the public as President Trump did,\" she said. \"The America first movement, which President Trump has built, is filled with hardworking patriots. The forgotten men and women, business owners, law enforcement officers, nurses and teachers and Middle America, as we all know from where you all grew up outside of this Beltway. That's who makes up this president's movement,\" said Leavitt. \"And Jasmine Crockett should go to a Trump rally sometime, and she can see it for herself.\" KAROLINE LEAVITT PRESSED ON RAMIFICATIONS OF TRUMP’S MIDDLE EAST FOREIGN POLICY Leavitt also quipped that she hopes Crockett will continue to be a \"rising star\" in the Democratic Party, \"for the Republican Party, at least.\" During a recent interview with Katie Couric, Crockett, one of the leading Democratic voices in the Trump resistance movement, explained Trump’s reelection as being made possible by a national mental health crisis. \"We’ve got a mental health crisis in this country because everyone, no matter how you affiliate yourself, should be against Trump, period. This is not partisan for me,\" said Crockett. The congresswoman also went on to claim that former Vice President Kamala Harris was more qualified to be president than Trump and that he was elected simply on the basis that he is an \"old white man.\" LEAVITT BALKS AT REPORTERS' LA RIOT COVERAGE, 'DISINGENUOUS ATTACK' IN BRIEFING: 'WHAT A STUPID QUESTION' She also said her \"heart breaks for service members\" in the military under Trump because \"the very thing that they signed up to fight against is now their commander-in-chief.\" \"It is really sick and anybody that supports it is also sick,\" said Crockett. During the same interview, Crockett also defended former President Joe Biden's mental acuity, claiming that she \"never saw anything\" from Biden that would have made her wonder about his mental sharpness, and argued that his mental acuity was \"supreme\" to President Donald Trump's. WHITE HOUSE RIPS 'SHAMEFUL' LA RIOTS AS TRUMP STEPS IN WHERE NEWSOM, BASS FAILED, LEAVITT SAYS \"We all slow down. But I will tell you that I will take a broken — or however they want to describe Joe Biden — over Donald Trump any given day, because, number one, I know Joe Biden's heart,\" Crockett said. CLICK HERE TO GET THE FOX NEWS APP Crockett has also recently taken heavy criticism for other comments against Republican leaders, including Texas Governor Greg Abbott, whom she mocked as \"governor hot wheels.\" This comment garnered her wide condemnation given the fact that Abbott is a paraplegic who uses a wheelchair to move about.","summary":"White House Press Secretary Karoline Leavitt fired back at Rep. Jasmine Crockett, D-Texas, after she accused President Donald Trump&apos;s supporters of being mentally ill.","url":"https://www.foxnews.com/politics/white-house-has-suggestion-jasmine-crockett-after-dem-calls-trump-supporters-sick","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/leavitt-crockett.png?ve=1&tl=1","video":null,"publish_date":"2025-06-19 19:56:54","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"US","sentiment":-0.239},{"id":333200342,"title":"Never-before-seen footage from Trump assassination attempt in Butler revealed in documentary","text":"President Donald Trump’s 2024 presidential campaign took a deadly turn when an assassin made an attempt on his life during a July rally in Butler, Pennsylvania. \n\nNow, Fox Nation subscribers can uncover new, previously unreleased footage from the shocking event.\n\nAs shown on Wednesday’s edition of “Fox & Friends,” new drone footage featured in Fox Nation’s “Art of the Surge: The Donald Trump Comeback” captures the scene of the Butler rally, as well as close-up footage of the Secret Service protecting Trump after shots rang out.\n\nAlso shown are shocking videos of the crowd’s reaction as everything unfolded, highlighting the fear of those who were there that day.\n\nIn the episode, Trump reflects on the immense danger he was in at the rally. \n\n“130 yards is like sinking a one-foot putt,” the president said, referring to the distance from which the shots traveled toward him. \n\n“It’s considered really close.”\n\n“Fox & Friends” co-host Lawrence Jones endorsed the Fox Nation show after seeing the striking new video from the harrowing shooting. \n\n“This series is incredible,” he said. \n\n“You get to see never-before-seen footage of that day.”\n\nThe final sixth and seventh episodes of “The Art of the Surge” season two are also now available to stream. \n\nEpisode six, titled “The West Wing,” takes viewers behind-the-scenes of multiple Trump Cabinet member meetings. \n\nExtended footage of conversations is shown featuring Transportation Secretary Sean Duffy, Treasury Secretary Scott Bessent and more as the administration seeks to address some of the most pressing issues facing the United States.\n\nThe seventh episode, titled “Lost Tapes Uncovered,” is a compilation of assorted videos from the vault of the show. \n\nViewers can peek at the Trump campaign team’s real-time reactions to then-Democratic presidential candidate Kamala Harris’ speech at the 2024 Democratic National Convention. \n\nElon Musk’s musings on the 2024 presidential election results with his son X are also shown, giving the audience a new angle into how those on Trump’s team were feeling as the contentious campaign came to a close.\n\nThe full first and second seasons of this dramatic docuseries are now streaming on Fox Nation. \n\nViewers can watch Trump’s historic return to the White House unfold in stunning fashion. \n\nLater episodes of the second season reveal Trump’s Cabinet picks and handling of the first 100 days of his second term.\n\nFox Nation subscribers can enjoy a wealth of other Trump-related content in addition to “The Art of the Surge.” \n\nSeveral streaming specials highlight Trump’s initiatives before or during his second term, including “President Trump: Middle East Trip,” “President Trump’s Cabinet: Sworn In” and “Trump Border Crackdown.”","summary":"In the episode, Trump reflects on the immense danger he was in at the rally.","url":"https://nypost.com/2025/06/19/us-news/never-before-seen-footage-from-trump-assassination-attempt-in-butler-revealed-in-documentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-x622vetyz-1750361778430.jpg?quality=75&strip=all&1750347387&w=1200","video":"https://cdn.jwplayer.com/videos/pfxSJc0r-RyIcpnTz.mp4","publish_date":"2025-06-19 19:40:00","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"zm","sentiment":0.258},{"id":333201898,"title":"Joy Behar hopes to 'actually influence people's thinking' with her criticism of the Trump administration","text":"\"The View\" co-host Joy Behar said she felt an obligation to speak out about President Donald Trump's administration on Wednesday and said she hoped to influence people's thinking during a \"Behind the Table\" discussion. Producer Brian Teta asked Behar, who has been with the show for 26 years, what she likes about doing the ABC talk show and why she's been on it for so long. \"It's because of the freedom to speak my mind, that has always been the attraction,\" she responded, before talking about other parts of her career. \"I like the people I work with, number one, I like everybody.\" \"I also feel an obligation to speak about the administration that we’re in the midst of, and I feel like we’re in a privileged position to say certain things and that we, you know, we can actually influence people’s thinking sometimes, even if it’s a little bit, that we’re in a lot of trouble in this country right now, and that I like the idea that we can say stuff that people will listen to,\" she said. 'THE VIEW' MELTS DOWN OVER LATEST BIDEN BOOK, SLAMS CNN FOR 'HAWKING' IT Behar was also asked about the many political figures she's gotten to interview on the show and about why politicians come on the talk show. \"We can show them the way they are in real life, the way they really are,\" Behar said. \"I've met Hillary Clinton many times. She's different when she's running for office, and she's all scared to make a mistake. When she's herself, she's very funny. She should have come on ‘The View’ more, I think at that time. In fact, somebody screwed her up, somebody in her campaign said, ‘don’t go on,' and it was a big mistake.\" Behar said Clinton was a grandma, wife and mother and was much more than just someone who ran for office. The co-hosts also talked about Sunny Hostin's viral question posed to former Vice President Kamala Harris last year during the 2024 campaign, as Teta joked that the liberal co-host had \"single-handedly taken down the Democratic Party\" when Harris' bungled answer went viral. 'THE VIEW' INSIDER SOUNDS ALARM AS DISNEY BOSS URGES HOSTS TO COOL OFF POLITICAL CHATTER Hostin defended her question about whether Harris would have acted differently at any point during President Joe Biden's first term, saying it was one Harris should have expected. Harris memorably said she couldn't think of anything she'd have done differently than the unpopular Biden, and the soundbite became fodder for the Trump campaign that Harris was more of the same. \"I knew it instantly when she answered it,\" Hostin said during the podcast conversation, when asked by Teta if she knew it would be a viral moment. \"Which is why I asked the follow-up question, ‘is there one thing?’ Because I knew, I could see the soundbite and I knew what was going to happen, but I thought it was a really fair question and I thought it was a question that she would expect.\" Biden appeared on the show in May for one of his first interviews since leaving the White House. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The former president blamed racism and sexism for Harris' loss during the conversation. \"I wasn’t surprised, not because I didn’t think the vice president was the most qualified person to be president,\" Biden said. \"She is. She’s qualified to be President of the United States of America. I was surprised because they went the route of, the sexist route, the whole route. I mean, this is a woman, she’s this, she’s that. I mean, I’ve never seen quite as successful and a consistent campaign undercutting the notion that a woman couldn’t lead the country, and a woman of mixed race.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"&quot;The View&quot; co-host Joy Behar said she felt she had an obligation to speak out against Trump&apos;s administration and hopes to &quot;influence people&apos;s thinking.&quot;","url":"https://www.foxnews.com/media/joy-behar-hopes-actually-influence-peoples-thinking-her-criticism-trump-administration","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/04/931/523/joy-behar-.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-19 19:06:24","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"US","sentiment":-0.156},{"id":333181018,"title":"Arnold Schwarzenegger, Sylvester Stallone ended ‘nasty’ feud to make money","text":"When bulked-up 1980s action stars Arnold Schwarzenegger and Sylvester Stallone were among the biggest celebrities on the planet, they often liked to bad-mouth each other in the press.\n\n“We hated each other,” Schwarzenegger said this week on Radio Andy, Andy Cohen’s SiriusXM show. “We were attacking each other, and saying nasty things about each other.”\n\nBut “The Terminator” star revealed that he and Stallone decided to bury the hatchet for a simple reason. Both entrepreneurial, they saw an opportunity to make a lot of money by working on a movie-related project together.\n\nRemember Planet Hollywood? It was a themed restaurant chain filled with movie props and memorabilia. It was launched in New York City in 1991, soon boasted 60 locations worldwide and was known for its famous celebrity backers, who prominently included Schwarzenegger, Stallone and Bruce Willis.\n\nIn addition to his fame as “Conan the Barbarian” and the future governor of California, Schwarzenegger, 77, also has long been known as a savvy businessman. Schwarzenegger said he began working with restaurateur Robert Earl, known for expanding the Hard Rock Cafe franchise globally, and film producer Keith Barish to create a new entertainment-themed restaurant chain — one that celebrated Hollywood mythology and glamour.\n\n“And the next thing I know, I get a call from my lawyer, who was also Sly’s lawyer, and he said, ‘Arnold, is there any kind of room for Sly on Planet Hollywood?'” Schwarzenegger recalled.\n\n“I said, ‘That’s actually a good idea, because that could bring us together, and I wanted that,” Schwarzenegger said. “At that point I had grown out of my craziness.”\n\n“So, sure enough, we made it work,” Schwarzenegger said. “Then Bruce Willis became part of Planet Hollywood, then Whoopi Goldberg became part of Planet Hollywood, then Chuck Norris.”\n\nThe rivalry between these two self-described “alpha males” began in January 1977, when both were seated at the same table during the Golden Globe Awards, Stallone told Variety in 2017. After Schwarzenegger received the award for best acting debut for his 1976 film “Stay Hungry,” he began “gloating.” Stallone then noticed Schwarzenegger laughing when he lost the best actor for his starring role in “Rocky.”\n\nBut Stallone said he got the last laugh when when “Rocky” won best picture. He also revealed that he picked up a big bowl of flowers and heaved it in Schwarzenegger’s direction.\n\n“I went, ‘OK, the gauntlet is down,'” Stallone said. “This began a 10-year battle royale. I mean, we couldn’t stand to be in the same galaxy.” But ultimately the feud came to an end, after Stallone said they realized they’re both “the same person.”\n\nUnfortunately, the Planet Hollywood glory didn’t last too long. Amid financial problems due partly to a reputation for lackluster food, the company filed for bankruptcy in October 1999, and the number of locations began to decline. As of May 2025, though, three Planet Hollywood restaurants and four hotels continue to operate.\n\nBut Schwarzenegger and Stallone eventually made several movies, including “The Expendables 2” in 2012, which also featured Willis and an ensemble of other aging male action stars such as Chuck Norris and Jean-Claude Van Damme.\n\nThe two men also have long been known for their conservative politics, though Stallone said he’s never identified as a Republican. Meanwhile, Schwarzenegger has long been a registered Republican, though he also has been on the record since 2016 as vehemently opposing Donald Trump and endorsing Kamala Harris in the 2024 election.\n\nStallone did not appear to publicly endorse Trump in the 2024 election. However, following Trump’s victory in November, Stallone attended an event at his Mar-a-Lago club, where he praised him as a “second George Washington” and compared him to his character Rocky Balboa, Variety reported. To thank Stallone for his support, Trump announced that the “Rocky” star would serve in a new role as “Special Ambassador to Hollywood,” sharing the title with pro-Trump actors Jon Voight and Mel Gibson.","summary":"The 2 action stars saw an opportunity to make $$$ by working together on a project celebrating their Hollywood fame.","url":"https://www.mercurynews.com/2025/06/19/arnold-schwarzenegger-sylvester-stallone-ended-nasty-feud-to-make-money/","image":"https://www.mercurynews.com/wp-content/uploads/2025/06/ArnoldSly1.jpeg?w=1024&h=731","video":null,"publish_date":"2025-06-19 17:56:12","author":"Martha Ross","authors":["Martha Ross"],"language":"en","source_country":"us","sentiment":0.189},{"id":333175554,"title":"World News | Some US Restaurants, Servers Oppose Republicans' 'no Tax on Tips' Budget Proposal","text":"Washington, Jun 19 (AP) Some segments of the US restaurant industry don't support President Donald Trump's proposal to eliminate federal taxes on tips, saying it would help too few people and obscure bigger issues in the way tipped workers are paid. The Independent Restaurant Coalition, which represents nearly 100,000 restaurant and bars, has appealed to Congress to reconsider the proposal, which is part of the president's spending bill. Even some workers who rely on tips say they oppose making them tax-deductible. Also Read | What Is ‘Doomsday Plane’? All About the ‘Flying Pentagon’ As America’s E-4B Nightwatch Aircraft Flies to Joint Base Andrews in Washington Amid Israel-Iran Conflict. “I think there's a huge hole in this concept of no tax on tips' because a lot of restaurant workers aren't receiving tips in the first place,” said Elyanna Calle, a bartender in Austin, Texas, and president of the Restaurant Workers United union. “It's not helping most kitchen workers, and oftentimes those are the people who are being paid the least.” Also Read | Israel-Iran Conflict: Amid Iranian Missile Strike, Israeli Stock Market Surges to 52-Week High. Tips included in sprawling tax cuts package For now, making tips tax-free appears to have broad support among lawmakers. Both Trump and his Democratic rival in last year's US presidential election, former Vice President Kamala Harris, campaigned on the concept. The House included it in a tax cuts package approved last month. The bill would eliminate federal income taxes on tips for people working in jobs that have traditionally received them as long as they make less than USD160,000 in 2025. The Senate Finance Committee passed a modified version on Monday. Senators capped deductions at USD 25,000 and want to phase them out for individuals whose income exceeds USD 150,000. Eligibility would be based on earnings as of Dec 31, 2024. Both the House and Senate committee measures would apply through the 2028 tax year. The Finance Committee specified that “cash tips” qualify but said the term applied to tips paid in cash, charged to credit cards or received from other employees under a tip-sharing arrangement. Main industry trade group supports tax-free tips Wary of wading into politics, many restaurant chains contacted by The Associated Press about tax-free tips didn't respond or referred questions to the National Restaurant Association, including Waffle House, The Cheesecake Factory, First Watch and the parent companies of Olive Garden, Applebee's and Chili's. The National Restaurant Association, a trade organization that represents nearly 500,000 US restaurants and bars, applauded the House's passage of Trump's spending bill and said it wants to see tax-free tips. The association estimates the measure would benefit more than 2 million servers and bartenders. But the US restaurant industry has more than 12 million workers, including dishwashers and chefs, according to government data. The Independent Restaurant Coalition says the “no tax on tips” proposal leaves out too many of those workers. A push to eliminate taxes on service charges The coalition wants Congress to eliminate taxes on service charges, which are being used to compensate employees at an increasing number of restaurants. Around 15% of U.S. restaurants add some form of service charge to customers' bills, according to the National Restaurant Association. George Skandalos, a pizza restaurant owner in Moscow, Idaho, was tired of seeing servers count out hundreds of dollars of tips at the end of the night while people in the kitchen scrubbed the floor on their hands and knees. So he started experimenting with different compensation models. Skandalos tried pooling servers' tips and distributing them but ran into rules preventing that. He tried raising his menu prices and explaining that a percentage of each order was going to employee compensation, but customers didn't understand and kept tipping. Skandalos now has a gratuity-free policy at his restaurant, Maialina. He charges a 20 per cent service fee that is distributed to all employees and helps pay for benefits like paid vacation and parental leave. The vast majority of customers appreciate the effort, he said. Skandalos said “no tax on tips” doesn't acknowledge restaurants like his that are trying to distribute pay more equally. He would like to see service charges exempted from taxes. “This bill is a very good start in terms of trying to leave more money in people's pocketbooks, but now let's finish what we started and make it a great thing for the restaurant industry overall,” he said. Tipped workers seek higher wages But Ted Pappageorge, the secretary-treasurer of the Culinary Workers Union Local 226 in Las Vegas, said restaurants should just pay their kitchen workers more to compensate for servers earning tips. “'No tax on tips' is an opportunity for Republicans and Democrats to deliver something to working class folks,” he said. Pappageorge wants Congress to take up a separate bill introduced by Nevada Democrat Steven Horsford that would eliminate taxes on tips but also require restaurants to pay workers at least the federal minimum wage of USD 7.25 per hour. In 43 states, restaurants are currently allowed to pay tipped workers as little as USD 2.13 per hour. Yolanda Garcia, a barista at Resorts World in Las Vegas and a member of the Culinary Workers Union, also supports Horsford's bill. Garcia said she makes USD 33,000 a year, including up to USD 600 per month in tips. Tips are never guaranteed, she said, but if they were tax-free, it would help make up for that uncertainty. “It would help me get more groceries. Right now, the price of everything has gone up,” Garcia said. Calle, the Austin bartender and union leader, said she also benefits from tips, but they're inconsistent. She suspects tipping would decline if the tax-free provision passes, because customers will resent it. For Calle, the underlying problem that must be solved is low base pay. “I think that if we continue to make the shift into relying on tips for people, it gives incentives for companies to not raise wages,” she said. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Some segments of the US restaurant industry don't support President Donald Trump's proposal to eliminate federal taxes on tips, saying it would help too few people and obscure bigger issues in the way tipped workers are paid.","url":"https://www.latestly.com/agency-news/world-news-some-us-restaurants-servers-oppose-republicans-no-tax-on-tips-budget-proposal-6939608.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-19 17:54:12","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.089},{"id":333165636,"title":"Sunny Hostin feels 'terrible' about Kamala Harris fumbling her viral question about differences with Biden","text":"\"The View\" co-host Sunny Hostin defended her viral question to former Vice President Kamala Harris last year that set back her campaign in a new podcast interview, but Hostin said she felt \"terrible\" that it had such an impact. As producer Brian Teta joked on the show's \"Behind the Table\" podcast that Hostin had \"single-handedly taken down the Democratic Party\" with her question to Harris about differences between her and President Joe Biden, the liberal co-host insisted it was fair and something Harris should have expected. Harris joined the co-hosts of \"The View\" in early October 2024 and was asked by Hostin if there was anything she would have done differently than Biden over the course of the presidency. Harris told the co-hosts, \"not a thing comes to mind,\" which was widely criticized and seen by some as a turning point for the campaign, given Biden's unpopularity and Harris avoiding an easy opportunity to create space for herself. \"I knew it instantly when she answered it,\" Hostin said during the podcast conversation, when asked by Teta if she knew it would be a viral moment. \"Which is why I asked the follow-up question, ‘is there one thing?’ Because I knew, I could see the soundbite and I knew what was going to happen, but I thought it was a really fair question and I thought it was a question that she would expect.\" TOP KAMALA HARRIS CAMPAIGN ADVISOR ADMITS SHE WAS FLOORED BY DEMOCRAT'S MAJOR FLUB ON 'VIEW' Hostin had no interest in hurting Harris' chances. The liberal co-host openly supported Harris and also predicted she would easily win the election. Hostin argued she felt Harris needed to express what her administration would look like in contrast with Biden's. \"And now Jake Tapper wrote it in his book?\" she asked her fellow co-host, Alyssa Farah Griffin. \"I feel terrible.\" Teta also asked the co-hosts if they felt Harris' answer really cost her the election. \"No, right?\" Hostin asked the live audience present, as she smiled. Co-host Sara Haines and Teta agreed, as Griffin suggested it did play a role in her loss. \"The Trump campaign put so much ad money behind that specific clip and what they were trying to do is tie her to Biden's unfavorabilities, but more than that, just simply the right-track, wrong-track of the election… They used it to say, 'Well, she's not going to do anything different,'\" Griffin said. BIDEN DENIES TELLING HARRIS THERE COULD BE 'NO DAYLIGHT' BETWEEN THEM, ADDRESSES FORMER VP'S 'VIEW' MOMENT Democratic strategist James Carville said after the election that Harris' loss could be reduced to the viral moment on \"The View.\" \"The country wants something different. And she’s asked, as is so often the case, in a friendly audience, on 'The View,' 'How would you be different than Biden?' That’s the one question that you exist to answer, alright? That is it. That’s the money question. That's the one you want. That’s the one that everybody wants to know the answer to. And you freeze! You literally freeze and say, ‘Well, I can’t think of anything,’\" Carville said last November after Trump's win. At the start of the podcast discussion, Behar quipped, \"it's Sunny's fault she didn't win.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP Hostin said in November she was surprised by Harris' flub, and called it a layup question at the time. \"I was surprised at the answer because it was a question that really could have inured to her benefit. It was a question that could have been a change maker,\" she said.","summary":"Sunny Hostin said she felt terrible about her viral question posed to Kamala Harris on &quot;The View,&quot; but defended asking her to differentiate herself from Joe Biden.","url":"https://www.foxnews.com/media/sunny-hostin-feels-terrible-about-kamala-harris-fumbling-her-viral-question-about-differences-biden","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/harris-pressed-on-the-view-october.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-19 17:08:02","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","source_country":"us","sentiment":-0.054},{"id":333155740,"title":"How Dems really view Trump’s economic approach — and what it means for the 2026 midterms","text":"A plurality of American voters are supportive of President Trump’s economic approach — and nearly one-quarter of Democratic voters are inclined to support House GOP candidates in the 2026 midterms as a result of his trade-focused policies, a new megapoll found.\n\nAt least 22% of Democrats said Trump’s tax-and-tariff agenda makes them more likely to back Republicans in House races next year, a massive Stack Data Strategy multilevel regression and post-stratification poll first reported by Politico Playbook concluded.\n\nA firm 18% of white Democrats also said Trump’s handling of the economy boosts their chances of backing Republicans, compared to 24% of Hispanic Democrats, 27% of black Democrats, and 30% of Asian Democrats, agreeing with that.\n\nDemocrats had hemorrhaged minority voters, particularly male ones in the 2024 election cycle and the megapoll indicates there could be additional opportunities for Republicans on that front.\n\nAdditionally, while only 35% of voters approve of Trump’s handling of the economy, compared to 41% who disapprove — a dramatic turnaround from his high standing during his first term and 2024 campaign — a plurality of voters believe tumult could be worth it.\n\nA considerable 42% of voters argued that economic turbulence could be “worth it in the long-run” compared to 37% who disagreed, per the poll.\n\nOverall, voters surveyed for the poll narrowly favored Democrats over Republicans 44.9% to 43.3%, with 10.2% unsure.\n\nIf the election unfolds that way, Democrats will flip just seven House seats and have a 222 to 212 majority in the lower chamber. Currently, Republicans have a 220 to 212 GOP majority.\n\nThat is not a surprising result. The party in power has lost House seats in every midterm election since 1938, with two exceptions: 1998 and 2002. Republicans are still favored to retain the Senate.\n\nThe poll also found that Trump’s strongest issue was immigration, with a 49% approval to 33% disapproval. Even a quarter of voters who backed former Vice President Kamala Harris in 2024 backed his immigration policy. \n\nThe megapoll was taken before protests and riots against US Immigration and Customs Enforcement (ICE) broke out across Los Angeles. \n\nAdditionally, the massive survey found that key provisions of Trump’s marquee legislative agenda, the One Big Beautiful Bill Act, are popular with voters. \n\nOn net, respondents backed extending the 2017 Tax Cuts and Jobs Act 45% to 20%, and supported boosting border security funding 53% to 21%. \n\nDemocrats have pummeled Republicans over Medicaid reforms in the legislative bundle, but 42% supported the main change of imposing work requirements, compared to 32% who opposed that. \n\nThose findings were published after a brutal Fox News poll that dropped on Wednesday showed voters opposing the One Big Beautiful Bill Act 59% to 38%. \n\nSenate Republicans are currently making modifications to the mammoth bill and are hoping to get it passed by the Fourth of July. \n\nGOP leaders have repeatedly predicted that the One Big Beautiful Bill Act could boost their electoral prospects once they get it over the finish line. \n\nThe Stack Data Strategy survey was taken from May 23 to June 13 and sampled 8,008. The Post has contacted the pollster about the margin of error. \n\nIn late 2023, the firm released a massive survey that found Trump was on pace to beat former President Joe Biden in the Electoral College.","summary":"A considerable 42% of registered voters also told pollsters that President Trump's economic approach could be \"worth it in the long-run\" compared to 37% who disagreed.","url":"https://nypost.com/2025/06/19/us-news/how-dems-really-view-trumps-economic-approach-and-what-it-means-for-the-2026-midterms/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/106766811.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/pfxSJc0r-RyIcpnTz.mp4","publish_date":"2025-06-19 16:59:39","author":"Ryan King","authors":["Ryan King"],"language":"en","source_country":"zm","sentiment":-0.359}]}