{"offset":0,"number":50,"available":394,"news":[{"id":366825328,"title":"Who is Karin Immergut, the Judge Who Blocked Trump's Oregon Troop Plan Twice in Two Days?","text":"A federal judge appointed by President Donald Trump has twice ruled against him in recent days, blocking his efforts to deploy National Guard troops to Oregon. Late on Sunday, Judge Karin J Immergut issued a temporary restraining order halting Trump's plan to send California National Guard units to Portland, Oregon. It was the second time in two days she had sided against the administration. On Saturday, Immergut also blocked the President from federalising the Oregon National Guard, warning that the administration's arguments for doing so \"risk blurring the line between civil and military federal power — to the detriment of this nation.\" Trump Lashes Out at His Own Appointee The infuriated the President, who said: \"I wasn't served well by the people that pick judges.\" \"I appointed the judge, and he goes like that,\" Trump told reporters. \"So, I wasn't served well. Obviously, if he made that decision — Portland is burning to the ground. You have agitators, instigators, all you have to do is look at your television… It's burning to the ground. The governor, the mayor, the politicians, they're petrified for their lives. And that judge, he ought to be ashamed of himself.\" Trump repeatedly referred to the judge as a man during his remarks. White House Deputy Chief of Staff Stephen Miller also attacked the ruling, calling it a \"legal insurrection\" in a post on X. formerly Twitter. Who is Judge Karin J Immergut? Immergut, 64, is a long-serving legal professional with decades of experience in Oregon's judicial system. Born in Brooklyn, New York, she attended Amherst College and earned her law degree from the University of California, Berkeley in 1987. She began her career at the law firm Covington & Burling in Washington, DC, before serving as an assistant US attorney in California from 1988 to 1992. Immergut has spent much of her professional life in Oregon. She worked as an assistant US attorney there from 2001 to 2003 before being nominated by President George W Bush to serve as U.S. attorney for the District of Oregon, a position she held until 2009. Also Read: Trump Just Sent Troops to Oregon — Here's Why California Governor Newsom Says It's 'Authoritarian' From 2009 to 2019, she served as a judge on the Multnomah County Circuit Court in Portland, overseeing felony cases, complex civil matters and death penalty proceedings. In her 2019 questionnaire for the Senate Judiciary Committee, Immergut wrote that she had presided over roughly 250 trials and hundreds of civil motions. \"I have also handled dozens of judicial settlement conferences in both civil and criminal cases,\" she said, noting her work on the court's drug diversion program aimed at rehabilitation. The Senate confirmed her 2019 appointment to the federal bench by voice vote, after the Judiciary Committee advanced her nomination by 20–2. Only Democratic Senators Mazie Hirono of Hawaii and Kamala Harris of California voted against her. Part of the Clinton Impeachment Probe Immergut briefly stepped into the national spotlight in 1998 when she worked as associate independent counsel for Kenneth Starr during the investigation that led to the impeachment of President Bill Clinton. She was one of two lawyers who personally interviewed Monica Lewinsky about her relationship with the president. Critics accused the team of asking invasive questions, but Immergut later defended her approach. She said she needed \"very detailed information about those [sexual] contacts because the perjury allegation was dependent on the details of the President's testimony.\" In May 2024, Chief Justice John Roberts appointed Immergut to a seven-year term on the Foreign Intelligence Surveillance Court (FISC), which reviews government requests to conduct electronic surveillance and searches in national security investigations. Judges on the court undergo additional background checks to handle classified material. She is also listed to teach a Stanford Law School course in 2025 titled \"The Role of the Special Counsel: From Watergate to Jack Smith.\" Immergut's rulings mark the latest judicial pushback against President Trump's attempts to deploy federal forces to US cities. Governor JB Pritzker of Illinois and officials in Oregon have called Trump's deployment plans unconstitutional, setting up an intensifying legal and political showdown. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Immergut's rulings mark the latest judicial pushback against President Trump's attempts to deploy federal forces to US cities","url":"https://www.timesnownews.com/world/us/us-news/who-is-judge-karin-immergut-us-president-donald-trump-oregon-national-guard-article-152953556","image":"https://images.timesnownews.com/thumb/msid-152953557,thumbsize-27492,width-1280,height-720,resizemode-75/152953557.jpg","video":null,"publish_date":"2025-10-07 00:33:24","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.306},{"id":366826688,"title":"Biggest Bombshells From Kamala Harris' Book '107 Days' — Including Biden's 'Reckless' Reelection Bid and How He Failed to Defend Her From Critics","text":"Kamala Harris does not hold back in her new book, calling out the former president several times.\n\nRadarOnline.com can reveal the biggest revelations from 107 Days.Letting Joe Biden Decide on Reelection Was 'Reckless'For Harris, letting Joe and Jill Biden decide on the 46th U.S. president's reelection was foolhardy.\n\n\"'It's Joe and Jill's decision.' We all said that, like a mantra, as if we'd all been hypnotized. Was it grace, or was it recklessness? In retrospect, I think it was recklessness,\" the former vice president wrote in her new book, 107 Days.\n\nKamala added, per the first excerpt shared by The Atlantic, \"The stakes were simply too high. This wasn't a choice that should have been left to an individual's ego, an individual's ambition. It should have been more than a personal decision.\"Why Kamala Harris Never Urged Joe Biden to End His Reelection BidIn 107 Days, Harris admitted for the first time that she could not tell Joe to step aside despite the heightened concerns over his health and age.\n\n\"During all those months of growing panic, should I have told Joe to consider not running? Perhaps,\" Harris wrote. \"But the American people had chosen him before in the same matchup. Maybe he was right to believe that they would do so again.\"\n\nShe explained: \"And of all the people in the White House, I was in the worst position to make the case that he should drop out. I knew it would come off to him as incredibly self-serving if I advised him not to run. He would see it as naked ambition, perhaps as poisonous disloyalty, even if my only message was: Don't let the other guy win.\"\n\nJill, on the other hand, declared she was \"all in\" on her husband's bid to maintain his position as the presumptive Democratic presidential nominee. She told a military crowd in Wilmington, North Carolina, she would back Joe as \"he has always supported [her] career.\"How Kamala Harris Reacted When Joe Biden Barely Mentioned Her in His Oval Office AddressHarris watched Joe's Oval Office exit speech at a hotel, calling the former president's address a \"good one\" that drew \"on the history of the presidency to locate his own place within it.\"\n\nHowever, she took notice of how he barely mentioned her, with her staff pointing out \"it was almost nine minutes into the 11-minute address\" before they heard Harris' name.\n\n\"I want to thank our great vice president, Kamala Harris. She is experienced, she's tough, she's capable. She's been an incredible partner to me and a leader for our country,\" she quoted Joe, adding, \"And that was it.\"Joe Biden's Team Failed to Defend Kamala Harris PubliclyHarris' relationship with the White House and Joe's staff seemed troubled, as she wrote about the alleged profound distrust they held toward her.\n\n\"When Fox News attacked me on everything from my laugh, to my tone of voice, to whom I'd dated in my 20s, or claimed I was a 'DEI hire,' the White House rarely pushed back with my actual résumé: two terms elected D.A., top cop in the second-largest department of justice in the United States, senator representing one in eight Americans,\" she pointed out.\n\nShe also dropped her complaints and expressed frustrations with the White House communications team for failing to fight back and defend her against bad press.\n\nPer Harris, she \"often learned that the president's staff was adding fuel to negative narratives that sprang up around [her].\" Although the stories were \"unfair or inaccurate,\" she alleged Joe's inner circle \"seemed fine with it.\"\n\n\"Indeed, it seemed as if they decided I should be knocked down a little bit more,\" Harris added.Joe Biden's Inner Circle Resented Kamala Harris' PopularityIn her account, Harris said people around Joe \"didn't like the contrast that was emerging,\" recalling how his inner circle was not pleased when the polls showed her rising popularity during the then-president's 2024 campaign.\n\nShe mentioned her Selma, Alabama, speech about the humanitarian crisis in Gaza in her book, noting it was \"vetted and approved\" by the White House and the National Security Council. According to Kamala, the West Wing was reportedly displeased when the address went viral.\n\n\"I was castigated for, apparently, delivering it too well,\" she divulged.\n\nHarris wrote: \"Their thinking was zero-sum: If she's shining, he's dimmed. None of them grasped that if I did well, he did well. That given the concerns about his age, my visible success as his vice president was vital. It would serve as a testament to his judgment in choosing me and reassurance that if something happened, the country was in good hands. My success was important for him. His team didn't get it.\"Joe Biden's Debate Blunder Stemmed From ExhaustionAlthough Harris criticized the reelection bid's \"recklessness\" and the resentment from Joe's aides, she still defended the ex-POTUS while writing about his disastrous debate performance against Donald Trump.\n\n\"Many people want to spin up a narrative of some big conspiracy at the White House to hide Joe Biden's infirmity,\" she shared. \"Here is the truth as I lived it. Joe Biden was a smart guy with long experience and deep conviction, able to discharge the duties of president. On his worst day, he was more deeply knowledgeable, more capable of exercising judgment, and far more compassionate than Donald Trump on his best.\"\n\nRather than attributing it to cognitive decline, Harris suggested Joe's fumble was due to fatigue as the debate happened \"after two back-to-back trips to Europe and a flight to the West Coast for a Hollywood fundraiser.\"\n\nShe strongly highlighted in the book: \"I don't believe it was incapacity. If I believed that, I would have said so. As loyal as I am to President Biden, I am more loyal to my country.\"","summary":"Kamala Harris' new book, '107 Days,' uncovers shocking moments from her whirlwind presidential run during the 2024 election.","url":"https://radaronline.com/p/kamala-harris-book-107-days-biggest-bombshells-joe-biden-reckless/","image":"https://media.radaronline.com/brand-img/AEdkWCEt4/0x0/kamala-harris-new-book-107-days-biggest-bombshells-1759740417991.jpg","video":null,"publish_date":"2025-10-07 00:30:00","author":"Angilene Gacute","authors":["Angilene Gacute"],"language":"en","category":"politics","source_country":"us","sentiment":-0.239},{"id":366825780,"title":"Democratic strategist admits some in party have ‘charisma of watching paint dry’ as they think of ways to reach young men","text":"Democrats are going all out to reach young male voters, after the GOP ate into its traditional advantage with young people during the 2024 election.\n\nStrategies have ranged from the party working with influencers to cover the DNC to surprisingly criticisms of leading Democratic candidates and officeholders.\n\n\"Young men are looking for someone they can have a beer with - someone relatable,\" Democratic strategist Joe Jacobson told Reuters. \"Democrats have good policies, but if your messenger has the charisma of watching paint dry, it doesn't matter.\"\n\nAfter the 2024 election, when the young male vote for Trump rose to 46 percent, up seven points from the previous cycle, many in the Democratic Party went searching for answers.\n\nOne early thesis was that the Democrats needed their own version of the wildly successful podcasts from comedians such as Joe Rogan and Theo Von, ostensibly non-political shows, that nonetheless command a large following among young male conservatives. Both shows featured interviews with Trump during the 2024 election. \n\nOthers have pointed to the activism style of the slain conservative activist Charlie Kirk, who was known for touring the country, holding rollicking rallies with pyrotechnics, and conducting freewheeling debates with large crowds at universities.\n\nFollowing Kirk’s shooting death last month, President Trump praised the Turning Point USA founder as someone who understood the “heart of the youth” and helped recruit a new generation of students and young people more broadly into the conservative movement. \n\nThe Democrats have had an influencer program since last year, but it seems an already-elected official has so far been the most prominent example of adopting new school political outreach tactics: California Governor Gavin Newsom.\n\nThe liberal stalwart has taken to aping Trump’s meme-heavy, often inflammatory style on social media, while hosting a podcast where he interviewed and debated conservative figures, including former Trump advisor Steve Bannon and Kirk himself. \n\nThe Democratic search for the young male vote comes amid a larger feeling of disaffection from young people in general.\n\nA 2024 analysis from the firm PRRI found that more young men and women considered themselves independent or “other” than a member of either establishment party. \n\nA spring 2025 youth poll from Harvard found that more than four in 10 Americans under 30 say they are “barely getting by” financially. A mere 15 percent believe the country is heading in the right direction, and fewer than one-third told the poll they approve of President Trump or either party in Congress.\n\nAnother key source of tension within the Democratic Party has been the ideological gap between its leadership and the left-leaning contingent of its youth grassroots.\n\nYoung people have been far more critical of the Israel-Hamas war, and the U.S. support for it, than leadership in either party, leading to flare-ups including a high-profile public spat between the 2024 Kamala Harris campaign and uncommitted delegates protesting the Democratic stance on the conflict. \n\nTop Democratic leaders have also been somewhat wary to throw their support behind one of their newest national stars. New York mayoral candidate Zohran Mamdani is a self-described democratic socialist who earned a surprise win in the Democratic primary thanks to widespread youth support and calls for left-leaning policies such as rent freezes, free buses, and city-run grocery stores.\n\nThe ongoing government shutdown has provided Democrats a key test of their pitch to voters, and Democrats have made a point of focusing on the quality of life issue of healthcare, accusing Republicans of raising prices by allowing Affordable Care Act subsidies to expire.\n\nSo far, the pitch seems to be working, at least among the general voter base.\n\nA Washington Post poll from the first day of the shutdown found 47 percent of adults in the U.S. blamed Trump and Republicans in Congress for the shutdown, compared to 30 percent who blamed the Democrats.","summary":"The Democratic Party’s soul-searching on how to reach young men comes after Republicans made gains during 2024 election","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrats-strategy-young-men-influencers-b2840576.html","image":"https://static.independent.co.uk/2025/09/30/17/Congress_Shutdown_05319.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/vZ8kMZ41-4VHSaSK0.mp4","publish_date":"2025-10-07 00:19:58","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":0.093},{"id":366824570,"title":"Dem’s lame reply to murder call, the Left needs ‘pragmatic’ populists and other commentary","text":"From the right: Dem’s Lame Reply to Murder Call\n\nVirginia Democratic gubernatorial candidate Abigail Spanberger “is oddly reluctant to call for the withdrawal of her party’s vile nominee for Attorney General — Jay Jones,” fumes David Catron at The American Spectator.\n\nIn “a series of deranged texts sent by Jones to a Republican lawmaker in August of 2022,” Jones mused about Republican Todd Gilbert getting “two bullets to the head” and suggested that he hoped his children would die.\n\n“Jones is not only unfit to be Virginia’s Attorney General, he is also a serious liability to Spanberger’s gubernatorial campaign.” \n\nIndeed, her response was “woefully inadequate”; she failed to demand he drop out, because Spanberger “is afraid of her far left flank.” \n\n“This is the dilemma that may well destroy the Democratic Party in the end.”\n\nLiberal: The Left Needs ‘Pragmatic’ Populists\n\n“Amid a dispiriting shutdown fight after a summer of drift,” snarks Justin Vassallo at the Liberal Patriot, Democrats must “do a bit of praying.” \n\nMost important: “rebuilding the fabled Blue Wall remains the first order of business if the party is to have any hope in 2028.” \n\nTo that end, there is “a cohort of independent-leaning,” pragmatic Democrats who could have “an outsize impact — not just on the party’s morale” but on its long-term “trajectory.” \n\nTheir “pragmatic populism” means they’re sensitive to “the concerns of working-class Trump voters,” are “critical of tariffs” and “know firsthand the costs of offshoring and corporate mergers.” \n\nPerhaps they can “reset the narrative in America’s rural and industrial heartlands.”\n\nLegal take: Trump Could Face Global Lawfare\n\nHaving failed to destroy President Trump in local, state and federal courts, the “global deep state” is looking to prosecute him in the International Criminal Court, warns law prof Eugene Kontorovich at The Wall Street Journal.\n\n“International lawyers are already developing multiple lines of attack against the administration and its officials,” with possible cases against Trump for killing Venezuelan drug traffickers or even for “immigration policy,” which has been called “a crime against humanity.”\n\nA future US president could follow the example of the Philippines, where former leader Rodrigo Duterte’s “successor conspired with The Hague” to destroy him, since he was a political enemy. \n\nTrump was taken by “surprise” by the “lawfare campaign” against him; he’d be wise to take proactive steps to “pre-emptively” head off similar efforts down the road.\n\nFrom the left: Progs Are Sure They Know Best\n\n“Progressive donor network Way to Win” recently held a “confab called Persuasion 2025” to “reassert the left’s strategy” to achieve “a national governing majority,” notes The Atlantic’s Jonathan Chait. \n\nBut “the progressive movement’s hold on the party is no longer certain.” \n\nThe DEI-inspired rise of Kamala Harris in the Democratic Party structure “was already an awkward fit,” and “her defeat” demonstrated how “progressive activists” had “driven the entire field leftward” and latched her to a “toxic” social agenda that revolted voters. \n\nProgressives have doubled-down, “irrationally” declaring, “No compromise with the electorate.” \n\nThe party’s progressives “seem determined to reeducate the public rather than compromise for their votes.” \n\nThis is a great strategy “if the goal is ideological purity” — but it won’t help win elections.\n\nLibertarian: DC Permanent ‘Temporary’ Programs\n\n“Milton Friedman liked to quip that there’s nothing more permanent than a temporary government program,” recalls Reason’s Christian Britschi. \n\n“We’re seeing more evidence for this” as the government shuts down after Democrats insist on “an extension of ‘temporary’ Affordable Care Act (ACA), aka Obamacare, subsidies passed during the pandemic.” \n\nThe enhanced subsidies — scrapping “income-eligibility caps” and boosting benefits — are set to expire this year. \n\nYet the fact that their expiration creates a “crisis” is “a feature, not a bug,” laments the Cato Institute’s Michael Cannon. It’s “how spending grows”: The 2021 expansion “attempts to mask the cost of rising premiums by shifting more of the expense onto taxpayers.” \n\nIt’s all a “fiscal illusion. They want to keep hiding the cost of Obamacare’s health insurance regulations.” \n\n— Compiled by The Post Editorial Board","summary":"Virginia Democratic gubernatorial candidate Abigail Spanberger “is oddly reluctant to call for the withdrawal of her party’s vile nominee for Attorney General — Jay Jones,” fumes David Catron.","url":"https://nypost.com/2025/10/06/opinion/dems-lame-reply-to-murder-call-the-left-needs-pragmatic-populists-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/newspress-collage-b5p8hgclw-1759792663069.jpg?quality=75&strip=all&1759778391&w=1200","video":null,"publish_date":"2025-10-06 23:43:54","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"zm","sentiment":-0.228},{"id":366821314,"title":"Utah Advances New Congressional Map: Here’s What It Means for Midterms","text":"Utah legislators voted to advance a congressional map that could reshape its boundaries ahead of the 2026 midterms—potentially giving Democrats a chance at flipping a few districts.\n\nWhy It Matters\n\nDemocrats are hopeful about their chances of flipping control of the House of Representatives in November 2026. Historically, the party in the White House loses seats in the midterms, and President Donald Trump’s approval rating remains low. But several states like Texas and Missouri have engaged in mid-decade redistricting to eliminate several Democratic-leaning quadrants in an attempt to thwart losses.\n\nUtah is one state where Democrats could gain seats in redistricting, as a court previously struck down its current map, viewed as a partisan gerrymander. Although former Vice President Kamala Harris received 38 percent of the vote in the state, none of its four congressional districts are Democratic-leaning or even competitive. The new map advanced on Monday would change that.\n\nWhat To Know\n\nBoth the Utah House of Representatives and Senate voted to advance a new map to comply with court orders Monday afternoon, bringing it one step closer to becoming law ahead of the midterms. The map did not receive support from Democratic legislators but passed with Republican support.\n\nRepublicans would have an advantage in each of the four districts, but two would be viewed as more competitive than on the current map.\n\nUnder the new map, Trump would have received just under 50 percent of the vote in UT-03, defeating Harris by about 2 percentage points. This district would contain all of Salt Lake City, a Democratic stronghold split up in the current map, other parts of Salt Lake County and more rural, conservative areas.\n\nA polling center in Provo, Utah, is pictured on November 6, 2018.\n\nIn UT-02, he would have beaten Harris by about 7 points. This map contains the rest of Salt Lake County and rural areas to the west.\n\nAn analysis conducted by The Salt Lake Tribune that accounted for other races found the districts to be slightly more conservative—UT-02 at R+10.7 and UT-03 at R+6.\n\nThe map only splits Salt Lake County into two districts. Under the current map, it is split between each of the four districts—which critics said diluted the power of Democratic voters. Although all districts backed Trump, the two single-digit districts would likely be contested by Democrats, particularly if 2026 shapes up to be a blue wave.\n\nWhat People Are Saying\n\nBetter Boundaries, an anti-gerrymandering group, wrote in a statement: “When politicians control redistricting, there is always an incentive to protect power. That is why Utah voters passed Proposition 4 to create fair standards and measures that could evolve as data and technology changed. Map C demonstrates how the core principles of Proposition 4 are being sidestepped. Proposition 4 called for fairness measured by the best available tools and data, transparency in how maps are drawn, and accountability to voters rather than political interests.”\n\nGOP State Senator Scott Sandall said in a statement reported by KSL-TV: “Despite a condensed timeline, our committee remained committed to transparency and public engagement. The approved map adheres to Proposition 4 requirements and reflects the diversity of Utah by ensuring every district includes both rural and urban communities. Redistricting is the Legislature’s constitutional responsibility, and we continue to prioritize fair maps that give every Utahn a strong, equal voice in Congress.”\n\nWhat Happens Next\n\nThe map will be submitted to the court later Monday, KSL reported.\n\nOther states are also considering redistricting. Most notably, California voters will head to the polls next month to decide on a ballot measure that would temporarily replace its commission-drawn map with one more favorable to Democrats. The ballot measure was introduced in response to efforts in Texas. Polls suggest a majority of voters support the California move.","summary":"Thenewly passed map would establish two potentially competitive districts around Salt Lake City.","url":"https://www.newsweek.com/utah-advances-new-congressional-map-heres-what-it-means-for-midterms-10837081","image":"https://assets.newsweek.com/wp-content/uploads/2025/08/2449440-utah-voting.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-06 22:47:11","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.207},{"id":366822704,"title":"Former Auburn Coach Bruce Pearl Responds To ESPN's Mike Wilbon Calling Him 'Divisive'","text":"Auburn basketball coach Bruce Pearl suddenly retired last month and handed the reins over to his son, Steve. For many, it was a sad moment that a great coach was leaving the game, especially coming off a Final Four appearance. ESPN's Mike Wilbon was not one of those people. During the final moments of Pardon the Interruption on Sept. 22, Wilbon said he was glad Pearl was gone because he had become \"divisive\" and even hoped that Pearl had been forced out of his job. PTI co-host Tony Kornheiser balked at Wilbon's comments, saying that he liked Pearl and that he and Wilbon were \"on the other side\" regarding their opinions on Pearl. Pearl joined Will Cain on Fox News on Monday and responded to Wilbon's comments. \"A dear friend of Mike's reached out to me and said, 'Look, this is not antisemitic. It's probably political,'\" Pearl said. Pearl has been outspoken in his defense of Israel during the ongoing conflict between the nation and the terrorist group Hamas. However, Pearl has also vocally supported President Donald Trump, not just on Israel, but on other political platforms. He has also criticized Barack Obama for increasing racial tensions in the United States. In Wilbon's world – not just Wilbon, but all the left-wingers in the media – supporting Donald Trump makes someone divisive. And criticizing Obama? Forget it. In their world, Obama is completely above reproach. Of course, endorsing Kamala Harris or another Democrat politician is not divisive, at least to them. That's the double-standard that exists, sadly. \"If there's anything I'm not, that is divisive. I've tried to bring people together my entire life,\" Pearl continued. \"Maybe it's an example of why we can't agree to disagree about things politically.\" Pearl is spot-on, unfortunately. Instead of Wilbon simply saying he disagreed with some of Pearl's political opinions, he chose to celebrate his leaving college basketball and even hoped that he was forced to do it. Pearl rejected that notion, though. \"I was not forced out; I love Auburn and I love the opportunity now to be able to do some things for faith and family in our country, to be an advocate for Israel, to be an advocate for education, and [I'm] looking forward to [doing] those things while my son is winning basketball games,\" Pearl said. Good for Pearl for taking the high road, as Will Cain correctly pointed out Wilbon's hypocrisy. \"I would love to ask Mike, ‘Did you ever call Steve Kerr or Gregg Popovich divisive?’\" Cain asked, rhetorically. Fortunately, I can answer that question for Cain, at least on Popovich. The answer is no. In fact, when Popovich became the NBA all-time wins leader among coaches, Wilbon starred in a glowing tribute praising the former Spurs coach's career. Remember, this is a guy who has openly criticized President Donald Trump on numerous occasions. He once called the president a \"pathetic individual.\" Sure seems divisive, doesn't it?","summary":"Bruce Pearl responds to ESPN’s Mike Wilbon calling him “divisive&quot; after his sudden retirement from Auburn, defending his political beliefs and stance on Israel.","url":"https://www.outkick.com/sports/former-auburn-coach-bruce-pearl-espn-mike-wilbon-divisive","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/10/bruce-pearl-wilbon.jpg","video":null,"publish_date":"2025-10-06 22:40:16","author":"Dan Zaksheske","authors":["Dan Zaksheske"],"language":"en","source_country":"us","sentiment":-0.165},{"id":366808924,"title":"Unveiled: Abigail Spanberger’s Year at the ‘Islamic Saudi Academy’ Following 9/11","text":"The twisted tale of Abigail “Let Your Rage Fuel You!” Spanberger continues apace, with more troubling information coming out every day about the Democrat candidate for governor in Virginia.\n\nFirst, there was the revelation that Spanberger, who retired last year after serving three terms in Congress, had, as RedState reported back in August, “pocketed $50,000 in campaign donations from a businessman who is a member of the Chinese Communist Party (CCP).” As we noted then, Virginia law “forbids foreign nationals from making political contributions, and Chinese law typically bans CCP members from holding foreign citizenship or permanent residency.”\n\nREAD MORE: Democrats Fume As Abigail Spanberger Stumbles: Dodges Bathroom Question, Caught Pocketing CCP Cash\n\nAbigail Spanberger’s Brutal Botch on Trans Bathroom Policies\n\nThen, on the heels of one her campaign supporters waving a vile, racist sign at Spanberger’s Republican opponent, Winsome Earle-Sears—something Spanberger was slow to condemn—the Democrat utterly botched her response to whether or not she supports boys in girls’ sports and males using female spaces. It was her Kamala Harris moment (and of course she supports biological males having unfettered access to girls’ and womens’ private spaces, she’s just too much of a coward to say it.)\n\nNext, we had her urging her supporters to “Let your rage fuel you!” when dealing with political opponents. Utterly dangerous and irresponsible words, especially in light of the fact that someone on her ticket has been outed as having assassination fantasies about a Republican colleague. Again, something Spanberger was slow to condemn; the fact that she hasn’t called for Jay Jones to exit the race proves how much she embraces and welcomes the rage.\n\nNot to mention her Deep State past. Abigail Spanberger is a veritable smorgasbord of radical policies, violent rhetoric, and far-left priorities.\n\nNow, we’re finding out that, soon after 9/11, she spent a year teaching at a Northern Virginia school called the Islamic Saudi Academy (now called King Abdullah Academy).\n\nThe Democratic gubernatorial nominee in Virginia worked for a Saudi government-controlled school just after 9/11, at a time when the Islamic academy was already controversial for being controlled by the Saudi royal family and for its extremist textbooks which taught hatred of non-Muslims.\n\nNEW: Abigail Spanberger worked at the Saudi government-run Islamic Saudi Academy just over a year post-9/11. When she began teaching there, the school was already well-known for its radical & hateful textbooks, links to Hamas, pro-jihad graduates, & more…https://t.co/SfjvuGfBfo\n— Jerry Dunleavy IV 🇺🇸 (@JerryDunleavy) October 6, 2025\n\nA few things to know about the Islamic Saudi Academy (ISA):\n\nThe school was controlled and funded by the Saudi government;\n\nNumerous local citizens in northern Virginia were opposed to the relocation and expansion of the ISA due to concerns about the school’s teachings, about its control by and funding from the Saudi government, and about the Saudi government’s human rights record;\n\nA top leader of Hamas had sent his children to the school;\n\nThe school’s comptroller had been linked to Hamas;\n\nThen-recent graduates of the school had come under suspicion by federal authorities of potentially seeking to carry out a suicide attack in Israel;\n\nThe school’s textbooks contained hateful language, including animosity toward non-Muslims and Jews in particular;\n\nThe ISA had withdrawn from membership in a major accreditation organization; and\n\nThe ISA’s own website stated that it was controlled by the Saudi government and was guided by the Saudi Ministry of Education.\n\nJust a few short years after her time on the Saudi payroll, Spanberger made the leap to becoming an operative for the CIA, something she loves to tout on the campaign trail. She’s got all the bona fides you’d want in a Deep State shill seeking to acquire power.\n\nIf you’re interested in learning more about Spanberger’s tenure teaching future jihadists, there a great write up over on X (see tweet below). Here’s a sampling:\n\nBefore she donned the CIA badge, before she spun herself into a “national security expert” and paraded as the beltway’s moderate darling, Abigail Spanberger spent time at a school so notorious, it earned the nickname “Terror High.” The Islamic Saudi Academy (ISA), funded directly by the Saudi government, has long been under fire for promoting extremist ideology, glorifying jihad, and radicalizing its students. And from 2002–2003, guess who was on staff? Deep-State-Abbie herself—teaching English literature while surrounded by a cesspool of Wahhabi indoctrination.\n\nhttps://t.co/itNgwRceQl\n— A Guy on X. (@VaChangeAgent) July 23, 2025\n\nAbigail Spanberger would like voters to believe she’s a moderate, but when you scratch the surface even a little bit, you find that she’s a dangerous blend of Deep State operative, far-left ideologue, and lover of incendiary political rhetoric.\n\nEditor’s Note: The Schumer Shutdown is here. Rather than put the American people first, Chuck Schumer and the radical Democrats forced a government shutdown for healthcare for illegals. They own this.\n\nHelp us continue to report the truth about the Schumer Shutdown. Use promo code POTUS47 to get 74% off your VIP membership.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe twisted tale of Abigail &#8220;Let Your Rage Fuel You!&#8221; Spanberger continues&#8230;\n\n\nThis Post: Unveiled: Abigail Spanberger&#8217;s Year at the &#8216;Islamic Saudi Academy&#8217; Following 9/11 first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/unveiled-abigail-spanbergers-year-at-the-islamic-saudi-academy-following-9-11/","image":"https://internewscast.com/wp-content/uploads/2025/10/Revealed-Abigail-Spanberger-Spent-Year-After-911-Working-For-039Islamic.jpg","video":null,"publish_date":"2025-10-06 22:37:28","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.101},{"id":366810698,"title":"The winner (if there is such a thing) of the government shutdown will be determined by these two races","text":"The government shutdown is now entering its first full week. So far, neither Democrats nor Republicans look any closer to a deal. \n\nDemocratic House Minority Leader Hakeem Jeffries threw down a gauntlet and challenged House Speaker Mike Johnson to a televised floor debate, which Johnson rebuffed. \n\nA maxim of Washington is that typically, nobody wins a government shutdown. This is why each side seeks to blame the other, with Republicans blaming Senate Minority Leader Chuck Schumer and calling it a “Schumer Shutdown,” while Democrats accuse Republicans of shutting down the government over not protecting tax credits for the Affordable Care Act’s health care marketplace. \n\nBut determining who “wins” a shutdown is a fool’s errand. \n\nWhile a poll from The Washington Post showed that a plurality of Republicans blame President Donald Trump and the GOP for the shutdown, it’s a difficult barometer to measure. Typically, the person who blinks in a shutdown loses. \n\nThat makes New Jersey and Virginia’s gubernatorial elections next month the perfect barometers. New Jersey and Virginia’s elections are unique products: the states hold their elections in odd years and therefore, they serve as a barometer for the national mood and typically serve as a tea leaf for next year’s midterm. \n\nHistorically, the party out of power wins these races. In 2009, New Jersey elected Chris Christie, elevating him to national status for winning in a blue state. And in 2021, Glenn Youngkin seemed to offer a path forward for Republicans in Virginia despite its increasingly Democratic tilt.\n\nRepublicans faced mixed opportunities in New Jersey and Virginia this time around, despite the fact they did better in both states last year than expected.\n\nGiven its critical mass of federal workers, Virginia has served as ground zero for cuts put in place by Elon Musk’s Department of Government Efficiency. Plenty of them have already lost their jobs.\n\nVirginia law prohibits governors from running for consecutive terms, so Youngkin’s lieutenant governor Winsome Earle-Sears is running for his old seat. Spanberger has sought to tie Earle-Sears to DOGE and the government shutdown. Curiously, Earle-Sears has not received an endorsement of Trump, which complicates her effort.\n\nMeanwhile, Earle-Sears has sought to tie Spanberger to Democrats in Washington who want to hold out for an extension of the subsidies. Virginia’s economy is usually hit by government shutdowns. In fact, the one time the president’s party won Virginia’s governorship came in 2013, when Republicans led by Sen. Ted Cruz (R-Texas) shut down the government to defund the Affordable Care Act, which led to Terry McAuliffe winning. \n\nEarle-Sears has sought to repeat the anti-transgender attacks that Trump made against Kamala Harris in the 2024 election, even running an ad saying Spanberger “Abigail Spanberger is for They/Them — NOT Us.”\n\nBut Sears has consistently polled in double digits behind the Democratic nominee, former congresswoman Abigail Spanberger. The most generous poll shows Sears down by 10 points. \n\nThat means that Republicans have largely resorted to investing in the New Jersey governor’s race. Rep. Mike Sherrill, who flipped a red seat in 2018, is running on the Democratic side. Like Spanberger, Sherrill is a decidedly moderate Democrat, she has touted her record as a Naval helicopter pilot. \n\nBy contrast, Republican Jack Ciattarelli is running again in New Jersey. Republicans feel they have a legitimate shot after Trump got within six points of Kamala Harris last year thanks to shifts with Asian-Americans and Hispanic voters. \n\nBut so far, only one poll from Emerson College shows the race being competitive. Others, including from Fox News, show Sherrill has as much as an eight-point lead. \n\nIn addition, Ciattarelli received an unwelcome surprise when Russell Vought, Trump’s director of Office of Management and Budget, announced he would cancel the Gateway Tunnel as part of his retaliation against Democratic states because of “unconstitutional DEI principles.” \n\nAnd unsurprisingly, both states’ races have been rocked by scandals to varying degrees. In Virginia, Democratic attorney general candidate Jay Jones has come under fire for saying that his rival should be shot. \n\nIn New Jersey, the inspector general for the the National Archives and Records Administration launched an investigation into how Ciattarelli’s campaign obtained military records of Sherrill’s, which included private information. \n\nAs of right now, it seems like Democrats have a better shot at flipping Virginia than they do holding New Jersey, where term-limited Gov. Phil Murphy is not as popular. \n\nBut if the shutdown is continuing into next month, which is a distinct possibility, and Democrats win decisively in both states, Republicans might have to change course.","summary":"Sorting out who wins when workers are being furloughed and services to Americans frozen is a fool’s errand, writes Eric Garcia, but two races ahead of the 2026 midterms will serve as bellwethers.","url":"https://www.independent.co.uk/news/world/americas/us-politics/government-shutdown-virginia-new-jersey-b2840437.html","image":"https://static.independent.co.uk/2025/10/01/17/50/Jack-Ciattarelli-Mikie-Sherril.jpeg?width=1200","video":null,"publish_date":"2025-10-06 22:12:36","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.282},{"id":366818440,"title":"'The Five': Kamala Harris challenged by the facts during book tour","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Five October 06, 2025 04:30 \n\n 'The Five': Kamala Harris challenged by the facts during book tour \n 'The Five' co-hosts discuss former Vice President Kamala Harris' continued insistence that the 2024 election was the closest in the 21st century.\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE FIVEV-VIDEOKAMALA HARRISDONALD TRUMPJOE BIDENPRESIDENTIAL PRIMARIES2020 PRESIDENTIAL ELECTIONPOLITICS","summary":"&apos;The Five&apos; co-hosts discuss former Vice President Kamala Harris&apos; continued insistence that the 2024 election was the closest in the 21st century.","url":"https://www.foxnews.com/video/6382132895112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5e4f67ab-b5f9-4f09-be63-1abcb8365870/a9fb17b4-3efc-42f6-9499-02fc5e9be9be/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-10-06 22:05:59","author":null,"language":"en","source_country":"us","sentiment":0.418},{"id":366802008,"title":"Free Press co-founder Bari Weiss named editor-in-chief of CBS News","text":"Paramount has acquired The Free Press, a four-year old digital news platform, and will make its co-founder Bari Weiss editor-in-chief of CBS News, the company announced Monday.\n\nThe official announcement came after months of speculation on the deal and Weiss' high profile role within the news division. Weiss, 41, will report to Paramount Chief Executive David Ellison, who personally courted the former New York Times journalist.\n\n\"We are thrilled to welcome Bari and The Free Press to Paramount and CBS News. Bari is a proven champion of independent, principled journalism, and I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,\" Ellison said in a statement. \"This move is part of Paramount's bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world.\"\n\nParamount is paying around $150 million in cash and stock for The Free Press, a feisty, upstart operation that generated attention through opinion pieces and podcasts with a strong point of view. Its favorite targets are the excesses of progressive left and purveyors of so-called \"woke\" policies.\n\nCBS News is a traditional mass appeal network TV operation with a proud legacy of journalistic excellence and the home of popular franchises \"60 Minutes\" and \"CBS Sunday Morning.\" But the division has struggled to deal with the shifts in audience habits brought about by streaming video and social media.\n\nWeiss is a provocateur who famously resigned from her high-profile role in the opinion section of the New York Times in 2020, citing bullying by her colleagues and a hostile work environment as the reasons. She has no experience in television or running an editorial operation on the scale of CBS News, which has more than 1,000 employees.\n\nWeiss also ascends at a time when the Trump has threatened news operations with lawsuits and regulatory action, such as pulling station TV licenses over what he believes is unfair criticism of him and his administration. Paramount agreed to pay $16 million to settle a Trump lawsuit making the dubious claim that a \"60 Minutes\" interview with Kamala Harris was deceptively edited to aid her 2024 presidential election campaign against him.\n\nCBS News has never had an executive with the title editor in chief before naming Weiss to the role. It still has a president — Tom Cibrowski — a former ABC News executive hired earlier this year who will remain in his role and continue to report to Paramount TV Media President George Cheeks.","summary":"Paramount has acquired The Free Press, a four-year old digital news platform, and will make its co-founder Bari Weiss editor-in-chief of CBS News, the company announced Monday. The official announcement came after months of speculation on the deal and Weiss'…","url":"https://www.keenesentinel.com/news/national_world/free-press-co-founder-bari-weiss-named-editor-in-chief-of-cbs-news/article_d8e7fdbe-d14a-51b4-b5ac-3c279b0bd7f6.html","image":"https://bloximages.chicago2.vip.townnews.com/keenesentinel.com/content/tncms/assets/v3/editorial/c/4a/c4acb9a9-cf52-5b08-816b-b3d2a85f64a0/68e3e6aace7fb.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-10-06 21:30:00","author":"By Stephen Battaglio Los Angeles Times,Stephen Battaglio Los Angeles Times","authors":["By Stephen Battaglio Los Angeles Times","Stephen Battaglio Los Angeles Times"],"language":"en","source_country":"us","sentiment":0.282},{"id":366816100,"title":"“What in the Willy Wonka?”: Tyra Banks is hawking “hot ice cream” and everyone is confused","text":"Tyra Banks is back in entrepreneur mode, and this time, she’s trying to make “hot ice cream” happen. The former supermodel and America’s Next Top Model host recently launched a line of sippable desserts through her sMiZE & Dream shops, claiming to have invented the world’s first “hot ice cream.” \n\nWhile she may have been a highly successful trend setter in the past, people aren’t sure about this one.\n\nWould you try hot, melted ice cream if Tyra Banks made it? What if she made some jarring TikTok videos about it?\n\nTyra Banks’ groundbreaking invention: Hot ice cream\n\nIt’s not a latte or hot chocolate. It’s very important to Banks that you understand this. In her confectionery shops around the world, she’s pushing ice cream lovers to try it hot and sippable.\n\n“This is my favorite ice cream flavor, and I’ve been working on making it hot for a year,” she said in a TikTok video in September. “And no, I’m not talking about me in a swimsuit in the 90s.”\n\n @smizeanddream Introducing… the world’s first HOT ice cream experience. Not a latte. Not a hot chocolate. But your favorite scoops, transformed into liquid. hot. ice cream. Sippable, baby. ✨ After countless rounds in Tyra’s R&D kitchen, we nailed it – the texture, the mouthfeel, a whole new way to experience ice cream. We call it HOT MAMA 🙌 Because mamas (and mama figures) hustle hard – and deserve to indulge in a little hotness for themselves. The very first drop? “TYRA’S FAVORITE”. One of the best ice creams in town… with toasted pecans, caramel butter, and salted cream. You’ve licked it cold… now sip it hot. Available NOW at our Darling Harbour flagship in Sydney. Cool cones. Hot cups. Get them both. ⏳ You’ve got 7 days. Then it’s gone. #SMiZEandDREAM #icecreamsydney #sydneyfood ♬ original sound – SMiZE & DREAM \n\n“I’m talking about hot ice cream—something that has not been done before.”\n\nWatching this, one might assume that the ice cream is spicy. However, that has been done before. What she’s talking about might have only been done in the dorm rooms of some of the most stoned college students on campus.\n\nIt’s the same ice cream she’s been selling in her shop sMiZe & Dream since the height of the COVID-19 pandemic, but heated up until you could chug it. It comes in a cup topped with whipped cream and various features of the flavor you choose, like caramel, nuts, or sprinkles.\n\n @smizeanddream Our super-popular Fairy Dough Diva ice cream just got a HOT makeover… and she drops TODAY! 🔥✨ Meet the Fairy Dough Diva HOT MAMA 💖… she’s reimagined as hot ice cream, love. Silky, smooth, and sippable-warm — and no, she’s not melted ice cream — she’s a hot original, not a hot mess. 😉🍦 This Diva is TyTy’s innovation in a couture SMiZE cup — buttery vanilla biscuit–infused hot cream, topped with Chantilly, rainbow hundreds & thousands, and finished with a slice of our super-buttery house-made fairy dough crunch biscuit. 🌈 This Diva is in demand — but only for ONE WEEK. After that? Poof. Her curtain will close. 👑🔥 Catch her now at our Darling Harbour flagship in Sydney. ✨ #sydneyfood #SMiZEandDREAM #icecreamsydney ♬ original sound – SMiZE & DREAM \n\n“Liquid, warm, soothing, yummy, silky,” Banks describes.\n\nYou could also top that with one of her house-made cookies.\n\nTyra started her ice cream career in Los Angeles, but has opened shops in many other locations, including Washington, D.C. That one ended up as a campaign stop for former Vice President Kamala Harris in 2024. Her newest location is in Sydney, Australia, where the cold season is coming to a close.\n\nFans say they can’t tell if this is real life, a troll, or a fever dream\n\nFans of Banks, ice cream, and anyone who somehow falls outside of those two categories seem confused. Some are having trouble getting their minds around the concept at all, while others don’t understand why the supermodel thinks she has something.\n\nWith all the TikTok reactions, the hashtag #hoticecream already has 487 videos.\n\n @steve_jobs_gay_son ♬ original sound – :^) \n\n“I guess I’m just really confused about Tyra Banks … making hot ice cream that she’s really seemingly manic about,” said TikToker @steve_jobs_gay_son. “She like ‘hot ice cream, it’s never been done before!’ It seems [like] hot milk, flavored hot milk.”\n\n“I have had a cold for the past several days, so I’m not convinced that what I just saw was not a fever dream of my mind’s own creation,” joked @danimattie.\n\n“I can’t determine what’s real and what’s not real anymore.”\n\nOthers had thoughts about the wacky things people get up to when they have too much money.\n\n @hannahoopope Thank you Tyra ! #hoticecream #tyrabanks #fyp #foryou #foryoupage ♬ Mario 64 – Dire Dire Docks – Devin Taylor \n\n“If only more rich people took note from Tyra and started solving the world’s problems like she is,” @hannahoopope said, sarcastically. “Like the fact that ice cream was too cold in the southern hemisphere. It needs to be hot. Thank you, Tyra!”\n\nConfusion is also the dominant vibe in the comments on Banks’ videos.\n\n“One thing about Tyra is she’s gonna confuse the hell out of you,” remarked @a.j.c_1.\n\n“What in the Willy Wonka is taking place?” asked @najlanouveau.\n\nThe internet is chaotic—but we’ll break it down for you in one daily email. Sign up for the Daily Dot’s newsletter here.","summary":"Tyra Banks is back in entrepreneur mode, and this time, she’s trying to make “hot ice cream” happen. The former supermodel and America’s Next Top Model host recently launched a line of sippable desserts through her sMiZE &amp; Dream shops, claiming to have invented the world’s first “hot ice cream.” \n\n\n\n\n\n\n\n\nWhile she may have been a highly successful trend setter in the past, people aren't sure about this one.\n\n\n\n\n\n\n\n\nWould you try hot, melted ice cream if Tyra Banks made it? What if she made some jarring TikTok videos about it?\n\n\n\n\n\n\n\n\nTyra Banks' groundbreaking invention: Hot ice cream\n\n\n\n\n\n\nIt's not a latte or hot chocolate. It's very important to Banks that you understand this. In her confectionery shops around the world, she's pushing ice cream lovers to try it hot and sippable.\n\n\n\n\n\n\n\n\n\"This is my favorite ice cream flavor, and I've been working on making it hot for a year,\" she said in a TikTok video in September. \"And no, I'm not talking about me in a swimsuit in the 90s.\"\n\n\n\n\n\n\n\n\n\n @smizeanddream In","url":"https://www.dailydot.com/entertainment/tyra-banks-hot-ice-cream/","image":"https://uploads.dailydot.com/2025/10/tyra-banks-hot-ice-cream-.jpg?auto=compress&fm=pjpg&w=2000&h=1000","video":null,"publish_date":"2025-10-06 21:30:00","author":"Lindsey Weedston","authors":["Lindsey Weedston"],"language":"en","source_country":"us","sentiment":0.282},{"id":366804296,"title":"Hurricane Doomsday Message From Bill Nye in 2024 Goes Viral","text":"Calling Bill Nye a \"scientist\" is an insult to the millions of people who are actually scientists, and this 2024 clip of Nye proves that point. In October 2024, Hurricane Milton ravaged Florida, sparking yet another round of panic from climate change activists, including Nye. He appeared on MSNBC to blast then-candidate Donald Trump for not having a plan to address climate change, and called for everyone (especially the younger demographic) to vote for Kamala Harris instead. \"(Trump) has no plans to address climate change, no plans for long-term dealing with these sorts of problems…If we were talking about (climate change), that’s good, but the main thing is vote,\" Nye said. Embedded in his argument are three big assumptions: 1) climate change is causing an increase in hurricanes, 2) stopping climate change can fix that, and 3) Kamala Harris had the best plan to address these problems. Nye doesn’t have the intellectual honesty to realize that the climate has always been changing and fluctuating for all of time. Maybe there is a correlation to warm temperatures and hurricane frequency. But one bad year with two bad storms does not mean we are nearing Armageddon. All climate predictions about the end of the world have all been wrong until this point. As an alternative, we could just look at this data and realize an uptick in hurricanes doesn’t signal the end of the world. It is Florida after all, they get dozens of these per year. Last year just happened to be a pretty bad one. But the most ridiculous part is believing that any one candidate — especially a pathological liar like Kamala Harris — would have any effect on stopping hurricanes. Saying a president could stop the hoax of climate change catastrophes is like saying I can affect whether the Patriots win a football game. It's just not possible! Harris couldn’t even remember that she got blown away in the presidential election last year. Do we really expect her to have a brain competent to address any real problem? (I’m glad we never got to find out how bad she would have been as president.) The funniest part about all of this is that Florida just had its first hurricane-free September on record. You know who was in office for all that? Trump. Again, the president doesn’t get credit for a lack of hurricanes making landfall. But it does prove what we’ve known all along. Bill Nye is anything but a scientist; he’s a fearmongering climate change lunatic that is infected with TDS.","summary":"Calling Bill Nye a “scientist&quot; is an insult to the millions of people who are actually scientists, and this 2024 clip of Nye proves that point.","url":"https://www.outkick.com/culture/hurricane-doomsday-message-from-bill-nye-2024-goes-viral","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/10/gettyimages-2236819285.jpg","video":null,"publish_date":"2025-10-06 21:20:36","author":"John Simmons","authors":["John Simmons"],"language":"en","source_country":"us","sentiment":-0.588},{"id":366800344,"title":"American liberal says he's now a Trump supporter after seeing how rough and dangerous London has become","text":"An American liberal said he has swung to the right and is backing Donald Trump's crime crackdown after experiencing widespread paranoia over thefts in London. \n\nAris Goldberg, a travel TikToker, sparked debate across social media after sharing a 'surprising' conversation he had with a British man on the train while taking a trip to the capital. \n\nHe said that they started discussing the state of London amid rising phone thefts and daylight robberies in the city, and was stunned to be told: 'For all his flaws, we want Trump here.' \n\nGoldberg said he was a staunch Democrat who voted for Joe Biden and Kamala Harris over Trump in recent elections, but his opinions shifted after being warned over London's crime issues. \n\nIn a calm and considered vlog, Goldberg said he was told 'crime is out of control here', and was cautioned not to walk down the street with his phone out or to wear a nice watch because it may get stolen. \n\n'Even right now, I'm about to turn a corner on a street, I gotta worry about holding my phone because some moron might come by an an E-bike and try to grab it,' he said as he filmed the clip. \n\n'What's going on around right now is a real problem,' he said. 'The crime rates in these places are unnecessary, they're making our favorite big cities unsafe.' \n\nThe conversation took place amid growing controversy in the US over Trump's decision to deploy National Guard troops to several Democrat-led cities to handle claims of out-of-control crime. \n\nGoldberg said he was stunned by the claim from a 'good, level headed' British man that he would want Trump in charge because of how divisive politics is in the US with him in the White House. \n\n'America is more polarized than we've been in years,' he said. \n\nHe said that while he has never voted for Trump and didn't support him, being warned over crime in London has made him 'make the swing fast' to backing the Republican. \n\nThe driving force for this shift is a soft-on-crime approach to handling offenders, Goldberg said, that left him scratching his head over why people wouldn't want criminals to go to jail. \n\n'Listen man, we're either gonna have laws or we're not,' he continued. 'Break the law, go to jail.\n\n'You want to play by the rules, play by the law, you should be good, if you don't, there should be consequences.' \n\nGoldberg said he was warned by numerous people during his trip to be careful not to be targeted by brazen thieves in broad daylight. \n\n'It's pushing out good quality people, it's attracting bad quality people, and it's not a good quality of life for anybody,' he said. \n\n'Everybody should have a good quality of life, everybody should be entitled to their safety.' \n\nHe concluded that British people would still have 'a lot of problems' with Trump, but felt that his tough stance on crime would be enough to make the president popular in the current circumstances. \n\n'They want that sort of enforcement, they want someone that comes in and says, this is the law, you either follow the law or get out.","summary":"Aris Goldberg, a travel TikToker, sparked debate across social media as he said he was stunned by the number of people in London who warned him to be cautious about brazen daylight robberies.","url":"https://www.dailymail.co.uk/news/article-15167895/American-liberal-London-Aris-Goldberg-Trump-thefts-crime-surprise.html","image":"https://i.dailymail.co.uk/1s/2025/10/06/21/102755371-0-image-a-89_1759783216516.jpg","video":null,"publish_date":"2025-10-06 21:15:05","author":"Editor,Will Potter","authors":["Editor","Will Potter"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.031},{"id":366800978,"title":"Did Taylor Swift use AI art? Life of a Showgirl orange door videos seem AI-generated","text":"Fans worldwide are expressing disappointment after Taylor Swift allegedly used AI-generated videos to help promote her new album, The Life of a Showgirl.To be clear, it has neither been confirmed that the videos in question are AI — though it certainly seems that way — nor is it clear that Swift was directly involved in the creation of the videos. The allegedly AI-generated videos surfaced via 12 \"orange doors\" with QR codes placed in major global cities. Those QR codes led to videos related to Showgirl. It's the classic Easter egg tactic Swift has made famous. \n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\nBut once those videos made their way online, people began to notice they seemed to be made with AI. Here's a good breakdown on TikTok about parts of videos that appear to be AI. \n\n Did Taylor Swift swipe a lyric from a TikTok creator?\n\nFolks online, including seemingly some Swifties, were disappointed that Swift would use AI in a promotional campaign for Showgirl. Why would an impossibly wealthy artist choose to use AI-generated works rather than pay artists for the actual work that AI poorly replicates? Swift also famously fought to own her back catalog of music, and using AI — a technology that scrapes other folks' work to create its own content — would seem to run counter to that ethos.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\n This Tweet is currently unavailable. It might be loading or has been removed.\n\nIt's also worth noting that Swift has worked against AI-generated content when it directly affects her. She spoke out in support of Kamala Harris after then-presidential candidate Donald Trump used AI-generated art to suggest Swifties supported him in 2024. Swifties also mobilized to protect Swift after AI-generated deepfakes of the singer surfaced online.Perhaps the videos rely on (poorly done) visual effects created by humans. But if the videos are actually AI, there are certainly a lot of disappointed people online. \n let cbeScripts = {\"twitterEmbed\":[\"https:\\/\\/platform.twitter.com\\/widgets.js\"],\"tiktokEmbed\":[\"https:\\/\\/www.tiktok.com\\/embed.js\"]};\n let cbeScriptObserver = function (nodeType, scriptsArr) {\n let firstElem = document.querySelector('.' + nodeType)\n let self = this\n\n if (firstElem == null) {\n console.warn(`CBE cannot find element with class .${nodeType} for script observer.`)\n\n scriptsArr.forEach((scriptSrc) => {\n const linkEl = document.createElement('link')\n linkEl.rel = 'dns-prefetch'\n linkEl.href = scriptSrc\n document.head.append(linkEl)\n\n window[nodeType + 'Loaded'] = false\n\n this.embedObserver = new IntersectionObserver((entries) => {\n entries.forEach((entry) => {\n if (entry.isIntersecting && window[nodeType + 'Loaded'] === false) {\n scriptsArr.forEach((scriptSrc) => {\n const el = document.createElement('script')\n el.src = scriptSrc\n el.async = true\n document.head.append(el);\n\n window[nodeType + 'Loaded'] = true\n self.embedObserver.disconnect()\n\n }, {root: null, rootMargin: '750px'})\n this.embedObserver.observe(firstElem)\n\n for (const item in cbeScripts) {\n new cbeScriptObserver(item, cbeScripts[item])","summary":"Some fans are voicing their displeasure after the internet pointed out that Taylor Swift seemed to AI-generated videos in a high-profile promo.","url":"https://mashable.com/article/did-taylor-swift-use-ai-videos-life-of-a-showgirl-orange-door","image":"https://helios-i.mashable.com/imagery/articles/07bFSx7Ni2yKC10R07tQvyH/hero-image.fill.size_1200x675.v1759777288.jpg","video":null,"publish_date":"2025-10-06 21:04:47","author":"Tim Marcin","authors":["Tim Marcin"],"language":"en","source_country":"US","sentiment":-0.448},{"id":366811984,"title":"George Clooney Doubts Democrats Will Request More Political Op-Eds: ‘People Have Heard Enough From Me’","text":"George Clooney said he’s probably going to stay away from writing critical op-eds about the Democratic Party, particularly after his remarks in his “George Clooney: I Love You Joe Biden. But We Need a New Nominee” may have impacted Joe Biden’s exit from the 2024 presidential election.\n\nThe actor sat down with Esquire in an interview published Monday and was asked if he thought the Democrats would approach him about writing another opinion piece. “I don’t think so,” Clooney said. “I think people have heard enough from me. I wasn’t doing it to, you know—I was doing it because I’d been a personal witness to things.”\n\nAs TheWrap previously reported, in Clooney’s op-ed, the veteran actor emphasized that he had been a longtime supporter of Biden and that he considered the politician to be a friend. However, he argued that due to his age, Biden was no longer the politician he once was. The op-ed was credited for contributing heavily to the growing chorus of Democrats opposed to Biden running in the 2024 election, which eventually led to [former Vice President Kamala] Harris taking over the ticket.\n\nWhile he said he might stay from the political drama, he say that Democrats need to pull it together as a team in the midst of the Trump era.\n\n“I do believe we get through these things, and if you think back to the times that have been really bad in the country—we’ve had them,” Clooney said. “I think ’68 was as bad as we could have had. Every city in the United States was on fire and rioting, and the capital was surrounded by armed guards to protect themselves. We killed Martin Luther King and Bobby Kennedy that year. There was the Tet Offensive.”\n\nHe continued: “So if you look at it, you go, We’ve been in bad places before. Certainly the Civil War. So we’re going to get through it, but a lot of damage is going to be done along the way because of where we are. And it is heartbreaking to see. And Democrats are gonna have to get their act together.”\n\n“And they will,” he concluded. “Coming out of the Iraq war and all that is what brought us Obama—brought us a really good leader. And we’re gonna need it.”","summary":"While the actor hesitates to weigh in too much following his Biden exposé, he does urge the left-leaning party to “get their act together”\n\n\nThe post George Clooney Doubts Democrats Will Request More Political Op-Eds: ‘People Have Heard Enough From Me’ appeared first on TheWrap.","url":"https://www.thewrap.com/george-clooney-joe-biden-op-ed-democrats/","image":"https://www.thewrap.com/wp-content/uploads/2025/10/rump-23-1.jpg","video":null,"publish_date":"2025-10-06 21:03:09","author":"Raquel 'Rocky' Harris","authors":["Raquel 'Rocky' Harris"],"language":"en","category":"politics","source_country":"US","sentiment":-0.425},{"id":366816212,"title":"HBO’s Bill Maher Accuses Kamala Harris of ‘Playing Victim’ in Memoir 107 Days","text":"HBO host Bill Maher did not hold back from Kamala Harris for her memoir. The former Vice President came out with her memoir titled ‘107 Days.’ In the book, she talks about her 2024 Presidential campaign while making several bombshell revelations. Maher accused Harris of “playing the victim” for losing the elections.\n\nThe host slammed Harris on a recent episode of the show. Maher took a dig at the former VCP by suggesting that the memoir “should have been called ‘Everyone Sucks but Me’,” instead of 107 days.\n\nVan Jones, who is known to be Barack Obama’s advisor, appeared on the show as a guest and was seen clapping at the comment. The Real Time host went on to allege that 107 days was a “victim’s title.”\n\n“Yeah. Uh, and a billion and a half dollars and a built-in army of about 75 million people who’d vote for any human-adjacent life form that wasn’t Trump,” he added. Maher went on to allege that in the memoir, the VCP takes no accountability for her loss and “nothing is ever Kamala’s fault.”\n\nHe pointed out how Harris claims that Joe Biden “let her down” by not bowing out of the race sooner. “Gavin Newsom, he was asked for his endorsement, but texted, ‘hiking, will call back,’ but then never did,” he said. Maher sarcastically added how the California Governor did not ask Harris to prom.\n\nThe host seems to be referencing the expert from the book, where Kamala claimed that several Democratic leaders did not show her support. She also recalls how, when she asked Newsom if he would endorse her, he told her he was “hiking” and would get back to her. According to the memoir, the Governor never got back to her.\n\nIn the book, she also discusses how she ruled out picking Pete Buttigieg as her running mate because his being openly gay was a “risk” when it came to her presidential run. She writes how Buttigieg “would have been an ideal partner — if I were a straight white man.”\n\n“America itself lets Kamala down by not being ready for the running mate she really wanted, Pete Buttigieg,” the HBO host mocked Kamala’s conflict. He joked that’s the reason the former VCP got stuck with Tim Walz, whom he addresses as a “Home Depot paint salesman.”\n\nHarris has been unusually candid about Joe Biden’s contribution to her campaign struggle, contrary to her previous denials. The 60-year-old reportedly declined reports about tension between her and Biden after she stepped in as the Presidential candidate.\n\nShe notes how she had started feeling “hurt and disappointment” when it came to Biden. She alleged that there had been a noticeable “change of temperature” in the former President’s behaviour after the election.","summary":"Bill Maher slams Kamala Harris's memoir 107 days while accusing her of blaming everyone but herself.","url":"https://www.inquisitr.com/hbos-bill-maher-accuses-kamala-harris-of-playing-victim-in-memoir-107-days","image":"https://www.inquisitr.com/wp-content/uploads/2025/10/Bill-Maher-takes-swipe-at-Kamala-harris.jpg","video":null,"publish_date":"2025-10-06 20:56:18","author":"Realtime Via Youtube @avgirl4life Via X.com,Vaishnavi Shetye","authors":["Realtime Via Youtube @avgirl4life Via X.com","Vaishnavi Shetye"],"language":"en","category":"politics","source_country":"US","sentiment":-0.599},{"id":366822244,"title":"Taylor Swift fans accuse singer of using AI in her Google scavenger hunt videos","text":"For the release of her twelfth album, “The Life of a Showgirl,” Taylor Swift sent fans on an online scavenger hunt this weekend, which began by searching for “Taylor Swift” on Google. But as fans unveiled secret videos as part of the campaign, some fretted that the clips looked like they were AI-generated — and they were not pleased.\n\nA Google search for the singer’s name yields a cryptic message: “12 cities, 12 doors, 1 video to unlock.” \n\nFans had to figure out the location of the doors, then physically find them and scan a QR code, which surfaced 12 unique videos that contained the clues needed to solve the puzzle. When fans Googled the correct phrase, another orange door appeared, which fans had to collectively “knock” on by clicking 12 million times. Finally, the door “opened,” revealing a lyric video for “The Fate of Ophelia,” which has its own orange door progress bar on YouTube.\n\nYouTube had scored the video exclusive for the track, as well as the lyric videos from the remaining songs on the new album.\n\nGoogle initially announced the scavenger hunt in a video on Instagram. The video begins with an aerial view of Earth, then quickly zooms in on a hilly, bejeweled landscape, until we see an orange door, overlayed with a Google search bar.\n\nWhile Swifties love a puzzle, some were rubbed the wrong way by the 12 clue-containing videos, which looked to be AI-generated.\n\nInstead of searching for clues to unveil Swift’s new lyric video, as Swift intended, some fans began to scour the video clips like detectives, looking for signs that the scenes were synthetic. However, while there are clips that look computer-generated, it’s unclear if they were made using AI, and if so, to what extent. \n\nIt would make sense if these videos were generated using Google’s AI products. As OpenAI shows off its new Sora 2 video generator, this Taylor Swift collaboration would be a serendipitous opportunity for Google to show millions of Swifties what its Veo 3 model can do.\n\nGoogle did not respond to TechCrunch’s request for comment on how these videos were generated or if Swift and Google worked together on this activation by using Google’s own AI technology. But Swift’s team and Google have teamed up for similar promotional activities in the past, we should note. \n\nThe use of AI in creative works is a sensitive subject. Some artists think these tools can help them, while others have protested the manner in which large language models are trained on their work without consent, effectively using artists’ own work to create the technology that could threaten their livelihoods.\n\nEven Swift herself spoke out about the dangers of AI after President Donald Trump shared an AI-generated image of her showing support for his campaign last year; the incident spurred her to post an endorsement for former Vice President Kamala Harris, who ran against Trump in 2024.\n\n“Recently I was made aware that AI of ‘me’ falsely endorsing Donald Trump’s presidential run was posted to his site. It really conjured up my fears around AI, and the dangers of spreading misinformation. It brought me to the conclusion that I need to be very transparent about my actual plans for this election as a voter,” she wrote on Instagram at the time.\n\nThe controversy around Swift’s possible use of AI is amplified given her own stature in the music industry. \n\nWhile AI may appeal to some artists as a way to cut costs, the billionaire musician has every possible resource at her disposal to bring the fantastical scenes from her promotional videos to life.","summary":"Swifties love a puzzle, but some were rubbed the wrong way by a promotional scavenger hunt which appeared to use AI-generated videos.","url":"https://techcrunch.com/2025/10/06/taylor-swift-fans-accuse-singer-of-using-ai-in-her-google-scavenger-hunt-videos/","image":"https://techcrunch.com/wp-content/uploads/2024/09/taylor-swift-2024.jpg?resize=1200,783","video":null,"publish_date":"2025-10-06 20:50:16","author":"Amanda Silberling","authors":["Amanda Silberling"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.067},{"id":366792284,"title":"A Journey into the Heart of US Society","text":"The American economy is again showing signs of vitality. With the Federal Reserve cutting interest rates, the hope of lower borrowing costs has sparked renewed optimism in trade, investment, and employment. Markets are responding with resilience, businesses are regaining confidence, and households are cautiously optimistic about relief from inflation. Yet behind the statistics, the true pulse of the nation is best felt not in the halls of power, but in the daily interactions between ordinary citizens. For a newcomer, one of the richest ways to understand America is not only through its politics and headlines but through working shoulder to shoulder with its people, in their neighborhoods and workplaces. My journey since migrating in September 2024 has been exactly that— a yearlong immersion into the everyday life of the USA.\n\nMy introduction came swiftly through politics. Soon after arrival, I was hired by Working America, a grassroots canvassing arm of the AFL-CIO, tasked with door-to-door outreach. The mission was ambitious: convince voters in Michigan, a critical swing state, to support Vice President Kamala Harris and Senate nominee Alyssa Slotkin. The campaign invested heavily— over 400 workers were hired at competitive wages, mobilized to tilt the state blue. Yet, despite the effort, Harris and Slotkin both lost resoundingly, while Donald Trump’s message resonated strongly with voters. That experience of knocking on doors and engaging in candid conversations with American families was invaluable. I learned firsthand that the economy outweighed all other concerns for most households. Voters were blunt, pragmatic, and deeply invested in their livelihoods.\n\nFor me, this is the true greatness of the USA: not only in its vast economy or global influence, but in the everyday dignity of its people. Their struggles and triumphs, their resilience and openness, their ability to debate leadership yet unite in family and community— these are what sustain the nation. As the USA moves forward under shifting political winds and evolving economic realities, it is this spirit of ordinary people that will continue to make it great\n\nFrom politics, my path shifted to commerce when I joined Home Depot, one of the largest consumer hardware chains in the world. With over 2300 stores across the USA, Canada, and Mexico, Home Depot is more than a retailer— it is a cultural institution. Its aisles of lumber, hardware, gardening supplies, and household goods are where the USA’s do-it-yourself ethos thrives. Over the course of a year, I interacted with more than 10,000 customers, an experience that revealed the diversity of US society, from the elderly woman lifting 50-pound bags of mulch on her own to immigrant laborers purchasing tools to build a future in their adopted land.\n\nMy colleagues reflected the same diversity. Many were students in their 20s, eager to earn money while completing their education. Others were retirees, working to stay active and engaged. Supervisors were consistently encouraging, patient, and generous with their knowledge, creating a work environment built on cooperation and mutual respect. The culture of sharing— skills, stories, and even personal aspirations— was profoundly enriching. These interactions created a microcosm of the USA itself: multigenerational, multiethnic, and bound together by a shared pursuit of opportunity.\n\nAmong customers, patterns emerged. The majority were middle-aged or elderly white Americans, often shopping as families. I witnessed countless examples of parents supporting their adult children in building or renovating homes— contributing not just financially but with their own expertise and labour. These acts of solidarity underscored a family-centric ethos, where generations stand behind one another in pursuit of stability and growth. Elderly women, in particular, impressed me with their resilience, unflinchingly hauling heavy bags of soil and fertilizer, embodying a spirit of independence that refused to yield to age.\n\nAlongside them were immigrants from Ukraine, Poland, France, the Middle East, and Asia. Many were cautious with credit card transactions, double-checking details to protect themselves from fraud. South Asians, particularly Indians and Pakistanis, were polite, efficient, and meticulous in their purchases, often focused on home painting, plumbing, or gardening. East Asians— Chinese, Koreans, Vietnamese— approached shopping with equal caution, reflecting cultural habits of vigilance. Latino customers, frequently labourers, arrived in groups, often with limited English but remarkable resourcefulness, buying tools and materials for construction and repair work.\n\nAfrican American customers, too, left strong impressions. Many carried themselves with confidence and self-reliance, often declining assistance from associates. While some interactions required careful navigation, the majority revealed a pride in independence and a determination to manage their affairs on their own terms. Meanwhile, white Americans stood out for their openness and generosity, often splitting household expenses equitably between spouses, and approaching associates with courtesy and ease.\n\nYoung white couples shopping with children brought life and laughter to the store aisles, their children’s golden hair and innocent chatter a reminder of the vitality of family life. Religion, too, surfaced in subtle ways. Conversations revealed that many Americans are deeply Christian, with regular Bible reading shaping their worldview. When I explained Islam’s respect for Jesus and Mary, and the Quran’s insistence on reverence for previous prophets, several were surprised and intrigued. For many, this was their first time hearing of the similarities between Islam and Christianity. These dialogues, though small, were powerful in bridging understanding and dispelling misconceptions.\n\nThrough these experiences, I came to appreciate the dual fabric of American life: the resilience and industriousness of ordinary people, and the larger political and economic forces shaping their choices. On one hand, Trump’s “America First” agenda resonates strongly, promising to curb illegal immigration, reduce homelessness, combat gangs, and restore national pride. On the other, skepticism exists— rising costs of essentials frustrate households, even those who support the administration. Yet, optimism endures, rooted in the belief that once policies mature, they will deliver tangible benefits.\n\nWhat struck me most was the balance between leadership and people. Politicians and policymakers set the stage, but it is in the hands of ordinary Americans— lifting heavy bags of fertilizer, saving meticulously for home repairs, canvassing neighborhoods, or splitting bills at the checkout— that the nation’s resilience resides.\n\nOne year after arriving in the USA, I feel enriched not just by professional experiences but by a deeper understanding of the US character. From politics to retail, from elderly gardeners to immigrant laborers, from religious dialogues to economic frustrations, I have seen the USA up close. And what I have found is a society marked by hard work, generosity, independence, and a cautious but enduring hope for a better tomorrow.\n\nFor me, this is the true greatness of the USA: not only in its vast economy or global influence, but in the everyday dignity of its people. Their struggles and triumphs, their resilience and openness, their ability to debate leadership yet unite in family and community— these are what sustain the nation. As the USA moves forward under shifting political winds and evolving economic realities, it is this spirit of ordinary people that will continue to make it great.","summary":"The American economy is again showing signs of vitality. With the Federal Reserve cutting interest rates, the hope of lower borrowing costs has sparked renewed optimism in trade, investment, and employment. Markets are responding with resilience, businesses are regaining confidence, and households are cautiously optimistic about relief from inflation. Yet behind the statistics, the true [&#8230;]","url":"https://www.pakistantoday.com.pk/2025/10/07/a-journey-into-the-heart-of-us-society/","image":null,"video":null,"publish_date":"2025-10-06 20:43:34","author":"Qamar Bashir","authors":["Qamar Bashir"],"language":"en","source_country":"pk","sentiment":0.588},{"id":366791554,"title":"Bari Weiss Has Won the War on Wokeness in Media","text":"In the resignation letter announcing her departure from the Grey Lady in July 2020, the opinion journalist Bari Weiss memorably lamented that \"Twitter is not on the masthead of the New York Times. But Twitter has become its ultimate editor.\"\n\nWhat Weiss meant was that the extremely progressive sensibilities of elite social media users—leftist activists, educators, journalists, Democratic campaign staffers, etc.—held undue sway over the range of views that could be printed in the opinion pages. This was a constant source of frustration for Weiss, a centrist thinker critical of the left whose mission was to bring some measure of ideological diversity to the paper. (In her letter, she bragged about having published independent and contrarian writers such as Jesse Singal, Glenn Loury, Thomas Chatterton Williams, and Reason's own Nick Gillespie.) But in the summer of 2020, the collective set of ideologies, habits, and preferences commonly referred to as wokeness still ruled the roost.\n\nMuch has changed in the last few years, and they are about to change even more noticeably at another large media company. Weiss is set to become the editor in chief of CBS News, and parent company Paramount has also purchased The Free Press—the media company she built from scratch in the years since leaving The New York Times—for an eye-popping $150 million.\n\nIn other words, over the course of just five years, Weiss has gone from an under-appreciated mid-level editor at a hostile (to her) newspaper to the boss of a major television news company, making millions in the process. One doesn't have to be in sympathy with Weiss' views in order to appreciate the staggering nature of this achievement: She has pulled off an elaborate Count of Monte Cristo–style revenge, if not over The Times itself, at least over the sort of people who made her experience at The Times so miserable.\n\nAnd the misery, in Weiss' telling, was indeed thorough. She claims that her colleagues bullied and badgered her for soliciting opinions that conflicted with their own, even though this was the job The Times had hired her to perform. This tension had culminated, just one month prior to her resignation, in a full-on staff revolt over an op-ed by Sen. Tom Cotton (R–Ark.) that called for the National Guard to be deployed to quell post-George Floyd rioting in U.S. cities. Progressive staffers framed their opposition to the op-ed as a matter of workplace safety: They said this op-ed put the lives of black staffers at risk and constituted a form of violence. The argument was not: We question the wisdom of sending the army into cities to conduct law enforcement. The argument was: You should not be allowed to write this. In other words, it wasn't an argument at all.\n\nAgain, back in 2020, this was par for the course. A phenomenon that previously remained confined to elite college campuses had spread throughout social media, infecting workplaces that disproportionately hired young, uber-progressive people. It hit the media industry particularly hard—The Times was hardly alone in having to reckon with junior employees suddenly making unreasonable demands for emotional safety. Twitter may have served as the \"ultimate editor,\" in Weiss' telling, but Slack—the online communications platform used by many businesses, particularly media companies—was where the social-media-constructed opinions of woke youngsters took shape as internal enforcement mechanisms for groupthink.\n\nSince at least 2016, when Donald Trump made opposition to political correctness a central aspect of his presidential campaign, many libertarian, contrarian, and otherwise heterodox figures—including Weiss herself—have warned that the thing we now call wokeness would engender massive backlash. Her elevation to the position of editor in chief of CBS News is, in some sense, one of the clearest indicators yet that wokeness in media, like wokeness everywhere else, is a loser. It is losing in the marketplace of ideas, as well as the actual marketplace: Entertainment companies that once fretted about offending activists by platforming un-woke comedians have abandoned this fear. Moreover, with Trump back in charge, companies are more worried about offending a very thin-skinned president and a Federal Communications Commission (FCC) that is eager to please him.\n\nIndeed, the recent kerfuffle over Jimmy Kimmel's cancellation is a reminder that backlashes can generate much-needed correction, but they can also go completely off the rails and bring to power a political figure that has no interest in ideological consistency with respect to free speech. Trump proclaims that his will be the most pro-free speech administration in U.S. history, and then he threatens to immediately arrest flag-burners for engaging in one of the most obviously protected forms of First Amendment expression. One can certainly think the various components of wokeness—the cancelations of provocative speakers, haranguing of classmates and coworkers over imprecise use of language, and so on—were extremely annoying and reflective of an illiberal social trend without cosigning the Trump remedy. Patriotic correctness is also annoying.\n\nSome will likely see Weiss' conquest of CBS, not as some legitimate victory for anti-wokeness, but rather yet another humiliating example of a major media organization sucking up to Trump. Paramount's merger with Skydance Media required the president's approval, and Trump had sued 60 Minutes, one of CBS's flagship news programs, over its Kamala Harris interview.\n\nViewing this development through a Trump lens is reductive, however. Weiss isn't Trump or MAGA, and though the mainstream media is already describing CBS News as facing a hostile takeover from a \"Trump-friendly\" journalist, The Free Press does run plenty of criticism of Trump and his movement, particularly on foreign policy. Their sensibilities are far more neoconservative than MAGA's, and the publication's uncompromising support for Israel is out of step with many of the right's more popular online figures these days: Tucker Carlson, Megyn Kelly, Candace Owens, Joe Rogan, and others. (To its credit, The Free Press does regularly feature debates on this subject, including this one between Coleman Hughes and Dave Smith.)\n\nFor her part, Weiss has announced no specific plans to radically rebrand or reformat CBS News. In a letter to all employees of the company, she outlined ten \"core journalistic values\" she thinks the company should exemplify under her leadership. They are all inoffensive and non-ideological. Even so, CBS News veterans are anonymously telling media reporters that they are \"encouraging\" Weiss not to interfere with 60 Minutes or CBS News Sunday Morning. That seems more than a little delusional on their parts.","summary":"Paramount has acquired The Free Press for $150 million and named her editor-in-chief of CBS News.","url":"https://reason.com/2025/10/06/bari-weiss-has-won-the-war-on-wokeness-in-media/","image":"https://reason.com/wp-content/uploads/2025/10/sipaphotosten193145-1200x675.jpg","video":null,"publish_date":"2025-10-06 20:30:19","author":"Robby Soave","authors":["Robby Soave"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":366791168,"title":"Love him or hate him, Trump just showed Biden and Democrats how to handle Israel’s Netanyahu. But can his Gaza ‘peace’ endure?","text":"As Monday dawned in Doha, where negotiators were set to meet and discuss the beginnings of a peace agreement to end the war in Gaza, prospects for ending a bloody conflict that upended regional stability and threatened to engulf the entire Middle East in war seemed closer than ever.\n\nBack in Washington, Donald Trump similarly looks closer than ever to achieving the peacemaker label he’s long sought and often falsely claimed for himself by running around the world and claiming credit for ending multiple wars — the current count stands (allegedly) at seven. \n\nAnd news coverage in both America and Israel is making the case that the U.S. president did what his predecessor either could not or would not: he “strong-armed” Benjamin Netanyahu into bringing this conflict to an end.\n\nOn the eve of the two-year anniversary of the war’s Oct. 7, 2023, onset, Israeli strikes in Gaza were reportedly reduced significantly but still ongoing. In sporadic strikes around the territory on Saturday, according to Reuters, 36 people died, including children. \n\nThen, Donald Trump — in a Truth Social post, naturally — called for Israel to “immediately” cease attacking the Gaza Strip as negotiations proceed.\n\nAnd though it seems Benjamin Netanyahu hasn’t fully complied, there’s no doubt in the minds of experts on the Israeli and American relationship that Donald Trump has successfully tugged a leash around the prime minister’s neck. To bring an end to the war, from this point, would be a massive blow to Joe Biden’s legacy and evidence that the president’s brash, demanding approach to foreign affairs was more effective than Biden’s “hug Bibi closer” strategy.\n\nTrump himself on Sunday declared that speed was a necessary component of success in peace talks between Israel and Hamas, likely drawing on his experience trying to negotiate the same between Russia and Ukraine. While Hamas hasn’t agreed to the full breadth of the White House 20-point peace plan, the U.S. president is now putting immense pressure — very publicly — on both sides to get both parties to the finish line.\n\nUnder Joe Biden’s presidency, U.S. officials repeatedly stressed that the president and his top deputies, including Vice President Kamala Harris, were working tirelessly to reach a peace agreement. And while it’s a certain truth that political dynamics around the war are starkly different now than from what they were in January-November of 2024, enough reporting exists to get a picture of the kind of pressure and leverage that the Biden administration (at the direction of the president) was willing to put on Israel. \n\nIt wasn’t much.\n\nAs one former Biden State Department official (who resigned over the Democratic president’s handling of the war) wrote in a piece for the Quincy Institute: “even the Israeli military expected the United States to allow them to carry out the indiscriminate bombing campaign only for a matter of weeks, before reining in the scale of destruction.”\n\n“Instead,” Annelle Rodriguez-Sheline wrote, “The Biden administration violated American laws and bypassed Congress to rush an additional $17.9 billion in weapons and security assistance to Israel, all while lying to the American public about tirelessly working for a ceasefire.”\n\nFormer Israeli ambassador to the U.S., Michael Herzog, had a similar view of the amount of pressure Biden was willing to put on Netanyahu, telling Israeli media: “God did the State of Israel a favor that Biden was the president during this period…We fought for over a year and the [Biden] administration never came to us and said, ‘ceasefire now.’ It never did.”\n\nNo such illusions exist around Trump’s style of diplomacy. Israeli correspondent Isabel Kershner wrote for The New York Times after Trump reportedly complained to the Israeli prime minister that he was “always so f***ing negative”: “It was abundantly clear to Israelis, and to Palestinians and others in the region, that the one calling the shots was President Trump.”\n\nOne Israeli columnist, cited by the Times and Axios, added that “Trump doesn’t threaten Netanyahu; he orders him.”\n\nIt’s a devastating dynamic, overall, for those few remaining Democrats still willing to defend the Biden administration’s handling of the war through late 2023 and the totality of 2024. And there are just a few of them left: even Jake Sullivan, the president’s national security adviser, has evolved to the position now where in August he said that he’d reached out to Democratic electeds on the Hill to let them know he thought supporting an arms embargo of Israel was an appropriate position. More Democrats voted for such an embargo against Israel this summer than they did at any point during the Biden administration.\n\n“There are no more serious military objectives to achieve. It’s just bombing the rubble into rubble,” he said on The Bulwark Podcast.\n\nHarris, meanwhile, used the issue as a wedge between her and the former president in her book, 107 Days, which released in September. Enraging many progressives who complained that she should have done so when it mattered, the former vice president explained that there was, despite her campaign’s denials, daylight between her and Biden on the issue of Gaza, particularly on the issue of showing empathy and remorse for Palestinian civilians killed in the conflict.\n\n\"I had pleaded with Joe, when he spoke publicly on this issue, to extend the same empathy he showed to the suffering of Ukrainians to the suffering of innocent Gazan civilians,” Harris wrote. \"But he couldn't do it: While he could passionately state, 'I am a Zionist,' his remarks about innocent Palestinians came off as inadequate and forced.\"\n\nFew Democrats (and fewer with future, upwardly-mobile ambitions) are now willing to side against the majority of their base over the former administration’s stance of unconditional support for Israel. Biden, by virtue of age and lack of future interest in politics, will quite possibly never face tough questions about the issue from a journalist or a critic ever again.\n\nProgressives are livid with the concept of putting the peace process in Trump’s hands, who they argue is putting Palestinians at rhetorical gunpoint to accept a deal.\n\n“Trump's plan is a recipe for Israel's permanent military presence within Gaza and for denying Palestinians the right to self-determination by having Gaza run by foreigners, not by Palestinians. And Trump has given Israel the green light to 'finish the job' if Palestinians don't accept this diktat — a potential prelude to the Trump-Netanyahu plan for the ethnic cleansing of all Palestinians from Gaza,” IMEU Policy Project executive director Margaret DeReus told The Independent on Monday.\n\nBut, she added, “Both Presidents Biden and Trump have had all the power to end Israel’s genocide of Palestinians from Day One. Instead, both chose to send Israel billions of dollars in weapons, paid for by our tax dollars. The devastation in Gaza and the unimaginable loss of Palestinian life are a result of their failure to put real pressure on Israel for two years.”\n\nHarris, meanwhile, remains politically tarred by both the conflict and the age-related downward spiral of the Biden campaign.\n\nThe prospect of Trump engineering a permanent peace deal would only drive that knife in further for anyone tangibly connected to the 2024 iteration of the “party establishment”. \n\nBefore it picks a nominee in 2028, leading Democrats will still have to answer questions from a very upset base of supporters about why they circled the wagons around this unpopular strategy until it was too late.","summary":"Liberals hate Donald Trump’s demanding and sometimes petulant approach to foreign policy. But it may have achieved what Joe Biden and Kamala Harris could not, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-netanyahu-gaza-peace-democrats-biden-b2840419.html","image":"https://static.independent.co.uk/2025/09/30/18/ORIENTE_MEDIO-GUERRAS-GAZA-PLAN_DE_PAZ_29447.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/yYovMO1x-4VHSaSK0.mp4","publish_date":"2025-10-06 20:19:33","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.009},{"id":366791492,"title":"Clash of the White House titans: Two of Trump's most powerful lieutenants go to WAR with each other - after vicious leak sent shockwaves","text":"It's been almost a week since a bombshell tip about a longtime Trump confidante was delivered to the Daily Mail via text message.\n\n'Hearing Corey Lewandowski got fired,' said the White House leaker on Wednesday. Inside 1600 Pennsylvania Avenue, the claim seemed to spark confusion.\n\n'I'm not sure if he was fired,' a senior communications aide told the Daily Mail. 'Hearing he was furloughed as part of the federal government shutdown. Been getting messages about this all day.' \n\nSix sources — two in the White House, three in the Department of Homeland Security (where Lewandowski is employed as a temporary staffer) and one Republican operative — gave the Daily Mail different explanations for why Lewandowski might be out.\n\nOne White House source said, 'They want him out.' \n\nFor his part, Lewandowski – often referred to as DHS Secretary Kristi Noem's de facto chief of staff – issued a furious denial on Wednesday.\n\n'How are those sources doing today?' he emailed the Daily Mail.\n\nHours later, Lewandowski took to Twitter, posting: 'I thought it only fitting today to share the words of the famous Mark Twain... The reports of my death are greatly exaggerated.'\n\nBut five days after the Daily Mail first reach out to the White House, they have yet to address this reporting, directing questions to a DHS spokesperson, who said they 'could not comment.' \n\nThe relative White House silence stands in stark contrast to how official Washington typically responds to damaging reports about staffers in good standing — with a firm statement of the president's 'full faith' in the individual in question.\n\nThen on Monday, the Daily Mail was told that there is an effort underway to oust Lewandowski — and it is being lead by White House Border Czar Tom Homan, according to a top GOP operative.\n\nLast month, Homan found himself under the spotlight. Sources told the Associated Press that Homan was under investigation since late last year for accepting $50,000 from an undercover FBI agent.\n\nHoman allegedly accepted the money — before he was tapped to serve in the administration — from an operative posing as businessman interested in government contracts related to the Trump's illegal immigration crackdown. \n\nThe bribery probe has reportedly been closed by the US Justice Department. Homan has not responded to the Daily Mail's request for comment.\n\nOn Thursday, Lewandowski fueled further speculation about his future by tweeting about the New Hampshire governor's race.\n\n'Everyone says being a Governor is the best job in Politics. I agree,' Lewandowski posted on X, after having spent the weekend in New Hampshire.\n\nLewandowski declined to say whether or not he expects the president's endorsement should he seek office in New Hampshire.\n\nA run for governor could hypothetically offer Lewandowski a graceful exit ramp from the administration. Indeed, 'grace' is not something typically associated with the controversial Trump foot solider.\n\nEarlier this month, the Daily Mail reported on a memo laying out accusations that Lewandowski improperly accepted a combined $50,000 from the Chinese Communist Party and Israeli Prime Minister Bibi Netanyahu's Likud Party.\n\nA senior DHS official denied the report, telling the Daily Mail that Lewandowski never received any foreign money.\n\nLewandowski was abruptly let go from Trump's 2016 campaign after being charged with simple battery for grabbing a female reporter, Michelle Fields, during a press event. The charges were later dropped. \n\nIn 2021, he was pushed out of Trump's orbit again after the wife of a GOP donor, Trashelle Odom, accused him of stalking and harassing her at a Nevada charity dinner.\n\nLewandowski was charged with misdemeanor battery, but the charges were dropped after he agreed to community service, a $1,000 fine and an apology to Odom.\n\nLawyers for Lewandowski have said their client 'was not charged with assault or stalking in Clark County, Nevada. In fact, the case against Mr. Lewandowski was dismissed.'\n\nFinally, Lewandowski was booted off Trump's 2024 campaign after reportedly clashing with campaign managers Susie Wiles and Chris LaCivita.\n\nBut, against the odds and raising eyebrows among Trump's closest allies, he returned to the fold again after Trump defeated Kamala Harris.\n\nFor now, Lewandowski remains in his position – as a special government employee of DHS – a role meant to be temporary and limited to 130 working days per year without federal salary or benefits. A source at DHS said Lewandowski had about 60 days left on his term, which could take him to the end of the year.","summary":"It's been almost a week since a bombshell tip about a longtime Trump confidante was delivered to the Daily Mail via text message. Five days later, it's still silence from the White House.","url":"https://www.dailymail.co.uk/news/article-15153549/White-House-war-trump-backers.html","image":"https://i.dailymail.co.uk/1s/2025/10/06/20/102754837-0-image-a-90_1759780447602.jpg","video":null,"publish_date":"2025-10-06 19:56:28","author":"Editor,Elina Shirazi,Phillip Nieto","authors":["Editor","Elina Shirazi","Phillip Nieto"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.217},{"id":366802576,"title":"What Will Bari Weiss Do to CBS News?","text":"Weiss wrote this article at something like the midpoint of her Times journey. When Donald Trump won the Presidency in 2016, she was at the Wall Street Journal; the morning after the election, she sobbed at her desk, and realized that she felt too liberal for the paper and needed to leave. In 2017, she joined the Times, where this was definitely not a problem—but, after three years of being consistently derided (not least over the I.D.W. piece), she quit, and, on the way out, publicly accused her colleagues of cowering before the orthodoxies of Twitter and “bullying” her for committing “Wrongthink.” She has said that she voted for Joe Biden in 2020. But, by the beginning of this year, she was sounding more conciliatory about Trump, dismissing her prior anguish as “Trump derangement syndrome.” “There were two things, I think, that I didn’t know in that moment when I was crying at my desk,” she explained: “the kind of illiberalism that was born out of the reaction” to Trump, and the fact that he would enact “a lot of policies that I agreed with.”\nAlong the way, Weiss founded the Free Press, a news site hosted on Substack—where it is the best-selling politics offering, with roughly a million and a half subscribers, some eleven per cent of whom pay—that sits somewhere between the center and the right, without “center-right” feeling like a consistently accurate label. This was Weiss’s own end run around mainstream institutions, and the site has come to be seen, at least by its fans, as an expression of her “pro-Israel and anti-woke worldview—not to mention her broadly shit-kicking anti-establishment disposition,” as Puck’s Dylan Byers recently put it. Weiss’s many critics would dispute that she was ever “anti-establishment.” Either way, she is indisputably back in the mainstream: the occasion for Byers’s piece was to report that David Ellison, the son of the billionaire Larry Ellison, and the freshly minted chairman of Paramount Skydance, the parent company of CBS News, was planning to put Weiss in charge of that outlet’s “editorial direction”; this morning, she was formally unveiled as its editor-in-chief. (Notably, she will report directly to Ellison.) The Free Press is coming along, too, with Ellison’s company having acquired it at a reported valuation of a hundred and fifty million dollars. According to a press release, Weiss will continue to lead the Free Press, but the site will “maintain its own independent brand and operations.”\nWeiss arrives at a moment that feels almost existential for CBS News, whose owners have been widely and credibly accused, in recent months, of kowtowing to Trump. This summer, Paramount settled a risible lawsuit that Trump filed over edits to a “60 Minutes” segment about Kamala Harris that had displeased him. Shortly thereafter, the Federal Communications Commission approved Paramount’s merger with Ellison’s Skydance. More or less everyone saw these developments as connected; Stephen Colbert said—on CBS—that the settlement was a “big fat bribe,” right before his show was cancelled. (Executives denied any quid pro quo, and cited financial motivations for cutting Colbert.) Brendan Carr, the F.C.C. chair, did publicly welcome Skydance’s “commitment to make significant changes at the once storied CBS broadcast network,” including measures to “root out” what he described as bias. Paramount Skydance also promised to appoint an ombudsman to oversee CBS News, and soon did, tapping Kenneth Weinstein, a right-wing think-tank type and recent G.O.P. donor. Last month, the network said it would no longer edit interviews on its Sunday show “Face the Nation,” after the Administration complained about cuts to a pre-recorded sitdown with Kristi Noem, the Secretary of Homeland Security.\nIn a recent profile of Weiss in the Guardian, the progressive journalist David Klion predicted that she would act as an “ideological commissar” at CBS, helping to further “enforce compliance” with the White House line. Others share the fear that a Trumpified Weiss is storming the citadel of objective journalism. Some version of this dynamic may well play out—as I see it, neither Ellison nor Weiss has accumulated enough benefit of the doubt for us to trust any promises to the contrary. But a MAGA-fied CBS isn’t a guarantee. The story is a bit murkier than Manichaean talk of stormers and citadels.\nTrump’s return to power is, at minimum, essential context for Ellison’s takeover of CBS News and hiring of Weiss, in ways that are specific—Trump’s recent pressure campaign against the network and the role of his regulators in approving the Skydance deal; his apparent closeness to the Ellison family—and in the more general sense that he has exerted a rightward gravitational pull on the concept of what it means for media to be “mainstream.” (The denizens of the Intellectual Dark Web, it’s safe to say, would not be depicted hiding in a forest today.) Ellison will, perhaps, need to stay in the Administration’s good graces as he seeks approval for other deals, including a possible bid for Warner Bros. Discovery, which owns CNN. Even if Ellison seems to care more about Warner Bros.’ entertainment properties—and Paramount’s, for that matter—than he does about news, it’s plausible that he sees hiring Weiss as throwing a bone to Trump while maintaining deniability in politer company. (Again, she’s not Bannon.) Publicly, Ellison has pledged to prioritize “truth” and “trust” at CBS, and said that he won’t politicize the network. At least some staffers say they already view this promise as worthless.\nAnd yet it’s easy to imagine a world in which Harris won, and Ellison acquired CBS and hired Weiss anyway, to similar howls from the left. (His deal for the network was struck in the summer of 2024.) Though CBS might pivot toward Trump under her leadership, it’s a safer bet that her biggest impact will be on the stories that seem to animate her most—campus protests and Israel—whether or not Trump is involved with them. Ellison’s family is close to Benjamin Netanyahu, Israel’s Prime Minister, and Ellison was reportedly attracted to Weiss’s pro-Israel politics. (Not that the pair’s presence will invent tensions over Israel at CBS; prior to Ellison’s takeover, Shari Redstone, Paramount’s controlling shareholder, repeatedly intervened to disparage editorial decisions that she felt were insufficiently sympathetic to the country’s cause.)\nUltimately, Weiss appears to be beloved of very powerful people who are distressed by the rise of wokeness, and who for some reason see themselves as “besieged outsiders,” as The Nation’s Jack Mirkinson argued recently. To read a profile of Weiss is to be slapped around the face by the names of élite admirers; those now include the Supreme Court Justice Amy Coney Barrett and the Amazon founder Jeff Bezos, whose Saturnalian wedding Weiss attended in Venice this year. It’s often fair to describe such figures as pro-Trump, but not always, and I’ve previously argued that Bezos’s recent behavior—at least as expressed through the rightward tilt of the op-ed page at the Post, which he owns—has been driven more by a mix of self-interest and the self-mythologizing that Mirkinson describes than any doctrinaire commitment to Trump. The G.O.P. pollster Frank Luntz told the Times last year that Weiss “doesn’t just speak to the 1 percent” but to “the one-hundredth of 1 percent. And they’ll listen.” Ellison fits this description, and then some. He probably didn’t need the pretext of Trump to listen, or to act.\nMaybe so—and a coming wave of insider stories attesting to Weiss’s difficulties in asserting her authority strikes me as the most inevitable outcome of this affair. But the mythology of CBS’s storied journalistic past belies a more nuanced reality. (Some of Murrow’s own colleagues thought that he was late to the battle with McCarthy, for instance.) And, while there is, to be sure, a difference between straight news and overt opinion, the line where those genres meet is fuzzy, and inevitably subjective. Even if CBS staffers (rightly) see the Free Press as opinionated, it might not see itself that way; indeed, the site claims simply to be covering the world the way it is, when mainstream newsrooms have abandoned that role. (Already, in the press release announcing her appointment, Weiss promised to make CBS News “the most trusted news organization of the 21st Century.”) This isn’t to say that everything is relative. But the truth rarely just reveals itself. The choices journalists make in seeking it inevitably inform the stories they tell.\nSometimes, the truth is viciously fought over. Trump and Weiss have certainly long been in combat mode, even if they might not always be on the same team. When Trump took on CBS earlier this year, its journalists did not back down from the stories they wanted to tell, either: one segment on “60 Minutes,” for example, quoted a source likening Trump’s intimidation of law firms to the behavior of a Mob boss, drawing another legal threat from the President; after Bill Owens, the show’s executive producer, quit, a correspondent said, bluntly, on air, that Owens felt he’d lost his independence from management amid the settlement and merger sagas. We’ll have to see what shape the fight takes from here. I don’t think that Trump has won just yet. I don’t think Weiss has, either. ♦","summary":"A change in leadership at the network has been seen as part of an effort to appease Donald Trump. But there may be other motivations.","url":"https://www.newyorker.com/news/the-lede/what-will-bari-weiss-do-to-cbs-news","image":"https://media.newyorker.com/photos/68e3c3d89d5744babd3c8cd7/16:9/w_2992,h_1683,c_limit/Allsop-BW-GettyImages-2187869182.jpg","video":null,"publish_date":"2025-10-06 18:43:59","author":"Jon Allsop","authors":["Jon Allsop"],"language":"en","category":"politics","source_country":"us","sentiment":-0.182},{"id":366805178,"title":"Bill Maher Blasts Kamala Harris for 'Playing Victim' Over Humiliating Election Loss to Trump... And Jokes Memoir Should Have Been Called 'Everyone Sucks but Me'","text":"HBO Real Time host Bill Maher has called out Kamala Harris’ new memoir, 107 Days, on October 3. \n\n\"Kamala Harris’s new memoir of the '24 election is called 107 Days, but should have been called 'Everyone Sucks but Me',\" he said.Bill Maher Claimed 'Nothing' Is Kamala Harris' Fault in Her BookCNN commentator Van Jones, a former advisor to President Barack Obama, was Maher’s guest and, shockingly, clapped at Maher’s comment. \n\n“107 Days' is a victim’s title because, get it, she only had 107 days to win,” he continued. “Yeah. Uh, and a billion and a half dollars and a built-in army of about 75 million people who’d vote for any human-adjacent life form that wasn’t Trump.\"\n\nHarris’ book, which was released in September, focuses on her short presidential campaign, which lasted only had 107 days, after Joe Biden opted not to run for a second term.\n\n\"But in 107 Days, nothing is ever Kamala’s fault. Biden lets her down by not stepping down sooner. Pouty face emoji. Gavin Newsom, he was asked for his endorsement, but texted, ‘hiking, will call back,’ but then never did. And then he didn’t even ask her to prom,\" Maher added.'America Itself Lets Kamala Harris Down,' Bill Maher QuippedIn the book, Harris discussed multiple Democrats, including Newsom, who she tried to garner endorsements from. She claims Newsom told her he was \"hiking\" and would call her back, but \"never did.\"\n\nMaher also went at Harris over her revealing in the book she didn’t pick Pete Buttigieg to be her running mate due to her feeling it was a \"risk\" as he’s gay.\n\nSpecifically, in the book, she noted Buttigieg \"would have been an ideal partner — if I were a straight white man.\"\n\n\"But we were already asking a lot of America: to accept a woman, a Black woman, a Black woman married to a Jewish man. Part of me wanted to say, Screw it, let’s just do it. But knowing what was at stake, it was too big of a risk,\" she elaborated. \"And I think Pete also knew that — to our mutual sadness.\" \n\nIn response, Maher said, \"America itself lets Kamala down by not being ready for the running mate she really wanted, Pete Buttigieg. So she’s stuck with the Home Depot paint salesman [Tim Walz], and the rest is history.\"Kamala Harris Complimented Hillary Clinton While Taking a 'Nasty Swipe' at Joe BidenAs RadarOnline.com reported, while on her book tour, Harris praised Hillary Clinton as a true mentor while taking a “nasty swipe” at Biden. \n\n\"We all hope to be mentored. We all hope to have support from those who come before. Sometimes it happens, sometimes it doesn't. And certainly that's true of politics,\" she detailed. \"Hillary Clinton is one of those people that believes in lifting people up and supporting people. And she follows through.\"\n\nWhile she didn’t call out Biden by name, the implication Biden was not overly supportive of her seemed obvious to social media users.Kamala Harris Wrote About Her Frustrations Regarding Joe BidenIn the same vein, Harris wrote the following regarding Biden in her book: “My feelings for him were grounded in warmth and loyalty, but they had become complicated, over time, with hurt and disappointment. After warmly welcoming us into the Biden family at the beginning of the campaign, there seemed to be a change of temperature after the election.”\n\nShe also expressed her frustration with Biden’s speech at the Democratic National Convention. \n\n\"He spoke for nearly an hour, detailing the accomplishments of our administration,\" Harris wrote. \n\n\"It was a legacy speech for him, not an argument for me, and he was entitled to it. But if we waited for some personal stories about working with me and what qualities he had seen that led him to endorse me, they weren't there.\"","summary":"Bill Maher blasted Kamala Harris for 'playing victim' over her humiliating election loss to Donald Trump.","url":"https://radaronline.com/p/bill-maher-kamala-harris-trump-loss-blasted-playing-victim-memoir/","image":"https://media.radaronline.com/brand-img/H744NlKeP/0x0/bill-maher-kamala-harris-trump-loss-blasted-playing-victim-1759772821040.jpg","video":null,"publish_date":"2025-10-06 18:34:37","author":"Matt Richards","authors":["Matt Richards"],"language":"en","category":"politics","source_country":"us","sentiment":-0.465},{"id":366772718,"title":"\"I've Never Met You\": Karoline Leavitt Was Truly Shocked By This Bold Question From The Latinos For Trump Founder","text":"Latinos for Trump President Bianca Gracia stunned White House press secretary Karoline Leavitt during a Friday briefing when she called for a “siesta fiesta” on the South Lawn.\n\nThe White House postponed an event to commemorate National Hispanic Heritage Month due to the government shutdown on Wednesday.\n\nDuring Friday’s press briefing, Gracia enthusiastically echoed the false claim from President Donald Trump and his allies that the shutdown occurred because Democrats want to give free health care to undocumented immigrants.\n\n“This week, the Democrats have chosen illegals over hardworking Hispanic Americans during Hispanic Heritage Month, causing the White House to cancel the celebration with the president,” Gracia said.\n\nShe then asked Leavitt if Trump is “open to letting the Hispanics, who overwhelmingly voted for him, have their own siesta fiesta in the White House lawn.”\n\nTrump made large gains with Hispanic voters in 2024, but they did not “overwhelmingly” vote for him, as Gracia claimed. According to the Pew Research Center, Democratic presidential nominee Kamala Harris still won more of their votes.\n\n“We don’t need fancy-shmancy, right?” Gracia told Leavitt. “You can give us the backyard, and we’ll fill it all in and have our own fiesta. Is the president open to that?”\n\nSurprised, Leavitt clarified she had never met Gracia, nor was she aware that the Latinos for Trump president was going to ask that question in the first place, but she welcomed her to the briefing room.\n\n“I love your energy,” Leavitt told Gracia. “I can’t personally unilaterally promise the South Lawn grounds; we have some construction going on out there.”\n\nThe press secretary then joined Gracia in taking a dig at Democrats, stating that when they “vote to reopen the government, that event will be back in the planning stages.”\n\nWatch the full briefing room moment below","url":"https://www.yahoo.com/news/articles/ive-never-met-karoline-leavitt-172813426.html","image":"https://s.yimg.com/ny/api/res/1.2/BmcwZsR1o831K51.gqMZjA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTE0MDA7aD05MzQ7Y2Y9d2VicA--/https://media.zenfs.com/en/buzzfeed_articles_778/c1d0d40961f55fa1c45304e5a730de20","video":null,"publish_date":"2025-10-06 17:28:13","author":"Pocharapon Neammanee","authors":["Pocharapon Neammanee"],"language":"en","source_country":"us","sentiment":-0.443},{"id":366764420,"title":"Nearly 20% of younger voters say they would not elect a woman as president, new poll finds","text":"An overwhelming majority of American voters believe it’s important to elect more women to political office, but younger voters are the least open to voting for a woman as president, according to a new poll.\n\nDespite broad support for more women in office across all demographics, Americans under 50 are the least likely to elect a woman president themselves, according to survey results from American University.\n\nNearly one in five voters said they or someone with whom they are close would not vote for a woman as president — including one-quarter of women under 50 and nearly 20 percent of men under 50. Only 13 percent of men and women over 50 said they would support a woman candidate.\n\nThe survey of 801 registered voters through the university’s Women and Politics Institute was performed online from September 3-6 and has a 3.5-point margin of error.\n\nDespite wide majority support for more women in politics, the survey reveals paradoxical thinking among voters, who trust women on critical issues and want to see more of them in office while “persistent bias” and narrow expectations emerge when it comes to envisioning them as president.\n\nExpectations for a “first female president” are narrowly defined, with the picture of a married Democratic mother under 65 with political experience as a model candidate, the survey found.\n\nWomen candidates also face a “double bind” where survey respondents want women to be both “tough” and “likable” in standards that are not typically applied to their male counterparts, the poll found.\n\nRepublican men are more likely to believe women achieve leadership roles due to alleged hiring quotas or through manipulation, while women are more likely to see structural barriers and an “old boys’ club” as well as negative media scrutiny and self-doubt as key deterrents that prevent more women in politics.\n\nThe survey — arriving nearly one year after former Donald Trump defeated former Vice President Kamala Harris in the 2024 presidential race — also found that respondents are divided on whether her candidacy has made it easier or harder for a woman to become president.\n\nDemocratic, Republican and independent women were nearly evenly divided on the question, though 45 percent of Republicans overall — including 47 percent of Republicans over age 65 — believed her loss has made it less likely the country will elect a female president.\n\nNearly 60 percent of Democratic voters, however, said her campaign will make it more likely that a woman president will be elected in the future.\n\nThe survey also noted that while only one-third of voters listen to “bro culture” podcasts — the so-called “manosphere” media that put Trump in front of millions of young listeners in 2024 — they are overwhelmingly popular with people under age 50. More than three-quarters of people aged 50 and older did not listen to those podcasts within the last year.\n\nFour in five of those who listen to those podcasts believe they affected the election’s outcome.\n\nEighty-two percent of listeners say those podcasts affected the results “a great deal” or “a fair amount.” Only 16 percent overall said they have no impact.","summary":"Most voters want to elect more women, but sexist double standards emerge when picturing them as president","url":"https://www.independent.co.uk/news/world/americas/us-politics/young-voters-elect-women-president-poll-b2840377.html","image":"https://static.independent.co.uk/2025/10/06/16/26/BESTPIX-Kamala-Harris-Book-Tour-In-Los-Angeles-x9tszilf.jpeg?crop=7723.5,5149,x3.7,y0&trim=0,4,0,3&width=1200","video":"https://cdn.jwplayer.com/videos/GsnJ32UN-OhrQWqOm.mp4","publish_date":"2025-10-06 17:22:49","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":0.204},{"id":366778020,"title":"George Clooney doesn't think Democrats will ask him to pen another op-ed: 'People have heard enough from me'","text":"George Clooney doesn’t think the Democratic party will be asking him for any favors any time soon. \n\n In a new Esquire cover story, the 64-year-old Jay Kelly star was asked if he thought the party would ever tap him to write any more op-eds after he penned a July 2024 essay for The New York Times calling for then-President Joe Biden to drop out of the presidential race. \n\n “I don’t think so,” Clooney replied. “I think people have heard enough from me. I wasn’t doing it to, you know—I was doing it because I’d been a personal witness to things.” \n\n In his essay, which was titled “I Love Joe Biden, But We Need a New Nominee,” Clooney voiced his belief that Biden should exit the presidential race after personally seeing the politician’s decline at a fundraising event weeks earlier. Just days later, Biden officially ended his bid for reelection and endorsed Vice President Kamala Harris in his stead. \n\n Clooney, a self-described “lifelong Democrat,” commended Biden’s decision to step aside at the time, calling it “the most selfless thing that anybody's done since George Washington.” \n\n He added, “It’s very hard to let go of power. We know that. We've seen it all around the world. And for someone to say, 'I think there's a better way forward,' all the credit goes to him, and that's really the truth.\"\n\n Clooney later explained that he considered writing the piece to be his “civic duty” during an interview with CNN’s Jake Tapper in April. When asked if people were still angry at him about the article, he replied, “Some people, sure.”\n\n But he didn’t let it bring him down. \"It's okay. You know, listen. The idea of freedom of speech, the specific idea of it, is you can't demand freedom of speech but don't say bad things about me. That's the deal,\" Clooney said. \"You have to take a stand. If you believe in it, take a stand. Stand for it. Then deal with the consequences. That's the rules.\"\n\n He added, “I'm okay with criticism for where I stand. I defend their right to criticize me as much as I defend my right to criticize them.\"\n\n Get your daily dose of entertainment news, celebrity updates, and what to watch with our EW Dispatch newsletter.\n\n And Clooney certainly has been criticized for his remarks. Biden’s son Hunter slammed the Oscar winner for advocating for his father to end his reelection bid in an interview three months ago. \n\n \"What do you have to do with f---ing anything? Why do I have to f---ing listen to you?\" Hunter said. \"What right do you have to step on a man who’s given 52 years of his f---ing life to the service of this country and decide that you, George Clooney, are going to take out basically a full page ad in the f---ing New York Times to undermine the president?\"\n\n Donald Trump, who won over Harris, has also lambasted Clooney, calling the Good Night, and Good Luck director a “second-rate movie star” and “failed political pundit” in March. \n\n “He fought hard for Sleepy Joe’s election and then, right after the debate, dumped him like a dog,\" Trump wrote on Truth Social. \"Later, I assume under orders from the [Barack] Obama camp, pushed all out for Kamala, only to soon realize that that was not going to work out [too] well.\"\n\n While speaking with Esquire, Clooney said he does believe the U.S. will be able to survive Trump’s second term, but that “a lot of damage is going to be done” along the way. \n\n “So we’re going to get through it, but a lot of damage is going to be done along the way because of where we are,” he told the outlet. “And it is heartbreaking to see. And Democrats are gonna have to get their act together.” \n\n He continued, “And they will. Coming out of the Iraq war and all that is what brought us Obama —brought us a really good leader. And we’re gonna need it.”","summary":"The Oscar winner noted that he believes the United States will survive a second Trump presidency, but that \"a lot of damage is going to be done” along the way.","url":"https://ew.com/george-clooney-doesnt-think-democrats-another-op-ed-11824805","image":"https://ew.com/thmb/SxytrW7TI5YLs2U8vZADqSx3LkU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/george-clooney-02-100625-d3815a896ba44e1a88193ab1c26fe857.jpg","video":null,"publish_date":"2025-10-06 17:10:28","author":"Emlyn Travis","authors":["Emlyn Travis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.181},{"id":366747112,"title":"Taylor Swift fans ‘terribly disappointed’ over bizarre rumoured AI videos","text":"To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nAs with any new Taylor Swift album, the world has lost its mind analysing lyrics and tearing apart the songs for glimpses into her life.\n\nSpeculated diss tracks and ‘tradwife’ lyrics continue to be a hot topic, but Swifties have a major complaint when it comes to The Life of a Showgirl.\n\nFans were shocked when what seemed to be AI-generated videos surfaced online, appearing to promote Taylor’s 12th album.\n\nIt comes as tensions in the creative industry rise after the first-ever AI-powered ‘R&B singer’ signed a $3,000,000 record deal, and an ‘AI actress’ debuted.\n\nThe Opalite singer, 35, has previously been outspoken about AI usage when deepfake explicit images of her were made and distributed online.\n\nThis led to X blocking any search of ‘Taylor Swift AI’ on their site last year to prevent the manufactured images from circulating.\n\n The videos appeared after her new album dropped (Picture: Brooke Sutton/Getty Images)\n\n The Life of a Showgirl was released on Friday, October 3 (Picture: Mert Alas and Marcus Piggott)\n\nWhat are the rumoured Taylor Swift AI videos?\n\nThis so-called ‘Orange Door’ campaign was kicked off when fans googled Taylor’s name, with a little orange heart appearing on the bottom of the screen.\n\nOnce fans clicked the button a message reading ’12 cities, 12 doors, one video to unlock’ floated up the page.\n\nFans then needed to repeatedly click the fire heart emoji button — mirroring the one Taylor used in her Instagram post for the new album — as individual letters fell onto the screen.\n\nThese letters spelt anagrams which have since been decoded as the following cities: London, Paris, Milan, Berlin, Barcelona, Melbourne, and US cities of Chicago, Nashville, New York, Santa Monica, Las Vegas and Beverly Grove in California.\n\nThe page then continues to drop animated orange doors, with no further information offered. \n\n The Google puzzle led you to different cities (Picture: Google)\n\nMELBOURNE DOOR FOUNDAt Melbourne Central https://t.co/yiwUJcPVYL pic.twitter.com/3btP8ncF6P— julia 🏹 (@tayvis8789) October 5, 2025\n\nSome fans then reported seeing physical doors appearing in the listed cities with a QR code on them.\n\n‘MELBOURNE DOOR FOUND At Melbourne Central,’ wrote tayvis8789 on X, sharing pictures of the door which had ’12’ written on it.\n\nThe QR code then supposedly took fans to the teaser videos on Taylor Swift’s official YouTube channel.\n\nHowever, the links shared are no longer working and the YouTube Shorts are not visible on Taylor’s channel.\n\nWhat do The Life of a Showgirl AI videos show?\n\nEach city is said to have a different video; however, only a handful have been found.\n\nThe London video shows a bar, with a toy carousel and Ferris wheel moving, before heading into a backstage dressing room.\n\nAnother clip, dubbed the ‘Paris video’ features a garden full of nature with a Greek-inspired statue, reminiscent of Taylor’s previous music videos.\n\n The videos used imagery Taylor has used previously (Picture: X/TheSwiftSociety)\n\n https://www.instagram.com/reel/DPZl6rakcuW/\n\nA third video shows a luxury dressing room again but this one is a direct copy of that featured in the Fate of Ophelia music video, with a cat hiding under a chair. \n\nThe AI accusations began when fans pointed out a coat hanger in the London video, which appeared to have two hooks that merged into one as the camera shifted.\n\nThe toy Ferris wheel in the same clip was also accused of being blurry; meanwhile, other videos had odd textures like Berlin’s cat’s fur.\n\nSome fans did defend the clips, stating that it could just be CGI with some glitches rather than full AI videos.\n\nWhat are the supposed Taylor Swift AI videos for?\n\nIt’s unclear what the intention was behind the doors; possibly a large Easter egg hunt, as fans claimed letters were found in the footage.\n\nWhen put together, they reportedly spelt: ‘You must remember everything but mostly this: the crowd is your king.’\n\nThe Crowd is Your King was a vinyl variant released for The Life of a Showgirl, promoted with the cinematic launch party.\n\nAccording to online sleuths, not all the doors have been unlocked yet but if you Google this line from one of the poems (found on her vinyls) the orange emoji appears again.\n\nAn orange door, mimicking the final door of the Eras Tour, drops down, and you ‘knock’ once more to enter, taking you to The Fate of Ophelia official lyric video.\n\nThis function was only reached after 12million fans ‘knocked’ on the door, with that number now over 14 million. \n\nThe Fate of Ophelia music video has also been released on Taylor’s YouTube after a launch party in cinemas over the weekend.\n\nHas Taylor Swift addressed the supposed AI videos?\n\nTaylor’s social media accounts have not mentioned this campaign so far and the YouTube Shorts are not visible on her channel.\n\nSome fans had posted links for others to view but these no longer work, with a note saying the video is ‘unavailable’.\n\nWhen Taylor launched the 1989 (Taylor’s Version) Google puzzle, she and her fan interaction account, Taylor Nation, were incredibly active in encouraging fans.\n\n Taylor has not addressed the videos (Picture: PA Wire)\n\nFor this campaign, neither has posted anything about hidden clues or discovering doors.\n\nSince the breadcrumbs came through Google, fans have speculated that this may have been made to promote Google’s Veo video maker and AI products as a collaboration.\n\nShe has not said anything about the criticism of the supposed AI usage, but has previously slated AI-generated deepfakes. \n\nWhat have Taylor Swift fans said about the videos?\n\nFans took to social media to discuss the videos and express disappointment in Taylor for supposedly using AI, although this is not confirmed.\n\n‘Wtffffff happen to art STOP AIIII,’ wrote qxeenbey4 under a post sharing the Paris video, which was filled with flowers, birds and squirrels.\n\ni was trying to defend taylor a bit but i cant defend this at all and i cant ignore it and im very upset bc why is she using ai………….. girl ur a billionaire who spent the last five years reclaiming your art what are you DOING!!!!!!!!!! https://t.co/DOsW2tzly9— 🌷 , petra! 𝜗ৎ (@peterfemmejay) October 4, 2025\n\ntaylor has literally used ai in EVERY of these tloas little visuals 😭 this is literally so bad considering she's the biggest artist out there right now. why a billionaire spending YEARS defending their art would need this? terribly disappointing. and there's more pic.twitter.com/jZeGCmSHjv— ໊ (@dieforyous) October 5, 2025\n\nPeterfemmejay said: ‘I was trying to defend Taylor a bit but I can’t defend this at all and I can’t ignore it and I’m very upset bc why is she using AI………….. girl ur a billionaire who spent the last five years reclaiming your art, what are you DOING!!!!!!!!!!’\n\nDieforyous claimed: ‘Taylor has literally used AI in EVERY of these tloas little visuals 😭 this is literally so bad considering she’s the biggest artist out there right now. Why a billionaire spending YEARS defending their art would need this? terribly disappointing.’\n\nWhat has Taylor Swift said about AI?\n\nThe use of AI in creative works is highly controversial, given that artists’ works need to be fed into its database for images to be generated, which many feel amounts to plagiarism.\n\nXicoia, an AI company, recently received backlash when they advertised that an actress, Tilly Norwood, was looking for an agent — only she was completely computer-generated.\n\n Recently, an AI ‘actress’ Tilly Norwood was unveiled, raising concerns (Picture: via REUTERS)\n\nConcern was quickly raised that the first thing the company did was build an approximation of a young woman, who will never age, completely in their control and unable to say no.\n\nMeanwhile, in music, Xania Monet charted on the Billboard singles charts and landed a $3,000,000 record deal despite being AI.\n\nCreator Talisha Jones used Suno, a Chat-GPT equivalent, to make the singer whose song How Was I Supposed to Know? reached number 22 in the US.\n\nLast year, Taylor publicly spoke out against AI when American President Donald Trump posted an AI picture of her supporting him.\n\n https://www.instagram.com/p/C_wtAOKOW1z/?hl=en\n\n Taylor has not spoken out about the videos (Picture: Kevin Winter/TAS24/Getty Images for TAS Rights Management)\n\nIn actuality, the Actually Romantic singer is a longstanding democrat who has vocally thrown her support behind Kamala Harris and against Trump.\n\nAt the time, she wrote on Instagram: ‘Recently I was made aware that AI of “me” falsely endorsing Donald Trump’s presidential run was posted to his site. It really conjured up my fears around AI, and the dangers of spreading misinformation. \n\n‘It brought me to the conclusion that I need to be very transparent about my actual plans for this election as a voter. The simplest way to combat misinformation is with the truth.’\n\nMetro has reached out to Taylor Swift’s reps for comment.\n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"The videos appeared online.","url":"https://metro.co.uk/2025/10/06/taylor-swift-fans-terribly-disappointed-bizarre-rumoured-ai-videos-24350155/","image":"https://metro.co.uk/wp-content/uploads/2025/10/GettyImages-2196121480-87a1.jpg?quality=90&strip=all","video":null,"publish_date":"2025-10-06 17:07:21","author":"Danni Scott","authors":["Danni Scott"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.047},{"id":366764816,"title":"Minnesota government worker who got away with vandalizing Teslas thanks to America's wokest DA STILL has his taxpayer-funded job","text":"A Minnesota Department of Human Services employee, whose Tesla vandalism spree in Minneapolis was caught on video, is still employed by the state. \n\nTaxpayers are continuing to pay the salary of Dylan Adams, a fiscal policy analyst at the Minneapolis DHS. \n\nIn March, Adams racked up more than $21,000 in damages during work hours as he walked around the city with his dog and keyed the electric cars. \n\nWhen asked about consequences Adams may have faced for his vandalism, a DHS spokesperson confirmed to the Daily Mail that 'Dylan Adams is a current employee.' \n\nThe spokesperson also said, 'no public data exists with respect to disciplinary action.'\n\nAdams' acts of vandalism were caught on video because Teslas are equipped with 360 degree cameras and automatically record when someone approaches the vehicle. \n\nDespite the damning footage, Hennepin County District Attorney Mary Moriarty declined to pursue criminal charges against Adams. Her office instead said it would seek a 'diversion' of the case.\n\n'This is an approach taken in many property crime cases and helps to ensure the individual keeps their job and can pay restitution, as well as reducing the likelihood of repeat offenses,' Moriarty said. \n\n'Criminal prosecution remains a possibility should unlawful behavior continue.'\n\nDistrict attorney Moriarty has been criticized in the past for her progressive approach in dealing with criminals. \n\nOne of her biggest controversies came in 2023, when she played a key role in overturning the conviction of a man who was arrested for murdering a flower shop employee during a robbery in 2004. \n\nShe has established a first-of-its-kind Conviction Integrity Unit dedicated to re-examining past convictions and pursuing 'appropriate relief' for those convicted. \n\nHer office also announced this year that it would stop prosecuting felony cases that stem from low-level traffic stops. \n\nMoriarty announced in August that she would not be seeking reelection in 2026. \n\nHer approach to criminal justice was extended to Adams as well, which frustrated police and some members of the Minneapolis community. \n\nMinneapolis Police Department Chief Brian O’Hara said: 'Our investigators are always frustrated when the cases they poured their hearts into are declined,' adding that victims of crimes usually feel the same way. \n\nThe videos of Adams' vandalism clearly show him keying four Teslas, three of which were in downtown Minneapolis and one that was at a Target in Northeast Minneapolis. \n\nSince President Donald Trump was elected and Tesla owner Elon Musk began publicly backing him, the electric vehicles, their charging stations and dealerships, have all become targets of politically-motivated violence by left-wingers. \n\nSome have taken it a step further, calling Musk a Nazi and saying he should be killed. Tesla owners have reported public attacks ranging from verbal abuse and curse words to physical assault. \n\nAs a state employee, Adams' boss is technically Governor Tim Walz, who was presidential candidate Kamala Harris's pick for vice presidential running mate. \n\nIn March, the same month Adams was recorded vandalizing Teslas, Walz disparaged Elon Musk and his electric car company at an event in Wisconsin. \n\nThe governor said he gets a 'little boost' from watching Tesla's stock drop, before adding that if a person owns a Tesla, 'we're not blaming you. You can take dental floss and pull the Tesla thing off, you know?' \n\nThe FBI and the Justice Department have said they will treat attacks on Teslas and their related facilities as 'domestic terrorism' because there is a strong likelihood of a political motive. \n\nThat has led to some people online calling for the federal government to step in and prosecute Adams where the state has not.","summary":"Taxpayers are continuing to pay the salary of Dylan Adams, an employee at the Minneapolis DHS who was caught on video vandalizing Teslas in Minneapolis.","url":"https://www.dailymail.co.uk/news/article-15166357/Minnesota-Dylan-Adams-tesla-vandal-employed-government.html","image":"https://i.dailymail.co.uk/1s/2025/10/06/17/102749197-0-image-m-18_1759767586446.jpg","video":null,"publish_date":"2025-10-06 16:55:08","author":"Editor,Eliot Force","authors":["Editor","Eliot Force"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.018},{"id":366748756,"title":"Joe Concha mocks Kamala Harris book that ‘plays the victim’","text":"Concha was referring to Harris’s husband, Doug Emhoff, who is an attorney and partner at the law firm Willkie Farr & Gallagher.\n\nHarris is stoking rumors that she could run for president again in 2028 by embarking on a book tour across the country. However, Concha predicted that with the book, Harris is “not setting herself up very well for 2028 now.”\n\n“Kamala Harris here seems to point the finger at everybody except her own performance, which, again, when she’s outside of a teleprompter and went on The View for example, and couldn’t explain what she would do differently from Joe Biden, didn’t have a good answer for that, which was really the one point why she existed: to be the change candidate,” Concha said.\n\nIn the book, titled 107 Days, Harris claims that she “often learned that the president’s staff was adding fuel to negative narratives” about her as she ran her campaign.\n\n“I’m sorry, this is something that she plays the victim, and she’s anything but the victim because the only victim here was the Democrat Party because they’ve been set back years as a result of this horrible 107 days,” Concha said.\n\nHarris did not win over a single swing state in 2024 despite a war chest of over $1 billion.","summary":"Washington Examiner columnist Joe Concha criticized former Vice President Kamala Harris for writing a book about her 2024 presidential campaign that “seems to point the finger at everyone except her own performance.” “If you look at [Harris] and her husband are worth nearly $10 million,” Concha said Sunday on Fox and Friends. &#8220;They have plenty [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3838710/joe-concha-mocks-kamala-harris-book/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/Harris-Book-Ford.jpg?w=696","video":null,"publish_date":"2025-10-06 16:53:01","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","source_country":"US","sentiment":-0.553},{"id":366730372,"title":"Running for Cover(s): A Look at the Grammys’ Newest Category","text":"Skip to main content\n\nOctober 6, 2025 9:30am\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nGlory, by Perfume Genius; Man’s Best Friend, by Sabrina Carpenter; Private Music, by Deftones; From Zero, by Linkin Park; and Mayhem, by Lady Gaga.\n\nCourtesy of Studio (5)\n\nShare on Facebook\n\nShare to Flipboard\n\nSend an Email\n\nShow additional share options\n\nShare on LinkedIn\n\nShare on Pinterest\n\nShare on Reddit\n\nShare on Tumblr\n\nShare on Whats App\n\nPrint the Article\n\nPost a Comment\n\nWhen Sabrina Carpenter unveiled the cover this past summer for her latest album, Man’s Best Friend, she got a lot of attention — and not in a good way. Depicting the pop star on her knees in a dog-like pose while her hair is presumably being pulled by a male, the cover caused a stir on social media for what many felt looked like objectification. In response, Carpenter released an alternative cover but defended the image as satire.\n\nIronically, the controversy arose just as the Recording Academy decided to put the spotlight on album cover art again. On June 12, just a day after Carpenter’s cover was revealed, Recording Academy CEO Harvey Mason Jr. announced that the 2026 Grammys would give an award for best album cover as a stand-alone category, something it hasn’t done since 1973. The category existed when the first Grammys took place in 1959 (Frank Sinatra won) but was renamed best album package in 1974 and then best recording package in 1994, both efforts to encompass a release’s full and vibrant visual presentation.\n\nRelated Stories\n\nGrammys 2026: The State of the Race\n\nHollywood Flashback: Outkast Found a Breath of Fresh Air With 'Stankonia'\n\n“Having things that solely exist now in the digital space as just a singular image, I think it’s really cool to celebrate and recognize album covers,” says Frank Maddocks, vp creative at Warner Records. “Now that these images don’t actually end up being physical pieces when many people see them, it only makes sense that there would be something to acknowledge this.”\n\nIndeed, streaming services and social media dominate music discovery these days, so many fans only see a thumbnail when they’re listening or shopping for music. A separate best recording package category will now include tangible boxed or special limited-edition releases, leaving covers to be judged on their own.\n\n“A lot of my favorite musicians growing up built an entire visual world around their albums,” Perfume Genius, aka Michael Alden Hadreas, says about album cover art. “It’s a way to get closer; it made you feel like you knew where the songs lived, and you could go there too.”\n\nPerfume Genius’ latest, Glory, is a strong contender for the new category, depicting an artful yet curious scene: Hadreas laying contorted in what looks like a home studio as a mysterious figure stands outside a window. It makes you ponder what exactly is going on in the moment captured.\n\n“I wanted [it] to have a balance between high and low, deep meaning and absurdity,” he says of the image. “The record is an attempt to externalize complicated, contradictory feelings I have trouble articulating in my everyday life. The art feels like an extension of that — a way to try to squeeze out as much as possible.”\n\nMaybe you can’t judge a book by its cover, but when it comes to great albums, there’s usually a deeper connection between what’s on the outside and the music on the inside. Lady Gaga’s Mayhem, for example, melds her image with the foreboding aesthetic of her tour and gothy moods of the songs within. It’s surely another contender for a nod this year.\n\nOn the other hand, sometimes album art is so powerful and eye-catching, it doesn’t necessarily need to reference the creative expression it envelops, or even the artist. Like other Grammy categories, what’s “best” is subjective, but no one would argue that exemplary album cover art engages fans and beckons new ones.\n\nCharli XCX‘s Brat, the winner of best recording package last year, went viral for its distinctive bright green hue and simplistic typeface, which put all the attention on the title and turned it into a cultural moment that everyone wanted to identify with.\n\nCharli XCX’s breakout Brat, her sixth studio album, helped kick-start Kamala Harris’ presidential run after the singer posted that “Kamala IS brat.”\n\nCourtesy of Studio (2)\n\n“Brat was super impactful,” says Maddocks, who worked on the two album covers his label hopes will be nominated this year — Linkin Park’s From Zero (a photo of layers of paint and glass) and Deftones’ Private Music. “It showed that you can do something simple but with a thought process that, coupled with a great album, really works.”\n\nOf his striking work on Linkin Park’s and Deftones’ releases this year, which are art-driven (and not AI, by the way), Maddocks says: “It’s really about pushing against what we’ve already done and also pushing against what’s popular or trending. We’re always trying to do something left of center and kind of unexpected … to create images that are striking and memorable.”\n\nTHR Picks the Best Album Covers That Would Have — and Should Have — Been Winners\n\nMick Jagger (left) and Keith Richards of The Rolling Stones epitomized the vibe of the band’s 1971 album, Sticky Fingers, and its cover art\n\nChris Walter/WireImage\n\nDuran Duran, Rio (1982)\n\nPatrick Nagel’s clean, modern, color-drenched portraiture brought an air of mystery and exotic allure to the U.K. new wave sensation’s debut and made the artist’s stark yet sensual female illustrations synonymous with the decadence of the 1980s.\n\nDuran Duran, Rio, 1982\n\nCourtesy of Studio\n\nMichael Jackson, Dangerous (1991)\n\nMark Ryden’s surrealist circus-themed album cover is the King of Pop’s most artful and beautiful ever, chock full of symbolic Easter eggs, evocative elements and personal themes that bring dimension to his personal experience and the music it inspired.\n\nMichael Jackson, Dangerous, 1991\n\nCourtesy of Studio\n\nPink Floyd, Dark Side of the Moon (1973)\n\nMinimalistic yet vibrant, the now-iconic prismatic spectrum image and contrasting black background designed by Storm Thorgerson of Hipgnosis is eye-catching and eerie. It also evokes the complex and cosmic themes of Floyd’s music as well as its most ominous moods and subjects.\n\nPink Floyd, Dark Side of the Moon, 1973\n\nCourtesy of Studio\n\nThe Rolling Stones, Sticky Fingers (1971)\n\nCraig Braun and Andy Warhol’s provocative crotch shot with working zipper design and underwear inner sleeve was nominated for best “package” in 1972, but it was probably too risqué to win back then. The main image alone has inspired many below-the-belt covers to come — though none were ever as cool. Today, it’d be no contest.\n\nThe Rolling Stones, Sticky Fingers, 1971\n\nCourtesy of Studio\n\nRead more from THR’s Music Issue\n\nThis story appeared in the Oct. 1 issue of The Hollywood Reporter magazine. Click here to subscribe.\n\nTHR Newsletters\n\nSign up for THR news straight to your inbox every day\n\nTaylor Swift\n\nTaylor Swift Shoots Down “Shockingly Offensive” Question During Interview\n\nTina Turner\n\nIke Turner Jr., Grammy Winner and Son of Ike and Tina Turner, Dies at 67\n\nThe Life of a Showgirl\n\nTaylor Swift Releases Video for “The Fate of Ophelia” on YouTube\n\nThe Life of a Showgirl\n\nTaylor Swift’s ‘The Life of a Showgirl’ Sells 2.7 Million Copies in First Day Release\n\nThe Life of a Showgirl\n\nTaylor Swift Reveals ‘The Life of a Showgirl’ Acoustic Recordings in Limited CD Release\n\nKristi Noem Warns ICE Will Be “All Over” 2026 Super Bowl, Slams NFL for Naming Bad Bunny Halftime Headliner\n\nThe Hollywood Reporter is a part of Penske Media Corporation. © 2025 The Hollywood Reporter, LLC. All Rights Reserved.\n\nTHE HOLLYWOOD REPORTER is a registered trademark of The Hollywood Reporter, LLC.\n\nPowered by WordPress.com VIP","summary":"For the first time in 50 years, the Grammys are honoring outstanding album art.","url":"https://www.hollywoodreporter.com/music/music-features/grammy-awards-best-album-cover-category-1236388282/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/10/27fea_grammy_albums_image_hero-SPLASH-2025.jpg","video":null,"publish_date":"2025-10-06 16:30:00","author":"Lexy Perez,Lina Lecaro","authors":["Lexy Perez","Lina Lecaro"],"language":"en","source_country":"us","sentiment":0.071},{"id":366715222,"title":"Roy Cooper’s Chances of Winning Key Senate Race As He Outraises GOP Rival","text":"Former North Carolina Governor Roy Cooper, a Democrat, outraised Republican Michael Whatley in the Tar Heel State’s critical Senate race during the last quarter.\n\nNewsweek reached out to the campaigns of Cooper and Whatley for comment via email.\n\nWhy It Matters\n\nNorth Carolina’s Senate race is set to be among the most closely watched elections of the 2026 midterms as Democrats hope President Donald Trump’s deteriorating approval rating could drive them to victory across the country.\n\nTypically, the party in the White House does lose seats in the midterms, and Cooper, who enjoyed strong approval during his time as governor, was viewed as a top tier candidate. Whatley previously served as the chair of the Republican National Committee and the chair of the North Carolina GOP, so he is also well known on the state’s political scene.\n\nFundraising will be critical for both candidates as they spend the next 13 months making their cases to voters about why they should represent the state in Washington. North Carolina is a closely divided state that has narrowly broken for Republicans in presidential and Senate races in recent years.\n\nWhat to Know\n\nCooper’s campaign announced on Monday that he raised $14.5 million in the third quarter of 2025. His campaign touted that as the “largest amount ever raised during a U.S. Senate challenger campaign’s first quarter and raised in only 65 days since the campaign launched.”\n\nWhatley, meanwhile, raised $5.8 million in the third quarter, reported The Washington Examiner.\n\nBoth Cooper and Whatley are viewed as major front-runners in their respective parties’ primaries, as neither have drawn high profile challengers. They are running to replace retiring Senator Thom Tillis, a Republican. Tillis announced his retirement after voting against Trump’s One Big Beautiful Bill. Tillis had been at odds with the state party for years over his more moderate positions on issues like LGBTQ+ rights and immigration.\n\nFormer North Carolina Governor Roy Cooper speaks during the Democratic National Convention on August 22, 2024 in Washington, D.C.\n\nPublic polling indicates that Cooper holds an advantage over Whatley at this point.\n\nAn Emerson College poll from July showed Cooper up six points over Whatley (47 percent v. 41 percent). It surveyed 1,000 registered voters from July 28 to July 30 and had a margin of error of plus or minus three percentage points.\n\nMeanwhile, a Harper poll showed Cooper up four points (46 percent to 42 percent). It surveyed 600 likely voters from September 14 to September 15 and had a margin of error of plus or minus 3.98 percentage points.\n\nA Change Research poll showed Cooper up seven points (48 percent to 41 percent). It surveyed 855 likely voters from September 2 to September 8, 2025 and had a margin of error of plus or minus 3.6 percentage points.\n\nNorth Carolina has been close in recent elections, but Democrats have struggled to reach a plurality of voters in federal races, even as they perform well in gubernatorial races. In 2020, the state backed Trump over former President Joe Biden by just over a percentage point. In 2024, Trump prevailed over former Vice President Kamala Harris by about three points.\n\nIn 2022, Republican Ted Budd, then a member of Congress, defeated Democrat Cheri Beasley by about three points. GOP Senator Thom Tillis narrowly defeated Democrat Cal Cunningham by less than two points in 2020. In 2016, former GOP Senator Richard Burr defeated Democrat Deborah Ross, now a member of Congress, by nearly six percentage points.\n\nAt the same time, Democrats have won recent gubernatorial races. Democrat Josh Stein, who succeeded Cooper, won November’s gubernatorial race by nearly 15 points after Republican Mark Robinson faced a series of scandals on the campaign trail.\n\nWhat People Are Saying\n\nCooper’s campaign manager Jeff Allen wrote in a press release: “Roy Cooper will always put North Carolinians first, and this record-breaking fundraising reflects a massive groundswell of support for our campaign. This will be the most competitive race in the country, and we’re putting a people-powered organization together to flip this seat and send Roy Cooper to the Senate to lower costs and deliver for North Carolina families.”\n\nWhatley wrote to X last week: “I am incredibly grateful for each and every donation to my campaign. In the Senate, I will be a true America First ally to President Trump and deliver real results for the people of North Carolina.”\n\nWhat Happens Next\n\nThe Cook Political Report and Sabato’s Crystal Ball both classify the North Carolina Senate race as a pure toss-up, a sign of how competitive both parties view the race. North Carolina’s primary is set for March 3, 2026, and the general election will be held November 3, 2026.","summary":"North Carolina&#039;s Cooper touted $14.5 million in contributions in what is expected to be among the most competitive midterms races.","url":"https://www.newsweek.com/roy-cooper-senate-race-north-carolina-10834548","image":"https://assets.newsweek.com/wp-content/uploads/2025/10/GettyImages-2167982068.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-10-06 15:35:16","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","source_country":"US","sentiment":-0.26},{"id":366756784,"title":"Taylor Swift Told Fans They Need To Buy Four More Versions Of Her Album To Hear Seven Acoustic Songs And A Voice Note, And People Have Finally Had Enough","text":"If you need reminding, Taylor decided to publicly endorse Kamala Harris in the presidential election after fake images of her endorsing Donald Trump began to circulate online, with Taylor saying on Instagram at the time: “Recently I was made aware that AI of ‘me’ falsely endorsing Donald Trump’s presidential run was posted to his site. It really conjured up my fears around AI, and the dangers of spreading misinformation.”\n\nAfter the album's release, fans were excited to discover secret TLOAS promo billboards hidden in 12 different cities across the globe. Each one showed an orange door with a QR code that led to a video exclusive to each country, and visibly AI-generated. Here's London's as an example.\n\nLetters of the alphabet were hidden in each of the videos, and fans eventually worked out that they spelled: \"You must remember everything but mostly this the crowd is your king.\"\n\nThese Easter egg videos were promoted on X by YouTube, and were originally shared to Taylor's YouTube page, but appear to have since been deleted — which may be due to the backlash they received. \n\nResponding to the videos, one disappointed Swiftie shared a screenshot of this post and simply asked: “where are you :( #SwiftiesAgainstAI,” to which another user replied: “she ‘fights’ for causes when she is the victim. she always did this and this is just one more example. she was anti ai because someone made a video of her. she is a feminist when people are misogynistic towards her. and then she calls women bitches in her music with ai videos.”\n\nThis tweet has been liked more than 137,000 times since it was posted on Sunday. \n\nSomebody else agreed: “It’s white feminism. All the activism begins and ends with situations about her and herself only.”\n\nIt's worth noting that while the videos were shared to Taylor's official account, it's not known how personally involved she was with this promo gimmick.","summary":"“Can’t you just be nice to your fans for once? Haven’t you got enough of their money yet?”\n\nView Entire Post &rsaquo;","url":"https://www.buzzfeed.com/stephaniesoteriou/taylor-swift-fans-four-cds-ai-videos-backlash-explained","image":"https://img.buzzfeed.com/buzzfeed-static/static/2025-10/06/14/thumb/Rn9AIsUt1.jpg?crop=1245:830;3,0&resize=1250:830&resize=1200:*","video":null,"publish_date":"2025-10-06 15:28:01","author":"https://www.buzzfeed.com/about,Stephanie Soteriou","authors":["https://www.buzzfeed.com/about","Stephanie Soteriou"],"language":"en","source_country":"au","sentiment":-0.206},{"id":366744124,"title":"CBS buys The Free Press website, installs founder Bari Weiss as CBS News editor-in-chief","text":"NEW YORK (AP) — Paramount said Monday that it has bought the commentary website The Free Press and installed its founder, Bari Weiss, as the editor-in-chief of CBS News, a newly created position.\n\nThe announcement, while anticipated, is a bold move for the venerable television news network initiated by new corporate leader David Ellison. Weiss’ experience is in print journalism, particularly in commentary.\n\n“I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,” Ellison said in a news release. “This move is part of Paramount’s bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world.”\n\nSome at CBS News have been concerned that the news division is moving in a direction more friendly to President Donald Trump.\n\nThis year, Paramount Global agreed to pay Trump $16 million to settle a lawsuit regarding the editing of an interview with then presidential candidate Kamala Harris on CBS’ storied “60 Minutes” news program.\n\nJournalists were infuriated and a senator suggested an investigation to determine whether bribery laws were broken. The company was hoping to put the issue to rest as it sought administration approval of a major merger.\n\nThat deal has since been approved by the Trump administration.\n\nNo purchase price was announced for The Free Press, which has been a success in the five years since Weiss started it after leaving The New York Times as an opinion editor. When she left the Times, she wrote a letter of resignation that talked about a culture of intolerance at the newspaper and said she was bullied by colleagues who disagreed with her.\n\nIn a letter to CBS News employees on Monday, Weiss said that CBS was part of a deep family tradition growing up in Pittsburgh, Pennsylvania.\n\n“My goal in the coming days and weeks is to get to know you,” she wrote. “I want to hear from you about what’s working, what isn’t, and your thoughts on how we can make CBS News the most trusted news organization in America and the world. I’ll approach it the way any reporters would — with an open mind, a fresh notebook and an urgent deadline.”\n\nEllison said Weiss will report directly to him and partner with CBS News President Tom Cibrowski, who reports to Paramount executive George Cheeks.\n\nEllison said that Weiss will “shape editorial priorities, champion core values across platforms and lead innovation in how the organization reports and delivers the news.”\n\nHe said that “we believe the majority of the country longs for news that is balanced and fact-based, and we want CBS to be their home.”","summary":"No purchase price was announced for The Free Press, which has been a success in the five years since Weiss started it after leaving The New York Times as an opinion editor. \n\n\nThe post CBS buys The Free Press website, installs founder Bari Weiss as CBS News editor-in-chief appeared first on Boston.com.","url":"https://www.boston.com/culture/media/2025/10/06/cbs-buys-the-free-press-website-founder-bari-weiss-news-editor-in-chief/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2025/10/AP25279512467689-68e3de27cce44-768x432.jpg","video":null,"publish_date":"2025-10-06 15:26:41","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.095},{"id":366712670,"title":"Ex-Marine Amy McGrath launches another run for Kentucky Senate","text":"FORMER SECRET SERVICE AGENT AND EX-CIA OFFICER LAUNCH DEMOCRATIC BIDS FOR MCCONNELL’S SENATE SEAT\n\n“Our democracy is under siege, cowards in Washington are bowing to Donald Trump, and Kentuckians are paying the price. Kentuckians deserve someone battle-tested and ready to fight for them on day one. I’ve spent my life stepping up when the mission was tough and the stakes were high, first as a Marine and now for Kentucky. I’m ready to complete the mission,” McGrath wrote in her announcement on X.\n\nMcGrath, a former F-18 fighter jet pilot, has voiced her disagreement with many of the opinions of Secretary of War Pete Hegseth, who has pushed for “gender neutral” standards in the military. She recently told CNN, “Pete Hegseth still has a lot to learn.”\n\n“When I flew my combat missions, there was not a set male standard and a female standard for flying an aircraft onto the back of an aircraft carrier. You can either do it or you can’t,” McGrath said. \n\nMcGrath is running an anti-Trump campaign in a state where President Donald Trump beat former Vice President Kamala Harris by about 30 points in 2024. She told the Lexington Herald-Leader‘s Austin Horn that she thinks her campaign will resonate with Kentuckians.\n\n“What we’re seeing from folks in power right now is not what most Kentuckians voted for. I don’t think any Kentuckians voted for higher prices or less health care. They didn’t vote for more taxes in the form of tariffs and putting rural hospitals at risk. That’s what we’re getting right now,” McGrath said.\n\nMcGrath is running with a simple slogan, “End the chaos. Cut costs. Protect freedoms,” according to her campaign website. Her website also highlights campaign priorities, including cutting grocery costs, maintaining Kentucky’s status as an “energy leader,” and keeping rural hospitals open.\n\nThe McGrath campaign did not respond to the Washington Examiner‘s request for comment.\n\nEach Republican candidate in the Senate race, including Rep. Andy Barr (R-KY), former state Attorney General Daniel Cameron, and businessman Nate Morris, is vying for Trump’s endorsement in the Republican primary.\n\nThis is not McGrath’s first rodeo when it comes to campaigning as a red-state Democrat under Trump. She first ran for McConnell’s seat in 2020, falling to the Kentucky Republican approximately 38.2% to 57.8% despite raising just over $80 million for her campaign.\n\nMcGrath also faced off against Barr when she challenged him for Kentucky’s 6th Congressional District in 2018. She garnered about 48.7% of the vote to Barr’s 51%.\n\nKENTUCKY REPUBLICANS BREAK WITH PARTY LEADERSHIP ON TOWN HALL HIATUS\n\n“Andy Barr and President Trump beat Amy McGrath once, and they’ll do it again. Together, they defeated her in what was once a battleground district, despite her millions from coastal elites and endless airtime from the liberal media,” Alex Bellizzi, Barr’s campaign spokesman, said in a statement to the Washington Examiner.\n\nKentucky’s Senate primary Election Day will be held on May 19, 2026. The general election is set for Nov. 3, 2026.","summary":"Former Marine Amy McGrath from Kentucky is taking another shot at running for the Senate. This time, instead of facing off against Sen. Mitch McConnell (R-KY), McGrath is entering a race full of Democrats and Republicans eager to fill McConnell&#8217;s seat after he retires. McGrath joins two political outsiders, former Secret Service agent Logan Forsythe [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3838382/ex-marine-amy-mcgrath-launches-run-kentucky-senate/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2023/12/ap-18311115035022.jpg?w=696","video":null,"publish_date":"2025-10-06 15:12:31","author":"Molly Parks","authors":["Molly Parks"],"language":"en","source_country":"US","sentiment":0.012},{"id":366712666,"title":"Bari Weiss named editor-in-chief of CBS News in $150 million acquisition of the Free Press","text":"“This move is part of Paramount’s bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world,” Skydance CEO David Ellison said in a statement.\n\n“Bari will report directly to me,” Ellison said, “leading the work of The Free Press and collaborating with our CBS News team in the pursuit of making it the most trusted name in news.”\n\nEllison is the son of billionaire Oracle co-founder Larry Ellison, who is allied with President Donald Trump.\n\nThe $150 million purchase is a mix of cash and Paramount stock, according to a New York Times report. Weiss has never run a TV network but will now oversee hundreds of reporters, anchors, and producers.\n\nWeiss co-founded the Free Press after quitting the opinion section of the New York Times in 2020. She has described legacy media outlets as untrustworthy and has described her publication as a place for people who “prefer to think for themselves.”\n\nWeiss said her new role at CBS News would allow her to work on Sunday news programs, including 60 Minutes and CBS Sunday Morning, which are “shaping how millions of Americans read, listen, watch, and, most importantly, understand the news.”\n\n“It gives The Free Press a chance to help reshape a storied media organization — to help guide CBS News into a future that honors those great values that underpin The Free Press and the best of American journalism,” she added.\n\nTHE MEMBERS OF THE HOUSE AND SENATE WHO HAVE SAID THEY WON’T SEEK REELECTION\n\nCBS News has drawn the ire of Trump since his 2024 presidential campaign. He filed a lawsuit last year against Paramount, accusing 60 Minutes of deceptively editing an interview with then-Vice President Kamala Harris, the Democratic presidential nominee. Trump declined to appear on the program last year.\n\nCBS denied the claim, but Paramount settled Trump’s lawsuit for $16 million. The settlement came as Skydance and Paramount were seeking approval from the Federal Communications Commission for an $8 billion merger.","summary":"Newly formed media corporation Paramount Skydance announced its acquisition of the digital news site the Free Press in a $150 million deal, naming Bari Weiss as CBS News editor-in-chief. Weiss co-founded the Free Press in 2021 with her wife, Nellie Bowles, and her sister, Suzy Weiss. The publication has around 1.5 million subscribers on Substack, [&#8230;]","url":"https://www.washingtonexaminer.com/news/3838531/bari-weiss-editor-in-chief-cbs-news-acquisition-free-press/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP25205519992690.jpg?w=696","video":null,"publish_date":"2025-10-06 14:55:04","author":"Annabella Rosciglione","authors":["Annabella Rosciglione"],"language":"en","category":"politics","source_country":"US","sentiment":0.31},{"id":366705274,"title":"Younger Voters Least Likely To Elect Female President But Want More Women In Gov’t, Poll Says","text":"The majority of voters want more women in elected office, according to a new American University poll released on Monday.\n\nThe survey, first reported on by Politico, found that 54% of voters said there are “too few women” in elected office. Meanwhile, 35% of respondents said there are “about the right number” of women currently serving in office and 11% said there were “too many” women in elected office.\n\nThe poll found that younger voters are the least likely to support a female president being elected, with 75% of women under 50 being open to voting for a woman as president, while 80% of men in the same age bracket said the same. Comparatively, 87% of men and women over 50 said they were open to electing a female president, the poll says. (RELATED: Many Kamala Harris Supporters In North Carolina Agree Her Political Career Is Dead In The Water)\n\nMoreover, 4 in 10 voters – particularly Republicans and younger respondents – said they knew someone who would not vote for a female president, according to the poll. Still, the poll also found that 83% of Americans said they believe it is important to elect more women.\n\n“This survey reveals a powerful paradox,” Viva de Vicq, the lead pollster of the survey, told Politico. “Voters trust women on the issues that matter most and want to see more women in office. Yet when asked about the presidency, bias and narrow expectations resurface.”\n\nOf Democrats surveyed, 92% said it is important to elect more women, compared to 77% of Republicans who said the same, according to the poll. The survey also showed that 91% of voters aged 18 to 34 believe it is important that more women get elected, while 80% of voters aged 50 to 64 felt the same.\n\nAdditionally, 26% of voters said they prefer that the first female president would be “tough” instead of “likable,” compared to 19% who responded it was more important for her to be seen as “likable” and 56% who said it is equally important to be seen as both.\n\nThe survey results come in the aftermath of President Donald Trump defeating former Vice President Kamala Harris in the 2024 presidential election. In late July, Harris passed on entering the 2026 race for California’s governor’s mansion, igniting speculation that she may seek the White House in 2028.\n\nTrump similarly bested former Secretary of State Hillary Clinton in the 2016 White House election.\n\nOf those surveyed, 32% said the 2028 White House race will be the “most important” election of their lifetime so far, while 35% of respondents said it will be “more important than most.” Meanwhile, 26% of voters said the 2028 presidential race will be “no more or less important than any other election” and just 7% said it will be “less important” than most elections, according to the poll.\n\nA New York Times (NYT) analysis of voter registration data released in August notably found that the Democratic Party lost millions of registered voters between the 2020 and 2024 elections, while the Republican Party added voters during the same period of time. Some Democrats have reportedly expressed concerns about the state of their party following the release of the NYT’s analysis.\n\nThe nationwide poll of 801 male and female registered voters was conducted from September 3 to 6. The margin of error for the dataset overall is plus or minus 3.46% at the 95% confidence level.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'powerful paradox'","url":"https://dailycaller.com/2025/10/06/younger-voters-seek-more-female-representation-in-govt-but-sour-on-president/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https://cdn01.dailycaller.com/wp-content/uploads/2025/10/GettyImages-2238215504-scaled-e1759757833236.jpg","video":null,"publish_date":"2025-10-06 14:52:07","author":"Ireland Owens","authors":["Ireland Owens"],"language":"en","category":"politics","source_country":"US","sentiment":-0.092},{"id":366717670,"title":"CBS buys The Free Press website, installs founder Bari Weiss as CBS News editor-in-chief","text":"Paramount said Monday that it has bought the commentary website The Free Press and installed its founder, Bari Weiss, as the editor-in-chief of CBS News, a newly created position. \n\nThe announcement, while anticipated, is a bold move for the venerable television news network initiated by new corporate leader David Ellison. Weiss’ experience is in print journalism, particularly in commentary.\n\n“I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,” Ellison said in a news release. “This move is part of Paramount’s bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world.”\n\nSome at CBS News have been concerned that the news division is moving in a direction more friendly to President Donald Trump.\n\nThis year, Paramount Global agreed to pay Trump $16 million to settle a lawsuit regarding the editing of an interview with then presidential candidate Kamala Harris on CBS’ storied “60 Minutes” news program.\n\nJournalists were infuriated and a senator suggested an investigation to determine whether bribery laws were broken. The company was hoping to put the issue to rest as it sought administration approval of a major merger.\n\nThat deal has since been approved by the Trump administration. \n\nNo purchase price was announced for The Free Press, which has been a success in the five years since Weiss started it after leaving The New York Times as an opinion editor. When she left the Times, she wrote a letter of resignation that talked about a culture of intolerance at the newspaper and said she was bullied by colleagues who disagreed with her.\n\nIn a letter to CBS News employees on Monday, Weiss said that CBS was part of a deep family tradition growing up in Pittsburgh, Pennsylvania.\n\n“My goal in the coming days and weeks is to get to know you,” she wrote. “I want to hear from you about what's working, what isn't, and your thoughts on how we can make CBS News the most trusted news organization in America and the world. I'll approach it the way any reporters would — with an open mind, a fresh notebook and an urgent deadline.”\n\nEllison said Weiss will report directly to him and partner with CBS News President Tom Cibrowski, who reports to Paramount executive George Cheeks.\n\nEllison said that Weiss will “shape editorial priorities, champion core values across platforms and lead innovation in how the organization reports and delivers the news.”\n\nHe said that “we believe the majority of the country longs for news that is balanced and fact-based, and we want CBS to be their home.”","summary":"Paramount announced Monday that it has bought the successful news commentary website The Free Press and installed its founder, Bari Weiss, as editor-in-chief of CBS News","url":"https://www.independent.co.uk/news/world/americas/paramount-cbs-new-york-cbs-news-donald-trump-b2840229.html","image":"https://static.independent.co.uk/2025/10/06/15/Media_CBS_Weiss_67689.jpg?width=1200","video":null,"publish_date":"2025-10-06 14:26:55","author":"David Bauder","authors":["David Bauder"],"language":"en","source_country":"gb","sentiment":0.095},{"id":366714198,"title":"‘Don’t Pay Me, Pay My Charity’ Worked For Trump, Will IRS Agree?","text":"WASHINGTON, DC - JUNE 15: U.S. President Donald Trump stops and talks to the media before he boards Marine One on the South Lawn at the White House on June 15, 2025 in Washington, DC. The President will attend the annual meeting of the Group of 7 nations, Britain, Canada, France, Germany, Italy, Japan and the United States are taking place in the Canadian Rocky Mountains in Alberta, and will run until late Tuesday. (Photo by Tasos Katopodis/Getty Images)\nGetty Images\n\nPresident Donald Trump is not the only one to use the “don’t pay me, pay my charity” idea. His $16 million settlement with Paramount over “60 Minutes” involved his claims that the network’s edits favored then Vice President Kamala Harris. The settlement went to Trump’s legal fees and to his presidential library. He used similar techniques in his $15 million settlement with ABC News, a $25 Million deal with Meta, a $10 million from Twitter/X. The latest is his $24.5 million settlement with YouTube.\n\nTax on Lawsuits and Legal Fees\n\nThe widespread assumption is that all of his techniques avoids taxes, but is that so clear? In some cases, a plaintiff’s request to have settlement funds paid to charity are viewed by the IRS as a payment first to the plaintiff, and then a contribution by him to charity. That may be subject to percentage income limits, which in some cases means that the whole charitable contribution deduction may not be available in the year of the settlement. If the settlement pays legal bills that Trump would otherwise owe, the IRS could call that taxable income.\n\nWhen someone discharges your liability, the IRS often views that as income, even if you never handle the cash. Similarly, if Trump receives a reimbursement out of the Paramount settlement for legal fees that he has already paid, is that income? It depends on whether Trump has deducted the legal fees on his taxes that are later reimbursed. If he has deducted the fees, the IRS usually requires reimbursed amounts to be treated as income. The IRS calls it the tax benefit rule. Since you got a tax benefit from a deduction, if you are later reimbursed you can be required to take the reimbursement into income.\n\nPartial Payments To Charity\n\nMany settlements involving payments to charity involve only a small part of a settlement, something like this. Sally has negotiated a sexual harassment settlement with her former employer, and part of the deal is that 10% of the funds will go to a designated charity. Will Sally be taxed on that? Some defendants would agree not to issue a Form 1099 to Sally for that 10%. But in my experience, most companies will treat that payment as made to Sally, even if the payment goes directly to the charity.\n\nThis is because Sally is viewed as the one requesting and directing the payment. Sally can still claim a charitable contribution deduction on her tax return, even if she does not write the check to the charity. There can be some difficult tax problems in the case of large payments to charity, such as 50% or 100% of the funds going to charity. In that case, extra caution is needed before the deal is signed. There are annual limits on charitable contributions, and since the IRS may view the settlement as paid to the plaintiff who then is deemed to make the donation, you don’t want to have trouble with the size of your charitable contribution deduction.\n\nMORE FOR YOU\n\nPaying Friends or Relatives\n\nDirecting settlement money to charity can work in some cases, but even that is not foolproof, as noted above. And having the settlement agreement direct the money to someone else — say a friend or relative — usually does not avoid taxes to the plaintiff either. The IRS taxes the person who had a legal right to payment.\n\nEditorial StandardsReprints & Permissions","summary":"IRS may view a plaintiff’s request for a settlement to go to charity as a payment first to the plaintiff, and then a contribution by him to charity.","url":"https://www.forbes.com/sites/robertwood/2025/10/06/dont-pay-me-pay-my-charity-worked-for-trump-will-irs-agree/","image":"https://imageio.forbes.com/specials-images/imageserve/68e3047fcb245a87af131c8b/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-10-06 14:25:25","author":"Robert W. Wood,Senior Contributor,Tasos Katopodis","authors":["Robert W. Wood","Senior Contributor","Tasos Katopodis"],"language":"en","source_country":"US","sentiment":-0.282},{"id":366698718,"title":"CBS buys The Free Press website, installs founder Bari Weiss as CBS News editor-in-chief","text":"By DAVID BAUDER, Associated Press Media Writer\n\nNEW YORK (AP) — Paramount said Monday that it has bought the commentary website The Free Press and installed its founder, Bari Weiss, as the editor-in-chief of CBS News, a newly created position.\n\nThe announcement, while anticipated, is a bold move for the venerable television news network initiated by new corporate leader David Ellison. Weiss’ experience is in print journalism, particularly in commentary.\n\n“I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,” Ellison said in a news release. “This move is part of Paramount’s bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world.”\n\nSome at CBS News have been concerned that the news division is moving in a direction more friendly to President Donald Trump.\n\nThis year, Paramount Global agreed to pay Trump $16 million to settle a lawsuit regarding the editing of an interview with then presidential candidate Kamala Harris on CBS’ storied “60 Minutes” news program.\n\nJournalists were infuriated and a senator suggested an investigation to determine whether bribery laws were broken. The company was hoping to put the issue to rest as it sought administration approval of a major merger.\n\nThat deal has since been approved by the Trump administration.\n\nNo purchase price was announced for The Free Press, which has been a success in the five years since Weiss started it after leaving The New York Times as an opinion editor. When she left the Times, she wrote a letter of resignation that talked about a culture of intolerance at the newspaper and said she was bullied by colleagues who disagreed with her.\n\nIn a letter to CBS News employees on Monday, Weiss said that CBS was part of a deep family tradition growing up in Pittsburgh, Pennsylvania.\n\n“My goal in the coming days and weeks is to get to know you,” she wrote. “I want to hear from you about what’s working, what isn’t, and your thoughts on how we can make CBS News the most trusted news organization in America and the world. I’ll approach it the way any reporters would — with an open mind, a fresh notebook and an urgent deadline.”\n\nEllison said Weiss will report directly to him and partner with CBS News President Tom Cibrowski, who reports to Paramount executive George Cheeks.\n\nEllison said that Weiss will “shape editorial priorities, champion core values across platforms and lead innovation in how the organization reports and delivers the news.”\n\nHe said that “we believe the majority of the country longs for news that is balanced and fact-based, and we want CBS to be their home.”","summary":"Paramount announced Monday that it has bought the successful news commentary website The Free Press.","url":"https://www.twincities.com/2025/10/06/cbs-bari-weiss-free-press/","image":"https://www.twincities.com/wp-content/uploads/2025/10/GettyImages-2194604196.jpg?w=1024&h=682","video":null,"publish_date":"2025-10-06 14:03:59","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.073},{"id":366695578,"title":"CBS buys The Free Press website, installs founder Bari Weiss as CBS News editor-in-chief","text":"By DAVID BAUDER, Associated Press Media Writer\n\nNEW YORK (AP) — Paramount said Monday that it has bought the commentary website The Free Press and installed its founder, Bari Weiss, as the editor-in-chief of CBS News, a newly created position.\n\nThe announcement, while anticipated, is a bold move for the venerable television news network initiated by new corporate leader David Ellison. Weiss’ experience is in print journalism, particularly in commentary.\n\n“I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,” Ellison said in a news release. “This move is part of Paramount’s bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world.”\n\nSome at CBS News have been concerned that the news division is moving in a direction more friendly to President Donald Trump.\n\nThis year, Paramount Global agreed to pay Trump $16 million to settle a lawsuit regarding the editing of an interview with then presidential candidate Kamala Harris on CBS’ storied “60 Minutes” news program.\n\nJournalists were infuriated and a senator suggested an investigation to determine whether bribery laws were broken. The company was hoping to put the issue to rest as it sought administration approval of a major merger.\n\nThat deal has since been approved by the Trump administration.\n\nNo purchase price was announced for The Free Press, which has been a success in the five years since Weiss started it after leaving The New York Times as an opinion editor. When she left the Times, she wrote a letter of resignation that talked about a culture of intolerance at the newspaper and said she was bullied by colleagues who disagreed with her.\n\nIn a letter to CBS News employees on Monday, Weiss said that CBS was part of a deep family tradition growing up in Pittsburgh, Pennsylvania.\n\n“My goal in the coming days and weeks is to get to know you,” she wrote. “I want to hear from you about what’s working, what isn’t, and your thoughts on how we can make CBS News the most trusted news organization in America and the world. I’ll approach it the way any reporters would — with an open mind, a fresh notebook and an urgent deadline.”\n\nEllison said Weiss will report directly to him and partner with CBS News President Tom Cibrowski, who reports to Paramount executive George Cheeks.\n\nEllison said that Weiss will “shape editorial priorities, champion core values across platforms and lead innovation in how the organization reports and delivers the news.”\n\nHe said that “we believe the majority of the country longs for news that is balanced and fact-based, and we want CBS to be their home.”","summary":"Paramount announced Monday that it has bought the successful news commentary website The Free Press.","url":"https://www.bostonherald.com/2025/10/06/cbs-bari-weiss-free-press/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/GettyImages-2194604196.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-06 14:03:59","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.073},{"id":366706698,"title":"The Free Press' Bari Weiss to become CBS News editor in chief: What her move means for the network","text":"Bari Weiss: CBS News staffers are buzzing with curiosity and speculation after reports that journalist Bari Weiss is set to take a top position at the network, as per a report. Sources told Fox News Digital that employees are sharing news articles and waiting to see how her appointment might change the newsroom. The source said, \"Everyone is sending the articles around. Waiting to see how it will change — or if it will,\" as quoted by Fox News Digital.Bari Weiss expected to join CBS News in top editorial roleAccording to outlets including Puck News and the New York Post, Paramount is acquiring Weiss’ media company, The Free Press, for $150 million. Weiss is expected to become editor in chief of CBS News, reporting directly to Paramount CEO David Ellison, potentially bypassing CBS News President Tom Cibrowski, as per the Fox News Digital report. One staffer described the situation as uncertain, “Everyone is waiting to see how things will fall. Nobody knows,” as quoted in the report.Ellison has reportedly been courting Weiss for months, even before taking over as Paramount CEO in August following the company’s merger with Skydance Media, as reported by Fox News Digital.ALSO READ: Americans have till October 8 to claim up to $5,200 from three major settlementsLive EventsBari Weiss’ journey from The New York Times to The Free Press Weiss, who left The New York Times in 2020 citing a \"illiberal environment\", launched her newsletter \"Common Sense\" in 2021, later rebranding it as The Free Press in 2022, as per the Fox News Digital report. The publication now has more than 155,000 paying subscribers and was recently valued at $100 million, according to Puck News.She is known for building her brand around the critique of liberal groupthink in legacy media, according to the report. Her reporting at The Free Press has challenged topics such as DEI, gender ideology, and media narratives regarding Israel’s ongoing war with Hamas, which has drawn criticism from the cultural left, as per the Fox News Digital report.ALSO READ: Analysts warn AI hype is a 'Red Flag' — bubble now bigger than 2008 Subprime crisisCBS staffers optimistic about new leadership and ideasA CBS staffer expressed optimism about Weiss joining the network, saying, \"I think fresh ideas can’t hurt,\" adding, \"I’m sure she has some, so let’s see,\" as quoted by Fox News Digital.Despite internal discussions, some CBS News staffers are not concerned about how Weiss’ appointment will be perceived by the general audience. One staffer told Fox News Digital, \"[With] people in the industry, maybe, but people at home most likely don’t have any idea who she is or what she does,\" adding, \"At the end of the day, people watching at home pay our bills, not the people writing about it in the trades, so who actually knows how they’ll react,\" as quoted in the report.David Ellison aims to boost CBS News ratings with strategic hiresEllison’s plan appears aimed at revitalizing CBS News, which continues to trail behind rival networks ABC and NBC in ratings, according to Fox News Digital. Weiss’ ascension would follow a series of controversial moves by CBS and Paramount, including a multimillion-dollar settlement with US president Donald Trump over the “60 Minutes” Kamala Harris interview and the cancellation of “The Late Show with Stephen Colbert,” which drew criticism from the far-left, as per the report.FAQsWho is Bari Weiss?Bari Weiss is a journalist who left The New York Times in 2020 and later launched The Free Press.What role is Weiss taking at CBS News?She is expected to become editor in chief, reporting directly to Paramount CEO David Ellison.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onBari WeissBari Weiss CBS NewsDavid Ellison CBS NewsBari Weiss The Free Pressthe free pressfree pressdavid ellisonasBari Weiss editor in chiefCBS News Paramount acquisition\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onBari WeissBari Weiss CBS NewsDavid Ellison CBS NewsBari Weiss The Free Pressthe free pressfree pressdavid ellisonasBari Weiss editor in chiefCBS News Paramount acquisition(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Bari Weiss: CBS News staffers are abuzz with speculation as journalist Bari Weiss is reportedly set to take a top editorial role. Paramount is acquiring her media company, The Free Press, for $150 million, with Weiss expected to become editor in chief, reporting directly to Paramount CEO David Ellison. This move signals a potential shift in the newsroom's direction.","url":"https://economictimes.indiatimes.com/news/international/us/the-free-press-bari-weiss-to-become-cbs-news-editor-in-chief-what-her-move-means-for-the-network/articleshow/124341403.cms","image":"https://img.etimg.com/thumb/msid-124342031,width-1200,height-630,imgsize-18632,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-06 13:56:58","author":null,"language":"en","source_country":"in","sentiment":-0.109},{"id":366690298,"title":"Trump unleashes new FCC threat on NBC in fat-shaming Al Sharpton post that name-checks ‘Tawana Brawley hoax’","text":"President Donald Trump has lashed out at Rev. Al Sharpton in a Truth Social rant calling for the Federal Communications Commission to “look into” cancelling NBC’s broadcast license.\n\nIn the post, the president recounted his long acquaintance with the veteran civil rights activist while sharing a picture of him in his younger days when he was much heavier. \n\n“I knew Al Sharpton for many years, not that it matters, but he was a major ‘TRUMP’ fan,” the president wrote. “He’d ask me to go to his fake Rallies all the time, because I brought BIG Crowds, and he couldn’t get anybody to come without me.”\n\n“Then he did the Tawana Brawley Hoax, one of the worst Low Level Scams in History, and that set him back, BIG TIME!,” Trump said, alluding to a notorious 1987 case in which a Black girl falsely accused four white men of kidnapping and raping her.\n\nThe president continued: “Then [Sharpton] got to know Brian Roberts, Chairman of Fake News NBC, who gave him what would become one of the Lowest Rated Shows in Television History. Roberts is afraid to take him off because it wouldn’t be ‘Politically Correct.’ \n\n“This is just one of the many reasons that the Federal Communications Commission should look into the license of NBC, which shows almost exclusively positive Democrat content. Likewise, ABC Fake News — About the same thing, 97 percent negative to Republicans!”\n\nRoberts is in fact the CEO and Chairman of Comcast, not NBC. Sharpton’s show, PoliticsNation, airs on MSNBC, not NBC, which are two distinct networks, albeit under the umbrella of the same parent company, NBCUniversal, which is in turn owned by Comcast.\n\nTrump accompanied his meandering post with a 1988 image of Sharpton, presumably intended to be unflattering, showing the reverend posing in a red shirt and suspenders.\n\nA lifelong Democrat, Sharpton has angered Trump in the past by supporting Kamala Harris’s failed 2024 presidential campaign and by appearing with the former “Central Park Five” at the Democratic National Convention in Chicago last August. The group were five Black men exonerated after being falsely accused of the rape of a white jogger in New York City in the 1989.\n\nTheir story remains an embarassment to Trump given that he took out a series of newspaper advertisements at the time calling for the quintet to face the death penalty, wrongly assuming their guilt.\n\nThe president has recently ramped up his attacks on his media critics, celebrating over the cancellation of Stephen Colbert’s late-night show earlier this year and, more recently, over the short-lived suspension of Jimmy Kimmel.\n\nFCC chairman Brendan Carr, for his part, was attacked on both sides of the aisle for making a Mafia-style threat against Kimmel and was parodied on the returning Saturday Night Live over the weekend.","summary":"President attacks civil rights activist over alleged bias on his PoliticsNation show while calling on his own media attack dog Brendan Carr to investigate MSNBC’s sister network","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-al-sharpton-nbc-msnbc-b2840130.html","image":"https://static.independent.co.uk/2025/08/25/02/Trump_District_of_Columbia_67888.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/aaZrlDX4-OhrQWqOm.mp4","publish_date":"2025-10-06 13:50:57","author":"Joe Sommerlad","authors":["Joe Sommerlad"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.001},{"id":366821754,"title":"Why does Bari Weiss keep winning?","text":"The anti-woke backlash is coming for CBS News — in the person of Bari Weiss.\nIn a deal that will have seismic ramifications for the mainstream media, Paramount (CBS’s parent company) has purchased The Free Press (Weiss’s online publication) for around $150 million in cash and stock.\nIt’s an enormous win for Weiss, an outspoken center-right commentator who quit an editing job for the New York Times’ opinion section five years ago, and who has made criticism of the “woke left” a central theme of her work.\nAnd the capstone is that, as part of the deal, Weiss will now be the editor-in-chief of CBS News — putting her in charge of a storied journalistic institution.\nAs of this writing, it isn’t clear how Weiss (and Paramount CEO David Ellison, who arranged the deal) intend to go about remaking CBS News. But of late, Paramount seems to be keenly focused on pleasing the Trump administration and the right.\nWhat is quite clear is that in the five years since Weiss broke with the mainstream media via her Times resignation — she publicly criticized what she said was the paper’s adherence to progressive orthodoxy and intolerance of dissenting views — she’s just kept rising to greater levels of influence and wealth, to her many critics’ deep dismay.\nSince its founding a little less than three years ago, the Free Press has become one of the top-earning Substack publications — perhaps the top — pulling in over $10 million a year from about 170,000 paying subscribers.\nAmong the many anti-woke newsletters on that platform, the Free Press rose to the top for a few reasons. Weiss decided to put together a whole publication, with many writers and contributors, rather than relying just on her own byline. She proved a skilled networker and fundraiser, getting initial startup money from, among others, venture capitalists Marc Andreessen and David Sacks — and following it up by raising millions more.\nThe influential economics blogger Tyler Cowen, in explaining why he became a Free Press columnist this year, cited its “startup” mentality, Weiss’s “charisma,” and added that the publication “has the audience I wish to reach.”\nThat audience — disillusioned ex-liberal or centrist elites, often in blue states, who have broken with Democrats and the left but who generally aren’t yet full MAGA or traditionally conservative — has shown up, with their views and their wallets, because the Free Press’s ideological slant speaks to their concerns.\nIndeed, one way to understand Weiss’s impact is that she is a convener of a new faction on the right, one organized around recent issues and controversies that shook up traditional political loyalties. And now, one of this faction’s champions — arguably its leader — will have a chance to reshape CBS News. \nSo what does the Free Press faction believe?\nThe five pillars of the Free Press’s worldview\nThough The Free Press has had a variety of writers with different views on various matters, its core worldview, I would argue, has five main pillars.\n1. Against the “woke” left\nWeiss was one of the many who responded to the “Great Awokening” — the leftward shift among progressives on issues of identity, particularly race and gender — with skepticism and, eventually, outright opposition. \nDuring her New York Times tenure, Weiss was drawn to those who argued something had gone awry in progressive discourse on campuses and elsewhere (she wrote a much-discussed story on a so-called “intellectual dark web”). Her work faced much criticism inside and outside the Times, sometimes for factual reasons, but also because she’d hit a nerve by claiming in the age of Trump that progressives were the intolerant ones.\nTensions came to a head in summer 2020, when the opinion section’s top editor, James Bennet, was forced out after staffers went public to claim that an op-ed he had run had put Black staffers in danger. Not long afterward, Weiss quit too, posting her resignation letter denouncing Times culture on her website. “My own forays into Wrongthink have made me the subject of constant bullying by colleagues who disagree with my views,” she wrote.\nWeiss went to Substack, a platform on which many “anti-woke” newsletters thrived. Frustration with wokeness and “cancel culture” was a powerful bonding agent: many people felt they’d been socially ostracized or had to self-censor, and they were tired of it. Before long, Weiss — who had called herself a centrist and said she voted for Joe Biden in 2020 — was making common cause with conservative activists like Christopher Rufo. They had common enemies.\n2. Against the “experts”\nMany critics of the Great Awokening were particularly perturbed by the shift left of major institutions, such as mainstream media outlets, academia, tech companies like Facebook and Twitter. To them, these institutions seemed totally dominated by progressives, constantly bending to their demands — while those who departed from the progressive consensus risked deplatforming, being accused of spreading dangerous or bigoted misinformation, and having their jobs threatened for saying the wrong thing. \nSo these institutions and “the experts” in general have become a constant punching bag for the Free Press — portrayed as politically biased and constantly wrong. (The Free Press launched as one of the outlets covering the “Twitter Files” that Elon Musk released to try to impugn his company’s previous owners.)\nDuring the pandemic, these issues of wokeness in institutions had become entangled with criticism of the public health establishment. Skeptics of vaccines, critics of lockdowns, and those pushing for speedier school reopenings all felt their views were being censored. So the Free Press became a home for such commentary — indeed, three of its contributors now have top public health posts in the Trump administration.\nWithout going “full populist,” the Free Press has also tried to expand the tent for who can count as an expert with views worth taking seriously. When they recently convened a roundup of expert reactions to Robert F. Kennedy Jr.’s tenure as health secretary, they included Zeke Emanuel and Emily Oster — but also vaccine skeptic Alex Berenson and Vani the “food babe” Hari. \nBut recently, there have been signs that Free Press editors think the pendulum is swinging a bit too much. A recent editorial opens with the requisite fulminations against the public health establishment — before professing to be “horrified” that Florida’s surgeon general wants to end all vaccine mandates for children. It turns out that a ceaseless, years-long assault on the “experts” may bring some undesirable consequences.\n3. Supportive of Israel — and outraged about antisemitism in progressive spaces\nSince Weiss was an undergraduate at Columbia University in the mid-2000s, she’s been involved in the pro-Israel side of campus controversies; she wrote a book called How to Fight Anti-Semitism in 2019. \nThese issues were always a part of the Free Press mix, but they became utterly central to its coverage after the October 7, 2023, attacks. The publication cheered on Israel’s war abroad, while arguing that a scourge of antisemitism on US college campuses was making Jewish students unsafe.\nBut as the war has stretched on, horrific conditions in Gaza haven’t budged Weiss’s support for what she’s called “a war between civilization and barbarism” — one between “good and evil.” This August, a Free Press investigation insisted viral photos of starving Gazan children were misleading, because the children suffered from preexisting health conditions.\nWeiss’s critics often argue that her pro-Israel politics makes an awkward fit with her condemnation of other identity politics.“Weiss rails against identity politics as part of left extremism even as Jewish identity forms the central tenet of her own political approach,” the academic Judith Butler wrote back in 2019. Regardless of the internal coherence of this worldview, there’s clearly an audience for it — especially after October 7.\n4. Against the (anti-Israel) far right\nRelatedly, the Free Press is broadly tolerant toward the contemporary right — including, as we’ll get to in a minute, the president and his top officials. But the faction of the right they criticize the most is the conspiratorial populist far right. Think Tucker Carlson, Alex Jones, and Candace Owens. \nIn February, Weiss worried in a speech that the “far right” — which she clarified was “not the one defined by cable news” — could devour “what remains of the center right.” Another Free Press article from July argued that “a visible faction of the MAGA movement is revising American history, reviving dangerous conspiracies, and erasing the taboo against open bigotry.”\nThese complaints are sometimes about explicit professed racism, but they very often tend to be about the antisemitism (sometimes alleged, sometimes indisputable) and criticism of Israel that is common on parts of the online right. And the far right has no love for the Free Press either; commentator Darryl Cooper asserted that the Free Press’s true mission was “to make sure moderate liberals and conservatives newly skeptical of the mainstream narrative stay on the reservation with regard to Israel.” \n5. Measured toward Trump and his administration\nThe Free Press isn’t an avowedly right-wing or pro-Trump publication. Its audience is people who find Fox News or other conservative media too hardline, lowbrow, or sycophantic toward the president. But they aren’t an anti-Trump publication either — far from it.\nIndeed, the standard Free Press take on Trump is that he should be understood as a politician with the support of about half the country who does some good things and some bad things — and not as an appalling aberrant figure and budding authoritarian who all decent people must despise. (Weiss has said she bristled at the “overzealous, out-of-touch, hysterical reaction” against Trump in his first term, and asserted that the reaction itself proved “extraordinarily authoritarian and totalitarian in its impulses”).\nAs Trump began his second term and proceeded to do various extreme and authoritarian things, the Free Press has criticized him about various matters (such as Trump planning to accept a plane from Qatar and going too far in his retribution efforts). But they’ve been strategic about how they do so — being careful not to tip over into becoming an “anti-Trump” publication, since that would cost them their influence on the right.\nSome commentators who liked Weiss’s anti-wokeness takes have been appalled at this stance toward Trump’s second term. “The almost total avoidance of coverage of the current government threats to freedoms as basic as habeas corpus, due process and free speech on campus is quite something,” Andrew Sullivan wrote, adding: “When there is coverage, it’s nitpicking in order to defend Trump.” \n“Yes, PC-SJW-Critical-Woke-Intersectionality is bad, but some perspective, please,” Steven Pinker posted on X. “Blowing up the international order, sucking up to autocrats, wrecking the world economy, sowing doubt about vaccines, spreading medical quackery, strangling lifesaving foreign aid, pardoning violent rioters, preventing data collection, spewing nonstop lies, & extorting the press, law firms, and universities is worse.”\nBut the Free Press has found a good deal to like about Trump’s second term — most notably, the strike on Iran, after which they editorialized: “Trump Keeps His Promise on Iran. The World Is Safer for It.” \nCan Bari Weiss actually reshape CBS News?\nWeiss has spent years pillorying the mainstream media for everything they get wrong, and has built her own alternative. Now, she’ll face a challenge of a different magnitude — trying to put her stamp on a major, long-established mainstream TV news network: the home of 60 Minutes.\nOne big question is whether she — and Paramount CEO David Ellison — are hoping to change CBS News to be somewhat more responsive to conservatives’ critiques, or whether they want to fully reshape it into a center-right operation.\nAccording to a Semafor report, Weiss has discussed bringing on her old New York Times opinion section boss, James Bennet. Bennet has written at length about how he thought the Times went astray in 2020, but he isn’t exactly a right-wing ideologue: He was the top editor at The Atlantic and was a contender to become the top Times editor as well before his ouster.\nI tend to think that you don’t put Weiss in charge of your mainstream media organization if you are seeking only minor changes. Which means we could be looking at a new version of the “Musk Twitter takeover” playbook — basically a wrecking ball, aimed at demolishing the old institution and creating something more ideologically pliable in its place.\nThe big question is just what Ellison (the son of Oracle co-founder Larry Ellison, who briefly surpassed Elon Musk as the world’s richest person last month) wants — and why, exactly, he shelled out so much cash for the Free Press and Weiss. Little is known about David Ellison’s politics, but his father has long been a Trump supporter, and both are staunch supporters of Israel.\nThere have also been signs that David Ellison is quite solicitous toward the administration. To get the merger that allowed him to become CEO past Trump’s Federal Communications Commission, Paramount settled an absurdly groundless lawsuit by Trump over how 60 Minutes edited a Kamala Harris interview last year.\nThen, once Ellison was ensconced, Trump’s administration complained about how a Face the Nation interview of Homeland Security Secretary Kristi Noem was edited — spurring CBS to suddenly announce that they would now air such interviews unedited.\nLast month, CBS News also named longtime conservative think tanker Kenneth Weinstein to be its new ombudsman, in charge of reviewing outside complaints about its coverage — fulfilling a commitment they’d made to the FCC to get the merger through.\nHow the deal placing Weiss atop the network will play out remains to be seen. Blatant ideological interference will surely lead to staff protests, if not an exodus. But that may be exactly what Weiss wants — to dismantle a citadel of the media establishment and create something new in its place.\nUpdate, October 6, 9:38 am ET: This story, originally published early Monday morning, has been updated with the news that the Paramount/Free Press deal has closed.","summary":"The anti-woke backlash is coming for CBS News — in the person of Bari Weiss. In a deal that will have seismic ramifications for the mainstream media, Paramount (CBS’s parent company) has purchased The Free Press (Weiss’s online publication) for around $150 million in cash and stock. It’s an enormous win for Weiss, an outspoken [&#8230;]","url":"https://www.vox.com/politics/463751/bari-weiss-free-press-cbs-ellison-paramount","image":"https://platform.vox.com/wp-content/uploads/sites/2/2025/10/gettyimages-2194604196.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613","video":null,"publish_date":"2025-10-06 13:38:00","author":"Andrew Prokop","authors":["Andrew Prokop"],"language":"en","source_country":"us","sentiment":0.271},{"id":366677944,"title":"CBS News confirms anti-woke star Bari Weiss is new editor-in-chief and that she'll host debate show about the thorniest topics","text":"Anti-woke former New York Times opinion editor Bari Weiss has been confirmed as the new editor-in-chief of CBS News.\n\nWeiss, 41, will also run a new debate program covering thorny topics including immigration and the ethics of editing embryo genes, per the Wall Street Journal. \n\nThe media tycoon issued a statement on Monday confirming her new role via an email to subscribers from her own publication, The Free Press. \n\n'As of today, I am editor-in-chief of CBS News, working with new colleagues on the programs that have impacted American culture for generations—shows like 60 Minutes and Sunday Morning — and shaping how millions of Americans read, listen, watch, and, most importantly, understand the news in the 21st century,' she said. \n\nCBS will also acquire The Free Press for around $150 million. \n\nWeiss will report directly to Skydance Paramount CEO David Ellison, whose company Skydance recently merged with CBS' owners at Paramount.\n\nTom Cibrowski will remain CBS News' president but Weiss will not have to report to him. \n\nWeiss has been 'informally consulting' CBS for 'a while,' a source previously told The Daily Mail. \n\nWeiss, who quit the New York Times in 2020 over its 'illiberal environment,' counts more than 1.25 million subscribers to The Free Press, Axios reported. \n\nIn her career announcement on Monday, she wrote that she 'fled' The New York Times in 2020 because the paper was to her just 'a fancy logo and a motto that many had abandoned in exchange for devotion to a set of narrow, partisan ideas'.\n\n'I wanted to be a part of that more than I wanted to cling to the prestige,' Weiss wrote. \n\nHer hiring by new Paramount Skydance CEO Ellison, the son of billionaire Trump ally Larry Ellison, is set to make waves within the CBS newsroom after a tumultuous year.\n\nIn October, Donald Trump sued the network over a 60 Minutes interview with Kamala Harris that he claimed was deceptively edited.\n\nIn the spring, 60 Minutes Executive Producer Bill Owens and CBS News CEO Wendy McMahon both resigned over concerns with the company's direction.\n\nParamount ultimately agreed to pay Trump $16 million to settle the lawsuit.\n\nThat settlement paved the way for the administration's approval of an $8billion merger between Skydance Media and Paramount last month.\n\nStaff at CBS News are now fretting over the expected arrival of Weiss, who has regularly criticized the state of legacy media and left-leaning views. \n\n'There's real fear in the building right now,' our source said. \n\n'Veteran reporters who've been here for decades are whispering about whether they'll still have a job by the end of the year.' \n\nA source told The Wrap that Paramount is expecting resignations once Weiss is hired.\n\n'Staff morale is at an all-time low. People are scared, plain and simple,' our source added. 'Everyone knows a news boss mean big changes, and no one feels secure.'\n\nWeiss has surfaced a fierce critic of legacy media after leaving the Times in 2020. \n\nEllison, meanwhile, is the 42-year-old son of Larry Ellison, a long-time Republican donor worth roughly $300billion. \n\nHe is an actor turned producer with no background in news, but is bolstered by his deputy, former NBCUniversal exec Jeff Shell \n\nThis is a breaking news story with updates to follow.","summary":"Weiss, 41, will also run a new debate program covering thorny topics including immigration and the ethics of editing embryo genes.","url":"https://www.dailymail.co.uk/media/article-15166713/CBS-News-Bari-Weiss-new-editor-chief.html","image":"https://i.dailymail.co.uk/1s/2025/10/06/14/102659313-0-Anti_woke_former_New_York_Times_opinion_editor_Bari_Weiss_will_b-a-8_1759757192494.jpg","video":null,"publish_date":"2025-10-06 13:35:07","author":"Alex Hammer,Editor,Laura Parnaby,Stephen M. Lepore","authors":["Alex Hammer","Editor","Laura Parnaby","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":0.102},{"id":366706696,"title":"Bari Weiss named editor-in-chief of CBS News under Free Press-Paramount deal","text":"Paramount Skydance CEO David Ellison has named Bari Weiss editor-in-chief of CBS News, as part of a deal to acquire the online news site she founded, The Free Press. The companies did not disclose the deal value in Monday's announcement. A source familiar with the matter said it was for $150 million. The announcement capped months of talks between Ellison and Weiss. The newly minted media baron first floated the idea at July's Allen & Co conference in Sun Valley, a frequent staging ground for major media mergers, according to media reports. Weiss resigned as an opinion writer for the New York Times in July 2020, in a 1,500-word open letter in which she described being the subject of \"constant bullying\" by colleagues who disagreed with her views. In 2022, she founded her new media company on a credo of \"honesty, doggedness, and fierce independence.\"Live Events \"This move is part of Paramount's bigger vision to modernize content and the way it connects - directly and passionately - to audiences around the world,\" Ellison said, calling Weiss \"a proven champion of independent, principled journalism.\" The Free Press has earned a reputation for challenging conventional narratives. Notable articles include a first-person essay from a then-senior editor at NPR, who accused the public radio network of liberal bias that cost it listeners' trust. Another offered a whistleblower account of the Washington University Transgender Center at the St. Louis Children's Hospital, which reported vulnerable teenagers with mental health problems rushed into life-altering treatments. Weiss will report directly to David Ellison, and help set an editorial course for CBS News. The network's evening news broadcast is in third place behind its television peers. She will work with CBS News President Tom Cibrowski, who joined in 2025 after spending 25 years at ABC News in a variety of leadership positions. Cibrowski will continue to report to George Cheeks, Paramount's chair of TV Media. The Free Press, which has about 1.5 million subscribers including 170,000 paying members, will remain independent, retaining its brand and operations, the companies said. Major media and tech companies are now controlled by supporters of President Donald Trump or billionaire business leaders who lined up behind him during his inauguration, donated to his inaugural fund or visited the White House with gifts. The son of longtime Trump supporter Larry Ellison, David Ellison, helped secure regulatory approval for his company Skydance Media to buy Paramount, with the promise that the CBS network would reflect \"a diversity of viewpoints from across the political and ideological spectrum,\" according to a statement from Federal Communications Commission Chairman Brendan Carr announcing the deal. Prior to the deal, Paramount paid $16 million to settle a 2024 lawsuit Trump filed over a \"60 Minutes\" interview with former Vice President Kamala Harris, which he claimed gave a distorted view of his rival for the White House. The FCC has said the settlement and regulatory review were unrelated. In early September, the company announced the appointment of its new ombudsman, Kenneth Weinstein, a former president and CEO of the conservative Hudson Institute.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onBari Weiss editorCBS NewsDavid EllisonParamount Skydance CEOmedia mergersAllen & Co conferenceLarry EllisonWhistleblowerFree Press\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onBari Weiss editorCBS NewsDavid EllisonParamount Skydance CEOmedia mergersAllen & Co conferenceLarry EllisonWhistleblowerFree Press(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"Paramount Skydance CEO David Ellison has appointed Bari Weiss as editor-in-chief of CBS News, following a $150 million acquisition of her online news site, The Free Press. This move aims to modernize content and connect with audiences, with Weiss championing independent journalism and diverse viewpoints. The Free Press will maintain its independence.","url":"https://economictimes.indiatimes.com/news/international/global-trends/bari-weiss-named-editor-in-chief-of-cbs-news-under-free-press-paramount-deal/articleshow/124341276.cms","image":"https://img.etimg.com/thumb/msid-124341428,width-1200,height-630,imgsize-18632,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-06 13:20:07","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","source_country":"in","sentiment":0.362},{"id":366698172,"title":"How Bari Weiss’ Takeover of CBS News Shifts the Media World | Analysis","text":"The acquisition of Bari Weiss’ right-leaning The Free Press by Paramount places her in a disruptive role atop the beleaguered but storied CBS News. With her unprecedented ascent to become editor in chief, the move heralds the arrival of a divisive, ferociously ambitious figure with distinct political views overseeing one of the world’s most consequential news operations.\n\nWhat could go wrong? \n\nWhen asked about his plans for CBS News in August, Paramount’s newly minted CEO, David Ellison, told reporters that he didn’t want to “politicize anything” as he took the reins of the historic company. But in bringing aboard Weiss, someone who has no experience in broadcast news and whose work has launched multiple firestorms over hot-button political issues including gender identity, Israel and Gaza and the influence of tech bros on Washington, Ellison has seemingly undermined that claim.\n\nOn Monday, Paramount said it would acquire The Free Press for what insiders say is $150 million in stock and cash. Weiss will report directly to Ellison while CBS News President and Executive Editor Tom Cibrowski will continue to manage its day-to-day operations and report to George Cheeks. One person with knowledge of the conversations described the role as consulting at a high level rather than running the daily news operation, as Weiss will also continue to run The Free Press.\n\nThe person also told TheWrap that with Weiss’ hiring, Susan Zirinsky — who was brought on earlier this year to oversee news after the previous owner Shari Redstone bristled at some of the network’s coverage of the war in Gaza — will exit that role.\n\nWeiss’ appointment upends the conventional thinking around how a newsroom should be run, a shift that is happening as journalists see their media organizations face increasing financial and political pressure. At the same time, trust in media in the U.S. has sunk to an all-time low as President Trump regularly attacks any coverage he deems remotely unfavorable.\n\nFor CBS News, the move lays the groundwork for more wrenching changes that come on top of the additional layoffs expected as Paramount seeks to cut costs. \n\n“I’ve always seen her as a point-of-view journalist — it’s one of the first things you can say about her — but CBS News doesn’t think of itself as a POV news network,” Jay Rosen, a media critic and former journalism professor at New York University, told TheWrap. “There is no point of view to the news division as they imagine their work, and so I think she is very much different than [what] the culture of CBS News has been for a long time.”\n\nBecause of Weiss’ unorthodox résumé for this sort of position — her experience is rooted in opinion journalism, as an anti-woke New York Times columnist and Wall Street Journal op-ed editor — the perception is that the hire has more to do with shifting to a right-of-center political ideology than a grand vision for CBS News.\n\nIndeed, in a post on The Free Press on Monday, Weiss outlined what she sees as a mission to serve the “overwhelming majority” of Americans in the center of the political spectrum.\n\n“If the illiberalism of our institutions has been the story of the last decade, we now face a different form of illiberalism emanating from our fringes. On the one hand, an America-loathing far left. On the other, a history-erasing far right. These extremes do not represent the majority of the country, but they have increasing power in our politics, our culture, and our media ecosystem,” she wrote.\n\n“Overlooked by all these so-called interlocutors are the enormous numbers of smart, politically mixed, pragmatic Americans. The people who believe, unapologetically, in the American project. This is the actual mainstream. These people are the overwhelming majority of the country. And they are being ill-served.”\n\nNetwork sources were reluctant to discuss what Weiss’ role would mean ahead of the announcement, but they pointed to the tumult that has enveloped CBS since 2023 — which has included its coverage of the Israel-Gaza conflict, its various leadership changes and Trump’s legal assault on its journalism — to outline the challenges Weiss would face in earning the newsroom’s trust.\n\n“CBS News is a very complicated, very tricky organization,” a person close to the network told TheWrap. “It’s a viper’s pit, and it is very, very tricky to bring new people into CBS News and have them be accepted.”\n\nAnother senior insider said that Weiss’ role was more titular than operational, and that it would need to evolve with time.\n\nCBS News declined to comment.\n\nIn a note to staff on Monday, Weiss outlined her position as a “champion” for journalistic values: \n\n“I stand for the same core journalistic values that have defined this profession since the beginning, and I will continue to champion them alongside you.”\n\nA new news era\n\nParamount’s purchase of The Free Press, the “anti-woke” contrarian outlet Weiss founded in 2022, represents an astonishing exit for a media company, much less one that is only three years old. \n\nBut CBS News has been in a bind, and Ellison was determined to make a change.\n\nCBS News had already taken measures to mollify conservative critics since Ellison took the reins of Paramount. It appointed an ombudsman, Kenneth R. Weinstein, a former CEO of conservative think tank Hudson Institute, who was revealed to have a history of donating to Trump-affiliated groups.\n\nYet beyond questions about her ability to run an enterprise of the scale of CBS News, Weiss, 41, is a particularly divisive figure, having achieved much of her fame less for the job she did as an opinion columnist for The New York Times than the very public manner in which she left it, tendering her resignation in 2020 by accusing the paper of creating a “hostile work environment” due to her right-leaning views.\n\nWeiss sparked additional headlines by serving as one of the journalists to whom Elon Musk reached out to produce the “Twitter Files,” an exercise intended to expose the platform’s hostility to conservatives after he acquired it in 2022. The much-hyped effort drew partisan cheers but ended without yielding any significant revelations and was seen as a blow to Weiss’s credibility.\n\n“The fact that Elon Musk decided to come to a bunch of people essentially with newsletters rather than The Washington Post and The New York Times tells you a lot about where real trust in the media these days actually lies,” Weiss said on a podcast in 2022 regarding the Twitter Files.\n\nWeiss’ pending deal, not surprisingly, drew an endorsement from another journalist involved in the Twitter Files, Matt Taibbi, who exulted in “legacy media’s tears” over the reports.\n\nThe Free Press, meanwhile, has become a mirror of Weiss’ politics, although even there she has elicited controversy. She conducted a podcast interview with billionaire tech mogul Peter Thiel, where she declined to challenge him on his more controversial beliefs — such as his position against democracy and in favor of the survival of the elite in a tech “singularity” with machines — in contradiction to her publication’s promise of “fierce independence.”\n\nIn their lengthy sit-down after the 2024 election, Thiel referred to Democrats as “the evil party” and spoke of the political left as a “progressive cult” and “not very American,” to no pushback from Weiss.\n\nAll told, it’s an unlikely track record for a journalist set to take on a major role in one of the largest and most storied news organizations in the world, following in the footsteps of Walter Cronkite and Edward R. Murrow. \n\nA spokesperson for The Free Press did not respond to a request for comment or to make Weiss available for an interview.\n\nJoining an embattled newsroom \n\nThe Free Press acquisition follows several blows to CBS News’ morale. Much of that involved Paramount’s settlement of Trump’s “60 Minutes” lawsuit, based on a flimsy claim that the editing of a Kamala Harris interview hurt his campaign, and concessions made to Federal Communications Commission chairman Brendan Carr, including the hiring of an ombudsman.\n\nWeiss could plunge the mood even lower, in what could be interpreted as another move to placate Trump. CBS seemingly took another step in that direction by announcing last month that it would change its interview policy for “Face the Nation” after the Department of Homeland Security accused the network of a “whitewash” for airing a shortened version of a Kristi Noem interview answer related to undocumented migrant Kilmar Abrego Garcia.\n\n“Absorbing The Free Press seems to him to be a way to be on both sides, and to prevent Donald Trump from attacking his company,” Rosen said regarding Ellison. “Somehow, he sees Bari as an answer to, ‘How do you prevent the President of the United States from going into attack mode constantly?’”\n\nWeiss, who is described by those who know her as both charismatic and controlling, represents a marked departure from the more staid, traditional values of CBS News. Her arrival thus sets up a potential ideological struggle and a clash between old and new, handing the keys to a legacy media outlet to someone who, with her frequently expressed disdain for traditional media, has made her name as a provocateur.\n\nWeiss’ career has been no stranger to controversy, and her age and apparent success launching a digital enterprise could be indicative of the “next generation” studio that Ellison — a fellow millennial — has discussed creating. \n\nBut she would come to the process with both a huge learning curve and considerable skepticism from the rank and file at the news division.\n\n“Bari Weiss brings a more center right perspective to a mainstream media that generally leans left and I imagine that’s part of her appeal,” said Liz Spayd, a lecturer at Georgetown University who worked as the New York Times’ final public editor.\n\nFrom columnist to entrepreneur\n\nA native of a Pittsburgh suburb who studied at both New York’s Columbia University and Jerusalem’s Hebrew University, Weiss got her start at the Israeli newspaper Haaretz and the Jewish newspaper The Forward before two stints at The Wall Street Journal and then the New York Times. \n\nHer opinion pieces at the Journal often straddled the line between challenging the Rupert Murdoch-owned paper’s editorially conservative tilt and progressives’ leftward bent, but she told Vanity Fair in 2019 she often felt like the most liberal voice at the paper after Donald Trump’s election.\n\n“I wanted people to see how I felt about this, and what I thought it meant for the country,” Weiss told the magazine. “I realized I had to leave.”\n\nShe moved to the Times in 2017, where her opinions roiled those across the political spectrum — and her Times colleagues — with pieces often targeting social justice movements. Her headlines included those titled “Three Cheers for Cultural Appropriation,” which advocated for Americans to blend cultures outside racial and ethnic lines, and “Meet the Renegades of the Intellectual Dark Web,” where she profiled and gave voice to incendiary figures like Jordan Peterson and Dave Rubin. \n\nIn her July 2020 resignation letter to publisher A.G. Sulzberger, which is still pinned to her website, Weiss claimed to have been bullied by colleagues because of her views, and accused the paper of “illiberalism,” of being intolerant of views outside of a progressive orthodoxy.\n\n“The lessons that ought to have followed the election [of Donald Trump] — lessons about the importance of understanding other Americans, the necessity of resisting tribalism, and the centrality of the free exchange of ideas to a democratic society — have not been learned,” she wrote. “Instead, a new consensus has emerged in the press, but perhaps especially at this paper: that truth isn’t a process of collective discovery, but an orthodoxy already known to an enlightened few whose job is to inform everyone else.”\n\nWeiss launched the Substack blog “Common Sense” in 2021, which she later turned into The Free Press in 2022 alongside her wife, Nellie Bowles, and her sister, Suzy Weiss. She initially framed the organization as one dedicated to independent journalism — albeit one that’s a home for causes personal to her, including combating antisemitism. At times, the website has turned into a platform for “anti-woke” writers and perspectives eschewed by mainstream media. \n\nNPR’s former senior business editor, Uri Berliner, wrote a lengthy takedown of the public radio network’s perceived liberal bias in The Free Press in April 2024. Two months and a suspension later, he joined Weiss’ website as a senior editor.\n\nThe Free Press has also taken investments from right-leaning millionaires, including tech investors Marc Andreessen, David Sacks and the U.K.-based Paul Marshall, who owns the conservative British broadcaster GB News, according to the Financial Times.\n\nAs the New York Times reported in a profile last year, Weiss has positioned the site as “a teller of dangerous truths,” catering to an audience that shares her views that “elite universities have lost the plot; that legacy outlets have lost their minds; that Ms. Weiss knows the way forward.”\n\nCritics, however, see Weiss primarily as a gifted self-promoter who has carved out a posture that hinges on being anti-“woke” above all else. The Nation’s Jack Mirkinson was particularly blunt, citing The Free Press’ anti-trans “propaganda” as an example, and referring to the prospect of Weiss overseeing CBS News as a sign that “grifters are taking over establishment media.”\n\nWeiss’ website has found an audience, with an estimated 1.5 million free and paid subscribers, according to The New York Times, and roughly 50 employees as of August 2024 (though it lost a number of key hires this year). The outlet is estimated to have about $14 million in annual revenue and about 140,000 paying subscribers, according to TheWrap’s reporting. \n\n“She doesn’t have experience running a broadcast network or sprawling newsroom anywhere near the size of CBS but she is unquestionably a successful media entrepreneur at a time when we need more of them,” Spayd said.\n\nWhat is less certain is just how disruptive Weiss will be to an embattled news organization already bracing for chaos. \n\nSharon Waxman contributed reporting to this story.","summary":"The founder of The Free Press will become chief editor of  the storied newsroom after a career of expressing disdain for traditional journalism\n\n\nThe post How Bari Weiss’ Takeover of CBS News Shifts the Media World | Analysis appeared first on TheWrap.","url":"https://www.thewrap.com/bari-weiss-cbs-news-role-meaning-david-ellison/","image":"https://www.thewrap.com/wp-content/uploads/2025/09/090425-Bari-Weiss-Story.jpg","video":null,"publish_date":"2025-10-06 13:17:27","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","source_country":"US","sentiment":0.064},{"id":366668320,"title":"Paramount officially acquires anti-woke The Free Press and names Bari Weiss CBS News’ editor-in-chief","text":"Paramount Skydance has acquired the anti-woke digital media outlet The Free Press for $150 million and named the site’s “heterodox” founder Bari Weiss as CBS News’ editor-in-chief, the companies announced on Monday.\n\nThe move, which was in the works for months and had been deemed “imminent” in recent days, is just the latest shake-up at the Tiffany Network following the politically fraught merger between Paramount and Skydance Media this past summer, which saw Paramount’s former ownership pay President Donald Trump $16 million to settle a “meritless” lawsuit over a 60 Minutes interview with Kamala Harris.\n\nThis is a breaking news story...","summary":"Bari Weiss is now the top editor of CBS News.","url":"https://www.independent.co.uk/news/world/americas/us-politics/bari-weiss-paramount-the-free-press-b2840161.html","image":"https://static.independent.co.uk/2025/10/03/18/30/GettyImages-2187869182.jpeg?width=1200","video":null,"publish_date":"2025-10-06 13:02:40","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.073},{"id":366690490,"title":"From Dan Rather to — Bari Weiss? How far CBS News has fallen","text":"Twenty years ago, when Dan Rather was pushed out from CBS News following a controversial 2004 report on former President George W. Bush’s National Guard service, it was a massive scandal. While many remember it for being predicated upon shaky documents, it was also incredibly prophetic about the future media landscape: One that’s rapidly consumed by corporate interests, political pressure and the erosion of editorial independence. \n\nAfter a 24-year tenure in the anchor chair of the “CBS Evening News,” Rather did not depart quietly. “They sacrificed support for independent journalism for corporate financial gain, and in so doing, I think they undermined a lot at CBS News,” he told CNN’s Larry King in 2007. “Somebody, sometime, has got to take a stand and say democracy cannot survive, much less thrive with the level of big corporate and big government interference and intimidation in news.” Rather filed an unsuccessful $70 million lawsuit against the network, and in the years that followed, he delivered a series of prescient warnings about the chilling effects of political appeasement. \n\nDespite the narrative pushed by the right-wing campaign against him — which was led by Bush’s White House — Rather remained adamant, even through reputational degradation, that the real threat to journalism wasn’t liberal bias or declining ratings, but the corrosive takeover of the fourth estate by corporate and ideological power. Now, two decades later, CBS News has reached the end of a long corridor he warned us would lead to disaster. \n\nThis morning it was announced that Paramount, CBS’s parent company, has named Bari Weiss as the editor-in-chief of CBS News. A former New York Times opinion page editor who resigned after she claimed to have been “silenced” amidst the George Floyd protests in 2020, Weiss went on to found the Free Press on Substack. With roughly 1.5 million subscribers, the newsletter built its audience on contrarian opinion columns and critiques of “the woke left.” Weiss has cultivated a reputation as a reasonable dissident, eliding outright partisanship and granting her the appearance of neutrality while claiming the mantle to question progressive orthodoxy. \n\nIn a letter to Free Press subscribers, Weiss promised to deliver more of the same in her new role at CBS News. Describing the newsletter’s acquisition and her new position as a “once-in-a-lifetime opportunity,” she noted the move “gives The Free Press a chance to help reshape a storied media organization—to help guide CBS News into a future that honors those great values that underpin The Free Press and the best of American journalism. And in doing so, to bring our mission to millions of people.”\n\nPart of her mission at the Tiffany Network will be to tackle “illiberalism emanating from our fringes.” Weiss wrote, “On the one hand, an America-loathing far left. On the other, a history-erasing far right. These extremes do not represent the majority of the country, but they have increasing power in our politics, our culture, and our media ecosystem. Overlooked by all these so-called interlocutors are the enormous numbers of smart, politically mixed, pragmatic Americans. The people who believe, unapologetically, in the American project.”\n\nOn Thursday, the New York Times reported that Paramount’s acquisition of the conservative outlet would value Weiss’ operation at around $150 million. That’s quite the leap for a 41-year-old first made famous for her role in the battle for academic freedom in the Middle East Studies Department at Columbia University. At the same time Rather’s controversial reporting was challenging a sitting president, Weiss led a campus campaign designed to ruin the careers of Arab professors by equating their criticisms of Israel with anti-Semitism. Decades later, Weiss’ Free Press repeatedly criticized CBS News’ coverage of Israel’s war in Gaza. \n\nWeiss appears to have been hand-picked for the position by tech billionaire Larry Ellison, whose company Skydance recently purchased CBS through a purchase of its parent company, Paramount — and whose Oracle Corporation was just handed virtual control of TikTok in the U.S. by President Donald Trump. The Free Press’ stridently pro-Israel coverage, focusing on U.S.-centered culture wars, like criticizing campus protests rather than the bombing campaign or famine in Gaza, made Weiss an ideal candidate for Ellison’s apparent vision to reshape the global narrative around Israel’s war ahead of the third anniversary of Oct. 7. \n\nEllison, a former Democrat turned top Trump donor, is one of the world’s largest financial supporters of Israel’s military forces. His recent purchases of Paramount and TikTok signal that he will seek to use his massive new media footprint to maintain an environment where U.S. support for Israel remains strong, even while the American public’s support for Israeli Prime Minister Benjamin Nentanyah’s government is drastically declining. Weiss, for her part, is said to report directly to Ellison’s son, David, the chief executive of the new Paramount Skydance company — and whom she thanked profusely in her letter — rather than CBS News president Tom Cibrowsk, who is reportedly preparing to lay off up to 10% of CBS News’ staff in the coming weeks. \n\nWant more sharp takes on politics? Sign up for our free newsletter, Standing Room Only, written by Amanda Marcotte, now also a weekly show on YouTube or wherever you get your podcasts.\n\n“The fact that we don’t have money to pay journalists, but we have money to pay Bari Weiss between $100 and 200 million is indicative of what the Ellisons’ true goal here is,” one network correspondent told the Independent. “And it’s not journalism.”\n\nCBS staff, according to reporting, worry that bringing in Weiss will reduce the willingness of the network to maintain a modicum of editorial independence to cover pro‑Palestinian views in a balanced manner. Some see Weiss as likely to tamp down coverage of Gaza or to emphasize narratives that align with the Israeli government’s ideology. \n\nDespite having zero broadcast news experience, Weiss will oversee the Tiffany Network’s storied “60 Minutes” program. Earlier this year, several of the show’s top executives resigned after Paramount agreed to a $16 million settlement with Trump, who had sued the network over the program’s October 2024 interview with then‑Vice President Kamala Harris. Despite the fact that CBS followed standard journalistic practices, Trump alleged the interview was edited in a way that falsely portrayed her responses — and gave her an advantage over him. Now, after the settlement and ahead of the official change in leadership, CBS News is now reportedly negotiating a potential “60 Minutes” sit-down with the president. Last month, the network named Kenneth Weinstein, the CEO of a conservative think tank and one-time Trump appointee, as the ombudsman for CBS News. \n\n“I think the ombudsman, Bari Weiss, and the impending massive layoffs that are coming in a couple of weeks have everyone just kind of freaking out, like, literally freaking out,” another CBS journalist told the Independent. “It’s not a good place right now. There was a proper way to do this and a not proper way, and they’re doing it in the non-proper way, and maybe that’s by design.”\n\nUltimately, Ellison’s megacorporation needs regulatory approval from Trump’s administration, and Weiss’ elevation is likely meant to appease the president’s complaints about ideological diversity. By bringing in a high‑profile critic of progressive media bias, CBS News can plausibly argue that it’s trying to include conservative perspectives. It’s a strategic move to reshape CBS News’ identity from the independence of the Rather era. Notably, it comes as the Washington Post, owned by billionaire Jeff Bezos, issued a new directive that the paper’s opinion section emphasize “personal liberties and free markets” — a rightward shift that has prompted high-profile exits from several longtime columnists, including Eugene Robinson and Ruth Marcus.\n\nThe capture of CBS News by a Trump-aligned billionaire and a culture warrior with an editorial agenda is not just a sign of media decay. It’s a sign that democracy’s referees are being replaced by players. The supposed watchdogs are now operatives. Dan Rather knew this was coming. He warned us that once news organizations are fully absorbed by corporate and political interests, they stop telling truth to power — and start laundering power’s version of the truth. \n\n“I still know many people there, and I’m not ashamed to say that my heart is still there and probably always will be in a way, but this is an extremely tough time for them,” Rather recently said of CBS News. Speaking last month to SiriusXM host Andy Cohen, the legendary journalist lamented Ellison’s takeover. “It’ll be interesting to see how much, if any, pressure the new owners put on them to change the coverage to be more pro-Trump than to [be] independent news.”","summary":"The Tiffany Network has become a battlefield in the billionaires' war on journalism","url":"https://www.salon.com/2025/10/06/from-dan-rather-to-bari-weiss-how-far-cbs-news-has-fallen/","image":"https://www.salon.com/app/uploads/2025/10/Bari-Weiss-Mike-Johnson-2194604122-150x150.jpg","video":null,"publish_date":"2025-10-06 13:00:15","author":"Sophia Tesfaye","authors":["Sophia Tesfaye"],"language":"en","source_country":"us","sentiment":0.09},{"id":366719568,"title":"Free Press co-founder Bari Weiss named editor-in-chief of CBS News","text":"Paramount has acquired The Free Press, a four-year-old digital news platform, and will make its co-founder Bari Weiss editor-in-chief of CBS News, the company announced Monday. The official announcement came after months of speculation on the deal and Weiss' high profile role within the news division. Weiss, 41, will report to Paramount Chief Executive David Ellison, who personally courted the former New York Times journalist. “We are thrilled to welcome Bari and The Free Press to Paramount and CBS News. Bari is a proven champion of independent, principled journalism, and I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,\" Ellison said in a statement. \"This move is part of Paramount’s bigger vision to modernize content and the way it connects — directly and passionately — to audiences around the world.” Paramount said Weiss will \"shape editorial policies, champion core values across platforms and lead innovation in how the organization reports and delivers the news.\" The union of The Free Press and CBS News will be one of the most closely watched lab experiments in the modern media era. Weiss has no experience in television or running an editorial operation on the scale of CBS News, which has more than 1,000 employees. Paramount is paying around $150 million in cash and stock for The Free Press, a feisty, upstart operation that generated attention through opinion pieces and podcasts with a strong point of view. Its favorite targets are the excesses of progressive left and purveyors of so-called \"woke\" policies. CBS News is a traditional mass appeal network TV operation with a proud legacy of journalistic excellence and the home of popular franchises \"60 Minutes\" and \"CBS Sunday Morning.\" But the division has struggled to deal with the shifts in audience habits brought about by streaming video and social media. Weiss is a provocateur who famously resigned from her high profile role in the opinion section of the New York Times in 2020, citing bullying by her colleagues and a hostile work environment as the reasons. Weiss acknowledged the division's legacy in a note sent to CBS News staffers after her appointment was announced. \"Growing up, CBS was a deep family tradition,\" Weiss said. \"Whenever i hear the tick, tick, tick or that trumpet fanfare, it sends me right back to our den in Pittsburgh. The opportunity to build on that legacy — and to renew it in an era that so desperately needs it — is an extraordinary privilege.\" Weiss also ascends at a time when Trump has threatened news operations with lawsuits and regulatory action, such as pulling station TV licenses over what he believes is unfair criticism of him and his administration. Paramount agreed to pay $16 million to settle a Trump lawsuit making the dubious claim that a \"60 Minutes\" interview with Kamala Harris was deceptively edited to aid her 2024 presidential election campaign against him. CBS News has never had an executive with the title editor-in-chief before naming Weiss to the role. It still has a president — Tom Cibrowski — a former ABC News executive hired earlier this year who will remain in his role and continue to report to to Paramount TV Media President George Cheeks. In her note, Weiss told her staffers her goal in the coming weeks is to learn \"what's working and what isn't, and your thoughts on how we can make CBS News the most trusted news organization in America and the world. I'll approach it the way any reporter would — with an open mind, a fresh notebook, and an urgent deadline.\" The Free Press, which has around 170,000 paid subscribers, will continue as its own independent brand, with its own podcasts and live events business.","summary":"CBS News parent Paramount will also acquire The Free Press for $150 million in cash and stock.","url":"https://www.latimes.com/entertainment-arts/business/story/2025-10-06/free-press-co-founder-bari-weiss-named-editor-in-chief-of-cbs-news","image":"https://ca-times.brightspotcdn.com/dims4/default/0a9ffcd/2147483647/strip/false/crop/6240x4160+0+0/resize/1486x991!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9a%2Fb1%2Ff8e5ce20494792d0307afa5bb1db%2F1347359-et-free-press","video":null,"publish_date":"2025-10-06 12:53:00","author":"Stephen Battaglio","authors":["Stephen Battaglio"],"language":"en","source_country":"US","sentiment":0.295},{"id":366698168,"title":"Paramount Acquires Bari Weiss’ the Free Press, Names Her CBS News Editor in Chief","text":"Paramount has acquired Bari Weiss’ right-leaning publication The Free Press and named its founder as editor in chief of CBS News. The Monday move makes apparent CEO David Ellison’s desire to shift the Tiffany Network’s news division in a more conservative direction.\n\nWeiss will report directly to Ellison, who said in a statement that he was “thrilled” to welcome Weiss aboard.\n\n“Bari is a proven champion of independent, principled journalism, and I am confident her entrepreneurial drive and editorial vision will invigorate CBS News,” he wrote. “This move is part of Paramount’s bigger vision to modernize content and the way it connects – directly and passionately – to audiences around the world.”\n\nFinancial terms were not disclosed, but insiders told TheWrap that Paramount had purchased the three-year-old website for $150 million in a cash and stock deal, an astonishing outcome for a media website that insiders estimate to generate about $14 million in revenue, mostly from subscriptions.\n\nWeiss’ focus will be to “shape editorial priorities, champion core values across platforms and lead innovation” in CBS News’ journalism.\n\n“This partnership allows our ethos of fearless, independent journalism to reach an enormous, diverse and influential audience,” Weiss said in a statement. “We honor the extraordinary legacy of CBS News by committing ourselves to a singular mission: building the most trusted news organization of the 21st Century.”\n\nIn a note to CBS staffers, Weiss described her family’s history with the CBS News brand and said she would spend her first few weeks on a listening tour at the network. \n\n“I stand for the same core journalistic values that have defined this profession since the beginning, and I will continue to champion them alongside you,” she shared.\n\nCBS News President and Executive Editor Tom Cibrowski, a well-liked executive who assumed the role in March, will remain at the organization. The two will work together, though Cibrowski will continue to report to CBS’s CEO of TV Media, George Cheeks.\n\nEllison told staffers in a memo on Monday that Weiss had an “incredible energy, judgment and perception for what will resonate with audiences.”\n\n“Working alongside our exceptionally talented colleagues at CBS News, she will help ensure that our reporting remains relevant, accessible and — most importantly — trusted in this new era for American media,” he wrote.\n\nThe announcement caps Ellison’s monthslong pursuit of Weiss’ outlet, one first reported in June. It signals a significant new era for a global news operation that has traditionally pursued objectivity but has been marred by attacks from President Trump and others over coverage they’ve deemed biased and adversarial. Paramount appointed a conservative think tank veteran, Kenneth R. Weinstein, as its internal watchdog last month, just after the Ellisons took ownership of Paramount from the Redstone family.\n\nThe Free Press acquisition follows several blows to CBS News’ morale. Much of that involved Paramount’s settlement of Trump’s “60 Minutes” lawsuit, based on a flimsy claim that the editing of a Kamala Harris interview hurt his campaign. Paramount settled the lawsuit for $16 million.\n\nTheWrap reported last month that Weiss would join CBS News in a top role.\n\nParamount said Weiss would remain editor and CEO of The Free Press, which will operate as a standalone outlet alongside CBS News. The website has often crusaded against policies or cultural moments it has deemed “woke,” and it has not wavered from hot-button political issues involving gender identity, Israel and Gaza and the convergence of tech and Washington. \n\nWeiss maintains ties to controversial tech leaders, having interviewed the reclusive Palantir chairman, Peter Thiel, last year and co-hosted a pre-inauguration party in January with Elon Musk’s X.\n\nThe acquisition continues a spree of deals by the Ellison-led Paramount, which acquired the rights of UFC games; the rights to the animated satire “South Park”; and deals with filmmakers James Mangold and “Stranger Things” creators the Duffer Brothers. Ellison has also been reportedly interested in purchasing Warner Bros. Discovery, though he has yet to place a bid for the company.","summary":"The purchase ends a monthslong saga over David Ellison’s pursuit of the “anti-woke” outlet\n\n\nThe post Paramount Acquires Bari Weiss’ the Free Press, Names Her CBS News Editor in Chief appeared first on TheWrap.","url":"https://www.thewrap.com/paramount-bari-weiss-the-free-press-purchase/","image":"https://www.thewrap.com/wp-content/uploads/2025/07/Bweiss.png","video":null,"publish_date":"2025-10-06 12:40:55","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","source_country":"US","sentiment":0.26}]}