{"offset":0,"number":50,"available":338,"news":[{"id":386943790,"title":"Heading into midterms, Republicans hold edge with older voters, Reuters/Ipsos poll finds","text":"SummaryDemocrats face challenges unifying base and appealing to older votersOlder voters less concerned with cost-of-living issuesOlder voters more reliable to turn out for a midterm election\n\nWASHINGTON, Dec 11 (Reuters) - Recent electoral victories have given Democrats increasing hope of taking back one and perhaps both houses of the U.S. Congress in next year’s midterm elections, but a new Reuters/Ipsos poll suggests that some of that enthusiasm may be premature.\n\nRepublicans hold a greater advantage with older voters, who are more likely to turn out during non-presidential years. And those voters may be less swayed by the kind of cost-of-living issues that have animated recent Democratic campaigns, the poll found.\n\nAdvertisement · Scroll to continueReport Ad\n\nThe poll “shows there is still a lot of work ahead for Democrats to unify their base and to demonstrate they can meet the moment,” said Joel Payne, a longtime Democratic strategist.\n\nDemocratic candidates have in recent months been able to leverage voters’ concerns about the economy and President Donald Trump’s overall unpopularity into a series of wins that have injected energy into a party that was moribund after Democratic presidential nominee Kamala Harris' loss last year.\n\nThe most recent victory was in Miami, where Eileen Higgins on Tuesday became the first Democrat in almost 30 years to be elected mayor. That came on the heels of Democrat Mikie Sherrill winning the New Jersey governor’s race and Democrat Abigail Spanberger being elected Virginia’s governor last month.\n\nAdvertisement · Scroll to continue\n\nWARNING SIGN FOR DEMOCRATS\n\nBut the Reuters/Ipsos poll contains some blinking-red warning signs heading into a year where the party needs a net gain of three seats to win back control of the U.S. House of Representatives and a net gain of four seats to take the Senate.\n\nSome 46% of U.S. voters aged 50 and older said they planned to vote for the Republican running in their congressional district, 8 percentage points more than the 38% who said they would vote Democrat, according to the poll, which concluded on Monday.\n\nThe strong Republican lead marks a significant change from past midterm election cycles, held midway through U.S. presidential terms.\n\nIn December 2021 - ahead of the last midterm elections - older voters favored Republicans by only a single point - 43% to 42%. In the same month ahead of the 2018 election, when Democrats ended up winning the House, they had a small lead among older Americans age 50 and up, 40% to 38%.\n\nAs they have traditionally, Democrats enjoy an advantage among younger voters. The poll gave them an 11-point lead on the generic congressional ballot among voters under 50 -- 42% to 31%. Summing together voters of all ages in the latest poll, 40% picked Democrats and 39% picked Republicans, pointing to a tightly divided country.\n\nOLDER VOTERS MORE OFTEN TURN UP IN MIDTERMS\n\nItem 1 of 2 Democratic candidate for New York City mayor Zohran Mamdani waves next to his mother Mira Nair onstage after winning the 2025 New York City Mayoral race, at an election night rally in the Brooklyn borough of New York City, New York, U.S., November 4, 2025. REUTERS/Shannon Stapleton/File Photo/File Photo[1/2]Democratic candidate for New York City mayor Zohran Mamdani waves next to his mother Mira Nair onstage after winning the 2025 New York City Mayoral race, at an election night rally in the Brooklyn borough of New York City, New York, U.S., November 4, 2025. REUTERS/Shannon Stapleton/File... Purchase Licensing Rights, opens new tab Read more\n\nBut older voters are deemed more reliable voters in midterm elections, meaning there is some chance that key parts of the Democratic base won’t show up without Trump on the ballot.\n\nDoug Sosnik, a former political adviser to former President Bill Clinton, said that Democrats now excel at turning out high-propensity voters except when it comes to older Americans, which could pose a problem next year.\n\n“You have to look at everything through the prism of the midterm,” Sosnik said.\n\nVoters over 50 made up 56% of the electorate in last year's presidential elections but comprised 64% of voters in the 2022 midterm contests, according to an analysis by the Pew Research Center. The latest Reuters/Ipsos poll, which surveyed 4,434 adults nationwide, found 60% of older voters strongly agree with a statement that they would regret not voting in next year's congressional elections, compared to 40% of younger voters who said the same.\n\nThat pattern played out in the recent gubernatorial elections, where both Sherrill and Spanberger managed to squeeze enough support from older voters to prevail. Both won about two-thirds of voters under 45, according to exit polls conducted by a consortium of networks including CNN, but a bare majority of voters 45 and over.\n\nReaching those voters may remain a challenge. Affordability was a central theme to both Sherrill's and Spanberger's campaigns, as well as Higgins’ candidacy in Miami. But the Reuters/Ipsos poll found that older voters are less likely to cite the cost of living as the most important issue for how they will vote next year. While five in 10 voters age 18-49 said the cost of living was the top issue, just four in 10 older voters said the same.\n\nOLDER VOTERS HAVE DIFFERENT WORRIES\n\nOlder voters may be more insulated from day-to-day worries, Sosnik said: “Wealth creates an environment of a different set of issue concerns.”\n\nSome 27% of voters age 50 and up said democratic values and norms were the most important factors, compared to 22% of younger voters. People also differed by age in which democratic values were most pressing, with older folks more likely than younger voters to cite the dangers of noncitizens voting and election fraud.\n\nIn addition, some 19% of voters age 50 and up said immigration was their top concern, compared to 12% of younger voters -- an area where Republicans have historically kept an edge.\n\nSosnik said that Democrats don’t need to revamp their message next year but rather must tweak it to draw older voters, making prosperity “an issue for all age groups.”\n\nThat means, he said, going beyond job creation and affordability to making it easier for Americans to build careers and accumulate wealth.\n\nThe latest Reuters/Ipsos poll, conducted online, had a margin of error of 2 percentage points among all registered voters, including those age 50 and up. Among younger voters, the margin of error was 3 percentage points.\n\nReporting by Jason Lange and Jim Oliphant; Editing by Scott Malone and Lisa Shumaker\n\nPurchase Licensing Rights\n\nJason LangeThomson ReutersJason Lange is a Washington correspondent focused on political data. Send tips to jason.lange@thomsonreuters.comEmail","url":"https://www.reuters.com/world/us/heading-into-midterms-republicans-hold-edge-with-older-voters-reutersipsos-poll-2025-12-11/","image":"https://www.reuters.com/resizer/v2/M7Z62NW53FNVLATXKBPUJ2PBLM.jpg?auth=f32ff46128b27033f9a1b00176756e18ed8bdf16b4d306190d7dfebc07051156&height=1005&width=1920&quality=80&smart=true","video":"https://ajo.prod.reuters.tv/v3/playlist/724380/master.m3u8","publish_date":"2025-12-11 11:22:38","author":"James Oliphant,Jason Lange","authors":["James Oliphant","Jason Lange"],"language":"en","category":"politics","source_country":"us","sentiment":0.236},{"id":386927592,"title":"Trump calls affordability crisis a 'hoax.' The data tells a different story","text":"In the spring of last year, then-President Joe Biden tried to convince skeptical voters that the struggling economy was healthy. Then-candidate Donald Trump seized on the moment and vowed to lower prices for American consumers, beating his eventual Democratic rival Kamala Harris in part with a winning economic message.\n\nNow it's President Trump who's trying to persuade the public that the state of the economy is sound, after prices rose 3% in the 12 months ending in September and with consumers spending less on big-ticket items. \n\nBetsey Stevenson, a professor of economics at the University of Michigan, says making that argument could be a tall order in the face of rising costs for a number of goods and services.\n\n\"My personal takeaway from the experience we had [in 2024] was that you can't tell people that prices aren't up when they're up,\" she said.\n\nWhile the prices of some items such as gasoline have fallen on Trump's watch, the overall cost of living has continued to climb. For example, grocery costs are up 2.7% for the year ending in September and electricity costs have jumped more than 5%, according to the Bureau of Labor Statistics.\n\n\"Trump's claims about inflation are false,\" Stevenson said, \"and you can go to the grocery store and see it yourself.\"\n\nBut, in a wide-ranging speech to supporters on Tuesday, Trump both defended his administration's track record on the economy and said that talk of affordability was overblown. Trump told the crowd in Mount Pocono, Pa., that he believed the term \"affordability\" was a \"hoax\" perpetrated by Democrats. Trump's recent assertions dismissing inflation are not backed by official government economic data.\n\nConsumers are feeling high prices firsthand\n\nWhile it's true that inflation hit a 9% high during the summer of 2022 under the Biden administration, that was during the pandemic and it dropped significantly after that. Inflation dipped to an annual rate of 3% in January during Biden's final month in office, the same rate it was in September under Trump.\n\nNow many voters are questioning how well Trump is tackling the stubbornly high costs of everyday items. Some 57% of voters said in a Harvard CAPS/Harris poll released this week that Trump was \"losing the battle against inflation,\" while 68% of respondents to a AP-NORC Center for Public Affairs Research poll from October said the economy was poor or very poor.\n\nVoters' souring attitudes on the Trump administration's handling of the economy come less than a year before the U.S. midterm elections, in which Republicans will aim to maintain their majorities in both houses of Congress. But in a warning sign for the GOP, November's odd-year races saw Democrats who campaigned on affordability win major contests in New York City, Virginia and New Jersey.\n\nPolitical consultant and pollster Frank Luntz says Trump risks appearing out of touch if he continues to claim that affordability is a \"hoax\" when Americans feel like they're paying more — and actually do pay more.\n\n\"When you talk about affordability, it is all perception,\" Luntz told NPR's Morning Edition. \"The greatest danger is if you tell people happy days are here again, and it's 1929,\" he added, referencing the beginning of the Great Depression.\n\nLuntz added that Trump blaming Biden for the failures of the economy may have worked during the campaign season and even for some time after.\n\n\"That said, it's now a year since the election, and the public does expect this administration to take charge. At a certain point, they will not accept the blame game,\" he said.\n\nTrump's tariffs are contributing to inflation\n\nBut getting inflation to slow down or prices to drop will be easier said than done for the Trump administration, which has embraced economic policies such as tariffs that force prices upward, according to Stevenson. Trump and other administration officials have argued that tariffs are necessary to correct past global trade policies that have been unfair to the U.S. and to bring back domestic manufacturing.\n\nAlthough tariffs are raising about $30 billion per month in revenue for U.S. coffers, the new import taxes levied by the Trump administration have increased prices on a number of items, from food to clothing to furniture.\n\n\"What I find surprising is that he's out there telling people: 'This isn't happening. This is a con job. There's no affordability problem,'\" Stevenson said. \"At the same time, he's pursuing policies that are purposefully restricting supply, which every person who has taken even an introductory economics course knows will push up prices.\"\n\nStill, the administration has taken several steps recently to ease the negative effects of tariffs on U.S. consumers and producers. Last month, Trump scrapped the tariffs on certain products that aren't widely produced in the U.S., such as bananas and coffee. And on Monday the administration announced that it was making $12 billion in one-time payments to U.S. farmers to offset their rising business costs.","summary":"As Democrats campaigning on affordability pick up wins, Trump's messaging about a strong economy is at odds with widespread voter sentiment that he's not doing enough to tackle rising costs.","url":"https://www.npr.org/2025/12/11/nx-s1-5639957/trump-affordability-hoax-economy-midterms","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3922x2615+0+0/resize/3922x2615!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2Fc5%2F2470a64a4f73944f55d7dac096d6%2Fap25344072646473.jpg","video":null,"publish_date":"2025-12-11 10:00:00","author":"Joe Hernandez","authors":["Joe Hernandez"],"language":"en","category":"politics","source_country":"US","sentiment":-0.284},{"id":386909640,"title":"Stephen Colbert argues Paramount’s $108B bid for Warner Bros proves network ‘can afford to un-cancel’ his show","text":"Talk show host Stephen Colbert drew applause from his audience on Tuesday night as he argued his network should be able to support his show if they can fork out enough cash to pursue a hostile takeover of another media company. \n\nThere is currently a massive bidding war over which company will buy Warner Bros. Discovery, which recently put itself up for sale and holds the rights to movie franchises ranging from “Lord of the Rings” to “Harry Potter.” \n\nWhile Netflix moved to acquire Warner Bros. in a deal valued at $82.7 billion, Paramount has significantly upped the ante by launching a hostile takeover bid. \n\nParamount Skydance announced Monday it has launched an all-cash tender offer to acquire the outstanding shares of Warner Bros. \n\nDiscovery for $30.00 per share in cash, with the company suggesting it’s a “superior” offer than the recently announced $82.7 billion Netflix deal.\n\n“Just yesterday morning, my beloved parent company, Paramount, reportedly launched a hostile takeover bid for Warner Brothers valued at $108 billion. Wow. If my company’s got that kind of green, I’m sure they can afford to un-cancel one of their best shows,” he said.\n\nColbert was making a tongue-in-cheek reference to the cancellation of his own show, which will be axed by CBS in spring 2026. \n\nThe show’s cancellation follows the network and its parent company’s settlement with Trump earlier after he sued both for “election interference” over a “60 Minutes” interview edit of his 2024 opponent, then-Vice President Kamala Harris. \n\nThis is also amid a widespread decline in the popularity of late-night talk shows as a format amid a shifting media landscape and generational change.\n\nAs the audience erupted in cheers, he eventually asked them to sit down, joking that the actual show he was talking about was the crime drama series “the Equalizer” starring Queen Latifah, and not his own show. \n\n“CBS, you head the people, bring back ‘The Equalizer!’ We need our queen to return. Why do you think America has become so UN-equalized?”\n\nColbert has not been shy about criticizing his parent company. \n\nBut one aspect of the deal, Colbert joked sarcastically, is particularly foreboding.\n\n“Turns out, Paramount got a little assist on the cash front. Their bid includes $24 billion from Saudi Arabia, Qatar, and Abu Dhabi wealth funds, and when the dictator of Saudi Arabia gives you billions of dollars, I’m sure there’s no catch,” he said with clear sarcasm, going on to joke, “In a totally unrelated story, I’m looking forward to next season’s new CBS hit comedy, “Young Mohammed bin Sheldon.”","summary":"Stephen Colbert received praise after he said his show could've been saved since Paramount had more than enough cash to take over Warner Bros. Discovery.","url":"https://nypost.com/2025/12/10/media/stephen-colbert-argues-paramounts-108b-bid-for-warner-bros-proves-they-can-save-the-late-show/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/12/Comp_-21.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/bs5RU1rE-RyIcpnTz.mp4","publish_date":"2025-12-11 03:46:32","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":0.133},{"id":386926162,"title":"Tyrus: This will be a bust","text":"to top close Video This video is playing in picture-in-picture.\n\nGutfeld December 10, 2025 05:55 \n\n Tyrus: This will be a bust \n Fox News host Greg Gutfeld and the 'Gutfeld!' panel discuss former Vice President Kamala Harris boasting about getting her own bust.\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE GREG GUTFELD SHOWGUTFELD!V-VIDEOPOLITICSKAMALA HARRIS","summary":"Fox News host Greg Gutfeld and the &apos;Gutfeld!&apos; panel discuss former Vice President Kamala Harris boasting about getting her own bust.","url":"https://www.foxnews.com/video/6386307812112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/be89bf72-2986-4762-a3c9-fabc8012fbd5/7fe5b551-bb0c-4dd3-95eb-89fb0f98c7ea/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-12-11 03:45:55","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.263},{"id":386921244,"title":"'Taylor Swift Is A Nazi' Narrative Boosted By Coordinated Online Effort, New Report Finds","text":"Online talk around Taylor Swift’s “The Life of a Showgirl” album in October was disrupted by a coordinated, “narrative manipulation” effort that accused the singer of promoting Nazism and MAGA ideology, according to a new report from the behavioral intelligence startup GUDEA.\n\nThe report flagged narratives pushed by inauthentic accounts across a number of platforms, including one claiming that “Taylor Swift is a Nazi,” an accusation that served as a “catalyst for a secondary, authentic conversation” comparing Swift to self-described Nazi and Hitler-loving rapper Ye (formerly Kanye West).\n\nUsers who weren’t engaging with conspiracy theories “nevertheless entered the conversation in response to the fallout created by inauthentic users” to defend the singer and to slam the “irrationality” of such a narrative, the report found.\n\n“The pattern of inauthentic provocation [to] authentic user discourse is a hallmark of successful narrative manipulation,” GUDEA’s report reads.\n\n“It demonstrates how small bursts of coordinated activity can reshape cultural perception by forcing mainstream audiences to respond to extremized framing.”\n\nThe report comes months after wild interpretations of Swift’s lyrics and imagery bubbled up online, including posts that connected a lightning-bolt-like necklace in her merch store to a Nazi SS symbol. \n\nGUDEA also found a “significant user overlap between accounts pushing the Swift ‘Nazi’ narrative” and those part of a “separate astroturf campaign” attacking Blake Lively, a friend of Swift who is involved in a sexual harassment lawsuit against her “It Ends With Us” co-star and director Justin Baldoni.\n\nFollowing Swift’s album release, she was accused of making racist swipes at her fiancé Travis Kelce’s ex-girlfriend after using the word “savage” on her song “Eldest Daughter.”\n\nSome posts tried depicting her as a “trad wife” to Kelce and claimed she promoted white supremacy with the lyrics “got the whole block looking like you” on her song “Wi$h Li$t,” despite the line appearing to make a nod to her desire to start a family with her NFL star fiancé.\n\nOthers accused her of embracing far-right ideology, despite her history of backing Democratic candidates — such as former Vice President Kamala Harris — over the years.\n\nGeorgia Paul, GUDEA’s head of customer success, speculated to Rolling Stone magazine that the narrative-pushing efforts could serve as a test run for “nefarious actors” outside of the U.S.\n\n“[They may] have reasons to see, ‘If I can move the fan base for Taylor Swift — an icon who is this political figure, in a way — does that mean I can do it in other places?’” Paul said.","url":"https://www.huffpost.com/entry/taylor-swift-album-criticism-nazi-maga-social-media-attack_n_6939ffaee4b053d6e8eceb1b?origin=top-ad-recirc","image":"https://img.huffingtonpost.com/asset/693a03cd2600005dff836b27.jpeg?cache=vdF9Bn9vSo&ops=1778_1000","video":null,"publish_date":"2025-12-11 02:30:27","author":"Ben Blanchet","authors":["Ben Blanchet"],"language":"en","source_country":"in","sentiment":0.119},{"id":386923508,"title":"The NetflixWBD Sale Means Fewer Seats for Black Creatives and Culture","text":"Netflix intends to purchase Warner Bros. for $72 billion. The deal would give the world’s largest streamer ownership of a 102-year-old archive including Hollywood’s most legendary film and television IP—from Casablanca to The Color Purple. The monumental sale arrives at a time of extreme economic headwinds and unprecedented job losses in the entertainment industry.\n\nThis isn’t just a historic transaction. It powers a broader global trend toward massive consolidation in media. \n\nBut beneath the headlines is a more urgent question: What does the world’s most powerful streamer combined with the most storied studio mean for Black creatives, Black culture, and Black economic power inside Hollywood?\n\nHere’s my forecast.\n\n1. A shrinking seat at the table\n\nClearing redundancies and restructuring are inevitable in acquisitions at this scale, and shareholders mandate it to reduce costs. Unfortunately, Black senior leaders and Black middle managers often bear the brunt of cuts. Warner Bros. Discovery only has a handful of Black senior leaders, including Channing Dungey, Warner’s Chairman and CEO of their television group, and a longtime entertainment leader who previously ran ABC Entertainment. Under Netflix rule, a company with a vastly different operating structure, does Dungey’s role and influence survive?\n\nAnd what of Black employees in the middle layers of the company, who are already significantly outnumbered? Consolidation typically leads to fewer Black decision makers in the room, fewer champions for diverse storytelling, and waning influence during a period already defined by anti-DEI backlash.\n\n2. Conglomerates trigger steely gatekeeping\n\nSinners delivered a culture-shifting win for Warner Bros, defying the decline of theatrical releases, with a global box office nearing $400 million. But the scale of Warner’s $90 million investment on the Coogler–Jordan partnership is an anomaly. For the average Black filmmaker, passing through Hollywood’s steely gatekeepers remains extraordinarily difficult. Even when projects clear that bar, many face early cancellations or one-season fates.\n\nIn summer 2021, HBO infamously cancelled Misha Green’s Lovecraft Country after a single acclaimed season and has offered very few Black-led series since. But it’s also important to acknowledge historical context. Consolidation does not automatically mean fewer opportunities for Black film and TV.\n\nIn the era when Time Warner operated as one of the world’s most powerful entertainment conglomerates, it housed Warner Bros., Warner Music Group, Time Inc., including People, Entertainment Weekly, Essence, and the book publisher Simon & Schuster.\n\nDuring that period, Warner fueled the heyday of Black cinema in the 1990s with titles like Set It Off, Friday, and Hoodlum, and powered the rise of Black sitcoms, among them include classics Family Matters and The Fresh Prince of Bel-Air.\n\nBut that same conglomerate also produced the nadir of Black cinema and the dearth of the Black sitcom, often justified under the biased theory Black-led stories are “too niche” or lacked broad cultural appeal.\n\nConsolidation creates possibility and danger. Historically, offering Black storytellers a platform and later, snatching it away.\n\n3. Data-driven decision-making overrules creative risk\n\nNetflix is fundamentally a technology company. Its ethos prioritizes data, optimization, and agility. This is smart business but often overshadows creative risk-taking, which is the spinal cord to cultural progress.\n\nUnder a Netflix-led Warner Bros., would Sinners have been greenlit at that scale? Would Coogler have secured such a rare, creator-favorable deal structure?\n\nData-driven forecasting is often used to reinforce the disproven myth that Black film and TV don’t perform. When data intelligence overrules cultural intelligence, Black storytelling becomes vulnerable to algorithmic erasure.\n\nTo Netflix’s credit, the streamer backed series like Mara Brock-Akil’s Forever and Survival of the Thickest starring Michelle Buteau and Tasha Smith. But inheriting Warner’s creative engine means the bar must be set higher. Way high up. Not merely maintained.\n\n4. Deepened dependency on Black dollars and cultural power, with little investment\n\nA Netflix–Warner Bros. combination creates the single most powerful entertainment company in the world. But no entertainment company generates meaningful profits without Black consumers, who historically over-index on time spent on entertainment, and whose cultural leadership and taste drive innovation across the industry.\n\nNetflix leans heavily into “Strong Black Lead”, a social-first marketing vertical launched early 2018 to increase Black subscribers. The streamer’s leadership, including co-CEO Ted Sarandos, publicly supported former Vice President Kamala Harris’s presidential run. But there remains a wide gap between messaging and the company’s investment in Black senior leaders, Black producers, and Black original programming.\n\nA merger at this scale could also trigger subscription cost increases, disproportionately impacting communities already facing inflation in housing, food, and digital access. Black influence fuels the entertainment business. Yet Black creatives rarely receive equitable investment in return.\n\nThe Road Ahead: antitrust, power, and the stakes for Black culture\n\nAlthough the sale is agreed upon, it still requires regulatory approval. The Department of Justice and the FCC will evaluate antitrust implications—concerns that often lead to required divestitures, spin-offs, ownership caps, or mandates around content distribution.\n\nFollowing Netflix’s deal announcement, Paramount, in a last ditch effort, launched an even more aggressive bid to secure Warner Bros, including its television networks, valued at $108.4 billion. David Ellison’s SkyDance company acquired Paramount for $8 billion summer 2025 with support from father Larry Ellison, co-founder of software company Oracle. Skydance has since laid off over 1,000 Paramount employees. Both father and son have shown political alignment with President Trump behind-the-scenes. Reportedly, Trump is more enthusiastic about Ellison’s bid for Warner, signaling the president would push for speedy FCC approval. \n\nThough the Ellisons’s offer for Warner far exceeds Netflix by some $36 billion, Sarandos remains confident its deal will close.\n\nEven if Netflix wins FCC approval to merge Warner into their streaming operations, in a Trump nation begetting anti-DEI actions, chances regulators prioritize protections for Black creatives are slim. What does it say about Hollywood and America if the most consequential entertainment merger of our time leads to measurable decline in Black influence and Black creative access? Hollywood sits on the backbone of Black talent and storytelling. This moment will pressure-cook a time of mercurial change and will test if the industry intends to honor this truth or consolidate past it.","summary":"The NetflixWBD Sale Means Fewer Seats for Black Creatives and Culture","url":"https://www.adweek.com/convergent-tv/the-netflix-wbd-sale-means-fewer-seats-for-black-creatives-and-culture/","image":"https://static-www.adweek.com/wp-content/uploads/2025/12/3eeb42c7-656d-4992-9b52-f7179cbe727d.png?w=600&h=315&crop=1","video":null,"publish_date":"2025-12-11 01:34:27","author":"Geneva S. Thomas","authors":["Geneva S. Thomas"],"language":"en","source_country":"au","sentiment":0.35},{"id":386928088,"title":"Kamala Harris quells new speculation about CA governor run in 2026","text":"Kamala Harris’ team is shooting down speculation that the former vice president is again considering a run for California governor next year, after she announced in July that she would not.\n\nFueled by polls showing a weak Democratic field of gubernatorial candidates, political circles were abuzz this week that Harris, the former Democratic presidential nominee, was having second thoughts.\n\nTwo sources close to Harris who were unauthorized to speak publicly confirmed Wednesday that she plans to stay out of the race.\n\nAfter her 2024 loss to President Donald Trump, Harris initially considered running in California’s open governor’s race next year but in July announced that her future public service “will not be in elected office.” On Wednesday, an aide pointed to that announcement when asked if Harris was reconsidering.\n\nHarris recently told the New York Times that she planned to “ramp up” her political engagement in 2026, forming a political action committee and paying the Democratic National Committee $7 million for her email list.\n\nShe has spent the last two months on a book tour for “107 Days,” her memoir about her truncated presidential campaign, and on Wednesday announced added more than a dozen new stops in early 2026.\n\nRumors flew around political circles in recent days that Harris was reconsidering her decision to stay out of the California race, citing the lack of a gubernatorial frontrunner. With six months to go until the primary election, recent polls have shown nearly a third of California voters are undecided about whom to support in the governor’s race.\n\nAttorney General Rob Bonta is also believed to be considering a run for governor after initially saying in February that he would focus on his current position — a claim he reiterated last week to reporters. His adviser, Dan Newman, did not respond to requests for comment Wednesday.\n\nAn Emerson college poll conducted in early December showed two Republican candidates leading the state’s gubernatorial field, with Democrats Eric Swalwell and Katie Porter close behind.\n\nAfter losing the 2024 election, Harris initially regrouped in Los Angeles out of the public eye.\n\nIn her memoir and in interviews, she has swiped at Newsom, former Transportation Secretary Pete Buttigieg, and Pennsylvania Gov. Josh Shapiro, who she considered as a running mate before deciding on Minnesota Gov. Tim Walz.\n\nShe wrote that Newsom initially declined her calls after former president Joe Biden dropped out and endorsed her because he was on the treadmill, and later on a hike.\n\nLater that night, Newsom endorsed Harris. The two came up together in San Francisco politics in the 1990s and share political and fundraising strategists.\n\nThis story was originally published December 10, 2025 at 2:08 PM.","url":"https://www.sacbee.com/news/politics-government/capitol-alert/article313595047.html","image":"https://www.sacbee.com/public/latest-news/i54vc8/picture313595417/alternates/FREE_1140/2244068917-GI.JPG","video":null,"publish_date":"2025-12-10 22:08:17","author":"Lia Russell,Nicole Nixon","authors":["Lia Russell","Nicole Nixon"],"language":"en","category":"politics","source_country":"us","sentiment":-0.286},{"id":386902412,"title":"‘Thousands of people are coming to hear my voice’: Kamala Harris declares herself to be a ‘historic figure’","text":"Kamala Harris, Joe Biden’s vice president who was appointed “border czar” during his time in the Oval office and allowed one of the biggest national catastrophes ever through millions and millions of illegal aliens, including terrorists, breaking into the country, now considers herself a “historic figure.”\n\nA report from Fox News noted that she also boasted about having a marble bust of herself carved to be placed in Congress.\n\nShe was being interviewed by the New York Times in a promotion for a coming book she is selling and told reporters at the newspaper “she no longer feels ‘burdened’ by the need to achieve a place in history.”\n\nBesides her border failure, she also confirmed she was heart and soul aligned with Joe Biden’s agenda promoting abortion for all – at taxpayer expense – and transgenderism, including body mutilating surgeries for children.\n\nShe admitted all that when she said she couldn’t think of anything done during Biden’s term that she would have done differently.\n\nFurther, when she was the Democrat nominee for president in 2024, she failed in dramatic style, ceding every swing state, the Electoral College and the popular vote to President Trump.\n\n“I understand the focus on ’28 and all that,” Harris complained. ‘But there will be a marble bust of me in Congress. I am a historic figure like any Vice President of the United States ever was. Thousands of people are coming to hear my voice. Thousands and thousands.”\n\nShe said the tour promoting her book, for which sales are dismal, constantly is “sold out.”\n\nA commentary at BizPacReview bluntly asked, “Is she drunk?”\n\nIt explained, “A New York Times profile on the woman who could have been President of the United States indicates that voters haven’t seen the last of her, but the less-than-flattering nature of the piece is enough to make one wonder if she’ll ever receive enough support to make another run for the Oval Office.”\n\nThe Times wrote, “Old advisers, both allied and estranged, have squinted from afar at her book tour, wondering what exactly her strategy is, or if there is any at all. She has done little to distance herself from former President Joseph R. Biden Jr. besides admitting aloud that it was ‘recklessness’ on her part not to have discouraged him from running again. There has been virtually none of the strategic repackaging that a future candidate typically does, the buffing out of flaws and shining up of strengths.”\n\nThe report pointed out voters “had no idea” for what she stood in 2024.\n\nReports also reveal she is using her book to “settle scores” with people, including Pennsylvania Gov. Josh Shapiro to Joe Biden who are criticized.\n\nHer book also includes complaints about how hard it was to get anything positive said about her work.\n\nThe Times report said she swears freely, letting fly a two-word phrase “rhyming with ‘bucket'” and mostly has been a bystander as the Democrat party struggles to find an identity following its collapse in 2024.\n\nShe’s slipped lately in polling assessing Democrats aiming for a 2028 primary and praises Democrats in Congress for shutting down government for many weeks, hurting people in the process, unsuccessfully trying to get Republicans to raid taxpayers for hundreds of billions of dollars to give to illegal aliens.","summary":"Boasts of having marble bust of her placed in Congress","url":"https://www.wnd.com/2025/12/thousands-people-are-coming-hear-my-voice-kamala/","image":"https://www.wnd.com/wp-content/uploads/2024/07/kamala-harris-capitol-flag-democrats-republicans-congress.jpg","video":null,"publish_date":"2025-12-10 20:50:19","author":"Bob Unruh","authors":["Bob Unruh"],"language":"en","source_country":"us","sentiment":-0.38},{"id":386902790,"title":"WTF? Embracing profanity is one thing both political parties seem to agree on","text":"Vice President JD Vance called a podcast host a “dips-t” in September. In Thanksgiving remarks before troops, Vance joked that anyone who said they liked turkey was “full of s–.” After one National Guard member was killed in a shooting in Washington last month and a second was critically injured, top Trump aide Steven Cheung told a reporter on social media to “shut the f– up” when she wrote that the deployment of troops in the nation’s capital was “for political show.”\n\nAmong Democrats, former Vice President Kamala Harris earned a roar of approval from her audience in September when she condemned the Trump administration by saying “these mother—- are crazy.” After Trump called for the execution of several Democratic members of Congress last month, Sen. Chris Murphy, D-Conn., said it was time for people with influence to “pick a f— side.” Senate Democratic leader Chuck Schumer of New York said the administration cannot “f– around” with the release of the Jeffrey Epstein files. Democratic Rep. Jasmine Crockett, who on Monday announced her Senate campaign in Texas, did not hold back earlier this year when asked what she would tell Elon Musk if given the chance: “F– off.”\n\nThe volley of vulgarities underscore an ever-coarsening political environment that often plays out on social media or other digital platforms where the posts or video clips that evoke the strongest emotions are rewarded with the most engagement.\n\n“If you want to be angry at someone, be angry at the social media companies,” Utah Gov. Spencer Cox, a Republican, said Tuesday night at Washington National Cathedral, where he spoke at an event focused on political civility. “It’s not a fair fight. They’ve hijacked our brains. They understand these dopamine hits. Outrage sells.”\n\nCox, whose national profile rose after calling for civility in the wake of conservative activist Charlie Kirk’s assassination in his state, approved an overhaul of social media laws meant to protect children. A federal judge has temporarily blocked the state law.","url":"https://news.net/news/wtf-embracing-profanity-is-one-thing-both-political-parties-seem-to-agree-on/","image":"https://dymlcaxjpm5z9.cloudfront.net/wp-content/uploads/2025/12/10232638/Trump_30408-scaled.jpg","video":null,"publish_date":"2025-12-10 19:48:03","author":"Steven Sloan","authors":["Steven Sloan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.161},{"id":386912170,"title":"Miami election was a ‘shot in the arm’ for Dems but careful calling it a comeback | Opinion","text":"The analysis and punditry of the results of Miami’s Tuesday night election started even before Eileen Higgins, a Democrat, won the mayoral race.\n\nThere’s no doubt this was a good — even great — night for Democrats. The nonpartisan race turned into a red-versus-blue contest with President Donald Trump’s endorsement of Emilio Gonzalez, a Republican, and the infusion of resources Higgins got from national Democrats. But does this mean Florida — and Miami-Dade County, which Trump easily carried in 2024 — are back in play for the Democratic Party?\n\nWithout doubt, Higgins made history as the first woman to lead Miami and the first elected mayor to run as a Democrat since the 1990s. But we should be careful with extrapolations, especially when turnout in city elections are embarrassingly low: fewer than 38,000 Miamians voted Tuesday — out of 176,000 registered voters.\n\nWe wish this election had remained nonpartisan. But in today’s politically polarized climate, it was only a matter of time before local races— where issues such as affordability, infrastructure and public transportation shouldn’t be partisan — became embroiled in party politics.\n\nAlas, that ship has sailed.\n\nThe mayoral race became a test for two things: whether Democrats can crawl their way out of the electoral hole they dug for themselves in South Florida, and whether a Trump endorsement sinks or elevates candidates in a general election.\n\nGonzalez lost by nearly 20 points. The fact that Trump’s support did not get him elected is no surprise. The president’s endorsement may work in a GOP primary but a general election in a city that Kamala Harris carried, albeit by a slim margin, in 2024 is a different story. Trump’s support also failed to get several candidates elected in important U.S. Senate and gubernatorial races across the country in 2022. Trump has also lost support among Hispanic voters, a key demographic in Miami.\n\nIn hindsight, would Gonzalez have been better off running only on his résumé as a former city manager and retired Army colonel who reversed in court the city commission’s decision to move the 2025 elections to next year without voter approval? Even that might not have been enough to close the gap on Higgins’ advantage.\n\nThe Tuesday election was a “shot in the arm” for Democrats, Fernand Amandi, a Miami Democratic pollster, told the Herald Editorial Board.\n\n“I think, for the first time, they have something they can start to build on,” he said.\n\nHiggins’ win will encourage Democratic donors to take a second look at Florida, a state the party has essentially written off in recent elections, and it’s an indicator they should not ignore the state anymore, Amandi said. But even the most optimistic Democrats are probably not saying this suddenly means Florida is back in play for them. The 2026 elections will still be a challenge for the party that has been hemorrhaging voters and has ceded control to the GOP, including in former blue bastions like South Florida.\n\nNow that Higgins has won two competitive races — for mayor and Miami-Dade County commissioner in 2018 — consultants will inevitably begin looking at her next political move (she gave up her county seat less than halfway through her second term to run for mayor). But Higgins must focus on implementing an ambitious agenda that includes streamlining the city’s slow permitting system, building more affordable housing and improving public transit.\n\nAbove all, Higgins’ legacy will be defined by whether she can change the image of Miami from a city hall where scandals and bad behavior are the status quo. She will have to accomplish all of that with the limited powers Miami’s charter gives her position. Unlike the mayors of Miami-Dade County and other cities, she will not have administrative powers, which are delegated to a city manager she can appoint. Higgins, however, should be strategic with her existing powers to veto legislation and whip votes on the commission on issues she cares about.\n\nMiami’s mayoral election was a good night for the Democratic Party, but the real measure of success will be if the next four years are better for the residents of the city.","url":"https://www.miamiherald.com/opinion/editorials/article313584485.html","image":"https://www.miamiherald.com/public/latest-news/ugoj2y/picture313568181/alternates/LANDSCAPE_1140/MIA_EILEENHIGGINSELECTIONAGS085.JPG","video":null,"publish_date":"2025-12-10 19:24:56","author":"The Miami Herald Editorial Board","authors":["The Miami Herald Editorial Board"],"language":"en","source_country":"us","sentiment":-0.586},{"id":386887352,"title":"Kamala Harris to visit Madison book tour about failed presidential bid","text":"MADISON - Kamala Harris will bring her book tour to Madison next year, promoting her account of the whirlwind 2024 presidential election and her loss to Donald Trump.\n\nHarris will appear at the Orpheum Theater in downtown Madison at 1 p.m. on Sunday, March 1.\n\nThe event is being held in partnership with local bookstore A Room of One's Own. \n\nThe visit is one of 18 appearances Harris will make across the U.S. this spring, following her 17-stop fall 2025 tour. \n\nThe former Democratic nominee for president stepped into the race after Joe Biden dropped out, after facing pressure and scrutiny regarding his age and mental faculties.\n\nBut her run, limited to 107 days, was not without controversy, which is detailed in her book, aptly named \"107 Days.\"\n\nHarris shares details about her relationship with Biden, her regrets regarding the campaign and goes as far as to criticize her running mate, Minnesota Gov. Tim Walz, according to USA Today.\n\nShe also aims at Trump and Vice President JD Vance, criticizing everything from their stance on immigration to military service.\n\nThe last time Harris visited Madison — where she lived from the ages of 3 to 5 — was Oct. 30, 2024, during a star-studded rally featuring live performances from Mumford & Sons and Gracie Abrams.\n\nTickets for the March 1 event go on sale Friday, Dec. 11, and can be purchased through the Orpheum's website. Tickets for a meet-and-greet before the event can also be purchased.\n\nLaura Schulte can be reached at leschulte@jrn.com and on X @SchulteLaura.","url":"https://eu.jsonline.com/story/news/politics/2025/12/10/kamala-harris-to-visit-madison-book-tour-about-failed-presidential-bid/87701484007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2024/11/01/PMJS/75997286007-getty-2182349681.jpg?auto=webp&crop=4855,2732,x0,y252&format=pjpg&width=1200","video":null,"publish_date":"2025-12-10 18:41:02","author":"Journal Sentinel","authors":["Journal Sentinel"],"language":"en","category":"politics","source_country":"us","sentiment":-0.034},{"id":386905024,"title":"Automation and Intimacy Brought Video Podcasters Out of the Man Cave","text":"In the course of 2025, the video-podcast clip in general became a major unit of discourse. Once upon a time, aspiring public intellectuals and digital-native commentators had blogs. Then they had Twitter accounts, snarking from behind cartoon avatars; then podcasts, speaking into microphones into the void; then newsletters, publishing reams of text into our inboxes. In all of those formats, the human body was conspicuously absent—but no longer. With the rise of the somewhat oxymoronic video podcast, the de-rigueur medium is a digital talk show of one, an eponymous production performed—face, body, outfit, and soul—for the camera. We don’t just listen to Friedland, Ezra Klein, “Call Her Daddy” ’s Alex Cooper, “Talk Easy” ’s Sam Fragoso, “Throwing Fits” ’s James Harris and Lawrence Schlossman, or myriad other podcast proprietors anymore; we watch, often in closeup, every expression that flits across their faces, and thus cultivate a kind of parasocial intimacy usually reserved for Hollywood actors. There is no more hiding behind a byline; the moment mandates hair stylists and makeup. And, with the end of faceless punditry, measured neutrality moves toward obsolescence, too. The quality that hosts need in order to court and maintain audiences online is a dose of charismatic feeling, preferably caught in thirty seconds or less.\nA few early adopters have been broadcasting their podcasts on video for many years. Joe Rogan has been filming his podcast since it launched in 2009, and the tech tastemaker Lex Fridman started filming his conversations back in 2018. But the mass rush toward video podcasting began with the 2024 Presidential race, which made clear just how much influence on public opinion shows like Rogan’s exerted. Donald Trump, J. D. Vance, and Elon Musk all took their turns doing three-hour gab sessions with Rogan in the run-up to Election Day; that August, Trump went viral discussing addiction in an unusually touchy-feely moment on Theo Von’s video podcast. MAGA’s success reaching voters this way—and Kamala Harris’s regrettable decision not to go on Rogan—sparked a realization that the medium was more than passive man-cave listening. Early this year, YouTube revealed that a billion monthly users consumed podcasts on its platform and declared itself “the most frequently used service for listening to podcasts in the U.S.”\nDuring Trump’s first year back in office, D.I.Y. footage of two people talking into microphones has shaped the news cycle as much as any cable network. In January, the Times columnist Ross Douthat patched Steve Bannon in over Zoom for a conversation first aired on an episode of the Times’ “Matter of Opinion” podcast and then syndicated on Douthat’s new video podcast, “Interesting Times.” In a surreal mise en scène, Douthat, appearing in high res in a cozy studio, watched Bannon’s face on a laptop as he denounced “Broligarchs” such as Musk, whose DOGE operations were ramping up at the time, signalling the first clear schism between the MAGA right and the tech overlords who backed Trump in 2024. (Watching someone watch a Zoom call is a video-podcast innovation of dubious appeal.) Then, in February, Musk made a redux appearance on Rogan’s show and delivered one of his most in-depth public discussions of DOGE; on YouTube, the episode racked up more than fourteen million views. The video podcast was suddenly a news-making venue, a makeshift press conference at a time when, thanks in part to Trump’s draconian approach to the First Amendment, press was more limited than ever.\nWhat’s motivating the turn to video goes beyond the strategic utility of cultivating intimacy with an audience; the trend has equally to do with the structural mechanics of disseminating content online. Even as podcasts exploded in popularity during the early twenty-tens, the form had problems with discovery and distribution. Isolated bits of audio were not likely to go viral, because there was no centralized social-media-style feed for audio content, and because the major podcasting apps did not use algorithmic recommendations to help creators find fresh audiences. If you are an audio podcaster looking for listeners, you have to rely on word of mouth or pop up on other productions hoping to grab some of their fans. But, if you piggyback your audio release on video channels, you can reach new audiences through the automated feeds of YouTube, TikTok, and X. Gavin Newsom, the governor of California, apparently hoped to benefit accordingly when he débuted a video podcast, “This Is Gavin Newsom,” in March, that seemed intended to plant him in the public psyche as a 2028 Presidential contender. (By the next election, perhaps YouTube-channel-subscriber numbers will be as meaningful as a candidate’s performance in the polls.) The same month, Amy Poehler, an actor, writer, and comedy power-producer who ostensibly has little need for a new platform, launched her own video podcast, “Good Hang,” fostering a direct audience outside the usual Hollywood channels. There’s a certain levelling effect at play: no matter how big your name is, the ideal media strategy today seems to be a stage set and a microphone. In August, Taylor Swift used “New Heights,” the video podcast co-hosted by her now fiancé Travis Kelce, to divulge details of her latest album. Watching fans pore over the footage for clues in the couple’s body language, one couldn’t help but think that audio doesn’t stand a chance.\nThe video podcast has established a new aesthetic of information—or perhaps just revived one that was more familiar in the era of “Crossfire” debates on CNN. We watch for signs of emotional gravitas as much as for the content of what is being said. Authority adheres to hosts through their acts of sheer duration, with some broadcasting several times a week or for hours every day. Through video, we get to know our pundits the same way we engage with influencers, and the more we are convinced by their multimedia performances the more readily we join their podcasting personality cults. Increasingly, this world of digital broadcasting is embroiled in slow-burning rivalries and rhetorical fights, a Marvel universe of independent opinion-givers. In September, the writer Ta-Nehisi Coates appeared on Ezra Klein’s hit Times podcast, “The Ezra Klein Show,” which transitioned to video late last year. Coates was there to discuss a column that Klein had written about the assassination of the right-wing activist Charlie Kirk, in which Klein argued that Kirk had practiced politics “the right way.” Coates had published a rejoinder in Vanity Fair, pointing out that Kirk had “reveled in open bigotry.” Their tête-à-tête on Klein’s show, staged at a bare-bones studio table, added a human component to their battle of ideas. Coates looked visibly taken aback as he discussed Klein’s choice not to call out Kirk’s hateful ideology, and supportive viewers turned his skeptical face into a kind of reaction meme. Klein’s more placid affect, meanwhile, did little to absolve him of critiques of political abstraction and whitewashing. In the video-podcast era, those best able to project their authenticity through the small screen win—and it’s not always the people who film themselves the most often.\nAs the internet’s content-distribution channels become overwhelmingly cluttered with spam, misinformation, and A.I.-generated slop and propaganda, video podcasts have the considerable advantage of serving as markers of reality, at least for now. Viewers are reassured to see a voice coming directly out of a face, and a conversation documented for a stretch of time that would seem difficult to fake. ChatGPT can blandly spit out infinite facts, but individual eloquence is still in limited supply. What’s unclear is whether the video-podcast format can sustain the explosion of entrants as more talking heads in journalism, politics, entertainment, and tech jockey for attention in a digital landscape already beset by chronic distraction. In the past few months alone, we’ve seen the arrival of new video podcasts from Emily Sundberg’s buzzy New York City newsletter “Feed Me”; the sports agent Rich Paul and the ESPN commentator Max Kellerman, under the umbrella of The Ringer; the comedian Ilana Glazer; and PBS. (The New Yorker is not immune from the trend: it now films some episodes of The New Yorker Radio Hour.) Least expected, perhaps, was the launch of “The Liz Truss Show,” hosted by the former British Prime Minister, on YouTube. Truss’s time in office lasted all of six weeks, but, with a clip-on microphone and a wonkish backdrop, perhaps she can gin up a new kind of following, one videotaped chat at a time. ♦","summary":"Whether you’re a pundit, a politician, or an A-list comedian, the best media strategy these days is a D.I.Y. stage set and a microphone.","url":"https://www.newyorker.com/culture/infinite-scroll/why-video-podcasts-multiplied-beyond-the-man-cave","image":"https://media.newyorker.com/photos/6938aacbf24a4b29fd17babc/16:9/w_2800,h_1575,c_limit/NewYorker_podcasts_final%20.jpg","video":null,"publish_date":"2025-12-10 18:27:33","author":"Kyle Chayka","authors":["Kyle Chayka"],"language":"en","source_country":"us","sentiment":-0.06},{"id":386903004,"title":"This High-Profile Race Shows Exactly What Has Changed In The Democratic Party","text":"WASHINGTON — There’s plenty of reason to be skeptical of Rep. Jasmine Crockett’s chances in Texas’ U.S. Senate race. While Crockett’s television hits and podcast interviews delight liberals, she’s only ever won in safely Democratic seats. Her preferred strategy of focusing on increasing base voter turnout has little track record of success. Republicans are openly ecstatic about her decision. \n\nBut if Democratic elected officials share this skepticism, they’re unwilling to say it out loud. They’re also not willing to fully back her campaign or endorse her over her primary opponent, state Rep. James Talarico. \n\n“It’s entirely possible that she can put together a good campaign,” said Sen. Ruben Gallego (D-Ariz.).\n\n“She’s an outstanding person and an important voice in her state,” added Sen. Raphael Warnock (D-Ga.).\n\n“I’m obviously focused on the House, not the Senate,” said House Minority Leader Hakeem Jeffries (D-N.Y.), declining to speak on the ambitions of one of the most high-profile members of his caucus.\n\nUncertainty about the utility of Crockett’s bid extended even to Sen. Chris Murphy (D-Conn.), one of the members of the so-called “Fight Club” group of progressive senators pushing for a more aggressive approach to combating Donald Trump.\n\n“There are some places where the primaries are good, and there are places where they can be a pain in the ass,” Murphy told HuffPost. “A primary can, you know, ultimately cause a lot of new people to register and cause a lot of new people to get involved.”\n\nThe wishy-washiness greeting Crockett is reflective of the party’s uncertainty about how to navigate the anti-Trump, anti-establishment energy coursing through the party, which closely mirrors the GOP’s crack-up in the first half of the 2010s. Democrats are hoping to mirror the incredibly strong midterm election performances Republicans had in those years.\n\nBut they are hoping to avoid the downsides the GOP experienced in those years: Primary voters repeatedly picking weak candidates who handed winnable elections to the opposition. The consensus among party operatives is Crockett is the Democratic equivalent of Christine O’Donnell or Richard Mourdock, a candidate whose fighting spirit animates the party’s base but whose rhetoric — like Crockett saying conservatives are “inherently violent” or suggesting Latino Trump supporters have a “slave mentality” — repels swing voters. \n\n“This feels like a Democratic tea party moment,” said Adam Carlson, founder of the Democratic polling firm Zenith Research. “Democratic primary voters are tired of having candidates dictated to them, and they’re saying, ‘Stop telling us who’s electable. We’re going to vote for who we like the best.’” \n\nThe party’s establishment has long succeeded at closely managing primaries. Senate Minority Leader Chuck Schumer (D-N.Y.), known as a ferocious recruiter, was also adept at subtly and not-so-subtly discouraging candidacies, helping the party avoid contentious primaries in Florida and Kansas in recent years. \n\nAnd voters largely went along with party leaders’ wishes. In the first midterm under Trump, wins by insurgent progressives like Rep. Alexandria Ocasio-Cortez (D-N.Y.) were the exception rather than the rule, with voters — especially in swing states and districts — backing moderate candidates seen as safe choices to win. That trend largely continued through the 2020, 2022 and 2024 elections. \n\nDemocrats in those elections often benefited from anti-Trump energy, and clear cases of the party picking the wrong nominee were few, far between and often limited to lower-stakes races for the U.S. House. But some party operatives fear they could be far more common this cycle.\n\nSen. John Fetterman (D-Pa.) indirectly compared Crockett to Aftyn Behn, the Tennessee state legislator whose liberal stances and controversial social media posts some Democrats blamed for blowing the party’s shot at a deep-red House seat earlier this month.\n\n“I do know that Texas is red, and then I do know that you have to bring some people over to the other side,” Fetterman told HuffPost. “And now, what happened in Tennessee? You know, we had that total train wreck on our side, and that could have been actually really, truly competitive if it was like a more reasonable kind of a candidate.”\n\nCrockett’s entrance into the race seemingly forced former Rep. Colin Allred, potentially a much stronger candidate, to challenge Rep. Julie Johnson for a safe Democratic House seat instead. Allred ran 6 percentage points ahead of former Vice President Kamala Harris in the state when he challenged Sen. Ted Cruz last cycle.\n\nAllred’s team portrayed his decision, which leaves Talarico as Crockett’s only competition in the primary, as a selfless one that would give the party’s nominee a 13-week head start in the general election by avoiding a runoff, which is a near certainty in the GOP primary between incumbent Sen. John Cornyn, Attorney General Ken Paxton and Rep. Wesley Hunt. (Texas requires runoffs in primaries if no candidate breaks 50% of the vote.)\n\nBut as the likelihood of Crockett running for Senate became clear in recent weeks, Democrats in the state couldn’t find anyone willing to discourage her. Senate Democrats do not yet view Texas, an ultra-expensive state that might only be competitive if Cornyn loses to the deeply conservative and ethically challenged Paxton, as an essential part of their pathway to the majority. \n\nEven if they had, Crockett, to put it lightly, does not seem to be the type swayed by the pleas of party elders. \n\n“It’s weird that people believe that I could win the races that I won and I’m just like out here willy-nilly,” she told CNN last week before officially announcing her decision. “But OK. I am very self-aware, right?”\n\nWith Allred out of the race, it is now a showdown between Crockett and Talarico, widely seen as another rising star in the party and someone who has amassed a $5 million war chest since entering the race this summer, according to the Federal Election Commission filings from October. (Crockett has roughly $4.6 million in her account.) \n\nCrockett’s unelectability, in the eyes of most Democratic operatives, comes down to both her insistence on turning out Democratic base voters at the expense of persuasion and her tendency to actively insult Trump voters.\n\n“There just aren’t enough Democrats to win using a base-heavy strategy in Texas,” Carlson said.\n\nThe other concern Democrats have about Crockett is, as one strategist put it, her “robust self-image.” Her campaign announcement did not include any mention of policies or voter concerns; it was a video of herself with audio of Trump insulting her. Early on in her kickoff speech, Crockett said she was running because “what we need is for me to have a bigger voice.” \n\nCrockett’s campaign did not respond to an email requesting comment. During an appearance on CNN on Monday night, Crockett went further than previously in suggesting she would reach out to some Trump voters. \n\n“We are going to be able to get people that potentially have voted for Trump even though I, obviously, am one of his loudest opponents because at the end of the day, they vote for who they believe is fighting for them,” she told host Laura Coates.\n\nBut she reiterated her top priority would be turning out otherwise apathetic voters, a strategy even many other progressives have backed away from. “Our goal is to make sure that we can engage people that historically have not been talked to because there are so many people that get ignored, specifically in the state of Texas,” she said. “Listen, the state of Texas is 61% people of color. We have a lot of good folk that we can talk to.”\n\nOne Democrat working for a House campaign in Texas’ heavily Latino Rio Grande Valley — an area that has swung sharply to Republicans over the past decade — noted Crockett’s announcement video included no mention of the high cost of living, a message the party has used to successfully win back Latino voters elsewhere in elections this year.\n\n“It’s simply not the message these voters are looking for,” said the operative, who requested anonymity to speak frankly because his candidate is neutral in the Senate primary. “People here are worried about a downballot bloodbath.” \n\nWhile Crockett has an advantage in name identification and starts out in the lead, Democrats watching the race say she also has uniquely high unfavorable ratings, even among members of her own party. Talarico allies hope a closer look at Crockett’s record — including her past support for Israel, her ties to the cryptocurrency industry and her acceptance of corporate political action committee money — rather than just her TV appearances, will convince the party’s voters Talarico gives them the best chance of winning statewide in Texas for the first time in 30 years. \n\n“We’re building a movement in Texas — fueled by record-breaking grassroots fundraising and 10,000 volunteers who are putting in the work to defeat the billionaire mega-donors and puppet politicians who have taken over our state,” Talarico said in a statement after Crockett’s entrance into the race. “Our movement is rooted in unity over division — so we welcome Congresswoman Crockett into this race.”","url":"https://www.huffpost.com/entry/texas-senate-race-democratic-party_n_6939989de4b0758c1aff338e?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/69399929190000caf87f3c31.jpeg?cache=cdWWm9a14L&ops=1778_1000","video":null,"publish_date":"2025-12-10 18:19:43","author":"Igor Bobic,Kevin Robillard","authors":["Igor Bobic","Kevin Robillard"],"language":"en","category":"politics","source_country":"us","sentiment":0.129},{"id":386912200,"title":"Trump will be on the ballot as much as possible in 2026. It didn’t work in Miami","text":"Donald Trump wants to help Republicans by putting himself front and center in next year’s midterm elections.\n\nHe tried it in the race for Miami mayor and it didn’t work.\n\nThe candidate Trump endorsed in the race, Republican Emilio González, lost by nearly 20 points to Democrat Eileen Higgins Tuesday in a city Kamala Harris barely won last year, and became the city’s first Democratic mayor in three decades.\n\n“For the president to weigh in on a local race like this and to lose is embarrassing,” anti-Trump Republican political consultant Mike Madrid said.\n\nThe surge of support in Miami for a Democratic candidate could be a harbinger of what’s to come next year when voters decide which party will control Congress — and Trump’s involvement didn’t stem the tide of Republican losses that began in New Jersey and Virginia last month.\n\nAfter those losses, Trump’s midterm strategy is to get more involved. He plans to endorse Republicans in races that presidents don’t normally weigh in on, according to his chief of staff Susie Wiles.\n\n“Typically in the midterms, it’s not about who’s sitting in the White House. You localize the election and you keep the federal officials out of it. We’re actually going to turn that on its head and put him on the ballot,” Wiles said in an interview released Monday by an online show called The Mom View.\n\nWiles, a longtime Florida Republican political consultant and lobbyist, pointed to last month’s Republican losses elsewhere in the country as evidence of “what happens when he’s not on the ballot and not active.”\n\n“He’s going to campaign like it’s 2024 again,” she added. “He doesn’t help everybody, but for those he does, he’s a difference maker.”\n\nOn Tuesday night, however, Trump put himself on the Miami ballot and it didn’t make a clear difference: Higgins garnered 59% of the vote Tuesday to González’ 41%.\n\nFor Democrats, Tuesday’s results are exactly the type of win against a Trump-endorsed candidate they hope to replicate during the regular election cycle next year.\n\n“Mayor-elect Eileen Higgins’ win is a testament to what Democrats can accomplish when we organize and compete everywhere, including in Miami,” DNC chair Ken Martin said Tuesday night.\n\nThe Democratic Congressional Campaign Committee pointed to it as a warning sign to Rep. Maria Elvira Salazar, who has recently been openly critical of Trump and called his latest immigration crackdown “un-American.”\n\n“Tonight’s victory proves yet again that Democrats are on offense in some of the most competitive political terrain in the country as we continue to expand the battlefield,” Democratic Congressional Campaign Committee spokesperson Madison Andrus echoed.\n\nLongtime Florida Democratic consultant Steve Schale said Higgins’ win is clearly not an indicator “Florida is back in play” for Democrats, but he said the significance of Democrats winning a mayoral seat in Miami can’t be written off as simply an off-year result.\n\n“Her winning is a bigger deal than what happened in New York City,” he said, pointing to Zohran Mamdani’s win over Trump-endorsed Andrew Cuomo.\n\nHe also took a long-term view, harkening back to Florida mayoral wins two decades ago that proved to be an early sign of Florida becoming more competitive ahead of Barack Obama winning Florida in 2008.\n\n“Florida looked really uncompetitive after the 2004 presidential election. We had a governor’s race decided by a dozen points. We had a presidential race that wasn’t close,” Schale said. “The first sign that showed that Florida was potentially reverting back to the mean of being a little bit more competitive was a number of mayor’s races in 2005.”\n\nFor Democrats, building back a beleaguered party against a Republican party that holds every statewide office and holds a supermajority in the state Legislature is a massive lift that one December election is unlikely to change. But Florida Democratic Party Chair Nikki Fried hopes the win will start to convince national investors not to write Florida off as permanently red.\n\n“How can the rest of the nation not wake up and see that we are making progress?” Fried told the Herald ahead of Election Day.\n\nRepublicans minimize the loss\n\nSome Florida Republicans insisted that Higgins’ win wasn’t a referendum on Trump and that instead, Trump’s presence in the race wasn’t emphasized enough. Trump’s endorsements were limited to social media posts, not a visit or robocalls, and came after Higgins placed well ahead of González and 12 other candidates during the Nov. 4 general election.\n\n“I actually think [Wiles] has the right formula. Where it failed this time for Miami was that we didn’t push Trump enough,” Miami Republican Executive Committeewoman Angie Wong told the Herald Tuesday night. “I think the messaging was lost in Miami that we had a Trump-endorsed candidate.”\n\nGonzález downplayed the partisan framing of the race — a contest that had both campaigns sending mailers highlighting Trump’s endorsement of González. One Florida Democratic Party mailer told voters to “send a clear message: Trump’s endorsement will be rejected in Miami.”\n\n“I wanted this to be a municipal race,” he said at his Election Night party in downtown Miami about 30 minutes before the results came in. “I wanted this to be about Miami.”\n\nThe Republican – who called Higgins a “soft socialist” on the campaign trail – insisted he was also courting Democrats throughout the campaign, and wouldn’t have minded some high-profile Democratic support, too. He was up against a 8,800 Democratic voter registration advantage in the race.\n\n“Hell, I’ll take Biden’s endorsement,” he said of the former president, the one candidate to beat Trump in an election. “When you get endorsed by a president, that means a lot.”\n\nGonzález said he thought the president’s backing galvanized Republicans during the runoff and boosted his party’s motivation to vote. While Democrats cast about 1,200 fewer ballots in the runoff than they did in the first-round election last month, Republicans cast about 1,200 more than they did in November. “More Republicans turned up,” González said.\n\nBoth candidates emphasized local issues throughout their campaign, with a focus on rejecting corruption and bringing integrity and honesty to city hall.\n\nLeading up to election day, Republicans lowered expectations for a win. Despite Trump’s endorsement in the race, Florida GOP chair Evan Power called Miami a “Kamala district.”\n\n“We’re fighting there because we’re fighting everywhere,” he said Monday.\n\nDemocrats have typically won the city in major elections and lead in voter registration, even though they haven’t held the mayoral seat since the late 1990s. Manny Diaz, mayor from 2001 to 2009, went on years later to be chairman of the Florida Democratic Party, but renounced his affiliation with the party prior to his first election.\n\nMiami Dade GOP Chairman Kevin Cooper cautioned people from making too much of the results.\n\n“The unfortunate result of one campaign,” he said, “is not the unfortunate result of an agenda or of a party.”\n\nMiami Herald staff writers Doug Hanks and Tess Riski contributed to this report.\n\nThis story was originally published December 10, 2025 at 12:32 PM.","url":"https://www.miamiherald.com/news/politics-government/article313579467.html","image":"https://www.miamiherald.com/public/latest-news/e08cjs/picture312795392/alternates/LANDSCAPE_1140/MIA_42TRUMPAMERICABUSINESSFORUM.JPG","video":null,"publish_date":"2025-12-10 17:32:01","author":"Claire Heddles","authors":["Claire Heddles"],"language":"en","source_country":"us","sentiment":-0.142},{"id":386929510,"title":"Minnesota University Accused of Harboring Illegal Alien Predator","text":"Jesus Saucedo-Portillo seems like a guy you wouldn't want hanging around your neighborhood or your kids' college campus. He's in the country illegally, for starters, but it gets worse than that; Saucedo-Portillo is a registered sex offender, with at least one conviction for driving while impaired. So, not exactly an Eagle Scout.\n\nBut when Immigration & Customs Enforcement (ICE) tried to pick Saucedo-Portillo up on the campus of Augsburg University, a small private college in Minneapolis, where he was unaccountably taking classes despite being in the country illegally, a school administrator and - get this - campus security tried to stop them.\n\nThat's right. A school administrator and the campus security apparatus tried to stop the legal arrest of an illegal alien and convicted criminal.\n\nOn Monday night, DHS, responding to a local news report, said on X that ICE agents arrested Jesus Saucedo-Portillo, a criminal illegal alien and registered sex offender with a prior conviction for driving while impaired.That arrest was hindered when a school administrator teamed up with campus security and attempted to prevent ICE agents from doing their job.Saucedo-Portillo is an undergraduate student at Augsburg University in Minneapolis.\n\nNot anymore, he isn't. Is it belaboring the obvious to note that this guy could have actually posed a danger to the students of Augsburg University?\n\n\"Our officers told the school Administrator and campus security that ICE had a warrant for the illegal alien's arrest. The school Administrator told ICE officers they were violating university policies,\" the statement said. \"Our officers informed them that federal law supersedes any University policy and that if campus security would not stop blocking the law enforcement vehicle from exiting, they would be obstructing justice.\"Despite the warning, the administrator refused to back down and ordered campus security to block the ICE vehicle, according to DHS.\"Our officers followed their training to use the minimum amount of force necessary to clear the area and successfully arrested this criminal illegal alien,\" the statement finished.In an interview with Minnesota Public Radio, Augsburg President Paul Pribbenow corroborated that Saucedo-Portillo is a student and claimed that the arrest was \"illegal\" and that ICE did not have a warrant.\n\nThe officers were correct. ICE is under no obligation to give any consideration to the university's policies. Augsburg University can pass all the policies they like, they can define pi as 3 and insist that the stars are the lights of the heavens shining through holes in the celestial spheres for all they like, and that won't change the facts on the ground, that being that federal law that enables ICE to do their jobs supersedes anything they decree. The arrest wasn't illegal, just because this turbocharged son of a vacuum-cleaner salesman says so, in total disregard for the safety and well-being of his students.\n\nRead More: ICE Strikes Back: Dangerous Illegals Nabbed in New Minneapolis Sweep\n\nYou can't even parody these people. They are already beyond that.\n\nHere's the thing: If this same, exact action were taken during, say, the Obama administration, it's a near-certainty that Paul Pribbenow wouldn't have offered a peep in reply. And the Obama administration was, to be fair, no slouch in kicking illegals out of our country. So, where were the leftist protests then? Where were the useful idiots setting fire to cars and waving Mexican flags? \n\nThis isn't about the illegal aliens. It's not about immigration law. It's about Trump Derangement Syndrome, pure and simple. If Kamala Harris had won the 2024 election, and we should be grateful every waking moment that she didn't, and if she had implemented this exact crackdown on illegal immigration, the left would have not only ignored it - they almost certainly would have celebrated it. Augsburg University would have handed this guy over on a silver platter.\n\nAugsburg officials did not return multiple requests for comment.\n\nYou don't say.\n\nEditor’s Note: Thanks to President Trump, illegal immigration into our great country has virtually stopped. Despite the radical left's lies, new legislation wasn't needed to secure our border, just a new president.\n\nHelp us continue to report the truth about the president's border policies and mass deportations. Join RedState VIP and use promo code FIGHT to get 60% off your membership.","url":"https://redstate.com/wardclark/2025/12/10/minnesota-university-accused-of-harboring-illegal-alien-predator-n2196993","image":"https://media.townhall.com/cdn/hodl/2025/57/a09fd36f-ed3e-4952-ac54-554380213273.jpg","video":null,"publish_date":"2025-12-10 17:06:59","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"politics","source_country":"us","sentiment":-0.522},{"id":386885430,"title":"WTF? Embracing profanity is one thing both political parties seem to agree on","text":"By STEVEN SLOAN, Associated Press\n\nWASHINGTON (AP) — As he shook President Barack Obama’s hand and pulled him in for what he thought was a private aside, Vice President Joe Biden delivered an explicit message: “This is a big f——— deal.” The remark, overheard on live microphones at a 2010 ceremony for the Affordable Care Act, caused a sensation because open profanity from a national leader was unusual at the time.\n\nMore than 15 years later, vulgarity is now in vogue.\n\nDuring a political rally Tuesday night in Pennsylvania that was intended to focus on tackling inflation, President Donald Trump used profanity at least four times. At one point, he even admitted to disparaging Haiti and African nations as “ shithole countries ” during a private 2018 meeting, a comment he denied at the time. And before a bank of cameras during a lengthy Cabinet meeting last week, the Republican president referred to alleged drug smugglers as “sons of b——-s.”\n\nWhile the Biden incident was accidental, the frequency, sharpness and public nature of Trump’s comments are intentional. They build on his project to combat what he sees as pervasive political correctness. Leaders in both parties are seemingly in a race now to the verbal gutter.\n\nVice President JD Vance called a podcast host a “dips—t” in September. In Thanksgiving remarks before troops, Vance joked that anyone who said they liked turkey was “full of s—-.” After one National Guard member was killed in a shooting in Washington last month and a second was critically injured, top Trump aide Steven Cheung told a reporter on social media to “shut the f—- up” when she wrote that the deployment of troops in the nation’s capital was “for political show.”\n\nAmong Democrats, former Vice President Kamala Harris earned a roar of approval from her audience in September when she condemned the Trump administration by saying “these mother———- are crazy.” After Trump called for the execution of several Democratic members of Congress last month, Sen. Chris Murphy, D-Conn., said it was time for people with influence to “pick a f——— side.” Senate Democratic leader Chuck Schumer of New York said the administration cannot “f—- around” with the release of the Jeffrey Epstein files. Democratic Rep. Jasmine Crockett, who on Monday announced her Senate campaign in Texas, did not hold back earlier this year when asked what she would tell Elon Musk if given the chance: “F—- off.”\n\nThe volley of vulgarities underscore an ever-coarsening political environment that often plays out on social media or other digital platforms where the posts or video clips that evoke the strongest emotions are rewarded with the most engagement.\n\n“If you want to be angry at someone, be angry at the social media companies,” Utah Gov. Spencer Cox, a Republican, said Tuesday night at Washington National Cathedral, where he spoke at an event focused on political civility. “It’s not a fair fight. They’ve hijacked our brains. They understand these dopamine hits. Outrage sells.”\n\nCox, whose national profile rose after calling for civility in the wake of conservative activist Charlie Kirk’s assassination in his state, approved an overhaul of social media laws meant to protect children. A federal judge has temporarily blocked the state law.\n\nTough political talk is nothing new\n\nTough talk is nothing new in politics, but leaders long avoided flaunting it.\n\nRecordings from Democrat Lyndon B. Johnson’s administration, for instance, revealed a crude, profane side of his personality that was largely kept private. Republican Richard Nixon bemoaned the fact that the foul language he used in the Oval Office was captured on tape. “Since neither I nor most other Presidents had ever used profanity in public, millions were shocked,” Nixon wrote in his book “In the Arena.”\n\n“Politicians have always sworn, just behind closed doors,” said Benjamin Bergen, a professor at the University of California-San Diego’s Department of Cognitive Science and the author of “What the F: What swearing reveals about our language, our brains, and ourselves.” “The big change is in the past 10 years or so, it’s been much more public.”\n\nAs both parties prepare for the 2026 midterm elections and the 2028 presidential campaign, the question is whether this language will become increasingly mainstream. Republicans who simply try to imitate Trump’s brash style do not always succeed with voters. Democrats who turn to vulgarities risk appearing inauthentic if their words feel forced.\n\nFor some, it is just a distraction.\n\n“It’s not necessary,” said GOP Rep. Don Bacon of Nebraska, who is retiring next year after winning five elections in one of the most competitive House districts. “If that’s what it takes to get your point across, you’re not a good communicator.”\n\nThere are risks of overusing profanity\n\nThere also is a risk that if such language becomes overused, its utility as a way to shock and connect with audiences could be dulled. Comedian Jerry Seinfeld has talked about this problem, noting that he used swear words in his early routines but dropped them as his career progressed because he felt profanity yielded only cheap laughs.\n\n“I felt like well I just got a laugh because I said f—- in there,” he said in a 2020 interview on the WTF podcast with fellow comedian Marc Maron. “You didn’t find the gold.”\n\nWhite House spokesperson Liz Huston said Trump “doesn’t care about being politically correct, he cares about Making America Great Again. The American people love how authentic, transparent, and effective the President is.”\n\nBut for Trump, the words that have generated the most controversy are often less centered in traditional profanity than slurs that can be interpreted as hurtful. The final weeks of his 2016 campaign were rocked when a tape emerged of him discussing grabbing women by their genitals, language he minimized as “locker room talk.” His “shithole” remark in 2018 was widely condemned as racist.\n\nMore recently, Trump called a female journalist “piggy,” comments that his press secretary, Karoline Leavitt, defended as evidence of a president who is “very frank and honest.” Trump’s use of a slur about disabled people prompted an Indiana Republican whose child has Down syndrome to come out in opposition to the president’s push to redraw the state’s congressional districts.\n\nOn rare occasions, politicians express contrition for their choice of words. In an interview with The Atlantic published last week, Gov. Josh Shapiro, D-Pa., dismissed Harris’ depiction of him in her book about last year’s presidential campaign by saying she was “trying to sell books and cover her a—.”\n\nHe seemed to catch himself quickly.\n\n“I shouldn’t say ‘cover her a—,” he said. “I think that’s not appropriate.”","summary":"Leaders in both parties are openly using vulgarities.","url":"https://www.bostonherald.com/2025/12/10/political-profanity/","image":"https://www.bostonherald.com/wp-content/uploads/2025/12/Trump_30408_08229f-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-10 16:58:03","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.072},{"id":386881244,"title":"WTF? Embracing profanity is one thing both political parties seem to agree on","text":"By STEVEN SLOAN, Associated Press\n\nWASHINGTON (AP) — As he shook President Barack Obama’s hand and pulled him in for what he thought was a private aside, Vice President Joe Biden delivered an explicit message: “This is a big f——— deal.” The remark, overheard on live microphones at a 2010 ceremony for the Affordable Care Act, caused a sensation because open profanity from a national leader was unusual at the time.\n\nMore than 15 years later, vulgarity is now in vogue.\n\nDuring a political rally Tuesday night in Pennsylvania that was intended to focus on tackling inflation, President Donald Trump used profanity at least four times. At one point, he even admitted to disparaging Haiti and African nations as “ shithole countries ” during a private 2018 meeting, a comment he denied at the time. And before a bank of cameras during a lengthy Cabinet meeting last week, the Republican president referred to alleged drug smugglers as “sons of b——-s.”\n\nWhile the Biden incident was accidental, the frequency, sharpness and public nature of Trump’s comments are intentional. They build on his project to combat what he sees as pervasive political correctness. Leaders in both parties are seemingly in a race now to the verbal gutter.\n\nVice President JD Vance called a podcast host a “dips—t” in September. In Thanksgiving remarks before troops, Vance joked that anyone who said they liked turkey was “full of s—-.” After one National Guard member was killed in a shooting in Washington last month and a second was critically injured, top Trump aide Steven Cheung told a reporter on social media to “shut the f—- up” when she wrote that the deployment of troops in the nation’s capital was “for political show.”\n\nAmong Democrats, former Vice President Kamala Harris earned a roar of approval from her audience in September when she condemned the Trump administration by saying “these mother———- are crazy.” After Trump called for the execution of several Democratic members of Congress last month, Sen. Chris Murphy, D-Conn., said it was time for people with influence to “pick a f——— side.” Senate Democratic leader Chuck Schumer of New York said the administration cannot “f—- around” with the release of the Jeffrey Epstein files. Democratic Rep. Jasmine Crockett, who on Monday announced her Senate campaign in Texas, did not hold back earlier this year when asked what she would tell Elon Musk if given the chance: “F—- off.”\n\nThe volley of vulgarities underscore an ever-coarsening political environment that often plays out on social media or other digital platforms where the posts or video clips that evoke the strongest emotions are rewarded with the most engagement.\n\n“If you want to be angry at someone, be angry at the social media companies,” Utah Gov. Spencer Cox, a Republican, said Tuesday night at Washington National Cathedral, where he spoke at an event focused on political civility. “It’s not a fair fight. They’ve hijacked our brains. They understand these dopamine hits. Outrage sells.”\n\nCox, whose national profile rose after calling for civility in the wake of conservative activist Charlie Kirk’s assassination in his state, approved an overhaul of social media laws meant to protect children. A federal judge has temporarily blocked the state law.\n\nTough political talk is nothing new\n\nTough talk is nothing new in politics, but leaders long avoided flaunting it.\n\nRecordings from Democrat Lyndon B. Johnson’s administration, for instance, revealed a crude, profane side of his personality that was largely kept private. Republican Richard Nixon bemoaned the fact that the foul language he used in the Oval Office was captured on tape. “Since neither I nor most other Presidents had ever used profanity in public, millions were shocked,” Nixon wrote in his book “In the Arena.”\n\n“Politicians have always sworn, just behind closed doors,” said Benjamin Bergen, a professor at the University of California-San Diego’s Department of Cognitive Science and the author of “What the F: What swearing reveals about our language, our brains, and ourselves.” “The big change is in the past 10 years or so, it’s been much more public.”\n\nAs both parties prepare for the 2026 midterm elections and the 2028 presidential campaign, the question is whether this language will become increasingly mainstream. Republicans who simply try to imitate Trump’s brash style do not always succeed with voters. Democrats who turn to vulgarities risk appearing inauthentic if their words feel forced.\n\nFor some, it is just a distraction.\n\n“It’s not necessary,” said GOP Rep. Don Bacon of Nebraska, who is retiring next year after winning five elections in one of the most competitive House districts. “If that’s what it takes to get your point across, you’re not a good communicator.”\n\nThere are risks of overusing profanity\n\nThere also is a risk that if such language becomes overused, its utility as a way to shock and connect with audiences could be dulled. Comedian Jerry Seinfeld has talked about this problem, noting that he used swear words in his early routines but dropped them as his career progressed because he felt profanity yielded only cheap laughs.\n\n“I felt like well I just got a laugh because I said f—- in there,” he said in a 2020 interview on the WTF podcast with fellow comedian Marc Maron. “You didn’t find the gold.”\n\nWhite House spokesperson Liz Huston said Trump “doesn’t care about being politically correct, he cares about Making America Great Again. The American people love how authentic, transparent, and effective the President is.”\n\nBut for Trump, the words that have generated the most controversy are often less centered in traditional profanity than slurs that can be interpreted as hurtful. The final weeks of his 2016 campaign were rocked when a tape emerged of him discussing grabbing women by their genitals, language he minimized as “locker room talk.” His “shithole” remark in 2018 was widely condemned as racist.\n\nMore recently, Trump called a female journalist “piggy,” comments that his press secretary, Karoline Leavitt, defended as evidence of a president who is “very frank and honest.” Trump’s use of a slur about disabled people prompted an Indiana Republican whose child has Down syndrome to come out in opposition to the president’s push to redraw the state’s congressional districts.\n\nOn rare occasions, politicians express contrition for their choice of words. In an interview with The Atlantic published last week, Gov. Josh Shapiro, D-Pa., dismissed Harris’ depiction of him in her book about last year’s presidential campaign by saying she was “trying to sell books and cover her a—.”\n\nHe seemed to catch himself quickly.\n\n“I shouldn’t say ‘cover her a—,” he said. “I think that’s not appropriate.”","summary":"Leaders in both parties are openly using vulgarities.","url":"https://www.ocregister.com/2025/12/10/political-profanity/","image":"https://www.ocregister.com/wp-content/uploads/2025/12/Trump_30408_08229f-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-12-10 16:58:03","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.072},{"id":386876588,"title":"‘Taylor Swift Is a Nazi’ Claims Were Spurred by a Coordinated Bot Attack, Study Finds","text":"When Taylor Swift released her twelfth studio album, “The Life of a Showgirl,” in October, the album sparked record streams as well as an onslaught of criticism. While a portion of the online discourse it provoked was centered around whether or not the album was actually good, a parallel wave of attacks accused Swift and the album of promoting ultra-right-wing ideology.\n\nUsers across platforms claimed that the song “Wi$h Li$t,” in which Swift sings about her only wish being to settle down, was an implicit endorsement of MAGA values, even though the singer had publicly endorsed Trump’s opponent, former vice President Kamala Harris, in the 2024 election. Some even claimed that a line in the song, in which Swift sings “have a couple kids, got the whole block looking like you” in reference to her fiancé, football player Travis Kelce, had white supremacist connotations.\n\nAccounts also claimed that the lines “I’m not a bad bitch, and this isn’t savage” in the song “Eldest Daughter” and “sleepless in the onyx night, but now, the sky is opalite” from the song “Opalite” were racist digs at Kelce’s ex-girlfriend, who is black.\n\nOther posts even claimed that a necklace merch with lightning bolts on it was actually a Nazi dog-whistle for vaguely resembling “SS.”\n\nNow, according to new research from behavioral intelligence startup GUDEA, at least a good chunk of these online attacks were spurred by inauthentic social media accounts in what looks to be a coordinated attack on Swift’s reputation.\n\nGUDEA examined thousands of posts from 18,000 accounts across 14 social media platforms made in the first two weeks following the album’s release, to find that the “Taylor Swift is a Nazi” narrative was spurred by accounts that behaved like bots. The inauthentic narrative acted as a catalyst for authentic conversations, like one comparing Swift to self-proclaimed Nazi Kanye West.\n\nSurprisingly, though, it was the Swifties that inadvertently ensured that the attacks reached their intended impact. These false narratives were basically “rage bait” designed to provoke real users and strengthen the narrative’s visibility. So ultimately, it was established accounts and influencers that took the false narrative from the confines of the fringe corners of the internet to the mainstream conversation. Every time a fan interacted with the false claims to refute them, it only fed the narrative for the algorithm.\n\n“This demonstrates how a strategically seeded falsehood can convert into widespread authentic discourse, reshaping public perception even when most users do not believe the originating claim,” the researchers wrote, adding that the pattern is “a hallmark of successful narrative manipulation.”\n\nIt’s not clear who orchestrated the bot attacks or what they could be gaining from this. But the researchers did find significant overlap between the accounts that pushed the narrative and accounts involved in a reputational attack campaign on actress Blake Lively, who is in the middle of a sexual harassment and online smear campaign lawsuit against actor Justin Baldoni.\n\nGUDEA’s head of customer success, Georgia Paul, told Rolling Stone that the culprits could also be nefarious actors asking themselves, “If I can move the fan base for Taylor Swift —an icon who is this political figure, in a way— does that mean I can do it in other places?”\n\nUltimately, what the incident highlights is just how scarily close our new digital reality has come to the “dead internet theory.” Bots are flooding all corners of the web, and they are actively shaping our own experience of it.\n\nAccording to Cloudflare data, roughly 30% of all internet traffic is now bots. GUDEA founder and CEO Keith Presley’s estimate is even higher at 50%.\n\n“The internet is fake,” Presley told Rolling Stone on Tuesday.","summary":"Bots manipulated online discourse to convince people that Taylor Swift was MAGA.","url":"https://gizmodo.com/taylor-swift-is-a-nazi-claims-were-spurred-by-a-coordinated-bot-attack-study-finds-2000697793","image":"https://gizmodo.com/app/uploads/2025/12/shutterstock_2673688277-1200x675.jpg","video":null,"publish_date":"2025-12-10 16:30:06","author":"Ece Yildirim","authors":["Ece Yildirim"],"language":"en","source_country":"us","sentiment":-0.23},{"id":386875232,"title":"End Stage of Grief: Democrats Might Be Settling for the Best of the Worst","text":"The two biggest names in Democratic Party presidential circles are being swished around again, and while probably and arguably also the most laughable, the fact remains it's all they seem to have at the moment.\n\nThis fawning little number was in Democrat and decent guy Dan Turrentine's X feed yesterday.\n\nHe didn't write it, but did note that it confirmed things he'd been told earlier about the subject - Kamala Harris can't shake her aspirations to the throne.\n\nI have said it since late Spring, when I heard from two birdies in her orbit: @KamalaHarris badly wants to run again in 2028. https://t.co/gR7dlePc9N— dan turrentine (@danturrentine) December 9, 2025\n\nIt's really a love letter wrapped in news article camouflage.\n\nThere are gentle criticisms offset by the strangest affirmative adjective choices, and it is dripping with pathos. \n\n...But it has been a year since her loss to President Trump, the traditional period of mourning.Friends and allies swear she is more relaxed now. .On a recent long-form podcast, the likes of which she got so much heat for avoiding last year, Ms. Harris let fly a two-word phrase — rhyming with “bucket” — to describe her new ethos. . She is the first woman to serve as vice president, and., and she still defaults to acting as if every question is part of a deposition where answers can and will be used against her.\n\nUNLEASHED! LAWYERLY LANGUAGE REMAINS HER SAFE SPACE\n\nI guess that's how toney, lickspittle NYT reporters describe what we knuckle-draggers commonly called Kamala's 'word salad.'\n\nThey then thoughtfully provide an example of the former vice president's lawyerly language.\n\n...She has mostly been a bystander in the Democratic Party’s raging debate over its direction. Should Democrats veer to the left or center? More populism? More progressivism? Both? Neither? What exactly should the party stand for?\n\nGracious. That was deep.\n\nDeep but truly authentic Kamala word salad - yup.\n\nHarris is thrilled people are paying good money to line up and hear her word salads on this tour, and the Times points out only one other Democrat has had the drawing power in national tours that Harris enjoys - Bernie Sanders.\n\n She believes there should be a bust of her in Congress.\n\n...Ms. Harris has made clear she doesn’t “feel burdened” — yes, she still uses that phrase — by where she fits in the punditry pecking order or the polls or the cable chyrons. She is enjoying the freedom from what she calls the “transactional” constrictions of campaigning, of asking people for a vote.Her place in history is already secure, and she knows it.“I understand the focus on ’28 and all that,” she said in the interview. “\n\nHer sense of her own place in history is so secure that Harris even called the newly elected mayor of New York to advise him on how to fill his team and be an effective executive, having been so effective herself at every opportunity.\n\n.“,” she said of Mr. Mamdani, a 34-year-old democratic socialist, praising the excitement he has generated from younger voters.\n\nThe NYT authors don't point out that pinning down what exactly Harris's 'ideology' is is difficult thanks to her utter vacuousness and vapidity.\n\nAgain, they redefine Harris's space-cadet-like delivery and vagueness as 'elusive.' Isn't that a much prettier word?\n\nDamn near makes a questionable intellect mysterious instead of laughable.\n\nIn public and in private, she has been exploring issues of trust, misinformation, social media, community and artificial intelligence. She is particularly obsessed with young people and their growing disillusionment, which she shares.“,” she told Stephen Colbert in her first interview about her book. “”\n\nI believe Kamala Harris owes a portion of the $7M she made selling her email list to the DNC to these two reporters for the tongue bath.\n\nIs the country ready for a run at Word Salad Redux? You'll note I'm not asking if we want one - we won't have much choice if Democrats don't have much choice.\n\nStu Burguiere, discussing the article with Megyn Kelly - who howls over the 'historic' figure conceit - contrasts Harris's style (lawyerly, don't forget) with Jasmine Crocker, who blurts out every word the second it pops into her head.\n\nHarris, he says, is trying to do the exact opposite, just 'trying to survive, because she's not quick enough on her feet to come up with a real answer.'\n\nFor the moment, Harris is playing coy Hillary Clinton word games, and having surrogates make sure they use the terms 'white boys.'\n\n...Black voters, particularly in the South, have swung the party’s last two open presidential nominating contests. Ms. Harris has made a point of traveling through the South on her book tour. Her stop in Birmingham, Ala., was so popular that the venue added a second event.“” said Bakari Sellers, a former South Carolina legislator who has been an informal Harris adviser, referring to the governors of Pennsylvania and California and to Mr. Buttigieg, the former transportation secretary. “She is so important to so many people.”At the Ryman, \n\nGavin Newsom's name does pop up towards the end of the article.\n\nA 'very talented' California rival\n\nThat has to sting a smidge as does the recounting of the Newsom anecdote from Harris' book, where she'd called to ask for his endorsement and got a 'Hiking. Will call back' text. She says she never heard from him again, even though Newsom did quickly endorse her.\n\nWhy so catty in the book, then - Newsom wanted to know, too. So he says he asked her.\n\n...Mr. Newsom has questioned why the episode was included, given that he endorsed her so quickly. He texted Ms. Harris to ask her this after her book came out, he recounted recently to a video game streamer.“Anyway,” Mr. Newsom said with a laugh, “that’s the relationship.”\n\nThe love letter to the Word Salad Queen ends as love letters do - with a swoon over Harris' heroics.\n\nThe authors recount Harris's visit to Tennessee to support young legislators there who were being censured for disrupting the session with their antics while encouraging protestors storming the Capitol.\n\n....Ms. Harris, however, has a correction to that timeline.\n\nCan't you hear that in your head in that nasal delivery of hers?\n\n600K copies of her book have been sold, and venues have been packed for her appearances. This has to be tickling the ambitious fantasies of her 'very talented' California rival, who, coincidentally, has announced the release of a no doubt riveting memoir of his own next year.\n\nWhat a novel approach.\n\nAnd who, somehow, is enjoying an inexplicable tick-up in popularity at the moment that defies reality on the ground.\n\n amid rumors he could run for the Democratic nomination in 2028.The governor’s willingness to battle the president has made his popularity soar, with a new poll finding that Newsom’s overall approval rating is now at 56%, a 10% jump since June. Among Democrats in California, his approval rating is 82%., fueling new speculation about a 2028 presidential run.\n\nAnd Gavin Newsom promises pathos, having been born the poor child of black sharecroppers...or something close.\n\n...“” Newsom said in the announcement.The book release comes as Newsom is seeing a bump in approval after his attacks on Trump on social media, his forceful pushback against immigration raids and his successful November campaign for Prop 50, which allowed redistricting in California to counter Republican redistricting in other states.\n\nJust another proof point @GavinNewsom had the best 2025 of the 2028ers. Period. https://t.co/MVUaoatk8z— dan turrentine (@danturrentine) December 9, 2025\n\nI could swear this sticky Randall Flagg Lite wannabe was THE WORST if I didn't remember I'd just written 500 words or so about Kamala Harris right above that.\n\nAlthough I will give greasy Gavin the edge because he's actually been in charge of something and done nothing but botch it horribly for so long. Anything Harris was ever 'in charge of,' even as Attorney General, had other people doing the work for her (they never did find any trial transcripts where she was the lead attorney, I don't believe). As VP 'in charge' of borders or whatever, thankfully, she was a powerless embarrassment, not a legislative menace.\n\nMaybe I should change that headline to 'Avoiding the Worst of the Worst,' instead.\n\nAt HotAir, we’ve been dealing with real government suppression of free speech for YEARS. Despite the threats and consequences, we refuse to go silent and remain committed to delivering the truth.\n\nBut we can't do it without your support.\n\nPlease help Ed, David, John, and me continue fighting back against government censorship by joining our terrific HotAir VIP community today. Use promo code FIGHT to receive 60% off your membership.\n\nAnd thank you so much again for being here with us at HotAir.","url":"https://hotair.com/tree-hugging-sister/2025/12/10/end-stage-of-grief-democrats-might-be-settling-for-the-best-of-the-worst-n3809723","image":"https://media.townhall.com/cdn/hodl/2025/304/e2c9b9ce-7c4c-486d-bc39-d98ba6cd7f01.jpg","video":null,"publish_date":"2025-12-10 16:20:52","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","source_country":"us","sentiment":-0.116},{"id":386863136,"title":"Watch Jake Tapper Humiliate Jasmine Crockett With Her Own Words","text":"CNN anchor Jake Tapper confronted Democratic Texas Rep. Jasmine Crockett on Tuesday for previously saying that Latinos who voted for President Donald Trump have “slave mentality.”\n\nCrockett said in a Vanity Fair profile in December 2024 that this group of Latinos have a “slave mentality” and must hate themselves since Trump wants to deport illegal immigrants. During an interview on “The Lead with Jake Tapper,” Crockett denied saying they all have “slave mentality” and argued most of them likely do not support what Trump is doing.\n\n“‘The immigration thing has always been something that has perplexed me about this community … It almost reminds me of what people would talk about when they would talk about kind of like slave mentality and the hate that some slaves would have for themselves. It’s almost like a slave mentality that they have. Now about the time that that was published last year, around a million Latino voters in Texas were voting for Trump,'” Crockett told Vanity Fair. (RELATED: Jasmine Crockett’s Senate Campaign Going As Well As You’d Expect)\n\nAfter reading the quote, Tapper pointed out that a record-high number of Latinos voted for Trump.\n\n“Now about the time that that was published last year, around a million Latino voters in Texas were voting for Trump. Do they all have slave mentality?” Tapper asked. \n\n“No, and that’s not what that said at all, to be clear. It did not say that every Latino has that type of mentality,” Crockett said. “No, no, but slave, the ones that vote for people who believe in strong or Trump’s immigration policy. So, so I don’t believe that the people that voted for Trump believe in what they’re actually getting.” \n\nTrump achieved the highest share of the Latino vote ever recorded for a Republican nominee, winning approximately 46% to 48% in the 2024 election. He won the Latino male vote 54% to 44% against former Vice President Kamala Harris, according to an NBC News exit poll.\n\nCrockett launched her Senate campaign on Monday and claimed she can flip Texas blue. The congresswoman will attempt to unseat Republican Texas Sen. John Cornyn, who is running for reelection.\n\nThe senator-hopeful also stated on CNN that she does not need Trump voters to win the Senate seat.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Do they all have slave mentality?'","url":"https://dailycaller.com/2025/12/10/jake-tapper-jasmine-crockett-latinos-trump-slave-mentality/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F12%2FScreenshot-2025-12-10-at-10.48.51%E2%80%AFAM-e1765381790933.png","video":null,"publish_date":"2025-12-10 15:57:26","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","source_country":"us","sentiment":-0.163},{"id":386861666,"title":"Blaming Trump for affordability issue would be like blaming him for Afghan withdrawal: Marc Thiessen","text":"to top close Video This video is playing in picture-in-picture.\n\nVarney Co December 10, 2025 04:00 \n\n Blaming Trump for affordability issue would be like blaming him for Afghan withdrawal: Marc Thiessen \n Fox News contributor Marc Thiessen weighs in on President Donald Trump's economic speech in Pennsylvania, former Vice President Kamala Harris' remarks about her legacy and more on 'Varney & Co.'\n\nTags WHAT TO WATCHSHOWSVARNEY| LATEST EPISODESVARNEY AND COV-VIDEOSPOLITICSECONOMY","summary":"Fox News contributor Marc Thiessen weighs in on President Donald Trump&apos;s economic speech in Pennsylvania, former Vice President Kamala Harris&apos; remarks about her legacy and more on &apos;Varney &amp; Co.&apos;","url":"https://www.foxbusiness.com/video/6386283054112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/e0b3bcf6-ea91-4dc6-869a-fbe10c7b0210/6b9b61f1-e32b-407d-be82-226440cf800d/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-12-10 15:31:32","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.065},{"id":386868474,"title":"Tony Dokoupil Named New Anchor of “CBS Evening News ”","text":"Tony Dokoupil is getting a shift change. The CBS Mornings co-host is now boarding CBS Evening News as the program's new anchor, the network announced on Wednesday, Dec. 10.\n\n Dokoupil, 44, will anchor his first broadcast on Monday, Jan. 5, 2026 amid one of the first major lineup changes under editor-in-chief Bari Weiss. The TV journalist has co-hosted CBS Mornings alongside Gayle King and Nate Burleson since 2019 after joining CBS News in 2016.\n\n “After 20 years in journalism, traveling through all 50 states and talking with people in hundreds of far-flung American places, I realize why a country this big needs a show this ambitious,” Dokoupil said in a statement.\n\n He added, “The strength of our nation is that we benefit from fair reporting and the open discussion of all ideas. For more than 60 years, the Evening News has been a bedrock of that process. I’m honored to join a fearless team at this important moment, and with what I can promise is a commitment to trust and the plain truth.”\n\n CBS Mornings also shared the news on Wednesday, with Dokoupil telling King, 70, Burleson, 44, and Vladimir Duthiers that it’s “an amazing thing to say.” He added, “It’s been almost seven years that we’ve been doing this together and I am not joking that this has been the best job I have ever had in journalism. If things didn’t change around us, I would never change this.”\n\n “Until next year!” King quipped in response. She also noted that their co-host will remain on the program for the rest of the week.\n\n In her own statement shared by CBS News, Weiss, 41, called the new anchor \"the person to win\" back viewers' \"trust in the media,\" citing his \"old-school journalistic values.\" Saying that Dokoupil \"is what everyone wants in an evening-news anchor,\" CBS News president Tom Cibrowski added that he was \"authentic, compassionate [and] unafraid.\"\n\n The hire makes Dokoupil the sixth anchor of the broadcast in the last decade, following Scott Pelley, Jeff Glor, Norah O’Donnell, John Dickerson and Maurice DuBois, who announced his CBS Morning News exit on Thursday, Dec. 4 less than a year after taking over with Dickerson, 57. Dickerson announced his exit from CBS in October after 16 years.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n It was also announced that Matt Gutman has been named CBS News chief correspondent, with the former ABC News journalist set to start on the same days as Dokoupil.\n\n Gutman, 48, will report for CBS Mornings and CBS Evening News, where he will serve as a fill-in anchor for the broadcast. Additionally, he will also serve as a lead correspondent for 48 Hours and is slated to contribute to 60 Minutes. \n\n The staffing switch-up comes amid several changes at CBS News following Skydance’s $8 billion acquisition of Paramount, CBS' parent company. The merger came after CBS News settled a lawsuit with President Donald Trump, who accused 60 Minutes of deceptively editing former Vice President Kamala Harris' 2024 campaign trail appearance on the show.\n\n Paramount agreed to pay $16 million to the president's future presidential library. Initially, the lawsuit sought $10 billion in damages, and led to concerns over the precedent Paramount would set for media companies by giving into Trump's demands.\n\n Also in October, Weiss, best known for running the opinion website The Free Press, was named editor in chief of CBS News, despite having no experience running a news organization the size of CBS.\n\n “Tony’s superpower is listening to people. We want to serve Americans in the best way possible by meeting them where they are every night — and we’ll do that with this cross-country kick-off tour,” CBS Evening News executive producer Kim Harvey said in a statement on Wednesday.\n\n She added, “Tony knows what makes this country great and what challenges we face. I look forward to partnering with him to share America’s story every night.”\n\n During his tenure at CBS News, Dokoupil has interviewed the likes of JD Vance, Bill Gates, Harry Styles, Hillary Clinton and more.","summary":"Dokoupil will replace co-anchors Maurice DuBois and John Dickerson, who announced their departures earlier this year","url":"https://people.com/tony-dokoupil-named-new-anchor-of-cbs-evening-news-11865789","image":"https://people.com/thmb/fZM6Q1YqxLMadTO9MF-yZh3Z9kk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tony-dokoupil-cbs-mornings-121025-f0c7d79df5ac421e92dfddb74061d387.jpg","video":null,"publish_date":"2025-12-10 15:20:10","author":"Brenton Blanchet,Dave Quinn","authors":["Brenton Blanchet","Dave Quinn"],"language":"en","source_country":"US","sentiment":-0.098},{"id":386933694,"title":"Historia en elecciones de Miami: ganó una mujer, una canditata no hispana y además demócrata","text":"(LPL/EN) – La demócrata Eileen Higgins se convirtió el martes en la nueva alcaldesa de Miami con cerca de 60% de los votos tras imponerse en la segunda vuelta al republicano Emilio T. González, en unos comicios municipales que, pese a ser oficialmente no partidistas, se desarrollaron bajo la intensa sombra de la política nacional.Higgins se convierte así en la primera mujer y la primera persona no hispana en llegar a la Alcaldía de Miami, además de la primera demócrata elegida en 24 años para gobernar el municipio, históricamente dominado por republicanos cubanoamericanos, en un duro revés al partido del presidente Donald Trump.La demócrata, excomisionada del condado de 61 años, derrotó a González, de 68, quien había recibido el respaldo de Trump y del gobernador de Florida, Ron DeSantis, y logró 40,5% de los votos.\n\n“Esta noche, la gente de Miami hizo historia. Juntos dejamos atrás años de caos y corrupción y abrimos la puerta a una nueva etapa para nuestra ciudad – una marcada por liderazgo ético, responsable y enfocado en resultados reales para nuestra gente”, señaló Higging en un comunicado tras conocersen los resultados preliminares.La contienda atrajo atención nacional tras el intento republicano por extender a la ciudad de Miami el dominio electoral que consolidaron en 2024, cuando Trump ganó sorpresivamente el condado Miami-Dade por más de diez puntos frente a Kamala Harris.\n\nPara los demócratas, la victoria de Higgins representa un impulso simbólico y estratégico. El Comité Nacional Demócrata había concentrado esfuerzos en su campaña, y el senador Rubén Gallego viajó a Miami el fin de semana para respaldarla, en un momento en que el partido busca recuperar terreno en Florida tras años de retrocesos.La elección, sin embargo, se desarrolló en un contexto local complejo. Aunque el condado Miami-Dade se movió claramente hacia los republicanos en 2024, algunos reportes indican que en la ciudad de Miami Harris ganó por un margen mínimo, haciendo de esta contienda un termómetro clave para medir la capacidad demócrata de reconectar con un electorado cambiante.\n\nLa ciudad de Miami, con cerca de medio millón de habitantes, tiene una población hispana que ronda el 70 %.Higgins basó su campaña en enfrentar el aumento del costo de vida, mejorar los servicios municipales y reforzar la transparencia del gobierno local.En contraste, González, coronel retirado de la Fuerza Aérea y exdirector de Servicios de Ciudadanía e Inmigración de Estados Unidos (USCIS), centró su mensaje en seguridad pública, crecimiento económico y preparación ante emergencias, apoyado en su experiencia militar y administrativa.\n\nAmbos candidatos también reflejaron visiones opuestas sobre migración. González defendió las estrictas medidas del Gobierno de Trump, que en semanas recientes impuso nuevas restricciones para solicitar la ciudadanía a cubanos y venezolanos. Higgins calificó esas políticas de “inmorales”.La segunda vuelta se convocó después de que ninguno alcanzara más de 50% en las elecciones del 4 de noviembre, cuando Higgins obtuvo el 36 % de los votos y González 19%.\n\n History in Miami elections: a woman, a non-Hispanic candidate, and a Democrat was elected\n\n(LPL) – Democrat Eileen Higgins became Miami’s new mayor on Tuesday with nearly 60% of the vote after defeating Republican Emilio T. González in the runoff election. Despite being officially nonpartisan, the municipal elections were heavily influenced by national politics.\n\nHiggins thus becomes the first woman and the first non-Hispanic person elected mayor of Miami, as well as the first Democrat elected in 24 years to govern the city, historically dominated by Cuban-American Republicans. This represents a significant setback for President Donald Trump’s party.\n\nThe 61-year-old Democrat, a former county commissioner, defeated González, 68, who had received the backing of Trump and Florida Governor Ron DeSantis, and garnered 40.5% of the vote.\n\n“Tonight, the people of Miami made history. Together, we left behind years of chaos and corruption and opened the door to a new era for our city—one marked by ethical, responsible leadership focused on real results for our people,” Higgins said in a statement after the preliminary results were announced.\n\nThe race attracted national attention following the Republican attempt to extend to the city of Miami the electoral dominance they consolidated in 2024, when Trump surprisingly won Miami-Dade County by more than ten points against Kamala Harris.\n\nFor Democrats, Higgins’ victory represents a symbolic and strategic boost. The Democratic National Committee had focused its efforts on her campaign, and Senator Rubén Gallego traveled to Miami over the weekend to support her, at a time when the party is seeking to regain ground in Florida after years of setbacks.\n\nThe election, however, unfolded against a complex local backdrop. Although Miami-Dade County clearly shifted to Republicans in 2024, some reports indicate that Harris won the Miami mayoral race by a narrow margin, making this contest a key barometer for gauging the Democratic Party’s ability to reconnect with a shifting electorate.\n\nThe city of Miami, with nearly half a million residents, has a Hispanic population of around 70%. Higgins based his campaign on addressing the rising cost of living, improving municipal services, and strengthening local government transparency.\n\nIn contrast, González, a retired Air Force colonel and former director of U.S. Citizenship and Immigration Services (USCIS), focused his message on public safety, economic growth, and emergency preparedness, drawing on his military and administrative experience.\n\nBoth candidates also reflected opposing views on immigration. González defended the Trump administration’s strict measures, which in recent weeks imposed new restrictions on citizenship applications for Cubans and Venezuelans. Higgins called these policies “immoral.”\n\nThe second round was called after no candidate received more than 50% of the vote in the November 4 election, when Higgins won 36% of the vote and González 19%.","summary":"(LPL/EN) &#8211; La demócrata Eileen Higgins se convirtió el martes en la nueva alcaldesa de Miami con cerca de 60% de los votos tras imponerse en la segunda vuelta al republicano Emilio T. González, en unos comicios municipales que, pese a ser oficialmente no partidistas, se desarrollaron bajo la intensa sombra de la política nacional.Higgins [&#8230;]\n\n\nThe post Historia en elecciones de Miami: ganó una mujer, una canditata no hispana y además demócrata appeared first on La Prensa Latina Media.","url":"https://laprensalatina.com/historia-en-elecciones-de-miami-gano-una-mujer-una-canditata-no-hispana-y-ademas-democrata/","image":"https://laprensalatina.com/wp-content/uploads/2025/12/AFP__20251210__2251063815__v2__HighRes__MiamiToElectNewMayorInRunoffElectionTuesday-1280x853-1.avif","video":null,"publish_date":"2025-12-10 15:10:11","author":"Miguel","authors":["Miguel"],"language":"en","source_country":"cu","sentiment":0.372},{"id":386852780,"title":"Shocking update on student loan repayments weeks after Trump announced plans to cancel debt for millions","text":"Featured Image Credit: Mandel NGAN - Pool/Getty Images\nTopics: Donald Trump, Education, Joe Biden, US News, Money, Politics, Republicans\n\nCallum Jones\n\nChoose your content:\n\nan hour ago\n\nan hour ago\n\nPerson who called police on Bonnie Blue reveals why they did it as she now faces 15 years in prison\n\nBonnie Blue was raided by police after they got a tip\n\nan hour ago\n\nWhere to stream 95% rated drama series starring Knives Out actor as Wake Up Dead Man arrives in days\n\nViewers binged the series in a matter of hours\n\nan hour ago\n\nExpert warns that people should be wary of these 3 things if Trump's $2,000 tariff checks are actually approved\n\nThe president hopes that Americans will get the checks sometime next year\n\nan hour ago\n\nThe Rock's daughter 'hard launches' relationship with fellow wrestler in intimate social media post\n\nSimone Johnson admitted that she's fallen in love\n\nUniversity student president speaks out after being forced to resign over controversial comments about Barron Trump\n\nTrump blasts 'traitor' Marjorie Taylor Greene in scathing rant after explosive 60 Minutes interview\n\nTrump 'voids' Biden's last minute pardons after claim ex president made one crucial mistake when doing them\n\nKamala Harris blasts Trump administration after revealing surprising comment he made to her in private","summary":"![CDATA[The Trump administration claim Joe Biden 'sought to unlawfully shift student loan debt onto American taxpayers']]","url":"https://www.unilad.com/news/us-news/donald-trump-joe-biden-student-loan-update-884778-20251210","image":"https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/bltd1744612c23f4c0b/69398118ed85de817c7d34f0/trump-debt.jpg","video":null,"publish_date":"2025-12-10 15:02:19","author":"Callum Jones","authors":["Callum Jones"],"language":"en","source_country":"gb","sentiment":-0.021},{"id":386917452,"title":"Bringing up baby","text":"Skip to content\n\nWhite House\n\nEnergy/Environment\n\nHealth Care\n\nTransportation\n\nHeard on the Hill\n\nFintech Beat\n\nPolitical Theater\n\nDonald Trump\n\nDonald Trump Tweets\n\nWhite House Calendar\n\nWhite House Releases\n\nPress Seating Chart\n\nCorrespondents Dinner\n\nKamala Harris\n\nNewsletters\n\nCapitol Ink\n\nRoll Call e-Edition\n\nClassifieds\n\nRollCall logo\n\nSearch RollCall.com\n\nRollCall logo\n\nWhite House\n\nEnergy/Environment\n\nHealth Care\n\nTransportation\n\nHeard on the Hill\n\nFintech Beat\n\nPolitical Theater\n\nDonald Trump\n\nDonald Trump Tweets\n\nWhite House Calendar\n\nWhite House Releases\n\nPress Seating Chart\n\nCorrespondents Dinner\n\nKamala Harris\n\nNewsletters\n\nCapitol Ink\n\nRoll Call e-Edition\n\nClassifieds\n\nSearch RollCall.com\n\nHeard on the Hill\n\nBringing up baby\n\n (Tom Williams/CQ Roll Call)\n\nTom Williams\n\nPosted December 10, 2025 at 2:47pm\n\nFlorida Rep. Kat Cammack and her 4-month-old daughter, Augusta Dair, leave a House Republican Conference meeting in the Capitol on Wednesday.\n\nRecent Stories\n\nHouse votes overwhelmingly to pass compromise NDAA\n\nTrump administration launches ‘Gold Card’ visa website\n\nLawmakers hold hope for health care even with partisan Senate votes\n\nModerate House Republicans look to force vote on ACA tax credits\n\nThese are the key Texas races for Congress in 2026\n\nThe Capitol is hard to navigate. Does it have to be?\n\nThe Source for news on \nCapitol Hill since 1955\n\nNewsletters\n\nSubscriptions\n\nCQ and Roll Call are part of FiscalNote, a leading provider of political and business risk solutions. Copyright 2025 CQ and Roll Call. All rights reserved.","url":"https://rollcall.com/2025/12/10/bringing-up-baby/","image":"https://rollcall.com/app/uploads/2025/12/house_gop_465_121025.jpg","video":null,"publish_date":"2025-12-10 14:47:21","author":"Posted December 10, 2025 At 2:47pm","authors":["Posted December 10, 2025 At 2:47pm"],"language":"en","category":"politics","source_country":"us","sentiment":0.009},{"id":386875222,"title":"Too Good to Check: Did the NRSC Deke Dems Into Clearing the Field For Crockett?","text":"Let me start with a disclaimer: I do not for one second believe this rumor to be true. It's not that the strategy would be bad; it's that it's too good for the GOP to pull off. Think Todd Akin, only in California or Massachusetts. \n\nUnless Claire McCaskill has switched sides and now does strategy for the National Republican Senatorial Committee (NRSC), color me skeptical about this report from NOTUS. Deeply skeptical:\n\nThe National Republican Senatorial Committee put out a poll in July with Crockett’s name included, which showed her as the leading Democrat in a hypothetical matchup.“When we saw the results, we were like, ‘OK, we got to disseminate this far and wide,’” a source familiar with the process told NOTUS. The fact that Crockett was included in the poll was no accident.In June news broke that Texas Democrats Colin Allred, James Talarico, former Rep. Beto O’Rourke and Rep. Joaquin Castro met to discuss the 2026 election. Operatives at the NRSC realized that Crockett — whose political stock had been rising — wasn’t included in that meeting and also hadn’t been included in any credible poll. So they decided to change that.Following the NRSC’s polls, other surveys began to include Crockett and showed similar results: She was surging in the primary.\n\nAccording to their sources at the NRSC, the manipulation didn't end there. The NRSC then started \"seeding\" the poll results into \"progressive spaces,\" which not only raised Rep. Jasmine Crockett's profile but also apparently convinced Crockett herself that she could win the election. That snowballed into this week, when a candidate that might have competed well enough to make Republicans nervous after their own bruising primary – Colin Allred – decided to withdraw in Crockett's favor.\n\nOr so these NRSC sources claim. \n\nIs this true? Is it even possible? Well, McCaskill certainly proved it possible in 2012, but this situation is a little different. Akin was less of a national figure at the time than Crockett is now, which means that Crockett's radical nature is already well known. (Akin's issue was more a lack of preparation for the big step up to the scrutiny a Senate race produces.) Crockett had already become a popular leading figure among progressive activists. Perhaps the NRSC kicked a stone or two to start an avalanche, but some of the rocks had been shifting for the last couple of years. \n\nAlso, the panic suggested by NOTUS and other media outlets over the upcoming GOP primary fight may be overblown. Without a doubt, John Cornyn faces the fight of his life against Ken Paxton, a MAGA favorite. RCP has aggregated three polls in this race, and all three show a dead heat between the two, with former House Republican Wesley Hunt suddenly getting a significant amount of support, too. However, the primary will take place in March, which leaves the Texas GOP plenty of time to heal up any divisions that will open up over the next three months before the voting starts in the general election. \n\nDonald Trump beat Kamala Harris by 14 points last November. Ted Cruz beat Allred by nine points in 2022. The Senate race will not be a special election; Texans will be prepared to turn out and will still be decisively Republican, not suddenly blue. This isn't a case where a purple state could produce surprises, and the Lone Star State certainly isn't the Big Apple, even if Crockett seems confused by the difference:\n\nRep. Jasmine Crockett, D-Texas, pointed to Mamdani-Trump voters, AOC-Trump voters and Obama-Trump voters when confronted Tuesday on her difficult path to victory in the Texas Senate race.MS NOW host Chris Hayes asked Crockett about people who question her ability to win the \"8 to 10% of Republican voters necessary to win this race,\" who cited the voters who supported both President Donald Trump and Democrats like Zohran Mamdani, Alexandria Ocasio-Cortez and former President Barack Obama.Crocket, who launched her Texas Senate bid on Monday, disagreed with the notion that she needs to win over a percentage of Republican voters and said she hoped to energize her base in a way Democratic candidates have failed to do in the past.\"I don’t think anyone who is super in love with Trump would ever vote for me or any other Democrat. That is just the reality. I think what it is, is who is going to talk to people and make them understand that they will fight for them. That is why you have Mamdani-Trump voters. That is why you have AOC-Trump voters. That is why you had Obama-Trump voters,\" she told Hayes.\n\nEr ... AOC-Trump voters? Ocasio-Cortez won her NY-14 seat last year by 69.2/30.8. Kamala Harris won that district by a 65/33 split. If there were any AOC-Trump votes, you could probably cast those on your fingers and toes. The slight difference in percentage may be largely accounted for by voters who declined to mark their ballots in one election or the other. Even if one assumes that the difference is entirely attributable to voters who chose both AOC and Trump, though, that would be voters in a very, very radical-Left district. The notable point about those votes wouldn't be MAGAs who voted for AOC, but Democrats who couldn't stomach Harris. \n\nAnyway, I hope I'm wrong about the NRSC, and that they have truly learned to play McCaskill's game at Machiavellian levels. I'm more inclined to think they got lucky that Democrats decided to get stupid. Frankly, I'll take either explanation. \n\nEditor’s Note: Every single day, here at Hot Air, we will stand up and FIGHT, FIGHT, FIGHT against the radical left and deliver the conservative reporting our readers deserve. Sometimes, however, we just point and laugh, and let the radical Left embarrass itself. This is one of those times.\n\nHelp us continue to point, laugh, and expose the idiocy of progressive elites. Join Hot Air VIP and use promo code FIGHT to get 60% off your membership!","url":"https://hotair.com/ed-morrissey/2025/12/10/too-good-to-check-did-the-nrsc-deke-dems-into-nominating-crockett-n3809719","image":"https://media.townhall.com/cdn/hodl/2023/310/e90722bb-d3a2-4859-8263-cb27780ad46b.jpg","video":null,"publish_date":"2025-12-10 14:20:32","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","source_country":"us","sentiment":-0.318},{"id":386864848,"title":"Miami elects its first Democratic mayor in nearly 30 years","text":"Miami has elected its first Democratic mayor in almost 30 years. Former county commissioner Eileen Higgins won Tuesday’s runoff election, a closely watched race that drew attention from national political figures, including President Donald Trump.\n\nUnofficial results from Miami-Dade County show Higgins winning 59% of the vote, according to The Washington Post. She defeated Emilio González, a former Miami city manager, who received nearly 41%.\n\nIn a victory statement, Higgins said: “Tonight, the people of Miami made history. Together, we turned the page on years of chaos and corruption and opened the door to a new era for our city — one defined by ethical, accountable leadership that delivers real results for the people.” \n\nFederal backing\n\nThough Miami’s mayoral election is technically nonpartisan, it drew attention from big-name politicians.\n\nFormer Transportation Secretary Pete Buttigieg offered support for Higgins. While Trump and Florida Gov. Ron DeSantis backed González, with the president saying he’s “fantastic” and calling the election an “important race.”\n\nSignificance of the race\n\nWith Higgins’ victory, she becomes not only the first Democratic mayor in nearly three decades, but she’s also the first woman mayor in the history of Miami and the first non-Hispanic mayor since the 1990s. \n\nHer victory represents a shift in South Florida politics. Democrats have seen a string of competitive showings this year, including close contests in traditionally Republican districts. Still, strategists from both parties cautioned against reading the Miami results as a sign that nearby congressional seats are likely to flip in 2026.\n\nPolitics in Miami\n\nMiami’s recent political trajectory has leaned increasingly Republican. In 2024, Kamala Harris narrowly defeated Trump in Miami, a steep drop from Joe Biden’s 19-point margin in 2020.\n\nRepublicans DeSantis and Sen. Marco Rubio won decisively in Miami-Dade in 2022, breaking a longtime Democratic stronghold.\n\nIn 2024, Trump became the first Republican presidential candidate in 36 years to win Miami-Dade County. The president is now planning to build his presidential library in Miami. \n\nHiggins’ victory interrupts that trend — at least at the local level — returning the mayor’s office to Democratic control for the first time since the mid-1990s.\n\nThe post Miami elects its first Democratic mayor in nearly 30 years appeared first on Straight Arrow News.","url":"https://muvitv.com/2025/12/10/miami-elects-its-first-democratic-mayor-in-nearly-30-years/","image":"https://muvitv.com/wp-content/uploads/2025/12/AP25344035489895_Lynne_Sladky__The_Associated_Press_clean-daUl2i.jpeg","video":null,"publish_date":"2025-12-10 14:14:40","author":"Muvi","authors":["Muvi"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.088},{"id":386861028,"title":"Mark Kelly Says He’s “Been Through Harder Things” Than Pete Hegseth’s Attacks","text":"Raised in northern New Jersey, Kelly has for 17 years lived in Arizona, the state he now represents as a Democratic US senator. In between, Kelly was an astronaut who made four trips into space and a Navy pilot who flew 39 combat missions over Iraq. That military background has now put Kelly into Trump’s crosshairs. Last month, as the president gleefully cheered on the bombing of boats allegedly running drugs from Venezuela, Kelly appeared in a video to remind US troops they have a duty to refuse illegal orders.\nTrump was furious. He called for the Democrats to be jailed and railed that the video was “SEDITIOUS BEHAVIOR, punishable by DEATH!”\nThe idea for the message had originated with Michigan senator Elissa Slotkin, a former CIA analyst, and the video included four other members of Congress who served in the military or in US intelligence agencies. But Kelly has become the prime target for retribution because he retired as a Navy captain—and could be recalled to active duty and punished. Hegseth announced he was launching a probe into Kelly to determine whether Kelly had violated military law, with the results due December 10—even though in 2016, Hegseth publicly made essentially the same point about refusing illegal orders.\nThe 61-year-old Kelly is unfazed, even though he has been besieged by graphic death threats ever since Trump’s attack and has hired private security guards for his own protection. “He is not intimidating me, and he’s not going to,” Kelly says. “I have been through, you know, harder things than this.” Chief among them is the assassination attempt that led to Kelly running for office in the first place: In 2011 his wife, Arizona Democratic congresswoman Gabby Giffords, was shot in the back of the head during a constituent meeting, violence that erupted amid escalating political rhetoric.\n“I sat next to my wife’s hospital bed for months, without any idea of how it was gonna turn out,” Kelly says. “Most people don’t survive that kind of wound.” Giffords barely did. In 2020, he ran in, and won, a special election squeaker to fill the remainder of the late John McCain’s Senate term. Kelly was elected again, to a full term, in 2022.\nThe primary audience for the video, Kelly insists, is the enlisted men and women who are on the front lines of Trump’s belligerent agenda, and who could be vulnerable to prosecution for war crimes. “They’re going to be under tremendous pressure to do something they will later regret, that they might find was not lawful,” Kelly says. And while the action is in the Caribbean Sea right now, the senator is concerned it could shift into American cities. “[Trump] talks about sending the military to train on US citizens, and people think, ‘Oh, well, he’s not going to do it. It’s just Trump being Trump.’ That’s how we got here,” Kelly says. “We know who Donald Trump is, right? We knew who he was even when he was running for office the first time. This is a guy who talked about killing—killing—women and children. He said we should have the military kill the family members of terrorists. You know, you can't put that shit back in the donkey.”\nWhich is one reason the video statement by Kelly and his colleagues has resonance beyond any literal battlefields. For decades, conventional wisdom ceded national security, as a political issue, to the Republicans. But that’s been slowly changing. Recent, prominent examples include wins last month for Democrats Mikie Sherrill (a former Navy officer) and Abigail Spanberger (a former CIA officer) in gubernatorial races (in New Jersey and Virginia). Democrats are recruiting more veterans to run elsewhere as part of an appeal beyond the coastal elites. “Voters trust veterans,” says Matt Corridoni, a Democratic strategist who has worked with vet candidates. “They're not afraid to go out there and reclaim patriotism and reclaim the flag, and they do it with a level of authenticity and credibility that your standard politician doesn't have.”\nLast year, Kelly was one of three finalists—along with Pennsylvania governor Josh Shapiro and Minnesota governor Tim Walz—in Kamala Harris’s search for a running mate. “That would have been fun,” Kelly says now. “I think the election would probably have had the same outcome, unfortunately.” Currently, Kelly barely shows up in polling about the 2028 Democratic presidential nomination—but it’s still early. “I like that Kelly is out there and he’s not just taking it from the president,” says Rebecca Pearcey, who was a top strategist for Elizabeth Warren’s 2020 primary bid. “He’s fighting back when Democrats have lost some energy because it’s so exhausting.”\n“He’s got a weighty and appealing resume, and the field is going to be wide open,” another veteran Democratic presidential campaign strategist stays. “Why wouldn’t he take a shot?”\nWhen I tell Kelly that a friend suspects he’s already running—because she receives more fundraising emails from him than anyone else—the senator laughs. “I’m not the lead fundraiser. I hire people to figure that stuff out for me,” he says. “I’ve got a lot on my plate right now. Apparently tomorrow the Navy is supposed to say something about my court martial.” He lets out another, tighter laugh. “Trump is not gonna scare me,” Kelly says. “He's a wannabe authoritarian, and we've gotta make sure he doesn't get there.”","summary":"In an interview, the Arizona senator says the defense secretary “is not intimidating me, and he’s not going to”—though he’s less forthcoming about a potential 2028 presidential run.","url":"https://www.vanityfair.com/news/story/mark-kelly-pete-hegseth-investigation-interview","image":"https://media.vanityfair.com/photos/693976b9a348c67d922bd563/16:9/w_3360,h_1890,c_limit/2167175727","video":null,"publish_date":"2025-12-10 13:36:17","author":"Chris Smith","authors":["Chris Smith"],"language":"en","source_country":"US","sentiment":-0.092},{"id":386844632,"title":"Harris says she remains confident in her legacy as &#8216;historical figure&#8217;","text":"Former Vice President Kamala Harris, the Democratic candidate for president in 2024, said she has reached a point in her public life where she no longer feels pressured to secure her place in history. (EVAN VUCCI/AP FILE)\n\nBy Elaine Mallon | Sinclair National DeskPUBLISHED: December 10, 2025 at 8:25 AM EST \n\nGetting your Trinity Audio player ready...Former Vice President Kamala Harris, the Democratic candidate for president in 2024, said she has reached a point in her public life where she no longer feels pressured to secure her place in history. \n\n Subscribe to continue reading this article.\n\n Already subscribed? To log in, click here. \n\nShare this:\n Click to share on Facebook (Opens in new window)\n Facebook\n\n Click to share on X (Opens in new window)\n\n Click to share a free article with a friend\n\n GIFT THIS ARTICLE\n What is article sharing?\n\n Subscribers are entitled to 10 gift sharing articles each month. These can be shared with friends and family who are not subscribers.\n\n Subscribe now! or Sign in to your account.\n\n Subscribe\n Log in\n\nRevContent Feed\n\nAround the WebThe Latest Knee Pain Device Seniors Wish They Knew About SoonerRejuvaKneeFamilies Say This $34 Puppy Toy Gets More Use Than Most Big Ticket Gifts!ConsumerWorldWhy This 250th Anniversary Hat is Selling out Fast PeoasisHere's What Gutter Guards Should Cost if You Qualify for Senior RebatesLeafFilter PartnerThis Tiny Hearing Aid is Changing Lives - and It’s Under $100Oricle HearingCouple Spends $1.7 Million on MotorhomeViralnovaExperience Daytime Visibility at NightpeoasisNeurologist: 97% of People With Neuropathy Don't Know This Crucial ThingNeuropathyGuideTrending Now: Woodland Charm Christmas Ornaments Winning Hearts in Council Bluffs!GlosrityNeurologists: 1/2 Cup Each Morning Relieves Neurоpathy Quickly! (Try It)Health HeadlinesNighttime Driving Feels Like Daytime! See Clearly With These Headlight GlassesPeoasisThese Companies Are Probably Overcharging You for Home InsuranceYour Senior SavingCrystalize Your Pet in a Stunning, Custom 3D Crystal Keepsake!ArtPix 3DGet Your Paws on These Animal Socks!peoasisHere's The Estimated Cost of a 1-day Gutter Guards InstallationLeafFilter PartnerTake a Look Inside Keanu Reeves's Mansion in Council BluffspowerplaygamesMedication for Managing Blood PressureGoodRxHere's The Estimated Cost of a 1-day Walk-in Shower UpgradeHomeBuddy23 Ridiculously Cool Gadgets You'll Want to Buy ImmediatelyTrending GadgetThis Cordless Lamp is The Most-Loved Gift of The YearCasekisWhy Homeowners Are Preparing for Another Power Spike Soon (Watch)Energy SystemsGreta Thunberg's House Shocks The Whole World, The Proof In PicsLil Mario GameFinally – Affordable Jewelry That Looks ExpensiveCarla's Jewelry1 Simple Hack to Cut Your Electric Bill (Try Tonight)GadgetCyno","url":"https://www.baltimoresun.com/2025/12/10/harris-says-she-remains-confident-in-her-legacy-as-historical-figure/","image":"https://www.baltimoresun.com/wp-content/uploads/2025/07/Harris_68760-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-10 13:25:46","author":"Elaine Mallon","authors":["Elaine Mallon"],"language":"en","source_country":"us","sentiment":0.425},{"id":386821630,"title":"Time’s 2025 Person of the Year should be an obvious choice: Charlie Kirk","text":"So, basically, three of the five frontrunners are either AI itself or someone AI-adjacent, like Altman and Huang. Pope Leo would be good for selling magazines (new popes in the past have outperformed on that front). And Mamdani would certainly appease Time’s readership, which is profoundly liberal at this point. \n\nBut it’s also obvious that President Donald Trump should always be a top consideration every year as long as he’s president, given the award is about who has had the strongest impact on history or who represented the year most, according to Time’s own criteria. Given how impactful the first year of Trump’s second term has been, it is an easy case to make: He essentially closed the border, is carrying out mass deportations, ignited a tariff war resulting in better trade deals for the United States, and made his tax cuts permanent. Gas prices are at four-year lows, Iran’s nuclear capabilities have been decimated, and the peace deal in Gaza is holding. That’s a strong impact on history. \n\nAll of that said, the late Charlie Kirk is the best choice for this award posthumously. His assassination was the first major political assassination in this country since the 1960s. The Turning Point USA movement, which Kirk began at age 18, has resulted in millions of followers. And his death, leaving a wife and two very young children behind, has spurred more than 120,000 new Turning Point USA chapter requests across the country. \n\nBack to impact. Kirk has been the most googled name of the year, even surpassing Trump, who rightly won the award in 2024 for winning back a presidency few thought he could following the 2020 election. Per Fox News, “faith leaders report a 15% rise in church attendance as young people inspired by Charlie Kirk turn to Christianity.” Bible sales have also skyrocketed, with a reported 36% increase after Kirk’s death in September, when compared to the same time one year ago. “Get married. Have children. Build a legacy. Pass down your values. Pursue the eternal. Seek true joy,” Kirk often preached. And his followers appear to share the same values. Per a recent NBC News poll among those aged 18 to 29, young men who voted for Trump list having children as being most important to their personal definition of success. Also among the top 10 are being married, being spiritually grounded, making family and community proud, and using talents and resources to help others. \n\nHowever, among women who voted for then-Vice President Kamala Harris, having a fulfilling job/career is listed as most important at 51%, with having money to do things you want as second at 46%. You have to go all the way down to 9th on the list to find being grounded spiritually, and 11th to find being married as a top priority (just 6%), which is tied with having children. \n\nRecent census data backs up this sentiment from women on the Left, which shows that the number of children per family is falling to below two (1.9) for the first time. And a study released by Morgan Stanley shows that nearly half the female population aged 25 to 44 will be single and childless in this country by 2030. \n\n“Having children is more important than having a good career. … My kids matter more than how many social media followers I have,” Kirk told Fox’s Laura Ingraham earlier this year. But contrast that with what possible Democratic presidential nominee Rep. Alexandria Ocasio-Cortez (D-NY) has said about having children, or in this case, not having children. \n\n“Our planet is going to hit disaster if we don’t turn this ship around, and so it’s basically like, there’s a scientific consensus that the lives of children are going to be very difficult,” Ocasio-Cortez said in an Instagram Live video in 2019 while chopping food in her kitchen. “And it does lead, I think, young people to have a legitimate question, you know, ‘Is it OK to still have children?’”`\n\nOcasio-Cortez, who has been engaged for more than three years and has no children, would go on to predict that “the world will end” by 2031 if trillions aren’t spent to address climate change. Given her massive social media following, it appears more than a few of her supporters are actually taking this ridiculous warning seriously. \n\nHarris, who also has no biological children of her own, latched onto this sentiment during her recent book tour. Young adults are “experiencing what they’ve coined ‘climate anxiety’, which is their fear that because of changes in extreme weather, the future of their lives is very much at stake,” she stated. \n\nIn a related story, her presidential campaign spent more than $12 million on private jets during its 107-day campaign last year. \n\nWithout family, as Kirk often stressed, society crumbles. You can’t pass along wisdom to a younger generation if that generation doesn’t exist. The joy of family is replaced by doom scrolling through social media to fill the hours. And the association between being single past the average marriage age and depression is very real, with the National Institutes of Health studies showing clear links to suicidal ideation and mood disorders. \n\nThe most important institution in society is the family. If we lose the family, we lose everything,” Kirk once declared. And more than his political beliefs or support of Trump, his preaching of family and faith will be his most lasting legacy and therefore should absolutely warrant Time’s attention, but it undoubtedly won’t due to the magazine’s unabashed liberal bent. \n\nOver the years, the magazine has made some truly ludicrous choices in this regard. In 1988, the choice was “The Endangered Earth.” \n\n“Now, more than ever, the world needs leaders who can inspire their fellow citizens with a fiery sense of mission, not a nationalistic or military campaign, but a universal crusade to save the planet,” Time said back then. Thirty-seven years later, Earth appears to be doing just fine. \n\nGreta Thunberg was also Time’s person of the year in 2019, in the same vein, at just 16 years old. \n\n“We are in the beginning of a mass extinction, and all you can talk about is money and fairy tales of eternal economic growth!” she said in 2019 to the United Nations General Assembly. “How dare you!” \n\nHow’s that mass extinction coming along, Greta? Six years later, she has ditched being a climate alarmist and instead is focusing on the “genocide” in Gaza. \n\nThe following year, Time broke its own rule of choosing a singular person or entity in selecting both Joe Biden and Harris to be politically correct. In past years, when selecting newly elected presidents from Kennedy to Nixon to Carter to Reagan to Papa Bush to Clinton to Bush 43 to Obama to Trump, never once was the vice president also included. Go figure. \n\nTime magazine is a shell of what it once was. Person of the year used to carry some serious weight, and perhaps it still does on the Left. \n\nOCT. 7TH COMMUNITIES: STILL MOURNING BUT BEGINNING TO REBUILD\n\nBut any objective person with no skin in the game would be hard-pressed to find an argument not to choose Kirk. \n\nBut this award is more about politics and business than anything else, much like the rest of legacy media these days.","summary":"In Focus delivers deeper coverage of the political, cultural, and ideological issues shaping America. Published daily by senior writers and experts, these in-depth pieces go beyond the headlines to give readers the full picture. You can find our full list of In Focus pieces here. Time magazine will award its Person of the Year soon. [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3911965/time-magazine-2025-person-of-the-year-charlie-kirk/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/10/AP25253676809293.jpg?w=696","video":null,"publish_date":"2025-12-10 13:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","source_country":"US","sentiment":0.3},{"id":386926240,"title":"This Green Queen Raised a Million Bucks for Charity by Hiking 100 Miles in Drag","text":"This story was originally published by the Guardian and is reproduced here as part of the Climate Desk collaboration.\n\nPattie Gonia, the drag queen and environmentalist, arrived in San Francisco on Friday afternoon and crossed the Golden Gate Bridge with $1 million more than when she set out on her journey last week.\n\nThe diversity and inclusion advocate completed the 100-mile trek from Point Reyes national seashore to San Francisco in full drag with her voluminous red wig and smokey eye. The effort was part of a campaign she launched to raise $1 million for eight nonprofits that aim to expand access and make the outdoors a more “equitable place.”\n\n“Don’t let anyone ever tell you that you can’t make a difference,” she wrote on social media after completing the journey. “When I started being Pattie, everyone told me I was crazy. When I told people I wanted to do this fundraiser, [they] laughed in my face.\n\n“Seven years later and I hope I can be a little bit of proof to you that combining who you are and what you’re good at to fight for the change you want to see in the world works.”\n\nPattie Gonia has become one of the most visible drag queens in the US in recent years. In 2024, Donald Trump’s campaign used footage of her with Kamala Harris as part of an attack ad against the then vice-president. Earlier this year she helped organize a demonstration at Yosemite, where LGBTQ+ climbers hung a trans pride flag on El Capitan.\n\n“We flew the Trans pride flag in Yosemite to make a statement: Trans people are natural and Trans people are loved,” she said in a statement at the time. “We are done being polite about Trans people’s existence. Call it a protest, call it a celebration—either way, it’s giving elevation to liberation.”\n\nRecently, she playfully challenged the US defense secretary, Pete Hegseth, to a pull-up competition in a video that contrasted footage of her lifting herself with ease with video of Hegseth appearing to struggle through the exercise.\n\nFor the last week, she was on a solo trek on the California coast, getting in drag daily and setting up camp each night, while filming videos documenting the journey. She is set to perform her final show of the year in San Francisco on Saturday, “That is, if I can make it in time,” she said. Video posted to social media on Friday evening showed her strutting across the Golden Gate Bridge and ending her journey with cake.\n\nBy Friday, a GoFundMe for the project had raised more than $1 million from almost 35,000 individual donations.","summary":"This story was originally published by the Guardian&#160;and is reproduced here as part of the&#160;Climate Desk&#160;collaboration. Pattie Gonia, the drag queen and environmentalist, arrived in San Francisco on Friday afternoon and crossed the Golden Gate Bridge with $1 million more than when she set out on her journey last week. The diversity and inclusion advocate completed the [&#8230;]","url":"https://www.motherjones.com/politics/2025/12/environmentalist-drag-queen-pattie-gonia-raises-million-dollars-charity-hike-100-miles/","image":"https://www.motherjones.com/wp-content/uploads/2025/12/GettyImages-2221286163.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-12-10 12:30:00","author":"Dani Anguiano,Schuyler Mitchell","authors":["Dani Anguiano","Schuyler Mitchell"],"language":"en","source_country":"US","sentiment":0.483},{"id":386868924,"title":"Fact-checking Trump’s Pennsylvania speech and his Politico interview","text":"United States President Donald Trump spoke to US news outlet Politico in an interview at the White House on Monday, during which he made several strong claims about the state of the economy, the threat he claims is posed by drug gangs in Venezuela, and his popularity among Black Americans.\n\nThen, a day later, Trump spoke about immigration and affordability at a rally-style speech, which lasted for 90 minutes in Pennsylvania, during which he launched a scathing attack on Ilhan Omar, the US’s first Muslim congresswoman, who he claims is in the country illegally.\n\nWe fact-check some of the claims Trump made during the interview and the speech.\n\nClaim: Trump inherited the ‘worst inflation in history’, the economy is thriving now\n\nDuring the Pennsylvania rally, Trump claimed that he had inherited the “worst inflation in the history of our country” from former president, Democrat Joe Biden.\n\nIn the Politico interview, Trump said: “I inherited a mess. I inherited a total mess. Prices were at an all-time high when I came in.”\n\nHe also told Politico: “If you think of gasoline a gallon, they had it at $4.50, almost $5.00. You go to some of the states, you had it at $6.00. We hit, uh, three states two days ago, $1.99 a gallon.”\n\nPhiladelphia-based nonprofit Factcheck.org wrote in January this year that while inflation did rise under Biden, Trump did not, in fact, inherit the “worst inflation” in history.\n\nThe annualised inflation rate was below 3 percent during the six months before Trump took office in his second term.\n\nThe organisation explained the rise in inflation under Biden was partly down to the economic damage caused by the COVID-19 pandemic.\n\nAccording to Factcheck.org, the Consumer Prices Index (CPI) rose from 5.4 percent to 9.1 percent in the 12-month period ending in June 2022. But this was far from the worst the US has experienced. That was in the aftermath of World War I, when inflation hit 23.7 percent in June 1920.\n\nIn March 1980, inflation hit 14.8 percent, marking one of the most severe spikes in consumer prices in modern US history.\n\nTrump’s statements about petrol prices are also slightly misleading.\n\nIn the US, the average price of petrol – called “gas” in the US – was $3.05 per gallon (3.8 litres) in November this year, according to the US Energy Information Administration (EIA). According to online marketplace Choose Energy, the cost per gallon ranged from $2.41 in Oklahoma to $4.53 in California as of December 3.\n\nThe $1.99 price cited by Trump applies to isolated low-price stations in certain states and does not reflect a general statewide average.\n\nClaim: Ilhan Omar is in the US illegally\n\nDuring the Pennsylvania rally, Trump launched an attack on Ilhan Omar, the Democrat who has served as a Minnesota representative in Congress since 2019.\n\nWhile bemoaning immigration to the US by people from Somalia and other countries, he claimed that Omar is in the US illegally.\n\n“I love this Ilhan Omar, whatever the hell her name is. With her little turban. I love her. She comes in, does nothing but bitch. She’s always complaining. She comes from her country, where, I mean, it’s considered about the worst country in the world,” Trump said to a crowd of supporters, who roared with applause.\n\n“We gotta get her the hell out,” he said. “She married her brother in order to get in, right … she married her brother to get in, therefore she’s here illegally.”\n\nThe crowd of supporters at the rally started chanting “Send her back!”\n\nTrump also claimed that Somalia has no military, parliament or police. “They police themselves, they kill each other all the time.”\n\nFirst, Somalia does have a military, a parliament and a police force.\n\nWhile Omar was born in Mogadishu, the capital of Somalia, in 1982, her family fled the Somali Civil War and spent four years in a refugee camp in Kenya before seeking asylum in the US in 1995, when she was 12.\n\nOnce asylum is granted – as it was to Omar’s family – the US Refugee Admissions Program grants lawful permanent resident (LPR) status to refugees, who can then apply for citizenship five years later.\n\nOmar became eligible for citizenship five years after she entered the US, and finally became a citizen in 2000, when she was 17 years old.\n\nDoubts about Omar’s legal status in the US and claims that she married her brother have circulated among the US right wing since 2018, shortly before she was elected to Congress. In 2018, Omar dismissed these claims as “disgusting lies” in a statement to The Associated Press (AP). She provided AP with detailed marriage and divorce records.\n\nIlhan Omar first married Ahmed Abdisalan Hirsi in 2002 in a Muslim faith ceremony, had two children, and later separated. In 2009, she married British citizen Ahmed Nur Said Elmi in a civil marriage, separating in 2011; she reunited with Hirsi in 2012, and after legally divorcing Elmi in 2017, remarried Hirsi legally in 2018.\n\nThere is no verifiable evidence to back up allegations that either Hirsi or Elmi is Omar’s brother. She has strongly denied these allegations.\n\nClaim: The Venezuela boat strikes save 25,000 American lives each time\n\nDuring Trump’s Politico interview, he repeated the claim that Venezuelan President Nicolas Maduro “sends in a lot of drugs” to the US.\n\nSince September, US military strikes on at least 21 Venezuelan boats in the Caribbean and eastern Pacific have killed more than 80 people.\n\nIn September, a top US Navy commander ordered a second strike on an alleged Venezuelan drug boat, despite almost completely destroying it in the first attack. According to witnesses, there were only two survivors clinging to debris in the water after the first strike, and both were killed in the second.\n\nWhen Trump was asked about that second strike, he said: “It looked like they were trying to turn back over the boat, but I don’t get involved in that. That’s up to them. Uh, the admiral that did is a highly respected man. And we save 25,000 people every time we knock out a boat.”\n\nDuring the rally in Pennsylvania, Trump again made the claim that for every US strike on alleged Venezuelan drug boats, “we save 25,000 American lives”.\n\nThe Trump administration has not provided any evidence that strikes on Venezuelan boats each save 25,000 American lives by preventing drug trafficking into the US. Indeed, it has not provided evidence that any of the boats it has struck were carrying drugs or were affiliated with drug cartels, as it claims.\n\nFurthermore, there is little evidence that drugs are trafficked from Venezuela on a large scale. The 2023 United Nations Office on Drugs and Crime (UNODC) World Drug Report said global cocaine production had hit a record 3,708 tonnes, up nearly one‑third from 2022, with most coca cultivation taking place in Colombia, followed by Peru and Bolivia.\n\nTrafficking routes into the US in 2023-2024 primarily passed through Colombia, Peru and Ecuador, not Venezuela, although it does serve as a minor transit corridor for Colombian cocaine moving into the eastern Caribbean.\n\nThe dominant US-bound maritime route remains through the eastern Pacific, then into Mexico and Central America, where most large seizures occur before drugs can pass overland into the US. The US Drug Enforcement Administration’s own 2024 report similarly identified Colombia as the source for about 84 percent of cocaine seized in the US, and made no mention of Venezuela.\n\nClaims about transgender people and Black people\n\nDuring the Pennsylvania rally, Trump claimed the Democrats want “transgender for every member in your family”.\n\nHe added: “If they’re not feeling well that night, let’s just change their sex.”\n\nTrump also said: “Black people love Trump. I got the biggest vote with Black people.”\n\nIn the US, access to medical transition or “gender‑affirming” treatments, such as puberty blockers, hormone therapy or surgeries, is not a uniform process nationwide. It varies significantly from state to state depending on local laws, medical practices and insurance coverage provisions.\n\nHowever, while some European countries have placed restrictions on access to such treatments – especially for children, for whom there are concerns that puberty blockers, which are largely untrialled, might cause lasting developmental harm – these can be more readily available in parts of the US.\n\nThere is certainly no evidence that the Democratic Party believes all families should have a transgender member.\n\nWhen it comes to Black voters, it is true that Trump made significant inroads in the lead-up to the 2024 election. Overall, he secured 20 percent of the Black vote in November 2024 – a big rise from the 12 percent he won in 2020.\n\nHowever, this means that his opponent for the presidency, Democrat Kamala Harris, in fact won the majority of the Black vote.","summary":"Here&#039;s a closer look at what Trump said about the economy and migration during the Politico interview and the rally.","url":"https://www.aljazeera.com/economy/2025/12/10/fact-checking-trumps-pennsylvania-speech-and-his-politico-interview?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/12/reuters_69394698-1765361304.jpg?resize=1200%2C675","video":null,"publish_date":"2025-12-10 12:25:48","author":"Apps Support,Sarah Shamim","authors":["Apps Support","Sarah Shamim"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.613},{"id":386913672,"title":"Exclusive: Jasmine Crockett on the Uphill Battle She&#8217;s Facing in the Senate Race &#8212; and Why It&#8217;s So Important","text":"It’s been only three days since Texas Rep. Jasmine Crockett announced her campaign for Senate. And while the Congresswoman is hitting the streets hard ahead of next year’s midterm election, the battle has not been an easy one for her. From constant backlash from Republicans– including President Donald Trump– to the recent redistricting effort in her state to wipe out Democrat-led voting zones, Crockett has seen and heard it all. \n\nShe sat down with The Root to share her plans for the Senate race and why her voice matters now.\n\nThe Root: Your campaign announcement included audio of President Trump repeatedly calling you a “low-IQ person.” Why was it important for you to include that in your messaging? What message were you trying to send?\n\nRep. Jasmine Crockett: One of the things that I wanted to do was do more than just say, “I’m tough.”  So the theme of our campaign is #Texastough, right? So I don’t run from a fight at all, and it doesn’t matter who is on the other side, including the President of the United States. And I wanted to kind of demonstrate that. Like, yeah, I hear you. I’ve heard everything that you said, and I’m not backing down.\n\nAnd I think that right now, regardless of somebody’s political affiliation, [voters] want people to have a backbone. They want people that exhibit strength, and they want people that will go after whoever is wrong– even if it is the President of the United States… So I thought that that was a great way to set the tone for what it was going to be. And then I also thought that it was just kind of genius, that he has said things like, “They’re relying on her to save us.” [We] specifically made that the last particular thing that was said; then I did the little grin, right? Because I also felt like Republicans recognized Democratic star power before Democrats even see it. I think Democrats run away from it sometimes, and I think Republicans go after it, and they attack it because they don’t want them to ascend. I think it is telling that even as a very junior member in the House, he’s [Trump’s] calling out my name. That says a lot.\n\nThe Root: How did the redistricting effort play a role in your decision to run for Senate?\n\nCrockett: We know that just a few days prior to the filing deadline in Texas, the Supreme Court played Texans and played this country by trying to take our five seats and silencing voices of African Americans by making them only worth one-fifth of their voting strength when it came down to those congressional lines. But the one place that they are wholly able to access the ballot box and wholly able to participate in their representation is for the United States Senate. \n\nI do believe in karma in addition to the fact that it is only the United States Senate that actually oversees who actually sits on the Supreme Court. It’s also the Senate that has oversight over the Supreme Court justices. And so right now, I could settle and say, “I can be here, and I can stay a voice,” but the things that we really need to see change [is] where our rights have been stripped away– whether we’re talking about the Voting Rights Act, whether we’re talking about rolling back provisions with the Civil Rights Act, whether we’re talking about diversity, equity and inclusion (DEI), whether we’re talking about reproductive access. Whatever it is, it has been all coming out of this Supreme Court.\n\n… And so this is about elevating our fight. This is about fighting smarter. This is about changing the map… And I can continue to play this game and play on people’s emotions and say, “I’m here fighting for you,” and I am, right? But if I can elevate my fight, then that’s what we need to do. And this is about leveling up and making sure that when I fight, I’m also winning.\n\nThe Root: And it is gonna be a fight, right? I don’t suspect that you think this is gonna be an easy battle, especially giving the attention that’s on Texas. What are the biggest challenges facing your campaign?\n\nCrockett: Facing my campaign is probably just hate. I mean it’s hard to keep people focused, right? One of the things that I used to talk about when I was on the trail for [former Vice President Kamala] Harris and [former President Joe] Biden is that we’re getting distracted… So just trying to make sure that people stay focused and don’t get distracted. \n\nYou know the things that are making your life tough. Why are we talking about anything else? If we’re not talking about how you’re gonna have more money in your pocket; if we’re not talking about how we’re gonna close this wealth gap; if we’re not talking about how you and your kids are going to access healthcare or education or housing or funds for your own business or raising the wage so that people can actually have a livable wage. If we’re not talking about that, then we ain’t really got nothing to talk about. And anybody that is talking about other things, I need people to quickly recognize that it is nothing more than a distraction.\n\nI always know how to stay on point and stay on message. You know, I may get emotional when I say stuff because at the end of the day, this isn’t a game for me. I don’t do politics because it’s like, “Oh, I grew up in a household where I always knew that this is where I was going.” That’s not what it is. This is a calling on my life. This is what I truly believe… I can tell you that I never saw any of this playing out like this. These were not my plans. And so right now, one thing I know how to do is work. I know how to hustle. And I also know how to beat back the haters that have doubted me, right? Because I’ve been doubted over and over. That’s what it is to be a Black woman in America. But that ain’t stop me. So we’re not gonna let us stop as this time.\n\nThe Root: Something else that you’ve been credited with is knowing how to get people to the voting booth. What is your secret to getting Americans involved, especially when so many don’t want to be?\n\nCrockett: Well, it wouldn’t be a secret if I told you! But what I will say is that I don’t think it’s a secret. I think it’s authenticity. I think it’s building a rapport. And I think what we’re seeing right now, and the reason that people naturally were putting my name into the hat– and it wasn’t me that was putting my name into the hat; it was other people. They were naturally seeing me as the potential contender. I think it is a level of trust and rapport. A lot of people don’t trust politicians, and I honestly don’t blame them, and I don’t beat anybody down about not trusting them, because I didn’t… I give people the permission structure to critique and criticize and ask questions because that’s what democracy looks like.\n\nAs the child of a preacher, it always be people at the church that want to beat somebody into Christianity. That is not gonna be how it’s gonna happen, right?  They’ve always said, just show people through how you live, and then you will bring people to God. It’s the exact same thing. I can tell you, “I’m a good guy,” I can tell you, “I’m a different politician,” or I can just show you.\n\n… People have been following me for years, and I’ve never changed.  And so, you know, there’s gonna be people that are gonna try to write my story for other people and try to define me. And the problem is that I’ve been defining myself for almost six years, and I am battle tested, right? There’s too much on the line to have somebody that is untested, especially in this kind of environment, and not knowing whether or not they will back down, because lives depend on this.  This is life or death, and that’s not hyperbole.\n\n… It’s not time to play politics. It’s not time to say, “Oh, I’m just going to be a flunky for the president.” It’s time to have somebody that is actually going to put people first. And at the end of the day, I don’t think that’s a Democrat or a Republican. If you care about food on your table, a roof over your head, money in your pocket, then there’s only one candidate that is– at least in a general election– gonna give you that. And not just saying it, but has bills and letters and advocacy and investigation that she’s engaged in to show that’s who she is.","summary":"Rep. Jasmine Crockett talked to The Root about the uphill battle she's facing after launching her Senate campaign. \n\nRead more...","url":"https://www.theroot.com/exclusive-jasmine-crockett-on-the-uphill-battle-shes-f-2000078495","image":"https://assets-server.theroot.com/wp-content/uploads/2025/12/10115417/GettyImages-2228425478-scaled.jpg","video":null,"publish_date":"2025-12-10 12:07:07","author":"Phenix S Halley","authors":["Phenix S Halley"],"language":"en","source_country":"US","sentiment":-0.499},{"id":386917462,"title":"The electorate’s inflation report card: three factors to watch","text":"The economy is usually the key issue in any election, and 2026 does not look to be an exception. \n\nUnemployment led President Reagan to lose 26 House seats in the 1982 midterms and President Obama to lose 63 seats in 2010. Record-high inflation was one of the key factors that cost President Carter his reelection in 1980 as well as Democrats’ loss of the Senate, and it had negative consequences again for President Biden and the Democratic Party in the last election. \n\nThe electorate’s intent in November 2024 was to change the direction of the economy and elect a president and Congress that would effectively address inflation. When Kamala Harris said in an interview that she couldn’t think of anything she would do differently from what Joe Biden had done, the outcome of the presidential election was pretty clear. \n\nPresident Trump was handed a well-defined objective: deal with inflation and help the country tackle the cost of living. During an interview with Politico’s Dasha Burns released this week, Trump gave his economy a grade of “A-plus-plus-plus-plus-plus.”\n\nBut voters will ultimately decide what counts as a successful report card. \n\nSo what goes into voters’ report card as they head into next year’s election? And what have we seen recently that is driving the grade they give him and his congressional counterparts? \n\nPrices vs. wages\n\nFirst, the inflation rate rarely goes below 0, so the idea that all prices collectively will go down is unlikely. The key is slowing the rate of increase so that wages are rising at a faster rate, and that relationship is what determines whether people think things are improving. \n\nWhen wages outpace inflation, people have more purchasing power and can do more. But under Biden, over his four-year term, prices went up 21.4 percent, while weekly wages went up 16.7 percent. That is a significant loss of purchasing power. Losing almost 5 percent of your earnings to inflation, when many families were already living paycheck to paycheck, was an overwhelming motivator for a policy change. Biden’s peak for year-to-year inflation was in June 2022, when it hit 9.1 percent, the highest in four decades. \n\nWhen Trump took office, the CPI was 3.0 percent, and in the recent September report it was still 3.0 percent. However, while prices have increased 2.2 percent since he was inaugurated, weekly wages have gone up 2.6 percent — meaning weekly wages have increased more than prices. \n\nState of inflation \n\nThe second factor is whether the wage increase is reducing concerns about the impact of inflation. Currently, it has not been enough of an improvement for the electorate in helping them deal with the cost of living. \n\nIn the most recent Winning the Issues survey (Nov. 15–17), 57 percent said inflation was getting worse, as opposed to 20 percent who said it was getting better. Among independents, 63 percent said it was getting worse, while only 12 percent said it was getting better. So the current slight outperformance of wages over inflation has not been enough. \n\nWhen people buy groceries, they have a personal understanding of what is happening to prices. Biden and Harris learned the hard way what happens when political leadership tries to “spin” what voters are actually seeing. The president has not helped himself or Republicans in Congress by referring to the issue of affordability as a “con job” by Democrats. \n\nAnother concern has been the recent slowdown in job creation and the implications for wage growth. Since Trump has taken office (starting with February), the country’s average monthly number of jobs created is 72,000, although the September number, a gain of 119,000 jobs, was a significant improvement over the prior four months. \n\nTrump’s handling of the economy \n\nFinally, how have those first two factors shaped the electorate’s views of Trump’s handling of the economy and inflation? \n\nGiven their view that inflation has gotten worse, the outlook is negative, with 33 percent approving of how he has handled inflation, versus 59 percent disapproving — a very large margin. On how he has handled the economy, 37 percent approve and 56 percent disapprove, according to the Winning the Issues survey.\n\nIndependents are much more critical. On inflation, 23 percent approve and 68 percent disapprove, while on the economy 28 percent approve and 64 percent disapprove. Just to give a sense of the scale, independents who disapprove of how Trump has handled inflation represent 22 percent of the electorate. If independents voted based on their presidential job approval on inflation, it would make the 2026 elections extremely difficult for Republicans. \n\nThe most recent elections showed how that could be a major problem. In both Virginia and New Jersey, independents voted for the Democratic gubernatorial candidate by a wide margin, exit polls show. In New Jersey, they made up 31 percent of the electorate and voted for Democrat Mikie Sherrill by a margin of 13 points (56-43). In Virginia, they made up 33 percent of the electorate and favored Democrat Abigail Spanberger by a 19-point margin (59-40). \n\nThe importance of the Virginia outcome is that Spanberger was able to recreate Biden’s 2020 independent margin of 19 points in the state, which was indicative of his 13-point margin among them nationally. In the 2022 election, Democrats won independents by 2 points and Republicans won 222 House seats. In 2024, Democrats won independents by 1 point and Republicans won 220 seats. In 2018, Democrats won independents by 12 and Democrats won 235 seats. \n\nTrump is about to engage in a more robust focus on what some of his policies are going to do to improve the electorate’s ability to handle cost-of-living issues. His policies on regulation, energy and taxes should have a positive impact, but they need to be emphasized on a more consistent basis. \n\nBut will Trump sustain an economic message? Back in 2018, according to the exit polls, voters’ attitudes about the economy improved after Trump’s win in 2016, going from 36 percent excellent/good to 68 percent. Yet he focused on the immigration “caravan” despite getting a remarkably positive jobs report the Friday before the election.\n\nLooking ahead to 2026, laser focus on the economy and cost of living is job one for Republicans. \n\nDavid Winston is the president of The Winston Group and a longtime adviser to congressional Republicans. He previously served as the director of planning for Speaker Newt Gingrich. He advises Fortune 100 companies, foundations and nonprofit organizations on strategic planning and public policy issues, as well as serving as an election analyst for CBS News.","url":"https://rollcall.com/2025/12/10/electorate-inflation-report-card-three-factors-to-watch/","image":"https://rollcall.com/app/uploads/2025/12/house_gop_184_111825.jpg","video":null,"publish_date":"2025-12-10 12:04:33","author":"Posted December 10, 2025 At 12:04pm","authors":["Posted December 10, 2025 At 12:04pm"],"language":"en","source_country":"us","sentiment":-0.167},{"id":386913656,"title":"Amanda Seales Explains Why She&#8217;s Not Rocking With Charlamagne Tha God","text":"In news that can only be described as “well this is gonna get interesting,” Amanda Seales is airing out her issues with her former friend Charlamagne tha God. And just like you might expect — she’s not holding back!\n\nAs you well know by now, Seales has no problem speaking up and speaking out about people and situations that have rubbed her the wrong way or are downright wrong, and her latest criticism is centered around the popular “The Breakfast Club” host. And now the clock is ticking on whether or not he’ll respond in a similar fashion.\n\nDuring a recent livestream on Instagram, she broke down why she wouldn’t collaborate with Charlamagne and the things that led up to her not wanting to rock with him anymore. Specifically responding to a viewer when asked why she doesn’t just do a podcast with him, Seales let loose.\n\n“Why would I do a podcast with Charlamagne? We had great chemistry until I realized he was a ridiculous person and he was a snake. So then we don’t have great chemistry anymore. He’s also not an intellectual. Like he’s read books, he’s not a dummy. But he’s not an intellectual and he’s not — he don’t got no back bone. He sits here and regurgitates the same crap,” Seales began in part.\n\nShe went on to reference an interview that he did with former Vice President Kamala Harris in which Seales claimed Charlamagne didn’t push back enough with a point she was trying to make. However, as others pointed at the time, Charlamagne was actually pretty critical with Harris during her campaign, so much so that others took note of it pretty quickly.\n\n“Like stick to rappers. Yes, Andrew Schultz can say whatever and then he defends him. So, you know, go for it playboy. But that’s not my peoples no more,” Seales said.\n\nShe then dropped an eye-opening bombshell when she revealed that she and “The Breakfast Club” host were supposed to previously collaborate on a show entitled “Amanda Seales is Difficult”–which would’ve been a mockumentary about her experience working in Hollywood. \n\nCharlamagne was set to executive producer, or, at least, that was the case until his manager and business manager allegedly tried to pitch the show to VH1 and allegedly claimed it was their idea and not Seales’.\n\nAs a result, that further soured the relationship between the two and prompted the “Insecure” star to no longer want to work with him.\n\n“Why would they [Charlamagne’s team] feel like they could do that? Why would they even have that idea in their mind? Why had they not clarified from jump?” Seales questioned.\n\nNow it’s unclear what exactly prompted Seales to come for Charlamagne like this, but trust and believe, fans will be waiting with bated breath to see how this whole situation unfolds.","summary":"Amanda Seales has no problem speaking up about people and situations that have rubbed her the wrong way--and her latest criticism about Charlamagne tha God falls right in line!\n\nRead more...","url":"https://www.theroot.com/amanda-seales-explains-why-shes-not-rocking-with-charla-2000078445","image":"https://assets-server.theroot.com/wp-content/uploads/2025/12/10094331/amandacharla-scaled.jpg","video":null,"publish_date":"2025-12-10 11:51:13","author":"Shanelle Genai","authors":["Shanelle Genai"],"language":"en","source_country":"US","sentiment":-0.505},{"id":386838962,"title":"CNN staffers fear for 'utter s--- show' in network's future if Paramount buys Warner Bros Discovery: insiders","text":"CNN is on the brink of having yet another new owner and, as of this moment, it's anyone's guess as to who it'll be. In October, CNN's parent company, Warner Bros. Discovery announced it was putting itself up for sale. It previously said it was going to split into two companies — one for the studio and HBO, the other being the cable networks currently within the corporate umbrella. Before Netflix emerged last week as the victor of the bidding war, it had seemed that Paramount owner David Ellison was in the driver's seat, only to be off-roaded by the streaming giant on Friday with its nearly $83 billion offer. On Monday, Paramount launched a $108 billion hostile takeover bid for the entire company, including its cable assets like CNN. \"I think there is a very small contingent who wants Paramount... most do not,\" one CNN staffer told Fox News Digital. PARAMOUNT LAUNCHES HOSTILE TAKEOVER BID OF WARNER BROS DISCOVERY, SAYS OFFER IS ‘SUPERIOR’ TO NETFLIX DEAL Leading up to the corporate drama that has unfolded in recent days, CNN's rank and file were not exactly leaping for joy about the prospects of Ellison becoming their new boss. \"I don’t think most like it because they fear him meddling,\" the CNN staffer said of Ellison. A second CNN staffer noted the \"grim\" mood within the newsroom regarding Ellison. \"They see CBS as a complete and utter s--- show, which it was before this to be honest,\" the CNN staffer told Fox News Digital, while conceding \"our organization is also in chaos and crisis.\" TRUMP WARNS NETFLIX-WARNER BROS DISCOVERY DEAL COULD BE A PROBLEM, SAYS HE'LL BE ‘INVOLVED’ IN DECISION In August, Ellison took over Paramount as part of its $8 billion merger with Skydance Media. The deal was plagued by politics as Paramount settled President Donald Trump's election interference lawsuit against the company over CBS News' handling of the \"60 Minutes\" interview with then-Vice President Kamala Harris. Liberal critics accused Paramount of \"bending the knee\" to Trump in order for his FCC to approve the merger. They also expressed outrage over CBS' cancellation of \"The Late Show with Stephen Colbert,\" which will stop airing after May 2026. The network insisted it was purely a financial decision, though critics believe it was also tied to the FCC-approved merger. CBS News, the perpetual third place broadcaster behind ABC News and NBC News' weekday programming, has undergone some major changes in Ellison's first few months as its owner, from implementing a brutal round of layoffs, tapping Bari Weiss as the network's editor-in-chief, to pushing out \"CBS Evening News\" anchors John Dickerson and Maurice DuBois. Weiss is reportedly eying \"CBS Mornings\" co-host Tony Dokoupil to take the chair. SENATE GEARS UP FOR 'INTENSE' ANTITRUST HEARING IN WAKE OF NETFLIX, WARNER BROS DEAL CNN staffers fear that the editorial reshaping of CBS News by Ellison and Weiss would impact their own newsroom if Paramount buys Warner Bros. Discovery. They also worry about a potential \"bloodbath\" among leadership if CBS News and CNN were to merge. \"They like editorial independence, and I think the reports of what CBS has gone through suggests that may not be the case where there to be a Paramount takeover,\" the first CNN staffer said. During a CNBC interview on Monday, Ellison was asked whether he would combine CNN and CBS News' newsgathering operations. He dodged the question, speaking instead about the broader goal he has for news, which is getting into the \"trust\" and \"truth business\" that \"speaks to the 70% of Americans in the middle,\" a sentiment previously echoed by Weiss. BARI WEISS REPORTEDLY 'STUNNED' '60 MINUTES' CREW BY ASKING WHY THE COUNTRY THINKS THEY'RE 'BIASED': REPORT However, The Wall Street Journal reported that Ellison had told Trump officials that he'd make sweeping changes to CNN if he became its owner, and that Trump has been vocal about wanting CNN to have new ownership that will make programming changes. \"I think everyone wants to be fair,\" the CNN staffer said. \"I don't think [CNN colleagues] see Ellison as trying to target the political middle. I think they think he is kowtowing to Trump.\" Trump himself has so far had a more agnostic approach to the bidding war despite his reported coziness with Ellison and his billionaire father Larry Ellison. Last week, he praised Netflix as a \"great company\" and called its CEO Ted Sarandos a \"fantastic man\" but expressed concern about its market share. On Monday, he refrained from saying he supported Paramount's bid despite it being partially financed by his son-in-law Jared Kushner's private equity firm Affinity Partners, something Trump told reporters he hadn't discussed with Kushner about. Meanwhile, Trump blasted Paramount over the \"60 Minutes\" interview featuring ally-turned-foe Rep. Marjorie Taylor Greene, R-Ga., writing on Truth Social that the new ownership is \"NO BETTER THAN THE OLD OWNERSHIP.\" CNN has repeatedly been orphaned by corporate parents for years, from Time Warner in the 90s, to AOL in the early 2000s, to AT&T in 2018, leading to its 2022 spinoff of Warner Bros. Discovery, led by CEO David Zaslav. \"I remember when AT&T was seen as horrific. Looking back, it’s the best owner we’ve had in a decade,\" the second CNN staffer said. \"They left us alone. That’s all any news organization wants. They plowed money into us. And yeah, Zaslav dumped CNN+ on like the second day or whatever. But AT&T put in 600 million bucks.\" Not everyone at CNN is hitting the panic button on Ellison. The second staffer told Fox News Digital that they'll be \"open-minded\" if he takes over. The staffer also called Weiss \"very thoughtful and very confident,\" which could be a \"very good combo.\" \"I hope I'll be pleasantly surprised,\" they said. CBS SNAGS ABC REPORTER WHO APOLOGIZED FOR REMARKS ABOUT CHARLIE KIRK'S ALLEGED SHOOTER'S 'TOUCHING' MESSAGES A third CNN staffer suggested that Paramount buying the network would be the better outcome versus being spun off if Netflix buys Warner Bros. and being \"totally chopped to pieces and whittled to the bone private equity style.\" Regardless, the agony of CNN's unknown future is only fueling anxiety in the newsroom. \"Most people have no idea what will happen... The uncertainty is the worst of all,\" the first CNN staffer said. Representatives for CNN and Warner Bros. Discovery did not immediately respond to Fox News Digital's requests for comment. A spokesperson for Paramount declined to comment. CLICK HERE TO GET THE FOX NEWS APP","summary":"CNN staffers tell Fox News Digital the mood in the newsroom is &quot;grim&quot; over the prospects of Paramount owner David Ellison buying its parent company Warner Bros. Discovery.","url":"https://www.foxnews.com/media/cnn-staffers-fear-utter-s-show-networks-future-paramount-buys-warner-bros-discovery-insiders","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/06/cnn-building-big-cracks.jpg","video":null,"publish_date":"2025-12-10 11:30:50","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.007},{"id":386812630,"title":"DOJ’s Harmeet Dhillon rips Gavin Newsom’s 2028 ambitions on ‘Pod Force One,’ says AOC is ‘more promising’","text":"Assistant Attorney General Harmeet Dhillon ripped California Gov. Gavin Newsom in an interview on “Pod Force One,” saying his “state leadership failures” were disqualifying for a 2028 presidential run — before suggesting that Rep. Alexandria Ocasio-Cortez (D-NY) was a far “more promising” candidate for Democrats.\n\nDhillon, a former California resident, told The Post’s Miranda Devine that Newsom, who is term-limited and will leave office in January 2027, “isn’t untested, like [former President Barack] Obama was, in a way” but has “notable personal foibles and failures” when asked whether the governor had a shot at the US presidency.\n\nThe assistant AG for the Civil Rights Division also noted that a member of Newsom’s staff had claimed she was “involved in the firebombing of a judge’s house in South Carolina, which turned out to have been an accident.”\n\n“I think that there are other more promising, for the Democrat Party, younger politicians,” Dhillon said in Wednesday’s podcast episode. “I think AOC is one of those fictionally created-in-a-lab characters that may be a more promising one for them.”\n\n“I think that’s the bigger threat. The Zohran Mamdanis of the world, who are charismatic, attractive, diabolical, that’s the next generation,” she added.\n\nNewsom, 58, flew to Washington, DC, last week to request an additional $34 billion in wildfire recovery aid from Congress — but officials at the Department of Homeland Security and Federal Emergency Management Agency refused to meet with the Democratic governor.\n\nTensions with the Trump administration have defined Newsom’s second-to-last year in office, with the president and governor taking shots at each other over the wildfire recovery aid, energy issues, anti-ICE riots in Los Angeles that led to National Guard troops deploying, as well as trolling posts on social media.\n\nThe souped up social media presence, which has echoed Trump’s brash and unapologetic tone, complete with the president’s signature all capital letters style, as well as the governor’s pivots to the middle on controversial issues, has caused many to speculate Newsom is gearing up for a 2028 Democratic run.\n\nAOC is also rumored to be eyeing a run for the presidency in 2028 — or a run for the Senate seat held by Senate Minority Leader Chuck Schumer (D-NY).\n\nNewsom is currently leading the primary field with 28% support, according to the RealClearPolitics polling aggregator, followed by former Vice President Kamala Harris at 20%, former Transportation Secretary Pete Buttigieg at 11.5% and Ocasio-Cortez at 8.5%.\n\nEvery week, Post columnist Miranda Devine sits down for exclusive and candid conversations with the most influential disruptors in Washington on ‘Pod Force One.’ Subscribe here!\n\nDhillon’s Civil Rights Division has sued Newsom’s administration several times, most recently for adopting a redistricting plan, known as Proposition 50, that allegedly “racially gerrymandered congressional districts in violation of the Equal Protection Clause of the Fourteenth Amendment to the U.S. Constitution.”\n\nThe assistant AG recused herself from the case since her former law firm initiated the suit, but Dhillon said she had a poor impression of Newsom’s team based on the controversy over the firebombing of the South Carolina judge’s home.\n\nIzzy Gardon, Newsom’s director of communications, said that “Ms. Dhillon owes us a full apology for her blatantly false implications. Our office never threatened her, in contrast to the Trump Administration’s vile rhetoric against sitting judges.”\n\n“In recent weeks and months, Trump officials have referred to judges as ‘terrorists’ and ‘legal insurrectionists,’” the rep said, noting she has reposted other offensive tweets including one calling him a “woke douche bag.”\n\nGardon added: “She and her associates own that dangerous, disgraceful, and un-American rhetoric, and she should apologize for that, too.”\n\nCircuit Court Judge Diane Goodstein’s home in Edisto Beach was engulfed in a fire on Oct. 5 that authorities have still not determined the cause of. Sources told FitsNews that month the judge, who ruled against the Trump administration’s request for state voter data but was overruled by the South Carolina Supreme Court.\n\nIn a post from her official account on X, Dhillon said her division “will not stand for a state court judge’s hasty nullification of our federal voting laws” and “will allow nothing to stand in the way of our mandate to maintain clear voter rolls.”\n\nGardon had posted on X in response to the judge’s home being lit on fire on Oct. 5: “A few weeks ago, one of Trump’s top DOJ officials publicly targeted this judge. Today, the judge’s home is on fire.”\n\nDhillon dished on her “Pod Force One” interview, “They blamed me and Stephen Miller for that, and you get death threats because of that? I had to literally call the police over some threats that I received.”","summary":"Dhillon told The Post's Miranda Devine that Newsom has \"notable personal foibles and failures.\"","url":"https://nypost.com/2025/12/10/us-news/dojs-harmeet-dhillon-rips-gavin-newsoms-2028-ambitions-on-pod-force-one-says-aoc-is-more-promising/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/12/newspress-collage-3m0uli6l4-1765329133913.jpg?quality=75&strip=all&1765311175&w=1200","video":"https://cdn.jwplayer.com/videos/XGhE86KI-RyIcpnTz.mp4","publish_date":"2025-12-10 11:04:31","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.016},{"id":386789978,"title":"Do Democrats have a brewing primary problem?","text":"In today’s edition … Kamala Harris is headed to the DNC’s Winter meeting … You give us your views on politics and virality … but first …\n\nThe big news\n\nEileen Higgins won the runoff to be Miami’s next mayor Tuesday night, capping a strong year for Democrats at the ballot box as the former county commissioner becomes the first Democratic mayor of the city in almost 30 years.","url":"https://www.washingtonpost.com/politics/2025/12/10/do-democrats-have-brewing-primary-problem/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5LBXM2GLA2T6THE4VDNXZLKI7A_size-normalized.JPG&w=1600&h=900","video":null,"publish_date":"2025-12-10 11:00:46","author":"Dan Merica,Matthew Choi","authors":["Dan Merica","Matthew Choi"],"language":"en","category":"politics","source_country":"us","sentiment":0.331},{"id":386788952,"title":"The Unlikely State Where Democrats Could Turn U.S. Politics on Its Head","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nIn 2018 U.S. Rep. Beto O’Rourke broke state fundraising records and sparked national attention with his campaign for a Texas Senate seat. The polls never had him as the favorite—FiveThirtyEight gave him a 23 percent chance by Election Day—but it was noteworthy that in Texas a Democrat was even close. Bolstered by the notoriously unlikable Ted Cruz and a national “blue wave,” O’Rourke lost by only 2.6 points. Not bad for an anti-gun Democrat in a seemingly deep-red state.\n\nIn hindsight, O’Rourke’s narrow loss was actually the cruelest thing he could’ve done to the Democratic Party. It created a misleading impression that a long-dreamed-of blue Texas was right around the corner. That idea was emboldened in 2020, after Joe Biden lost the state by just 5.5 points. It was a larger loss than O’Rourke’s had been, but it was arguably more impressive when you took into account the more Republican-friendly national environment.\n\nDemocrats’ hopes were high, and they held on to them even after taking a step back during the 2022 midterms. Then came Kamala Harris’ 2024 Texas wipeout, when she lost to Donald Trump by 13.7 points. It was a massive regression, and it felt familiar. For years, optimistic Democrats—braced by near misses—had promised a blue Texas over the horizon. And, once again, when the big moment arrived, the state apparently returned to a deep-red hue.\n\nNot only did this seemingly destroy any hope that Texas was trending blue, but a core part of the blue Texas theory—that Hispanic and Latino voters would carry Democrats across the finish line—had been debunked. Trump won 55 percent of Latino voters in the state, a stunning swing from his 41 percent share in 2020.\n\nThe blue Texas dream is widely scoffed at post-2024, with liberals themselves often the most skeptical of the idea. They’ll say they’ve been promised that the state will flip one too many times, so don’t you dare try to get their hopes up again. Conservatives, meanwhile, appear to see blue Texas as a total joke; whereas Cruz’s 2024 Senate campaign ads took the idea seriously, in 2025 the White House urged Texas legislators to redraw their state’s congressional map in an attempt to grab Republicans five additional seats. It’s a move that conveyed total confidence that Texas would remain in the GOP’s hands.\n\nAnd so it is with some trepidation that I come to argue that the blue Texas dream is not over. Not only that, but there’s a historical precedent for a state flipping from one party’s bastion to the other’s playground.\n\nLet’s begin with those electoral maps that Republicans redrew this summer, a move that took on additional salience last week after the Supreme Court upheld them for the upcoming election. It’s not clear that this power grab will actually yield the party the five new seats it’s hoping to snag—particularly if the national political environment continues to favor Democrats in 2026. As elections analyst Eli McKown-Dawson noted, two of those five districts aren’t actually safe red: Texas’ 28th District can easily fall in a blue-wave environment, and its 34th could fall too if the Hispanic vote shifts back to Democrats. Given Hispanic and Latino Texans’ status as swing voters and their already-observable leftward shift in the 2025 elections, this hardly seems like a safe bet for the GOP. And considering that the recent Tennessee special election showed a district moving 13 points to the left, these 2024 Texas margins just aren’t that impressive.\n\nBut when I talk about blue Texas, I’m talking about something more ambitious than a wave election that flips a few House seats.\n\nSome Not-So-Distant History\n\nRepublicans’ moves in Texas suggest an assumption that the state will remain deep red in perpetuity. But it wasn’t so long ago that the party believed it had a megastate in the bag, only to see it flip on them.\n\nRewind 31 years, and you’ll find a California that had leaned Republican for over a generation. Voters elected not a single Democratic presidential candidate from 1968 to 1988 and only one Democratic governor from 1966 to 1998. Sen. Dianne Feinstein, later famous for repeatedly winning reelection on autopilot, actually lost her first statewide race to a Republican in 1990. Much like O’Rourke’s 2018 defeat, Feinstein’s 3.5-point loss was described by the Oakland Tribune as an “impressive closing campaign” that put her “in the front ranks” in an upcoming 1992 primary for the Senate.\n\nThe California of 1990 isn’t a perfect comparison with modern Texas. For one thing, its pro-choice Republican governor, Pete Wilson, started off more moderate than politicians like Greg Abbott and Cruz did. Still, it’s hard not to look at the next gubernatorial election in 1994 and not see some parallels to 2024. 1994 was the year Wilson won reelection by a much larger margin than his first time around, and he did so by tacking notably to the right on immigration. After his victory, he described the race as a sweeping mandate, and other GOP figures in the state certainly agreed: “This is a glorious day to be a Republican,” Wilson’s attorney general told reporters. “We have made a change in America and California that’s going to last a long, long time.”\n\nBut a Democrat won the governor’s race four years later, and (give or take one Terminator) the party continued to win that seat for decades to come. Within one generation, Republicans had gone from the clear favorites in statewide elections to candidates barely taken seriously at all. This was not an instant switch but a culmination of a decadeslong trend, one that necessitated many steps forward and plenty of steps back. Colorado and Virginia would go through similar transformations in the 2000s, while Georgia and Arizona are on similar trajectories today. So why is it so hard to imagine Texas, a state that voted Republican by 23 points in 2004 and by only 5.5 points in 2020, going down the same path?\n\nWhat’s Holding Texas Democrats Back?\n\nThe easiest explanation for all the doomerism is that the changing national environment has created a misleading picture. 2018 was a bluer year nationwide than 2020, which was a bluer year than 2022, which was itself a bluer year than 2024; Democrats’ vote share in Texas declined during this period at least partially because their vote share was declining everywhere. It’s similar to the way Republicans’ California win in ’94 grows less impressive when you remember that as the year of a historic national red-wave midterm. National trends can cloud one’s takeaway from statewide elections; Wilson falsely interpreted his win as a sign that California was fully on board with his increasingly conservative, anti-immigrant platform, and that fundamental misread of his electorate paved the way for a Democrat to win big in 1998.\n\nThe other reason for the blue Texas skepticism is that the Democrats’ dominance in California was fueled by its burgeoning Hispanic population. The transition helped contribute to the “emerging Democratic majority” theory, the idea that an increasingly diverse America would usher in an inevitable age of Democratic dominance. The theory was half right: The country has indeed gotten more diverse. But at the same time, many of its minority groups have shifted right. If Hispanic and Latino voters were still casting ballots like they did in 2016 (their estimated 20-point swing from ’16 cost Democrats at least 400,000 votes in ’24), Texas could already be an undeniable swing state; instead, Hispanic voters swung hard for Trump and helped him carry the state with ease.\n\nBut while the evolution of the Hispanic vote is a complication in the blue Texas dream, it certainly doesn’t kill it. After all, that transition is similar to what happened with Irish and Italian voting blocs during the mid-20th century. As Vox correspondent Christian Paz put it before the 2024 election, “Hispanic and Latino Americans may simply be following the trends of previous waves of immigrant communities: assimilating, diffusing across the country, and becoming as ideologically and politically diverse as native-born and white Americans are.” Just as Irish and Italian Americans went from reliable Democrats to less-predictable swing voters, so too are Hispanic Americans today. The transition may be messier given the sheer variety of Hispanic voters (hailing from over a dozen different major countries), but the general trend seems clear.\n\nAnd a demographic that swings in one direction can swing back just as quickly in the other. Nearly all recent polling data shows that Hispanic and Latino voters are souring on Trump, and these numbers have been backed up at least partially in the 2025 election results. Especially in states like New Jersey and Virginia, Latino-heavy districts have shown a major reversion toward Democrats. And as party strategist Chuck Rocha noted in an August interview for the Texas Tribune, the president has shown a unique strength with Hispanic voters that might not be replicable for other Republicans, nor may it help them much in the 2026 midterms. In 2024 Ted Cruz performed 4 to 6 points worse than Trump in the most Hispanic-heavy districts throughout the state; whose coattails will Texas Sen. John Cornyn be able to ride in 2026?\n\nAnother common argument against blue Texas is the state’s apparent exodus of liberal voters combined with an influx of conservative voters. While there is a trend of political self-sorting in America that accelerated in the COVID era, the impact this has had on Texas appears overstated. Not only are far more people entering the state than leaving it, but the people entering (primarily young people of diverse backgrounds) are evidently motivated more by job opportunities and cost of living than by partisan politics. It’s also the blue and purple metro areas that are booming in Texas, not the red rural counties. Just as Hispanic residents have been shown to vote more liberal when they live in liberal districts, so too do most other Americans. As long as most people are moving into Texas suburbs and cities, self-sorting migration is likely not enough to reverse the state’s blueward trend on its own.\n\nPerhaps the biggest factor holding back a blue Texas is voter apathy in the state. As the Texas Blue Action website notes with great frustration, the state already has enough registered Democrats to flip most of its recent statewide election results, but many of those registered Democrats aren’t voting. This logic could easily be flipped around on the advocacy group (there are plenty of registered Republicans in the state who don’t vote either), but the general point stands: Voter turnout among Democrats tends to be lower than among Republicans in the state, further hurting Democrats’ chances. Texas has one of the lowest voter participation rates in the country, a fact that blue Texas skeptics constantly cite as proof that the state is unflippable.\n\nThe obvious counter is to ask why voter apathy is so high in the first place. It can’t be explained away by the state’s restrictive voter policies, as similarly restrictive states, such as Georgia and Florida, regularly see higher turnout. The difference is that those states are perceived as swing states and Texas isn’t. People are more likely to turn out in elections when they think their votes matter, but Texas voters feel as if theirs don’t. And although the state’s Republican voters get at least the satisfaction of being on the winning team, for its Democrats, voting can feel like an undignified, Sisyphean task. What’s the point in showing up if you think you’re just going to lose again and again?\n\nThis is why it’s so crucial for Democrats to not give up on Texas: A single win would deal a major blow to the perception that their statewide elections are a foregone conclusion. Much like how Georgia’s surprise 2020 flip led to a boost (relative to the nation) in voter turnout in 2024, a single win could energize Texas Dems’ get-out-the-vote efforts going forward. Both the 2026 state Senate race and gubernatorial race are too far out to say anything for certain, but the national blue-leaning midterm trend will make those contests Democrats’ best chance to win the state in over 30 years. Flipping Texas with the right candidate in a blue-wave midterm would hardly turn it into a blue state yet, but it would provide the much-needed proof that blue Texas isn’t a delusion.\n\nEven if Democrats fail to win statewide in 2026, it’s important that they take the possibility seriously and continue putting in the work to make it happen. Winning Texas’ Senate seat could be crucial to regaining control of the U.S. Senate, and turning Texas into a purple state would radically shift the presidential electoral map in Democrats’ favor. After the 2030 census, Texas is expected to gain four electoral votes, while the heavy-blue states may lose up to nine of them; this math is devastating for Democrats unless they manage to put Texas on the table.\n\nMost importantly, Democrats need to believe in and strive for a blue Texas because persistent groundwork is vital for the long-term flipping of a state. Just as Stacey Abrams’ doomed 2018 gubernatorial campaign still paved the way for Democrats’ triumph in Georgia two years later, so too could the Democrats’ campaigns in 2026. There’s a decent chance that things won’t work out as nicely for Texas, that flipping the state truly is a total nonstarter, as so many pundits insist. That doesn’t mean, however, that the party should give up on it after having gained so much ground. Blue Texas is not guaranteed, but it is at least possible, and that should be more than enough reason to keep up the fight.","summary":"Republicans believe that it will stay red forever. Their arrogance could be their undoing.","url":"https://slate.com/news-and-politics/2025/12/texas-redistricting-democrats-republicans.html?via=rss","image":"https://compote.slate.com/images/f1318e44-d812-4f50-9fe2-ae99967dfe6a.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-12-10 10:45:00","author":"Michael Boyle","authors":["Michael Boyle"],"language":"en","category":"politics","source_country":"US","sentiment":-0.51},{"id":386798934,"title":"Who is Eileen Higgins, the first Democratric mayor of Miami in 30 years?  - Dominican Republic Post –","text":"Miami voters on Tuesday elected Democrat Eileen Higgins as mayor, ending a nearly three-decade dry spell for her party after she defeated a Republican endorsed by Donald Trump in the predominantly Hispanic city.\n\nWhile the election was officially nonpartisan, the race took on national significance, pitting Higgins against Republican Emilio Gonzalez, a former Miami city manager, in a contest closely watched by both parties.\n\nThe win comes in the wake of recent electoral success achieved by the Democratic Party ahead of next year’s midterm elections.\n\nHere is what we know:\n\nWhat were the final results of the Miami election?\n\nHiggins led Republican Gonzalez 59 percent to 41 percent on Tuesday night, according to preliminary results from the Miami-Dade County Supervisor of Elections Office. She is the first woman ever elected as mayor in the city.\n\nShe won Tuesday’s run-off after leading the first round of voting on November 4 with 35 percent of the vote to Gonzalez’s 19 percent.\n\n“Tonight, the people of Miami made history,” Higgins said in a statement. “Together, we turned the page on years of chaos and corruption and opened the door to a new era for our city.”\n\nHiggins’ victory adds to a run of recent Democratic wins, including races in New Jersey and Virginia, as the party looks towards the 2026 midterms. That trend continued with strong results in November’s off-year elections and a solid showing in this month’s special House race in Tennessee.\n\nWhile Miami’s mayor wields limited formal power, the role is highly symbolic, representing a city with a large Latino population at the centre of national immigration debates.\n\nHome to roughly half a million residents, Miami is Florida’s second-most populous city after Jacksonville. In recent election cycles, it has shifted towards Republicans, making a Democratic win stand out even more. Trump had won Miami-Dade County in the 2024 presidential election against her Democratic rival Kamala Harris.\n\nHispanic or Latino residents make up roughly 70 percent of Miami’s population. In Miami-Dade County overall, about 69–70 percent of residents identify as Hispanic or Latino – a demographic majority that significantly shapes the region’s cultural and political identity.\n\nWhat are some of the key issues of this campaign?\n\nImmigration was a key issue in Higgins’ campaign.\n\nIn Miami, she often talked about Donald Trump’s immigration crackdown, saying she heard from residents who were worried about family members being detained. She described the election as a referendum on the president’s policies, which have caused concerns about due process.\n\nMore than 200,000 people have been arrested since Trump launched the crackdown on migrants in January. At least 75,000 people, who were arrested as part of Trump’s fight against gang members and criminals, had no criminal records, according to new data. He has deported hundreds of migrants and halted asylum and green card applications.\n\nThe Trump administration had also ordered the arrest of several students who participated in protests against Israel’s genocidal war on Gaza. Several of them have since been released by the courts.\n\nThe difference between the candidates was clear during a debate last month. Higgins called immigration enforcement in Miami “cruel and inhumane” and criticised the detention centre opened by Florida Governor Ron DeSantis, commonly known as “Alligator Alcatraz”.\n\nIn that same debate, her opponent, Gonzalez, said he supported federal law enforcement rounding up “people who commit crimes”.\n\n“I support putting down migrant criminals, I cannot in good conscience fight with the federal government and defend a rapist or a murderer,” Gonzalez added.\n\nHiggins repeated her message in an interview with El Pais this week, drawing a sharp contrast with Trump’s approach.\n\n“He and I have very different points of view on how we should treat our residents, many of whom are immigrants,” she said.\n\n“That is the strength of this community. We are an immigrant-based place. That’s our uniqueness. That’s what makes us special.”\n\nAffordability was also a major issue in the race. Higgins focused her campaign on local concerns such as housing costs, while Gonzalez campaigned on repealing Miami’s homestead property tax and streamlining business permits.\n\n“My opponent is keen on building, building, building,” Gonzalez told CNN. “She wants to put a skyscraper in every corner … then calling it affordable housing, which is a misnomer, because very rarely is it truly affordable.”\n\nDuring a speech in Pennsylvania on Tuesday, Trump raised the issue of affordability, which Democrats have highlighted. He blamed high prices on his predecessor, Joe Biden.\n\nThe cost of living has been on the election campaign agenda in recent gubernatorial and mayoral elections in which Democrats have made gains, including the much-publicised New York mayoral election. The Democratic wins show that the issue has resonated with voters.\n\nWho is Eileen Higgins?\n\nHiggins is Miami’s first non-Hispanic mayor in nearly three decades. Born in Ohio and raised in Albuquerque, New Mexico, she earned a Bachelor of Science in mechanical engineering from the University of New Mexico and later completed an MBA at Cornell University.\n\nBefore becoming mayor, Higgins represented a politically conservative district that includes Little Havana, the city’s well-known Cuban enclave.\n\nShe has embraced the nickname “La Gringa,” a term commonly used in Spanish to refer to white Americans.\n\nHer professional background spans international development and consulting, with a focus on infrastructure and transportation projects across Latin America. She later served as Peace Corps country director in Belize and went on to work as a foreign service officer for the United States Department of State, where her portfolio included diplomatic and economic development efforts in countries such as Mexico and South Africa.\n\nAfter her government service, Higgins returned to the private sector before eventually entering local politics in Miami.","url":"https://dominicanrepublicpost.com/who-is-eileen-higgins-the-first-democratric-mayor-of-miami-in-30-years/","image":"https://dominicanrepublicpost.com/app/uploads/2025/12/AP25344043213577-1765336357-v0hF7K.jpg","video":null,"publish_date":"2025-12-10 10:26:19","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":0.062},{"id":386819312,"title":"Who is Eileen Higgins, the first Democratric mayor of Miami in 30 years?  - St. Kitts Gazette – Daily News","text":"Miami voters on Tuesday elected Democrat Eileen Higgins as mayor, ending a nearly three-decade dry spell for her party after she defeated a Republican endorsed by Donald Trump in the predominantly Hispanic city.\n\nWhile the election was officially nonpartisan, the race took on national significance, pitting Higgins against Republican Emilio Gonzalez, a former Miami city manager, in a contest closely watched by both parties.\n\nThe win comes in the wake of recent electoral success achieved by the Democratic Party ahead of next year’s midterm elections.\n\nHere is what we know:\n\nWhat were the final results of the Miami election?\n\nHiggins led Republican Gonzalez 59 percent to 41 percent on Tuesday night, according to preliminary results from the Miami-Dade County Supervisor of Elections Office. She is the first woman ever elected as mayor in the city.\n\nShe won Tuesday’s run-off after leading the first round of voting on November 4 with 35 percent of the vote to Gonzalez’s 19 percent.\n\n“Tonight, the people of Miami made history,” Higgins said in a statement. “Together, we turned the page on years of chaos and corruption and opened the door to a new era for our city.”\n\nHiggins’ victory adds to a run of recent Democratic wins, including races in New Jersey and Virginia, as the party looks towards the 2026 midterms. That trend continued with strong results in November’s off-year elections and a solid showing in this month’s special House race in Tennessee.\n\nWhile Miami’s mayor wields limited formal power, the role is highly symbolic, representing a city with a large Latino population at the centre of national immigration debates.\n\nHome to roughly half a million residents, Miami is Florida’s second-most populous city after Jacksonville. In recent election cycles, it has shifted towards Republicans, making a Democratic win stand out even more. Trump had won Miami-Dade County in the 2024 presidential election against her Democratic rival Kamala Harris.\n\nHispanic or Latino residents make up roughly 70 percent of Miami’s population. In Miami-Dade County overall, about 69–70 percent of residents identify as Hispanic or Latino – a demographic majority that significantly shapes the region’s cultural and political identity.\n\nWhat are some of the key issues of this campaign?\n\nImmigration was a key issue in Higgins’ campaign.\n\nIn Miami, she often talked about Donald Trump’s immigration crackdown, saying she heard from residents who were worried about family members being detained. She described the election as a referendum on the president’s policies, which have caused concerns about due process.\n\nMore than 200,000 people have been arrested since Trump launched the crackdown on migrants in January. At least 75,000 people, who were arrested as part of Trump’s fight against gang members and criminals, had no criminal records, according to new data. He has deported hundreds of migrants and halted asylum and green card applications.\n\nThe Trump administration had also ordered the arrest of several students who participated in protests against Israel’s genocidal war on Gaza. Several of them have since been released by the courts.\n\nThe difference between the candidates was clear during a debate last month. Higgins called immigration enforcement in Miami “cruel and inhumane” and criticised the detention centre opened by Florida Governor Ron DeSantis, commonly known as “Alligator Alcatraz”.\n\nIn that same debate, her opponent, Gonzalez, said he supported federal law enforcement rounding up “people who commit crimes”.\n\n“I support putting down migrant criminals, I cannot in good conscience fight with the federal government and defend a rapist or a murderer,” Gonzalez added.\n\nHiggins repeated her message in an interview with El Pais this week, drawing a sharp contrast with Trump’s approach.\n\n“He and I have very different points of view on how we should treat our residents, many of whom are immigrants,” she said.\n\n“That is the strength of this community. We are an immigrant-based place. That’s our uniqueness. That’s what makes us special.”\n\nAffordability was also a major issue in the race. Higgins focused her campaign on local concerns such as housing costs, while Gonzalez campaigned on repealing Miami’s homestead property tax and streamlining business permits.\n\n“My opponent is keen on building, building, building,” Gonzalez told CNN. “She wants to put a skyscraper in every corner … then calling it affordable housing, which is a misnomer, because very rarely is it truly affordable.”\n\nDuring a speech in Pennsylvania on Tuesday, Trump raised the issue of affordability, which Democrats have highlighted. He blamed high prices on his predecessor, Joe Biden.\n\nThe cost of living has been on the election campaign agenda in recent gubernatorial and mayoral elections in which Democrats have made gains, including the much-publicised New York mayoral election. The Democratic wins show that the issue has resonated with voters.\n\nWho is Eileen Higgins?\n\nHiggins is Miami’s first non-Hispanic mayor in nearly three decades. Born in Ohio and raised in Albuquerque, New Mexico, she earned a Bachelor of Science in mechanical engineering from the University of New Mexico and later completed an MBA at Cornell University.\n\nBefore becoming mayor, Higgins represented a politically conservative district that includes Little Havana, the city’s well-known Cuban enclave.\n\nShe has embraced the nickname “La Gringa,” a term commonly used in Spanish to refer to white Americans.\n\nHer professional background spans international development and consulting, with a focus on infrastructure and transportation projects across Latin America. She later served as Peace Corps country director in Belize and went on to work as a foreign service officer for the United States Department of State, where her portfolio included diplomatic and economic development efforts in countries such as Mexico and South Africa.\n\nAfter her government service, Higgins returned to the private sector before eventually entering local politics in Miami.","url":"https://stkittsgazette.com/who-is-eileen-higgins-the-first-democratric-mayor-of-miami-in-30-years/","image":"https://stkittsgazette.com/app/uploads/2025/12/AP25344043213577-1765336357-1bd7dT.jpg","video":null,"publish_date":"2025-12-10 10:24:07","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":0.062},{"id":386814966,"title":"Who is Eileen Higgins, the first Democratric mayor of Miami in 30 years?  - Guyana Inquirer – Daily Guyana","text":"Miami voters on Tuesday elected Democrat Eileen Higgins as mayor, ending a nearly three-decade dry spell for her party after she defeated a Republican endorsed by Donald Trump in the predominantly Hispanic city.\n\nWhile the election was officially nonpartisan, the race took on national significance, pitting Higgins against Republican Emilio Gonzalez, a former Miami city manager, in a contest closely watched by both parties.\n\nThe win comes in the wake of recent electoral success achieved by the Democratic Party ahead of next year’s midterm elections.\n\nHere is what we know:\n\nWhat were the final results of the Miami election?\n\nHiggins led Republican Gonzalez 59 percent to 41 percent on Tuesday night, according to preliminary results from the Miami-Dade County Supervisor of Elections Office. She is the first woman ever elected as mayor in the city.\n\nShe won Tuesday’s run-off after leading the first round of voting on November 4 with 35 percent of the vote to Gonzalez’s 19 percent.\n\n“Tonight, the people of Miami made history,” Higgins said in a statement. “Together, we turned the page on years of chaos and corruption and opened the door to a new era for our city.”\n\nHiggins’ victory adds to a run of recent Democratic wins, including races in New Jersey and Virginia, as the party looks towards the 2026 midterms. That trend continued with strong results in November’s off-year elections and a solid showing in this month’s special House race in Tennessee.\n\nWhile Miami’s mayor wields limited formal power, the role is highly symbolic, representing a city with a large Latino population at the centre of national immigration debates.\n\nHome to roughly half a million residents, Miami is Florida’s second-most populous city after Jacksonville. In recent election cycles, it has shifted towards Republicans, making a Democratic win stand out even more. Trump had won Miami-Dade County in the 2024 presidential election against her Democratic rival Kamala Harris.\n\nHispanic or Latino residents make up roughly 70 percent of Miami’s population. In Miami-Dade County overall, about 69–70 percent of residents identify as Hispanic or Latino – a demographic majority that significantly shapes the region’s cultural and political identity.\n\nWhat are some of the key issues of this campaign?\n\nImmigration was a key issue in Higgins’ campaign.\n\nIn Miami, she often talked about Donald Trump’s immigration crackdown, saying she heard from residents who were worried about family members being detained. She described the election as a referendum on the president’s policies, which have caused concerns about due process.\n\nMore than 200,000 people have been arrested since Trump launched the crackdown on migrants in January. At least 75,000 people, who were arrested as part of Trump’s fight against gang members and criminals, had no criminal records, according to new data. He has deported hundreds of migrants and halted asylum and green card applications.\n\nThe Trump administration had also ordered the arrest of several students who participated in protests against Israel’s genocidal war on Gaza. Several of them have since been released by the courts.\n\nThe difference between the candidates was clear during a debate last month. Higgins called immigration enforcement in Miami “cruel and inhumane” and criticised the detention centre opened by Florida Governor Ron DeSantis, commonly known as “Alligator Alcatraz”.\n\nIn that same debate, her opponent, Gonzalez, said he supported federal law enforcement rounding up “people who commit crimes”.\n\n“I support putting down migrant criminals, I cannot in good conscience fight with the federal government and defend a rapist or a murderer,” Gonzalez added.\n\nHiggins repeated her message in an interview with El Pais this week, drawing a sharp contrast with Trump’s approach.\n\n“He and I have very different points of view on how we should treat our residents, many of whom are immigrants,” she said.\n\n“That is the strength of this community. We are an immigrant-based place. That’s our uniqueness. That’s what makes us special.”\n\nAffordability was also a major issue in the race. Higgins focused her campaign on local concerns such as housing costs, while Gonzalez campaigned on repealing Miami’s homestead property tax and streamlining business permits.\n\n“My opponent is keen on building, building, building,” Gonzalez told CNN. “She wants to put a skyscraper in every corner … then calling it affordable housing, which is a misnomer, because very rarely is it truly affordable.”\n\nDuring a speech in Pennsylvania on Tuesday, Trump raised the issue of affordability, which Democrats have highlighted. He blamed high prices on his predecessor, Joe Biden.\n\nThe cost of living has been on the election campaign agenda in recent gubernatorial and mayoral elections in which Democrats have made gains, including the much-publicised New York mayoral election. The Democratic wins show that the issue has resonated with voters.\n\nWho is Eileen Higgins?\n\nHiggins is Miami’s first non-Hispanic mayor in nearly three decades. Born in Ohio and raised in Albuquerque, New Mexico, she earned a Bachelor of Science in mechanical engineering from the University of New Mexico and later completed an MBA at Cornell University.\n\nBefore becoming mayor, Higgins represented a politically conservative district that includes Little Havana, the city’s well-known Cuban enclave.\n\nShe has embraced the nickname “La Gringa,” a term commonly used in Spanish to refer to white Americans.\n\nHer professional background spans international development and consulting, with a focus on infrastructure and transportation projects across Latin America. She later served as Peace Corps country director in Belize and went on to work as a foreign service officer for the United States Department of State, where her portfolio included diplomatic and economic development efforts in countries such as Mexico and South Africa.\n\nAfter her government service, Higgins returned to the private sector before eventually entering local politics in Miami.","url":"https://guyanainquirer.com/who-is-eileen-higgins-the-first-democratric-mayor-of-miami-in-30-years/","image":"https://guyanainquirer.com/app/uploads/2025/12/AP25344043213577-1765336357-6p5PEx.jpg","video":null,"publish_date":"2025-12-10 10:24:06","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":0.062},{"id":386770622,"title":"Who is Eileen Higgins, the first Democratric mayor of Miami in 30 years?  - Haiti Gazette – Daily Haiti News","text":"Miami voters on Tuesday elected Democrat Eileen Higgins as mayor, ending a nearly three-decade dry spell for her party after she defeated a Republican endorsed by Donald Trump in the predominantly Hispanic city.\n\nWhile the election was officially nonpartisan, the race took on national significance, pitting Higgins against Republican Emilio Gonzalez, a former Miami city manager, in a contest closely watched by both parties.\n\nThe win comes in the wake of recent electoral success achieved by the Democratic Party ahead of next year’s midterm elections.\n\nHere is what we know:\n\nWhat were the final results of the Miami election?\n\nHiggins led Republican Gonzalez 59 percent to 41 percent on Tuesday night, according to preliminary results from the Miami-Dade County Supervisor of Elections Office. She is the first woman ever elected as mayor in the city.\n\nShe won Tuesday’s run-off after leading the first round of voting on November 4 with 35 percent of the vote to Gonzalez’s 19 percent.\n\n“Tonight, the people of Miami made history,” Higgins said in a statement. “Together, we turned the page on years of chaos and corruption and opened the door to a new era for our city.”\n\nHiggins’ victory adds to a run of recent Democratic wins, including races in New Jersey and Virginia, as the party looks towards the 2026 midterms. That trend continued with strong results in November’s off-year elections and a solid showing in this month’s special House race in Tennessee.\n\nWhile Miami’s mayor wields limited formal power, the role is highly symbolic, representing a city with a large Latino population at the centre of national immigration debates.\n\nHome to roughly half a million residents, Miami is Florida’s second-most populous city after Jacksonville. In recent election cycles, it has shifted towards Republicans, making a Democratic win stand out even more. Trump had won Miami-Dade County in the 2024 presidential election against her Democratic rival Kamala Harris.\n\nHispanic or Latino residents make up roughly 70 percent of Miami’s population. In Miami-Dade County overall, about 69–70 percent of residents identify as Hispanic or Latino – a demographic majority that significantly shapes the region’s cultural and political identity.\n\nWhat are some of the key issues of this campaign?\n\nImmigration was a key issue in Higgins’ campaign.\n\nIn Miami, she often talked about Donald Trump’s immigration crackdown, saying she heard from residents who were worried about family members being detained. She described the election as a referendum on the president’s policies, which have caused concerns about due process.\n\nMore than 200,000 people have been arrested since Trump launched the crackdown on migrants in January. At least 75,000 people, who were arrested as part of Trump’s fight against gang members and criminals, had no criminal records, according to new data. He has deported hundreds of migrants and halted asylum and green card applications.\n\nThe Trump administration had also ordered the arrest of several students who participated in protests against Israel’s genocidal war on Gaza. Several of them have since been released by the courts.\n\nThe difference between the candidates was clear during a debate last month. Higgins called immigration enforcement in Miami “cruel and inhumane” and criticised the detention centre opened by Florida Governor Ron DeSantis, commonly known as “Alligator Alcatraz”.\n\nIn that same debate, her opponent, Gonzalez, said he supported federal law enforcement rounding up “people who commit crimes”.\n\n“I support putting down migrant criminals, I cannot in good conscience fight with the federal government and defend a rapist or a murderer,” Gonzalez added.\n\nHiggins repeated her message in an interview with El Pais this week, drawing a sharp contrast with Trump’s approach.\n\n“He and I have very different points of view on how we should treat our residents, many of whom are immigrants,” she said.\n\n“That is the strength of this community. We are an immigrant-based place. That’s our uniqueness. That’s what makes us special.”\n\nAffordability was also a major issue in the race. Higgins focused her campaign on local concerns such as housing costs, while Gonzalez campaigned on repealing Miami’s homestead property tax and streamlining business permits.\n\n“My opponent is keen on building, building, building,” Gonzalez told CNN. “She wants to put a skyscraper in every corner … then calling it affordable housing, which is a misnomer, because very rarely is it truly affordable.”\n\nDuring a speech in Pennsylvania on Tuesday, Trump raised the issue of affordability, which Democrats have highlighted. He blamed high prices on his predecessor, Joe Biden.\n\nThe cost of living has been on the election campaign agenda in recent gubernatorial and mayoral elections in which Democrats have made gains, including the much-publicised New York mayoral election. The Democratic wins show that the issue has resonated with voters.\n\nWho is Eileen Higgins?\n\nHiggins is Miami’s first non-Hispanic mayor in nearly three decades. Born in Ohio and raised in Albuquerque, New Mexico, she earned a Bachelor of Science in mechanical engineering from the University of New Mexico and later completed an MBA at Cornell University.\n\nBefore becoming mayor, Higgins represented a politically conservative district that includes Little Havana, the city’s well-known Cuban enclave.\n\nShe has embraced the nickname “La Gringa,” a term commonly used in Spanish to refer to white Americans.\n\nHer professional background spans international development and consulting, with a focus on infrastructure and transportation projects across Latin America. She later served as Peace Corps country director in Belize and went on to work as a foreign service officer for the United States Department of State, where her portfolio included diplomatic and economic development efforts in countries such as Mexico and South Africa.\n\nAfter her government service, Higgins returned to the private sector before eventually entering local politics in Miami.","url":"https://haitigazette.com/who-is-eileen-higgins-the-first-democratric-mayor-of-miami-in-30-years/","image":"https://haitigazette.com/app/uploads/2025/12/AP25344043213577-1765336357-9kA0YA.jpg","video":null,"publish_date":"2025-12-10 10:23:35","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ht","sentiment":0.062},{"id":386798320,"title":"Who is Eileen Higgins, the first Democratric mayor of Miami in 30 years?  | Barbados Gazette – Barbados","text":"Miami voters on Tuesday elected Democrat Eileen Higgins as mayor, ending a nearly three-decade dry spell for her party after she defeated a Republican endorsed by Donald Trump in the predominantly Hispanic city.\n\nWhile the election was officially nonpartisan, the race took on national significance, pitting Higgins against Republican Emilio Gonzalez, a former Miami city manager, in a contest closely watched by both parties.\n\nThe win comes in the wake of recent electoral success achieved by the Democratic Party ahead of next year’s midterm elections.\n\nHere is what we know:\n\nWhat were the final results of the Miami election?\n\nHiggins led Republican Gonzalez 59 percent to 41 percent on Tuesday night, according to preliminary results from the Miami-Dade County Supervisor of Elections Office. She is the first woman ever elected as mayor in the city.\n\nShe won Tuesday’s run-off after leading the first round of voting on November 4 with 35 percent of the vote to Gonzalez’s 19 percent.\n\n“Tonight, the people of Miami made history,” Higgins said in a statement. “Together, we turned the page on years of chaos and corruption and opened the door to a new era for our city.”\n\nHiggins’ victory adds to a run of recent Democratic wins, including races in New Jersey and Virginia, as the party looks towards the 2026 midterms. That trend continued with strong results in November’s off-year elections and a solid showing in this month’s special House race in Tennessee.\n\nWhile Miami’s mayor wields limited formal power, the role is highly symbolic, representing a city with a large Latino population at the centre of national immigration debates.\n\nHome to roughly half a million residents, Miami is Florida’s second-most populous city after Jacksonville. In recent election cycles, it has shifted towards Republicans, making a Democratic win stand out even more. Trump had won Miami-Dade County in the 2024 presidential election against her Democratic rival Kamala Harris.\n\nHispanic or Latino residents make up roughly 70 percent of Miami’s population. In Miami-Dade County overall, about 69–70 percent of residents identify as Hispanic or Latino – a demographic majority that significantly shapes the region’s cultural and political identity.\n\nWhat are some of the key issues of this campaign?\n\nImmigration was a key issue in Higgins’ campaign.\n\nIn Miami, she often talked about Donald Trump’s immigration crackdown, saying she heard from residents who were worried about family members being detained. She described the election as a referendum on the president’s policies, which have caused concerns about due process.\n\nMore than 200,000 people have been arrested since Trump launched the crackdown on migrants in January. At least 75,000 people, who were arrested as part of Trump’s fight against gang members and criminals, had no criminal records, according to new data. He has deported hundreds of migrants and halted asylum and green card applications.\n\nThe Trump administration had also ordered the arrest of several students who participated in protests against Israel’s genocidal war on Gaza. Several of them have since been released by the courts.\n\nThe difference between the candidates was clear during a debate last month. Higgins called immigration enforcement in Miami “cruel and inhumane” and criticised the detention centre opened by Florida Governor Ron DeSantis, commonly known as “Alligator Alcatraz”.\n\nIn that same debate, her opponent, Gonzalez, said he supported federal law enforcement rounding up “people who commit crimes”.\n\n“I support putting down migrant criminals, I cannot in good conscience fight with the federal government and defend a rapist or a murderer,” Gonzalez added.\n\nHiggins repeated her message in an interview with El Pais this week, drawing a sharp contrast with Trump’s approach.\n\n“He and I have very different points of view on how we should treat our residents, many of whom are immigrants,” she said.\n\n“That is the strength of this community. We are an immigrant-based place. That’s our uniqueness. That’s what makes us special.”\n\nAffordability was also a major issue in the race. Higgins focused her campaign on local concerns such as housing costs, while Gonzalez campaigned on repealing Miami’s homestead property tax and streamlining business permits.\n\n“My opponent is keen on building, building, building,” Gonzalez told CNN. “She wants to put a skyscraper in every corner … then calling it affordable housing, which is a misnomer, because very rarely is it truly affordable.”\n\nDuring a speech in Pennsylvania on Tuesday, Trump raised the issue of affordability, which Democrats have highlighted. He blamed high prices on his predecessor, Joe Biden.\n\nThe cost of living has been on the election campaign agenda in recent gubernatorial and mayoral elections in which Democrats have made gains, including the much-publicised New York mayoral election. The Democratic wins show that the issue has resonated with voters.\n\nWho is Eileen Higgins?\n\nHiggins is Miami’s first non-Hispanic mayor in nearly three decades. Born in Ohio and raised in Albuquerque, New Mexico, she earned a Bachelor of Science in mechanical engineering from the University of New Mexico and later completed an MBA at Cornell University.\n\nBefore becoming mayor, Higgins represented a politically conservative district that includes Little Havana, the city’s well-known Cuban enclave.\n\nShe has embraced the nickname “La Gringa,” a term commonly used in Spanish to refer to white Americans.\n\nHer professional background spans international development and consulting, with a focus on infrastructure and transportation projects across Latin America. She later served as Peace Corps country director in Belize and went on to work as a foreign service officer for the United States Department of State, where her portfolio included diplomatic and economic development efforts in countries such as Mexico and South Africa.\n\nAfter her government service, Higgins returned to the private sector before eventually entering local politics in Miami.","url":"https://barbadosgazette.com/who-is-eileen-higgins-the-first-democratric-mayor-of-miami-in-30-years/","image":"https://barbadosgazette.com/app/uploads/2025/12/AP25344043213577-1765336357-1bAOua.jpg","video":null,"publish_date":"2025-12-10 10:22:33","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bb","sentiment":0.062}]}