{"offset":0,"number":50,"available":348,"news":[{"id":388838598,"title":"CBS slips Trump's name into Kennedy Center Honors broadcast via voiceover amid rebranding controversy","text":"While the Kennedy Center Honors held its annual ceremony before the prestigious institution's board voted to add President Donald Trump's name to its title, CBS still found a way to honor the controversial name-change during its broadcast.\n\n When the ceremony, which took place in Washington D.C. on Dec. 7, aired Tuesday evening on CBS, the network added a voiceover declaring, \"And now, the Trump Kennedy Center Honors on CBS,\" while a title card flashed reading, \"The following is a Donald J. Trump and Kennedy Center Production.\"\n\n Trump then took the stage, becoming the first sitting president to host the ceremony. But according to The Washington Post, CBS significantly cut Trump's 12-minute opening monologue to a mere two minutes, removing a joke about the crowd being full of \"miserable, horrible people.\"\n\n The network's news division also reportedly implemented a policy to omit Trump's name from the Kennedy Center name in ongoing coverage, according to the Post. \n\n \"On Tuesday, CBS will broadcast the annual Kennedy Center Honors,\" wrote CBS News senior director of standards and practices Jack Renaud in an email to his colleagues, which the Post says it obtained ahead of the ceremony. \"Yesterday, the newly appointed board of the Kennedy Center voted to change the facility's name to the Trump-Kennedy Center... But it would take Congressional approval to officially change the name.\"\n\n Renaud then concluded, according to the outlet, \"Therefore, CBS News will continue to use the 'Kennedy Center,'\" adding that \"if the president or other administration officials use the new name in a soundbite, that is their prerogative.\"\n\n Entertainment Weekly has reached out to representatives for the White House and CBS.\n\n Trump has made much of the Kennedy Center name change after the institution's board \"voted unanimously\" to approve it, as White House Press Secretary Karoline Leavitt noted in a Dec. 18 social media post. But Ohio Congresswoman Joyce Beatty, who sits on the board, disputed that claim, saying she was prevented from casting her true vote.\n\n \"For the record. This was not unanimous,\" she explained in a response to Leavitt's post. \"I was muted on the call and not allowed to speak or voice my opposition to this move. Also, for the record, this was not on the agenda. This was not consensus. This is censorship.\"\n\n Still, Trump trumpeted the broadcast of the \"TRUMP KENNEDY CENTER HONORS\" in a post to his Truth Social platform on Tuesday, hours before the ceremony was to take place.\n\n Get your daily dose of entertainment news, celebrity updates, and what to watch with our EW Dispatch newsletter.\n\n This is the latest development in the ongoing conflict between Trump and CBS. The network's parent company, Paramount Global, agreed in July to pay the president $16 million to settle his lawsuit over the editing of a 60 Minutes interview with his 2024 presidential opponent, Kamala Harris. That same month, the network made the unprecedented move of axing The Late Show With Stephen Colbert, following Trump's continuous criticism of its host.\n\n Some critics characterized the move as Paramount's attempt to silence one of the president's most prominent critics ahead of their bid to merge with Skydance Media, which was founded by Trump backer David Ellison.\n\n The effects of a new, Trump-friendly regime at Paramount can already be felt at CBS News, which landed in hot water this month after new boss Bari Weiss pulled a segment covering the Trump administration's new policy of deporting Venezuelan men to CECOT, a notorious, maximum-security prison in El Salvador.\n\n Longtime 60 Minutes correspondent Sharyn Alfonsi slammed the decision as \"political,\" warning that even the venerable investigative news program now faces the prospect of going \"from an investigative powerhouse to a stenographer for the state.\"","summary":"Trump became the first sitting president to preside over the annual ceremony, which has become embroiled in controversy over his push to add his name to the institution's title.","url":"https://ew.com/cbs-adds-trump-kennedy-center-honors-broadcast-voiceover-rebranding-controversy-11876030","image":"https://ew.com/thmb/zhk52k3ESI0kEo1qRBuopFR2bzo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Donald-Trump-48TH-ANNUAL-KENNEDY-CENTER-HONORS-2025-122425-11f2c34aa627475592e0e4e9d911a22d.jpg","video":null,"publish_date":"2025-12-25 00:21:42","author":"Ryan Coleman","authors":["Ryan Coleman"],"language":"en","source_country":"US","sentiment":-0.066},{"id":388839216,"title":"Donald Trump Takes Call from Child for Christmas, Brags About Winning Pennsylvania 'Actually Three Times'","text":"President Donald Trump bragged about his election victories while taking calls from children on Christmas Eve.\n\n On Wednesday, Dec. 24, the president and first lady Melania Trump celebrated Christmas at Mar-a-Lago in Palm Beach, Fla. There, they participated in NORAD Santa Claus calls, accepting calls from children across the nation.\n\n When a child from Pennsylvania called, Trump, 79, told him his home state was \"great.\"\n\n “We won Pennsylvania — actually, three times,” the president continued. “We won it in a landslide. So I love Pennsylvania.”\n\n Trump did win Pennsylvania in the 2016 and 2024 elections, but not in 2020.\n\n In 2016, he earned 48.2% of the votes, while Hillary Clinton earned 47.5%, per The New York Times. Four years later, former President Joe Biden won the state by a 1.17% margin, the Pennsylvania Capital-Star reported.\n\n In 2024, Trump defeated former Vice President Kamala Harris, after earning 3,543,308 votes, while Harris received 3,423,042, per The New York Times.\n\n Trump also told a child from Oklahoma that their state was \"very good to me in the election,\" and that they should \"never leave Oklahoma.\" (Trump won Oklahoma in three consecutive presidential elections, and the state hasn't gone to a Democrat since 1964.)\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. \n\n The president’s comments this holiday season follow his newsworthy Christmas conversation during his first term. In 2018, he spoke with Collman Lloyd, a 7-year-old girl from South Carolina, who talked about her plan to leave Santa Claus treats, according to a video obtained by Post and Courier and WISTV.\n\n But the president had an unusual response, saying, “Well, you just have a good time. Are you still a believer in Santa?” She confirmed she did, and he responded, “Because at 7, it’s marginal, right?” \n\n Trump's comments on Wednesday are similar to his remarks in November about West Virginia following the death of U.S. Army Specialist Sarah Beckstrom.\n\n The 20-year-old West Virginia National Guard member and Staff Sgt. Andrew Wolfe, 24, were shot and killed near the White House on Nov. 26. When Trump was asked if he would attend Beckstrom’s funeral, he commented on her home state. \n\n “I hadn’t thought about it yet, but it certainly is something I could conceive of,” Trump replied, then adding, “I love West Virginia. You know I won West Virginia by one of the biggest margins of any president anywhere.\" \n\n “These are great people. I love the people of West Virginia. I love the people of our country,\" he said. \"But I haven't given it any thought, but it sounds like something I could do.”\n\n Although Trump did not attend Beckstrom's funeral on Dec. 9, he did offer invitations to both soldiers’ parents to visit the White House, NBC News reported. Wolfe's family visited Trump on Dec. 4 and posed for a picture with him in the Oval Office.","summary":"While Trump won Pennsylvania in 2016 and 2024, former President Joe Biden won the state in 2020","url":"https://people.com/donald-trump-calls-child-christmas-brags-about-winning-pennsylvania-11876057","image":"https://people.com/thmb/VAHsNZLdlVbniHzoQ8WgAup1ZU0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(721x363:723x365)/Donald-Trump-NORAD-Santa-Calls-2025-122425-75da5b1c77784511b0dcb55b479de03d.jpg","video":null,"publish_date":"2025-12-25 00:18:30","author":"Charna Flam","authors":["Charna Flam"],"language":"en","source_country":"US","sentiment":-0.178},{"id":388841704,"title":"Bari Weiss Is Everything Today’s Journalists Hate","text":"Looking back on that now, she was a rare duck, and I sometimes wonder if I should reach out to her to ask what her views are on the current state of journalism. Perhaps I don't want to know the answer. It's been more than two decades, and people change.\n\nBut I would love to hear her take on Bari Weiss, who is committing flagrant acts of journalism over at CBS, much to the dismay and downright irritation of the other members of her profession. Weiss, hardly a conservative, worked for The New York Times. She left because the publication couldn't tolerate running a dissenting op-ed by Senator Tom Cotton. It was the right call, but I notice that no one hailed her bravery when she resigned. They saved that for the Jennifer Rubins of the world, when Rubin and her ilk left places like The Washington Post because they wouldn't endorse Kamala Harris, or any political candidate, last year.\n\nAfter leaving The New York TImes, Weiss built The Free Press from the ground up and on the principles of \"honesty, doggedness, and fierce independence.\" For her hard work, CBS and Paramount bought The Free Press and gave Weiss a much-deserved editorial role at CBS.\n\nThe past few days have also proven that Weiss is a much-needed presence at CBS.\n\nEarlier this week, Weiss spiked a story about CECOT, the El Salvadorian prison where the Trump administration is sending some illegal immigrants. She wrote a memo explaining what she'd like staff to do before running the story. Her requests were simple.\n\n\"If we're going to run another story about a topic that has by now been much-covered we need to advance it,\" her memo read. Among the ways to do so: does anyone in the administration or anyone prominent who defended the use of the Alien Enemies Act now regret it in light of what these Venezuelans endured at CECOT? That's a question I'd like to see asked and answered.\"\n\nWeiss also noted the story did not \"present the administration's argument for why it sent 252 Venezuelans to CECOT\" and asked, \"Isn't there much more to ask in light of the torture that we are revealing?\" She pushed to get principals like Stephen Miller and Tom Homan on the record. She urged a deeper dive into what CBS knows about the Venezuelans, too. Notably, she pointed out the semantic game: \"The data we present paints an incongruent picture,\" Weiss wrote. Of the 252 Venezuelans sent to CECOT, we say nearly half have no criminal histories. In other words, more than half do have criminal histories. We should spend a beat explaining this.\"\n\nAll of these things are more than reasonable requests. But the reaction of CBS staff shows they're not used to having an editor who does her job. Correspondent and producer Sharyn Alfonsi accused Weiss of pulling the story because of \"political reasons.\" Alfonis claims 60 Minutes tried to speak to Stephen Miller, who (along with other Trump officials) refused to talk to the network.\n\nTurns out that was a lie, too. Axios reported that the White House, State Department, and Department of Homeland Security all provided on-record comments to CBS, and not one of those comments made it into the 60 Minutes segment that was eventually leaked to Canadian networks. \n\nThis wasn't Alfonsi's first brush with problematic reporting, either. She was the reporter who ran a misleading piece on Ron DeSantis during COVID, alleging wrongdoing when DeSantis paired up with Publix to offer the COVID vaccine.\n\nBut the most offensive meltdown of all comes from Peter Rothpletz. In a none-too-subtle piece titled \"Bury Weiss\" (seems a bit threatening, no?), Rothpletz calls Weiss \"the faux-free speech warrior, faux-queer rights advocate, and arguably faux-journalist.\"\n\n“Over the last 48 hours, the faux-free speech warrior, faux-queer rights advocate, and arguably faux-journalist “editor-in-chief” of CBS News decided to drop the mask; she opted to go full fash, as the kids say.” - ⁦@PeterTwinklage⁩ for First Draft: https://t.co/Q9tdDGGNBl— Mehdi Hasan (@mehdirhasan) December 23, 2025\n\nI liken this to a child who has spent his whole life being indulged and spoiled. Raised by parents who didn't know how to say \"No,\" the first time that spoiled brat is denied what he wants, he throws a tantrum. He doesn't know how to function in a world where he doesn't get his way.\n\nJournalists, for far too long, have gotten away with not only injecting their politics into every noun, verb, and adjective of their \"news\" stories, but they also never offer pushback against Democrats — hence why I call them stenographers — and they gladly parrot DNC talking points like the propagandists they are. Now that someone is asking them to do the most basic, fundamental duties of their job, they're appalled that they can't continue their incestuous relationship with the Democratic Party.\n\nNow Bari Weiss is trying to save her industry from self-destruction, and she's being attacked for it. Weiss, for her part, is unfazed:\n\nMy job is to make sure that all stories we publish are the best they can be. Holding stories that aren’t ready for whatever reason — that they lack sufficient context, say, or that they are missing critical voices — happens every day in every newsroom. I look forward to airing this important piece when it’s ready.\n\nMany years ago, President Trump called the media the enemy of the people, and he was right.\n\nBut they're also the enemy of actual journalists like Bari Weiss.","url":"https://townhall.com/tipsheet/amy-curtis/2025/12/24/vip-journalistic-integrity-n2668437","image":"https://media.townhall.com/cdn/hodl/2024/53/c303f02b-9fd9-438e-9401-7a7399906eeb.jpg","video":null,"publish_date":"2025-12-24 23:30:27","author":"Amy Curtis","authors":["Amy Curtis"],"language":"en","source_country":"us","sentiment":-0.142},{"id":388834056,"title":"Lara Trump says 'scrambling' Democratic Party in a 'bit of a pickle' over next star","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle December 24, 2025 05:26 \n\n Lara Trump says 'scrambling' Democratic Party in a 'bit of a pickle' over next star \n Fox News host Lara Trump sets the record straight on the Democratic Party's potential rising star and mocks former Vice President Kamala Harris' dating advice on 'The Ingraham Angle.'\n Tags POLITICSSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE INGRAHAM ANGLEV-VIDEOKAMALA HARRISMEDIADEMOCRAT ELECTIONSGOVERNORSKENTUCKY","summary":"Fox News host Lara Trump sets the record straight on the Democratic Party&apos;s potential rising star and mocks former Vice President Kamala Harris&apos; dating advice on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6386919415112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/683a9127-221f-40a8-a513-438af483d3fb/872e8c20-a3a2-48c2-b9a3-83ef6f69f112/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-12-24 22:31:04","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.375},{"id":388825844,"title":"Trump says comedian Colbert should be ‘put to sleep’","text":"CBS called the cancellation of Stephen Colbert's show 'a purely financial decision'. (CBS pic)\nWASHINGTON: On the eve of Christmas, President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a \"pathetic trainwreck\" who should be \"put to sleep\".\nColbert's \"The Late Show\" is scheduled to end in May 2026, a decision his fans say smacks of censorship.\nIn a late night Truth Social post, Trump wrote that Colbert \"has actually gotten worse\" since being \"terminated by CBS, but left out to dry\".\n\"Stephen is running on hatred and fumes ~ A dead man walking! CBS should, 'put him to sleep,' NOW,\" Trump wrote.\nColbert has hosted the \"The Late Show\" since 2015 and it has been the highest-rated late night talk show on US television. His opening monologues often take aim at the Republican president.\nThere was no immediate public response from Colbert or CBS to Trump's post.\nCBS announced the sunsetting of Colbert's show after one more season in July, the same month its parent company reached a US$16 million settlement with Trump. CBS called the cancellation \"a purely financial decision.\"\nTrump had sued Paramount, alleging that CBS News' \"60 Minutes\" program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favor.\nIn another overnight post, Trump repeated threats to yank the broadcast licenses of networks whose content he deemed overly critical.\n\"If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!\"\nOn Sunday, CBS's new editor-in-chief, Bari Weiss, pulled a \"60 Minutes\" segment on alleged torture at El Salvador's Cecot prison - where Trump sent hundreds of deported Venezuelans - saying it needed more reporting.\nIn August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract.\nKimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.\nTrump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives.\nHis appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that \"the FCC is not formally an independent agency,\" implying that his actions could justifiably be aligned with the political priorities of the White House.","summary":"Stephen Colbert's 'The Late Show' is scheduled to end in May 2026, a decision his fans say smacks of censorship.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/12/25/trump-says-comedian-colbert-should-be-put-to-sleep","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/999fdaff-stephen-colbert-1.jpg","video":null,"publish_date":"2025-12-24 21:50:50","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.208},{"id":388824798,"title":"Former MN Gov. Tim Pawlenty says 2026 is ‘best chance’ for GOP to win statewide","text":"Tim Pawlenty was the last Republican to win statewide office after he was re-elected to his second term as Minnesota’s governor in 2006.\n\nThe former governor thinks 2026 might be Minnesota Republicans’ “best chance” to achieve the same feat 20 years later, he told Forum News Service in November.\n\nThe GOP race is crowded, with MyPillow founder Mike Lindell, House Speaker Lisa Demuth, state Rep. Kristin Robbins, attorney Chris Madel, and previous gubernatorial candidates Kendall Qualls and physician Scott Jensen.\n\n“The 2026 elections are the best chance for Republicans to win statewide here in a long time. Those chances will be impacted by (President Donald) Trump and (Gov. Tim) Walz’s popularity a year from now, the state of the economy, whether key consumer items are affordable, the quality of our candidates, and the growing sense things are off track in Minnesota,” Pawlenty wrote in an email.\n\n‘Political climate more polarized’\n\nLast year, a few Republicans and former Republicans declared themselves in support of former Vice President Kamala Harris for president.\n\nPawlenty was not one of them, but when asked to reflect on the “Republicans for Harris wave,” he said, “If you haven’t closed a sale with your product in nearly 20 years, it’s long past the time to get a better product, better marketing, or both.”\n\nPawlenty said he thinks Republicans currently in office have done a good job addressing “concerns about illegal immigration, crime, out-of-control wokeness and more,” but that more efforts are needed toward affordability.\n\n“Almost nothing stays the same in politics for long, and recent changes have featured MAGA taking over the Republican Party and socialists taking over the Democratic Party. The political climate is now markedly more polarized than when I was governor,” he wrote.\n\nDuring his tenure, Pawlenty focused on not raising taxes. He turned a budget deficit into a surplus — that later turned into a budget deficit. He passed a concealed carry law, and oversaw major infrastructure projects like the Northstar Commuter Rail and Target Field.\n\nBefore he was governor, he served 10 years in the Minnesota Legislature. He also had an unsuccessful run for the 2012 Republican nomination for president in 2010. He finished second to former Alaska Gov. Sarah Palin to be U.S. Sen. John McCain’s presidential running mate in 2008. Pawlenty sought a third term as governor in 2018 but lost the Republican primary to Jeff Johnson.\n\n‘A chilling effect on our discourse’\n\nNow, Pawlenty serves on various boards, periodically writes and speaks about policy and politics, and sometimes appears on cable news shows.\n\nTwo of those appearances were on Twin Cities-based KARE 11 in the wake of the June 14 Minnesota lawmaker shootings.\n\nIn one appearance on June 18, he provided context on misinformation regarding the appointment of accused assassin Vance Boelter to a government board. In another appearance on June 14, he said Minnesota’s “civic and political fabric seems to be so torn.”\n\n“It’s going to have a chilling effect on our discourse, on our political leaders, but importantly, also their families,” Pawlenty said on KARE 11. “Can you imagine being the child or a spouse, a significant other, of a political leader in this environment — every time you open the door, every time you go to the grocery store, you don’t know who is just going to question you or who might harm you?”\n\nFraud cases\n\nOn Dec. 5, he weighed in on Minnesota’s fraud investigations and the rhetoric about Minnesota’s Somali community that has followed.\n\n“Over 80 people have been charged … criminally for that fraud, and the vast majority of almost all of them are, in fact, Somali,” he said on News Nation. “So we don’t want to stigmatize any group because they belong to an ethnic group or another group, but we also don’t want to excuse illegal behavior or misconduct because they’re in that group.”\n\nWhen asked about how the current administration has handled the issue, Pawlenty responded, “There’s no question … that the early signals around this fraud were ignored.”\n\nWhen Forum News Service asked what’s ahead for him, Pawlenty didn’t rule out all elected office but did comment on one 2026 race.\n\n“While I’ve been asked to run for the U.S. Senate, I don’t think I could win my party’s endorsement at the convention or in a primary because I guess I’m now viewed as too ‘mainstream’ — which I find kinda funny,” he wrote.","summary":"The former governor discussed what he is up to these days and his reflections on the current state of politics.","url":"https://www.twincities.com/2025/12/24/former-mn-gov-tim-pawlenty-says-2026-is-best-chance-for-gop-to-win-statewide/","image":"https://www.twincities.com/wp-content/uploads/2018/04/jmp-005-0183-pawlenty.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-24 21:41:50","author":"Mary Murphy","authors":["Mary Murphy"],"language":"en","source_country":"us","sentiment":-0.043},{"id":388819136,"title":"Struggling student loan borrowers get screwed before Christmas","text":"The Trump administration will officially begin garnishing wages from people who default on their student loans, the Department of Education announced on Tuesday—a move that could impact millions of Americans.\n\nAccording to a report from CNN, the Department of Education will direct employers in January to begin withholding employees' income if they have not made payments on their federal student loans for 270 days. The garnishment will begin with 1,000 borrowers in default, and will gradually increase, the Department of Education told CNN in a statement.\n\nThe DOE first announced in April that it planned to resume student loan collection, ending the pause that was started in March 2020 during the pandemic and extended by former President Joe Biden. \n\nRelated | Education chief is hyped to body-slam student loan borrowers\n\nAt the time of the announcement, more than 5.3 million borrowers were in default, with another 4 million in late-stage delinquency by being between 91 to 180 days late on payments. \n\nThat means the Trump administration, ahead of the holidays, just told as many as 9 million people—who are already struggling with the high cost of living that Trump has failed to address—that their lives are about to get even harder.\n\nThis is just the latest way the Trump administration is screwing over student loan borrowers.\n\nEarlier this month, the Trump administration announced it is ending the Saving on a Valuable Education program, which lowered student loan payments and ultimately forgave loans of less than $12,000 after a decade. In November, Trump also modified the Public Service Loan Forgiveness program to arbitrarily decide who is no longer eligible for loan forgiveness.\n\nOf course, Biden had worked to bring relief to the millions of student loan borrowers, but was blocked by the conservative justices on the Supreme Court from doing so. \n\nDuring the 2024 election, then Vice President Kamala Harris had warned voters that student loan debt relief initiatives would be in danger if Trump was elected. But millions of young voters ignored the warning and voted for Trump anyway.\n\nNow that he’s in office, Harris’ warnings are coming true. \n\nIt's no wonder that Trump's approval with younger voters is plummeting.\nAn Economist/YouGov poll released Tuesday found just 26% of Americans aged 18 to 29 approve of the way Trump is handling his job. Among Americans aged 30 to 44, his approval is not much better at a dismal 36%.","summary":"The Trump administration will officially begin garnishing wages from people who default on their student loans, the Department of Education announced on Tuesday—a move that could impact millions of Americans.\n\n\n\nAccording to a report from CNN, the Department of Education will direct employers in January to begin withholding employees' income if they have not made payments on their federal student loans for 270 days. The garnishment will begin with 1,000 borrowers in default, and will gradually increase, the Department of Education told CNN in a statement.\n\n\n\nThe DOE first announced in April that it planned to resume student loan collection, ending the pause that was started in March 2020 during the pandemic and extended by former President Joe Biden. \n\n\n\n\nRelated | Education chief is hyped to body-slam student loan borrowers\n\n\n\n\nAt the time of the announcement, more than 5.3 million borrowers were in default, with another 4 million in late-stage delinquency by being between 91 to 180 days late on payments. \n\n","url":"https://www.dailykos.com/story/2025/12/24/2359902/-Struggling-student-loan-borrowers-get-screwed-before-Christmas?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1510844/story_image/AP03051005862.jpg?1766588680","video":null,"publish_date":"2025-12-24 20:00:19","author":"Emily Singer","authors":["Emily Singer"],"language":"en","source_country":"US","sentiment":-0.31},{"id":388815860,"title":"Another Left-Wing Judge Just Decided He's Got More Authority Than President Trump","text":"On March 23, President Trump revoked the security clearances of several Biden administration officials and others, including Joe Biden, Kamala Harris, and Hillary Clinton.\n\nIn a memo revoking security clearances, President Trump wrote, \"I have determined that it is no longer in the national interest for the following individuals to access classified information.\"\n\nOne of the people whose security clearance was revoked is attorney Mark Zaid. Zaid was one of the attorneys for Susan Monarez, the former director of the Centers for Disease Control and Prevention. Monarez was removed from that position in August.\n\nIn May, Zaid sued the Trump administration, with ABC describing Zaid as a \"whistleblower attorney\" who claimed his security clearance was revoked for \"improper political retribution.\"\n\nIn response to that suit, White House spokesman Harrison Fields said, \"The decision to grant any individual access to this nation's secrets is a sensitive judgment call entrusted to the President. Weighing these factors and implementing such decisions are core executive powers, and reviewing the President's clearance decisions falls well beyond the judiciary's authority.\"\n\nNow a radical Leftist judge has ruled that President Trump cannot revoke Zaid's security clearance.\n\nIt's a move attorney Mike Davis called \"lawless and dangerous.\"\n\nThis is one of the most lawless and dangerous orders yet.Biden DC U.S. District Judge Amir Hatem Mahdy Ali, the first Muslim and Arab DC judge, ordered the President's aides to ignore his executive order revoking a security clearance.Judge Ali, who is still a foreign citizen,… https://t.co/UstLz2B8Dz pic.twitter.com/D8WXReOB6j— 🇺🇸 Mike Davis 🇺🇸 (@mrddmia) December 24, 2025\n\n\"Judge Ali, who is still a foreign citizen, previously ordered the President could not perform a national security review of $2 billion in foreign aid,\" Davis wrote.\n\nWhen Ali ruled in that case, Davis sounded the alarm on his radical ties and background, writing, \"In the lame-duck session after Democrats lost the White House and Senate on November 5, 2024, Senate Democrats confirmed Ali on November 20 with a vote of 50-49.\"\n\n39-year-old Canadian-born Amir Hatem Mahdy Ali, the first Muslim and Arab DC judge, clerked on the Supreme Court of Canada and later led a radical leftwing group that called for defunding the police.In the lame-duck session after Democrats lost the White House and Senate on… https://t.co/obAiwgMllH pic.twitter.com/HaWGzY82tg— 🇺🇸 Mike Davis 🇺🇸 (@mrddmia) February 26, 2025\n\nDavis also notes that Ali, born in Canada, clerked for the Canadian Supreme Court and led a Leftist group that called for defunding the police.\n\nAs President, Article II of the Constitution grants Trump the authority to grant or deny security clearances as he sees fit.\n\n\"Even if there is somehow a 'bad' reason for the denial of security clearance, the remedy is never for a judge to order the transmittal of classified materials to someone over the President's objection. It's clearly unconstitutional. And it is likely espionage,\" Davis wrote in a subsequent social media post.\n\nThe President, as the commander-in-chief, has the Article II constitutional power to grant or deny security clearances to anyone as he sees fit.Even if there is (somehow) a \"bad\" reason for the denial of security clearance, the remedy is never for a judge to order the… https://t.co/pgvmucVTjo— 🇺🇸 Mike Davis 🇺🇸 (@mrddmia) December 24, 2025\n\n\"We need a national Muslim ban now. We're dangerously close to becoming the U.K.,\" wrote one social media user.\n\nWe need a national Muslim ban now. We're dangerously close to becoming the UK.— The Disrespected Trucker (@DisrespectedThe) December 24, 2025\n\n\"When is Congress going to do something about these judges?\" asked another.\n\nWhen is congress going to do something about these judges?— Nurse Patriot (@LABeachGal1) December 24, 2025\n\nConservatives are also calling for Ali's impeachment.\n\n🚨 BREAKING: Conservatives are demanding the IMPEACHMENT of foreign-born Judge Amir Ali after he declared himself PRESIDENT, unilaterally overturning Trump’s order revoking attorney Mark Zaid’s security clearance.The coup is real.This is OUTRAGEOUS. He’s not president. pic.twitter.com/DL8eCy9QN5— Eric Daugherty (@EricLDaugh) December 24, 2025\n\nIn a statement, Zaid said, \"This is not just a victory for me, it’s an indictment of the Trump administration’s attempts to intimidate and silence the legal community, especially lawyers who represent people who dare to question or hold this government accountable.\"\n\nIn a social media post, Zaid also called for a coup against President Trump, as well as his impeachment.\n\nThis Mark Zaid who called for a coup pic.twitter.com/2LRgwv8un3— BirdHunter03🇺🇸 (@midwesthunter03) December 24, 2025\n\nWe're confident the Trump administration will respond to this ruling, and the preliminary injunction doesn't take effect until January 13. Judge Amir's ruling doesn't prohibit the Trump administration from revoking Zaid's security clearance in the future.\n\nEditor's Note: Unelected federal judges are hijacking President Trump's agenda and insulting the will of the people.\n\nHelp us expose out-of-control judges dead set on halting President Trump's mandate for change. Join Townhall VIP and use promo code MERRY74 to get 74% off your membership.","url":"https://townhall.com/tipsheet/amy-curtis/2025/12/24/judge-blocks-stripping-of-security-clearance-n2668455","image":"https://media.townhall.com/cdn/hodl/2025/323/55ca30cf-08a2-4703-abff-502f6a17aed8.jpg","video":null,"publish_date":"2025-12-24 20:00:13","author":"Amy Curtis","authors":["Amy Curtis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.135},{"id":388810706,"title":"Trump says comedian Colbert should be ‘put to sleep’","text":"On the eve of Christmas, President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a “pathetic trainwreck” who should be “put to sleep.”\n\nColbert’s “The Late Show” is scheduled to end in May 2026, a decision his fans say smacks of censorship.\n\nIn a late night Truth Social post, Trump wrote that Colbert “has actually gotten worse” since being “terminated by CBS, but left out to dry.”\n\n“Stephen is running on hatred and fumes ~ A dead man walking! CBS should, ‘put him to sleep,’ NOW,” Trump wrote.\n\nColbert has hosted the “The Late Show” since 2015 and it has been the highest-rated late night talk show on US television. His opening monologues often take aim at the Republican president.\n\nThere was no immediate public response from Colbert or CBS to Trump’s post.\n\nCBS announced the sunsetting of Colbert’s show after one more season in July, the same month its parent company reached a $16 million settlement with Trump. CBS called the cancellation “a purely financial decision.”\n\nTrump had sued Paramount, alleging that CBS News’ “60 Minutes” program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favor.\n\nIn another overnight post, Trump repeated threats to yank the broadcast licenses of networks whose content he deemed overly critical.\n\n“If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!”\n\nOn Sunday, CBS’s new editor-in-chief, Bari Weiss, pulled a “60 Minutes” segment on alleged torture at El Salvador’s CECOT prison -- where Trump sent hundreds of deported Venezuelans -- saying it needed more reporting.\n\nIn August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract.\n\nKimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.\n\nTrump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives.\n\nHis appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that “the FCC is not formally an independent agency,” implying that his actions could justifiably be aligned with the political priorities of the White House.","url":"https://www.ctvnews.ca/entertainment/article/trump-says-comedian-colbert-should-be-put-to-sleep/","image":"https://www.ctvnews.ca/resizer/v2/ESVSHS2IJVG53K7I4EUN3QW52A.jpg?auth=d9ddb01e6a1341a88d6b10ac7635049a8a9ea9a8c2c2f7cf166372355443eb24","video":null,"publish_date":"2025-12-24 19:02:31","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.203},{"id":388790888,"title":"Trump says comedian Colbert should be ‘put to sleep’ | Kuwait Times Newspaper","text":"WASHINGTON: On the eve of Christmas, President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a “pathetic trainwreck” who should be “put to sleep.” Colbert’s “The Late Show” is scheduled to end in May 2026, a decision his fans say smacks of censorship.\n\nIn a late night Truth Social post, Trump wrote that Colbert “has actually gotten worse” since being “terminated by CBS, but left out to dry.” “Stephen is running on hatred and fumes ~ A dead man walking! CBS should, ‘put him to sleep,’ NOW,” Trump wrote.\n\nColbert has hosted the “The Late Show” since 2015 and it has been the highest-rated late night talk show on US television. His opening monologues often take aim at the Republican president. There was no immediate public response from Colbert or CBS to Trump’s post.\n\nCBS announced the sunsetting of Colbert’s show after one more season in July, the same month its parent company reached a $16 million settlement with Trump. CBS called the cancellation “a purely financial decision.”\n\nTrump had sued Paramount, alleging that CBS News’ “60 Minutes” program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favor. In another overnight post, Trump repeated threats to yank the broadcast licenses of networks whose content he deemed overly critical.\n\n“If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!”\n\nOn Sunday, CBS’s new editor-in-chief, Bari Weiss, pulled a “60 Minutes” segment on alleged torture at El Salvador’s CECOT prison - where Trump sent hundreds of deported Venezuelans - saying it needed more reporting.\n\nIn August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract. Kimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.\n\nTrump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives. His appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that “the FCC is not formally an independent agency,” implying that his actions could justifiably be aligned with the political priorities of the White House. — AFP","url":"https://kuwaittimes.com/article/37609/world/america/trump-says-comedian-colbert-should-be-put-to-sleep/","image":"https://kuwaittimes.com/kuwaittimes/uploads/images/2025/12/24/339200.jpg","video":null,"publish_date":"2025-12-24 18:53:00","author":"Kuwait Times","authors":["Kuwait Times"],"language":"en","source_country":"kw","sentiment":-0.213},{"id":388793220,"title":"Trump's TV Tantrum: The Don Threatens to Terminate Networks That Don't Praise Him — After Offering to Leave the Presidency to Be a Full-time Host","text":"Donald Trump went on an unhinged rant where he seemingly threatened the broadcast licenses of TV networks for their overwhelmingly critical coverage of him, RadarOnline.com can reveal. \n\nThe president pointed out how late-night network talk shows have become left-wing echo chambers railing against him, before making a provocative remark about CBS, ABC, and NBC's \"very valuable\" FCC licenses.Broadcast License Termination ThreatTrump shared a post on Truth Social late on Tuesday, December 23, asking, \"Who has the worst Late Night host, CBS, ABC, or NBC??? They all have three things in common: High Salaries, No Talent, REALLY LOW RATINGS!\"\n\nHe followed it up, stating, \"If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!\"\n\nGetting back into the spirit of the season, the president shared one more post before going to bed, wishing followers a \"Merry Christmas.\"Network Payouts to Donald Trump Over LawsuitsTrump isn't entirely off the mark in accusing U.S. broadcast networks of having a strong bias against him.\n\nABC paid Trump $16million to settle a defamation case where anchor George Stephanopoulos sensationally claimed the president had been found \"liable for rape\" in the E. Jean Carroll civil case, an incorrect accusation he repeated no less than 10 times. \n\nIn July, Paramount Global also paid $16million in another civil lawsuit after Trump sued CBS for deceptive practices, alleging that 60 Minutes selectively edited an interview with his then-2024 presidential race opponent, Kamala Harris, to make her answers seem more coherent just weeks before the election.FCC Threats Against Jimmy KimmelTrump's FCC hinted it would flex its muscle when it came to bias claims against Republicans following Turning Point USA founder and MAGA firebrand Charlie Kirk's assassination in September.\n\nABC's Jimmy Kimmel claimed in a monologue that Kirk was killed by a right-wing Trump supporter, even though days earlier, authorities revealed the free speech activist's alleged murderer, Tyler Robinson, had been indoctrinated by far-left ideology.\n\nFCC Chairman Brendan Carr threatened \"immediate action\" against Kimmel, ABC, and Disney for \"deliberately misleading the public\" for the host's untrue claim that \"the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\"\n\nKimmel was pulled off the air 'indefinitely\" by Disney later that day after Carr's comment on a right-wing podcast, although he only ended up being away for a total of six days.Host With the MostTrump's provocative comment about network broadcast licenses came shortly after he seemingly joked about stepping down from office after showing off his hosting skills at the Trump Kennedy Center Honors telecast on CBS. \n\n\"At the request of the Board, and just about everybody else in America, I am hosting the event,\" he boasted on Truth Social\n\nHe added, \"Tell me what you think of my 'Master of Ceremony' abilities. If really good, would you like me to leave the Presidency in order to make 'hosting' a full-time job?\"","summary":"Donald Trump cited overwhelmingly negative coverage on liberal network news and late night shows as reasons to pull their licenses.","url":"https://radaronline.com/p/donald-trump-threatens-to-terminate-network-fcc-licenses/","image":"https://media.radaronline.com/brand-img/1ULu5S1PN/0x0/donald-trump-broadcast-license-threat-1766597011909.jpg","video":null,"publish_date":"2025-12-24 18:30:00","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","category":"politics","source_country":"us","sentiment":-0.369},{"id":388795350,"title":"Kamala Harris savjetovala slobodne djevojke: “Nekad želite vezu petkom navečer, nekad nedjeljom ujutru”","text":"Bivša potpredsjednica Sjedinjenih Američkih Država i kandidatkinja demokrata za Bijelu kuću 2024. godine Kamala Harris tokom gostovanja na jednom podcastu davala je savjete djevojkama koje su same.\n\nBivša potpredsjednica Sjedinjenih Američkih Država i kandidatkinja demokrata za Bijelu kuću 2024. godine Kamala Harris tokom gostovanja na jednom podcastu davala je savjete djevojkama koje su same.\n\n“Izaberi da budeš s nekim ko ti dozvoljava da se smiješ sebi i njima. Izaberi da budeš s nekim za koga znaš da ti se sviđa, da idete zajedno u prodavnicu, da prošetate zajedno”, rekla je.\n\nInače, bivša potpredsjednica se udala 2014. godine kada je imala 40 godina.\n\n“Postoje različite faze u vašem životu i možda ne znate u kojoj se fazi nalazite. Možda ćete odabrati da želite imati vezu petkom navečer ili želite vezu nedjeljom ujutro”, rekla je.\n\nDodala je da ponekad možete dobiti oboje.\n\n“A, ponekad su to samo ulje i voda. I to je u redu! Budite u tim fazama u kojima se zabavljate”, rekla je.\n\nNaglašavajući da ljudi žele različite stvari u različitim fazama života, Harris je primijetila da nije sigurna da li bi bila spremna da se uda za Douga Emhoffa ranije u životu.\n\n“Doug i ja smo se vjenčali u četrdesetim godinama i jako volim svog muža. On je moj najbolji prijatelj. I pričali smo o tome, da smo se upoznali u dvadesetim, ne znam da li bismo zaista bili na istom mjestu”, rekla je.\n\n(24sata.info)","summary":"Bivša potpredsjednica Sjedinjenih Američkih Država i kandidatkinja demokrata za Bijelu kuću 2024. godine Kamala Harris tokom gostovanja na jednom podcastu davala je savjete djevojkama koje su same. Bivša potpredsjednica Sjedinjenih Američkih Država i kandidatkinja demokrata za Bijelu kuću 2024. godine Kamala Harris tokom gostovanja na jednom podcastu davala je savjete djevojkama koje su same. &#8220;Izaberi [&#8230;]\n\n\nThe post Kamala Harris savjetovala slobodne djevojke: &#8220;Nekad želite vezu petkom navečer, nekad nedjeljom ujutru&#8221; appeared first on 24sata.ba.","url":"https://24sata.info/kamala-harris-savjetovala-slobodne-djevojke-nekad-zelite-vezu-petkom-navecer-nekad-nedjeljom-ujutru/","image":"https://24sata.info/wp-content/uploads/2024/08/kamala-Harris.jpg","video":null,"publish_date":"2025-12-24 18:20:54","author":"B. A","authors":["B. A"],"language":"en","category":"politics","source_country":"ba","sentiment":-0.534},{"id":388803636,"title":"Trump says comedian Colbert should be ‘put to sleep’","text":"Just before Christmas, US President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a “pathetic train wreck” who should be “put to sleep”.\nColbert’s The Late Show is scheduled to end in May 2026, a decision his fans say smacks of censorship.\nIn a late-night social media post, Trump said that Colbert “has actually gotten worse” since being “terminated by CBS, but left out to dry”.\n“Stephen is running on hatred and fumes – A dead man walking! CBS should, ‘put him to sleep,’ NOW,” Trump said.\nColbert has hosted The Late Show since 2015 and it has been the highest-rated late-night talk show on US television. His opening monologues often take aim at the Republican president.\n\nThere was no immediate public response from Colbert or CBS to Trump’s post.\nCBS announced the sunsetting of Colbert’s show after one more season in July, the same month its parent company reached a US$16 million settlement with Trump. CBS called the cancellation “a purely financial decision”.\nTrump had sued Paramount, alleging that CBS News’ 60 Minutes programme deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favour.\nIn another overnight post, Trump repeated threats to yank the broadcast licences of networks whose content he deemed too critical.\n“If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!”\nOn Sunday, CBS’s new editor-in-chief, Bari Weiss, pulled a 60 Minutes segment on alleged torture at El Salvador’s CECOT prison – where Trump sent hundreds of deported Venezuelans – saying it needed more reporting.\n\nIn August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract.\nKimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.\nTrump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives.\nHis appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that “the FCC is not formally an independent agency”, implying that his actions could justifiably be aligned with the political priorities of the White House.","url":"https://www.scmp.com/news/world/united-states-canada/article/3337669/trump-says-comedian-colbert-should-be-put-sleep?module=latest&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/25/e6106cc9-bb62-4ddd-9bd1-c4c7d91fe37e_ad60a982.jpg","video":null,"publish_date":"2025-12-24 18:16:24","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"hk","sentiment":-0.181},{"id":388803634,"title":"Trump says comedian Colbert should be ‘put to sleep’","text":"Just before Christmas, US President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a “pathetic train wreck” who should be “put to sleep”.\nColbert’s The Late Show is scheduled to end in May 2026, a decision his fans say smacks of censorship.\nIn a late-night social media post, Trump said that Colbert “has actually gotten worse” since being “terminated by CBS, but left out to dry”.\n“Stephen is running on hatred and fumes – A dead man walking! CBS should, ‘put him to sleep,’ NOW,” Trump said.\nColbert has hosted The Late Show since 2015 and it has been the highest-rated late-night talk show on US television. His opening monologues often take aim at the Republican president.\n\nThere was no immediate public response from Colbert or CBS to Trump’s post.\nCBS announced the sunsetting of Colbert’s show after one more season in July, the same month its parent company reached a US$16 million settlement with Trump. CBS called the cancellation “a purely financial decision”.\nTrump had sued Paramount, alleging that CBS News’ 60 Minutes programme deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favour.\nIn another overnight post, Trump repeated threats to yank the broadcast licences of networks whose content he deemed too critical.\n“If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!”\nOn Sunday, CBS’s new editor-in-chief, Bari Weiss, pulled a 60 Minutes segment on alleged torture at El Salvador’s CECOT prison – where Trump sent hundreds of deported Venezuelans – saying it needed more reporting.\n\nIn August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract.\nKimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.\nTrump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives.\nHis appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that “the FCC is not formally an independent agency”, implying that his actions could justifiably be aligned with the political priorities of the White House.","url":"https://www.scmp.com/news/world/united-states-canada/article/3337669/trump-says-comedian-colbert-should-be-put-sleep?module=top_story&pgtype=homepage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/25/e6106cc9-bb62-4ddd-9bd1-c4c7d91fe37e_ad60a982.jpg","video":null,"publish_date":"2025-12-24 18:16:24","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"hk","sentiment":-0.181},{"id":388785562,"title":"Trump says comedian Colbert should be ‘put to sleep’","text":"Just before Christmas, US President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a “pathetic train wreck” who should be “put to sleep”.\nColbert’s The Late Show is scheduled to end in May 2026, a decision his fans say smacks of censorship.\nIn a late-night social media post, Trump said that Colbert “has actually gotten worse” since being “terminated by CBS, but left out to dry”.\n“Stephen is running on hatred and fumes – A dead man walking! CBS should, ‘put him to sleep,’ NOW,” Trump said.\nColbert has hosted The Late Show since 2015 and it has been the highest-rated late-night talk show on US television. His opening monologues often take aim at the Republican president.\n\nThere was no immediate public response from Colbert or CBS to Trump’s post.\nCBS announced the sunsetting of Colbert’s show after one more season in July, the same month its parent company reached a US$16 million settlement with Trump. CBS called the cancellation “a purely financial decision”.\nTrump had sued Paramount, alleging that CBS News’ 60 Minutes programme deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favour.\nIn another overnight post, Trump repeated threats to yank the broadcast licences of networks whose content he deemed too critical.\n“If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn’t their very valuable Broadcast Licenses be terminated? I say, YES!”\nOn Sunday, CBS’s new editor-in-chief, Bari Weiss, pulled a 60 Minutes segment on alleged torture at El Salvador’s CECOT prison – where Trump sent hundreds of deported Venezuelans – saying it needed more reporting.\n\nIn August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract.\nKimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.\nTrump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives.\nHis appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that “the FCC is not formally an independent agency”, implying that his actions could justifiably be aligned with the political priorities of the White House.","summary":"Just before Christmas, US President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a “pathetic train wreck” who should be “put to sleep”.\nColbert’s The Late Show is scheduled to end in May 2026, a decision his fans say smacks of censorship.\nIn a late-night social media post, Trump said that Colbert “has actually gotten worse” since being “terminated by CBS, but left out to dry”.\n“Stephen is running on hatred and fumes – A...","url":"https://www.scmp.com/news/world/united-states-canada/article/3337669/trump-says-comedian-colbert-should-be-put-sleep","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/12/25/e6106cc9-bb62-4ddd-9bd1-c4c7d91fe37e_ad60a982.jpg","video":null,"publish_date":"2025-12-24 18:16:24","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.181},{"id":388796708,"title":"Markwayne Mullin: Narco-Terrorist Boat Strikes Only Opposed by 'Deranged' Democrats","text":"Tuesday, during an appearance on Fox News Channel’s “Hannity,” Sen. Markwayne Mullin (R-OK) spoke approvingly of the Trump administration’s effort to combat alleged narco terrorist drug traffickers in the Caribbean Sea.\n\nHe called it a winning strategy and questioned Democrat opposition.\n\n“Every Democrat, Senator Mullin, that ran against him for president the very next year, Kamala Harris and Elizabeth Warren and Bernie Sanders and Cory Booker — they all voted for it because they know that every state, every congressional district in this country is affected by the drug war,” fill-in host Kellyanne Conway said. “Please explain to us how in the world you’ve got Democratic colleagues siding with the narco terrorists and against President Trump’s muscular attempts to bring to heel these narco terrorists who are funding the drug war and flooding poison into our communities and our kids’ veins.”\n\nMullin replied, “Well, Kellyanne, you can’t explain crazy because we all know the numbers. In 2024, we lost more Americans to drug overdoses than we did at U.S. personnel in the entire Vietnam War. That’s insane. The only people that doesn’t think this is a good idea to send these narco terrorists to the bottom of the ocean and to for them to, you know, to rot in whatever their eternity is going to be is these Democrats that are in Washington, D.C. that are so deranged hatred towards President Trump. We all know that this is a winning strategy. We’re going to be proactive. Why wait until it comes to our streets? Why allow it to poison our family? Why allow it to poison our towns and our states?”\n\n“Yes, let’s go attack them and sink them in the waters that they’re using to transport this poison into our states,” he continued. “And by the way, this war power or this authority that the president is using is the same power that the other presidents, including Barack Obama that used it 500 times and killed 3,700 individuals, including U.S. citizens. And this is the same authority that President Trump is using, right? This has been going on for almost 25 years now. And so, for the fact that they said that he doesn’t have the authority, that’s not correct. We have terrorist organizations that are drug cartels that are bringing this poison into our state, into our states and to our country. The difference is the hemisphere that they’re operating underneath. Why would any person in their right mind think that it’s wrong that we are being proactive, attacking these drug cartels and keeping this poison from flooding our states? It just doesn’t make sense to me — why I said I can’t explain crazy.”\n\nFollow Jeff Poor on X @jeff_poor","summary":"Tuesday, during an appearance on Fox News Channel's \"Hannity,\" Sen. Markwayne Mullin (R-OK) spoke approvingly of the Trump administration's effort to combat alleged narco terrorist drug traffickers in the Caribbean Sea.\n\n\nThe post Markwayne Mullin: Narco-Terrorist Boat Strikes Only Opposed by &#8216;Deranged&#8217; Democrats appeared first on Breitbart.","url":"https://www.breitbart.com/clips/2025/12/24/markwayne-mullin-narco-terrorist-boat-strikes-only-opposed-by-deranged-democrats/","image":"https://media.breitbart.com/media/2025/12/Mullin12242025-640x335.jpg","video":null,"publish_date":"2025-12-24 18:14:42","author":"Jeff Poor","authors":["Jeff Poor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.228},{"id":388802526,"title":"\"Pathetic Trainwreck\": Trump Says Stephen Colbert Should Be \"Put To Sleep\"","text":"On the eve of Christmas, President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a \"pathetic trainwreck\" who should be \"put to sleep.\"Colbert's \"The Late Show\" is scheduled to end in May 2026, a decision his fans say smacks of censorship.In a late-night Truth Social post, Trump wrote that Colbert \"has actually gotten worse\" since being \"terminated by CBS, but left out to dry.\" \"Stephen is running on hatred and fumes. A dead man walking! CBS should, 'put him to sleep,' NOW,\" Trump wrote.Colbert has hosted \"The Late Show\" since 2015, and it has been the highest-rated late-night talk show on US television. His opening monologues often take aim at the Republican president.There was no immediate public response from Colbert or CBS to Trump's post. CBS announced the sunsetting of Colbert's show after one more season in July, the same month its parent company reached a $16 million settlement with Trump. CBS called the cancellation \"a purely financial decision.\"Trump had sued Paramount, alleging that CBS News' \"60 Minutes\" program deceptively edited an interview with his 2024 election rival, Kamala Harris, in her favour.In another overnight post, Trump repeated threats to yank the broadcast licenses of networks whose content he deemed overly critical. \"If Network NEWSCASTS, and their Late Night Shows, are almost 100% Negative to President Donald J. Trump, MAGA, and the Republican Party, shouldn't their very valuable Broadcast Licenses be terminated? I say, YES!\" On Sunday, CBS's new editor-in-chief, Bari Weiss, pulled a \"60 Minutes\" segment on alleged torture at El Salvador's CECOT prison -- where Trump sent hundreds of deported Venezuelans -- saying it needed more reporting. In August, Disney-owned ABC briefly suspended its late-night star, Jimmy Kimmel, before bringing him back on a one-year contract.Kimmel had annoyed conservatives with comments in the wake of the murder of right-wing activist Charlie Kirk.Trump appears to be aiming to reshape the US media landscape, which he says is biased against conservatives.His appointee to head the Federal Communications Commission, Brendan Carr, turned heads when he told a Congressional hearing that \"the FCC is not formally an independent agency,\" implying that his actions could justifiably be aligned with the political priorities of the White House.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"On the eve of Christmas, President Donald Trump has unleashed a fresh blast of vitriol at late-night comedy talk shows, saying comedian Stephen Colbert is a \"pathetic trainwreck\" who should be \"put to sleep.\"","url":"https://www.ndtv.com/world-news/pathetic-trainwreck-trump-says-stephen-colbert-should-be-put-to-sleep-9936213","image":"https://c.ndtvimg.com/2025-07/9j5n6hgk_as_625x300_19_July_25.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-12-24 18:11:15","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"in","sentiment":-0.178},{"id":388794300,"title":"Judge blocks Trump from stripping security clearance from attorney for now","text":"A federal judge blocked President Trump's attempt to strip a security clearance from whistleblower attorney Mark Zaid Tuesday, finding that the Trump administration did so in \"retribution\" and without proper due process.U.S. District Judge Amir Ali ruled Tuesday night that \"the government's retribution\" against Zaid was \"carried out by summarily canceling the attorney's security clearance without any of the process that is afforded to others.\" Ali said the administration had not conducted an individualized national security assessment of Zaid's clearance before stripping him of it.The judge also found that Zaid introduced credible evidence that he \"cannot properly advise current clients because he is precluded from accessing classified material and using classified information\" in their defense.Zaid sued the Trump administration in May after Mr. Trump rescinded his security clearance, as well as the clearances of prominent Democrats, including former Vice President Kamala Harris, former Secretary of State Hillary Clinton and several members of the Biden administration. Mr. Trump's order said that it was \"no longer in the national interest\" for Zaid and the other individuals listed to access classified information.Zaid represented the whistleblower who reported concerns about the president's dealings with Ukraine during his first term, and in Mr. Trump's second term, he's also been retained by many whistleblowers. Zaid had held a security clearance for over two decades.Ali, who was nominated by President Joe Biden, granted Zaid's motion for a preliminary injunction to \"immediately and fully restore\" his security clearance and access to classified information. The judge put his order on hold for 21 days to allow the Justice Department to consider an appeal. If there is no appeal, the order is set to go into place on Jan. 13. Ali also rejected a Justice Department motion to dismiss the lawsuit.In a statement to CBS News, Zaid said the decision is \"an indictment of the Trump administration's attempts to intimidate and silence the legal community, especially lawyers who represent people who dare to question or hold this government accountable.\"\"I will not be intimidated and look forward to continuing to defend the brave men and women who stand up to the unlawful retaliation of the Trump administration,\" the statement continued.","summary":"Trump signed an executive order in March saying it was \"no longer in the national interest\" for attorney Mark Zaid and others to access classified information.","url":"https://www.cbsnews.com/news/judge-blocks-trump-from-stripping-security-clearance-from-whistleblower-attorney-for-now/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/12/24/2a84f9f4-5f0f-43aa-8821-a822d3782aec/thumbnail/1200x630g2/4ab69057be49db4a15c6649f972fadf8/gettyimages-2235972861.jpg","video":null,"publish_date":"2025-12-24 17:55:49","author":"Jacob Rosen","authors":["Jacob Rosen"],"language":"en","category":"politics","source_country":"US","sentiment":-0.47},{"id":388774488,"title":"Rubio and State Department Putting Europe on Notice About Free Speech","text":"As Ed wrote earlier, things are getting testy between the United States and Europe. Definitely read his piece to get the full picture. Me? I'm going to make the case, once again, that these countries cannot be called \"allies\" if they attack the rights of Americans. \n\nThe war on free speech in the West isn't going away, and until President Trump re-assumed office, the Biden administration was as belligerent against our rights to speak our minds as any petty tyrant in the UK, the EU, or other countries that we like to call the \"Free World.\"\n\nThe issue of free speech has been a flashpoint between the Trump administration and our \"allies\" in the West, and by now it should be clear that Trump—and even more so Rubio and Vance—are not merely making performative statements for the cameras. They clearly mean what they say. \n\nRubio has turned out to be a superstar and the clearest-speaking Secretary of State in my lifetime. He rarely minces words, so it doesn't take an interpreter to parse out diplo-speak to understand the message he just delivered to our allies in Europe. \n\n\"Are we going to live in a world where some American puts up a social media post and then gets to some airport somewhere and is arrested?\"Secretary of State Marco Rubio issues a warning to Americans over Europe's assault on the First Amendment. pic.twitter.com/tOG8Lf8Ov0— Free Speech America (@FreeSpeechAmer) December 23, 2025\n\nAre we gonna live in a world where some American puts up a social media posts and then gets to some airport somewhere and is arrested? Um, we’re also concerned about the impact that some of their policies are having on our social media platforms. As you recently saw, you know, X. Is facing this massive multimillion dollar fine that they’re gonna have to pay, I guess, if they want to continue to operate. But I think more importantly, I think it, it, it, it touches on the broader question that was asked a little bit earlier. We all talk about how these alliances, in many cases, our alliances with our European partners are built on our, on our common principles are common values as much as anything else. These aren’t just a geopolitical arrangement. It is an alliance with like-minded countries with whom we share values and principles. And one of those values and principles, we hope is freedom and the freedom of expression, and we’re concerned that that is eroding. \n\nIn other words, the United States' defense of Europe is predicated on preserving shared values, and Americans won't be inclined to spend so much blood and treasure to defend countries that are determined to erode Americans' rights and even pervert our political system. \n\nAnd make no mistake, speech policies in other Western countries are aimed directly at Americans and American elections. In the 2024 election, the Europeans and the United Kingdom did far more to interfere in the outcome than Vladimir Putin ever could have. The United Kingdom actually sent election workers to help Kamala Harris, and the European Union actually threatened to fine Elon Musk billions of dollars for having an online discussion with Donald Trump during the campaign. \n\nI remember thinking last year that this was one of the most chilling letters I’d ever read. It treats freedom of speech as merely one factor to be weighed in the balance against “detrimental effects on civic discourse and public security.” And the letter was targeted specifically… pic.twitter.com/IOvqYc0jV6— Christopher Landau (@DeputySecState) December 24, 2025\n\nI remember thinking last year that this was one of the most chilling letters I’d ever read. It treats freedom of speech as merely one factor to be weighed in the balance against “detrimental effects on civic discourse and public security.” And the letter was targeted specifically at a conversation on this very platform between @elonmusk, an American, and @realDonaldTrump, also an American then running for the US Presidency. When the letter talks about “content that may incite violence, hate and racism in conjunction with major political—or societal—events around the world” in this context, it’s talking about core political speech. More than any other document I’ve ever read, this letter bares the fangs of the global censorship-industrial complex and underscores that unelected bureaucrats in the EU are ready, willing, and able to use their regulatory reach to try to influence elections and nullify the First Amendment in the US. When I wrote earlier this month about the glaring inconsistency between US relations with the EU and NATO, this is exactly what I had in mind. If the sovereign nations of Europe allow the EU to attack fundamental freedoms in the US, those same nations cannot expect the US to defend fundamental freedoms in Europe.\n\nSeriously, now. How can we call countries that interfere with Americans' rights and our political system in such ways \"allies?\" Over the decades, Americans have spilled the blood of hundreds of thousands of our men and spent trillions of dollars to ensure the freedom and independence of these countries.\n\nThat letter from the EU is long, but it boils down to this: The EU hates Donald Trump and believes that his every utterance is \"hate speech,\" so if you let him onto X, we will fine your company billions of dollars. The fine for violating the EU's Digital Services Act is 6% of worldwide revenues, and Breton made clear than in Musk's case that would include all his businesses, and not just X.\n\nDear Mr Musk,I am writing to you in the context of recent events in the United Kingdom and in relation to the planned broadcast on your platform X of a live conversation between a US presidential candidate and yourself, which will also be accessible to users in the EU.I understand that you are currently doing a stress test of the platform. In this context, 1 am compelled to remind you of the due diligence obligations set out in the Digital Services Act (DSA), as outlined in my previous letter. As the individual entity ultimately controlling a platform with over 300 million users worldwide, of which one third in the EU, that has been designated as a Very Large Online Platform, you have the legal obligation to ensure X's compliance with EU law and in particular the DSA in the EU.This notably means ensuring, on one hand, that freedom of expression and of information, including media freedom and pluralism, are effectively protected and, on the other hand, that all proportionate and effective mitigation measures are put in place regarding the amplification of harmful content in connection with relevant events, including live streaming. which, if unaddressed, might increase the risk profile of X and generate detrimental effects on civic discourse and public security. This is important against the background of recent examples of public unrest brought about by the amplification of content that promotes hatred, disorder, incitement to violence, or certain instances of disinformation.It also implies i) informing EU judicial and administrative authorities without undue delay on the measures taken to address their orders against content considered illegal, according to national and/ or EU law, ii) taking timely, diligent, non-arbitrary and objective action upon receipt of notices by users considering certain content illegal, ill) informing users concerning the measures taken upon receipt of the relevant notice, and iv publicly reporting about content moderationIn this respect, I note that the DA obligations apply without exceptions or discrimination to the moderation of the whole user community and content of X (including yourself as a user with over 190 million followers) which is accessible to EU users and should be fulfilled in line with the risk-based approach of the DA, which requires greater due diligence in case of a foreseeable increase of the risk profile.As you know, formal proceedings are already ongoing against X under the DSA, notably in areas linked to the dissemination of illegal content and the effectiveness of the measures taken to combat disinformation.As the relevant content is accessible to EU users and being amplified also in our jurisdiction, we cannot exclude potential spillovers in the EU. Therefore, we are monitoring the potential risks in the EU associated with the dissemination of content that may incite violence, hate and racism in conjunction with major political - or societal - events around the world, including debates and interviews in the context of elections.Let me clarify that any negative effect of illegal content on X in the EU, which could be attributed to the ineffectiveness of the way in which X applies the relevant provisions of the DSA, may be relevant in the context of the ongoing proceedings and of the overall assessment of X's compliance with EU law. This is in line with what has already been done in the recent past, for example in relation to the repercussions and amplification of terrorist content or content that incites violence, hate and racism in the EU, such as in the context of the recent riots in the United Kingdom.I therefore urge you to promptly ensure the effectiveness of your systems and to report measures taken to my team.My services and I will be extremely vigilant to any evidence that points to breaches of the DA and will not hesitate to make full use of our toolbox, including by adopting interim measures, should it be warranted to protect EU citizens from serious harm.Yours sincerely,Thierry BretonCe: Linda Yaccarino, CEO of X\n\nBreton literally compared allowing Donald Trump to speak to amplifying terrorism. \n\nLetting Donald Trump speak, according to the European Union, was a threat to its existence and an illegal act. \n\nEvery American’s right to free speech is enshrined in our US Constitution. Foreign nations seeking to impose their anti-freedom policies to censor American voices and force American platforms to regulate or silence our free speech is a gross violation of our sovereignty that must… https://t.co/mPBp6KMmBb— DNI Tulsi Gabbard (@DNIGabbard) December 24, 2025\n\nIs it any wonder why the State Department is making clear to our \"allies\" that their status as such is in question? If Vladimir Putin had tried to pull something like that, everybody would be screaming bloody murder. They screamed bloody murder when a few hundred thousand dollars were spent on unintelligible social media ads in 2016. \n\nThis is @_ConnieShaw spokesperson for the Free @SpeechUnion commenting on the Online Safety Act. She describes it as a \"disaster\" as perfectly legal content has been censored, including a speech in Parliament by Katie Lam.Or was that the idea?Connie praises the Americans. pic.twitter.com/8ZL9yfyOBg— David Atherton (@DaveAtherton20) December 24, 2025\n\nThe European Union tried to make Trump's presidential campaign illegal. Which, to be fair, is on brand. The EU keeps pushing to cancel elections it doesn't like and ban political parties within its own borders, so why not make a play for the American elections as well?\n\nWhen both the Secretary of State and his deputy make the same point on the same day about the questionable status of our NATO allies, they should sit up and take notice. \n\nNATO countries have forgotten that they are junior partners in this alliance. They seem to believe that, by their status as the older partners, they are the senior partners. This attitude ignores the fact that the United States was founded by people who left the continent's tyrannical leaders and have no desire to be ruled over by them again. \n\nIf they want our help—and the United States has been very generous with it—they have to play by our rules. And Americans believe in freedom. \n\nEditor’s Note: The mainstream media isn't interested in the facts; they're only interested in attacking the president. Help us continue to get to the bottom of stories like the Jeffrey Epstein files by supporting our truth-seeking journalism today. Join Hot Air VIP and use promo code MERRY to get 74% off your membership!","url":"https://hotair.com/david-strom/2025/12/24/rubio-and-state-department-putting-europe-on-notice-about-free-speech-n3810201","image":"https://media.townhall.com/cdn/hodl/2025/350/f1ec5c9d-b346-430c-b72d-3f8a243eed27.jpg","video":null,"publish_date":"2025-12-24 17:00:38","author":"David Strom","authors":["David Strom"],"language":"en","category":"politics","source_country":"us","sentiment":0.175},{"id":388793224,"title":"'Obnoxious': Kamala Harris Brutally Ridiculed for Giving Dating Advice — Despite Husband Doug Emhoff Famously Cheating on His First Wife With Children's Teacher","text":"Kamala Harris has been brutally ridiculed after doling out dating advice despite her husband, Doug Emhoff, cheating on his first wife with his kids' teacher, RadarOnline.com can reveal. \n\nThe former presidential candidate revealed her tips on relationships while appearing on Tuesday's episode of the Rich Little Brokegirls podcast.What Advice Did Kamala Harris Give?Harris specifically spoke to \"anyone who is single who wants to be in a relationship.\"\n\nShe advised them to \"be kind to yourself and choose to be with someone who is kind.\"\n\n\"There are different phases in life, and depending on what phase you're in, maybe you're gonna choose that you want to have that kind of Friday night relationship or you want that Sunday morning relationship,\" she said while chuckling. \"Sometimes you can get both, and sometimes they just is oil and water. And... that's okay. Be in those phases where you are having fun.\"Kamala Harris Slammed as a 'Fool' for Dating AdvicePeople immediately took to X to slam Harris for her advice, with one person writing, \"Did her advice include not dating married men? My advice is don't take advice from Kamala Harris for anything....\"\n\n\"Why the f--- would anyone take dating advice from Kamala Harris?\" another person piped in to add.\n\n\"If she were honest, she'd say 'find a powerful, much older guy to give you a job and promote your career ahead of far better and more qualified people so you can fail your way to the top – when it's time to cash out, find a rich guy who b---- babysitters,\" another person noted. Emhoff had previously admitted to having an affair while with his first wife.\n\nStill, others called Harris \"obnoxious\" and a \"fool.\"Kamala Harris' 'Complicated' Relationship With Joe BidenAs far as Harris goes, people claiming she dated \"married men\" were referring to rumors of an affair with former San Francisco mayor Willie Brown. \n\nAside from handing out dating tips, Harris got candid earlier this year about her \"complicated\" relationship with Joe Biden, whom she was the vice president under. \n\nWhen appearing on The Diary of a CEO podcast, Harris was asked if she thought Biden wanted her to win the 2024 election.\n\n\"I do...,\" she said after pondering the question. \"Because I was the only one who would be able to preserve his legacy. But even that's about him.\"\n\n\"Well, if I had to assume one of the reasons why he'd want me to win...Yeah,\" she added.What Is Kamala Harris' Political Future?While she insisted she has \"a great deal of affection for\" Biden, she admitted she was \"greatly disappointed\" and \"angered\" by Biden in the past, especially when she stepped in as the Democratic nominee after he decided not to run for reelection.\n\nWhile Harris was ultimately defeated by Donald Trump, she tiptoed around answering whether she would make another go at becoming president in 2028.\n\n\"I am not done. I have lived my entire career as a life of service, and it's in my bones,\" she said in an interview. \n\nShe later noted her grandnieces would \"see a female president in the White House in their lifetime, for sure\" and admitted there's a possibility it could be her.","summary":"Kamala Harris was ridiculed and slammed as 'obnoxious' for giving dating advice during a recent podcast appearance.","url":"https://radaronline.com/p/kamala-harris-dating-advice-doug-emhoff/","image":"https://media.radaronline.com/brand-img/_Vt5CIF5V/0x0/kamala-harris-dating-advice-ridiculed-1766592013977.jpg","video":null,"publish_date":"2025-12-24 17:00:00","author":"Matt Richards","authors":["Matt Richards"],"language":"en","source_country":"us","sentiment":0.072},{"id":388757850,"title":"Kamala Harris Gives Saucy Dating Advice, And It Might Make You Blush","text":"Now that’s the way to win a swing state.\n\nFormer Vice President Kamala Harris advised young singles campaigning for love to enjoy that “Friday night relationship” if they’re not ready for the “Sunday morning relationship.” (Watch the video below.)\n\nOn the “Rich Little Brokegirls” podcast posted Tuesday, the 2024 Democratic presidential nominee at first offered basic tips like, be kind to yourself and choose someone kind, “who allows you to laugh at yourself and them.”\n\nThen she ventured into more intimate territory.\n\n“There are different phases in your life,” she told host Kimberly Ndubizu. “And depending on what phase you’re in, maybe you’re going to choose that you want to have that kind of Friday night relationship or you want that Sunday morning relationship.” Harris laughed at her get-real guidance.\n\n“Sometimes they go together and sometimes ...” Ndubizu chimed in.\n\n“And sometimes you can get both, and sometimes it’s oil and water,” Harris continued. “And that’s OK. Be in those phases where you are having fun. Be in those phases where you have a sense of, you know, I just want something more.\n\n“But be honest with yourself about what you’re in, and figure out whether what you’re in is actually what you want. Right? But the first step is to be honest about what you’re in. And not try and make it something that it’s not because that usually doesn’t work out so well.”\n\nHarris met her husband, Doug Emhoff, on a blind date, and the pair wed in 2014.\n\nFast-forward to 14:20 to watch the exchange","url":"https://www.huffpost.com/entry/kamala-harris-dating-advice_n_694bf991e4b0d33e39fdfa3e?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/694c0d00150000d12785d330.jpeg?cache=hBGQgITUk2&ops=1778_1000","video":null,"publish_date":"2025-12-24 16:27:22","author":"Ron Dicker","authors":["Ron Dicker"],"language":"en","source_country":"us","sentiment":0.27},{"id":388757856,"title":"Kamala Harris Gives Saucy Dating Advice, And It Might Make You Blush","text":"Now that’s the way to win a swing state.\n\nFormer Vice President Kamala Harris advised young singles campaigning for love to enjoy that “Friday night relationship” if they’re not ready for the “Sunday morning relationship.” (Watch the video below.)\n\nOn the “Rich Little Brokegirls” podcast posted Tuesday, the 2024 Democratic presidential nominee at first offered basic tips like, be kind to yourself and choose someone kind, “who allows you to laugh at yourself and them.”\n\nThen she ventured into more intimate territory.\n\n“There are different phases in your life,” she told host Kimberly Ndubizu. “And depending on what phase you’re in, maybe you’re going to choose that you want to have that kind of Friday night relationship or you want that Sunday morning relationship.” Harris laughed at her get-real guidance.\n\n“Sometimes they go together and sometimes ...” Ndubizu chimed in.\n\n“And sometimes you can get both, and sometimes it’s oil and water,” Harris continued. “And that’s OK. Be in those phases where you are having fun. Be in those phases where you have a sense of, you know, I just want something more.\n\n“But be honest with yourself about what you’re in, and figure out whether what you’re in is actually what you want. Right? But the first step is to be honest about what you’re in. And not try and make it something that it’s not because that usually doesn’t work out so well.”\n\nHarris met her husband, Doug Emhoff, on a blind date, and the pair wed in 2014.\n\nFast-forward to 14:20 to watch the exchange","url":"https://www.huffpost.com/entry/kamala-harris-dating-advice_n_694bf991e4b0d33e39fdfa3e?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/694c0d00150000d12785d330.jpeg?cache=hBGQgITUk2&ops=1778_1000","video":null,"publish_date":"2025-12-24 16:27:22","author":"Ron Dicker","authors":["Ron Dicker"],"language":"en","source_country":"us","sentiment":0.27},{"id":388761226,"title":"List of Democrats&#039; Double-Digit Overperformances in 2025 Elections","text":"Democrats overperformed former Vice President Kamala Harris by double digits in special elections across the country in 2025. Democratic National Committee Deputy Executive Director Libby Schneider told Newsweek that the party should “feel buoyed by the strong results we’ve seen up and down the ballot all year long.” Why It Matters Off-year special elections can be a gauge of the mood of the electorate between the presidential election and midterms set for next November, when Democrats are hoping to reclaim control of the House and Senate. The results suggest heightened Democratic enthusiasm, and polls for next year give the party an edge. They also served as a test of President Donald Trump’s popularity, as he supported Republican candidates in many of these races. What To Know Democrats began 2025 in a tough spot, still grappling with former Vice President Kamala Harris’ loss in the last year’s presidential race. The party was divided about the best path forward as well as what contributed to Trump’s victory. Despite those woes, special elections this year yielded strong results for Democrats. House Minority Leader Hakeem Jeffries speaks during a news conference in Washington on May 5, 2025. Florida House Special Elections Democrats overperformed Harris’ margin by double digits in two Florida House special elections this year. Although Republicans still won each race, Democrats put up stronger-than-expected showings. In Florida’s 1st Congressional District, Republican Jimmy Patronis defeated Democrat Gay Valimont by about 14.6 percentage points, much narrower than Trump’s 37-point victory last November. In Florida’s 6th Congressional District, Republican Randy Fine defeated Democrat Josh Weil by about 14 points—a notable change from Trump’s 30-point victory in 2024. This race was viewed as being potentially competitive and drew national attention—and spending. Virginia’s 11th Congressional District Democrat James Walkinshaw overperformed in the special election to fill the seat vacated by the late Representative Gerry Connolly. He won the race in the Northern Virginia district by more than 50 points against Republican Stewart Whitson. Harris won the seat by 34 points last November. Arizona’s 7th Congressional District In Arizona’s 7th Congressional District, a seat that drifted rightward last November as Trump made inroads with Hispanic voters, Democrat Adelita Grijalva easily won the race to replace her father, the late Representative Raul Grijalva. She won her race by nearly 40 points, compared to Harris’ 22-point victory last November. Tennessee’s 7th Congressional District The special election in Tennessee’s 7th Congressional District to replace former Representative Mark Green, who left Congress for a private-sector job, was viewed as a competitive race by both parties. Democrats were hopeful that Aftyn Behn could defeat Republican Matt Van Epps, and the race drew investment from both parties. Van Epps, who received the support of Trump, ended up winning, but Behn still made the race closer than expected. He won by just under nine points, compared to Trump’s 22-point victory last year. Miami Mayoral Race Democrat Eileen Higgins this month defeated Republican Emilio Gonzalez by nearly 20 points in the Miami mayoral election. She secured just over 59 percent of the vote, while Gonzalez received just under 41 percent. That’s a strong improvement for Democrats from 2024, when Harris won Miami by less than a percentage point. Miami was once a Democratic stronghold but has shifted right as Republicans have made gains among Hispanic voters, especially Cuban voters who are prominent in Miami. Wisconsin Supreme Court Election Although Wisconsin’s Supreme Court elections are technically nonpartisan, liberal-aligned Susan Crawford won by double digits against the conservative-aligned Brad Schimel in a state that Democrats lost at the presidential level last November. Crawford won by just about 10 percentage points; Trump carried Wisconsin by less than a percentage point in last year’s election. State Legislative Elections Democrats outperformed Harris in the following state legislative races by double digits, according to The Downballot: What People Are Saying Democratic National Committee Deputy Executive Director Libby Schneider, in a statement to Newsweek: “With another 40%+ overperformance by a Democrat from the top of the 2024 ticket last week in Kentucky, and as Democrats enter the midterm year, our party should feel buoyed by the strong results we’ve seen up and down the ballot all year long. Across red, purple, and blue states, Democrats have gotten off the mat and proven that when you organize everywhere, you can win anywhere — in every part of the country.“ CNN data analyst Harry Enten, this month after the Miami mayoral race: “It is just the latest shift that we’re seeing. That is what I think is so important going on here. We’ve seen in special elections. We saw it in Virginia gov. We saw it in New Jersey gov. We’ve seen it across the political map, where over and over and over again, the baseline from 2024, Democrats are consistently outperforming it.” Red Eagle Politics, a conservative political commentary account with more than 110,000 followers on X: “Democrats do better in off-year elections now. Cool, we get it. The thing is, Dems were massively overperforming in countless specials every year since Obama left office, almost ALL went back to baseline in the Midterm or Presidential year.” What Happens Next Whether or not these special-election overperformances translate to a strong midterm showing will be seen next November. Polls are giving Democrats an advantage on the generic ballot, but the results of the midterms could be shaped by factors such as how the economy fares over the coming months.","summary":"Democrats outperformed former Vice President Kamala Harris&#039; margins in special elections across the country this year.","url":"https://www.newsweek.com/list-of-democrats-double-digit-overperformances-in-2025-elections-11266946","image":"https://assets.newsweek.com/wp-content/uploads/2025/12/GettyImages-2213591265.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-12-24 16:27:01","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"US","sentiment":0.148},{"id":388771808,"title":"‘This woman ran for President’: Kamala Harris’s dating advice sparks debate online","text":"For the time being as she takes a sabbatical from politics, Democrat leader Kamala Harris seems to be making a career move towards a dating coach. The former Vice President has been making quite the headlines on the dating advice she has for young girls and rather than making it easier for them, it seems she has them confused. On Tuesday, Harris appeared on the “Rich Little Broke Girls” podcast and shared amusing dating advice with her signature cackle. According to her, you can have all you want whenever you want. Kamala Harris’s dating adviceHarris, 61, who married Douglas Emhoff in 2014 had something really interesting to say to all the young and single woman dating out there. “Choose to be with someone who allows you to laugh at yourself and them,” said Harris. “Choose to be with someone who you know you like, going to the grocery store together, taking a walk together.”Up till here, her advice seemed like one from a wise woman who has experienced both dating and marriage. But soon, the tables turned. Harris also stated that there are “different phases in your life and you may not know what phase you’re in.”“Maybe you’re going to choose that you want to have that kind of Friday night relationship — or you want that Sunday morning relationship,” she continued. “Sometimes you can get both — and sometimes they just is oil and water. And that’s OK! Be in those phases where you are having fun!” she added. “Enjoy dating, by the way, because dating is fun. It’s supposed to be. Just do what, at the end of the day, when you go to sleep at night and when you wake up in the morning, makes you feel like, ‘I’m good,’” she suggested.While she met and married her husband in their 40s, she added that she couldn’t tell if they “would have really been in the same place” if they had met in their 20s.Netizens react to Kamala Harris’ dating advicePeople on the internet are less than impressed with Harris’s dating advice. As a former Vice President and presidential candidate, it seems the expectations for her were high. Americans wanted a wise and profound advice from her, but what they got was a casual dating tip. And it has left them enraged, considering it is coming from an experienced politician.“Nothing profound, but she acts like it's deep wisdom. Hard to believe this woman ran for president. But hey, Dems—please nominate her again in 2028. I’m begging you,” said a post on X. “Sounds like a cyclical recipe for insecurity and constant self-questioning of one's worth, based on sexuality's power dynamics. Figuring this out on your own is one thing; having a political leader say it is another,” pointed out another. “Was this career advancement or relationship advice? Can never tell with that one...,” trolled another referring to Harris’ past relationship with Willie Brown. “Honestly, the advice itself isn’t that crazy. She’s basically saying different people serve different roles in different seasons of life, and that it’s okay to be honest about what you want at the time. Some people will hear this as empowering, others will see it as unserious coming from a politician,” explained an X user. Kamala Harris on being a ‘humble’ womanElsewhere in the interview, Harris recalled a reporter asking her about criticisms of her lack of humility. \"I don’t aspire to be humble. Humility, yes, is very important. [It’s] a very dated perspective on who women should be. To say that women should be humble. Women should be quiet. Women should laugh quietly,\" she said.\"Women should not have a sense of humour. Women should not raise their voice,\" she continued. \"I have never felt burdened by those very dated, and I think out-of-touch standards.\" In an April 2024 interview with Drew Barrymore, she also addressed the criticism she faced on her signature cackle. \"Well, let me just tell you something: I have my mother’s laugh,\" she continued. \"And I grew up around a bunch of women, in particular, who laughed from the belly.\"While the netizens are expecting something sage from the politician all the time, sometimes one can be just an honest woman and share a tip that is ideal for a modern woman. Not everything around a politician needs to be politicised. Additionally, there were others on the internet who also found her dating advice ideal, writing comments such as, “Dating advice from Kamala Harris is something I never knew I needed but love to have.”","url":"https://timesofindia.indiatimes.com/world/us/this-woman-ran-for-president-kamala-harriss-dating-advice-sparks-debate-online/articleshow/126162965.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126162971/126162971.jpg","video":null,"publish_date":"2025-12-24 16:09:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.012},{"id":388770616,"title":"Harris Suggests Mocking Her Laugh Is Sexist, As She Gives Young Women Dating Advice","text":"Kamala Harris suggested that those who make fun of her cackle are simply sexist, on an episode of the “Rich Little Broke Girls” podcast, where the former vice president and failed 2024 Democratic presidential candidate was providing the show's listeners with dating advice.\n\n“I don’t aspire to be humble. Humility, yes, is very important,” Harris said when asked about the criticism that she lacks humility. “[It’s] a very dated perspective on who women should be. To say women should be humble, women should be quiet, women should laugh quietly.”\n\n“Women should not have a sense of humor. Women should not raise their voice,” she went on. “I have never felt burdened by those very dated, and I think out-of-touch standards.”\n\nSurprisingly, Harris largely avoided identity politics during her short presidential run. \n\nAfter losing to President Trump, she wrote a book titled 107 Days detailing her campaign and embarked on a promotional tour. In the book, she blamed everyone from the American people to her former boss, Joe Biden, for her loss, throwing several high-profile Democrats under the bus. Yet publicly, she has been unwilling to voice those same criticisms.\n\n“Choose to be with someone who allows you to laugh at yourself and them,” she said. “Choose to be with someone who you know you like, going to the grocery store together, taking a walk together.”\n\n“There are different phases in your life, and you may not know what phase you’re in,” Harris explained. “Maybe you’re going to choose that you want to have that kind of Friday night relationship, or you want that Sunday morning relationship.\"\n\n“Maybe you’re going to choose that you want to have that kind of Friday night relationship, or you want that Sunday morning relationship.\n\n“Sometimes you can get both — and sometimes they just is oil and water. And that’s OK! Be in those phases where you are having fun!”\n\n“Doug and I got married in our 40s, and I love my husband so very much. He is my best friend,” she reflected.\n\n“And we’ve talked about it, if we had met in our 20s, I don’t know that we would have really been in the same place.”\n\nHarris should also be among the last people offering dating advice to young women, given that she famously launched her political career while dating former San Francisco mayor and political kingmaker Willie Brown. Harris’s introduction to the broader political stage largely occurred during their year-and-a-half relationship. \n\nWhile serving as Speaker of the California State Assembly, Brown appointed Harris to the California Unemployment Insurance Appeals Board and later placed her on the California Medical Assistance Commission, two positions that gave her significant political visibility. He also introduced her to the state’s political elite and Democratic donor network, paving the way for her eventual run for California attorney general.\n\nEditor's Note: President Trump is leading America into the \"Golden Age\" as Democrats try desperately to stop it. \n\nHelp us continue to report on President Trump's successes. Join Townhall VIP and use promo code MERRY74 to get 74% off your membership.","url":"https://townhall.com/tipsheet/dmitri-bolt/2025/12/24/kamala-harris-says-making-fun-of-her-cackle-is-sexist-n2668449","image":"https://media.townhall.com/cdn/hodl/2025/212/24ea96ae-7982-4cf4-9189-4bd6f49e9269.jpg","video":null,"publish_date":"2025-12-24 16:00:00","author":"Dmitri Bolt","authors":["Dmitri Bolt"],"language":"en","source_country":"us","sentiment":0.158},{"id":388741940,"title":"Bari Should Fire Them!","text":"The Left plays by different rules, and while I disagree with people who argue that we should adopt the same rules to fight them, that doesn't mean that we should pretend that people who are not good-faith actors should be treated the same as those who are. \n\nAs Ed has written about in two posts, the controversy over Bari Weiss's delay of a 60 Minutes story on Trump's deportation of illegal aliens to El Salvador's CECOT has completely gotten out of hand. \n\nNot only was Weiss right about the story not being balanced, but now we know that the \"journalists\" who put together the story and leaked it to Canadian media actually lied to her and the world about the reporting that they did. \n\nElon is absolutely right. There is no point tinkering at the margins by debating wording, editing choices, or how a segment might be polished or improved. The problem is not execution. The entire 60 Minutes operation is corrupted, and it has been for a very long time, going back… https://t.co/jApBVI80Mk— Hans Mahncke (@HansMahncke) December 24, 2025\n\nElon is absolutely right. There is no point tinkering at the margins by debating wording, editing choices, or how a segment might be polished or improved. The problem is not execution. The entire 60 Minutes operation is corrupted, and it has been for a very long time, going back at least to the Dan Rather fake letter episode, which was explicitly designed to take down George W. Bush.That was followed by a long series of scandals, including 60 Minutes loudly insisting that Biden family corruption claims had been debunked, insisting that Hunter Biden’s laptop was not verified, and, more recently, deceptively stitching together Kamala Harris’s incoherent word salad into something that resembled a coherent answer. These are not the mistakes of a newsroom that occasionally gets something wrong. They are the consistent behaviors of a political propaganda operation.Framing this as a debate about journalistic standards completely misses the point. These are political operatives, not reporters, and the only serious course of action is to shut the operation down and rebuild from scratch with entirely new people.\n\nEverybody is pretending that this controversy is about journalistic standards and whether 60 Minutes did its work appropriately. There is a lot of talk about Standards and Practices, lawyers, vetting, and the like, as if crossing all the Ts and dotting all the Is in a manner that might keep CBS on just the right side of the \"slander\" line were the point. \n\nSome nuggets in here @axios:- Can confirm WH, State Dept and DHS all provided on record comment in response to CBS News journalists’ request for comment ahead of the segment. None of those comments made airhttps://t.co/hFkRmt5Uv9— Sara Fischer (@sarafischer) December 22, 2025\n\nThat's not even close to the point, and neither is the claim that every statement in the story is factual (which turns out not to be the case, if that matters by now). \n\nI can make factual statements about somebody that, for instance, pass the \"factual\" test without actually conveying truth. For instance, I could say that Dan Rather fondled his mother's breasts regularly, and that would be factually correct, and without context would be a shocking assertion. If I added that he was an infant breastfeeding at the time, the truth of the matter would be revealed by the context. The first statement makes him sound like a pervert; the second makes him sound perfectly normal. \n\nSharyn Alfonsi’s producer for the botched DeSantis story (Oriana Zill de Granados) is also the producer for the CECOT story. https://t.co/BByr8wnMan— Chuck Ross (@ChuckRossDC) December 23, 2025\n\nIf a \"journalist\" only reports the \"fact\" without proper context, it's clear that they are not using \"journalistic\" judgment to inform people of important information; they intend to slander somebody in the slyest way possible and get away with it. \n\nThat is the sort of thing that went on here, just as has gone on at 60 Minutes for years. By massaging words or facts in ways intended to manipulate the viewer, these \"reporters\" are acting as political propagandists, not journalists getting to the truth. \n\nThey are doing the same thing to discredit Bari Weiss, accusing her of giving Donald Trump a \"kill switch\" on their reporting. \n\nThose of us who are interested in the truth—and I don't mean by that \"conservatives,\" but rather all people who are interested in understanding reality and communicating its nature fairly and accurately—need to get past the idea that we must pretend that Pravda propaganda is just another type of journalism. \n\n“Our story was screened five times and cleared by both CBS attorneys and Standards and Practices,” Ms. Alfonsi wrote in the note, a copy of which was obtained by The New York Times. “It is factually correct. In my view, pulling it now, after every rigorous internal check has been met, is not an editorial decision, it is a political one.”Ms. Weiss said in a statement late Sunday: “My job is to make sure that all stories we publish are the best they can be. Holding stories that aren’t ready for whatever reason — that they lack sufficient context, say, or that they are missing critical voices — happens every day in every newsroom. I look forward to airing this important piece when it’s ready.”\n\nPropagandists aren't journalists, and we should quit acting as if they can be negotiated with or persuaded. As you can see from the very fact that the \"journalists\" in question lied about whether the administration would comment on their story, and then leaked their drivel into the media after their Editor in Chief told them to do better, these people have an agenda. They want to \"get\" Trump and they want to evict Bari Weiss. \n\nThey should be fired, not coddled or negotiated with.","url":"https://hotair.com/david-strom/2025/12/24/bari-fire-them-n3810220","image":"https://media.townhall.com/cdn/hodl/ha/images/2024/63/6b5a7134-5aa7-4d2c-9f34-d5bf8091dabd.jpeg","video":null,"publish_date":"2025-12-24 15:00:31","author":"David Strom","authors":["David Strom"],"language":"en","category":"politics","source_country":"us","sentiment":-0.428},{"id":388751454,"title":"CBS Gets Revenge on Trump After ‘60 Minutes’ Fiasco","text":"CBS News aired the Kennedy Center Honors on Tuesday using a sharply edited Donald Trump monologue and dodging his controversial “Trump Kennedy Center” rebrand.\n\nThe new Trump-appointed Kennedy Center board voted on Dec. 18 to rename the John F. Kennedy Center for the Performing Arts as the “Trump-Kennedy Center,” leading to almost immediate legal action.\n\nBehind the scenes, the paper said CBS News standards had circulated guidance telling staff to stick with “Kennedy Center,” noting the board’s vote alone doesn’t make the change official because Congress would have to approve it. \n\nThe network also trimmed Trump’s opening remarks from roughly 12 minutes to about two minutes for viewers at home, cutting out some of his freewheeling asides—including his crack at the laughing crowd as “miserable, horrible people.” \n\nThe on-air snub came as CBS’s relationship with Trump has taken repeated hits, often with 60 Minutes at the center.\n\nIn July, Paramount, the network’s parent company, agreed to pay $16 million to Trump’s presidential library to settle his $20 billion lawsuit over what he claimed was deceptive editing of a Kamala Harris interview, a deal the company announced without an apology. \n\nSince then, Trump has continued his attack on the network, even as CBS has been accused of bending over backwards to placate him. In November, it aired a 28-minute version of a Trump 60 Minutes sit-down with Norah O’Donnell, as well as a separate 73-minute extended cut. \n\nYet it left out a tense exchange in which Trump expressed irritation over questions about a crypto mogul he pardoned amid reports of a $2 billion deal tied to a Trump family crypto venture. The edits also omitted Trump’s comment about CBS’s payout related to the settlement. \n\nThen came the network’s leadership turmoil. After Paramount Skydance CEO David Ellison, 42, installed Bari Weiss, 41, as CBS News editor-in-chief in October, the MAGA-curious boss spiked a 60 Minutes segment at the eleventh hour last weekend.\n\nIt featured interviews with deportees sent by the Trump administration to a notorious megaprison in El Salvador, with Weiss claiming the segment needed more work before it could air. Her last-minute decision sparked concerns of White House interference and triggered fury inside the newsroom.\n\nThe episode spiraled further when the segment surfaced anyway after a Canadian broadcaster aired it, and Paramount Skydance began issuing copyright takedowns to scrub reposts.\n\nSet against concerns over political pressure and corporate leverage, the network’s refusal to call the venue the “Trump Kennedy Center” on its biggest annual cultural broadcast—and cutting Trump’s screen time—has raised more than a few eyebrows.","summary":"CBS Photo Archive / Mary Kouw/CBS via Getty ImagesCBS News aired the Kennedy Center Honors on Tuesday using a sharply edited Donald Trump monologue and dodging his controversial “Trump Kennedy Center” rebrand.\n\nThe new Trump-appointed Kennedy Center board voted on Dec. 18 to rename the John F. Kennedy Center for the Performing Arts as the “Trump-Kennedy Center,” leading to almost immediate legal action.\n\nDespite the 79-year-old president trying to muscle the rebrand into the country’s living rooms while hosting what he called “THE TRUMP KENNEDY CENTER HONORS” on Tuesday evening, CBS aired the 48th Kennedy Center Honors with the institution’s long-standing name, noted The Washington Post.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/cbs-gets-revenge-on-trump-after-60-minutes-fiasco/","image":"https://www.thedailybeast.com/resizer/v2/MUJVMRQA5NEFZIT44YQANJRD3E.jpg?smart=true&auth=ef836d54f8a1c727009c7970a5d853c1a12636db86c8daf9b0513328aac36c37&width=1440&height=1080","video":null,"publish_date":"2025-12-24 14:33:07","author":"Tom Latchem","authors":["Tom Latchem"],"language":"en","category":"politics","source_country":"us","sentiment":-0.363},{"id":388757078,"title":"8 Times JD Vance Went Into Lions Den And Jousted With The Left","text":"Vice President J.D. Vance has repeatedly battled the corporate media in adversarial settings, pushing back aggressively against their narrative in heated exchanges.\n\nVance willingly entered the lion’s den throughout the 2024 election and as vice president, where members of the corporate media would often try to corner him on the positions and policies of President Donald Trump’s administration. Conservatives widely praised him for countering left-wing narratives.\n\n‘I don’t really care, Margaret’: Vance clashes with Margaret Brennan over illegal immigration \n\nCBS News host Margaret Brennan claimed during a Jan. 26 episode of “Face the Nation” that 30,000 Afghans had been properly vetted in the U.S., despite there being a properly vetted Afghan national who plotted a terrorist attack in Oklahoma in November 2024.\n\n“My primary concern as the vice president, Margaret, is to look after the American people. And now that we know that we have vetting problems with a lot of these refugee programs, we absolutely cannot unleash thousands of unvetted people into our country,” Vance said. \n\n“These people are vetted,” Brennan said. (RELATED: Vance Torches Politico Reporter For Deep State Smear Job)\n\n“Just like the guy who played a terrorist attack in Oklahoma a few months ago, he was allegedly properly vetted. And many people in the media and the Democratic Party said that he was properly vetted. Clearly, he wasn’t. I don’t want my children to share a neighborhood with people who are not properly vetted. And because I don’t want it for my kids, I’m not going to force any other American citizens kids to do that either.”\n\nBrennan argued that it had not been clear whether the suspect was “radicalized” before or after he arrived in the U.S.\n\n“I don’t really care, Margaret,” Vance replied. “I don’t want that person in my country. And I think most Americans agree with me.”\n\nThe suspect in question was Nasir Ahmad Tawhedi, who entered the U.S. on humanitarian parole in 2021 and was arrested for allegedly planning a terror attack on Election Day in 2024. More recently, an Afghan national named Rahmanullah Lakanwal was charged with shooting two National Guardsmen at the Farragut West metro station in Washington, D.C., in November. He entered the U.S. under former President Joe Biden’s administration and was granted asylum in early 2025 under the Trump administration.\n\nVance accuses Dana Bash of double standard between interviewing him and Democrats \n\nDuring the 2024 election cycle, Vance accused CNN’s Dana Bash of imposing a double standard on how she interviews him versus then-Vice President Kamala Harris and her former running mate, Democratic Minnesota Gov. Tim Walz. Bash questioned Vance on the allegations that Haitians were eating pets in Springfield, Ohio, which many had claimed was a conspiracy theory.\n\n“Dana, would you like to ask me questions and then let me answer them or would you like to debate me on these topics? I noticed that when you had Kamala Harris and Tim Walz, you gave them multiple choice answers to the questions that you asked and you allowed them to answer the questions. I’m happy to be here to talk about policy, but if you’re going to interrupt me every single time I open my mouth, then why am I even doing this? So please, ask a question and I ask that you be polite enough to let me answer it,” Vance said.\n\nVance turns tables on Vanity Fair story alleging official called him ‘conspiracy theorist’ \n\nVanity Fair published a report on Dec.16 alleging that White House chief of staff Susie Wiles referred to Vance as a “conspiracy theorist.” When a reporter with The Washington Post asked Vance for a response during an event on Dec. 16, he stated that he only believed in conspiracies that were true.\n\n“Sometimes I am a conspiracy theorist, but I only believe in the conspiracy theories that are true. And by the way, Susie and I have joked in private and in public about that for a long time. For example, I believed in the crazy conspiracy theory back in 2020 that it was stupid to mask three-year-olds at the height of the COVID pandemic, that we should actually let them develop some language skills. I believed in this crazy conspiracy theory that the media and the government were covering up the fact that Joe Biden was clearly unable to do the job.”\n\nVance calls out Politico reporter’s ‘journalistic malpractice’ over story about special envoy Steve Witkoff \n\nIn August, Vance harshly criticized Politico diplomatic correspondent Felicia Schwartz’s report about special envoy Steve Witkoff, in which she cited anonymous sources, trimmed down Vance’s quote and did not include comment from Secretary of State Marco Rubio.\n\n“This story from Politico is journalistic malpractice. But it’s more than that: it’s a foreign influence operation meant to hurt the administration and one of our most effective members. Notice how all of the people attacking Steve are on background? That means it’s two or three deep staters who are angry that Witkoff has succeeded where they’ve failed,” Vance wrote on X. “You know what this ‘reporter’ left out to make room for anonymous quotes? The full quote from the sitting vice president, on the record. A quote from the secretary of the state, on the record. A quote from Jared Kushner, on the record.”\n\n This story from Politico is journalistic malpractice. But it’s more than that: it’s a foreign influence operation meant to hurt the administration and one of our most effective members. Notice how all of the people attacking Steve are on background? That means it’s two or three… https://t.co/LsPmTpZfqy — JD Vance (@JDVance) August 29, 2025 \n\nVance fires back at liberal influencer accusing him of ‘war crime’ \n\nLiberal influencer Brian Krassenstein accused the administration of committing a “war crime” for launching air strikes at Venezuelan ships believed to be shipping illegal drugs to the U.S. Vance doubled down on the administration’s actions, saying that killing cartel members putting Americans in danger is the “highest and best use of our military.”\n\n“Killing the citizens of another nation who are civilians without any due process is called a war crime,” Krassenstein said in a Sept. 6 post on X.\n\n“I don’t give a shit what you call it,” Vance replied.\n\n I don’t give a shit what you call it — JD Vance (@JDVance) September 6, 2025 \n\nTrump authorized striking several Venezuelan ships that were said to be carrying drugs and drug traffickers. The administration has yet to provide credible evidence that these ships truly carried illegal drugs or were run by narcoterrorists, including members of Tren de Agua.\n\nVance scoffs at ABC host’s priorities amid government shutdown \n\nWhile the longest government shutdown in history continued on, ABC’s George Stephanopoulos asked Vance about reports that alleged border czar Tom Homan accepted $50,000 in cash from Federal Bureau of Investigation (FBI) agents in 2024 during an Oct. 12 interview on “This Week.” Vance also hit back at Stephanopoulos for focusing on a report about Homan rather than focusing on what truly mattered to the American people.\n\n“Here’s, George, why fewer and fewer people watch your program and why you’re losing credibility: because you’re talking — for now five minutes — with the vice president of the United States about this story regarding Tom Homan, a story that I’ve read about, but I don’t even know the video that you’re talking about,” Vance said. “Meanwhile, low-income women can’t get food because the Democrats and Chuck Schumer have shut down the government. Right now, we’re trying to figure out how to pay our troops because Chuck Schumer has shut the government. You are focused on a bogus story.”\n\n“You’re insinuating criminal wrongdoing against a guy who has done nothing wrong instead of focusing on the fact that our country is struggling because our government’s shut down. Let’s talk about the real issues, George,” the vice president continued. \n\nVance doesn’t let host get away with attempted gotcha question \n\nThe vice president shut down NBC News’ Kristen Welker’s attempted gotcha question about gerrymandering in Texas.\n\n“If President Trump’s agenda is so popular, why do Republicans need to add additional seats to the map?” Welker asked during an Aug. 24 segment of “Meet the Press.”\n\n“First of all, Kristen, you have to ask yourself why have Democrats gerrymandered their states aggressively in the past ten to 20 years,” Vance said. “If you look, for example, at the popular vote in a lot of these states, in Massachusetts, where 32% of the residents of Massachusetts voted for Republicans, zero Republican federal representatives.”\n\nThe Texas Legislature redrew the congressional map to help Republicans gain more seats in the House, which caused outraged Democrats to flee the state in retaliation. After a contentious legal battle, the Supreme Court gave Texas the green light to go forth with the map.\n\nVance turns tables on reporter trying to grill him on Trump’s 2020 election fraud claims \n\nDuring an appearance on “The Interview” on Oct. 12, 2024, The New York Times’ Lulu Garcia-Navarro attempted to grill Vance on whether he believed that President Donald Trump lost the 2020 election. In response, Vance fired back at her for not acknowledging that big technology companies censored the story about Hunter Biden’s laptop just weeks before the 2020 election.\n\n“Senator Vance, I’m going to ask you again. Did Donald Trump lose the 2020 election?” Garcia-Navarro asked.\n\n“Did big technology companies censor a story that independent studies have suggested would have cost Trump millions of votes? I think that’s the question … But you’re repeating a slogan rather than engaging with what I’m saying, which is that when our own technology firms engage in industrial-scale censorship — by the way, backed up by the federal government — in a way that independent studies suggest affects the votes,” Vance said. “I’m worried about Americans who feel like there were problems in 2020. I’m not worried about this slogan that people throw: Well, every court case went this way. I’m talking about something very discreet, a problem of censorship in this country that I do think affected things in 2020.\n\nTwitter suspended accounts belonging to the New York Post and then-White House press secretary Kayleigh McEnany in October 2020 for posting the outlet’s story about Hunter Biden’s laptop, claiming that it violated its “hacked materials” policy. Later, the Daily Caller News Foundation, The Washington Post and The New York Times all independently verified that the laptop belonged to Hunter Biden and that at least some of the contents were authentic.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'I don't really care, Margaret'","url":"https://dailycaller.com/2025/12/24/jd-vance-lions-den-left-wing-media/","image":"https://images.dailycaller.com/image/width=1280,height=549,fit=cover,format=webp,f=auto/https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2025%2F12%2FScreenshot-2025-12-22-at-2.57.16%E2%80%AFPM-e1766435038801.png","video":null,"publish_date":"2025-12-24 14:13:30","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","source_country":"US","sentiment":-0.261},{"id":388721494,"title":"Melania Trump and Jill Biden go head-to-head in Daily Mail poll of best White House Christmas decor - and there's a clear winner","text":"A new poll has revealed which US First Lady from the past decade has the best taste in White House Christmas decor.\n\nNearly two thirds of respondents to a Daily Mail poll conducted this week picked Melania Trump's decorating style of over Jill Biden's, and an even greater group picked Trump's over Michelle Obama's. \n\nThe poll of 1,000 registered voters conducted by JL Partners on December 20th and 21st revealed that 61 percent of Americans prefer Melania Trump's 2025 White House Christmas decorations over the 39 percent who picked Jill Biden's in 2024. \n\nPeople were shown two pictures anonymously without names attached and told to choose their preferred styles.\n\nRepublicans, independents and Democrats all agreed, with even Democrats choosing the Trump decorations by 54 percent to the 46 percent who picked Biden's.\n\nMelania also triumphed over Michelle Obama by an even larger margin of 67 percent to 33 percent for Obama's 2016 decor. \n\nDemocrats once again chose the Trump decorations over Obama's by 62 percent to 38 percent.\n\nRespondents were shown one photograph representing each first lady's decor style.\n\nThis nameless head to head test of decorating styles showed how eliminating biases can garner results that differed from public perception of this year's White House Christmas Decor. \n\nFans of the home decor television channel HGTV threatened to boycott the network this year after it broadcast a one-hour behind-the-scenes special following over one hundred volunteers as they adorned the historic home with huge trees, lavish ornaments and dramatic garlands.\n\nThis year's polling is similar to those from a poll conducted by the Daily Mail in 2017, when Trump bested Biden in decor style.\n\nFifty-four percent of respondents said they preferred Trump's trinkets over those dreamed-up by Jill Biden in option one.\n\nRepublicans, perhaps attracted to all that red, liked them the most, with 57 percent of Republicans selecting Trump's to 43 percent who said Biden's.\n\nBut Melani even won a narrow majority of Democrats to say she did it better.\n\nDaily Mail's 2017 polling found that 51 percent of Democrats preferred Trump's decor compared to 49 percent who chose Biden's.\n\nJL Partners' poll this year also revealed a number of fascinating results about how Americans view the holiday season and other Christmastime traditions. \n\nAmericans' favorite Christmas song this year was revealed to 'It's Beginning to Look a Lot Like Christmas,' chosen by 26 percent of overall respondents, making it a rare point of agreement across party lines as 29 percent of Republicans and 27 percent of Democrats both selected it as their top choice. \n\nThe most irritating Christmas song was widely considered to be 'Grandma Got Run Over by a Reindeer,' disliked by 35 percent of respondents, with Republicans and Democrats united in their annoyance. \n\nIn terms of traditions people are ready to leave behind, ugly Christmas sweaters led the way at 22 percent, followed by Elf on the Shelf at 15 percent and matching family pajamas at 14 percent.\n\nMeanwhile, the long-running debate over whether Die Hard is a Christmas movie leans toward 'no,' with 47 percent disagreeing compared to 37 percent agreeing. \n\nMen were evenly split on the issue, while women more decisively rejected the idea by a 50 percent to 30 percent margin.\n\nThe current president was seen overall as the worst politician to sit next to at the holiday table, although Republicans, predictably instead name Biden as their least desirable seatmate.\n\nRepublicans said they would most like to sit next to Trump at Christmas dinner, while Democrats preferred Barack Obama and Kamala Harris.","summary":"A new poll has revealed which US First Lady from the past decade has the best taste in White House Christmas decor.","url":"https://www.dailymail.co.uk/news/article-15409141/Melania-Trump-Jill-Biden-Christmas-decor.html","image":"https://i.dailymail.co.uk/1s/2025/12/24/12/104985959-0-Melania_Trump_s_Christmas_decorations_are_seen_in_the_East_Room_-a-14_1766579633404.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/12/01/3829603696410343920/640x360_MP4_3829603696410343920.mp4","publish_date":"2025-12-24 13:38:31","author":"Editor,Victoria Churchill","authors":["Editor","Victoria Churchill"],"language":"en","source_country":"gb","sentiment":-0.049},{"id":388742894,"title":"Hunter Biden breaks silence on the two disasters that he claims took down his dad","text":"Listen to this article in summarized format\n\nLoading...×\n\n Subscribe to \n Unlock AI Briefing and Premium ContentSubscribe NowWhat's IncludedExclusive StoriesDaily ePaper AccessSmart Market ToolsCurated Investment IdeasAd-lite Experience Subscription\n\nAPHunter Biden breaks silence on the two disasters that he claims took down his dad\n\nHunter Biden has spoken publicly about what he sees as the most damaging moments of his father’s presidency. In a revealing interview, the president’s son did not hold back as he reflected on political missteps and painful decisions. His remarks focused on two moments he believes reshaped Joe Biden’s legacy.ALSO READ: Quote of the Day by Franz Kafka: 'Start with what is right rather than…'— Top quotes by the Absurdist fiction novelistWhat did Hunter Biden say about the 2024 debate?Hunter Biden described the 2024 presidential debate against Donald Trump as “a complete and utter disaster.” Speaking on the Shawn Ryan Show, he said the debate reinforced existing doubts about his father, regardless of whether viewers supported or opposed him. During the event, Biden struggled with words and facts while responding to questions from the moderator.ALSO READ: Quote of the Day by Sylvia Plath: 'But life is long…' — Top quotes by the poet defined by deathLive EventsHunter explained that although his father managed to finish the debate, the damage was already done. “He recovered in the debate and was able to, you know, get through the debate, but it reinforced every preconceived notion that people had whether you loved him or hated him,” he said. According to Hunter, that moment forced a difficult decision about whether Joe Biden should continue his re-election campaign, as per a report by The US Sun.\"So then he’s got to make a decision about whether or not he’s going to stay in the race.”Why did the debate end Biden’s re-election bid?Hunter noted that the Democratic primaries had already concluded before the debate took place. He said no challenger stepped forward because Joe Biden was viewed as having “the most successful presidency of any Democrat or any president.” Despite that, the fallout from the debate proved decisive. Roughly three weeks later, Biden was replaced by Kamala Harris as the Democratic presidential nominee.ALSO READ: End of an era: Beloved theme park Dollywood announces immediate closure after 64 yearsHow did Hunter view the Afghanistan withdrawal?The second major issue Hunter criticized was the U.S. withdrawal from Afghanistan. He called the execution of the pullout “an obvious f***ing failure,” pointing specifically to how events unfolded in August 2021. The evacuation ended with the Abbey Gate terrorist attack, which killed more than 170 Afghans and 13 U.S. service members, as per a report by The US Sun.ALSO READ: JD Vance unleashes blistering message at Nick Fuentes after racist attacks on wife Usha“I think that there was a better way to do it,” Hunter said, adding that while blame could be placed on generals and advisors, his father understood ultimate responsibility rested with him. \"And I think that I can blame it on his generals. I can blame it on the people, the way in which we did it, but my dad always knew this, also, that the buck stops with him.\" “I think that was a failure,\" Hunter said, as per a report by The US Sun.ALSO READ: Does USPS deliver on Christmas Eve? Yes, but the catch your local post office won’t advertiseDid Hunter believe leaving Afghanistan was wrong?Despite his criticism, Hunter made it clear he did not oppose the decision to leave Afghanistan itself. He said ending the war was necessary after two decades of conflict, loss of life, and massive financial cost. Still, he emphasized that the president must own the outcome, as per a report by The US Sun.Hunter also shared that the human toll weighed heavily on his father. He said Joe Biden remains “crushed” by the deaths that occurred during the withdrawal. “Crushed by it. Just absolutely crushed,” he said.ALSO READ: Best Burger King, McDonald's, Whataburger, Shake Shack deals, offers for Christmas Eve, December 25FAQsWhat moments did Hunter Biden criticize most?The 2024 debate against Donald Trump and the Afghanistan withdrawal.Did Hunter support leaving Afghanistan?Yes, but he criticized how the withdrawal was handled.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onHunter BidenJoe Biden legacyAfghanistan withdrawal2024 presidential debateKamala HarrisShawn Ryan ShowBiden political missteps\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onHunter BidenJoe Biden legacyAfghanistan withdrawal2024 presidential debateKamala HarrisShawn Ryan ShowBiden political missteps(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Hunter Biden, in a candid interview, revealed two \"disastrous\" moments from his father's presidency. He described the 2024 debate against Donald Trump as a \"complete and utter disaster\" that solidified negative perceptions. Additionally, Hunter criticized the execution of the Afghanistan withdrawal, calling it an \"obvious f***ing failure\" despite believing leaving the country was the right decision.","url":"https://economictimes.indiatimes.com/news/international/us/hunter-biden-breaks-silence-on-the-two-disasters-that-he-claims-took-down-his-dad/articleshow/126160522.cms","image":"https://img.etimg.com/thumb/msid-126160675,width-1200,height-630,imgsize-163324,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-12-24 13:09:25","author":"Franz Kafka","authors":["Franz Kafka"],"language":"en","category":"entertainment","source_country":"in","sentiment":-0.31},{"id":388738312,"title":"Shedeur Sanders, Trump protest, Mark Johnson and more: Top 20 cleveland.com Facebook posts of 2025","text":"CLEVELAND, Ohio – In Northeast Ohio, the world revolves around the Cleveland Browns. Or at least it seems that way. \n\nThe social media producers at cleveland.com – the folks who share the news you’re reading across Facebook, X, Instagram and beyond – see every piece of news written on the website each day. And without fail, news tying back to the Browns garners high interest each year. In 2025, six of the Top 20 stories on our cleveland.com Facebook page relate back to the Browns in some way. \n\nWe have crunched the numbers and what follows are the Top 20 posts on our Facebook page for 2025, as of early December. Their ranking is determined by a statistic called total engagement, which takes link clicks, post reactions, comments, shares, video views (if applicable) and other figures into consideration to see which posts resonated most with our audience this year. \n\nFor transparency’s sake: Some items have been excluded from the list, whether it’s because a story was shared more than once, or the post was removed by the social team or taken down by Facebook. \n\nWithout further ado, here’s the Top 20: \n\nShedeur Sanders makes his Browns debut \n\nYes, it was an August preseason game. But no one knew at the time that Shedeur Sanders would end up as the Browns starting QB, beginning in Week 12 of the season. \n\nHowever, fans – and Browns beat writer Mary Kay Cabot – seemed high on Sanders after the Aug. 8 preseason win over the Carolina Panthers. A link to one of her stories with the headline, “‘Legendary’ Browns rookie Shedeur Sanders dazzles in his starting debut vs. the Panthers in 30-10 victory” garnered more than 34,000 reactions, 9,000 comments and about 1,200 shares.\n\nRock & Roll Hall of Fame 2025 inductee announcement \n\nThe Rock Hall’s location in downtown Cleveland is a point of pride for many Northeast Ohioans, and each year, the inductee selection brings a lot of... big feelings, good and bad. When this year’s inductee class was announced in April, many Facebook users spotted cleveland.com’s announcement. The post has more than 43,000 reactions, including 32,000 likes, nearly 15,000 comments and close to 6,000 shares.\n\nLocal meteorologist Mark Johnson let go from WEWS \n\nIn May 2025, meteorologist Mark Johnson was dismissed from his role at WEWS News Channel 5, a job he held for decades. There was much speculation locally about why (WEWS and its parent company Scripps did not disclose a reason), and news reports about Johnson’s dismissal were popular on Facebook this year. Two stories – the initial news report and a follow-up article with comments from Johnson’s attorney – were in the Top 15. \n\nA Facebook post with a link to the article with Johnson’s attorney’s statement garnered nearly 7,500 reactions and close to 3,000 comments.\n\nCleveland Browns hold moment of silence after Charlie Kirk’s death \n\nPrior to kickoff at the Cleveland Browns vs. Green Bay Packers game on Sept. 21, the team held a moment of silence for Charlie Kirk, the polarizing conservative activist who was assassinated on Sept. 10. \n\nA video of the moment shared on the cleveland.com Facebook page had millions of views; more than 120,000 reactions and close to 13,000 comments.\n\n“Hands Off” protest gets tense in Ohio City \n\nIn response to President Donald Trump’s second term and policies put in place by his administration, there have been a number of nationwide organized protests in 2025. In April, a “Hands Off” protest in Cleveland’s Ohio City neighborhood became tense when a Trump supporter drove past demonstrators with a large pro-Trump flag. \n\nAdditional coverage of the protest also received a lot of attention on our Facebook page. \n\nThis video, however, garnered more than 26,000 reactions and just about the same number of comments.\n\nShedeur Sanders vs. Dillon Gabriel in Browns preseason \n\nMore Browns quarterback debate to make the Top 20! After Week 2 of the Browns preseason, in which Sanders and other rookie QB Dillon Gabriel had each made one start, we asked our Facebook audience which of the two had a better debut. \n\nThe post had 24,000 reactions (with more than 21,000 reactions saying Sanders’ debut was better), as well as 3,500 comments.\n\nCleveland Clinic sets controversial policy on co-pay payments \n\nIn mid-May, the Cleveland Clinic announced a policy (which has since been reversed): Patients needed to pay their copays upfront at the time of their nonemergency appointments, or else risk losing it. A social media post announcing the news, including a link to the article, stirred a variety of reactions. \n\nThe post had about 6,800 reactions, 5,300 comments and more than 3,000 shares. Some commenters pushed back on the hospital’s billing system, and professionals noted the policy could have been a barrier to healthcare for low-income patients.\n\nStand-up comedian trashes Cleveland \n\nDon’t come for Clevelanders and expect to get out unscathed. Comedian Ariel Spears (may have) learned that lesson after some comments made about The Land on a podcast in April. \n\nSpears said Cleveland is “America’s toilet bowl” and that the people who live here are “not sharp” and “miserable.” A post on the cleveland.com Facebook page sharing Spears’ comments garnered about 5,500 reactions, more than 6,000 comments and greater than 1,000 shares. And let’s just say those comments are not too kind.\n\nPlans for new Browns stadium in Brook Park hit a snag \n\nEven though the saga surrounding construction plans for a new Cleveland Browns stadium in Brook Park, near the airport, seems to be coming to a close, our Facebook audience was invested in reading about, and interacting with, the plans every step of the way. \n\nWhen state aviation officials denied a construction permit in mid-August, stating the height of the proposed stadium would obstruct air traffic, the Facebook audience responded. The post had more than 10,000 reactions, about 3,700 comments and 1,500 shares. The top comment on the post reiterated the sentiment that the team should play in Cleveland, not the suburbs.\n\nYes, a water-skiing squirrel \n\nSurprising no one at all, animals doing quirky things attract lots of attention online. A video shared of Twiggy the water-skiing squirrel at the Cleveland Boat Show this past January was super popular. \n\nThe video was viewed more than 6.7 million times, and got more than 100,000 reactions! There were also more than 10,000 comments. It’s something you just have to see for yourself.\n\nMark Johnson hired by WKYC’s parent company \n\nLocal weatherman news was a surprise “hit” on cleveland.com’s social media pages this year. \n\nAfter popular meteorologist Mark Johnson was let go from his job at News Channel 5 in May, he was hired by WKYC Channel 3’s parent company, Tegna, in July. This breaking news story garnered more than 23,000 reactions (overwhelmingly positive), as well as nearly 5,000 comments. Johnson broadcast weather nationally for Tegna before taking on a meteorologist role on local airwaves again, this time on WKYC, in November.\n\nCleveland Clinic loses top heart hospital ranking \n\nWhen the annual U.S. News & World Report hospital rankings were released in July, there was a surprising result: After 30 years, the Cleveland Clinic lost the top spot on the list of best heart hospitals in the country. The hospital system fell to third, ranking behind two New York City hospitals. \n\nA social media post announcing the news received close to 3,000 reactions – many of them surprised or sad – as well as over 1,000 comments and more than 450 shares.\n\nShedeur Sanders’ first home game performance \n\nOn Nov. 30, Browns QB Shedeur Sanders got his first start at home against the San Francisco 49ers. The Browns lost the game, but Sanders went 16-of-25, passing for 149 yards and one touchdown. \n\nAfter each game, our social media team asks our Facebook audience how the players and coaches performed. When asked about Sanders’ first home start, fans reacted big-time: more than 11,000 reactions and over 4,300 comments.\n\nFormer VP candidate, Minnesota Gov. Tim Walz, visits Northeast Ohio \n\nIn April, the Ohio Democratic Party worked with Tim Walz – who ran with Democrat Kamala Harris in the 2024 presidential election – to come to Republican districts across the state and conduct two “people’s town halls” in districts held by Republicans. The effort was done to “bring attention to members of congress who won’t face constituents” in the early months of President Donald Trump’s second term, according to spokeswoman Katie Seewer. \n\nA Facebook post relaying the news garnered more than 10,000 reactions and nearly 15,000 comments.\n\nQuarterback Julian Sayin makes first start at Ohio State \n\nTo open the 2025 college football season, the defending champion Ohio State Buckeyes faced the Texas Longhorns, led by Arch Manning. Texas was ranked No. 1 in the preseason AP poll, with Ohio State landing at No. 3. The highly anticipated matchup resulted in a Buckeye victory, 14-7. \n\nAs with Browns games, our sports social producer asked our Facebook audience how sophomore QB Julian Sayin performed in his first Buckeyes start. The post received more than 18,000 reactions (primarily positive) and 3,300 comments.\n\nCleveland Clinic reverses controversial copay policy \n\nAfter receiving a lot of blowback from patients and advocates, the Cleveland Clinic reversed course with its planned “pay now” copay policy (see No. 7 on this list for a refresher). The reversal came about two weeks after the first announcement. Now, Clinic patients with commercial insurance or Medicare Advantage, who can’t pay their co-pay at the time of their non-emergency outpatient visit, can set up a 0% interest payment plan, according to reporter Julie Washington. \n\nThe Facebook post sharing the latest news on the policy garnered nearly 7,000 reactions, over 2,000 comments and about 1,100 shares.\n\nWest Side Market construction update \n\nThe West Side Market – the landmark and local institution on city’s near West Side – is undergoing some big upgrades. In April, renderings were publicly released, showing what the market will look like once the $68 million construction is complete. \n\nA Facebook post sharing some of those images had more than 4,300 reactions, close to 900 comments and nearly 600 shares.\n\nWacko for Flacco (again) \n\nAs the Cleveland Browns quarterback carousel spun, spun, spun this past offseason, fans of the team were given a glimmer of hope when the Browns re-signed Joe Flacco – who helped the team make a short-lived playoff run in 2023 – to a one-year deal. Ultimately, Flacco started the season for the Browns but was traded in-state to the Cincinnati Bengals after Week 5. \n\nA Facebook post asking our audience how they felt about Flacco’s return to the team received plenty of reaction – about 7,600 Facebook reactions (almost exclusively “likes” and “loves”) and about 8,400 comments.\n\nCleveland connection to scary plane crash \n\nIn February, a plane travelling from Minneapolis to Toronto crashed on the tarmac in Canada, injuring eight people. The photos of the wrecked plane lying upside-down were jarring. It turns out that same plane started its day, so to speak, in Cleveland. \n\nThe plane flew from Cleveland Hopkins airport to Minneapolis, where it landed safely with no issues that morning. The crash happened at the end of the subsequent flight. \n\nAn article detailing that local connection garnered more than 2,000 reactions on Facebook, as well as close to 850 comments.\n\nBrutus Buckeye crosses out the “M” in endzone during The Game \n\nThis year was again (finally) the year for the Ohio State Buckeyes, as they beat the Michigan Wolverines in the snow at the Big House on Nov. 29, 27-9. And our social media producer at the game, Paris McGee Jr., captured a now-viral moment from the press box. \n\nBrutus Buckeye, the beloved team mascot, X-ed out the “M” in Michigan in the snow in the endzone before writing out Script Ohio on the sideline. The video has more than 2 million views, as well as more than 26,000 reactions, 1,100 comments and 4,600 shares.","summary":"We have crunched the numbers, and what follows are the Top 20 posts on cleveland.com's Facebook page for 2025, as of early December.","url":"https://www.cleveland.com/metro/2025/12/shedeur-sanders-no-kings-protest-mark-johnson-and-more-top-20-clevelandcom-facebook-posts-of-2025.html","image":"https://www.cleveland.com/resizer/v2/SB43L47EXJBU5COOITQJZKX57E.JPG?auth=176c8e6a98b6b9a6c9d11b4585f243bfc7666e67031e1ec27ce908f373412d71&width=1280&smart=true&quality=90","video":null,"publish_date":"2025-12-24 13:01:00","author":"Jane Morice","authors":["Jane Morice"],"language":"en","source_country":"US","sentiment":0.229},{"id":388692428,"title":"8 of the biggest late night moments of 2025","text":"It's no exaggeration to say that 2025 changed the landscape of late night television.Although there were the usual viral interview moments with celebrities, the year was dominated by the cancellation of The Late Show with Stephen Colbert, the suspension and reinstatement of Jimmy Kimmel, and the controversy that surrounded both of those events.We've recapped some of the biggest late night moments of 2025 below.\n\n Seth Meyers tells Trump how to stop late night hosts from mocking him\n\n1. Stephen Colbert calling out his own parent company\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ6GC9XXYVTACGH0JGQ',\n data: {\"slug\":\"zzvx3L3DQb8\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=zzvx3L3DQb8\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nIn July, Paramount Global agreed a $16 million settlement with President Donald Trump after he filed a suit against the company over the alleged \"deceitful\" editing of a 60 Minutes interview with former Vice-President Kamala Harris. Stephen Colbert — who works for Paramount-owned CBS — didn't hold back on the news, referring to the payment as \"big fat bribe,\" and noting that Paramount had been trying to secure the Trump administration's approval of its merger with Skydance Media.\"As someone who has alway been a proud employee of this network, I am offended,\" said Colbert in his Late Show monologue. \"And I don't know if anything will ever repair my trust in this company. But just taking a stab at it, I'd say $16 million would help.\"2. Stephen Colbert announcing the cancelation of The Late Show\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ7W4E6ED252CR20V02',\n data: {\"slug\":\"AuqEZx6TmfI\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=AuqEZx6TmfI\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nJust days after his comments about Paramount, Stephen Colbert began The Late Show by announcing that it had been cancelled — it will run until May 2026 before ending for good.\"It's not just the end of our show, but it's the end of The Late Show on CBS,\" Colbert told the shocked audience. \"I'm not being replaced. This is all just going away.\"3. Stephen Colbert ramping up his coverage of Trump and Epstein\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ7W4E6ED252CR20V03',\n data: {\"slug\":\"VIZegLAvK8o\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=VIZegLAvK8o\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nDespite CBS claiming the cancellation of The Late Show was \"purely a financial decision\" and \"not related in any way to the show's performance, content or other matters happening at Paramount,\" some speculated that Paramount's Skydance Media merger — which at that point still required approval from the Trump administration — may have been a factor.Regardless, Colbert, a longtime Trump critic, didn't hold back in the days after his announcement. He ramped up his coverage of the president's actions, telling him to \"go **** yourself\" before doubling down on his coverage of Trump's friendship with convicted child sex offender Jeffrey Epstein.4. Jimmy Kimmel being suspended\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ8GC5ABYWK81S5J136',\n data: {\"slug\":\"-j3YdxNSzTk\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=-j3YdxNSzTk\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nIn September, ABC pulled Jimmy Kimmel Live! \"indefinitely\" from broadcast amidst Republican criticism toward Kimmel for his comments about right-wing commentator Charlie Kirk's killer and Republican reactions to Kirk's death. ABC's decision seemed to stem from pressure from the Trump administration; preceding the company's announcement, Federal Communications Commission (FCC) chairman Brendan Carr threatened the network to take action against the late night host (and like Colbert, a longtime Trump critic).Major backlash ensued from celebrities and Kimmel's fellow late night hosts Seth Meyers, Jimmy Fallon, Stephen Colbert, Jon Stewart, and Jon Oliver, all of whom offered their support while condemning censorship. Meanwhile, Trump and his followers reacted with glee. ABC-owned Disney+ and Hulu cancellations doubled during the suspension. Kimmel's show was reinstated a week later, smashing viewership records.5. John Oliver calling out Disney's CEO in response\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ8GC5ABYWK81S5J137',\n data: {\"slug\":\"ohPToBog_-g\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=ohPToBog_-g\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nFollowing Kimmel's suspension, John Oliver joined the late night hosts showing their support with a deep dive into exactly what the hell happened. In a must-watch monologue, the Last Week Tonight host lambasted the threatening tactics used by Trump's FCC chair Carr, and appealed directly to Disney CEO Bob Iger, urging him to stand up to parent company ABC using \"the only phrase that can genuinely make a weak bully go away...'F*** you. Make me.'\"6. Jon Stewart's 'administration compliant' Daily Show monologue\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ9P0WQ9XKG46MKC9KH',\n data: {\"slug\":\"_GXNJ3V9lzg\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=_GXNJ3V9lzg\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nAnother must-watch reaction to Kimmel's suspension was The Daily Show's 23-minute \"administration-compliant\" monologue from Jon Stewart poking fun at censorship. Facetiously walking on proverbial eggshells, the host referred to Donald Trump as \"father\" and told the audience to \"shut the f*** up\" if they reacted negatively to the president — even in regard to Trump's comments saying Kimmel was suspended for having \"zero talent\" instead of threats from FCC chair Carr to Jimmy Kimmel Live! broadcaster ABC.7. Seth Meyers calls Kimmel suspension 'a big moment in our democracy'\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJ9P0WQ9XKG46MKC9KJ',\n data: {\"slug\":\"bGpYFjwClr8\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=bGpYFjwClr8\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nLate Night host Seth Meyers has also been a target of the president this year, and also responded to Kimmel's suspension by ABC with support. In a strong monologue, Meyers took A Closer Look at censorship and free speech in Donald Trump's America.\"Trump promised to end government censorship and bring back free speech, and he's doing the opposite,\" said Meyers, calling out Kimmel's suspension. \"This is a big moment in our democracy, and we must all stand up for the principles of free expression. There's a reason free speech is in the very First Amendment. It stands above all others.\"8. Kimmel's record-breaking return monologue\n\n window.videoEmbeds = window.videoEmbeds || [];\n window.videoEmbeds.push({\n elemId: 'video-container-01KD839RJAHWJHWNVB3NJP68EQ',\n data: {\"slug\":\"c1tjh_ZO_tY\",\"url\":\"https:\\/\\/www.youtube.com\\/watch?v=c1tjh_ZO_tY\",\"start_time\":\"\"},\n videoPlayerType: 'in-content'\n\nA week after his \"indefinite\" suspension by ABC, widespread backlash, and an impactful Disney+ and Hulu boycott, Kimmel's show was reinstated on Sept. 24 — and his returning monologue smashed viewership records. Kimmel shouted out his fellow talk show hosts Jon Stewart, Seth Meyers, Jimmy Fallon, John Oliver, and Stephen Colbert.The monologue become Kimmel's most viewed YouTube monologue of all time less than a day after it went live — right now, it's sitting at 23 million views.\"This show is not important,\" said Kimmel in his monologue. \"What is important is that we get to live in a country that allows us to have a show like this…. Our freedom to speak is what [talk show hosts in other countries] admire most about this country. And that's something I'm embarrassed to say I took for granted until they pulled my friend Stephen [Colbert] off the air, and tried to coerce the affiliates who run our show in the cities that you live in to take my show off the air.\"That's not legal. That's not American. That is un-American, and it is so dangerous.\"","summary":"It's no exaggeration to say that 2025 changed the landscape of late night television.","url":"https://mashable.com/article/viral-late-night-moments-2025-colbert-kimmel","image":"https://helios-i.mashable.com/imagery/articles/00R4FHWe1bdpllLYH8aNWXy/hero-image.fill.size_1200x675.v1766573769.png","video":null,"publish_date":"2025-12-24 11:22:48","author":"Sam Haysom,Shannon Connellan","authors":["Sam Haysom","Shannon Connellan"],"language":"en","source_country":"us","sentiment":-0.305},{"id":388705922,"title":"Bari Weiss—a Poetic Inspiration","text":"One of the pleasures of working at a place like The New Republic is that every so often, something comes in over the transom that just delights us. This poem landed on my computer screen on a December Saturday. Who is this Clement Ogden Friendly? If you know anything about a) Christmas-related poetry, b) great American twentieth-century humorous poets, and c) the history of CBS News, you’ll figure it out. Let’s just say he’s someone I’m very close to.\n\nA Very Bari Christmas\n\nBy Clement Ogden Friendly\n\nThings weren’t very festive at old CBS\n\nA wasp’s nest of intrigue, a pool full of cess\n\nYes, spirits were low in Manhattan (the borough)\n\nAt the Tiffany Network of Edward R. Murrow.\n\n“We’re dead,” said a wag. “On our house, there’s a pox\n\nI mean Christ on a cracker, we’re losing to Fox.”\n\n“Well,” said another, “we’re fated to lose\n\nCuz all we put on every day is fake news.”\n\n“Piss off,” yelled wag one, who didn’t easily embarrass\n\nAt edited footage of Kamala Harris.\n\n“You’ll see what we need soon enough,” crowed wag two.\n\n“A strong, mighty wind will quite soon here blow through.”\n\nThe old days of Cronkite, of Dans Schorr and Rather\n\nWere best thought of now as just so much blather\n\nThere’s a new breed today whose opinions most count\n\nAnd they hail from a kingdom we call Paramount.\n\nIn came Askinasi and Cheeks and Jeff Shell\n\nAnd with them, to some, a quite ominous smell\n\nBut even they were subordinate—and just a bit jealous’n\n\nEnvious of the one who was called David Ellison.\n\n“Listen up!” cawed the chief in his first all-hands Zoom\n\n(He cared very little for reading the room)\n\n“Pay attention, Achtung, sit right down and park it\n\nFor my sermon on personal liberties and free markets.”\n\n“Oh!” he then added, sounding just a bit cross,\n\n“I almost forgot: And you’ll have a new boss.”\n\nA winner of Pulitzers? A war correspondent? \n\nOne whose experience on Capitol Hill is abondant?\n\n“Well, no,” David said. “She’s none of those things;\n\nCarries none of the baggage those boring things bring\n\nThey’re all so old hat! And I sense the nation’s\n\nSuspicious of these so-called ‘qualifications’\n\n“What we need is straight thinking. Someone who won’t pause, uh,\n\nOver phonies who lie about tariffs, or Gaza\n\nShe’ll be all over those wokesters just like white on rice\n\nSo meet your new leader. She’s named Bari Weiss.”\n\n“Well, hi everyone!” Bari said with a smirk.\n\n“Our time is a’wasting. Let’s get right to work.\n\nHere’s a big scoop on which I’ll spare no expense\n\nAbout alleged nonbinary bathrooms at Spence.\n\n“I also have sources who say confidensh’ly\n\nAnd again—on this scoop, I will spend exponensh’ly\n\nCuz I believe this one’ll spread like warm butter\n\nThe Chess Club at Wesleyan is funded by Qatar.”\n\n“Uh … boss,” said a staffer, “those sound … super great\n\nBut we’ve got some in the works that really can’t wait.\n\nThere’s this piece on Tom Homan that looks at him squarely.”\n\n“Love it!” chirped Weiss. “He’s been treated so unfairly!”\n\nAnd so things did go, through October, November;\n\nThere were buyouts for those old enough to remember\n\nMike Wallace and Khomeini, Scott Pelley on Tenet,\n\nOld-timers who’d someday say, “I was there when it\n\nAll started to crumble. I never did count\n\nOn this new breed of man from this place, Paramount.”\n\nNo—as Christmas approached, the mood wasn’t merry\n\nFor many who’d crossed paths with Weiss comma Bari.\n\nBut there was staff to be shed, a truth undeniable\n\nA need to defenestrate those unreliable\n\nShe had just a certain kind square in her sights\n\nIn the pre-Christmas layoffs, she retained all the whites.\n\nThere were some at the Times, a few souls misbegotten,\n\nWho knew her m.o. since that piece by Tom Cotton. \n\nAnd on West 57th, the adventure was new each day\n\nIn the reign of the neo-MAGA cantatrice.\n\n“These people,” she told Nellie, “don’t see things through my prism\n\nIt’s news to explore the failures of feminism!\n\nAnd surely no serious-minded news juggernaut\n\nShould waste its time on yet another ‘expose’ of CECOT!”\n\nAt the holiday party, she toasted her triumphs\n\n“This running a network—it ain’t rocket science!”\n\nWith dissenters being few now, no one went berserk \n\nWhen she named the new morning news anchor: Erika Kirk.\n\nSo that’s where things stood, at old CBS\n\nWhere what heldeth the future was anyone’s guess\n\nAnd where some heads hung low in Manhattan (the borough)\n\nAt the Tiffany Network of Edward R. Murrow.","summary":"One of the pleasures of working at a place like The New Republic is that every so often, something comes in over the transom that just delights us. This poem landed on my computer screen on a December Saturday. Who is this Clement Ogden Friendly? If you know anything about a) Christmas-related poetry, b) great American twentieth-century humorous poets, and c) the history of CBS News, you’ll figure it out. Let’s just say he’s someone I’m very close to.\n\n\nA Very Bari Christmas\n\nBy Clement Ogden Friendly\n\n\nThings weren’t very festive at old CBS\n\nA wasp’s nest of intrigue, a pool full of cess\n\nYes, spirits were low in Manhattan (the borough)\n\nAt the Tiffany Network of Edward R. Murrow.\n\n\n“We’re dead,” said a wag. “On our house, there’s a pox\n\nI mean Christ on a cracker, we’re losing to Fox.”\n\n“Well,” said another, “we’re fated to lose\n\nCuz all we put on every day is fake news.”\n\n\n“Piss off,” yelled wag one, who didn’t easily embarrass\n\nAt edited footage of Kamala Harris.\n\n“You’ll see what we need soon enough,” cr","url":"https://newrepublic.com/article/204664/bari-weiss-cbs-news-poetic-inspiration","image":"https://images.newrepublic.com/246bec9cf0381eeedce371c77554beac5efb58c6.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg","video":null,"publish_date":"2025-12-24 11:00:00","author":"Clement Ogden Friendly,Michael Tomasky","authors":["Clement Ogden Friendly","Michael Tomasky"],"language":"en","category":"politics","source_country":"lr","sentiment":0.086},{"id":388613904,"title":"Kamala Harris suggests mocking her cackle is sexist: 'Out-of-touch standards'","text":"Former Vice President Kamala Harris suggested that it is sexist to mock her distinctive cackle. Harris made the comment during a recent appearance on the \"Rich Little Broke Girls\" podcast, when she recalled a reporter asking her about criticisms of lacking humility. \"I don’t aspire to be humble. Humility, yes, is very important. [It’s] a very dated perspective on who women should be. To say, women should be humble. Women should be quiet. Women should laugh quietly,\" Harris said. KAMALA HARRIS SAYS SHE HASN'T DECIDED ON 2028 PRESIDENTIAL CAMPAIGN AMID REPORT SHE'S 'STEPPING TOWARD' RUN \"Women should not have a sense of humor. Women should not raise their voice,\" she continued. \"I have never felt burdened by those very dated, and I think out-of-touch standards.\" The former vice president has previously argued that sexism was to blame for criticism of her cackle, including during an April 2024 interview with talk-show host Drew Barrymore. \"Like, apparently, some people love to talk about the way I laugh,\" Harris said at the time. \"Well, let me just tell you something: I have my mother’s laugh,\" she continued. \"And I grew up around a bunch of women, in particular, who laughed from the belly.\" KAMALA HARRIS WARNS THAT DEMOCRATIC PARTY IS 'STUCK IN THE PAST,' SPEAKING INAUTHENTICALLY During Harris' appearance on the \"Rich Little Broke Girls\" podcast, she also gave dating advice to young single women, highlighting the importance of finding someone who is kind and makes them laugh. \"Choose to be with someone who allows you to laugh at yourself and them,\" she said. \"Choose to be with someone who you know you like, going to the grocery store together, taking a walk together.\" \"There are different phases in your life and you may not know what phase you’re in,\" Harris added. \"Maybe you’re going to choose that you want to have that kind of Friday night relationship — or you want that Sunday morning relationship. Sometimes you can get both — and sometimes they just are oil and water. And that’s okay! Be in those phases where you are having fun!\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP Noting that people want different things at various stages in life, Harris said she was not sure if she would have been ready to marry Doug Emhoff, who she married in 2014, earlier in life. \"Doug and I got married in our 40s, and I love my husband so very much. He is my best friend,\" Harris said. \"We’ve talked about it. If we had met in our 20s, I don’t know that we would have really been in the same place,\" she added. Harris' office did not immediately respond to Fox News Digital’s request for comment.","summary":"Former Vice President Kamala Harris suggested that mocking of her distinctive laugh is sexist, criticizing what she described as outdated standards.","url":"https://www.foxnews.com/media/kamala-harris-suggests-mocking-her-cackle-sexist-out-of-touch-standards","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/11/harris-rally.jpg","video":null,"publish_date":"2025-12-24 06:19:06","author":"Landon Mion","authors":["Landon Mion"],"language":"en","source_country":"us","sentiment":0.039},{"id":388733740,"title":"COP30 and the Art of Climate-Policy Neglect","text":"This November, delegates from nearly 200 countries convened in Brazil for COP30 – where COP stands for “Conference of Parties,” and the number 30 reflects the number of such events since the very first one in Berlin in 1995. Stemming from a UN statute adopted in 1992 and bearing the acronym UNFCCC (United Nations Framework Convention on Climate Change), reaching the 30th edition of COP would be a triumph if its success was measured on diplomatic endurance. But it’s not, and the conference’s takeaways could have seemingly been predicted before the final gavel – prioritization of the optics of agreeableness over binding, legally meaningful agreements to address the root cause of climate change: the world’s never-ending coal, oil, and gas emissions.\n\nRather, what the world saw in Belém was the continued widening chaos between the COP World and the Energy World – with the former defined by performative diplomacy and the latter defined by the unrelenting physics of the global economy. What Brazil’s President Lula deemed the “COP of Truth” felt more like another COP of capitulation. The conference effectively signaled that despite the escalating urgency of limiting greenhouse warming, the global reliance on fossil fuels will continue “until further notice.”\n\nIt is tempting to pin the outcome of COP30 on the glaring absence of the United States, led by an administration which has pompously relegated the country’s critical role in the fight against climate change both at home and abroad. Look no further than the administration’s recurrent announcements on unleashing American coal and stopping clean energy projects in their tracks. But the outcome of a United States-less COP30 – with lots of rhetoric and pacts but little needle-moving action – was not new, nor partisan. It was emblematic of a world’s unserious approach to the climate policy plans outlined in COP21’s “Paris Accords,” which yielded steadfast, collective commitments to limit the increase in global temperature to under 2 degrees Celsius above pre-industrial levels.\n\nOr, yet another fossil fuel fakeout. In 2023, I wrote in the Washington Post in “The great fossil fuel phaseout fakeout” about the Biden administration’s hypocrisy in approving the Alaskan oil-producing Willow Project – projected to yield 180,000 barrels of oil per day for 30 years – even as the U.S. delegation to COP28, headed by Vice President Kamala Harris, joined the majority’s resolve to transition away from fossil fuels. Heaven forbid the Biden administration should use political capital to lead on the global stage for a carbon tax – which meta-analyses find are widely successful in slowing emissions – or on the domestic stage for an increase of the gas tax, also proven effective. These two measures would have required meaningful political will from the leader of the free world, but would have successfully incentivized decarbonization around the world and encouraged an actual transition away from fossil fuels, very much critical for the safety and well-being of future humans.\n\nThe cost of this fakeout’s inaction is no longer theoretical. The current global temperature is already hovering around 1.5 degrees above pre-industrial levels, with no sign of abating, paralleled by an ever-rising atmospheric carbon concentration, which now stands at a historic high of roughly 430 parts per million. And with these come the never-ending streamers of record-breaking wildfires, heat waves, flooding, hurricanes, and more, all with much of the world’s most vulnerable populations in the crosshairs of sea-level rise. This is a problem that, in the absence of groundbreaking technology, will get much worse before it gets better – if it gets better.\n\nBut none of this is surprising. Many delegates leaving Brazil may have felt disappointment, but once again, it was victory for the status quo. It was a confirmation that the world is unwilling to revisit, relitigate, and reimplement the action plan outlined in Paris 10 years ago, despite this plan never being more urgent or paramount for the future of mankind.\n\nAnd while, of course, the United States’ presence was sorely missed – with COP30’s fossil fuel interests emboldened, allowing them to dig in their heels – it feels almost repetitive to recent COP conferences with the country’s leadership.\n\nOnce again, the world stands unmoved by the wrath of climate change. The United States’ chair was empty, but even when full, the drilling continued.","url":"https://www.realclearpolitics.com/articles/2025/12/24/cop30_and_the_art_of_climate-policy_neglect_153664.html","image":"https://www.realclearpolitics.com/asset/img/social_media_assets/site_logos/rcp.png","video":null,"publish_date":"2025-12-24 06:00:00","author":"Joel Darmstadter","authors":["Joel Darmstadter"],"language":"en","source_country":"us","sentiment":0.098},{"id":388591972,"title":"Jasmine Crockett says allies are worried for her safety during Texas senate bid","text":"Rep. Jasmine Crockett, D-Texas, said in an interview that some of her allies are expressing concern for her safety as she runs for the US Senate.\n\nWhile on the “Native Land Pod” podcast on Tuesday, Crockett discussed speaking with former Vice President Kamala Harris, the second black woman to be elected to the US Senate, about her decision to run for the Texas seat.\n\nShe added that she was also speaking to members of the US Senate regarding her campaign, highlighting one unnamed senator who warned that she should take precautions.\n\n“There is one member who was like, ‘I think you can do it. Like, I have no doubts,’” Crockett said. “And that particular member said, ‘My biggest concern is your safety. If you tell me that you are going to take all the precautions that you need to take, then go for it. But I don’t want you to become a sacrificial lamb.'”\n\nCrockett said that Harris, whom she described as viewing her as “family,” expressed the same sentiment.\n\n“I can tell you that the vice president in a very similar vein is, like, ‘The country needs you. I’m going to need you to make sure that you’re as safe as possible,'” Crockett said.\n\nCrockett told host Angela Rye that she was working on being fitted for a bulletproof vest after beginning her campaign, saying she was not going to run without it.\n\n“It is a sad reality, but I think about the courage that had to exist for those that came before me,” Crockett said.\n\nCrockett announced her campaign for the Senate earlier this month. Though Republicans ridiculed and criticized the announcement, some Democratic colleagues have also reportedly privately voiced disappointment at the news.\n\n“She might win a primary, but she ain’t winning a general in Texas,” one House Democrat anonymously told Axios.\n\nIn June, Crockett previously expressed doubt about pursuing a longer career in politics because of death threats she has faced in her position.\n\n“I did criminal defense work, and I worked with true blue criminals and never had to worry about death threats. And waking up and having to deal with death threats, having to think about where I go, how much security I have, because of all the hateful rhetoric that is circling, and a lot of it is spewed directly from the President of the United States himself,” Crockett said in June.","summary":"Texas Democrat announced her run for Senate earlier this month.","url":"https://nypost.com/2025/12/23/media/jasmine-crockett-says-allies-are-worried-for-her-safety-during-texas-senate-bid/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/12/newspress-collage-acvqzcbu7-1766544400533.jpg?quality=75&strip=all&1766526405&w=1200","video":"https://cdn.jwplayer.com/videos/Rx3ACbFb-RyIcpnTz.mp4","publish_date":"2025-12-24 02:58:44","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":0.03},{"id":388591954,"title":"Kamala Harris suggests criticizing her distinctive cackle is sexist — as she gives dating advice for young women","text":"Former Vice President Kamala Harris suggested that mockery over her boisterous cackle is sexist — as she doled out dating advice for young women.\n\nDuring an appearance on the “Rich Little Broke Girls” podcast, the former veep recalled being asked by a reporter about criticisms of her lacking humility.\n\n“I don’t aspire to be humble. Humility, yes, is very important,” Harris said. “[It’s] a very dated perspective on who women should be. To say, women should be humble. Women should be quiet. Women should laugh quietly,” she said as she covered her mouth and raised her eyebrows.\n\n“Women should not have a sense of humor. Women should not raise their voice,” she continued.\n\n“I have never felt burdened by those very dated, and I think out-of-touch standards.”\n\nHarris also gave dating advice to young, single women, in which she stressed the importance of finding someone who is kind.\n\n“Choose to be with someone who allows you to laugh at yourself and them,” she said. “Choose to be with someone who you know you like, going to the grocery store together, taking a walk together.”\n\n“There are different phases in your life, and you may not know what phase you’re in,” Harris added.\n\n“Maybe you’re going to choose that you want to have that kind of Friday night relationship — or you want that Sunday morning relationship.\n\n“Sometimes you can get both — and sometimes they just is oil and water. And that’s OK! Be in those phases where you are having fun!”","summary":"\"I have never felt burdened by those very dated, and I think out-of-touch standards.\"","url":"https://nypost.com/2025/12/23/us-news/kamala-harris-suggests-criticizing-her-distinctive-cackle-is-sexist/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/12/kamala-harris-suggests-criticizing-her-cackle-is-sexist.jpg?quality=75&strip=all&1766524858&w=1200","video":"https://cdn.jwplayer.com/videos/sjuJxiFX-RyIcpnTz.mp4","publish_date":"2025-12-24 02:21:49","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":0.106},{"id":388574398,"title":"Jasmine Crockett claims allies have expressed concern for her safety while running for Senate","text":"Rep. Jasmine Crockett, D-Texas, said in a interview that some of her allies are expressing concern for her safety as she runs for the U.S. Senate. While on the \"Native Land Pod\" podcast on Tuesday, Crockett discussed speaking with former Vice President Kamala Harris, the second Black woman to be elected to the U.S. Senate, about her decision to run for the Texas seat. She added that she was also speaking to members of the U.S. Senate regarding her campaign, highlighting one unnamed senator who warned that she should take precautions. CROCKETT FIRES BACK AT JD VANCE'S 'STREET GIRL' COMMENTS, SAYS IT'S A RACIST TROPE \"There is one member who was like, ‘I think you can do it. Like, I have no doubts,’\" Crockett said. \"And that particular member said, 'My biggest concern is your safety. If you tell me that you are going to take all the precautions that you need to take, then go for it. But I don't want you to become a sacrificial lamb.'\" Crockett said that Harris, whom she described as viewing her as \"family,\" expressed the same sentiment. JASMINE CROCKETT CITES MAMDANI-TRUMP, AOC-TRUMP VOTERS WHEN CONFRONTED ON PATH TO VICTORY IN TEXAS \"I can tell you that the vice president in a very similar vein is, like, 'The country needs you. I'm going to need you to make sure that you're as safe as possible,'\" Crockett said. Crockett told host Angela Rye that she was working on being fitted for a bulletproof vest after beginning her campaign, saying she was not going to run without it. \"It is a sad reality, but I think about the courage that had to exist for those that came before me,\" Crockett said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Crockett announced her campaign for the Senate earlier this month. Though Republicans ridiculed and criticized the announcement, some Democratic colleagues have also reportedly privately voiced disappointment at the news. \"She might win a primary, but she ain't winning a general in Texas,\" one House Democrat anonymously told Axios. In June, Crockett previously expressed doubt about pursuing a longer career in politics because of death threats she has faced in her position. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"I did criminal defense work, and I worked with true blue criminals and never had to worry about death threats. And waking up and having to deal with death threats, having to think about where I go, how much security I have, because of all the hateful rhetoric that is circling, and a lot of it is spewed directly from the President of the United States himself,\" Crockett said in June.","summary":"Rep. Jasmine Crockett, D-Texas, said some allies, including former Vice President Kamala Harris, expressed safety concerns as she runs for U.S. Senate.","url":"https://www.foxnews.com/media/jasmine-crockett-claims-allies-have-expressed-concern-her-safety-while-running-senate","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/jasmine-crockett-announces.jpg","video":null,"publish_date":"2025-12-24 00:45:34","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"US","sentiment":0.142},{"id":388568334,"title":"Kamala Harris Gives Hilarious Dating Advice To Younger Women On Podcast","text":"Kamala Harris may be testing a post-politics pivot ... swapping policy for pillow talk by dishing out advice to single women -- and getting a little cheeky on the campaign trail of love!\n\nThe former VP dropped her relationship wisdom on the \"Rich Little Brokegirls\" podcast Tuesday ... saying dating’s all about knowing your season, whether you’re voting for a wild Friday night situation or endorsing a wholesome Sunday-morning-coffee type deal.\n\nKamala clearly amused herself with the breakdown -- busting out that trademark cackle and teasing that in certain chapters, you don’t have to pick a party ... you can double-dip and run both romances at once!!\n\nShe eventually reined it in -- tossing out the safer stuff too, like picking someone kind, someone you can laugh with ... yadda yadda, you know the drill.\n\nBut LBR, we already know what works for Kamala. When Friday night clocks out and Sunday morning rolls around, there’s no recount ... Doug Emhoff’s got her vote locked up!","url":"https://www.tmz.com/2025/12/23/kamala-harris-dating-advice-podcast/","image":"https://imagez.tmz.com/image/84/4by3/2025/12/23/8403f76c20ca4ff1b2d34b5a42b562aa_xl.png","video":null,"publish_date":"2025-12-23 23:57:14","author":null,"language":"en","source_country":"us","sentiment":0.1},{"id":388563406,"title":"CBS defends pulling 60 Minutes segment about Trump deportations","text":"CBS News is facing scrutiny after pulling a segment from its flagship Sunday broadcast about the Trump administration’s deportations of Venezuelan men to a detention centre in El Salvador.\n\nThe last-minute decision by top editor Bari Weiss sparked widespread criticism, including from the CBS correspondent who reported the story.\n\nSharyn Alfonsi, the CBS reporter, told colleagues on Sunday that the move was “political”, according to a private note that leaked to the media.\n\nCBS had promoted the segment on social media ahead of its scheduled airtime on 60 Minutes, but said in a statement on Monday that the piece needed additional reporting.\n\nThe programme was set to document allegations of “brutal and torturous conditions” at the Terrorism Confinement Center in El Salvador, known as CECOT.\n\nThe Trump administration had deported about 250 Venezuelan men there earlier this year, accusing them of being members of a dangerous gang.\n\nNews reports published since the spring, including by the BBC, have documented allegations of abuse at the detention centre.\n\nThe 60 Minutes report, called “Inside CECOT”, will air in a future broadcast, CBS News said in its statement.\n\n“Holding stories that aren’t ready for whatever reason – that they lack sufficient context, say, or that they are missing critical voices – happens every day in every newsroom,” Ms Weiss said in a statement.\n\n“I look forward to airing this important piece when it’s ready,” she said.\n\nCBS News has a partnership agreement with the BBC, meaning news content including video footage can be shared. BBC News is editorially independent of CBS.\n\nMs Weiss told colleagues in an editorial meeting on Monday morning that the segment about the Salvadoran prison “did not advance the ball” and required more interviews.\n\n“We need to be able to get the principals on the record and on camera,” she said, according to statements reviewed by the BBC.\n\nMs Alfonsi, in her note to colleagues on Sunday, said her team had approached the White House, the State Department, and the Department of Homeland Security, but that government officials refused to be interviewed for the piece. The 60 Minutes segment had been approved by CBS lawyers and standards editors, she added.\n\n“If the administration’s refusal to participate becomes a valid reason to spike a story, we have effectively handed them a ‘kill switch’ for any reporting they find inconvenient,” Ms Alfonsi wrote.\n\nThe latest 60 Minutes controversy adds to scrutiny of CBS News since the broadcaster was taken over earlier this year as part of a wider merger with Paramount.\n\nIt is now led by David Ellison, the son of tech billionaire and Trump ally Larry Ellison, whose relationship with the president has been closely watched as he pushes to build a media empire.\n\nHe is currently seeking to acquire Warner Bros Discovery, which owns television networks including CNN. Paramount on Monday said Larry Ellison would provide a personal guarantee for more than $40bn for that deal.\n\nThe Ellisons’ earlier takeover of Paramount was approved by the Trump administration this summer, after Paramount agreed to pay $16m to settle a lawsuit brought by Trump over a 60 Minutes interview with his 2024 presidential rival Kamala Harris. Trump claimed the interview was deceptively edited to benefit Democrats.\n\nTo win approval of the deal, Mr Ellison agreed to install an independent ombudsman at CBS to review complaints of bias and committed to regulators that programming would reflect a diversity of view points.\n\nMr Ellison drew attention in October when he named Ms Weiss, a former New York Times opinion writer and founder of digital start-up The Free Press, editor-in-chief of CBS News.\n\nMs Weiss, who has criticised broadcast media for becoming too partisan and liberal, had previously said she aims to change editorial decision-making at CBS.\n\nDemocratic Senator Brian Schatz, who represents Hawaii, was among the lawmakers to weigh in on the controversy.\n\n“What is happening to CBS is a terrible embarrassment,” he wrote on social media on Sunday. “If executives think they can build shareholder value by avoiding journalism that might offend the Mad King they are about to learn a tough lesson.”\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.\n\n\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"CBS News is facing scrutiny after pulling a segment from its flagship Sunday broadcast about the Trump administration&#8217;s deportations of Venezuelan men to a detention centre in El Salvador. The last-minute decision by top editor Bari Weiss sparked widespread criticism, including from the CBS correspondent who reported the story. Sharyn Alfonsi, the CBS reporter, told [&#8230;]\n\n\nThe post CBS defends pulling 60 Minutes segment about Trump deportations appeared first on BrownGH.com.","url":"https://www.browngh.com/cbs-defends-pulling-60-minutes-segment-about-trump-deportations/","image":"https://www.browngh.com/wp-content/uploads/2025/09/BROWNGH-1.png","video":null,"publish_date":"2025-12-23 22:39:29","author":"Browngh.com","authors":["Browngh.com"],"language":"en","category":"politics","source_country":"gh","sentiment":0.033},{"id":388561744,"title":"CBS defends pulling 60 Minutes segment about Trump deportations","text":"CBS News is facing scrutiny after pulling a segment from its flagship Sunday broadcast about the Trump administration's deportations of Venezuelan men to a detention centre in El Salvador.\n\nThe last-minute decision by top editor Bari Weiss sparked widespread criticism, including from the CBS correspondent who reported the story.\n\nSharyn Alfonsi, the CBS reporter, told colleagues on Sunday that the move was \"political\", according to a private note that leaked to the media.\n\nCBS had promoted the segment on social media ahead of its scheduled airtime on 60 Minutes, but said in a statement on Monday that the piece needed additional reporting.\n\nThe programme was set to document allegations of \"brutal and torturous conditions\" at the Terrorism Confinement Center in El Salvador, known as CECOT.\n\nThe Trump administration had deported about 250 Venezuelan men there earlier this year, accusing them of being members of a dangerous gang.\n\nNews reports published since the spring, including by the BBC, have documented allegations of abuse at the detention centre.\n\nThe 60 Minutes report, called \"Inside CECOT\", will air in a future broadcast, CBS News said in its statement.\n\n\"Holding stories that aren't ready for whatever reason - that they lack sufficient context, say, or that they are missing critical voices - happens every day in every newsroom,\" Ms Weiss said in a statement.\n\n\"I look forward to airing this important piece when it's ready,\" she said.\n\nCBS News has a partnership agreement with the BBC, meaning news content including video footage can be shared. BBC News is editorially independent of CBS.\n\nMs Weiss told colleagues in an editorial meeting on Monday morning that the segment about the Salvadoran prison \"did not advance the ball\" and required more interviews.\n\n\"We need to be able to get the principals on the record and on camera,\" she said, according to statements reviewed by the BBC.\n\nMs Alfonsi, in her note to colleagues on Sunday, said her team had approached the White House, the State Department, and the Department of Homeland Security, but that government officials refused to be interviewed for the piece. The 60 Minutes segment had been approved by CBS lawyers and standards editors, she added.\n\n\"If the administration's refusal to participate becomes a valid reason to spike a story, we have effectively handed them a 'kill switch' for any reporting they find inconvenient,\" Ms Alfonsi wrote.\n\nThe latest 60 Minutes controversy adds to scrutiny of CBS News since the broadcaster was taken over earlier this year as part of a wider merger with Paramount.\n\nIt is now led by David Ellison, the son of tech billionaire and Trump ally Larry Ellison, whose relationship with the president has been closely watched as he pushes to build a media empire.\n\nHe is currently seeking to acquire Warner Bros Discovery, which owns television networks including CNN. Paramount on Monday said Larry Ellison would provide a personal guarantee for more than $40bn for that deal.\n\nThe Ellisons' earlier takeover of Paramount was approved by the Trump administration this summer, after Paramount agreed to pay $16m to settle a lawsuit brought by Trump over a 60 Minutes interview with his 2024 presidential rival Kamala Harris. Trump claimed the interview was deceptively edited to benefit Democrats.\n\nTo win approval of the deal, Mr Ellison agreed to install an independent ombudsman at CBS to review complaints of bias and committed to regulators that programming would reflect a diversity of view points.\n\nMr Ellison drew attention in October when he named Ms Weiss, a former New York Times opinion writer and founder of digital start-up The Free Press, editor-in-chief of CBS News.\n\nMs Weiss, who has criticised broadcast media for becoming too partisan and liberal, had previously said she aims to change editorial decision-making at CBS.\n\nDemocratic Senator Brian Schatz, who represents Hawaii, was among the lawmakers to weigh in on the controversy.\n\n\"What is happening to CBS is a terrible embarrassment,\" he wrote on social media on Sunday. \"If executives think they can build shareholder value by avoiding journalism that might offend the Mad King they are about to learn a tough lesson.\"","summary":"CBS News is facing scrutiny after pulling a segment from its flagship Sunday broadcast about the Trump administration's deportations of Venezuelan men to a detention centre in El Salvador.","url":"https://www.myjoyonline.com/cbs-defends-pulling-60-minutes-segment-about-trump-deportations/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/12/image-2589.png","video":null,"publish_date":"2025-12-23 22:39:13","author":"Abubakar Ibrahim,Bbc 39pm","authors":["Abubakar Ibrahim","Bbc 39pm"],"language":"en","category":"politics","source_country":"gh","sentiment":0.033},{"id":388563326,"title":"Recognizing Media Malfunctions With the Heckler Awards - Part 1: The Industry Technical Trophies","text":"With the year coming to a close, it is time to haul the news from the media to the curb, but we first need to dig through the pile and sort the refuse. We need to separate the worst from getting into the recycling bins, because the last thing we need to see is some of this behavior circulating once again. So, in the futile effort of improving the journalism landscape, we need to highlight the lowlights of 2025.\n\nHere at \"Riffed From the Headlines,\" it has been another year of compiling the worst and misbegotten in the media landscape. We began the year with the hope that improvements would be experienced. Our hopes were, not surprisingly, dashed. Thus, we are left with the task of delivering notice of the worst from the journalism industry, and for that, we have developed The Heckler Awards.\n\nThis will be a four-part series in which we will (dis)honor the events reported in the press this year, based on the evidence compiled in our daily column. We begin with technical awards, and that will then give way to specific honors in the various categories we use to organize the lapses in journalism ethics. Part One will honor industry-wide activity, while Part Two will recognize achievements by individuals and specific outlets, and then Parts Three and Four will entail the category \"winners.\"\n\nNow, with that pageantry aside, let us delve into the recognition and begin handing out the recognition of the news industry foibles for 2025, in this, the first round of The Hecklers!\n\nThe Industry Prevarication of the Year – The Epstein Follies\n\nThere were a great many corrupted storylines throughout the year, so choosing was not an easy task. But eventually we settled on the one item that seemed to be a throughline in the press for most of the year. The release of the Epstein Files occupied the press for most of 2025, beginning with the criticism that they were not released in a timely fashion. This led the press to – dare we use their term – \"pounce.\"\n\nThe accusations began early, then the delay in the release, and the announcement that there was not an actual \"list\" was all it took for the media to rush to conclusions. Later in the year, we saw the steady release of choice documents, all creating a maelstrom of accusations from the press. The common thread? It was all entirely supposition.\n\nEvery charge leveled at President Trump, every piece of \"evidence\" held up, and every claim that they finally had him pegged with guilt fell apart. The Democrats leaked choice emails and doctored photos to assign culpability, as the press obediently trumpeted the \"proof,\" and every time these examples fell apart faster than an IKEA bookshelf. The realization was that if Trump could have been brought down by Epstein evidence, it would have occurred years ago. The desperation was blatant, and the need to ignore Democrats proven to have Epstein connections made things worse.\n\nThe Media Mynah Birds Trophy – The \"Maryland Man\" Mystique\n\nAs the administration ramped up the deportation efforts, the press found their martyr, and it was a perplexing choice. Abrego Garcia was latched onto as their cause, an illegal alien with a checkered past and connections to El Salvador gangs. This was who they picked as their sympathetic figure?!\n\nYet, as he was rightfully deported, the press recast Garcia, referring to him as a \"Maryland father\" while ignoring his background, using him as a cudgel against Trump. Even when he was exposed as a domestic abuser, and then a case of him being involved in trafficking other illegals emerged, they still clung to him as their noble figure. This posturing fed into a year of other sympathetic stories where detained illegals were recast, as their valid deportation rap sheets were ignored to push the anti-deportation narrative.\n\nRecognition for Deep Sea Double-Tap Divisiveness – Drug Boat Criticisms Bombing\n\nThe obsessiveness in the press to bring down Secretary Pete Hegseth, at any cost, has been perpetual since he was announced as the appointee for the role in heading the War Department. The latest is the urgency to say he has committed a war crime by targeting drug boats off the coast of Venezuela. Specifically, one event where they targeted a boat and there were survivors, so a second strike was made. This is said to be a severe violation of war crime statutes, which collapses under scrutiny.\n\nIf the boat was initially targeted, why is a second strike considered problematic? And if double-tap strikes on targeted combatants are considered criminal, where was this media outrage when Barack Obama was routinely using double-tap drone strikes that took out first responders and civilians? The reporting today strikes as being deeply convenient.\n\nCollective Pearl-Clutching Honor – The White House Bawl-room\n\nIt was a tiresome time when every newscast had to have us feeling deep tremors of anxiety that President Trump was going to undertake the prospect of constructing a new ballroom on the White House grounds. All manner of fractured coverage ensued. First, it was destroying the main building, then it became that he was razing the historic East Wing (comprised mostly of empty offices and a kitchen that struggles to supply large events). Also, we were told he did not go through appropriate channels, that it was costing taxpayers too much, and that the private donations were a problem.\n\nWhat has cooled the coverage is how many past presidents expressed a desire for a ballroom, and that for most state dinners, guests walked through the East Wing in order to go to a party outside, held in tents.\n\nThis is actually hilarious because this photo shows invited guests walking **through** the East Wing to get to a **tent** set up outside for Biden’s state dinner.Which is…you know…the whole reason Trump is building a ballroom. pic.twitter.com/jsoFqzX3fK— Kristen Mag (@kristenmag) October 27, 2025\n\nThe Shutdown Shoutdown Citation – Slanted Coverage of Closing the Government\n\nWe endured the longest government shutdown in the nation's history, and the effects were so dire that some people actually noticed. Throughout the pointless power struggle, the press took the unanimous position that this had been entirely the fault of the Republicans. Despite, you know, the small detail about every single GOP member voting to keep things open.\n\nSomehow, the Democrats largely escaped blame despite being hailed for their strong stance, and even when they voted against emergency payments to the military and benefits programs, they were excused from culpability.\n\nIn the end, nothing at all was accomplished, and the press was left trying to sell the concept that Democrat subsidies set to expire by the Democrats and exploding the cost of the Democrat-crafted Obamacare was entirely blamed on Republicans.\n\nTaken Into Accountability Award – Media Defamation Suits\n\nIt was a year marked by media outlets being taken to task legally for errant and malicious reporting. An act that previously was difficult to enforce in the courts became a regular feature throughout the year. MSNBC settled a case where it lied about a doctor performing hysterectomies on immigrant women. CBS News also had a notable settlement with President Trump over the deceptively edited interview with Kamala Harris on 60 Minutes. Most notable was in January when a jury ruled that CNN was liable for malicious defamation against a Navy veteran. Additionally, the president has two active cases going on, one against the Pulitzer Prize committee and one recently brought against the BBC.\n\nThe Droning Censorship Decree – Stephen Colbert, Jimmy Kimmel, Mark Kelly\n\nThere has been all manner of media wailing this year about censorship, with a notable component heard: Specifically, we cannot stop hearing from those supposedly censored! After CBS announced that it was not renewing Stephen Colbert's contract, accusations flew that he was cancelled by Donald Trump. The show is losing tens of millions of dollars annually, yet the \"cancelled\" host is still on the air, insulting the president nightly, until next summer.\n\nJimmy Kimmel was pulled off the air for a few nights following his comments about Charlie Kirk. More hysteria followed about the president being intolerant of criticism. Yet there is Kimmel, each and every night, braying about the man he says is obsessed with him.\n\nSen. Mark Kelly (D-AZ) has been on a media tour for weeks now following the controversy of the Seditious Six video he took part in last month. If you have not heard Kelly declaring how he will not allow the president to silence him, go flip on your television – it is likely he is talking about not being allowed to talk by granting his 573rd interview this month.\n\nA Framed Pink Slip – NPR/PBS/CPB\n\nThe first half of the year was filled with segments, hearings, reports, and interviews with the leadership of the Public Broadcasting Service and National Public Radio, as they strove mightily to fend off the looming threat of being defunded. Their words were not only futile, as the Big Beautiful Bill saw fit to yank the federal funding, and the Corporation for Public Broadcasting folded as a result. All the emotional narratives were entirely empty, as it was shown.\n\nOne of the claims perpetually made was how people in remote areas relied on public broadcasters for emergency information. It had always been a laughable claim, but then it was exposed when the flash floods hit regions in Texas. After that natural disaster, it was found that the NPR station in that area never delivered weather alerts throughout the night when lives were affected.\n\nMedia Rennovation Recipients – MSNBC / CNN\n\nOne thing you can undertake when you are a foundering news network is changing your framework for the better. In the case of second place MSNBC and distant third place CNN, these are not exactly willing changes.\n\nCNN has long been struggling in the ratings and has long desired to enter the digital streaming marketplace. It has failed repeatedly. Most remember CNN+, the effort that cost hundreds of millions of dollars, only to be shut down in less than one month. Less known was the attempt to reconstitute things on the HBO Max platform, and that garnered little interest. So that was ended in October, as the network was set to unveil CNN Premium, a subscription service where people can pay for the content that most do not want to watch for free. How can it go wrong?!\n\nAfter Comcast Universal spun off its cable channels into a separate company called Versant, it also meant that NBC News was cutting off the cable news channel entirely. Over the course of months, MSNBC had to move out to get its own studios, was cut off from using manpower and equipment in D.C., had to rely on Sky News for syndicated content, and by November, divest itself from all connections to the broadcast network. It was rebranded as MS NOW (\"My Source for News, Opinion, and the World\"), and a $20 million ad campaign was launched to promote its rebranding.\n\nThe Trophy for Not Listening To Their Own Echoes – Ignoring the Russian Collusion Files Release\n\nFor most of a decade, the press had been entirely consumed with the coverage of the Russian collusion scandal…that wasn't. Just think back to the time when barely any newscast would take place without some mention of the scandal that was never alive but somehow would not die. But when this Spring saw Tulsi Gabbard releasing the full complement of intelligence files, suddenly the press had very little interest…at all. The story has been entirely forgotten by now.\n\nSomething about the Democrats' deceptive practices and the complicity of the press has inspired abject apathy in media circles.\n\nThe Plane Blame Game Award – False Reporting On Airline Accidents\n\nFollowing the jarring air catastrophe in D.C., when a military chopper collided with a landing passenger airliner, the press was intent on heaping the blame on President Trump and Transportation Secretary Sean Duffy. The intent was to suggest that cuts had led to staffing shortages in air traffic control towers, and for weeks, any incident to be found was blasted on the airwaves and across headlines. At one point, a plane that crashed during a landing was attempted to be blamed on President Trump and Duffy…despite that incident taking place in Canada.\n\nEventually, this narrative died off for two reasons. The number of airline accidents has been lower than the previous year, and staffing shortages were found to have been in place during the Biden years.\n\nRevisionist Thinking Recognition – New Criticisms of the Old Regime\n\nMaybe we can credit Jake Tapper and Alex Thompson for freeing the minds of some in the press. Their book \"Original Sin\" was comprised mostly of news about the Biden presidency that the press refused to cover during the Biden presidency. This sparked at least a glimmer of reports recasting some of the details from the previous four years.\n\nNew assessments about the economy from the past four years have occasionally seeped out. There was a willingness by The New York Times to take a new approach to Biden's actions at the border. And it was rather stark the way that former White House Press Secretary Karine Jean-Pierre was dumped on by many for her disaster of a book tour, where she appeared inept and incapable of speaking cogently. Now, this had always been the case with KJP, but in the past, when those of us would point it out, the press would act indignant.\n\nSomali Enchanted Evening Prize – Excusing Minnesota Welfare Fraud\n\nAs the case of the rampant government benefits scandal in Minnesota continues to grow, many in the press are showing more than a hesitation to cover this story. They seem intent on covering it up. As more evidence emerges that this entails billions of dollars of fraud, with fortunes being sent out of the country to Somalis, many outlets are taking the approach that it is wrong and mean to focus on the Somali community.\n\nOf course, there is more than just identity politics involved. The scandal is enveloping prominent Democrats, like Ilhan Omar, Tim Walz, and Keith Ellison, so they need to be brought on news shows to spin the scandal news and evade culpability.\n\nEditor’s Note: Do you enjoy Townhall’s conservative reporting and opinion? Support our work by joining Townhall VIP! Use the promo code MERRY74 to get 74% off your VIP membership!","url":"https://townhall.com/columnists/bradslager/2025/12/23/recognizing-media-malfunctions-with-the-heckler-awards-part-1-the-industry-technical-trophies-n2668383","image":"https://media.townhall.com/cdn/hodl/2024/2/a0cff6d3-8fd4-4a9f-ae8e-9b6d6db29e64.png","video":null,"publish_date":"2025-12-23 22:05:00","author":"Brad Slager","authors":["Brad Slager"],"language":"en","source_country":"us","sentiment":-0.584},{"id":388595598,"title":"Paramount efforts to buy Warner Bros Discovery play out in background of latest CBS News drama","text":"Following CBS News’ delaying of a \"60 Minutes\" segment examining the Trump administration’s deportation of Venezuelan migrants to El Salvador’s CECOT prison, some media outlets have raised questions about whether the move was meant to curry favor with the administration amid an escalating battle for Warner Bros. Discovery. Paramount and its majority shareholders, the billionaire Ellison family, recently sweetened a bid for Warner Bros. Discovery to the tune of $108 billion. Considering WBD is currently moving forward with a deal to sell its movie and streaming assets to Netflix, Paramount’s bid is deemed a hostile one. This week, Weiss created a furor over her decision to delay the airing of a \"60 Minutes\" segment about CECOT, an unusual move given the network had already begun promoting the package ahead of its expected Sunday night airing. CBS INSIDERS WARN THAT SKYDANCE MERGER BRINGS &apos;HALL MONITOR&apos; TO NEWS DIVISION Correspondent Sharyn Alfonsi interviewed Venezuelan men deported by the Trump administration to the notorious prison for the segment, which leaked online Monday after airing in Canada. Alfonsi lashed out at Weiss in a memo to colleagues, saying it was a political decision and would be viewed as corporate censorship. Weiss told staffers on Monday she did not believe the story was ready for air and called for colleagues to engage in disagreement in a respectful manner. In her notes to \"60 Minutes\" colleagues about the segment, Weiss called for more aggressive efforts to get Trump officials in front of the camera and decried a \"strange\" portion involving analysis of the prison by Berkeley students. She has not called for killing the segment entirely, but instead wants more reporting before it can be aired. Liberal media figures think something rotten is afoot, with several breathless reports alleging Weiss&apos; actions are linked to the corporate machinations and the Ellisons&apos; connections to President Donald Trump. A Tuesday report from New York Magazine’s The Intelligencer suggested that the Ellisons are vying for favorable treatment from the Trump administration by censoring the segment. Larry Ellison, the billionaire father of Paramount CEO David Ellison and a Trump ally, has offered $40 billion of his own money as equity to help sweeten the deal. WARNER BROS BOARD SLAMS PARAMOUNT TAKEOVER BID AS SHAREHOLDERS FACE $72B NETFLIX CHOICE DECISION \"The Ellisons, who are among the very richest men in the world, purchased Paramount earlier this year and are now after an even bigger fish: They are hoping Trump wields his antitrust power to scuttle Netflix’s purchase of Warner Bros. Discovery and allows Paramount, instead, to consume WB, creating a new entertainment-and-media juggernaut,\" New York Magazine claimed. Despite this alleged power move, The Intelligencer argued that the Ellisons are \"not yet on Trump’s good side, and that the president is \"still fuming about 60 Minutes and how it’s still not sycophantic toward him — not in the way he’d like.\" Indeed, Trump took a shot at \"60 Minutes\" on Truth Social last week, saying the show was treating him even worse than before since David Ellison took over Paramount following its merger with Skydance Media this year. A Monday report from progressive outlet The Intercept was even more explicit in its accusations of corporate interference related to Paramount’s bid for Warner Bros. Discovery. The outlet contended that Weiss’ move to spike the segment was \"a perfect example of why Paramount’s new owner, David Ellison, hired her in the first place.\" PARAMOUNT STRENGTHENS BID FOR WARNER BROS DISCOVERY AS WORLD AWAITS NETFLIX’S RESPONSE \"[Weiss’] job is to suck up to Trump, yes, but largely as a means –– not an end in and of itself. If Trump favors CBS and Paramount, it could undermine the pending Netflix–Warner Bros. Discovery merger, help Ellison take over WBD himself, and cement the Ellison family’s media concentration to further advance their business interests and their right-wing ideology,\" The Intercept alleged. The report went on to argue that Trump’s second term has undergone \"a total abandonment of anti-trust law,\" and that the Ellisons \"have an opportunity to consolidate unprecedented control of media into the hands of one company.\" The outlet maintained that, through the power of the federal government’s antitrust laws, Trump could tip the scales in favor of the Ellisons in the bidding war for Warner Bros. Discovery. KUSHNER FIRM DROPS OUT OF PARAMOUNT’S HOSTILE $108B WARNER BROS. DISCOVERY BID According to the outlet, Weiss and Ellison’s \"interference\" into \"60 Minutes\" isn’t necessarily about promoting \"Trumpism,\" it’s about promoting the Ellison agenda and growing their vast media empire. Earlier this year, Paramount closed an $8 billion merger with Skydance Media that required Trump administration approval. While that played out, CBS News, which is owned by Paramount, settled an election interference lawsuit with Trump for $16 million over how it edited a \"60 Minutes\" interview with Kamala Harris. The lawsuit was called spurious by critics and the settlement was viewed as an effective bribe to get the merger over the finish line, while supporters said Trump was merely holding a liberal media outlet accountable for its dishonesty. Weiss&apos; defenders online have said her ideas to improve the story were entirely reasonable, and reports that Alfonsi&apos;s segment didn&apos;t include on-the-record responses given by the White House, State Department and Department of Homeland Security have generated further discussion. There is no evidence that Weiss made any editorial decisions based on corporate or political pressures. Since she became CBS News editor-in-chief in October, her tenure has been closely scrutinized given her opinion background, particularly for her pro-Israel and anti-woke views. Alfonsi was also the correspondent behind a controversial \"60 Minutes\" segment in 2021 that alleged a pay-for-play scheme between Gov. Ron DeSantis, R-Fla., and Publix that was harshly criticized by Democrats and Republicans in the state. One thing is clear though: If Weiss did hope to generate less attention for the story by choosing to delay it, she was sorely mistaken. The segment, which can be seen here, has gotten infinitely more scrutiny than it would have if it had just aired as scheduled. GET FOX BUSINESS ON THE GO BY CLICKING HERE Weiss and CBS News did not immediately return Fox News Digital&apos;s requests for comment. Fox News&apos; David Rutz and Joseph Wulfsohn contributed to this report.","summary":"After CBS News&apos; decision to delay a &quot;60 Minutes&quot; segment about migrants deported to an El Salvador prison, some critics have alleged the move was to curry favor with the Trump administration.","url":"https://www.foxbusiness.com/media/paramount-efforts-buy-warner-bros-discovery-play-out-background-latest-cbs-news-drama","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/10/paramount.jpg","video":null,"publish_date":"2025-12-23 22:03:38","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","source_country":"us","sentiment":-0.123},{"id":388558956,"title":"Stacy Garrity’s campaign releases new ominous ad targeting Josh Shapiro","text":"The advertisement, called Twilight Justice, shows the woman riding a bike, face covered, getting on the subway, going into her apartment, and locking the doors. \n\nShe says, “You will never know my name or ever see my face. I always hide in the shadows. It’s the only way I can stay safe from retaliation.”\n\nShe goes on to ask, “Why? I expose terrible lies. I unmask the corrupt, and I make it available for all to see.”\n\nThe narrator then says, “My latest target? Let’s just say for one politician, it’s time to buckle up, sir. Go ahead, underestimate me. It’s amazing what you can learn when you hide in the shadows.”\n\nThroughout the video, images of Shapiro flash on screen, or his name appears. \n\nIt ends with the words “Twilight Justice [streaming early 2026].”\n\nGarrity campaign media consultant John Brabender said he was inspired to give the campaign advertisement an eerie vibe after the Hulu docuseries, “Death in Apartment 603: What Happened to Ellen Greenberg,” which investigates the controversial death of a 27-year-old Pennsylvania woman that was ruled a suicide. Shapiro received criticism for his handling of the Greenberg case while attorney general, but he has long defended his actions. \n\nGreenberg, who was an elementary school teacher, was found dead in her Philadelphia home in 2011 with 20 stab wounds from a large knife. \n\nThe medical examiner initially ruled it was a suicide, a ruling Greenberg’s parents dispute to this day. They believe she was murdered and said the state should have looked more closely at the evidence, which included bruises as well as the location of her stab wounds. They have spent years trying to change the cause of death and force an investigation into what they believe was the murder of their daughter. The Greenbergs have a lawsuit pending before the state Supreme Court, aiming to overturn the suicide ruling. \n\nWhen Shapiro was the state’s attorney general, his office reviewed the case, and a lower court judge acknowledged that the investigation was “deeply flawed.” However, the cause of death was not overturned, and critics have continued to comb through Shapiro’s time as state attorney general. \n\nThe series Brabender is producing for Garrity’s campaign will also be available on other social media platforms, including short-form content on Instagram, where most young voters obtain their information these days. \n\nSkipping traditional television spots to focus more on social media is a shift in how campaigns target voters, Fuyuan Shen, head of the Department of Advertising/Public Relations at the Penn State Donald Bellisario College of Communications, told ABC27.\n\n“We’ve definitely seen more ads like stories because of social media,” Shen added. “Oftentimes, that’s mixed with other information that’s difficult to sort out.”\n\nShapiro, who won his 2022 gubernatorial campaign by double digits, has become Pennsylvania‘s most popular politician by insisting that the government can still deliver for the people. He has a record that backs it up, including cutting bipartisan deals, reducing homelessness, and reopening a collapsed stretch of highway in just 12 days. \n\nShapiro, who is rumored to be eyeing a White House bid, has surged back into the spotlight, first by pushing back on former Vice President Kamala Harris‘s new book, then by strongly weighing in on the political violence spreading across the country. He has also taken President Donald Trump to task over divisive policies and a sluggish economy while meticulously building a national profile based on results and electability.\n\nPennsylvania, a critical swing state, is a near necessity for Democrats if they hope to win in 2028. It has the largest electoral prize among the key battleground states, and the last three presidential elections have been decided there by very tight margins. Trump won Pennsylvania in 2016 and 2024, while former President Joe Biden won in 2020. Shapiro was floated as a possible running mate for Harris in 2024, but she ultimately went with Gov. Tim Walz (D-MN). Harris’s 107-day sprint to the White House ended in disaster for Democrats, an outcome the party is eager to avoid repeating.\n\nJOSH SHAPIRO LOST HIS COOL AFTER LEARNING ABOUT HARRIS’S BOOK: ‘COMPLETE BULLS***’\n\nHowever, before Shapiro announces a White House bid, he will have to survive Garrity’s challenge for the governor’s seat in the midterm elections.\n\nAn email seeking comment from Shapiro on Garrity’s campaign advertisement was not returned.","summary":"Pennsylvania Treasurer&#160;Stacy Garrity, a Republican seeking to defeat Gov. Josh Shapiro (D-PA) in 2026, released a 90-second video that cryptically says she has enough dirt on the sitting governor to defeat him.&#160; The advertisement, which looks more like a streaming series trailer than a traditional campaign&#160;spot,&#160;follows a mysterious&#160;female figure moving through a dark, stylized version [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/4356990/stacy-garrity-campaign-new-ad-targeting-josh-shapiro/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/12/SUSAN-GARRITY-.jpeg?w=696","video":null,"publish_date":"2025-12-23 21:49:15","author":"Barnini Chakraborty","authors":["Barnini Chakraborty"],"language":"en","category":"politics","source_country":"us","sentiment":-0.178},{"id":388546176,"title":"Media Showdown: Bari Weiss Stands Firm on ’60 Minutes’ Deportation Story Amid Morning Joe’s Criticism","text":"Bari Weiss, the Editor-in-Chief at CBS News, recently provided further explanation regarding her unexpected decision to cancel a segment focusing on the harsh conditions within a Salvadoran prison. This facility has become notable for its role in housing individuals deported by the Trump administration.\n\nDuring CBS’s routine 9 a.m. editorial meeting on Monday, Weiss, who is 41, clarified her reasoning. According to a report from The New York Times, she concluded the segment was not worth airing as it did not offer new insights or significantly contribute to the ongoing conversation.\n\nWeiss emphasized that similar work had been previously published by outlets like the Times, underscoring her commitment to pursuing innovative and thought-provoking stories as her guiding principle.\n\n“To present a story on this topic two months later, we need to provide additional depth,” Weiss explained to her team. The decision to pull the segment sparked some controversy, prompting a managerial meeting later in the day, as reported by The Guardian.\n\nThis decision did not sit well with some members of the journalistic community. Panelists on MS NOW’s “Morning Joe” saw it as a setback for journalism. Joe Scarborough highlighted 60 Minutes Correspondent Sharyn Alfonsi’s assertion that the piece was “factually correct” and had successfully passed five standards reviews.\n\nMika Brzezinski, co-host of the show, echoed these sentiments, stating, “I’ve been in those screening sessions. Having worked there myself, I can attest that they are incredibly challenging.”\n\nCBS News employees, meanwhile, have threatened to quit over Weiss’s decision, CBS sources told CNN. Insiders told the Guardian that Weiss promised to air the story as the backlash continues.\n\n‘The most rigorous, most difficult process, it is an important process. And every frickin’ word, every frame of video is picked apart by editors to make sure it is correct. I mean, that I- they promoted it? I mean, come on,’ Brzezinski complained on Monday.\n\nThe report was set to speak on ‘brutal’ conditions at the Terrorism Confinement Center in Tecoluca, El Salvador, and was spiked on Saturday, after the story had been fully vetted by researchers and lawyers, sources who spoke with CNN said.\n\nContributor Pablo Torre griped that Weiss was ‘not a reporter, not a journalist, [and] is cosplaying as one and is poisoning the well of one of the last bastions of investigative reporting that gets funded.’\n\n‘And Sharyn Alfonsi is a very good reporter,’ Brzezinski added.\n\nWeiss’s Monday call elaborated on a Sunday note she sent to top 60 Minutes brass that claimed Afonsi’s team did not get enough administration officials on the record for the ‘important piece.’\n\n‘At present, we do not present the administration’s argument for why it sent 252 Venezuelans to CECOT,’ Weiss wrote in the memo, according to Axios.\n\n‘What we have is Karoline Leavitt’s soundbite claiming they are evildoers in America (rapists, murderers, etc.). But isn’t there much more to ask in light of the torture that we are revealing? Tom Homan and Stephen Miller don’t tend to be shy.\n\n‘I realize we’ve emailed the DHS spox, but we need to push much harder to get these principals on the record.’\n\nEarlier in the day, an internal memo sent by Alfonsi to her fellow staffers was leaked to the press.\n\nAlfonsi, the correspondent who reported out the story, slammed Weiss’s decision as a form of censorship.\n\nWeiss – a former New Yorker Times opinion writer who is only weeks into her CBS News tenure – told the Times late Sunday night: ‘My job is to make sure that all stories we publish are the best they can be. \n\nShe said that ‘folding stories that aren’t ready for whatever reason – that they lack sufficient context, say, or that they are missing critical voices – happens every day in every newsroom.’\n\nShe maintained that the 60 Minutes team would get the greenlight to publish the piece when it adheres to her standards.\n\nBut, according to Alfonsi and the two CBS sources who spoke with CNN, the story ‘was screened five times and cleared by both CBS attorneys and Standards and Practices’ as of Friday.\n\nThe sources also that the number of screenings before the initial signoff was somewhat out of the ordinary, with other shows being screened fewer times.. \n\nDespite the enhanced scrutiny, Weiss still had questions about the following morning, the sources said. It was lack of a response from the Trump administration that was her chief, CNN reported.\n\nAlfonsi argued that she and her team ‘requested responses to questions and/or interviews with DHS, the White House, and the State Department.’\n\n‘Their refusal to be interviewed is a tactical maneuver designed to kill the story,’ she told colleagues. \n\n‘If the administration’s refusal to participate becomes a valid reason to spike a story, we have effectively handed them a “kill switch” for any reporting they find inconvenient.’ \n\nThe segment was set to surround a group of Venezuelan men who thought they were being sent back to their home country, only to end up at the Terrorism Confinement Center, widely known as CECOT.\n\nFollowing Weiss’s statement to the Times, it remains unclear when it will air. \n\nWeiss was hired by Paramount CEO David Ellison back in October.\n\nShe is the founder of the right-leaning Free Press, which was bought by Ellison during for $150million. Ellison, 42, is the son of billionaire Trump ally Larry Ellison. He took the helm after the merger between Paramount and Skydance over the summer.\n\nThe deal caused over the editorial direction of CBS. The network was accused of bowing to pressure from the Trump administration by settling a suit with the president over a 60 Minutes interview in 2024 with Kamala Harris he said was ‘deceptively’ edited.\n\nDays after the suit was settled, the $8billion merger Paramount-Skydance was approved by the FCC. \n\nParamount is now launching a hostile takeover bid to acquire Warner Bros. Discovery, which owns CNN.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBari Weiss, the Editor-in-Chief at CBS News, recently provided further explanation regarding&#8230;\n\n\nThis Post: Media Showdown: Bari Weiss Stands Firm on &#8217;60 Minutes&#8217; Deportation Story Amid Morning Joe&#8217;s Criticism first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/media-showdown-bari-weiss-stands-firm-on-60-minutes-deportation-story-amid-morning-joes-criticism/","image":"https://internewscast.com/wp-content/uploads/2025/12/Bari-Weiss-doubles-down-on-pulling-60-Minutes-deportation-story.jpg","video":null,"publish_date":"2025-12-23 21:28:14","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.175},{"id":388577074,"title":"GOP Nets 12K Voter Registration Surge in Pennsylvania in One Week as Democratic Lead Shrinks Over Time","text":"A rapid shift in Pennsylvania’s voter registration landscape has added to the Republican Party’s long-term momentum, as recent data show a notable weekly gain that continues to chip away at the Democratic edge built over decades in the key battleground state.\n\nAccording to newly released data reported on December 22, 2025, Republicans achieved a net gain of 12,488 voter registrations over Democrats in a single week. This gain reflects a continuation of broader momentum for the GOP in Pennsylvania, where the Democrat advantage has been steadily shrinking over the past decade. As of now, Democrats hold a registration lead of only 49,258 voters, down from over 916,000 in 2016. Compared to the same period last year, Republicans have netted 82,373 new registrations over Democrats.\n\nThe surge also helped counteract recent efforts by Democrats to reactivate dormant voters in left-leaning strongholds. It builds on a longer trend of GOP gains that have significantly altered the voter registration landscape in Pennsylvania.\n\nBreitbart News has documented the long-term erosion of the Democrat voter registration advantage in Pennsylvania. In August, Decision Desk HQ reported that the Democrat lead had dropped to just 59,135 voters out of more than 8.3 million registered in the state. That represented one of the narrowest gaps in recent history. The data also showed that since the 2024 election cycle, Democrats had lost 449,282 registered voters—nearly twice the 222,134 lost by Republicans—resulting in a net gain of over 227,000 voters for the GOP.\n\nThis shift has occurred in tandem with economic developments under President Donald Trump’s second term. Trump, who carried Pennsylvania in 2024 with 50.4 percent of the vote over Democrat Kamala Harris, has since highlighted economic gains in the state. In a December 2025 speech in Mount Pocono, the president cited the creation of 60,000 jobs, including 4,000 in manufacturing, and nearly $100 billion in new investment—developments he attributes to pro-growth policies and collaboration with Republican Sen. Dave McCormick.\n\nTrump also emphasized that more than 40,000 Pennsylvanians have been lifted off food stamps since his return to office, highlighting job creation and new investments across the state under his administration. \n\nIn interviews conducted earlier this year by Breitbart News, Pennsylvania voters expressed a wide range of views. Some Trump supporters said they were not personally enthusiastic about him but backed his proposals to eliminate taxes on tips and overtime, citing direct economic benefits. Others agreed with his approach to tariffs and supported his executive order aimed at protecting women’s sports from biological male participation. Trump’s position that abortion should be decided at the state level was shared in a 2024 campaign video. Meanwhile, at least one Democrat voter highlighted women’s health and abortion rights as central to her decision not to support him.","summary":"A rapid shift in Pennsylvania’s voter registration landscape has added to the Republican Party’s long-term momentum, as recent data show a notable weekly gain that continues to chip away at the Democratic edge built over decades in the key battleground state.\n\n\nThe post GOP Nets 12K Voter Registration Surge in Pennsylvania in One Week as Democratic Lead Shrinks Over Time appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/12/23/gop-nets-12k-voter-registration-surge-in-pennsylvania-in-one-week-as-democratic-lead-shrinks-over-time/","image":"https://media.breitbart.com/media/2025/12/Voter-Registration-PA-640x335.jpeg","video":null,"publish_date":"2025-12-23 21:13:53","author":"Jasmyn Jordan","authors":["Jasmyn Jordan"],"language":"en","source_country":"US","sentiment":-0.25},{"id":388560012,"title":"DEEP STATE TRIGGERED: DOJ Staff Resignations Prove Harmeet Dhillon Is Doing Good Work at the Civil Rights Division","text":"More than 200 former staff at the Justice Department’s Civil Rights Division signed a letter condemning Assistant Attorney General Harmeet Dhillon, and in doing so, they outed themselves as deep state actors and demonstrated Dhillon’s effectiveness in restoring the division to its true mission.\n\nThe lawyers wrote to “sound the alarm about the near destruction of the DOJ’s once-revered crown jewel,” but their complaints illustrate the problems the Trump administration seeks to address.\n\n“There absolutely is a deep state,” John Daukas, former acting assistant attorney general in the division in Trump’s first term, told The Daily Signal in an interview Tuesday.\n\nWhile many federal employees hold “career” positions that are ostensibly nonpolitical, many of them act against the president’s political appointees and frustrate the president’s agenda.\n\nAn April RMG Research poll found that 75% of the federal employees who voted for Kamala Harris last year, work in the District of Columbia, and make more than $150,000 annually said they would refuse to follow a lawful order from President Donald Trump, if they considered it bad policy.\n\nDaukas said many Civil Rights Division career staff he worked with acted on a similar mentality.\n\n“They acted like they were the policymakers, like they had been elected, as opposed to the president,” he recalled.\n\nWhile 80% of the Civil Rights Division’s cases are noncontroversial—fighting human trafficking or real discrimination—about a fifth concern “hot-button issues,” such as abortion, transgender ideology, and “reverse discrimination.”\n\nCareer staff “did great work” with “the meat and potatoes stuff,” but they proved obstinate on other projects, Daukas said.\n\nTrump 45 Examples\n\nCareer staff balked when the Civil Rights Division opposed racial quotas by supporting Students for Fair Admissions’ cases against Harvard University and Yale University.\n\nDaukas recalled that many career staff “refused to sign briefs.” The head of the education section said “all her people were ‘too busy’ to work on the case.”\n\n“We had to cobble together this hodge-podge of people from other divisions,” including some from the U.S. Attorney’s Office in Connecticut, to do the job. The Supreme Court ultimately ruled against Harvard, striking down racial quotas.\n\nCareer staff also balked at investigating then-Gov. Andrew Cuomo, D-N.Y., for undercounting nursing home deaths during the COVID-19 pandemic. \n\nThe career staff “basically were dragging their feet. This is a technique they have—they just wait you out, thinking the administration will change,” Daukas recalled.\n\nCareer staff urged the politicals to investigate Texas and Indiana, instead. The political appointees wrote the letters themselves. Attorney General Letitia James, D-N.Y., ran her own investigation and found that Daukas’ suspicions were correct.\n\nThe Civil Rights Division also supported Idaho’s law banning boys from competing in girls’ sports, and the career staff refused to work on it, Daukas said. \n\n“We had about 400 attorneys in the Civil Rights Division, but it felt like we only had 15 or 20, who were the political appointees, willing to work on controversial issues,” he added.\n\nThe Civil Rights Division Letter\n\nThe former Civil Rights Division staffers’ letter—sent Dec. 9—unwittingly testifies to the importance of Dhillon’s work.\n\nThe letter notes that Attorney General Pam Bondi dropped a lawsuit challenging Georgia’s 2021 election integrity law—which former staffers say “made it harder to vote.”\n\nDaukas noted that the Georgia case was “totally bogus,” and that voting under the law has been easier than in many blue states. Yet the division brought the case because Biden had declared Georgia’s law “Jim Crow 2.0.”\n\nMentioning that case demonstrates “such a lack of self-awareness on their part,” Daukas said, because the case is “a paradigmatic example of the deep state and politics run amok.”\n\nThe letter also slams Dhillon’s decision to withdraw from settlement agreements regarding police wrongdoing in Minneapolis and other cities.\n\n“I was involved in the investigation of Minneapolis,” after the death of George Floyd in police custody, Daukas recalled. He said the division found evidence of potential police brutality but no evidence of racism. \n\nDespite the lack of evidence, the city of Minneapolis actually wanted a consent decree from the court, Daukas explained. “This is an inside job where they were colluding. The city wanted to be required to do these things, to spend money on social workers—it’s not like they were being punished.”\n\n“Thank goodness Harmeet and her team pulled this one back,” the former attorney noted. \n\nA Testament to Trump Reforms\n\nDhillon’s tenure marks a sea change from her predecessor under Biden, Assistant Attorney General Kristen Clarke. \n\nWhile pro-abortion vandals had targeted pro-life pregnancy centers and Catholic churches, Clarke prosecuted pro-life protesters outside abortion clinics. Clarke and her division also consulted with the Southern Poverty Law Center, which puts mainstream conservative and Christian groups on a “hate map” with the Ku Klux Klan. \n\nTrump’s administration also marks a sea change from Biden on “diversity, equity, and inclusion.” While Trump has pledged to enforce civil rights laws—which protect Americans regardless of race, sex, or religion—he has rejected the Marxist identity politics that claims the only true victims of discrimination must be from previously oppressed groups. \n\nThe former staffers’ letter complains that Dhillon “launched a coordinated effort to drive us out,” but based on the leftist bias under Clarke, the Trump administration’s approach to civil rights law, and the letter’s own complaints, it seems the effort may have been more than justified.","summary":"More than 200 former staff at the Justice Department&#8217;s Civil Rights Division signed a letter condemning Assistant Attorney General Harmeet Dhillon, and in doing so,... Read More\n\n\nThe post DEEP STATE TRIGGERED: DOJ Staff Resignations Prove Harmeet Dhillon Is Doing Good Work at the Civil Rights Division appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/12/23/deep-state-triggered-doj-staff-resignations-prove-harmeet-dhillon-is-doing-good-work-civil-rights-division/","image":"https://www.dailysignal.com/wp-content/uploads/2025/12/Harmeet-Dhillon-pointing.jpg","video":null,"publish_date":"2025-12-23 20:27:08","author":"Tyler O'Neil","authors":["Tyler O'Neil"],"language":"en","source_country":"us","sentiment":-0.06},{"id":388524242,"title":"Axios: 60 Minutes Lied About Trump Admin Response","text":"Quelle surprise. Axios actually hits the lead here, although reporter Sara Fischer made sure to provide it on X/Twitter as well:\n\nSome nuggets in here @axios:- Can confirm WH, State Dept and DHS all provided on record comment in response to CBS News journalists’ request for comment ahead of the segment. None of those comments made airhttps://t.co/hFkRmt5Uv9— Sara Fischer (@sarafischer) December 22, 2025\n\nReaders discover that the segment didn't include those comments in the first paragrph, although they have to get to the bottom of the story before the full picture emerges of the conflict between Bari Weiss and 60 Minutes' Sharyn Alfonsi:\n\nBetween the lines: According to a source familiar with \"60 Minutes\" correspondence with the administration, the \"60 Minutes\" team reached out to press officials at the White House, State Department and DHS, all of which provided comment to CBS News.None of those comments, which varied in length and substance, were included in the piece viewed by Axios.\n\nThat's not a \"between the lines\" issue. That directly reveals why Weiss pulled the segment in the US. For some reason, however, the Alfonsi segment aired in Canada, which Fischer viewed. It's not clear why Weiss' order didn't prevent the segment from airing in another country when Weiss had ordered it pulled in the US. One has to wonder whether that's clear to Weiss as well. Supposedly, the segment was transmitted \"via app\" to the Canadian distributor for 60 Minutes, but shouldn't Weiss' decision as the editor in chief of CBS News to keep it from airing have been universal?\n\nWhat is clear is that Weiss turned out to be correct in her assessment of the segment. Weiss first responded to Alfons's claim about political motives for spiking the story by saying it \"wasn't ready\" for air. Weiss then sent a more specific memo to CBS News personnel laying out the reasons for the decision, which included the need to get principals on the record to address the allegations:\n\nNew: See the memo Bari Weiss sent to some 60 Minutes staff on Sunday: pic.twitter.com/3ERieIGXLh— Isabella Simonetti (@thesimonetti) December 22, 2025\n\nMoney quote: \"Tom Homan and Stephen Miller don't tend to be shy. I realized we've emailed the DHS spox, but we need to push much harder to get these principals on the record.\" Well, surprise again! According to Axios, Alfonsi did get principals to respond, including that same DHS spokesperson and more. Rather than include that input, Alfonsi not only lied in the segment about not getting a response, she or the producers of 60 Minutes misled CBS News management about it. \n\nAnd now Axios has confirmed that, which shows exactly why Weiss got hinky after seeing the segment on Thursday. This is also not the first time that Alfonsi cooked a story at CBS News, either, so Weiss may have had her antenna up in the first place. As I noted in last night's Final Word, Alfonsi fronted a dishonest and false hit piece on Ron DeSantis in April 2021, accusing him of corruption in the deal with Publix to distribute teh COVID-19 vaccinations. It didn't take long for social media to connect the dots:\n\nThe entire reason I recognize the name is that she was the reporter behind the bogus DeSantis/publix hit piece.Link for a flashback: https://t.co/kSpbj2eeafIt was one of the most blatantly dishonest pieces of journalism I can ever remember. I would never trust a reporter who… https://t.co/gH3f6oJ62Z— AG (@AGHamilton29) December 22, 2025\n\nOh hey, Sharyn Alfonsi. I remember her.From a failed 2021 “60 Minutes” hit job that went unanswered and unexplained:“In the 60 Minutes segment that aired this weekend, CBS News’s Sharyn Alfonsi tells DeSantis, ‘Publix, as you know, donated $100,000 to your campaign, and then… https://t.co/oL7RB8BQgw— T. Becket Adams (@BecketAdams) December 22, 2025\n\nOh, and heeeyyyyy ...\n\nSharyn Alfonsi’s producer for the botched DeSantis story (Oriana Zill de Granados) is also the producer for the CECOT story. https://t.co/BByr8wnMan— Chuck Ross (@ChuckRossDC) December 23, 2025\n\nIt was so dishonest that even a Democrat involved called Alfonsi's report \"bullshit\":\n\nI did speak with @60Minutes. Never said I didn’t. They were very nice, but I told them that the @publix story was “bullshit”. Walked them through the whole process.The fact that I didn’t sit down on “camera” because I am responding to a 100 year emergency doesn’t change the truth https://t.co/G7QNsV42V5— Jared Moskowitz (@JaredEMoskowitz) April 6, 2021\n\nEven PolitiFact said at the time that CBS News owed everyone an explanation for how Alfonsi deceptively edited video of DeSantis to create a narrative rather than report the truth. The Daytona Beach News-Journal's editors wanted an explanation too, saying that Alfonsi's segment didn't \"even clear[] the bar as responsible opinion, let alone news. \n\nOf course, CBS News and 60 Minutes didn't learn any lessons about \"deceptively edited videos\" and narrative creation. They would use both again last year in their desperate attempt to make Kamala Harris sound coherent, and that time it cost Paramount $16 million to settle a lawsuit brought by Donald Trump over corrupt election interference. \n\nAnd so, here we are again, but this time CBS News is under new leadership. Will reporters finally get held accountable for producing dishonest hit pieces disguised as \"news\"? Stay tuned ... figuratively speaking only, that is. \n\nEditor's note: The crisis in media isn't just coming -- it has arrived. The mainstream media has transformed itself into the propaganda arm of the Left, and they work hard to intimidate advertisers and pressure Big Tech into choking off access to competing points of view. We hope we can gather as many allies as possible to keep all of these issues in the public square – and indeed to preserve the public square at all.\n\nJoin us in the fight. Join Hot Air VIP and use promo code MERRY to get 74% off your membership!","url":"https://hotair.com/ed-morrissey/2025/12/23/axios-60-minutes-lied-about-trump-admin-response-n3810179","image":"https://media.townhall.com/cdn/hodl/ha/images/up/2024/348/14ad40a3-f472-45a5-974c-2f4050e67830.jpeg","video":null,"publish_date":"2025-12-23 19:40:00","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.395},{"id":388522468,"title":"60 Minutes report on El Salvador prison pops up online after being pulled by CBS","text":"NEW YORK - A 60 Minutes report on a Salvadoran mega-prison housing US-deported migrants spread online on Dec 22, a day after CBS News pulled the segment before its scheduled Dec 21 broadcast, saying it needed more reporting.\n\nThe segment, which included allegations that Venezuelan deportees sent to the prison were tortured and raised questions about how the US characterised them, had first mistakenly streamed on Canada’s Global TV app on the night of Dec 22, according to a CBS News spokesperson.\n\nReuters reviewed an online video labelled as the segment in question and carrying the Global TV logo in the lower right-hand corner of the screen.\n\nThe content protection team at Paramount Skydance, which owns CBS, is in the process of issuing takedown orders for the unauthorised segment online, the CBS spokesperson said.\n\nCBS abruptly pulled the segment hours before it was due to air on Dec 21 evening in the US, sparking accusations from inside 60 Minutes and on Capitol Hill that the network was engaging in self-censorship under political pressure.\n\n“The broadcast lineup for tonight’s edition of 60 Minutes has been updated,” the programme posted on social media on Dec 21, three hours before it was slated to air.\n\n“Our report ‘Inside CECOT’ will air in a future broadcast.”\n\n‘Not an editorial decision’\n\nA CBS News spokesperson said in an email on Dec 21 that the segment “needed additional reporting”.\n\nMs Sharyn Alfonsi, a correspondent who reported the segment, said in a note to her team that CBS pulled the report for “political” reasons, according to a CBS News employee who confirmed the note’s contents.\n\n“Our story was screened five times and cleared by both CBS attorneys and Standards and Practices,” Ms Alfonsi wrote in the note, the CBS employee said on the condition of anonymity to avoid jeopardising their position.\n\n“It is factually correct. In my view, pulling it now, after every rigorous internal check has been met, is not an editorial decision, it is a political one.”\n\nMs Alfonsi told the New York Times, which reported the note on the evening of Dec 21: “I refer all questions to Bari Weiss,” referring to the new CBS News editor-in-chief.\n\nNeither Ms Alfonsi nor Ms Weiss responded to Reuters requests for comment.\n\nCECOT is a mega-prison in El Salvador where the US has sent hundreds of mostly Venezuelan migrants without trial.\n\nIt has been condemned by human rights groups for its harsh conditions.\n\nSkydance Media, run by Mr David Ellison - the son of Mr Larry Ellison, a longtime supporter of President Donald Trump - acquired Paramount in August. Mr David Ellison helped secure regulatory approval for the deal with the promise that the CBS network would reflect the “varied ideological perspectives” of American viewers.\n\nPrior to the deal, Paramount paid US$16 million (S$20 million) to settle a 2024 lawsuit Mr Trump had filed over a 60 Minutes interview with former vice-president Kamala Harris, which he said gave a distorted view of his rival for the White House.\n\nThe Federal Communications Commission has said the settlement and regulatory review were unrelated.\n\nOn Dec 22, Mr Larry Ellison stepped in to personally guarantee US$40.4 billion in Paramount Skydance’s latest effort to pry Warner Bros Discovery away from selling its prized Hollywood assets to streaming giant Netflix.\n\nThe deal would give Paramount Skydance control of CNN.\n\nIt is unclear whether Ms Weiss knew about the guarantee when she decided to hold the story. \n\nEarlier this month, Mr Trump attacked the new owners of CBS over a 60 Minutes interview with his former ally, Republican US Representative Marjorie Taylor Greene, on the same day Paramount Skydance launched a hostile bid for Warner Bros Discovery.\n\nIn an X post on Dec 22, Democratic Senate Minority Leader Chuck Schumer implied that the 60 Minutes postponement was politically motivated. “Trump and his billionaire buddies are trying to shape what people see and hear to create their own alternative reality,” Mr Schumer wrote.\n\n“The Trump administration doesn’t have a veto on what stories get told. CBS should put the full, unedited version of this story on the air ASAP. A free press doesn’t kowtow to the president – it holds him accountable.”\n\nLink removed\n\nCBS removed a link to the “Inside CECOT” segment page on Dec 21.\n\nA description on its Paramount Plus website earlier on Dec 21 said the segment was scheduled to air at 7.30pm ET, with Ms Alfonsi speaking to recently released deportees about the “brutal and torturous” conditions they had endured in the prison.\n\nMs Weiss raised several concerns with 60 Minutes producers about Ms Alfonsi’s segment and requested a substantial amount of new material to be added, the CBS employee said. The New York Times reported that Ms Weiss suggested adding an interview with White House official Stephen Miller or another senior Trump administration figure.\n\nMs Weiss further questioned the use of the term “migrants” to describe the Venezuelan men who were deported, noting they were in the US illegally, the employee said.\n\nIn her note, Ms Alfonsi stated that her team had sought comments from the White House, the State Department, and the Department of Homeland Security.\n\n“If the administration’s refusal to participate becomes a valid reason to spike a story, we have effectively handed them a ‘kill switch’ for any reporting they find inconvenient,” Ms Alfonsi wrote.\n\nThe decision comes as the network goes through changes under Ms Weiss, who was picked to lead CBS News in October after CBS parent company Paramount Skydance acquired the online publication she founded, The Free Press.\n\nMs Weiss, a former New York Times and Wall Street Journal opinion writer, was considered by some analysts as a controversial choice as she had never managed a television newsroom or produced broadcast news content before.\n\nOn Dec10, she named Mr Tony Dokoupil as the new anchor of its flagship CBS Evening News segment, replacing the dual anchor team of Mr John Dickerson and Mr Maurice DuBois. REUTERS","url":"https://www.straitstimes.com/world/united-states/60-minutes-report-on-el-salvador-prison-pops-up-online-after-being-pulled-by-cbs","image":"https://cassette.sphdigital.com.sg/image/straitstimes/6e44dacee8df3ac52c5f6e3c77cf813cdcd2dfc6d0f0d727e08d946a01d6d338","video":null,"publish_date":"2025-12-23 19:36:41","author":null,"language":"en","source_country":"sg","sentiment":-0.058},{"id":388540242,"title":"Criticisms of CBS News grow as Canada airs pulled ‘60 Minutes’ story","text":"As controversy continues over a decision by the top editor of CBS News to spike a “60 Minutes” story critical of the Trump administration shortly before air time, the piece is now available on a Canadian streaming service. The story, “Inside CECOT,” focused on immigrants sent to the notorious Salvadoran prison by the Trump administration.\n\nJournalists inside and outside CBS News criticized the decision by Editor-in-Chief Bari Weiss, who took over the news organization in October after running a conservative website, The Free Press. Weiss says the story needed more reporting, including an on-camera response from the White House. But the story was held as the network’s parent company is pushing a hostile bid to acquire Warner Bros. Discovery — including CNN — and is reportedly seeking the backing of the Trump administration.\n\nWhat did the ‘60 Minutes’ episode show?\n\nThe story at the center of the controversy includes interviews with several people deported from the U.S. and sent to El Salvador’s Terrorism Confinement Center, known as CECOT, under President Donald Trump’s immigration crackdown. \n\nThose featured in the episode recount torture and physical and sexual abuse they suffered at the prison, according to NBC News. \n\n“When we got there, the CECOT director was talking to us,” one detainee, Luis Munoz Pinto, told CBS. “The first thing he told us was that we would never see the light of day or night again.”\n\n“He said, ‘Welcome to hell. I’ll make sure you never leave.’”\n\n“60 Minutes” confirmed that authorities later released him from the facility. He said that he was awaiting a decision on his asylum claim in the U.S. when immigration authorities deported him. \n\nWhy was the show pulled?\n\nLess than two days before the episode was scheduled to air, Weiss requested editors to schedule, shoot, edit and add an interview with White House Deputy Chief of Staff Stephen Miller, who reportedly has devised much of Trump’s immigration policy. \n\nWhile last-minute edits frequently happen in the news, this wasn’t the first time Weiss had seen the episode and asked for edits, according to The New York Times. A day before, Weiss had suggested small changes and producers added them to the show. By Friday afternoon, “60 Minutes” editors gave CBS management the okay to start airing promotions of the show, according to The Times.\n\nThe publication also reported that Weiss did not appear at five screenings of the episode as producers worked on it. They say she could’ve raised concerns during any of those meetings. \n\nWeiss defended her decision during a routine staff meeting Monday.\n\n“I held that story because it was not ready,” Weiss said, according to a recording of her remarks obtained by several news outlets. \n\nWeiss said that while the stories of those detained were “powerful,” other outlets had already published similar stories on the topic.\n\n“The public knows that Venezuelans have been subjected to horrific treatment in this prison,” she said. If “60 Minutes” wanted to do the story, she said, “We simply need to do more.”\n\nProducers from the show said they had asked the Department of Homeland Security, the White House and the State Department for an on-camera interview, but all three declined.\n\nNewsroom’s reaction to the decision\n\nCriticism of Weiss’ decision was swift. The “60 Minutes” correspondent who reported the story, Sharyn Alfonsi, said the decision gave the White House veto power over stories it doesn’t like.\n\n“If the administration’s refusal to participate becomes a valid reason to spike a story,” she wrote in an email to colleagues, “we have effectively handed them a ‘kill switch’ for any reporting they find inconvenient.”\n\nJournalists agree that it’s important to seek comments from all sides to give readers or viewers a full picture of an issue. However, that’s not always possible, and occasionally a side doesn’t want to give its opinion. When that happens, most stories will note the unsuccessful effort to obtain comment but will ultimately still publish the story. \n\nExperts worry that allowing any party, especially a powerful entity like the White House, to prevent an outlet from publishing a story by simply declining an interview would create major problems. \n\nThe frustrations over the weekend carried over into the Monday staff meeting, according to The Times. Weiss said she wanted a newsroom “where we are able to have contentious disagreements about the thorniest editorial matters and do so with respect” during the meeting. \n\nBut in a later meeting with “60 Minutes” staff, Alfonsi reportedly said Weiss had never contacted her after pulling the episode. \n\n“Disagreement requires discussion,” Alfonsi said.\n\nWho is Bari Weiss?\n\nIn early October, CBS announced that it would hire Weiss as editor-in-chief of CBS News. She brought no traditional news reporting or editing experience to the job, having begun her career at the opinion pages of The Wall Street Journal and The New York Times. Weiss left the Times in 2020 after three years, saying she was “bullied” by colleagues over her political views. \n\nShe created a successful Substack that attracted more subscribers than any other political newsletter on the platform. It became so successful that Weiss hired 10 employees and adopted the name The Free Press. Paramount Skydance, CBS News’ parent company, acquired The Free Press for $150 million earlier this year. \n\nThe deal came shortly after the company paid Trump $16 million to settle a lawsuit in which he claimed “60 Minutes” had edited a 2024 interview with Vice President Kamala Harris to boost her campaign against Trump. Legal experts agreed that the lawsuit had little merit since editing full interviews into small clips is an essential part of television news.\n\nIn the wake of the Trump settlement, Weiss’ entrance into CBS News’ top newsroom position was met with concern. Many worried her lack of newsroom experience and experience with reporters would hinder the company. \n\nMany also raised concerns over her possible conflict of interest since she reports directly to David Ellison, head of Paramount Skydance. David Ellison is the son of Larry Ellison, who is also a close friend of Trump and the largest shareholder of Paramount Skydance.\n\nThe Guardian recently reported that Larry Ellison had discussed who he would fire from CNN if Paramount Skydance purchased Warner Bros. Discovery, CNN’s parent company. Paramount is also in the middle of a hostile counter to a deal between Netflix and Warner Bros.\n\nBy pulling the “60 Minutes” episode, Weiss added to concerns that she would skew the news to favor Trump. However, supporters say she makes editorial decisions without regard to David Ellison, according to The Times. But they have conceded that she was still “learning the ropes” and admitted she had mishandled the timing of her feedback. \n\nThe post Criticisms of CBS News grow as Canada airs pulled ‘60 Minutes’ story appeared first on Straight Arrow News.","url":"https://muvitv.com/2025/12/23/criticisms-of-cbs-news-grow-as-canada-airs-pulled-60-minutes-story/","image":"https://muvitv.com/wp-content/uploads/2025/12/Untitled-design-15-6wjYbQ.jpeg","video":null,"publish_date":"2025-12-23 19:24:52","author":"Muvi","authors":["Muvi"],"language":"en","source_country":"zm","sentiment":-0.248}]}