{"offset":0,"number":50,"available":6413,"news":[{"id":256295662,"title":"Newly released bodycam video captures the arrest of woman in Ohio for allegedly eating a cat and having “fur on her lips”.","text":"Police in Ohio have released grisly footage of the incident which could be at the root of Donald Trump’s extraordinary claim that Haitian migrants are killing and eating their neighbors’ pets. The claim electrified the presidential debate on Tuesday when the GOP candidate platformed rumors that Haitian newcomers in the town of Springfield have been feasting on its domestic animals. Police have now revealed bodycam video of the only person known to have eaten a cat in the state recently – an American born woman in a town 170 miles away. Allexis Ferrell, 27, was found with ‘fur on her lips and blood on her hands’ when police were called by horrified neighbors in the town of Canton on August 16. ‘Officers were able to determine that Allexis had smashed the cat’s head with her foot and then began to eat the cat,’ they wrote in their report. The bizarre footage opens seconds after police arrived to find a ‘female squatting on a cat which appeared to have its head smashed in and the female with her hands on it’. Officers confronted Ferrell and ordered her to put her hands behind her back before one remarked: ‘Someone got rubber gloves? She’s covered in blood.’ She makes no response as she is asked her address and read her Miranda rights, before the grossed out officer warns a colleague to put a blanket on the back seat of their squad car. ‘Smile for me. Go like this,’ he says as he holds up a camera, ‘Did you eat that cat? Did you eat it?’ She bares her teeth for the picture and shakes her head slightly but says nothing. ‘Why d’you kill it?’ he demands. ‘I don’t know,’ she pipes in a small voice. ‘Get in there. It’s ridiculous,’ he says as he shoves her into the car. The first claims about pets being eaten over in Springfield were raised at a city commission meeting on July 30. Furious locals used the forum to voice their feelings about the 15,000 Haitians who have arrived on Temporary Protected Status since 2020. ‘I really challenge you guys to get out here and do something,’ one angry resident told the meeting. ‘These Haitians are running into trash cans, running into buildings, they’re flipping cars in the middle of the streets.’ ‘They’re in the park, grabbing up ducks by their neck, and cutting their head off and walking off with them. They’re eating them.’ One anonymous poster to a Springfield residents’ Facebook group claimed that her ‘neighbor’s daughter’s friend’ had lost her cat. ‘One day she came home from work, as soon as she stepped out of her car, looked towards a neighbor’s house, where Haitians live, and saw her cat hanging from a branch, like you’d do a deer for butchering, and they were carving it up to eat,’ she explained. Police and city officials in the town have been at pains to insist that there have been no credible reports of any migrants harming any pets. But the rumors were amplified by Trump’s running mate JD Vance before the ex-president himself wielded them in his debate with Kamala Harris. ‘In Springfield, they’re eating the dogs,’ he told her. ‘The people that came in. They’re eating the cats. ‘They’re eating — they’re eating the pets of the people that live there. ‘And this is what’s happening in our country.’ Told by ABC moderator David Muir that there had been no credible reports to the authorities, the ex-president insisted that had ‘seen people on television’. ‘The people on television say my dog was taken and used for food,’ he added. A spokesperson for Springfield police was among those denying the claims. ‘In response to recent rumors alleging criminal activity by the immigrant population in our city, we wish to clarify that there have been no credible reports or specific claims of pets being harmed, injured or abused by individuals within the immigrant community,’ he said on Tuesday. The Canton PD footage continues with an officer turning to a group of onlookers after Ferrell is placed in the squad car. ‘Did you guys see all this?’ he inquires. ‘No we pulled up and she was just laying there with..’ one replies. ‘Did you see her eating it?’ he asks. ‘Yeah,’ says one, ‘It was gross,’ added another. ‘She said with the blood on her shoes she stomped it out. She stomped the head out.’ ‘Well you don’t kill a cat and go to the hospital, you go to jail,’ the officer remarks. ‘Will you call the humane society and see if they will come pick this cat up,’ he then mutters into his radio. ‘It’s deceased.’ Ferrell is being held in the Stark County Jail on a charge of cruelty to companion animals, a fifth-degree felony. She graduated from Canton McKinley High School in 2015 and has a lengthy criminal history, with previous charges including cocaine possession, receiving stolen property and endangering children. ‘The suspect in this case is not a Haitian immigrant,’ Canton police spokesperson Dennis Garren said. ‘She is a lifelong Canton resident.’ Her bond has been set at $100,000 and she is due to face a competency hearing in front of Stark County Common Pleas Judge Frank G. Forchione on October 15. She has entered a plea of not guilty due to insanity.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPolice in Ohio have released grisly footage of the incident which could&#8230;\n\n\nThis Post: Newly released bodycam video captures the arrest of woman in Ohio for allegedly eating a cat and having &#8220;fur on her lips&#8221;. first appeared on Internewscast Journal","url":"https://internewscast.com/news/newly-released-bodycam-video-captures-the-arrest-of-woman-in-ohio-for-allegedly-eating-a-cat-and-having-fur-on-her-lips/","image":"https://i.dailymail.co.uk/1s/2024/09/13/01/89617959-0-image-m-19_1726186018389.jpg","video":null,"publish_date":"2024-09-13 00:44:24","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.546},{"id":256295472,"title":"Taylor Swift’s Harris-Walz Endorsement Sees 400-500% Increase in Voter Registration | Video","text":"Voter registration has reportedly increased by 400-500% in the last two days, according to TargetSmart senior adviser Tom Bonier. He told CBS News on Thursday that those numbers are in part thanks to what’s been dubbed the “Swift Effect” after the singer-songwriter endorsed Vice President Kamala Harris and Gov. Tim Walz in this year’s presidential election. “It’s really unlike anything I’ve seen,” Bonier said. “We’re seeing a [400] or 500% increase. And people come in, trying to register to vote immediately following the debate and in that period after Taylor Swift posted on Instagram.” Additionally, he noted that voter registration isn’t slowing down. In fact, “we’ve seen it continue through the last two days into today,” Bonier continued. He also credited the boost to Swift’s call to register to vote at the VMAs again on Wednesday. “If you are over 18, please register to vote for something else that’s very important, the … presidential election,” she told fans. The result, Bonier said, was “somewhere in the neighborhood of [9,000] to 10,000 people per hour just hitting our system. That’s not indicative of everything, but it’s a lot.” CNN also reported that Vote.gov saw 405,999 people referred to the site directly from Swift’s Instagram in the 24 hours that followed her endorsement. Swift endorsed Harris and Walz moments after the first presidential debate concluded on Tuesday. The singer wrote in part, “I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election. I’m voting for Harris because she fights for the rights and causes I believe need a warrior to champion them.” “I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos. I was so heartened and impressed by her selection of running mate Tim Walz, who has been standing up for LGBTQ+ rights, IVF and a woman’s right to her own body for decades,” Swift concluded, signing her message, “Taylor Swift, Childless Cat Lady.”","summary":"\"It's really unlike anything I've seen,\" TargetSmart senior adviser Tom Bonier tells CBS News\n\n\nThe post Taylor Swift&#8217;s Harris-Walz Endorsement Sees 400-500% Increase in Voter Registration | Video appeared first on TheWrap.","url":"https://www.thewrap.com/taylor-swift-voter-registration-harris-walz-endorsement/","image":"https://www.thewrap.com/wp-content/uploads/2024/09/taylor-swift-getty.jpg","video":null,"publish_date":"2024-09-13 00:39:28","author":"Stephanie Kaloi","authors":["Stephanie Kaloi"],"language":"en","source_country":"US","sentiment":-0.065},{"id":256295820,"title":"Bomb Threat Rattles US City In Republican Anti-migrant Conspiracy","text":"Government buildings and an elementary school in Springfield, Ohio were evacuated Thursday after an emailed bomb threat, police said, rattling the small US city at the heart of an anti-migrant conspiracy theory amplified by Donald Trump.Springfield has been thrust into the spotlight in recent days after an unfounded story of Haitian migrants eating pets went viral on social media, with the Republican ex-president and current White House candidate pushing the narrative despite it being debunked.Democrats have accused Trump and his running mate, Ohio Senator JD Vance, of fanning racial tensions as they use the Springfield conspiracy theory to elevate immigration as a campaign issue ahead of November's election.Trump doubled down on the rhetoric during a campaign rally in Tucson, Arizona on Thursday, saying that \"migrants are walking off with the town's geese.\"Immediately after mentioning Springfield in his speech, Trump added: \"I'm angry about young American girls being raped and sodomized and murdered by savage criminal aliens,\" though provided no specific details.Springfield authorities said there were no credible reports of pets being harmed by members of the immigrant community -- accusations that Trump also repeated in his Thursday debate against Democratic Vice President Kamala Harris.The White House condemned the claims on Thursday as \"filth\" and said they were endangering people's lives.On Thursday, Springfield police said that City Hall and several other government buildings had been evacuated after a bomb threat sent by email at 8:24 am (1224 GMT).\"Authorities investigated and cleared all facilities listed in the threat with the assistance of explosive detecting canines,\" the force said in a statement.Fulton Elementary School and Springfield Academy of Excellence were also listed in the threat and evacuated, according to the statement.\"We are currently partnering with the Dayton office of the Federal Bureau of Investigation to identify the source of the email,\" it added.Arriving at the school to retrieve his child, Haitian immigrant Mackenso Roseme told AFP that the current tensions in the community were \"worrying.\"\"I'm a little stressed. I think something might happen,\" he said.A sign in English, Spanish and Haitian Creole informed Roseme and other parents that the students had been moved to a high school.Mayor Rob Rue told the Springfield News-Sun that the person who sent the bomb threat claimed to be from the city and mentioned Haitian immigration issues.Despite the bomb threats, Trump was still reposting memes related to the conspiracy theory hours later on his Truth Social platform.He claimed Ohio was being \"inundated with illegal migrants, mostly from Haiti, who are taking over Towns and Villages at a level and rate never seen before.\"Springfield, with a population of about 58,000, has seen an increase in Haitian immigrants in recent years -- 10,000 to 15,000 according to the Springfield News-Sun.Social services, schools and housing have been stressed in the city for years, with some pointing to migration as a factor.Ohio Governor Mike DeWine -- a Republican like Trump -- gave some context to the situation in Springfield during an interview Thursday. DeWine said 15,000 immigrants from Haiti live in Springfield, \"a dramatic change\" for the city, and added they were there under Temporary Protected Status (TPS), which allows foreign nationals to live and work in the United States. \"Why did they come? They came for jobs,\" DeWine told Fox News reporters. \"There's nothing wrong with us being welcoming.\"A multiracial group of pastors called a press conference Thursday in Springfield, joining hands in prayer and calling on the community to come together. \"Today there were some things that happened, some threats of violence,\" Wes Babian, a former pastor of First Baptist Church, told AFP.\"That is part of what motivated the quick calling of clergy to come together to express our support for the Haitian community and our concern for the well-being of the entire community.\"","summary":"Government buildings and an elementary school in Springfield, Ohio were evacuated Thursday after an emailed bomb threat, police said, rattling the small US city at the heart of an anti-migrant conspiracy theory amplified by Donald Trump.","url":"https://www.ibtimes.com/bomb-threat-rattles-us-city-republican-anti-migrant-conspiracy-3743083","image":"https://d.ibtimes.com/en/full/4547572/springfield-has-been-thrust-spotlight-recent-days-after-unfounded-story-haitian-migrants.jpg","video":null,"publish_date":"2024-09-13 00:36:13","author":"Nicholas Roll With Daniel Stublen In Washington","authors":["Nicholas Roll With Daniel Stublen In Washington"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.169},{"id":256295374,"title":"New and surprising body camera video captures the arrest of a woman in Ohio for allegedly consuming a cat.","text":"Police in Ohio have released grisly footage of the incident which could be at the root of Donald Trump’s extraordinary claim that Haitian migrants are killing and eating their neighbors’ pets. The claim electrified the presidential debate on Tuesday when the GOP candidate platformed rumors that Haitian newcomers in the town of Springfield have been feasting on its domestic animals. Police have now revealed bodycam video of the only person known to have eaten a cat in the state recently – an American born woman in a town 170 miles away. Allexis Ferrell, 27, was found with ‘fur on her lips and blood on her hands’ when police were called by horrified neighbors in the town of Canton on August 16. ‘Officers were able to determine that Allexis had smashed the cat’s head with her foot and then began to eat the cat,’ they wrote in their report. The bizarre footage opens seconds after police arrived to find a ‘female squatting on a cat which appeared to have its head smashed in and the female with her hands on it’. Officers confronted Ferrell and ordered her to put her hands behind her back before one remarked: ‘Someone got rubber gloves? She’s covered in blood.’ She makes no response as she is asked her address and read her Miranda rights, before the grossed out officer warns a colleague to put a blanket on the back seat of their squad car. ‘Smile for me. Go like this,’ he says as he holds up a camera, ‘Did you eat that cat? Did you eat it?’ She bares her teeth for the picture and shakes her head slightly but says nothing. ‘Why d’you kill it?’ he demands. ‘I don’t know,’ she pipes in a small voice. ‘Get in there. It’s ridiculous,’ he says as he shoves her into the car. The first claims about pets being eaten over in Springfield were raised at a city commission meeting on July 30. Furious locals used the forum to voice their feelings about the 15,000 Haitians who have arrived on Temporary Protected Status since 2020. ‘I really challenge you guys to get out here and do something,’ one angry resident told the meeting. ‘These Haitians are running into trash cans, running into buildings, they’re flipping cars in the middle of the streets.’ ‘They’re in the park, grabbing up ducks by their neck, and cutting their head off and walking off with them. They’re eating them.’ One anonymous poster to a Springfield residents’ Facebook group claimed that her ‘neighbor’s daughter’s friend’ had lost her cat. ‘One day she came home from work, as soon as she stepped out of her car, looked towards a neighbor’s house, where Haitians live, and saw her cat hanging from a branch, like you’d do a deer for butchering, and they were carving it up to eat,’ she explained. Police and city officials in the town have been at pains to insist that there have been no credible reports of any migrants harming any pets. But the rumors were amplified by Trump’s running mate JD Vance before the ex-president himself wielded them in his debate with Kamala Harris. ‘In Springfield, they’re eating the dogs,’ he told her. ‘The people that came in. They’re eating the cats. ‘They’re eating — they’re eating the pets of the people that live there. ‘And this is what’s happening in our country.’ Told by ABC moderator David Muir that there had been no credible reports to the authorities, the ex-president insisted that had ‘seen people on television’. ‘The people on television say my dog was taken and used for food,’ he added. A spokesperson for Springfield police was among those denying the claims. ‘In response to recent rumors alleging criminal activity by the immigrant population in our city, we wish to clarify that there have been no credible reports or specific claims of pets being harmed, injured or abused by individuals within the immigrant community,’ he said on Tuesday. The Canton PD footage continues with an officer turning to a group of onlookers after Ferrell is placed in the squad car. ‘Did you guys see all this?’ he inquires. ‘No we pulled up and she was just laying there with..’ one replies. ‘Did you see her eating it?’ he asks. ‘Yeah,’ says one, ‘It was gross,’ added another. ‘She said with the blood on her shoes she stomped it out. She stomped the head out. ‘Well you don’t kill a cat and go to the hospital, you go to jail,’ the officer remarks. ‘Will you call the Humane society and see if they will come pick this cat up,’ he mutters into his radio. ‘It’s deceased.’ Ferrell is being held in the Stark County Jail on a charge of cruelty to companion animals, a fifth-degree felony. She graduated from Canton McKinley High School in 2015 and has a lengthy criminal history, with previous charges including cocaine possession, receiving stolen property and endangering children. ‘The suspect in this case is not a Haitian immigrant,’ Canton police spokesperson Dennis Garren said. ‘She is a lifelong Canton resident.’ Her bond has been set at $100,000 and she is due to face a competency hearing in front of Stark County Common Pleas Judge Frank G. Forchione on October 15. She has entered a plea of not guilty due to insanity.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPolice in Ohio have released grisly footage of the incident which could&#8230;\n\n\nThis Post: New and surprising body camera video captures the arrest of a woman in Ohio for allegedly consuming a cat. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/new-and-surprising-body-camera-video-captures-the-arrest-of-a-woman-in-ohio-for-allegedly-consuming-a-cat/","image":"https://i.dailymail.co.uk/1s/2024/09/13/01/89617959-0-image-m-19_1726186018389.jpg","video":null,"publish_date":"2024-09-13 00:31:24","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.546},{"id":256295774,"title":"Editorial: Kamala Leaves Trump Scrambling In Debate","text":"One of Trump's biggest weaknesses in the debate was his inability to stay succinct. Rather than recognising when silence would serve him better, he continuously took the bait Harris laid out. For instance, on the subject of illegal immigration, Trump made a bizarre and baseless claim that illegal immigrants were “eating the pets of good people in Springfield, Ohio”. This not only detracted from his argument but also showcased his tendency to derail serious discussions with outlandish statements. Each time Harris baited him, Trump took the hook, appearing increasingly angry, out of depth, and small. What’s surprising is that Trump had ample opportunity to shift the focus onto Harris's tenure as Vice-President under Joe Biden. Instead, he remained fixated on President Biden, forcing Harris to repeatedly remind him that she, not Biden, was his opponent. She even managed to dodge a critical question on why the Biden administration waited so long to address illegal immigration. Trump was so absorbed in his pet-eating story that he missed the chance to capitalise on her evasion. The debate ultimately did Trump’s campaign more harm than good. While his earlier confrontation with President Joe Biden in June highlighted the President’s age-related struggles, Wednesday’s debate underscored Trump’s inability to adapt. With this poor performance, it’s uncertain if Trump will be willing to engage in another debate with Harris. Debates, of course, aren’t the sole deciders of an election’s outcome. Trump still enjoys a strong base of supporters, and Harris’s win in this debate may not be enough on its own to defeat him. But the evening certainly reinforced her strengths and his weaknesses.","summary":"","url":"https://www.freepressjournal.in/analysis/editorial-kamala-leaves-trump-scrambling-in-debate","image":"https://media.assettype.com/freepressjournal/2024-09-11/royo536m/Hero Image - 2024-09-11T090202.509.jpg","video":null,"publish_date":"2024-09-13 00:30:00","author":"Fpj Editorial","authors":["Fpj Editorial"],"language":"en","catgory":"politics","source_country":"IN","sentiment":-0.347},{"id":256295428,"title":"Bomb threat stokes fear in Ohio’s Springfield after Trump amplifies pet-eating rumours","text":"Government buildings and a junior school in Springfield, Ohio were evacuated on Thursday after an emailed bomb threat, police said, rattling the small US city at the heart of an anti-migrant conspiracy theory amplified by Donald Trump. Springfield has been thrust into the spotlight in recent days after an unfounded story of Haitian migrants eating pets went viral on social media, with the Republican ex-president and current White House candidate pushing the narrative despite it being debunked. Democrats have accused Trump and his running mate, Ohio Senator J.D. Vance, of fanning racial tensions as they use the Springfield conspiracy theory to elevate immigration as a campaign issue ahead of November’s election. Trump doubled down on the rhetoric during a campaign rally in Tucson, Arizona on Thursday, saying that “migrants are walking off with the town’s geese”. Immediately after mentioning Springfield in his speech, Trump added: “I’m angry about young American girls being raped and sodomised and murdered by savage criminal aliens,” though provided no specific details. Springfield authorities said there were no credible reports of pets being harmed by members of the immigrant community – accusations that Trump also repeated in his Thursday debate against Democratic Vice-President Kamala Harris. The White House condemned the claims on Thursday as “filth” and said they were endangering people’s lives. On Thursday, Springfield police said that city hall and several other government buildings had been evacuated after a bomb threat sent by email at 8:24am (local time). “Authorities investigated and cleared all facilities listed in the threat with the assistance of explosive detecting canines,” the force said in a statement. Fulton junior school and Springfield Academy of Excellence were also listed in the threat and evacuated, according to the statement. “We are currently partnering with the Dayton office of the Federal Bureau of Investigation to identify the source of the email,” it added. Arriving at the school to retrieve his child, Haitian immigrant Mackenso Roseme said that the current tensions in the community were “worrying”. “I’m a little stressed. I think something might happen,” he said. A sign in English, Spanish and Haitian Creole informed Roseme and other parents that the students had been moved to a high school. Mayor Rob Rue told the Springfield News-Sun that the person who sent the bomb threat claimed to be from the city and mentioned Haitian immigration issues. Despite the bomb threats, Trump was still reposting memes related to the conspiracy theory hours later on his Truth Social platform. He claimed Ohio was being “inundated with illegal migrants, mostly from Haiti, who are taking over Towns and Villages at a level and rate never seen before.” Springfield, with a population of about 58,000, has seen an increase in Haitian immigrants in recent years – 10,000 to 15,000 according to the Springfield News-Sun. Social services, schools and housing have been stressed in the city for years, with some pointing to migration as a factor. Ohio Governor Mike DeWine – a Republican like Trump – gave some context to the situation in Springfield during an interview on Thursday. DeWine said 15,000 immigrants from Haiti live in Springfield, “a dramatic change” for the city, and added they were there under Temporary Protected Status (TPS), which allows foreign nationals to live and work in the United States. “Why did they come? They came for jobs,” DeWine told Fox News reporters. “There’s nothing wrong with us being welcoming.” A multiracial group of pastors called a press conference on Thursday in Springfield, joining hands in prayer and calling on the community to come together. “Today there were some things that happened, some threats of violence,” Wes Babian, a former pastor of First Baptist Church, said. “That is part of what motivated the quick calling of clergy to come together to express our support for the Haitian community and our concern for the well-being of the entire community.”","summary":"Evacuation of government buildings came days after the former president falsely claimed that Haitian immigrants were harming pets.","url":"https://www.scmp.com/news/world/united-states-canada/article/3278330/bomb-threat-stokes-fear-ohios-springfield-after-trump-amplifies-pet-eating-rumours","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/09/13/13b85341-ee08-4a2f-b073-2de66f629d4f_d9b66065.jpg","video":null,"publish_date":"2024-09-13 00:27:07","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"cn","sentiment":0.003},{"id":256295096,"title":"Trump Reveals Who He Plans to Blame If He Loses Election","text":"Is Donald Trump gearing up to blame old folks if he loses the presidential election to Kamala Harris in November? It sure sounded that way Thursday at a rally held by the former president in Tucson, Arizona, where he took note of the changing demographic of his supporters and wondered aloud if they will be to blame if he’s defeated on Election Day. “We have a lot of young people here,” Trump said. “My audiences, they’ve gotten younger and younger, do you notice that?” The crowd cheered as the 78-year-old former president basked in their appreciation. But rather than embracing their support and using it as a reason to emphasize his movement as a political movement focused on the future, he pivoted to reassuring the audience that he hadn’t changed one bit. “Don’t worry, I still like the old people the best, I don’t care!” he exclaimed, pointing at the supporters directly in front of him. The audience roared even louder than before. Trump grew even more animated. “I don’t care, let that cost—all these young people,” he said, gesturing to another section of the crowd. “Let that cost me the election. I like the—I still like the old people the best. Got to stay with the people that got you there, right?\" Indeed, the people who sent him to the White House in 2016 were older, according to an examination of exit polling from his election victory over Hillary Clinton performed by Pew Research. He fared well among 50- to 64-year-old voters at that time, and even better with those aged 65 and older. Trump’s hint that he's already gunning to blame young folks if he loses in November followed the former president’s widely criticized debate performance Tuesday night, when floated bizarre debunked conspiracies and failed to hit a home run, much less get on base. Trump announced earlier Thursday that he declined to debate Harris again, sparking widespread outrage and ridicule from Democrats who called him a “chicken.” He told supporters at his Tucson rally that he was turning down a rematch because he’s already done two—one against Joe Biden, which he won on a mercy rule, and one against Harris, who arguably pitched a shutout. “And because they were successful, there will be no third debate,” he said as the crowd cheered. But his actions suggested otherwise. He has slammed the debate’s moderators, David Muir and Linsey Davis, and blamed ABC News for bias against him. He suggested the network “has taken a big hit, because these two people are bad news.\"","summary":"Getty/Justin SullivanIs Donald Trump gearing up to blame old folks if he loses the presidential election to Kamala Harris in November? \n\nIt sure sounded that way Thursday at a rally held by the former president in Tucson, Arizona, where he took note of the changing demographic of his supporters and wondered aloud if they will be to blame if he’s defeated on Election Day.\n\n“We have a lot of young people here,” Trump said. “My audiences, they’ve gotten younger and younger, do you notice that?”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-reveals-who-he-plans-to-blame-if-he-loses-election","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2943,w_5230,x_0,y_228/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1726181165/GettyImages-1821573124_dvhr3r","video":null,"publish_date":"2024-09-13 00:21:16","author":"Mini Racker","authors":["Mini Racker"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.011},{"id":256294944,"title":"There will be no more debates with Harris, Trump says","text":"Republican nominee Donald Trump said on Thursday he would not participate in another presidential debate against Vice President Kamala Harris ahead of the Nov. 5 election, after several polls showed his Democratic rival won their debate earlier this week.'THERE WILL BE NO THIRD DEBATE!' the former president wrote on social media site Truth Social.Trump had participated in a debate against President Joe Biden in June before his debate against Harris on Tuesday.","summary":"While Donald Trump said in his post that polls showed he won the debate, several surveys showed that respondents thought Kamala Harris did better.","url":"https://www.japantimes.co.jp/news/2024/09/13/world/politics/trump-no-more-harris-debate/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/09/13/421414.jpg?v=3.1","video":null,"publish_date":"2024-09-13 00:19:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","catgory":"politics","source_country":"jp","sentiment":-0.391},{"id":256295224,"title":"Shocking new bodycam footage shows moment woman with 'fur on her lips' arrested for eating cat in Ohio","text":"Police in Ohio have released grisly footage of the incident which could be at the root of Donald Trump's extraordinary claim that Haitian migrants are killing and eating their neighbors' pets. The claim electrified the presidential debate on Tuesday when the GOP candidate platformed rumors that Haitian newcomers in the town of Springfield have been feasting on its domestic animals. Police have now revealed bodycam video of the only person known to have eaten a cat in the state recently - an American born woman in a town 170 miles away. Allexis Ferrell, 27, was found with 'fur on her lips and blood on her hands' when police were called by horrified neighbors in the town of Canton on August 16. 'Officers were able to determine that Allexis had smashed the cat's head with her foot and then began to eat the cat,' they wrote in their report. The bizarre footage opens seconds after police arrived to find a 'female squatting on a cat which appeared to have its head smashed in and the female with her hands on it'. Officers confronted Ferrell and ordered her to put her hands behind her back before one remarked: 'Someone got rubber gloves? She's covered in blood.' She makes no response as she is asked her address and read her Miranda rights, before the grossed out officer warns a colleague to put a blanket on the back seat of their squad car. 'Smile for me. Go like this,' he says as he holds up a camera, 'Did you eat that cat? Did you eat it?' She bares her teeth for the picture and shakes her head slightly but says nothing. 'Why d'you kill it?' he demands. 'I don't know,' she pipes in a small voice. 'Get in there. It's ridiculous,' he says as he shoves her into the car. The first claims about pets being eaten over in Springfield were raised at a city commission meeting on July 30. Furious locals used the forum to voice their feelings about the 15,000 Haitians who have arrived on Temporary Protected Status since 2020. 'I really challenge you guys to get out here and do something,' one angry resident told the meeting. 'These Haitians are running into trash cans, running into buildings, they're flipping cars in the middle of the streets.' 'They're in the park, grabbing up ducks by their neck, and cutting their head off and walking off with them. They're eating them.' One anonymous poster to a Springfield residents' Facebook group claimed that her 'neighbor's daughter's friend' had lost her cat. 'One day she came home from work, as soon as she stepped out of her car, looked towards a neighbor's house, where Haitians live, and saw her cat hanging from a branch, like you'd do a deer for butchering, and they were carving it up to eat,' she explained. Police and city officials in the town have been at pains to insist that there have been no credible reports of any migrants harming any pets. But the rumors were amplified by Trump's running mate JD Vance before the ex-president himself wielded them in his debate with Kamala Harris. 'In Springfield, they're eating the dogs,' he told her. 'The people that came in. They're eating the cats. 'They're eating -- they're eating the pets of the people that live there. 'And this is what's happening in our country.' Told by ABC moderator David Muir that there had been no credible reports to the authorities, the ex-president insisted that had 'seen people on television'. 'The people on television say my dog was taken and used for food,' he added. A spokesperson for Springfield police was among those denying the claims. 'In response to recent rumors alleging criminal activity by the immigrant population in our city, we wish to clarify that there have been no credible reports or specific claims of pets being harmed, injured or abused by individuals within the immigrant community,' he said on Tuesday. The Canton PD footage continues with an officer turning to a group of onlookers after Ferrell is placed in the squad car. 'Did you guys see all this?' he inquires. 'No we pulled up and she was just laying there with..' one replies. 'Did you see her eating it?' he asks. 'Yeah,' says one, 'It was gross,' added another. 'She said with the blood on her shoes she stomped it out. She stomped the head out. 'Well you don't kill a cat and go to the hospital, you go to jail,' the officer remarks. 'Will you call the Humane society and see if they will come pick this cat up,' he mutters into his radio. 'It's deceased.' Ferrell is being held in the Stark County Jail on a charge of cruelty to companion animals, a fifth-degree felony. She graduated from Canton McKinley High School in 2015 and has a lengthy criminal history, with previous charges including cocaine possession, receiving stolen property and endangering children. 'The suspect in this case is not a Haitian immigrant,' Canton police spokesperson Dennis Garren said. 'She is a lifelong Canton resident.' Her bond has been set at $100,000 and she is due to face a competency hearing in front of Stark County Common Pleas Judge Frank G. Forchione on October 15. She has entered a plea of not guilty due to insanity.","summary":"Police found Allexis Ferrell, 27, with 'fur on her lips' and 'blood on her hands' when they were called by horrified neighbors on August 16.","url":"https://www.dailymail.co.uk/news/article-13844919/bodycam-eating-cat-Ohio-trup-pets.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/09/13/01/89617959-0-image-m-24_1726186047620.jpg","video":null,"publish_date":"2024-09-13 00:17:41","author":"Dominic Yeatman For,Editor","authors":["Dominic Yeatman For","Editor"],"language":"en","source_country":"GB","sentiment":-0.546},{"id":256294904,"title":"Laura Loomer: Who is conspiracy theorist travelling with Trump?","text":"Now, she is known for her vocal support of Trump and for promoting a long string of conspiracy theories including claims that Kamala Harris is not black, and that the son of billionaire George Soros was sending cryptic messages calling for Trump’s assassination. These posts led her to be banned from a number of platforms including Facebook, Instagram and even, according to her, Uber and Lyft for making offensive comments about Muslim drivers. She once described herself as a “proud Islamophobe”. Ms Loomer frequently attends events in support of Trump and has been seen previously at his Florida residence Mar-a-Lago. Earlier this year, she travelled on his plane to Iowa where she was given a shout-out by him on stage at an event. “You want her on your side,” Trump said. The former president has also shared several of her videos on Truth Social. And last year, the New York Times reported that Trump had expressed an interest in hiring her for his campaign, relenting only after top aides expressed concern that she could damage his electoral efforts. “Everyone who works for him thinks she’s a liability,” one Trump aide said of Ms Loomer in a report in NBC News in January. Another outspoken Trump supporter, Marjorie Taylor Greene, took issue with Ms Loomer this week over her comments questioning Harris’s race and a post in which she said the White House “will smell like curry” if Harris – who is partly of Indian descent – is elected. Greene said Ms Loomer’s comments were “appalling and extremely racist” and did “not represent who we are as Republicans or MAGA” – prompting a flurry of furious messages in her direction. This feud in Trump’s orbit played out just a day after Ms Loomer appeared at events with Trump commemorating the anniversary of 9/11 in New York and Pennsylvania. Asked about her attendance there by the Associated Press, she said she did not work for the campaign and was “invited as a guest”.","summary":"Getty Images Laura Loomer is a frequent fixture at events supporting the former US president The presence of hard-right conspiracy theorist Laura Loomer alongside Donald Trump on the campaign trail in recent days has raised questions, including from some Republicans, about the influence the controversial former congressional candidate may have on him. Ms Loomer is &#8230;\n\n\nThe post Laura Loomer: Who is conspiracy theorist travelling with Trump? appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/laura-loomer-who-is-conspiracy-theorist-travelling-with-trump/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/a24f/live/91a64800-7154-11ef-b282-4535eb84fe4b.jpg","video":null,"publish_date":"2024-09-13 00:17:18","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.257},{"id":256295076,"title":"Jacksonville Beach Police Department searching for individual involved in a shooting","text":"Home US News Local news World News Business Crime Entertainment Health Guest Post Support Our Cause Biden To Clear $39B In Student Loans After SCOTUS Rejection July 14, 2023 Fury in Italy as Anne Frank and 'Warsaw Ghetto boy' murals designed to denounce anti-Semitism are vandalised within 24 hours on streets of Milan November 19, 2023 Religious Identification Among Democrats Crashes 20 Points in 20 Years September 24, 2023 Thomas Tuchel provides Hakim Ziyech injury update after Chelsea’s Super Cup victory over Villarreal August 11, 2021 Protesters shout ‘Down with America’ and ‘Down with Israel’ April 8, 2024 Order Now - 50% Off + Free Shipping Home US News Local news World News Business Crime Entertainment Health Guest Post Support Our Cause Search for: Search HomeNewsJacksonville Beach Police Department searching for individual involved in a shooting Jacksonville Beach Police Department searching for individual involved in a shooting Up next “Helena Police Respond to Threats Made Against Helena Middle School” Published on 13 September 2024 Author Internewscast Share this @internewscast.com FacebookXRedditPinterest If you know the man pictured here, call 904-270-1661. JACKSONVILLE, Fla. — The Jacksonville Beach Police Department is looking for a man they say is a person of interest in as hooting in the Jacksonville Beach Central Business District on May 27. The man is pictured below. If you have any information, contact Detective B. Burrell at [email protected] or 904-270-1674. Share this @internewscast.com FacebookXRedditPinterest You May Also Like News Kate Winslet Feels a Sense of Pride in Her Body Following Comments from ‘Lee’ Crew Before taking on a big screen portrayal of the photographer, Kate Winslet… Internewscast September 13, 2024 News Kendrick Lamar Releases Unexpected Song on Instagram Kendrick Lamar dropped a bombshell on the internet today! Just days after… Internewscast September 12, 2024 News Premiere Date Announced for Mark Duplass’ ‘Creep Tapes’ Series on Shudder Shudder has set a fall premiere date for The Creep Tapes, the… Internewscast September 12, 2024 News Following the debate, Trump brings his economic message to Arizona () — After the initial presidential debate featuring Vice President Kamala Harris… Internewscast September 12, 2024 News Ellie Goulding showcases her cleavage in a plunging black corset dress as she attends the Harris Reed fashion show during London Fashion Week with the stylish Kate Beckinsale. She’s not afraid to be bold with her fashion choices. And Ellie Goulding… Internewscast September 12, 2024 News 16-year-old arrested by Baker County Sheriff’s Office for allegedly threatening a school shooting The sheriff’s office said Wednesday the 16-year-old sent a message through a… Internewscast September 12, 2024 News Child rape victim of Brittanee Drexel’s killer seeks lifelong imprisonment for his ex and expresses concern that both may have committed additional murders A woman who was raped by Brittanee Drexel’s killer when she was… Internewscast September 12, 2024 News Hearst Moniker Adopted by A+E Networks EMEA for Rebrand A+E Networks EMEA will be known as Hearst Networks EMEA going forwards.… Internewscast September 12, 2024 News At just 11, Prince George is already taking flying lessons and enjoyed his first hour-long flight last week while Kate and William watched from below. Prince George is ‘already learning to fly’ – having taken his first… Internewscast September 12, 2024 News Remains found in Food Lion store freezer identified by colleagues An employee was discovered dead in a freezer at the Food Lion… Internewscast September 12, 2024 News Donald Trump Refuses to Participate in Another Debate with Kamala Harris Donald Trump is rejecting the idea of another debate with Kamala Harris,… Internewscast September 12, 2024 News The Beatles performed in Jacksonville for the first and only time 60 years ago, with one important condition. It was The Beatles first and only concert in Florida. JACKSONVILLE, Fla.… Internewscast September 12, 2024 “Helena Police Respond to Threats Made Against Helena Middle School” September 13, 2024 Pasco Deputies Looking for 39-Year-Old Fallon Pino Who is Reported Missing in Holiday September 13, 2024 Possible Arsonist in California’s Line Fire Started 2 Additional Fires on the Same Day and Could be Connected to More Fires September 13, 2024 Jennifer Lopez in Negotiations to Purchase $55 Million Azria Estate in Los Angeles Amid Split from Ben Affleck September 13, 2024 “Aldermen urge Mayor Brandon Johnson to dismiss aide over alleged antisemitic remarks and criticism of law enforcement” September 13, 2024 Local news Pasco Deputies Looking for 39-Year-Old Fallon Pino Who is Reported Missing in Holiday PASCO COUNTY, Fla. – Pasco Sheriff’s deputies urgently need the public’s help… Internewscast September 13, 2024 Health Citizens’ Jury Supports Law Change on Assisted Dying as Dame Esther Offers Hope Dame Esther Rantzen who is backing the Daily Express campaign for an… Internewscast September 13, 2024 Entertainment Jennifer Lopez in Negotiations to Purchase $55 Million Azria Estate in Los Angeles Amid Split from Ben Affleck Reports say the luxurious $55 million Azria Estate, nestled in the heart… Internewscast September 13, 2024 US “Helena Police Respond to Threats Made Against Helena Middle School” HELENA, Ala. (WIAT) — The Helena Police Department is investigating two different… Internewscast September 13, 2024 Internewscast Journal Home DMCA Sitemap Advertise / Guest Post BBCGist Health Terms and Conditions Support Our Cause Copyright 2023. All Right Reserverd","summary":"Internewscast Journal\n\nInternewscast\n\n\nIf you know the man pictured here, call 904-270-1661. JACKSONVILLE, Fla. —&#8230;\n\n\nThis Post: Jacksonville Beach Police Department searching for individual involved in a shooting first appeared on Internewscast Journal","url":"https://internewscast.com/news/jacksonville-beach-police-department-searching-for-individual-involved-in-a-shooting/","image":"https://media.firstcoastnews.com/assets/WTLV/images/fd0590e4-9438-4627-b479-536c056edfd9/20240912T234928/fd0590e4-9438-4627-b479-536c056edfd9_16x9.jpg","video":null,"publish_date":"2024-09-13 00:15:20","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.288},{"id":256294784,"title":"Trump announces new plan to end overtime taxes","text":"“I’m also announcing that as part of our additional tax cuts, we will end all taxes on overtime,” he said in his appearance in the battleground state. “That gives people more of an incentive to work.” “The people who work overtime are among the hardest working citizens in our country, and for too long, no one in Washington has been looking out for them,” Trump continued. “It’s time for the working man and woman to finally catch a break, and that’s what we’re doing because this is a good one. And I think it’s going to be great for the country.” This latest proposal builds on his previous economic efforts to win the public over in his battle against Vice President Kamala Harris. He did not offer details on how he would garner congressional support for the legislation or how the plan would be implemented. Before Thursday, the former president had endorsed ending taxes on tips and on Social Security benefits, an effort that appeals both to restaurant workers in crucial swing states such as Nevada, a state that has a sizable restaurant worker population, and to senior citizens, who are far more likely to vote than younger voters. Trump has repeatedly blasted Harris for copying portions of his economic plan, particularly the banning of taxes on tips, which the vice president subsequently embraced. During the Tuesday debate between the two candidates, Harris slammed Trump over his handling of the economy while in office. Trump claimed that Harris and President Joe Biden’s leadership over the last three years has led to inflation and high grocery prices, hurting families. His endorsement of no taxation on overtime is likely a bid to appeal to voters unhappy with how expensive everyday items have become and with their shrinking pay stubs since he left office. “That’s why we will be saying that if you’re an overtime worker, when you’re past 40 hours a week —think of that — your overtime hours will be tax free,” Trump said to applause from the audience. “OK, good. You’re gonna have it.” The former president and Harris faced off on the debate stage Tuesday evening, and both candidates held their first public rallies following the debate. Harris appeared in Charlotte and Greensboro, North Carolina, on Thursday afternoon and evening. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINE The debate will likely be the only one where they meet onstage after Trump declared Thursday he would not participate in another matchup. “She was a no-show at the Fox debate, and refused to do NBC and CBS,” he wrote on Truth Social. “KAMALA SHOULD FOCUS ON WHAT SHE SHOULD HAVE DONE DURING THE LAST ALMOST FOUR YEAR PERIOD. THERE WILL BE NO THIRD DEBATE!”","summary":"Former President Donald Trump announced a new economic proposal banning any taxes on overtime pay for people who work more than 40 hours per week during a Tuscon, Arizona, rally Thursday evening. &#8220;I&#8217;m also announcing that as part of our additional tax cuts, we will end all taxes on overtime,&#8221; he said in his appearance [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3152067/trump-announces-new-plan-end-overtime-taxes/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Trump-in-Arizona.webp","video":null,"publish_date":"2024-09-13 00:11:33","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","source_country":"US","sentiment":-0.141},{"id":256295716,"title":"US elections 2024: Kamala Harris widens lead over Donald Trump after presidential debate showdown, polls show","text":"Vice President Kamala Harris has surged ahead of former President Donald Trump following their fiery debate in Philadelphia, according to a new Reuters/Ipsos poll. The poll, conducted over two days after the showdown, shows Harris leading Trump 47% to 42%—a five-point margin that has expanded since late August.The debate, marked by sharp exchanges and personal attacks, saw Harris relentlessly press Trump on his fitness for office and ongoing legal troubles. Polling suggests voters saw her as the clear winner, with 53% believing Harris outperformed Trump, compared to just 24% who backed Trump’s performance. A CNN flash poll painted an even starker picture, with 60% of viewers saying Harris dominated the stage.Pundits were quick to declare Harris the victor, noting how she repeatedly backed Trump into a corner. According to Reuters, Harris \"put Trump on the defensive with a barrage of attacks on his record and legal woes,\" a view echoed by 52% of poll respondents who felt Trump struggled to keep up.For Harris, the poll is a welcome rebound after a recent New York Times/Siena College survey—widely regarded as highly accurate—showed her trailing Trump by a single point. That poll had put Trump at 48% to Harris' 47%, a razor-thin margin that had fueled anxiety within Democratic circles.Despite the positive numbers, the race remains tight, with battleground states like Pennsylvania, Georgia, and Wisconsin holding the keys to the White House. National polls, while promising, offer only a snapshot of the larger fight for electoral votes.In a bid to capitalize on her debate momentum, Harris' campaign swiftly challenged Trump to a second face-off, with Fox News offering to host the rematch. “Vice President Harris is ready for round two. Is Donald Trump?” her team asked in a pointed post-debate statement.Trump, meanwhile, has wavered on whether he’s game for another debate, calling the push for a second round a sign of desperation from the Harris camp. However, he’s left the door open depending on the host network.As the dust settles, the next major clash will be between the vice presidential nominees—Ohio Senator JD Vance and Minnesota Governor Tim Walz—who are scheduled to debate on October 1, setting the stage for yet another high-stakes political face-off.","summary":"Vice President Kamala Harris has surged ahead of former President Donald Trump after their Philadelphia debate, leading 47% to 42% in a Reuters/Ipsos poll. The debate was marked by sharp exchanges, with Harris pressing Trump on his fitness for office and legal issues. A CNN flash poll showed 60% of viewers believed Harris dominated the stage.","url":"https://timesofindia.indiatimes.com/world/us/us-elections-2024-kamala-harris-widens-lead-over-donald-trump-after-presidential-debate-showdown-polls-show/articleshow/113306231.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-113306301/113306301.jpg","video":null,"publish_date":"2024-09-13 00:05:53","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","catgory":"politics","source_country":"in","sentiment":-0.005},{"id":256295068,"title":"Trump acknowledges feeling angry during the debate and elaborates on his reasons, including his dissatisfaction with the ABC moderators and his frustration over migrants leaving with geese.","text":"If Donald Trump came across as angry in Tuesday night’s debate he was making no apologies for it two days later, saying he was furious about what Kamala Harris was doing to the country. ‘People said that I was angry at the debate, angry,’ he told a raucous crowd in Tucson, Arizona. ‘I was angry, and yes, I am angry because she allowed 21 million illegal aliens invading our communities. Many of them are criminals.’ The event was billed as a chance to address the spiralling cost of living crisis. And Trump unveiled a populist new policy, promising to end tax on overtime. But much of his speech was taken up with Tuesday’s debate. Trump railed against the moderators and said he had no need for another meeting with Harris after his ‘monumental victory.’ Harris was declared the winner of the debate in a DailyMail.com snap poll of viewers. They also said she was the winner of the vibe war, saying the vice president made them feel ‘hopeful’ while Trump made them feel ‘annoyed.’ Trump was clearly rattled by her attacks, baited into repeating a rightwing online rumor that illegal immigrants had been stealing and eating pets. On Thursday, he was back on the campaign trail trying to get his election run back on track in a crucial battleground state. He did that in typical Trump style, by making no apologies for appearing angry and by repeating the claim about migrants and cats and dogs. He said 911 calls in Springfield, Ohio, revealed migrants walking off with geese. ‘The migrants are walking off with the town’s geese. They’ve taken the geese,’ he said. ‘You know where the geese are in the park, in the lake, and even walking off with their pets ‘My dog’s been taken.’ He appeared at the city’s Linda Ronstadt Music Hall, much to the horror of its namesake, who earlier condemned his appearance. It usually hosts Tucson’s symphony orchestra. ZZ Top are coming in October. But on Thursday it was the stage for Trump’s trademark freewheeling delivery, packed with fury. ‘I’m angry about young American girls being raped and sodomized and murdered by Savage criminal aliens,’ he said. ‘I’m angry about rampant inflation destroying our middle class, and the American people are also very angry about that and every other thing that we’ve had to endure for three and a half years.’ Behind him a diverse mix of supporters, some in cowboy hats … some in suits, held up signs. ‘Latino Americans for Trump,’ said one And he couldn’t help but hark back to the debate, slamming Harris as well as the two ABC moderators. ‘Kamala Harris showed up spewing empty rhetoric. The same old lies, platitudes, offering no plans, no policies and no details whatsoever, nothing,’ he said. ‘The two anchors, David Muir and Linsey Davis, sat there and only corrected me on things where I was right but didn’t correct Kamala on Project 25 that I knew nothing about, on the bloodbath hoax that has been totally debunked, which had to do with the automobile industry that is going to be dying Both candidates headed to battleground states as they looked to kick on from Tuesday’s debate. Harris was in North Carolina, with rallies in Charlotte and Greensboro, for a chance to further buoy her supporters after a strong performance when she knocked Trump off his stride and put him on the defensive in their first head-to head-meeting. Her team has been poring over the 90-minute debate for clips to turn into TV ads. Meanwhile, Trump was looking to stabilize his campaign, which has been in flux ever since Harris unexpectedly entered the race in July. He has bulked up his senior staff, who believe he can capitalize what they see as Harris’s inability to flesh out her policy agenda and her vague answers on Tuesday. That hunch is borne out by a poll of debate viewers (all independent viewers) conducted by J.L. Partners for DailyMail.com Some 50 percent said they still needed to know more about Harris’ plans for office, compared with 37 percent for Trump. Arizona is central to Trump’s chances of success. Joe Biden win it by fewer than 11,000 votes, a narrow margin that triggered rounds of legal action and claims of fraud by Trump allies. Trump had won it four years earlier by 3.5 percent. The latest data from the J.L. Partners/DailyMail.com election model, which crunches decades of data along with the latest polls and forecasts, suggests it currently ‘leans Trump.’ His visit attracted criticism from the off. Mexican American singer Linda Ronstadt condemned him for his ‘hatred’ before his appearance in her namesake music hall. ‘It saddens me to see the former president bring his hate show to Tucson, a town with deep Mexican-American roots and a joyful, tolerant spirit. I don’t just deplore his toxic politics, his hatred of women, immigrants and people of color, his criminality, dishonesty and ignorance – although there’s that,’ Ronstadt wrote in a Facebook in which she also called him a rapist.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIf Donald Trump came across as angry in Tuesday night&#8217;s debate he&#8230;\n\n\nThis Post: Trump acknowledges feeling angry during the debate and elaborates on his reasons, including his dissatisfaction with the ABC moderators and his frustration over migrants leaving with geese. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-acknowledges-feeling-angry-during-the-debate-and-elaborates-on-his-reasons-including-his-dissatisfaction-with-the-abc-moderators-and-his-frustration-over-migrants-leaving-with-geese/","image":"https://i.dailymail.co.uk/1s/2024/09/12/23/89616879-13843489-After_marking_the_anniversary_of_9_11_on_Wednesday_Donald_Trump_-a-1_1726181476317.jpg","video":null,"publish_date":"2024-09-12 23:59:28","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.218},{"id":256294212,"title":"Even Democrats want Harris-Biden to end their cowardice and remove Ukraine’s handcuffs","text":"Despite Moscow’s escalations and now even demands from fellow Democrats, Team Harris-Biden continues to twiddle its thumb on lifting restrictions on Kyiv’s use of US weapons against Russia. Do they want Ukraine to lose? On Wednesday, Democratic Senate Foreign Relations Committee Chairman Ben Cardin declared the “time has come” for easing Harris-Biden restrictions on Kyiv’s use of US weapons, given “Vladimir Putin’s relentless attacks on Ukrainian civilians.” Actually, it’s long past time: If Harris-Biden had sent Ukraine sufficient stocks of restriction-free weaponry before Putin invaded, he might’ve been deterred from invading in the first place. After he attacked and Ukraine rebuffed his forces, a generous supply of long-range weapons, aircraft and other materiel, sans restrictions, might have turned the tide, or at least made Putin seek an out. Instead, the Harris-Biden team has only gradually ratcheted up the weapons it sends, and it still forbids their use in Russia, except in a few, small border areas. Long-range missiles, like US ATACMS, could let Ukraine hit Putin’s assets deep inside Russian territory. Meanwhile, Iran supplies Moscow with massive drone stocks and now even ballistic missiles — with no restrictions. No wonder even Democrats finally want the White House to get real: Besides Cardin, Sen. Jeanne Shaheen (NH) also demanded restrictions be lifted. A bipartisan House group issued similar calls: “Unless these restrictions are lifted, Ukraine will continue to struggle to achieve victory” and Ukrainians will “suffer unnecessary death, loss and hardship,” they said. Yet asked Tuesday if he’d heed such calls, President Biden said only, “We’re working on it.” Secretary of State Antony Blinken added: “We have adjusted” as needs have changed, “and I have no doubt that we’ll continue to do that.” What is the White House waiting for? Harris-Biden’s slow-walking incrementalism has only dragged out the war, and time is not on Ukraine’s side. During Tuesday’s debate, notably, Kamala Harris wouldn’t even say she backs a Ukraine victory. When asked, she merely bashed Donald Trump and bragged about her diplomatic efforts in Europe before the war. Yet as Trump noted, three days after her “diplomacy,” Russia invaded. Regardless of November’s results, Ukraine would be in a far stronger negotiating position based on gains it could make if restrictions on long-range weapons are rolled back. Harris and Biden need to shed their cowardly fear of responding to Russian escalation and heed the calls to provide serious help to Ukraine.","summary":"Despite Moscow’s escalations and now even demands from fellow Democrats, Kamala Harris and Joe Biden continue to twiddle their thumbs on lifting restrictions on Ukraine's use of US weapons against Russia.","url":"https://nypost.com/2024/09/12/opinion/even-democrats-want-harris-biden-to-remove-ukraines-handcuffs/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/newspress-collage-lo9l9vq2r-1726183501895.jpg?quality=75&strip=all&1726169219&w=1200","video":"https://cdn.jwplayer.com/videos/SXn6XgiE-RyIcpnTz.mp4","publish_date":"2024-09-12 23:52:14","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.387},{"id":256294214,"title":"DEI is down but not out as activists pour $15M into Harris’ election","text":"Are the corrosive diversity, equity and inclusion policies that have been pushed on us all finally in retreat, with chastened companies publicly dropping unpopular DEI policies? Not if the well-funded Human Rights Campaign — and its preferred presidential candidate Kamala Harris — has anything to say about it. The name sounds innocuous. After all, who could oppose a campaign for human rights? The reality is a far-left special-interest group that’s driving the most radical of ideas into our culture — one that’s gotten its hooks into what once were considered “mainstream” organizations like the American Association of School Librarians. And it’s well in the ear of the Democratic nominee. Harris is trying to transform herself from a leftist who has supported fringe policies like bailing out rioters in 2020, ending private health insurance and promising sex-change operations for migrant inmates, to a lovable moderate — just in time for Election Day. Now she’s a gun owner who is serious about protecting the border. Fracking? She loves fracking! Yet HRC has endorsed Harris for president, and promises on its website: “We are 75 million Equality Voters strong. This November WE SHOW UP.” In May, the group announced $15 million in swing-state spending on behalf of President Biden’s campaign, money that presumably will be spent on Harris now. HRC President Kelley Robinson acted as a media surrogate for Harris during the Democratic National Convention, and Harris’ running mate, Minnesota Gov. Tim Walz, delivered an address to the group just last week. After a series of recent high-profile defeats, HRC by all rights should be running for cover. The Post has detailed how activist Robby Starbuck has gotten several major companies to reverse absurd DEI procedures that were pushed on them by the HRC: preferential hiring practices for minority applicants, multimillion-dollar donations to allied woke organizations, transgender-cheering workplace policies and much more. How did HRC bend companies to its will? Through its Corporate Equality Index, a report card on how well or poorly corporations abide by HRC’s diversity criteria. The scores are then used by big investment firms like BlackRock to decide where they should direct their considerable cash. “Without a sense of purpose,” BlackRock CEO Larry Fink wrote in 2018, any company “will ultimately lose the license to operate from key stakeholders.” In other words, do what HRC wants, or else. In recent weeks, after conservative consumers’ pushback, Lowes, Jack Daniels, Harley Davidson, Ford and others have announced rollbacks of their DEI policies. “You have to be in alignment with your customers — [otherwise,] if someone else is, they’re going to eat your lunch,” Starbuck said. “Customers don’t ignore it when you’re violating their values every day.” But unaccountable organizations like the American Association of School Librarians don’t have shareholders to answer to, and can push any agenda they want. The librarians join with HRC for a “National Day of Reading” each year to promote “stories supporting transgender or non-binary youth.” Promoted books include “When Aidan Became a Brother,” about a girl who decides to become a boy — marketed for kids as young as 4. HRC follows its in-school brainwashing by pressuring hospitals to offer the most extreme procedures to kids who declare themselves transgender. The group’s Healthcare Equality Index, which rates hospitals in much the same way as the CEI grades companies, is partly funded by Pfizer and by the Pharmaceutical Research and Manufacturers of America— which both profit from transgender hormone medications. Hospitals don’t want to get abuse from rabid activists, so they do what they must to stay on the index’s good side. And even though some companies are beating a well-publicized retreat from DEI, the HRC website still touts dozens more that “partner” with them: Amazon, Google, Disney and many others continue to fund and boost this extremist group. It’s easy to get distracted. News cycles move quickly, and the idea that we may be leaving the last few years of woke insanity behind is a welcome one. Don’t be fooled: This overtly political special-interest group that has managed to insert itself into so many segments of our culture isn’t going anywhere — not as long as Harris and her allies remain in its corner. Kamala Harris spends a lot of time attacking Donald Trump over Project 2025, despite his repeated disavowals. But the fanatical policies pushed by the HRC appear to be more than welcome at Kamala’s table. Karol Markowicz is the author of the book “Stolen Youth.”","summary":"Don’t be fooled: the overtly political Human Rights Campaign, which has managed to ingratiate itself into so many segments of our culture, isn’t going anywhere — not as long as Harris and her allies remain in its corner.","url":"https://nypost.com/2024/09/12/opinion/dei-is-down-but-not-out-as-activists-pour-15m-into-harris-election/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/newspress-collage-8q4btulcy-1726182978291.jpg?quality=75&strip=all&1726170748&w=1200","video":null,"publish_date":"2024-09-12 23:52:12","author":"Karol Markowicz","authors":["Karol Markowicz"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.219},{"id":256294220,"title":"Kamala Harris Has Broken Trump As Devastated Ex-President Breaks Down In Arizona","text":"Kamala Harris has broken Trump as the ex-president’s first campaign stop was a mentally broken long ramble of half-thoughts that jumped around topics and bordered on nonsense. Video: The debate loss to Kamala Harris has apparently deeply psychologically damaged Trump. This is a 12 minute ramble today in Arizona where he starts talking about a 3rd debate mentally wanders off for 6+ minutes then says no third debate. This is what is left of the GOP nominee. pic.twitter.com/vqqRZcbayk â Sarah Reese Jones (@PoliticusSarah) September 12, 2024 Trump said in part: And that’s what she said. I want to rematch. Polls slowly show that I won the debate against Comrade Kamala Harris. And as you probably know, because you know, when you say Harris, does anybody know who Harris is now? Kamala is a very different kind of a word, nice name, very nice name. But you know its Kamal. You know, Norris Harris, when you say Harris, everyone says who the hell is that right? But she immediately called for a second debate which means that she was like a prize fighter that lost a fight. We had two debates though I had a debate with crooked Joe Biden, right? And I had another debate with her. She and crooked Joe have destroyed our country with millions of criminals and mentally deranged people pouring into the USA totally unchecked, unvettedand with inflation bankrupting our middle class, it has gotten bad. Everyone knows this and all of the other problems caused by Kamala and Joe, it was discussed in great detail during the first debate with Joe and the second debate with Comrade Harris. She was a no show at the Fox debate. You know, Fox invited her. She was a no show. I sat with the Great Sean Hannity. Does anybody know Sean? Good man. He’s a good man. And I said, where is she? She didn’t show. So we did a town hall and he got great ratings on that town hall. I’ll tell you right now. Got really great led all of television for the week. It’s not bad. Right. Simple town hall turned out to be, uh, it turned out to be a town hall from what it was supposed to be, but she didn’t show up and refused also to do NBC and CBS. She went over to ABC, which in my opinion, has taken a big hit becausethese two people were bad news. They kept screaming at me. I said, why are you screaming? I’m saying to myself, I’m looking at him. I always liked him. I’m not gonna watch him anymore. I’m not gonna watch him because he’s not legit what he did. I’m not gonna watch him and his hair’s not as good as it used to be. You know, Kamala should focus on what she should have done during the last almost four year period. She kept complaining. Well, you know, when I’m in, I’m gonna do this and I’m gonna do that. And at the end of the debate, I said, why don’t you just do it? You could leave right now. Why don’t you do it? I’m gonna do this and then I’m gonna do that and then I’m gonna do this and that, and that remember at the convention when she went out and they nominated her, even though she got no votes they nominated, no, she came in last place inthe primaries, right? And then she got, and then she said Donald Trump is a threat to democracy. No, she’s a threat to about, she is a threat to democracy. But do you remember when she went out? And she said, thank you. Do you remember that? It was the weirdest thing. Am I wrong? Because they were saying JD? And I are weird. No, we’re very solid people. She’s weird. And that vice president of hers is really weird. He’s really, that was a sound bite. You know, they said uh oh, he’s weird. That was, in other words, they gave it to their friends in the fake news. Weird. It’s something I’ve never called. I’ve been called a lot of bad things but not weird. But, you know, she went out and the people were applauding herself and she goes, thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. I think she went nuts. There was something wrong with her. Trump Is Mentally Broken Mary Trump told Lawrence O’Donnell that what happened would permanently damage Trump, and you can see from the transcript above that it has. Trump is completely broken. He is not just complaining about the debate. The ex-president has retreated to a fantasy world where he won the debate, and Kamala Harris is the weird and crazy one. Vice President Harris didn’t just win a debate. She may have ended his political career. The Republicans now have a nominee who is so broken by getting dominated in the debate that he can’t function. Trump can say he won the debate, but his behavior tells the story of a candidate who knows he lost and is destroyed. To comment on this story, join us on Reddit.","summary":"Kamala Harris has broken Trump as the ex-president’s first campaign stop was a mentally broken long ramble of half-thoughts that jumped around topics and bordered on nonsense. Video: The debate loss to Kamala Harris has apparently deeply psychologically damaged Trump. This is a 12 minute ramble today in Arizona where he starts talking about a &#8230;\n\n\nThe post Kamala Harris Has Broken Trump As Devastated Ex-President Breaks Down In Arizona appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/kamala-harris-has-broken-trump-as-devastated-ex-president-breaks-down-in-arizona/","image":"https://www.politicususa.com/wp-content/uploads/2024/09/Trump-Arizona-rally-post-debate-scaled.jpg","video":null,"publish_date":"2024-09-12 23:49:49","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","source_country":"us","sentiment":-0.165},{"id":256293742,"title":"US Presidential Polls: Trump refuses another presidential debate with Harris","text":"The possibility of a second meeting between the two US Presidential candidates before election day was dashed on Thursday when former President Donald Trump announced he would not take part in another debate with Vice President Kamala Harris.He asserted that he won Tuesday’s debate with Harris despite some polls showing otherwise.“When a prizefighter loses a fight, the first words out of his mouth are, ‘I WANT A REMATCH’. Polls clearly show that I won the debate against Comrade Kamala Harris, the Democrats’ Radical Left Candidate, on Tuesday night, and she immediately called for a Second Debate,” Trump posted on Truth Social.The former president claimed that subjects like immigration and inflation were covered “in great detail” both in Tuesday night’s discussion with Harris and in his June debate with President Biden.Trump, in a strong attack on the Biden-Harris administration, said that they have ‘destroyed’ the country.“She and Crooked Joe have destroyed our country, with millions of criminals and mentally deranged people pouring into the USA, totally unchecked and unvetted, and with inflation bankrupting our middle class. Everyone knows this, and all of the other problems caused by Kamala and Joe. It was discussed in great detail during the first debate with Joe, and the second debate with Comrade Harris,” the former US President said. “She was a no-show at the Fox debate and refused to do NBC & CBS,” Trump said in his post, adding “KAMALA SHOULD FOCUS ON WHAT SHE SHOULD HAVE DONE DURING THE LAST ALMOST FOUR YEAR PERIOD. THERE WILL BE NO THIRD DEBATE!”Both Donald Trump and Kamala Harris are the official presidential candidates of their respective parties, after they accepted the nomination at the conventions earlier this year.The US presidential elections are scheduled to be held on November 5 this year. Notably, the first presidential debate was held in June between President Biden and Trump, where the former’s performance expressed concerns over his age. Following this, Biden made an exit from the race and endorsed Harris.It is pertinent to note that Trump and Harris debated on Tuesday this week. It was their first meeting since Harris became the Democratic presidential nominee in late July, The Hill reported.The ultimate face off between Trump and Harris took place during the presidential debate conducted by ABC News on Tuesday (local time).","summary":"The News Mill","url":"https://thenewsmill.com/2024/09/us-presidential-polls-trump-refuses-another-presidential-debate-with-harris/","image":"https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg","video":null,"publish_date":"2024-09-12 23:31:08","author":"ANI","authors":["ANI"],"language":"en","catgory":"politics","source_country":"in","sentiment":-0.124},{"id":256294098,"title":"Letters to the Editor, Sept. 13, 2024","text":"Article content NOT TRUMP’S TIME This is my takeaway from watching the Kamala Harris and Donald Trump debate. In a word: Astounded. Given Trump’s deeply flawed character, it is incomprehensible how such a man could have become the president of the United States in the first place. I am baffled by questions such as the following and have written head-scratching possible answers. Who supports Donald Trump? Wealthy individuals and influential corporations. Also gullible folks who blindly believe internet misinformation and are unwilling to fact check. What do the wealthy see in Trump? An opportunity to have restrictive government regulations and tax laws changed. What do frustrated and angry people see in Trump? A far-fetched belief he will relieve their anxiety which has been brought on by the rapidly changing world. This race for the American presidency is a contest between good and evil, altruism and selfishness, truth and lies, duty and egotism, hopefulness and negativity, decency and indecency, cheerfulness and bitterness, realistic gun rules and token ones, progressiveness and small-mindedness, women’s rights and ‘holier-than-thou’ suppression, democracy and tyranny. Go Kamala, go! Lloyd Atkins Vernon, B.C. (With all the negatives you’ve listed about Trump, he is still going to receive a massive amount of support as many Americans are willing to accept his flaws because they felt more secure and had more money in their pockets when he was president) WASTE OF MONEY Let’s fly 154 MPs and all the staff needed to B.C. Money is no object. Hotel rooms, meals, anything. Who cares, it’s not their money. Will the Liberal MPs really tell Trudeau what’s on their mind? Absolutely not. Why? They are paid between $200,000 and $300,000 per year. Good pay for a bunch of dust collectors and they do not want to lose their job as almost none of them could get a job paying more than minimum wage. So the whole exercise is a total waste of time and a huge waste of money. Par for the course for Trudeau. And now the selfish Bloc will prop them up in exchange for a lot of goodies for Quebec. Nothing changes if nothing changes. Norman Shifman Toronto (An election cannot come soon enough to send the Trudeau Liberals to the dustbin of history) Share this Story : Letters to the Editor, Sept. 13, 2024 Copy Link Email X Reddit Pinterest LinkedIn Tumblr","summary":"NOT TRUMP&#8217;S TIME This is my takeaway from watching the Kamala Harris and Donald Trump debate. In a word: Astounded. Given Trump&#8217;s deeply flawed character, it is incomprehensible how such a man could have become the president of the United States in the first place. I am baffled by questions such as the following and [&#8230;]","url":"https://torontosun.com/opinion/letters/letters-to-the-editor-sept-13-2024","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/01/Friday-letters.jpg","video":null,"publish_date":"2024-09-12 23:30:39","author":"Postmedia News","authors":["Postmedia News"],"language":"en","source_country":"CA","sentiment":-0.638},{"id":256293788,"title":"Appeals Courts Reject 2 Trump Challenges in NY Case","text":"Former President Donald Trump encountered roadblocks on Sept. 12 in his attempts to challenge rulings related to his criminal case in New York. Hours later, the U.S. Court of Appeals for the Second Circuit denied Trump’s request for emergency relief in his attempt to relocate the case to federal court. Federal district Judge Alvin Hellerstein had denied that request and Trump followed by asking the Second Circuit to halt Hellerstein’s denial. Trump has argued that the Supreme Court’s decision in Trump v. United States, which held that presidents enjoy certain levels of immunity from criminal prosecution, and Merchan’s conduct raised federal questions that should be addressed in federal court. He has also derided Merchan’s gag order as an unconstitutional infringement on his right to free speech. Steven Cheung, a spokesperson for Trump’s campaign, said the former president will “continue to fight against the unconstitutional Witch Hunts and Gag Orders.” The orders were issued two days after Trump’s debate with Vice President Kamala Harris, during which he alleged that the justice system had been weaponized against him. Special counsel Jack Smith has appealed against that decision to the U.S. Court of Appeals for the 11th Circuit, raising the possibility that the case could restart. Also on Sept. 12, Attorney General Merrick Garland appeared to rebuff Trump in a speech defending his employees and describing the DOJ as impartial. The Second Circuit has yet to rule on Trump’s request to move Merchan’s case to federal court. He said he wouldn’t rule on Trump’s presidential immunity claims until after the election. In a letter on Sept. 9, Trump’s attorneys urged the Second Circuit to delay proceedings. “For example, President Trump’s ability to seek appellate review of the district court’s ruling would be irreparably harmed, in the absence of a stay, because Justice Merchant could move forward with sentencing and a ‘judgment of conviction’ ... before this appeal is resolved.” A judgment of conviction refers to the court formally declaring Trump guilty. In May, a jury found him guilty of 34 felony counts of falsifying documents. Georgia prosecutor Fani Willis’s case against Trump faced additional setbacks on Sept. 12 as Fulton County Superior Court Judge Scott McAfee dismissed several charges in the indictment brought by Willis. That case, which focuses on Trump’s reactions to the 2020 presidential election, is set to go before the state’s court of appeals in December with consideration of whether Willis should be disqualified from the prosecution. A similar, federal-level case is trudging along in Washington, where D.C. Judge Tanya Chutkan laid out a new schedule for continuing the pre-trial process, which was delayed for months as the Supreme Court weighed Trump’s immunity appeal.","summary":"The former president lost his appeal over Justice Juan Merchan's gag order, as well as an emergency request to stay a federal court's decision.","url":"https://www.theepochtimes.com/us/appeals-courts-reject-2-trump-challenges-in-ny-case-5722989","image":"https://img.theepochtimes.com/assets/uploads/2024/09/11/id5722267-GettyImages-2171266186-OP-300x180.jpg","video":null,"publish_date":"2024-09-12 23:30:22","author":"Sam Dorman","authors":["Sam Dorman"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.24},{"id":256294280,"title":"Trump Rules Out New Harris Debate As Swing State Fight Resumes","text":"Donald Trump said Thursday he would not take part in another debate with Kamala Harris, as the White House rivals headed back to battleground states that are set to decide a nail-bitingly close US presidential election.The Republican former president lashed out two days after his first televised clash with the Democratic vice president, when Harris put Trump on the defensive and got under his skin with a series of barbs.\"THERE WILL BE NO THIRD DEBATE!\" the 78-year-old wrote on his Truth Social platform, including in his tally the earlier debate with Joe Biden in June that drove the incumbent out of the race, and his Tuesday showdown with Harris.Trump claimed that \"polls clearly show that I won the Debate against Comrade Kamala Harris\" -- despite several snap surveys that showed Harris came out well on top in the clash viewed by more than 67 million Americans.At a rally in key swing state North Carolina, Harris insisted they should debate again before the November 5 election. It was not clear if she was aware of Trump's statement.\"Two nights ago Donald Trump and I had our first debate and I believe we owe it to the voters to have another,\" Harris said to cheers from supporters in the city of Charlotte.\"Because this election and what is at stake could not be more important,\" added the Democrat, who later addressed a second rally in nearby Greensboro.The 59-year-old referenced several Trump statements on issues including abortion and his widely mocked assertion that he had \"concepts of a plan\" to reform the US health care system.The Harris campaign said earlier that she was entering a \"more aggressive\" phase of her White House bid and was \"seeking to capitalize on her decisive debate victory and build on momentum.\"Trump took the stage Thursday in Tucson, Arizona, doubling-down on criticism of the ABC journalists who hosted his debate with Harris.He called the vice president a \"lunatic\" and referred to the two journalists, David Muir and Linsey Davis, as being biased in her favor.\"The worst two anchors anybody's ever seen,\" he said, later accusing Davis of looking at him \"with hatred in her eyes.\"Trump was due to speak mainly about the country's \"struggling economy,\" his campaign said, but in a more than hour-long speech he frequently made digressions to insult Harris and repeat ugly and unfounded allegations and conspiracy theories about migrants. Trump and Harris remain neck and neck in the polls with just 54 days until the election, with the result expected to hinge on a few thousand voters in half a dozen swing states including North Carolina and Arizona.Harris has erased Trump's lead since Biden ended his reelection bid on July 21 but insists she is the underdog in perhaps the shortest and most dramatic campaign in US political history.The election is also further stoking political tensions in an already deeply polarized nation.The White House on Thursday condemned a false story about migrants eating pet cats and dogs in Ohio -- which Trump pushed during the debate -- as \"filth\" and said it put \"lives in danger.\"On Thursday, Trump repeated those false allegations against Haitian migrants in his Tucson speech.The US government has declared the formal electoral count on January 6, 2025 a \"special security event\" -- amid apparent fears of a repeat of the storming of the US Capitol in 2021 by Trump supporters who refused to accept his defeat by Biden.The announcement came as Republican Alberto Gonzales, who was attorney general under president George W. Bush, said he backed Harris because of Trump's behavior on that day made him a threat to the rule of law.Trump and Harris though have their eyes firmly fixed on the battlegrounds.Harris returns to pivotal Pennsylvania on Friday for campaign events in Johnstown and Wilkes-Barre before attending an awards dinner Saturday with Second Gentleman Doug Emhoff.Trump will deliver remarks in Las Vegas on Friday on the cost of living, as he targets Nevada, yet another swing state.Harris's running mate Tim Walz barnstorms Michigan and Wisconsin from Thursday to Saturday as part of the campaign's New Way Forward swing state tour.","summary":"Donald Trump said Thursday he would not take part in another debate with Kamala Harris, as the White House rivals headed back to battleground states that are set to decide a nail-bitingly close US presidential election.","url":"https://www.ibtimes.com.au/trump-rules-out-new-harris-debate-swing-state-fight-resumes-1851501","image":"https://d.ibtimes.com.au/en/full/1859598/trump-harris-debate-was-watched-67-million-viewers-united-states.jpg","video":null,"publish_date":"2024-09-12 23:30:17","author":"Jim Watson, With Danny Kemp In Washington","authors":["Jim Watson, With Danny Kemp In Washington"],"language":"en","source_country":"au","sentiment":-0.261},{"id":256293632,"title":"ABC Denies Kamala Harris Was Given Questions Before Trump Debate","text":"ABC has denied Vice President Kamala Harris was given any questions ahead of Tuesday’s debate, shooting down one of the talking points that right-wingers—including former President Donald Trump—tried to use to explain the former president’s much-criticized debate performance. “Absolutely not,” an ABC News spokesperson told The Daily Beast. “Harris was not given any questions before the debate.” The network’s debate rules stated that “no topics or questions will be shared in advance with campaigns or candidates.”","summary":"Win McNamee/Getty ImagesABC has denied Vice President Kamala Harris was given any questions ahead of Tuesday’s debate, shooting down one of the talking points that right-wingers—including former President Donald Trump—tried to use to explain the former president’s much-criticized debate...","url":"https://nation.lk/online/abc-denies-kamala-harris-was-given-questions-before-trump-debate-276865.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-09-12 23:30:07","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.134},{"id":256294126,"title":"Lindsey Graham Warns Trump to Stop Palling Around With ‘Toxic’ Laura Loomer","text":"Sen. Lindsey Graham on Thursday became the latest Republican to denounce Laura Loomer, the far-right influencer seen traveling with former President Donald Trump in recent weeks. Graham, the longtime South Carolina Republican, has both clashed with and aligned himself with the former president in the past. On Thursday, he urged the president to abandon Loomer, who he called “toxic.” Loomer has existed on the periphery of the MAGA extended universe for years, but has recently been spotted more frequently with the former president. On Tuesday, she was seen leaving Trump’s private jet when it landed for the debate in Philadelphia. The far-right internet personality, who previously called 9/11 an “inside job,” also accompanied the president to memorials in Manhattan and Pennsylvania on the anniversary of the attacks on Wednesday. Graham, for his part, bristled at the inclusion of Loomer in Trump’s entourage during the important slate of events that were all meant to burnish his support among undecided voters. “I mean, she actually called for Kellyanne Conway’s daughter to hang herself,” Graham told the Huffington Post. “I don’t know how this all happened, but, no, I don’t think it’s helpful. I don’t think it’s helpful at all.” He repeated the criticism in a separate interview with the The Washington Post, calling Loomer’s past statements “beyond disturbing” while adding: “I hope this problem gets resolved. I think we should be talking about things that people are concerned about, and this issue, I think, doesn’t help the cause.” The most recent rift between Loomer and more mainstream Republican figures began when Georgia Rep. Marjorie Taylor Greene, a Trump stalwart originally elected in 2020, called out a days-old post from Loomer, where she criticized Democratic nominee Vice President Kamala Harris with ethnic stereotypes. Greene, who in the past has been criticized for racist and xenophobic statements, called Loomer’s remarks “appalling and extremely racist.” Responding to Graham with a post on X, formerly Twitter, Loomer claimed the senator was “never been loyal to President Trump.” “He got booed in his own state at a TRUMP RALLY and was booed off stage because he is DISLOYAL to Trump and the American people,” Loomer wrote, referring to the poor reception the senator got at a 2023 rally.","summary":"DAVID DEE DELGADOSen. Lindsey Graham on Thursday became the latest Republican to denounce Laura Loomer, the far-right influencer seen traveling with former President Donald Trump in recent weeks.\n\nGraham, the longtime South Carolina Republican, has both clashed with and aligned himself with the former president in the past. On Thursday, he urged the president to abandon Loomer, who he called “toxic.”\n\nLoomer has existed on the periphery of the MAGA extended universe for years, but has recently been spotted more frequently with the former president. On Tuesday, she was seen leaving Trump’s private jet when it landed for the debate in Philadelphia.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/lindsey-graham-warns-trump-to-stop-palling-around-with-toxic-laura-loomer","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2631,w_4678,x_243,y_346/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1726181311/laura_loomer_1_ug0nm8","video":null,"publish_date":"2024-09-12 23:25:51","author":"Zachary Folk","authors":["Zachary Folk"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.013},{"id":256293722,"title":"Will there be another Harris-Trump debate?","text":"Will there be another Harris-Trump debate? Former President Donald Trump and Vice President Kamala Harris traveled to battleground states Thursday for the first time since their debate earlier this week. Before speaking at a rally, Trump took to social media to announce he would not debate Harris again, although the former president has changed his mind about debating in the past. CBS News political correspondent Caitlin Huey-Burns has more.","summary":"Former President Donald Trump and Vice President Kamala Harris traveled to battleground states Thursday for the first time since their debate earlier this week. Before speaking at a rally, Trump took to social media to announce he would not debate Harris again, although the former president has changed his mind about debating in the past. CBS News political correspondent Caitlin Huey-Burns has more.","url":"https://www.cbsnews.com/video/will-there-be-another-harris-trump-debate/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/12/7fe2b128-3205-4675-bb43-0810e70ea11c/thumbnail/1200x630/22986153b3f1399a062844cdfc4323f4/cbsn-fusion-will-there-be-another-harris-trump-debate-thumbnail.jpg?v=d2d77bee90bcafa285fd6d60bd8b3612","video":null,"publish_date":"2024-09-12 23:25:05","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.181},{"id":256293376,"title":"Donald Trump Announces New Tax Plan","text":"Former President Donald Trump has announced a new plan to cut taxes if elected in November's election.Trump said during a rally in Tucson, Arizona, on Thursday that he would \"end all taxes on overtime\" if he returns to the White House.The former president previously backed a plan to eliminate taxes on tips, which was also supported by his Democratic presidential election opponent, Vice President Kamala Harris.\"I went to some economists, great ones, I said, 'What do you think?'\" Trump said on Thursday. \"They said, 'It would be unbelievable, you'll get a whole new workforce by doing that.' No taxes on overtime.\"\"The people who work overtime are among the hardest working citizens in our country,\" he added. \"When you're past 40 hours a week, your overtime hours will be tax-free. OK, good?\"Newsweek reached out for comment to the Trump and Harris campaigns via email on Thursday evening.Congress would likely need to pass legislation for any of the proposed tax cuts by Trump, or Harris, to take effect.Before Trump's presidency, a measure during former President Barack Obama's administration was launched to lower the upper-salary threshold for workers to be eligible for overtime. It was struck down in court following a challenge by Republican-led states.The Trump administration later set a higher threshold to qualify for overtime than Obama's proposal, still being lower than the threshold put in place following the court ruling.This is a developing story and will be updated as more information becomes available.","summary":"The ex-president and 2024 GOP nominee previously announced a plan to eliminate taxes on tips.","url":"https://www.newsweek.com/donald-trump-announces-new-tax-plan-1953246","image":"https://d.newsweek.com/en/full/2470470/donald-trump-overtime-tax-plan.jpg","video":null,"publish_date":"2024-09-12 23:23:50","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.176},{"id":256293464,"title":"2024 VMAs Reaches Biggest Audience in Four Years","text":"Eminem opened the 2024 VMAs on Wednesday (Sept. 11) with his recent hit “Houdini.” As it turns out, the show delivered a pretty neat magic trick of its own. In an era of flat, or even declining, ratings for awards shows, the VMAs delivered their biggest audience in four years, with more than 4 million viewers. MTV reports that combined ratings for the premiere and encore showings were up 8% compared to a year ago (4.09 million vs. 3.78 million). Ratings for the premiere simulcast at 8 p.m. ET/PT were up 25% compared to a year ago (3.11 million vs. 2.49 million). That premiere broadcast was simulcast across 13 networks in the U.S., the same number as last year – BET, BET Her, CMT, Comedy Central, Logo, MTV, MTV2, Nick at Nite, Paramount Network, Pop, TV Land, VH1 and Univision. That means that the casual music fan who may have been channel-surfing came across the show multiple times. That sheer repetition may have stirred their interest and made it seem like this was an event. The black-carpet pre-show at 6:30 p.m. aired on four networks. The first encore at 11:18 p.m. (the show ran over, as awards shows tend to do) aired on 10 networks. (Two other networks started their first encore showings within that hour.) The second encore at 2:34 a.m. aired on four networks. MTV reports that the 2024 VMAs were the No. 1 most social entertainment telecast in history, with 66.7 million interactions. The only program that beat it was the second presidential debate of the 2024 campaign season, which aired the previous night, between VP Kamala Harris and former President Donald Trump. The show rang up 829 million video views (an 18% increase over last year) and 76.3 million engagements (a 25% increase over last year) across global owned accounts. VMAs trended No. 1 worldwide on X (formerly Twitter) for 10 hours. Media impressions were up 8% — 107.5 billion impressions this year vs. 99.5 billion impressions last year. The 2024 VMAs had an impressive artist lineup, including host/performer Megan Thee Stallion and such other red-hot artists as Sabrina Carpenter, Chappell Roan and Benson Boone. Taylor Swift didn’t perform, but she was in the audience (or onstage accepting awards) from start to finish. It seems fair to say that artists support the VMAs at this point more than MTV supports music videos, other than on this one night a year. Maybe, given these healthy ratings for their flagship program, the channel can address putting music videos back into its programming mix.","summary":"It was the second-most social telecast in history, topped only by the previous night's presidential debate.","url":"https://www.billboard.com/music/awards/2024-vmas-ratings-biggest-audience-four-years-1235774507/","image":"https://www.billboard.com/wp-content/uploads/2024/09/03-megan-thee-stallion-mtv-vmas-2024-billboard-1548.jpg","video":null,"publish_date":"2024-09-12 23:22:07","author":"Paul Grein","authors":["Paul Grein"],"language":"en","source_country":"US","sentiment":0.101},{"id":256293698,"title":"Trump says he would push to end taxes on overtime pay","text":"(CNN) — Former President Donald Trump on Thursday said he would push for legislation that would end taxes on overtime pay if he wins a second term. “Today, I’m also announcing that as part of our additional tax cuts, we will end all taxes on overtime. You know what that means? Think of that,” Trump said at a campaign rally in Tucson, Arizona. “That gives people more of an incentive to work. It gives the companies a lot, it’s a lot easier to get the people,” Trump said in his first rally since his debate with Vice President Kamala Harris earlier this week. His pitch came in battleground Arizona, where Harris’ ascendance on the ticket has put the state — which President Joe Biden won by just 10,000 votes — back in play for Democrats this year. The former president previously announced he would push to end taxes on tips and proposed that seniors should not pay taxes on Social Security benefits. “The people who work overtime are among the hardest working citizens in our country and for too long, no one in Washington has been looking out for them,” Trump said. “Those are the people, they really work. They’re police officers, nurses, factory workers, construction workers, truck drivers and machine operators.” The-CNN-Wire™ & © 2024 Cable News Network, Inc., a Time Warner Company. All rights reserved.","summary":"(CNN) — Former President Donald Trump on Thursday said he would push for legislation that would end taxes on overtime pay if he wins a...","url":"https://wsvn.com/news/politics/trump-says-he-would-push-to-end-taxes-on-overtime-pay/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/Trump-North-Carolina-Wednesday-Rally.png","video":null,"publish_date":"2024-09-12 23:21:10","author":"Kevin Boulandier","authors":["Kevin Boulandier"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.205},{"id":256294834,"title":"Antisemitic Ads About Doug Emhoff Target Muslim Voters in Michigan","text":"The tone of the ad is celebratory. “Doug Emhoff,” a narrator says, “would be the first Jewish presidential spouse ever.” The strategy behind the spot seems to be far more cynical. A super PAC that appears to have Republican ties is targeting Michigan residents — including those in Detroit-area ZIP codes that are home to many Muslim Americans and Arab Americans — with YouTube advertisements that highlight Vice President Kamala Harris’s support for Israel and, in some cases, the Jewish faith of her husband, Mr. Emhoff. As the narrator cheerfully notes Mr. Emhoff’s religion, an image of the Israeli flag appears onscreen, a dog whistle conjuring the antisemitic trope of dual loyalty.","summary":"An ad campaign in the state, funded by a group that appears tied to Republicans, seems designed to remind Muslim voters of Kamala Harris’s pro-Israel views and her husband’s Jewish faith.","url":"https://www.nytimes.com/2024/09/12/us/politics/antisemitic-ads-doug-emhoff-muslim-michigan.html","image":"https://static01.nyt.com/images/2024/09/12/multimedia/12pol-michigan-ads-pwzb/12pol-michigan-ads-pwzb-facebookJumbo.jpg","video":null,"publish_date":"2024-09-12 23:19:34","author":"Katie Glueck","authors":["Katie Glueck"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.177},{"id":256295098,"title":"Trump says he will end all taxes on overtime pay if elected","text":"Republican U.S. presidential candidate Donald Trump said on Thursday that he will end all taxes on overtime pay as part of a wider tax cut package, if he is elected in the Nov. 5 election. \"As part of our additional tax cuts, we will end all taxes on overtime,\" Trump said in remarks at a rally in Tucson, Arizona. \"Your overtime hours will be tax-free.\" America Votes: Latest U.S. election news and analysis from a Canadian perspective Trump, who faces Democratic Vice President Kamala Harris in what polls show to be a tight race, has previously said he would seek legislation to end the taxation of tips to aid service workers. Harris has made a similar pledge. The subject of overtime has recently become a campaign issue between Trump and Harris. At a campaign event this month with union workers, Harris accused Trump of \"blocking\" overtime from millions of workers during his 2017-2021 presidency. In 2019, the Trump administration issued a rule increasing the eligibility of overtime pay to 1.3 million additional U.S. workers, replacing a more generous proposal that had been introduced by President Barack Obama, Trump's Democratic predecessor. The Trump administration raised the salary level for exemption from overtime pay to US$35,568 a year, up from the long-standing US$23,660 threshold. Workers’ rights groups criticized the move, saying it covered far fewer workers than the scheme introduced under Obama. Under Obama, the Labor Department proposed raising the threshold to more than US$47,000, which would have made nearly 5 million more workers eligible for overtime. That rule was later struck down in court. Overtime pay at these income levels overwhelmingly benefits blue-collar workers, such as fast-food workers, nurses, store assistants and other low-income employees. \"The people who work overtime are among the hardest working citizens in our country and for too long no one in Washington has been looking out for them,\" Trump said on Thursday. Under Labor Department rules, eligible workers must be paid at least time-and-a-half for hours worked above 40 hours in a single work-week. As of last month, American factory workers in non-supervisory roles put in an average of 3.7 hours of overtime a week, data from the Bureau of Labor Statistics shows. Download the CTV News App for breaking news alerts and video on all the top stories Not taxing overtime would result in less government revenue, at a time when Trump's plan to permanently extend the tax cuts he passed as president would expand the U.S. deficit by US$3.5 trillion through 2033, according to the non-partisan Congressional Budget Office. The U.S. budget deficit in the first 11 months of this fiscal year is US$1.9 trillion. It's unclear how much revenue the government receives from taxes on overtime pay. Trump's proposal would be a first for the federal government. Alabama this year became the first state to exclude overtime wages for hourly workers from state taxes as a temporary measure that won legislative support in part to help employers fill jobs in a tight labor market. The exemption is for 18 months only. (Reporting by Kanishka Singh, Tim Reid and Ann Saphir; Editing by Leslie Adler and Ross Colvin)","summary":"Republican U.S. presidential candidate Donald Trump said on Thursday that he will end all taxes on overtime pay as part of a wider tax cut package, if he is elected in the Nov. 5 election.","url":"https://www.ctvnews.ca/world/trump-says-he-will-end-all-taxes-on-overtime-pay-if-elected-1.7036287","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/9/12/donald-trump-1-7036288-1726183031238.jpg","video":null,"publish_date":"2024-09-12 23:18:07","author":"Reuters,Tim Reid, Ann Saphir And Kanishka Singh","authors":["Reuters","Tim Reid, Ann Saphir And Kanishka Singh"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.257},{"id":256293802,"title":"Where Trump and Harris Stand With Donations","text":"This is an edition of The Atlantic Daily, a newsletter that guides you through the biggest stories of the day, helps you discover new ideas, and recommends the best in culture. Sign up for it here. “HOLY COW!!!!!” read the subject line of a fundraising email just after the debate on Tuesday evening. Democrats and their allies were quick to use Kamala Harris’s strong performance to ask voters to chip in. Many heeded the call—Harris’s campaign reportedly raised $47 million in the 24 hours following the debate. Presidential debates aren’t everything in the grand scheme of an election, and Tuesday’s looks to be the last of this cycle, given that Donald Trump is refusing another round. But one tangible effect of the debate is that it sparked major donations for Harris. And it may end up doing the opposite for Trump: The New York Times reported yesterday that the former president’s rambling, falsehood-filled performance aggravated some of his very rich supporters. Although the full picture of donations won’t become clear until next month, the debate is likely to strengthen Harris’s already solid fundraising lead. In a standard election, donations tend to flood in after big moments such as debates and conventions. Harris’s memorable 2019 primary-debate comments about busing led her to exceed her previous best fundraising day; Joe Biden broke his single-hour fundraising record following a 2020 debate against Trump. But this is not a standard race: In addition to the normal fundraising touchstones, real money movement has also followed felony convictions and last-minute candidate swaps. In the 24 hours after Trump’s conviction in May, he raised nearly $53 million, according to his campaign, far surpassing his previous single-day fundraising high point, and his camp quickly fundraised after the attempt on his life in July (“NEVER SURRENDER,” his team wrote, demonstrating a bipartisan propensity toward all-caps email subject lines). Harris, meanwhile, got an influx of donations after Biden announced that he was leaving the race: Her campaign said she raised more than $100 million just after Biden endorsed her, and she went on to reverse the cash lead that Trump had held over Biden earlier this summer. Harris’s money momentum has stayed strong: Last month, she reportedly raised nearly triple the amount that Trump did ($361 million to his $130 million), including a $40 million bump just after the Democratic National Convention. And she arguably needs the money more than Trump does right now. Having inherited Biden’s campaign infrastructure, she has a large presence in many states, and although those regional offices may prove valuable, they also cost money to operate. Trump, meanwhile, has been working with a much smaller staff than Harris; his campaign outsources much of its on-the-ground work to PACs and organizations not formally affiliated with the campaign. In past cycles, having more money has tended to help the challenger more than the incumbent. Among the many odd things about this election cycle is that both candidates are a kind of mix of incumbent and challenger. Harris is well known as the vice president, but Trump’s persona is much better understood by the public—in a New York Times poll this month, many voters said that they still need to learn more about Harris. Donations will help her the most if she uses them to boost her name recognition and get out the vote, Michael J. Malbin, a political-science professor and a co-founder of the Campaign Finance Institute, told me. He suggested looking at this particular debate “as a stimulator of enthusiasm,” especially for volunteers. Harris has certainly been spending her money. She’s bought up a slate of national ads, including lots of time during the Paris Olympics. Trump has also spent lots of campaign money this year, though some of it has gone toward his pesky legal bills. In June, his campaign spent just $10 million on actual campaigning, Politico reported. The next month, he spent more than double that—still less than a third of what Biden and Harris spent that same month—and more recently, he has started ramping up his spending in swing states. We are at an in-between moment in the race: Election Day is near, but so much can still happen in the next two months. Money can buy ad time to sustain and boost the candidates. But it only goes so far. Ultimately, people vote for the person they know and like. Becoming that person requires a mix of approaches: good ads, yes, but also strong public appearances and conventions and volunteer efforts. And, of course, random events can upend a race—or at least energize groups of voters. On Tuesday evening, Taylor Swift posted her endorsement of Harris’s ticket. By Wednesday, Harris’s campaign had a new fundraising ask of voters: “Will you join Taylor Swift in supporting Vice President Kamala Harris’s campaign?” Related: Here are four new stories from The Atlantic: Today’s News Dispatches Explore all of our newsletters here. Evening Read What I Saw on the January 6 Committee By Jacob Glick More From The Atlantic Culture Break Watch (or skip). Season 2 of The Lord of the Rings: The Rings of Power (streaming on Prime Video) is still dealing with the Sauron Problem, Emma Stefansky writes. Because viewers know how the tale ends, the series is trying to manufacture suspense by dragging out the story. Read. Rumaan Alam’s latest novel, Entitlement, details how a Black woman’s quest for status runs up against her blind spots, Tope Folarin writes. Stephanie Bai contributed to this newsletter. When you buy a book using a link in this newsletter, we receive a commission. Thank you for supporting The Atlantic.","summary":"In this election, campaign money has been flowing in at both the standard moments and the not-so-standard.","url":"https://www.theatlantic.com/newsletters/archive/2024/09/where-trump-and-harris-stand-with-donations/679864/","image":"https://cdn.theatlantic.com/thumbor/1A4tMUU0Vm2XeTQhMSuN1rqIPbw=/0x189:5244x2920/1200x625/media/img/mt/2024/09/GettyImages_2170581623/original.jpg","video":null,"publish_date":"2024-09-12 23:17:00","author":"Lora Kelley","authors":["Lora Kelley"],"language":"en","source_country":"US","sentiment":-0.011},{"id":256295288,"title":"Biden marks 30th anniversary of pivotal bill to protect women","text":"President Joe Biden hosted nearly 1,000 survivors and women’s advocates at the White House Thursday to mark the 30th anniversary of the Violence Against Women Act. The legislation, originally written by Biden in 1990 when he was a member of the Senate and signed into law by President Bill Clinton in 1994, “improved the criminal justice response to violence against women” and “ensured that victims and their families have access to the services they need to achieve safety and rebuild their lives,” according to a fact sheet provided by the White House. Introducing himself as “Jill Biden’s husband and Ashley Biden’s dad,” Biden talked about VAWA’s successes, saying it “broke the dam of congressional and cultural resistance, brought this hidden epidemic out of the shadows, and began to shift the legal and social burdens away from the survivors onto the perpetrators where they belonged.” The Biden administration released its U.S. National Plan To End Gender-Based Violence in 2023 with the aim of providing an accessible federal plan that can be used by local municipalities as well as private entities. “Today, I am proud to announce a new significant action,” Biden said. “A record of nearly $700 million in grants this year alone to more than 40 VAWA-funded programs in states and tribal communities across the country.” VAWA was the first comprehensive federal legislation that recognized the need to combat the threat of violence against women and set out provisions and protections for victims of domestic violence. It established the National Domestic Violence Hotline and the Office on Violence Against Women, as well as many training programs for law enforcement agencies, judicial officials, and advocates in the field of gender violence. Thursday’s commemoration was also an opportunity for Biden to remind lawmakers and stakeholders that there’s still work to be done, and he trusts his vice president and current Democratic presidential nominee Kamala Harris to keep championing the law. “Let me just say the first and best decision I made when I was a nominee in 2020 was selecting Kamala Harris as vice president,” Biden told a cheering audience. “That’s not a political statement, it’s a factual statement.” VAWA expired in 2018. In 2022, Republicans threatened to sink a Democrat-driven effort to renew the legislation if it included language closing up the “boyfriend loophole” that allows unmarried abusers convicted of a misdemeanor to retain their right to purchase and own firearms. VAWA was reauthorized in March 2022 without closing that loophole, but Biden was able to sign that restriction into gun control legislation in June 2022 in the wake of terrible mass shootings in Uvalde, Texas, and Buffalo, New York. The president spoke about how he and Harris worked to ensure that they found a way to close that loophole. Biden finished his speech by calling the Violence Against Women Act “my proudest legislative accomplishment in the years I've served as senator, and vice president, and president,” eliciting a standing ovation from the audience collected on the White House lawn. “I'm so proud, so grateful for the heroes I’ve met along the way,” Biden said. “Women and men who run shelters and rape crisis centers, fighters and allies who stand up to industry titans to expose the truth. Survivors who speak up for themselves and empower those suffering in silence. “You've changed the nation,” Biden continued. “You've turned your pain into purpose. And your bravery and spirit are unbreakable. Because of you, and this is not hyperbole, because of you, we are a better nation than we were 30 years ago.”","summary":"President Joe Biden hosted nearly 1,000 survivors and women’s advocates at the White House Thursday to mark the 30th anniversary of the Violence Against Women Act. The legislation, originally written by Biden in 1990 when he was a member of the Senate and signed into law by President Bill Clinton in 1994, “improved the criminal justice response to violence against women” and “ensured that victims and their families have access to the services they need to achieve safety and rebuild their lives,” according to a fact sheet provided by the White House.\n\n\n\nIntroducing himself as “Jill Biden’s husband and Ashley Biden’s dad,” Biden talked about VAWA’s successes, saying it “broke the dam of congressional and cultural resistance, brought this hidden epidemic out of the shadows, and began to shift the legal and social burdens away from the survivors onto the perpetrators where they belonged.”\n\n\n\nThe Biden administration released its U.S. National Plan To End Gender-Based Violence in 2023 with the aim of providing an ","url":"https://www.dailykos.com/story/2024/9/12/2269884/-Biden-marks-30th-anniversary-of-pivotal-bill-to-protect-women?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1344859/story_image/GettyImages-2170839092resized.jpeg?1726181884","video":null,"publish_date":"2024-09-12 23:15:14","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":-0.035},{"id":256293048,"title":"The US is preparing criminal charges in Iran hack targeting Trump, AP sources say","text":"WASHINGTON (AP) — The Justice Department is preparing criminal charges in connection with an Iranian hack that targeted Donald Trump’s presidential campaign in a bid to shape the outcome of the November election, two people familiar with the matter said Thursday. It was not immediately clear when the charges might be announced or whom precisely they will target, but they are the result of an FBI investigation into an intrusion that investigators across multiple agencies quickly linked to an Iranian effort to influence American politics. The prospect of criminal charges comes as the Justice Department has raised alarms about aggressive efforts by countries including Russia and Iran to meddle in the presidential election between Trump and Democratic nominee Kamala Harris, including by hacking and covert social media campaigns designed to shape public opinion. Iran “is making a greater effort to influence this year’s election than it has in prior election cycles and that Iranian activity is growing increasingly aggressive as this election nears,” Assistant Attorney General Matthew Olsen, the Justice Department’s top national security official, said in a speech Thursday in New York City. “Iran perceives this year’s elections to be particularly consequential in impacting Iran’s national security interests, increasing Tehran’s inclination to try to shape the outcome,” he added. The Trump campaign disclosed on Aug. 10 that it had been hacked and said Iranian actors had stolen and distributed sensitive internal documents. At least three news outlets — Politico, The New York Times and The Washington Post — were leaked confidential material from inside the Trump campaign. So far, each has refused to reveal any details about what it received. Politico reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier that the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. The FBI, the office of the Director of National Intelligence and the Cybersecurity and Infrastructure Security Agency subsequently blamed that hack, as well as an attempted breach of the Biden-Harris campaign, on Iran. Those agencies issued a statement saying that the hacking and similar activities were meant to sow discord, exploit divisions within American society and influence the outcome of elections. The statement did not identify whether Iran has a preferred candidate, though Tehran has long appeared determined to seek retaliation for a 2020 strike Trump ordered as president that killed an Iranian general. The two people who discussed the looming criminal charges spoke on condition of anonymity to The Associated Press because they were not authorized to speak publicly about a case that had not yet been unsealed. The Washington Post first reported that charges were being prepared. Justice Department officials have been working to publicly call out and counter election interference efforts. The response is a contrast to 2016, when Obama administration officials were far more circumspect about Russian interference they were watching that was designed to boost Trump’s campaign. “We have learned that transparency about what we are seeing is critical,” Olsen, the Justice Department official, said Thursday. “It helps ensure that our citizens are aware of the attempts of foreign government to sow discord and spread falsehoods — all of which promotes resilience within our electorate,” he added. “It provides warnings to our private sector so they can better protect their networks. And it sends an unmistakable message to our adversaries — we’ve gained insight into your networks, we know what you’re doing, and we are determined to hold you accountable.” Last week, in an effort to combat disinformation ahead of the election, the Justice Department charged two employees of RT, a Russian state media company, with covertly funneling a Tennessee-based content creation company nearly $10 million to publish English-language videos on social media platforms with messages in favor of the Russia government’s interests and agenda. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — The Justice Department is preparing criminal charges in connection with an Iranian hack that targeted Donald Trump&#8217;s presidential campaign in a bid...","url":"https://wsvn.com/news/politics/the-us-is-preparing-criminal-charges-in-iran-hack-targeting-trump-ap-sources-say/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/06/Garland-slams-attacks-on-the-Justice-Department-telling-lawmakers-I-will-not-be-intimidated.png","video":null,"publish_date":"2024-09-12 23:14:42","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.277},{"id":256293258,"title":"This week on \"Sunday Morning\" (Sept. 15)","text":"The Emmy Award-winning \"CBS News Sunday Morning\" is broadcast on CBS Sundays beginning at 9:00 a.m. ET. \"Sunday Morning\" also streams on the CBS News app beginning at 11:00 a.m. ET. (Download it here.) Hosted by Jane PauleyCOVER STORY: Fighting vaccine skepticismThanks to vaccinations, measles was declared eliminated in the United States in 2000. But measles cases are now back, and one big reason is that, across the country, more families have exempted their children from routine immunizations than ever before. CBS News chief medical correspondent Dr. Jon LaPook looks at how the views of \"anti-vaxxers\" are precipitating new health crises; and talks with health experts about the dangers posed by anti-vaccine and anti-science movements.For more info: Medical historian and pediatrician Dr. Howard Markel\"When Germs Travel: Six Major Epidemics That Have Invaded America Since 1900 and the Fears They Have Unleashed\" by Howard Markel (Vintage), in Trade Paperback, eBook and Audio formats, available via Amazon, Barnes & Noble and Bookshop.orgElena Conis, historian of medicine, public health, and the environment, University of California, Berkeley\"Vaccine Nation: America's Changing Relationship with Immunization\" by Elena Conis (University of Chicago Press), in Hardcover, Trade Paperback, eBook and Audio formats, available via Amazon, Barnes & Noble and Bookshop.orgDr. Peter Jay Hotez, Baylor College of Medicine and Texas Children's Hospital\"The Deadly Rise of Anti-science: A Scientist's Warning\" by Peter J. Hotez (Johns Hopkins University Press), in Hardcover, Trade Paperback and eBook formats, available via Amazon, Barnes & Noble and Bookshop.org ALMANAC: September 15\"Sunday Morning\" looks back at historical events on this date.FOOD: Pete Wells dishes on life as NY Times restaurant criticSince he began writing restaurant reviews for The New York Times in 2012, Pete Wells became arguably the world's most powerful restaurant critic, until filing his final review this summer. With correspondent Martha Teichner, he reflects on dining out five nights a week for the past twelve years, all in the line of duty; the disguises he's worn to avoid detection by restaurant staff; and the health implications of eating at some of the world's best (and not-so-best) restaurants. For more info: Pete Wells, The New York TimesThe 100 Best Restaurants in New York City in 2024, by Pete WellsErnesto's, New York CitySemma, New York CityTrinciti Roti Shop, Queens, N.Y.Ewe's Delicious Treats, BrooklynBOOKS: Hillary Clinton on Harris' White House run, Trump's conviction, and moreHillary Rodham Clinton has lived one of the most public of lives, but has kept much private during her years as first lady, Senator, Secretary of State and presidential nominee. Now, she opens up about personal matters in her new book, \"Something Lost, Something Gained: Reflections on Life, Love, and Liberty.\" She talks with CBS News' Erin Moriarty about her marriage to President Bill Clinton and the loss of friends and family; her personal association to Vice President Kamala Harris' run for the White House; and how she interpreted news of the criminal conviction of former President Donald Trump.For more info: \"Something Lost, Something Gained: Reflections on Life, Love, and Liberty\" by Hillary Rodham Clinton (Simon & Schuster), in Hardcover, eBook and Audio formats, available September 17 via Amazon, Barnes & Noble and Bookshop.orgHillary Rodham Clinton (Official site) DESIGN: New methods, technology to cut down on bird strikesAccording to experts, up to a billion birds die every year from flying into buildings and skyscrapers – distracted by lights or reflections, or unaware of the hazards posed by glass. But some architects are using new bird-friendly glass in their construction, while public-awareness campaigns are having a dramatic effect on creating safer environments for migrating birds. Correspondent David Pogue reports.For more info: Ornithologist Andrew Farnsworth, Cornell Lab of OrnithologyFXCollaborative Architects PASSAGE: In memoriam\"Sunday Morning\" remembers some of the notable figures who left us this week.MUSIC: The return of LL Cool J, the rapperAs a teenager LL Cool J was the first artist signed to the Def Jam label, becoming one of the first major hip-hop stars, with hits like \"Going Back to Cali\" and \"Mama Said Knock You Out.\" He turned to acting, starring for 14 seasons on \"NCIS: Los Angeles.\" Now 56, he's returned to the thing he loves most – rapping – with his first album in more than a decade, \"The Force.\" He talks with \"Sunday Morning\" contributor Kelefa Sanneh about the origins of his career, and the magic of making a hip-hop record.You can stream the LL Cool J album \"The Force\" by clicking on the embed below (Free Spotify registration required to hear the tracks in full):For more info:llcoolj.com (Official site)\"The Force\" by LL Cool JTECHNOLOGY: Saildrones: Game-changers for the NavyThe U.S. Navy is testing a new way of patrolling the ocean, by using saildrones – boats that can function without crew while tracking vehicles on the high seas. CBS News national security correspondent David Martin talks with Saildrone founder & CEO Richard Jenkins about his autonomous fleet; and with Navy officials about how they are using the massive amounts of data being collected.For more info: saildrone.comU.S. Naval Forces Southern Command, Naval Station Mayport, Fla. BOOKS: Connie Chung's secrets to her successVeteran CBS journalist Connie Chung broke down barriers in TV news to become the first Asian woman to co-anchor a nightly network news program. She reflects on her four-decade career in a new memoir, \"Connie,\" and sits down at her home in Montana with \"Sunday Morning\" anchor Jane Pauley, to talk about fighting sexism and racism in what she called \"a sea of men,\" and the lengths she would go to, to land the big interviews.For more info: \"Connie: A Memoir\" by Connie Chung (Grand Central Publishing), in Hardcover, eBook and Audio formats, available September 17 via Amazon, Barnes & Noble and Bookshop.org HARTMAN: TBD MOVIES: \"Will & Harper\"Comedy legend Will Ferrell and former \"Saturday Night Live\" head writer Harper Steele had been buddies since the mid-1990s. But then Steele sent an email announcing that she had transitioned to a woman. How the two approached the changing dynamics of their friendship became the basis of a new Netflix documentary, \"Will & Harper,\" in which the two embark on a cross-country road trip – 17 days of laughter, tears and beer. Correspondent Tracy Smith talks with Ferrell and Steele about their adventure and what they learned about themselves, and the nation they navigated.To watch a trailer for \"Will & Harper\" click on the video player below: For more info: \"Will & Harper,\" now playing in theaters, and streaming on Netflix beginning September 27 NATURE: TBD WEB EXCLUSIVE: FROM THE ARCHIVES: James Earl Jones (YouTube Video)Acclaimed actor James Earl Jones, renowned as a Tony-winning stage presence, film star, and voice of Darth Vader, died on September 9, 2024 at age 93. In this \"Sunday Morning\" profile that originally aired March 16, 2008, Jones talked with correspondent Michelle Miller about overcoming his childhood stutter; described how he \"got lucky\" with his voiceover job for George Lucas' \"Star Wars,\" and how he voiced a \"dopey dad\" in \"The Lion King\"; and discussed his return to Broadway as Big Daddy in Tennessee Williams' \"Cat on a Hot Tin Roof.\"GALLERY: Summer music heats up 2024Live performances are in full swing this summer. Scroll through our concert gallery, featuring pictures by CBS News photojournalist Jake Barlow and photographers Ed Spinelli and Kirstine Walton.The Emmy Award-winning \"CBS News Sunday Morning\" is broadcast on CBS Sundays beginning at 9:00 a.m. ET. Executive producer is Rand Morrison.DVR Alert! Find out when \"Sunday Morning\" airs in your city \"Sunday Morning\" also streams on the CBS News app beginning at 11:00 a.m. ET. (Download it here.) Full episodes of \"Sunday Morning\" are now available to watch on demand on CBSNews.com, CBS.com and Paramount+, including via Apple TV, Android TV, Roku, Chromecast, Amazon FireTV/FireTV stick and Xbox. Follow us on Twitter; Facebook; Instagram; YouTube; TikTok; and at cbssundaymorning.com. You can also download the free \"Sunday Morning\" audio podcast at iTunes and at Play.it. Now you'll never miss the trumpet!","summary":"A look at the features for this week's broadcast of the 2023 News & Documentary Emmy-winner for Outstanding Recorded News Program, hosted by Jane Pauley.","url":"https://www.cbsnews.com/news/this-week-on-sunday-morning-september-15-2024/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/12/12db827e-412b-4f5d-8a03-4ef6eb0efd11/thumbnail/1200x630/5c739aea247b28b264897952eba77688/92nd-street-y-sun.jpg?v=d2d77bee90bcafa285fd6d60bd8b3612","video":null,"publish_date":"2024-09-12 23:14:00","author":"David Morgan","authors":["David Morgan"],"language":"en","source_country":"US","sentiment":0.442},{"id":256294124,"title":"ABC Denies Kamala Harris Was Given Questions Before Trump Debate","text":"ABC has denied Vice President Kamala Harris was given any questions ahead of Tuesday’s debate, shooting down one of the talking points that right-wingers—including former President Donald Trump—tried to use to explain the former president’s much-criticized debate performance. “Absolutely not,” an ABC News spokesperson told The Daily Beast. “Harris was not given any questions before the debate.” The network’s debate rules stated that “no topics or questions will be shared in advance with campaigns or candidates.” The spokesperson also said no aides were in contact with moderators David Muir and Linsey Davis. Trump aides have attacked the moderators as “agents of the Harris campaign” following their efforts, which have been almost universally lauded. The questions claim’s first dose of oxygen was on Wednesday, when Trump told Fox & Friends that he felt Harris was “awfully familiar” with the questions as he debated her. It was further amplified on Thursday by Leading Report, a website that has repeatedly shared misinformation on everything from politicians to networks. It claimed on X that an ABC whistleblower would “allegedly” release an affidavit that said the Harris campaign was given sample questions in advance and that Harris was given “assurances” that only Trump would be fact-checked during Tuesday”s debate. (A source familiar with the matter dismissed the purported “assurances” claim as untrue.) The website and its writers have recently claimed, either falsely or out of context, that Biden read the words “end of quote” on his teleprompter (he was reading a quote by Supreme Court Justice Sonia Sotomayor); that CNN would add a 1-2 minute delay to its June 27 debate (it did not); and that World Economic Forum founder Klaus Schwab had been “allegedly” hospitalized in April (he was not). The website masquerading as a news source seemed to derive the claim from an X account with the name “Black Insurrectionist.” The account tweeted on Thursday that they would release the said affidavit “before the weekend is out.” It offered no proof to back up the claim, and the account is not linked to any news source, conservative or otherwise. Still, billionaire-turned-X-scribe Bill Ackman boosted the Leading Report post to his 1.4 million followers. “If this turns out to be true, this is a serious breach of journalistic ethics and a death blow to @ABCNetwork reputation,” he wrote. Trump tried to lay the groundwork for potential debate shenanigans ahead of the debate that would excuse his performance, speculating on both Truth Social and to Sean Hannity that ABC panelist Donna Brazile—who famously tipped off Hillary Clinton about questions ahead of CNN events in 2016—would share questions with Harris. It came as Trump has repeatedly attacked the network—which he is currently suing—as biased. “Will panelist Donna Brazil give the questions to the Marxist Candidate like she did for Crooked Hillary Clinton?” Trump wrote. Trump has repeatedly labeled the debate as unfair and has claimed he was battling “THREE ON ONE” throughout the more than 90-minute telecast—all as he claimed he delivered his best debate performance yet. He wrote early Thursday the network should “fire everybody” and claimed later in the day he would not do another debate with Harris. The Harris campaign’s responded by calling him a chicken.","summary":"Win McNamee/Getty ImagesABC has denied Vice President Kamala Harris was given any questions ahead of Tuesday’s debate, shooting down one of the talking points that right-wingers—including former President Donald Trump—tried to use to explain the former president’s much-criticized debate performance.\n\n“Absolutely not,” an ABC News spokesperson told The Daily Beast. “Harris was not given any questions before the debate.”\n\nThe network’s debate rules stated that “no topics or questions will be shared in advance with campaigns or candidates.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/abc-denies-kamala-harris-was-given-questions-before-trump-debate","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1383,w_2459,x_0,y_119/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1726181871/GettyImages-2171258280_hkx6j8","video":null,"publish_date":"2024-09-12 23:08:00","author":"Corbin Bolies","authors":["Corbin Bolies"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.07},{"id":256294166,"title":"Trump campaign sells Taylor Swift-themed shirts after he denounced her Harris support","text":"Donald Trump’s campaign is selling bizarre “Eras Tour”-style shirts following pop superstar Taylor Swift’s surprise endorsement of Vice President Kamala Harris on Tuesday night. The shirts, mimicking Swift’s now-iconic tour graphic and targeting so-called “Swifties for Trump,” feature photos of Trump on backgrounds color-coordinated to each of Swift’s eras. They'll run supporters $45 dollars. “Look what you made me do,” the shirt’s pre-sale page on Republican fundraising platform WinRed reads, a jab at Swift pulled straight from one of her singles. The knock-off comes shortly after Trump dismissed Swift's endorsement, saying that Swift will “pay a price” for her stance when phoning into Fox & Friends. The merch sale comes days after Swift wrote in an endorsement of Harris, which she felt compelled to share after seeing AI-generated false endorsements from her posted by Trump. The endorsement, which also drew ridicule from JD Vance, has already driven at least 337,000 fans to voter registration site Vote.org. “I don't think most Americans are gonna be influenced by a billionaire celebrity who I think is fundamentally disconnected from the interests and the problems of most Americans,” Vance told Fox News before the campaign co-opted Swift’s design. Swift, who endorsed Biden in 2020, joins the ranks of musicians unwittingly tied to the Trump campaign. That includes garage-rock revivalists the White Stripes, who sued Trump for using their song \"Seven Nation Army\" in a campaign video without permission. The Trump team is late to Swift campaign merch party. Harris’s campaign released a set of friendship bracelets, a nod to Swiftie culture, immediately after her endorsement.","summary":"The \"Eras Tour\" knockoffs run \"Swifties for Trump\" $45, even after JD Vance dubbed Swift's endorsement meaningless","url":"https://www.salon.com/2024/09/12/campaign-sellstaylor-swift-themed-shirts-after-he-denounced-her-harris-support/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2024/07/taylor_swift_2162457025.jpg ?>","video":null,"publish_date":"2024-09-12 23:05:51","author":"Griffin Eckstein","authors":["Griffin Eckstein"],"language":"en","source_country":"us","sentiment":0.08},{"id":256293256,"title":"How Taylor Swift's Harris endorsement is impacting the 2024 race","text":"How Taylor Swift's Harris endorsement is impacting the 2024 race How much of an asset was Taylor Swift's endorsement of Vice President Kamala Harris? So far, more than 405,000 people have clicked on the voter registration link Swift shared in her post backing the Harris-Walz ticket. Tom Bonier, senior adviser at data firm TargetSmart, joins \"America Decides\" to analyze the numbers.","summary":"How much of an asset was Taylor Swift's endorsement of Vice President Kamala Harris? So far, more than 405,000 people have clicked on the voter registration link Swift shared in her post backing the Harris-Walz ticket. Tom Bonier, senior adviser at data firm TargetSmart, joins \"America Decides\" to analyze the numbers.","url":"https://www.cbsnews.com/video/how-taylor-swift-harris-endorsement-impacting-2024-race/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/09/12/0d5ddbec-5f5d-435e-803f-f97c3f36f784/thumbnail/1200x630/4cbc999ec806fc6d739b78113c8966c7/cbsn-fusion-how-taylor-swift-harris-endorsement-impacting-2024-race-thumbnail.jpg?v=d2d77bee90bcafa285fd6d60bd8b3","video":null,"publish_date":"2024-09-12 23:05:00","author":null,"language":"en","source_country":"US","sentiment":0.282},{"id":256292940,"title":"Letters: Redirect support | A strong case | Trump’s deceit | Ill prepared | Misusing genocide","text":"Fewer abortions take place under Democrats Re: “More abortions are bad for the United States” (Page A6, Sept. 10). In response to Mr. Burke, statistics prove that there are actually fewer abortions when the Democrats are in charge. When we invest in programs that provide education, health care, paid family leave and child care, abortions decrease. Thinking people do research. Margaret Mayfield San Jose Siebels should consider redirecting support Re: “Trump returning to Bay Area on Friday for campaign fundraiser” (Page B3, Sept. 10). Tom and Stacey Siebel have already given many millions of dollars to PACs in this election. After Citizens United, corporations are controlling elections in America. Donald Trump clearly has no plans for the economy in America (he doesn’t even understand what a tariff is), wants Ukraine to fail and supports Vladimir Putin. Trump’s lack of empathy for women should also alarm the Siebels. The best gift to the nation would be for the Siebels to withdraw their invitation to Trump and support democracy both here in the USA as well as in Ukraine and elsewhere. Alice Schaffer Smith Palo Alto Harris makes strong case against Trump During the debate, Kamala Harris did an admirable job of combating Donald Trump’s lies. There were three “untruths,” though, that I thought she let slide. One was Trump’s lie that “I had nothing to do with Jan. 6, it was all Pelosi’s fault.” Two was his fabrication that everyone on both sides wanted the Supreme Court to overturn Roe v. Wade so the states could vote on the abortion issue. And three was his bragging that he had the courage to fire several appointees for doing a bad job when in effect he fired them because they refused to let loyalty to him interfere with doing their job honestly. By the way, an equal number of his appointees quit for the same reason. We’ve been warned by many who served Trump that he can’t be allowed back in the White House, and I thought Harris made a really good case for just that. Bob Parker San Jose Country should unite against Trump’s deceit What a debate. The opponent of Vice President Kamala Harris repeatedly refused to admit that he lost the 2020 election to Joe Biden despite evidence to the contrary. Yet, this man who lives in a fantasy world where immigrants are eating cats and dogs and where illegal immigrants are receiving sex change operations in prison is the man Republicans have chosen to represent their party in the 2024 presidential election. I really don’t know whether to feel sorry for the former president or to be disgusted by his lies. What I do know is that we all must come together to make sure we defeat this racist bully who is bent on destroying all that is good and decent to ensure that democracy survives in this great nation. Myokyaw Myint San Jose Trump is ill-prepared to fight climate change Re: “Candidates spar on economy and abortion in tense debate” (Page A3, Sept. 11). I asked a friend if she watched the debate, and she said she did. She and her husband feel that high gasoline prices are due to the Biden administration’s reducing domestic supplies of crude oil. Further, they believe that high gasoline prices are causing inflation for food and other commodities. I suspect that many Americans share this view. So, I did some fact checking myself on this position. In fact, domestic oil production has increased during the Biden years. Would it increase more under a Trump administration like he claims? Maybe, but most economists say gasoline prices are mostly affected by worldwide crude oil prices and less affected by domestic supply. This understanding is important, because climate change is a serious, worsening problem that the next administration must address. I hope all American voters will consider climate change when they go to the polls in November. Rob Hogue Menlo Park Readers’ misuse of ‘genocide’ maligns Israel Re: “Netanyahu’s approach is growing protests” (Page A6, Sept. 11). Of the approximately 41,000 Gazans killed in this war, the Israeli military says over 17,000 were Hamas or other combatants. Many others were killed because Hamas members were hiding among them as they were being used as human shields. These numbers do not equate to genocide but more to the brutality of war. On the other hand, calls by Hamas, Iran and others to destroy Israel is a call for genocide. That is their goal and they mean it. Gilbert Stein Aptos","summary":"Mercury News Letters to the Editor for Sept. 13, 2024","url":"https://www.mercurynews.com/2024/09/12/letters-1867/","image":"https://www.mercurynews.com/wp-content/uploads/2024/05/SJM-Z-OPED-BROOKS-0521.jpg?w=1024","video":null,"publish_date":"2024-09-12 23:00:31","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.26},{"id":256293146,"title":"How a Cultural Shift Favors Harris","text":"American culture changes with astonishing speed. Nearly every decade, there are shifts in values, fashions and norms — in the whole atmosphere of national life. Sometimes when you’re watching a presidential campaign, it is best to ask: What year is it? What values and moods are dominant in America right now? Which candidate just seems right for this moment, and which candidate is simply out of step with the zeitgeist? Right now, I’d say, Kamala Harris is benefiting from the beginning of a cultural shift and is beginning to have the cultural winds at her back. Donald Trump is beginning to be slapped in the face by those winds. Trump emerged in the 1970s and 1980s. It was the tail end of the culture of narcissism, or what Tom Wolfe called the Me Decade. It was the era of the unchained self — self-esteem, self-expression, self-promotion. In the ’80s, especially in Manhattan, there was an unabashed fascination with wealth, self-display, ego, the lifestyles of the rich and famous. Trump was the cartoon epitome of all that decade’s extravagances. The Trump Tower on Fifth Avenue opened to the public on Feb. 14, 1983, with all its gild and glitz. His book “The Art of the Deal” came out in 1987, with its braying and panting over money, money, money. In that cultural moment, gold-plated narcissism made Trump a celebrity.","summary":"People can be bitter for only so long. Harris’s happy strength may offer a glimpse of a sunnier national mood to come.","url":"https://www.nytimes.com/2024/09/12/opinion/trump-harris-joy.html","image":"https://static01.nyt.com/images/2024/09/13/multimedia/12brooks2-cqtl/12brooks2-cqtl-facebookJumbo.jpg","video":null,"publish_date":"2024-09-12 23:00:10","author":"David Brooks","authors":["David Brooks"],"language":"en","catgory":"entertainment","source_country":"us","sentiment":0.33},{"id":256292880,"title":"The US is preparing criminal charges in Iran hack targeting Trump, AP sources say","text":"WASHINGTON (AP) — The Justice Department is preparing criminal charges in connection with an Iranian hack that targeted Donald Trump's presidential campaign in a bid to shape the outcome of the November election, two people familiar with the matter said Thursday. It was not immediately clear when the charges might be announced or whom precisely they will target, but they are the result of an FBI investigation into an intrusion that investigators across multiple agencies quickly linked to an Iranian effort to influence American politics. The prospect of criminal charges comes as the Justice Department has raised alarms about aggressive efforts by countries including Russia and Iran to meddle in the presidential election between Trump and Democratic nominee Kamala Harris, including by hacking and covert social media campaigns designed to shape public opinion. Iran “is making a greater effort to influence this year’s election than it has in prior election cycles and that Iranian activity is growing increasingly aggressive as this election nears,” Assistant Attorney General Matthew Olsen, the Justice Department's top national security official, said in a speech Thursday in New York City. “Iran perceives this year’s elections to be particularly consequential in impacting Iran’s national security interests, increasing Tehran’s inclination to try to shape the outcome,\" he added. The Trump campaign disclosed on Aug. 10 that it had been hacked and said Iranian actors had stolen and distributed sensitive internal documents. At least three news outlets — Politico, The New York Times and The Washington Post — were leaked confidential material from inside the Trump campaign. So far, each has refused to reveal any details about what it received. Politico reported that it began receiving emails on July 22 from an anonymous account. The source — an AOL email account identified only as “Robert” — passed along what appeared to be a research dossier that the campaign had apparently done on the Republican vice presidential nominee, Ohio Sen. JD Vance. The document was dated Feb. 23, almost five months before Trump selected Vance as his running mate. The FBI, the office of the Director of National Intelligence and the Cybersecurity and Infrastructure Security Agency subsequently blamed that hack, as well as an attempted breach of the Biden-Harris campaign, on Iran. Those agencies issued a statement saying that the hacking and similar activities were meant to sow discord, exploit divisions within American society and influence the outcome of elections. The statement did not identify whether Iran has a preferred candidate, though Tehran has long appeared determined to seek retaliation for a 2020 strike Trump ordered as president that killed an Iranian general. The two people who discussed the looming criminal charges spoke on condition of anonymity to The Associated Press because they were not authorized to speak publicly about a case that had not yet been unsealed. The Washington Post first reported that charges were being prepared. Justice Department officials have been working to publicly call out and counter election interference efforts. The response is a contrast to 2016, when Obama administration officials were far more circumspect about Russian interference they were watching that was designed to boost Trump's campaign. “We have learned that transparency about what we are seeing is critical,” Olsen, the Justice Department official, said Thursday. “It helps ensure that our citizens are aware of the attempts of foreign government to sow discord and spread falsehoods — all of which promotes resilience within our electorate,” he added. “It provides warnings to our private sector so they can better protect their networks. And it sends an unmistakable message to our adversaries — we’ve gained insight into your networks, we know what you’re doing, and we are determined to hold you accountable.” Last week, in an effort to combat disinformation ahead of the election, the Justice Department charged two employees of RT, a Russian state media company, with covertly funneling a Tennessee-based content creation company nearly $10 million to publish English-language videos on social media platforms with messages in favor of the Russia government’s interests and agenda.","summary":"WASHINGTON (AP) — The Justice Department is preparing criminal charges in connection with an Iranian hack that targeted Donald Trump&apos;s presidential campaign in a bid to shape the outcome of the November election, two people familiar with the matter...","url":"https://nation.lk/online/the-us-is-preparing-criminal-charges-in-iran-hack-targeting-trump-ap-sources-say-276860.html","image":"https://www.newsnationnow.com/wp-content/uploads/sites/108/2024/09/66e371bbd72e63.34629525.jpeg?w=900","video":null,"publish_date":"2024-09-12 23:00:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.277},{"id":256295198,"title":"Kamala lied, babies died: The ugly truth about her stance on abortion","text":"If there’s one topic that lights a fire behind Kamala Harris’ eyes, it’s abortion. And that was made crystal clear in the first presidential debate between Harris and former President Donald Trump on Tuesday night. “I think her strongest moment was when she started talking about abortion. Abortion is what animates her. Abortion is — I don’t think that this is an exaggeration to say — what she loves. It is what she has built her career on,” Allie Beth Stuckey of “Relatable” says. Kamala supports abortion through all nine months of pregnancy, for any reason, and paid for by the taxpayer. She also endorses overturning the Hyde Amendment, which protects American citizens’ tax dollars from funding abortions. “She explicitly supports overturning the Hyde Amendment to force you, Christian pro-lifer, to fund the slaughtering of unborn children,” Stuckey comments, noting that she also voted against the Born Alive Survivors Protection Act when she was a senator in 2019. The Born Alive Survivors Protection Act was created to protect babies who survive abortion outside the womb. Kamala reportedly called it “radical.” During the debate, Trump called out Kamala for her views on abortion, pointing out that she supports abortion in the ninth month and “execution after birth.” While Kamala and her supporters have been laughing in response to Trump’s criticism and pretending it isn’t true, it is, quite unfortunately, true. “She really does not believe in any limitations,” Stuckey comments, again referring to her vote against “protecting babies who survive abortions from execution.” The debate moderators continuously “fact-checked” Trump throughout the debate, while letting Kamala spew her lies, even lying for her at times. At one point, David Muir claimed there was no state where it’s legal to kill a baby after it’s born, but that’s not true. “Data from the Minnesota Department of Health shows that at least eight babies who survived abortions in the state were left to die between 2019 and 2021,” Stuckey explains. Kamala’s VP pick, Tim Walz, signed the Protect Reproductive Options Act in January 2023, which repealed the state's Born Alive Infant Protection Act. The Protect Reproductive Options Act also essentially prohibited any restrictions on abortion, including gestational age limits. The bill also removed the requirement for abortion providers to report cases in which infants survive abortion attempts. “We are talking about babies outside of the womb,” Stuckey says, disturbed. “Tim Walz and Kamala Harris believe that they should have no right to health care, that they should be left to die.” Want more from Allie Beth Stuckey? To enjoy more of Allie’s upbeat and in-depth coverage of culture, news, and theology from a Christian, conservative perspective, subscribe to BlazeTV — the largest multi-platform network of voices who love America, defend the Constitution, and live the American dream.","summary":"If there’s one topic that lights a fire behind Kamala Harris’ eyes, it’s abortion. And that was made crystal clear in the first presidential debate between Harris and former President Donald Trump on Tuesday night.\n\n\n\n\t“I think her strongest moment was when she started talking about abortion. Abortion is what animates her. Abortion is — I don’t think that this is an exaggeration to say — what she loves. It is what she has built her career on,” Allie Beth Stuckey of “Relatable” says.\n\n\n\n\tKamala supports abortion through all nine months of pregnancy, for any reason, and paid for by the taxpayer. She also endorses overturning the Hyde Amendment, which protects American citizens’ tax dollars from funding abortions.\n\n\n\n\t“She explicitly supports overturning the Hyde Amendment to force you, Christian pro-lifer, to fund the slaughtering of unborn children,” Stuckey comments, noting that she also voted against the Born Alive Survivors Protection Act when she was a senator in 2019.\n\n\n\n\tThe Born Alive Survivors Protecti","url":"https://www.theblaze.com/shows/relatable/abortion-kamala-harris","image":"https://www.theblaze.com/media-library/image.jpg?id=53621159&width=1200&height=600&coordinates=0%2C0%2C0%2C120","video":null,"publish_date":"2024-09-12 23:00:00","author":"BlazeTV Staff","authors":["BlazeTV Staff"],"language":"en","source_country":"US","sentiment":-0.262},{"id":256293114,"title":"‘The Simpsons’ Star Hank Azaria Imagines Chief Wiggum Investigating Cats, Dogs Being Eaten in Springfield | Video","text":"“The Simpsons” star Hank Azaria is hopping on the train mocking Donald Trump’s debate soundbite about cats and dogs being eaten. Trump’s first major blowup in Tuesday night’s presidential debate with Kamala Harris came when he exclaimed that immigrants in Springfield, Ohio, were eating neighborhood pets. “In Springfield, they’re eating the dogs, the people that came in,” Trump said. “They’re eating the cats. They’re eating the pets of the people that live there. This is what’s happening in our country, and it’s a shame.” In response, Azaria took to social media on Thursday with a video of himself doing one of the many voices he contributes to “The Simpsons” — Chief Wiggum taking a call about a similar issue happening in their fictional Springfield. “Springfield Police, Chief Clancy Wiggum speaking. How can I help you?” Azaria says, slipping into character. “People are eating dogs? Wait a minute, hot dogs? Oh cats. Mr. Katz is eating hot dogs? No? People are eating dogs and cats. People are eating dogs and cats in Springfield? Are they good?” Azaria’s joke is far from the first to be made after the debate moment. See more instances, below: This wasn’t even the only meme-able moment to come from Trump during the debate. When asked if he had a plan in place for health care, he responded, “I have the concepts of a plan and you will be hearing more in the near future.” Viewers also took that and ran with it, posting the quote under people like “Game of Thrones” author George R.R. Martin, Cousin Greg from “Succession” and more.","summary":"“Are they hot dogs?” the voice actor asks as his confused cop gets to the bottom of Trump’s widely mocked debate moment\n\n\nThe post ‘The Simpsons’ Star Hank Azaria Imagines Chief Wiggum Investigating Cats, Dogs Being Eaten in Springfield | Video appeared first on TheWrap.","url":"https://www.thewrap.com/hank-azaria-the-simpsons-chief-wiggum-trump-eating-dogs-cats/","image":"https://www.thewrap.com/wp-content/uploads/2023/05/hank-azaria.jpg","video":null,"publish_date":"2024-09-12 22:57:29","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","source_country":"US","sentiment":0.098},{"id":256292648,"title":"Government censorship is a greater threat than ‘disinformation’","text":"“Disinformation” is once again in the news. On one side are people who say that if something sounds like a fake news story and smells like a fake news story then it is indeed a fake news story. On the other side are people who say that if it looks like a duck, walks like a duck and quacks like a duck then it’s probably already been eaten by a Haitian immigrant. Who to believe? In any normal period it would be fairly easy to work out what is going on. In a story like the one from Springfield, Ohio, people make claims, the media investigates them and then everyone decides who they believe. But who can you believe today? Over recent days a lot of effort has once again gone in to highlighting the problem of online “misinformation.” This week the Australian government threatened to fine social media companies that “enable misinformation.” Under proposed new laws the Australian government could fine internet platforms up to 5% of their global revenues if the companies fail to stop the spread of such material. They would particularly chase after platforms that failed to crack down on stories that hurt election integrity or public health. The decisions over who is guilty of this would be made by an Australian regulator which would set up its own standards and fine companies for non-cooperation. Personally, I’m not certain that the Australian government has thought this through. And not just because it’s unclear how they expect to collect the loot from social media companies over whom they have stood as judge, jury and executioner. Will they ask them to send a wire transfer? Or would they like the money to be handed over by check? Perhaps they didn´t notice the mess caused when other governments tried to tread into this area. In 2022 the Biden administration set up its “Disinformation Governance Board.” It was launched by Secretary Mayorkas’ Department of Homeland Security and was led by one Nina Jankowicz. Remember her? She was famous for about 15 minutes after being appointed, when embarrassing videos of her singing surfaced online. Surprisingly, for several months Mary Poppins was technically the person tasked with deciding what was true or untrue in the whole of the United States and cyberspace. Unsurprisingly, she couldn’t perform the job and the “Disinformation Governance Board” was disbanded after a few months. To be fair to Jankowicz, it wasn’t her fault. Because it wasn’t just that she wasn’t up to the job. The point is that nobody could be. Other governments have gone in harder and faster. Last month the government of Brazil banned the platform X (formerly Twitter) for allegedly spreading disinformation. Like the American and Australian governments, you have to almost coo at the sight of the Brazilian government complaining about fake news. One reason why we shouldn’t allow governments to make decisions over what is true and what is not is that they aren’t very good at it. Remember that these are the same authorities who spent recent years making claims that were completely untrue. As well as stopping people saying things that turned out to be very true indeed. For example, readers might remember the summer of 2021, when Anthony Fauci went on TikTok to urge people to get vaccinated. In an interview with TikTok star Mia Finney, Dr. Fauci said, “If you get COVID, recover and then get vaccinated, your level of protection will be extremely high. The (US Centers for Disease Control and Prevention) still recommends that even though you’ve been infected that you should get vaccinated for the extra degree of protection.” That turned out to be what we used to call “untrue.” But I have never seen any of these “disinformation experts” call for the censoring or fining of Dr. Fauci. It is even worse in Australia. Having been the world’s worst lockdown zealots during COVID, Australian officials got away with saying the craziest things. As premier of Victoria, Dan Andrews, seemed to relish every restriction he could force on the Australian public. At one point in the COVID era he got frustrated that as restrictions lifted his power was waning. He discovered that some Australians had the gall to drink beer outside. For shame! Andrews was furious that the public would dare to have a bevy – even when socially distanced – and in one news conference furiously told the Australian public that it wasn´t enough for them to lift their masks between sips. According to him, if a person was so selfish as to have a beer on their own or with others outdoors then they should drink their beer through a facemask. In other words it is entirely reasonable that any person should be skeptical that the Australian authorities – anymore than the Americans or Brazilians – can actually police what is true and what is not. Let alone worldwide. There is absolutely no evidence that they can manage it. Government misleads the public all the time. As do some portions of the press and media. At one end of this are outright lies. At another there is what you might call an “approved narrative.” For example, just in the last few weeks we have seen the Democrats pretend that Kamala Harris never had any oversight on the southern border. Is that disinformation? I should say so. But would you want the government of Australia, Brazil or anywhere else decide that for us? Of course not. The American public can decide that for ourselves. Exposing the ‘anti-racist’ con artists I’ve just watched Matt Walsh’s new documentary film, “Am I Racist?” The creator of “What is a Woman?” is back with another amazing expose. This time taking on the “anti-racism” industry. Through speaking to a range of completely inexpert experts Walsh not only makes a serious point about the only acceptable racism in our day. He also makes for a lot of laughs along the way. Not least against the queen of this sinister hustle – “author” Robin DiAngelo. She seems to have erased her social media since the film came out this week. A great example of light – and laughter – being the best disinfectant.","summary":"Over recent days a lot of effort has once again gone in to highlighting the problem of online “misinformation.”","url":"https://nypost.com/2024/09/12/opinion/government-censorship-is-a-greater-threat-than-disinformation/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/mural-adorns-wall-city-springfield-89487436.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-09-12 22:56:26","author":"Douglas Murray","authors":["Douglas Murray"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.468},{"id":256292970,"title":"Why a Georgia judge dropped 2 criminal counts against Trump","text":"Why a Georgia judge dropped 2 criminal counts against Trump On Thursday, a judge dismissed two criminal counts against former President Donald Trump in the Georgia 2020 election case. Plus, Vice President Kamala Harris and Trump returned to the campaign trail for the first time since Tuesday's debate. CBS News' Nikole Killion, Nancy Cordes and Caitlin Huey-Burns have the latest.","summary":"On Thursday, a judge dismissed two criminal counts against former President Donald Trump in the Georgia 2020 election case. Plus, Vice President Kamala Harris and Trump returned to the campaign trail for the first time since Tuesday's debate. CBS News' Nikole Killion, Nancy Cordes and Caitlin Huey-Burns have the latest.","url":"https://www.cbsnews.com/video/why-georgia-judge-dropped-2-counts-against-trump/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/12/17858c7d-68f5-48c1-83c9-5708c0abbd65/thumbnail/1200x630/25fb804f89ee5b96e357d14015cb7dfd/cbsn-fusion-why-georgia-judge-dropped-2-counts-against-trump-thumbnail.jpg?v=d2d77bee90bcafa285fd6d60bd8b3612","video":null,"publish_date":"2024-09-12 22:54:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.047},{"id":256292848,"title":"An Alaska Airlines plane aborts takeoff to avoid hitting a Southwest Airlines aircraft","text":"CTVNews.ca Top Stories 2 dead, third in critical condition after attack in Kingston, Ont., suspect arrested Two people are dead and a third suffered life-threatening injuries following an attack at an encampment in Kingston, Ont. Thursday. A suspect has been arrested following a multi-hour standoff. B.C. will scrap carbon tax if feds remove requirement: Eby British Columbia’s premier says the province will end the consumer carbon tax if the federal government removes the legal requirement to have one. Trump rules out another debate against Harris as her campaign announces US$47M haul in hours afterward Donald Trump on Thursday ruled out another presidential debate against Kamala Harris as her campaign announced a massive fundraising haul in the hours after the two candidates met on stage. TIFF pauses screenings of documentary about Russian soldiers due to 'significant threats' The Toronto Film Festival says it has been forced to pause the screenings of a documentary about Russian soldiers this weekend, citing 'significant threats to festival operations and public safety.' 'Keep your bags packed': Consul general grilled over $9M NYC condo purchase After weeks of pressure, Canada's consul general Tom Clark is testifying on Thursday before a House of Commons committee about the purchase of his new official residence in New York that generated a lot of political attention over the summer. Georgia judge dismisses two criminal counts against Trump, court filing shows A Georgia judge on Thursday dismissed two criminal counts in the U.S. state's 2020 election interference case against Republican presidential candidate Donald Trump and one other count against allies of the former president. Family of Sikh man speaks out against Toronto-area hospital after beard shaved The family of a Sikh man from Brampton is seeking an apology, an explanation, and a promise to do better from the local hospital network after they say the facial hair of their loved one was removed without their consent. This Italian lawyer says he thought he was buying a regular print of Churchill, not the 'mythical' stolen portrait When Nicola Cassinelli, Italian lawyer and occasional art collector, bid on a portrait of the late U.K. prime minister Winston Churchill, he says, he didn't know it would land him in the centre of an international criminal investigation. NEW NEW | N.B. premier’s asylum seeker comments spark controversy Claims from New Brunswick Premier Blaine Higgs that Ottawa wants to force the province to take in 4,600 asylum seekers are \"largely fictitious,\" says federal Immigration Minister Marc Miller. Canada B.C. will scrap carbon tax if feds remove requirement: Eby British Columbia’s premier says the province will end the consumer carbon tax if the federal government removes the legal requirement to have one. 'Low property taxes, friendly neighbours': How some Manitoba communities are selling small-town living Amid a struggle to attract new growth to rural Manitoba, some communities are finding creative ways to sell Manitobans on small-town living. This Italian lawyer says he thought he was buying a regular print of Churchill, not the 'mythical' stolen portrait When Nicola Cassinelli, Italian lawyer and occasional art collector, bid on a portrait of the late U.K. prime minister Winston Churchill, he says, he didn't know it would land him in the centre of an international criminal investigation. Family of Sikh man speaks out against Toronto-area hospital after beard shaved The family of a Sikh man from Brampton is seeking an apology, an explanation, and a promise to do better from the local hospital network after they say the facial hair of their loved one was removed without their consent. Documents show dozens of harassment, violence cases at CSIS. It deemed only 8 founded When Canada's spy chief wrote a secret letter to the public safety minister last December — the week after a report emerged that two young women in the service had been sexually assaulted by a senior colleague — it came with a warning. Police investigating 'targeted' triple homicide in Lloydminster, Sask. Police in Lloydminster have confirmed they are investigating a triple homicide in the border city. World AP sources: Justice Department, FBI preparing criminal charges in Iran hack targeting Trump campaign The Justice Department is preparing criminal charges in connection with an Iranian hack that targeted Donald Trump's presidential campaign, two people familiar with the matter said Thursday. An Alaska Airlines plane aborts takeoff to avoid hitting a Southwest Airlines aircraft An Alaska Airlines flight that had been cleared for takeoff in Nashville, Tennessee, was forced to abort Thursday to avoid colliding with a taxiing Southwest Airlines plane, authorities said. No injuries were reported. Officers who beat Tyre Nichols didn't follow police training, lieutenant testifies Three former officers charged in the beating death of Tyre Nichols did not comply with Memphis Police Department training policies when they punched, kicked and hit the 29-year-old motorist after a January 2023 traffic stop, a police lieutenant testified Thursday. Georgia judge dismisses two criminal counts against Trump, court filing shows A Georgia judge on Thursday dismissed two criminal counts in the U.S. state's 2020 election interference case against Republican presidential candidate Donald Trump and one other count against allies of the former president. Ukraine says Russia has started a counteroffensive in its Kursk border region Russia has launched a counteroffensive in its Kursk region to dislodge Ukraine's forces who stormed across the border five weeks ago and put Russian territory under foreign occupation for the first time since World War II, Ukraine's president said Thursday. Harvey Weinstein indicted on additional sex crimes charges ahead of New York retrial Disgraced ex-movie mogul Harvey Weinstein has been indicted on additional sex crimes charges in New York ahead of a retrial in his landmark #MeToo case, Manhattan prosecutors said at a court hearing Thursday. Politics Singh says NDP drafting climate plan, won't say if it'll include consumer carbon tax NDP Leader Jagmeet Singh won't say whether he would keep the consumer carbon price if his party forms government after the next election. Ottawa loses bid to quash Israel advocates' lawsuit calling for halt to UNRWA funding The Federal Court has denied Ottawa's bid to quash a case in which advocates for Israel are asking for a reversal of Canada's temporary freeze on the main United Nations agency supporting Palestinians. 'All bets are off' when Parliament resumes, says NDP Leader Jagmeet Singh NDP Leader Jagmeet Singh says his team is focused on restoring Canadians' 'hope' but when it comes to the new minority dynamics in Parliament, 'all bets are off.' Health Young people report worsening mental health, especially girls: survey According to a survey conducted in both 2019 and 2023, mental health among adolescent girls has gotten worse as they've grown into young adults. Ottawa resident who tested positive for mosquito-borne virus dies, public health says An Ottawa resident who died of a viral encephalitis this summer tested positive for the mosquito-borne virus eastern equine encephalitis (EEEV), the first human case of the virus in Ottawa. Quebec woman wins MAID case to die at home after legal fight with landlord A woman who requested medical assistance in dying (MAID) won a major case in front of the Quebec rental board. She wanted to die at home, but her landlord didn't want her to. Sci-Tech SpaceX makes history with flashy new EVA spacesuits At 700 kilometres above Earth, Thursday’s historic SpaceX spacewalk took place higher than any previous NASA spacewalk, and featured cutting-edge technology. Sony unveils faster, more powerful PlayStation 5 Pro. And it comes with a price tag to match After years of speculation and hype, Sony will be launching an upgraded version of its popular PlayStation 5 at the console’s highest ever price. Billionaire steps out of SpaceX capsule for first private spacewalk hundreds of miles above Earth A billionaire kicked off the first private spacewalk Thursday, teaming up with SpaceX on the daring endeavour hundreds of miles above Earth. Entertainment TIFF pauses screenings of documentary about Russian soldiers due to 'significant threats' The Toronto Film Festival says it has been forced to pause the screenings of a documentary about Russian soldiers this weekend, citing 'significant threats to festival operations and public safety.' Taylor Swift wins big at MTV Video Music Awards, ties Beyonce's record and thanks Travis Kelce Taylor Swift's dominance continued at the MTV Video Music Awards, where she took home seven awards — including the night's biggest, the trophy for video of the year. TIFF goes 'Behind the Masks' with world premiere of Indigenous film Being on a red carpet is a dream for most. For Neil Diamond and Joanne Robertson, it has become a reality with the premiere of their film: So Surreal: Behind The Masks. Business Air Canada pushing for government intervention as clock ticks on labour talks Air Canada and business leaders are asking Ottawa to be ready to intervene in the airline's labour talks with its pilots with time running out before a potential shutdown, but so far the government has said the two sides need to work things out themselves. Canada Bread says Maple Leaf used it as 'shield' in bread price-fixing case Canada Bread is accusing Maple Leaf Foods of using it as a 'shield' to avoid liability in the alleged bread price-fixing scheme that's the subject of two class-action lawsuits and an ongoing Competition Bureau investigation. Sobeys parent company Empire reports $207.8M Q1 profit, sales up from year ago Empire Co. Ltd. says it earned $207.8 million in its latest quarter, down from $261 million a year ago as its sales edged higher. Lifestyle Waterloo, Ont. man with stage 4 cancer qualifies for Boston Marathon A Waterloo, Ont. man diagnosed with a rare and aggressive form of cancer continues to beat all odds. Cost of living troubles: Parents struggle as youth sports get more expensive As Canadians cope with rising costs in all corners of their lives, experts say kids' athletic programs are no exception, making it more difficult for families to keep their children active at an affordable price. Here's what you need to know about your rights ahead of a possible Air Canada strike, according to a passenger advocate While Air Canada has shared advice for travellers ahead of a possible pilots strike, an airline passenger rights advocate has more tips for Canadians who may be affected. Sports U.S. gymnast Jordan Chiles says 'the person I am' was taken from her during Olympic medal controversy An emotional Jordan Chiles opened up Wednesday about how the controversy surrounding her bronze medal in the women's artistic floor exercise at the 2024 Paris Games affected her, saying the process took away \"the person I am.\" 'A feather in our cap': 'Field of Dreams' recreated in Manitoba A hamlet with a population of fewer than 70 residents has successfully brought people back in time to 1989 - the setting, a ‘Field of Dreams’ carved out of cornfields. Tyreek Hill says he could have handled his traffic stop better but he still wants the officer fired Miami Dolphins wide receiver Tyreek Hill acknowledged Wednesday that he could have handled himself better in the initial moments of a weekend traffic stop that left him handcuffed and pulled out of his car by police officers near the team's stadium. Autos Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. Police nab driver speeding at nearly 3x the limit in Vancouver school zone Nearly two-dozen drivers were caught in a speed trap outside a Vancouver elementary school on Thursday – as students were settling back into their daily routines. Volvo Cars revamps SUV hybrid as it shifts plans away from pure electric Volvo Cars said on Wednesday that plug-in hybrids would continue to be a critical part of its profit growth plans over the next few years and that it would revamp its XC90 hybrid sports utility vehicle. Local Spotlight Inside a Manitoba ghost town, a group of ladies works to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. Langenburg UFO sighting commemorated with silver coin Perhaps Saskatchewan's most famous encounter with Unidentified Aerial Phenomenon (UAP/UFO) – \"The Langenburg Event\" is now being immortalized in the form of a collector's coin. 'She would be furious this is how her life ended': Mother of woman killed in crash with suspected impaired driver speaks out It's been 420 days since 22-year-old Abbey Bickell was killed in a car crash in Burnaby, a stretch full of heartbreak for her family as they not only grieved her death, but anxiously waited for progress in the police investigation. Wednesday, they finally got some good news. Ontario woman charged with assault with a weapon after neighbour sprayed with water gun A Simcoe, Ont. woman has been charged with assault with a weapon after spraying her neighbour with a water gun. 'I've cried a lot of tears': Floating home dreams sink for southwestern Ontario residents The dream of a life on water has drowned in a sea of sadness for a group of Chatham-Kent, Ont. residents who paid a Wallaceburg-based company for a floating home they never received. Buyers say they lost life savings to a Saskatchewan company selling luxury vacation condos In 2022, Tanya Frisk-Welburn and her husband bought what they hoped would be a dream home in Mexico. 'I'm so proud that we could do 100 years': Family-owned N.S. business marks milestone in menswear Mansour’s Menswear in Amherst, N.S., is celebrating its 100th anniversary this month Video shows tornado moving ashore in northern Ontario A beautiful Labour Day weekend at the lake was interrupted by some extreme weather when a tornado touched down in northern Ontario. 'Beautiful in its own way': New forest emerges in Jasper National Park, bringing protection and new opportunities Charred stumps and the remains of fire-ravaged trees still cover large tracts of land on the Jasper landscape, but life is returning quickly down below. Vancouver B.C. will scrap carbon tax if feds remove requirement: Eby British Columbia’s premier says the province will end the consumer carbon tax if the federal government removes the legal requirement to have one. Vancouver officially launches shared electric scooter program Electric scooters are now available for rent in two neighbourhoods in East Vancouver. The micro-mobility company Lime has rolled out 100 e-scooters along with 27 parking stations. Harbour Air suspends service between Vancouver, Sunshine Coast, Vancouver Island, citing low demand Seaplane operator Harbour Air says it is cancelling one of its routes between Vancouver and Vancouver Island, and temporarily suspending some flights to the Sunshine Coast, due to decreasing ticket sales. Toronto Chow says Toronto’s traffic congestion plan is working, acknowledges more could have been done sooner Mayor Olivia Chow said Thursday that new data show Toronto’s congestion management plan is working to reduce gridlock, with recent travel times for drivers and transit riders showing improvement in some of the most congested parts of the downtown core. TIFF pauses screenings of documentary about Russian soldiers due to 'significant threats' The Toronto Film Festival says it has been forced to pause the screenings of a documentary about Russian soldiers this weekend, citing 'significant threats to festival operations and public safety.' LifeLabs workers in GTA poised to strike if deal not reached by Saturday LifeLabs workers in the Greater Toronto Area could soon walk off the job if a deal isn’t reached with their employer. Calgary Teen charged in relation to residential fire in Riverbend, police continue search for second suspect One teen has been charged and police are searching for a second suspect in relation to a number of fires that took place in Riverbend in late August. Calgary pipeline repairs to be complete by this weekend Calgary Mayor Jyoti Gondek says construction work has been going well and is expected to be wrapped up by this weekend, with restrictions being lifted by Sept. 22. 'The hardest thing is to find a diagnosis': Calgary woman speaks out about neurological condition A Calgary woman is spreading the word about an often misdiagnosed ailment, because of her own struggles with the neurological condition. Ottawa 2 dead, third in critical condition after attack in Kingston, Ont., suspect arrested Two people are dead and a third suffered life-threatening injuries following an attack at an encampment in Kingston, Ont. Thursday. A suspect has been arrested following a multi-hour standoff. Ottawa resident who tested positive for mosquito-borne virus dies, public health says An Ottawa resident who died of a viral encephalitis this summer tested positive for the mosquito-borne virus eastern equine encephalitis (EEEV), the first human case of the virus in Ottawa. 'Buy Local': PSAC changes shopping message amid backlash for asking workers to boycott downtown Ottawa businesses A federal public service union is now encouraging its members to \"buy local\" and support neighbourhood businesses, one day after a social media post suggested federal workers boycott downtown businesses in an apparent retaliation for the return-to-office mandate. Montreal Quebec legislature adopts motion ensuring no eligibility certificates needed to receive health care in English A motion declaring that Quebecers are not required to present certificates of eligibility to receive health care in English was unanimously adopted by the National Assembly on Thursday. Parents outraged after homeless man allegedly spits on a 3-year-old near daycare Some parents in the Hochelaga-Maisonneuve borough are worried after a homeless man allegedly attacked a 3-year-old child while he was on his way to daycare located next to a homeless shelter. Quebec MNA Youri Chassin leaves the CAQ ship In another blow for the Coalition Avenir Québec (CAQ), Saint-Jérôme MNA Youri Chassin is leaving the party just hours after publishing an open letter criticizing his own government. Edmonton Police investigating 'targeted' triple homicide in Lloydminster, Sask. Police in Lloydminster have confirmed they are investigating a triple homicide in the border city. Edmonton police seize more than $1.2M in street drugs after months-long investigation The Edmonton Police Service says more than 66 kilograms of drugs have been seized in a large-scale drug investigation in central Edmonton that started in December. New Stollery play areas offers fresh air and new experiences for kids undergoing care The Stollery Children's Hospital opened its newly renovated play area on Thursday, including the hospital's first outdoor space. Atlantic NEW NEW | N.B. premier’s asylum seeker comments spark controversy Claims from New Brunswick Premier Blaine Higgs that Ottawa wants to force the province to take in 4,600 asylum seekers are \"largely fictitious,\" says federal Immigration Minister Marc Miller. Driver, 15, dies after crashing into power pole, tree in Stellarton, N.S. A 15-year-old has died after a single-vehicle collision in Stellarton, N.S., early Thursday morning. Tidal power junk: N.S. village wants huge, abandoned moorings moved from fishing area Residents of a small Nova Scotia community are worried about who will remove four concrete-filled boxcars sitting in their harbour after a tidal power firm collapsed. Winnipeg 'Low property taxes, friendly neighbours': How some Manitoba communities are selling small-town living Amid a struggle to attract new growth to rural Manitoba, some communities are finding creative ways to sell Manitobans on small-town living. Three new options unveiled for new Manitoba health cards Premier Wab Kinew posted on Instagram Thursday asking for opinions on three draft designs for the new health cards. Man charged after multiple child sex dolls seized from home: Winnipeg police A Winnipeg man has been charged with multiple offences after sex dolls designed to look like children were seized from his home. Regina 'Can be a real struggle': Veterinary shortage in Sask. particularly felt by exotic pet owners As Saskatchewan is facing a shortage of veterinarians, owners of exotic pets are in a particularly tricky situation if their animal needs care. Councillor Lori Bresciani to make 'major announcement' on upcoming election Councillor Lori Bresciani will make a major announcement regarding her involvement in Regina's upcoming municipal election. Sask. Entertainment Expo postponed to 2025 due to health concerns This year’s edition of the Saskatchewan Entertainment Expo has been postponed until 2025. Kitchener Early apple harvest for farmers in Region of Waterloo Apple trees are already being harvested at the Martin's Family Fruit Farm in Waterloo, Ont., at least one week ahead of their typical schedule. Waterloo, Ont. man with stage 4 cancer qualifies for Boston Marathon A Waterloo, Ont. man diagnosed with a rare and aggressive form of cancer continues to beat all odds. More kids facing food insecurity than ever before, say experts Local organizations say the number of kids experiencing food insecurity has risen in Waterloo Region. Saskatoon Saskatoon police ask board to green light 31 new positions after infusion of provincial cash The Saskatoon Police Service (SPS) is asking its board to green light 31 new full-time positions, after the province committed to permanently fund a host of new officers last week. Saskatoon Tribal Council shelter will face cuts after new proposed shelter opens: province The proposed downtown location for the city’s newest homeless shelter is drawing criticism from the chief of the Saskatoon Tribal Council (STC), which runs the city’s largest emergency shelter. Saskatoon police investigating death following garage fire Saskatoon Police Service (SPS) is investigating after a person was found dead following a fire early Thursday morning. Northern Ontario Greater Sudbury's encampment population has doubled in a year More tents are going up in Energy Court at an encampment near the former safe consumption site trailer. 2 dead, third in critical condition after attack in Kingston, Ont., suspect arrested Two people are dead and a third suffered life-threatening injuries following an attack at an encampment in Kingston, Ont. Thursday. A suspect has been arrested following a multi-hour standoff. Timmins councillor urges leaders to 'better engage with the community' over health hub location Sources tell CTV News that the Cochrane District Services Board now owns the Ramada Inn on Riverside Drive and is working with a number of groups to create a Health Wellness Centre of Excellence. London TVDSB releases expenses for off-site retreat to Toronto More details have been released on the expenses associated with TVDSB's off-site planning meeting in Toronto. Pedestrian fighting for life in hospital after overnight crash near Western A pedestrian is in hospital with life-threatening injuries after a violent two car crash near the Western University gates on Richmond Street north early Thursday morning. Survivor winner training to become a doctor in London, Ont. A Canadian winner of the reality series Survivor is spending part of her $1 million U.S. paycheck to train to become a doctor in London, Ont. Barrie Ont. police officer's spouse charged in historical sexual assault case involving a child CTV News is learning more about disturbing allegations of sexual assault from 14 years ago in Beeton involving the husband of a Peel Regional police officer. House fire in Barrie displaces residents, cause under investigation Emergency crews battled heavy smoke and flames after a fire broke out in a garage at a Barrie home Thursday afternoon. Guns & high capacity magazines seized, teens arrested after threats against Collingwood, Ont. school Ontario Provincial Police (OPP) officers investigating a threat made against a Simcoe County school arrested two young men and seized several weapons. Windsor Chatham-Kent moving forward with tiny transitional cabins as number of homeless encampments grows $3.8 million in funding has been approved by Chatham-Kent Council to see 50 tiny transitional cabins built on Chatham's east side. Crash between car and tractor trailer kills two people Around 1 p.m. on Wednesday, OPP, fire and EMS responded to a crash between a tractor trailer and a passenger vehicle, at the intersection of Inwood Road and Courtright Line in Brooke-Alvinston. Could a Windsor resident win the record Lotto Max jackpot? Here are the odds: Some Windsor lotto players are likely hoping for a historic $75 million win this Friday. Vancouver Island B.C. will scrap carbon tax if feds remove requirement: Eby British Columbia’s premier says the province will end the consumer carbon tax if the federal government removes the legal requirement to have one. Harbour Air suspends service between Vancouver, Sunshine Coast, Vancouver Island, citing low demand Seaplane operator Harbour Air says it is cancelling one of its routes between Vancouver and Vancouver Island, and temporarily suspending some flights to the Sunshine Coast, due to decreasing ticket sales. Dry conditions mean increased wildfire risk in B.C. through the fall An expert with the BC Wildfire Service says relentless drought conditions for much of British Columbia sets the stage for more fire activity this fall. Kelowna Woman stabbed during daylight Kelowna home invasion: RCMP A woman suffered life-threatening injuries after being stabbed during a home invasion in Kelowna, according to authorities. Dog mauled to death in B.C. yard after 3 pit bulls jump fence: police A 12-year-old collie was killed by three pit bulls in the B.C. Interior Sunday morning, according to authorities. Suspect charged with 2nd-degree murder 1 year after Smithers, B.C., shooting Mounties in northwestern B.C. say they have arrested the suspect in a fatal shooting almost exactly a year after it occurred. Lethbridge Police operation near Vauxhall, Alta., ends: RCMP A police operation in near Vauxhall, Alta. has ended. 1 suspect in custody after break-in and violent assault of Lethbridge woman A man is in police custody with charges pending in relation to a break-in and violent assault of a woman earlier this week. Interfaith Food Bank puts out call for fresh vegetables, fruit and dairy as harvest season continues As harvest season continues in southern Alberta, the Interfaith Food Bank in Lethbridge is putting out an urgent call for fresh food and produce. Sault Ste. Marie Sault police respond to gun call Thursday Members of the public in Sault Ste. Marie are being asked to avoid Albert Street West as police deal with a developing situation. Thessalon mural tells the history of the community A visual history of the Town of Thessalon is taking shape, thanks to a mural being painted on the municipal officer created by a Sudbury artist Monique Legault. Incident on Sussex Road ends with arrest, Sault police say The Sault Ste. Marie Police Service say one person has been taken into custody following an incident on Sussex Road in the city. N.L. Newfoundland and Labrador monitoring rise in whooping cough cases: medical officer Newfoundland and Labrador's chief medical officer is monitoring the rise of whooping cough infections across the province as cases of the highly contagious disease continue to grow across Canada. Dispute over unrecognized Inuit group halts major conference for Canadian North A 16-year-old biennial event aimed at fostering business in the country's eastern Arctic and northern regions has been cancelled indefinitely as a dispute unfolds between Inuit in Canada and a Labrador group claiming to share their heritage. Cow cuddling: Why a Newfoundland farm is offering quality time with these 'gentle creatures' Jim Lester’s farm hopped on the cow-cuddling trend in early August, and his time slots have been pretty well sold out ever since. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks If You're On The Hunt For Comfortable And Stylish Boots, You'll Love These 13 Pairs School Has Officially Begun, And Here Are A Few Essential Supplies That Won't Break The Bank 19 Fall Fashion Staples Worth Adding To Your Wardrobe Home These Silk & Snow Sheets Stopped Me And My Partner from Arguing Over Bedding (And They're On Sale Right Now) The 5 Best Toaster Ovens In Canada In 2024, Tested and Reviewed 15 Useful Products For Your Workspace That'll Make You Think \"I Need That\" Gifts 18 Top-Notch Presents And Gift Add-Ons That Anyone Would Love To Receive 15 Of The Best Gifts To Give A One-Year-Old For Their First Birthday 20 Of The Best Gifts For People Who Travel A Lot Beauty These 12 Setting Sprays Will Actually Keep Your Makeup From Budging The Best Foundations For People With Mature Skin, According To Reviewers If You Want To Keep Your Summer Glow, Here Are A Few Products You'll Want To Add To Your Cart Deals From Anthropologie To Amazon: Here Are The Best Deals You'll Find Online This Weekend Beauty Week Has Officially Begun On Amazon Canada — Here Are The Best Deals You Can Find Here Are All The Best Labour Day Weekend Sales To Shop In Canada Stay Connected","summary":"An Alaska Airlines flight that had been cleared for takeoff in Nashville, Tennessee, was forced to abort Thursday to avoid colliding with a taxiing Southwest Airlines plane, authorities said. No injuries were reported.","url":"https://www.ctvnews.ca/world/an-alaska-airlines-plane-aborts-takeoff-to-avoid-hitting-a-southwest-airlines-aircraft-1.7036231","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/9/12/nashville-airport-1-7036237-1726181439692.jpg","video":null,"publish_date":"2024-09-12 22:51:28","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"ca","sentiment":0.057},{"id":256292654,"title":"Germany responds to Donald Trump's debate comments","text":"Germany is denying an assertion made by former President Donald Trump during the presidential debate Tuesday about the country's renewable energy industry. \"You believe in things like we're not going to frack, we're not going to take fossil fuel, we're not going to do things that are going to be strong, whether you like it or not,\" Trump said in his debate against Vice President Kamala Harris. \"Germany tried that, and within one year, they were back to building normal energy plants.\"But on Tuesday, Germany's Federal Foreign Office decided to issue a rebuttal, echoing the former president's language. \"Like it or not: Germany's energy system is fully operational, with more than 50% renewables,\" the Federal Foreign Office shared on X. \"And we are shutting down – not building – coal & nuclear plants. Coal will be off the grid by 2038 at the latest.\"The German Foreign Office also poked at Trump for another comment he made during the debate.\"PS: We also don't eat cats and dogs,\" it concluded, referring to Trump's debunked claim that Haitian migrants had eaten pets in Springfield, Ohio. The town's authorities have said that there have not been credible reports about migrants targeting pets.\"Contradiction with facts and humor — that is the right answer to disinformation,\" German State Minister Anna Lührmann added on Thursday about her government's response. \"As democrats, we can no longer allow ourselves to leave false statements uncommented.\"Climate change and energy policies are raised frequently during both candidates' election campaigns. Trump also claimed that if Harris wins the election, fracking in Pennsylvania \"will end on day one.\"\"Fossil fuel will be dead,\" Trump said. \"We'll go back to windmills, and we'll go back to solar.\"Before she became vice president, Harris, who was a senator representing California, pushed for climate-friendly policies. \"There's no question I'm in favor of banning fracking,\" Harris said in 2019. But as vice president, she has changed course.\"I have not banned fracking as vice president,\" Harris told Trump. \"My position is that we have got to invest in diverse sources of energy so we reduce our reliance on foreign oil.\"After Russia's invasion of Ukraine, energy costs in Germany have spiked as Berlin seeks alternatives to Russian energy. The United States exported over 200 million cubic feet of liquid natural gas to Germany last year. Russian natural gas volumes in the German energy market saw a 30% decline in 2022.\"Yes, Germany is serious about the energy transition,\" the German embassy in Washington said in a post on X. \"Our energy system is fully operational, with > 50% renewables. Coal will be off the grid by 2038 at the latest - while we're investing billions to create new opportunities in former coal regions.\"Germany shut down its last three nuclear power plants last year, as it plans to transition the majority of its energy consumption to renewable energy by 2050. But the country still needs \"additional measures\" to reach its climate targets, according to the German Environment Agency.As president, Trump criticized Berlin's energy policy for relying heavily on Russia. In 2019, he signed the Protecting Europe's Energy Security Act into law, which would sanction vessels participating in the construction of the Nord Stream 2, an undersea pipeline built by Russia's state-run energy giant Gazprom. In May 2021, the State Department waived previously imposed sanctions, but the waiver was terminated a day before Russia invaded Ukraine. In September 2022, a series of explosions, first detected by Scandinavian authorities off the Danish island of Bornholm, ruptured the pipeline. Last month, German prosecutors issued an arrest warrant for a Ukrainian national, whom they said had resided in Poland, but he had left the country.The U.S. denied any involvement in the attack and condemned the sabotage against the pipeline.During the debate, Trump still attacked the Biden administration over the pipeline. \"Why does Biden go in and kill the Keystone pipeline and approve the single biggest deal that Russia has ever made, Nord Stream 2? Because they're weak, and they're ineffective,\" Trump said, asking Harris about her administration's foreign policy.","summary":"Germany took to social media to rebut comments made by former President Donald Trump during the presidential debate​ Tuesday about the country's renewable energy industry.","url":"https://www.cbsnews.com/news/germany-responds-to-donald-trumps-debate-comments-on-energy-with-a-dash-of-sarcasm/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/09/11/a803cb5f-8e34-49fe-bfe9-e360b3623240/thumbnail/1200x630/0be990516b0845b687aecc1e98fe6ea5/cbsn-fusion-trump-defends-debate-comments-spin-room-thumbnail.jpg?v=d2d77bee90bcafa285fd6d60bd8b3612","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3187470_hls/master.m3u8","publish_date":"2024-09-12 22:50:53","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.031},{"id":256291718,"title":"Nate Silver's Warning on Kamala Harris' Post-Debate Gains","text":"Early polling has shown that Vice President Kamala Harris came out on top after her debate against Donald Trump, but pollster Nate Silver warns against reading \"too much\" into such numbers.Many commentators, including conservatives, have said that Harris was the winner of Tuesday's event in Philadelphia. The matchup may be the only time voters get to hear from both candidates on a debate stage, however. Trump said Thursday he is rejecting Harris' challenge for a second debate.Trump's campaign has said the former president gained a slight boost in his poll numbers after Tuesday, but several early polls found that viewers believed Harris outperformed him. The first national post-debate poll, released by Reuters/Ipsos on Thursday, also found Harris leading Trump among registered voters by 5 percentage points (47 percent to 42 percent).\"The first post-debate polls are in, and they helped Kamala Harris very slightly in our forecast—but we'd caution against reading too much into any of this data just yet,\" Silver wrote in his Thursday afternoon update of Silver Bulletin, a Substack publication.The pollster, who created the polling analysis site FiveThirtyEight, said that it \"takes several days to conduct a traditional poll\" and that the surveys that have come out so far after the debate have been conducted online or through automated telephone polling companies.\"Harris got a good number (+5 nationally) in an Ipsos poll, but that's generally been one of her stronger polls this cycle,\" Silver added. \"And Trump led by 2 points nationally in a Rasmussen Reports survey, but Rasmussen has a very strong GOP lean.\"Newsweek reached out to the Harris and Trump campaigns via email for comment.According to Silver's aggregate of national polling, Harris is leading Trump 48.7 percent to 46.8 percent on average. But Silver's model still gives Trump a higher chance of winning the necessary 270 Electoral College votes in November, with the former president projected to take critical battleground states like Arizona, Georgia, Pennsylvania, Nevada and North Carolina. The other closely watched swing states this fall, Wisconsin and Michigan, are a toss-up, according to Silver's predictions.Silver's model did give Harris a slight boost to her chances of winning after Tuesday's debate. But as of Thursday, the pollster projects Trump has a 60.6 percent chance of victory, while Harris has 39.2 percent.Silver said during an appearance on Maria Konnikova's podcast, Risky Business, on Thursday that he plans to vote for Harris in November. He also said he is trying to remain as nonpartisan as possible in his predictions.","summary":"Early polling shows that Harris came out on top after Tuesday's debate. But Silver says it is too early to be certain about her chances in November.","url":"https://www.newsweek.com/nate-silvers-warning-kamala-harris-post-debate-gains-1953226","image":"https://d.newsweek.com/en/full/2470442/nate-silvers-warning-harris-post-debate-gains.jpg","video":null,"publish_date":"2024-09-12 22:47:10","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","source_country":"us","sentiment":-0.028},{"id":256292158,"title":"Trump says he won't debate Harris again","text":"Trump says he won't debate Harris again At an event in North Carolina on Thursday, Vice President Kamala Harris challenged former President Donald Trump to another debate, saying the candidates \"owe it to the voters.\" Trump has since ruled out participating in another debate against the vice president. Molly Ball, senior political correspondent for The Wall Street Journal, and Fin Gómez, CBS News political director, join \"America Decides\" with analysis.","summary":"At an event in North Carolina on Thursday, Vice President Kamala Harris challenged former President Donald Trump to another debate, saying the candidates \"owe it to the voters.\" Trump has since ruled out participating in another debate against the vice president. Molly Ball, senior political correspondent for The Wall Street Journal, and Fin Gómez, CBS News political director, join \"America Decides\" with analysis.","url":"https://www.cbsnews.com/video/trump-says-he-wont-debate-harris-again/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/12/fe475f6a-cb56-47c8-b2a9-9448ff188281/thumbnail/1200x630/e7b7754085daf2a64b7853e5c03ca9b9/trump.jpg?v=d2d77bee90bcafa285fd6d60bd8b3612","video":null,"publish_date":"2024-09-12 22:47:03","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.297},{"id":256292694,"title":"GOP pollster: Trump won’t 'have enough time to recover' if he debates Harris again","text":"Repblican pollster Noelle Nikpour on Thursday explained why Donald Trump refusing to do another debate against Kamala Harris was the \"wisede decision\" to make. According to CBS News, the former president first made the announcement via Truth Social, declaring, \"THERE WILL BE NO THIRD DEBATE!\" The first debate took place in June, against President Joe Biden. Per the report, \"Later in the day, at a campaign stop in Tucson, Arizona, he said, 'Because we've done two debates and because they were successful, there will be no third debate. Too late anyway, the voting has already begun.'\" READ MORE: Trump faces increasing calls to participate in second debate Noting that Nikpour has spoken with big GOP donors, Fox News' Neil Cavuto asked, \"From a political standpoint, is it better in their mind that Donald Trump not debate again — that it might not be such a good idea? What do you think?\" The GOP pollster replied, \"A hundred percent on that. I think a lot of the donors — at least the ones that I was texting with the night of the debate — were not exactly thrilled about how that debate went down.\" Nikpour continued, \"What I will tell you, is that I think It was smart for Donald Trump not to do the debate. I think that was a good decision with the campaign. And I'll tell you why. Because depending on when that debate will be scheduled, and if he has another repeat performance like he did, I don't know if the campaign can recover that quickly. I don't think they have enough time to recover from that. We've got 54 days before the election. By the time the debate happens, you've got to have ads ready, and be able to respond to anything that would be negative. So I think not doing the debate was a wise decision.\" READ MORE: 'Nothing is off the table': Trump plans for 'bureaucratic bullying' of enemies if he wins Watch the video below or at this link.","summary":"Repblican pollster Noelle Nikpour on Thursday explained why Donald Trump refusing to do another debate against Kamala Harris was the \"wisede decision\" to make. \n\nAccording to CBS News, the former president first made the announcement via Truth Social, declaring, \"THERE WILL BE NO THIRD DEBATE!\" The first debate took place in June, against President Joe Biden. \n\nPer the report, \"Later in the day, at a campaign stop in Tucson, Arizona, he said, 'Because we've done two debates and because they were successful, there will be no third debate. Too late anyway, the voting has already begun.'\"\n\nREAD MORE: Trump faces increasing calls to participate in second debate\n\nNoting that Nikpour has spoken with big GOP donors, Fox News' Neil Cavuto asked, \"From a political standpoint, is it better in their mind that Donald Trump not debate again — that it might not be such a good idea? What do you think?\"\n\nThe GOP pollster replied, \"A hundred percent on that. I think a lot of the donors — at least the ones that I was texting w","url":"https://www.alternet.org/trump-second-harris-debate/","image":"https://www.alternet.org/media-library/image.png?id=53621571&width=1200&height=600&coordinates=0%2C38%2C0%2C180","video":null,"publish_date":"2024-09-12 22:40:27","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.333},{"id":256291626,"title":"Donald Trump says no more debates against Kamala Harris","text":"Polls show the two candidates in an extremely tight race with just two months to go before the election. During the 90-minute debate on Tuesday, Harris frequently rattled Trump with a string of personal attacks that put him on the defensive, including comments about the size of his rally crowds and his conduct during the 6 January 2021 riots at the US Capitol. A snap CNN poll of voters watching suggested that Harris performed better. Betting markets suggested the same. Trump and his supporters claimed that the two ABC journalists moderating the debate were unfair and biased in favour of Harris. “When a prize fighter loses a fight, the first words out of his mouth are ‘I want a rematch’,” Trump wrote. “Polls clearly show that I won the debate against comrade Kamala Harris, the Democrats’ radical left candidate, on Tuesday night, and she immediately called for a second debate,” he added. At a rally in Charlotte, North Carolina shortly after Trump’s announcement, Harris said that she and Trump “owe it to the voters to have another debate”. “This election and what is at stake could not be more important,” she added. The Harris campaign called for a second debate immediately after Philadelphia, stating that voters “got to see the choice they will face at the ballot box: moving forward with Kamala Harris or going backwards with Trump”. “Vice President Harris is ready for a second debate. Is Donald Trump?” Speaking after the debate, various Trump campaign surrogates – including Florida Republican Representative Matt Gaetz – said that they believed Trump would welcome another debate. However Trump the next morning said on Fox News that the debate had been “rigged” and that he was “less inclined” to attend another after his “great night”.","summary":"Getty Images Donald Trump has repeatedly claimed victory in the 10 September debate with Kamala Harris. Donald Trump has announced that he will not hold another debate against Kamala Harris before the November election. The former president claimed on Truth Social on Thursday that Harris wanted a &#8220;rematch&#8221; because he &#8220;clearly&#8221; won on Tuesday in &#8230;\n\n\nThe post Donald Trump says no more debates against Kamala Harris appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/donald-trump-says-no-more-debates-against-kamala-harris/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/20eb/live/d86360f0-713d-11ef-8fe6-3f883dde47fa.jpg","video":null,"publish_date":"2024-09-12 22:40:17","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.501},{"id":256291644,"title":"Trump ally Laura Loomer in racism row after ‘curry’ jab at Kamala Harris’ Indian heritage","text":"Feuding MAGA conspiracy theorists Laura Loomer and US congresswoman Marjorie Taylor Greene accused each other of racism in a social media war of words that began on Wednesday, which Loomer spent with Donald Trump. Days earlier, Loomer posted a message on X, formerly Twitter, stating that “if Kamala Harris wins, the White House will smell like curry”, along with other anti-Indian tropes. “This is appalling and extremely racist,” Greene shot back Wednesday night. “It does not represent who we are as Republicans or MAGA. This does not represent President Trump.” Greene, who has a running rivalry with the far-right political activist, demanded her former friend take down her racist post. Loomer responded with a long string of angry replies, starting with one referring to the congresswoman from Georgia as “a raging antisemite” who once claimed space lasers operated by prominent Jewish bankers were used to ignite wildfires in California. She also called Greene “the most miserable lying b**** in Congress”. The two Trump surrogates used to get along well. Greene said she endorsed and contributed to Loomer’s failed 2020 congressional campaign in Florida, but did not back her in 2022. According to Greene, that led to the deterioration of their relationship. Loomer claims she stopped trusting Greene and questions the congresswoman’s commitment to the MAGA movement. Loomer has spent time with Trump in Pennsylvania this week, where the Republican US presidential nominee delivered a bizarre and seemingly baseless claim that Haitian migrants in Ohio are eating people’s pets during Tuesday’s presidential debate. That racist conspiracy theory also appears more than once on Loomer’s X feed. The activist, who has frequently promoted September 11 conspiracy theories, also joined Trump on Wednesday for ceremonies marking the anniversary of the attacks. Many MAGA supporters on X urged Loomer and Greene to stop quarrelling for Trump’s sake. “We have an election to win and sowing seeds of division is not the way to win it!” right-wing influencer Alex Stone posted. “Why are we doing this to each other?” another MAGA supporter asked. “Why are we attacking fellow Republicans in the midst of one of the most important elections of our lives?”","summary":"The conspiracy theorist was called out by Republican lawmaker Marjorie Taylor Greene, sparking a war of words between the two MAGA loyalists.","url":"https://www.scmp.com/news/world/united-states-canada/article/3278326/trump-ally-laura-loomer-racism-row-after-curry-jab-kamala-harris-indian-heritage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/09/13/9211f7a4-2ceb-4dbd-ab6d-0bfbb57695d3_1df2e2e3.jpg","video":null,"publish_date":"2024-09-12 22:38:59","author":"Tribune News Service","authors":["Tribune News Service"],"language":"en","source_country":"cn","sentiment":-0.188}]}