{"offset":0,"number":50,"available":404,"news":[{"id":325561902,"title":"Kamala Harris tells audience to 'remember history,' warns current era parallels 'the 1930s'","text":"Leaked video shows former Vice President Kamala Harris warning that the state of the world is eerily similar to the 1930s. In a rare appearance since leaving the White House, videos have surfaced of Harris at a Q&A during the 2025 Australian Real Estate Conference (AREC 2025). Toward the end of the Q&A, the host noted his admiration for former President Barack Obama, asking Harris what has made him so successful. \"I think one of the very special aspects of who he is, is he really is a student of history and that gets back to my earlier point about, for each of us, understanding the context in which we exist,\" she said in the footage leaked online. It’s critically important, because coupled with the enthusiasm that comes with ambition and optimism, we must be the clear-eyed focus of understanding where we've been.\" KAMALA HARRIS TAKES VEILED JABS AT TRUMP, ELON MUSK IN 1ST MAJOR SPEECH SINCE ELECTION DEFEAT The former vice president then argued, as a \"student of history\" herself, that the world’s current state echoes one of the darkest parts of the 20th century. \"I do worry, frankly, about what’s happening right now in our world,\" she said. \"I do worry that it is important that we remember history. It’s important we remember the 1930s. It’s important that we remember that history has taught us that isolation does not equal insulation.\" Harris went on to argue, \"It is important that we understand and remember history which taught us the interdependence and interconnection between nations. History that has taught us the importance of relationships of trust, the importance of friendships, integrity, honesty.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP She added, \"There is so much about foreign affairs that is just like the importance of having good friendships, consistency, honesty, being there for each other when you need them, holding up standards, international rules and norms.\"","summary":"At AREC 2025, Kamala Harris warned of parallels between today&apos;s world and the 1930s, highlighting the importance of historical lessons and global alliances.","url":"https://www.foxnews.com/media/kamala-harris-tells-audience-remember-history-warns-current-era-parallels-the-1930s","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/ea82101b-kamala-harris2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-28 00:00:47","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"us","sentiment":0.519},{"id":325553238,"title":"EXCLUSIVE: Harris Faulkner Dishes On What Happened Behind The Scenes During Viral Trump Black Journalist Event","text":"Fox News host Harris Faulkner said she knew something was askew before President Donald Trump’s July 31, 2024, interview with a panel during the National Association of Black Journalists (NABJ) conference when asked about it during an interview with the Daily Caller News Foundation.\n\nTrump was interviewed by Faulkner, ABC News reporter Rachel Scott and Semafor reporter Kadia Goba, during which he clashed with Scott over her first question about Trump’s criticism of left-wing members of Congress and former Republican presidential candidate Nikki Haley, and also commented on Vice President Kamala Harris, saying that he “didn’t know she was black” until a few years ago. Faulkner told the DCNF that she saw executives and others debating how to handle the event before Trump took the stage. (RELATED: EXCLUSIVE: Meet Harris Faulkner, The Fox News Host Who Is Bearing Down On ‘The View’ In Ratings Duel)\n\n“I was backstage when the delay happened for 40 minutes, ‘Oh, we’re having audio problems.’ What I saw backstage were executives from, from some of the, and former executives, from some of the networks and they were working on what they were going to do with Trump, and it did not look positive. And I got to see that firsthand,” Faulkner told the DCNF about the NABJ event.\n\n“If those people wanted to keep it under wraps, they couldn’t, and they were shouting. And I remember Rachel Scott was part of that whole, you know, melee of people around, I don’t know, it felt like the inner workings of going after Trump,” Faulkner continued. “I thought, ‘Okay, you know what? I’m probably wrong.’ We get on that stage. I wasn’t wrong. What I saw was real, and suddenly a script that, you know, appeared in a prompter in front of the stage that I did not remember anybody talking about.”\n\nFaulkner was modest when the DCNF asked her about her decision to speak out about the way the panel was conducted. “All I did in that moment was call out the truth,” Faulkner told the DCNF about her Aug. 1, 2024, appearance to discuss the forum on “Fox and Friends,” during which she expressed her frustration with the “gotcha moments” during the panel.\n\n“So much of what America is focused on and so much of what it started with all that emotion and the gotcha moments from the interviewer who was seated directly to his left, has really overtaken the fact that we had an opportunity to talk with the president who walked into a racial storm yesterday,” Faulkner told “Fox and Friends” co-hosts Steve Doocy, Ainsley Earhardt and Brian Kilmeade about Scott’s initial question to Trump. “There were journalists, activists, whatever you want to call people who let their politics show who wanted the NABJ to rescind their offer to have the 45th president of the United States come and sit.”\n\nFaulkner also called out Scott for not acknowledging the July 13, 2024, assassination attempt Trump survived during the NABJ panel’s interview with him.\n\n“I mean, it did not take much to show humanity, and in that moment, I was so disappointed that that did not happen,” Faulkner told Doocy, Earhardt and Kilmeade. (RELATED: ‘That Moment Was Not Fair’: Harris Faulkner Warns Media Is Using Race To ‘Divide’ Country After Trump’s NABJ Interview)\n\nIn July 2024, when Faulkner was on the panel interviewing Trump for the NABJ event, “The Faulkner Focus” drew 2.1 million viewers on average, according to a Fox News release, with the show’s audience since climbing to 2.3 million, according to Nielsen data provided to the DCNF. Faulkner, though, didn’t think calling out the NABJ forum was what led to her ratings boost, pointing instead to another event.\n\n“I called it out, so I don’t know maybe that was a boost,” Faulkner told the DCNF. “I think really, what was a boost was my sit down on July 13 with the president, four hours before he was shot in public, because he laid out his vision for the country, and when that played in its entirety, even that night after the shooting, there were words in that [NABJ] interview where I said, ‘Why did you pick J.D. Vance for your [vice] president?’ Because, I mean, for your VP, pick, you’ll remember back then… there were some missteps by J.D. Vance in the beginning, and there was some criticism.”\n\nFaulkner told the DCNF she asked about the selection of Vance to get the NABJ panel discussion out of what she called an “ambush lane.”\n\n“That’s why you saw me ask that question at the NABJ, as I kind of rerouted that conversation that was so unfair and said, ‘Can we just get back to journalism here? Can we get out of the ambush lane with Trump?’” Faulkner told the DCNF. “And by the way, you told me you were looking for somebody who could do the job first thing, [you’re] getting a little criticism on J.D. Vance and he, I mean, just as he always does, he knows exactly what he wants.”\n\n“I look at J.D. Vance now as our vice president, he’s given a lot of credit for meeting the moment, every single moment that it comes this way right now in this administration,” Faulkner continued. “So the president knew what he wanted. He got to say it in that moment. And all I did was bring forth the journalism.”\n\nFaulkner has been vocal in her criticism of corporate media outlets’ coverage of Trump since Trump was shot in the right ear while giving a speech at a July 13 campaign rally in Pennsylvania. In one instance, after Democrats refused to applaud when Secret Service Director Sean Curran presented Devarjaye “D.J.” Daniel, who is battling terminal brain cancer, with credentials during Trump’s March 4 speech to a joint session of Congress, Faulkner took aim at Democrats and MSNBC host Nicolle Wallace over their reactions to the address.\n\n ‘That Moment Was Not Fair’: Harris Faulkner Warns Media Is Using Race To ‘Divide’ Country After Trump’s NABJ Interview @DailyCaller https://t.co/GOU4IdeR6i — Harold Hutchison (@HaroldHutchison) August 1, 2024 \n\n“What happened to Nicole Wallace? She was a Republican, she was the comms director for former President [George] W. Bush. She was somebody could see the nation in a nonpartisan way when it called for that from the White House. She could see Americans. What is she looking at right now?” Faulkner asked during the March 5 episode of “Outnumbered.” “She has joined the liberal side of the chamber last night, who I can now call, I mean literally, the largest convention of heart donors living on the planet. Living heart donors!”\n\nNABJ did not respond to a request for comment from the DCNF.\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"EXCLUSIVE: Harris Faulkner Dishes On What Happened Behind The Scenes During Viral Trump Black Journalist Event","url":"https://dailycaller.com/2025/05/27/exclusive-harris-faulkner-dishes-on-what-happened-behind-the-scenes-during-viral-trump-black-journalist-event/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/Faulkner_Harris_SMILING_01-2-scaled-e1747947622209.jpg","video":null,"publish_date":"2025-05-27 22:25:28","author":"Harold Hutchison","authors":["Harold Hutchison"],"language":"en","source_country":"US","sentiment":-0.203},{"id":325559238,"title":"Turns Out That RFK Jr.’s Plan to Make America Healthy Again Doesn’t Include Most Pregnant Women or Children","text":"In a sub-60-second video posted on X, Kennedy—who has said his brain was partially eaten by a worm that crawled inside and died—smiles while declaring he “couldn’t be more pleased to announce that as of today the COVID vaccine for healthy children and healthy pregnant women has been removed from the CDC-recommended immunization schedule.” He adds: “We’re now one step closer to realizing President Trump’s promise to make America healthy again.”\nNational Institutes of Health director Jay Bhattacharya, who also appears in the video, as does Food and Drug Administration commissioner Martin Makary, calls the decision “common sense” and “good science.” Makary claims, “There’s no evidence healthy kids need it today, and most countries have stopped recommending it for children.”\nAs The Washington Post notes, “the social media post did not offer a detailed explanation about the move.” Georges C. Benjamin, the executive director of the American Public Health Association, told the outlet he was unaware of any data supporting Kennedy and Co.’s claims. “Are they making this decision without going to any of their advisory committees?” Benjamin said. “Show us the evidence, the studies that have been done.… I don’t know of any.”\nIn fact, the CDC has previously said pregnant people are at higher risk of becoming very ill from COVID and are at an increased risk of pregnancy complications—including stillbirth. Last year, a study from the Cleveland Clinic, published in The EMBO Journal, showed that “mild and asymptomatic SARS-CoV-2 infections can trigger immune responses in a pregnant individual that may cause serious inflammatory responses in the developing fetus.” Receiving the vaccine during pregnancy also provides protection for newborn babies, who are at high risk of developing serious complications. “It’s really concerning,” Sean O’Leary, MD, chair of the American Academy of Pediatrics’ Committee on Infectious Diseases, told NPR. “I think it’s going to be confusing not only for parents but also for public health professionals and medical professionals as well. This takes away choice.” Steven J. Fleischman, MD, president of the American College of Obstetricians and Gynecologists, said in a statement, “As ob-gyns who treat patients every day, we have seen firsthand how dangerous COVID infection can be during pregnancy and for newborns who depend on maternal antibodies from the vaccine for protection. The science has not changed. It is very clear that COVID infection during pregnancy can be catastrophic and lead to major disability.\"\nCurrently, the CDC website states that COVID vaccination for children “is safe,” that “getting vaccinated helps protect children against COVID-19,“ and that “children who have already had COVID-19 should still get vaccinated.” Last year, a study published in JAMA concluded that its “analysis of 3,913,063 cases suggest reduced pediatric SARS-CoV-2 transmission following immunization,” and that “these results support the use of COVID-19 vaccines to reduce COVID-19 incidence and hospitalization in pediatric populations.”\nKennedy is, of course, a longtime anti-vaxxer who has falsely claimed the COVID vaccine was the “deadliest vaccine ever made.” He once involved himself in a vaccine controversy in Samoa and traveled to the country to amplify local anti-vaccine advocates, months before a deadly measles outbreak killed 83 people on the island nation. Earlier this month, amidst a measles outbreak in the US, he ordered federal agencies to find new treatments for the disease, despite the vaccine being wildly effective.\nGuy who doesn’t know the three branches of government would like to lead Alabama\nKing Charles: Leave Canada alone!\n\nAOC Is Running Out of Time to Make a Mayoral Endorsement\nNew York • Read More\nCalifornia Republicans would love Kamala Harris to run for governor\nPolitico • Read More\nJudge Temporarily Blocks White House From Ending Congestion Pricing\nNYT • Read More\nWhat Trump Really Wants From Tim Cook\nVanity Fair • Read More\nTed Bundy, Charles Manson, and Gary Ridgway Once Breathed the Same Poisoned Air. Did It Make Them Killers?\nVanity Fair • Read More\nTrump Administration Tries to Cut Off Harvard Altogether\nNew York • Read More\nThis country is fining impatient airplane passengers who stand up too early\nThe Washington Post • Read More\nFlorida man flees alligator, then attacks deputies before being shot dead\nThe Washington Post • Read More","summary":"In response, the president of the American College of Obstetricians and Gynecologists said, “The science has not changed. It is very clear that COVID infection during pregnancy can be catastrophic and lead to major disability.”","url":"https://www.vanityfair.com/rfk-jr-cdc-covid-vaccine-pregnant-women-and-children","image":"https://media.vanityfair.com/photos/68362ea1b446a33ff93dc15c/16:9/w_6192,h_3483,c_limit/2167258349","video":null,"publish_date":"2025-05-27 21:33:58","author":"Bess Levin","authors":["Bess Levin"],"language":"en","source_country":"US","sentiment":-0.093},{"id":325538432,"title":"Watch Video: Secret Service women officers fight near former President Barack Obama’s home. Here’s what happened next","text":"The US Secret Service has suspended two of its uniformed officers after a physical fight was caught on camera. The incident took place near former President Barack Obama’s Washington, D.C., residence.Fight Took Place Near Obama’s HomeTwo officers reportedly began arguing early on May 21, around 2:30 a.m., near Obama’s residence. The home is located roughly two miles from the White House. The verbal disagreement escalated into a physical altercation. In the video, one officer can be seen using her radio during the dispute. She said, “I need a supervisor out here… immediately before I whoop this girl’s ass.”Also Read: Nine Perfect Strangers Season 2: Episode 3 release date, plot, episode schedule and where to watchVideo Shows Physical AltercationFootage released on social media showed the two female officers shoving and striking each other. The video and audio were published by RealClearPolitics reporter Susan Crabtree. The content was posted on X and quickly drew attention. In the video, the officers did not appear to be responding to an emergency at the time.Secret Service Confirms IncidentA spokesperson for the Secret Service confirmed the details of the fight to New York Post. The agency acknowledged that two Uniformed Division officers were involved in an altercation while on duty. Both officers were immediately suspended. An internal investigation is now underway. Also Read: Netflix TUDUM 2025: Global streaming date, time, films, TV shows and celebritiesThe spokesperson added that all Secret Service employees are expected to follow a strict code of conduct. Any violation is taken seriously. FAQsWhat action was taken against the officers who fought near Obama’s home?Both officers involved in the fight were suspended from duty. The incident is under internal investigation by the Secret Service.Has the Secret Service faced similar behavior before?Yes, a prior incident in April 2024 involved an officer assigned to Kamala Harris reportedly attacking her supervisor after a duty dispute.","summary":"Two Secret Service officers were suspended after a physical fight near former President Barack Obama’s home. The incident was caught on video. One officer threatened the other over radio. The agency confirmed the altercation and launched an internal investigation.","url":"https://economictimes.indiatimes.com/news/international/us/watch-video-secret-service-women-officers-fight-near-former-president-barack-obamas-home-heres-what-happened-next/articleshow/121449100.cms","image":"https://img.etimg.com/thumb/msid-121449107,resizemode-4,width-1200,height-900,imgsize-23718,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-27 21:24:52","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":0.032},{"id":325539180,"title":"Fox News Politics Newsletter: Trump's war with Harvard","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -'The Kamala Excuse': Tensions between Biden and Harris plagued their campaigns, new book reveals -Former NY Democratic Rep Charlie Rangel dead at 94 -Dem strategy session to stop hemorrhaging of male voters ridiculed Trump's war with Harvard The Trump administration escalated its war with Harvard University on Tuesday, announcing it will claw back the university's remaining $100 million in federal funding – effectively ending all financial ties with the Ivy League institution. \"The government is out of business with Harvard University, fully,\" a senior administration official told Fox News Digital. At the center of the fight are accusations of Harvard failing to combat a campus culture of antisemitism. While the university accuses the White House of overreach and insists it is defending free speech, its own internal investigation appears to have handed Trump officials ammunition…Read more White House ‘MONSTERS’: Trump fires off scathing all-caps Memorial Day message targeting 'SCUM' who sought to 'DESTROY' the US HONORING HEROES: Trump honors fallen American heroes, praises God in Memorial Day address: 'Great, great warriors' CONVICTION UNDONE: Trump pardons former Virginia sheriff convicted of taking $75K in bribes PULLING THE PLUG: Trump admin seeks to cancel all remaining contracts with Harvard University A SECOND LOOK: FBI reopening investigation into cocaine found at Biden White House UNDETECTED: Biden's presidential health reports showed no sign of recently revealed aggressive cancer 'SQUANDERED': DOGE sniffs out eye-popping spending on Biden DEI efforts in key agency World Stage RUSSIA-UKRAINE WAR: GOP lawmaker blasts 'dumb' Trump comment on Zelenskyy despite 'perfect' criticism of Putin RISING TENSIONS: Trump warns Putin is 'playing with fire' after declaring the Russian president has 'gone absolutely CRAZY' DEMOCRAT DETOUR: Maryland Democrat Ivey furious not given access to Kilmar Abrego Garcia in El Salvador Capitol Hill TRUMP-APPROVED: Trump endorses House Republican who failed to vote on the One Big Beautiful Bill Act POLITICS AT PLAY: Vets groups torch Dems for holding up key VA picks, including memorials chief on Memorial Day STORIES FROM THE HILL: Remembering Rep. Charlie Rangel – and a voicemail I'll never forget MALE 'SYNTAX': Dems drop $20M on bizarre ‘American men’ study in effort to dig out of 2024 political hole DIVA DEMOCRACY: Jasmine Crockett shares bizarre song clip calling herself 'leader of the future' 'WEAK AND WOKE': Rahm Emanuel calls Democrat's party brand 'weak,' appearing to weigh White House run Across America FARM ALARM: Key Trump voting bloc has concerns with MAHA report, as Trump officials give assurances TOXIC BETRAYAL: Veterans of US' 'toxic soup' Uzbekistan base still fight for proper healthcare 20 years after it was shuttered ELECTION INTEGRITY: Texas governor makes it 'crystal clear' only U.S. citizens can vote in state elections BUSTED BACKER: DOJ reaches plea deal with Dem donor who sought to bribe her way to Kennedy Center seat 'UNSUSTAINABLE': Illegal immigrant health care costs in blue state triggers intense budget debate 'POLITICAL TARGETING': Red state official recounts personal experience of being 'debanked' and why it 'has to be stopped' SPEECH SILENCED: Supreme Court declines to review free speech case involving student who wore 'only two genders' shirt SPACE FORCE BATTLE: Battle over Space Command HQ location heats up as lawmakers press new Air Force secretary 'MENACE TO OUR CITY': Far-left candidate's office accused of fostering toxic environment for women Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/politics/fox-news-politics-newsletter-trumps-war-with-harvard","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-harvard-antisemitism.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 21:07:46","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.242},{"id":325534484,"title":"Fox News Politics Newsletter: Trump's war with Harvard","text":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening… -'The Kamala Excuse': Tensions between Biden and Harris plagued their campaigns, new book reveals -Former NY Democratic Rep Charlie Rangel dead at 94 -Dem strategy session to stop hemorrhaging of male voters ridiculed Trump's war with Harvard The Trump administration escalated its war with Harvard University on Tuesday, announcing it will claw back the university's remaining $100 million in federal funding – effectively ending all financial ties with the Ivy League institution. \"The government is out of business with Harvard University, fully,\" a senior administration official told Fox News Digital. At the center of the fight are accusations of Harvard failing to combat a campus culture of antisemitism. While the university accuses the White House of overreach and insists it is defending free speech, its own internal investigation appears to have handed Trump officials ammunition…Read more White House ‘MONSTERS’: Trump fires off scathing all-caps Memorial Day message targeting 'SCUM' who sought to 'DESTROY' the US HONORING HEROES: Trump honors fallen American heroes, praises God in Memorial Day address: 'Great, great warriors' CONVICTION UNDONE: Trump pardons former Virginia sheriff convicted of taking $75K in bribes PULLING THE PLUG: Trump admin seeks to cancel all remaining contracts with Harvard University A SECOND LOOK: FBI reopening investigation into cocaine found at Biden White House UNDETECTED: Biden's presidential health reports showed no sign of recently revealed aggressive cancer 'SQUANDERED': DOGE sniffs out eye-popping spending on Biden DEI efforts in key agency World Stage RUSSIA-UKRAINE WAR: GOP lawmaker blasts 'dumb' Trump comment on Zelenskyy despite 'perfect' criticism of Putin RISING TENSIONS: Trump warns Putin is 'playing with fire' after declaring the Russian president has 'gone absolutely CRAZY' DEMOCRAT DETOUR: Maryland Democrat Ivey furious not given access to Kilmar Abrego Garcia in El Salvador Capitol Hill TRUMP-APPROVED: Trump endorses House Republican who failed to vote on the One Big Beautiful Bill Act POLITICS AT PLAY: Vets groups torch Dems for holding up key VA picks, including memorials chief on Memorial Day STORIES FROM THE HILL: Remembering Rep. Charlie Rangel – and a voicemail I'll never forget MALE 'SYNTAX': Dems drop $20M on bizarre ‘American men’ study in effort to dig out of 2024 political hole DIVA DEMOCRACY: Jasmine Crockett shares bizarre song clip calling herself 'leader of the future' 'WEAK AND WOKE': Rahm Emanuel calls Democrat's party brand 'weak,' appearing to weigh White House run Across America FARM ALARM: Key Trump voting bloc has concerns with MAHA report, as Trump officials give assurances TOXIC BETRAYAL: Veterans of US' 'toxic soup' Uzbekistan base still fight for proper healthcare 20 years after it was shuttered ELECTION INTEGRITY: Texas governor makes it 'crystal clear' only U.S. citizens can vote in state elections BUSTED BACKER: DOJ reaches plea deal with Dem donor who sought to bribe her way to Kennedy Center seat 'UNSUSTAINABLE': Illegal immigrant health care costs in blue state triggers intense budget debate 'POLITICAL TARGETING': Red state official recounts personal experience of being 'debanked' and why it 'has to be stopped' SPEECH SILENCED: Supreme Court declines to review free speech case involving student who wore 'only two genders' shirt SPACE FORCE BATTLE: Battle over Space Command HQ location heats up as lawmakers press new Air Force secretary 'MENACE TO OUR CITY': Far-left candidate's office accused of fostering toxic environment for women Get the latest updates on the Trump administration and Congress, exclusive interviews and more on FoxNews.com.","summary":"Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.","url":"https://www.foxnews.com/deals/fox-news-politics-newsletter-trumps-war-with-harvard","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trump-harvard-antisemitism.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 21:07:46","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.242},{"id":325531864,"title":"House Republicans banking on ‘big beautiful bill’ to boost midterm chances, stop Dem plans for third Trump impeachment","text":"WASHINGTON — House Republicans are urging their Senate colleagues to swiftly pass President Trump’s “big beautiful bill” — which recent polling suggests is popular in key congressional districts — to avoid losing the chamber to Democrats who could use a new majority to start impeachment probes.\n\nSpeaker Mike Johnson (R-La.) told The Post in a phone interview Friday that Republicans got “caught flat-footed” when the Tax Cuts and Jobs Act (TCJA) passed in December 2017 and the GOP took a drubbing in the midterms the following year, handing Democrats a 41-seat House advantage.\n\n“We want to ensure that people can feel the effects of it well in advance of the midterm elections,” Johnson said.\n\n“That’s one of our great regrets about the TCJA is we waited too long. We believe this bill is going to provide real relief for real Americans everywhere — and the sooner we do it, the better.”\n\nHistorical headwinds are strongly against House Republicans heading into next year. In nearly every midterm election since 1938, the party in power has lost seats — with two exceptions: 1998 and 2002.\n\nBut Johnson and other GOP leaders have been trying to stay optimistic about the GOP’s odds of defying history. \n\nHigh stakes\n\nThe stakes are high for Republicans, especially Trump, even as some GOP senators have doubted the bill has enough votes to pass the upper chamber in its current form.\n\nA National Republican campaign operative focused on the 2026 elections warned Tuesday Democrats are “going to do everything in their power to impeach President Trump” if they win back even partial control of Congress.\n\nEven Dems in toss-up races, like Georgia Sen. Jon Ossoff, have signaled openness to impeachment based on Trump “selling access” to people purchasing his name-branded cryptocurrency.\n\nJohnson already stared down an impeachment threat this Congress after Rep. Shri Thanedar (D-Mich.) tried to force a vote this month on articles alleging abuse of trade powers, bribery and corruption, obstruction of justice and tyranny.\n\n“While Democrats are throwing fits, impeding law enforcement, playing political games, and demonstrating how far out of touch they are — Republicans are working to deliver lower taxes for families, restore American energy dominance, strengthen border security, restore peace through strength, and make government work more efficiently and effectively,” the speaker said in a statement at the time. “The contrast has never been more clear.”\n\nThanedar backed down at the last minute following objections from some members of his own party — but other Democrats like Rep. Al Green (R-Texas) have hinted at following through in the future, accusing Trump of being “an authoritarian president.”\n\n“House Democrats have already provided just a small preview of what a Democratic majority would bring: distractions, division, and nonstop Trump Derangement Syndrome,” said National Republican Congressional Committee spokesman Mike Marinella.\n\nTrump was impeached and acquitted twice during his first term and has been keen on avoiding a repeat of that fate. \n\nBeyond the specter of impeachment, House Democrats would take over powerful committees with subpoena powers and other investigative tools and launch a blitz of inquiries into Trump and his allies.\n\nTopics could range from Trump’s crackdown on law firms and universities, to his meme-coin venture and the “flying palace” super jet worth an estimated $400 million his administration recently received from Qatar.\n\nLegislative success\n\nThe House passed the One Big Beautiful Bill Act, 215-214, early Thursday to make Trump’s 2017 tax cuts permanent; end taxes on qualified tips, overtime pay and car loan interest payments as well as boost border and defense spending; enact Medicaid reforms; and claw back money from unused green-energy tax credits.\n\nIts passage had been in doubt up until hours before the vote due to last-minute objections from conservatives in the House Freedom Caucus, who wanted work requirements for Medicaid imposed sooner than 2029. They successfully got the timeline bumped up to the end of 2026.\n\nFiscal hawks also wanted hundreds of billions of dollars in solar, wind and other renewable energy tax incentives from President Joe Biden’s Inflation Reduction Act to be stripped if not implemented by the end of 2028 — or if it has not produced at least a 5% return on investment within 60 days of the bill’s enactment.\n\nBlue-state Republicans further touted a $40,000 state and local tax (SALT) deduction cap for individuals filing with the IRS.\n\n“The ultimate package is one that really does appeal to hardworking Americans because it addresses their needs, it addresses real tax benefits and tax savings, the cuts that will help everybody,” Johnson said. “The challenge is the process of building that consensus step by step is very time consuming — and very laborious.”\n\n“It’s another reason why we had to start this a year in advance,” he added, noting that getting it to Trump’s desk by July 4 would “be great for the party, but bigger than that, great for the country, and it will also avoid these calamities that would follow us if we don’t get this job done.”\n\nThe GOP-aligned polling firm Fabrizio Lee issued an internal memo Saturday showing up to 72% of registered voters in key congressional districts supported “requiring able-bodied, working-age adults who receive Medicaid to at least look for work or participate in community service part-time.”\n\nAnother 63% also preferred “ending the federal income tax on tips,” 61% liked extending the 2017 tax cuts for individuals and 59% favored “ending federal income tax on overtime pay,” the poll found.\n\nHouse Minority Leader Hakeem Jeffries (D-NY) and others have ripped the tax bill as a “scam” that would disproportionately benefit the ultra-wealthy, but GOP campaign staff believe the early polling is a good sign for their party in the midterms.\n\n“The polls are clear that voters overwhelmingly support the Republican agenda, and that’s exactly why Democrats will be rejected again in 2026,” Marinella said.\n\nGame plan for victory\n\nIn tandem with the efforts to achieve legislative and policy successes, Trump and his allies are hoping smart politics can prevent a midterm loss.\n\nThat means emphasizing quality candidates, avoiding messy primaries and fundraising aggressively.\n\nCandidate quality had been widely seen by GOP brass as one of the biggest reasons for the party’s disappointing 2022 midterm performance.\n\nRepublicans took steps to rectify that issue in 2024 and are hoping to repeat that by discouraging retirements and recruiting more viable candidates. Additionally, Trump has begun endorsing Republicans months in advance of potential primaries in order to avoid messy infighting.\n\nThe president came out early in support of New York Rep. Mike Lawler’s re-election bid, potentially clearing the field for Rep. Elise Stefanik (R-NY) to make a run for governor. Lawler has also teased a possible run.\n\nLastly, Trump, his allies and Republicans have been working to boost their war chest to help fortify embattled candidates with ample cash, with super PACs such as MAGA Inc. and Securing American Greatness expected to play a big role in the midterm skirmish.\n\nNational Republican Congressional Committee Chairman Richard Hudson (R-NC) has signaled his intention of going on offense, with more than two dozen seats on the official House GOP campaign arm’s target list.\n\nThere are 13 House Democrats running in districts that Trump won, but only three Republicans in districts that former Vice President Kamala Harris won in the 2024 cycle.","summary":"Speaker Mike Johnson (R-La.) told The Post that the party wants Americans to \"feel the effects\" of Trump's agenda ahead of November 2026.","url":"https://nypost.com/2025/05/27/us-news/house-republicans-banking-on-big-beautiful-bill-to-boost-midterm-chances-stop-dem-plans-for-third-trump-impeachment/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105408226.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/QtCnOcm0-RyIcpnTz.mp4","publish_date":"2025-05-27 21:05:35","author":"Josh Christenson,Ryan King","authors":["Josh Christenson","Ryan King"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.021},{"id":325531860,"title":"Democrats don’t need to spend $20 million to study why men abandoned the party — just stop trashing them","text":"Democrats can’t figure out why they’re hemorrhaging young male voters — and party leaders are so baffled that they’ve thrown $20 million toward studying their predicament.\n\nI’ll give them the punchline for free: It’s all the man-bashing.\n\nProgressives waged war on toxic masculinity, insisting that we should “believe all women” and claiming that red meat is a right-wing thing. Is it any wonder men have said “no thanks”?\n\nDespite the obvious, the Democratic Party has reportedly poured eight figures into an effort dubbed SAM, short for “Speaking with American Men: A Strategic Plan” — probing men as though they are some alien species.\n\nThe report, according to the New York Times, promises to “study the syntax, language and content that gains attention and virality in [young male] spaces.” Sounds like a lot of gobbledygook. \n\nDems like California Governor Gavin Newsom and Kentucky Governor Andy Beshear reportedly discussed how to reach the average American man at the Future Forward PAC conference held at… the Ritz-Carlton in Half Moon Bay, California.\n\nWhat they could have done instead is listen to other people in their own party.\n\nWhen DNC vice chair David Hogg had the gall to say the Democrats should pay more attention to young men — good advice from a real-life 25-year-old male — party leaders reacted by calling for an election to void his position, allegedly in political retribution. \n\nAppearing on “Real Time with Bill Maher” on May 9, Hogg lamented that his party was leaving young men behind.\n\n“What I think happened last election is younger men — they would rather vote for somebody who they don’t completely agree with [but] who they don’t feel judged by, than somebody who they do agree with [but] that they feel like they have to walk on eggshells around constantly because they’re going to be judged or ostracized or excommunicated,” he said.\n\nWhen former Bernie Sanders supporter and ultimate bro whisperer Joe Rogan invited Kamala Harris onto his podcast during the last election cycle — even entering into negotiations about discussion topics — the candidate turned him down, leaving Trump with a slam dunk.\n\nHarris’ clear message? Screw you men, we don’t really care.\n\nThe result: Trump won voters under 26, white men, black men and 18-year-old non-white men, while his support among men overall swelled from 49% in 2020 to 55% in 2024.\n\nSure, the Dem’s SAM report isn’t wrong. It suggested advertising more in video games and shifting language away from a “moralizing tone” towards men. This is all true — but it’s also too little, too late. \n\nThis is, after all, the party that insisted Doug Emhoff had “reshaped the perception of masculinity” on the campaign trail. Meanwhile, progressive ideology pushed by the Dems has told young men they are intrinsically toxic and their concerns aren’t a priority.\n\nAnd, as one X user aptly pointed out, mainstream media headlines have even gone as far as to malign workouts, red meat and hot girls as “right wing.”\n\nYou don’t necessarily have to go as far as Hulk Hogan ripping apart his own T-shirt to reveal a “Trump Vance 2024” tank top underneath, as happened at the Republican National Convention. But that sent a message that masculinity isn’t shamed around here.\n\n“The progressive left sometimes thinks or talks about masculinity in this kind of toxic way, which I think creates an opportunity for the right to actually say, no, masculinity is a good thing,” Richard Reeves, president of The American Institute for Boys and Men, told The Post. \n\n“One of the markers of being on the right now is to actually just be unapologetic about being a guy and being masculine and not having to apologize for mansplaining and ‘toxic masculinity’ and manspreading and all of that.”\n\nSeems like a pretty obvious message, and one that doesn’t cost $20 million.","summary":"Dems reportedly plan to spend $20 million investigating why Trump's support by American men swelled from 49% in 2020 to 55% in 2024. But the answer is simple and embedded in Kamala Harris's failed campaign.","url":"https://nypost.com/2025/05/27/opinion/the-secret-to-saving-democrats-20-million-stop-trashing-men/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/dems-men_720.jpg?quality=75&strip=all&w=720","video":"https://cdn.jwplayer.com/videos/QbGQFABo-RyIcpnTz.mp4","publish_date":"2025-05-27 21:00:55","author":"Rikki Schlott","authors":["Rikki Schlott"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.428},{"id":325531842,"title":"Florida Rep. Wasserman Schultz rejects NYT report comparing Democrats to ‘slow’ and ‘passive’ animals: ‘I’m focused on the humans’","text":"Rep. Debbie Wasserman Schultz, D-Fla., rejected a New York Times report that included research comparing the Democratic Party to “slow” and “passive” animals, telling CNN on Tuesday that she was worried about “human beings.” \n\n“‘Republicans are seen as apex predators like lions, tigers and sharks, beasts that take what they want when they want it. Democrats are typically tagged as tortoises, slugs, or sloths: slow, plodding, passive,'” CNN host John Berman said, quoting a New York Times report that highlighted Democratic researcher Anat Shenker-Osorio’s findings on how people view the Democratic and Republican parties. \n\n“And then a little bit later there was a respondee who said the Democrats are like deer in headlights. How is it that you think that the Democratic Party has earned these descriptions?” \n\n“I‘m not focused on the animals that some New York Times reporter compares the political parties to. My constituents are human beings, and the human beings that I represent are facing devastating health care cuts, the most significant health care cuts that have been ever handed down by any administration,” Schultz responded.\n\nThe New York Times reported on Sunday that the party was still struggling with its image after former Vice President Kamala Harris’ loss.\n\nA Democratic man from Georgia who participated in the focus group and was the one who described the Democratic Party as a “deer in headlights” went further to describe the state of the party. \n\n“You stand there and you see the car coming, but you’re going to stand there and get hit with it anyway,” he said, according to the Times.\n\nSchultz continued to dismiss the report, reiterating, “I’m focused on the humans I represent, not, you know, animal comparisons.”\n\nBerman pushed back and said it was voters who likened the party to tortoises, sloths and slugs.\n\n“John, you said they were asked to compare the parties, so they were prompted to compare the parties to animals. That is ridiculous. I‘ve watched a lot of focus groups, and I know that the people that I represent want me fighting for the humans, the families that I represent,” Schultz responded.\n\nThe Democratic Party’s favorability remains low after President Donald Trump’s win. \n\nThe party’s rating stood underwater in an April Fox News national poll at 41% favorable and 56% unfavorable, which is an all-time low for Democrats in Fox News polling.\n\nAnother poll in March found that just 27% had a positive view of the Democratic Party.","summary":"Rep. Debbie Wasserman Schultz rejected a New York Times report that included research comparing the Democratic Party to \"slow\" and \"passive\" animals.","url":"https://nypost.com/2025/05/27/media/wasserman-schultz-rejects-ny-times-report-on-voters-seeing-democrats-as-slow-and-passive/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105413564.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/QtCnOcm0-RyIcpnTz.mp4","publish_date":"2025-05-27 20:59:49","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.204},{"id":325547144,"title":"'When I die, I want them to say I was Palestinian': This is Bishara Bahabah, the American mediator between Hamas and the US","text":"Like many Arab Americans, Bishara Bahbah was once a loyal Democratic voter who never considered backing the Republican Party — until October 7. Or more accurately, in the wake of what followed. In Bahbah’s eyes, President Joe Biden’s unwavering support for Israel’s war in Gaza pushed him to a turning point: “I became a Republican,” he declared as early as June 2024, even before Biden withdrew from the presidential race. “We’re sick of Joe Biden and his involvement in the genocide against the Palestinian people in Gaza.” He didn’t expect that, less than a year later, he’d become a key, though largely unknown, player in the painful negotiations for a hostage deal and a potential end to the war. Bahbah, a Palestinian-American academic, journalist and political activist, was born in 1958 in East Jerusalem. Most of his family had relocated to Jordan after the 1948 war, later settling in the U.S. in the 1970s. He earned his undergraduate degree at Brigham Young University and went on to receive a master’s degree and Ph.D. from Harvard University. He later taught at Harvard and served as associate director at the university’s Middle East Institute before embarking on a career that blended finance, politics and pro-Palestinian activism. In the 1990s, Bahbah was a member of the Palestinian delegation to the multilateral peace talks and remained a vocal supporter of a two-state solution. He later served as editor-in-chief of the Palestinian newspaper Al-Fajr and was active in numerous humanitarian organizations. He also published extensively on Middle Eastern political and social issues. Though he built his life in the U.S., his connection to Palestine never wavered. “It will always be my home, no matter where I live,” he told Arab News in 2018. “My children were born in the U.S., but I registered them with UNRWA. When I die, I want them to say I was Palestinian. That’s our eternal right.” A voice for peace — and Trump Until recently, Bahbah had no ties to Donald Trump. But the war in Gaza caused a dramatic political shift among Arab Americans, traditionally one of the Democratic Party’s most loyal constituencies. An October 2024 survey by the Arab American Institute (AAI) showed support in the community was nearly split: 42% backed Trump, 41% supported Vice President Kamala Harris, and 12% favored other candidates. According to Arab News/YouGov, Trump led Harris among Arab-American voters 45% to 43%, with 29% of respondents citing the Israeli-Palestinian conflict as their top concern. Bahbah played a central role in that shift. Frustrated by what he saw as empty promises from Biden and Harris, he joined Trump’s campaign in May 2024, hoping that a Trump victory would force Israel to end the war in Gaza. The Trump team invited him to help establish a political action committee called “Arab Americans for a Better America.” Get the Ynetnews app on your smartphone: Google Play: https://bit.ly/4eJ37pE | Apple App Store: https://bit.ly/3ZL7iNv He later founded and led “Arab Americans for Trump,” a platform that helped boost Republican turnout in Arab-majority areas of Michigan, one of the key swing states in Trump’s path to reelection. Bahbah worked closely with Trump’s special envoy Richard Grenell and Lebanese-American businessman Massad Boulos, Trump’s son-in-law and a key liaison to Arab-American communities. After Trump’s victory, Bahbah helped draft a congratulatory letter from Palestinian Authority President Mahmoud Abbas, which led to the first direct phone call between the two leaders. Still pro-Trump, but not uncritical Despite his continued support for Trump, Bahbah hasn’t hesitated to criticize him publicly. He sharply opposed Trump’s February 5 comment suggesting Gaza could become a “Middle Eastern Riviera” if its population were expelled. “The president’s ideas are completely unacceptable,” Bahbah wrote onX.X. “Gaza belongs to the Palestinians—it’s not real estate to be bought or sold.” Soon after, he rebranded his organization from “Arab Americans for Trump” to “Arab Americans for Peace.” That shift marked his quiet entry into backchannel diplomacy. Bahbah said that in April, he received a call from senior Hamas figure Ghazi Hamad, after Suha Arafat—the widow of Yasser Arafat—connected the two. Hamad asked Bahbah to relay a message to the U.S., which eventually helped secure the release of hostage Edan Alexander. Since then, Bahbah has served as an unofficial communication channel between Hamas and the U.S. administration—bypassing Israel—in efforts to broker a ceasefire. It was revealed Monday that Bahbah was behind the latest ceasefire proposal submitted to Israel and rejected. The plan reportedly includes a 70-day truce, the release of five living hostages on the first day and another five on the final day, and the daily entry of 1,000 aid trucks. The U.S. did not coordinate the plan with Israel in advance. One senior Israeli official called the offer “effectively a surrender to Hamas,” noting that it was drafted in coordination with the group and thus aligned with its positions. The proposal diverged sharply from the “Witkoff framework” that Israel has clung to since fighting resumed in March. Follow Ynetnews on Facebook | Twitter | Instagram | Telegram","summary":"Disillusioned by Biden and Harris, he backed Trump in the presidential election and helped PA President Mahmoud Abbas draft a congratulatory message while still publicly criticizing Trump’s Gaza plan;  Bahbah, who came to the US as an immigrant in the 1970s, now serves as a backchannel between Hamas and Washington while bypassing Israel; 'My children were born in the U.S., but I registered them with UNRWA'","url":"https://www.ynetnews.com/article/sy5q0kqmeg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/05/27/rkzGjwXflx/rkzGjwXflx_0_156_768_432_0_large.jpg","video":null,"publish_date":"2025-05-27 20:59:12","author":"Tzippy Shmilovitz","authors":["Tzippy Shmilovitz"],"language":"en","category":"politics","source_country":"il","sentiment":-0.089},{"id":325531848,"title":"Washington Post announces another buyout program targeting veteran staffers, other departments","text":"The Washington Post announced Monday it was implementing another buyout program, this time targeting veteran staffers and other department employees. \n\n“Today, we are announcing that The Washington Post is offering a Voluntary Separation Program (VSP) to news employees with 10 or more years’ service at The Post, as well as to all members of the video department and to all members of the copy desk and sports copy desk,” Washington Post executive editor Matt Murray wrote in a staff memo obtained by Fox News Digital. \n\nThe memo stated the move was part of The Washington Post’s “ongoing newsroom transformation efforts aimed at reshaping and modernizing the newsroom for the current environment.”\n\n“Like the rest of our industry, we are adapting to changing habits and new technologies that are transforming news experiences. Even as we have begun creating new departments and welcoming new colleagues, to reach new audiences we must increase our staffing flexibility and expand in areas such as audience data and social video,” Murray continued. \n\nMurray told staff the buyout program would conclude by the end of July. \n\n“With the VSP, we will no doubt see valued colleagues and friends decide to leave The Post,” Murray wrote. \n\n“But as stewards of this great institution, we all must remain relentlessly focused on bringing engaging and relevant journalism to growing numbers of readers in the formats and ways they want it in 2025. That is an urgent and important task for us given the pace of technological change, the industry’s evolving landscape and the ever-present need to produce and promote strong, rigorous and independent journalism.” \n\nAccording to a VSP document viewed by Fox News Digital, nine months of base pay would be given to staffers employed for 10-15 years, 12 months of base pay for 15-20-year veterans, 15 months of base pay for 20-25-year veterans and 18 months for anyone who has worked at the Post for more than 25 years. \n\nAll of them would also receive 12 months of pay credit in their Separate Retirement Account (SRA). \n\nOne Washington Post staffer told Fox News Digital that the new buyout program is “less discerning” than previous rounds of buyouts because of how widespread it is, adding that copy editors are “always targets” and that they’re “always underperticipated.” \n\n“Less important who stays or goes. Just want to get the numbers down,” the staffer said. \n\nA spokesperson for The Washington Post told Fox News Digital, “The Washington Post is continuing its transformation to meet the needs of the industry, build a more sustainable future and reach audiences where they are. This voluntary program is part of our ongoing efforts aimed at reshaping how we deliver world-class news experiences and expand our reach to serve all Americans.”\n\nThe “Democracy Dies in Darkness” paper was hit with layoffs earlier this year and previously implemented buyouts in 2023. \n\nThe Post was reportedly expected to lose a whopping $77 million in 2024. \n\nThere has been an exodus of talent from the Post in recent months, including several resignations following moves made by the paper’s billionaire owner, Jeff Bezos, who halted the Post’s endorsement of former Vice President Kamala Harris just days before the presidential election and his initiative announced earlier this year, ordering columns regularly defending “personal liberties and free markets” and banning viewpoints that oppose them.","summary":"The Washington Post announced Monday it was implementing another buyout program, this time targeting veteran staffers and other department employees.","url":"https://nypost.com/2025/05/27/media/washington-post-announces-another-buyout-program-targeting-veteran-staffers-other-departments/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105413172.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/QtCnOcm0-RyIcpnTz.mp4","publish_date":"2025-05-27 20:52:47","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":0.399},{"id":325536438,"title":"Bill Maher UNLOADS on liberals over relentless support of Hamas: 'Are you f*****g kidding me!'","text":"Bill Maher sharply criticized 'liberals' he accused of sympathizing with Hamas, expressing disbelief with the exclamation, 'Are you f***ing kidding me?'.\n\nThe 69-year-old comedian accused the left-wing of aligning their loyalties with Hamas and failing to condemn radical Islamic terrorism, arguing during a recent podcast episode that many anti-Israel protestors would ironically be among the first killed by the terrorist group.\n\n'All the protestors who are protesting in Gaza against Hamas? They've all been killed. They killed protestors and women,' Maher said, before launching into a tirade against his 'woke' audience.\n\nThe latest episode of Maher's Club Random podcast, which aired on YouTube Monday, featured a conversation with right-wing political commentator Tim Pool.\n\nDuring the conversation, the Real Time host revealed that he has faced backlash from the 'far-left' ever since he began frequently and vocally criticizing Islam. \n\n'One of the main reasons why the far left started to really hate me is because I call out Islam as what it is, extremely illiberal,' Maher said during the episode.\n\n'That's what's so ironic about liberals being so supportive of Hamas, is because you're liberals and these are the people, I'm sorry, but this ideology, Islam, even in its more benign forms - yes, I agree, the vast majority of Muslims, not terrorists, of course,' he added.\n\n'Islamists, which is the word we use to describe people who are not terrorists, but kind of agree with the things terrorists are doing, that's a much higher number.' \n\nTo further his point, the comedian added that far-left protestors in the US who support Hamas wouldn't survive a second if they were sent to live under Islamic regimes in the Middle East.\n\n'Most Muslim societies live under some form of sharia law, which no westerner who thinks that Hamas is so great could ever live under,' he continued.\n\n'Your fundamental rights that you take for granted here in America, you would not have.'\n\nHe went on to reference the protests erupting across the US, arguing that if similar demonstrations took place under Hamas rule, participants would be killed - claiming the terrorist group targets women and protestors alike.\n\n'I mean, do I have to say anything more than just - if it was just that issue, how women are treated,' Maher added. 'Are you f***ing kidding me?'\n\nIn the very same episode, Maher also argued that the left-wing of the Democratic Party is alienating voters by focusing on what he called 'ridiculous' social issues and promoting 'woke policies'.\n\n'They seem like committed to just going to absurd lengths just for sh**s and giggles, just for the f*** of it,' he said. \n\nMaher has been outspoken about Israel amid the ongoing violence in Palestinian territories and frequently discusses Middle Eastern politics on his HBO show.\n\nIn October 2024, he accused American singer Chappell Roan of supporting Hamas and downplaying the October 7, 2023 attack on Israeli soil, as reported by Times of Israel.\n\nDuring a lengthy monologue on his political talk show last year, Maher criticized both the star and Gen Z for relying heavily on social media as their primary source of news.\n\n'I know you're moved by what you see on there [TikTok], we all are. The dead Palestinian bodies. But it's odd that your generation didn't seem nearly as moved by the Jewish bodies on October 7,' Maher said.\n\n'Chappell, you're not wrong that oppression is bad or that Palestinians, and many other Muslim populations are oppressed and deserve to be freed - you just have it completely ass backwards as to who is doing the oppressing.'\n\nIn September 2024, Maher blasted Kamala Harris for her policy on the Middle East after she called for an end to the war in Gaza.\n\nThe former-Vice President told a trio of journalists from the National Association of Black Journalists that a ceasefire and hostage deal must get done in the Israel-Hamas war.\n\nWhile calling for a two-state solution, she said the goal was to ensure 'the Israelis have security and Palestinians in equal measure have security, have self-determination and dignity.' \n\nMaher condemned Harris for her take, arguing that it wasn't a real solution and that it would be better to say nothing at all if she couldn't offer a plan of substance.\n\n'I mean, everybody who talks about Israel these days is just so full of s**t,' Maher said. \n\n\"'I don't want children to die.'\" Duh. Who does?' he added. 'None of us want children to die. None of us want this war to go on, but it's not addressing what the problem is.'\n\n'Here's what Kamala Harris said this week about what we should do when the war is over: \"No reoccupation of Gaza, no changing of the territorial lines of Gaza\" and an ability to have security in the region for all concerned in a way that we create stability.\" I feel like if that's what you have to say, don't say anything. Just shut up.'\n\nIn April 2024, Maher tore into college-age protestors as performative publicity seekers, warning that 'no-one likes you', in a withering putdown on his HBO show.\n\nThe comic and pundit blasted demonstrators, who have brought chaos to 'normies' with sit-down protests on major roads and college campuses.\n\nHe dubbed the Palestinian keffiyeh headscarf the modern equivalent of the Che Guevara T-shirt and scorned their 'cosplay as revolutionaries' while disrupting the lives of those who have to work for a living. \n\n'Hey, if it makes you feel good to cosplay as revolutionaries. Knock yourself out. Burn yourself out. Just don't drag Gaza into it,' he said.\n\n'Also, throwing stuff on paintings is just stupid. No one sees mashed potatoes on a Monet and thinks he's got a point, I should recycle my cans.","summary":"Bill Maher unleashed on the left wing's so-called 'liberals' he accused of sympathizing with Hamas, saying he's hated for calling out Islam for 'what it is'.","url":"https://www.dailymail.co.uk/news/article-14754793/bill-maher-liberals-support-hamas.html","image":"https://i.dailymail.co.uk/1s/2025/05/27/20/98800155-0-image-m-79_1748374778943.jpg","video":null,"publish_date":"2025-05-27 20:47:59","author":"Editor,Kelly Garino","authors":["Editor","Kelly Garino"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.341},{"id":325520108,"title":"Secret Service suspends officers caught brawling on camera outside Obama’s home: ‘Whoop this girl’s ass’","text":"WASHINGTON — The Secret Service has suspended two uniformed officers who were reportedly caught on camera fighting each other side former President Barack Obama’s home last week.\n\nDuring the brawl, one federal officer allegedly grabbed her radio and threatened to “whoop this girl’s ass.”\n\nVideo published Tuesday shows the female agents punching and shoving each other.\n\nRealClearPolitics reporter Susan Crabtree, who published both the video and audio files to X, wrote that the fisticuffs happened outside Obama’s Washington, DC, home about 2 miles northwest of the White House.\n\n“I need a supervisor out here… immediately before I whoop this girl’s ass,” of the women says into the radio.\n\nA Secret Service spokesperson confirmed the fight to The Post.\n\n“The U.S. Secret Service is aware of an on-duty altercation that occurred between two Uniformed Division officers at approximately 2:30 a.m. on May 21,” the spokesman said.\n\n“The individuals involved were suspended from duty and this matter is the subject of an internal investigation. The Secret Service has a very strict code of conduct for all employees and any behavior that violates that code is unacceptable. Given this is a personnel matter, we are not in a position to comment further.”\n\nThis is just the latest alleged incident of bad behavior in the Secret Service’s uniform ranks. Michelle Herczeg, who was assigned to protect then-Vice President Kamala Harris, was accused of attacking a supervisor in April 2024 after he relieved her of duties when he allegedly began throwing sanitary pads and screaming at coworkers, according to reports.","summary":"Video published Tuesday shows the female agents punching and shoving each other.","url":"https://nypost.com/2025/05/27/us-news/secret-service-suspends-officers-caught-brawling-on-camera-outside-obamas-home/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-xwrjc0p4y-1748375141411.jpg?quality=75&strip=all&1748360880&w=1200","video":"https://cdn.jwplayer.com/videos/QtCnOcm0-RyIcpnTz.mp4","publish_date":"2025-05-27 19:58:42","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.448},{"id":325522214,"title":"Conservatives Criticize CBS’s Scott Pelley for Graduation Speech Remarks","text":"CBS News’ Scott Pelley delivered a vehemently anti-Trump commencement address, adding to the challenges facing his network as it incited a wave of criticism from Trump’s supporters. \n\nIn his speech to the graduating class at Wake Forest, Pelley criticized the president, warning them about an ‘insidious fear’ that has spread across the nation since he was re-elected. \n\nThe speech, which quickly went viral, led to Pelley being ridiculed for his theatrical delivery, with conservatives calling him a hypocrite for his tirade on the sanctity of journalism.\n\nBut the speech may yet add to turmoil inside CBS as it faces a $20 billion lawsuit from Trump accusing the network of deceptively editing its interview with Kamala Harris during the 2024 presidential election. \n\nThe editing came as CBS’ 60 Minutes program sat down with Harris in October, when she gave a ‘word salad’ response to the Israel-Hamas conflict that was included on a YouTube clip but was mysteriously removed from the broadcast. \n\nTrump alleges that the network tried to manipulate the American people by favoring his election opponent, with his lawsuit seen as a crisis for CBS’s parent company Paramount Global as it enters critical negotiations for a merger. \n\nThe huge lawsuit threatens to derail Paramount Global’s anticipated sale to Skydance Media for $8 billion, with Pelley’s inflammatory speech unlikely to warm Trump to the network. \n\nThe potential sale of CBS’ parent company to Skydance Media is the subject of a Federal Communications Commission investigation, and must be approved by the FCC’s Chairman Brendan Carr, a Trump appointee. \n\nDemocratic Senators Bernie Sanders, Elizabeth Warren and Ron Wyden recently issued a warning to the network warning that any settlement could be considered an illegal payoff. \n\nThis may mean Paramount has to fight the lawsuit until its conclusion, with Pelley’s speech likely to fuel the fire from the White House to make the network pay. \n\nLast month, Pelley also went rogue as he rebuked his own corporate bosses live on the air and warned them against appeasing Trump to let the multi-billion-dollar merger go through. \n\n‘Our parent company, Paramount, is trying to complete a merger. The Trump administration must approve it. Paramount began to supervise our content in new ways,’ he said. \n\n‘No one here is happy about it.’ \n\nThe potential sale of Paramount to Skydance is reportedly critical for its controlling shareholder Shari Redstone, whose family needs the $2.4 billion she would receive in shares to pay their mounting debts or they risk losing billionaire status, per the LA Times. \n\nPelley’s speech may add to the network’s headaches, after he is already facing a wave of criticism from conservatives for his overtly political commencement speech, with footage of his theatrical mannerisms going viral. \n\n‘In this moment, this morning, our sacred rule of law is under attack,’ he said in the speech. \n\n‘Journalism is under attack. Universities are under attack. Freedom of speech is under attack.’ \n\nPelley raised his arms in the air as he continued: ‘And insidious fear is reaching through our schools, our businesses, our homes and into our private thoughts.’\n\n‘The fear to speak… in America,’ he added while pausing for dramatic effect.\n\n‘Power can re-write history, with grotesque, false narratives. They can make criminals heroes, and heroes criminals.\n\n‘Power can change the definition of the words we use to describe reality. Diversity is now described as illegal. Equity is to be shunned. Inclusion is a dirty word. This is an old playbook, my friends. There is nothing new in this.’ \n\nTrump supporters quickly launched on the anchor’s speech, with X users branding him ‘angry and unhinged,’ saying he was making the anti-Trump remarks ‘as he speaks openly and freely in America.’\n\n‘This self-important, sermonizing propagandist is what passes for a legacy media “journalist,”‘ one X user wrote.\n\n‘WTF is up with Scott Pelley?’ another questioned.\n\n‘His speech at Wake Forest graduation was a national disgrace in my opinion. He is not informed and talks only for the liberals… this makes me want to hurl.’\n\nAmong those who joined the pile-on against Pelley was Jaunita Brodderick, who once accused former President Bill Clinton of rape.\n\n‘What a pompous POS,’ she wrote on X.\n\nOthers branded Pelley a hypocrite for his remarks about the sanctity of journalism, as they pointed to his employer’s allegedly deceptive editing of Harris’ interview during the election campaign. \n\n‘Did Scott Pelley mention that 60 Minutes edited Kamala’s campaign interview, and helped her answer questions?’ one X user responded.\n\n‘Until he does that, his credibility is ZERO.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nCBS News&#8217; Scott Pelley delivered a vehemently anti-Trump commencement address, adding to&#8230;\n\n\nThis Post: Conservatives Criticize CBS&#8217;s Scott Pelley for Graduation Speech Remarks first appeared on Internewscast Journal","url":"https://internewscast.com/news/conservatives-criticize-cbss-scott-pelley-for-graduation-speech-remarks/","image":"https://internewscast.com/wp-content/uploads/2025/05/MAGA-unleashes-on-CBS-propagandist-Scott-Pelley-after-grad-speech.jpg","video":null,"publish_date":"2025-05-27 19:49:26","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.151},{"id":325529672,"title":"WATCH: Dem congresswoman jumps down throat of CNN anchor for asking her about voters’ negative views of party","text":"Democrat Florida Rep. Debbie Wasserman Schultz raged at CNN’s John Berman on Tuesday as he asked her for answers to voters’ negative views of her party.\n\nDemocrat researcher Anat Shenker-Osorio told The New York Times that around 250 focus groups consisting of swing voters associated the current Democrat Party with tortoises, sloths and “deer in the headlights,” prompting Berman to ask how the party earned the descriptions. Schultz, appearing visibly frustrated by the question, said she represents “human beings” and is not concerned about what her party is being compared to.\n\n“‘Republicans are seen as apex predators, like lions, tigers and sharks-beasts that take what they want when they want it. Democrats are typically tagged as tortoises, slugs or sloths: slow, plodding, passive.’ Later, there was a responder that said the Democrats are like ‘deer in headlights.’ How is it that you think that the Democratic Party has earned these descriptions,” Berman asked.\n\n“John, I am not focused on the animals that some New York Times reporter compares the political parties to,” Schultz said. “My constituents are human beings, and the human beings that I represent are facing devastating healthcare cuts. The most significant healthcare cuts that have ever been handed down by any administration. Almost 14 million people will lose their Medicaid coverage, many hundreds of thousands more, when you add the cuts to the Affordable Care Act … I’m focused on the humans I represent, not animal comparisons.”\n\nAs Berman clarified that the voters made these comparisons, Schultz scoffed at his questioning and said comparing the political parties to animals is “ridiculous.”\n\n“John, you said they were asked to compare the parties so they were prompted to compare the parties to animals. That is ridiculous. I’ve watched a lot of focus groups and I know the people that I represent want me fighting for the humans, the families that I represent,” the congresswoman continued.\n\nThese comparisons come at a time when the Democrats’ approval ratings have reached abysmal lows. An NBC News poll from March found that just 27% of voters have a positive view of the party, which is the party’s lowest rating since 1990. A CNN poll found in the same month that Democrats’ favorability rating stood at 29%, which is the lowest recorded rating since 1992.\n\nThe Democrats lost the popular vote for the first time in 20 years and the Hispanic male vote for the first time ever in the 2024 election. Trump became the first Republican nominee to win the Latino male vote by garnering 55% of support among that voter block, according to an NBC News exit poll.\n\nPublic polling repeatedly found that voters trusted Trump and Republicans to handle the economy and immigration, the two leading issues in the 2024 election, over Democrats. Since former Vice President Kamala Harris’ loss to Trump, it is still unclear who the leader of the Democrat Party is in the aftermath of the election.\n\nWhile the Democrats’ popularity is suffering, Trump’s approval ratings are surging beyond expectations in the month of May, CNN’s Harry Enten found on May 16. The jump in approval followed a drop in his favorability in April.\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].","summary":"'I'm focused on the humans I represent, not animal comparisons'","url":"https://www.wnd.com/2025/05/watch-dem-congresswoman-jumps-down-throat-of-cnn-anchor-for-asking-her-about-voters-negative-views-of-party/","image":"https://www.wnd.com/wp-content/uploads/2012/10/republicans-democrats-symbols.jpg","video":null,"publish_date":"2025-05-27 19:48:21","author":"Daily Caller News Foundation","authors":["Daily Caller News Foundation"],"language":"en","source_country":"us","sentiment":0.009},{"id":325515284,"title":"Republican Party has 'captured' the working-class vote for the foreseeable future, says former Trump administration official","text":"to top close Video This video is playing in picture-in-picture.\n\nAmerica Reports May 27, 2025 06:54 \n\n Republican Party has 'captured' the working-class vote for the foreseeable future, says former Trump administration official \n Former Kamala Harris battleground state director Dan Kanninen and Sentinel Action Fund president Jessica Anderson weigh in on the Biden White House's alleged 'politburo' and whether the Democratic Party has a 'weak' brand on 'America Reports.'\n Tags POLITICSSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRAMERICA REPORTSV-VIDEOJOE BIDENWHITE HOUSEBOOKSMEDIADEMOCRAT ELECTIONSREPUBLICANS","summary":"Former Kamala Harris battleground state director Dan Kanninen and Sentinel Action Fund president Jessica Anderson weigh in on the Biden White House&apos;s alleged &apos;politburo&apos; and whether the Democratic Party has a &apos;weak&apos; brand on &apos;America Reports.&apos;","url":"https://www.foxnews.com/video/6373539644112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c3252541-fdb3-49b5-8c17-f511964b5c93/b04f2510-57cd-4824-8bc0-458c34c959ff/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 19:30:30","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.019},{"id":325514620,"title":"Republicans' Chances of Flipping Michigan Senate Seat in Midterms—New Poll","text":"Michigan presents an opportunity for Republicans to flip a Senate seat in the 2026 midterms, but a new poll suggested the race will be close in the battleground state that narrowly backed President Donald Trump last November.Why It MattersSenator Gary Peters' retirement in Michigan leaves the Senate seat open, and candidates from both parties are trying to seize on the rare open seat in the Great Lake State.The Michigan Senate race will likely be one of the most competitive, and expensive, of the midterms. The state has emerged as one of the closest battlegrounds, backing Trump in 2016 and 2024 but voting for Joe Biden in 2020. Republicans will be looking to expand their Senate majority, but it's a must win for Democrats who are hoping to ride a \"blue wave\" to flip the chamber in November 2026.What To KnowA new poll conducted by the Glengariff Group and the Detroit Regional Chamber asked Michigan voters who they would support in hypothetical matchups of the election. It found that the race will likely be competitive, but how close could depend on who emerges from each party's primary.Representative Haley Stevens held the strongest lead off any Democrat against former Representative Mike Rogers and Representative Bill Huizenga, who has not formally announced a campaign but has been floated as a potential candidate.Stevens led Rogers by 6 points and Huizenga by 8.4 points among \"definite voters,\" the poll found.State Senator Mallory McMorrow led Rogers by 1.4 points and Huizenga by 4.7 points, according to the poll.Rogers held a 1.9-point lead over Abdul El-Sayed, a progressive who ran for governor in 2018, while El-Sayed held a 2.5-point lead over Huizenga, according to the poll.The poll surveyed 600 registered voters from May 5 to 8 and had a margin of error of plus or minus 4 points.How Competitive Will Michigan Senate Race Be?The Michigan Senate race has \"the chance to be very close,\" David Dulio, director for civic engagement and distinguished professor of political science at Oakland University, told Newsweek.\"Any time there is an open-seat contest, the competitiveness usually goes up as the candidates are often evenly matched in terms of quality and funding usually flows into these races,\" Dulio said. \"Given the narrow majority Republicans have in the Senate, this race will be high on both parties' lists. For the Democrats to win back control, they will have to keep the seats they currently hold. The GOP sees this as a very good opportunity for a pickup.\"If the electorate is similar to 2018—the midterm during Trump's first presidency—Democrats may not need to win back Trump voters, he said.\"Simply put, many Trump voters didn't show up in 2018,\" he said. \"There's a strong chance that happens again in 2026. It goes back to the historical trends in midterm elections that often sees a surge in supporters for a presidential candidate in the presidential cycle and a decline in turnout among those voters during the midterm.\"Tariffs may be a critical issue on the minds of Michigan voters next year, he said. Democrats in the race \"see a real opportunity,\" as the consensus is that it will likely be a \"bad year\" for Republicans. Rogers, meanwhile, has done a \"good job of clearing the primary field,\" Dulio said.Michigan was one of the closest states in the 2024 presidential election. It backed Trump over Vice President Kamala Harris by 1.4 percentage points.At the same time, Democrat Elissa Slotkin, who at the time was a member of the House of Representatives, prevailed over Rogers in the Senate race. She won by only 0.3 percentage points.What People Are SayingAndrew Mamo, Mallory McMorrow for Michigan spokesman, told Newsweek: \"We're thrilled with where our campaign stands at the beginning of this race. She has a clear path to beating any Republican who comes out of their primary and is working every day to bring people together to get it done.\"The El-Sayed campaign told Newsweek: \"This early poll reflects what we've seen on the trail: our movement for working people is gaining momentum. Unlike the career politicians, Abdul has never and will never taken a cent of corporate PAC money—and his bold, honest positions reflect that. As Michiganders get to know Abdul, his record of government leadership, and his vision for an economy that puts people first, we know our movement will continue to grow.\"Haley Stevens campaign spokesperson Reeves Oyster told Newsweek: \"This poll makes it clear that Haley Stevens is the only candidate in this race who can stand up to Donald Trump and Elon Musk's chaos agenda in the Senate to lower costs, grow Michigan's manufacturing economy, and fight for Michigan families.\"Senate Majority Leader John Thune, a South Dakota Republican, said when Rogers announced his candidacy: \"Mike Rogers is the conservative leader that Michigan needs in the U.S. Senate. As an Army veteran and former special agent, Mike understands the importance of putting service before self. We need him in the U.S. Senate to help achieve President Trump's America First agenda and to bring manufacturing and good-paying jobs back to Michigan.\"What Happens NextMichigan's primary will be held in August 2026, so candidates have more than a year to make their case to voters. The Cook Political Report currently classifies the race as a pure toss-up.","summary":"A new poll pointed to a close race in the battleground state.","url":"https://www.newsweek.com/republicans-chances-flipping-michigan-senate-seat-2026-midterms-new-poll-2077642","image":"https://d.newsweek.com/en/full/2652284/michigan-senate-race-polls.png","video":null,"publish_date":"2025-05-27 19:26:02","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":0.17},{"id":325534648,"title":"The national reaction to George Floyd’s death was unnecessary and destructive","text":"No, the blame was placed on all of us as a society. We were all racist, we were told. Hundreds of thousands of police officers across the country who did not kill Floyd were especially racist, we were told, and so Democrats running major American cities stripped them of their funding. Rioters and looters burned down and robbed businesses in Minneapolis and other cities, given the seal of approval by Democrats such as then Vice Presidential candidate Kamala Harris, who promoted the bail fund that enabled their release immediately after their arrests.\n\nThe reaction to Floyd’s death led to activists, Democratic politicians, celebrities, major corporations, and liberal media to racialize everything in the country. The “diversity, equity, and inclusion” scam took off, ingraining itself in universities and corporations, promoting racial divisions and making race relations worse. The language police came out in droves, demanding you stop referring to “master” bedrooms and sports team “owners.” The NFL even segregated the national anthem at the behest of these DEI activists, adding a “black national anthem” to its pre-game festivities.\n\nDOJ SCRAPS BIDEN-ERA POLICE CONSENT DECREE PLANS IN MINNEAPOLIS AND LOUISVILLE\n\nThe reaction to Floyd’s death also marked the death of public health “expertise,” as the experts who demanded rigorous quarantines and lockdowns during the COVID-19 pandemic said, during the heart of the pandemic, that massive crowds protesting racism were fine because racism was a worse virus. As we were told, “In this moment the public health risks of not protesting to demand an end to systemic racism greatly exceed the harms of the virus.”\n\nTrust in public health has not recovered since then. It took years for cities to rein in the crime crises that blossomed out of tolerating and promoting the riots we saw. The country has slowly clawed back the rapid advance of DEI through institutions and the culture. This should have been a local crime story, and it would have played out in court exactly as it did without being turned into a national indictment of America. Instead, we got a massive overreaction that led to five years of discord, division, and destruction (both cultural and literal).","summary":"Sunday marked five years since George Floyd was killed by a police officer in Minneapolis. That means that this entire week marks five years since the national reaction to Floyd’s death did untold damage to the country. The outrage over Floyd’s death was itself understandable, but it very quickly exploded far outside the scope of [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/beltway-confidential/3422838/national-reaction-george-floyd-death-police-racism/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/George-Floyd-riots-minnesota.webp","video":null,"publish_date":"2025-05-27 19:12:49","author":"Zachary Faria","authors":["Zachary Faria"],"language":"en","source_country":"us","sentiment":-0.583},{"id":325509560,"title":"Washington Post announces another buyout program targeting veteran staffers, other departments","text":"The Washington Post announced Monday it was implementing another buyout program, this time targeting veteran staffers and other department employees. \"Today, we are announcing that The Washington Post is offering a Voluntary Separation Program (VSP) to news employees with 10 or more years’ service at The Post, as well as to all members of the video department and to all members of the copy desk and sports copy desk,\" Washington Post executive editor Matt Murray wrote in a staff memo obtained by Fox News Digital. The memo stated the move was part of The Washington Post's \"ongoing newsroom transformation efforts aimed at reshaping and modernizing the newsroom for the current environment.\" \"Like the rest of our industry, we are adapting to changing habits and new technologies that are transforming news experiences. Even as we have begun creating new departments and welcoming new colleagues, to reach new audiences we must increase our staffing flexibility and expand in areas such as audience data and social video,\" Murray continued. JEFF BEZOS' TENURE AS WASHINGTON POST OWNER IN SPOTLIGHT AS PAPER GRAPPLES WITH LOW MORALE, STAFFER EXODUS Murray told staff the buyout program would conclude by the end of July. \"With the VSP, we will no doubt see valued colleagues and friends decide to leave The Post,\" Murray wrote. \"But as stewards of this great institution, we all must remain relentlessly focused on bringing engaging and relevant journalism to growing numbers of readers in the formats and ways they want it in 2025. That is an urgent and important task for us given the pace of technological change, the industry’s evolving landscape and the ever-present need to produce and promote strong, rigorous and independent journalism.\" According to a VSP document viewed by Fox News Digital, nine months of base pay would be given to staffers employed for 10-15 years, 12 months of base pay for 15-20-year veterans, 15 months of base pay for 20-25-year veterans and 18 months for anyone who has worked at the Post for more than 25 years. All of them would also receive 12 months of pay credit in their Separate Retirement Account (SRA). WASHINGTON POST ‘RUDDERLESS’ AS BEZOS' PAPER ENGULFED BY LAYOFFS, TALENT EXODUS AHEAD OF TRUMP'S SECOND TERM One Washington Post staffer told Fox News Digital that the new buyout program is \"less discerning\" than previous rounds of buyouts because of how widespread it is, adding that copy editors are \"always targets\" and that they're \"always underperticipated.\" \"Less important who stays or goes. Just want to get the numbers down,\" the staffer said. A spokesperson for The Washington Post told Fox News Digital, \"The Washington Post is continuing its transformation to meet the needs of the industry, build a more sustainable future and reach audiences where they are. This voluntary program is part of our ongoing efforts aimed at reshaping how we deliver world-class news experiences and expand our reach to serve all Americans.\" WASHINGTON POST STAFFERS URGE OWNER JEFF BEZOS TO MEET IN SCATHING LETTER: ‘WE ARE DEEPLY ALARMED’ The \"Democracy Dies in Darkness\" paper was hit with layoffs earlier this year and previously implemented buyouts in 2023. The Post was reportedly expected to lose a whopping $77 million in 2024. There has been an exodus of talent from the Post in recent months, including several resignations following moves made by the paper's billionaire owner, Jeff Bezos, who halted the Post's endorsement of former Vice President Kamala Harris just days before the presidential election and his initiative announced earlier this year, ordering columns regularly defending \"personal liberties and free markets\" and banning viewpoints that oppose them. CLICK HERE TO GET THE FOX NEWS APP","summary":"The Washington Post has launched a new round of buyouts taking aim at veteran staffers, the opinion pages as well as the copy desk and video department.","url":"https://www.foxnews.com/media/washington-post-announces-another-buyout-program-targeting-veteran-staffers-other-departments","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/waponewsroom.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 19:00:12","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"us","sentiment":0.428},{"id":325509562,"title":"Wasserman Schultz rejects NY Times report on voters seeing Democrats as 'slow' and 'passive'","text":"Rep. Debbie Wasserman Schultz, D-Fla., rejected a New York Times report that included research comparing the Democratic Party to \"slow\" and \"passive\" animals, telling CNN on Tuesday that she was worried about \"human beings.\" \"'Republicans are seen as apex predators like lions, tigers and sharks, beasts that take what they want when they want it. Democrats are typically tagged as tortoises, slugs, or sloths: slow, plodding, passive,'\" CNN host John Berman said, quoting a New York Times report that highlighted Democratic researcher Anat Shenker-Osorio's findings on how people view the Democratic and Republican parties. \"And then a little bit later there was a respondee who said the Democrats are like deer in headlights. How is it that you think that the Democratic Party has earned these descriptions?\" \"I‘m not focused on the animals that some New York Times reporter compares the political parties to. My constituents are human beings, and the human beings that I represent are facing devastating health care cuts, the most significant health care cuts that have been ever handed down by any administration,\" Schultz responded. RAHM EMANUEL CALLS DEMOCRAT'S PARTY BRAND ‘WEAK,' APPEARING TO WEIGH WHITE HOUSE RUN The New York Times reported on Sunday that the party was still struggling with its image after former Vice President Kamala Harris' loss. A Democratic man from Georgia who participated in the focus group and was the one who described the Democratic Party as a \"deer in headlights\" went further to describe the state of the party. \"You stand there and you see the car coming, but you’re going to stand there and get hit with it anyway,\" he said, according to the Times. Schultz continued to dismiss the report, reiterating, \"I'm focused on the humans I represent, not, you know, animal comparisons.\" Berman pushed back and said it was voters who likened the party to tortoises, sloths and slugs. \"John, you said they were asked to compare the parties, so they were prompted to compare the parties to animals. That is ridiculous. I‘ve watched a lot of focus groups, and I know that the people that I represent want me fighting for the humans, the families that I represent,\" Schultz responded. LESS THAN 4 MONTHS INTO TRUMP'S 2ND TERM, DEMS ARE ALREADY EYEING THE 2028 RACE CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The Democratic Party's favorability remains low after President Donald Trump's win. The party's rating stood underwater in an April Fox News national poll at 41% favorable and 56% unfavorable, which is an all-time low for Democrats in Fox News polling. CLICK HERE TO GET THE FOX NEWS APP Another poll in March found that just 27% had a positive view of the Democratic Party.","summary":"Rep. Debbie Wasserman Schultz, D-Fla., dismissed comparisons of Democrats to &quot;passive&quot; animals in a New York Times report, and said she was focused on her constituents.","url":"https://www.foxnews.com/media/wasserman-schultz-rejects-ny-times-report-voters-seeing-democrats-slow-passive","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/wasserman-schultz-nyt-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 19:00:01","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.126},{"id":325509322,"title":"Altercation Involving Female Secret Service Staff Near Obama’s DC Residence","text":"A startling video showed the moment when two female Secret Service agents got into an altercation outside the $8 million mansion of former President Barack Obama in Washington DC. \n\nThe altercation unfolded May 21 at around 2:30am as the former president’s security detail grappled next to a police vehicle. \n\nAccording to audio shared by RealClearPolitics journalist Susan Crabtree, one of the agents reportedly called for a supervisor whilst threatening to engage in a fight with her fellow agent. \n\n‘Can I get a supervisor down to Delta two immediately before I whoop this girl’s ass,’ the agent in the audio said. \n\nAs reported to DailyMail.com by a Secret Service spokesperson, the incident occurred while the agents were on duty. It remains uncertain whether the Obamas were present at the residence during the altercation. \n\n‘The individuals involved were suspended from duty and this matter is the subject of an internal investigation,’ the statement read. \n\n‘The Secret Service has a very strict code of conduct for all employees and any behavior that violates that code is unacceptable. Given this is a personnel matter, we are not in a position to comment further.’ \n\nIt comes a year after a Secret Service agent assigned to then-Vice-President Kamala Harris was removed from duty after she got into a physical fight with her fellow agents. \n\nThe Secret Service has come under scrutiny in recent years amid allegations of unprofessionalism and security lapses. \n\nThese allegations came under the spotlight after the near-assassination of President Donald Trump at a rally in Butler, Pennsylvania last July, which ultimately led the agency’s director Kimberly Cheatle to resign. \n\nCheatle was replaced by Sean Curran, one of the agents who surrounded Trump after he was shot in the ear on stage at the rally. \n\nThe altercation in Harris’ security detail last April also brought humiliation to the agency, as reports said a female agent identified as Michelle Herczeg flew into a frenzy at her fellow agents. \n\nAccording to Secret Service sources, Herczeg arrived for duty acting erratically, grabbing a fellow agent’s personal phone and started deleting applications from it.\n\nShe also was mumbling to herself, hiding behind curtains and throwing items at fellow agents including menstrual pads, according to a report at the time from RealClearPolitics. \n\nHerczeg told her fellow agents they would ‘burn in hell and needed to listen to God.’\n\nSources at the time said the special agent in charge and a detail shift supervisor tried to calm Herczeg after she began exhibiting aggressive behavior, but she tackled the Senior Agent in Charge of security detail and began punching him.\n\nAlthough Herczeg was armed, her weapon remained in the holster until the she was disarmed by her colleagues. She was handcuffed and removed from the terminal.\n\nThe Secret Service was overhauled under Trump as his own agent Curran was installed as the new chief soon after the Butler shooting. \n\nIn recent weeks, another incident involving the Secret Service went viral as footage showed a mysterious man creeping close to Trump’s daughter Ivanka. \n\nThe moment came on May 3 when the First Daughter and her husband Jared Kushner were having dinner at Carbone Beach in South Beach, Florida. \n\nFootage showed an unidentified man holding a Manila envelope, and wearing khaki shorts and a black t-shirt trying to walk alongside them.\n\nAt that point, an agent in a blue button down shirt and black jeans could be seen gently shoving the man out of the way.\n\nWhen the man then put his hand on the agent, the guard responds by forcefully pushing the bystander out of the way with both hands.\n\nThe scene sent bystanders screaming in shock – prompting Ivanka to turn around to see what the commotion was.\n\nBut within seconds, the guard could be seen rushing her and Jared into an awaiting SUV.\n\nAmid the footage going viral online, the Secret Service told DailyMail.com: ‘During a protective movement on Saturday, May 4, 2025, an adult male encroached, coming too close to Secret Service personnel.\n\n‘A special agent immediately intervened, physically redirecting the individual to reestablish a safe perimeter. The public is reminded that during protective operations, maintaining a safe distance from law enforcement and protective personnel is essential.\n\n‘Adequate space ensures agents can respond swiftly to unexpected actions and helps safeguard everyone in the vicinity.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nA startling video showed the moment when two female Secret Service agents&#8230;\n\n\nThis Post: Altercation Involving Female Secret Service Staff Near Obama&#8217;s DC Residence first appeared on Internewscast Journal","url":"https://internewscast.com/news/altercation-involving-female-secret-service-staff-near-obamas-dc-residence/","image":"https://internewscast.com/wp-content/uploads/2025/05/Obamas-female-secret-service-staff-brawl-outside-his-DC-home.jpg","video":null,"publish_date":"2025-05-27 18:49:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.658},{"id":325499400,"title":"Obama's female secret service staff caught in shameful brawl outside his $8m DC mansion","text":"Shocking footage captured the moment two female Secret Service agents fought with each other outside former President Barack Obama's $8 million DC mansion. \n\nThe altercation unfolded May 21 at around 2:30am as the former president's security detail grappled next to a police vehicle. \n\nIn audio before the fight shared by RealClearPolitics reporter Susan Crabtree, one of the Secret Service agents was reportedly heard calling for a supervisor as she threatened to attack her colleague. \n\n'Can I get a supervisor down to Delta two immediately before I whoop this girl's ass,' the agent in the audio said. \n\nIn a statement to DailyMail.com, a Secret Service spokesperson said the fight came as the agents were on-duty. It is unclear if the Obamas were in the home at the time. \n\n'The individuals involved were suspended from duty and this matter is the subject of an internal investigation,' the statement read. \n\n'The Secret Service has a very strict code of conduct for all employees and any behavior that violates that code is unacceptable. Given this is a personnel matter, we are not in a position to comment further.' \n\nIt comes a year after a Secret Service agent assigned to then-Vice-President Kamala Harris was removed from duty after she got into a physical fight with her fellow agents. \n\nThe Secret Service has come under scrutiny in recent years amid allegations of unprofessionalism and security lapses. \n\nThese allegations came under the spotlight after the near-assassination of President Donald Trump at a rally in Butler, Pennsylvania last July, which ultimately led the agency's director Kimberly Cheatle to resign. \n\nCheatle was replaced by Sean Curran, one of the agents who surrounded Trump after he was shot in the ear on stage at the rally. \n\nThe altercation in Harris' security detail last April also brought humiliation to the agency, as reports said a female agent identified as Michelle Herczeg flew into a frenzy at her fellow agents. \n\nAccording to Secret Service sources, Herczeg arrived for duty acting erratically, grabbing a fellow agent's personal phone and started deleting applications from it.\n\nShe also was mumbling to herself, hiding behind curtains and throwing items at fellow agents including menstrual pads, according to a report at the time from RealClearPolitics. \n\nHerczeg told her fellow agents they would 'burn in hell and needed to listen to God.'\n\nSources at the time said the special agent in charge and a detail shift supervisor tried to calm Herczeg after she began exhibiting aggressive behavior, but she tackled the Senior Agent in Charge of security detail and began punching him.\n\nAlthough Herczeg was armed, her weapon remained in the holster until the she was disarmed by her colleagues. She was handcuffed and removed from the terminal.\n\nThe Secret Service was overhauled under Trump as his own agent Curran was installed as the new chief soon after the Butler shooting. \n\nIn recent weeks, another incident involving the Secret Service went viral as footage showed a mysterious man creeping close to Trump's daughter Ivanka. \n\nThe moment came on May 3 when the First Daughter and her husband Jared Kushner were having dinner at Carbone Beach in South Beach, Florida. \n\nFootage showed an unidentified man holding a Manila envelope, and wearing khaki shorts and a black t-shirt trying to walk alongside them.\n\nAt that point, an agent in a blue button down shirt and black jeans could be seen gently shoving the man out of the way.\n\nWhen the man then put his hand on the agent, the guard responds by forcefully pushing the bystander out of the way with both hands.\n\nThe scene sent bystanders screaming in shock - prompting Ivanka to turn around to see what the commotion was.\n\nBut within seconds, the guard could be seen rushing her and Jared into an awaiting SUV.\n\nAmid the footage going viral online, the Secret Service told DailyMail.com: 'During a protective movement on Saturday, May 4, 2025, an adult male encroached, coming too close to Secret Service personnel.\n\n'A special agent immediately intervened, physically redirecting the individual to reestablish a safe perimeter. The public is reminded that during protective operations, maintaining a safe distance from law enforcement and protective personnel is essential.\n\n'Adequate space ensures agents can respond swiftly to unexpected actions and helps safeguard everyone in the vicinity.","summary":"Shocking footage captured the moment two female Secret Service agents fought with each other outside former President Barack Obama's $8 million DC mansion.","url":"https://www.dailymail.co.uk/news/article-14754731/Obama-female-secret-service-agents-fight-DC.html","image":"https://i.dailymail.co.uk/1s/2025/05/27/19/98798477-0-image-m-21_1748369807161.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/07/3210849356189905981/1024x576_MP4_3210849356189905981.mp4","publish_date":"2025-05-27 18:43:05","author":"Editor,Emily Goodin,Will Potter","authors":["Editor","Emily Goodin","Will Potter"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.565},{"id":325495320,"title":"En Tampa, los demócratas de Florida hablan con franqueza sobre sus problemas y esperanzas de éxito futuro","text":"La victoria de Donald Trump en noviembre llevó al Partido Demócrata a nivel nacional a una profunda introspección. En Florida, fue la segunda derrota electoral consecutiva por gran margen, y ya están en marcha las conversaciones sobre cómo enfrentar esa realidad.\n\nTomemos como ejemplo la charla realizada el pasado jueves por la noche, organizada por el Caucus LGBTQ+ del Partido Demócrata del Condado Hillsborough en Tampa.\n\n“Los demócratas somos los mejores para perder, perder, perder”, dijo Mike Drapak, del Hillsborough Society, un comité político formado tras los conflictos internos con el Comité Ejecutivo Demócrata del Condado Hillsborough. “Y ahí es realmente donde debemos comenzar: siendo autocríticos.”\n\nLos miembros del partido deben dejar de “echar culpas” y empezar a mirarse en el espejo, “entender exactamente qué estamos haciendo para que la gente nos rechace”, señaló Drapak.\n\nLa caída del partido ha sido ampliamente documentada. Después de perder todas las contiendas estatales por márgenes de dos dígitos en 2022 y 2024, el partido vio cómo en diciembre dos miembros de su ya reducida bancada en la Cámara de Representantes estatal se cambiaron al Partido Republicano, seguido el mes pasado por el entonces líder demócrata en el Senado estatal, Jason Pizzo, del sur de Florida, quien anunció dramáticamente en el pleno que abandonaba el partido porque estaba “muerto”.\n\nEl gobernador Ron DeSantis no perdió la oportunidad de aprovechar los problemas del partido la semana pasada, declarando que el anuncio de Pizzo de que se postularía a gobernador como independiente era necesario “porque la gente sabe que si tienes una ‘D’ junto a tu nombre en este estado, estás acabado. Porque este partido es un desastre.”\n\nGran parte del debate de la semana pasada entre los demócratas de Tampa giró en torno a los mensajes del partido. Nick Clemente, quien perdió una contienda por un escaño estatal ante la republicana Traci Koster en noviembre, dijo que la marca demócrata de Florida está “inequívocamente rota”.\n\n“¿Cómo hablamos con la gente común que quizá escucha pódcast sobre la UFC, NASCAR o speed metal y no sobre política?” preguntó al público de unas 50 personas. “¿Cómo conectamos con ellos desde nuestros valores y los puntos en común que tenemos, para intentar reparar la marca y que la gente no se avergüence de ser demócrata?”\n\nLogan Mueller, presidente del grupo de Demócratas de la Universidad de Tampa, dijo que un problema clave, en su opinión, es que los demócratas siguen haciendo campaña “como si estuviéramos en 1996.”\n\n“Ellos han ganado la batalla de la información ahora mismo”, dijo en referencia al Partido Republicano.\n\n“Con internet, los pódcast y los videos, no tenemos presencia real en el terreno. Todos los pódcast más populares y los espacios con los que la gente se conecta son muy conservadores. No tenemos ningún medio para transmitir nuestro mensaje y, además, no tenemos un mensaje unificado que podamos compartir con todos. No tenemos un mensaje económico positivo que todos quieran. Una de las razones por las que Trump también tuvo cierto éxito fue porque vendía optimismo. Vendía la idea de hacer grande a Estados Unidos de nuevo.”\n\n‘Demasiado complicado’\n\nSabrina Bousbar coincidió con Mueller.\n\nLa joven de 28 años, oriunda de Pinellas, hizo campaña por Joe Biden en 2020 y luego fue asesora principal en la Administración para la Preparación y Respuesta Estratégica del Departamento de Salud y Servicios Humanos de EE. UU. El verano pasado se postuló al Congreso, quedando en segundo lugar detrás de su compañera demócrata Whitney Fox en el Distrito 13 de Florida. (Fox luego perdió ante la republicana Anna Paulina Luna).\n\n“Somos un poco demasiado complicados”, dijo. “Intentamos tener mensajes para cada sector por separado, pero no tenemos un mensaje cohesivo para todos.”\n\nMueller comentó que muchos de sus compañeros en UT prefieren registrarse como independientes sin afiliación partidista, en lugar de demócratas.\n\n“No quieren asociarse con un partido que ha perdido la guerra del mensaje”, agregó Mueller. “[El partido] tiene muchas connotaciones negativas. Y registrarse como independiente les permite evitar ese caos que se ha generado durante tanto tiempo. El camino a seguir realmente es promover un mensaje económico positivo, porque a los jóvenes sí les importa la economía, tanto como a cualquier otra persona.”\n\nLa cuarta integrante del panel fue Tamika Lyles, demócrata del condado Osceola que busca la nominación del partido para el Senado de EE. UU. el próximo año. Se quejó de que los candidatos demócratas tardan demasiado en conectarse con el electorado.\n\n“No nos ven hasta que es tiempo de primarias o de elecciones generales, cuando vamos a tocar puertas e intentamos llevarles ese mensaje. Pero no lo escuchan”, dijo. “Porque lo primero que preguntan es: ‘¿Dónde has estado todo el año? ¿Qué has estado haciendo todo el año?’ ¿Cuál fue el mensaje durante todo el año mientras todo esto ocurría? Así que necesitamos a alguien que esté hablando constantemente ese idioma.”\n\nUn tema común entre los demócratas tras las elecciones de 2024, tanto a nivel nacional como en Florida, es la necesidad de “encontrarse con los votantes donde están”.\n\nComo alguien que ha trabajado con sindicatos organizados en todo el país, Drapak dijo que ha encontrado “una cantidad significativa” de misoginia, homofobia y racismo en el corazón del país.\n\n“Tenemos que entender eso”, dijo. “Y necesitamos aprender cómo podemos comunicarnos de manera que no atraigamos a los más radicales de ese extremo, pero sí a algunas personas que desean lo mismo que nosotros.”\n\nAunque hubo muchas intervenciones sobre la falta de un mensaje claro, no se habló tanto sobre políticas concretas ni sobre cómo adaptarse a un electorado que se ha desplazado hacia la derecha en los últimos cinco años.\n\nVoto latino\n\nEn cuanto al voto latino, un grupo demográfico clave en Florida que respaldó a Trump por amplio margen sobre Kamala Harris el pasado otoño, un miembro del Caucus Hispano de Pinellas sugirió que una posible oportunidad sería volver a acercarse específicamente a los venezolanos molestos por la decisión del Tribunal Supremo de EE. UU. la semana pasada que elimina de forma inmediata el Estatus de Protección Temporal (TPS) para cientos de miles de ellos.\n\nEn una encuesta realizada el mes pasado a 408 venezolanos residentes en Florida por el Foro de Opinión Pública Latina de la Universidad Internacional de Florida, casi la mitad de quienes dijeron haber votado por Donald Trump en 2024 ahora afirman que se arrepienten o tienen sentimientos encontrados al respecto. Más del 70 % se opone a la decisión de Trump de poner fin al permiso humanitario para venezolanos.\n\n“Debemos usar esto como munición”, dijo Bousbar, de ascendencia marroquí y colombiana. El Partido Republicano ha enfocado su atención en los latinos de Florida desde que Barack Obama dejó la escena política hace más de una década.\n\n“Los latinos comenzaron a inclinarse más hacia los republicanos en cada elección. Pero ahora que estamos viendo el impacto real de esta postura antiinmigrante —deportando personas ilegalmente a sus países, o encarcelándolas sin notificar a sus familias ni brindarles el debido proceso legal que deberían tener en el estado y en EE. UU.— tenemos que tomar eso y comunicárselo a ellos”, dijo.\n\n“Deberíamos estar colocando anuncios en radio en español, mensajes en televisión en español sobre las leyes que ha impulsado Donald Trump contra las comunidades latinas, específicamente venezolanos y cubanos, aquí en el estado de Florida, porque tal vez podamos hacer que el péndulo se mueva de regreso hacia nosotros.”","summary":"‘Intentamos tener mensajes para cada sector por separado, pero no tenemos un mensaje cohesivo para todos.’","url":"https://www.centrotampabay.com/noticias/politica/en-tampa-los-dem%C3%B3cratas-de-florida-hablan-con-franqueza-sobr/","image":"https://www.centrotampabay.com/downloads/9237/download/CT-In%20Tampa%2C%20Florida%20Democrats%20talk%20candidly%20about%20their%20problems%20and%20hopes%20for%20future%20success.jpeg?cb=b291e202b7ef85c964f63f3b7ce778fa&w=1536","video":null,"publish_date":"2025-05-27 17:57:07","author":"Florida Phoenix,Mitch Perry","authors":["Florida Phoenix","Mitch Perry"],"language":"en","category":"politics","source_country":"us","sentiment":1},{"id":325495030,"title":"Dems drop $20M on bizarre 'American men' strategy plan study in effort to dig out of 2024 political hole","text":"Democrats are spending $20 million on a study examining how to speak to \"American men\" after losing ground with the demographic during the 2024 election cycle, The New York Times revealed. \"Speaking with American Men: A Strategic Plan\" is a $20 million project crafted by Democrats to \"study the syntax, language and content that gains attention and virality in these spaces\" of male voters, the Times reported Sunday. Known as \"SAM,\" the study will specifically examine young male voters and how the party can connect with the demographic. Additionally, the study advised rolling out pro-Democrat ads in video games. The study's revelation was made in an overarching article detailing the uphill battle Democrats face after the 2024 election, which included Democrats scrambling to replace former President Joe Biden as the nominee with just more than 100 days left in the election cycle and ultimately delivering all seven battleground states to President Donald Trump. \"The Democratic Party’s tarnished image could not come at a more inopportune moment,\" the article detailed. \"In this era of political polarization, the national party’s brand is more important and influential than ever, often driving the outcomes of even the most local of races.\" DEMOCRATIC PARTY SCRAMBLES TO FIX IMAGE AS MEMBERS ACKNOWLEDGE PARTY 'LOST CREDIBILITY' In response, Democrat operatives and donors have gathered at swank hotels to craft plans on how to draw back the working class and male voters, the Times reported. Trump made big in-roads with the male vote during the 2024 election cycle. A Fox News Voter Survey published in November 2024 found that men aged 18–44 supported Trump at 53%, compared to former Vice President Kamala Harris’ 45%. While The Associated Press found that more than half of male voters under the age of 30 voted for Trump instead of Harris — including roughly six-in-10 White male voters supporting Trump — about one-third of Black male voters supported Trump, as did about 50% of young Latino male voters. Trump's support among young Black and Latino male voters jumped by about 20% compared to his 2020 support, the AP reported. Democratic strategist Michael Ceraso told Fox News Digital on Tuesday that he does not take issue with Democrats investing in voter engagement strategies but added that he found it \"hilarious\" that \"people in suits are hanging out at luxury hotels asking how they can talk to day-to-day Americans.\" \"We're having an issue with the messenger more than the message,\" Ceraso said, arguing that voters support longstanding Democratic policies such as affordable housing, but that \"Democrats just need to take a reality check\" on how they convey their messaging to voters. \"I just don't understand how, after all these years and all these Democrats who've been in the game, how we continue to make those same choices,\" he added. \"Like Rahm Emmanuel, or all these sort of big names, they're just like, 'Yeah, we're going to figure out how to win in, you know, rural North Carolina by hanging out in a New York hotel.' That makes no sense to me. And strategically, I don't care how much money you spend on focus groups, if you're doing that, you're just negating any type of investment you're putting into how to have a conversation with voters.\" Democrats spending millions studying American male \"syntax\" sparked condemnation from conservatives and Democrats alike on social media, Fox News Digital found. FETTERMAN HITS PARTY'S LOSSES AMONG YOUNG MALE VOTERS: 'IT'S UNDENIABLE THAT DEMOCRATS HAVE LOST A LOT' \"Democratic donors treating men like an endangered species on a remote island they need to study probably won’t rebuild trust,\" MSNBC contributor Rotimi Adeoy posted to X in response to the Times' report. \"This kind of top-down, anthropological approach misses the point: people don’t want to be decoded, they want to be understood and met where they are.\" \"The idea that you can \"fix\" the male voter problem that exists with Black, Latino, and white men by spending $20 million to study their syntax like they’re a foreign culture is exactly why there’s a disconnect,\" Adeoy continued. \"These voters aren’t a research subject. They’re citizens.\" Chief political analyst at the Liberal Patriot, Michael Baharaeen, posted to X, \"This really says it all,\" in response to a tweet quoting the article regarding how \"Democratic donors and strategists have been gathering at luxury hotels to discuss how to win back working-class voters, commissioning new projects that can read like anthropological studies of people from faraway places.\" \"The fact that Democrats need to drop $20 million just to figure out how to speak to American men tells you everything you need to know. This is the same move they pull on black people. They don't care about you they only care about your vote!\" conservative podcaster DeVory Darkins posted to X. CRINGEWORTHY PRO-HARRIS AD SHOWCASING MALE SUPPORT FEATURES PROFESSIONAL ACTORS \"Democratic donors are planning to spend $20 million to figure out how to talk to dudes,\" polster Frank Luntz posted to X. A handful of critics reposted a video from the 2024 campaign cycle that featured men declaring they were \"man enough\" to support Harris for president. The grassroots ad went viral in October 2024 as social media commenters panned it as \"the cringiest political ad ever created\" and pointed out it was created by a former producer for Jimmy Kimmel and featured actors vowing support for Harris. The video featured six self-described manly men who claimed they were so masculine that they ate \"carburetors for breakfast\" and were not \"afraid of bears,\" while adding they also do not fear women and would support Harris for the Oval Office. CLICK HERE TO GET THE FOX NEWS APP \"Remember the month before the election and Democrats tried to relate to men?. Now they’re trying again spending $20 million,\" one social media commenter posted this week, accompanied by the October 2024 video.","summary":"Democrats investing $20 million in a study to understand American male voters after losing ground in the 2024 election sparks criticism from both parties.","url":"https://www.foxnews.com/politics/dems-drop-20m-bizarre-american-men-strategy-plan-study-effort-dig-out-2024-political-hole","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/trumpmalevoters.png?ve=1&tl=1","video":null,"publish_date":"2025-05-27 17:53:17","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.081},{"id":325491364,"title":"Skepticism Greets Democrat Strategists’ Plan to Win Back Young Men","text":"Democratic Party strategists are hoping to win back young men through a new $20 million effort called “Speaking With American Men.”\n\nWhat’s being labeled a “Strategic Plan” is an attempt to “study the syntax, language, and content that gains attention and virality in these [online] spaces.” \n\nThe plan recommends buying advertisements in video games and cautions Democrats to “shift from a moralizing tone.” The plan raised some eyebrows after excerpts of it were published by The New York Times, not least because the Democratic National Committee recently announced it might be holding another election in June that could result in the ouster of the youngest male member of the leadership team.\n\nDavid Hogg was elected one of the DNC’s four vice chairs, but faced blowback after he refused to sign a neutrality policy that asked members to avoid activity that would “call into question their impartiality and evenhandedness,” instituted by DNC Chair Ken Martin. Instead, he said he would work to unseat some Democrat incumbent legislators. \n\n“People say they want change in the Democratic Party; but really, they want change so long as it doesn’t potentially endanger their position of power,” Hogg told The New York Times after announcing his intention to seek primary challengers for some Democrat incumbents. \n\nThe DNC has said the vote in June to replace Hogg is unrelated to his comments, but Hogg has objected to redoing the election, saying that it “sends a horrible message to the public about our inability to run elections.”\n\nThe language released about the “Speaking With American Men” plan itself comes across as sterile and anthropological, like what one would see in an academic literature review. Even Democrat California Gov. Gavin Newsom has admitted his own son is a “huge fan” of conservative media influencer Charlie Kirk. \n\nEven before President Donald Trump’s decisive victory in November, political strategists were sounding the alarm about the Democratic Party’s attitude toward male voters in general, and young men in particular. Trump beat Harris among all men by 11 percentage points, 53% to 42%, in an October poll shortly before the election. To be fair to the former vice president, that pattern has emerged before. In the 2000 race, Republican George W. Bush also won men, coincidentally, by 11 points, also 53% to 42%. \n\nDemocrat strategists may be more wary of the decades-long trajectory of the shift to the right of America’s young men. The party is likely to continue to struggle with men in general if young men remain much more politically conservative than the older men they will replace going forward. From 2016 to 2023, fully 12% of young men ages 18 to 29 ceased to identify with or lean toward the Democratic Party.\n\nFormer Chicago Mayor Rahm Emanuel decried the party’s brand more broadly as “weak and woke” in an interview published Monday by The Wall Street Journal. The onetime chief of staff to President Barack Obama, hinting of a possible 2028 White House bid of his own, also described the Democrat brand as “toxic.”\n\nAfter the presidential election, the party’s approval rating sits at just 27%. That’s the lowest it has been since 1990, and it is being felt not just nationally, but also on an individual state basis. After the mass exodus of more conservative-minded voters from New Jersey to Florida and other states over the past five years, Kamala Harris managed to only win blue New Jersey with 52% of the vote.","summary":"Democratic Party strategists are hoping to win back young men through a new $20 million effort called &#8220;Speaking With American Men.” What’s being labeled a... Read More\n\n\nThe post Skepticism Greets Democrat Strategists’ Plan to Win Back Young Men appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/27/skepticism-greets-democrat-strategists-plan-win-back-young-men/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/25.05.27_Schumer.jpg","video":null,"publish_date":"2025-05-27 17:51:45","author":"Jacob Adams,The New York","authors":["Jacob Adams","The New York"],"language":"en","category":"politics","source_country":"us","sentiment":-0.427},{"id":325496014,"title":"Washington Post Offers Voluntary Buyouts to Staffers  With 10 or More Years","text":"The Washington Post announced on Tuesday that it will begin offering voluntary buyouts to staffers with more than 10 years service. \n\nAn internal memo from executive editor Matt Murray, shared to X by Ben Mullin, noted that the move was “part of our ongoing newsroom transformation efforts aimed at reshaping and modernizing the newsroom for the current environment.”\n\nThe Voluntary Separation Program is open to news employees with 10 or more years on staff, as well as to all members of the video department and to all members of the copy desk and sports copy desk, Murray wrote. \n\nHe acknowledged that “reimagining the newsroom” is “disruptive and even uncomfortable.”\n\nMurray also noted, “I want to underscore that the VSP is voluntary, and that we are fortunate we can offer enhanced packages for those who choose them.”\n\nThe package is also being offered to the entire video team and copy desks in a shift to “place greater emphasis on developing repeatable franchises and more personality-driven formats” for YouTube and other social media channels.\n\nHe said that the VSP process will take approximately two months and should be finished by the end of July. \n\nMurray also said that he will name a print editor and welcome former Wall Street Journal deputy editor Jason Anders, whose position as managing editor of of its newly-created News Hub was announced earlier this month. \n\n“With the VSP, we will no doubt see valued colleagues and friends decide to leave the Post. But as stewards of this great institution, we must all remain relentlessly focused on bringing engaging and relevant journalism to growing numbers of readers in the formats and ways they want in 2025,” Murry wrote.\n\nHe concluded his memo by saying, “This is an urgent and important task for us given the pace of technological change, the industry’s evolving landscape and the ever-present need to produce and promote strong, rigorous, and independent journalism.”\n\nThe newspaper is owned by Amazon founder Jeff Bezos and his support of Donald Trump — including nixing an editorial endorsement for Kamala Harris in October and an ad that stated “Fire Elon” in February — prompted a number of resignations. \n\nAmong those who have resigned are commentator Ruth Marcus, columnist David Shipley and Molly Roberts, who wrote about technology and society for The Post’s Opinions section and Pulitzer Prize winner David Hoffman. Sally Buzbee also resigned as executive editor in June 2024.","summary":"The move is part of \"reshaping and modernizing the newsroom for the current environment,\" says executive editor Matt Murray\n\n\nThe post Washington Post Offers Voluntary Buyouts to Staffers  With 10 or More Years appeared first on TheWrap.","url":"https://www.thewrap.com/washington-post-offers-voluntary-buyouts-to-newsroom/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/washington-post-building.jpg","video":null,"publish_date":"2025-05-27 17:47:30","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","category":"politics","source_country":"US","sentiment":0.512},{"id":325502470,"title":"WATCH: Physical fight erupts between female Secret Service agents outside Obama’s house","text":"It appears DEI is still alive and well in the US Secret Service even though there has been a change of guard.\n\nVideo of the physical fight between two female Secret Service Agents outside of Obama’s DC residence was released on Tuesday.\n\nAs previously reported, two female US Secret Service Uniformed Division officers got into a physical fight outside of Barack Obama’s DC residence at 2:30 am last Wednesday.\n\nIt is unclear if anyone was injured or disciplined over the fight.\n\nLast week the audio of the fight was released:\n\n#BREAKING SCOOP: IS DEI STILL PLAGUING THE SECRET SERVICE?\nFRACAS OUTSIDE OBAMA RESIDENCE RAISES NEW QUESTIONS: Get a supervisor “immediately before I whoop this girl’s ass.”\nTwo female Secret Service Uniformed Division officers got into a physical fight outside former… pic.twitter.com/RmEDx6BWXD\n— Susan Crabtree (@susancrabtree) May 22, 2025\n\nThe video shows the two agents in a brawl near a vehicle.\n\n#BREAKING AND EXCLUSIVE: @RCPolitics has obtained video of the fight between two women Secret Service Uniformed Division Officers outside former President Obama’s residence last week after one officer called a supervisor to come before “I whoop this girl’s ass.”\nThe… https://t.co/6BQyQdEcBs pic.twitter.com/9ouSfHh4sN\n— Susan Crabtree (@susancrabtree) May 27, 2025\n\nProblems with Secret Service agents fighting and excessively drinking have plagued the agency for years.\n\nLast year a female secret service agent assigned to Kamala Harris got into a physical fight with other agents at Joint Base Andrews.\n\nAccording to reports, the problem agent, identified as Michelle Herczeg, began acting aggressively, speaking gibberish and shouting incoherently at other agents while they were near the lounge at JBA.\n\nHerczeg reportedly threw menstrual pads at another agent before getting into a brawl a JBA.\n\nRealClearPolitics previously reported that Herczeg grabbed a male agent’s personal cell phone and began deleting apps on it before she completely melted down.\n\nAgent Herczeg had to be physically restrained and her firearm was taken away from her. She was handcuffed and taken to the hospital in an ambulance.\n\n“Herczeg then chest-bumped and shoved her superior, then tackled him and punched him. The agents involved in restraining Herczeg were especially concerned because she still had her gun in the holster. They wrestled her to the ground, took the gun from her, cuffed her, and then removed her from the terminal,” RealClearPolitics reported.\n\nEarlier this year, President Trump announced Sean Curran, one of the agents who surrounded him following the Butler assassination attempt, as the new Secret Service Director.\n\nIt was later reported that Sean Curran was expected to clean house on his first day on the job.\n\n“On incoming Secret Service Director Sean Curran’s first day in the new role, 5-10 senior leadership officials, including former Director Ron Rowe, were warned that they would either be fired, moved, or pressed into retirement, according to three sources in the Secret Service community,” RCP reporter Susan Crabtree said earlier this year.\n\n[Editor’s note: This article originally appeared on The Gateway Pundit.com]","summary":"One woman calls for a supervisor 'immediately before I whoop this girl's a**'","url":"https://www.wnd.com/2025/05/watch-physical-fight-erupts-between-female-secret-service-agents-outside-obamas-house/","image":"https://www.wnd.com/wp-content/uploads/2024/02/beast-car-presidential-limousine-secret-service-white-house-building.jpg","video":null,"publish_date":"2025-05-27 17:40:43","author":"The Gateway Pundit","authors":["The Gateway Pundit"],"language":"en","category":"politics","source_country":"us","sentiment":-0.691},{"id":325485806,"title":"Kamala Harris's went to Australia for the first time and gave a speech that's going viral; here's what she said","text":"Kamala Harris came to Australia for the first time to speak at a big real estate event – the 2025 Australian Real Estate Conference. The event was held on the Gold Coast at the Convention and Exhibition Centre and had 4,500 real estate agents attending, according to the reports. Harris was interviewed on stage for about an hour by John McGrath, a well-known real estate industry expert. She walked on stage to Beyoncé’s “Halo”, joked about being “unemployed right now,” and got a standing ovation, as per the report by Guardian. Harris didn’t name names, but clearly took a shot at Elon Musk, criticizing someone “popular in the press” who said empathy is a weakness in Western civilization. She said real leaders shouldn’t be judged by “who you beat down” but by showing care and curiosity about others.Elon Musk had said in a podcast with Joe Rogan that empathy is a “bug” in Western culture that’s being exploited. Musk also runs the controversial Department of Efficiency under Trump’s administration and has criticized Harris’s party’s immigration policies, according to the report by Daily Beast. Harris warned that these views are dangerous and said people need to remember the 1930s, when fascism was rising in the world. She stressed that “isolation does not equal insulation”, as mentioned in the report by Guardian. Harris said that trust, friendship, honesty, and doing the right thing matter a lot in today’s world. She gave some life lessons from her career, saying she was often the first woman in her role and was told many times, “you’re not ready.” Her motto is “I eat no for breakfast”, as per Guardian report. Harris warned about the risks of AI, saying Americans are worried it could take away jobs or spread lies.She said innovation is great, but we must also make sure vulnerable people are protected. Some stories she told came from her 2019 book, showing how her personal experiences shaped her views, as per reports. She didn’t mention Donald Trump, JD Vance, or her loss in the last US election, but her comments hinted at concerns about the new US government’s direction.Other speakers at the event were Steven Bartlett, a British businessman and podcaster, and David Walker, a real estate agent from Sydney. The event runs until Monday, but organisers didn’t say how much money they paid speakers.Lastly, Musk was seen giving a “Roman salute” at a Trump event and made online jokes about Nazi names, which caused more controversy, as reported by Daily Beast. Musk got embroiled in even more controversies, according to the Daily Beast, after his Roman Salute during a speech at an event, inviting 'Nazi' comparisons from his detractors. FAQsQ1. Why was 1930s a reference in Harris's speech?Harris referred to the 30s as a reference to the great depression and other international issues of that time.Q2. Which statement of Musk's did Kamla Harris didn't agree with?Musk had said before that empathy tends to weaken people, which Harris said she doesn't endorse.","summary":"Kamala Harris spoke at a big real estate event in Australia, where she shared her views on leadership, AI, and world politics. She also seemed to criticise Elon Musk’s comments on empathy, warning people to learn from history.","url":"https://economictimes.indiatimes.com/news/international/us/kamala-harriss-went-to-australia-for-the-first-time-and-gave-a-speech-thats-going-viral-heres-what-she-said/articleshow/121445370.cms","image":"https://img.etimg.com/thumb/msid-121445548,resizemode-4,width-1200,height-900,imgsize-37316,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-27 17:30:02","author":"Global Desk","authors":["Global Desk"],"language":"en","source_country":"in","sentiment":0.176},{"id":325477272,"title":"Washington Post columnist Jonathan Capeheart quits editorial board over dispute with white colleague: ‘Robbing me of my humanity’","text":"A black Washington Post opinion writer said he quit the newspaper’s editorial board over a dispute with a white colleague about a piece concerning Georgia’s voting laws that he didn’t agree with — accusing her of “robbing me of my humanity,” according to a report.\n\nJonathan Capehart, who was the only African American member of the editorial board when he quit in 2023, writes in a new book titled “Yet Here I Am: Lessons from a Black Man’s Search for Home,” that he stepped down over a dispute with another opinion editor, Karen Tumulty, the news site Semafor reported.\n\nIn his book, Capehart, who remains a columnist at the paper, writes that he clashed with Tumulty over an editorial which took issue with then-President Joe Biden’s criticism of a 2021 Georgia voting law.\n\nBiden described the law as “Jim Crow 2.0” — a characterization that the Washington Post editorial board deemed to be “hyperbolic.”\n\nThat didn’t sit well with Capehart, who agreed with Biden’s view of the law and was upset that the editorial may make it appear as if he supported the board’s position that it was “hyperbolic,” according to Semafor.\n\nAccording to the book, Capehart was incensed when Tumulty later did not apologize to him for publishing it. He wrote that he felt additionally put off when Tumulty said Biden’s choice of words was insulting to people who had lived through racial segregation in the South.\n\n“Tumulty took an incident where I felt she ignored and compounded the insult by robbing me of my humanity,” he wrote in the book, which was published last week.\n\n“She either couldn’t or wouldn’t see that I was black, that I came to the conversation with knowledge and history she could never have, that my worldview, albeit different from hers, was equally valid.”\n\nCapehart left the editorial board after complaining about the incident to human resources and other senior figures at the paper, Semafor reported.\n\nCapehart’s frustrations were notable enough that after the piece was published, opinion editor David Shipley was asked to meet privately with the Rev. Al Sharpton to discuss the incident and alleged shortcomings in the paper’s opinion coverage, Semafor reported.\n\nThe claims made by Capehart in his new book have also reportedly rankled Washington Post staffers, according to Semafor.\n\nCapehart’s description of the incident in his book as well as a recent discussion that he held with former Biden administration official Susan Rice at a local Washington, DC, bookstore last week has been the subject of internal recriminations at the newspaper in recent days, Semafor reported.\n\nAccording to two Washington Post staffers, staff have complained privately that the book publicly pitted current colleagues against each other and appeared to run afoul of the Post’s editorial guidelines around collegiality, as well as rules that restrict staff from publicly disclosing internal editorial conversations.\n\nThe Post has sought comment from the Washington Post, Tumulty and Capehart.\n\nIn a statement to Semafor, Tumulty noted that the paper had repeatedly published opinion pieces criticizing Georgia’s 2021 voting laws limiting ballot access, but said she would not comment further on the book or the Post’s editorial processes.\n\n“I have a very different recognition of the events and conversations that are described in this book, but out of respect for the longstanding principle that Washington Post editorial board deliberations are confidential I am not going to say anything further,” Tumulty told Semafor.\n\nSome current and former staff told Semafor that they felt Capehart’s decision to go after Tumulty in a book and on his book tour over an editorial disagreement, as well as the actual description of the incident, was unfair to her.\n\n“Ed board members, current and former, are honor bound not to discuss specific deliberations publicly,” former deputy opinion editor Chuck Lane said in a text to Semafor.\n\n“I can only say that Karen took an unsought leadership role when the paper needed her, and performed it superbly and 100 percent honorably, despite extraordinary health challenges — for which I admire her greatly.”\n\nThe Washington Post editorial board has undergone considerable upheaval in the last nine months.\n\nJust before the Nov. 5 presidential election, billionaire owner Jeff Bezos blocked the editorial board from endorsing the Democratic nominee, then-Vice President Kamala Harris.\n\nEarlier this year, Bezos overhauled the opinion section so that it would promote “personal liberties” and “free markets” — a move that prompted the resignation of Shipley.","summary":"A black Washington Post opinion writer said he quit the newspaper&#8217;s editorial board over a dispute with a white colleague about a piece concerning Georgia&#8217;s voting laws that he didn&#8217;t agree with &#8212; accusing her of &#8220;robbing me of my humanity,&#8221; according to a report. Jonathan Capehart, who was the only African American member of...","url":"https://nypost.com/2025/05/27/media/washington-post-columnist-jonathan-capeheart-quits-over-dispute-with-white-colleague/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/105403481.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-27 17:22:13","author":"Ariel Zilber","authors":["Ariel Zilber"],"language":"en","source_country":"us","sentiment":-0.312},{"id":325478502,"title":"Tom Morello Mocks Trump's Crowd Sizes While Defending Bruce Springsteen","text":"Rage Against the Machine guitarist Tom Morello raged against Donald Trump on Sunday, hitting back at the president for criticizing music legend Bruce Springsteen.Newsweek has reached out to the White House seeking comment.Why It MattersTrump is a prolific social media user and many of his posts are targeted at his critics. When they or their supporters have hit back, it has often resulted in a public slanging match between the president and certain celebrities, whether across social media or in real-life arenas.Tensions between Springsteen and Trump started when the rocker denounced the administration in the opening remarks of his tour in Manchester on Wednesday night, resulting in the president lashing out in response.What To KnowMorello unleashed a diatribe against Trump during his performance at the Boston Calling music festival over the weekend, defending Springsteen after the latter drew the president's wrath recently. The artist suggested Trump's issue with Springsteen stemmed from jealousy over the crowd size The Boss could attract, according to Rolling Stone.Earlier this month, Springsteen branded Trump an \"unfit president\" who was in charge of \"a rogue government\" that was \"corrupt, incompetent and treasonous\" in front of a British crowd during his Land of Hope and Dreams Tour.Trump swiftly fired back with a post on Truth Social on May 16. \"I see that Highly Overrated Bruce Springsteen goes to a Foreign Country to speak badly about the President of the United States,\" he began.\"Never liked him, never liked his music, or his Radical Left Politics and, importantly, he's not a talented guy—Just a pushy, obnoxious JERK, who fervently supported Crooked Joe Biden, a mentally incompetent FOOL, and our WORST EVER President, who came close to destroying our Country...This dried out 'prune' of a rocker (his skin is all atrophied!) ought to KEEP HIS MOUTH SHUT until he gets back into the Country, that's just 'standard fare.' Then we'll all see how it goes for him!\"It wasn't long before other musicians leaped to Springsteen's defense.Neil Young said he agreed with \"Bruce and thousands of musicians\" that Trump was \"ruining America,\" while Pearl Jam's Eddie Vedder said Springsteen was \"a true American\" and urged Trump to \"wake up!\"Trump has called for a \"major investigation\" into celebrities who aided Kamala Harris' 2024 election campaign, including Bruce Springsteen, saying their appearances were potentially illegal contributions.The 75-year-old musician has previously endorsed Democratic candidates including former Presidents Barack Obama and Joe Biden and ahead of the 2024 presidential election described Trump as the \"most dangerous candidate for president\" in his lifetime.What People Are SayingRage Against the Machine star Tom Morello told the Boston Calling crowd, according to Rolling Stone : \"Bruce is going after Trump because Bruce, his whole life, he's been about truth, justice, democracy, equality. And Trump is mad at him because Bruce draws a bigger audience. F*** that guy.\"The star also showed the audience that the words \"F*** ICE [Immigration and Customs Enforcement]\" were emblazoned across the back of his guitar.He then went on to say the Boston gig, complete with anti-Trump rhetoric, could be \"the last big event before they throw us all in jail.\"Bruce Springsteen, speaking at a concert: \"In my country, they're taking sadistic pleasure in the pain they inflict on loyal American workers. They're rolling back historic civil rights legislation that has led to a more just and plural society. They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won't bow down to their ideological demands.\"What Happens NextTrump has not yet commented on Morello's outburst.","summary":"\"Trump is mad at him because Bruce draws a bigger audience,\" Rage Against the Machine's Tom Morello told concertgoers.","url":"https://www.newsweek.com/tom-morello-donald-trump-bruce-springsteen-2077565","image":"https://d.newsweek.com/en/full/2652193/tom-morello.jpg","video":null,"publish_date":"2025-05-27 17:14:25","author":"Chloe Mayer","authors":["Chloe Mayer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.235},{"id":325475292,"title":"CBS, International Brotherhood of Electrical Workers Reach New Tentative Agreement","text":"The International Brotherhood of Electrical Workers (IBEW) has reached a new tentative agreement with CBS that the union is calling “one of the most significant wage packages in the nearly 90-year history of the relationship.”\n\nThe pact also establishes “joint frameworks for dialogue and cooperation” on issues such as artificial intelligence and new technologies to work collaboratively and solve issues without workplace disruption. \n\n“This tentative agreement reflects a new era of partnership and progress that recognizes the important contributions of IBEW-represented technicians while embracing the challenges and opportunities of the future,” IBEW International President Kenneth W. Cooper said in a statement. ” From news and sports to streaming and operations, IBEW members are the engine behind CBS’s continued success, just like they have been since 1939. We believe this agreement not only speaks to CBS’s commitment to national and local broadcasting, it also reinforces the value of skilled union labor and reflects a shared vision for adapting to the fast-evolving media landscape.”\n\n“The skilled technicians and valued employees represented by IBEW have been a bedrock of CBS’s success since the early days of television, and that continues as we chart our future together,” Paramount Global co-CEO and CBS president George Cheeks added. “I want to thank IBEW leaders Kenneth Cooper and Robert Prunn for setting the tone in a collaborative, forward-looking negotiation that worked through issues together and delivered value for all our stakeholders.”\n\nFinancial terms of the deal were not disclosed. \n\nThe new agreement with IBEW comes as Paramount is awaiting regulatory approval from the FCC for its pending $8 billion merger with Skydance Media. \n\nThe deal, which is expected to close in the first half of 2025, recently triggered its first 90-day extension.If the deal is not closed by July 6, the deadline will be automatically pushed another 90 days to Oct. 4. After that, if the deal is still not closed, or if a regulator blocks the merger or one of the parties involved breaches the terms of the agreement, then Skydance and Paramount will have the option of terminating the deal. Exercising that option would leave Paramount on the hook to pay Skydance a $400 million breakup fee. \n\nAmong those who have met with the FCC expressing opposition to the deal is Hollywood’s Teamsters union, which has asked the agency to “memorialize Skydance’s pro-worker commitments as a merger condition, or encourage the parties to reach an agreement on how best to protect workers post-transaction.”\n\nIn addition to its regulatory review, the FCC has launched a “news distortion” investigation into an Oct. 7 “60 Minutes” interview with former Vice President Kamala Harris. That interview is also the subject of a $20 billion lawsuit from President Donald Trump, who CBS is currently in mediation talks with about a potential settlement.","summary":"The union said the pact is \"one of the most significant wage packages in the nearly 90-year history of the relationship\"\n\n\nThe post CBS, International Brotherhood of Electrical Workers Reach New Tentative Agreement appeared first on TheWrap.","url":"https://www.thewrap.com/cbs-ibew-tentative-agreement/","image":"https://www.thewrap.com/wp-content/uploads/2023/04/CBS-logo-2023.jpeg","video":null,"publish_date":"2025-05-27 17:04:04","author":"Lucas Manfredi","authors":["Lucas Manfredi"],"language":"en","category":"politics","source_country":"US","sentiment":0.275},{"id":325500356,"title":"’60 Minutes’ Anchor Ruins Graduation With Deranged Anti-Trump Tirade","text":"The last cable news holdovers have an excuse for their growing irrelevancy: It’s everybody else’s fault. But mostly Trump’s. \n\n“Our sacred rule of law is under attack,” “60 Minutes” anchor Scott Pelley told Wake Forest University’s class of 2025 in a commencement speech. “Journalism is under attack. Universities are under attack. Freedom of speech is under attack. And insidious fear is reaching through our schools, our businesses, our homes, and into our private thoughts.” \n\nPelley is right on one count. Freedom of thought is the fundamental freedom. But it’s the left that has spent decades eroding that freedom. Their obsession with “isms” goes beyond controlling what you’re allowed to say or do (or who you have to bake a cake for). It’s an obsession with making sure you think along the right (HR approved) lines. \n\nPelley continued to rage against the Trump administration as faculty and students looked on, seemingly mystified. \n\n“Why attack universities? Why attack journalism? Because ignorance works for power. First, make sure the truth seekers live in fear,” he added. \n\nPelley identifying as a “truth-seeker” is about as plausible as a man identifying as a woman. CBS News, which produces “60 minutes,” is currently facing a $20 billion lawsuit from Trump. The lawsuit alleges the network deceptively edited a “60 Minutes” interview with then Vice President Kamala Harris to “tip the scales in favor of the Democratic Party.”\n\n“Power can rewrite history with grotesque false narratives. They can make criminals heroes and heroes criminals. Power can change the definition of the words we use to describe reality. Diversity is now described as illegal. Equity is to be shunned. Inclusion is a dirty word.” \n\nThe left would now like us to believe they’re attached to some sort of fundamental principles. This is untrue. They are in the business of power. They need it to prop up otherwise ridiculous claims. Unfortunately for him, Pelley isn’t adroit enough to disguise his own hypocrisy. Turning criminals into civic heroes is the left’s favorite pastime. Every year, leftists celebrate the anniversary of George Floyd, a convicted criminal and fentanyl user. Recently, Democrats latched on to Kilmar Abrego-Garcia, an alleged MS-13 gangbanger accused (by his wife) of beating his wife. What’s more, the left is constantly engaged in rhetorical warfare. Mutilation of healthy body parts is now “gender affirming care.” Killing a child in the womb is “choice.” You get the picture. (RELATED: Liberals’ ‘Fiery But Mostly Peaceful’ Revolution Dead On Arrival)\n\nHis description of diversity, equity, and inclusion makes even less sense. No one is quibbling over the definition of diversity. It’s a synonym for heterogeneity. What is up for debate is whether diversity is good, in and of itself. It’s not. Nor is equity. Nor is inclusion for its own sake. The primary end of higher education, for instance, should be to cultivate the mind. So-called “sexual diversity” is not an obvious aid to that goal. \n\nPelley digressed from raving against Trump to share a personal story. “In the 1980s, I was rejected by CBS News over and over and over again, over years. They told me at one point, ‘Please stop applying.’ They did. And at the time, I thought, ‘What’s wrong with these people?’ They couldn’t hear the song in my heart.”\n\nOne wonders what song is playing in Pelley’s heart. One is grateful they cannot hear it either.\n\nFollow Natalie Sandoval on X: @NatalieIrene03","summary":"'Journalism is under attack. Universities are under attack'","url":"https://dailycaller.com/2025/05/27/scott-pelley-cbs-wake-forest-university-commencement-speech-donald-trump/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/GettyImages-452193809-scaled-e1748359518385.jpg","video":null,"publish_date":"2025-05-27 16:13:19","author":"Natalie Sandoval","authors":["Natalie Sandoval"],"language":"en","source_country":"us","sentiment":-0.096},{"id":325458490,"title":"Democratic strategists question influence of Obama-era campaign operatives in party's future","text":"Some Democratic strategists are questioning the role campaign operatives — who are associated with former President Barack Obama's presidential campaigns — will play going forward as the Democratic Party scrambles to move forward after former Vice President Kamala Harris' loss. \"I’m sorry — I don’t want a surgeon who keeps killing patients,\" Democratic strategist Chris Kofinis told NBC News about the set of Obama-era campaign operatives who contributed to several modern Democratic campaigns. \"It’s pretty easy to win with a guy like Obama.\" Several of those who led Obama's campaigns also worked for Harris in 2024, as well as former President Joe Biden, until he dropped out and lost to President Donald Trump. Obama campaign alums Jen O'Malley Dillion and Stephanie Cutter worked on Harris' campaign. Other former Obama campaign aides, Mitch Stewart and Rufus Gifford, worked on Biden's campaign as well, NBC News reported. DNC Finance Chair Chris Korge called out David Plouffe, Obama's 2008 campaign manager and an advisor to Harris' campaign, in an interview with NBC News earlier this month. Plouffe placed blame for Harris' loss on Biden, telling authors Jake Tapper and Alex Thompson that the former president \"totally f----- us.\" EX-OBAMA CAMPAIGN MANAGER JOINS HARRIS TEAM, VP KEEPS REST OF BIDEN'S SQUAD IN TACT \"To blame Biden now is to shift the accountability from the people who lost the race: the consultants, the so-called gurus,\" Korge said during the interview. \"It’s time to re-evaluate the use of consultants and bring in new forward-looking people.\" \"The old Obama playbook no longer works,\" Korge added. Another Democratic strategist, Mike Nellis, told NBC News that the Democratic Party had nostalgia for the Obama era, but noted that the politics have changed. \"One of the challenges the Democratic Party does have is that there is nostalgia for the Obama era, both in terms of Barack Obama being in the White House and what that meant for the country and the style of leadership that we have, but also like the style of our politics,\" Nellis said. \"There’s been a de-evolution of our politics over the last 10 years, and it’s just a very different era.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURENebraska Democratic Party chair Jane Kleeb detailed an anecdote about how she responded to Republican attacks with regard to transgender issues in a mayoral election in Omaha. The Democratic candidate, John Ewing, ended up beating the Republican candidate, Jean Stothert. \"I didn’t contact the Pod Save America guys or a New York press firm to say, ‘how do I handle this?’\" Kleeb said. \"Our team literally got into the conference room at our state party office and said, ‘Let’s throw out ideas on how we can push back on this, because we’re not going to let them take down John Ewing on this bulls--- again.’\" Kleeb added that she wanted all the operatives at the table, and spoke out against \"intraparty fighting.\" Another ex-Obama campaign aide, Steve Schale, defended Plouffe and called him \"one of the sharpest guys around.\" Chuck Rocha, a former Bernie Sanders campaign advisor, pointed out that the campaign consultants are usually locked-in with candidates before they even announce their campaigns. JON STEWART, 'POD SAVE AMERICA' QUESTION BIDEN'S HEALTH IN WAKE OF 'ORIGINAL SIN' BOOK \"Most of these same consultants have locked in these candidates before they ever announce, and so there’s never any opportunity for any new blood to be a part of these campaigns,\" Rocha said. \"They’re all connected.\" David Hogg, a DNC vice chair, told NBC that the party's political operatives hold on to power for too long, comparing them to several Democratic lawmakers in power. He also said young voters don't really have a memory of Obama's presidency. \"I don’t think they have one to be honest with you. That’s part of the challenge,\" Hogg said. \"For many of these younger people who are under the age of 20, right now… they don’t remember much of what Obama talked about. They grew up in the political context of Donald Trump and him being normalized, because that was what politics was to them growing up.\" After Harris lost, Plouffe, Dillion, Cutter and Quentin Fulks, all part of her campaign operation, joined the co-hosts of Pod Save America, a podcast hosted by all ex-Obama aides, to discuss what went wrong in the election. CLICK HERE TO GET THE FOX NEWS APP Liberal critics accused them of gaslighting and taking no accountability for the loss.","summary":"As the Democratic Party weighs their future, strategists question the influence of Obama-era operatives as some call for a new approach following Kamala Harris&apos; defeat.","url":"https://www.foxnews.com/media/democratic-strategists-question-role-obama-campaign-operatives-partys-future","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/03/931/523/barack-obama.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 16:10:14","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.252},{"id":325469038,"title":"FBI deputy director says Biden-era investigations being reexamined","text":"FBI deputy director Dan Bongino announced early Monday that three high-profile cases are being reexamined: The investigations into the 2021 D.C. pipe bombings, cocaine found in the White House in 2023 and the 2022 leak of the Supreme Court's Dobbs decision ending the federal right to an abortion.\"Shortly after swearing in, the Director and I evaluated a number of cases of potential public corruption that, understandably, have garnered public interest,\" Bongino said in a statement. \"We made the decision to either re-open, or push additional resources and investigative attention, to these cases.\" Bongino said he has requested weekly updates on these cases, and \"we are making progress.\"The identity of the person who planted two pipe bombs on Capitol Hill the night before the Jan. 6, 2021, riot, remains a mystery over four years later. Occurring in the final days of the first Trump administration, the incident was mainly investigated by the FBI during the Biden administration, under Christopher Wray, who was FBI director from 2017 through January 2025, and resigned shortly before President Trump took office. Mr. Trump tapped allies Kash Patel as FBI director and Bongino as his deputy. The earliest case that Bongino announced was being reexamined occurred when pipe bombs were discovered by a passerby around 1 p.m. Jan. 6, 2021, at the Democratic National Committee headquarters and near the Republican National Committee headquarters as Mr. Trump's supporters stormed the U.S. Capitol in an attempt to stop Congress from certifying the 2020 election results. Both buildings are near the Capitol. Investigators believe both pipe bombs were left between 7:30 and 8:30 p.m. on Jan. 5. Former Vice President Kamala Harris, who was the vice president-elect at the time, was evacuated from the Democratic National Committee headquarters when the devices were recovered. No suspect has ever publicly been named, although earlier this year, investigators released security camera video showing the suspect sitting on a park bench, reaching into his backpack and planting a pipe bomb outside the DNC. According to a report obtained by CBS News in March 2021, the bombs contained only one method of detonation — a 60-minute kitchen timer. The devices did not go off, and when and whether they were meant to explode remains unclear. But the FBI said its analysis concluded the pipe bombs were viable and posed a danger to the public.Another case Bongino plans to reexamine is the 2022 leak of the Supreme Court's draft opinion in the Dobbs case, which sought to overturn the 1973 Roe decision that made abortion legal nationwide. A draft opinion of a Supreme Court had never before been leaked, and at the time, Chief Justice John Roberts denounced the leak as a \"betrayal\" and \"a singular and egregious betrayal of trust\" that would be fully investigated. An eight-month investigation was conducted by the marshal of the Supreme Court, who consulted with former Homeland Security Secretary Michael Chertoff, but investigators were unable to find the leaker. In a 20-page report released with a Supreme Court statement saying the leaker could not be identified, Marshal of the Supreme Court Gail Curley said it is \"unlikely\" the leak stemmed from a hack of the court's IT systems by a person outside the court. But after examining the Supreme Court's computer devices, networks, printers and available call and text logs, investigators found \"no forensic evidence indicating who disclosed the draft opinion.\"The final case cited by Bongino was the discovery of cocaine at the White House on July 2, 2023. The Secret Service closed the investigation after 11 days, saying it had compiled a list of \"several hundred\" people who may have accessed the area where the substance was discovered. But no fingerprints could be found on the cocaine's packaging and there was \"insufficient DNA\" for \"investigative comparisons,\" the Secret Service said at the time.","summary":"FBI deputy director Dan Bongino said three high-profile investigations are being reexamined.","url":"https://www.cbsnews.com/news/dan-bongino-fbi-cases-reexamined/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/05/26/59942627-d99a-438e-98ed-bceaac953b43/thumbnail/1200x630g2/22e8466ecb1968d4f80e2c1e4d843f00/gettyimages-1156720731.jpg?v=48f078ae8a74a1412614b0db6f935e48","video":null,"publish_date":"2025-05-27 16:03:48","author":"Caroline Linton","authors":["Caroline Linton"],"language":"en","category":"politics","source_country":"US","sentiment":-0.351},{"id":325561980,"title":"Analysis Finds Nearly Half Of Chicago Mayor Brandon Johnson’s Appointees Are Black Amid DOJ Probe","text":"Source: Scott Olson / Getty Last week, we reported that the U.S. Department of Justice’s Civil Rights Division launched an investigation into the hiring practices of Chicago Mayor Brandon Johnson. The investigation appears to be prompted by a single conversation in which the mayor boasted about the diversity during a sit-down with Bishop Byron Brazier of the Apostolic Church of God. “There are some detractors that will push back on me and say, ‘The only thing the mayor talks about is the hiring of Black people,’” Johnson told Brazier, according to local newsletter WTTW. “No. What I’m saying is when you hire our people, we always look out for everybody else. We are the most generous people on the planet. I don’t know too many cultures that have play cousins.” WTTW published an analysis of the racial and breakdown of Johnson appointees over the last two years and found that nearly half the officials he has hired to important positions in the city are Black. The analysis also found that more than half of his appointees are women. Now, does the demographic breakdown of Johnson’s administration perfectly reflect the city’s demographic makeup? Not really, but it’s close enough that Trump officials wouldn’t have even noticed any perceived racial disparity if there wasn’t a video that showed Johnson boasting about diversity. Either way, the MAGA-fied probe into his hiring practices seems to represent a continuation of the Trump administration’s practice of abusing its power to wage its propaganda-reliant war on DEI. That effort is especially rich coming from an administration that has been overwhelmingly filled with woefully underqualified white people who barely go a day without demonstrating how much they don’t even know about the offices they have been appointed to, which Johnson recently noted in response to the DOJ investigation into his office. “My administration reflects the country, reflects the city,” Johnson said. “His (Trump’s) administration reflects the country club.” According to WTTW, approximately 47% of the Chicagoans Johnson appointed to various offices over the past two years were Black. Another 22% were white, 24% were Latino and 5% were Asian. According to the 2020 U.S. census, Chicago is 31.4% White, 29.9% Latino, 28.7% Black and 6.9% Asian. The analysis of Johnson’s appointees is broken down into three categories: departments, boards and committees that require City Council confirmation; Johnson’s closest advisors; and his appointments to the Chicago Board of Education. From WTTW: Of the nearly 75 appointments Johnson made that required City Council confirmation, 48% were Black. Another 23% were White, another 23% were Latino and 5% were Asian, according to WTTW News’ analysis. The appointments were evenly split between men and women, according to the analysis. Nearly half of Johnson’s 25-member senior staff is Black; the staff is nearly equally divided between men and women, according to the analysis. Latino Chicagoans make up 24% of his senior staff, with White Chicagoans making up another 24%, according to the analysis. Johnson has one Asian American among his senior staff, according to WTTW News’ analysis. In all, 105 people serve in the mayor’s office, according to an analysis released by Johnson’s office in the wake of the announcement of the federal probe. They are 34% Black, 30% White, 24% Latino and 7% Asian American, officials said. After the members of the Chicago Board of Education that the mayor appointed in July 2023 resigned in October amid a budget crisis, Johnson appointed 13 members to replace them and serve on the first partially elected board to run Chicago Public Schools. Approximately 46% of the Chicagoans Johnson appointed to the school board were Black, including board president Sean Harden. Another 30% were Latino, another 15% were Latino and 8% were Asian, according to WTTW News’ analysis. Nearly 70% were women, according to the analysis. So, is Johnson prioritizing the hiring of Black people, or does he hire so many Black people because so many Black people happen to be qualified? Or is it both? Actually, a better question is this: Is President Donald Trump’s administration about to dig into the racial breakdown of city appointees in every city in America, and will it launch investigations into any city that has disproportionately hired white people? If we’re being honest, we already know the answer. SEE ALSO: Trump’s DOJ Thinks Chicago Mayor Brandon Johnson Hired Too Many Black People, So It Launched An Investigation Trump Wants To Investigate Bruce Springsteen, Kamala Harris, Oprah And Beyoncé After Springsteen Dragged Him","summary":"Nearly half of Chicago Mayor Brandon Johnson’s senior staff and his picks are Black and more than half are women.","url":"https://newsone.com/6186402/chicago-mayor-brandon-johnsons-nearly-half-appointees-black-amid-doj-probe/","image":"https://newsone.com/wp-content/uploads/sites/22/2025/05/1748360132614.jpg?quality=80&strip=all&w=1024&crop=0,0,100,683px","video":null,"publish_date":"2025-05-27 16:00:00","author":"Zack Linly","authors":["Zack Linly"],"language":"en","source_country":"US","sentiment":-0.182},{"id":325445942,"title":"Dem strategy session to stop hemorrhaging of male voters ridiculed","text":"More than six months after the Democratic Party suffered major setbacks in the 2024 elections, the party is seeking a path to escape the political wilderness. Part of that effort includes a recent gathering by top party consultants and donors trying to figure out how Democrats can improve outreach to male and working-class voters. President Donald Trump won back control of the White House while Republicans flipped the Senate and defended their fragile House majority in November, and the GOP made gains among Black and Hispanic voters, as well as younger voters – all traditional members of the Democratic Party's base. \"Everything we've done up to this point has resulted in re-electing Donald Trump,\" longtime Democratic strategist and communicator Joe Caiazzo told Fox News Digital. OPINION: WHAT DEMOCRATS NEED TO DO TO WIN AGAIN \"If anyone tells you that we don't have to course correct, they don't know what they're talking about,\" added Caiazzo, a veteran of Sen. Bernie Sanders 2016 and 2020 presidential campaigns. In the face of Trump's sweeping and controversial moves since his return to the White House in January, an increasingly angered and energized base of Democrats is pushing for party leaders to take a stronger stand in leading the resistance to the president and Republicans. The anger directed not only at Trump and Republicans, but also at fellow Democrats, appears to be a factor in the party's polling woes, with Democratic Party favorable ratings sinking to historic lows. WATCH: DEMOCRATS' PARTY CHAIR MAKES CASE IN ‘FOX NEWS SUNDAY’ APPEARANCE Democratic National Committee (DNC) Chair Ken Martin vows the party will compete in all 50 states going forward. In an interview earlier this month on \"Fox News Sunday,\" Martin highlighted that the party's focus right now is \"squarely on making sure that we stand up for hardworking Americans who are being left behind in this Trump economy.\" A 2024 election DNC postmortem is currently underway, with the findings expected to be issued later this year. However, grabbing the spotlight in recent days was a gathering hosted by the Democrat-aligned super PAC Future Forward at a luxury resort along the California coast. Among the strategy discussions at the gathering was a $20 million effort titled, \"Speaking with American Men: A Strategic Plan.\" The recommendations of the effort, which is code-named SAM, included having Democrats drop what is described as a \"moralizing tone\" toward male voters, changing the party's language used toward men and purchasing more ads on video games as part of male outreach. Some former key staffers on the 2024 campaign of former President Joe Biden and former Vice President Kamala Harris, who replaced Biden as the party's nominee last summer, heavily criticized the effort, which was first reported by the New York Times and later confirmed by Fox News. \"Instead of studying working-class voters and men, why doesn’t the Democratic Party donor class go out and meet some? What the hell is this?\" James Singer, a spokesman for the 2024 campaign, wrote in a social media post. \"As a Democrat, it’s embarrassing.\" It was a similar message from Ammar Moussa, another veteran Democratic strategist and communicator who worked on the Biden and Harris campaigns. \"This is embarrassing. Truly,\" Moussa wrote on X. Democrats have long had a problem attracting male voters in presidential elections. Trump won the male vote by 12 points over Harris in the 2024 presidential election, and according to the Fox News Voter Analysis, that margin ballooned to 15 points among men 45 and older. Fast-forward to this spring, and the Democrats' ratings stood underwater in the latest Fox News national poll at 41% favorable and 56% unfavorable in a survey conducted April 18-21. That is an all-time low for the Democrats in Fox News polling, and for the first time in a decade, the party's standing was lower than that of the GOP, which stood at 44% favorable and 54% unfavorable. The figures were reversed last summer, when Fox News last asked the party favorability question in one of its surveys. HEAD HERE FOR THE LATEST FOX NEWS POLLING The Fox News poll was far from an outlier. The Democratic Party's favorable ratings were well in negative territory in a Pew Research national survey - 38% favorable, 60% unfavorable - conducted in early April and at 36% favorable, 60% unfavorable in a Wall Street Journal poll in the field a couple of weeks earlier. Additionally, national polls conducted in February by Quinnipiac University and March by CNN and by NBC News also indicated the favorable ratings for the Democratic Party sinking to all-time lows. However, there is more. Confidence in the Democratic Party's congressional leadership also sunk to an all-time low, according to a Gallup poll conducted early last month. The confidence rating for Democrats' leadership in Congress stood at 25% in the survey, which was nine points below the previous low of 34% recorded in 2023. The semi-annual Harvard Youth Poll, which was released late last month, indicated that approval ratings for Democrats in Congress among Americans aged 18-29 nosedived. An ABC News/Washington Post/Ipsos poll conducted in mid-April indicated that more respondents trusted Trump (40%) than Democrats in Congress (32%) to handle the nation's main problems. Additionally, a Reuters/Ipsos poll conducted late last month suggested Republicans hold a significant advantage over Democrats on two top issues: the economy and immigration. CLICK HERE TO GET THE FOX NEWS APP \"If Democrats want to be competitive in this country and build lasting majorities in both chambers and be competitive for the White House, we've got to broaden the tent,\" Caiazzo insisted. He lamented that Democrats have \"become hyper-focused on a certain set of issues that only speak to a certain set of people while letting the most important issues of the day fall by the wayside. Every single day, Democrats should be focused on how we make things better for working people. And the way we deliver that message has got to meet people where they are.\"","summary":"Facing criticism and low favorability, Democrats hold strategy talks to address outreach to male voters and improve their standing after 2024 election setbacks.","url":"https://www.foxnews.com/politics/democrat-strategy-session-stop-hemorrhaging-male-working-class-voters-criticized","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/6d9939e8-kamala-harris-democratic-convention-address-chicago-8-22-24-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 15:34:45","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","category":"politics","source_country":"US","sentiment":-0.076},{"id":325465626,"title":"Scott Pelley Further Damages 60 Minutes' Credibility With Anti-Trump Commencement Speech","text":"CBS continues to brand \"60 Minutes\" as a straight-news program, despite obvious evidence to the contrary. Meanwhile, show anchor Scott Pelley spent his weekend spreading Democratic talking points about Donald Trump at a Wake Forest University commencement speech. \"Your country needs you—the country that has given you so much is calling you, the class of 2025. Your country needs you, and it needs you today,\" Pelley said during his grandiose sermon-like speech. Pelley began before warning that an \"insidious fear\" has infiltrated schools, businesses, and homes across the nation. He then told the students, without citing any examples, that free speech is under attack by the current administration. \"This morning our sacred rule of law is under attack. Journalism is under attack, universities are under attack, freedom of speech is under attack and insidious fear is reaching throughout schools, our businesses, our homes and into our private thoughts,\" he continued. \"The fear to speak in America. If our government is, in Lincoln’s phrase ‘of the people, by the people, for the people,’ then why are we afraid to speak? Ignorance works for power. Power can change the definition of the words we used to describe reality. This is an old playbook, my friends. There is nothing new in this.\" Oh. And where was this fear when free speech was actually put in jeopardy during the Biden administration, when leaked documents confirmed that the White House pressured social media companies to censor political content to its advantage? Anyone? Pelley recently criticized parent company Paramount on air for reportedly trying to tone down the anti-Trump propaganda on its flagship news program. He believes his bosses are suppressing free speech to appease Trump. However, that's not true. In reality, the top brass at Paramount is responding, according to Pelley's show editing an interview with Kamala Harris, fawning over censorship laws in Germany (speaking of free speech), falsely accusing Tulsi Gabbard of assuring Russia, and sympathizing more with Hamas terrorists than hostages. Scott Pelley is a hack. Anyone who has watched \"60 Minutes\" over the past nine months knows that.","summary":"Scott Pelley further damages 60 Minutes&apos; credibility with anti-Trump commencement address.","url":"https://www.outkick.com/analysis/scott-pelley-further-damages-60-minutes-credibility-anti-trump-commencement-speech","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/05/gettyimages-2151212544.jpg","video":null,"publish_date":"2025-05-27 15:27:47","author":"Bobby Burack","authors":["Bobby Burack"],"language":"en","source_country":"us","sentiment":-0.108},{"id":325445938,"title":"’60 Minutes’ correspondent ripped as ‘fraud’ and ‘liar’ for anti-Trump commencement speech","text":"Prominent conservative social media users tore into \"60 Minutes\" correspondent Scott Pelley for slamming President Donald Trump during a recent commencement speech. After the CBS News reporter accused the Trump administration of attacking journalists and universities and creating a spirit of fear for \"truth seekers\" in the country during his address to Wake Forest University graduates earlier this month, conservatives took to X to blast the \"pompous\" media figure. \"Pompous CBS journalist Scott Pelley closed his commencement address at Wake Forest by telling graduates they ‘are the fierce defenders of democracy, the seekers of truth,' and ‘the vanguard against ignorance’ that’s taken over the country (i.e. Trump),\" the Media Research Center’s Curtis Houck wrote. CBS NEWS CEO WENDY MCMAHON ABRUPTLY RESIGNS, CITES DISAGREEMENT WITH COMPANY AMID ‘CHALLENGING’ PERIOD During his fiery speech last week, the CBS journalist painted a dark picture of the Trump agenda. \"Why attack universities? Why attack journalism? Because ignorance works for power,\" Pelley said. \"First, make the truth seekers live in fear, sue the journalists and their companies for nothing. Then, send masked agents to abduct a college student who wrote an editorial in her college paper defending Palestinian rights and send her to a prison in Louisiana charged with nothing. Then move to destroy the law firms that stand up for the rights of others.\" He continued, stating, \"With that done, power can rewrite history with grotesque false narratives. They can make criminals heroes and heroes criminals. Power can change the definition of the words we use to describe reality. Diversity is now described as illegal. Equity is to be shunned. Inclusion is a dirty word. This is an old playbook, my friends. There's nothing new in this.\" Pelley then urged the graduates to speak up against the censorship and fear he said is being fostered by the administration. \"In this moment, this moment, this morning, our sacred rule of law is under attack. Journalism is under attack. Universities are under attack. Freedom of speech is under attack. And insidious fear is reaching through our schools, our businesses, our homes and into our private thoughts, the fear to speak in America. If our government is, in Lincoln's phrase, 'Of the people, by the people, for the people,' then why are we afraid to speak?\" PARAMOUNT FACING MOUNTING PRESSURE FROM CBS STARS, DEM LAWMAKERS AS COMPANY MULLS SETTLING TRUMP LAWSUIT Pelley’s words come as the Trump administration has sought to withhold federal grants from Harvard and other prestigious universities for allegedly promoting left-wing policies and failing to crack down on antisemitism on campus. The president is also in the middle of a lawsuit against Pelley’s employer, CBS, alleging that the network deceptively edited a 2024 interview with former Vice President Kamala Harris shortly before the presidential election. Conservatives on X weren’t buying Pelley’s assessment of Trump. Comedian Adam Corolla wrote on X, \"TDS [Trump Derangement Syndrome] hits narcissist especially hard.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Moms For Liberty co-founder Tiffany Justice mentioned an interview she had with Pelley to show evidence of his left-wing bias. She wrote, \"I read porn from public school library books to @ScottPelley, who listened with his glasses tucked between his lips. He edited out that part of the @60Minutes interview to make our concerns seem unfounded. Scott is a liar and fraud.\" Former Trump senior advisor Jason Miller commented, \"OK @ScottPelley @CBSNews @ParamountGCD… we see you.\" Bill Clinton sexual assault accuser Juanita Broaddrick remarked, \"What a pompous POS.\" CLICK HERE TO GET THE FOX NEWS APP CBS did not respond to Fox News Digital's request for comment.","summary":"Conservative social media users criticized CBS News correspondent Scott Pelley for his anti-Trump commencement speech at Wake Forest University last week.","url":"https://www.foxnews.com/media/60-minutes-correspondent-ripped-fraud-liar-anti-trump-commencement-speech","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/scottpelleytrump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-27 15:16:33","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"US","sentiment":-0.107},{"id":325435394,"title":"Jake Tapper Compares Joe Biden Health 'Cover-Up' to Watergate","text":"The author of a bombshell book laying bare former President Joe Biden's alleged declining mental faculties during his presidency says the scandal \"may be even worse than Watergate.\"CNN journalist Jake Tapper made the claims during an appearance on Piers Morgan Uncensored, which was broadcast on YouTube on Monday.Tapper was appearing with his co-author Alex Thompson to promote their book Original Sin, in which several named insiders claim the former U.S. president was faltering physically and cognitively in a decline that was hidden from the American public.Newsweek reached out to representatives for Biden via email for comment.Why It MattersBiden stepped aside on the presidential campaign trail last year amid fears for his health and cognitive abilities, which left Vice President Kamala Harris at the top of the Democratic ticket.She later lost to Donald Trump, and some Democrats were furious at the bungled campaign, accusing Biden of damaging the party's chances by hanging on too long to power.Now, the book by Tapper and Thompson, which has shot to the top of the bestseller charts, suggests that senior members of Biden's administration were aware of his fragile health for some time before he stepped down.What To KnowBiden, 81, repeatedly insisted he was fit to serve a second term, despite regular barbs about his age from his rival, Trump, who was only marginally younger at 78. Trump described Biden as \"cognitively impaired\" in September 2023 and during the 2024 race pointed to a number of gaffes the then-president had made, such as falls, apparent confusion, and rambling speeches.The growing scandal about Biden's health was exacerbated when it emerged earlier this month that Biden is battling an \"aggressive form\" of prostate cancer.Some doctors suggested Biden and his team must have known about the cancer diagnosis before he left office. Howard Forman, a professor of radiology and biomedical imaging at the Yale School of Medicine, said it was \"inconceivable\" that Biden's cancer had not been discovered while he was in the White House.During his interview with Piers Morgan, Tapper compared the scale of the events to Watergate, the scandal that engulfed former President Richard Nixon in the 1970s. Nixon had denied any connection to a break-in at the Democratic National Committee headquarters in the Watergate Hotel in 1972, and the resulting cover-up eventually led to his resignation in 1974.Morgan questioned Tapper about the book's conclusion, and read aloud a passage stating: \"Joe Biden is not Richard Nixon, and the hiding and cover-up of his deterioration is not Watergate.\"Morgan mused that he wasn't \"entirely sure\" he agreed with that sentiment.Tapper replied: \"The next line is: 'It is an entirely separate scandal.' It is a scandal. It is, without question. And maybe even worse than Watergate in some ways, because Richard Nixon was in control of his faculties when he was not drinking. So the idea that, yeah, we don't mean to exonerate [Biden].\"He also noted that the mention of Watergate followed an excerpt in the book in which former Watergate prosecutor Archibald Cox had explained \"how presidents get surrounded by people who have a vested interest in keeping that president propped up.\"Tapper also responded to claims that the media had a role to play. \"In retrospect, of course, I wish my coverage had been better on this subject,\" he said.What People Are SayingFormer President Joe Biden said on ABC's The View this month that he would have won if he'd stayed in the 2024 presidential race: \"I was confident I would beat Trump. He's a loser.\"Biden shared a photo of himself with his wife Jill Biden on X (formerly Twitter) after his cancer diagnosis:\"Cancer touches us all. Like so many of you, Jill and I have learned that we are strongest in the broken places. Thank you for lifting us up with love and support.\"What Happens NextThe political fallout over Biden's health will rumble on as the authors continue to promote their book and the Democrats turn inward to review the past and look for mistakes or even wrongdoing. The Republican Party, with Trump at its helm, will be hoping to make much political capital from the allegations.","summary":"\"It is a scandal...and maybe even worse than Watergate in some ways,\" Jake Tapper told Piers Morgan.","url":"https://www.newsweek.com/joe-biden-health-scandal-watergate-jake-tapper-book-2077492","image":"https://d.newsweek.com/en/full/2652122/joe-biden.jpg","video":null,"publish_date":"2025-05-27 15:07:41","author":"Chloe Mayer","authors":["Chloe Mayer"],"language":"en","source_country":"US","sentiment":-0.41},{"id":325420198,"title":"Australian media slams Kamala Harris for taking 'half a million dollars' to say 'I am unemployed right now' at real estate event","text":"Sky News Australia tore into former vice president Kamala Harris for being the chief speaker at a real estate event in Gold Coast, where she was reported paid half a million dollars to \"essentially chuckle on stage and make jokes about being unemployed\". The former vice president was in Australia Sunday to speak at the Australian Real Estate Conference, where she sat on stage with real estate industry veteran John McGrath and spoke about her mother, Playboy Magazine covers, hormones and being unemployed right now. Sky News Digital Presenter Gabriella Power called Kamala Harris a comedian as she asked comedian and commentator Alex Stein to comment on Harris's Australia outing. “She can’t do any worse than spending $1 billion on her presidential campaign and somehow ending up $100 million in debt,” Stein said, adding that he double-checked whether Kamala Harris ever visited Australia when she was the vice president and the answer is no. \"I wonder why she's there now. I know why she's there now. She is there for the money,\" Stein said. “Kamala Harris is not having very good job prospects, or many offers here in America that are that great, so what is she going to do? She’s going to go to Australia,\" Stein said. What Kamala Harris said at the real estate event \"My mother was actually very funny because she would say, 'You look at the cover of Playboy magazine, let me just tell you, the reason that people are looking at these things, understand what they were developed for the perpetuation of the human species!' She was very practical that way,\" Kamala Harris said and began laughing. \"I don't aspire to be humble. And I don't recommend it, I think that one must be humble. But to aspire to be humble would be quite inauthentic,\" she said on humility. \"If one understands that, just, I mean, there's so much that is magnificent and awe-inspiring about this world and its people.\" When the moderator said he believed that Kamala Harris's best work is ahead of her, for sure, Harris said, \"I am unemployed right now. Go on, let's speak truth.\"","summary":"","url":"https://timesofindia.indiatimes.com/world/us/australian-media-slams-kamala-harris-for-taking-half-a-million-dollars-to-say-i-am-unemployed-right-now-at-real-estate-event/articleshow/121441269.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-121441292/121441292.jpg","video":null,"publish_date":"2025-05-27 14:17:53","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.238},{"id":325421208,"title":"NPR and public radio stations sue Trump White House over funding cuts","text":"NPR and three of its member stations filed suit in federal court Tuesday against President Trump's White House over the president's executive order to block funding for public media. Trump's order called for an end to government dollars for the Corp. for Public Broadcasting, the taxpayer-backed entity that provides funding to NPR and PBS. He called the outlets \"left wing propaganda.\" The suit says the May 1 action by Trump violated the 1st Amendment. \"The Order targets NPR and PBS expressly because, in the President's view, their news and other content is not 'fair, accurate, or unbiased,'\" the legal brief said, according to an NPR report. The suit also says that the funding — currently at around $500 million annually — is appropriated by Congress. The allocation is made two years in advance. \"Congress directly authorized and funded CPB to be a private nonprofit corporation wholly independent of the federal government,\" Corp. for Public Broadcasting chief Patricia Harrison told NPR in a statement. Harrison said that the Corp. for Public Broadcasting is not a federal agency subject to the president's authority. \"The Executive Order is a clear violation of the Constitution and the First Amendment's protections for freedom of speech and association, and freedom of the press,\" NPR President and Chief Executive Katherine Maher said in a statement. The order is one of a number of attempts by Trump to limit or intimidate institutions he does not agree with. Targets included law firms, universities and media companies such as CBS, which is being sued for $20 billion over a “60 Minutes” interview with former Vice President Kamala Harris during the 2024 presidential campaign. NPR filed the suit with three public radio outlets, including Denver-based Colorado Public Radio, Aspen Pubic Radio and KSUT which serves the Four Corners region of Arizona, Colorado, New Mexico and Utah. Both NPR and PBS have stressed that the bulk of the federal funding they receive goes to stations that provide local news and emergency alerts for their communities.","summary":"The lawsuit in federal court says President Trump's May 1 executive order that targets NPR and PBS for its programming choices, making it unconstitutional.","url":"https://www.latimes.com/entertainment-arts/business/story/2025-05-27/npr-and-public-radio-stations-are-suing-trump-white-house-over-executive-order","image":"https://ca-times.brightspotcdn.com/dims4/default/adea562/2147483647/strip/true/crop/5100x2678+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2F1b%2Fa2124aa94fb692393c0d1f6ae4d1%2Ftwitter-npr-42690.jpg","video":null,"publish_date":"2025-05-27 14:03:44","author":"Stephen Battaglio","authors":["Stephen Battaglio"],"language":"en","category":"politics","source_country":"US","sentiment":-0.109},{"id":325409712,"title":"'The Kamala Excuse': Tensions between Biden and Harris plagued their campaigns, new book reveals","text":"Former Vice President Kamala Harris had 107 days to convince the American people to elect her the next president. Tension between Harris' team and former President Joe Biden's inner circle did not do her any favors, a new book by CNN anchor Jake Tapper and Axios political correspondent Alex Thompson reveals. \"Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again,\" has returned questions about Biden's cognitive decline and his administration's alleged cover-up to the national conversation. The book also pulls back the curtain on the complicated relationship between Biden and Harris, spotlighting the distrust that had been brewing between their teams since Biden tapped Harris as his running mate in 2020. NEW BOOK REVEALS BIDEN'S INNER CIRCLE WORRIED ABOUT HIS AGE YEARS BEFORE BOTCHED DEBATE PERFORMANCE The choice for Biden's vice president came down to Harris or Gov. Gretchen Whitmer, D-Mich., according to Thompson and Tapper. NEW BOOK EXPOSES HOW TOP BIDEN COMMS STAFFER WAS 'TIP OF THE SPEAR' COVERING UP BIDEN'S COGNITIVE DECLINE \"Many on the Biden team felt that Harris didn't put in the work and was also just not a very nice person. Several quietly expressed buyer's remorse: They should have picked Whitmer.\" To Biden's 2020 presidential campaign, Whitmer represented the \"next generation of Biden Democrats,\" Thompson and Tapper said. Additionally, former first lady Jill Biden resented Harris after hitting him hard during the first Democratic primary in 2019 for opposing the Department of Education's busing program to integrate public schools. \"That little girl was me,\" Harris said on the debate stage. \"Still, Biden's advisers did not fully trust her. Harris and her advisers felt it. Her aides got the impression that doing more than the bare minium to help was considered an act of disloyalty to Biden,\" Tapper and Thompson said of Harris' involvement in the 2020 campaign. \"Some of that culture carried over into the White House.\" Biden privately called Harris a \"work in progress\" and was not confident she could beat then-former President Donald Trump in 2024. However, Harris' team thought building up the vice president should have been a priority for Biden's transitional presidency as a \"bridge\" for the next generation of Democratic leadership, as he said back in 2020. An excerpt of the book reads, \"In the eyes of Harris's team, the Biden White House was setting her up to fail. They gave her assignments her team considered politically toxic, such as dealing with the migration crisis, rarely offered to help, and knifed her to reporters along the way. Harris's camp didn't understand the hostility and the reluctance to offer her opportunities to shine.\" The Fox News Voter Analysis in 2024 found that 52% of voters said Trump was the better candidate to handle immigration, while just 36% said Harris. Additionally, it was a top issue for voters, with 20% saying it was the most important issue facing the country. Harris faced the brunt of criticism for the surge in border crossings during the Biden-Harris administration as the Trump campaign trolled her as the \"border czar.\" When Biden dropped out of the race after his disastrous debate performance in summer 2024, Harris inherited his struggling campaign, and her old boss soon became a \"liability.\" \"From the beginning of her campaign in July to the August weeks of picking a running mate, presiding over the convention, rolling out wave after wave of ads, and on through September debate prep, it was clear that Biden was a liability,\" Tapper and Thompson wrote. Harris was caught in the crosshairs of Biden's relentless gaffes and missteps as she tried to walk a fine line between loyalty to Biden and distancing herself from his failing campaign, as the journalists described. While Harris had \"great affection for Joe,\" her loyalty fired back when she told \"The View\" she would not have done anything differently than Biden as president. \"There is not a thing that comes to mind,\" Harris said – an instant attack ad for the Trump administration as they highlighted the Biden-Harris administration's record on immigration, the withdrawal from Afghanistan and inflation. \"What is he doing?\" Harris asked her team after Biden donned a Trump 2024 hat at a 9/11 memorial gathering at the Shanksville Fire Station, less than a month before the election. \"This is completely unhelpful. And so unnecessary,\" Harris told her team, according to the book. \"That would be, the Harris campaign decided, the last time she would do a public event with the president before the election.\" However, Biden still wanted a role in the campaign, Tapper and Thompson said, as he saw former Presidents Bill Clinton and Barack Obama speaking at rallies on the campaign trail. \"He didn't seem to understand what a liability he had become.\" When one of Trump's supporters called Puerto Rico a \"floating island of garbage\" during a Madison Square Garden rally about a week before the election, what should have been a political layup for Democrats, became another mess for Harris to clean up. \"The only garbage I see floating out there is his supporters,\" Biden said on a Voto Latino Zoom call. While Biden was creating a political mess for Harris to clean up, Trump seized the opportunity to claim the narrative, sporting a high-visibility vest at a rally in battleground Michigan and hosting an impromptu press gaggle from the front seat of a garbage truck that was decked out in Trump decals. \"By the end of the campaign, she had helped the Democratic Party, but her own candidacy was barely treading water. And the albatross that was Joe Biden kept getting heavier,\" Tapper and Thompson said. CLICK HERE TO GET THE FOX NEWS APP Fox News Digital has written extensively dating back to the 2020 presidential campaign about Biden's cognitive decline and his inner circle’s role in covering it up. Representatives for Biden and Harris did not immediately respond to Fox News Digital's request for comment.","summary":"Tension between former former Vice President Kamala Harris&apos; team and former President Joe Biden&apos;s inner circle did not do Harris any favors, a new book by CNN anchor Jake Tapper and Axios political correspondent Alex Thompson reveals.","url":"https://www.foxnews.com/politics/the-kamala-excuse-pg-66-chapter-talks-about-friction-between-harris-biden-teams","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/harris-biden-getty.png?ve=1&tl=1","video":null,"publish_date":"2025-05-27 14:00:52","author":"Deirdre Heavey","authors":["Deirdre Heavey"],"language":"en","source_country":"us","sentiment":-0.258},{"id":325411282,"title":"‘Under attack’: Watch ’60 Minutes’ anchor chew up commencement address raging against Trump","text":"“60 Minutes” journalist and author Scott Pelley raged against President Donald Trump during his commencement speech at West Forest University on May 20.\n\nPelley claimed that rule of law, universities and journalists are “under attack” during the current presidency and that people no longer have the freedom to express their thoughts. His remarks came as “60 Minutes” and CBS News are in the midst of a legal battle with Trump, who is suing the network and program for allegedly editing an interview with former Vice President Kamala Harris in an effort to politically benefit her.\n\n“But in this moment, this moment, this morning, our sacred rule of law is under attack,” Pelley said. “Journalism is under attack. Universities are under attack. Freedom of speech is under attack and insidious fear is reaching through our schools, our businesses, our homes and into our private thoughts. The fear to speak, in America? Power can rewrite history with grotesque, false narratives. They can make criminals heroes and heroes criminals. Power can change the definition of the words we use to describe reality.”\n\nPelley claimed that the Trump administration has forcibly changed the terms, “diversity” and “equity” to have different meanings in order to fit their own agenda.\n\n“This is an old playbook, my friends. There is nothing new in this,” Pelley added.\n\nTrump filed a $10 billion lawsuit against CBS News in October 2024 after the network appeared to manipulate the “60 Minutes” interview with Harris. The lawsuit, which increased to $20 billion in February, alleged that CBS News participated in “deliberate deception” by omitting parts of Harris’ answer on former President Joe Biden’s stance on Israel in order to help her in the 2024 election.\n\nThe lawsuit prompted Bill Owens, the now-former executive producer of “60 Minutes,” to resign from his position in April, stating that he had lost journalistic independence. In response to Owens’ resignation, Pelley accused CBS News and its parent company, Paramount, of “meddling” with staffers’ independence at ’60 Minutes’ by supervising their content ‘in new ways.’”\n\nMore recently, Wendy McMahon stepped down from her role as president and CEO of CBS News and Stations, telling her staff in a May 19 memo that the network faced a “challenging time.”\n\nParamount’s controlling shareholder, Shari Redstone, said she is in favor of settling the lawsuit with Trump by seeking his agreement to sell her company to Skydance, a Hollywood studio, according to the New York Times.\n\nTrump accused “60 Minutes” in a Truth Social post of reporting about him in a “derogatory and defamatory way” during their coverage of two stories on him in April. He called on the Federal Communications Commission (FCC) to revoke CBS News’ license and “impose the maximum fines and punishment” for allegedly attempting to help Harris win the 2024 election.\n\n“I am so honored to be suing 60 Minutes, CBS Fake News, and Paramount, over their fraudulent, beyond recognition, reporting,” Trump said in an April 14 post. “They did everything possible to illegally elect Kamala, including completely and corruptly changing major answers to Interview questions, but it just didn’t work for them. They are not a ‘News Show,’ but a dishonest Political Operative simply disguised as ‘News,’ and must be responsible for what they have done, and are doing.”\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].","summary":"'Insidious fear is reaching through our schools, our businesses, our homes and into our private thoughts'","url":"https://www.wnd.com/2025/05/under-attack-watch-60-minutes-anchor-chew-up-commencement-address-raging-against-trump/","image":"https://www.wnd.com/wp-content/uploads/2024/06/cbsnews.jpg","video":null,"publish_date":"2025-05-27 13:34:41","author":"Daily Caller News Foundation","authors":["Daily Caller News Foundation"],"language":"en","source_country":"us","sentiment":0.116},{"id":325421226,"title":"Thanks, Tom Cruise and Stitch! Movie theaters have a record-breaking Memorial Day weekend","text":"It was Saturday afternoon, and I had ditched my two young, loud kids, leaving them with my husband for a solo trip to the movie theater. There was no quiet to be had, though. When I got to the AMC theater at Del Amo Fashion Center in Torrance, the place was packed. Among the crowd: lots of kids as giddy and rowdy as my own. It was the opening weekend for Walt Disney Co.’s live-action remake of \"Lilo & Stitch.\" Families posed for selfies outside the theater with a giant banner featuring the crazed alien Stitch. Inside, a long line for popcorn and candy snaked through the lobby. The premieres of \"Lilo & Stitch\" and \"Mission: Impossible — The Final Reckoning\" powered a record-breaking Memorial Day weekend at the box office. As my colleague Samantha Masunaga reported, \"Lilo & Stitch\" hauled in an estimated $183 million in its opening weekend in the U.S. and Canada, setting the record for the biggest Memorial Day weekend opener ever. Not adjusting for inflation, it toppled the former top Memorial Day movie, \"Top Gun: Maverick,\" which debuted with $160.5 million in 2022. Paramount Pictures and Skydance Media's “Mission: Impossible — The Final Reckoning\" brought in $77 million domestically for second place, with \"Final Destination Bloodlines,\" \"Thunderbolts*\" and \"Sinners\" rounding out the top five. The busy holiday was a relief for theater owners and moviemakers still struggling from a post-pandemic slump. The local film and TV industry has been battered in recent years by the slowdown in production wrought by the COVID-19 pandemic, which made audiences more comfortable staying home to watch movies on streaming platforms, and the writers' and actors' strikes in 2023. Enter: the little blue alien and Tom Cruise, still performing his own stunts at 62. Chris Aronson, Paramount's president of domestic distribution, called the holiday ticket sales \"just an extraordinary accomplishment after so many people were willing to write off the theatrical business.\" Historically, the holiday has been one of the biggest moviegoing weekends, serving as a springboard for the busy summer months. This year, the record-breaking holiday follows a solid spring. Films such as Warner Bros. Pictures' \"A Minecraft Movie\" and Ryan Coogler’s \"Sinners\" helped to fuel domestic theatrical revenue of $875 million in April, close to the pre-pandemic average of $886 million for the same month from 2015 to 2019, Eric Handler, media and entertainment analyst at Roth Capital, told Masunaga. Disney and Marvel Studios' \"Thunderbolts*\" and Warner Bros. Pictures' \"Final Destination Bloodlines,\" which premiered in May, also have kept up steady business. I didn't go to see the blockbusters, though. I walked into a less-than-half-full screening of \"Friendship,\" the ultra-awkward indie comedy starring Tim Robinson as a suburban dad who becomes obsessed with his new neighbor, a weatherman played by Paul Rudd. The trailer boasts a review that, in reference to another Rudd movie, calls it \"'I Love You, Man' for sickos.\" For an independent film, it had a good holiday weekend, bringing in $4.6 million, according to the film performance tracker Box Office Mojo. Half of my theater's audience sat quietly, and I heard one older man grumble on the way out that it was \"the worst movie I've ever seen.\" The other half laughed through the actors' foraging expedition for wild mushrooms and \"adventures\" in the local sewer system. I was in the latter half, whatever that says about me. My husband — a Robinson superfan who went by himself to a \"Friendship\" screening later that night — met me outside the theater with our kids, who had one question: \"When can we go see 'Lilo & Stitch'?\" As mayor of Los Angeles, Villaraigosa's work to expand mass transit, plant trees and reduce carbon emissions made him a favorite of the environmental movement.But Villaraigosa also accepted more than $1 million in campaign contributions and other financial support from oil companies and other donors tied to the industry over more than three decades in public life, according to city and state fundraising disclosures reviewed by The Times.As the Colorado River's reservoirs have declined, even larger amounts of groundwater have been drained from aquifers.Researchers found that most of the depletion of groundwater is occurring in the river's lower basin, largely in Arizona, where the bulk of the water is pumped from desert aquifers to irrigate farms.\"If this trend continues, it could lead to severe water shortages that impact not only local farmers and residents but also broader agricultural markets and municipal water supplies throughout the southwestern U.S.,\" researcher Karem Abdelmohsen said.Police actions related to the George Floyd protests have cost taxpayers $11.9 million in settlements and jury awards, according to a Times analysis of LAPD data.The city faces tens of millions more in liability exposure from scores of pending lawsuits.Five years after Floyd's killing, police backers say public opinion has largely swung back in favor of aggressive law enforcement, pointing to voter decisions last year to pass tough-on-crime legislation and oust progressive prosecutors.A 4-year-old Bakersfield girl facing deportation could die within days of losing medical care.A mob wreaks havoc in downtown L.A., tagging buildings and trains as someone breathes fire.Trump’s FCC delays multilingual emergency alerts for natural disasters, sparking concern in L.A.Trump, ‘60 Minutes’ and corruption allegations put Paramount on edge with a sale less certain.Urban fires can require long trips for helicopters to get water. An ex-L.A. County firefighter has a solution.Hannah Gutierrez, 'Rust' western movie armorer, has been released from prison.A U.S. attorney in L.A. moves to ‘neutralize’ California’s sanctuary rules.The age of the sweep is over. This year's Emmys are in for a much-needed shakeup, writes columnist Glenn Whipp.Pushing more Americans into homelessness is no way to revitalize downtowns, argues columnist LZ Granderson.Bravo to all those engaged in the struggle against Trump’s anti-democratic bullying, columnist Robin Abcarian writes.Columnist George Skelton asks, Is Kamala Harris the best option to fix California's problems? Antonio Villaraigosa is dying to run against Kamala Harris for governor, columnist Mark Z. Barabak writes. Here’s why.Walking all 15.5 miles of Pico Boulevard in a day revealed hidden parts of L.A.So what really happened at the cartel training site dubbed ‘Mexican Auschwitz’? The 10 best movies we saw at the 2025 Cannes Film Festival.Weekend warriors yank out invasive plants to save L.A. River.Restaurants: 50 of the best rooftop restaurants and bars to soak in city views. Shopping: 10 of the best places to buy patio furniture in L.A. Television: ‘The Last of Us’ Season 2 finale: A mission for revenge takes a turn.Recipes: Here's a recipe for Nonna's meatball sandwich.✏️ Get our free daily crossword puzzle, sudoku, word search and arcade games. Valerie says, \"My Happy Place a.k.a.: Santa Barbara.\" Lynne says, \"Cayucos! Cool beach town in Central California!\" Email us at essentialcalifornia@latimes.com, and your response might appear in the newsletter this week. Today's great photo is from Times photographer Myung J. Chung at Los Angeles National Cemetery in Westwood where Scouts joined community members in a huge Memorial Day effort to place flags on nearly 90,000 grave sites. Hailey Branson-Potts, staff reporter Kevinisha Walker, multiplatform editor Andrew Campa, Sunday writer Karim Doumar, head of newsletters How can we make this newsletter more useful? Send comments to essentialcalifornia@latimes.com. Check our top stories, topics and the latest articles on latimes.com.","summary":"The premieres of \"Lilo & Stitch\" and \"Mission: Impossible — The Final Reckoning\" fueled a record-breaking Memorial Day weekend at movie theaters.","url":"https://www.latimes.com/california/newsletter/2025-05-27/lilo-stitch-mission-impossible-memorial-day-movie-sales","image":"https://ca-times.brightspotcdn.com/dims4/default/e6941c8/2147483647/strip/true/crop/5084x2669+0+360/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd8%2F52%2F6b393f154d95a7cfcf3ceebe2125%2F1507673-la-et-memori","video":null,"publish_date":"2025-05-27 13:30:00","author":"Hailey Branson-Potts","authors":["Hailey Branson-Potts"],"language":"en","source_country":"US","sentiment":0.394},{"id":325399382,"title":"Haitians March for Their Lives. Will Congress Even Notice?","text":"This past week, protestors filled the streets of Port-au-Prince. They weren’t demanding luxury. They weren’t demanding favors. They were demanding medicine. They were demanding life.\n\nPeople with HIV, many of them mothers and children, marched to demand access to antiretroviral drugs. Their clinics are empty. Their nurses are unpaid. And their government—and ours—has left them behind.\n\nOne protester held a sign that read: “Don’t Kill Us with Your Politics.” Another shouted through a megaphone, “We will not die quietly.” For decades, Haiti relied on American aid to prop up its fragile healthcare system. Now, with funding cut off, it’s collapsing in real time. The streets have become operating rooms. The protests are triage.\n\nThis is the downstream effect of the USAID collapse. And it didn’t happen overnight. It’s the result of years of calculated sabotage by American politicians who resent the very idea of global solidarity. And make no mistake—many of these protestors know exactly who to blame. They name names: Trump, Musk, Congress.\n\nBut this time, it’s different. Haitians are refusing to suffer in silence. They’re taking to the streets, demanding the world pay attention. Because if this moment passes without action, it will set a precedent: that mass death by neglect is an acceptable outcome of political infighting.\n\nThe question is: Will we listen? Or will we let them scream into the void?\n\nWe are Fighting Back. You Can Too.\n\nThe Alliance for American Leadership is tracking the impact of aid cuts, rallying support to restore funding, meeting with members of Congress, and reminding Americans of the real meaning of American leadership: decency, duty, and hope.\n\nIn just our first two months, we've recruited over 400 volunteers from 41 states, including 23 senior campaign strategists and the former Briefing Manager for the Kamala Harris Presidential Campaign.\n\nWe are on track to mobilize 5,000 volunteers by the 2026 midterm elections to fight for American leadership. We will resist fascism, restore USAID, and rebuild America’s role as a force for good in the world. This is our moment to lead with integrity and purpose, showing the world. What true American values are all about.\n\nBut behind every meeting, every voice, and every victory is the operational engine that makes it all possible — and right now, we need your help to keep it running.\n\nWe must raise $20,000 to sustain the operational infrastructure that powers this movement. That means funding our digital outreach and empowering the young, diverse, and working-class leaders who are too often left out of the fight. Your support keeps the lights on, the teams moving, and the pressure on Congress at full force.\n\nIf you want to stand with us:\n\n Get involved: https://a4al.org\n\n Volunteer with us\n\n Subscribe to our newsletter\n\n Join our advisory board\n\n Apply for an internship\n\nWrite for our think tank or blog","summary":"This past week, protestors filled the streets of Port-au-Prince. They weren’t demanding luxury. They weren’t demanding favors. They were demanding medicine. They were demanding life.\n\n\n\nPeople with HIV, many of them mothers and children, marched to demand access to antiretroviral drugs. Their clinics are empty. Their nurses are unpaid. And their government—and ours—has left them behind.\n\n\n\nOne protester held a sign that read: “Don’t Kill Us with Your Politics.” Another shouted through a megaphone, “We will not die quietly.” For decades, Haiti relied on American aid to prop up its fragile healthcare system. Now, with funding cut off, it’s collapsing in real time. The streets have become operating rooms. The protests are triage.\n\n\n\nThis is the downstream effect of the USAID collapse. And it didn’t happen overnight. It’s the result of years of calculated sabotage by American politicians who resent the very idea of global solidarity. And make no mistake—many of these protestors know exactly who to blame. They nam","url":"https://www.dailykos.com/stories/2025/5/27/2324455/-Haitians-March-for-Their-Lives-Will-Congress-Even-Notice?pm_campaign=blog&pm_medium=rss&pm_source=Itzl Alert Network","image":"https://cdn.prod.dailykos.com/images/1437231/story_image/haiti.jpeg?1748307940","video":null,"publish_date":"2025-05-27 13:09:04","author":"averyallen,Daily Kos","authors":["averyallen","Daily Kos"],"language":"en","category":"politics","source_country":"us","sentiment":-0.089},{"id":325493344,"title":"POLL RESULTS: Worst Media Take of the Week Winner!","text":"We’ve got a brand new, fun interactive series for the new year called Worst Media Take of the Week, where you — our loyal NewsBusters visitors and MRC supporters — get to vote on which leftist journalist or celebrity had the worst media take of the week. \n\nMuch appreciation to all who voted last week via NewsBusters and the MRC’s various social media sites (Facebook, Instagram and X.com). \n\nThe results of the Worst Media Take of the Week are in and the winner is…\n\nWhoopi Goldberg!\n\nThe comedian and co-host of ABC’s The View won with 58 percent of the vote! Goldberg took first place for her lame attempt to brush-off the Democratic party and legacy media’s attempt to hide Joe Biden’s mental decline. Goldberg huffed: “Why is this important to know now?” \n\nCBS News political contributor/former VP Kamala Harris communications director Ashley Etienne finished in second place with 28 percent of the vote. Former NBC’s Today and CBS Evening News anchor Katie Couric finished third with 14 percent.\n\nThe following is a montage of all the nominees: \n\nWINNER (58 percent of the vote)\n\nWhoopi: Why is It “Important to Know” About Biden’s Decline Now?\n\n“So should anonymous sources who talked to [Jake] Tapper have spoken up about their concerns while he [Joe Biden] was in office - while he was in still in office? And my other question is, why is this important to know now?”— Co-host Whoopi Goldberg on ABC’s The View, May 20.\n\nSECOND PLACE (28 percent of the vote)\n\nAshley Etienne: Trump Released Biden Memory Lapse Tape to “Distract” From His “Disastrous First 100 Days”\n\n“It’s clear to me that President Trump released the [Special Counsel Robert Hur/President Joe Biden] tape because he’s trying to distract from his disastrous - unprecedented disastrous first 100 days.” — CBS News political contributor/former VP Kamala Harris communications director Ashley Etienne on NBC’s Meet the Press, May 18.\n\nTHIRD PLACE (14 percent of the vote)\n\nKatie Couric: “There’s No Such Thing as True Objectivity”\n\n“Pointing out the facts and what is really happening is automatically interpreted as being biased, right? And, and of course, I think there’s no such thing a true objectivity, but having said that, - you know I really struggle with that.”— Former NBC’s Today show co-host and CBS Evening News anchor Katie Couric on Next Question podcast, May 15.\n\nThanks again to all who participated! \n\nFunded by James P. Jimirro","summary":"We’ve got a brand new, fun interactive series for the new year called Worst Media Take of the Week, where you — our loyal NewsBusters visitors and MRC supporters — get to vote on which leftist journalist or celebrity had the worst media take of the week.  \n\nMuch appreciation to all who voted last week via NewsBusters and the MRC’s various social media sites (Facebook, Instagram and X.com).  \n\nThe results of the Worst Media Take of the Week are in and the winner is…\n\nWhoopi Goldberg!\n\nThe comedian and co-host of ABC’s The View won with 58 percent of the vote! Goldberg took first place for her lame attempt to brush-off the Democratic party and legacy media’s attempt to hide Joe Biden’s mental decline. Goldberg huffed: “Why is this important to know now?” \n\nCBS News political contributor/former VP Kamala Harris communications director Ashley Etienne finished in second place with 28 percent of the vote. Former NBC’s Today and CBS Evening News anchor Katie Couric finished third with 14 percent.\n\nThe following is a","url":"https://www.newsbusters.org/blogs/nb/geoffrey-dickens/2025/05/27/poll-results-worst-media-take-week-winner","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/WorstMediaMoments_5-22-25_RESULTS.png?itok=30NlpOcB","video":null,"publish_date":"2025-05-27 12:57:00","author":"Geoffrey Dickens,James P. Jimirro","authors":["Geoffrey Dickens","James P. Jimirro"],"language":"en","source_country":"US","sentiment":0.083},{"id":325376826,"title":"Trump insiders trash multi-million dollar Democrat effort to find the 'liberal Joe Rogan'","text":"Democrats continue struggling through their journey in the political wilderness, but one problem they have identified is a loss of their grip on popular culture.\n\nTheir familiar effort to win the endorsements of celebrities and to campaign with pop culture icons failed to generate the same enthusiasm that propelled politicians like former President Barack Obama. \n\nInstead, Trump’s political success was fueled by appealing to center-left podcast hosts, comedians, gamer streamers, and online influencers who helped him seize an unprecedented number of votes of Americans previously ignored by the Republican Party.\n\nThe New York Times revealed that several Democratic groups have pitched ideas to amplify their politics online, many of them receiving millions from investors to get started. \n\nBut the Democrat attempt to create a ‘left wing’ podcast network to swing the conversation to the left drew jeers from MAGA political strategists. \n\n‘I mean, good for them, if they can sucker these people into giving them money, it’s just a total grift, that will have no effect,’ Republican political strategist Alex Bruesewitz told the Daily Mail. He ridiculed Democrats for ‘being completely out of touch.’\n\nBruesewitz worked with Barron Trump to shepherd President Trump through the unconventional but influential world of podcast personalities such as Theo Von, Andrew Schultz, the Nelk Brothers, Jake and Logan Paul, Adin Ross, as well as the number one podcaster Joe Rogan.\n\nThe search for the ‘liberal Joe Rogan’ has become a punchline for Republicans who point out that Rogan was once a California liberal, but that the policies of the left drove him away.\n\n‘The Left should stop and ask how they lost Joe Rogan in the first place,’ online strategist Zach Henry told the Daily Mail. ‘But just like after every election, they skip the introspection and double down—more spin, more propaganda, never any accountability.’\n\n‘They had the liberal Rogan, his name was Joe Rogan, until their psychotic policies alienated him,’ wrote former Trump aide and political strategist Andrew Surabian on X.\n\nRogan was once a supporter of Sen. Bernie Sanders for president in 2016 and also championed Rep. Tulsi Gabbard, a former rising Democrat before she was effectively ostracized from Democratic leadership and joined the Republican Party.\n\nSurabian argued that the left was ignorant of how Rogan earned the trust and admiration of his massive audience.\n\n‘Dems STILL don’t get Rogan’s appeal. He built an apolitical fanbase over 25 years precisely because people trust he isn’t bought and paid for by a political party,’ he wrote.\n\nBruesewitz said Democrats would need to dial back on some of their more unpopular policies and engage with existing influential podcasts if they wanted to find their way back into political rebalance.\n\n‘Instead of reversing their insane policies that are not rooted in common sense and have alienated every reasonable person in America, Democrats are going to double down on their insanity, and just invest millions of dollars to astroturf shills of their policies,’\n\nTo be a ‘shill’ in the podcast and influencer community is the biggest insult, as critics frequently question whether rising shows and podcasts are somehow being compromised by a growing coalition of well-funded interests who want to control the message.\n\nPolitical strategists from the 1990s and early 2000s sense a familiar trend among Democrats who worked tirelessly to create a ‘left-wing Rush Limbaugh,’ after the titan AM political talk show radio host singlehandedly weaponized common sense, humor, and unvarnished conservative opinions to swing the country to the right.\n\nLeft-wing efforts to astroturf talk radio resulted in failed projects such as Air America, which crumbled into obscurity.\n\nEven Democratic strategists appeared discouraged by the conversation stemming from activists trying to raise money to try and build their own networks.\n\n‘There is no liberal Joe Rogan because there isn’t a conservative Joe Rogan,’ wrote former Kamala Harris political strategist Mike Nellis on X. ‘He’s a f***ing entertainer. Go on his show and engage with his audience.’\n\nNotably, Harris snubbed Rogan's invite to appear on his program during the 2024 campaign, while Trump sat for a multiple hour interview spanning a wide range of topics. \n\nThe now-president's interview broke YouTube records and garnered over 38 million views in just three days. \n\nBut Democrats who are now eager to go on podcasts also face a barrier from the podcast community who have rejected a lot of the policies. \n\nEfforts to abandon free speech principles and cancel comedians for ‘anti-woke’ jokes was highly unpopular with their audiences. \n\nShould a Democrat get a spot on the show, they would have to answer for any attacks on free speech, ‘woke’ policies, and admit they did something wrong in the last election cycle.\n\nCreating safer more partisan spaces online tends to make Democrats more comfortable. \n\nThe ‘Obama bros’ Jon Lovett, Jon Favreau, and Tommy Vietor who funded the Pod Save America podcast after President Trump beat Hillary Clinton in 2016, won significant funding from Democratic benefactors including George Soros to help expand ‘Crooked Media’ into a larger news and podcast network.\n\nThe digital publishing group MeidasTouch made waves during the 2024 election and expanded their footprint in 2025 after Harris lost to Trump.\n\nBut neither of the overtly political messaging platforms can touch the impact of Rogan’s audience and influence combined with other prominent podcasters who agreed to interview Trump on their shows.\n\nA gleeful Bruesewitz suggested that Democrats invest more in existing liberal influencers who were already being patronized by political firms to drive a Democratic message.\n\n‘I’m just hopeful that David Hogg wins and they invest millions to platform him.’ Bruesewitz said.\n\nHogg, a student who attended Parkland High School in Florida during the 2018 school shooting, was plucked out by liberal professionals to lead a charge for gun control.\n\nConservatives were amazed that Hogg was elevated to a prominent position in the Democratic National Committee where he began tearing down existing Democrats and generating heartburn for party operatives.\n\nBruesewitz, who enthusiastically supported Hogg’s rise as a bit of a troll, suggested that he take up the mantle of the left’s biggest voice in the podcasting world.\n\n‘He should leave the DNC now, I think he’s done his work there, he should leave the DNC now and take tens of millions of dollars to be the left’s Joe Rogan,’ he said.","summary":"Democrats continue struggling through their journey in the political wilderness, but one problem they have identified is a loss of their grip on popular culture.","url":"https://www.dailymail.co.uk/news/article-14740777/trump-operatives-democrat-effort-liberal-joe-rogan.html","image":"https://i.dailymail.co.uk/1s/2025/05/22/20/98664645-0-image-a-14_1747941486404.jpg","video":null,"publish_date":"2025-05-27 12:13:05","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.132},{"id":325473994,"title":"‘Lawfare’ 2.0: From Beyonce and Bruce to Cuomo and Chicago mayor, Trump and Bondi’s enemies list is growing","text":"Donald Trump campaigned on ending “weaponization” in government after accusing his political enemies of launching a legal war to derail his chances of winning the presidency a second time.\n\nBut the president, with an emboldened Department of Justice, led by staunch ally Pam Bondi, has launched apparent partisan lawfare of his own, with investigations underway against prominent Democratic officials and left-leaning pop superstars, dozens of legal threats aimed at his ideological opponents — and even the law firms representing them.\n\nTrump signed an executive order on his first day in office accusing Joe Biden’s administration of a “systematic campaign against its perceived political opponents” that is designed “more toward inflicting political pain than toward pursuing actual justice or legitimate governmental objectives.”\n\nBut the order seemingly does what it condemns — “ending the weaponization of government” by turning the government against his enemies.\n\nThe president promised “retribution” for his supporters during his first campaign speech in 2023, and critics say his administration has wielded the executive branch and leveraged the Justice Department to settle personal and political vendettas.\n\n“We are witnessing a huge attack on the rule of law, and direct assault on the Constitution,” Democratic Senator Chris Van Hollen told reporters May 20, listing off Trump’s “tyranny and political blackmail” and threats to federal funding, arrests of student protesters and his “weaponizing” of the Justice Department.\n\nIn her confirmation hearing, Attorney General Bondi promised to lawmakers that “the partisanship, the weaponization will be gone” from the Justice Department. “America will have one tier of justice for all,” she said.\n\nBut instead, her Justice Department “has transformed into Donald Trump’s personal law firm,” accuses former pardon attorney Liz Oyer, who is suing the administration over her “abrupt” and “illegal” firing.\n\nBondi’s office is “essentially whatever the president wants it to be right now,” Oyer told NPR.\n\nTrump’s list of targets seemingly grows by the day. \n\nWithin the last week, the Justice Department’s civil rights division opened an investigation into Chicago’s Democratic mayor after he boasted to a church congregation about hiring so many Black people to his administration, federal prosecutors filed criminal charges against a sitting member of Congress, and Andrew Cuomo — a prominent Trump antagonist while serving as New York’s governor and now the leading candidate for New York City mayor — has been accused of lying to Congress.\n\nThe president has also demanded a “major investigation” into his own allegations that Bruce Springsteen, Beyonce, Oprah Winfrey and Bono violated campaign finance laws by supporting Kamala Harris’ presidential campaign.\n\nRichard Grenell, Trump’s appointed president of the Kennedy Center, also called the center’s deferred maintenance and financial deficit “criminal” and referred the institution to the U.S. attorney’s office.\n\nAdministration officials leaped on former FBI director James Comey for a social media post spelling out “86 47,” which the president called an “assassination” threat.\n\nThe Justice Department also announced plans this week for a new unit specifically taking aim at university diversity programs in an effort to pull out federal funding.\n\nProsecutors are also investigating New York Attorney General Letitia James for mortgage fraud — after she successfully led a civil case against the president and his real-estate empire for defrauding investors by fraudulently inflating the value of his properties.\n\n“This investigation into me is nothing more than retribution,” James said in public remarks last week. “It’s baseless.”\n\nAnd, in the middle of an Oval Office meeting with South Africa’s president, Trump lashed out at a “jerk” reporter the president said “ought to be investigated,” adding to a long list of media outlets and publishers the president has threatened with legal action.\n\nThe Justice Department’s criminal investigation into Cuomo, the current front runner in the race for New York mayor, was unveiled just weeks after the administration dropped corruption charges against his rival Eric Adams.\n\nAn investigation follows accusations from House Republicans that Cuomo lied to a congressional subcommittee about decisions he made during the COVID-19 pandemic while he was governor.\n\n“We have never been informed of any such matter, so why would someone leak it now? The answer is obvious: This is lawfare and election interference plain and simple — something President Trump and his top Department of Justice officials say they are against,” Cuomo’s spokesperson Rich Azzopardi told The Independent.\n\n“Governor Cuomo testified truthfully to the best of his recollection about events from four years earlier, and he offered to address any follow-up questions from the subcommittee — but from the beginning this was all transparently political,” he added.\n\nThe probe is coming from the U.S. attorney’s office in Washington, D.C., not in New York. The top prosecutor in D.C. is now former Fox News host Jeanine Pirro, who unsuccessfully ran against Cuomo for state attorney general in 2006.\n\nPirro routinely came to Trump’s defense on-air throughout his criminal indictments and investigations, and she previously called on state prosecutors to investigate the governor for manslaughter and negligent homicide.\n\n“You cannot escape the consequences of your intentional and reckless acts,” she said during a Fox News segment in 2021. “You cannot escape your intentional coverup.”\n\nEd Martin, who was replaced by Pirro as the top prosecutor in Washington, is now the head of the Justice Department’s “Weaponization Working Group,” which he says will “name” and “shame” people that the administration can’t charge with crimes but deserve to be punished publicly.\n\nDuring a press conference earlier this month, Martin called himself the “captain\" of the group, which is investigating federal prosecutors involved in past investigations into Trump and his allies.\n\n“There are some really bad actors, some people that did some really bad things to the American people. And if they can be charged, we’ll charge them. But if they can’t be charged, we will name them,” Martin said. “And we will name them, and in a culture that respects shame, they should be people that are ashamed.”\n\nThe Justice Department’s investigation into Chicago Mayor Brandon Johnson, who is Black, hinges on accusations that he hired people for the government solely because of their skin color.\n\nThe allegations — outlined in a letter from Trump’s new civil rights division chief Harmeet Dhillon — rest on his comments to a Black church congregation when he was asked about economic opportunities for minority residents.\n\n“There are some detractors that will push back on me and say, you know, ‘The only thing the mayor talks about is the hiring of Black people,’” Johnson said in his remarks. “No, what I’m saying is, when you hire our people, we always look out for everybody else. We are the most generous people on the planet. … Having people in my administration that will look out for the interest of everyone, and everyone means you have to look out for the interests of Black folks, because that hasn’t happened.”\n\nIn a news conference responding to the investigation, Johnson said he won’t be “intimidated by the tyranny that's coming from the federal government.”\n\nDhillon has recast the agency’s mission into one that leans into the president’s grievances and shifts its focus away from police oversight, voting rights protections and combating racial discrimination. Last week, her division ended police misconduct investigations in departments across the country.\n\nThe rapid transformation of the civil rights division is “really unprecedented and and really threatens the foundations of our multiracial democracy, and it’s something that all Americans should be very, very alarmed about,” Jin Hee Lee, director of strategic initiatives at the NAACP Legal Defense Fund, told The Independent.\n\n“Everything that this administration has said indicates that they have absolutely no interest in pursuing civil rights violations or holding bad actors accountable for civil rights violations,” she said.","summary":"Trump promised an end to ‘weaponization’ in government. Now he has a Justice Department at his disposal to commit ‘lawfare’ of his own, critics say","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-doj-enemies-list-pam-bondi-b2756067.html","image":"https://static.independent.co.uk/2025/05/22/13/56/Trump-Florida-NCAA-vkw9txk2.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/Bk6QD7k2-4VHSaSK0.mp4","publish_date":"2025-05-27 12:11:30","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","source_country":"gb","sentiment":-0.161},{"id":325493350,"title":"STUDY: Be My (Leftist) Guest Again: Bias Still Reigns Supreme at PBS","text":"Paula Kerger, chief executive of the taxpayer-subsidized Public Broadcasting Service (PBS), recently told the New York Times, “In terms of the news, we work really hard to try to bring multiple viewpoints forward.”\n\nBut as the second Trump administration begins and PBS comes under unprecedented existential pressure from the administration for its liberally biased evening news product, a review of coverage of the first four months of Trump II proves the PBS News Hour still occupies a liberal bubble, and it’s sealed tight as ever.\n\nA new Media Research Center study tracked and labeled every guest that appeared on the News Hour over the first four months of Trump’s second term -- January 20, 2025 (Inauguration Day) through May 19, 2025 -- and found that liberal-Democratic leaning guests outnumbered conservative-Republican leaning guests by 173-41, a ratio of 4.2 to 1 (106 guests were rated either neutral or politically unrelated). That gap surpassed findings from an analogous MRC study conducted two years ago, which uncovered a ratio of 3.7 to 1.\n\nYet even those figures understate the program’s true slant, as many of the Republican and conservative guests opposed Trump on a variety of issues and controversies, including military issues, program cuts, and deportation of illegal immigrants.\n\nKey Findings:\n\n■ Liberal-Democratic guests outnumbered conservative-Republican guests by 173-41, a ratio of 4.2 to 1.\n\n■ Of 18 total appearances by Republican officials, eight were coded as anti-Trump. Of 24 total appearances by Democratic officials, none were pro-Trump.\n\n■ When elected officials and political appointees were removed from the guest count, the ideological disparity of show guests becomes even more striking, with liberal-leaning guests outnumbering conservative-leaning guests 149-23, for a ratio of 6.5 to 1.\n\n■ Liberal journalists made 22 appearances as guests, compared to just one appearance by a conservative journalist.\n\n■ The ideological breakdown of guests on the News Hour’s new “On Democracy” segment was nearly balanced, 6-5 liberal-conservative. But the difference in hostility during the interviews themselves showed PBS’s liberal ideology had not changed.\n\nLiberal Guests Fearmongering Over Trump 2.0\n\nThe incoming administration was attacked from all angles by PBS guests, who were encouraged to unload on Trump and budget-cutting Elon Musk by News Hour interviewers.\n\nSteve Vladeck, constitutional law professor at Georgetown University, made an impressive five appearances over the study period to fearmonger over Trump and the Supreme Court and Trump’s use or abuse of executive authority, deportations and due process. This same liberal expert came on PBS to defend Hillary Clinton on her email scandal in 2016.\n\nNatasha Sarin appeared twice in the study period to criticize cuts to the IRS by Elon Musk’s cost-cutting Department of Government Efficiency (DOGE). Sarin worked for the Treasury Department during the Biden administration, but PBS failed to provide that information, or the fact that she contributed $750 to the Biden campaign in 2020.\n\n On March 19, host Geoff Bennett conducted a 13-minute interview with Senate Minority Leader Chuck Schumer, and it was challenging -- from the Left. PBS began with a video medley of Democratic leaders expressing their fury at Schumer for voting in favor of a continuing resolution to prevent a government shutdown. The online headline for the interview summarized the tilt: “‘We had an awful choice’: Schumer defends voting with GOP saying shutdown would be worse.”\n\nWouldn’t a balanced PBS moderate between Democrats and Republicans in policy disputes? Instead, PBS anchor Geoff Bennett pressed Schumer: \"Why not be as tactically ruthless as Republicans have shown themselves to be?\"\n\nThe March 28 show brought a welcome bit of balance, as two Princeton University professors, Stephen Macedo and Frances Lee, discussed their book lamenting “public health” bureaucratic overreach during America’s panicked, authoritarian reaction to the COVID pandemic.\n\nYale professor Jason Stanley went on the News Hour on April 1 and ranted to anchor Nawaz about how he was escaping to Canada because America was sinking into fascism under Trump. As usual, no conservatives were interviewed to offer a rebuttal.\n\n PBS, like the other networks, devoted oodles of sympathy to infamous “Maryland man” Kilmar Abrego Garcia while covering the controversy of the Trump administration’s supposedly unjust deportation of the El Salvadoran illegal and suspected MS-13 gang member.\n\nReporter Laura Barron-Lopez was joined April 15 by guest Mary McCord, executive director of the Institute for Constitutional Advocacy and Protection at Georgetown University, who relayed a sympathetic story on Garcia’s behalf: “He was a teenager. His mother sold pupusas. Gangs were trying to extort her and threatening her children and wanted her to put them into the gangs. He was sent here by his family. He's never broken any laws here. There are no criminal convictions here...”\n\nA News Hour favorite, McCord had in January defended Biden’s preemptive pardons of his family’s financial controversies.\n\nRepublican Party Poopers\n\nOf 18 total appearances by Republican elected officials or political appointees, eight were anti-Trump (three of those eight appearances were from one person, retired Rear Admiral James McPherson, criticizing various military moves by Trump). By contrast, of 24 total appearances by Democratic elected officials or political appointees, none were pro-Trump. Also notice that, somehow more Democrats (often disgruntled Biden bureaucrats taking aim at Trump) managed to appear on the PBS News Hour than did Republicans, even though Republicans would seem to be more newsworthy, given their control of both Congress and the presidency.\n\nWhen those elected officials and political appointees were removed from the guest count, the ideological disparity of show guests becomes even more striking, with liberal-leaning guests outnumbering conservative-leaning guests 149-23, for a ratio of 6.5 to 1.\n\nJournalists as Guests\n\nBesides its own roster of reliably liberal reporters (White House reporter Laura Barron-Lopez is typically the most slanted), the PBS guest list was stuffed with liberal journalists from other outlets as well. Over the four-month study period, identifiably liberal journalists made 22 appearances as guests, compared to just one appearance by a conservative journalist -- cartoonist Michael Ramirez, interviewed for a segment that also featured liberal former Washington Post cartoonist Ann Telnaes, who sketched Donald Trump conducting with a swastika-tipped baton. Subtle!\n\nJeffrey Goldberg, editor of The Atlantic (and moderator of the PBS weekly roundtable Washington Week with The Atlantic) appeared twice to talk about his accidental inclusion on a sensitive military “group chat.”\n\nPaul Krugman, the former New York Times columnist, leaned into his partisanship in his February 13 appearance. PBS’s resident economics reporter Paul Solman drew Krugman out on the stupidity of low-income Trump voters, “We know that Trump won heavily among people who pay very little attention to the news.”\n\nBrian Stelter, editor of CNN’s Reliable Sources newsletter (and reliable white knight for the liberal media) appeared on the February 25 show to discuss the “chilling effect” of the Trump administration blocking the Associated Press from the White House reporter pool. He borrowed a ridiculous Soviet-era comparison from White House correspondent Peter Baker of The New York Times, who wrote that “these changes remind him of how the Kremlin took over the press pool and banned certain outlets….So he sees parallels here to what's happened in more repressive countries in the past.”\n\nThe March 3 “On Democracy” segment featured Nobel Peace Prize laureate and investigative journalist Maria Ressa. Bennett bluntly forwarded the maximalist anti-Trump angle, featuring Trump as autocrat: “[Ressa’s] book How to Stand Up to a Dictator detailed her experience running the news site Rappler under the increasingly autocratic regime of President Rodrigo Duterte in the Philippines. She recently sat down with Amna Nawaz to discuss parallels she's seeing between the Philippines and the U.S. under President Trump….”\n\nOn March 14, the News Hour invited on Sarah Brown, senior editor at the Chronicle of Higher Education, to accuse Trump of withholding aid from elite colleges as “part of this larger effort by the Trump administration to try to have universities in alignment with his agenda. That`s really what is underlying everything that we`re seeing here with DEI programs, with these protesters and potential deportations of protesters.” No opposing view was offered.\n\nGuest host William Brangham gave New York Times reporter David Enrich a sympathetic March 17 interview to promote his anti-Trump book Murder The Truth: Fear, the First Amendment, and a Secret Campaign to Protect the Powerful. The online headline provided the flavor: “‘Murder the Truth’ examines growing effort to silence journalists and curtail free speech.”\n\nEnrich provided a laughable liberal media cliché, insisting that Trump’s fight against the Supreme Court precedent in New York Times vs. Sullivan (which set a high standard in defamation cases against public figures) was: “already causing a really severe chilling effect on the ability of everyone from a normal citizen to someone with a Substack newsletter or podcast to journalists at major news outlets being able to really properly scrutinize and hold powerful people to account.”\n\n“On Democracy” Hypocrisy\n\nAfter a relatively mild first two weeks -- perhaps shell shock from Trump’s win? – the News Hour got its liberal groove back with a new series, the portentously titled “On Democracy,” which News Hour co-host Amna Nawaz promised would go beyond the day to day news “to look at big questions about the changing laws, institutions and norms.” How convenient that those became pertinent media questions only after Donald Trump began his second term.\n\nThe recurring segment launched February 6 with guest Barton Gellman of the left-wing Brennan Center. After Nawaz asked Gellman if the courts are \"sort of the most robust guardrail\" against Trump, Nawaz fretted about an American descent into authoritarianism. This came after four years of PBS ignoring unilateral moves by the Biden administration on college loan forgiveness and COVID vaccine mandates.\n\nThe “On Democracy” segment aired 11 times through May 19, and the ideological breakdown of guests was surprisingly balanced, 6-5 liberal-conservative. That might seem like a recognition that PBS knows it has a problem and is trying to solve it. But the interviews themselves fell back into the same liberal grooves, with conservative guests employed as punching bags and liberal guests treated with all respect.\n\nNawaz practically seethed at her conservative guest Michael Knowles during their February 20 interview, blasting him in this exchange on transgenderism after he made a point about the concept spreading via social contagion.\n\nNawaz: Michael, you realize this is the same argument people made about gay people, right?\n\nKnowles: Well, I'm talking about the whole LGBT ideology. So I suppose, in some ways, I'm making that argument myself.\n\nNawaz: You don't believe that gay people exist?\n\nYet three days beforehand, in an “On Democracy” segment February 17, Nawaz set up radical-left Princeton professor Kim Lane Scheppele to imply President Trump was a fascist dictator who would use immigrants and transgenders as scapegoats.\n\nNawaz: We have also seen the targeting with very specific groups like immigrants and transgender people. Is that something you have seen before?\n\nScheppele rose to the liberal bait.\n\nScheppele: Absolutely. Picking scapegoats is partly a way of generating public approval for people who don't like the scapegoats. But it's also a way of saying to people who might challenge this government, this could happen to you. So if you step out of line, you can see what happens. You fall into this abyss of arbitrary treatment, where the law cannot protect you and where we are going to come after you. \n\nNawaz: We have also seen the targeting with very specific groups like immigrants and transgender people. Is that something you have seen before?\n\nScheppele: Absolutely. Picking scapegoats is partly a way of generating public approval for people who don`t like the scapegoats. But it’s also a way of saying to people who might challenge this government, this could happen to you. So if you step out of line, you can see what happens. You fall into this abyss of arbitrary treatment, where the law cannot protect you and where we are going to come after you.\n\nAnother “On Democracy” guest, law professor Ilya Shapiro, was introduced as hailing from the “conservative-leaning” Manhattan Institute, which was either to provide an ideological warning label, or perhaps the beleaguered network drawing attention to the fact that it was trying to be balanced.\n\nStill, Shapiro didn’t get softball questions but was peppered with dubious questions from co-host Geoff Bennett about Trump’s claims of executive authority like this: “There have been arguments, as you well know, that we are either in or that we're approaching a constitutional crisis. I’d imagine you would disagree with that. But what to you would signal a constitutional crisis? What to you, would signal that this democratic experiment is in peril?”\n\nEven one of the ostensibly Republican guests for “On Democracy,” Alberto Gonzales, who served as Attorney General during the George W. Bush administration, was invited onto the April 30 broadcast to relay his anti-Trump position.\n\nNawaz introduced him as a Kamala Harris voter and for having called Trump \"the most serious threat to the rule of law in a generation.\" Nawaz’s last question to him: “Attorney General, you called Donald Trump the most serious threat to the rule of law in a generation. Based on the norm-breaking and the rule-bending we have seen so far, are you worried that you can't get it back once it`s gone?”\n\nAs demonstrated, the News Hour guest list was dominated by radical professors, disgruntled Democratic bureaucrats, and legacy media liberals -- an unwise stance for a tax-funded network that operates (for now) under a congressional mandate to maintain \"strict adherence to objectivity and balance in all programs or series of programs of a controversial nature.” \n\nMETHODOLOGY: The study covered a four-month period, using a Nexis search of News Hour transcripts from Jan 20, 2025 (Inauguration Day) through May 19, 2025, encompassing every edition of the PBS News Hour, Monday through Friday, for a total of 86 episodes of news coverage. (Not included: The half-hour PBS News Weekend show, a separate entity with different hosts that airs on Saturday and Sunday.) \n\nGuests were defined as interview subjects if they appeared in studio or talked to a host or in-studio reporter remotely. Also included as guests were main subjects of field profiles, as well as the show’s occasional “Brief But Spectacular” segments, in which a single guest talked without interaction from an interviewee. Guests were defined as either liberal or conservative based on the subject matter and content of the interview, or classified as non-applicable if neither designation applied. \n\nElected officials and political appointees were included in the tally -- defined as current or recently retired officeholders at the federal, state, and local level, as well as those who currently serve in the Biden White House or served previously or currently in the Trump White House, or were appointed to their position during the Biden or Trump administrations.\n\nRegular PBS pundits were excluded from the tally, as were National Public Radio reporters and public television reporters from local member stations. Guests included in the tally: All other journalists, both reporters and columnists, as well as academics, activists, think tank staffers, etc., save those who discussed non-political subjects or didn’t advance partisan or ideological positions during their interviews.","summary":"Paula Kerger, chief executive of the taxpayer-subsidized Public Broadcasting Service (PBS), recently told the New York Times, “In terms of the news, we work really hard to try to bring multiple viewpoints forward.”\n\nBut as the second Trump administration begins and PBS comes under unprecedented existential pressure from the administration for its liberally biased evening news product, a review of coverage of the first four months of Trump II proves the PBS News Hour still occupies a liberal bubble, and it’s sealed tight as ever.\n\n\n\nA new Media Research Center study tracked and labeled every guest that appeared on the News Hour over the first four months of Trump’s second term -- January 20, 2025 (Inauguration Day) through May 19, 2025 -- and found that liberal-Democratic leaning guests outnumbered conservative-Republican leaning guests by 173-41, a ratio of 4.2 to 1 (106 guests were rated either neutral or politically unrelated). That gap surpassed findings from an analogous MRC study conducted two years ago,","url":"https://www.newsbusters.org/blogs/nb/clay-waters/2025/05/27/study-be-my-leftist-guest-again-bias-still-reigns-supreme-pbs","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/PBSNewsHour2025_Study.png?itok=oYYgUGzw","video":null,"publish_date":"2025-05-27 12:00:00","author":"Clay Waters","authors":["Clay Waters"],"language":"en","category":"politics","source_country":"US","sentiment":0.23},{"id":325459562,"title":"There are two Gen Zs","text":"We can confidently say that Gen Z got a lot more Republican over the last couple of years, thanks to a swarm of new, first-time young voters — specifically men of all races.\nPre-election polling captured this phenomenon, voter registration trends tracked it, and post-election exit polls suggest ballots reflected it. Add to this a recent report from the Democratic firm Catalist, which has produced some of the most definitive analyses of the 2024 election, and you start to get a pretty solid sense that young voters have shifted hard toward the Republican Party.\nStill, that might elide some nuance within Gen Z.\nThe data we have from the last election suggests, broadly, at least two types of young voters: “Old Gen Z” — more Democratic, more progressive — and “Young Gen Z” — more Trump-curious and more skeptical of the status quo.\nThat internal split, roughly between those aged 18 to 24 in the latter camp and 25 to 29 in the former, hasn’t dissipated post-election; it is still showing up in polling and surveys. No cohort is monolithic, but a combination of factors — the pandemic, the rise of smartphones and newer social media, inflation, Trump — seems to be driving a wedge within Gen Z.\nThe upshot is that there appear to be two Gen Zs. And that divide within the generation certainly complicates the long-held belief that younger voters are generally more progressive than older ones — and that Democrats thus have a natural edge with younger generations.\nPolitically, there are two Gen Zs \nAbout a year ago, the Harvard Youth Poll, a public opinion project from that university’s Institute of Politics that has been recording young voters’ sentiments for more than a decade, tracked a major difference in the way voters under the age of 30 were feeling about Joe Biden and Donald Trump. \nWhile Biden held a lead of 14 percentage points among adults aged 25 to 29, his lead among 18- to 24-year-olds was 10 points smaller. Support for Trump was higher among the younger part of this cohort by 5 percentage points in the March 2024 poll.\nThat dynamic remained true even after the Democrats switched to Kamala Harris as their standard-bearer. In the same poll conducted in September, the younger half of Gen Z voters continued to lag in its Democratic support compared to the older half.\nNow, more than four months into the Trump presidency, this dynamic — of Young Gen Z being more friendly to Republicans than Old Gen Z — continues to show up in the latest Harvard IOP poll. \nFor example, the March 2025 survey found that Young Gen Z holds more favorable views of Republicans in Congress than Old Gen Z; while the older cohort disapproves of the GOP by a 35-point margin, the margin for the younger cohort is 28 points. Similarly, the older cohort disapproves of Trump’s job performance more sharply than the younger cohort — a 7-point gap on the margins.\nThe same survey found Trump’s favorability is 5 points better with Young Gen Z than with Old Gen Z. And while both groups tend to be unaffiliated with either party, a slightly larger share of Young Gen Z, 26 percent to 23 percent for Old Gen Z, identifies with the GOP.\nOlder Gen Z hasn’t seen any slippage in its wariness of Republicans. Across all three of those Harvard polls, the share who identify with the Republican Party has remained essentially unchanged. The only major difference in the spring poll is a significant shift away from Democrats toward the “independent” label. Old Gen Z’s views of Republicans in Congress have gotten more positive — 63 percent of them disapprove this spring, compared to 76 percent of them last year. That said, these older Gen Z voters’ views of Trump have only dropped since the fall.\nHarvard’s poll isn’t the only one picking up this split in preferences. Yale University’s youth poll from April has tracked similar divisions in political identification and preferences, while other non-political polling from the Pew Research Center has tracked internal differences within Gen Z as well.\nThe ideology of the Gen Zs\nIn terms of ideology, the polling is noisier, but shows signs of a split as well. \nHarvard’s pre-election polls did track higher “conservative” identification rates among under-25s than over-25s. Across all three 2024 and 2025 Harvard polls, conservative identification is essentially unchanged across both groups. Regardless of how each subgroup self-identifies, however, other polling suggests that the youngest Zoomers may still hold more conservative views than the oldest Zoomers.\nAccording to the spring Yale Youth Poll, younger Gen Z men and women tend to have more Republican-coded opinions than their older Gen Z peers on a range of policy issues. They tend to view Trump more favorably, side with the Republican position on some policies, like immigration, trans women in college sports, and Ukraine, by higher margins, and are more likely to consider casting a vote for a generic Republican candidate than older Gen Z. \nYounger Gen Z is also the segment of Americans where religiosity seems to be holding steady, if not outright increasing. As I’ve reported before, young Gen Z men are holding on or returning to organized religion in rates high enough to slow down a decades-long trend toward religious dissociation in America. \nThey are outpacing older Gen Z and younger millennial men in identifying with a religion, per the Pew Research Center’s latest Religious Landscape Study. And in particular, among all Gen Z born between 2000 and 2006, a higher share, 51 percent, identify as Christian than they did in 2023, when 45 percent said so.\nIncreased religiosity isn’t necessarily direct evidence of more conservative thought or Republican affiliation, but there is a correlation between Republican partisan identification and respondents saying that the role of religion is important to them or that they identify with a religion at all. In other words, more religious Americans tend to be more Republican, or more conservative.\nThis split could upend future elections\nShould these trends hold, they will pose a challenge for both major political parties. \nThe idea of a rising Democratic electorate — that younger, diverse, and more progressive generations of voters becoming eligible to vote could deliver consistent victories for Democratic and liberal candidates — looks increasingly tenuous, not least after the 2024 elections. The polling since suggests the pro-GOP shift among younger Gen Z-ers may not be a blip. \nBut Republicans will have work to do to sustain these gains and to have them work in their party’s favor during election season. That Young Gen Z showed up for the GOP in 2024 doesn’t guarantee that they will do so again in next year’s midterms, or the next presidential election.\nAnd a lot is at stake. Gen Z will become the largest part of the electorate in 2030, and will have the power to sway elections, if Democrats and Republicans can keep them engaged. \nFor now, the data show there may be something durable in the split that 2024 polling captured: The newest cohort of young voters, who couldn’t vote in previous elections, was significantly more Republican than the oldest young voters. In 2020, Trump got about 31 percent of their vote. In 2024, he got 43 percent of their support.\nAnd the 2024 Catalist report suggests that the shift was driven by the emergence of a previously disengaged, male, and racially diverse youth electorate, made up predominantly of newly eligible Young Gen Z voters. Young Black and Latino men in this cohort shifted their votes to Trump, and were a significant chunk of new voters. Was this shift unique to Trump and his campaign? Perhaps. But what data we do have suggests there is an underlying curiosity or openness toward Republicans among the youngest cohort of Gen Z — one strong enough to cleave this generation in two.","summary":"We can confidently say that Gen Z got a lot more Republican over the last couple of years, thanks to a swarm of new, first-time young voters — specifically men of all races. Pre-election polling captured this phenomenon, voter registration trends tracked it, and post-election exit polls suggest ballots reflected it. Add to this a [&#8230;]","url":"https://www.vox.com/politics/414266/republican-conservative-two-gen-z-young-voter-trumpier-progressive","image":"https://platform.vox.com/wp-content/uploads/sites/2/2025/05/gettyimages-2158175237.jpg?quality=90&strip=all&crop=0%2C10.728733235956%2C100%2C78.542533528088&w=1200","video":null,"publish_date":"2025-05-27 11:30:00","author":"Christian Paz","authors":["Christian Paz"],"language":"en","category":"politics","source_country":"us","sentiment":-0.077}]}