{"offset":0,"number":50,"available":4286,"news":[{"id":255360962,"title":"Harris criticizes Trump for using Arlington visit for political gain and disrespecting hallowed site","text":"Vice President Kamala Harris said former President Donald Trump “disrespected sacred ground” in his recent appearance at Arlington National Cemetery, where the Republican nominee took and distributed images despite a federal prohibition on campaign activity on the grounds. Harris, in a statement posted Saturday on the social media platform X, cited reports that Trump’s campaign aides created an altercation with a cemetery staffer and proceeded to take photographs and film the former president, including at the graves of Afghanistan war veterans, after being warned about rules at the site. “Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,” Harris said, calling Arlington a “solemn place where we come together to honor American heroes … not a place for politics.” The original incident stemmed from Trump’s and Republicans’ continued criticism of President Joe Biden and now Harris for the chaotic U.S. withdrawal from Afghanistan. At the invitation of some family members of service members killed during the withdrawal, Trump laid wreaths last Monday in honor of Sgt. Nicole Gee, Staff Sgt. Darin Hoover and Staff Sgt. Ryan Knauss. They were among 13 U.S. service members and more than 100 Afghans who died in an Aug. 26, 2021, bombing at Hamid Karzai International Airport. Trump’s campaign was warned about not taking photographs before an altercation at the cemetery, according to defense officials. Officials have said since that an Arlington employee whom two Trump campaign staff members allegedly “verbally abused and pushed” aside has declined to press charges. The Trump campaign has since lashed out at Pentagon officials, with a top campaign adviser, Chris LaCivita, referring to military spokespersons as “hacks.” Trump campaign officials say it had permission to bring someone to take video. Since Biden ended his reelection bid, Trump has been zeroing in on Harris and her roles in foreign policy decisions. He has specifically highlighted the vice president’s statements that she was the last person in the room before Biden made the decision on Afghanistan. Biden’s administration was following a withdrawal commitment and timeline that the Trump administration had negotiated with the Taliban in 2020. A 2022 review by a government-appointed special investigator concluded decisions made by both Trump and Biden were the key factors leading to the rapid collapse of Afghanistan’s military and the Taliban takeover. Harris on Saturday alluded to Trump’s history of picking fights with veterans and repeated allegations that he has “called our fallen service members ‘suckers’ and ‘losers’ and disparaged Medal of Honor recipients.” “This is a man who is unable to comprehend anything other than service to himself,” Harris said. “I will always honor the service and sacrifice of all of America’s fallen heroes. … And I will never politicize them.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nVice President Kamala Harris said former President Donald Trump “disrespected sacred ground”&#8230;\n\n\nThis Post: Harris criticizes Trump for using Arlington visit for political gain and disrespecting hallowed site first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/harris-criticizes-trump-for-using-arlington-visit-for-political-gain-and-disrespecting-hallowed-site/","image":"https://www.clickorlando.com/resizer/wb-bS6dhvsCYcI6YopPX1wjODPI=/cloudfront-us-east-1.images.arcpublishing.com/gmg/ORUJZTHIBFHDTCKE77EUK72BFY.jpg","video":null,"publish_date":"2024-08-31 23:50:56","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.141},{"id":255360872,"title":"Kamala provokes Trump to make surprising statement on recurring election issue","text":"Kamala Harris provoked Donald Trump into reversing his position on abortion, it has been revealed, with the former president suddenly embracing the practice by blasting out a rather surprising statement on social media. ‘My Administration will be great for women and their reproductive rights,’ Trump declared in a recent post on his Truth Social platform. The latest twist from Trump exemplifies his vacillating position on the pivotal topic. The man who once called himself ‘the most pro-life president’ has also been evasive, saying the issue should be determined at the state level. But after the Democratic National Convention, Trump was privately ‘bothered by Ms. Harris’s assertions that a second Trump term would further imperil abortion rights,’ according to the New York Times. Trump had also been vexed by other speeches at the DNC, which linked him with Project 2025, a conservative blueprint that promises to further restrict reproductive measures, the Times said. After watching Harris’ speech on August 23, Trump was so angry that he delivered the statement about his future administration affording women their reproductive rights – a declaration that the New York Times observed ‘sounded as if it could come from the head of Planned Parenthood.’ Asked to make a comment by the New York Times, Karoline Leavitt, a spokeswoman for the former president, said that he ‘has long been consistent in supporting the rights of states to make decisions on abortion.’ She added that presidential candidate has ‘been very clear that he will not sign a federal ban when he is back in the White House.’ But this is only the latest chapter in the long and complicated history Trump has with abortion, an issue he routinely waffles on. In 1999, Trump, then 53, told NBC’s Meet the Press that he was ‘very pro-choice.’ By 2011, however, he had changed his stance and told attendees at a conservative conference that he was ‘pro-life.’ When he first ran for president in 2016, he further heightened his opposition to abortion, telling MSNBS host Chris Matthews that he would be in favor of punishments for women who received the operation. The former president understands that abortion is an incredibly invidious and delicate issue. According to the New York Times, in 2022, when the Supreme Court was on the verge of overturning Roe v. Wade, Trump told allies that the ‘move would hurt his party.’ The Republicans’ lackluster performance in the midterms seemed to bear out the former president’s prediction. ‘Mr. Trump has been privately emphatic with advisers that in his view the abortion issue alone could kill their chances of victory in November,’ the New York Times reported. As a result, Trump’s views on reproductive rights have oscillated wildly in recent months, much to the chagrin of some social conservatives. Erick Erickson, the founder of the conservative website RedState, told the New York Times: ‘It almost seems to me like this is improvisational politics.’ He continued: ‘There’s not really a plan- he’s “Live at the Improv,” which is a problem for this.’ Trump further frustrated social conservatives by adopting a more progressive line on IVF, or in vitro fertilization. This week, he declared that he would make the expensive procedure free for Americans, which the New York Times noted would be ‘an initiative that would put him to the left of many Democrats.’ The former president has further distanced himself from the issue by reportedly ordering the party to tone down abortion language at the Republican National Convention. Earlier this spring, Trump told his advisors that he was leaning toward endorsing a 16-week national abortion ban with exceptions for rape, incest, and the life of the mother, according to the New York Times. However, he reportedly reversed course after looking over some polling and started saying that abortion was something that should be decided at the state level. However, the former president has repeatedly voiced his objection when state’s have ruled too harshly on the abortion question. He has denounced Florida’s 6-week ban, calling it a ‘terrible mistake,’ and during an interview with NBC on Thursday. He added that women in Florida needed more time in order to determine whether or not they wanted an abortion. This prompted outcry from some conservatives, including those at the National Review, where they published an article entitled ‘Trump Stabs Florida Pro-lifers in the Front.’ In an effort to clean up the situation, Ms. Leavitt told the New York Times that the former president ‘simply reiterated that he believes six weeks is too short.’ On Friday, Trump revealed that he would vote no on the measure that would preserve the six-week ban in Florida. As the final weeks of the presidential campaign grind on and Trump tries to regain some of the losses he has incurred since Harris took over for President Joe Biden, he will face the immense challenge of winning over new voters while placating his base.","summary":"Internewscast Journal\n\nInternewscast\n\n\nKamala Harris provoked Donald Trump into reversing his position on abortion, it has&#8230;\n\n\nThis Post: Kamala provokes Trump to make surprising statement on recurring election issue first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/kamala-provokes-trump-to-make-surprising-statement-on-recurring-election-issue/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-How-Kamala-agitated-Trump-into-making-shock.jpg","video":null,"publish_date":"2024-08-31 23:46:49","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.087},{"id":255360612,"title":"Trump unleashes on Harris, talking immigration, China in exclusive 'Life, Liberty & Levin' interview","text":"EXCLUSIVE: Former President Trump unleashed on Vice President Kamala Harris in a wide-ranging interview on Fox News' \"Life, Liberty & Levin.\" Fox News Channel host Mark Levin sat down with the former President Trump at Mar-a-Lago to discuss his new book, \"Save America,\" which is set to hit bookstores on Sept. 3. The exclusive interview will air on Fox News Channel at 8 p.m. ET on Saturday and on Sunday. MNBC HOST RAGES AFTER SEEING POLLS SHOWING TRUMP LEADING, CALLS ELECTORAL COLLEGE A ‘SUICIDE PACT’ WATCH: Trump warned that a Harris presidency would include no fracking in pivotal battlegrounds, like Pennsylvania, saying that the Democratic nominee is a \"radical left Marxist.\" \"I call her comrade Kamala because she is radical left. She's a radical left Marxist. And that's what she is. And she'll destroy our country,\" he said. \"There's not going to be any fracking in Pennsylvania.\" \"And for her whole life, she fought people like I've never seen anything like it…look at the way she fought Justice Kavanaugh. The viciousness and the violence,\" he said. \"She's a Marxist.\" WATCH: During the interview, Levin asked Trump if he received any note or call from Harris following the assassination attempt in Butler, Pennsylvania, on July 13. \"Did you get a call or a note, I’m just curious, from Kamala Harris?\" Levin asked. \"No. Not that I know of,\" Trump responded. The former president noted that he received a phone call from President Biden following the would-be assassination. WATCH: Trump discussed the \"terrible\" mainstream media, reminiscing about his previous debate performance with Biden, which heightened calls for the current president to stop pursuing reelection. \"ABC is probably the worst in terms of fairness. George Flopadopalis… the people they have, they're just terrible… Jonathan. Karl,\" he said, speaking about his upcoming date with Harris in September. \"I had to make a decision, I wanted to, and I like to debate.\" GEN Z INFLUENCERS RAVE ABOUT TRUMP VP PICK JD VANCE: ‘HE HAS WHAT IT TAKES TO WIN OVER MY GENERATION’ \"I mean, I guess I've won a lot of debates because otherwise I wouldn't have been president,\" he said. \"I had a lot of debates initially, and the last one with Joe Biden, I think I did a very good job. And, maybe I did too good a job, but he was shielded and sheltered from, you know… here's a man that's in charge of nuclear warfare and stuff. And I don't think he should have been there, but that was a debate, and it was their idea. They wanted to do it. I said, you know, it's early, but I'll do it if you want. What do you want to do? And they gave me CNN. They gave me Jake Tapper, and they gave me Dana Bash, who traditionally you would never do it. You'd never do it with them because they're Trump haters at the highest level. And CNN is a Trump hater.\" WATCH: The former president also weighed in after Meta Platforms CEO Mark Zuckerberg said that the Biden administration pressured the company to \"censor\" COVID-19 content during the pandemic and the scandal surrounding Hunter Biden's laptop. \"It just came out today in the New York Post that, Zuckerberg listened to the administration and did everything he could to help them, including hiding the laptop from hell, which is Hunter Biden, which has more stuff in it than even they report now,\" he said. \"But the laptop from hell, they hid the 51 intelligence agents had a lot of different things.\" \"It would have made a big difference in the election. So that's election cheating right there,\" he said. WATCH: The former president called SpaceX and Tesla CEO Elon Musk a \"great friend,\" saying that, despite \"loving\" electric cars, they are sustainable at this point in time. \"Elon's a great friend of mine. I think he's phenomenal. I love electric cars. I think they're great,\" Trump told Levin. \"But there's a place for them. And then there's a place for gas-propelled cars. And there's a place for hybrids.\" TRUMP-MUSK INTERVIEW: 5 BIGGEST TAKEAWAYS FROM THE 2024 PRESIDENTIAL ELECTION TO THE US BORDER CRISIS \"They buy everything, and they have a mandate, but we don't make enough electricity,\" he said. \"So what are they going to do? And who would create this mandate? Where they want to make trucks all electric, but the trucks would have to stop six times to get charged from New York to Los Angeles, as opposed to no times if you have diesel. With diesel, the truck gets lighter and lighter as it goes along. With electric, the battery is so big it would take half the payload.\" Harris has recently attempted to flip the script on her previously encouragement of an electric vehicle mandate, recently back tracking her strong support for a mandate. WATCH: Trump highlighted the illegal migrant crisis in the U.S., saying that criminals are coming and \"destroying our country.\" \"We have billions of people coming in, but hundreds of thousands of those people are criminals from Venezuela,\" Trump said. \"They take them off the streets of Caracas, and they bring them into our country.\" \"And then they [Venezuela] announce a crime rate is way down. You know, that's what they've done. Their crime rate is way down now, but they come from Africa, Asia, the Middle East and from South America. And they're destroying our country.\" Trump slammed Harris for ignoring the immigration crisis at the recent Democratic National Convention (DNC). \"And when you watch her, like at the convention, oh, everything's just peachy,\" he said. \"But migrant crime is turning out to be a disaster. Many, many people are killed and raped and mugged and everything else. These are tough people, but they let them out of jails.\" WATCH: Trump weighed in on his relationship with China's President Xi Jinping, saying that there has been \"no greater critic of China than me.\" \"I think there is no greater critic of China than me,\" he said. \"But I respected China and I respected President Xi and I had a great relationship with them.\" \"They took advantage of us. And why shouldn't they? I mean, if we were stupid enough to let them do it, they made hundreds of billions of dollars a year, $507 billion. And most years over that and now it's more, and I had them down to a much smaller,\" he said. \"And I put massive tariffs on them. Nobody got any money from China, but I got hundreds of billions of dollars from China.\" CLICK HERE TO GET THE FOX NEWS APP Trump said that if he wins November's election that he will have a good relationship with \"everybody.\" \" I think that we will have a good relationship. I'd rather have a good relationship with China,\" he said. \"And I'm saying this, and I hope that President Xi is watching, which he will in one form or another, whether it's watching or he'll be told.\" \"But I think we'll have a good relationship with China. And I think we'll have a good relationship with everybody,\" he said. Fox News Digital has reached out to the Harris campaign for comment.","summary":"In an exclusive interview with Fox News&apos; Mark Levin, on &apos;Life, Liberty &amp; Levin,&apos; Former President Trump said that Kamala Harris is a &quot;radical left Marxist,&quot; and discussed his domestic and foreign relations plans.","url":"https://www.foxnews.com/media/trump-unleashes-harris-talking-immigration-china-exclusive-life-liberty-levin-interview","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/071c64f7-14c1-4667-a71c-0457f80a9a11/652f44d2-b162-414a-b388-83e3bc60aa7a/1280x720/match/720/405/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-31 23:14:14","author":"Sarah Rumpf-Whitten","authors":["Sarah Rumpf-Whitten"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.318},{"id":255359894,"title":"Anuel AA’s support for Trump and appeal to Latino voters in Pennsylvania","text":"Celebrity endorsements in an election year are hardly a new phenomenon. But former President Donald Trump’s appearance alongside Puerto Rican reggaeton star Anuel AA forms part of a larger emerging pattern in his campaign’s outreach to voters of color — and signals the campaign might see an opportunity in battleground Pennsylvania. After greeting the former president on the tarmac, Anuel AA, born Emmanuel Gazmey Santiago, endorsed Trump during his rally in Johnstown, Pennsylvania, on Friday, telling Puerto Ricans to “stay united” and to “vote for Trump.” “I don’t know if these people know who the hell you are, but it’s good for the Puerto Rican vote. Every Puerto Rican is going to vote for Trump right now. We’ll take it,” Trump told several thousand attendees at the campaign rally while introducing the rapper. While the immediate crowd might not be familiar with the star, his magnitude as a reggaeton and rap artist likely won’t be lost on the likely target audience: young Puerto Rican voters and battleground state Latino voters at large. The 31-year-old rapper is a frequent feature on smash hits with artists like Bad Bunny — and a major artist in his own right with a social media following millions-strong to show for it. But the rapper’s appearance and brief remarks may also be part of a larger Trump campaign effort to court artists of color to engage voters in a new way. Trump has garnered the support of several notable Black artists — including rappers Lil Wayne and Kodak Black — and others like Sexxy Red have signaled their support for the former president in interviews. At a rally in the Bronx earlier this year, Trump brought up two local fixtures of the growing drill music scene: Sheff G and Sleepy Hallow. Even though Puerto Ricans who live on the island — despite being U.S. citizens — can only vote in presidential primaries and not in the general election, they can still influence relatives on the mainland. Pennsylvania, a state that doesn’t often first come to mind as a battleground with a sizable Latino vote, is home to the third-largest Puerto Rican diaspora community in the country (roughly 500,000 Puerto Ricans strong) after thousands fled the island in the aftermath of Hurricane Maria in 2017. Puerto Rican and Latino support for President Joe Biden proved crucial in cementing his successful 2020 campaign in the Keystone State, while over 60% of Latino voters nationwide broke for Biden over Trump, according to exit polls conducted at the time. Now, both sides of the ticket may see a path to victory in strengthening their margins in these growing diaspora communities. Earlier this summer, the Trump campaign opened a “Latino Americans for Trump” office in Reading, Pennsylvania, inviting former Puerto Rico Gov. Luis Fortuño to deliver remarks at its opening in both English and Spanish. Even Vice President Kamala Harris, before launching her own presidential bid following Biden’s decision to no longer seek re-election, took her first official trip to the island and toured housing developments made possible through $140 billion of infrastructure funding from the Biden-Harris administration. While the influence of any celebrity endorsement is hard to gauge, Anuel AA wading into the election on Trump’s behalf is significant — even if just as a pop culture moment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCelebrity endorsements in an election year are hardly a new phenomenon. But&#8230;\n\n\nThis Post: Anuel AA&#8217;s support for Trump and appeal to Latino voters in Pennsylvania first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/anuel-aas-support-for-trump-and-appeal-to-latino-voters-in-pennsylvania/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-08/240831-Anuel-AA-trump-ch-1035-1fc75e.jpg","video":null,"publish_date":"2024-08-31 23:00:58","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.113},{"id":255360462,"title":"Trump repels women—and he just keeps making it worse","text":"In 2020, Democratic presidential nominee Joe Biden was the beneficiary of a massive gender gap that propelled him to the White House. According to exit polls, Donald Trump won men by 8 percentage points (53% to Biden’s 45%) but lost women by 15 points (42% to Biden’s 57%)—a huge 23-point gender gap. That was before Trump’s largely handpicked Supreme Court overturned Roe v. Wade and ended the constitutional right to abortion, and before the Democratic Party nominated a dynamic woman candidate to face a tired, grumpy Trump in 2024. The result: The latest Quinnipiac University poll has Vice President Kamala Harris winning women by 21 points (58% to Trump’s 37%), and Trump winning men by 18 points (57% to Harris’ 39%)—a yawning 39-point gender gap. That gap is on the larger side among recent polls, though. Emerson College’s recent swing-state polls show the difference in most states hovering around 20-25 points (much like it did in 2020), but pollsters might struggle to account for the recent massive increase in voter registration among women. There is a tsunami brewing among women voters. So what’s Trump doing about it? Making things worse for himself. Let us count the ways that the Trump campaign and conservatives have wooed women in the past two days. This Washington Post headline from Thursday kind of says it all: “Vance tells Harris to ‘go to hell’ for cemetery criticism she didn’t give.” Yes, telling successful, powerful women to go to hell is always a winner. Ladies love it when men attack them with that kind of language. Trump’s running mate, Ohio Sen. JD Vance, already dug the ticket into a hole thanks to his bizarre obsession with a woman’s breeding status. You’d think he would be trying to mitigate that damage. Then there’s this from Mediaite also on Thursday: “‘Beyond Disgusting’: Radio Host Slammed For Calling Kamala Harris Power Hungry ‘Since The Moment She Got Up Off Her Knees’” Erick Erickson, the conservative radio host in question, is not a huge Trump fan. He is also self-righteously pious, but his supposed religiosity didn’t prevent him from saying something vile about our country’s first woman vice president. “Kamala Harris has done nothing but climb the ladder of power since the moment she got up off her knees in front of Willie Brown,” Erickson spewed. Attacking Harris’ short-lived relationship with the former San Francisco mayor is a common refrain in current right-wing discourse as frustration mounts with conservatives’ inability to land any real blows on her soaring campaign. Which voters are these Trump surrogates trying to sway with these kind of crass and sexist attacks? Yet, instead of backing off, they’re getting positive reinforcement from none other than Trump himself. On Truth Social, one noxious user posted an image containing a photo of Hillary Clinton and Harris as well as the comment “Funny how blowjobs impacted their careers differently…” Trump then shared the post with his followers on the site. And on Wednesday, CNN anchor Pamela Brown said it made her “stomach feel sick.” Moves like that amplify Trump’s sick, debased behavior in ways that, once again, won’t be helping him win votes. This also happened: They can’t help themselves, can they? And then there’s this week’s Arlington National Cemetery disgrace, where Trump and his team staged a campaign photo op in violation of federal law. And when a female cemetery official tried to stop them, she was literally shoved aside. “An ANC employee who attempted to ensure adherence to these rules was abruptly pushed aside,” the U.S. Army said in a statement. Unfortunately, she is too terrified of Trump’s goons to press charges. But it all adds up politically. Trump is struggling to win a key demographic, but he can’t escape his own misogynistic impulses, nor the sexism at the root of his base. And the more momentum Harris builds, the uglier those attacks will be, perpetuating a vicious cycle that will serve Trump poorly through Election Day.","summary":"In 2020, Democratic presidential nominee Joe Biden was the beneficiary of a massive gender gap that propelled him to the White House. According to exit polls, Donald Trump won men by 8 percentage points (53% to Biden’s 45%) but lost women by 15 points (42% to Biden’s 57%)—a huge 23-point gender gap.&nbsp;\n\n\n\nThat was before Trump’s largely handpicked Supreme Court overturned Roe v. Wade and ended the constitutional right to abortion, and before the Democratic Party nominated a dynamic woman candidate to face a tired, grumpy Trump in 2024. The result: The latest Quinnipiac University poll has Vice President Kamala Harris winning women by 21 points (58% to Trump’s 37%), and Trump winning men by 18 points (57% to Harris’ 39%)—a yawning 39-point gender gap.&nbsp;\n\n\n\nThat gap is on the larger side among recent polls, though. Emerson College’s recent swing-state polls show the difference in most states hovering around 20-25 points (much like it did in 2020), but pollsters might struggle to account for the recent ma","url":"https://www.dailykos.com/story/2024/8/31/2266638/-Trump-repels-women-and-he-just-keeps-making-it-worse?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1340063/story_image/GettyImages-1683613289.jpg?1725032090","video":null,"publish_date":"2024-08-31 23:00:06","author":"kos","authors":["kos"],"language":"en","source_country":"US","sentiment":-0.235},{"id":255359704,"title":"Harris slams Trump over Arlington National Cemetery altercation, prompting fiery response from JD Vance","text":"Vice President Kamala Harris slammed former President Trump after an incident involving his staff and a cemetery official this week, prompting a critical response from Trump's running mate, Sen. JD Vance. On Thursday, an Army spokesperson said an Arlington National Cemetery official was \"abruptly pushed aside\" while interacting with Trump's staff during a wreath-laying ceremony event Monday. The ceremony honored service members killed by ISIS-K terrorists Aug. 26, 2021, during the U.S. withdrawal from Afghanistan. The U.S. Army said in a statement the employee was making sure that Trump's team was \"made aware of federal laws, Army regulations and DoD policies, which clearly prohibit political activities on cemetery grounds.\" Trump claimed he took photographs with families of service members who had requested them. \"[President] Joe Biden killed those young people because he was incompetent,\" Trump said during a speech in Johnstown, Pennsylvania, Friday. \"And then they tell me that I used their graves for public relations services, and I didn’t.\" TRUMP IMPERSONATES ELON MUSK TALKING ABOUT ROCKETS: ‘I’M DOING A NEW STAINLESS STEEL HUB’ In a statement posted on Facebook Saturday afternoon, Harris accused Trump's team of disrespecting service members. \"As Vice President, I have had the privilege of visiting Arlington National Cemetery several times,\" the statement from the Democratic presidential nominee said. \"It is a solemn place; a place where we come together to honor American heroes who have made the ultimate sacrifice in service of this nation. It is not a place for politics. \"And yet, as was reported this week, Donald Trump’s team chose to film a video there, resulting in an altercation with cemetery staff,\" Harris added. \"Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt.\" Harris claimed the incident was \"nothing new\" from Trump and accused the former president of \"call[ing] our fallen service members ‘suckers’ and ‘losers’ and disparage[ing] Medal of Honor recipients.\" \"This is a man who is unable to comprehend anything other than service to himself,\" Harris added, before promising to \"never politicize\" service members. TRUMP-MUSK INTERVIEW: 5 BIGGEST TAKEAWAYS FROM THE 2024 PRESIDENTIAL ELECTION TO THE US BORDER CRISIS The statement was met with swift backlash from Republican vice presidential candidate JD Vance, who suggested Harris \"get off social media.\" \"President Trump was there at the invitation of families whose loved ones died because of your incompetence,\" Vance wrote on X. \"Why don’t you get off social media and go launch an investigation into their unnecessary deaths?\" Karoline Leavitt, who served as an assistant press secretary during the Trump administration, also criticized Harris on social media. \"Kamala Harris bragged about being the last person in the room with Joe Biden when they decided on their terrible Afghanistan withdrawal plan,\" Leavitt wrote. \"Kamala’s stupidity led to one of the most embarrassing events in American history and 13 brave US soldiers being killed. \"She has never said their names. She has never reached out to their families,\" Leavitt added. \"For this alone, Kamala does not deserve to be elected. Kamala has already proven that she would be a dangerously incompetent Commander in Chief.\" CLICK HERE TO GET THE FOX NEWS APP Fox News Digital reached out to the Trump and Harris campaigns for comment. The Associated Press contributed to this report.","summary":"Former President Trump was the target of a critical post by Vice President Kamala Harris Saturday accusing him of disrespecting service members.","url":"https://www.foxnews.com/politics/harris-slams-trump-over-arlington-national-cemetery-altercation-prompting-fiery-response-from-jd-vance","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/Copy-of-Side-by-Side-split-9.png?ve=1&tl=1","video":null,"publish_date":"2024-08-31 22:46:33","author":"Andrea Vacchiano","authors":["Andrea Vacchiano"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.465},{"id":255358336,"title":"Harris’ Economic Message--Successes Fight For Media Attention","text":"Share to Facebook Share to Twitter Share to Linkedin RALEIGH, NORTH CAROLINA - AUGUST 16: Democratic U.S. presidential candidate Vice President Kamala ... [+] Harris speaks on her policy platform, including improving the cost of living for all Americans, (Photo by Grant Baldwin/Getty Images) Getty Images As the presidential campaign goes into high gear starting on Labor Day, Kamala Harris has been outlining her policies—including economics. For the most part, she is sticking with the very successful policies of the Biden Administration. She is now working to communicate these economic successes while addressing economic problems, as many Americans still have negative views on the economy in spite of very strong economic numbers. Start with employment and jobs. Although the unemployment rate has ticked up in the last few months, we have been experiencing strong and steady job growth. Forbes’ Derek Saul told us as of mid-August, “Since Biden took office, overall employment is up 11%, average pay is up 17% and unemployment is down from 6.7% to 4.3%.” This continuing job growth is especially remarkable given the Federal Reserve’s high interest rates. In what was likely a mistaken analysis of how to fight inflation, the Fed has raised interest rates eleven times since 2022, with the current average federal funds rate of 5.33% the highest in over twenty years. (Fed chairman Jerome Powell recently said “the time has come” for the Fed to cut rates, most likely at upcoming their September meeting.) Steady job growth has benefited lower-paid workers. While the persistent Black-white unemployment rate gap remains too high, in August that gap was 2.5 percent, relatively low historically. But we need continuing economic growth to bring unemployment rates down and help close that gap, which also is driven by continuing labor market discrimination. America’s economic performance is very strong, even in the face of high interest rates. Consider a recent description of the economy: “the economy is not just resilient, it is quite robust” with the US doing significantly better than European competitors. MORE FOR YOU Apple iPhone 16 And iPhone 16 Plus: Everything We Know So Far FBI Issues Urgent Ransomware Attack Warning—Do These 3 Things Now Today’s NYT Mini Crossword Clues And Answers For Saturday, August 31 Was that the Biden-Harris Administration bragging? No. It was a mid-year analysis from JPMorgan’s private banking division, hardly a pro-Democratic source. Elaborating on the positive data, economist James Pethokoukis of the conservative and Republican-leaning American Enterprise Institute says “the US economy has outperformed all other major economies post-pandemic, exceeding pre-pandemic growth projections despite inflation and monetary tightening.” He points out that “the US stands alone among major economies in delivering a recovery where both labor supply and productivity gains are rising above their pre-pandemic pace.” Why then are so many Americans sour on the economy? Inflation is the main culprit, although some observers also blame political polarization and the news media. There’s no question that high inflation early in Biden’s term made people feel worse about the economy. Faced with the pandemic-induced economic decline, Biden successfully pushed for increased government spending and support to households to boost the economy. And that spending surge was successful, as our current economic numbers and superior performance to European nations shows. Some claimed the increased spending was causing inflation to rise, in a classic demand-driven inflation. But others argued the pandemic had badly disrupted global supply chains, driving price hikes, and inflation would moderate as those kinks were worked out. That was the argument made by Biden’s economists in 2021 and it looks to be correct. Our current slowing inflation leads Nobel laureate Paul Krugman to say that “the inflation news is a big vindication for Bidenomics.” Certainly the lived experience of inflation has contributed to negative sentiments about the economy. While unemployment hits some households, higher prices hit everyone, so sustained inflation can make people feel worse. But analysts also argue our increasing political polarization contributes to negative views on the economy. In 2020, the Gallup Organization’s Frank Newport looked at a wide range of economic indicators, and concluded that “Americans' views of the economy, at both the national and personal levels, are significantly related to their political identity.” This continues today. A 2024 Harris Poll for The Guardian found significant differences in assessing the economy between Republicans and Democrats. The report noted “the survey continued a trend of Republicans reporting higher levels of pessimism about the nation’s finances since Biden took office.” And some scholars implicate news media’s coverage of economics in the pessimism. Political scientists Mark Copelovich and Michael Wagner found that “individuals’ views on the economy are influenced by the information they are exposed to through media usage and political talk networks.” Copelovich frequently posts a graphic showing how a bias towards negative economic news has plagued Biden. The graphic shows headlines since Biden took office, with the terms “inflation” and “recession” far outnumbering “unemployment/jobs” or “recovery.” So Harris has her work cut out to communicate economic success. And she is wisely focusing on continuing economic pain points, especially in emphasizing an “Opportunity Economy” that will lower the cost of housing and invest in affordable child care. Expect more of that message as the election heats up, and she draws contrasts with Trump’s tax and other policies that favor wealthy Americans. Follow me on Twitter or LinkedIn. Richard McGahey Following Editorial Standards Print Reprints & Permissions","summary":"Kamala Harris has a strong economic record to run on, but is emphasizing future challenges and solutions.","url":"https://www.forbes.com/sites/richardmcgahey/2024/08/31/harris-economic-message--successes-fight-for-media-attention/","image":"https://imageio.forbes.com/specials-images/imageserve/66d396cee976aa7f3b2a4685/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-31 22:22:34","author":"Contributor,Richard McGahey","authors":["Contributor","Richard McGahey"],"language":"en","source_country":"US","sentiment":0.133},{"id":255359782,"title":"RFK Jr. sues North Carolina elections board after swing state refused to remove name from ballot","text":"The lawsuit filed in Wake County Superior Court on Friday says the board’s decision to deny Kenendy’s request to remove his name from the ballot violates his free speech rights and accuses the board of making an issue out of nothing. “By refusing to acknowledge Kennedy’s statutory rights and entitlements, defendants have irreparably harmed him,” the lawsuit said. “Even worse, by forcing Kennedy to remain on the ballot against his will, defendants are compelling speech in violation of [the Constitution].” “Thus to the extent NCSBE claims it is ‘impractical’ to remove him from the ballot, it is an issue of NCSBE’s own making,” the lawsuit added. The legal move comes a day after North Carolina’s board of elections voted 3-2 to deny Kennedy’s request to remove his name from the ballot. The board has a Democratic majority, and the vote was along party lines. According to the board’s executive director, Karen Brinson, North Carolina has already printed 1.73 million ballots in over 60 counties, and special ballots have already been prepared for overseas military members and the disabled. Kennedy suspended his presidential campaign on Aug. 23 and endorsed former President Donald Trump. He pledged to remain on the ballots in states not likely to be competitive while removing his name from ballots in states that will be. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER However, that has not exactly gone as planned, with Michigan and Wisconsin also denying Kennedy’s request to be removed from their respective ballots. Polling from the Hill and Decision Desk HQ shows Trump and Vice President Kamala Harris tied in North Carolina at 48.1% in a head-to-head race. However, adding Kennedy’s name takes support away from Trump, dropping him down to 43.5% and giving Harris 48.8%.","summary":"Robert F. Kennedy Jr. is suing North Carolina’s board of elections after they refused to remove his name from the ballot in the pivotal swing state. The lawsuit filed in Wake County Superior Court on Friday says the board’s decision to deny Kenendy’s request to remove his name from the ballot violates his free speech [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3140413/rfk-jr-sues-north-carolina-elections-board-refused-remove-name/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/RFK-Jr-2024--scaled.webp","video":null,"publish_date":"2024-08-31 22:21:46","author":"Zach LaChance","authors":["Zach LaChance"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.482},{"id":255360906,"title":"Harris: Trump 'Disrespected Sacred Ground' At US Military Cemetery","text":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump \"disrespected sacred ground\" at a US military cemetery during a contentious pre-election visit.Trump's presence at the hallowed Arlington National Cemetery -- intended to provide a campaign boost ahead of the November 5 vote -- has instead mushroomed into a public dispute consuming the candidates and the military.In Monday's incident at the cemetery across the Potomac River from Washington, Trump broke rules barring photography for political purposes, posing with relatives of US service members killed in Afghanistan in content that was later shared by his campaign on social media.\"Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,\" Harris said.In one image, he is standing with family members of a fallen Marine, posing among headstones while grinning broadly and giving a thumbs-up.\"If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honored, never disparaged, and treated with nothing less than our highest respect and gratitude,\" Harris wrote on X.On Thursday, the US Army issued a rare statement confirming that a cemetery staff member had been \"abruptly pushed aside\" after asking Trump's team to stop filming in a burial section for those killed in recent wars, where photography for political purposes is banned.Trump's campaign team has gone on the offensive by describing the employee as a \"despicable individual\" and claiming she was suffering a mental health episode. But the military said the staff member had \"acted with professionalism\" and it condemned the incident as \"unfortunate.\"Trump spoke at length at a rally Friday night about the cemetery incident and Afghanistan and said it was families of fallen troops who asked to have their picture taken with him.\"I said 'Absolutely.' I wasn't doing it for -- I don't need publicity, I get a lot of publicity. I would like to get a lot less publicity,\" Trump said in Johnstown, Pennsylvania.Trump blamed the White House for the criticism he is drawing. \"Joe Biden killed those young people because he was incompetent. And then they tell me that I used their graves for public relations purposes. And I didn't. And I'll tell you what, it was a disgrace,\" Trump said.Trump has made criticism of the Biden-Harris administration's handling of the US retreat from Afghanistan a keynote of his campaign, arguing that he would have managed it better.He visited the cemetery with families of some of the 13 service members killed in a 2021 bombing in Kabul during the last, chaotic hours of the US withdrawal.Trump's relationship with the military has long spawned controversy.While often touting his support for the armed forces, he privately mocked the war dead while he was president and did not want to be seen near military amputees, according to his former chief of staff.Harris's blunt response Saturday appeared to underline her determination to take the fight directly to Trump in what is shaping up to be a bruising presidential election. Trump has repeatedly mocked Harris's name, intelligence, appearance and racial identity, while the Harris campaign has replied that the former president is \"weird,\" an aspiring dictator, and \"out of his mind.\" Harris earlier faced withering criticism over the cemetery incident from Trump's running mate, Senator J.D. Vance.Apparently responding to a mistaken report that Harris had already reacted to the visit, Vance accused her of feigning outrage and said, \"She can go to hell.\"\"Don't focus on Donald Trump showing up to grieve with some people who lost their children. Focus on your own job. Don't do this fake outrage thing,\" he later told the Washington Post.At that point Harris had not publicly mentioned the cemetery visit. Kevin Carroll, who served as a senior aide to Trump's homeland security chief John Kelly, voiced scathing criticism of Trump's behavior in an opinion piece published Friday in The Guardian newspaper. \"The photo of a grinning Trump giving a jaunty thumbs-up over these patriots' graves is an indelible image of narcissism risen to the point of sociopathy,\" Carroll wrote.","summary":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump \"disrespected sacred ground\" at a US military cemetery during a contentious pre-election visit.","url":"https://www.ibtimes.com.au/harris-trump-disrespected-sacred-ground-us-military-cemetery-1851089","image":"https://d.ibtimes.com.au/en/full/1858322/democratic-presidential-candidate-kamala-harris-said-her-republican-rival-donald-trump.jpg","video":null,"publish_date":"2024-08-31 22:12:07","author":"Brian Knowlton","authors":["Brian Knowlton"],"language":"en","catgory":"politics","source_country":"au","sentiment":-0.378},{"id":255360812,"title":"Kamala Harris criticises Trump over Arlington Cemetery dispute","text":"The incident happened on Monday, when Trump was at an event honouring 13 US military service members who were killed during the country's withdrawal from Afghanistan three years ago. Saturday’s post marks the first time Ms Harris, the Democratic nominee for president, has commented on the controversy. She wrote that she has visited Arlington National Cemetery in Virginia several times during her tenure as vice president, and she would never use the site for political gain. “If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honored, never disparaged, and treated with nothing less than our highest respect and gratitude,” Ms Harris said. “And it is my belief that someone who cannot meet this simple, sacred duty should never again stand behind the seal of the President of the United States of America.” At a campaign rally in Michigan on Thursday, Trump hit back at those who had criticised him over the incident. He said he had been asked to pose for a photo at the site after the memorial by family members of the soldiers who had died. “I go there, they ask me to have a picture and they say I was campaigning,” Trump said. “The one thing I get plenty of is publicity. I don't need that. I don't need the publicity.” Trump's running mate JD Vance used the controversy to attack the Biden administration over its handling of the 2021 withdrawal from Afghanistan, saying that Ms Harris \"can go to hell\". \"Three years ago, 13 brave, innocent Americans died, and they died because Kamala Harris refused to do her job,\" Mr Vance said on Wednesday in response to questions from BBC's US partner, CBS News. NPR reported earlier that two members of Trump’s campaign staff verbally abused and pushed the cemetery worker aside when she tried to intervene. Federal law prevents use of the cemetery for political campaigning and the US Army said participants were warned of the rules in advance. A US Army spokesperson said on Thursday that “the incident was unfortunate, and it is also unfortunate that the ANC employee and her professionalism has been unfairly attacked.” The Trump campaign has denied that a physical altercation took place at the cemetery, adding “we are prepared to release footage if such defamatory claims are made”. House Democrats have since asked the US Army for a report into the incident, asking for a “full account” of what happened.","summary":"Harris said the cemetery is \"not a place for politics\" in her first remarks on the incident.","url":"https://www.bbc.com/news/articles/c39k379grzlo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/2980/live/93bade40-67df-11ef-8f80-436745fb1a1a.jpg","video":null,"publish_date":"2024-08-31 22:10:55","author":"Nadine Yousif","authors":["Nadine Yousif"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.236},{"id":255358136,"title":"Chris Hayes is upset about Nate Silver’s latest poll, labeling the Electoral College as a ‘National Suicide Pact’","text":"Looks like someone needs to say this for the hundred thousandth-and-second time: The United States is a constitutional republic, not a democracy. The Constitution makes it very plain. While the federal government has some democratic institutions (the House of Representatives – sort of) it also includes some very un-democratic institutions (the Senate, the Supreme Court) because the United States is not a democracy, and the Founders set it up deliberately to prevent government by direct democracy. Leave it to MSNBC’s execrable talking head Chris Hayes to neither know nor care about any of this. On Friday, he was in a bit of a snit over new polling showing Donald Trump pulling ahead of Kamala Harris in the Electoral College–and proved, once again, that he’s willing to throw out the founding principles of the nation if it means his side might not win an election. What a jerk. On his X account Friday, the “All in With Chris Hayes” anchor blasted recent poll results from famed pollster Nate Silver showing that Harris would most likely beat Trump in the national popular vote if the election were held today, though Trump would win the Electoral College.“It’s clear as day the Electoral College is, to quote the great Justice Jackson a national suicide pact,” Hayes posted. Here, see for yourself: Independent of the model itself, it’s clear as day the electoral college is, to quote the great justice Jackson a national suicide pact. Just a wildly dangerous institution that undermines democracy but also creates all manner of rube-goldberg machinery to be attacked by bad… https://t.co/NROBirf3yt— Chris Hayes (@chrislhayes) August 29, 2024 Just a wildly dangerous institution that undermines democracy but also creates all manner of rube-goldberg machinery to be attacked by bad actors. Chris, Chris, Chris. There is no democracy to undermine. The United States is not a democracy. It never was a democracy. It never will be a democracy.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLooks like someone needs to say this for the hundred thousandth-and-second time:&#8230;\n\n\nThis Post: Chris Hayes is upset about Nate Silver&#8217;s latest poll, labeling the Electoral College as a &#8216;National Suicide Pact&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/chris-hayes-is-upset-about-nate-silvers-latest-poll-labeling-the-electoral-college-as-a-national-suicide-pact/","image":"https://media.townhall.com/cdn/hodl/2021/178/69f02472-ef2e-4599-9396-1e1262cf0602.png","video":null,"publish_date":"2024-08-31 22:00:57","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.184},{"id":255358240,"title":"Trump Lashes Out With Sexual Slurs at Kamala Harris as Polls Show Her Winning","text":"In an attempt to disparage Vice President Kamala Harris, former president Donald Trump used derogatory sexual remarks by bringing up her past relationships. Trump made a crude remark about how Hillary Clinton and Harris's careers were shaped as a result of \"blowjobs.\" According to Mediaite, the Republican leader claimed Harris's relationship with longtime California lawmaker Willie Brown gave her a head start in the political world. Trump endorsed these accusations by posting a screenshot of a tweet from X that had Clinton and Harris standing together and with the comment, \"Funny how blowjobs impacted both their careers differently,\" on Truth Social. The remark also alludes to the extramarital affair that former President Bill Clinton had with Monica Lewinsky during his tenure in the White House, as well as Clinton's impeachment that followed the scandal. X users criticized the vile views of the GOP nominee, \"And not a peep about it from the media - shame on them and the Republican Party for putting their own interests (power and wealth) above the good of the country,\" an X user raged. \"How could any woman vote for Donald Trump?\" a netizen questioned. \"Trump does not believe that women can achieve success through hard work and dedication. He looks down on women. He's a misogynist,\" another person chimed. An X user said, \"Trump has no class— he doesn’t have a soul. He has no respect for women. Trump is a disgusting man and I don’t feel bad for his ear.\" A netizen pointed out, \"Yet his campaign spokesperson said this is not what voters care about. I care!\" As per Huff Post, Jessica Mackler, the head of EMILY's List, a nationwide group that assists Democratic women in winning elections based on their support for abortion rights, called out Trump saying, “There is no limit.” “This is the Donald Trump playbook, in particular, when he’s on the defensive and feels he is not driving the conversation. He uses these really gross, really sexist, often racist and sexual-in-nature attacks. It does two things: It panders to his base and gets them riled up, and two, it seeks to create chaos around him and he can move into whatever space that is,” she said. “So the more that we see this movement by the Harris campaign, the more we see this enthusiasm, the more he is pushed to these all-time new lows.” JD Vance, Trump's running mate, justified the misogynistic remarks about Harris. When questioned about how Trump's \"misogynist memes\" about female politicians and blowjobs contribute to national unity during an interview on CNN. Trump is “a political candidate who isn’t stodgy, who likes to have some fun and likes to tell some jokes,” the Ohio Republican senator said. “I’d much rather have a candidate who’s willing to go off-script, who’s willing to give every interview and is willing to tell some jokes. I do think that’s how you lift people up.” He added, “A politics of boring scolds telling people they can’t laugh, that is not lifting Americans up. That is tearing us down.”","summary":"&#34;Trump does not believe that women can achieve success through hardwork and dedication. He looks down on women. He&#39;s a misogynist,&#34; netizens said.","url":"https://www.inquisitr.com/trump-lashes-out-with-sexual-slurs-at-kamala-harris-as-polls-show-her-winning","image":"https://dab57h0r8ahff.cloudfront.net/713488/uploads/100b2760-6791-11ef-8920-0b4fa867e5e7_1200_630.jpeg","video":null,"publish_date":"2024-08-31 22:00:01","author":"INQUISITR,Mary Anthony","authors":["INQUISITR","Mary Anthony"],"language":"en","source_country":"US","sentiment":-0.001},{"id":255359778,"title":"Donald Trump questions transgender acceptance at Moms for Liberty event","text":"Former President Donald Trump questioned the increasing acceptance of transgender Americans during his speech at the annual Moms for Liberty event on Friday.He criticised transgender women participating in women’s sports and advocated for restricting access to gender-affirming healthcare.The Republican presidential candidate also railed against illegal immigration. He accused school boards of acting like “dictatorships” and harming students by implementing policies opposed by parents.“Our country is being poisoned. And your schools and your children are suffering greatly because they’re going into the classrooms and taking disease, and they don’t even speak English,” Trump said.Trump also targeted President Joe Biden and Vice President Kamala Harris, calling the later as a 'defective person.' He also shared personal stories about his family and career, including his rise to fame as the reality television star of \"The Apprentice.\"Moms for Liberty, a group with over 130,000 members known for opposing LGBTQ+ discussions and structural racism in K-12 education, gained prominence for its stance against racial equity programs and transgender accommodations in schools, as well as its support for book bans.The group also backs Project 2025, a comprehensive conservative agenda for the next Republican presidency, although Trump has distanced himself from it.","summary":"Donald Trump spoke at the Moms for Liberty event, questioning transgender acceptance and criticizing transgender women in sports. He advocated for restricting gender-affirming healthcare and criticized illegal immigration and school board policies. Trump also targeted President Joe Biden and Vice President Kamala Harris while sharing personal stories about his family and career, including his TV show \"The Apprentice.\"","url":"https://timesofindia.indiatimes.com/world/us/donald-trump-questions-transgender-acceptance-at-moms-for-liberty-event/articleshow/112957269.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112957275/112957275.jpg","video":null,"publish_date":"2024-08-31 21:59:13","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","catgory":"politics","source_country":"in","sentiment":0.274},{"id":255360046,"title":"The quiet technocrat who steered Biden’s effort to tighten the border","text":"The lead architect of President Joe Biden’s border strategy is not Vice President Kamala Harris, despite persistent Republican claims to the contrary. That role belongs to a bookish, little-known policy adviser named Blas Nuñez-Neto. A data-driven technocrat, Nuñez-Neto has helped engineer Biden’s pivot toward tougher border enforcement and sweeping restrictions on asylum — moves that contributed to a nearly 80 percent drop in illegal crossings since December. The transformation is shoring up one of Democrats’ biggest vulnerabilities ahead of the Nov. 5 presidential election and potentially defusing a top-polling issue for Republican nominee Donald Trump. After three years of record crossings, the U.S.-Mexico border is quieter and more controlled today than at any point since late 2020, before Trump left office. Nuñez-Neto pulled that off by steering the administration back to a border policy framework Democrats used to embrace more easily, according to current and former administration officials. The formula: Be generous and welcoming to immigrants seeking to come lawfully, but stingy and firm with those who don’t. The White House declined to make Nuñez-Neto available for an interview. Biden officials said the administration’s border policy moves have been shaped by senior White House officials and Homeland Security Secretary Alejandro Mayorkas, whom Nuñez-Neto worked for before being promoted to the White House in June. In a statement, White House spokesperson Angelo Fernández Hernández said Biden “believes it is a false choice to say we have to walk away from being an America that embraces immigration in order to secure our border.” “We must enforce our laws at the border and deliver consequences to those who do not have a legal basis to remain in the United States, and we must expand lawful pathways,” Fernández Hernández said. Nuñez-Neto’s policy approach embodies the political calculus that while most Americans remain favorably disposed toward immigrants, few things erode the welcoming spirit faster than an out-of-control border. The growing U.S. economy needs workers, too, and immigrants help offset declining U.S. birth rates. But how they arrive matters. Relying heavily on the president’s executive powers to grant entry using an authority known as parole, the Biden administration has been allowing nearly 75,000 migrants to enter each month through legal channels. Republican critics denounce those pathways as a “shell game,” arguing the administration is facilitating mass migration through doors that should not be opened in the first place. But the expansion — paired with the most severe restrictions on asylum eligibility at the border from a Democratic administration in decades — has corralled the disorder. Trump has largely ignored the change, displaying at his rallies a chart that shows record illegal crossings during Biden’s first three years and cuts out data showing the 2024 decline. He continues to label Harris, his Democratic opponent in the upcoming election, as the “border czar,” though she never held such a role. Biden tasked Harris with leading the administration’s plan to reduce Central American emigration by promoting investment and job creation, not to deal with immigration enforcement at the southern border. That task - arguably one of the least-desirable in a Democratic administration - would become Nuñez-Neto’s. A change in direction The Argentine-born Nuñez-Neto was working on border security issues at the Rand Corporation in early 2021 when DHS policy adviser David Shahoulian — one of the few voices in the administration urging tougher measures at the border — recommended him for a job. He became chief operating officer for U.S. Customs and Border Protection. Trump’s rhetoric and harsh policies in the White House had galvanized immigration advocacy groups and many Democrats against enforcement and the very idea of deterrence as an element of border security. Biden loosened restrictions, fueling a perception that the border was more open even as officials — including Harris — told would-be migrants “do not come.” Shahoulian soon left the administration in frustration. In late 2021, Nuñez-Neto took over his role shaping border policy at DHS. More than a year later, as the administration ended the pandemic-era Title 42 border restrictions, Biden officials increasingly sought help from Mexico, Panama and other nations in the region to help contain migration and cooperate with U.S. policies. Nuñez-Neto took on a second role as DHS’s top international envoy. He became a major diplomatic asset: a bilingual U.S. official capable of explaining policy to Spanish-language media and speaking directly to Latin American officials. Nuñez-Neto developed an especially close partnership with Roberto Velasco, the top official at Mexico’s Foreign Ministry for North American affairs, according to current and former senior officials from both nations. Mexican authorities this year have arrested record numbers of migrants traveling through the country toward the U.S. border, a crackdown that Biden officials credit with sharply curtailing illegal crossings. Angela Kelley, a senior adviser at DHS until June 2022, said the Biden administration has worked to craft a careful balance of incentives and penalties — carrots and sticks. She had been a longtime advocate for asylum seekers, and worked to resist Trump’s policies. Nuñez-Neto was laser-focused on border crossings, checking enforcement data daily. “He’s more of a sticks guy, given his background,” said Kelley, now chief policy adviser at the American Immigration Lawyers Association. Nuñez-Neto was promoted to the White House as the president announced strict new emergency measures that have upended decades of asylum law, closing the border when crossings are high and essentially barring access to U.S. courts for migrants who enter the country illegally. The restrictions were made possible by a breakthrough agreement Nuñez-Neto helped negotiate with Velasco and other senior Mexican officials. It allows the United States to return large numbers of non-Mexican migrants back across the border — a crucial tool for agencies that have struggled to send deportees to Venezuela and other nations whose relations with Washington are strained. As the deterrence policies took shape, the number of migrants released into the United States with a pending asylum claim — the procedure decried as “catch and release” — plummeted. It was Nuñez-Neto, not someone from Harris’s team, who fielded questions about the measures from reporters and on Capitol Hill. “Those of us who follow the inside baseball of immigration know he’s the person that has become the de facto border czar,” said one policy adviser close to the administration who spoke on the condition of anonymity to describe informal conversations with top officials. Nuñez-Neto has done so with a quiet, disciplined manner that is the stylistic opposite of swaggering Trump-era border officials. Some immigration advocates and activists have come to view him with scorn, as a border-cop-in-sheep’s-clothing who speaks of migrants sympathetically while orchestrating the kind of crackdown immigration hard-liners have only dreamed of. The sharp drop in illegal crossings has allowed the Harris campaign to go on offense. She blames Trump for sinking a bipartisan Senate bill last winter that would have provided billions in new funding for more border agents, detention capacity, deportation flights and other enforcement tools. She has called for Congress to pass the bill, and says she would sign it into law if she’s elected. But several of its toughest provisions — in particular the emergency asylum restrictions — are already in place. A young immigrant in Washington Nuñez-Neto was 11 and living in an apartment in the nation’s capital when he met Supreme Court Justice Sandra Day O’Connor, after winning an essay contest that asked sixth-graders how to make Washington a “special city for special people.” “Nobody is perfect,” wrote Nuñez-Neto, who had arrived in the country 2½ years earlier, according to a Washington Post article about the event in 1986. “But everyone is special. I could be more special by encouraging people and never saying bad words.” After graduate school Nuñez-Neto worked at the Congressional Research Service and then as an aide to Sen. Tom Carper (D-Del.), specializing in border security. He was hired as an adviser to the CBP commissioner in 2015, when record numbers of Central American families and unaccompanied minors had started streaming across the border in Texas, catching the Obama administration off-guard. The U.S. enforcement system had been primarily designed to contain mass migration by adult laborers, not families and children requesting humanitarian protection. But their right to do so is broadly protected under U.S. asylum law. Gil Kerlikowske, the CBP commissioner during Obama’s second term, said Nuñez-Neto became a trusted aide as the administration grappled with the problem. “We traveled all over the world together,” Kerlikowske said in an interview. “He was brilliant. His experience and knowledge are astronomical.” At one point during a trip to Poland, where U.S. officials were speaking with European border police about soaring numbers of asylum seekers, Nuñez-Neto urged Kerlikowske’s team to visit Treblinka, the site of a Nazi death camp. Kerlikowske said it was a sign to him of how seriously Nuñez-Neto took U.S. responsibilities to ensure migrants seeking U.S. refuge aren’t deported to face persecution or death. Rewriting the rules At DHS and then the White House, Nuñez-Neto has spent much of his time trying to subdue the forces that were set in motion during Biden’s first months in office. The low point came in fall 2021, when thousands of mostly Haitian migrants crossed the border near Del Rio, Tex., and set up a squalid camp on the banks of the Rio Grande. Just weeks after Biden’s chaotic troop withdrawal from Afghanistan, the administration was suddenly facing a humanitarian crisis on U.S. soil. Many of the migrants had been living for years in Brazil and Chile before seizing the opportunity to make the dangerous journey north. “It was a huge wake-up call for all the countries along the route,” said former Biden immigration adviser Katie Tobin, who left the White House in February. “That was when we started negotiating a hemisphere-wide approach.” Tobin led the development of the Los Angeles Declaration on Migration and Protection, signed in 2022 by the United States and 21 other countries. It became the framework for a more collaborative model that treats migration as something to manage rather than simply repress. When Ukrainians started surging over the border after Russia’s invasion, Nuñez-Neto, Tobin and other Biden officials negotiated a deal with Mexico that allowed them to apply to enter the United States legally. When Venezuelan migration jumped, they developed a similar accord. Mexico made clear it would cooperate on tighter enforcement but wanted the United States to expand legal channels. The United States now offers nearly 1,500 appointments a day along the southern border to asylum seekers who register with the CBP One mobile app. Up to 30,000 citizens of Cuba, Haiti, Nicaragua and Venezuela can apply each month to enter the United States legally with a financial sponsor. Nuñez-Neto and other Biden officials are restrained when describing the decline in illegal crossings. They have seen the numbers can spike quickly in response to changes in U.S. enforcement. And they recognize the strategy they’ve crafted rests on a wobbly foundation of fragile international accords and disputed executive actions that are facing challenges in federal court. “We are making progress,” said Fernández Hernández. “But long-term, the only lasting solution is for Congressional Republicans to stop playing politics and pass the bipartisan border deal.”","summary":"A data-driven technocrat, this little-known adviser has helped engineer Biden’s pivot toward tougher border enforcement and sweeping restrictions on asylum — moves that contributed to a nearly 80 percent drop in illegal crossings since December.","url":"https://www.stripes.com/theaters/us/2024-08-31/biden-border-policy-advisor-migrant-crossings-decline-15035227.html","image":"https://www.stripes.com/incoming/k5gj4p-31082024bidenborderpolicyadvisormigrantcrossingsdeclinephotos01.jpg/alternates/LANDSCAPE_480/31082024bidenborderpolicyadvisormigrantcrossingsdeclinephotos01.jpg","video":null,"publish_date":"2024-08-31 21:47:33","author":"Nick Miroff","authors":["Nick Miroff"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.026},{"id":255357038,"title":"Kamala Harris blasts Donald Trump’s  ‘political stunt’ at Arlington National Cemetery: ‘Disrespected sacred ground’","text":"Vice President Kamala Harris slammed former President Donald Trump’s controversial photo-op at Arlington National Cemetery with Gold Star families on Monday, claiming he “disrespected sacred ground.” Even though he was invited by Gold Star families, Democratic presidential nominee accused Trump of staging a “political stunt” after his campaign staff got into an altercation with a cemetery employee who tried to stop them from filming and photographing a wreath-laying ceremony in Section 60 — the burial site for military personnel killed while fighting in Afghanistan and Iraq. “It is not a place for politics,” Harris said in lengthy a statement posted on social media Saturday afternoon. “Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,” she continued. “This is nothing new from Donald Trump. This is a man who has called our fallen service members “suckers” and ‘losers’ and disparaged Medal of Honor recipients,” Harris claimed. Trump has long denied making the “suckers” and “losers” comments cited in a 2020 story in The Atlantic. The US Army claimed Trump campaign staff members “ abruptly pushed aside” a cemetery official who tried to prevent staffers from capturing the former president participating in the ceremony on camera, according to federal law. There is no law against snapping photographs in the national ceremony, but a cemetery spokesperson told The Post that “federal law prohibits political campaign or election-related activities within Army National Military Cemeteries, to include photographers, content creators or any other persons attending for purposes, or in direct support of a partisan political candidate’s campaign.” Section 60 holds the gravesites of the latest casualties to the Afghanistan and Iraq wars, including three of the 13 US troops who were killed by an ISIS-K suicide bomber at the Kabul International Airport in August 2021. “Participants in the August 26th ceremony and the subsequent Section 60 visit were made aware of federal laws, Army regulations and DoD policies, which clearly prohibit political activities on cemetery grounds,” an Army spokesperson said in a statement Thursday. The Gold Star families of the 13 fallen soldiers killed during the withdrawal released a statement on Wednesday denying that they had trampled on Section 60 regulations and thanked Trump for “honoring our children and their fallen brothers and sisters.” “On the three-year anniversary of the Abbey Gate Bombing, the president and his team conducted themselves with nothing but the utmost respect and dignity for all of our service members, especially our beloved children,” they said. Darin Hoover, the father of Marine Staff Sgt. Taylor Hoover, one of the three fallen service members buried at the military cemetery, told The Post that it was not a campaign event and that they had personally invited Trump to attend. The Trump campaign claimed the cemetery employee who interfered was “suffering from a mental health episode” and that there was “no physical altercation as described.”","summary":"“It is not a place for politics,” Harris said in lengthy a statement posted on social media Saturday afternoon.","url":"https://nypost.com/2024/08/31/us-news/kamala-harris-blasts-donald-trump-over-arlington-national-cemetery-photo-op-political-stunt/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/88675119.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/pI0KLc55-RyIcpnTz.mp4","publish_date":"2024-08-31 21:43:51","author":"Patrick Reilly","authors":["Patrick Reilly"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.001},{"id":255356990,"title":"Harris steers clear of race, gender despite historic bid","text":"Kamala Harris is aiming to make history as America’s first Black and South Asian woman president — but she has not leaned into the prospect. Instead, Harris has steered well clear of mentioning race and gender during speeches, rallies and the first press conference of her lightning campaign. The 59-year-old Democrat has also refused to engage with Republican rival Donald Trump and his allies when they have tried to bait her by questioning her racial identity and making sexist attacks. Rather, Harris seems to be focusing on the broader excitement over her replacing President Joe Biden as candidate, and on issues like the cost of living that she believes voters care more about. Her reluctance to rely on her trailblazing status as a selling point was on full display when she and her running mate Tim Walz gave their first interview to CNN on Thursday. Harris was asked about a photo circulating of her grand-niece watching her Democratic National Convention speech in Chicago, which went viral as a symbol of the breaking of racial and gender barriers in America. But Harris was not biting. “I am running because I believe that I am the best person to do this job at this moment for all Americans, regardless of race and gender,” Harris told CNN. Harris was equally dismissive when asked about Trump’s inflammatory accusation that she leaned into her Black identity for political gain. “Same old, tired playbook. Next question, please,” she said with a laugh. ‘Precious time’: One reason for her approach is that Trump’s attacks are so far merely drawing attention to her history-making status, rather than damaging her, said Jesse J. Holland, an assistant professor of media and public affairs at George Washington University. “Why spend your precious time talking about things when your opponent’s doing it for you — and perhaps not successfully?” Holland told AFP. Harris is also helped by the fact that she is already a known quantity as the first ever Black, female and South Asian vice president, even if voters are still getting used to her as a presidential candidate. She has not shied away from talking about her background as the daughter of a Jamaican-born father and an Indian-born mother. She began her convention speech with a heartfelt tribute to her mother, a “brilliant, five-foot tall brown woman who taught her children to ‘never complain about injustice, but do something about it.'” But going further and explicitly ramming home a message on race and gender is not necessarily a vote winner across the board.","summary":"Kamala Harris is aiming to make history as America&#8217;s first Black and South Asian woman president &#8212; but she has not leaned into the prospect. Instead, Harris has steered well clear of mentioning race and gender during speeches, rallies and the first press conference of her lightning campaign. The 59-year-old Democrat has also refused to [&#8230;]","url":"https://dailytimes.com.pk/1222522/harris-steers-clear-of-race-gender-despite-historic-bid/","image":"https://dailytimes.com.pk/assets/uploads/2024/09/1-1.jpg","video":null,"publish_date":"2024-08-31 21:41:51","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","source_country":"pk","sentiment":-0.147},{"id":255356992,"title":"Bacon, eggs and dead whales: this week on US campaign trail","text":"Donald Trump defending bacon eaters from wind turbines, Kamala Harris wowing with her egg-cracking skills, and another baffling story about RFK Jr apparently cutting off a dead whale’s head. Here are some offbeat highlights from the US campaign trail this week. Breezy bacon: Ever wondered why people eat less bacon these days? Donald Trump has the culprit for you — his old nemesis, wind turbines. The Republican sent heads spinning when he linked the green energy source to lower bacon consumption after being asked about his plans to lower inflation. “You know this was caused by their horrible energy. Wind -– they want wind all over the place,” he said at an event in Wisconsin on Thursday. Cracking on: American voters are learning more about Kamala Harris everyday — and this week they got a reminder of her cooking skills with the resurfacing of an old viral video where she cracks eggs with one hand. Harris coolly dispatched the maneuver while baking “monster cookies” during her “Cooking With Kamala” YouTube series. She wasn’t shy about her skills either, with a confident nod and a snappy “Yeah, come on now” when her fellow chef commented that she was a “pro.” Whale, whale, whale…: Another week, another bizarre tale about Robert F. Kennedy Jr., who reportedly sawed the head off a dead whale before driving it for five hours home on the roof of his vehicle. His independent presidential campaign — which he has suspended after endorsing Donald Trump — has also seen tales of him dumping a dead bear cub in New York’s Central Park.","summary":"Donald Trump defending bacon eaters from wind turbines, Kamala Harris wowing with her egg-cracking skills, and another baffling story about RFK Jr apparently cutting off a dead whale&#8217;s head. Here are some offbeat highlights from the US campaign trail this week. Breezy bacon: Ever wondered why people eat less bacon these days? Donald Trump has [&#8230;]","url":"https://dailytimes.com.pk/1222521/bacon-eggs-and-dead-whales-this-week-on-us-campaign-trail/","image":null,"video":null,"publish_date":"2024-08-31 21:40:17","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","source_country":"pk","sentiment":0.079},{"id":255356496,"title":"Trump \"Disrespected Sacred Ground' At US Military Cemetery: Kamala Harris","text":"TCF vendors Exponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Roq.ad GmbHCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Index Exchange Inc. Cookie duration: 395 (days).Data collected and processed: Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch QuantcastCookie duration: 396 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch BeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Sovrn, Inc.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch AdikteevDoesn't use cookies.Data collected and processed: Probabilistic identifiers, Authentication-derived identifiers, IP addresses, Users’ profiles, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch RTB House S.A.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch The UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Nexxen Inc.Cookie duration: 180 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EpsilonCookie duration: 184 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Yahoo EMEA LimitedCookie duration: 397 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch ADventori SASCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Triple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Xandr, Inc.Cookie duration: 90 (days).Data collected and processed: Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch NEORY GmbHCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Nexxen Group LLCCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch NEURAL.ONECookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch ADITION (Virtual Minds GmbH)Cookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Active Agent (Virtual Minds GmbH)Cookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Taboola Europe LimitedCookie duration: 366 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EquativCookie duration: 396 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Adform A/SCookie duration: 3650 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Magnite, Inc. Cookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch RATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch Sift Media, IncDoesn't use cookies.Data collected and processed: Precise location data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Rakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Lumen Research LimitedDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch Amazon Ad ServerCookie duration: 396 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch OpenXCookie duration: 365 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Yieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Roku Advertising ServicesCookie duration: 396 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Nano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Browsing and interaction data, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch Simplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: Precise location data, IP addresses, Device identifiersmoreUses other forms of storage.View details | Privacy policylaunch PubMatic, IncCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Comscore B.V.Cookie duration: 720 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch FlashtalkingCookie duration: 730 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch PulsePoint, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Smaato, Inc.Cookie duration: 21 (days).Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Semasio GmbHCookie duration: 366 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Crimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Genius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Criteo SACookie duration: 390 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Adloox SADoesn't use cookies.Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Blis Global LimitedCookie duration: 400 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Lotame Solutions, IncCookie duration: 274 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch LiveRampCookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch GroupM UK LimitedCookie duration: 395 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch LoopMe LimitedCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Dynata LLCCookie duration: 365 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Ask LocalaDoesn't use cookies.Data collected and processed: Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch AziraDoesn't use cookies.Data collected and processed: Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch DoubleVerify Inc.​Doesn't use cookies.Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch BIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch IPONWEB GmbHCookie duration: 365 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch NextRoll, Inc.Cookie duration: 183 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Teads France SASCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Ströer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch OS Data Solutions GmbH & Co. KGCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Permodo GmbHDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Platform161 B.V.Cookie duration: 396 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Basis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch SMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Bombora Inc.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch EASYmedia GmbHCookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Remerge GmbHDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch advanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Magnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Delta Projects ABCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch usemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch emetriq GmbHCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Publicis Media GmbHCookie duration: 1825 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch M.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch OneTag LimitedCookie duration: 396 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Cloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Smartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policylaunch Improve DigitalCookie duration: 90 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Adobe Advertising CloudCookie duration: 365 (days).Data collected and processed: Authentication-derived identifiers, IP addresses, Privacy choices, Device identifiersmoreView details | Storage details | Privacy policylaunch Bannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch TabMo SASDoesn't use cookies.Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Integral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreView details | Privacy policylaunch WizalyCookie duration: 365 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch WeboramaCookie duration: 393 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch Jivox CorporationCookie duration: 30 (days).Data collected and processed: Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Vistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policylaunch On Device Research LimitedCookie duration: 30 (days).Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch Rockabox Media LtdDoesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device characteristicsmoreView details | Storage details | Privacy policylaunch Exactag GmbHCookie duration: 180 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Privacy policylaunch Celtra Inc.Doesn't use cookies.Data collected and processed: Precise location data, IP addresses, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch mainADV SrlCookie duration: 30 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Gemius SACookie duration: 1825 (days).Data collected and processed: Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch The Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Nielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Solocal SACookie duration: 396 (days).Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Pixalate, Inc.Doesn't use cookies.Data collected and processed: Browsing and interaction data, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch Oracle AdvertisingCookie duration: 180 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch NumberlyCookie duration: 180 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch AudienceProject A/SCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Demandbase, Inc.Cookie duration: 730 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Effiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Arrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Seenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policylaunch Commanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policylaunch travel audience GmbHCookie duration: 397 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch HUMANDoesn't use cookies.Data collected and processed: Probabilistic identifiers, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Adludio Ltd.Doesn't use cookies.Data collected and processed: Precise location data, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Blendee srlCookie duration: 366 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Innovid LLCCookie duration: 90 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Papirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policylaunch Neustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Verve Group Europe GmbHDoesn't use cookies.Data collected and processed: User-provided data, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Otto (GmbH & Co KG)Cookie duration: 365 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Adobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Localsensor B.V.Doesn't use cookies.Data collected and processed: Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Online SolutionCookie duration: 365 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Relay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: User-provided data, Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Device identifiers, Device characteristicsmoreView details | Storage details | Privacy policylaunch GP One GmbHCookie duration: Uses session cookies.Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Privacy choices, Non-precise location data, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch The MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch MindTake Research GmbHCookie duration: 180 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Cint ABCookie duration: 730 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Google Advertising ProductsCookie duration: 396 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch GfK GmbHCookie duration: 730 (days).Data collected and processed: User-provided data, Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Storage details | Privacy policylaunch RevJetCookie duration: 730 (days).Data collected and processed: IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Protected Media LTDDoesn't use cookies.Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Device identifiers, Device characteristicsmoreView details | Privacy policylaunch Clinch Labs LTDCookie duration: 730 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Oracle Data Cloud - MoatDoesn't use cookies.Data collected and processed: IP addresses, Non-precise location datamoreView details | Privacy policylaunch Hearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policylaunch Amazon AdvertisingCookie duration: 396 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Users’ profiles, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policylaunch Moloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policylaunch Adtriba GmbHCookie duration: 730 (days).Data collected and processed: Browsing and interaction data, Authentication-derived identifiers, IP addresses, Privacy choices, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Objective Partners BVCookie duration: 90 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch EnsightenCookie duration: 1825 (days).Data collected and processed: Browsing and interaction data, IP addresses, Privacy choices, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch eBay IncCookie duration: 90 (days).Data collected and processed: IP addresses, Privacy choices, Device characteristicsmoreView details | Storage details | Privacy policylaunch MetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: User-provided data, Browsing and interaction data, IP addresses, Device identifiers, Device characteristicsmoreUses other forms of storage.View details | Privacy policylaunch Hurra Communications GmbHCookie duration: 366 (days).Data collected and processed: Probabilistic identifiers, Browsing and interaction data, Precise location data, Authentication-derived identifiers, IP addresses, Non-precise location data, Device identifiers, Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policylaunch Ad partners AkamaiPrivacy policylaunch MetaPrivacy policylaunch AunicaPrivacy policylaunch Booking.comPrivacy policylaunch C3 MetricsPrivacy policylaunch IBMPrivacy policylaunch EvidonPrivacy policylaunch AdacadoPrivacy policylaunch intelliAdPrivacy policylaunch DstilleryPrivacy policylaunch MediaMathPrivacy policylaunch ZMSPrivacy policylaunch Omnicom Media GroupPrivacy policylaunch ResonatePrivacy policylaunch SojernPrivacy policylaunch Tradedoubler ABPrivacy policylaunch TrustArcPrivacy policylaunch TruEffectPrivacy policylaunch Travel Data CollectivePrivacy policylaunch advolution.controlPrivacy policylaunch LifeStreetPrivacy policylaunch AdMaximPrivacy policylaunch Batch MediaPrivacy policylaunch Vodafone GmbHPrivacy policylaunch MagnitePrivacy policylaunch ScenestealerPrivacy policylaunch NetquestPrivacy policylaunch Manage.comPrivacy policylaunch CloudflarePrivacy policylaunch Salesforce DMPPrivacy policylaunch NetflixPrivacy policylaunch ebuildersPrivacy policylaunch AppLovin Corp.Privacy policylaunch Fractional MediaPrivacy policylaunch RackspacePrivacy policylaunch LiftoffPrivacy policylaunch MSI-ACIPrivacy policylaunch AdmetricsPrivacy policylaunch NaveggPrivacy policylaunch AdmedoPrivacy policylaunch KochavaPrivacy policylaunch MobitransPrivacy policylaunch ADEXPrivacy policylaunch ImpactPrivacy policylaunch SpotadPrivacy policylaunch AarkiPrivacy policylaunch SFRPrivacy policylaunch CablatoPrivacy policylaunch WaystackPrivacy policylaunch TreSensaPrivacy policylaunch gskinnerPrivacy policylaunch CUBEDPrivacy policylaunch OptomatonPrivacy policylaunch AnalightsPrivacy policylaunch Dentsu Aegis NetworkPrivacy policylaunch DigisegPrivacy policylaunch Haensel AMSPrivacy policylaunch BDSK Handels GmbH & Co. KGPrivacy policylaunch Marketing Science Consulting Group, Inc.Privacy policylaunch DENTSUPrivacy policylaunch KoblerPrivacy policylaunch WidespacePrivacy policylaunch VimeoPrivacy policylaunch","summary":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump &quot;disrespected sacred ground&quot; at a US military cemetery during a contentious pre-election visit.","url":"https://nation.lk/online/trump-disrespected-sacred-ground-at-us-military-cemetery-kamala-harris-275474.html","image":"https://c.ndtvimg.com/2024-07/ugf3uu1g_trump-harris-_625x300_22_July_24.jpeg","video":null,"publish_date":"2024-08-31 21:30:17","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":0.223},{"id":255356484,"title":"Vietnam’s ‘bamboo diplomacy’ is paying off, at least for now","text":"In what was outgoing Vietnamese President To Lam’s first international trip since his appointment as the Communist Party of Vietnam’s general secretary, Beijing and Hanoi signed 14 deals, from cross-border railways to crocodile exports. Lam characterised bilateral ties with China as a “top priority” and described his trip as “the affirmation of the Party and the Vietnamese government to value the relation[ship] with China”. The joint statement said the two ruling parties were carrying out a historic mission while striving for people’s well-being, national development and peace, reaffirming their commitment to deepen their comprehensive strategic partnership and building a China-Vietnam community with a shared future. During Chinese President Xi Jinping’s visit to Hanoi in December, the two sides signed a series of cooperation documents in areas including infrastructure, trade and security, as well as reaching a historic milestone when they announced a China-Vietnam strategic community with a “shared future”, a recurring reference that potentially suggests Hanoi has aligned itself with Beijing’s vision. In December, Vietnam expressed its support for China’s Global Development Initiative, Global Security Initiative and Global Civilisation Initiative, saying these programmes were aimed at protecting common interests of all mankind, promoting peace and creating a better world. Hanoi has now agreed to step up cooperation within these frameworks, which could be seen as a diplomatic win for China. Lam’s pursuit of closer ties with China echoes that of his late predecessor, Nguyen Phu Trong, who in February exchanged Lunar New Year greetings with Xi and wished for healthy development in the bilateral relationship to benefit the people and contribute to peace and stability. Earlier this month, Lam vowed not to make any changes to Vietnam’s foreign policy, and focus on advancing the country’s socioeconomic development goals. His trip to China shows he hasn’t strayed from that pledge. Soon after Lam’s election as party general secretary, US President Joe Biden sent a congratulatory message, expressing his and Vice-President Kamala Harris’ desire to work with him on advancing bilateral relations. But Washington’s message came as the Biden administration rejected Vietnam’s request to classify it as a market economy, despite upgrading bilateral ties to a comprehensive strategic partnership last September and hailing Hanoi’s “progress in [making] significant market-based economic reforms”. The rejection dealt a blow to Vietnam’s “bamboo diplomacy”, which seeks to balance ties between the US and China. The US decision could have prodded Vietnam into strengthening economic ties with China. However, the move is unlikely to inflict any significant damage to US-Vietnam relations, given that it enjoys a large trade surplus with the United States, at almost US$105 billion in 2023 and around US$56 billion for the first half of this year. China is Vietnam’s second-largest export market with bilateral trade amounting to about US$172 billion. However, its trade deficit with China rose by more than 56 per cent to over US$32 billion in the first five months of 2024, signalling the importance of the US as Vietnam’s largest export destination. Meanwhile, China is increasing its investments in Vietnam. Last year, it invested about US$4.5 billion in the Southeast Asian country, according to Vietnam’s Foreign Investment Agency, up 77.6 per cent from 2022. In the first seven months of 2024, Chinese investments in Vietnam surged more than sevenfold. Prior to the China-US trade war, many labour-intensive, low-valued-added industries had moved from China’s coastal areas to Vietnam. The trade war has provided Vietnam with an opportunity to take advantage of its geographic location and lure Chinese companies to relocate their production facilities and invest in advanced industries such as electronics and automotive components to help advance its economy and become a technological power. And not only does Vietnam seek to learn from China’s high-speed rail networks and link up with large Chinese development strategies, it also believes China has a key role to play in regional and global development. This was arguably reflected in Vietnamese Prime Minister Pham Minh Chinh’s remarks during June’s World Economic Forum conference in Dalian, Liaoning province. Underlining China’s “important role” in the world’s development, he vowed to work with Beijing to build a “community with a shared future.” He also recalled a quote from Vietnamese revolutionary Ho Chi Minh to “congratulate China, thank China and learn from China”. Vietnam’s proximity to China, territorial disputes in the South China Sea, large deposits of rare earth minerals estimated at about US$3 trillion and its potential as an option for the US “friendshoring” strategy have sharply raised American interest in the region. Yet, by signing new deals with China, agreeing to deepen cooperation in defence and security, boost economic, trade and investment cooperation, and attempting to resolve territorial disputes, Vietnam is charting its own policy in a bid to make ensure it doesn’t miss the boat to become the world’s factory. US Undersecretary of State Uzra Zeya’s trip to Vietnam last week to “highlight the strength and dynamism of the US‐Vietnam relationship” seems to underscore an urgency within the Biden administration to ensure Hanoi does not get too close to Beijing. Vietnam’s “bamboo diplomacy” appears to be working, for now. However, that might all change should Donald Trump, who opened an investigation into Vietnam’s trade practices as president, return to the White House and test this diplomacy with his harsh rhetoric and punitive tariffs. Azhar Azam is geopolitical analyst with a keen interest in economy, climate change and regional conflicts","summary":"By deepening ties with China while not alienating the US, Vietnam is using its strengths to develop its economy and boost its regional status.","url":"https://www.scmp.com/opinion/asia-opinion/article/3276537/vietnams-bamboo-diplomacy-paying-least-now","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/30/66e2971d-dccd-419f-90b6-df8abebac831_d5f7257e.jpg","video":null,"publish_date":"2024-08-31 21:30:09","author":"Azhar Azam","authors":["Azhar Azam"],"language":"en","source_country":"cn","sentiment":0.063},{"id":255359108,"title":"The Women Trump Is Winning","text":"Updated at 5:55 p.m. ET on August 31, 2024 Donald Trump’s appearance last night at Moms for Liberty’s annual gathering was intended as a classic campaign stop—a chance for the candidate to preen in front of a friendly audience. And this audience certainly was friendly. At this week’s “Joyful Warriors” summit in Washington, D.C., members of the three-year-old conservative organization attended a seminar on the history of Marxism and a session on abolishing the Department of Education—led by a contributor to the Heritage Foundation’s Project 2025. They packed their tote bags full of pamphlets about “wokecraft” and the “toxic culture” in public schools. They wore bejeweled TRUMP hats and glittering American-flag pins. They stood in awe of a painting depicting Kamala Harris devouring the bloody corpse of a bald eagle. But right now, both Trump and Moms for Liberty are struggling to be relevant and relatable to American women. “The more popular you get, the devil will work harder on you,” Jessica Caiazzo, a member from Oahu, Hawaii, told me yesterday with a shrug, when I asked about the group’s combative reputation. Beelzebub has certainly been punching the clock. A Google search for Moms for Liberty in the past year would have yielded stories about not just significant election losses of candidates endorsed by the group, but a rape allegation, a ménage-à-trois scandal, and an ill-considered Adolf Hitler quote. Thanks to these developments, Moms for Liberty has lost momentum—something it has in common with Trump’s campaign in recent weeks. With Biden’s exit from the presidential race, the mantle of older, less coherent candidate has fallen on Trump. He has also spent the past few days fending off criticism that he is insufficiently pro-life, while simultaneously combating the perception that he and his running mate, J. D. Vance, are a threat to women’s rights. Moms for Liberty’s national summit, which was held just a few blocks from the White House, was slightly smaller this year, with some 600 attendees, compared with the roughly 700 who attended the group’s 2023 gathering in Philadelphia. That year had an impressive lineup of speakers, including not only Trump but also Vivek Ramaswamy, Nikki Haley, and Ron DeSantis. The event also attracted major protests from progressive activists and some elected Democrats. This year was much quieter. Trump aside, the headliners were B-list: the former Democratic representative turned MAGA missionary Tulsi Gabbard of Hawaii, The Blaze’s Glenn Beck, and the actor Rob Schneider, of Deuce Bigalow fame. A hyped “March for Kids” evolved into a lackluster indoor assembly this morning. No protesters bothered to show up this week. But at least the Moms had Trump—though they seemed to want to keep him reined in, rather than give over their platform to one of his two-hour stream-of-consciousness monologues. His appearance last night was structured as a conversation with Tiffany Justice, one of the group’s co-founders—and she was not afraid to cut him off. Trump “reined in” is relative, and the conversation still meandered. Topics included: his daughter Ivanka (she could’ve been “a great ambassador to the United Nations … nobody could compete with her rat-tat-tat!”), his hit TV show The Apprentice (“It’s sort of Survivor with the asphalt-jungle aspect”), how he as president would treat transgender children (“Think of it: Your kid goes to school, and comes home a few days later with an operation”), and his recent visit to Arlington National Cemetery to highlight service members killed during the 2021 withdrawal from Afghanistan (“These people were killed by Biden as far as I’m concerned”). At one point, Justice asked Trump to give members advice on running for office. “I always say, ‘Don’t do it!’” he replied. The crowd laughed, but Justice looked panicked: “No, run for office! We want you to run for office!” The group, after all, now needs all the energy and participation it can get. When Moms for Liberty was founded in Florida by Justice, Tina Descovich, and Bridget Ziegler in 2021, in direct response to pandemic school closures, it came in hot. Across the country, group members disrupted school-board meetings and helped vote out moderate and liberal officials. In 2022, roughly 47 percent of candidates endorsed by Moms for Liberty won their election, according to a Brookings Institution analysis. But by the following year, that number had shrunk to 33 percent (though Moms for Liberty disputes these figures). The same year, group members were photographed posing with Proud Boys, and one chapter leader quoted Hitler in a newsletter. Late last year, news broke that Ziegler’s husband, the chair of the Florida Republican Party, had been accused of rape by a woman with whom the couple had allegedly had a three-way sexual encounter. Last week’s GOP primary elections in Florida were not a great sign for the group’s 2024 progress: Six of its endorsed candidates lost, three won, and five went into runoff elections. In two counties where Republican voters outnumber Democrats two to one, four Moms for Liberty candidates were sent packing. These setbacks were a sharp reversal of the group’s earlier success. “If you have a low profile, you can get a relatively small number of people to vote for your candidates, and you can actually flip school-board seats,” given the low turnout in such elections, Jon Valant, the director of the Brown Center on Education Policy at Brookings, told me. “What happened to [Moms for Liberty] is that, as people got to know them a bit better and the scandals started occurring, the brand grew more toxic.” The group’s initial complaints about coronavirus closures caught the public mood at the time, but the Moms’ focus soon evolved into efforts to remove from schools books seen as progressive or subversive and to restrict lessons on sexuality and the legacy of slavery in America—issues, Valant said, that are far less popular. For candidates to have the Moms for Liberty brand attached now is “probably doing them just as much harm as good.” The upcoming presidential election is poised to have the largest gender gap in history, and given his deficit with women voters, Trump is probably glad to appear in front of any enthusiastic female audience. But last night, he didn’t mention any of his latest attempts to get women to support the Republican ticket. He did not, for example, reassert his rather frantic promise that he “will be great for women and their reproductive rights,” nor did he attempt to clarify his position on a Florida abortion amendment after his apparent flip and subsequent intense pressure from pro-life leaders. Trump also neglected to repeat his offhanded pledge earlier this week to make IVF treatment free for all Americans, a response to accusations that he and Vance oppose the practice. Of course, the Moms for Liberty didn’t need to hear any of that. These members love Trump no matter what. To them, he is Goldilocks on abortion—not too prohibitive, not too permissive, but somewhere just right. “He literally just said no to federal [restrictions], and if you are a true Republican or even a libertarian, the government should not rule you and tell you what to do,” Caiazzo, the member from Hawaii, told me. Trump is “saying his truth,” another attendee, Jennifer White of Round Rock, Texas, told me. Like Trump, she said, “I am pro-life, but I do understand and I do have compassion about rape and incest and a mother’s life.” Plus, White added, maybe Vance has a point about childless women. Kamala Harris “has never birthed a baby,” she said. “I have a hard time with people who may not have children who want to parent my children.” Onstage, Trump would have kept talking about his troubled interaction at Arlington cemetery, but right around 10 p.m., Justice wisely interrupted him. “Sir, thank you for loving the American people, and thank you for working to make America great again,” she said, beaming at him. Moms for Liberty has said it plans to spend more than $3 million in key battleground states ahead of the presidential election. And although the organization typically endorses only school-board candidates, Justice told Trump last night, “I wanna tell you personally, sir, that I endorse you for president of the United States.” The room erupted in cheers, Trump looked pleased, and the two began to dance to a Trump favorite, the Village People’s “Y.M.C.A.” The women in the audience were happy to see them side by side. But these aren’t the women Trump needs to win over.","summary":"Way behind in polls of female voters, the GOP nominee found an audience that liked him with Moms for Liberty.","url":"https://www.theatlantic.com/politics/archive/2024/08/donald-trump-moms-for-liberty/679683/","image":"https://cdn.theatlantic.com/thumbor/8xpJ2bJVbkGSzMYavRfKGoiT8zo=/0x53:2496x1353/1200x625/media/img/mt/2024/08/AP24244078608264/original.jpg","video":null,"publish_date":"2024-08-31 21:23:00","author":"Elaine Godfrey","authors":["Elaine Godfrey"],"language":"en","catgory":"politics","source_country":"US","sentiment":0},{"id":255356104,"title":"ESSENCE Festival 2024: A 30-Year Celebration Of Black Excellence","text":"Share to Facebook Share to Twitter Share to Linkedin NEW ORLEANS, LOUISIANA - JULY 06: (L-R) Caroline A. Wanga, CEO, Essence Ventures and Vice President ... [+] Kamala Harris speak onstage during the 2024 ESSENCE Festival Of Culture™ Presented By Coca-Cola® at Ernest N. Morial Convention Center on July 06, 2024 in New Orleans, Louisiana. (Photo by Arturo Holmes/Getty Images for ESSENCE) Getty Images for ESSENCE With just a few months left in 2024, it’s safe to say that the year has been memorable for several reasons. One event of paramount importance was the annual ESSENCE Festival of Culture, which celebrated its 30th anniversary earlier this summer. Held annually in New Orleans, the star-studded event featured several activations and programming geared towards reinforcing Essence Magazine’s commitment to championing Black culture, particularly Black women. From a fierce lineup of musical acts including Janet Jackson, Usher, Victoria Monét and others to panel discussions featuring prominent individuals like Vice President Kamala Harris, the cast of Hulu’s Reasonable Doubt, and more, the festival showcased an abundance of Black joy and excellence. According to Hakeem Holmes, the Vice President of the ESSENCE Festival of Culture, the intentionality in curating the highly-anticipated weekend-long event was purposeful and a source of pride for the New Orleans native. “I'm honestly overwhelmed with both joy and then obviously dashes of stress. Being from New Orleans, there are a lot of pressures, but I think the pressures are challenges that I took when I approached this role of wanting to make sure that this community, my community, was seen and a part of this event. I'm really proud of that, and I'm proud that the team I work with in that we've been able to do that for this 30th anniversary and birthday celebration. In the last few years, this event has blossomed into something that is for everyone. We really emphasize that because we know that Black people are not a monolith. When we look at this experience, this experience has now grown into serving all of those subgroups within our culture. I'm really proud of the work that the team has been doing to ensure that every group feels seen and feels like they can live unapologetically and celebrate that joy.” NEW ORLEANS, LOUISIANA - JULY 06: Dara Renee attends the 2024 ESSENCE Festival Of Culture™ Presented ... [+] By Coca-Cola® at Ernest N. Morial Convention Center on July 06, 2024 in New Orleans, Louisiana. (Photo by Cindy Ord/Getty Images for ESSENCE) Getty Images for ESSENCE The joy that Holmes speaks of wasn’t solely experienced by the multitude of attendees who traveled from all across the world but from the talent as well. Dara Reneé, the multihyphenate actress who stars in Descendants: The Rise of Red, was excited to experience the festival for the first time alongside her family. “It is such an honor to be here. I wouldn't be who I am today without the Black women in my life, from my grandmother to my aunts. Everyone has made me who I am. I'm so glad some of them came out to support me; some of my family from Baltimore. I wouldn't be where I am without Black people. I'm also a global ambassador of Pantene, so I'm grateful to be here and see all the beautiful Black businesses.” MORE FOR YOU Apple iPhone 16 And iPhone 16 Plus: Everything We Know So Far FBI Issues Urgent Ransomware Attack Warning—Do These 3 Things Now Today’s NYT Mini Crossword Clues And Answers For Saturday, August 31 NEW ORLEANS, LOUISIANA - JULY 06: (L-R) La June Montgomery Tabron and Colman Domingo speak onstage ... [+] during the 2024 ESSENCE Festival Of Culture™ Presented By Coca-Cola® at Ernest N. Morial Convention Center on July 06, 2024 in New Orleans, Louisiana. (Photo by Arturo Holmes/Getty Images for ESSENCE) Getty Images for ESSENCE The actress wasn’t the only one delighted to attend, as the same can be said for actor, director, and playwright Colman Domingo. Domingo, who appeared during the jam-packed event to support his latest partnership with the W.K. Kellogg Foundation, the National Day of Racial Healing, was especially enthused to be in community with the multiple Black women who were present. “When I walk through here, I see my sister, aunties, and cousins, and it is just beautiful. It's such a beautiful expression of not only Black womanhood but also how Black women hold up Black men and how we have to do it together. I just love being out there. I was so excited to be here, not only for the W.K. Kellogg Foundation but also to be with all these Black women.” NEW ORLEANS, LOUISIANA - JULY 06: Hakeem Holmes, Vice President of ESSENCE Festival of Culture™ ... [+] speaks onstage during the 2024 ESSENCE Festival Of Culture™ Presented By Coca-Cola® at Ernest N. Morial Convention Center on July 06, 2024 in New Orleans, Louisiana. (Photo by Paras Griffin/Getty Images for ESSENCE) Getty Images for ESSENCE As Holmes reflects on the legacy of the ESSENCE Festival of Culture, he expresses gratitude towards the supportive community, who he believes is the sustaining force for the hugely successful event. “My first ESSENCE Festival was in 2013; prior to that, I had never been to the experiences at the Convention Center or the Superdome. I didn't know the Convention Center experience existed. I remember stepping foot in the Convention Center as an intern, and I was just overwhelmed with joy at how the festival served the community. Our community, our culture, and our people hold us accountable, and they're why the festival is here today. The festival was supposed to be a one-time event that is now celebrating 30 years. And without the community-at-large, the festival wouldn't be here.” Follow me on LinkedIn. Check out my website. Kenneth J. Williams Jr. Following Editorial Standards Print Reprints & Permissions","summary":"One event of paramount importance was the annual ESSENCE Festival of Culture, which celebrated its 30th anniversary earlier this summer.","url":"https://www.forbes.com/sites/kennethjwilliamsjr/2024/08/31/essence-festival-2024-a-30-year-celebration-of-black-excellence/","image":"https://imageio.forbes.com/specials-images/imageserve/66d3870765e0687e12bf364d/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-31 21:15:39","author":"Contributor,Kenneth J. Williams Jr","authors":["Contributor","Kenneth J. Williams Jr"],"language":"en","source_country":"US","sentiment":0.288},{"id":255356684,"title":"Harris calls Trump cemetery visit disrespectful, political stunt","text":"U.S. Vice President Kamala Harris criticized Republican presidential rival Donald Trump on Saturday over a visit he made to soldiers' graves at Arlington National Cemetery that was later used in campaign video footage. \"It is a solemn place; a place where we come together to honor American heroes who have made the ultimate sacrifice in service of this nation. It is not a place for politics,\" Harris wrote in an X post. The vice president weighed in five days after Trump took part in a wreath-laying ceremony on Monday honoring the 13 service members killed during the U.S. withdrawal from Afghanistan in 2021. He also visited Section 60 of the Virginia cemetery, which the military considers hallowed ground. Federal law and Pentagon policies do not allow political activities in that section, but Trump's campaign took videos and used them in advertisements as he battles Democrat Harris in a close race for the White House. Trump's visit drew criticism from some veterans and soldiers' relatives. The U.S. Army on Friday defended a cemetery employee who was pushed aside at Section 60, saying she acted professionally and was being unfairly attacked. \"Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,\" Harris wrote. Trump vice presidential pick JD Vance and press secretary Karoline Leavitt responded to Harris' post with their own that referenced the Afghanistan pullout and accused Harris of being insensitive to the servicemembers who died there. \"Why don’t you get off social media and go launch an investigation into their unnecessary deaths?\" Vance wrote. Trump used the third anniversary on Monday of the U.S. withdrawal from Afghanistan to try to pin the chaotic pullout under President Joe Biden on his vice president. Harris, 59, became the Democratic nominee in the Nov 5 presidential election after Biden, 81, pulled out of the race in July. The vice president's response to the Trump cemetery visit may give a clue to how she would handle the topic in their upcoming Sept 10 debate. Harris referred to Trump's history of insulting military veterans. \"This is nothing new from Donald Trump. This is a man who has called our fallen service members 'suckers' and 'losers' and disparaged Medal of Honor recipients,\" she wrote. Trump once said the late Senator John McCain, a former Republican presidential candidate, was not a war hero even though he spent years as a prisoner of war in North Vietnam after being shot down while a Navy pilot. Trump referred to fallen World War One veterans as \"suckers\" and \"losers,\" according to his former White House chief of staff, John Kelly, a retired Marine Corps general. It was unclear whether such incidents would sway the veterans vote. In an April report, the Pew Research Center found that military veterans favor the Republican Party. © Thomson Reuters 2024.","summary":"U.S. Vice President Kamala Harris criticized Republican presidential rival Donald Trump on Saturday over a visit he made to soldiers' graves at Arlington National Cemetery that was later…","url":"https://japantoday.com/category/world/harris-calls-trump-cemetery-visit-disrespectful-political-stunt","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/2a/c4/92b655eb9ba49c1c05d119ba06ca64cdfd30/tagreuters/_w1700.jpg","video":null,"publish_date":"2024-08-31 21:12:04","author":"Doina Chiacu,Japan Today Editor","authors":["Doina Chiacu","Japan Today Editor"],"language":"en","catgory":"politics","source_country":"jp","sentiment":-0.321},{"id":255356376,"title":"Trump \"Disrespected Sacred Ground' At US Military Cemetery: Kamala Harris","text":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump \"disrespected sacred ground\" at a US military cemetery during a contentious pre-election visit. Trump's presence at the hallowed Arlington National Cemetery -- intended to provide a campaign boost ahead of the November 5 vote -- has instead mushroomed into a public dispute consuming the candidates and the military. \"Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,\" Harris said of Monday's incident at the cemetery near Washington, where Trump defied the rules and posed for photos with relatives of US service members killed in Afghanistan. In one image, he is standing with family members of a fallen Marine, posing among headstones while grinning broadly and giving a thumbs-up. \"If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honored, never disparaged, and treated with nothing less than our highest respect and gratitude,\" Harris wrote on X. 'Abruptly pushed aside' On Thursday, the US Army issued a rare statement confirming that a cemetery staff member had been \"abruptly pushed aside\" after asking Trump's team to stop filming in a burial section for those killed in recent wars, where photography for political purposes is banned. Trump's campaign team has gone on the offensive by describing the employee as a \"despicable individual\" and claiming she was suffering a mental health episode. But the military said the staff member had \"acted with professionalism\" and it condemned the incident as \"unfortunate.\" Trump has made criticism of the Biden-Harris administration's handling of the US retreat from Afghanistan a keynote of his campaign, arguing that he would have managed it better. He visited the cemetery with families of some of the 13 service members killed in a 2021 bombing in Kabul during the last, chaotic hours of the US withdrawal. Trump's relationship with the military has long spawned controversy. While often touting his support for the armed forces, he privately mocked the war dead while he was president and did not want to be seen near military amputees, according to his former chief of staff. Harris's blunt response Saturday over the cemetery incident appeared to underline her determination to take the fight directly to Trump in what is shaping up to be a bruising presidential election. Trump has repeatedly mocked Harris's name, intelligence, appearance and racial identity, while the Harris campaign has replied that the former president is \"weird,\" an aspiring dictator, and \"out of his mind.\" Harris earlier faced withering criticism over the cemetery incident from Trump's running mate, Senator J.D. Vance, who has launched a series of fierce attacks against the vice president. Apparently responding to a mistaken report that Harris had already reacted to the cemetery visit, Vance accused her of feigning outrage and said, \"She can go to hell.\" \"Don't focus on Donald Trump showing up to grieve with some people who lost their children. Focus on your own job. Don't do this fake outrage thing,\" he later told the Washington Post. At that point Harris had not publicly mentioned the cemetery visit. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump \"disrespected sacred ground\" at a US military cemetery during a contentious pre-election visit.","url":"https://www.ndtv.com/world-news/donald-trump-disrespected-sacred-ground-at-us-military-cemetery-6462775","image":"https://c.ndtvimg.com/2024-07/ugf3uu1g_trump-harris-_625x300_22_July_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-08-31 21:03:24","author":null,"language":"en","catgory":"politics","source_country":"in","sentiment":-0.134},{"id":255355620,"title":"Biden goes back to the BEACH for the second weekend in a row, despite promising to work hard at the DNC.","text":"President Joe Biden was spotted with First Lady Jill Biden on the beach in Rehoboth, Delaware – vacationing for the second weekend in a row. Biden sat near a blue umbrella wearing a black hat and Philadelphia Eagles T-shirt while talking on the phone and waving at the cameras on Saturday. The First Lady appeared relaxed with the sleeves of her white dress rolled up and hair tired back in a gray baseball cap. The 81-year-old president, who vowed he was committed to seeing out the remaining months of his term, has been facing criticism for spending so much time at the beach. ‘Who is running the country?’ Texas congressman Wesley Hunt said on X on Thursday. ‘Joe Biden is on his second vacation in two weeks and Kamala Harris is preparing for her first interview in 40 days.’ Biden arrived in Rehoboth Beach on Sunday after spending a week at an 8,000-acre ranch in Santa Ynez, California. The couple – along with their children and grandchildren – stayed at a California ranch owned by Democratic donor billionaire Joe Kiani. The property sits about three hours north of Los Angeles in Santa Barbara wine country. Kiani has been a major donor to Biden’s campaigns and a friend to the family. Hunter Biden paid a visit to the $50 million vineyard property last year. Dubbed the ‘Kiani Preserve,’ the 8,000 acres has its own private vineyard, donkeys and a cattle herd. However, the White House has defended Biden’s two-week break, saying he is in charge and running the country from his vacation locations. ‘The president is on vacation, but you can never unplug and from a job like that. Nor does he try to,’ National Security Council spokesperson John Kirby said Monday in a zoom briefing with reporters. ‘He’s very much in command,’ he noted of Biden. He pointed out Biden spoke with Indian Prime Minister Narendra Modi on Monday and talked to Ukrainian President Volodymyr Zelensky as proof the president is working. He’ll be in Rehoboth until Monday, when he joins Kamala Harris in Pittsburgh for a campaign event. Biden is on his 114th visit to Delaware spanning all or part of 328 days, according to journalist Mark Knoeller who tracks presidential travel. That is much more when compared to Donald Trump at a similar point in office: he spent 51 visits and 240 days at either of his estates in Mar-a-Lago, Florida, or Bedminster, New Jersey. Biden will hit the road next week, heading to Wisconsin on Thursday to talk about his administration’s push to lower costs for Americans. Wisconsin in a critical battleground state for Democrats in the 2024 election. Biden is no longer on the ballot but can talk about what he and Kamala Harris have done to help the country. During his speech at the Democratic National Convention in Chicago, Biden said he was acting for the good of the country, and that he was ‘going to be working like hell’ before his term ended. He added that serving as Commander-in-Chief has been the ‘honor of my lifetime’ and that he has ‘a lot to do’ in his last five months in office. ‘I’ve got a lot to do – I intend to get it done,’ he said. Biden exited the presidential race on July 21 after his terrible debate performance against Donald Trump, which led to concerns about his mental abilities. ‘Over the next six months, I’ll be focused on doing my job as president,’ Biden said in his July 24 Oval Office address.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Joe Biden was spotted with First Lady Jill Biden on the&#8230;\n\n\nThis Post: Biden goes back to the BEACH for the second weekend in a row, despite promising to work hard at the DNC. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/biden-goes-back-to-the-beach-for-the-second-weekend-in-a-row-despite-promising-to-work-hard-at-the-dnc/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Biden-returns-to-the-BEACH-for-second.jpg","video":null,"publish_date":"2024-08-31 21:02:21","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.039},{"id":255355622,"title":"6 Million Viewers Watch CNN Interview With Harris And Walz","text":"Share to Facebook Share to Twitter Share to Linkedin Minnesota Gov. Tim Walz and Vice President Kamala Harris are interviewed by CNN’s Dana Bash at Kim’s ... [+] Cafe in Savannah, Georgia, on August 29, 2024. (Will Lanzoni/CNN) Will Lanzoni/CNN CNN’s prime time interview with Kamala Harris and running mate Tim Walz—the Democratic ticket’s first since President Joe Biden stepped down from his re-election campaign—drew a total audience of more than 6 million viewers Thursday night, making the interview the top-rated show in television on the night. Among viewers 25-54, the key demographic valued by advertisers, The First Interview: Harris & Walz drew a total audience of 1.2 million viewers, the second largest audience on the night behind college football on ESPN. Minnesota Gov. Tim Walz and Vice President Kamala Harris are interviewed by CNN’s Dana Bash at Kim’s ... [+] Cafe in Savannah, Georgia, on August 29, 2024. (Will Lanzoni/CNN) Will Lanzoni/CNN The prime time special, with Dana Bash asking Harris and Walz questions, beat the combined ratings of Fox News (2.65 million viewers) and MSNBC (1.367 million viewers), according to ratings data compiled by Nielsen. The interview gave CNN its best ratings in the 9 p.m. ET hour since CNN hosted the presidential debate in June that ultimately led President Joe Biden to exit his re-election campaign. The Trump-Biden debate drew a total audience of 9.681 million viewers and 3.398 million viewers in the key demo. MORE FOR YOU Apple iPhone 16 And iPhone 16 Plus: Everything We Know So Far FBI Issues Urgent Ransomware Attack Warning—Do These 3 Things Now Today’s NYT Mini Crossword Clues And Answers For Saturday, August 31 ASHEBORO, NC - AUG. 21: Vice presidential nominee J.D. Vance and former president Donald J. Trump ... [+] addresses a crowd in Asheboro, North Carolina, on Wednesday. (Kate Medley for the Washington Post) The Washington Post via Getty Images Trump and his running mate, JD Vance, had criticized Harris for failing to sit for a network interview—and then for including Tim Walz, despite a long tradition of presidential candidates being interviewed with their running mates after their party’s convention. Asked by Bash about policy shifts she’s made on issues including fracking, Harris said her “values have not changed” and she said she would include a diversity of opinion in the White House should she be elected in November. \"You mentioned the Green New Deal,” Harris told Bash. “I have always believed, and I have worked on it, that the climate crisis is real, that it is an urgent matter to which we should apply metrics that include holding ourselves to deadlines around time. We did that with the Inflation Reduction Act. We have set goals for the United States of America, and by extension, the globe, around when we should meet certain standards for reduction of greenhouse gas emissions, as an example. That value has not changed.\" Harris also declined to talk much about Trump suggesting she “happened to turn black,” dismissing it as the “same old tired playbook” before asking for the next question. In other newsmaking answers, Harris said she would include a Republican in her cabinet. “I've got 68 days to go with this election, so I'm not putting the cart before the horse,\" Harris said. \"But I would, I think. I think it's really important. I have spent my career inviting diversity of opinion. I think it's important to have people at the table when some of the most important decisions are being made that have different views, different experiences. And I think it would be to the benefit of the American public to have a member of my Cabinet who was a Republican.\" Follow me on Twitter or LinkedIn. Mark Joyella Following Editorial Standards Print Reprints & Permissions","summary":"The Democratic ticket's first network interview was the highest-rated show in television Thursday night.","url":"https://www.forbes.com/sites/markjoyella/2024/08/31/6-million-viewers-watch-cnn-interview-with-harris-and-walz/","image":"https://imageio.forbes.com/specials-images/imageserve/66d3611f9c1837ec79fc1aff/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-31 21:00:14","author":"Mark Joyella,Senior Contributor","authors":["Mark Joyella","Senior Contributor"],"language":"en","source_country":"US","sentiment":0.023},{"id":255357204,"title":"Nothing about this year is normal. It could give Harris a chance at history","text":"by Errin Haines for The 19th With 70 days to go until Election Day, Vice President Kamala Harris is now within striking distance of becoming America’s 47th president. For some, the moment seemed implausible just over a month ago — and that was not lost on Harris as she accepted the Democratic Party’s nomination for president. “America, the path that led me here in recent weeks, was no doubt unexpected,” Harris told voters Thursday, the final night of the Democratic National Convention. “But I’m no stranger to unlikely journeys.” In record time, Harris has gone from running mate to candidate, from overlooked to undeniable as the Democratic Party’s standard bearer. The circumstances of Harris’ historic run, like the 2024 election cycle, have been unconventional, a combination of luck — good and bad — preparation, and an unprecedented political climate. Now, for the second time in less than a decade — and the second time ever — a woman is at the top of the ticket for a major American political party. Biden’s decision to drop out, thrusting Harris into the campaign and allowing her to ride a wave of joy and momentum, has created a situation singular in American politics. For many reasons, this couldn’t have happened any other way: In an electorate that has never made a woman president and only once gone for a non-White presidential candidate, many are suddenly excited about a candidate who’s a woman of color, in part because she holds both of these identities. The unusual nature of the race is a positive, said Hillary Clinton, the 2016 Democratic nominee for president and the first woman to win a major party’s nomination. “A short campaign, a dramatic exit and entrance … I think all of that works to her advantage, because it captured the imagination of people,” Clinton said. “The country is certainly paying attention to her. It’s a real tribute to her and the way that she just leapt onto the scene, took control of it, showed how effective she was from the very beginning.” Clinton’s path to the nomination was not entirely normal, either. Like others who have run for president, she was a former senator and secretary of state, but unlike others, she was a former first lady. And she emerged as her party’s pick after a contentious 2016 primary election where questions around her “likeability” dogged her candidacy. While vice presidents have often gone on to seek the top job, Harris’ path is unique. She did not have to wait eight years after a failed primary bid to run again. She didn’t face off against Democrats for the nomination, a process that often can push candidates to the left, a potential liability in a general election, and open them up to intense scrutiny from the press. Instead, Democrats got clarity: a choice that is not only about deciding whether to vote for the woman, but whether or not they will support their party’s nominee. That Harris is running a campaign lasting 107 days — and not the traditional race that lasts more than a year and includes an open primary contest with potential challengers — has unique advantages and pitfalls. Democratic strategist Karen Finney pointed out that the first 48 hours, with Harris also doing the work of calling delegates and donors, was critical to setting a tone and ensuring a smooth process. But, she added, the shorter timetable means Harris doesn’t have a lot of room for error. “There are people who wouldn't have been able to step up that quickly and continue to win the day,” Finney said. “But also, you don’t have a lot of time to recover from missteps.” The collapsed timeline doesn’t give the candidate time to overthink or the country time to fall into sexist patterns, which both have done in the past. And in the weeks since Harris has been his opponent, Trump has struggled to define her, his traditional playbook of racial and gendered attacks falling flat. “Donald Trump, for better or worse, has been quite good at getting things to stick to people,” said Prairie View A&M University political scientist Melanye Price. “The longer he repeats the things he says, the more likely it is that somehow, that starts to seep into the narrative of the nation. The less time he has to figure out how to effectively campaign against her, the better it’s going to be for her and more likely it’ll be that those on the fence voters won’t have time for his toxicity to metastasize.” Harris and her campaign have also been on offense, fighting on ground she has defined with her messaging, shaping her own narrative and vision through her campaign events and at the convention. Still looming on the election schedule for Harris are two potential political challenges: a presidential debate currently scheduled for September 10 and her first sit-down press interview, which her campaign has said will happen by the end of August. Those working to help elect Harris, who have already been collaborating and strategizing but who now have a new candidate and fresh energy, see the rushed calendar as a plus. “It’s kind of like there’s this sense of urgency that forces everyone to see that we have to dig deep for these next 10 weeks, that we have to go now,” said Stefanie Brown James, co-founder and executive director of CollectivePAC, which works to elect Black candidates at the local, state and federal level. “We’re seeing people want to know who this person is that’s causing all this excitement? What does she stand for? That’s something we can’t sleep on, and it’s going to take every ounce of us working every day for the next 10 weeks for us to be successful.” In many ways, the story of Harris’ unlikely journey is one not just of 107 days, but of the last four years, and about how far the candidate and the country have come. Much of that evolution happened behind the scenes, when the media paid less attention to a role that has been traditionally unimportant. But with a new opportunity to introduce herself, after a national reckoning on race, with women continuing to break barriers across society, could voters choose Harris to break what Clinton calls “the highest, hardest glass ceiling”? Harris is making the case for why she is ready to be president. Soon, the country will decide whether they believe she is ready.","summary":"by&nbsp;Errin Haines for The 19th\n\n\n\nWith 70 days to go until Election Day, Vice President Kamala Harris is now within striking distance of becoming America’s 47th president.\n\n\n\nFor some, the moment seemed implausible just over a month ago — and that was not lost on Harris as she accepted the Democratic Party’s nomination for president.\n\n\n\n“America, the path that led me here in recent weeks, was no doubt unexpected,” Harris told voters Thursday, the final night of the Democratic National Convention. “But I’m no stranger to unlikely journeys.”\n\n\n\nIn record time, Harris has gone from running mate to candidate, from overlooked to undeniable as the Democratic Party’s standard bearer.\n\n\n\nThe circumstances of Harris’ historic run, like the 2024 election cycle, have been unconventional, a combination of luck — good and bad — preparation, and an unprecedented political climate. Now, for the second time in less than a decade — and the second time ever — &nbsp;a woman is at the top of the ticket for a major American po","url":"https://www.dailykos.com/story/2024/8/31/2266605/-Nothing-about-this-year-is-normal-It-could-give-Harris-a-chance-at-history?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1339816/story_image/GettyImages-2167185136.jpg?1724958491","video":null,"publish_date":"2024-08-31 21:00:08","author":"The19th","authors":["The19th"],"language":"en","source_country":"US","sentiment":0.013},{"id":255357336,"title":"The Debrief with Chris Irvine: Is Biden still running the country?","text":"Washington Examiner Investigations Editor Sarah Bedford joins Managing Editor Chris Irvine to discuss President Joe Biden‘s vacation time at the beach. Is he still running the executive office? Vice President Kamala Harris’s narrative of hiding behind scripted moments is starting to replace the joyful narrative. When Harris is up at the debate stage, will people have more eyes on her and find out who she really is?","summary":"Washington Examiner Investigations Editor Sarah Bedford joins Managing Editor Chris Irvine to discuss President Joe Biden&#8216;s vacation time at the beach. Is he still running the executive office? Vice President Kamala Harris&#8217;s narrative of hiding behind scripted moments is starting to replace the joyful narrative. When Harris is up at the debate stage, will people [&#8230;]","url":"https://www.washingtonexaminer.com/the-debrief/3138586/the-debrief-chris-irvine-is-biden-still-running-country/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Biden-in-Rehoboth-1.webp","video":null,"publish_date":"2024-08-31 21:00:00","author":"Washington Examiner Staff","authors":["Washington Examiner Staff"],"language":"en","source_country":"US","sentiment":0.148},{"id":255357534,"title":"Jesse Watters Put Fox News in a Rare Position: Covering Its Ass Live on Air","text":"This week, Fox News was in a rare position: Covering its ass live on air. Host Jesse Watters has a history of making misogynist remarks. But on Monday, he took it too far, apparently, by Fox’s low (low) standards. During a roundtable discussion, he made a vulgar remark about Vice President Kamala Harris, claiming she’d be “paralyzed in the Situation Room while the generals have their way with her.” Fox News isn’t exactly known for issuing apologies or corrections—they paid almost $800 million in a settlement to avoid doing just that when Dominion, a voting machine company, sued Fox over its rampant 2020 election lies. But, as Mother Jones creator Kat Abughazaleh points out, the real question is how long can Fox indulge “smug assholes” like Watters without getting burned? When even Jeanine Pirro tells you to “take it back,” you should know you’ve crossed the line, and Watters tried to clean up his mess the next day, claiming his comments were being “misconstrued.” But his smirk said it all. As their rhetoric becomes increasingly racist and misogynistic and the stakes rise as the election campaign charges forward, Fox may find its credibility finally spent. Because when you’re willing to risk it all for Jesse Watters’ weirdly horny takes, maybe it’s time to reconsider just how much you’re willing to lose.","summary":"This week, Fox News was in a rare position: Covering its ass live on air. Host Jesse Watters has a history of making misogynist remarks. But on Monday, he took it too far, apparently, by Fox’s low (low) standards. During a roundtable discussion, he made a vulgar remark about Vice President Kamala Harris, claiming she&#8217;d [&#8230;]","url":"https://www.motherjones.com/politics/2024/08/jesse-watters-fox-news-kamala-harris-sexist-remarks/","image":"https://www.motherjones.com/wp-content/uploads/2024/08/GettyImages-2041845801.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2024-08-31 20:47:56","author":"Mother Jones","authors":["Mother Jones"],"language":"en","source_country":"US","sentiment":-0.342},{"id":255355264,"title":"Trump backs ballot amendment to legalize recreational marijuana in Fla.","text":"Aug. 31 (UPI) -- Donald Trump on Saturday said he supports a ballot initiative in his home state of Florida that would legalize the recreational use of marijuana for adults 21 and older. \"Someone should not be a criminal in Florida, when this is legal in so many other States,\" Trump wrote on Truth Social about Amendment 3. \"We do not need to ruin lives & waste Taxpayer Dollars arresting adults with personal amounts of it on them, and no one should grieve a loved one because they died from fentanyl laced marijuana. We will make America SAFE again!\" One day earlier, he said he opposes another ballet initiative measure in Florida: Amendment 4, which seeks to change the state's ban on abortion from six weeks of pregnancy to around 24 weeks. Both measures require 60% of approval by voters in the Nov. 5 election for passage. The marijuana amendment would authorize 25 companies licensed by the state to sell pot to adults for recreational use and allow the possession of the substance up to 3 ounces. Medical marijuana usage already is legal in the state. With Trump's residence in Mar-a-lago in Palm Beach, Trump is eligible to vote on the two measures. \"Whether people like it or not, this will happen through the approval of the Voters, so it should be done correctly,\" he wrote. \"We need the State Legislature to responsibly create laws that prohibit the use of it in public spaces, so we do not smell marijuana everywhere we go, like we do in many of the Democrat run Cities.\" The marijuana proposal is backed by Florida's medical marijuana industry. It is one of the largest in the country and brings in more than $2 billion in profits each year. Florida Gov. Ron DeSantis is against both ballot measures, launching a political committee called the Florida Freedom Fund to attack the legalization push and efforts to enshrine the right to abortion in the state's constitution. DeSantis helped launch the \"No on 3\" campaign in July, which released a statement saying that the initiative would lead to \"weed everywhere, every place, and in your face.\" Florida state Sen. Joe Gruters, a Trump ally and former state GOP chair, wrote on X: \"I am incredibly proud to have President Trump stand alongside us in our effort to end needless arrests and incarcerations of adults for simple possession of marijuana and to give Floridians the same individual freedom to choose safe, tested products that more than half the country already enjoys.\" Eighty-eight percent of Americans say marijuana should be legal for personal or medical use, according to a March study by the Pew Research Center. Marijuana remains illegal under federal law, but 24 states and Washington, D.C., have passed legislation allowing recreational use. The issue also will be on the ballot in South Dakota and Nebraska in November. Only three states have approved the measure with at least 60%: New Jersey and Arizona in 2020, and Maryland in 2022. Thirty-eight states and the District of Columbia have approved medical marijuana use. Regarding the abortion issue, on Thursday Trump told NBC News that Florida's six-week ban is \"too short\" and declined to take a clear stance on a state ballot measure. But he face backlash from anti-abortion advocates. \"So I think six weeks, you need more time than six weeks,\" he told Fox News. \"I've disagreed with that right from the early primaries when I heard about it, I disagreed with it. \"At the same time, the Democrats are radical, because the nine months is just a ridiculous situation where you can do an abortion in the ninth month. ... So I'll be voting no for that reason.\" Vice President Kamala Harris' campaign said that Trump \"will vote to uphold an abortion ban so extreme it applies before many women even know they are pregnant.\"","summary":"Donald Trump on Saturday said he supports a ballot initiative in his home state of Florida that would legalize the recreational use of marijuana for adults 21 and older.","url":"https://www.upi.com/Top_News/US/2024/08/31/Fla-Trump-back-recreational-marijuana-measure/5161725134377/","image":"https://cdnph.upi.com/ph/st/th/5161725134377/2024/upi/43a5300a01536628e0548baed1305b08/v1.2/Trump-backs-ballot-amendment-to-legalize-recreational-marijuana-in-Fla.jpg","video":null,"publish_date":"2024-08-31 20:40:04","author":"Allen Cone","authors":["Allen Cone"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.173},{"id":255358694,"title":"Mark Cuban polls followers on preferring their kids to be like Trump or Harris: Trump wins in a landslide","text":"Dallas Mavericks minority owner Mark Cuban posed a question to his followers on X on Friday night in a now-lopsided poll. \"Who’s persona and character would you like to see young children grow up to have?\" Cuban wrote on a two-way poll with the two options being Donald Trump and Kamala Harris. Trump is leading the poll 65.7% to just 34.3% for Harris, with over 645,000 votes at the time of publication. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM The poll prompted several responses from prominent political commentators and influencers on the platform. Former Republican candidate for Missouri Secretary of State Valentina Gomez, who lost earlier this month, was one of many high-visibility right-wing voices in the replies to criticize Harris' professional history. MARK CUBAN SLAMMED BY KNICKS STAR JALEN BRUNSON OVER COMMENTS ABOUT HIS PARENTS Cuban has been a vocal opponent of Trump dating back to the former president's first bid for office. However, the billionaire sports mogul once sided with Trump. Cuban has said he supported the former president when Trump initially launched his first presidential campaign in 2015. Cuban elaborated on his initial support of Trump during an interview with Vivek Ramaswamy on X on August 7. \"In 2015, I was like, ‘He's great. He's not a typical Stepford candidate. I thought that was a positive,\" Cuban said. \"A big part of that is I didn't think he had a chance. I just wanted to kind of screw things up in traditional politics, which I'm not a fan of.\" The \"Shark Tank\" host even said he would consider being Trump's running mate in the 2016 election in an interview with Business Insider in July 2015. \"I don't care what his actual positions are,\" Cuban also wrote of Trump in a post on his own social media app project \"Cyberdust\" in July 2015. \"I don't care if he says the wrong thing. He says what's on his mind. He gives honest answers rather than prepared answers. This is more important than anything any candidate has done in years.\" Earlier this year, when Joe Biden was still the presumptive Democratic nominee, Cuban went so far as to say he would vote for Biden over Trump even if Biden were \"being given his last rites.\" \"If they were having his last wake, and it was him versus Trump, and he was being given last rites, I would still vote for Joe Biden,\" Cuban told Bloomberg News in March. CLICK HERE TO GET THE FOX NEWS APP Cuban has been quick to throw his support behind Harris since she became the presumptive nominee. He defended her proposed economic agenda in a thread of X posts on August 16, and even accused Trump of copying Harris' policy when the former president declared that his presidency would be \"great for women's reproductive rights.\" \"And now he is copying @KamalaHQ policies. What's going on here?\" Cuban wrote on X on Aug. 24. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Dallas Mavericks minority owner Mark Cuban polled his followers on X asking &quot;who&apos;s persona and character&quot; they would want their kids to have, Harris or Trump.","url":"https://www.foxnews.com/sports/mark-cuban-polls-followers-preferring-kids-like-trump-harris-trump-won-landslide","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/TrumpHarris.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-31 20:33:37","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.021},{"id":255354868,"title":"Harris says Trump campaign \"disrespected\" Arlington National Cemetery","text":"Vice President Kamala Harris condemned former President Donald Trump and his campaign for disrespecting a \"sacred ground, all for the sake of a political stunt.\"In a post on X, the Democrat Party nominee said Arlington National Cemetery is a \"place where we come together to honor American heroes\" and it is \"not a place for politics.\"These are Harris' first comments since it was reported that an altercation between a female cemetery official and a Trump campaign staffer on Monday. Trump took part in a wreath-laying ceremony at the Tomb of the Unknown Soldier to commemorate three years since the U.S. withdrawal from Afghanistan. He was joined by Gold Star families whose family members died.\"And yet, as was reported this week, Donald Trump's team chose to film a video there, resulting in an altercation with cemetery staff,\" Harris said on Saturday. \"Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt.\"She added: \"If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honored, never disparaged, and treated with nothing less than our highest respect and gratitude.\"The Trump campaign and Arlington National Cemetery officials differ on what exactly happened.Different experiences, same incident The Trump campaign said they were explicitly granted permission to bring \"campaign designated media\" to Section 60 of the cemetery by the Gold Star families. Messages reviewed by CBS News confirmed that the campaign was given direct permission by the families.However, the rules at Army National Military Cemeteries are dictated by federal law which prohibits any filming for partisan, political or fundraising purposes, according to Arlington National Cemetery media policies, even if there are requests by family members of the fallen. An Army spokesperson said all participants were made aware of the federal laws ahead of Monday's incident.\"An ANC employee who attempted to ensure adherence to these rules was abruptly pushed aside,\" the Army said. \"Consistent with the decorum expected at ANC, this employee acted with professionalism and avoided further disruption.\"The incident was reported to the military police department by the Arlington Cemetery employee, who decided not to press charges. The Army told CBS News that it considers the matter closed. The Trump campaign's communications director, Steven Cheung told CBS News in a statement that there was \"no physical altercation\" and that they are prepared to release footage.\"The fact is that a private photographer was permitted on the premises and for whatever reason an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump's team during a very solemn ceremony,\" the statement said.Republicans take aim at Harris, Dems want answersIn a post on X responding to Harris, Trump's running mate Sen. JD Vance said: \"President Trump was there at the invitation of families whose loved ones died because of your incompetence. Why don't you get off social media and go launch an investigation into their unnecessary deaths?\"Meanwhile, Republican Sen. Tom Cotton praised Trump, saying Gold Star families had every right to invite \"whomever they wanted to commemorate this solemn anniversary.\"\"The real scandal is that Kamala Harris and Joe Biden condemned thirteen brave American troops to death and didn't even have the decency to call or meet with the Gold Star families to express their condolences,\" the Arkansas senator said in a statement released by Trump's campaign.In her own post on X, Trump campaign spokesperson Karoline Leavitt blasted Harris, blaming the vice president for the deaths during the withdrawal.\"Kamala's stupidity led to one of the most embarrassing events in American history and 13 brave US soldiers being killed. She has never said their names. She has never reached out to their families,\" she said. \"For this alone, Kamala does not deserve to be elected. Kamala has already proven that she would be a dangerously incompetent Commander in Chief.\"Meanwhile, Democratic lawmakers with the House Oversight Committee sent a letter to the U.S. Army requesting a \"full account\" of the incident at the cemetery. \"It appears that the Trump campaign—which arrived at the Cemetery with a photographer and videographer—completely flouted the laws and rules they were informed of and filmed footage in the restricted area for use in a political TikTok video,\" Democratic Rep. Jamie Raskin of Maryland wrote in a letter to Army Secretary Christine Wormuth.Raskin requested a response from Wormuth by Sept. 9.","summary":"The Democratic Party nominee said Arlington National Cemetery is a \"place where we come together to honor American heroes\" and is \"not a place for politics.\"","url":"https://www.cbsnews.com/news/kamala-harris-trump-campaign-arlington-national-cemetery/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/28/ff1ba8c1-17c1-44e7-b895-0b0747f15112/thumbnail/1200x630g2/661be847bf60c7ee2f999c0b5d2cae98/gettyimages-2168587810.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3157444_hls/master.m3u8","publish_date":"2024-08-31 20:29:37","author":"Lucia Suarez Sang","authors":["Lucia Suarez Sang"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.161},{"id":255354422,"title":"It’s possible for William and Harry to get their old act back together like Oasis… but not while Harry is ­with Meghan","text":"WAS this the week that the most famous feuding brothers in the world started to patch it up? Liam and Noel Gallagher getting the band back together was just the start. Incredibly, in the same week that the Oasis reunion was announced, Prince William and Prince Harry were at the memorial for their uncle Lord Robert Fellowes, who was Diana’s brother-in-law. Oasis AND the Fab Four announcing a reunion tour on the same day? Not quite. The warring Windsors are not quite ready to take their old act back on the road. William and Harry were photographed together at the Queen’s funeral in 2022. But this week all the reports suggest the brothers sat apart at the memorial. Unlike Liam and Noel, there was no joint photoshoot. “They kept their distance,” said -someone who was there. But the fact that William and Harry were in the same church, paying their respects to their uncle — when Harry was not expected to attend the event — still feels significant. And coming so soon after reports that William did not want Harry at his Coronation feels like some small step to restoring the old fraternal bond that was so incredibly strong for so long. Is it too much to hope that one day William and Harry will bury the hatchet? And not in a ginger skull? Noel and Liam made it seem possible. There have been suggestions that Harry is keen on a reconciliation with the family he ran away from, and then -ratted on. The paperback of Harry’s autobiography Spare is being published without any salacious updates or indiscreet interviews to promote it. Mancus yobbus Harry could have easily -created another anti-royal media frenzy — if he had wanted to. Is that perhaps a tentative hand of friendship held out by a man who often looks so wretchedly unhappy in his new pseudo-royal life? A divorced rock star will always be in need of another £50million or so. But the Oasis reunion is not just about the money. I would bet my life that Noel and Liam watched the recent Blur reunion with a touch of envy and -bewilder- ment. Blur sold out Wembley — twice (the same as Bruce Springsteen). A two-hour concert film is being released in the cinema. The Gallagher brothers will have watched Blur’s renaissance and reflected: “But Oasis were better than Blur. But Oasis were bigger than Blur. What about us?” It was probably the first thing that Noel and Liam have agreed about for years. Their reunion is more than huge — it is historic. Oasis are the last of the great bands. Their tour feels like it could be the last majestic gasp of the guitar-based rock music that exploded a lifetime ago. Oasis 2025 has the gravitas of a David Attenborough wildlife documentary. See this exotic species now — Mancus yobbus — for we may never see their like again. And for Noel and Liam, that has to feel good. And if the Gallaghers can make up — despite the bad blood, despite the bitching, despite all the hurt feelings — can William and Harry do it too? Yes, under one condition. Some say the Oasis reunion was only made possible by Noel’s divorce from second wife Sara -MacDonald — who once described her brother-in-law Liam as “a fat t*t doing his tribute act, balancing a tambourine on his head”. But sharp-tongued Sara and her waspish social media posts are history now. And perhaps that suggests a way -forward for the warring Windsors. It is not impossible for -William and Harry to get their old beloved act back together again. But probably not while Harry is -married to Meghan. A reconciliation between her sons is what Liam and Noel’s mum, Peggy -Gallagher, always wanted. And — more than anything in the world — isn’t that what Diana would have wanted for William and Harry too? DON’T expect our joy-sucking socialist government to give a toss about three pubs a week closing down because the finger-wagging, left-wing prigs want to ban outdoor smoking. Labour knows nothing about running a business. Labour cares nothing about the people who create wealth. Economic growth, Keir? Don’t make me chortle mirthlessly. Labour may have just called last orders for the great British pub. SAVOUR A TASTY MARCEL MARCEL PROUST, took one bite of the madeleine cakes he loved as a boy and the taste triggered memories that resulted in his seven-volume memoir, In Search Of Lost Time. A lot of people feel the same way about Angel Delight. And beans on toast. And Arctic Roll, Curly Wurlys, rice pudding, fish fingers, Wall’s Viennetta, jam roly-poly, sponge pud, toffee apples and Alphabetti spaghetti. A poll of 2,000 adults named all these treats as nostalgia-inducing foods that can transport us back to our childhood and bring back memories more profoundly than a photo. I searched the list in vain for the dish that reminds me most strongly of being a kid: Toad in the hole. But it’s not there, though everything else seems to be, including Wagon Wheels, eggs with “soldiers”, candyfloss, rhubarb and custard sweets and fairy cakes. Toad in the hole was pork sausages embedded in Yorkshire pudding. Just one bite would transport me to Billericay in the Sixties. And if ever I want inspiration for a seven-volume auto- biographical novel, I will not be reaching for a Curly Wurly. THE question journalists keep asking Ridley Scott, 86, is: Why doesn’t Russell Crowe appear in your sequel, Gladiator II? Anyone expecting Russell to show his face in -Gladiator II must have missed what happened to Maximus at the end of the first film. STROP TRUMP ABBA have instructed Donald Trump to stop using their music at his campaign rallies. And it’s not just one song – it’s Dancing Queen, Money, Money, Money and Winner Takes It All. Knock it off, Don! There’s only one blonde bombshell those songs need – and it’s Agnetha Faltskog. And has Trump seen the way Kamala Harris is shooting up the polls? If Don uses any banging Abba tune, it should surely be SOS. Who’s that old chap on Zoe’s arm? IT is strange to still hear Zoe Kravitz being routinely called “the daughter of Lenny Kravitz” – as if that is the thing Zoe is best known for. But Zoe is 35 now. She wrote and directed the glossy psychological thriller Blink Twice, a box office smash. As an actress she more than held her own with Nicole Kidman and Reese Witherspoon in Big Little Lies. She was the best-ever Catwoman, in The Batman. It was heart-warming to see Zoe walked down the red carpet of the Blink Twice premiere on the arm of her funky old dad. But Lenny is 60 now. Are You Going To Go My Way was more than 30 years ago. It is about time to start calling Lenny “the father of Zoe Kravitz”. RAD TO WORSE EMMA RADUCANU tearfully crashes out of the US Open in the first round – a tournament she fabulously won as a teen – and the vultures immediately circle, tut-tutting about her lucrative sponsorship deals as if they were the reason for her slide in form. Emma should not be in tears or made to feel bad because she gets knocked out of a Grand Slam. She has time – years and years – to come back and become a Grand Slam champion again if she wants it badly enough. Whatever happens next, she is the most successful British women’s tennis player in our lifetime. And she is still only 21. Give the kid a break. GOOD ENOUGH FOR EU AS the Prime Minister hugged and kissed his way across Germany and France, we kept hearing that Brexit is about to be “betrayed”. What part of Brexit would that be? The part of Brexit that gave us back control of our borders? Or the part that secured a lucrative UK-US trade deal? I think it makes sense for Keir Starmer to want to reset our relationship with the EU. But here’s the thing, Keir – do they want to reset with us? Right now the UK generously allows EU citizens to stroll into our country in the same immigration line as the British. This act of courtesy is not reciprocated. If we go to the EU, we are herded into the “all other passports” line. Senior politicians do not queue at airports, and this grotesque unfairness seems to have escaped their notice. But if you had your holidays in Europe this summer, I would bet my last euro that you and your family noticed. We treat EU citizens as friends and cherished guests. The EU treats the Brits as undesirables. It would be common courtesy for the EU to extend to the UK the privileges we extend to them. Yes, let’s have a better relationship with the EU. We should all aspire to get on with the neighbours. But do our neighbours want to get on with us?","summary":"","url":"https://www.thesun.co.uk/news/30190838/oasis-prince-william-harry-tony-parsons/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/08/2021-60th-birthday-princes-william-885235989_ad51f9.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-08-31 20:24:48","author":"Laura Goddard,Tony Parsons","authors":["Laura Goddard","Tony Parsons"],"language":"en","source_country":"gb","sentiment":0.078},{"id":255357376,"title":"Melania’s plea for Trump to control his swearing flops as he tears into Harris at rally","text":"Melania Trump’s apparent plea to her husband Donald Trump to control his language fell on deaf ears on Friday night when he torched Kamala Harris saying that everything she touches turns to “s**t.” The former president and Republican nominee attacked the vice president’s record before a crowd in Johnstown, Pennsylvania, claiming she doesn’t “have any common sense” before noting that both his wife and Reverend Franklin Graham have asked him to not use “foul” language. Trump continued: “They believe in an ideology and – if you look at Kamala and you look at what she’s done to every place she’s touched has turned to s**t. Every single place she’s touched. I have to say, it. Every place she’s touched, you know?” He then said: “You might have heard this, Franklin Graham is wonderful and he wrote me a letter and he said, ‘Sir, I love your stories, and I love listening to your rallies, but could you please don’t use foul language? Your speeches would be even better if you didn’t use foul language.’” Explaining that he nevertheless sometimes uses “foul language” to make a point, Trump said: “But there’s an example. It’s not really that bad a word, but how can you top that word for what I’m talking about? Right? What word? “Every place she touches wouldn’t be nice. People would – that would be a thud. It would land with a thud. “No, and Franklin is probably right. I’m not sure I agree with him. But he’s a great guy, actually. But he did say that to me.” Rev Graham is not the only person who has apparently pleaded with the former president to maintain some decorum in his campaign speeches. Trump said that while he tries to avoid swearing to appease Graham, he has also been warned off it by the former first lady. He told the crowd: “My wife also, she says, ‘Please don’t use foul language.’ But it’s hard. You know, there’s some words that can’t be duplicated. They can’t. I try, but it can’t be duplicated.” It’s not the first time expletives have crept into this year’s election. In May, Vice President Harris was speaking at a summit for Asia, Native Hawaiian, and Pacific Islander Americans, discussing being of mixed Black and Indian heritage. She told the audience: “We have to know that sometimes, people will open the door for you and leave it open, sometimes they won’t. “And then you need to kick that f**king door down.” The sentiment was greeted with big cheers from the crowd before Harris laughed and apologized: “Excuse my language.”","url":"https://www.yahoo.com/news/melania-plea-trump-control-swearing-202341688.html","image":"https://media.zenfs.com/en/the_independent_635/6e60a0ed7bc1abae684d381ebb149ef2","video":null,"publish_date":"2024-08-31 20:23:41","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.187},{"id":255354562,"title":"Melania’s plea for Trump to control his swearing flops as he tears into Harris at rally","text":"Melania Trump’s apparent plea to her husband Donald Trump to control his language fell on deaf ears on Friday night when he torched Kamala Harris saying that everything she touches turns to “s**t.” The former president and Republican nominee attacked the vice president’s record before a crowd in Johnstown, Pennsylvania, claiming she doesn’t “have any common sense” before noting that both his wife and Reverend Franklin Graham have asked him to not use “foul” language. Trump continued: “They believe in an ideology and – if you look at Kamala and you look at what she’s done to every place she’s touched has turned to s**t. Every single place she’s touched. I have to say, it. Every place she’s touched, you know?” He then said: “You might have heard this, Franklin Graham is wonderful and he wrote me a letter and he said, ‘Sir, I love your stories, and I love listening to your rallies, but could you please don’t use foul language? Your speeches would be even better if you didn’t use foul language.’” Explaining that he nevertheless sometimes uses “foul language” to make a point, Trump said: “But there’s an example. It’s not really that bad a word, but how can you top that word for what I’m talking about? Right? What word? “Every place she touches wouldn’t be nice. People would – that would be a thud. It would land with a thud. “No, and Franklin is probably right. I’m not sure I agree with him. But he’s a great guy, actually. But he did say that to me.” Rev Graham is not the only person who has apparently pleaded with the former president to maintain some decorum in his campaign speeches. Trump said that while he tries to avoid swearing to appease Graham, he has also been warned off it by the former first lady. He told the crowd: “My wife also, she says, ‘Please don’t use foul language.’ But it’s hard. You know, there’s some words that can’t be duplicated. They can’t. I try, but it can’t be duplicated.” It’s not the first time expletives have crept into this year’s election. In May, Vice President Harris was speaking at a summit for Asia, Native Hawaiian, and Pacific Islander Americans, discussing being of mixed Black and Indian heritage. She told the audience: “We have to know that sometimes, people will open the door for you and leave it open, sometimes they won’t. “And then you need to kick that f**king door down.” The sentiment was greeted with big cheers from the crowd before Harris laughed and apologized: “Excuse my language.”","summary":"Former first lady and Rev Franklin Graham have asked Trump to control his language, he told a crowd in Johnstown, Pennsylvania","url":"https://www.independent.co.uk/news/world/americas/us-politics/melania-trump-donald-rally-swearing-harris-b2605054.html","image":"https://static.independent.co.uk/2024/08/31/20/SEI219364989.jpg?width=1200","video":null,"publish_date":"2024-08-31 20:23:41","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.187},{"id":255360688,"title":"Donald Trump makes shocking show of support for legalizing marijuana in Florida but promises he will be ‘tough on crime’","text":"DONALD Trump signaled his support for the legalization of marijuana in a surprising post on his social media platform, Truth Social. The GOP presidential candidate said on Saturday that Floridians should accept a ballot measure that would legalize cannabis in the state. The proposed amendment will allow \"adults 21 years or older to possess, purchase, or use marijuana products and marijuana accessories for non-medical personal consumption by smoking, ingestion, or otherwise.\" Florida voters will have the chance to vote for the new amendment this November. If at least 60% of voters vote in favor of the law, the state will become the 25th state to legalize the use of recreational marijuana. Trump, who deemed himself the \"law & order\" candidate, posted that the legalization will happen whether \"people like it or not,\" although he stopped short of officially endorsing it. \"As everyone knows, I was, and will be again, the most respected LAW & ORDER President in U.S. History. We will take our streets back by being tough & smart on violent, & all other types, of Crime,\" he wrote. \"In Florida, like so many other States that have already given their approval, personal amounts of marijuana will be legalized for adults with Amendment 3. \"Whether people like it or not, this will happen through the approval of the Voters, so it should be done correctly.\" The business mogul explained that if the substance was going to be legalized, there needed to be strict laws controlling its use. \"We need the State Legislature to responsibly create laws that prohibit the use of it in public spaces, so we do not smell marijuana everywhere we go, like we do in many of the Democrat run Cities. At the same time, someone should not be a criminal in Florida, when this is legal in so many other States. \"We do not need to ruin lives & waste Taxpayer Dollars arresting adults with personal amounts of it on them, and no one should grieve a loved one because they died from fentanyl laced marijuana. \"We will make America SAFE again!\" he ended his post. This is the closest the former president has come to taking a stance on the Florida ballot measure, which he will have the opportunity to vote for in November. When the billionaire first ran for president in 2016, he said there were good and bad things about legalizing the drug. \"Because in some ways I think it’s good [to legalize marijuana] and in other ways it’s bad,\" he told Bill O'Reilly during a 2016 appearance. \"I do want to see what the medical effects are. I have to see what the medical effects are and, by the way — medical marijuana, medical? I’m in favor of it a hundred percent.” Trump's semi-favorable position on the ballot measure, known as Amendment 3, more closely aligns with opponent Kamala Harris and contrasts his Republican peer Governor Ron DeSantis, who opposes the legislation. Harris has previously joked about smoking the drug, and said it's absurd that the government classifies marijuana as worse than fentanyl, The Associated Press reported. DeSantis, on the other hand, has taken a more harsh stance against the legalization of marijuana, and Florida's proposed Amendment 3. During a press conference on July 21, DeSantis publicly opposed the ballot, ABC affiliate WEAR reported. \"I'm not for it, I don't think it's good to do,\" DeSantis said. \"I don't think we need to mess up the state.\" The governor argued that the legalization of marijuana would lead to streets that reeked of the drug leading to a lower quality of life. \"You go to places like Denver and it smells like marijuana,\" he added. \"It's not been good for quality of life.\" Republican billionaire Ken Griffin denounced Amendment 3 in an op-ed he wrote for The Miami Herald earlier this month. Griffin called the ballot \"a terrible plan to create the nation’s most expansive and destructive marijuana laws,\" and said he donated over $20 million to candidates who are fighting against the drug's legalization. \"Passage of Amendment 3 would create a monopoly for large marijuana dispensaries and permit pot use in public and private areas throughout Florida,\" he claimed. \"That will help no one other than special interests— and it will hurt us all, especially through more dangerous roads, a higher risk of addiction among our youth, and an increase in crime.\"","summary":"","url":"https://www.thesun.ie/news/13729073/donald-trum-marijuana-legalization-florida/","image":"https://www.thesun.ie/wp-content/uploads/sites/3/2024/09/AB-TW-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-08-31 20:17:10","author":"Charlotte Maracina","authors":["Charlotte Maracina"],"language":"en","catgory":"politics","source_country":"ie","sentiment":-0.185},{"id":255361236,"title":"Donald Trump makes shocking show of support for legalizing marijuana in Florida but promises he will be ‘tough on crime’","text":"DONALD Trump signaled his support for the legalization of marijuana in a surprising post on his social media platform, Truth Social. The GOP presidential candidate said on Saturday that Floridians should accept a ballot measure that would legalize cannabis in the state. The proposed amendment will allow \"adults 21 years or older to possess, purchase, or use marijuana products and marijuana accessories for non-medical personal consumption by smoking, ingestion, or otherwise.\" Florida voters will have the chance to vote for the new amendment this November. If at least 60% of voters vote in favor of the law, the state will become the 25th state to legalize the use of recreational marijuana. Trump, who deemed himself the \"law & order\" candidate, posted that the legalization will happen whether \"people like it or not,\" although he stopped short of officially endorsing it. \"As everyone knows, I was, and will be again, the most respected LAW & ORDER President in U.S. History. We will take our streets back by being tough & smart on violent, & all other types, of Crime,\" he wrote. \"In Florida, like so many other States that have already given their approval, personal amounts of marijuana will be legalized for adults with Amendment 3. \"Whether people like it or not, this will happen through the approval of the Voters, so it should be done correctly.\" The business mogul explained that if the substance was going to be legalized, there needed to be strict laws controlling its use. \"We need the State Legislature to responsibly create laws that prohibit the use of it in public spaces, so we do not smell marijuana everywhere we go, like we do in many of the Democrat run Cities. At the same time, someone should not be a criminal in Florida, when this is legal in so many other States. \"We do not need to ruin lives & waste Taxpayer Dollars arresting adults with personal amounts of it on them, and no one should grieve a loved one because they died from fentanyl laced marijuana. \"We will make America SAFE again!\" he ended his post. This is the closest the former president has come to taking a stance on the Florida ballot measure, which he will have the opportunity to vote for in November. When the billionaire first ran for president in 2016, he said there were good and bad things about legalizing the drug. \"Because in some ways I think it’s good [to legalize marijuana] and in other ways it’s bad,\" he told Bill O'Reilly during a 2016 appearance. \"I do want to see what the medical effects are. I have to see what the medical effects are and, by the way — medical marijuana, medical? I’m in favor of it a hundred percent.” Trump's semi-favorable position on the ballot measure, known as Amendment 3, more closely aligns with opponent Kamala Harris and contrasts his Republican peer Governor Ron DeSantis, who opposes the legislation. Harris has previously joked about smoking the drug, and said it's absurd that the government classifies marijuana as worse than fentanyl, The Associated Press reported. DeSantis, on the other hand, has taken a more harsh stance against the legalization of marijuana, and Florida's proposed Amendment 3. During a press conference on July 21, DeSantis publicly opposed the ballot, ABC affiliate WEAR reported. \"I'm not for it, I don't think it's good to do,\" DeSantis said. \"I don't think we need to mess up the state.\" The governor argued that the legalization of marijuana would lead to streets that reeked of the drug leading to a lower quality of life. \"You go to places like Denver and it smells like marijuana,\" he added. \"It's not been good for quality of life.\" Republican billionaire Ken Griffin denounced Amendment 3 in an op-ed he wrote for The Miami Herald earlier this month. Griffin called the ballot \"a terrible plan to create the nation’s most expansive and destructive marijuana laws,\" and said he donated over $20 million to candidates who are fighting against the drug's legalization. \"Passage of Amendment 3 would create a monopoly for large marijuana dispensaries and permit pot use in public and private areas throughout Florida,\" he claimed. \"That will help no one other than special interests— and it will hurt us all, especially through more dangerous roads, a higher risk of addiction among our youth, and an increase in crime.\"","summary":"","url":"https://www.thescottishsun.co.uk/news/13459369/donald-trum-marijuana-legalization-florida/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2024/09/AB-TW-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-08-31 20:17:10","author":"Charlotte Maracina","authors":["Charlotte Maracina"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.185},{"id":255353818,"title":"Kamala Harris Gets Worrying Sign in Critical Swing State: New Poll","text":"Vice President Kamala Harris got a worrying sign in Michigan, a critical swing state in November's election, in a poll released on Friday.While it remains a close race between Trump, the GOP's presidential nominee, and Harris, the vice president has been doing better in Michigan for the past month. Harris was nominated to be the Democratic Party's nominee after President Joe Biden dropped out of the race on July 21. However, a new poll shows that the former president is ahead of Harris by 1 point in the battleground state.A survey conducted between August 23 and 26 by EPIC MRA, a polling firm in Michigan, found that 47 percent of the 600 respondents polled would vote for Trump and 46 percent would vote for Harris. However, the poll has a margin of error of plus or minus 4 percent, meaning that the results represent a statistical tie.The poll had a fairly even mix of Republicans and Democrats. A total of 43 percent of respondents identified themselves as Republicans while 41 percent identified as Democrats. Thirteen percent identified as independent.Newsweek has reached out to Trump's and Harris' campaigns via email for comment on Saturday afternoon.On average, Harris still leads Trump by over two points in Michigan (46.6 to 44.1 percent), according to poll aggregator FiveThirtyEight. Trump was ahead of Harris until July 30 when the vice president jumped 1.7 points ahead of him. For the past month, she has been slightly increasing her lead for the most part, reaching a high of plus 3.4 points at times. However, this lead has been slightly decreasing since Thursday.Battleground states, including Michigan, will play a key role in determining the result of this year's election due to the Electoral College, which awards each state a certain number of electoral votes based on population. A presidential candidate needs to secure 270 electoral votes for victory, and winning the national popular vote does not guarantee success. Surveys from battleground states may be more telling than those of national polls.The Silver Bulletin Presidential Model also has Harris ahead of Trump in Michigan. According to the model's polling averages, the vice president leads Trump by 1.9 points (48.3 to 46.4 percent).How Does Harris Fare in Other Swing States?Harris leads Trump by 1.3 points in Pennsylvania (48.2 to 46.9 percent), by 0.9 points in Georgia (48.3 to 47.4 percent), by 3.2 points in Wisconsin (49.4 to 46.2 percent) and by 0.9 points in Nevada (48.6 to 47.7 percent), according to the Silver Bulletin's polling averages.Meanwhile, Trump is ahead of Harris by 0.4 points in North Carolina (48.4 to 48 percent) and by 0.6 points in Arizona (48.5 to 47.9 percent).How Are Both Nominees Doing Nationally?Harris is currently beating Trump on the national stage by 3.5 points. The Silver Bulletin has the vice president with 49.1 percent of the vote and Trump with 45.6.","summary":"While it remains a close race between Donald Trump and Harris, she has been doing better in Michigan for the past month.","url":"https://www.newsweek.com/donald-trump-kamala-harris-michigan-poll-1947138","image":"https://d.newsweek.com/en/full/2461967/harris.jpg","video":null,"publish_date":"2024-08-31 20:06:32","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.095},{"id":255353970,"title":"Moms for Liberty fully embraces Trump and widens role in national politics as election nears","text":"WASHINGTON (AP) — In her welcoming remarks at Moms for Liberty’s annual gathering in the nation’s capital on Friday, the group’s co-founder, Tiffany Justice, urged members to “fight like a mother” against the Democratic presidential ticket. Later that evening, after she had interviewed Republican nominee Donald Trump onstage, she made a point to say she was personally endorsing him for the presidency. Their talk show style chat was preceded by a “Trump, Trump, Trump” chant from the audience. The weekend’s gathering, drawing parent activists from across the country, has showcased how Moms for Liberty has moved toward fully embracing Trump and his political messaging as November’s election draws nearer. The group is officially a nonpartisan nonprofit that says it’s open to anyone who wants parents to have a greater say in their children’s education, yet there was little pretense about which side of the nation’s political divide it has chosen. A painting that was prominently displayed on an easel next to the security station attendees had to pass through before being allowed into the conference area showed Vice President Kamala Harris kneeling over a bald eagle carcass, a communist symbol on her jacket and her mouth dripping with blood. A Moms for Liberty spokeswoman said she hadn’t seen the gruesome painting and noted that the only official signage for the event included the group’s logo. The group’s enthusiasm for Trump is likely to benefit the former president this fall by solidifying a key part of his base — parents who share his views that the U.S. Education Department is bloated and ineffective, equity programs are distracting from academic fundamentals, vaccine mandates violate parental rights and schools that accept transgender children are putting other students in danger. But it’s much less clear how Moms for Liberty’s support for Trump and his agenda will affect races for local school boards, which have become some of the most contentious elections on many ballots since 2022, the year after the group was founded. Many communities where Moms for Liberty candidates took over a majority of the school board have been frustrated by their laser-like focus on removing books, questioning lessons around race and rejecting LGBTQ+ identities. A lack of progress toward academic improvement has in turn led to a counter movement among more moderate and liberal parents and teachers unions. Moms for Liberty says it won’t make an official endorsement in the presidential race, but it isn’t shying away from getting involved. The group’s founders recently wrote an open letter to parents warning that Harris and her running mate, Minnesota Gov. Tim Walz, a former high school social studies teacher, would be “the most anti-parent, extremist government America has ever known.” The group spent its first three years becoming synonymous with the “parents’ rights” movement in local school boards but recently has become more involved in national politics. It participated in the controversial conservative blueprint for the next Republican administration, Project 2025, as a member of its advisory board. The group also has invested more than $3 million in four crucial presidential swing states. The money has paid for advertising in Arizona, Georgia, North Carolina and Wisconsin, including messages critical of the Biden administration. Justice said the advertising has helped increase Moms for Liberty membership in those states and mobilized members who were not previously politically active to register to vote. “I think you’re going to see a lot of new voters who understand now that their vote and their voice matters,” she said in an interview. She added that as the group continues to endorse in local school board races, she is encouraged by Florida’s recent primary in which 60% of Moms for Liberty-backed candidates — some running for office for the first time — advanced to this fall’s general election. But countering those wins were undeniable losses for the group, among them two in heavily Republican Sarasota County, and two in Pinellas County, where a Moms for Liberty-backed candidate coasted to a school board seat two years ago. Those results come after conservative candidates struggled to gain traction with voters in local school board elections across the country last fall. In that election, Moms for Liberty said just 40% of its endorsed candidates won. Jonathan Collins, co-director of the politics and education program at Columbia University’s Teachers College, said parents’ rights candidates may be struggling around the country because they are focused on removing existing policies and classroom materials, rather than offering a clear, forward-looking plan to remedy pandemic learning loss. “They’re not getting beaten by people who are responding to the cultural attacks with their own cultural attacks,” he said. “They’re getting beat by people who are responding to the cultural attacks with very, very practical, hyperlocal ideas of school and district improvement.” Around the country, some school board members backed by Moms for Liberty or who carry out the group’s agenda have been recalled in recent months by community members who say their policies have caused chaos. In Woodland, California, north of the state capital, a school board member backed by Moms for Liberty members was recalled in March after she raised fears that children were coming out as transgender “as a result of social contagion ” during a school board meeting in 2023. In Southern California, a trustee with the Temecula Valley Unified School District Board of Education was recalled after he and two of his colleagues voted to reject a social studies curriculum because it included a history of the gay rights movement. And in Idaho’s heavily Republican panhandle, community members from across the political spectrum rose up to recall two right-wing members of their board last year who sought to root out critical race theory and institute a conservative agenda. Katie Blaxberg, a Pinellas County candidate who will run against the one remaining Moms for Liberty-linked candidate for that county’s school board this fall, said the “nastiness” and “divisiveness” of the group “isn’t conducive to any sort of good work.” But a group of more than 600 Moms for Liberty supporters exchanging phone numbers and listening attentively to slide presentations in Washington on Friday offered a different perspective. Gretchen Schmid, the chair of a Moms for Liberty chapter in Orange County, North Carolina, said her chapter helped advocate a new parents’ bill of rights law in her state. It passed last year after the Legislature, which is heavily gerrymandered to favor Republicans, overrode the Democratic governor’s veto. Schmid said when parents used to call and ask schools to share information about assignments, they wouldn’t hear back, but now, “people are getting more responses.” On Saturday, Moms for Liberty’s four-day summit paused sessions during the day to hold a demonstration a mile away, organized by a coalition of more than 30 conservative groups. Donning yellow rhinestone visors, Rachel Mack and Sarah Recupero said they had made the drive from Florida to support the protection of all children, especially in sports. “I am definitely somebody who stands for the whole women-in-women’s sports and men-in-men’s sports,” Mack said. Several blocks away, those opposed to Moms for Liberty held a competing event, a Celebration of Reading, to counter book banning and advocate for a more inclusive environment for children. Heidi Ross traveled from Buckeye, Arizona, to volunteer for the event after seeing a post on Facebook about it. “I have a granddaughter who’s two, and I want her to grow up in a world where she can read whatever she wants to read and no one bothers her or makes a fuss about it,” she said. “So, I hopped on that plane, really for her and all children.” ___ Associated Press writer Kate Payne in Tallahassee, Florida, contributed to this report. ___ The Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content.","summary":"WASHINGTON (AP) — In her welcoming remarks at Moms for Liberty’s annual gathering in the nation’s capital on Friday, the group’s co-founder, Tiffany Justice, urged members to “fight like a mother” against the Democratic presidential ticket.","url":"https://www.thestar.com/news/world/united-states/moms-for-liberty-fully-embraces-trump-and-widens-role-in-national-politics-as-election-nears/article_96e54cc4-474e-59e2-94ba-58128f8e1d5a.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/6/6e/66e4ed9f-08ef-50fa-a531-135421fa9bc6/66d378992596a.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2024-08-31 20:05:14","author":"Ali Swenson,Moriah Balingit And Ayanna Alexander The Associated Press,Wire Content","authors":["Ali Swenson","Moriah Balingit And Ayanna Alexander The Associated Press","Wire Content"],"language":"en","catgory":"politics","source_country":"CA","sentiment":0.197},{"id":255354572,"title":"Kamala Harris says Trump ‘disrespected sacred ground’ during Arlington cemetery visit","text":"Vice President Kamala Harris condemned former President Donald Trump on Monday for his actions at Arlington National Cemetery, accusing him of disrespecting the solemn site for a political stunt. Harris's remarks were made in a post on X, where she expressed her dismay over the incident involving Trump and his campaign team during a visit to the cemetery.The controversy stems from an incident where Trump's campaign staff allegedly pushed aside a cemetery staff member to capture photos and videos with families of service members who died during the U.S. military's withdrawal from Afghanistan. Harris criticized Trump, stating, \"If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honored, never disparaged, and treated with nothing less than our highest respect and gratitude.\"Trump defended his actions, claiming that the families requested the photos and that he did not intend to use the visit for political gain. However, Harris's call for Trump to \"never again stand behind the seal of the President of the United States of America\" underscored her belief that the former president's behavior was inappropriate for such a hallowed place.The incident has sparked widespread debate, with Democrats urging a thorough investigation into the actions of Trump's campaign staff.(Sources: Agence France-Presse, Alexandra Marquez, ABC News; The Guardian)","summary":"","url":"https://tribune.net.ph/2024/08/31/kamala-harris-says-trump-disrespected-sacred-ground-during-arlington-cemetery-visit","image":"https://media.assettype.com/tribune/2024-08-31/irs24csv/063_2169592633.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2024-08-31 20:04:25","author":"TDT","authors":["TDT"],"language":"en","catgory":"politics","source_country":"ph","sentiment":-0.307},{"id":255353854,"title":"Harris: Trump 'Disrespected Sacred Ground' At US Military Cemetery","text":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump \"disrespected sacred ground\" at a US military cemetery during a contentious pre-election visit.Trump's presence at the hallowed Arlington National Cemetery -- intended to provide a campaign boost ahead of the November 5 vote -- has instead mushroomed into a public dispute consuming the candidates and the military.\"Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,\" Harris said of Monday's incident at the cemetery near Washington, where Trump defied the rules and posed for photos with relatives of US service members killed in Afghanistan.In one image, he is standing with family members of a fallen Marine, posing among headstones while grinning broadly and giving a thumbs-up.\"If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honored, never disparaged, and treated with nothing less than our highest respect and gratitude,\" Harris wrote on X.On Thursday, the US Army issued a rare statement confirming that a cemetery staff member had been \"abruptly pushed aside\" after asking Trump's team to stop filming in a burial section for those killed in recent wars, where photography for political purposes is banned.Trump's campaign team has gone on the offensive by describing the employee as a \"despicable individual\" and claiming she was suffering a mental health episode. But the military said the staff member had \"acted with professionalism\" and it condemned the incident as \"unfortunate.\"Trump has made criticism of the Biden-Harris administration's handling of the US retreat from Afghanistan a keynote of his campaign, arguing that he would have managed it better.He visited the cemetery with families of some of the 13 service members killed in a 2021 bombing in Kabul during the last, chaotic hours of the US withdrawal.Trump's relationship with the military has long spawned controversy.While often touting his support for the armed forces, he privately mocked the war dead while he was president and did not want to be seen near military amputees, according to his former chief of staff.Harris's blunt response Saturday over the cemetery incident appeared to underline her determination to take the fight directly to Trump in what is shaping up to be a bruising presidential election. Trump has repeatedly mocked Harris's name, intelligence, appearance and racial identity, while the Harris campaign has replied that the former president is \"weird,\" an aspiring dictator, and \"out of his mind.\" Harris earlier faced withering criticism over the cemetery incident from Trump's running mate, Senator J.D. Vance, who has launched a series of fierce attacks against the vice president.Apparently responding to a mistaken report that Harris had already reacted to the cemetery visit, Vance accused her of feigning outrage and said, \"She can go to hell.\"\"Don't focus on Donald Trump showing up to grieve with some people who lost their children. Focus on your own job. Don't do this fake outrage thing,\" he later told the Washington Post.At that point Harris had not publicly mentioned the cemetery visit.","summary":"Democratic presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump \"disrespected sacred ground\" at a US military cemetery during a contentious pre-election visit.","url":"https://www.ibtimes.com/harris-trump-disrespected-sacred-ground-us-military-cemetery-3741473","image":"https://d.ibtimes.com/en/full/4544798/democratic-presidential-candidate-kamala-harris-said-her-republican-rival-donald-trump.jpg","video":null,"publish_date":"2024-08-31 20:03:15","author":"Brian Knowlton","authors":["Brian Knowlton"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.081},{"id":255353790,"title":"Microexpressions Expert Reveals What Harris’ Face Was Saying in CNN Interview","text":"Vice President Kamala Harris said a lot during her interview alongside running mate Tim Walz with CNN’s Dana Bash. And a lot of it came through on her face, according to microexpressions expert Annie Särnblad. The Q&A session was Walz and Harris’ first joint interview, watched live by nearly 6 million viewers on Thursday night, and Bash covered a wide range of topics—most of them addressing claims made by her opponent, Donald Trump. In a series of analytic videos made exclusively for The Daily Beast, Särnblad said that upon reviewing the video for microexpressions, Harris seemed to be “growing in her confidence.”","summary":"CNN/YouTubeVice President Kamala Harris said a lot during her interview alongside running mate Tim Walz with CNN’s Dana Bash. And a lot of it came through on her face, according to microexpressions expert Annie Särnblad.The Q&amp;amp;A session was Walz...","url":"https://nation.lk/online/microexpressions-expert-reveals-what-harris-face-was-saying-in-cnn-interview-275465.html","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1528,w_2716,x_121,y_0/dpr_2.0/c_limit,w_585/fl_lossy,q_auto/Screenshot_2024-08-31_at_3.19.01_PM_z4aocw","video":null,"publish_date":"2024-08-31 20:00:04","author":null,"language":"en","source_country":"lk","sentiment":0.324},{"id":255353474,"title":"Kamala Harris' Chances of Beating Donald Trump in Texas, According to Polls","text":"Recent polls compiled by FiveThirtyEight suggest that while former President Donald Trump maintains a lead in Texas over Vice President Kamala Harris, this year's presidential race in the Lone Star State may be more competitive than initially anticipated.Most surveys conducted among likely voters in the state in June showed Trump with a significant lead over President Joe Biden. However, recent polls suggest that Harris, who became the Democratic nominee following Biden's withdrawal on July 21, may be narrowing the gap in Texas.A series of surveys conducted over the past few months show Trump consistently ahead of the vice president in Texas, though the margin varies. The most recent poll by Quantus Polls and News, conducted between August 29 and 30 among 1,000 registered voters, gives Trump an 8-point lead over Harris, 52 to 44 percent.This latest poll aligns with a trend observed in earlier surveys. A Public Policy Polling survey commissioned by Clean and Prosperous America, conducted between August 21 and 22, showed Trump leading by 5 points, with 49 percent support compared to Harris' 44 percent. An alternative model from the same pollster using different weighting showed a narrower 3-point lead for Trump.A key poll that has caught attention comes from the University of Houston Hobby School of Public Affairs and Texas Southern University's Barbara Jordan-Mickey Leland School of Public Affairs. This survey of 1,365 likely voters, conducted between August 5 and 16, shows Trump leading Harris by about five points, 49.5 percent to 44.6 percent.This represents a shift from an earlier poll by the same institutions conducted in June and July, which had shown Trump with a 9-point lead over Biden. The change suggests that Harris' entry into the race may have altered the dynamics in Texas.Newsweek has contacted the Harris campaign, as well as Trump's spokesperson, via email on Saturday for comment.The University of Houston Hobby School of Public Affairs and Texas Southern University's Barbara Jordan-Mickey Leland School of Public Affairs poll also revealed interesting voter movement. When resurveying 878 respondents from their June poll, researchers found that Trump retained 97 percent of his June vote, while Harris retained 96 percent of Biden's June vote. Notably, 44 percent of Robert F. Kennedy Jr. supporters switched to Harris compared to only 21 percent shifting to Trump.Kennedy Jr., an independent presidential candidate, dropped out of the race last week and endorsed Trump.Despite these signs of a tightening race, other polls still show Trump with a more substantial lead. An ActiVote survey of 400 likely voters, conducted between July 31 and August 13, had Trump ahead by seven points, 53 percent to Harris' 47 percent, in the Lone Star State.As it stands, Trump is leading by 6.6 points in Texas, according to Race to the White House's polling average. However, with several weeks to go before Election Day, both campaigns will be closely watching Texas, with its crucial 40 electoral votes, for any signs of shifting political winds.Texas has voted for the Republican candidate in every presidential election since 1980, but recent demographic changes and shifting political alignments have led some to consider it a potential battleground state.","summary":"With several weeks to go before Election Day, both campaigns will be closely watching the state for any signs of shifting political winds.","url":"https://www.newsweek.com/kamala-harris-chances-beating-donald-trump-texas-polls-1947135","image":"https://d.newsweek.com/en/full/2461987/kamala-harris.jpg","video":null,"publish_date":"2024-08-31 19:56:32","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.167},{"id":255354480,"title":"Watch: Trump mimics Musk; quips they 'can have a good hookup ... '","text":"Former President Donald Trump on Friday impersonated Tesla CEO Elon Musk discussing rocket development, which drew laughter from the crowd at annual Moms for Liberty event in washington, DC.Impersonating Musk, Trump said, \"With Elon, it's like, 'Well, you know, I'm working on a new stainless steel hub that will help us navigate around the engines much faster, because there's an issue with the type of engine going into space nowadays.’”— CollinRugg (@CollinRugg) He continued jokingly, “‘But in the end, I think we can have a good hookup because of the new foils that are coming up.’”Reflecting on Musk’s thought process, Trump added, \"I'm hearing everything that's going through his mind. But he's like, he's a super genius guy.\"The Republican presidential candidate also mentioned that Musk had given him a \"tremendous endorsement\" and described him as \"a very different kind of guy\" who thinks as he speaks.\"I'm a huge fan of his electric car; I think it's incredible,\" Trump said, though he also noted, \"I'm a big fan of electric, but they don't go far and they are expensive.\"Trump also hinted at another upcoming interview with the Tesla CEO after a recent one with Musk on X in mid-August.Donald Trump also criticised Vice President Kamala Harris, calling her a \"defective person\" at the event. He commented on Harris's limited media presence, saying that her lack of interviews was a reflection of her inadequacies.","summary":"During the Moms for Liberty event in Washington, DC, former President Donald Trump humorously imitated Tesla CEO Elon Musk discussing rocket development, calling Musk a 'super genius' and mentioning his endorsement. Trump shared his appreciation for electric cars but noted issues with cost and range. Trump also hinted at another upcoming interview with the Tesla CEO after a recent one with Musk on X in mid-August. He also criticized Vice President Kamala Harris, referring to her as a 'defective person' and highlighting her limited media presence as a reflection of her qualifications.","url":"https://timesofindia.indiatimes.com/world/us/im-working-on-a-new-stainless-steel-hub-donald-trump-mimics-elon-musk-at-moms-for-liberty-event/articleshow/112957003.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-112957048/112957048.jpg","video":null,"publish_date":"2024-08-31 19:53:32","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"IN","sentiment":0.086},{"id":255353944,"title":"Pro-Palestinian groups plan to protest Harris campaign stops","text":"WASHINGTON >> Kamala Harris’ strong support for Israel as it continues its war in Gaza is fueling calls for a fresh round of protests at campaign stops, universities and public events in the weeks ahead, activists told Reuters, describing what they said was her failure to listen to pro-Palestinian voices. Arab Americans, Muslims and their allies, shut out of a Democratic National Convention speaking slot in Chicago, plan to show up in force during Harris’ debate against Donald Trump in Philadelphia on Sept. 10 and in major cities and college campuses on the Oct. 7 anniversary of the Hamas attack. On Thursday, they interrupted Harris’ speech at a Savannah, Georgia rally. Since replacing President Joe Biden at the top of the Democratic ticket, Harris has made it clear she will not consider cutting arms sales to Israel, one of the main asks of pro-Palestinian groups. She reiterated the position in a Thursday interview with CNN, saying “No, we have to get a (ceasefire and hostage) deal done,” when asked about limiting weapons. Harris’ firmly stated position threatens to open the same cracks in the Democratic coalition that faced Biden before he ended his campaign on July 21, despite a huge surge in enthusiasm from Democrats when she took over the ticket. “That’s right. War crimes and genocide will continue,” Rep. Rashida Tlaib, a Democrat and the first Palestinian-American woman elected to Congress, said on X about Harris’ CNN interview. Campaign officials say Harris and top campaign officials have met with pro-Palestinian advocates, and approved space for a panel on the issue during the DNC. Harris has hired two officials in recent weeks to reach out to the Arab American and Muslim communities, but declined to make them available for interviews. Protests that roiled college campuses last spring are bubbling up in Michigan, Pennsylvania and other battleground states. Democratic party insiders fear Harris will lose needed votes in the Nov. 5 presidential election, which is expected to be decided by slim margins in a handful of states. Harris has pulled ahead of Republican Donald Trump nationally in most recent polls, but trails in some polls of battleground states that will decide the 2024 winner. Until now, she has mostly avoided the same protests over Gaza that shadowed Biden events, as likely voters hoped she would craft a foreign policy more empathetic to Palestinians. Ahmet Tekelioglu, executive director of the Council of American Islamic Relations-Philadelphia, said he expected thousands of protesters to show up on the day of the Harris-Trump debate. Student protesters made a noisy return to Columbia University in recent days, the epicenter of the pro-Palestinian student movement. Elena Nissan Thomas, 19, a student at Indiana University, who drove to Chicago to take part in a DNC protest, said she was ready to continue protesting as the school year begins. “I don’t understand Vice President Harris saying she supports a ceasefire and doing nothing to do an arms embargo,” she said. Political strategists estimate nearly a million Muslims cast a ballot in the 2020 presidential election, many of them concentrated in battleground states, with about 70% backing President Joe Biden. The war began on Oct. 7 when Hamas attacked Israel, killing about 1,200, according to Israeli tallies. Israel’s retaliatory strikes on Gaza, aided by U.S. support, have since killed 40,000 Palestinians, Gaza health officials say, displacing nearly its entire 2.3 million population and creating a famine crisis. Tanjina Islam, a delegate to the DNC from Georgia, said she wants to support Harris, but is devastated by the lack of concern for Palestinians. “Everybody is hurting. A lot of people are leaning towards the third party — Jewish Voice for Peace, students, Black Muslims, the Muslims, the Arabs. Everybody is hurting. And these are majority Democrat voters,” she said. “So if Harris loses Georgia, the only reason would be that people did not go out to vote, or people voted for the third party.”","summary":"WASHINGTON >> Kamala Harris&#8217; strong support for Israel as it continues its war in Gaza is fueling calls for a fresh round of protests at campaign stops, universities and public events in the weeks ahead, activists told Reuters, describing what they said was her failure to listen to pro-Palestinian voices.","url":"https://www.staradvertiser.com/2024/08/31/breaking-news/pro-palestinian-groups-plan-to-protest-harris-campaign-stops/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-30T194726Z_900723661_RC2CL9A2P5KX_RTRMADP_3_USA-ELECTION-HARRIS-PROTESTS.JPG","video":null,"publish_date":"2024-08-31 19:53:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.242},{"id":255358904,"title":"Microexpressions Expert Reveals What Harris’ Face Was Saying in CNN Interview","text":"Vice President Kamala Harris said a lot during her interview alongside running mate Tim Walz with CNN’s Dana Bash. And a lot of it came through on her face, according to microexpressions expert Annie Särnblad. The Q&A session was Walz and Harris’ first joint interview, watched live by nearly 6 million viewers on Thursday night, and Bash covered a wide range of topics—most of them addressing claims made by her opponent, Donald Trump. In a series of analytic videos made exclusively for The Daily Beast, Särnblad said that upon reviewing the video for microexpressions, Harris seemed to be “growing in her confidence.” “She is starting to look more presidential,” said Särnblad, adding that it appeared to be a “good decision to do this interview together with her running mate Tim Walz.” She explained, “Throughout the interview, she shows affection and support towards [Walz]. She lifts her chin in pride when she is looking at him several times, and she raises her infraorbital triangles, which are the balls of our cheeks, in happiness.” There were also moments in the interview in which Harris shows a “deepening of her nasolabial furrows, which we do when we feel discomfort,” Särnblad said. “So that makes sense in the context of this very high-stakes interview.” Walz showed shame in his facial expressions while answering questions about his previous drunk driving arrest. “He puckers his chin, tucks it, and closes his eyes,” Särnblad said. At another point in the interview, Särnblad noted that Harris made an expression of contempt while addressing claims that she plans to ban fracking. “Contempt with a one-sided smile that is tucked in her cheek, and a deepening of the nasolabial furrow,” she said. Särnblad has a master’s degree in cultural anthropology and is also certified in the Facial Action Coding System (FACS). In addition to TV appearances instructing on microexpressions, she conducts microexpressions workshops for CEOs and health care workers across the country. Microexpressions, she explained, are intimately tied to our evolutionary makeup, which makes them difficult to conceal. “They are involuntary, precede the thought process,” she said. “In other words, just like when we touch a hot pot on the stove and pull our hand back a split second before realizing that we’ve burnt ourselves, the microexpression comes just before the moment of cognition.” She added, “As a result, our faces leak the truth in our microexpressions, even when our words lie.” What’s more, these microexpressions are universal and specific to particular emotions, said Särnblad: “Regardless of geography, culture, language, gender, ethnicity and socialization, humans make the same microexpressions to express that specific emotion. Even people who are born blind make the same microexpressions.” Addressing Harris’ seemingly constant joyful temperament, Särnblad said there is more going on than what meets the eye. “The expression of joy is something that we can all use more of. It triggers endorphins in our own bodies both when we raise our cheeks in joy as well as when we see someone else’s cheeks rise,” explained Särnblad. “Interestingly, the smile itself isn’t necessary to show joy—a huge opening of the mouth in the shape that we can a smile isn’t necessarily happy. In order for joy to be present, there needs to also be a lift of the cheeks.” She added, “Joy is hugely underrated in power, persuasion, and influence. Since mood is contagious, many people would rather spend time in and around people who express happiness.” As for the big Sept. 10 debate between Trump and Harris on ABC, Särnblad advised audiences to watch the candidates’ faces, which should tell viewers everything. “The easiest way to catch someone’s microexpressions is to plant our gaze on the lower part of the person’s face,” she said. “This is because anger, fear, vulnerability, disgust, contempt, and many other facial expressions each have a unique location and movement on the lower face.” She added, “The only way to change our microexpressions is to change our thoughts so completely that our bodies fully believe the lie. I’ve been told that really good spies can do this. I’ve yet to see a politician capable of it.” Särnblad is the author of three books, Diary of a Human Lie Detector: Facial Expressions in Love, Lust, and Lies; The Facial Expressions Glossary: Business Version; and the recently released Annie and the Secret Language of Faces.","summary":"CNN/YouTubeVice President Kamala Harris said a lot during her interview alongside running mate Tim Walz with CNN’s Dana Bash. And a lot of it came through on her face, according to microexpressions expert Annie Särnblad.\n\nThe Q&A session was Walz and Harris’ first joint interview, watched live by nearly 6 million viewers on Thursday night, and Bash covered a wide range of topics—most of them addressing claims made by her opponent, Donald Trump.\n\nIn a series of analytic videos made exclusively for The Daily Beast, Särnblad said that upon reviewing the video for microexpressions, Harris seemed to be “growing in her confidence.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/microexpressions-expert-annie-sarnblad-analyzes-vp-kamala-harris-and-gov-tim-walz-cnn-interview","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1528,w_2716,x_121,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1725131952/Screenshot_2024-08-31_at_3.19.01_PM_z4aocw","video":null,"publish_date":"2024-08-31 19:52:47","author":"Emell Derra Adolphus","authors":["Emell Derra Adolphus"],"language":"en","source_country":"US","sentiment":0.212},{"id":255354996,"title":"In North Carolina, Democrats counting on young voters","text":"LAURINBURG, US — For several months, Yampiere Lugo has been going door to door, urging young people in North Carolina to vote in November. With Joe Biden's withdrawal from the race and Kamala Harris's arrival atop the Democratic ticket, the party activist says his generation, a key voting bloc, is fired up. \"I've talked to a lot of people around my age who have sort of all expressed the same sentiment, that they're just so much more excited to have someone who's just younger, more energetic,\" Lugo told AFP. The 25 year old, who works as an administrative assistant at a local school, says even people he thought might skip the election altogether have said the vice president has their support. The enthusiasm marks a sharp contrast with the situation Lugo was facing just over a month ago, when he was canvassing for Biden in Laurinburg, the seat of Scotland County, not far from the border with South Carolina. At the time, the activist admitted to AFP that young voters were \"frustrated\" with their options, facing a choice between the 81year old Biden and Donald Trump, the 78 year old Republican former president. Now, Lugo believes Harris, 59, can win North Carolina, one of a handful of swing states likely to play a pivotal role in the race for the White House. Winning here will be an uphill battle, the southern state has not voted for a Democrat in the presidential election since Barack Obama in 2008. \"North Carolina is going to have something to say in November,\" said Zach Finley, the president of the Young Democrats of North Carolina. But for Harris to turn the state Democratic blue, the party needs to campaign \"the right way, turning out the folks we need to\", added Finley, who is also 25. Excited On a national level, voters between the ages of 18 and 39 favoured Biden over Trump in 2020 by a margin of about 20 per centage points, according to the Pew Research Centre. Finley says the party needs to \"turn out young people who, especially in the last couple of years, have been really disincentivised\" by the political process. Democrats are getting out the vote the old-fashioned way in Scotland County, knocking on doors and talking to people. The rural area is one of the most hotly contested political battlefields in the country, Hillary Clinton bested Trump here in 2016, but the Republican bounced back to defeat Biden in 2020, by just 287 votes. In November, \"It's all about turnout,\" says Garland Pierce, a Democratic state representative and a Baptist pastor. \"That's what everybody's really depending on, is the young voters to really go to the polls. The lawmaker says Harris's somewhat surprise breakthrough into the race has galvanised voters in North Carolina. \"It appears that young people are really excited\" about her candidacy, he said, adding that the economy will be a key issue in the contest. Cost of things Pierce's prediction about the economy is shared by a number of young voters AFP met in the streets of Laurinburg, which is home to 15,000 residents. \"Everything used to be cheaper,\" laments Donnie Leviner, an 18 year old student with his own home renovation business. Before Biden won the White House, \"gas prices used to be way lower\", said Leviner, who added that he would vote for Trump in his first ever trip to a presidential voting booth. For Lucas Wylie, a 26-year-old engineer having a coffee at an outdoor cafe with his dog, young voters are \"very focused on the cost of things and affordability\". Wylie cited expensive housing and high interest rates as evidence of soaring prices, and said both would be important to him in November. Finley agreed. \"There's just a lot of pent-up anxiety being a young person in this country, not even being able to afford a home,\" he said. \"It's almost out of reach, especially in North Carolina.\" Finley said Democrats need to reassure young voters that they are attuned to their concerns, and ready to deliver solutions. Harris will need to convince young people that they will ultimately be able to \"achieve some form of the American dream”, and offer the same thing to the next generation, Finley said.","summary":"LAURINBURG, US — For several months, Yampiere Lugo has been going door to door, urging young people in North Carolina to vote in November.\n\n\nWith Joe Biden's withdrawal from the race and Kamala Harris's arrival atop the Democratic ticket, the party activist says his generation, a key voting bloc, is fired up.\n\n\n\"I've talked to a lot of people around my age who have sort of all expressed the same sentiment,  that they're just so much more excited to have someone who's just younger, more energetic,\" Lugo told AFP.\n\n\nThe 25 year old, who works as an administrative assistant at a local school, says even people he thought might skip the election altogether have said the vice president has their support.\n\n\nThe enthusiasm marks a sharp contrast with the situation Lugo was facing just over a month ago, when he was canvassing for Biden in Laurinburg, the seat of Scotland County, not far from the border with South Carolina.\n\n\nAt the time, the activist admitted to AFP that young voters were \"frustrated\" with their optio","url":"https://jordantimes.com/news/world/north-carolina-democrats-counting-young-voters","image":"https://jordantimes.com/sites/default/files/styles/thumbnail/public/Hasan%20Dajah.jpg?itok=sFRrnPpZ","video":null,"publish_date":"2024-08-31 19:49:00","author":"issa","authors":["issa"],"language":"en","catgory":"politics","source_country":"jo","sentiment":-0.246},{"id":255352986,"title":"New poll shows Harris’s lead over Trump cut in half in must-win swing state","text":"Kamala Harris’s lead in Minnesota has been halved by Donald Trump, one new survey shows, despite the state’s Governor Tim Walz joining the Democratic ticket. The most recent poll by SurveyUSA in conjunction with local TV networks KTSP, KAAL, and WDIO, has found that Harris is now leading Trump 48 per cent to 43 per cent in the must-win swing state. Though still healthy, her lead has shrunk to five percentage points in the space of a month, having led 50 per cent to 40 per cent in a poll conducted between July 23 and 25. The new poll surveyed 635 likely voters and has a margin of error of 4.5 percentage points. “I think you see in the national polls that Kamala Harris is getting sort of a post-convention bump,” Brian McClung, communications director for former Republican Governor Tim Pawlenty, said in a statement. “So the opposite has occurred in your SurveyUSA poll, but I think this is where we expect the race to be.” Former Minnesota DFL Party Chair Mike Erlandson agreed, saying the 10-point lead for Harris last month might have been the result of excitement about a shake-up in the race with President Joe Biden dropping out. “She’s in good shape in Minnesota, and frankly, the Democratic and Republican conventions happening, adding Tim Walz to the ballot, everybody’s paying attention now, right? So if I was those guys, I’d be excited to be up by five points in Minnesota.” The poll showed Harris was leading among women (55 to 37 per cent), independents (42 to 35 per cent), and voters from urban areas (57 to 34 per cent) and suburban areas (53 to 39 per cent). Trump meanwhile leads among men (48 to 42 per cent) and voters in rural areas (54 to 37 per cent). However, surveys conducted by Redfield & Wilton Strategies and The Telegraph at the beginning, middle, and end of August show the opposite trend to the SurveyUSA poll. They show Harris’s lead growing across the state from five percentage points to seven, and then nine points by August 29.","summary":"Excitement over vice president taking over Democratic Party ticket may have softened, though other polling shows lead growing in the North Star state","url":"https://www.independent.co.uk/news/world/americas/us-politics/harris-trump-new-poll-minnesota-walz-b2605045.html","image":"https://static.independent.co.uk/2024/08/23/19/11561041.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/4enQpNyM-4VHSaSK0.mp4","publish_date":"2024-08-31 19:39:36","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","source_country":"gb","sentiment":-0.52},{"id":255352684,"title":"Kamala Harris says Donald Trump ‘disrespected sacred ground’ at Arlington military cemetery","text":"Democratic US presidential candidate Kamala Harris said Saturday that her Republican rival Donald Trump “disrespected sacred ground” at a US military cemetery after reports that his campaign team pushed a staff member during a politicised visit. Trump’s cemetery visit – intended to provide a campaign boost ahead of November’s election – has instead mushroomed into a public dispute between the former US president and the military. “Let me be clear: the former president disrespected sacred ground, all for the sake of a political stunt,” Harris said of Monday’s incident at Arlington National Cemetery near Washington, where Trump was accompanying relatives of US service members killed in Afghanistan. “If there is one thing on which we as Americans can all agree, it is that our veterans, military families, and service members should be honoured, never disparaged, and treated with nothing less than our highest respect and gratitude,” Harris wrote on X. On Thursday, the US Army confirmed that a cemetery staff member had been pushed aside after asking Trump’s team to stop filming in a burial section for those killed in recent wars, where photography is banned. The military condemned the incident as “unfortunate”. As Vice President, I have had the privilege of visiting Arlington National Cemetery several times. It is a solemn place; a place where we come together to honor American heroes who have made the ultimate sacrifice in service of this nation. It is not a place for politics. And… — Kamala Harris (@KamalaHarris) August 31, 2024 Meanwhile, Trump’s campaign team has gone on the offensive by describing the employee as a “despicable individual” and claiming she was suffering a mental health episode. Trump has made criticism of Biden’s handling of the retreat from Afghanistan a keynote of his campaign, arguing that he would have managed it better. He attended the cemetery with families of some of the 13 service members killed in a 2021 bombing in Kabul during the last hours of the US withdrawal. After the visit to the Arlington cemetery, Trump’s campaign posted a photo of the former president standing with the relatives and giving a thumbs-up gesture. The uproar over the incident is the latest in a long line of controversies over Trump’s relationship with the military. While often touting his support for the armed forces, he privately mocked the war dead while he was president and did not want to be seen near military amputees, according to his former chief of staff.","summary":"The US Army says a cemetery employee was pushed after asking Trump’s team to stop filming in a burial section where photography is banned.","url":"https://www.scmp.com/news/world/united-states-canada/article/3276718/kamala-harris-says-donald-trump-disrespected-sacred-ground-arlington-military-cemetery","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/09/01/f9fdcab6-c56b-40b1-b276-7aba0ceb63db_a801e2d6.jpg","video":null,"publish_date":"2024-08-31 19:31:31","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.229},{"id":255357540,"title":"Yes, Trump’s Debate Mic Should Be Muted—But Not For the Reason You Think","text":"On September 10, Vice President Kamala Harris and former President Donald Trump will debate each other for the first time. Amid weeks of contention over the debate’s rules, it has been reported that ABC News, the host network, informed both candidates’ camps that their microphones will be muted when the other is speaking. While Trump’s campaign has agreed to the terms, Harris’ camp reportedly has not. Both Harris and Trump (though not his team, as my colleague Julianne McShane has written) want to have unmuted mics. But ABC’s rules are not unprecedented—Trump and President Biden’s debate this summer also featured muted mics. Harris and her team’s argument for unmuted mics seems to rely on letting Trump embarrass himself: Speaking over a debate opponent when it is the other person’s turn to talk does not exactly look professional. But there is a more serious reason for Harris to reconsider her stance: ensuring that one person talks at a time will make the event more accessible to some disabled viewers. For people who need live captioning during the debate, constant changes in speakers are challenging to follow. In the UK, the BBC uses different colors to indicate different speakers when multiple people are talking—but US news networks have yet to catch up. It is also considered best practice for American Sign Language interpretation to only let one person speak at a time, which makes interpreters’ jobs more practical. More than 48 million Americans are hard-of-hearing, 11 million of whom are Deaf or have significant loss—not a small number of potential viewers. Captions can also be helpful for people with other disabilities, including conditions that affect cognition such as ADHD and Long Covid. Political debates can be informative—or just entertaining, if your mind is already made up. If Harris wants an easy win for disability rights, she doesn’t need to hold out on this rule.","summary":"On September 10, Vice President Kamala Harris and former President Donald Trump will debate each other for the first time. Amid weeks of contention over the debate&#8217;s rules, it has been reported that ABC News, the host network, informed both candidates&#8217; camps that their microphones will be muted when the other is speaking. While Trump&#8217;s [&#8230;]","url":"https://www.motherjones.com/politics/2024/08/trump-harris-debate-mic-muted-accessibility-hearing-loss/","image":"https://www.motherjones.com/wp-content/uploads/2024/08/pres-debate-accessibility_2000_B.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2024-08-31 19:30:30","author":"Julia Métraux","authors":["Julia Métraux"],"language":"en","source_country":"US","sentiment":0.199},{"id":255354680,"title":"New poll shows Harris eyeing victory in North Carolina as possible pick-up","text":"IE 11 is not supported. For an optimal experience visit our site on another browser. New poll shows Harris eyeing victory in North Carolina as possible pick-upAug. 31, 202404:50‘Astonishing!’: Breaking down the massive, organic surge in young voter registration04:51‘A wild day’: Film director recalls being at the January 6th riot after new documentary debut05:37‘Still a lot of ground to make’ up in critical Latino vote for Harris: NextGen America President06:43Now PlayingNew poll shows Harris eyeing victory in North Carolina as possible pick-up04:50UP NEXTStrategist breaks down how Harris looks to ‘rise above the attacks’ on her racial identity06:13‘It is bizarre!’ Political analyst reacts to Trump trying to change the tune of his abortion stance05:51How the “J6 Awards Gala” could hurt Trump’s legal defense: Former federal prosecutor explains05:13Middle class ‘wants to see the contrast’ between Harris and Trump at first debate: Rep. Crockett07:52Harris condemns Trump for incident at Arlington cemetery01:10Paving paradise: the controversial plan to develop protected Florida state parks04:48Pentagon orders two carrier strike groups to remain in Middle East04:56Congresswoman: ‘Patriotism is not owned by one party or the other. It is something that Americans feel.’ 04:43Strategist: ‘She is a once in a generation candidate.’ 08:57Cease-fire talks continue following Israeli airstrikes06:18Congresswoman on ceasefire: ‘It’s imperative that we do get to a deal, to save the remaining hostages.’06:43White House correspondent: ‘It was a capstone to what has been a whirlwind four plus weeks.’06:12Democrats reclaim patriotism at the DNC08:41‘That energy is truly magic,’ Democratic congressman from California09:20Fmr. Trump press secretary: 'I think giving our country the chance to be civil again is more important right now'07:10Former FBI Assistant Director: 'There are groups who are intent on disruption' at DNC in Chicago04:28Weekends with Alex WittNew poll shows Harris eyeing victory in North Carolina as possible pick-up04:50Share this -CopiedVice President Kamala Harris is eyeing victory in North Carolina as new polls give Democrats hope for their first victory in the state since 2008. NBC News' Steve Kornacki breaks down the Cook Political Report that is now marking the state as a \"toss up.\"Aug. 31, 2024‘Astonishing!’: Breaking down the massive, organic surge in young voter registration04:51‘A wild day’: Film director recalls being at the January 6th riot after new documentary debut05:37‘Still a lot of ground to make’ up in critical Latino vote for Harris: NextGen America President06:43Now PlayingNew poll shows Harris eyeing victory in North Carolina as possible pick-up04:50UP NEXTStrategist breaks down how Harris looks to ‘rise above the attacks’ on her racial identity06:13‘It is bizarre!’ Political analyst reacts to Trump trying to change the tune of his abortion stance05:51MSNBC HIGHLIGHTS (BEST OF MSNBC)Play AllAlex Wagner TonightTrump stuck playing defense after week of damaging mistakesAlex Wagner TonightClose polls belie contrary trends as Kamala Harris continues to strengthen and Trump strugglesThe Reidout‘¡Sí, se puede!’: Latino voter enthusiasm for Harris skyrockets over issues like housingAlex Wagner TonightDonald Trump chases politics and stabs evangelical supporters in the backThe Reidout‘Judicial system has failed’: How Supreme Court's ruling could help Trump delay justiceThe ReidoutTrump’s shocking IVF flip-flop: Desperate move 'to stay out of prison'?Play All","summary":"Vice President Kamala Harris is eyeing victory in North Carolina as new polls give Democrats hope for their first victory in the state since 2008. NBC News' Steve Kornacki breaks down the Cook Political Report that is now marking the state as a \"toss up.\"","url":"https://www.msnbc.com/weekends-with-alex-witt/watch/new-poll-shows-harris-eyeing-victory-in-north-carolina-as-possible-pick-up-218385477899","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2024_08/1725132508534_n_witt_brk_kornacki_cam_240831_1920x1080-izx4br.jpg","video":null,"publish_date":"2024-08-31 19:28:45","author":"Msnbc.com","authors":["Msnbc.com"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.118}]}