{"offset":0,"number":50,"available":721,"news":[{"id":377126510,"title":"College’s student government reverses block on TPUSA chapter","text":"A Colorado college student government reversed its decision to block a Turning Point USA (TPUSA) chapter during an emergency meeting on Friday night.\n\nThe Associated Students of Fort Lewis College (ASFLC) voted to approve the TPUSA chapter after previously rejecting senior Jonah Flynn’s proposal to register the group with the university.\n\n“It was strange. They put us in a tiny room, with at least 100 people being forced to wait outside. Tons of local conservatives, students and community members. Inside the meeting, we got to speak briefly, and they immediately voted and unanimously approved it,” Flynn told Fox News Digital.\n\nFlynn planned to appeal the decision to the student court because the vote to block the chapter seemed to be a violation of his constitutional rights.\n\nA spokesperson for Fort Lewis College told Fox News Digital Friday that the institution “is committed to fostering an inclusive, student-centered learning environment that values both free expression and responsible leadership.”\n\n“Following a review and rescission of its earlier decision, the Associated Students of Fort Lewis College voted to approve Turning Point USA as a Registered Student Organization (RSO) during an emergency meeting on Friday night,” Public Information Officer Nardy Baeza Bickel told Fox News Digital.\n\n“This outcome reflects ASFLC’s commitment to fair governance, educational growth, and consistent policy application. Recognition does not imply endorsement of any organization’s viewpoints; all RSOs are expected to follow college policies and uphold community standards,” Bickel explained further.\n\n“Fort Lewis College appreciates ASFLC’s leadership in addressing a complex issue and continues to support students in developing their understanding of free expression, inclusion, and civic responsibility,” she added.\n\nThe benefits of registering the TPUSA chapter on FLC’s campus is that organizers have access to the school’s facilities for events. \n\nFlynn hopes to host a larger event than the one he held before through TPUSA. \n\nFlynn was at the center of controversy when he sought to start a TPUSA chapter, prompting a petition that accused TPUSA of causing harm to students. \n\nCritics alleged that Flynn’s plan mirrored TPUSA’s national “professor watchlist,” which has faced backlash. \n\nThe Herald reported that only three people supported Flynn’s proposal to start a chapter.\n\nOn Oct. 17, a petition which was launched by the Fort Lewis College community garnered over 400 signatures, arguing that TPUSA “has engaged in actions that directly harm our community.” \n\n“At a college where many students identify as Indigenous, students of color, LGBTQ+, or from other underrepresented backgrounds, this harm cannot be ignored,” the petition reads. \n\n“We are calling on Fort Lewis College to take action that prioritizes student safety and well-being by refusing to recognize the TPUSA chapter as an RSO.”\n\nShortly after the chapter was denied, a counter-petition launched backing TPUSA, garnering over 1,000 signatures so far.\n\nFlynn stood before the ASFLC board as it voted against establishing a TPUSA chapter in front of a crowded room last week. The seven elected senators on the board blocked the chapter.\n\n“Many of our morals and interests must be pushed to the side,” said Asa Worthington, the student body president of the Associated Students of Fort Lewis College. \n\n“The safety of our student body and the FLC community has always been and always will be ASFLC’s top priority.”\n\nKirk’s debating style inspired Flynn, a Philosophy major, to start a TPUSA chapter. \n\nHis campus is located in La Plata County, which went heavily for Kamala Harris in 2024. \n\nKirk was assassinated on Sept. 10 while speaking at Utah Valley University, which has sparked a huge interest across the country to start new TPUSA chapters in high schools and colleges.\n\n“I was really upset by what happened to Charlie. I was just sort of mourning and emotional and upset about it. Then I decided that what we need to do is not sort of back down,” Flynn told Fox News Digital.","summary":"The Associated Students of Fort Lewis College (ASFLC) voted to approve the TPUSA chapter after previously rejecting senior Jonah Flynn’s proposal to register the group with the university.","url":"https://nypost.com/2025/11/08/media/colleges-student-government-reverses-block-on-tpusa-chapter/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/115040835.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/TyjXOQat-RyIcpnTz.mp4","publish_date":"2025-11-08 21:23:39","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.312},{"id":377113872,"title":"Joe Biden warns of a 'very, very dark moment' as he hits out at Trump","text":"NYT News ServiceJoe Biden speaks at the Nebraska Democratic Party Ben Nelson Gala at the Hilton Omaha in Omaha, Neb., Friday, Nov. 7, 2025. (Christopher Smith/The New York Times)\n\nFormer President Joe Biden lashed out Friday at his successor, delivering an impassioned address in which he warned that the country was in a \"very, very dark moment\" and said President Donald Trump had acted \"in a way that embarrasses us as a nation.\" Biden, speaking at a Nebraska Democratic Party fundraising dinner in Omaha, condemned Trump for \"deliberately making hunger worse for America\" and accused him of taking a \"wrecking ball\" to the White House, the Constitution and the rule of law while enriching his own family. \"The American people are sending a message, are sending the message -- message to Trump and to his crowd,\" Biden said, at times shouting or meandering as he often did during the later years of his presidency. \"I just want you to know, you work for us, Mr. President. We don't work for you.\" In his first overtly political speech since leaving office, Biden warned that the nation had slipped into difficult times -- but said this week's elections were a reason for optimism. \"Folks, look, this isn't a golden age,\" Biden said. \"The fact of the matter is that it is a very, very dark moment. But you know, the fact of the matter is, we're in a situation where we had something very special happen just last Tuesday.\"Live Events A White House official did not immediately respond to a request for comment. Since Biden left office, many Democrats have appeared eager to move on from him. He was absent from the recent campaigns for governor in New Jersey and Virginia, even as former President Barack Obama was invited to appear at arena rallies last weekend in those states. A handful of Democrats have visited his homes in Delaware, but few have chosen to publicize their meetings. Gov. Bob Ferguson of Washington state stopped to play chess with Biden last month, and Ken Martin, the chair of the Democratic National Committee, visited the former president the day after winning an election to lead the party apparatus. In his 30-minute remarks in Omaha, Biden, 82, cycled through some of his greatest hits. He spoke about how unions had helped build the middle class, exaggerated (\"I was on the Foreign Relations Committee when I was 24 years old\") and sprinkled a dozen instances of \"folks\" throughout his remarks. He called for reopening the federal government and ending the shutdown and spoke movingly about his experience battling prostate cancer. He saved his harshest criticisms of Trump for his cuts to funding for cancer research and other health care. \"I think it's immoral, it's un-American, it's flat out wrong,\" Biden said. \"You have to ask yourself: Why? Why in God's name are they doing this? Why? Well, I'll tell you why. They give away an additional $4 trillion in tax breaks to the benefit of the wealthiest people in America.\" Biden has not been a regular on the party's chicken-dinner or fundraising circuit, where donors are far more likely to be attracted by Obama or members of the vast field of potential 2028 presidential candidates. Nebraska is a rare spot where Biden is welcome, and he received a warm reception from the local Democrats, who waved \"Jomaha\" signs from the crowd. After he finished his speech, Biden remained onstage and was wrapped in a blanket by Native American tribal leaders from Nebraska. While Vice President Kamala Harris lost the seven battleground states, she carried Nebraska's competitive 2nd Congressional District, which includes Omaha. Before Biden spoke, Nebraska Democrats played a clip in which cable networks called him as the winner of the district's electoral vote from his 2020 election night. Nebraska is one of two states that award their presidential electoral votes by congressional district. While the former president has been spotted on occasion riding Amtrak, he has had few announced public appearances in recent months. In May, he sat for a poorly received interview on ABC's \"The View\" as he sought to beat back book revelations about his mental and physical decline while in office. The same month, Biden's aides announced that he had an aggressive form of prostate cancer. In September, he had surgery to remove skin cancer lesions from his forehead and began undergoing radiation therapy at Penn Medicine Radiation Oncology in Philadelphia.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onBiden speech 2023Trump criticismNebraska Democratic Partycancer research cutsprostate cancer fundingBiden warns of dark momentDemocratic National Committeefundraising dinner Omaha2028 presidential candidates\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onBiden speech 2023Trump criticismNebraska Democratic Partycancer research cutsprostate cancer fundingBiden warns of dark momentDemocratic National Committeefundraising dinner Omaha2028 presidential candidates(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"Former President Joe Biden delivered a strong speech in Nebraska. He criticized President Donald Trump's policies and actions. Biden stated the nation is in a \"dark moment\". He also highlighted recent election results as a reason for optimism. The former president's remarks touched on his past achievements and policy stances.","url":"https://economictimes.indiatimes.com/news/international/global-trends/joe-biden-warns-of-a-very-very-dark-moment-as-he-hits-out-at-trump/articleshow/125192173.cms","image":"https://img.etimg.com/thumb/msid-125192320,width-1200,height-630,imgsize-121168,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-08 19:26:08","author":"Reid J Epstein","authors":["Reid J Epstein"],"language":"en","source_country":"in","sentiment":-0.164},{"id":377126802,"title":"Bad News for Republicans, Warnings for Both Parties","text":"Virginia and New Jersey, the two states that voted for governor in 2025, both voted for then-Vice President Kamala Harris over then-candidate Donald Trump by 52%-46% margins in 2024. Democrats ran significantly better in both states on Tuesday. One reason is that Trump Republicans, as an increasingly downscale party, see their turnout sag in off years than when the presidency is up. But that wasn’t their only problem this time.\n\nIn Virginia, Democrat Abigail Spanberger, a former CIA officer and congresswoman, won 58%-42%, well ahead of her standing in most polls. Republicans who dismiss this result as reflecting the weakness of nominee Winsome Earle-Sears should note that Democrat Jay Jones beat incumbent Attorney General Jason Miyares 53%-47%, despite the Oct. 3 revelation of Jones’ text messages that he’d like to murder a colleague and see his children die in their mother’s arms.\n\nSome 46% of Virginia voters said this was disqualifying, but even some of them voted for Jones. Its evidence that hatred of Trump’s party runs deep among many Democrats.\n\nThe most significant swing from 2024 was in northern Virginia, part of metropolitan Washington, which cast 33% of the state’s votes. That’s a highly educated, upscale community with a high percentage of federal and government contractor employees, but Republicans would be unwise to dismiss the Democrat gains as just a response to the government shutdown. It could be a forecast of what’s in store for them in Montgomery County, Pennsylvania; Oakland County, Michigan; and Waukesha County, Wisconsin.\n\nIn New Jersey, Rep. Mikie Sherrill, D-New Jersey, a Navy veteran, beat Republican Jack Ciatarelli 56%-43%, a big improvement on incumbent Gov. Phil Murphy’s, D-New Jersey, 51%-48% squeaker against Ciatarelli four years ago. Sherrill’s majority looked much like the 57%-41% Democrat advantage in the 2012, 2016 and 2020 presidential elections, which caused it to seem a solid blue state.\n\nThe big difference is that Ciatarelli was unable to duplicate the big gains that Trump made among Hispanic voters. Trump carried heavily Hispanic Passaic County with 50%—it voted only 42% Republican this year. Similarly, in Virginia, even Miyares, despite his Hispanic ancestry, won only 37% in heavily Hispanic Prince William County.\n\nNew Jersey and Virginia also have large Asian populations. But Ciatarelli won only 37% in heavily South Asian Middlesex County, behind Trump’s 44%, and in heavily Asian Loudoun County, Virginia, Republican Winsome Earle-Sears’ 35% was below Trump’s 40%.\n\nHas the Trump administration’s rough-and-ready immigration enforcement hurt his fellow Republicans? Or are we just seeing sags in turnout from low-propensity voters in low-propensity constituencies, as we have in previous contests a year after their side wins, as Republican pollster Patrick Ruffini suggests?\n\nA possible crosscurrent: The Republican percentages held up pretty closely to Trump’s 2024 percentage in Monmouth and Ocean counties on the Jersey Shore, whose demographics are similar to much of Florida’s, and in rural Southside and southwest Virginia.\n\nThen there is New York City, similarly sized (8 million-plus) to New Jersey and Virginia, whose record (since 1969) turnout of 2 million-plus was nonetheless lower than each of those states’ 3 million-plus.\n\nSince he won the June primary, the young socialist Zohran Mamdani—he turned 34 last month—has held wide leads in polls. His cheerful demeanor and clever ads, plus his emphasis on cost-of-living issues (free buses, city-owned grocery stores), have naturally produced sympathetic coverage from most media.\n\nThese media outlets have been happy to gloss over his positive attitudes toward terrorist-sponsoring Hamas and his immediate reaction to its Oct. 7, 2023, attack on Israel. They weren’t bothered by his protracted stubbornness in renouncing the “globalize the intifada” slogan, which means kill Jews everywhere, he once embraced. For months, he had wide leads in the polls thanks to split opposition from widely disliked former Gov. Andrew Cuomo and Republican nominee Curtis Sliwa.\n\nBut the results, with 93% of the votes in, have been somewhat different. In a city that voted 68%-30% for Harris over Trump, Mamdani is leading Cuomo by a decisive but far from overwhelming 50%-42%, with just 7% for Sliwa.\n\nWhile Democrats improved on Harris’ performance in Virginia and New Jersey, Mamdani far underperformed Harris in New York City. One-quarter of New York’s Harris voters supported the Republican or the candidate endorsed by Trump. Mamdani’s core constituency is highly educated, lower-income singles who congregate in central cities and university towns—what I’ve called the barista proletariat—a large bloc in New York City and decisive in the 2023 mayoral race in Chicago, but a small segment of the electorate in most of America.\n\nAs the Democrat nominee, Mamdani ran better among black people in central Brooklyn and southeast Queens than he had in the primary, and ran well below but still carried Puerto Rican and Dominican neighborhoods in the Bronx and northern Manhattan and, narrowly, heavily Mexican Corona. And he lost heavily Asian parts of Queens, though not quite as lopsidedly as Italian neighborhoods in Staten Island and Orthodox Jewish communities in Brooklyn.\n\nMamdani’s weakness among some Democrat constituencies does not represent a danger for the party across the country generally. But it does suggest that the socialist wing of the party, and those Democrats whose antipathy to Israel can verge on antisemitism, are far from a majority force nationally. It underlines the importance, in my view, for conservatives to follow the example of Ronald Reagan and William Buckley in denouncing those such as Tucker Carlson who have provided a friendly forum for the Nazi sympathizer Nick Fuentes.\n\nIn the meantime, Trump faces a tough constituency today: the Supreme Court. Will the justices, including those he appointed, accept his claim that the gauzy language of a 1977 law gives him the power to raise and lower his beloved tariffs singlehandedly? There’s a serious chance the majority-Republican-appointed court may reject that claim, as a totally Democrat-appointed court in 1952 rejected Harry Truman’s claim that he could seize the steel mills in wartime.\n\nA Supreme Court rebuff to Trump could turn out to be a political gift to the Trump Republican Party. Trump’s “Liberation Day” tariffs in April thrust his job approval downward, and 3% inflation, which, though low, can be plausibly linked to continuing tariffs, provides a basis, as Mamdani has shown, for Democrat campaigns. Also, should Trump acquiesce to an adverse Supreme Court decision, as Truman did 73 years ago, voters’ fears of an authoritarian presidency will be mitigated.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Virginia and New Jersey, the two states that voted for governor in 2025, both voted for then-Vice President Kamala Harris over then-candidate Donald Trump by... Read More\n\n\nThe post Bad News for Republicans, Warnings for Both Parties appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/08/bad-news-for-republicans-warnings-for-both-parties/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/20251107spanberger.jpg","video":null,"publish_date":"2025-11-08 19:00:00","author":"Michael Barone","authors":["Michael Barone"],"language":"en","category":"politics","source_country":"us","sentiment":-0.035},{"id":377098802,"title":"Conservatives beware: Socialism isn’t to be mocked, but feared","text":"CNN to Sen. Bernie Sanders (I-VT): “Do you think Zohran Mamdani is the leader of the Democratic Party?”\n\nSanders: “Well, of course he is.” \n\nFOR CONSERVATIVES, IT’S A TIME FOR CHOOSING\n\nThe Mamdani coalition that led him to be the leader of the Democratic Party, according to its most senior elected senator, is one that doesn’t remotely align with those of the past. In an election where the 34-year-old member of the Democratic Socialists of America beat the establishment Democrat (and hopelessly listless and entitled) Andrew Cuomo, along with Republican Curtis Sliwa, in a city with few actual Republicans even left living in it, Mamdani excelled with two groups:\n\nA) Under 30 voters: According to several exit polls, on average, almost 80% of those under 30 voted for Mamdani. \n\nB) Transplants: According to an NBC News exit poll, Mamdani won 83% of voters who have only lived in New York City for less than five years. Of those who were born and raised in New York City, that number of support drops to just 34%. \n\nYoung, college-educated voters went strong for Mamdani because his policies may have little impact on them, and because, like the future mayor, they see themselves as victims of a system that is so bad in their eyes that they suffer from mental illnesses as a result. This recent Presidential Election survey, released in October, will absolutely blow your mind: Among males in the baby boomer generation, 73% say that “no matter what psychological challenges I face, I will not let them define me.”\n\nBut when asking Generation Z (18-to-29 year old females) the same question about mental illness, a whopping 72% say that “mental illness is an important part of my identity.” Overall, according to Pew Research, 56% of young white liberal women have been diagnosed with a mental health condition. \n\nNow let’s connect the dots back to Mamdani’s victory: 81% of young women under 30 voted for him. His campaign of victimhood, of a system working against the people (despite Democrats being in complete control of New York City for the past 12 years), resonated with those who largely feel their problems are someone else’s fault, so they turned to a child and adult of privilege, a man who has never held a real job in his entire life, to fix their problems. \n\n“Here, we believe in standing up for those we love, whether you are an immigrant, a member of the trans community, one of the many black women that Donald Trump has fired from a federal job, a single mom still waiting for the cost of groceries to go down, or anyone else with their back against the wall. Your struggle is ours, too,” Mamdani declared Tuesday night. \n\nAh, the struggle. Mamdani lives in a rent-controlled apartment despite having no right to do so. He got married to a million-dollar compound in otherwise-poor Uganda earlier this year. His mother is a successful producer. His father is a tenured professor at Columbia. Yes, if anyone understands the struggle, it’s Zohran. \n\nAs for Gen Z also seeing themselves as struggling against a corrupt society despite many having a college education, this comes down to family formation. \n\nPer the U.S. Census, the average age to get married in the United States was 25 among men in 1980 and 22 among women. Today, that age has risen to over 30 for men and nearly 29 for women. As a result, according to Bloomberg, 45% of people 18-29 still live at home with their parents, marking the highest figure since the 1940s. \n\nAs for priorities, among young women who voted for Kamala Harris one year ago, they rank getting married 11th on their list of priorities as a personal definition of success. As for having children, that clocks in at 12th. \n\nBut when asking young males who voted for Trump, it’s a much different result: Having children ranks first, while getting married is close behind at fourth. \n\nSo if Mamdani comes into New York and raises taxes the way he wants to, will these young adults simply not care if the city bankrupts itself with all the tax revenue (individuals, businesses) escaping for Florida, Tennessee and Texas, because A) Mom and Dad will feel the pain, and B) there isn’t a spouse or kids to think of, only themselves as they suffer from a (fill in the blank) mental condition. \n\nWhat do these Democratic victories on Tuesday mean in blue states in 2026 and 2028? For starters, it depends on economic conditions. If Trump’s tariffs survive and pay off, Republicans are in a decent position in the swing districts that matter outside of major cities. If the economy goes south, Democrats get the same blue wave we saw in Trump’s first term in 2018. \n\nBut in the end, we’re quickly heading towards a country of two landscapes: From New York to Chicago to Minneapolis to Seattle to Los Angeles, these impossibly-blue cities will double down on socialism or the closest thing to it while attempting to protect illegals in the hopes of converting them into voters one day. In the rest of the country outside of most major cities, which if looking at the 2024 election map is almost entirely red, those places will remain right and right-of-center. \n\nThe political split between American cities and everywhere else is only getting wider. \n\nDemocrats will continue to bear-hug socialism, thinking they’ve tapped into some kind of secret potion that’s been under their noses all along. \n\nLet’s end this with this disturbing nugget: Per Gallup, 66% of Democrats now view socialism more favorably than capitalism (42%), while nearly 80% of Republicans view capitalism favorably. \n\nDON’T LET TUCKER CARLSON’S DEFENDERS GASLIGHT YOU ABOUT FREE SPEECH\n\nThis is the new battleground. And it isn’t going away. Just ask entrepreneur and conservative activist Peter Thiel. “When 70% of Millennials say they are pro-socialist, we need to do better than simply dismiss them by saying that they are stupid or entitled or brainwashed; we should try and understand why,” Thiel wrote in January 2020. \n\nHe’s right. And the right needs a counterargument to this, because the socialist bug isn’t going to drift away, but become a political hurricane.","summary":"In Focus delivers deeper coverage of the political, cultural, and ideological issues shaping America. Published daily by senior writers and experts, these in-depth pieces go beyond the headlines to give readers the full picture. You can find our full list of In Focus pieces here. “We will prove that there is no problem too large [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3880209/conservatives-beware-socialism-isnt-to-be-mocked-but-feared/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/11/zohran-mamdani.jpg?w=696","video":null,"publish_date":"2025-11-08 19:00:00","author":"Joe Concha","authors":["Joe Concha"],"language":"en","category":"politics","source_country":"US","sentiment":-0.068},{"id":377114252,"title":"Biden claims 'Democratic Party is back' after election, says late son 'should have been the president, not me'","text":"Former President Joe Biden told Nebraska Democrats on Friday that their party \"is back\" after a series of sweeping election wins last week and also accused President Donald Trump of destroying the Constitution and cutting health care and food assistance for millions of Americans. Biden, 82, speaking at the Nebraska Democratic Party’s \"Ben Nelson Gala\" in Omaha, also urged Republicans to end the ongoing government shutdown and said his late son, Beau Biden, should have been president, not himself. \"The Democratic Party is back. That's not hyperbole,\" Biden said. \"Did you see the election results?\" CHUCK TODD SAYS BIDEN'S PRESIDENCY WAS SO 'WEAK AND INEFFECTIVE' IT MADE PEOPLE GO BACK TO TRUMP Rep. Mikie Sherrill, D-N.J. and former Rep. Abigail Spanberger, D-Va., won gubernatorial races in their respective states, while Democratic socialist candidate Zohran Mamdani scored a stunning victory to become New York City’s next mayor. The wins came a year after former Vice President Kamala Harris suffered a stinging defeat to Trump. Harris was propelled to the top of the 2024 Democratic presidential ticket after Biden backed out of the race following a blistering debate performance against Trump. \"Well, the American people are sending a message, a message to Trump and to his crowd,\" Biden said, accusing the president of trampling on democracy and working for the rich. \"I just want you to know you work for us, Mr. President. We don't work for you,\" Biden said. \"You work for us, not just billionaires and millionaires. You know, this is democracy. And the fact of the matter is that there are no kings in democracies. None. None. But you act in a way that embarrasses the nation.\" Biden said Trump and the GOP were cutting health care programs and driving up costs, adding that more than 300 rural hospitals in America, including two in Nebraska, are expected to shut down. BIDEN PRAISES LATE-NIGHT HOSTS SPEAKING OUT AGAINST TRUMP 'KNOWING THEIR CAREERS ARE ON THE LINE' \"Folks, I've never said this my whole career. I think it's immoral. It's un-American. It's flat-out wrong,\" Biden said. Biden, who had a bandage on his head, referred to his own battle with cancer and praised the health care workers who have been treating him. He was diagnosed with stage four prostate cancer earlier this year. \"I know what cancer research means. Cancer. It’s every family. It hit my family hard, just as so many of yours,\" Biden said. \"When the love of my life, my oldest son, the attorney general of the state of Delaware, who should have been the president, not me, volunteered to go to Iraq for a year, didn’t have to, came back with stage four glioblastoma because he lived in a burn pit just like those guys did on 9/11, and he died.\" Biden also took aim at Trump’s plans to build a new ballroom at the White House after bulldozing the East Wing, calling it \"the perfect symbol of his presidency.\" \"When I left the presidency, President Trump was going to take a wrecking ball to the country, but I had no idea it would be an actual wrecking ball,\" Biden said. \"Anyone see what he's done to the East Wing of the people’s house? Trump has taken a wrecking ball not only to the people’s house, but to the Constitution, to the rule of law, to our very democracy.\" He also accused Trump of \"deliberately making hunger worse\" and claimed \"one in five children go to bed hungry every night.\" He mocked Trump for holding a \"Great Gatsby\" themed Halloween party at Mar-a-Lago while cutting food aid for millions, saying it showed \"who he is.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"On Friday, everyone dressed up like the rich folks they are from the Roaring Twenties and on Saturday he cut assistance to 40 million Americans,\" Biden said. The White House did not immediately respond to a Fox News Digital request for comment.","summary":"Former President Joe Biden said in a post-election speech in Nebraska the &quot;Democratic Party is back&quot; and accused Donald Trump of wrecking the Constitution.","url":"https://www.foxnews.com/politics/biden-claims-democratic-party-back-after-election-says-late-son-should-have-been-president-not-me","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/joe-biden.jpg","video":null,"publish_date":"2025-11-08 18:43:49","author":"Michael Dorgan","authors":["Michael Dorgan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.328},{"id":377121560,"title":"Gone Too Far? Controversial Comic Bill Maher Sparks Liberal Meltdown With Sick Joke About Ex-Veep Dick Cheney's Death","text":"Blowhard Bill Maher got a taste of how his ultra-liberal Real Time audience truly felt about former right-wing Vice President Dick Cheney when a joke about his death completely bombed.\n\nThe comedian, 69, misread his heavily left-leaning audience's opinion about the Republican who, despite his reputation as a war-monger while in office, gained new Democrat fans by bashing Donald Trump in his later years.\n\nCheney died at the age of 84 on November 3 due to complications from pneumonia and cardiac and vascular disease.One Dead Joke WorkedMaher lined up the Cheney joke by making fun of how some New York City voters likely weren't aware that Guardian Angels founder and Republican mayoral candidate Curtis Sliwa was still alive.\n\nSliwa, 71, became a popular Big Apple figure in the 1980s as his community safety group patrolled the subways and other public areas to fight crime. \n\nMaher joked that Sliwa \"was dogged by accusations of: we thought you were dead,\" while running against eventual winner, Democratic Socialist Zohran Mamdani, who rode to victory in a landslide.No Laughs Over Cheney\"Speaking of we didn't know you were dead, Dick Cheney died,\" Maher deadpanned as a transition, about another Republican, to which the audience fell silent except for a few groans.\n\nThe host appeared shocked and took a few beats before reacting as he very much misjudged his liberal audience.\n\n\"How many people thought he was dead? C'mon,\" the stunned funnyman snarked as his joke brought zero laughs. \n\nMaher tried to move on, seeking humor in the former Halliburton CEO's longtime career in the oil and gas industry. \n\n\"Anyway, the most powerful vice president ever, many people have said, and also a simple man who had a simple burial wish,\" Maher claimed. \"He said he wanted to be put in the ground to live his dream of slowly turning into oil.\"Maybe a Trump Joke?Maher then attempted to get laughs out of Trump sending National Guard troops into several crime-ridden U.S. cities. \n\nHe noted how Cheney and Trump \"were very different kinds of Republicans.\"\n\n\"Cheney used to send troops to occupy other countries,\" the New York native joked about the architect of the post 9/11 wars with Iraq and Afghanistan, which Cheney masterminded for his boss, then-President George W. Bush.Voted For Kamala HarrisWhile Cheney was loathed by Democrats during his two terms in office with Bush, 79, he gained a new following among left-wing voters by refusing to endorse Trump for president in 2024 and openly bashing him.\n\n\"There has never been an individual who is a greater threat to our republic than Donald Trump,\" Cheney warned while announcing he was making the rare move of casting his vote for Democratic presidential candidate Kamala Harris.\n\n\"He tried to steal the last election using lies and violence to keep himself in power after the voters had rejected him,\" the former veep sneered about the January 6, 2020, U.S. Capitol insurrection after Trump lost to Joe Biden.\n\nCheney added, \"He can never be trusted with power again. As citizens, we each have a duty to put country above partisanship to defend our Constitution.\"\n\nHis endorsement of Harris angered Republicans, and Trump went on to secure a second term as president.","summary":"Bill Maher tried to joke about former Republican Vice President Dick Cheney's death, but his left-wing audience found no humor in it.","url":"https://radaronline.com/p/bill-maher-angers-liberals-dick-cheney-death-joke-real-time/","image":"https://media.radaronline.com/brand-img/N2LBfr1b6/0x0/bill-maher-angers-liberals-dick-cheney-joke-1762624913523.jpg","video":null,"publish_date":"2025-11-08 18:29:09","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":0.002},{"id":377089608,"title":"Colorado college student government reverses course on TPUSA chapter after emergency meeting","text":"A Colorado college student government reversed its decision to block a Turning Point USA (TPUSA) chapter during an emergency meeting on Friday night. The Associated Students of Fort Lewis College (ASFLC) voted to approve the TPUSA chapter after previously rejecting senior Jonah Flynn’s proposal to register the group with the university. \"It was strange. They put us in a tiny room, with at least 100 people being forced to wait outside. Tons of local conservatives, students and community members. Inside the meeting, we got to speak briefly, and they immediately voted and unanimously approved it,\" Flynn told Fox News Digital. Flynn planned to appeal the decision to the student court because the vote to block the chapter seemed to be a violation of his constitutional rights. MICHIGAN COMMUNITY COLLEGE APPROVES TPUSA CHAPTER AFTER STUDENT GOVERNMENT REJECTION A spokesperson for Fort Lewis College told Fox News Digital Friday that the institution \"is committed to fostering an inclusive, student-centered learning environment that values both free expression and responsible leadership.\" \"Following a review and rescission of its earlier decision, the Associated Students of Fort Lewis College voted to approve Turning Point USA as a Registered Student Organization (RSO) during an emergency meeting on Friday night,\" Public Information Officer Nardy Baeza Bickel told Fox News Digital. \"This outcome reflects ASFLC’s commitment to fair governance, educational growth, and consistent policy application. Recognition does not imply endorsement of any organization’s viewpoints; all RSOs are expected to follow college policies and uphold community standards,\" Bickel explained further. \"Fort Lewis College appreciates ASFLC’s leadership in addressing a complex issue and continues to support students in developing their understanding of free expression, inclusion, and civic responsibility,\" she added. The benefits of registering the TPUSA chapter on FLC’s campus is that organizers have access to the school’s facilities for events. Flynn hopes to host a larger event than the one he held before through TPUSA. LOUISIANA GOP THROWS WEIGHT BEHIND TURNING POINT USA CHAPTER REJECTED BY NEW ORLEANS UNIVERSITY: 'INJUSTICE' Flynn was at the center of controversy when he sought to start a TPUSA chapter, prompting a petition that accused TPUSA of causing harm to students. Critics alleged that Flynn’s plan mirrored TPUSA’s national \"professor watchlist,\" which has faced backlash. The Herald reported that only three people supported Flynn’s proposal to start a chapter. On Oct. 17, a petition which was launched by the Fort Lewis College community garnered over 400 signatures, arguing that TPUSA \"has engaged in actions that directly harm our community.\" \"At a college where many students identify as Indigenous, students of color, LGBTQ+, or from other underrepresented backgrounds, this harm cannot be ignored,\" the petition reads. \"We are calling on Fort Lewis College to take action that prioritizes student safety and well-being by refusing to recognize the TPUSA chapter as an RSO.\" Shortly after the chapter was denied, a counter-petition launched backing TPUSA, garnering over 1,000 signatures so far. Flynn stood before the ASFLC board as it voted against establishing a TPUSA chapter in front of a crowded room last week. The seven elected senators on the board blocked the chapter. TURNING POINT USA CHAPTER DENIED OFFICIAL STATUS BY LOYOLA UNIVERSITY NEW ORLEANS STUDENT GOVERNMENT \"Many of our morals and interests must be pushed to the side,\" said Asa Worthington, the student body president of the Associated Students of Fort Lewis College. \"The safety of our student body and the FLC community has always been and always will be ASFLC’s top priority.\" Kirk’s debating style inspired Flynn, a Philosophy major, to start a TPUSA chapter. His campus is located in La Plata County, which went heavily for Kamala Harris in 2024. Kirk was assassinated on Sept. 10 while speaking at Utah Valley University, which has sparked a huge interest across the country to start new TPUSA chapters in high schools and colleges. \"I was really upset by what happened to Charlie. I was just sort of mourning and emotional and upset about it. Then I decided that what we need to do is not sort of back down,\" Flynn told Fox News Digital. CLICK HERE TO GET THE FOX NEWS APP","summary":"Colorado college student government unanimously approved Turning Point USA chapter after senior Jonah Flynn cited constitutional rights violations in the initial rejection.","url":"https://www.foxnews.com/media/colorado-college-student-government-rescinds-vote-denying-tpusa-chapter-emergency-meeting","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/flynn1-1.jpg","video":null,"publish_date":"2025-11-08 17:10:54","author":"Joshua Nelson","authors":["Joshua Nelson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.252},{"id":377087304,"title":"Social media erupts after far-left mayor gives victory speech in foreign language: 'Humiliating'","text":"Newly re-elected Minneapolis Democratic Mayor Jacob Frey is facing backlash from conservatives for giving a victory speech in Somali and saying that Minneapolis welcomes Somalians. In a video of the speech posted online, Frey can be seen leading chants in Somali as the crowd responds and applauds. Popular conservative influencer Paul Szypula ripped into the progressive mayor, writing, \"The pandering here is insane.\" \"Mayor Jacob Frey, as he won reelection, spoke almost a minute in Somalia then said Minneapolis belongs to Somalia,\" said Szypula. MINNEAPOLIS MAYOR’S RACE ADVANCES TO RANKED CHOICE VOTING AFTER NO CANDIDATE REACHES 50% In a second round of nonpartisan ranked-choice voting, Frey narrowly defeated a challenge from socialist Minneapolis state Sen. Omar Fateh. Fateh is the first Somali American and first Muslim to serve in the state senate. Fateh had the backing of the Twin Cities' chapter of the Democratic Socialists of America and \"Squad\" member Rep. Ilhan Omar, D-Minn., who represents Minneapolis in the U.S. House of Representatives. Meanwhile, Gov. Tim Walz, D-Minn., who was former Vice President Kamala Harris' running mate last year and is up for re-election next year, and Sen. Amy Klobuchar, D-Minn., endorsed Frey's campaign this year. While speaking with a crowd of Somali residents after his victory, Frey repeatedly thanked the crowd in Somali. ILHAN OMAR ERUPTS AT OWN PARTY FOR RENEGING ON SOCIALIST CANDIDATE'S ENDORSEMENT: 'INEXCUSABLE' \"To the great people of Minneapolis, and I say that very intentionally, because no matter where you are from, Minneapolis should be a place where you are proud to call home,\" he said. He then proceeded to list off a number of Somalian regions, saying, \"Whether you are from Bosaso or Mogadishu, whether you are from Hargeisa or Garowe, whether you are from Beledweyne or southwest, Minneapolis is a place where you come to seek prosperity, where you come to raise your family.\" \"Here is what this election means, this election means this is a moment for unity, where the entire Somali community can come together and say, ‘This is our people, this is our city, we are united behind each other,\" he said. Conservative pundit Gerry Callahan slammed Frey's speech, saying, \"This is an American politician, raised in America, educated in America, ostensibly representing Americans, prostrating himself in front of bunch of foreigners. Could be the most humiliating thing I’ve ever seen.\" Podcaster Matt Walsh also chimed in, writing, \"As I have said many times now, politicians in this country should be required by law to speak English when addressing the public in an official capacity. There should never be a time when Americans can’t understand what their elected leaders are saying.\" MINNEAPOLIS BECOMES FIRST MAJOR US CITY TO ALLOW MUSLIM CALLS TO PRAYER AT ALL HOURS Nick Sortor wrote, \"I don’t know how large ICE’s presence in Minneapolis is, but it needs to be much, MUCH larger.\" Fox News Digital reached out to Frey’s team for comment, but did not immediately receive a response. CLICK HERE TO DOWNLOAD THE FOX NEWS APP This is not the first time Frey has garnered criticism over Somali-language political messaging. He was also widely criticized in September for releasing a campaign ad in Somali. Rep. Chip Roy, R-Texas, commented on the ad, saying, \"This must be stopped.\" Rep. Mike Collins, R-Ga., also reacted to the ad, posting a disapproving gif. Kari Lake simply wrote, \"WTAF?\" which is an acronym for \"what the actual f---.\" Having entered office in 2018, Frey was elected to his third term as Minneapolis mayor on Tuesday. He is best known for marching with protesters during the 2020 Black Lives Matter riots, which were particularly destructive in Minneapolis, the city in which George Floyd died. Frey was also seen kneeling and weeping by Floyd’s casket at a memorial service.","summary":"Newly re-elected Minneapolis Democratic Mayor Jacob Frey is taking criticism for giving a victory speech in Somali and saying that Minneapolis belongs to Somalia.","url":"https://www.foxnews.com/politics/social-media-erupts-after-far-left-mayor-gives-victory-speech-foreign-language","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/jacob-frey.png","video":null,"publish_date":"2025-11-08 16:30:50","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.048},{"id":377091818,"title":"Obamacare Insurers Bet $400 Billion on Shutdown Democrats","text":"The following content is sponsored by American Resolve.\n\nHealth insurers have never had it so good. Their stocks are up more than 1,000 percent since Obamacare passed, and they now receive roughly a trillion dollars per year in federal subsidies.\n\nWith that much taxpayer money at stake, politics inevitably follows the cash—and lately, the industry has taken a hard-left turn.\n\nIn the last presidential campaign, insurers gave five times more to Kamala Harris than to Donald Trump. Blue Shield of California donated $500,000 and UnitedHealth donated $75,000 to Gov. Gavin Newsom’s ballot measure effort, Prop. 50, which could hand Democrats, and health insurers, as many as five additional seats in Congress. Newsom’s Prop. 50 won last week, increasing the chances of Democrats retaking the House and enacting their radical agenda, which includes impeaching President Donald Trump.\n\nThe strategy appears to be paying off. Democrats in Congress are repaying the favor by shutting down the government in order to keep $400 billion in Obamacare subsidies flowing from the American taxpayer to the insurance companies—and thus back to Democrats.\n\nThese are temporary COVID-era enhanced subsidies that the Democrats and their insurance company benefactors want to make permanent. Insurers have been surreptitiously enrolling people who aren’t even aware they have coverage and don’t use the policies, thus pouring more federal cash into insurance company coffers without requiring any outlays on the insurers’ part. This is a scam whose scale and duplicity is only achievable at the intersection of corporate cronyism and a bloated federal budget.\n\nAnd the political patronage doesn’t stop there. Health insurers are already paying back the Democrats. This year, they’re hiking Obamacare premiums by 26 percent, even though overall U.S. health care costs are up only about 6 percent.\n\nThat’s a sharp contrast to last year, when insurers held premium hikes to just 4 percent as Joe Biden and Kamala Harris ran for re-election. Did insurance companies simply defer their losses into this year, or are they actively punishing Republicans who face mid-term elections next year? This ploy achieves both goals.\n\nFurthermore, this health insurance company-led government shutdown has the effect of supporting Democrats’ other controversial shutdown goals, such as keeping nearly $200 billion in free health care benefits flowing to illegal immigrants.\n\nMeanwhile, health insurers are not putting federal subsidies to use for the benefit of ratepayers and taxpayers. In fact, like with much of the federal budget, our money is going down the drain.\n\nFederal auditors project that Medicare Advantage overbilling will exceed $1 trillion this decade. This year, the Trump Administration increased Medicare payments by $25 billion, of which UnitedHealthcare alone may receive about $7 billion.\n\nSoon after, The Wall Street Journal reported that UnitedHealthcare, the biggest Obamacare insurer, paid $9 billion to AARP—essentially to stamp its name on the company’s Medicare plans. That comes as United faces a federal investigation into Medicare overbilling, a risk that could threaten its long-term solvency.\n\nImagine if that $9 billion had gone to patients instead. How any of this helps seniors is unclear.\n\nIf Republicans agree to extend the Obamacare subsidies, it should come with a condition: make insurers pay for the privilege. One option is to pass the bipartisan NO UPCODE Act, which would curb the industry’s Medicare Advantage overbilling. It would help put an end to the practice of using inaccurate or exaggerated diagnoses to inflate claims.\n\nThe Congressional Budget Office estimates the measure would save taxpayers $124 billion. Half could extend Obamacare subsidies for two years; the rest could reduce the deficit.\n\nAfter raising premiums, cutting benefits, and facing federal investigations for overbilling Medicare, insurers need to rebuild public confidence, not test it.\n\nBacking a government shutdown to get $400 billion is the wrong approach—and a sure way to invite political backlash.","summary":"Health insurers have never had it so good. Their stocks are up more than 1,000 percent since Obamacare passed, and they now receive roughly a trillion dollars per year in federal subsidies.\n\n\nThe post Obamacare Insurers Bet $400 Billion on Shutdown Democrats appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/11/08/obamacare-insurers-bet-400-billion-on-shutdown-democrats/","image":"https://media.breitbart.com/media/2025/11/spc-ar-11-8-25-640x335.png","video":null,"publish_date":"2025-11-08 16:26:18","author":"American Resolve","authors":["American Resolve"],"language":"en","category":"politics","source_country":"US","sentiment":-0.515},{"id":377109470,"title":"Pop Singer Olivia Rodrigo Lashes Out at DHS Video Using Her Song: 'Racist, Hateful Propaganda'","text":"Pop star Olivia Rodrigo left an angry comment on a social media post from the Department of Homeland Security (DHS) scolding the federal agency for using one of her songs in a video about deportations.\n\nView this post on Instagram\n\nIn a brief meme that was also shared to the official White House Instagram account, the DHS clip tells illegal immigrants that they will be pursued and roughly apprehended “IF ICE FINDS YOU,” but they will receive gentle and respectful treatment “IF YOU SELF-DEPORT.” The soundtrack of the two segments flips from a chaotic punk breakdown to a calm vocal interlude, both taken from Rodrigo’s 2023 song “All-American Bitch.”\n\nThe ad then directs viewers to a site with information about the CBP Home app, which illegal aliens can use to arrange federal assistance to return to their home countries.\n\nRodrigo showed up in the comments of the post, writing: “don’t ever use my songs to promote your racist, hateful propaganda.”\n\nA DHS representative rebuked the 22-year-old former Disney Channel actress in a statement to TMZ: “America is grateful all the time for our federal law enforcement officers who keep us safe. We suggest Ms. Rodrigo thank them for their service, not belittle their sacrifice.”\n\nAfter her instant rise to pop superstardom at age 17, Rodrigo has dutifully promoted partisan left-wing causes, from baby sacrifice to experimental mRNA injections to Kamala Harris’s doomed presidential campaign. And, beyond just supporting these causes, the “Drivers License” singer has spewed a fair amount of venom at those who don’t share her views.\n\nAfter the Supreme Court overturned Roe v. Wade in the landmark case Dobbs v. Jackson Women’s Health Organization, Rodrigo dedicated a song titled “Fuck You” to the conservative justices who ruled states have a right to punish gestational infanticide. “They truly don’t give a shit about freedom,” she said from the stage.\n\n“This song goes out to the justices Samuel Alito, Clarence Thomas, Neil Gorsuch, Amy Coney Barrett, and Brett Kavanaugh,” she continued. “We hate you.”\n\nIn June of 2025, Rodrigo denounced Immigration and Customs Enforcement (ICE) operations in Los Angeles, writing on social media: “I’m deeply upset about these violent deportations of my neighbors under the current administration.”\n\n“LA simply wouldn’t exist without immigrants,” she asserted. “Treating hardworking community members with such little respect, empathy, and due process is awful. I stand with the beautiful, diverse community of Los Angeles and with immigrants all across America.”","summary":"Pop star Olivia Rodrigo left an angry comment on a social media post from the DHS scolding the federal agency for using one of her songs in a video about deportations.\n\n\nThe post Pop Singer Olivia Rodrigo Lashes Out at DHS Video Using Her Song: &#8216;Racist, Hateful Propaganda&#8217; appeared first on Breitbart.","url":"https://www.breitbart.com/entertainment/2025/11/08/pop-singer-olivia-rodrigo-lashes-out-at-dhs-video-using-her-song-racist-hateful-propaganda/","image":"https://media.breitbart.com/media/2025/11/GettyImages-2228151150-640x335.jpg","video":null,"publish_date":"2025-11-08 16:24:02","author":"Ezra Dulis","authors":["Ezra Dulis"],"language":"en","source_country":"US","sentiment":0.205},{"id":377096588,"title":"Trump wants to make the same mistake Biden did","text":"In the wake of the GOP’s electoral drubbing this past Tuesday, President Donald Trump had thoughts. After insisting it wasn’t his fault, he offered a prescription: Republicans need to talk more about their economic record. \n\n“These are the things you have to talk about,” he said. “If people don’t talk about them, then you can do not so well in elections.”\n\nThinking that was the problem is exactly the mistake President Joe Biden and Vice President Kamala Harris made.\n\nThe economy under Biden was the envy of the world—low unemployment, solid growth, and inflation well below that of peer nations. Democrats talked about it endlessly. I talked about it endlessly. But for a second America—crushed by rising costs, stuck in low-wage jobs, and left with little chance of upward mobility—it didn’t feel like prosperity. To them, life was getting harder.\n\nThat America looked at its options. Trump said the economy was “a disaster.” He wasn’t right in the macro sense, but for people taking items out of their grocery carts, it sure felt like one. Democrats, meanwhile, kept insisting things weren’t just fine—they were amazing. World-class economy! Record jobs! Historic growth! But no statistic can convince someone living a hard reality that things are okay.\n\nSo, in 2024, they rewarded the guy who said the economy was a disaster. Trump won voters making under $50,000 a year, 50% to Harris’ 48%, according to exit polls.\n\nThat flipped back on Tuesday, as lower-income voters snapped hard to the Democrats.\n\nAnd Trump’s takeaway? That voters just don’t understand how good they have it. On Thursday he even said, “I don’t want to hear about the affordability, because right now we’re much less. If you look at energy, we’re getting close to $2 a gallon gasoline.”\n\nExcept we’re not. Gas prices are higher on average now than a year ago, and everyone who counts their dollars at the pump knows it. The same thing happened earlier this fall, when he claimed prices were “WAY DOWN,” and even his biggest fans didn’t buy it.\n\nTrump is trying to spin away people’s real pain. The difference is that Biden could at least point to genuine accomplishments. Trump has none beyond a strong stock market that mainly benefits people making over $100,000 a year—voters who now lean Democratic.\n\nTuesday’s results suggest that poorer voters know they screwed up by voting Republican in 2024. They didn’t make that mistake in 2025. And unless Trump finds something real to offer them—beyond bigger and bolder lies—they won’t in 2026, either.\n\nYou can’t tell people who are struggling to make ends meet that everything’s fine. Trump’s about to learn the same lesson.","summary":"In the wake of the GOP’s electoral drubbing this past Tuesday, President Donald Trump had thoughts. After insisting it wasn’t his fault, he offered a prescription: Republicans need to talk more about their economic record. \n\n\n\n“These are the things you have to talk about,” he said. “If people don’t talk about them, then you can do not so well in elections.”\n\n\n\nThinking that was the problem is exactly the mistake President Joe Biden and Vice President Kamala Harris made.\n\n\n\nThe economy under Biden was the envy of the world—low unemployment, solid growth, and inflation well below that of peer nations. Democrats talked about it endlessly. I talked about it endlessly. But for a second America—crushed by rising costs, stuck in low-wage jobs, and left with little chance of upward mobility—it didn’t feel like prosperity. To them, life was getting harder.\n\n\n\nThat America looked at its options. Trump said the economy was “a disaster.” He wasn’t right in the macro sense, but for people taking items out of their grocery","url":"https://www.dailykos.com/story/2025/11/8/2352658/-Trump-wants-to-make-the-same-mistake-Biden-did?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1246406/story_image/AP23315572079441.jpg?1699809495","video":null,"publish_date":"2025-11-08 16:00:05","author":"kos","authors":["kos"],"language":"en","category":"politics","source_country":"US","sentiment":-0.549},{"id":377109482,"title":"VIDEO: James Carville Wants to Run a 'Convicted Pedophile' Against a Republican Candidate","text":"Democrat strategist James Carville is apparently not above running a criminal in a political campaign just to see if that person could win against a Republican candidate.\n\nCarville made his statement during a recent podcast episode of Politics War Room when he responded to a statement about Virginia.\n\n“By the way, if we won the attorney general’s race, I’m personally going to find a convicted pedophile and run him in a race just to see if he could beat a Republican. I’m not sure. I’m not going to say they’re convicted, a convicted pedophile. And by the way, the guy that was running against him ran a pretty good campaign,” Carville said:\n\nOn Election Day Tuesday, Democrat Jay Jones narrowly won the Virginia Attorney General race against incumbent Republican Jason Miyares, per Breitbart News:\n\nJones’s projected victory comes after a race largely characterized by a scandal involving text messages from 2022 showing Jones fantasizing about Virginia House Speaker Todd Gilbert and his children being gunned down.\nThe texts were a major flashpoint, as Republicans pressured Democrats to revoke their endorsements of Jones and disavow his violent rhetoric, especially in the wake of the assassination of Turning Point USA founder Charlie Kirk.\n\nPresident Donald Trump had endorsed Miyares in the race. At the time of his endorsement, Trump called on Jones to “drop out of the race” over his violent text messages.\n\nIn addition, Democrat gubernatorial candidate Abigail Spanberger won her race after refusing to revoke her endorsement of Jones when the text message scandal erupted.\n\nPrior to President Donald Trump’s victory over former Vice President Kamala Harris (D) in November 2024, Carville said he was “scared to death” about the election and “very concerned.”\n\nHe has since suggested a split in the Democrat Party was necessary for it to survive, saying “[M]aybe we need to have a schism,” Breitbart News reported in April.","summary":"Democrat strategist James Carville is apparently not above running a criminal in a political campaign just to see if that person could win against a Republican candidate.\n\n\nThe post VIDEO: James Carville Wants to Run a &#8216;Convicted Pedophile&#8217; Against a Republican Candidate appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/11/08/video-james-carville-wants-run-convicted-pedophile-against-republican-candidate/","image":"https://media.breitbart.com/media/2025/11/James-Carville-640x335.jpg","video":null,"publish_date":"2025-11-08 15:46:05","author":"Amy Furr","authors":["Amy Furr"],"language":"en","category":"politics","source_country":"US","sentiment":-0.273},{"id":377061166,"title":"Patriot or 'Pathetic RINO'? Maverick Republican Thomas Massie trades 'America First' label for 'America only'","text":"Rep. Thomas Massie — a Republican fiscal hawk facing a President Donald Trump-backed primary challenger in Kentucky — has previously described himself as \"America First,\" but now he says he thinks that he's \"America only.\" \"I am tired of sending money overseas,\" he told Fox News Digital during an interview on Thursday. \"I am tired of favoring foreign beef over U.S.A.-grown beef,\" he continued. \"I'm ready to be America only. And I think all congressmen should be that way.\" Massie gave Trump a mixed review, saying that the president is America First on \"some\" fronts. REP THOMAS MASSIE REMARRIES AFTER WIFE'S DEATH LAST YEAR: ‘PLEASE PRAY FOR US’ \"But when it comes to the beef, he is not America first. When it comes to sending money overseas to Ukraine and Israel,\" Massie said, \"I think he needs to get back to his campaign promises and put America first. Because we're not gonna make America great again by sending our money overseas.\" Massie noted that his \"biggest disagreement\" with both the Trump administration and House Speaker Mike Johnson, R-La., is the increase in spending. \"I mean, I thought we were conservatives. Why are we spending more this year than Joe Biden spent in his last year? Actually, we're spending about $200 billion dollars more,\" he said, adding that the consequence \"is inflation and higher interest rates.\" \"And people are feeling that. You can't gaslight them,\" Massie added. \"You can't tell them that things are getting cheaper when they're not getting cheaper.\" In a statement to Fox News Digital, White House spokesman Kush Desai accused Massie of \"Fake Math.\" TRUMP SAYS MASSIE IS ‘GONNA BE HISTORY’ AS ‘BIG, BEAUTIFUL BILL’ JUMPS FINAL HURDLES TO PASSAGE \"Here are the facts: President Trump’s Working Families Tax Cut Act cut mandatory spending by $1.5 trillion over the next 10 years, and the budget deficit from April to September of this year is down a staggering 40% compared to last year, when Joe Biden was president,\" Desai declared in the statement. \"Instead of Fake Math, Thomas Massie should reflect on how he betrayed his voters and hardworking Americans when he voted with every Democrat against the biggest tax cut for working families in American history, including no tax on tips, no tax on Social Security, no tax on overtime pay, increased child tax credits, and permanence for the 2017 Trump Tax Cuts,\" he added. Massie said his other disagreements with what has been happening in D.C. are \"secondary\" to the spending issue. \"I would say, we need to follow through on some of our campaign promises. For instance, release the Epstein files,\" he said. MAVERICK HOUSE REPUBLICAN IN TRUMP'S CROSSHAIRS TOUTS RECORD CAMPAIGN CASH HAUL Massie and Rep. Ro Khanna, D-Calif., have been spearheading a bid to force a House vote on a proposal that would compel the release of materials pertaining to Jeffrey Epstein. Their discharge petition has amassed 217 of the 218 signatures needed to force the vote, but Democratic Rep.-elect Adelita Grijalva, who has said she will sign on, has still not yet been sworn in to office more than six weeks after winning a special election in Arizona. Johnson \"has tried every which way he can to avoid this vote,\" Massie claimed, asserting that the speaker has not sworn in the Democrat because she \"represents the 218th signature I need to force a vote on releasing the Epstein files.\" Fox News Digital reached out to Johnson's office for comment. RAND PAUL PLEDGES SUPPORT FOR MASSIE AGAINST TRUMP-BACKED CHALLENGER: ‘I’M GOING TO HELP HIM' Massie, who owns cattle himself, said the president has \"sort of gut punched the cattle ranchers and… livestock farmers\" in the U.S. During remarks aboard Air Force One last month, Trump indicated the U.S. was considering buying beef from Argentina to drive down prices. Days later Reuters reported that a White House official indicated that the administration was quadrupling the nation's low-tariff imports of beef from the South American nation. Increasing the tariff rate quota to 80,000 metric tons will allow Argentina to send greater quantities of the product to America at a lower rate of duty, according to the outlet. The president has Massie in his political crosshairs — he has repeatedly reviled the congressman on Truth Social. In a post on Monday, Trump referred to Massie as \"a Weak and Pathetic RINO\" — a pejorative acronymn that stands for \"Republican in name only.\" He also called the congressman \"a totally ineffective LOSER,\" while expressing his support for primary challenger Ed Gallrein, who Trump is backing in the race. SCOOP: TRUMP-BACKED FORMER NAVY SEAL LAUNCHES GOP PRIMARY CHALLENGE AGAINST MASSIE Even as the president tries to convince voters in Kentucky's 4th Congressional District to reject Massie, the lawmaker said that he does not regret endorsing Trump ahead of the 2024 election, noting that former Vice President Kamala Harris would have been a total \"disaster.\" Massie initially backed Florida Gov. Ron DeSantis in the GOP presidential primary, but DeSantis dropped out and backed Trump, and Massie later endorsed the Republican juggernaut as well. CLICK HERE TO GET THE FOX NEWS APP \"And I'm glad that President Trump won,\" he said. Trump has \"done a lot of good things,\" he said, adding that many of them have been carried out via executive order, and he thinks Congress should vote on more of the issues so that the president's moves are not simply \"temporary actions.\" Asked whether he'd have any interest in potentially running for president himself, Massie said that he is not interested.","summary":"Rep. Thomas Massie, who is being primaried by a Trump-backed challenger, said that he now considers himself to be &quot;America only,&quot; not &quot;America First.&quot;","url":"https://www.foxnews.com/politics/patriot-pathetic-rino-maverick-republican-thomas-massie-trades-america-first-label-america-only","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/rep-thomas-massie-sept-2025.jpg","video":null,"publish_date":"2025-11-08 14:52:28","author":"Alex Nitzberg","authors":["Alex Nitzberg"],"language":"en","source_country":"us","sentiment":-0.474},{"id":377045362,"title":"Former Press Secretary Karine Jean-Pierre Left the Democrat Party to Become an Independent. Cue the Sound of One Hand Clapping.","text":"WASHINGTON—In case you hadn’t noticed, former White House press secretary Karine Jean-Pierre is a black woman, as she repeatedly reminds readers in her memoir “Independent: A Look Inside a Broken White House, Outside the Party Lines.”\n\nJean-Pierre also is “openly queer”—her words, not mine, scattered like breadcrumbs throughout her 177-page treatment of her two-plus years as former President Joe Biden’s top spokesperson.\n\nIf it weren’t for identity politics, Jean-Pierre wouldn’t have any identity at all. She tosses around labels, not arguments.\n\nJean-Pierre told The New Yorker that the “broken” White House in her book title refers not to the White House of her former boss, but that of current President Donald Trump.\n\nAnd yet, by her own account, KJP’s defection from the Democratic Party was a reaction to serving in an administration that was burdened with “racism, misogyny, and double standards.”\n\nIf you want to know what it was like to work inside the Biden White House, prepare to be disappointed. The book is light on policy and heavy on score-settling.\n\nJean-Pierre lashes out at the occasional in-house rival, and she never identifies by name then-national security communications adviser John Kirby, who often shared the podium with her. That snub only makes Kirby look better. Again.\n\n“Some of my resentful colleagues,” KJP wrote, thought she was not “fit for the job.” And then there was the “belligerent press corps.”\n\nI’ve read a lot of so-called tell-all books from former political staffers. Everyone has an ax to grind somewhere, but it’s the pros who know how to land a blow and move on.\n\nIn her book, “107 Days,” about the high-speed 2024 campaign, former Vice President Kamala Harris writes that on the Sunday before Election Day, “I still believed our campaign of joy would triumph in two days.” Harris also revealed that she and husband Doug Emhoff were “so traumatized” by the reversal of fortune they faced on election night that the couple did not discuss that evening until she started to write her book.\n\nHarris also wrote about stronger answers she should have given during interviews, and other missed opportunities.\n\nNot KJP, who blames the world for things Team Biden could have handled better. Hunter Biden? Jean-Pierre writes he “had been a punching bag for the GOP for years as its members exploited his history of drug addiction, harped on his business relationships, and accused his father of unethically helping him land lucrative deals overseas.”\n\nJean-Pierre conveniently forgets that Biden’s surviving son peddled his access to his then-vice president father, who was in charge of White House policy on Ukraine.\n\nJean-Pierre should realize that the Yale law graduate walked away from a plea agreement on charges involving a gun purchase while addicted to drugs because he thought he could win, even though he was guilty.\n\nThe former press secretary also neglects to mention that Hunter Biden’s legal problems could have been eliminated if Biden had pardoned his son—which candidate Biden promised he would not do but ended up doing anyway. After the election.\n\nI understand the pardon. Still, I’d love to get some insight into the former president’s oft-uttered claim, “My son did nothing wrong.”\n\nTo Jean-Pierre, the worst offense is the Democrats’ “betrayal” of Biden. She does not seem to have figured out that Biden betrayed Democrats when he announced he would run for reelection for an office he probably would not have won in 2020 if he revealed he planned to run again in 2024.\n\nBiden didn’t make it to Election Day, so KJP decided to switch parties. Now she calls herself an Independent. But she’s not. She’s a political animal who picked the wrong horse and wound up in a ditch. And now she’s digging the hole deeper.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"WASHINGTON—In case you hadn&#8217;t noticed, former White House press secretary Karine Jean-Pierre is a black woman, as she repeatedly reminds readers in her memoir &#8220;Independent:... Read More\n\n\nThe post Former Press Secretary Karine Jean-Pierre Left the Democrat Party to Become an Independent. Cue the Sound of One Hand Clapping. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/08/former-press-secretary-karine-jean-pierre-left-the-democratic-party-to-become-an-independent-cue-the-sound-of-one-hand-clapping/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/GettyImages-2242405200.jpgRS_-scaled.jpg","video":null,"publish_date":"2025-11-08 14:00:00","author":"Debra Saunders","authors":["Debra Saunders"],"language":"en","category":"politics","source_country":"us","sentiment":-0.209},{"id":377030112,"title":"“Big artists like taylor should take notes!!”: Netizens react as Olivia Rodrigo slams the White House for using her song to promote ICE","text":"Olivia Rodrigo has sharply criticized the White House and the Department of Homeland Security (DHS) after her 2023 song All-American Bitch was used in a social media video promoting immigration enforcement. As reported by Deadline on November 7, 2025, the Guts singer took to Instagram to condemn the use of her music in what she called “racist, hateful propaganda,” following the release of a video urging undocumented immigrants to “self-deport.” The clip, posted on November 4, 2025, in collaboration between the White House and DHS, featured footage of Immigration and Customs Enforcement (ICE) agents detaining people of color while Rodrigo’s song played in the background. In a direct reply under the post, the singer wrote,\"Don’t ever use my songs to promote your racist, hateful propaganda\"Fans have praised Rodrigo's public stance and said that other artists should follow suit, especially the big names like Taylor Swift.sammy @sammywthebodiLINKbig artists like taylor should take notes!!Slate Truck @Slate_TruckLINKtaylor for the love of god please do what you did with imgonnagetyouback and copy olivia again &#128557;Saysosis @MileyissosLINKNicki Minaj and Taylor swift don’t say anything about the White House using their music btwMore about the DHS video and the use of Olivia Rodrigo's musicAs reported by Deadline, the DHS video encouraged undocumented residents to “LEAVE NOW and self-deport using the CBP Home app,” warning of “consequences” if they failed to do so. The use of Olivia Rodrigo’s track, which features the lyrics “All the time, I’m grateful, all the time, I’m sexy and I’m kind, I’m pretty when I cry”, reportedly prompted widespread criticism online. The 22-year-old artist, known for her outspoken political stance, made clear that she did not authorize the song’s inclusion. Other artists have echoed her frustration. British singer Jess Glynne condemned a similar deportation-themed post using her song “Hold My Hand,” calling it “sick” and saying that her music \"is about love, unity, and spreading positivity, never about division or hate\"Comedian Theo Von also demanded that the DHS remove a video quoting him out of context, accusing the department of misrepresenting his stance on immigration before the clip was taken down.More about Olivia Rodrigo’s opposition to Donald Trump’s use of her musicThis is not the first time Olivia Rodrigo has objected to her songs being used for political messaging. In November 2024, The Independent reported that she had her 2021 hit deja vu removed from TikTok after Donald Trump’s campaign used it in a victory video celebrating his reelection.In a now-deleted comment that led to the platform taking the song down from the clip, Olivia Rodrigo reportedly wrote, “Ew don’t use my sound ever again ty\"Olivia Rodrigo performing at the 2025 Lollapalooza Festival (Image via Getty)Rodrigo, who publicly endorsed Kamala Harris in the 2024 U.S. presidential election, has reportedly long positioned herself as an advocate for reproductive rights and youth engagement. In 2021, she visited the White House to promote COVID-19 vaccinations for young Americans, praising former President Biden and Dr. Anthony Fauci for their public health efforts. Her latest criticism marks a sharp turn from that earlier collaboration, underscoring her frustration with the Trump administration’s immigration policies and the use of her work in government propaganda campaigns.The incident adds to a broader pattern of artists pushing back against political use of their work without consent. Under President Trump’s renewed administration, the DHS has faced mounting criticism for aggressive deportation measures, including the January 2025 decision to lift restrictions on ICE arrests at schools, hospitals, and places of worship, as reported by Deadline on November 7, 2025.Olivia Rodrigo’s latest criticism amplifies a growing chorus of entertainers distancing themselves from government messaging perceived as discriminatory.","summary":"Olivia Rodrigo has sharply criticized the White House and the Department of Homeland Security (DHS) after her 2023 song All-American Bitch was used in a social media video promoting immigration enforc","url":"https://www.sportskeeda.com/us/music/big-artists-like-taylor-take-notes-netizens-react-olivia-rodrigo-slams-white-house-using-song-promote-ice","image":"https://staticg.sportskeeda.com/editor/2025/11/ea334-17626018187316-1920.jpg","video":null,"publish_date":"2025-11-08 13:11:25","author":"Devangee","authors":["Devangee"],"language":"en","source_country":"in","sentiment":-0.034},{"id":377034732,"title":"BROADCAST BIAS: From Camelot to Whine-a-Lot, Michelle Obama claims she’s mistreated","text":"No first couple has been more adored by the national media in modern times than Barack and Michelle Obama. From their first campaign for the White House in 2008, they were compared to John and Jackie Kennedy for their style and grace. But Mrs. Obama still claims she’s been mistreated in her latest three-network love-bomb book tour. Her new book is titled \"The Look,\" a coffee-table book chock-full of fashion photos (list price $50). You can wallow in her \"intimate and candid stories\" about what she wore. It all sounds very self-impressed. The tour began with an ABC Sunday night \"20/20\" special on Nov. 2 titled: \"Michelle Obama: The Style, The Power, The Look.\" Robin Roberts was gushing from the get-go: \"As First Lady, you shot out of a cannon, any every eyeball in the world is gonna be on you.\" Roberts read some complaints from her book: \"We were all too aware that as a first Black couple, we couldn’t afford any missteps. And that as a Black woman, I was under a particularly white hot glare.\" She added a prompt: \"Did you feel that?\" Well, she wrote it! MELANIA TRUMP LAUGHED OFF VANITY FAIR COVER OFFER: REPORT Michelle answered: \"Making a mistake in a political environment where you're the first and people are – where your opponents are using your race as a fear-based strategy to make you seem like the other, then everything matters.\" This is a weird flex, because the entire Obama strategy was about how wonderfully different they were, the brilliant high-achieving two-lawyer couple. But she kept kvetching: \"You couldn’t afford to get anything wrong, because you didn’t get the – at least until the country came to know us, we didn’t get the grace that I think some other families have gotten.\" This is flat-out false. From the minute the Obamas came onto the national scene in 2004 – the media were in love. Grace overflowed like Niagara Falls. Conservatives may have harshly criticized them, but those comments were dismissed – as she wanted it -- as a \"fear-based strategy.\" MICHELLE OBAMA TELLS COLBERT SHE FEELS 'LOST' ABOUT CURRENT WHITE HOUSE NORMS AND STANDARDS UNDER TRUMP This special may have been like other prime-time Michelle-ogling specials, like the CBS-aired Oprah Winfrey interview in December 2016, where Oprah touted her as both a \"pop-culture icon\" and \"the coolest First Lady in U.S. history.\" But it’s a dramatic contrast with what happened to First Lady Melania Trump on an ABC \"20/20\" special in October 2018. ABC’s Tom Llamas – now NBC’s evening anchorman – asked a series of rude and personal questions, not the kind Hillary Clinton would get: \"You're not the first First Lady to have to deal with her husband's alleged infidelities. Has this put a strain on your marriage?\" KAMALA HARRIS MENTIONS MICHELLE OBAMA ONLY THREE TIMES IN 300-PAGE BOOK. HERE'S WHAT SHE SAID \"During the ‘Access Hollywood’ incident during the campaign, your husband apologized to you. Has your husband apologized to you since you've been in the White House?\" And in closing: \"You mentioned you still have a good marriage. Do you love your husband?\" The tour began with an ABC Sunday night \"20/20\" special on Nov. 2 titled: \"Michelle Obama: The Style, The Power, The Look.\" Robin Roberts was gushing from the get-go: \"As First Lady, you shot out of a cannon, any every eyeball in the world is gonna be on you.\" So, who was not receiving grace? MICHELLE OBAMA TAKES SWIPE AT TRUMP’S DEMOLITION OF WHITE HOUSE EAST WING Mrs. Obama also appeared on CBS, on \"The Late Show with Stephen Colbert,\" a show dominated by the host fawning over Democrat leaders. Colbert threw softballs: \"When did you realize that [fashion] was something to wield? That it actually was a power?\" KAMALA HARRIS' BOOK, MEDIA TOUR SLAMMED BY LIBERAL CRITICS AS 'EMBARRASSING' AND 'UNHELPFUL' She replied: \"I knew very quickly that I had to control every aspect of how I showed up in the world. It was a race to let the country learn me for me before they learn this other crazy woman that they were talking about, the angry bitter Black woman that was a terrorist and a danger to her country, and didn’t love her country.\" Honk if you remember Republicans calling Michelle Obama a dangerous terrorist. \"Angry and bitter\" is a plausible description, as you can hear in these comments. That's just as it came across in February 2008, after most states had voted, when she at least drew conservative notice for saying, \"For the first time in my adult lifetime, I am really proud of my country.\" National Review's Jim Geraghty called the remark \"strikingly ungracious.\" CLICK HERE FOR MORE FOX NEWS OPINION She concluded the latest interview: \"And how I showed up in the world played a huge role in just reminding people that we're normal people. Yes, we’re Black. But we bleed red, and we love red, white and blue.\" That’s a campaign answer. They are not \"normal people.\" Their first post-presidential book deal was for an estimated $65 million. She also highlighted how she showed the First Lady can be \"sexy\": \"I wanted to take advantage of the fact that as the First Lady, yes, you can be smart and educated and beautiful, and sexy and interesting and all those things. And yes, you can be a Black woman, a tall 5-foot-11 Black woman.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP NBC paired Mrs. Obama with Jenna Bush Hager, because the Bushes adore the Obamas just like the media do. Michelle kept pitching the racism stuff: \"The light was a little bit brighter because politics created an otherness. There were some people who tried to paint everything we did as a sign that we weren't ready, that we weren't suited, that we weren't American enough,\" she claimed. She was also asked to drop rhetorical bombs on President Donald Trump demolishing the East Wing to build a grand new ballroom for future generations. The whole TV tour felt like the latest 21-softball salute. CLICK HERE TO READ MORE FROM TIM GRAHAM","summary":"Michelle Obama claims media mistreatment during book tour for &apos;The Look&apos; despite receiving favorable coverage, contrasting sharply with Melania Trump&apos;s harsh questioning.","url":"https://www.foxnews.com/opinion/broadcast-bias-from-camelot-whine-a-lot-michelle-obama-claims-shes-mistreated","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/03/broadcast-bias-image.jpg","video":null,"publish_date":"2025-11-08 13:00:53","author":"Tim Graham","authors":["Tim Graham"],"language":"en","source_country":"US","sentiment":0.034},{"id":377032586,"title":"Elias: Newsom’s 2028 presidential star rising after state’s Prop. 50 win","text":"Ever since the Sept. 30 deadline for filing quarterly campaign fundraising reports, it’s been obvious that Gov. Gavin Newsom’s pet ballot measure, Proposition 50, was going to win by a landslide.\n\nNow it’s become clear that the big margin by which the anti-Donald Trump redistricting plan passed (almost 64% as of Friday) will give Newsom a big leg up on the 2028 presidential campaign he has finally admitted he’s considering.\n\nThe win became obvious when the finance reports showed Democrats had donated more than twice as much to pass Prop. 50 as Republicans had donated against it. That was a sure-fire sign the Republicans had pretty much given up on defeating the proposition.\n\nIt also meant an end to former Gov. Arnold Schwarzenegger’s persuasive TV ads against Prop. 50 and caused Republicans to concentrate their efforts on other states where they hope to redistrict to create enough newly Republican districts to guarantee continued GOP control of the House of Representatives.\n\nThis worked for them in Missouri and North Carolina, gaining one GOP-oriented seat in each, but has failed so far in Kansas and Indiana. There are also the five former Democratic-oriented seats in Texas whose gerrymandering into GOP majorities started this whole thing.\n\nWithout controlling the U.S. House of Representatives, Trump would lack the freedom of movement he’s enjoyed so far in his second term as president, a freedom he has sometimes believed might even give him the ability to run for a third term, despite the Constitutional ban on running more than twice.\n\nThat was why Trump began his effort by pressuring Texas Gov. Greg Abbott and its Legislature to redraw those five congressional seats. Newsom became the first national Democrat to fight back strongly, calling the Trump effort “election rigging” and getting those words into the title of his measure.\n\nThe changes it makes, canceling districts drawn by California’s nonpartisan citizens redistricting commission and substituting a plan figured to give Democrats five new seats to match those the party will likely lose in Texas, are temporary. In 2031, when new districts will be drawn anyhow, the job will revert to the citizens’ commission.\n\nThat contradicts Schwarzenegger’s often-repeated claim that Prop. 50 means the end for that commission, whose membership is reconstituted every 10 years. For Newsom, it’s the first time he’s taken an action that directly hits back at a Trump effort, which can only bolster his standing among Democrats nationally.\n\nPolls show they’re disappointed at their party’s passivity in the face of Trump actions like sending troops into Democratic-run cities, trying to force colleges to buy into his education philosophy no matter how their students, faculty and state legislature might feel and his defiance of some court orders.\n\nWhile the results on Prop. 50 came as no surprise to anyone who read the Sept. 30 financial reports, the early count also suggested final totals might closely match a late October CBS News poll that showed 62 percent of likely special election voters would vote for the redistricting.\n\nThis was apparently enough to push Newsom into admitting at long last that he is “considering” a 2028 presidential run. He’s betting Trump will not try to forestall that election by declaring a national emergency of some kind, and that whichever Republican is nominated will therefore be someone else.\n\nThat would run somewhat counter to longtime Trump advisor and former chief strategist Steve Bannon, now back in favor after serving jail time for three convictions of criminal contempt of Congress and fraud.\n\nBannon predicted the other day that Trump “will be president in 2028.” No one actually questions that; a new president is not due to be sworn in until early 2029. But did Bannon really mean 2029?\n\nNewsom plainly wants to become the next president in 2029, in part to undo a lot of what Trump has done. Things like his prophetic prediction of artillery products falling on Interstate 5 in Camp Pendleton during a celebration of the Marine Corps’ 250th anniversary despite Corps denials that it could happen, can only help him.\n\nNewsom’s closure of that highway, where shrapnel actually fell on police vehicles, probably saved both lives and plenty of property damage. His triumph with Prop. 50, coming soon afterward, will amplify the ground he gained on I-5.\n\nFor sure, his recent performances give him a leg up on other potential Democratic candidates like Illinois Gov. JB Pritzker, Pennsylvania Gov. Josh Shapiro, Kentucky Gov. Andy Beshears and former Vice President Kamala Harris.\n\nEmail Thomas Elias at tdelias@aol.com, and read more of his columns online at californiafocus.net.","summary":"The big margin by which the anti-Trump redistricting plan passed will boost the campaign the governor finally admits considering.","url":"https://www.mercurynews.com/2025/11/08/elias-newsoms-2028-presidential-star-rising-after-states-prop-50-win/","image":"https://www.mercurynews.com/wp-content/uploads/2025/11/SJM-L-NEWSOM50-1105.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-08 13:00:16","author":"Thomas Elias","authors":["Thomas Elias"],"language":"en","category":"politics","source_country":"us","sentiment":-0.257},{"id":377040448,"title":"Drowning the 'lazy' media with Trump's lies is the point","text":"It was another example of how Trump’s shifting policy positions, racially inflammatory statements and threats frequently fuel a flurry of headlines, reflecting what some psychologists are calling “media saturation overload” or “Trump stress disorder.” \n\nThis barrage of information may seem like overcommunication from a hyperactive administration. But it is much more than that.\n\nScholars have found that the constant, often conflicting and at times false information coming out of the White House and shared via social media posts and the conventional news media causes members of the public to see truth and fact as relative and makes them more likely to dismiss those who disagree with them as untruthful. This leaves doubt about what’s real and what isn’t. \n\nThis citizen paralysis creates what philosopher Hannah Arendt described in “The Origins of Totalitarianism” as a general public “for whom the distinction between fact and fiction … no longer exist.” When lies are truth and truth is derided as lies, Arendt wrote, ordinary people lose their bearings and can be manipulated for totalitarian objectives. \n\nMeanwhile, many journalists have openly acknowledged fatigue with the pace and nature of the Trump administrations’ news cycles, amid frequent newsroom layoffs, mergers and closures. \n\nI am a longtime journalist and now scholar of journalism and race, trained to see the methods and aims behind political leaders’ press operations. And as I show in my forthcoming book, the Trump administration’s rhetorical strategies echo the playbooks of authoritarian and white supremacist organizations such as the Third Reich and some factions of the modern alt-right movement. They are intended to narrow the scope of who belongs as an American.\n\nHeadlines at ‘muzzle velocity’\n\nThe Trump administration’s rhetorical strategies include claiming victim status while often laying blame on immigrants or other scapegoats in ways that I believe betray racist intent. At the same time it has overwhelmed journalists and the public with breaking news. \n\nThis strategy was laid out by Steve Bannon, an influential Trump supporter and strategist in his first administration, during a 2019 PBS “Frontline” interview, when he described the media as “the opposition party.”\n\n“They’re dumb and they’re lazy, they can only focus on one thing at a time,” he said. “All we have to do is flood the zone. … Bang, bang, bang. These guys will never – will never be able to recover. But we’ve got to start with muzzle velocity.”\n\nBannon has long been associated with the alt-right, a movement known for rhetorical tactics that minimize and obfuscate its true aims.\n\nA strategy forged in Trump’s first term\n\nAs I detail in my book, “American Otherness in Journalism: News Media Representations of Identity and Belonging,” Trump and his key advisers have been developing, refining and ramping up their news media manipulation for a long time. \n\nAn early example of this is the way the administration used these tactics through Trump’s public responses to the fatal violence at the August 2017 Unite the Right protest in Charlottesville, Virginia. \n\nThe two-day rally was organized by a white nationalist blogger and attended by members of neo-Nazi, white supremacist and far-right militias protesting the removal of a statue of Confederate Gen. Robert E. Lee from a Charlottesville park. They marched with tiki torches, flew Confederate and Nazi flags and chanted antisemitic and racist slogans. \n\nAmid violent clashes with counterprotesters on the second day, a neo-Nazi sympathizer drove into a crowd, killing a 32-year-old woman and injuring many others. \n\nMy study of television news coverage of Unite the Right found that the majority of news reports focused on the contradictory and inflammatory statements that Trump made about the antisemitic and racist protesters. Trump’s Aug. 15, 2017, press conference remark about blame on both sides after what happened garnered the most news media attention: “I think there is blame on both sides,” he said. “You had some very bad people in that group. You also had some very fine people on both sides.”\n\nExploiting chaos\n\nThe uncertainty surrounding what he meant created a cycle of news stories implying and denying that he sympathizes with white supremacists.\n\nThis is-he-or-isn’t-he intrigue spurred a surge of what fits the description of Bannon’s “muzzle-velocity” news headlines: “Trump declares ‘racism is evil’ amid pressure over Charlottesville” followed closely by “Trump defends White-nationalist protesters” and “Why Trump can’t get his story straight on Charlottesville.” \n\nWith the focus on Trump’s comments and what he might have really meant, the news media ultimately missed covering at the time the long-term threat posed by these white supremacist and other extremist groups.\n\nEchoing a playbook from the past\n\nScholars have identified the fascist roots of these “post-truth” strategies: strongmen leaders uninterested in establishing leadership through honesty and transparency. \n\nA recent scholarly analysis of Trump’s leadership concludes that the second-term president is overwhelming the public into “organized despair” by pitting races against each other while targeting minority groups as scapegoats, a tactic that hearkens back to 1930s Germany. \n\nA 2019 analysis of Trump’s narrative style describes how he presents himself as a “strongman” fighting invisible forces of censorship and suppression. It also points out that this was part of the appeal of fascist leaders such as Mussolini and Hitler. \n\nResearchers of Nazi propaganda identified key tactics in the German press such as name-calling and lumping together groups seen as opposition – communists, liberals and Jews – until public understanding of those groups blur into phrases like “enemies of Germany.” The messaging was constant and immersive, carried in local and national newspapers, radio, film and posters.\n\nA key part of Trump’s rhetorical strategy is using race without directly referring to it. For example, Trump has described cities with large nonwhite populations such as Washington, D.C., and Chicago as “out of control” or “dirty,” contrary to actual crime statistics. He’s also questioned Kamala Harris’ racial identity, suggesting she “happened to turn Black.” And referring to Black football players who had been protesting systemic racism by kneeling during the national anthem, Trump said, “Get that son of a bitch off the field right now,” which many observers interpreted as racist because he was insulting people of color for the act of protesting racism. \n\nThis racial coding has been used by white supremacist groups to mask their true intent. They also use less overt labels such as “alt-right” or “pro-white” as a “rhetorical bridge” to the mainstream public.\n\nIn the case of the NFL protesters, the plausible deniability became an actual denial. Trump perfected this move when, during a 2020 debate with Joe Biden, he said, “Proud Boys – stand back and stand by,” referencing another group accused of thinly veiled racism. \n\nDrowning in headlines\n\nI believe that the endgame for this strategy is authoritarian power that greatly narrows the scope of who truly belongs and has rights in this country as an American.\n\nThis media saturation – drowning the public with a thousand Trump-generated headlines – allows his administration to keep dominating and controlling national attention.\n\nBut the media-consuming public can use the tools they have to encourage news outlets to better inform the public by identifying the media saturation strategy and reporting on why leaders are using it.\n\nOtherwise, if news consumers let the headline overload do what it’s intended to do, and become overwhelmed and paralyzed, they become pawns in what I consider a ploy to make America less egalitarian and less democratic.\n\nAngie Chuang, Associate Professor of Journalism, University of Colorado Boulder\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.","summary":"The headlines documenting President Donald Trump’s plan to send federal troops to San Francisco followed a familiar arc. “Trump claims ‘unquestioned power’ in vow to send troops to San Francisco,” The Guardian reported on Oct. 20, 2025. The next day, the San Francisco Chronicle blared: “S.F. threatens to sue if Trump brings in National Guard.” Then, on Oct. 23, “Trump reverses his decision to send troops to San Francisco,” as ABC News put it, after Trump posted that conversations with the city’s mayor and tech moguls had swayed him.\n\nIt was another example of how Trump’s shifting policy positions, racially inflammatory statements and threats frequently fuel a flurry of headlines, reflecting what some psychologists are calling “media saturation overload” or “Trump stress disorder.” \n\nThis barrage of information may seem like overcommunication from a hyperactive administration. But it is much more than that.\n\nScholars have found that the constant, often conflicting and at times false information coming out of t","url":"https://www.alternet.org/overwhelm-the-public-with-muzzle-velocity-headlines-a-strategy-rooted-in-racism-and-authoritarianism/","image":"https://www.alternet.org/media-library/image.jpg?id=61691810&width=1200&height=600&coordinates=0%2C459%2C0%2C459","video":null,"publish_date":"2025-11-08 12:18:09","author":"The Conversation","authors":["The Conversation"],"language":"en","category":"politics","source_country":"US","sentiment":0.01},{"id":377008852,"title":"Tucker Carlson Says He Would 'Consider Suicide' If He Raised a Daughter Like Liz Cheney ","text":"Tucker Carlson said he would \"consider\" suicide if his daughters were like former Wyoming Rep. Liz Cheney.\n\n When Carlson, 65, appeared on Megyn Kelly's SiriusXM show Megyn Kelly LIVE, she raised the topic of the former Vice President Dick Cheney's death. The Republican lawmaker died at 84 on Monday, Nov. 3, according to a statement from his family.\n\n \"He raised a really repulsive daughter,\" Carlson said of Dick. \"Just on the downside, I’ve got a bunch of daughters that are just fine people, and I’m more proud of them than of anything in my life. And, if I had a daughter, you know, like Liz Cheney, I don’t believe in suicide, but I would consider it.\"\n\n “Oh wow,” Kelly said before laughing during the live taping of her Sirius XM show.\n\n In 2020, Liz broke from her party to urge President Donald Trump to respect the electoral process before leading the House investigation into the Jan. 6, 2021, Capitol riot. She later lost her seat in Congress and campaigned for the 2024 Democratic presidential nominee, Vice President Kamala Harris, last year. Liz was also one of the Trump targets to receive a preemptive pardon from former President Biden earlier this year, which the current President has since said are void.\n\n Carlson shares daughters Lillie, Hopie and Dorothy and son Buckley with his wife Susan Andrews.\n\n Before the statement on the former Wyoming lawmaker, Carlson said that he knew Dick \"well\" and had gone hunting and fishing with him.\n\n \"I just don’t really criticize people when they die,\" the former Fox News host said of Dick, who served as President George W. Bush's Vice President.\n\n Cheney died \"due to complications of pneumonia and cardiac and vascular disease,\" his family said.\n\n \"For decades, Dick Cheney served our nation, including as White House Chief of Staff, Wyoming's Congressman, Secretary of Defense, and Vice President of the United States,\" the Cheney family statement continued. \"Dick Cheney was a great and good man who taught his children and grandchildren to love our country, and to live lives of courage, honor, love, kindness, and fly fishing. We are grateful beyond measure for all Dick Cheney did for our country. And we are blessed beyond measure to have loved and been loved by this noble giant of a man.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer.\n\n Dick is survived by his wife of 61 years, Lynne. In addition to Liz, the couple shares daughter Mary and seven grandchildren.\n\n If you or someone you know is struggling with mental health challenges, emotional distress, substance use problems, or just needs to talk, call or text 988, or chat at 988lifeline.org 24/7.","summary":"The former Fox News host made the remarks on 'Megan Kelly LIVE'","url":"https://people.com/tucker-carlson-would-consider-suicide-if-daughter-like-liz-cheney-11846277","image":"https://people.com/thmb/X8jX6d348oQkdmvdkzTIrm9iNQc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(742x278:744x280)/Tucker-Carlson-Liz-Cheney-110725-98e7415f1fe14305a7fde2bdc423edb9.jpg","video":null,"publish_date":"2025-11-08 10:47:34","author":"Madison E. Goldberg","authors":["Madison E. Goldberg"],"language":"en","category":"politics","source_country":"US","sentiment":0.23},{"id":377076290,"title":"Britons Say Country 'Changing Too Fast', Detect 'Tension' Between Migrants and UK-Born, Research Finds","text":"A large academic study of attitudes among those living in the United Kingdom found the vast majority believe the country is “divided”, with many saying the culture is changing too fast and that they want “my country to be the way it used to be”.\n\nA massive majority of 86 per cent of people living in the United Kingdom believe there is either a “great deal” or a “fair amount” of tension between “immigrants and people born in the UK”, research by the Policy Institute at King’s College London claims to have found. This sentiment has increased perceptibly since the last time the question was asked in 2023, when it stood at a very robust 74 per cent.\n\nRemarkably, majorities seeing tension in British society between immigrants and Britons are dominant and evident across the political spectrum. While Nigel Farage’s Reform UK and Conservative voters are most convinced — with up to three-quarters of Reform voters saying there is a “great deal” of tension — even the left-wing parties exhibit the same views.\n\nThe Liberal Democrats and Greens, for instance, see agreement for the proposition hovering in the early-80s, while just 15 per cent disagree.\n\nDrawing on an uncommonly large sample size for British surveys, the University’s Institute states there are increasing notions of division in the country. Supporters of every political party and ethnic group agree that the country feels divided, and the proportion of those who support this idea has steadily risen throughout the 2020s.\n\nContributing to the idea that the United Kingdom is one that is ill at ease with itself, half of voters say the nation’s culture is “changing too fast”, with just a fifth disagreeing. This notion is gaining momentum as the two camps diverge: just five years ago, the for-and-against camps enjoyed a third of support each; now those opposing change dominate by two-to-one.\n\nConcomitant with concern of change running away, a strong plurality also agrees they “would like my country to be the way it used to be” at 48 per cent. This too is rapidly accelerating: just five years ago, Britons were more likely to say they were happy with the way the country is than not.\n\nThe King’s College London study particularly noted that this change is being overwhelmingly driven by changes of opinion among white people. In 2020, both white and “ethnic minority” people living in the United Kingdom were very much in parity, agreeing that the country wasn’t changing too quickly and didn’t need to be returned to a previous state.\n\nWhile there was slight movement in “Ethnic minority” agreement in the results — going from 32 to 35 per cent on the UK changing too fast in five years, for instance — white Britons soared ahead in that time. White respondents, for instance, shot up from that third of people in agreement in 2020 to a majority saying so now, and being twice as likely to agree with the need to stop change than being happy with it.\n\nReform and Conservative voters are, again, most likely to agree with these ideas. But despite an interpretation that could cast this as a high feeling of dissatisfaction with the United Kingdom, voters for those parties are also most likely to express patriotic ideas like “I am proud of my country”.\n\nThe research also drew in a wide range of other areas of interest. Feeling that there is a Brexit divide in the country is fading with time, with Leave and Remain voters more likely to see eye-to-eye. There has been a surge in people saying they believe transgender rights have gone too far, and Britons now perceive the word “woke” to be an insult, which they didn’t five years ago. Some 67 per cent agree there is a “culture war” going on.\n\nCuriously, practically the only metric in the whole study that has shown remarkable resilience to change are sentiments towards the history of the British Empire. While the predominant position is not having an opinion on it at all, of those who feel conviction, feeling the British Empire is “something to be proud of” beats out “something to be ashamed of” by about ten points, something which hasn’t changed in the past five years.\n\nThis study follows only by days another such piece of research which, again presented the British public as surprisingly conservative on matters of immigration compared to the perception of the UK as presented by its politics and political class, which remain in the whole overwhelmingly pro-open-borders. That study, by the National Centre for Social Research found that British voters are to the right of even their American cousins, with British Reform UK or Conservative voters to the right of U.S. Donald Trump voters, and British Labour supporters to the left of Kamala Harris voters.\n\nAsked to state whether they agree with the statement “We risk losing our national identity if we are too open to people from all over the world”, 81 per cent of right-wing British voters said they agreed, ahead of just 65 per cent of Trump voters. Again with the statement “It is bad for society if white people decline as a share of the population”, 70 per cent of the British camp agrees, compared to 43 per cent of Trump voters.","summary":"Vast majority believe the country is \"divided\", with many saying they want \"my country to be the way it used to be\", says study.\n\n\nThe post Britons Say Country &#8216;Changing Too Fast&#8217;, Detect &#8216;Tension&#8217; Between Migrants and UK-Born, Research Finds appeared first on Breitbart.","url":"https://www.breitbart.com/europe/2025/11/08/britons-say-country-changing-too-fast-detect-tension-between-migrants-and-uk-born-research-finds/","image":"https://media.breitbart.com/media/2025/11/GettyImages-2243275010-e1762597210667-640x335.jpg","video":null,"publish_date":"2025-11-08 10:21:42","author":"Oliver JJ Lane","authors":["Oliver JJ Lane"],"language":"en","category":"politics","source_country":"US","sentiment":0.179},{"id":376990718,"title":"Victor Davis Hanson: The Obamas Have Nothing to Complain About","text":"On today’s episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc react to Michelle Obama’s book tour for her new book “The Look.”\n\nThis transcript has been slightly edited for clarity. \n\nSami Winc: For having said that, which was very strange because you would think somebody on a show like that would be interested in the truth. And the second thing, Michelle Obama, of course, is on her whining tour. I guess we could say that. And she said that while she was in that White House, she was under a particularly white hot glare.\n\nAnd those were her words that they were so stressful on the White House to be watched by everybody, I thought. Wondering your thoughts on either of those two?\n\nVictor Davis Hanson: I’ll start with the second. First, Michelle, who was on the cover of Vogue repeatedly and who wasn’t as first lady? Oh, you were on the cover. And Melania never was.\n\nMelania was a professional international model. I know Barack Obama said yesterday you were fine. But I think most people would say that Melania is as pretty or prettier than you are and more elegantly dressed—not reflection on you, just that’s what models are. But she wasn’t on once. And let me ask you another question.\n\nWho was treated more unfairly? Donald Trump and Melania Trump by the media—I’m talking now NPR, PBS, NBC, CBS, ABC, New York Times, Washington Post. I could go on or you. Hmm. You. When Donald Trump made the cover of a magazine like The New Republic, he had a Hitler mustache. When you [had] Barack [in the magazine], he was dressed like FDR and said the new socialism was back. You were—everybody bent over backwards to accommodate you. I know there were people on the fringe right, that had sort of a Candace Owens proto you were a transsexual, all that crazy stuff. But by and large, in the midstream of the country, you—your memoir was a bestselling book.\n\nYou were treated with kid gloves. So when you said you’d never been proud of the country, you said until Barack was a figure. You said it was a downright mean country, you said they always raised the bar on people like us. You were given a pass. You were given a pass, and your whole life was, you were, came out of Harvard Law School.\n\nAnd you were in a Chicago law firm. You did, you wanted a sneaker account right away. And then when he was elected senator, they gave you a non-job for what? A third of the million dollars basically at the University of Chicago Medical School to direct people away from the medical school who couldn’t pay. You were always given either equitable treatment or exemplary treatment, and if you want to go Google and say, make fun of first lady, see how many things come up under Melania versus you, and it will be much more. And nobody put a gun to your head and said, you have to run for president. You use that bully pulpit to push all of your issues. As far as altering the White House, you made a special little kind of nice organic garden.\n\nYou did whatever you wanted, and yet now you [complain] and now you’re worth probably over a hundred million dollars. And no offense, but I don’t think that you and Barack had any reputation, history, CV [curriculum vitae], resume of being particularly accomplished Netflix content thinkers, creators. That’s what they gave you. What, $20 million? So you walked out of the White House, remember Barack had said, I’m going to run a president. I’m going to transform the country. I’m not, I’m not going to do it just to cash in. That’s what you did. So can’t you just say, this is an amazing country that a black man and woman were elected president with the majority, with a greater white vote than the previous white candidate, and we were—but that didn’t happen. Almost immediately, when you came in, you gave the typical Michelle chip on your shoulder. Well, I was in a Target and a shorter woman wanted me to reach and didn’t know who I was, so I had to reach for a package to give to her.\n\nIt happens to all of us, Michelle, happens to all of us all the time. And I was in local supermarket two weeks ago and I pulled out a shopping cart and the woman next to me pulled out a shopping cart. She didn’t speak English and it was full of what many of them are—trash, right? And then she said to me in Spanish, can I have your shopping cart?\n\nI felt so offended just because I’m white and I speak English. You think you can just take my shopping cart when I didn’t put trash in it? And you don’t want to clean it ’cause you don’t want to touch the trash. But I gave it to her. And I have never mentioned that incident until today. I didn’t digest it and get angry, that Sue, who is this person who’s probably here illegally and doesn’t speak [English], and she comes up to me, you know, bring this over to me.\n\nThings happen in life and you can’t think that way, and life is so hard on you because you have a beach estate in Hawaii that you built. Contrary to many environmental regulations, you have a abode on Martha’s Vineyard on the seashore cliff, I think it’s 20 acres. I think you have 2,000 gallons worth of propane on that.\n\nI only have 150. I have a three acre little house yard and we only have 150 gallons of propane and you get 2,000. It’s not fair. And my family at one time was bigger than yours. And then you’ve got your Kalorama mansion. You still have your Chicago nice thing, and your Tony Rezko acquired big yard, and yet that’s not enough.\n\nAll you do, we had to pay for food. We had to pay for food when we were in the White House. Well, most America, I really doubt that they sent you a bill for a ham sandwich. No offense, but it’s all complaint. And she grew up with middle class parents, and then she’s now onto the DEI [diversity, equity, and inclusion]. And you know, Barack said the other day, he’s trying to whip up the racial sentiment, he said, and you know, they just confused, they just see a black eye and they say, you got the job at DEI. Well, get rid of DEI. And you won’t think that. And in your case, Barack, you came with a mediocre record after two years from what we can ascertain from anecdotal evidence. Since you wouldn’t release your student records and you went to Columbia.\n\nAnd then you didn’t release your Columbian grades and then somebody got you into the Harvard Law School. Would you please release your Harvard Law School admissions LSAT, and GPA from Columbia, and then we will know whether you got in on DEI or not. Because you didn’t really cut a wide swath as an impressive law student when you graduated and you were going to be a constitutional lawyer and you were going to work on contractual law for a year.\n\nAnd from what people tell us in anecdotal information when you were given a year with no teaching abilities and a fellowship to write a book—on what contractual or constitutional law? You wrote about yourself, if you did write about yourself—there was accusations that Bill Ayers wrote it, and there were certain things in his memoir, anecdotes that were strikingly similar to yours.\n\nBut let’s not judge you. And it was the best seller, and you were on your way to the races. So both of you have nothing to complain about. There are millions of people in America—Indian, Hispanic, black, white, who would die to have the opportunities that you have. But you could never let it alone—till the moment you go to the grave, you’re going to be complaining about this country.\n\nAnd you know, it’s—it would be like me saying, wow. My mom was a very strong Democrat. My dad was a very strong Democrat. They had to go to an Oakland conference once, and my mom was shocked because they pulled into a parking lot at a judicial conference, and five large black males surrounded them and threatened them, and then my father, who’s very big, was well willing to, but you know, they were probably armed, so he pulled out his wallet and gave him a couple of $20, said please, my wife is a judge, and I’m not going to let you do this. Gosh, is that what black people do? I’ve never gotten over that trauma. I’ve never gotten over it, Michelle. And when I was at Stanford University, at the time my wife worked at the VA and we were walking down the street and she had a mental patient who saw her and her job was to take mental patients on bus tours and she saw one of her favorite people who actually had Down Syndrome and he, she was attending to him and an African American couple, two males came up, got right in her face and started emulating the way that that patient was talking, making fun of them. And I said, don’t do that to these two nice people. And the next thing they knew, they were pushing me and everything went downhill.\n\nAnd I have never thought of that until right now, but I am obsessed with it, what happened to me? So, you know, go to East Palestine, Ohio and live there for a year, and then tell me that you’re the only oppressed person in the world. I get so tired of that, of all of these elite people, of any, any race that keep complaining about how bad they’ve had it.\n\nYou know what I mean? Oh, it’s been so bad. I could do that too. Oh yeah. I had another sinus operation. It wasn’t fair. I’ve had nine operations in my life. Now that I’m looking at a beautiful little studio, I’m looking at an orchard, I think I’m blessed beyond comprehension. I have these wonderful people listening to me, but it’s so unfair that my operation didn’t work.\n\nWell, that’s what we get. I don’t know why she does it. Same thing with Whoopi Goldberg. She gets her new name. She gets all of this. She was a good actor in “Ghost”, and she was in “The Color Purple,” she takes off. Was it Ted Danson was her boyfriend. She was—and then she got Barbara Walters, created “The View.”\n\nShe had certain rules of decorum. It was very popular. There was, if there were politics, there were two sides. It boomed. She died. The next generation took over and wrecked it. Everybody has been sued for lying for the first time, and some judges now consider that libel. So when somebody hands you a paper from your producer who’s paying you millions of dollars and you spout off anything that comes into your mind and they say, don’t say that Donald Trump used the autopen unless you have evidence, and she had none.\n\nAnd she said, well, it was just a joke. Well, people get sued for that. I don’t know if he would sue them. I doubt it. But he has sued George Stephanopoulos for lying that he was a rapist 11 times when he was never convicted of that. And the same thing with the doctor and the Kamala Harris. So there is a lot of executives that are saying about “The View,” you guys are really controversial. You’ve not got very good audience share anymore, and you’ve got a lot of criticism and we’re all under scrutiny, so just be very careful. Instead, she tears it up and, and then, you know, and she said so many crazy things about the Holocaust and Jews, and it just, it’s all these people.\n\nI don’t know what it is. They’re all privileged, they’re all millionaires and they all whine, whine, whine, whine.\n\nSami Winc: Yeah, I think that’s what your audience thinks too. They listen to their complaints and the audience and I both probably think, you know, human life is like that. There are ups and there are downs, and we’ve all suffered ups and downs.\n\nVictor Davis Hanson: DEI—that’s why it’s such a pernicious ideology, because you can translate any personal unhappiness into a cosmic ism or ology against you, on this Marxist binary you’re on the 30% victims, you know, …. the problem is, everybody, there’s not enough victimizers for all the victims.\n\nSo you have to say it’s, well, I can’t find racism, but it’s systemic. It’s everywhere. It’s insidious. You need, you need a racist detector in your foundation of your home to find it. It’s in everywhere. So then of course you can’t see it. You can’t smell it, but it’s deadly. But only me, Professor Kendi, can find it—if you buy my book.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"On today’s episode of “Victor Davis&#160;Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc&#160;react to Michelle Obama’s book tour for her new book... Read More\n\n\nThe post Victor Davis Hanson: The Obamas Have Nothing to Complain About appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/08/victor-davis-hanson-obamas-have-nothing-complain-about/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/20251107TheObamas.jpg","video":null,"publish_date":"2025-11-08 10:00:00","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","source_country":"us","sentiment":-0.015},{"id":376987878,"title":"Lucas: Kamala’s book tour trumps 2024 race","text":"If Kamala Harris campaigned for president the way she is storming the country selling her book, she might have become president.\n\nHad she been more open with the media the way she is now — instead of hiding out from the press throughout the campaign — she might have prevailed.\n\nThe vice president had some $1.5 billion in campaign funds to burn through. And burn through those funds, she did,\n\nSo, things maybe could have been different,\n\nNot really. She was going to lose anyway.\n\nBut it is something to think about.\n\nIt is hard to imagine a President Harris dealing with dictators like Communist China’s Xi Jinping, war criminal Vladimir Putin of Russia or defiant Chuck Schumer of New York.\n\nIt is doubtful that she would have sent the B-2 bombers to wipe out the nuclear facilities in Iran or done much to free the Israelis held hostage by the Hamas terrorists in Gaza.\n\nWith Harris in the White House, John Kerry would have been back as climate czar, Maura Healey would be U.S. attorney general, and Elizabeth Warren would be Secretary of State.\n\nThe border would be open with Gavin Newsom in charge, people being deported would be Republicans, and Venezuelan dictator Nicolas Maduro would be bombing U.S vessels and not the other way around.\n\nUnder President Donald Trump, however, Maduro, if he is lucky, will soon be back driving a bus or die in prison, like fellow drug kingpin Manuel Noriega of Panama after the U.S. invaded and arrested him.\n\nAnd the East Wing of the White House that Trump is turning into a ballroom?\n\nForget about it. President Harris would have turned it into a Washington food pantry.\n\nIf you think not, consider her quote about the ballroom last week. She said, “Are you f—–g kidding me? The guy wants to create a ballroom for his rich friends while turning a blind eye to the fact that babies are going to starve when the SNAP benefits end hours from now. Come on.”\n\nNobody is going to starve in the U.S., and everybody knows it.\n\nAnd can you imagine President Harris ending wars around the globe the way Trump has done?\n\nTrump has settled so many wars between countries that he has lost count. He has even brought peace to countries that did not even know they were at war.\n\nSo, with the defeat of Harris, the country dodged a bullet.\n\nStill, Harris is hanging in there hoping that lightning will strike twice and that she will once again be the Democrat Party nominee for president in 2028. Fat chance.\n\nThe difference now is that this time she will have to fight for the Democrat nomination instead of being crowned by the party as she was in 2024 after Joe Biden melted down.\n\nHarris, however, will now face a wave of new, ambitious, young radical leftists like Andrea Ocasio-Cortez (AOC) or Zohran Mamdani (ZM) for instance, who have taken over the leadership of the Democrat Party\n\nMeanwhile, Harris still has old Joe Biden hanging around her neck like an ex-husband who won’t leave the house.\n\nStill, Harris is trying, and says she is not finished with politics, which is interpreted as that she will run again, or at least try.\n\nAnd she has remained in the spotlight not by campaigning for any candidate the way Barack Obama did, but by peddling her book.\n\nWhile stiffing the media in 2024 — and paying the price for it — Harris has now done interviews with more reporters promoting her book “107 Days” than she did during the entire 107 days of her presidential campaign.\n\nAnd she’s only been on her book-selling tour for 40 days.\n\nShe apparently thought that the $1.5 billion she spent on her campaign would do the trick. It did not\n\nHarris spent the entire 107 days of her 2024 presidential campaign without holding a single official press conference, which must be something of a record.\n\nNow she loves the media, and reporters have to beat her off with a stick.\n\nVeteran political reporter Peter Lucas can be reached at: peter.lucas@bostonherald.com","summary":"If Kamala Harris campaigned for president the way she is storming the country selling her book, she might have become president.","url":"https://www.bostonherald.com/2025/11/08/lucas-kamalas-book-tour-trumps-2024-race/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/BHR-Z-GRAHAM-01.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-08 08:34:55","author":"Peter Lucas","authors":["Peter Lucas"],"language":"en","source_country":"US","sentiment":-0.331},{"id":377027136,"title":"Top five takeaways from Tuesday&#39;s elections","text":"Democrats had a big night Tuesday. What did we learn from the voters?\n\nHistory repeats itself\n\nThe historical trend in New Jersey and Virginia is that the party opposite the incumbent president wins the gubernatorial race. With voters electing a Democrat for governor while Republican President Trump is in office, the trend continues.\n\nThat said, Republicans should not brush off the results as a routine trend. One, the margins of victory were larger than most expected them to be in the final results. Republican Glenn Youngkin won four years ago when Democrat Joseph R. Biden was president, but he polled just above 50%. Democrat Abigail Spanberger won with more than 57% of the vote. That helped other Democrats win close elections throughout the commonwealth.\n\nAlthough the party opposite the White House typically wins the gubernatorial races in Virginia and New Jersey, it can often serve as a bellwether for the midterm elections.\n\nVoters elected Republican Christine Todd Whitman as governor a year after Democrat Bill Clinton was elected president. The following year, a wave of Republicans retook the House and Senate as well as many other governorships across the country. The same thing happened the year after Republican Chris Christie was elected governor in New Jersey, when Barack Obama was in his first year as president.\n\nIt also goes the other way. In 2017, Democrat Phil Murphy was elected governor of New Jersey when Republican Donald Trump was president. During the 2018 Democratic wave, Republicans lost the House and many gubernatorial races. The same thing happened after Democrat Jon Corzine was elected governor in 2005 while Republican George W. Bush was president. Voters in swing states seem to want to counter what they perceive as overreach by either party.\n\nTDS is high in Democratic strongholds\n\nProposition 50 is the California ballot initiative that suspends the maps for congressional districts drawn by an independent commission and replaces them with a gerrymandered map adopted by the state Legislature, which Democrats control. It passed overwhelmingly Tuesday and will cost Republicans House seats from California.\n\nAn exit poll conducted by The Associated Press showed that roughly 7 in 10 voters in California said party control of Congress was “very important” to them. Those voters overwhelmingly supported Proposition 50. The exit poll also showed that approximately 80% of voters who supported the measure said it was necessary to counter changes made by Republicans in other states. Only 20% said it was the best way to draw maps.\n\nCalifornia Gov. Gavin Newsom made his intentions clear before the vote when he said that if Democrats take the House majority in 2026, it will “end Donald Trump’s presidency as we know it.” This is just the latest phase in Trump derangement syndrome.\n\nThis phenomenon was also a clear factor in Northern Virginia. The voters in the suburbs of Washington not only gave a clear victory to Ms. Spanberger but also helped elect a Democrat who said he fantasized about putting two bullets in the head of a Republican House speaker. Usually, that would be a disqualification for a candidate seeking to be the state’s top prosecutor. Not in Northern Virginia. These people hate President Trump so much that they voted for Democrats across the board.\n\nHouse majority is in jeopardy\n\nMidterm elections are historically tough for the party of the incumbent president. That got much harder after Tuesday. New maps in California will likely cost the Republican Party several seats in the House. The massive blue wave in Virginia also will fuel the move to redraw boundaries there in a way that will make it very difficult for Republicans to hold on to several seats.\n\nPersonality matters\n\nZohran Mamdani is a charismatic candidate. His social media campaign was outstanding. He comes across as likable and was discussing issues that many voters care about.\n\nAfter the 2024 elections, I warned that many of the inroads made with younger voters were based on personality, not policy. Authenticity is a big deal, and they viewed Mr. Trump as genuine and Vice President Kamala Harris as a fraud. Mayor-elect Mamdani embraced his personality-driven brand of socialism, and younger voters liked it.\n\nThat said, New York City is a liberal place. Ms. Harris received two-thirds of the vote there last November. Overall, the rest of the mayoral vote was split between a Republican and a disgraced former governor who was running under a third-party banner. Conservatives need to recruit charismatic candidates.\n\nWages and prices are the big issues\n\nJames Carville famously said during the 1992 presidential campaign, “It’s the economy, stupid.” He was right. Now it’s all about higher wages and lower prices.\n\nTo avoid a blue wave next fall, Republicans must focus on wages and prices. People are genuinely concerned about these issues. They must see results as well as plans for the future. Thankfully, conservatives have answers. Let’s get to work!\n\n• Scott Walker is president of Young America’s Foundation. He served as the 45th governor of Wisconsin.","summary":"Top five takeaways from Tuesday&#39;s elections","url":"https://www.washingtontimes.com/news/2025/nov/6/top-five-takeaways-tuesdays-elections/","image":"https://media.washtimes.com/media/image/2025/11/05/Election_2025_55203.jpg","video":null,"publish_date":"2025-11-08 08:33:33","author":"Scott Walker","authors":["Scott Walker"],"language":"en","category":"sports","source_country":"ie","sentiment":-0.022},{"id":377027142,"title":"Debra Saunders- Trumps biggest election loss happened in California","text":"WASHINGTON — How did Proposition 50, the California redistricting ballot measure, pass handily this week when Golden State voters initially disapproved of the measure?\n\n“There were any number of people who were not paying any damned attention,” former Republican Gov. Pete Wilson told me over the phone Wednesday.\n\nMoney-wise, the campaign to fight Gov. Gavin Newsom’s pet measure was running on empty, Wilson explained, while the “yes” campaign was rolling in other people’s money. “The Democrats did not only have the money, but they spent it,” Wilson offered, as he touched upon conservative discontent about the weak “No on 50” campaign.\n\nLike everything in American politics today, this episode starts with President Donald Trump, who pushed Texas and other red states to adopt new district maps mid-decade to stack the House deck in the GOP’s favor. The general practice is to redistrict after the decennial census.\n\nIn short, Trump invited the Golden State’s backlash.\n\nNearly 64% of voters supported Newsom’s “Election Rigging Response Act.” Many were especially ready to go to war against Trump because they believed the ICE raids he sanctioned were too aggressive. (But really, many progressives do not believe federal immigration law should be enforced at all.)\n\nThe problem is, Newsom doubled down on an already rigged setup — one tilted in his party’s favor.\n\nThe California system disproportionately favors Democrats, despite a 2010 reform measure that transferred the drawing of district maps to an independent citizens commission.\n\nUnder the pre-Proposition 50 system, California’s delegation in the House of Representatives consists of 43 Democrats and nine Republicans. That ratio doesn’t come close to matching statewide partisan makeup. In 2024, 58% of Golden State voters supported Vice President Kamala Harris and 38% voted for Trump.\n\nSoon, Newsom and those who supported Prop 50 will be able to boast that they moved the divide to 48 or 49 Ds versus four or five Rs. That would leave the GOP with less than 10 percent of the delegation.\n\nDouble-rigging, that’s Newsom’s idea of the outcome of “fair and free” elections.\n\nIt would be wrong to leave out Newsom’s most infamous act of having his cake and eating it too.\n\nReaders may recall that in 2020, while he was telling his constituents to avoid Thanksgiving get-togethers to prevent the spread of COVID-19, Gov. Handsome dined with fellow big shots at the tony French Laundry. Because he could.\n\nWilson is especially mindful of the disparity of campaign funding for and against Proposition 50. “All told, proponents spent roughly $99 million on advertising online and on television compared with nearly $39 million in opposition, according to data from AdImpact, an ad-tracking service,” The New York Times reported.\n\nAll that talk about big money favoring the right. Not in California.\n\n“The business community are the biggest wimps in the world,” political strategist and Wilson whisperer Sean T. Walsh noted, “and they can so easily be intimidated.”\n\nThat’s another way Newsom is so very much like Trump.\n\nDitto Gavin Newsom. Trump’s maneuver backfired completely. And now Newsom — not former Vice President and California Sen. Kamala Harris — is the likely Democratic front-runner in the 2028 race for the White House.\n\nSure, the next Republican nominee can slam Newsom for California’s dysfunction: The High-Speed Rail project, also known as the Train to Nowhere. The lack of affordability and the huge number of illegal immigrants who think that ICE has no right to arrest them for breaking immigration laws.\n\nNewsom will make a big target. But he’ll be cushioned by all the millions he is likely to draw thanks to Trump’s blunder. And he’ll be able to tell the country that he went up against Trump and won.\n\nContact Review-Journal Washington columnist Debra J. Saunders at dsaunders@reviewjournal.com. Follow @debrajsaunders on X.","summary":"Debra Saunders- Trumps biggest election loss happened in California","url":"https://www.presstelegram.com/2025/11/07/debra-saunders-trumps-biggest-election-loss-happened-in-california/","image":"https://www.presstelegram.com/wp-content/uploads/2025/08/OCR-L-CALAWSUITS-0813.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-08 08:32:59","author":"Gqlshare","authors":["Gqlshare"],"language":"en","source_country":"ie","sentiment":-0.22},{"id":376960504,"title":"JFK's grandson Jack Schlossberg looks to continue family dynasty with Congressional run: 'It's happening'","text":"President John F. Kennedy's grandson Jack Schlossberg looks to continue his family's political dynasty as he gears up to run for Congress. \n\nThe 32-year old social media personality looks set to announce his bid to take the open House seat in New York's 12th Congressional District.\n\nSchlossberg announced he was forming an exploratory committee in September and will announce his bid next week, Politico reported. \n\n'It's happening,' a source told the outlet, with another adding that he's already begun hiring campaign staffers and discussed the run with at least one elected official. \n\nThe Daily Mail has reached out to Schlossberg for comment. \n\nSchlossberg rose to TikTok and Instagram fame as a liberal heartthrob by sharing hunky shirtless photos and quirky clips of himself practicing ballet, hoverboarding while reciting poetry and even opening a coconut in Hawaii with his bare hands. \n\nHe would enter what is expected to be a crowded race to replace 78-year-old Jerrold Nadler, one of the oldest members in the Democratic caucus, who is retiring after 34 years in office.\n\nThe Democrats set to run in a district Kamala Harris beat Donald Trump in by 64 points include two members of the state assembly, a city council member and 26-year-old Rhodes Scholar Liam Elkind.\n\nAnti-gun activist Cameron Kasky, former Trump attorney Michael Cohen and actress and former candidate for governor Cynthia Nixon are also rumored to be jumping in, while Chelsea Clinton declined a run despite rumors to the contrary. \n\nThe 32-year-old is a graduate of both Harvard and Yale, and has been active in progressive politics, as well as the media. Schlossberg is the son of JFK's daughter Caroline Kennedy.\n\nSchlossberg spoke at the 2024 Democratic National Convention, and frequently criticizes his cousin Robert F. Kennedy Jr., who presently serves as President Donald Trump's Health and Human Services secretary. \n\nHis critiques are part of an active social media life, as Schlossberg has over 171,000 followers on X, 721,000 on Instagram and 835,000 on TikTok. \n\nHe has also been appointed to the America 250 Commission by Senate Minority Leader Chuck Schumer. \n\nNadler said last month of his potential successor that 'there's nothing particularly good or bad about a Kennedy holding my seat. \n\n'But the Kennedy, unlike Schlossberg, should be somebody with a record of public service, a record of public accomplishment, and he doesn't have one.' \n\nThe future of the historically safe seat for Democrats will likely be set in the Democratic primary scheduled for June 23, 2026. \n\nNadler, 78, has represented New York City's Upper West Side for over three decades, and his decision comes as the Big Apple has been steadily swinging towards younger socialist leaders such as Congresswoman Alexandria Ocasio-Cortez and New York City Mayor-Elect Zohran Mamdani. \n\nIn an interview with The New York Times, Nadler cited the spectacle made of former President Joe Biden's cognitive decline as a key reason for his decision to announce his departure from Congress.\n\nBiden's disastrous performance in last year's presidential debate escalated the scrutiny of the age and health of top leaders in the Democrat party.\n\n'Watching the Biden thing really said something about the necessity for generational change in the party, and I think I want to respect that,' Nadler noted to the New York Times. \n\nHe added that a younger successor 'can maybe do better, can maybe help us more.' \n\n'This decision has not been easy. But I know in my heart it is the right one and that it is the right time to pass the torch to a new generation,' Nadler noted in a statement issued by his office Tuesday announcing the end of his political career.\n\nSchlossberg is the son of Caroline Kennedy, the only daughter of Jackie Kennedy Onassis and JFK - who was five years old when her father was assassinated in 1963.\n\nHe has long shown an interest in politics, mingling with top officials at a young age alongside his famous mom and delivering numerous politically-driven speeches over the years.\n\nHe gained attention in June 2023 when he went on a harsh rant against RFK Jr. after the now-Health Secretary announced he was running for president.","summary":"The 32-year old social media personality and only grandson of President John F Kennedy appears set to announce his bid to take the open House seat in New York's 12th Congressional District.","url":"https://www.dailymail.co.uk/news/article-15271085/Kennedy-heir-Jack-Schlossberg-bid-NYC-seat.html","image":"https://i.dailymail.co.uk/1s/2025/11/08/02/103702407-0-image-m-13_1762569473696.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/18/5159222992184167759/1024x576_MP4_5159222992184167759.mp4","publish_date":"2025-11-08 07:03:49","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","source_country":"gb","sentiment":0.339},{"id":376942496,"title":"Biden says Trump ‘embarrasses’ US","text":"\"I just want you to know [that] you work for us, Mr. President. We don't work for you. You work for us, not just billionaires and millionaires. I mean, sincerely, I'm angry. This is democracy, and the fact of the matter is that there are no kings in democracies, none. But you act in a way that embarrasses us as a nation,\" Biden said at a Democratic Party event in Omaha, Nebraska.\n\nThe former US leader compared the recent demolition of the East Wing of the White House to Trump's approach to the entire country. \"Did anyone see what he's done to the East Wing of the White House? It's a perfect symbol of his presidency,\" Biden said, TASS reported.\n\nIn his opinion, Trump is doing the same thing with \"the Constitution, the rule of law, and democracy.\"\n\nBiden served as president from 2021 to 2025. He had initially planned to seek re-election but withdrew from the race after a disastrous performance in the debate with Trump. Kamala Harris replaced him in the presidential race but lost to Trump in the November 2025 election.\n\nIn May, Biden's office announced that the former president had been diagnosed with an aggressive form of prostate cancer. In September, he underwent surgery to remove malignant tumors on his skin. In October, CBS News reported that Biden had finished radiation therapy for prostate cancer.","summary":"TEHRAN, Nov. 08 (MNA) – Former US President Joe Biden accused current US leader Donald Trump of embarrassing the country.","url":"https://en.mehrnews.com/news/238518/Biden-says-Trump-embarrasses-US","image":"https://media.mehrnews.com/d/2024/07/08/4/5070688.jpg?ts=1720446659581","video":null,"publish_date":"2025-11-08 06:22:04","author":null,"language":"en","category":"politics","source_country":"ir","sentiment":-0.377},{"id":377032956,"title":"Biden says Trump ‘embarrasses’ US","text":"NEW YORK, November 8. /TASS/. Former US President Joe Biden accused current US leader Donald Trump of embarrassing the country.\n\n\"I just want you to know [that] you work for us, Mr. President. We don't work for you. You work for us, not just billionaires and millionaires. I mean, sincerely, I'm angry. This is democracy, and the fact of the matter is that there are no kings in democracies, none. But you act in a way that embarrasses us as a nation,\" Biden said at a Democratic Party event in Omaha, Nebraska.\n\nThe former US leader compared the recent demolition of the East Wing of the White House to Trump's approach to the entire country. \"Did anyone see what he's done to the East Wing of the White House? It's a perfect symbol of his presidency,\" Biden said. In his opinion, Trump is doing the same thing with \"the Constitution, the rule of law, and democracy.\"\n\nBiden served as president from 2021 to 2025. He had initially planned to seek re-election but withdrew from the race after a disastrous performance in the debate with Trump. Kamala Harris replaced him in the presidential race but lost to Trump in the November 2025 election.\n\nIn May, Biden's office announced that the former president had been diagnosed with an aggressive form of prostate cancer. In September, he underwent surgery to remove malignant tumors on his skin. In October, CBS News reported that Biden had finished radiation therapy for prostate cancer.","summary":"The head of state should work for citizens, not just billionaires and millionaires, the former US president emphasized.","url":"https://tass.com/world/2040863","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20251108/1457943.jpg","video":null,"publish_date":"2025-11-08 05:41:48","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.42},{"id":376921870,"title":"US: Israeli Military Lawyers Warn of War Crimes Evidence in Gaza","text":"TEMPO, Jakarta - US-gathered intelligence last year showed that Israeli military lawyers warned of evidence that could support allegations of war crimes against Israel in the Gaza genocide - an operation that relied on weapons supplied by the US, according to five former US officials, as cited by Al Arabiya.The previously unreported intelligence data-described by the former officials as one of the most shocking pieces of information shared with top US policymakers during the war-shows doubts about the legality of Israel's military tactics.Two former US officials said that the material was widely circulated within the US government ahead of the December 2024 US Congress briefing.The intelligence deepened Washington's concerns about Israel's brutality in a war claimed to be necessary to eradicate Palestinian Hamas fighters. US intelligence indicated concerns that Israel deliberately targeted civilians and humanitarian workers under the pretext of eliminating Hamas, a potential war crime that could drag Washington in.US officials expressed concerns about the findings, particularly as the civilian death toll in Gaza increased. They feared that Israel's operation might violate international legal standards on acceptable collateral damage.Israel has killed more than 68,000 Palestinian citizens during the two-year genocide, according to Gaza health officials, the majority of the casualties being women and children. The Israeli military claimed at least 20,000 casualties were combatants, but could not provide evidence.Meanwhile, Gaza authorities reported that a third of the total casualties were children. Gaza authority data was corroborated by the UN and other international organizations.US Internal RiftThe report was based on interviews with nine former US officials in the administration of then-President Joe Biden, including six with direct knowledge of the intelligence and subsequent debates within the US government. All spoke on condition of anonymity due to the sensitivity of the issue.Reports of internal US government disagreements over Israel's genocide in Gaza emerged during the Biden presidency. Based on detailed recollections from those involved, the report offers a fuller picture of the intensity of the debates in the final weeks of the administration, which ended with the inauguration of President Donald Trump in January.The debate became increasingly intense in the final days of the Biden administration.The intelligence information prompted interagency meetings at the US National Security Council (NSC), where officials and lawyers debated how and whether to respond to the new findings.US findings that Israel committed war crimes would require, under US law, a halt to future weapons shipments and a cessation of intelligence sharing with Israel. Israeli intelligence agencies have closely cooperated with the US for decades and provided crucial information, particularly about events in the Middle East.Biden administration discussions in December involved officials from across the government, including the State Department, Pentagon, intelligence community, and the White House. Biden was also briefed on the issue by his national security advisors.The debate in America about whether Israel committed war crimes in Gaza ended when attorneys from across the US government decided that it was still lawful for the US to continue supporting Israel with weapons and intelligence. They argued that the US had not gathered its own evidence that Israel had violated the laws of armed conflict, according to three former US officials.They argued that US-gathered intelligence and evidence did not prove that Israel had intentionally killed civilians and humanitarian workers or blocked aid, which are key factors in legal accountability.Some senior officials in the Biden administration were concerned that an official US finding of Israeli war crimes would force Washington to stop arms and intelligence support-a move they feared could embolden Hamas, delay ceasefire negotiations, and shift the political narrative in favor of the militant group.President Trump and his officials were briefed by the Biden team on the intelligence but showed little interest in the subject after taking over in January and began to strongly favor Israel, the former US officials said.Israeli War CrimesLast November, the International Criminal Court (ICC) in The Hague issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former defense chief Yoav Gallant, as well as Hamas leader Mohammed Deif, for alleged war crimes and crimes against humanity in the Gaza conflict.Hamas later confirmed that Israel had killed Deif.Israel has rejected the jurisdiction of the Hague-based court and denied war crimes in Gaza. Hamas leaders also dismissed accusations that they committed war crimes.Among the issues debated by US officials in the final weeks of the Biden administration was whether the government would engage if Israeli officials faced charges in international courts, according to those familiar with the debates.Israel, which is fighting a genocide case in the International Court of Justice, dismissed charges of genocide as politically motivated. They claimed their military strikes targeted Hamas, not civilian Gaza residents. Israel said it had taken steps to minimize civilian casualties and said Hamas fighters hid among civilians.US officials publicly defended Israel but also privately debated the issue based on intelligence reports, which became a political weak point for the Democratic Party. Biden and then-Vice President Kamala Harris launched a presidential campaign that ultimately failed.Biden did not respond to requests for comment.Editor’s Choice: Francesca Albanese Alleges 63 Countries Complicit in Gaza GenocideClick here to get the latest news updates from Tempo on Google News","summary":"A report on US intelligence from last year reveals that Israeli military lawyers warned of evidence that support allegations of war crimes in Gaza.","url":"https://en.tempo.co/read/2063982/us-israeli-military-lawyers-warn-of-war-crimes-evidence-in-gaza","image":"https://statik.tempo.co/data/2025/08/24/id_1423276/1423276_720.jpg","video":null,"publish_date":"2025-11-08 04:31:10","author":"Sita Planasari","authors":["Sita Planasari"],"language":"en","category":"politics","source_country":"id","sentiment":-0.082},{"id":376943052,"title":"Trump, not Nigeria, is of particular concern to the world","text":"Since Ukranian President Volodymyr Zelensky’s ugly encounter with American President Donald Trump in the latter’s Oval Office in Washington DC on February 28, I have come to the conclusion that the American President is a bully who thinks nothing more of power than a tool for oppression. In the midst of Ukraine’s war with Russia, President Zelensky had visited Trump at the White House to discuss a minerals agreement and secure continued US support for Ukraine in her fight against Russia’s invasion. But about 40 minutes into the meeting and in front of dozens of cameras in the room, Zelensky found himself sandwiched between President Trump and his deputy, J.D. Vance, as they derailed the meeting and minerals deal and descended on their guest in an unprecedented public confrontation between an American President and a foreign head of state.\n\nTrump, a supposed ally of Zelensky in Ukraine’s war with Russia following the latter’s invasion of the former’s territory, wanted Ukraine to agree on a ceasefire with Russia in order to halt hostilities and work towards a comprehensive peace deal. Trump, a known friend of Russian President Vladimir Putin, suddenly came to the decision that Ukraine was to blame for Russia’s invasion of her territory. He then went on to tag Zelensky, the weaker party in the dispute, as a dictator! Nearly all of US allies, along with other global figures, voiced their support for Zelensky, with many issuing statements to rebuke Trump for his confrontational disposition.\n\nThree months later, it was the turn of South African President Cyril Ramaphosa to get the Trump treatment. In a pure case of ambush, President Trump, in the middle of a meeting with Ramaphosa inside the same Oval Office at the White House, called for the lights to be dimmed so he could play a video to back up allegations of genocide against white South Africans. A thoroughly embarrassed Ramaphosa sat mouth agape as Trump hauled at him allegations of racism and mass murder of white South African farmers. The South African President tried to push back on Trump’s assertion, admitting that there is “criminality” in the country but most of the victims are black, but Trump was neither persuaded nor convinced.\n\nREAD ALSO; FULL LIST: Burna Boy, Wizkid, Davido, Ayra Starr, others nominated for 2026 Grammy awards\n\nThe same Trump has engaged China, Canada and other countries around the world in unwarranted diplomatic rows, embarrassing his countrymen and almost subjecting them to ridicule in a tax war with China. A man whose successive marriage to three different women collapses is certainly the one in need of self introspection.\n\nAs it has turned out, Nigeria is confronted with the fate that befell South Africa at Trump’s hands with another unfounded allegation of genocide against Christians leveled by Trump against the Tinubu administration. The American president had Friday last week shocked the country with a post on X (formerly Twitter), accusing Nigeria of genocide against its Christian population. And while the populace was trying to come to terms with the bombshell from the blue, he made another post, threatening to invade the country with American soldiers “gun-a-blazing”.\n\nOrdinarily, news of American soldiers coming to complement the efforts of our armed forces in the bid to end the reign of terror that has been unleashed on the nation for more than one and a half decades should gladden the heart. But the antecedents of both Trump and America in such matters would be a cause for concern for any patriot. Similar interventions in Iraq, Afghanistan, Libya and other countries before now have ended in regrets for the populace. In most cases, the interventions are based on fallacies aimed at pursuing the selfish economic agenda of America.\n\nIn the case of Nigeria, there are already enough grounds to believe that the fate that awaits it in the event of an intervention would not be any different from those of Libya, Iraq, Syria and Afghanistan where America had previously called the dog a bad name in order to hang it.\n\nA more viable option would be that America supports our armed forces with cutting edge arms and other military equipment to help our soldiers in the fight against terrorism. But while Trump is not oblivious of this alternative, he finds President Bola Ahmed Tinubu’s ‘sins’ against him and the American nation too serious to be dealt with remotely. Observers say he has not forgiven the Nigerian President over his alleged support along with other democrats like French President Emmanuel Macron for Kamala Harris, the democrats’ candidate in the election that brought Trump into office, for fear that Trump as American president would be a veritable threat to world peace.\n\nAdded to the foregoing is the quiet economic revolution the Tinubu government is steering in Nigeria. If any country or head of state is in love with the strides in the nation’s economic sphere, it certainly cannot be America or Trump. Before now, the US had reaped bountifully from refining our crude oil and exporting same to our country to deplete our foreign reserves. But with the Dangote Refinery now in full operation and other indigenous ones coming on board, the nation no longer has to depend on the US for her fuel needs. This does not only mean a huge loss of revenue for the US, it is also a huge loss of jobs for its populace. Many US refineries whose survival depended on Nigeria’s crude are said to have folded up. Besides, the naira has stabilised and has continued to appreciate against the dollar.\n\nIt will be clear from the foregoing that Trump’s outbursts and threats against Nigeria are products of a frustrated mind.","summary":"Since Ukranian President Volodymyr Zelensky&#8217;s ugly encounter with American President Donald Trump in the latter&#8217;s Oval Office in Washington DC on February 28, I have come to the conclusion that\n\n\nThe post Trump, not Nigeria, is of particular concern to the world appeared first on The Nation Newspaper.","url":"https://thenationonlineng.net/trump-not-nigeria-is-of-particular-concern-to-the-world/","image":"https://cdn.thenationonlineng.net/wp-content/uploads/2025/10/18050002/Vincent-Akanmode.png","video":null,"publish_date":"2025-11-08 04:08:11","author":"The Nation,Vincent Akanmode","authors":["The Nation","Vincent Akanmode"],"language":"en","source_country":"ng","sentiment":-0.152},{"id":376947890,"title":"Mamdani’s All-Female Fantasy","text":"Zohran Mamdani’s announcement of an all-female transition team was greeted with predictable applause. The message was clear: competence now comes with a gender. But behind the standing ovations lies a more insidious suggestion — that women, by virtue of being women, are not just equal to men, but better. More trustworthy. More capable. More moral. It’s the new secular gospel of politics: salvation through representation.\n\nBut is it true? Are women inherently wiser, kinder, or more competent than men? If so, history has a strange way of hiding it.\n\nTake Jacinda Ardern, once the darling of global progressivism — feted as the empathetic antidote to “toxic masculinity.” Yet under her leadership, New Zealand’s economy floundered, its mental health crisis worsened, and its COVID policies resembled house arrest more than public health. She promised kindness; she delivered curfews. Ardern was not a tyrant, but she proved that empathy alone cannot run a nation — any more than testosterone alone can. Her resignation was billed as “graceful.” Others might call it “strategic retreat.”\n\nOr Liz Truss, who managed to crash the British economy in less time than it takes to roast a Christmas turkey. Six weeks. That’s how long it took her to vaporize market confidence and resign in disgrace. The media called her “a symbol of systemic failure.” Feminists called her “a victim of sexism.” The rest of us simply called her a poor leader. Angela Merkel survived the euro crisis with Teutonic discipline, then threw open the doors and invited half the world to move in. What began as a humanitarian gesture became a housing crisis with subtitles. Overnight, Europe went from Mozart to muezzins, from beer gardens to border patrols. Cities that once fretted over carbon emissions now fret over knife attacks. Merkel called it compassion; history may call it continental self-harm. Then there’s Kamala Harris, a politician buoyed by firsts: first woman, first Black woman, first woman of color to hold the vice presidency. But history will remember her not for breaking ceilings, but for breaking sentences. Her tenure dissolved in a fog of platitudes and nervous laughter. To call her a model of competence was always to confuse volume with vision.\n\nAnd she’s hardly alone. Argentina once pinned its hopes on Cristina Fernández de Kirchner, whose populism left the economy gasping for air while corruption ran a marathon. Imelda Marcos turned the Philippine treasury into a shoe closet. Marie Antoinette mistook starvation for bad manners. Even Eva Perón — immortalized in song — left a legacy more theatrical than transformative.\n\nNone of this is to deny women’s achievements. Margaret Thatcher rebuilt Britain’s backbone when men around her folded. Golda Meir held Israel together under siege. These were not “female leaders” so much as formidable ones, whose competence owed nothing to chromosomes and everything to conviction.\n\nBut that’s precisely the point. Competence has never been gendered. The myth that women lead with “heart” while men lead with “ego” is as reductive as it is patronizing. It assumes that compassion and logic, empathy and authority, cannot coexist in one person — when, in truth, the best leaders embody both. Churchill could weep and roar. Thatcher could mother and maul. Power does not rewrite nature; it reveals it.\n\nThe modern fetish for “all-female” teams, panels, boards, and cabinets is less about equality than optics. It’s virtue-signaling in high heels — an aesthetic of morality rather than its substance. Diversity by subtraction: if men are the problem, just remove them. One can almost picture Mamdani’s advisors leaning in, whispering sweet nonsense into his ear — and he listened. After all, he understands the times: an age where virtue is a brand, politics is performance art, and governing is influencer culture with a taxpayer-funded ring light. Purity isn’t moral anymore; it’s merchandised. (RELATED: Five Quick Things: The Mamdani Matriarchy Sets Up Shop In NYC)\n\nTo suggest that an all-female team is inherently more capable is to wander perilously close to biological essentialism — the very sin feminism once opposed. Women possess remarkable attributes — resilience, intuition, grace under pressure — qualities the world sorely needs. But they do not have a monopoly on them. Men possess courage, composure, and conviction — qualities shared, not owned. The point is not that men and women are the same, but that neither sex holds a moral monopoly on virtue or vice. Cleopatra and Catherine the Great were brilliant — and ruthless. Mother Teresa embodied mercy; Queen Mary burned heretics. Gender never guaranteed goodness, only complexity.\n\nNew York doesn’t need a sisterhood of salvation; it needs a functioning city hall. Government is not a therapy circle. It’s an arena of competing interests, where ideology must meet reality — and reality doesn’t tick boxes, it kicks them over.\n\nIf Mamdani truly believes that the best person for every job just happens to be a woman, then fine. But if his all-female team was assembled to prove a point rather than solve a problem, then New York is in for a rude awakening. Symbolism makes for stirring headlines, but it rarely fills potholes or fixes budgets. It’s easy to pick a team that looks virtuous; it’s harder to build one that actually works.\n\nREAD MORE from John Mac Ghlionn:\n\nDesigner Babies and a Brave New Biopolitics\n\nComrade With a Condo: The Mamdani Myth Exposed\n\nThe Armed Awakening of America’s Radical Left","summary":"Zohran Mamdani’s announcement of an all-female transition team was greeted with predictable applause. The message was clear: competence now comes...","url":"https://spectator.org/mamdanis-all-female-fantasy/","image":"https://spectator.org/wp-content/uploads/2025/11/248-Zohran-Mamdani-reveals-all-female-transition-team-at-Queens-press-conference-YouTube-0_02.png","video":null,"publish_date":"2025-11-08 03:04:55","author":"John Mac Ghlionn","authors":["John Mac Ghlionn"],"language":"en","source_country":"US","sentiment":-0.154},{"id":376913250,"title":"Rep. Al Green switches congressional districts in bid for reelection","text":"HOUSTON — U.S. Rep. Al Green announced Friday that he plans to run in the redrawn 18th Congressional District, setting up a competitive primary between the longtime Houston Democrat and whichever candidate wins the upcoming special election runoff to decide the seat’s occupant through the end of next year.\n\nGreen began his speech not by talking about himself, but of President Donald Trump. \n\n“This democracy belongs to the people, it doesn’t belong to one man,” Green said from a Southwest Houston hotel. “He is an authoritarian, and we are going to make sure that he knows that the people in the 18th Congressional District are going to send somebody to Congress that he fears.”\n\nGreen has been a strong advocate of the effort to impeach Trump, and he said continuing to criticize the president will be one of his priorities if he secures another term in Congress — but he’s facing a crowded race. \n\nHarris County Attorney Christian Menefee and former Houston City Council member Amanda Edwards, both Democrats, finished atop a field of 16 candidates in Tuesday’s election to fill out the remainder of late Rep. Sylvester Turner’s term representing the district under its old lines. Green plans to run in the March primary, which will be held under the 18th District’s new boundaries created by Republicans’ mid-cycle redistricting this summer. Menefee has already announced he plans to run in the March primary, which will take place weeks after the runoff. Edwards has yet to reveal her plans beyond the special election.\n\nGreen has represented Texas’ 9th Congressional District — anchored in the southern parts of Houston — since 2005. But that district was redrawn by Texas Republicans in their new congressional map to favor the GOP, and its boundaries were moved to eastern Harris County and Liberty County, pulling in almost none of the same area as before. The new 9th Congressional District went from voting for Kamala Harris in 2024 by 44 percentage points to one that President Donald Trump would have carried by a 20-point margin under the new lines.\n\nMuch of Green’s turf in the old 9th District was drawn into the new 18th District, including Central Southwest Houston, NRG Stadium and Missouri City. It’s a deep-blue district with a long history of Black representation, having sent titans including former Reps. Barbara Jordan and Mickey Leland. The new 18th District would have voted for Harris by a 54-point margin in 2024 had it existed. \n\nBut the 18th District is currently vacant after Turner, the former mayor of Houston, died in office in March, two months into his first term. Turner himself had been nominated for the seat by Harris County Democratic Party officials after the district’s longtime representative, Sheila Jackson Lee, died in office in July 2024. \n\nGreen said he worked alongside Jackson Lee representing their respective districts for years. Now that their districts have merged, Green said “in her absence, I am going to carry on the fight for the 18th and 9th Congressional District — on the north side of the south side.”\n\nWith two of the district’s septuagenarian representatives dying in office within the course of a year, age — an uncomfortable but public fault line in the Democratic Party since then-President Joe Biden’s disastrous presidential debate performance — will almost certainly factor into a prospective primary. Green is 78, and will be 79 by the time winners of the 2026 election are sworn in in 2027. The Democrats competing to represent the current iteration of the 18th Congressional District are considerably younger; Edwards is 43, while Menefee is 37.\n\nA running theme among the slate of speakers who spoke before Green took the stage Friday evening, including California Congresswoman Maxine Waters and Mississippi Congressman Bennie Thompson, was “seniority matters.”\n\nGreen would bring many advantages of incumbency to the primary, as a Houston congressman of 20 years with a national profile over his efforts to impeach Trump and his disruption of the State of the Union address earlier this year, for which he got kicked out of the chamber. Under the new map, 75% of registered voters in Green’s current district — including himself — have been moved into Congressional District 18.\n\nHis experience, Green said, is why Houstonians should trust that he’s fit for the job. \n\n“You know what I have done, you know what I will do,” he said. “You know that I will stand up to Donald Trump because you saw me do it. Stand because you’ve seen me do it.\n\nIn August, Green heavily hinted that he planned to run in the 18th District, noting that he and the majority of his constituents had changed district numbers, but he said he would not announce his plans until after the Nov. 4 special election to avoid confusing Houstonians. \n\nCandidates can begin filing Saturday for a spot on the 2026 primary ballot, the start of a monthlong window that runs until Dec. 8. The timing ensures that Edwards and any other prospective candidates will need to decide whether to put their name on the ballot before their runoff election.\n\nThough Green brings high name identification and a decades-long history of representing Houston, the prospect of defeating a Democratic incumbent in Houston has precedent. A former Houston NAACP president, Green first captured his congressional seat after winning a primary against an incumbent Democrat, Chris Bell, whose southwestern Houston district had been redrawn by Republicans. \n\nBut Green is hopeful that his track record in his two decades in office will be enough to get him elected for another term in a different district. \n\nHe also made a promise if he’s reelected to Congress. \n\n“When I go back to Congress, I promise you, I will file additional articles of impeachment to remove Donald Trump,” he said.","summary":"The veteran lawmaker whose current district was redrawn to benefit Republicans would face the winner of the 18th Congressional District special election runoff.","url":"https://www.texastribune.org/2025/11/07/texas-al-green-congessional-district-18/","image":"https://i0.wp.com/www.texastribune.org/wp-content/uploads/2025/11/0731-Jeffries-Dems-Presser-BD-17-scaled.jpg?fit=2560%2C1707&quality=89&ssl=1","video":null,"publish_date":"2025-11-08 02:52:09","author":"By Gabby Birenbaum and Colleen DeGuzman","authors":["By Gabby Birenbaum and Colleen DeGuzman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.12},{"id":376909844,"title":"Trump’s beef with foreign meat packers? They ‘drive up prices’, he claims","text":"US President Donald Trump has accused foreign-owned meat packers of driving up the price of beef in the United States and asked the Department of Justice to open an investigation.\nTrump announced the move on social media on Friday, days after his Republican Party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living.\nBut experts said it was unlikely that an investigation would result in lower prices at grocery stores and a trade group representing meat packers said they were not to blame.\nTrump did not present evidence for his claims, writing on social media that “I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation.”\n\nHe said he was taking the action to help ranchers who were recently angered by his suggestion that the US would buy Argentine beef to bring down stubbornly high prices for American consumers.\n“We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardise the security of our Nation’s food supply,” Trump wrote.\nWhy US beef prices have climbed\nBeef prices have soared to record levels in part after drought and years of low prices led to the smallest US herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.\nMeanwhile, demand for beef remains strong. Prices are high because consumers wanted to eat it, and they were willing and able to pay for it, said Glynn Tonsor, who leads the Meat Demand Monitor at Kansas State University.\nTonsor said the ownership mix in the meat packing industry had not changed significantly in the past four years.\n\nConcentration in the meat packing business has been a long-time concern for farmers and politicians on both sides of the aisle. Four major meatpacking companies dominate the beef market in the US.\nThere was no evidence to back up claims that the big packers had undue market power and used it to drive up beef prices, said Derrell Peel, an agricultural economist at Oklahoma State University.\n“The packing industry in this country has been investigated and researched for 50 years, and it’s been an issue for over a hundred years, at least, for some producers,” Peel said, expressing scepticism that consumers or producers would benefit from the investigation Trump announced.\n“If the outcome is to break up the big packers, the outcome will be higher beef prices for consumers and lower cattle prices for producers,” Peel said.\n\nOklahoma Senator Markwayne Mullin said on Friday that he and fellow Republican senators Cindy Hyde-Smith of Mississippi and Tim Sheehy of Montana visited the White House earlier in the day to speak with Trump about recent volatility in the beef market. Mullin said Trump agreed to have the Justice Department look at the issue.\nMullin blamed meat processors, saying that “we’re seeing the same exact game play again out” as a 2019 lawsuit against large meatpackers for violating antitrust laws.\nJBS, which is based in Brazil, is the largest US beef producer and its second-largest producer of poultry and pork. Half of its annual revenue comes from the US, where it has more than 72,000 employees.\nThe company has faced price-fixing charges before. In 2022, JBS agreed to a US$52.5 million settlement with grocery stores and wholesalers who accused JBS, Arkansas-based Tyson Foods and other companies of working together to suppress the number of cattle being slaughtered to drive up beef prices.\n\nJBS did not admit wrongdoing as part of that settlement. Messages seeking comment were left on Friday with JBS USA.\nRepublican Senator Kevin Cramer last week called on the administration to renew an investigation into meat packers that was opened in Trump’s first term. Cramer’s office said he had pushed for such an inquiry since March 2020.\nThe Meat Institute, a trade group that represents JBS and other meat producers, said its industry was being pinched by the price of cattle, despite record prices for US beef.\n“For more than a year, beef packers have been operating at a loss due to a tight cattle supply and strong demand,” Meat Institute President and CEO Julie Anna Potts said in a statement.\n“The beef industry is heavily regulated, and market transactions are transparent. The government’s own data from USDA confirms that the beef packing sector is experiencing catastrophic losses and experts predict this will continue into 2026.”\nTrump’s accusations have renewed a bipartisan presidential fight against rising food prices.\nThen president Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry.\nAnd then vice-president Kamala Harris, who Trump defeated by winning re-election last year, used her campaign to vow to crack down on food producers and major supermarkets’ “price gouging”.","summary":"US President Donald Trump has accused foreign-owned meat packers of driving up the price of beef in the United States and asked the Department of Justice to open an investigation.\nTrump announced the move on social media on Friday, days after his Republican Party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living.\nBut experts said it was unlikely that an investigation would result in lower prices at...","url":"https://www.scmp.com/news/world/united-states-canada/article/3332017/trumps-beef-foreign-meat-packers-they-drive-prices-he-claims","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/08/cac57f0f-cdc8-46fe-9758-f81a37c85687_eab4035b.jpg","video":null,"publish_date":"2025-11-08 02:18:59","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.116},{"id":376892842,"title":"Letters: This election repudiates Donald Trump and his policies","text":"Election rebukes Trump\nand his policies\n\nThis election was a huge Democratic victory and a repudiation of Donald Trump. Apparently, it never occurred to him that Americans would be appalled at:\n\n1. Masked ICE agents snatching their neighbors off the streets, many of whom were arrested because of the color of their skin. Some even turned out to be U.S. citizens.\n\n2. Hiring an antivaxxer and science denier, Robert F. Kennedy, Jr., to be in charge of the nation’s health.\n\n3. Targeting his political opponents by bringing frivolous, made-up charges.\n\n4. Starting a trade war with our friends, such as Canada and Mexico. He just raised Canadian tariffs simply because they played a Ronald Reagan commercial disparaging tariffs during the World Series.\n\n5. Sending the National Guard into cities in Democratic-run states on the pretext of crime preventionand against the will of the governors.\n\n6. Cutting back Medicare and Medicaid benefits to give huge tax cuts to his billionaire donors.\n\nArthur Straus\nWalnut Creek\n\nThe truth about\ndemocratic socialism\n\nRe: “Democrat Zohran Mamdani elected New York City mayor” (Page A3, Nov. 5).\n\nMany Americans don’t understand the difference between communists, socialists, and democratic socialists. Democratic socialists believe in a market-based capitalist economy run to benefit the majority, not the few. They advocate for a robust social safety net, government control over essential services like health care and policies to reduce economic inequality, such as higher taxes on the wealthy and corporations. They want universal health care, free higher education and to strengthen labor unions.\n\nWhile communism and some forms of socialism involve state control of everything, democratic socialism works within existing democratic structures to achieve its goals. It is opposed to the authoritarian communism of Russia and China.\n\nMany also worry that democratic socialism will slide into full-fledged socialism or some form of communism. That ignores long-established and respected Social Democratic Parties in Europe — the Labour Party in the UK and the Socialist Party in France, as well as left-of-center parties throughout Scandinavia.\n\nJim Wolpman\nWalnut Creek\n\nRestoring SNAP would\nbe best thing for Trump\n\nRe: “Congress must cement health care, food aid” and “Trump administration must prop up SNAP” (Page A6, Nov. 6).\n\nThank you, Jim Driggers and Ricardo Narvaez, for your recent letters advocating for SNAP, the government program providing food for needy children and families.\n\nObviously, Mr. Trump has never had to go without food due to a lack of money, so he cannot understand the meaning of hunger. Well, Mr. Trump, there are many people without the means to buy food who have used SNAP to feed their families. Do you really want to be seen as the wealthy leader responsible for starving American children?\n\nRestore SNAP.\n\nTari Nicholson\n\nFederal rules against\ngerrymandering needed\n\nMy party just put another nail in the coffin of democracy in California with Proposition 50.\n\nEven in high school, we learned that gerrymandering was undemocratic and unacceptable. It needs a non-political federal implementation of standard rules for all states. States’ rights are an issue, but these are elected federal positions and cannot be left up to the local political bias of states. It beats rolling in the mud with the rest of the country.\n\nIn the future, the California Democratic Party’s claim to defend democracy and protect all minorities (Republicans) will ring hollow.\n\nJames Roesler\n\nProgressive tide rolls\nin with election\n\nThe political tide has changed in America.\n\nZohran Mamdani’s emphatic victory over Andrew Cuomo shows that New Yorkers support progressive, for-the-people policies, over for-the-rich favoritism.\n\nDemocratic wins around the country — Virginia and New Jersey governors, races in Pennsylvania, Georgia and Virginia again, and Proposition 50 here, are all blows to Donald Trump’s nasty, erratic divisiveness.\n\nYet, the Democratic Party leadership resists progressive policies because they fear losing corporate campaign funds and are satisfied with the status quo. Chuck Schumer didn’t endorse Mamdani. Hakeem Jeffries only did so, and Barack Obama only called him at the last minute, after the outcome was clear.\n\nHad Kamala Harris supported progressive policies rather than spouting limp anti-Trump rhetoric, she would have won.\n\nThe only way for Democrats to win back power is to prioritize ordinary people’s needs, tax the shamefully rich and give first-time and younger voters reasons to support Democrats. It’s common sense.\n\nKeith Nakatani\n\nGaza tragedy must\nnever happen again\n\nRe: “It’s time to face the enormity of Gaza’s loss” (Page A13, Oct. 26).\n\nI can only imagine returning to the devastation that once was home in Gaza. Consider the whole Bay Area reduced to powder: Grace Cathedral, 680, Golden Gate Park — no more. Schools and hospitals — piles of concrete and rebar. No clean or running water, not even any pipes or treatment facilities. No toilets; no sewers. No food. Your home is now contaminated rubble. Can you even find the lot? Your pets?\n\nHow do you rebuild centuries of history, beauty, life and culture that have all been bombed to dust? Bring back whole families blasted out of existence? Help so many WCNSFs (Wounded Child No Surviving Family)? This, while Israel continues its bombing, torture, starvation, detention and land theft of innocent Palestinians.\n\nWe must find a way to reclaim the vibrancy and history of Palestine and ensure that “never again” will such obliteration be funded with our money and support.\n\nElizabeth Fisher\nPleasant Hill","summary":"Also: Democratic socialism &#124; The best thing &#124; Federal rules &#124; Progressive tide &#124; Gaza tragedy. East Bay Times reader letters to the editor for Nov. 9, 2025.","url":"https://www.mercurynews.com/2025/11/07/letters-election-repudiates-donald-trump-policies/","image":"https://www.mercurynews.com/wp-content/uploads/2025/11/LDN-L-VOTE-CENTERS-1102-13.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-08 00:30:39","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":0.009},{"id":376892336,"title":"Trump accuses foreign-owned meat packers of inflating US beef prices and calls for investigation","text":"President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation.\n\nThe Republican president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living. But experts said it's unlikely that an investigation would result in lower prices at grocery stores, and a trade group representing meat packers said they're not to blame.\n\nTrump did not present evidence for his claims, writing on social media that “I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation.”\n\nHe said he was taking the action to help ranchers, who were recently angered by his suggestion that the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers.\n\n“We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation’s food supply,” Trump said.\n\n Why beef prices have climbed \n\nBeef prices have soared to record levels in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.\n\nMeanwhile, demand for beef remains strong. Prices are high because consumers want to eat it, and they’re willing and able to pay for it, said Glynn Tonsor, who leads the Meat Demand Monitor at Kansas State University.\n\nTonsor said the ownership mix in the meat packing industry has not changed significantly in the past four years.\n\nConcentration in the meat packing business has been a longtime concern for farmers and politicians on both sides of the aisle. Four major meatpacking companies dominate the beef market in the United States.\n\nThere’s no evidence to back up claims that the big packers have undue market power and use it to drive up beef prices, said Derrell Peel, an agricultural economist at Oklahoma State University.\n\n“The packing industry in this country has been investigated and researched for 50 years, and it’s been an issue for over a hundred years, at least, for some producers,” Peel said, expressing skepticism that consumers or producers will benefit from the investigation Trump announced.\n\n“If the outcome is to break up the big packers, the outcome will be higher beef prices for consumers, and lower cattle prices for producers,” Peel said.\n\n Meat packers say they're getting pinched by high prices \n\nOklahoma Sen. Markwayne Mullin said he and his fellow Republican senators Cindy-Hyde-Smith of Mississippi and Tim Sheehy of Montana visited the White House to speak with Trump about recent volatility in the beef market. Mullin said Trump agreed to have the Justice Department look at the issue.\n\nMullin blamed meat processors, saying that “we’re seeing the same exact game play again out” as a 2019 lawsuit against large meatpackers for violating antitrust laws.\n\nJBS, which is based in Brazil, is the largest U.S. beef producer and its second-largest producer of poultry and pork. Half of its annual revenue comes from the U.S., where it has more than 72,000 employees.\n\nThe company has faced price-fixing charges before. In 2022, JBS agreed to a $52.5 million settlement with grocery stores and wholesalers who accused JBS, Arkansas-based Tyson Foods and other companies of working together to suppress the number of cattle being slaughtered in order to drive up beef prices. \n\nJBS did not admit wrongdoing as part of that settlement. Messages seeking comment were left Friday with JBS USA.\n\nThe Meat Institute, a trade group that represents JBS and other meat producers, said its industry is being pinched by the price of cattle, despite record prices for U.S. beef.\n\n“For more than a year, beef packers have been operating at a loss due to a tight cattle supply and strong demand,” Meat Institute President and CEO Julie Anna Potts said in a statement. “The beef industry is heavily regulated, and market transactions are transparent. The government’s own data from USDA confirms that the beef packing sector is experiencing catastrophic losses and experts predict this will continue into 2026.”\n\nTrump’s accusations have renewed a bipartisan presidential fight against rising food prices.\n\nThen-President Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, who Trump defeated in winning reelection last year, used her campaign to vow to crack down on food producers and major supermarkets’ “ price gouging.”\n\nKarnowski reported from Minneapolis. Dee-Ann Durbin from Detroit, Josh Funk from Omaha, Nebraska, and Stephen Groves in Washington contributed to this report.","summary":"President Donald Trump is accusing foreign-owned meat packers of driving up the price of beef in the U.S. and is asking the Department of Justice to open an investigation","url":"https://www.independent.co.uk/news/world/americas/donald-trump-jbs-department-of-justice-washington-concentration-b2861219.html","image":"https://static.independent.co.uk/2025/10/22/16/US_Beef_Prices_41489.jpg?width=1200","video":null,"publish_date":"2025-11-07 23:56:27","author":"Darlene Superville","authors":["Darlene Superville"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.13},{"id":376897844,"title":"Latino voters swing toward Democrats in 2025 after Trump's 2024 historic gains","text":"Latino voters overwhelmingly supported Democratic candidates in Tuesday's elections, largely reversing historic gains President Trump made in 2024 with this key demographic.Mr. Trump was a factor for voters generally, across Virginia, New Jersey, and California, according to CBS News exit polls — many said they voted in these races to oppose him. In New Jersey, 68% of Latino voters supported Democratic gubernatorial candidate Mikie Sherrill, helping her defeat Republican Jack Ciattarelli, who was endorsed by Mr. Trump. Sherrill carried Latino men and women alike, and even flipped 18% of Latino Trump voters.Every New Jersey county voted more Democratic than in the 2024 presidential election. And Democrats swept the 10 counties where Latinos make up at least 20% of the population, expanding on their 2024 margins and flipping counties that Mr. Trump won in 2024. In 2024, Mr. Trump made significant inroads in heavily Latino cities like Passaic with a 70% Latino population. He increased his vote margin by over 30 points and flipped the county, becoming the first Republican to win the presidential vote there in over 30 years.This year, these communities swung hard the other way, reversing Republican gains. Passaic flipped back to the Democratic column, giving Sherrill the same vote share Joe Biden enjoyed there in 2020. And in both Paterson and heavily Latino Prospect Park, Sherrill did even better.\"The thing that stands out the most to me is the amount of swing from Republican to Democrat in just one year,\" said Chuck Rocha a Democratic political strategist and CBS News contributor. \"We saw the swing of Latinos to the right slowly, progressively over the last 10 to 12 years, but on Tuesday night it was a real snapback — almost back to pre-Trump numbers of Latino performances for Democrats.\" In 2024, Mr. Trump received a higher percentage of the Latino vote than any other Republican presidential candidate in history. He won 46% of the Latino vote, coming very close to former Vice President Kamala Harris' vote share of 51%, according to CBS News exit polling. This was a dramatic improvement from Mr. Trump's showing of 28% in 2016.A precinct-level analysis of Passaic County reveals the types of places that shifted dramatically. About 16% of the county's precincts flipped from backing Mr. Trump last year to Sherrill this year, with no flips in the other direction.Moreover, it was areas with larger Latino populations that saw the biggest swings left. While some Latino Trump voters switched to vote Democratic this year, these shifts are also due to changes in turnout. Places with more Latinos saw greater churn in the electorate: that is, more of their 2024 voters skipped voting this year, and many of them were replaced with new voters who didn't vote last year (according to voter file data on this year's advance voters).Across the three cities mentioned above, along with Clifton, wards with more Latino residents both saw more churn and shifted more toward Democrats. Taken together, these data points and CBS News exit polling suggest that many of Trump's Latino voters stayed home, while others switched sides, and new voters broke heavily Democratic.In Virginia, Hispanic voters also swung for Democratic Gov.-elect Abigail Spanberger, who won 67% of their vote across the state. Mr. Trump made large gains in Manassas and Manassas Park in 2024, which are more than 40% Latino. In 2025, these two areas turned out for Spanberger.\"Certainly with the Latino community, economic issues, kitchen table issues, are always front of mind and always center in the decisions they're making,\" said Democratic National Committee Chair Ken Martin of the appeal of Democratic candidates to Latinos. \"You add on top of that, the fact that for many parts of this country, the Latino community has been terrorized with these mass thugs from ICE going out and indiscriminately pulling Latino from their cars.\" According to CBS News exit polls, 65% of Virginia Latino voters disapprove of Mr. Trump, with the economy ranking as their highest priority.In New Jersey, 57% of Latino voters disapprove of Mr. Trump, and 53% feel the economy is not in good shape. On immigration, six in 10 Latinos feel the president's immigration actions have gone too far, and a similar number say the state's next governor should not cooperate with him.\"I predicted this was going to happen once the economy did not improve and once they started not deportation — but once they started deportations of non-criminal aliens and racial profiling — that there was gonna be a snapback,\" said Democratic Senator Ruben Gallego of Arizona, who campaigned for both Spanberger and Sherrill. \"It's the same thing I saw in Arizona once there was racial profiling with Sheriff Joe Arpaio. You saw a mass mobilization of Latinos going out to not just protect themselves or protect their families,\" Gallego told CBS News, making reference to the former Maricopa County sheriff and anti-immigration hardliner. In 2024, Gallego won his U.S. Senate race, becoming Arizona's first Latino senator, as Mr. Trump won the state that year, largely on the strength of his outsized support from Latino male voters.In a recent UnidosUS bipartisan survey, 41% said they feared they or someone close to them might be arrested by federal immigration agents, despite having legal status. \"Unfortunately Latinos are leaving the Republican party after giving us a monumental chance in 2024,\" GOP Rep. Maria Elvira Salazar said in a video posted on X after Tuesday's elections. She called the results \"a wake up call\" for the Republicans. \"I've said it before, the Hispanic vote is not guaranteed: Hispanics married President Trump, but they're only dating the GOP,\" Salazar said.The president said Wednesday, \"I don't think it was good for Republicans,\" regarding the election results. \"If you read the pollsters, the shutdown was a big factor, negative for the Republicans.\"The 2025 races garnered national attention as an early test of voter sentiment about Mr. Trump's second term and the ability of Democrats to counter Republicans ahead of the next year's pivotal midterm elections. Republicans have engaged in mid-decade redistricting in Texas, Missouri and North Carolina, at the behest of Mr. Trump, trying to boost GOP chances of winning seats and retain control over the House of Representatives. In Texas, Republicans redrew five Democratic congressional districts — including two in South Texas that will be competitive in 2026. Former Republican Rep. Mayra Flores is running for one of the newly drawn seats, Congressional District 34, and says she hopes to compound Mr. Trump's 2024 historic gains. In a phone interview, she praised Mr. Trump's second term, but said, \"Our focus needs to continue on bringing down the cost of living and improving the economy because the American people are struggling to live.\"Flores says Latino voters in South Texas largely supported Mr. Trump in 2024 because they wanted more border security, and she believes the GOP will be able to hold onto their votes next year. In the 2025 fiscal year, which just ended in September, unlawful crossings along the U.S.-Mexico border plummeted to the lowest annual level since the early 1970s, as a result of the Trump administration's sweeping crackdown on illegal immigration. \"We see firsthand what it looks like not to have law and order, and that is why Hispanics voted for President Trump,\" Flores said. \"We wanted law and order and continue to want law and order now more than ever.\"","summary":"Mikie Sherrill flipped 18% of Latino Trump voters and won Latino men and women in her race for New Jersey governor.","url":"https://www.cbsnews.com/news/latino-voters-swing-toward-democrats-in-2025-after-trumps-2024-historic-gains/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/11/07/5e4a8c21-98fa-48a4-8c1d-20c189f7520d/thumbnail/1200x630/5ee27b8428c4d28141a9c0b6237bed7d/gettyimages-2244585029.jpg","video":null,"publish_date":"2025-11-07 23:55:20","author":"Kabir Khanna,Nidia Cavazos","authors":["Kabir Khanna","Nidia Cavazos"],"language":"en","category":"politics","source_country":"us","sentiment":0.155},{"id":376914752,"title":"Trump accuses foreign-owned meat-packers of inflating U.S. beef prices and calls for investigation","text":"President Trump on Friday accused foreign-owned meat-packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation. The Republican president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living. “I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation,” Trump wrote in the social media post. “We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation’s food supply,” he continued. Trump offered no proof to support his allegations. Beef prices have soared to record levels in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports. Concentration in the meat-packing business has long been a concern for farmers and politicians on both sides of the aisle. There are four major meat-packing companies in the United States, and the largest beef company, JBS, is headquartered in Brazil. JBS USA did not immediately respond to a request for comment on Friday. “Action must be taken immediately to protect Consumers, combat Illegal Monopolies, and ensure these Corporations are not criminally profiting at the expense of the American People,” Trump said. Last month, Trump suggested the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers, angering U.S. cattle ranchers. Trump’s accusations have renewed a bipartisan presidential fight against rising food prices. Then-President Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, whom Trump defeated last year, used her campaign to vow to crack down on food producers and major supermarkets “ price gouging.” Superville and Karnowski write for the Associated Press. Karnowski reported from Minneapolis.","summary":"Beef prices have soared to record levels in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.","url":"https://www.latimes.com/world-nation/story/2025-11-07/trump-accuses-foreign-owned-meat-packers-of-inflating-us-beef-prices-and-calls-for-investigation","image":"https://ca-times.brightspotcdn.com/dims4/default/6a7284f/2147483647/strip/false/crop/4316x2877+0+0/resize/1486x991!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0d%2F97%2F0ad3cb54425abd9bb6d31a45baaa%2Fd23fdb5954a640678326a","video":null,"publish_date":"2025-11-07 22:44:32","author":"Darlene Superville And Steve Karnowski","authors":["Darlene Superville And Steve Karnowski"],"language":"en","category":"politics","source_country":"US","sentiment":-0.105},{"id":376877050,"title":"Olivia Rodrigo Slams ICE for Using Her Song to Promote ‘Racist, Hateful Propaganda’","text":"Skip to main content\n\nOlivia Rodrigo attends the 67th GRAMMY Awards on February 02, 2025 in Los Angeles, California.\n\nFrazer Harrison/Getty Images)\n\nDo you get deja vu? Donald Trump‘s administration has once again been slammed by an artist for using their music without permission, this time receiving a comment from an unhappy Olivia Rodrigo after the White House and Department of Homeland Security shared a video set to one of her songs.\n\nThe controversial clip in question was shared in a joint Instagram post on Tuesday. Soundtracked by “All-American Bitch,” the opening track on the pop star’s Billboard 200-topping sophomore album, Guts, the video shows United States Immigration and Customs Enforcement officers forcibly tackling, detaining and deporting people.\n\nOlivia Rodrigo Caps Guts Tour With ‘Lacy’ Performance in NYC\n\nOlivia Rodrigo Speaks Out Against Jimmy Kimmel’s Suspension: ‘Blatant Censorship’\n\nOlivia Rodrigo & Gracie Abrams Refuse to ‘Remain SILENT’ About Starving Palestinian Children\n\nIt then cuts to a montage of supposed immigrants voluntarily boarding flights organized by the DHS, smiling and giving thumbs up as they go. “LEAVE NOW and self-deport using the CBP Home app,” the caption reads. “If you don’t, you will face the consequences.”\n\nIn the comments, Rodrigo wrote, “don’t ever use my songs to promote your racist, hateful propaganda.”\n\nBillboard has reached out to the White House and ICE for comment.\n\nIt’s unclear why the government would want to use a song by the three-time Grammy winner. Not only has Rodrigo been vocal in her opposition to Trump, endorsing his opponent Kamala Harris in the 2024 election, but she’s also specifically called out his harsh crackdown on immigration by way of ICE raids this past year.\n\n“I’ve lived in LA my whole life and I’m deeply upset about these violent deportations of my neighbors under the current administration,” she wrote on her Instagram Story in June. “LA simply wouldn’t exist without immigrants. Treating hardworking community members with such little respect, empathy, and due process is awful. I stand with the beautiful, diverse community of Los Angeles and with immigrants all across America. I stand for our right to freedom of speech and freedom to protest.”\n\nThat said, Trump’s administration is famous for using music without artist permission at this point. In the past few weeks alone, Kenny Loggins slammed the twice-impeached POTUS for pairing “Danger Zone” with an AI-generated video of himself dumping feces on “No Kings” protestors, and Swifties called out the White House for making a TikTok set to Taylor Swift’s “The Fate of Ophelia.” (The pop star herself didn’t comment on the issue, but given her long history of clashing with Trump, it’s probably safe to say she didn’t give him the green light.)\n\nGet weekly rundowns straight to your inbox\n\nWant to know what everyone in the music business is talking about?\n\nGet in the know on\n\nVisit Billboard Pro for music business news\n\nBillboard is a part of Penske Media Corporation. © 2025 Billboard Media, LLC. All Rights Reserved.\n\nPowered by WordPress.com VIP\n\noptional screen reader\n\nManage Account\n\nBillboard Hot 100™\n\nBillboard 200™\n\nHits Of The World™\n\nSongs Of The Summer\n\nYear-End Charts\n\nDecade-End Charts\n\nR&B/Hip-Hop\n\nBusiness News\n\nRecord Labels\n\nView All Pro\n\nSongwriters & Producers\n\nArtist Index\n\nRoyalty Calculator\n\nMarket Watch\n\nIndustry Events Calendar\n\nBillboard Español\n\nCultura y Entretenimiento\n\nCrossword Puzzle\n\nGET ACCESS TODAY","summary":"The singer's \"All-American Bitch\" was used in a video encouraging self-deportations.","url":"https://www.billboard.com/music/music-news/olivia-rodrigo-slams-ice-song-use-racist-hateful-propaganda-1236108389/","image":"https://www.billboard.com/wp-content/uploads/2025/11/olivia-rodrigo-2025-grammy-billboard-1800.jpg","video":null,"publish_date":"2025-11-07 22:39:17","author":"Hannah Dailey","authors":["Hannah Dailey"],"language":"en","category":"politics","source_country":"us","sentiment":0.299},{"id":376871698,"title":"Takeaways from the 2025 general election, in charts","text":"By MAYA SWEEDLER, HUMERA LODHI, HYOJIN YOO, HANNAH RECHT, KATIE MARRINER, SIMRAN PARWANI and EUNICE ESOMONU, Associated Press\n\nWASHINGTON (AP) — After voters swung toward Republican Donald Trump during last fall’s presidential election, states like Virginia and New Jersey swung back toward Democratic candidates at nearly the same velocity as 2024’s shift, an Associated Press analysis of election data from this week found.\n\nFrom populous suburbs to big cities to military-heavy counties, this year’s electorate moved decisively toward the Democratic Party. Some of these areas had the largest shifts towards Trump last year, particularly in New York and New Jersey, but on Tuesday, the returns more closely resembled 2020 margins.\n\nThis came alongside relatively high turnout, at least compared to recent off-year elections, suggesting that one pattern of the last decade in American politics — Republicans doing well when Trump is on the ballot, and Democrats doing better when he is not — continues to hold.\n\nThe AP’s analysis is based off county- and precinct-level data. In all cases, 2025 margins are as of 10:45 a.m. on Nov. 7. Additional votes will be counted as election officials tabulate late-arriving mail and provisional ballots. Here are some of the findings.\n\nVirginia and New Jersey continue a trend — but with big margins\n\nVirginia and New Jersey, the two states that elect governors in the year following a presidential election, both have a tradition of moving against the party in the White House.\n\nStarting in 1976, every time a party has won back control of the presidency, Virginia voters have chosen a governor from the opposing party the following year. And in New Jersey, voters elected a governor from the opposite party of the sitting president in every election from 1989 to 2017.\n\nDemocrats Abigail Spanberger and Mikie Sherrill continued this trend with double-digit victories.\n\nSpanberger’s victory was especially notable for its scale. In the last 12 Virginia gubernatorial elections, the average margin of victory was 8.6 percentage points.\n\nSpanberger’s 14.4-point win — coming a year after Democratic presidential nominee Kamala Harris won the state by just 5.8 percentage points — was bolstered by big margins in Northern Virginia, home to Washington, D.C., suburbs heavily affected by federal government cuts and the ongoing government shutdown. It also greatly exceeded former President Joe Biden’s 10.1-point victory in 2020.\n\nThese shifts helped Spanberger win 15 counties and independent cities that her predecessor, Republican Gov. Glenn Youngkin, had won four years earlier. Six of those jurisdictions — Spotsylvania, Lynchburg, Nelson, Waynesboro, Prince Edward and Surry — also supported Trump in 2024.\n\nSpanberger also benefited from a spending advantage of around $27 million and Trump’s reluctance to endorse her Republican opponent.\n\nIn succeeding term-limited Democratic Gov. Phil Murphy, Sherrill not only restarted New Jersey’s history of voting for the party not in power but also broke a 60-year streak. No party has held the New Jersey governorship for more than three consecutive terms since the 1960s, when a two-term Democratic governor succeeded another two-term Democratic governor.\n\nRecent voting patterns in New Jersey suggested the governor’s race could have been much tighter. And in addition to receiving Trump’s endorsement, Republican Jack Ciattarelli kept pace with Sherrill in terms of spending.\n\nHe also got close the election prior. Ciattarelli came within 3 points of ousting Murphy in 2021. And between Ciattarelli’s 2021 and 2025 campaigns, Trump made massive inroads in New Jersey: He flipped five counties that Biden won in 2020 and cut the Republican margin in the state down to just 5.9 percentage points.\n\nSherrill’s 13.5-point win indicated a return to pre-2024 levels. While she fell short of Biden’s 15.9-point win, she returned all five of the counties Trump flipped to the Democratic column. She also improved on Harris’ margin in Bergen County, the state’s largest, by more than 8 points.\n\nNew York City saw generational turnout\n\nSome of Tuesday’s elections were notable outliers in terms of the number of people they brought to the polls, while others were more in line with past races.\n\nIn New York City, state assemblymember Zohran Mamdani juiced turnout in his successful primary campaign and built on that in the general election. More than two million New Yorkers voted for mayor this year, a level of voter enthusiasm the city hasn’t seen in a mayoral election since 1969, when John Lindsay won a second term.\n\nThe governor races were more of a mixed bag. New Jersey had the highest turnout rate in a governor election since 2009, when Republican Chris Christie beat incumbent Democrat Gov. Jon Corzine. As of Friday morning, this year’s turnout was just under 50%.\n\nVirginia’s turnout rate was just shy of 2021 levels as of Friday morning. It is not yet clear if turnout in 2025 will meet or exceed 2021 as ballots continue to be counted.\n\nMamdani made strides among voters of color\n\nBefore the general election, Mamdani drew skepticism from political pundits for perceived weakness with some voters of color in New York City. While he did well in June’s primary among neighborhoods with large Asian and Muslim populations, he generally fell short of former Gov. Andrew Cuomo in predominantly Black and Hispanic neighborhoods.\n\nThe general election was a different story. Whether it was because of outreach, the benefit of running on the Democratic ballot line, or his mega-viral campaign videos, Mamdani won nearly every single majority Black and majority Hispanic neighborhood.\n\nIn general, Mamdani did well in areas and among demographics that moved toward Trump over the last two presidential elections.\n\nForty-seven New York City neighborhoods shifted at least 25 points towards Trump in 2024. Mamdani won 37 of them.\n\nMamdani won most of the city’s neighborhoods that experienced the greatest shift right in 2024\n\nAnd a year after Trump eroded Democrats’ advantage among young voters nationally, Mamdani won about three-quarters of voters under the age of 30, according to the AP Voter Poll.\n\nCalifornia becomes the first state to draw more Democratic seats\n\nThere was only one race on the ballot in California, but it had major implications for control of the U.S. House in next year’s midterm elections. In passing Proposition 50, which temporarily substitutes a Democratic-drawn congressional map for the map created by an independent redistricting commission, California voters could flip as many as five Republican-held U.S. House seats next year.\n\nCalifornia became the first state to adopt a new map that would add Democratic seats. Four other states — Texas, Missouri, North Carolina and Ohio — have also enacted new maps since Trump began encouraging states to redistrict over the summer. Those four states all changed their district lines to create winnable Republican seats.\n\nFederal workers voted blue\n\nTwo groups that have been particularly affected by the ongoing government shutdown are military families and federal workers. Many in these groups have been furloughed or are working without pay as the shutdown stretches into a sixth week.\n\nDemocrats sought to capitalize on this in both gubernatorial campaigns.\n\nIn Virginia, home to one of the largest concentrations of federal workers as well as major military bases, federal workers in particular supported Spanberger.\n\n… Military households were more split\n\nHouseholds with a current or former member of the military were evenly split between the two candidates in Virginia and favored Ciattarelli in New Jersey.","summary":"This year’s electorate moved decisively towards the Democratic Party.","url":"https://www.sandiegouniontribune.com/2025/11/07/takeaways-2025-election-charts/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/11/Election_2025_America_Votes_96874-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-07 22:03:31","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"US","sentiment":-0.014},{"id":376890620,"title":"James Carville says he'd 'find a convicted pedophile' to run against Republicans after election wins","text":"Democratic strategist James Carville stirred controversy Thursday with provocative remarks reacting to Tuesday’s election results. On his \"Politics War Room\" podcast, Carville stated: \"I’m personally going to find a convicted pedophile and run him in a race just to see if he could beat a Republican.\" He followed up with: \"I’m not sure. I’m not going to say a convicted pedophile could win.\" Carville added: \"And by the way, the guy who was running against him ran a pretty good campaign.\" CARVILLE DOUBLES DOWN AFTER GETTING CALLED OUT FOR PREDICTING TRUMP ADMIN COLLAPSE, SAYS IT’S HAPPENING ‘NOW' The veteran strategists' remarks came in the wake of Democrats flipping a number of key offices and improving their performance on Tuesday. One winning result was Jay Jones, the Democratic challenger for Virginia attorney general who defeated incumbent Republican Jason Miyares. The win came after previously leaked texts of violent language from Jones’ 2022 messages became public. JOE SCARBOROUGH TELLS DEM CANDIDATE JAY JONES TO LEAVE RACE OVER VIOLENT COMMENTS AGAINST GOP LAWMAKER Although the texts drew sharp criticism, Jones wrote that the then-House Speaker Todd Gilbert \"gets two bullets to the head,\" raising questions from conservatives about whether Democrats are serious about combating and condemning political violence. In the messages, Jones fantasized about Gilbert being shot in the head while also suggesting that harm should come to the Republican's young \"fascist\" children. \"I'm gonna give you all the most interesting piece of news of this cycle, even more interesting than Bucks County, the Republican legislator who released the text, lost, exactly,\" Carville said on his podcast. Carville also suggested that \"baggage\" on Republicans may be weighing heavier than candidate missteps. \"You've got some baggage out there with Trump people,\" he said. VIRGINIA SLAMMED FOR ‘TRULY DEMONIC’ ELECTION THAT EXCUSED POLITICAL VIOLENCE TO SPITE TRUMP, CRITICS SAY On the podcast he went further, saying he would bet money that a Democrat would win the presidency in 2028 and court-pack the Supreme Court. \"I’m going to tell you what’s going to happen. A Democrat is going to be elected in 2028. You know that. I know that. The Democratic president is going to announce a special transition advisory committee on the reform of the Supreme Court,\" he said. \"They’re going to recommend that the number of Supreme Court justices go from nine to 13. That’s going to happen, people. That’s going to happen to you. They’re going to win,\" he added. \"They’re going to do some blue ribbon panel of distinguished jurists, and they're going to recommend 13, and a Democratic Senate and House is going to pass it, and the Democratic president is going to sign it, because they have to do an intervention so we can have a Supreme Court that the American people trust again.\" Carville has conceded before now that in January he was wrong about the 2024 election after repeatedly predicting Kamala Harris would win and that the results boiled down to the economy. CLICK HERE TO DOWNLOAD THE FOX NEWS APP He also previously wrote an essay for the New York Times headlined \"Three Reasons I’m Certain Kamala Harris Will Win.\" He also said in a pre-election MSNBC interview that Harris would beat Donald Trump because Trump was \"stone a--- nuts.\"","summary":"Democratic strategist James Carville made provocative comments about running controversial candidates against Republicans following Tuesday&apos;s election results.","url":"https://www.foxnews.com/politics/james-carville-says-hed-find-convicted-pedophile-run-against-republicans-after-election-wins","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/james-carville-speaks-at-event.png","video":null,"publish_date":"2025-11-07 22:00:16","author":"Emma Bussey,Louis Casiano","authors":["Emma Bussey","Louis Casiano"],"language":"en","category":"politics","source_country":"us","sentiment":0.004},{"id":376874826,"title":"Trump calls for investigation into foreign meatpackers over U.S. beef prices","text":"President Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation.The president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public's concerns about the cost of living. Mr. Trump, however, has insisted grocery prices are down, with some exceptions. The president said the price of boxed beef is \"fishy.\" \"I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation,\" Mr. Trump wrote in the social media post.\"We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation's food supply,\" he continued.The president offered no proof to support his allegations. \"Action must be taken immediately to protect Consumers, combat Illegal Monopolies, and ensure these Corporations are not criminally profiting at the expense of the American People,\" he said. Last month, Mr. Trump suggested the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers, angering U.S. cattle ranchers.Beef prices have soared in part after drought and years of low prices led to the smallest U.S. herd size in decades. Mr. Trump's tariffs on Brazil, a major beef exporter, have also curbed imports.Mr. Trump's accusations have renewed a bipartisan presidential fight against rising food prices.Then-President Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, who Trump defeated in winning reelection last year, used her campaign to vow to crackdown on food producers and major supermarkets \"price gouging.\"","summary":"President Trump is accusing foreign-owned meat packers of driving up the price of beef in the U.S. and is asking the Department of Justice to open an investigation.","url":"https://www.cbsnews.com/news/trump-foreign-owned-meat-packers-inflating-beef-prices-investigation/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/11/07/b7af0f80-0678-4f68-87f3-4cd29616b4ad/thumbnail/1200x630/00eca9f92a33010f01f933d6090b51aa/ap25293843709372.jpg","video":null,"publish_date":"2025-11-07 21:48:21","author":"Majority Foreign Owned","authors":["Majority Foreign Owned"],"language":"en","category":"politics","source_country":"US","sentiment":-0.026},{"id":376868736,"title":"Trump accuses foreign-owned meat packers of inflating US beef prices and calls for investigation","text":"WASHINGTON (AP) — President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation.\n\nThe Republican president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living.\n\n“I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation,” Trump wrote in the social media post.\n\n“We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation’s food supply,” he continued.\n\nTrump offered no proof to support his allegations.\n\n“Action must be taken immediately to protect Consumers, combat Illegal Monopolies, and ensure these Corporations are not criminally profiting at the expense of the American People,” he said.\n\nLast month, Trump suggested the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers, angering U.S. cattle ranchers.\n\nBeef prices have soared in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.\n\nTrump’s accusations have renewed a bipartisan presidential fight against rising food prices.\n\nThen-President Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, who Trump defeated in winning reelection last year, used her campaign to vow to crackdown on food producers and major supermarkets “ price gouging.”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the...","url":"https://wsvn.com/news/politics/trump-accuses-foreign-owned-meat-packers-of-inflating-us-beef-prices-and-calls-for-investigation/","image":"https://wsvn.com/wp-content/uploads/sites/2/2018/09/ground-beef.jpg?quality=60&strip=color","video":null,"publish_date":"2025-11-07 21:34:27","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.135},{"id":376867938,"title":"Trump accuses foreign-owned meat packers of inflating US beef prices and calls for investigation (World)","text":"President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation.\n\nThe Republican president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living.\n\n“I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation,” Trump wrote in the social media post.\n\n“We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation’s food supply,” he continued.\n\nTrump offered no proof to support his allegations.\n\nBeef prices have soared to record levels in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.\n\nConcentration in the meat packing business has long been a concern for farmers and politicians on both sides of the aisle. There are four major meat packing companies in the United States, and the largest beef company, JBS, is headquartered in Brazil. JBS USA did not immediately respond to a request for comment on Friday.\n\n“Action must be taken immediately to protect Consumers, combat Illegal Monopolies, and ensure these Corporations are not criminally profiting at the expense of the American People,” Trump said.\n\nLast month, Trump suggested the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers, angering U.S. cattle ranchers.\n\nTrump’s accusations have renewed a bipartisan presidential fight against rising food prices.\n\nThen-President Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, who Trump defeated in winning reelection last year, used her campaign to vow to crackdown on food producers and major supermarkets “ price gouging.”","summary":"President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation. The Republican president announced the move on social media days after his party suffered losses in key elections in which the...","url":"https://www.castanet.net/news/World/582786/Trump-accuses-foreign-owned-meat-packers-of-inflating-US-beef-prices-and-calls-for-investigation","image":"https://www.castanet.net/content/2025/11/86825b8a9b0b536c5e9cd5a7533c8d196163076c551397863f9f3ae2fa37a15a.jpg","video":null,"publish_date":"2025-11-07 21:15:00","author":"Majority Foreign Owned,The Canadian Press","authors":["Majority Foreign Owned","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.07},{"id":376859998,"title":"Trump accuses foreign-owned meat packers of inflating US beef prices and calls for investigation","text":"By DARLENE SUPERVILLE, Associated Press\n\nWASHINGTON (AP) — President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation.\n\nThe Republican president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living.\n\n“I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation,” Trump wrote in the social media post.\n\n“We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation’s food supply,” he continued.\n\nTrump offered no proof to support his allegations.\n\n“Action must be taken immediately to protect Consumers, combat Illegal Monopolies, and ensure these Corporations are not criminally profiting at the expense of the American People,” he said.\n\nLast month, Trump suggested the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers, angering U.S. cattle ranchers.\n\nBeef prices have soared in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.\n\nTrump’s accusations have renewed a bipartisan presidential fight against rising food prices.\n\nThen-President Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, who Trump defeated in winning reelection last year, used her campaign to vow to crackdown on food producers and major supermarkets “price gouging.”","summary":"Trump’s accusations renew a bipartisan presidential fight against rising food prices.","url":"https://www.ocregister.com/2025/11/07/trump-beef-prices/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/AP25295192541489.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-07 21:07:06","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.078},{"id":376871664,"title":"Trump accuses foreign-owned meat packers of inflating US beef prices and calls for investigation","text":"By DARLENE SUPERVILLE, Associated Press\n\nWASHINGTON (AP) — President Donald Trump on Friday accused foreign-owned meat packers of driving up the price of beef in the U.S. and asked the Department of Justice to open an investigation.\n\nThe Republican president announced the move on social media days after his party suffered losses in key elections in which the winning Democratic candidates focused relentlessly on the public’s concerns about the cost of living.\n\n“I have asked the DOJ to immediately begin an investigation into the Meat Packing Companies who are driving up the price of Beef through Illicit Collusion, Price Fixing, and Price Manipulation,” Trump wrote in the social media post.\n\n“We will always protect our American Ranchers, and they are being blamed for what is being done by Majority Foreign Owned Meat Packers, who artificially inflate prices, and jeopardize the security of our Nation’s food supply,” he continued.\n\nTrump offered no proof to support his allegations.\n\n“Action must be taken immediately to protect Consumers, combat Illegal Monopolies, and ensure these Corporations are not criminally profiting at the expense of the American People,” he said.\n\nLast month, Trump suggested the U.S. would buy Argentine beef to bring down stubbornly high prices for American consumers, angering U.S. cattle ranchers.\n\nBeef prices have soared in part after drought and years of low prices led to the smallest U.S. herd size in decades. Trump’s tariffs on Brazil, a major beef exporter, have also curbed imports.\n\nTrump’s accusations have renewed a bipartisan presidential fight against rising food prices.\n\nThen-President Joe Biden talked with independent farmers and ranchers about initiatives to reduce food prices by increasing competition within the meat industry. And then-Vice President Kamala Harris, who Trump defeated in winning reelection last year, used her campaign to vow to crackdown on food producers and major supermarkets “price gouging.”","summary":"Trump’s accusations renew a bipartisan presidential fight against rising food prices.","url":"https://www.sandiegouniontribune.com/2025/11/07/trump-beef-prices/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/11/AP25295192541489.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-07 21:07:06","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.078},{"id":376854056,"title":"California Republicans in Hot Water Thanks to Newsom Redistricting Effort","text":"Republican representatives from California will have to fight for their survival in the 2026 midterms as Democrats redraw the Golden State’s congressional maps to increase their districts after passage of Proposition 50.\n\nProposition 50, which California voters supported by about a 2-to-1 margin in this year’s election, will temporarily suspend the state’s independent redistricting commission so Democrats can increase their representation by about five seats. \n\nCalifornia Gov. Gavin Newsom justified the redistricting effort by claiming it was in response to redistricting in Texas and other red states. The new congressional map is expected to flip several congressional districts blue, including the ones currently represented by California Republican Reps. Doug LaMalfa, Kevin Kiley, Ken Calvert, Darrell Issa, and David Valadao.\n\nIssa, Valadao, and Kiley are expected to come under immense pressure come the 2026 midterms.\n\nCalifornia’s 52 congressional seats are currently occupied by 43 Democrats and just nine Republicans. While President Donald Trump secured nearly 40% of the Golden State’s vote in 2024, less than 20% of the congressional seats are occupied by Republicans.\n\nCalifornia is already #1 in the nation for poverty, unemployment, and homelessness. So now Newsom has set his sights on a new distinction: #1 in gerrymandering.Princeton’s Gerrymander Project called the Prop. 50 map one of the two worst gerrymanders in the last 50 years. pic.twitter.com/j25ZiMr6Es— Rep. Kevin Kiley (@RepKiley) November 1, 2025\n\nIssa and Valadao have fighting chances to keep their seats, whereas Democrats are looking to district Kiley out of Congress entirely.\n\nIssa Prepares for a Fight\n\nValadao and Issa both also supported the “One Big, Beautiful Bill,” which enshrined much of Trump’s agenda into federal law. The bill provided about $100 billion for border enforcement, modernization of the U.S.’ air traffic control system, preserved and expanded Trump’s tax cuts, and increased the child tax credit, among other things.\n\n“I’m not going anywhere. I’ll continue to represent the people of California—regardless of their party or where they live,” Issa said in a statement following Tuesday’s election results. Issa’s new district, drawn by the state Legislature, has turned his seat from solid red to light blue. \n\nIssa is serving his second stint in Congress. He first came to Washington in 2001 and held his seat until 2019. During his first stint, he chaired the House Oversight Committee from 2011 to 2015 and managed Congress’ response to the Obama-era IRS scandal.\n\nIssa returned to Washington in 2021 and has kept his seat with a strong, conservative voting record.\n\nThe Southern Californian has robust conservative bona fides. He has earned an A+ rating from Susan B. Anthony Pro-Life America by voting for legislation like the Born-Alive Abortion Survivors Protection Act and a resolution condemning attacks on pro-life facilities and churches.\n\nIssa has also supported the Protection of Women and Girls in Sports Act, which would make it against federal law for schools that receive federal funding to allow males to participate in athletic programs meant for girls and women.\n\nValadao Looks to Hold On\n\nLike Issa, Valadao has served two separate stints in Congress. His first stint ran from 2013 to 2019, but he returned to Washington in 2021.\n\nValadao has likewise received an A+ from the Susan B. Anthony Pro-Life America scorecard.\n\nValadao’s new district will still likely be red, with it reportedly going, according to Punchbowl News, “from a seat President Donald Trump won by six points to one he won by two points.”\n\nValadao’s office was not immediately available for comment.\n\nDoes Kiley Have a Chance?\n\nMeanwhile, Kiley, who currently represents California’s 3rd Congressional District, will face a steeper uphill battle. His district’s new borders now encompass a region that went for then-Vice President Kamala Harris in her 2024 presidential bid by 10 points. \n\nKiley, a member of Congress since 2023, has yet to announce whether he will seek reelection, but the prospects of flipping the 3rd District are already enticing Democrat challengers, as Rep. Ami Bera, D-Calif., has declared his intention to run.\n\nOther Republicans find themselves in a similar situation to Kiley.\n\nCalvert is campaigning for California’s new 40th Congressional District, which includes greater than 50% of the district he presently represents. But he’ll have to face off against Rep. Young Kim, R-Calif., the current representative for the 40th District, who has said she will run for reelection in the solidly red new district as well.","summary":"Republican representatives from California will have to fight for their survival in the 2026 midterms as Democrats redraw the Golden State’s congressional maps to increase... Read More\n\n\nThe post California Republicans in Hot Water Thanks to Newsom Redistricting Effort appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/07/california-republicans-in-hot-water-thanks-to-newsom-redistricting-effort/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/20251107_DarrellIssa.jpg","video":null,"publish_date":"2025-11-07 20:00:00","author":"Jacob Adams","authors":["Jacob Adams"],"language":"en","category":"politics","source_country":"us","sentiment":0.048},{"id":376866308,"title":"Democrats Collapsed Here Last Year. How’d Zohran Do?","text":"At this point last November, Zohran Mamdani was a largely unknown state assemblyman, and the Democratic Party’s brand in New York City was at rock bottom. \n\nIn the 2024 election, President Donald Trump picked up about 100,000 more votes in the city than in 2020; Kamala Harris fell more than half a million votes shy of Joe Biden’s total. And some of the most dramatic shifts in the entire country could be found in immigrant neighborhoods in Mamdani’s home borough of Queens. The party’s outer-borough collapse mirrored the party’s national crack-up; as it spent millions to court college-educated voters in the suburbs, Democrats were losing ground with the sorts of working-class, non-white voters in blue cities who traditionally helped form the backbone of the party. The term you kept hearing over and over was “realignment.”\n\nWhen we chatted with residents and elected officials this spring, in the Queens neighborhoods of Jackson Heights and Corona, we found deep-seated frustrations with Democratic governance—and concerns about crime, immigration, sex-workers, poor services, and the cost of living. Many people brought up the pandemic, which had hit the area hard and damaged people’s faith in the social contract.\n\n“The former governor, Andrew Cuomo, never stepped foot in Corona, even during the pandemic,” Democratic state assemblywoman Catalina Cruz told us. “I had to fight him to get a vaccination site in my district because while we were the epicenter, because my community was undocumented and immigrant, we were the last ones to get help.” Corona, she said, was what you get “when the government ignores its community.”\n\nMamdani’s victory on Tuesday over Cuomo was the product of a relentless campaign that united a broad multi-racial coalition with a focus on affordability. But it was also a test of how well the Democratic Party was recovering in the places where it has suffered the most. This outer-borough collapse, clustered most intensely in working-class Latino and Asian communities, loomed over the New York City mayoral race from the start. Mamdani soft-launched his candidacy by talking to Trump voters and non-voters in outer-borough neighborhoods about what it would take to win them back. \n\nSo: How’d he do?\n\nComparing off-year races with presidential elections can be a little difficult, but Mamdani’s vote total—the highest for a winning mayoral candidate since the 1960s—offered some clear takeaways. Although 700,000 fewer people voted in the city this November compared to last, Mamdani actually earned more votes than Harris in a few notable areas. \n\nIn parts of the Brooklyn neighborhood of Bushwick, home to many young and left-leaning voters, overall turnout matched or exceeded 2024 totals, and nearly all those votes went to Mamdani. That’s a major achievement for an off-year election, and a reflection of the mayor-elect’s appeal among younger Americans who opposed Trump and were unenthusiastic about the Democratic Party. \n\nBut Mamdani also ran well ahead of Harris in another, much different area: along parts of Hillside Avenue in Queens. This is one of the two neighborhoods Mamdani visited last November to talk to residents about the presidential election. In the now-famous video, voters expressed their frustration with the Democratic Party’s appeasement of Israel and their sense that politicians had done little to address the high cost of living. In one heavily Bangladeshi precinct on Hillside Avenue, Mamdani ended up winning more raw votes than Harris on Tuesday—despite 14 percent fewer people showing up. \n\nThe story was similar in other pockets of the city with large South Asian and Muslim populations, and where Democratic support lagged in 2024. Mamdani, despite running against a prominent Democratic former governor, scored a 24-percent improvement on Harris’ vote total in one precinct in Brooklyn’s “Little Bangladesh”—where turnout was just as high as last year.\n\nMamdani’s energetic emphasis on affordability, his implicit and explicit rejection of unpopular Democratic figures like Cuomo and Mayor Eric Adams, and his unique appeal as one of the city’s first major-party Muslim mayoral candidates helped him make up ground that Democrats had recently lost.\n\nOn Tuesday, a few hours before polls closed, we returned to the Queens neighborhoods we profiled earlier this year for Reveal, to see how Mamdani’s pitch had gone over. What we found was backed up by the numbers. It would be wishful thinking to call Mamdani universally beloved, but there were signs that his message of affordability resonated with voters who had been on the fence about Democrats, and that Trump’s 2024 coalition was beginning to fracture.\n\nIn conversations with about two dozen voters, we heard firsthand from people who voted Democratic after rejecting Harris last year, and from voters—particularly young voters—who were drawn to Mamdani by his emphasis on issues that affected their lives on a daily basis.\n\n“I don’t take buses because I don’t trust them—I pay for the bus, it just, like, skips my stop or something,” said a young Elmhurst voter named Diego. Another voter outside the precinct said he voted for Trump as “the lesser evil” in 2024, but felt that Mamdani offered a new direction and saw promise in his plans to make the city “affordable.”\n\n“The free bus thing, I think, is great,” he said. “A lot of the time people don’t want to pay for the bus anyway. That’s a good incentive, and honestly, I’d rather if we all paid a little more tax and make the MTA free.” \n\nBeyond Mamdani convincing some Trump voters, there were signs of dissatisfaction in the Republican electorate, too. More than one voter mentioned that they voted for Trump—and not for Mamdani—but were disappointed by the administration.\n\nA senior citizen in Jackson Heights who voted for Cuomo because of his emphasis on public safety told us that he and his wife had both voted for Trump last November. \n\n“He promised a lot of things [were] going to change,” he said. \n\n“But nothing’s changed,” his wife added.\n\nMamdani had some of his strongest performances in Jackson Heights, an extraordinarily diverse neighborhood with large South Asian and Latino populations. In one heavily South Asian voting district in the neighborhood, Mamdani ran 20 percentage points ahead of Kamala Harris and netted more votes overall. \n\nOutside a polling site in the neighborhood on Tuesday, Abdul Aliy said that he left the presidential line blank last November. “I just couldn’t bring myself to vote for Harris, [and] obviously I wasn’t gonna vote for Trump, so there wasn’t really an option I saw,” he said. But he told us he voted for Mamdani enthusiastically, because the democratic socialist’s platform aligned with his own values: “Free transit, free buses,” he said, rattling off the campaign promises that resonated. “He has this idea of a public market that will stabilize the prices of certain goods—I like that idea.”\n\nOutside of P.S. 89Q in nearby Elmhurst, Rina Hart, a 32-year-old user interface designer, said that she and her family were long-time New Yorkers who had voted for Cuomo in the past. Hart initially thought she would do so again in the primary. But she was turned off by the former governor’s campaign and the wealthy donors backing him. “I was concerned about Mamdani’s experience,” she explained, “but at least he has integrity.”\n\nHer parents ended up voting for Cuomo in the primary, while she and her brothers went for Mamdani. There was no generational divide in the general election: They all backed Mamdani. Hart explained that her mom, who is South Asian, had been alienated by the racist videos promoted by Cuomo’s backers. \n\n“It’s been a really tough time to be a Democrat. And you’re kind of seeing why we didn’t win,” Hart said about Mamdani’s rise in the wake of recent Democratic losses. “It’s been really hopeful.” She now wants the party to move on from Senate Minority Leader Chuck Schumer, who did not endorse the mayor-elect. \n\n“That’s the only way we can get out of this MAGA cycle that we’re in,” Hart said.\n\nGlacel, an Ecuadorian immigrant who has worked at one of the original Equinox gym locations for the past 31 years, went with Cuomo.\n\nShe said she didn’t vote in last year’s presidential election because of the local crime and disorder. It was the worst she’d ever seen things get in Queens, and she blamed the decay on Democrats not dealing with the migrant crisis. “Disgusting. Filthy. Messy,” she said. “Ecuador is better than here.” \n\nAnother Elmhurst voter, an Argentine immigrant named Miguel Mendez, described himself as a sometime-Democratic voter. He opposed Trump during his first election and had once been curious about Bernie Sanders, but came around to the Republican nominee by 2024. He believed the neighborhood was deteriorating and that Democrats were more interested in pushing their ideology than in fixing it up.\n\n“If it wasn’t the Salvadorans, the MS-13—it was the Tren de Aragua, or even cartels,” he said. “I mean, you can ask anyone over here where the gangs are. You can go to Roosevelt, you see what I mean. The prostitution, it’s everywhere.\n\nMendez chose Curtis Sliwa. (His girlfriend, he said, told him he couldn’t back Cuomo.) \n\nDespite voting for Trump, he wasn’t happy with how things were playing out in Washington. The second Trump term had been “a big disappointment for me, because I was begging him to talk about all the weird drones that came in New Jersey and New York,” he said. “He said that he was gonna bring that out, same thing with the Epstein names, a bunch of stuff that he’s not doing—so that makes me think that no matter what party the guy who’s in office, they just have to follow an agenda.”\n\nFurther along Roosevelt Avenue, in the heavily Latino parts of Queens that swung heavily toward Trump in 2024, the picture was mixed. Turnout in Corona, a working-class Latino neighborhood, was up dramatically from the last mayoral election, but still well short of a presidential year. Among those who voted, data from the New York Times shows Mamdani winning the neighborhood by 11 points.\n\nAna, a 58-year-old Democratic voter in Corona from the Dominican Republic, said she voted for Cuomo after backing Kamala Harris last year. Like other voters in Corona, the problems along Roosevelt Avenue, which she also blamed on more recent immigrant arrivals, were front of mind.\n\n“I like the Democrats because they’re humanitarians but as a result they’re hurting us,” Ana said. She lamented that her own Democratic representatives had not done enough when it came to immigration.\n\nThat included her own member of Congress, Rep. Alexandria Ocasio-Cortez (D-N.Y.). But Ana still mostly liked her congresswoman, who unlike Mamdani, she thought had enough experience.\n\nAna was skeptical about the feasibility of Mamdani’s plans to make the city more affordable. Free buses won’t make her daily 4 am subway commute to a restaurant job at Google’s Manhattan campus any cheaper. Nor would his proposed rent freeze for stabilized units cover her market-rate apartment. \n\n“You can’t offer free things in New York,” Ana explained in Spanish. “Even looking at something here costs something.” Then she laughed with a sigh of resignation. \n\nMamdani now has four years to prove voters like her wrong.","summary":"At this point last November, Zohran Mamdani was a largely unknown state assemblyman, and the Democratic Party’s brand in New York City was at rock bottom.&#160; In the 2024 election, President Donald Trump picked up about 100,000 more votes in the city than in 2020; Kamala Harris fell more than half a million votes shy [&#8230;]","url":"https://www.motherjones.com/politics/2025/11/democrat-collapse-realignment-new-york-city-mayor-race-mamdani-trump-harris-2024-corona-queens-jackson-heights/","image":"https://www.motherjones.com/wp-content/uploads/2025/11/20251106_mamdani-queens-voters_2000_D.jpg?w=1200&h=630&crop=1","video":null,"publish_date":"2025-11-07 19:51:19","author":"Chasity Hale,Tim Murphy and Noah Lanard","authors":["Chasity Hale","Tim Murphy and Noah Lanard"],"language":"en","category":"politics","source_country":"us","sentiment":-0.113},{"id":376869426,"title":"Judge Dismisses Suit by Des Moines Register Subscriber Who Alleged Fraud Over the Paper's Trump-Harris Poll","text":"Last January, Dennis Donnelly, a longtime Des Moines Register subscriber, sued the newspaper and pollster Ann Selzer, alleging that they had committed multiple torts by conducting and publicizing a poll suggesting that the presidential contest between Donald Trump and Kamala Harris in Iowa was much closer than expected. On Thursday, a federal judge in Iowa dismissed that lawsuit with prejudice, deeming it inconsistent with the First Amendment. U.S. District Judge Rebecca Goodgame Ebinger also concluded that Donnelly had failed to properly plead any of his claims.\n\nThat decision in Donnelly v. Des Moines Register and Tribune Co. does not bode well for a similar lawsuit that Trump filed against Selzer and the Register last December. \"A party cannot evade First Amendment scrutiny\" by \"simply labeling an action one for 'fraud,'\" Ebinger notes. Yet that is exactly what Trump is trying to do when he portrays \"fake news\" as a form of consumer fraud.\n\nIf anything, Trump's fraud claims are even less plausible than Donnelly's. Donnelly, who sued on behalf of all Des Moines Register subscribers, actually has a commercial relationship with the newspaper. Trump, by contrast, does not seem to have any such connection with the Register or Selzer. But both lawsuits suffer from the same basic problem: Because they treat misleading journalism as actionable fraud, they amount to thinly veiled assaults on freedom of the press.\n\nThe poll at the center of both cases, which Selzer conducted in late October 2024, gave Harris a three-point lead over Trump in Iowa, a difference that was within the statistical margin of error. The Register reported the results two days before the election under the headline \"Iowa Poll: Kamala Harris leapfrogs Donald Trump to take lead near Election Day.\"\n\nBy contrast, several other polls conducted around the same time gave Trump a lead of seven to nine points in Iowa. He ultimately won Iowa by 13 points.\n\nThe gist of Donnelly's complaint is that the Register and Selzer misled him and other readers about the state of the race in late October. But as Ebinger notes, he did not allege that Selzer's methodology \"differed from the one disclosed in the accompanying article\" or that the defendants \"altered responses or weighed the sample in an attempt to produce a certain result.\" In fact, Donnelly noted that Selzer's Iowa Poll \"is historically accurate and is the 'gold standard' for polling\" in that state. But he thinks Selzer and the Register should have been skeptical of the surprising results because other polls painted a different picture.\n\nIs that sort of journalistic failure enough to strip Selzer and the Register of the constitutional protection that ordinarily would apply to their work? Ebinger thinks not. \"Each of Donnelly's claims must satisfy First Amendment scrutiny,\" she notes, \"because 'there is no free pass around the First Amendment.'\"\n\nThe defendants argued that they were entitled to \"absolute immunity\" from Donnelly's claims, which they described as \"a frontal assault on the First Amendment.\" Donnelly argued that he could prevail by showing \"actual malice,\" the standard that applies to defamation claims by public figures.\n\nFinding the relevant case law unclear, Ebinger applies the \"actual malice\" test but concludes that Donnelly has failed to meet it. \"Actual malice requires showing 'sufficient evidence to permit the conclusion that the defendant in fact entertained serious doubts as to the truth of [their] publication,'\" she writes. It is not enough to argue that a \"reasonably prudent\" person would not have published an article or that he \"would have investigated before publishing.\" To show a \"reckless disregard for the truth,\" a plaintiff must do more than allege that the defendant failed to \"recognize a mistake or ambiguity and its potential consequences.\"\n\nAt this stage of the case, Ebinger says, Donnelly had to allege \"non-conclusory\" and \"non-speculative\" facts \"sufficient to give rise to a reasonable inference of actual malice.\" She says he clearly failed to do so.\n\nDonnelly suggested that Selzer and the Register \"designed the poll's methodology to produce an intentionally inaccurate result and knowingly published the inaccurate result,\" Ebinger notes. But \"no specific facts have been alleged to support such a\n\nThat failure, Ebinger says, dooms all of Donnelly's claims. She nevertheless addresses each one separately.\n\n\"Donnelly alleges fraudulent misrepresentation of the state of the election,\" Ebinger writes. \"Under Iowa law, a claim for fraudulent misrepresentation requires a plaintiff to show: 1) a representation was made; 2) the representation was false; 3) the representation was material; 4) the defendant knew the representation was false; 5) the defendant intended to deceive the plaintiff; 6) the plaintiff acted in reliance on the truth of the representation and that reliance was justified; and 7) the representation was a proximate cause of plaintiff's damages.\"\n\nDonnelly's claim fails right out of the gate, Ebinger says, because \"no false representation was made.\" The defendants \"conducted a poll using a particular methodology which yielded results that later turned out to be different from the event the poll sought to measure,\" she writes. But \"the results of an opinion poll are not an actionable false representation merely because the anticipated results differ from what eventually occurred.\"\n\nDonnelly \"does not claim the disclosed methodology was not followed, that results were falsified, or that Defendants altered the poll in some other way which did not reflect the publicly disclosed methodology,\" Ebinger notes. \"Defendants told readers exactly what they did and how they did it.\" Donnelly \"fails to cite to any authority finding an opinion poll [regarding] a future event constitutes a false factual assertion.\"\n\nDonnelly also alleges \"negligent misrepresentation to a reckless degree.\" That claim requires a plaintiff to show that the defendant, by virtue of his profession and his relationship to the plaintiff, had a \"duty of care.\"\n\nThe Iowa Supreme Court has said \"professionals such as accountants, abstractors, and attorneys owe a duty of care in supplying information to foreseeable third parties as members of a limited class of persons who would be contemplated to use and rely upon the information.\" But that duty extends only to \"a person in the profession of supplying information for the guidance of others\" who \"acts in an advisory capacity,\" is \"manifestly aware of the use [to which] the information will be put,\" and \"intends to supply it for that purpose.\"\n\nDonnelly's negligent misrepresentation claim \"fails because a pollster and a general\ncirculation newspaper reporting on the results of an election poll are not in the business or profession of supplying information to a limited class of others who [they know will] rely on the information,\" Ebinger says. \"The relationship between a newspaper and the public is fundamentally different from the relationship between an accountant or attorney and his or her client. There is no 'limited class of persons' a newspaper contemplates will use the information the paper publishes.\"\n\nDonnelly asserted that Selzer and the Register violated the Iowa Consumer Fraud Act, which prohibits \"unfair\" or \"deceptive\" practices \"in connection with the advertisement, sale, or lease of consumer merchandise.\" That claim, Ebinger says, \"fails because publishing the results of a political opinion poll that matches the co-published methodology is not an unfair or deceptive practice.\"\n\nAn \"unfair practice\" entails \"substantial and unavoidable injury to consumers.\" That did not occur here, Ebinger says.\n\nDonnelly claimed the defendants promised \"trustworthy, accurate news\" and \"knowingly or recklessly failed to deliver that product\" by \"blowing their biggest story of the year.\" Under Iowa law, \"a course of conduct contrary to what an ordinary consumer would anticipate contributes to a finding of an unfair practice.\" But \"ordinary customers of the Des Moines Register would expect the paper to publish the Iowa Poll as it has done for decades,\" Ebinger writes. \"Consumers would expect the poll to be conducted commensurate with the methodology accompanying the poll. Consumers would understand from the methodology statement, as well as the inherently uncertain nature of opinion polling, that polling is an inexact science which can yield errant results in prognosticating future election results.\"\n\nDonnelly \"cites to no law which establishes that mere inaccuracy of an opinion poll constitutes an unfair practice,\" Ebinger notes. \"Donnelly's assertion is also internally contradictory as such a standard would mean every [pollster] cited favorably by Donnelly was similarly engaged in an unfair practice because they too published polls which did not accurately forecast the election outcome.\"\n\nTo establish \"deception,\" a plaintiff must show that \"an act or practice\" was \"likely to mislead a substantial number of consumers as to a material fact or facts.\" Deception \"therefore necessarily requires the false statement or material omission of a fact,\" Ebinger writes. \"Donnelly does not allege any misrepresentation with regard to either the methodology statement or the poll results…No factual information regarding how the poll was conducted was withheld from readers. The article fully described the poll results [and the] the poll methodology, and provided additional analysis of the surprising nature of the results.\"\n\nDonnelly claimed Selzer and the Register engaged in \"professional malpractice.\" But he \"fails to allege the necessary element of duty,\" Ebinger says.\n\nDonnelly argued that the defendants owed Register readers \"the ordinary care of a\njournalist or pollster,\" which would have entailed recognizing \"the obvious problems with the Iowa Poll.\" But \"the nature of the relationship between newspapers and their readers…does not impose such a general duty,\" Ebinger writes. \"Donnelly fails to cite\nto any Iowa law imposing such a duty on newspapers, and courts generally find no such duty exists.\" She quotes one of those decisions, which concluded that \"imposing a high duty of care on those in the business of news dissemination and making that duty run to a wide range of readers or TV viewers would have a chilling effect which is unacceptable under our Constitution.\"\n\nTo illustrate the implications of imposing such a legal duty, Ebinger cites a 1999 decision rejecting the proposition that the Weather Channel could be held liable for an inaccurate forecast. The judge noted \"the litany of absurd suits which could follow from imposing such a duty, such as construction workers suing when they pour concrete in reliance on a weather report forecasting no rain or commuters suing when they are stuck in traffic and late to work because the news reported there would be light traffic,\" Ebinger writes. \"Finding for Donnelly here would permit similar absurdity.\"\n\nFinally, Donnelly argued that Selzer and the Register were guilty of \"interference with the right to vote.\" In support of that claim, he cited a 1911 Iowa case involving local officials who prevented someone from voting. The outcome hinged on \"the proper interpretation of the Iowa Code section governing voter eligibility,\" Ebinger notes, and the decision \"makes no mention of a cognizable tort under Iowa law for interference with the right to vote.\" Donnelly \"cites to no other Iowa law establishing such a tort.\"\n\nLike Donnelly's lawsuit, Trump's complaint against Selzer and the Register alleged \"fraudulent misrepresentation,\" \"reckless negligent misrepresentation,\" and violations of the Iowa Consumer Fraud Act. \"The claims are essentially identical,\" notes Robert Corn-Revere, chief counsel at the Foundation for Individual Rights and Expression, which represents Selzer.\n\nTrump's case, like Donnelly's, was assigned to Ebinger. But on September 30, he asked her to dismiss it without prejudice. She initially resisted but was overruled by the U.S. Court of Appeals for the 8th Circuit last week. \"Right now,\" Corn-Revere says, \"the question in the Trump case is about whether it will remain in federal court.\"\n\nCorn-Revere nevertheless welcomed Ebinger's ruling in Donnelly's case. \"This decision shows where petty politics ends and the rule of law begins,\" he said in a press release. \"The court's strongly worded opinion confirms that a legal claim cannot be concocted with political slogans and partisan hyperbole, and that there is no hiding from the First Amendment. This is a good day for freedom of speech.\"","summary":"On Thursday, a federal judge dismissed a lawsuit that echoed Donald Trump's claims against the Des Moines Register and pollster Ann Selzer.","url":"https://reason.com/2025/11/07/this-ruling-does-not-bode-well-for-trumps-attempt-to-portray-journalism-as-consumer-fraud/","image":"https://reason.com/wp-content/uploads/2025/10/trump-face-1200x675.jpg","video":null,"publish_date":"2025-11-07 19:40:53","author":"Jacob Sullum,Joakim Book","authors":["Jacob Sullum","Joakim Book"],"language":"en","category":"politics","source_country":"us","sentiment":-0.598},{"id":376847090,"title":"None of the above: Democrats were asked to name who the real leader of their party is – and most don’t know","text":"While Democrats essentially swept Tuesday’s off-cycle elections by overwhelming margins, boosted by Donald Trump’s historic unpopularity and an extremely energized liberal base, the party is still hunting for a figurehead leader who can help them retake power from the GOP.\n\nAccording to a new poll from Politico, the most popular answer when Democratic voters were asked who they considered to be the real leader of the party was “I don’t know.” Finishing in third place was “nobody.”\n\nThe survey, which polled Americans who voted for former Vice President Kamala Harris in the 2024 presidential election, showed that there are currently dozens of competitors for the crown, with Harris garnering the second most responses.\n\nEven though the ex-veep was the only person on the list to hit double-digits, only 16 percent of the people who voted for her last year believe she is the Democratic leader. In comparison, “I don’t know” or a variation of that answer was chosen by 21 percent of respondents.\n\nWith last year’s presidential nominee – who is seen as a possible 2028 contender and has been making the media rounds recently promoting a book – pulling in relatively meager support as the face of the party, a host of other senior lawmakers and ex-presidents were also named by Democrats as possible leaders.\n\nOn the flip side, the only other notable name who has been floated as a 2028 hopeful is California Gov. Gavin Newsom, who barely topped six percent in the poll despite his highly publicized antagonism towards Trump and Republicans – which culminated in his redistricting effort winning easily in Tuesday’s elections.\n\nBarack Obama, who left the White House in 2017 following Trump’s first electoral victory and cannot run again, was picked by 7.4 percent of Democratic voters as the leader of the party – just behind Senate Minority Leader Chuck Schumer and Hakeem Jeffries, the top Democrat in the House.\n\nJoe Biden, the 82-year-old former president who announced last July that he would not seek a second term amid calls for him to drop out following his disastrous debate performance against Trump, finished in 8th place at 4.4 percent.\n\n“Ugh no one,” a 26-year-old white woman in Arizona who voted for Harris told Politico when asked who the leader of the party was, while a 49-year-old white man in Maryland added: “I do not believe there is a leader right now.”\n\nWith Democratic strategists also telling Politico that this is merely “where we are” and that even they “couldn’t couldn’t tell you who the leader of the Democratic Party” despite working for Democrats, they still see a lot of hope after Tuesday’s results.\n\nTwo moderates in the Virginia and New Jersey gubernatorial races sailed to double-digit victories despite some pollsters (and Fox News) suggesting the GOP candidates – especially in Jersey – could make it close or even win the seats. At the same time, democratic socialist Zohran Mamdani convincingly beat former Gov. Andrew Cuomo in the New York City mayoral election, leading to a full-blown freakout by MAGA media and Republicans sounding the alarms about the midterms and 2028.\n\n“It felt like we’re getting our footing back, in terms of politics,” a strategist for the centrist Third Way think tank told Politico, adding: “That has not yet translated to people seeing clearly who they think is pointing the direction of the party.”\n\nOn the flip side, Trump – who can’t run in 2028 despite what some MAGA influencers have claimed – is overwhelmingly seen as the current leader of the GOP, with no other Republican even garnering three percent of the tally. The president finished at 81 percent among voters who chose him in last year’s election.\n\nJared Leopold, a strategist who has worked for the Democratic Governors Association, pointed out that the lack of a clear leader for Democrats is “pretty standard for a party that is out of power.” He compared the party’s situation right now to where Democrats were in 2008, when Obama emerged, and in 2016, when Trump became the face of the GOP.\n\n“Democrats were successful [Tuesday] as a big tent party running on affordability and against Donald Trump,” he added. “That’s a two-piece equation that will be successful for us as we move toward 2028.”","summary":"‘Ugh no one,’ a 26-year-old white woman in Arizona who voted for Harris told Politico when asked who the leader of the party was, while a 49-year-old white man in Maryland added: ‘I do not believe there is a leader right now’","url":"https://www.independent.co.uk/news/world/americas/us-politics/democrat-leader-poll-2025-kamala-harris-b2861052.html","image":"https://static.independent.co.uk/2025/10/02/15/04/FILE-PHOTO-U-S--President-Biden-attends-a-Department-of-Defense-Commander-in-Chief-farewell-ceremony.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/34lDqYt9-OhrQWqOm.mp4","publish_date":"2025-11-07 19:09:49","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.249},{"id":376847076,"title":"Katie Porter’s polling for California governor tanks after screaming fit at staffer and interview walkout","text":"Support for California gubernatorial candidate Katie Porter has tanked after she nearly stormed out of a recent interview and old footage surfaced of her berating a staffer, according to new polling.\n\nIn a UC Berkeley survey released Friday, 11 percent of Golden State voters said they back Porter, a former Democratic congresswoman, down from 17 percent in August.\n\nShe’s now been overtaken by Riverside County Sheriff Chad Bianco, a Republican, who garnered 13 percent support, up three points from this summer. The shift may reignite hope among Republicans keen on retaking the governor’s mansion for the first time in decades.\n\n“Californians are craving real leadership after eight years of [Governor Gavin] Newsom’s posturing and primping while so many are suffering,” Bianco told The Independent when asked about the survey. “A new way forward begins in November 2026 when I am elected Governor.” \n\nThe poll comes on the heels of a turbulent few weeks for Porter, one of nearly a dozen candidates running to replace term-limited Gavin Newsom in 2026. \n\nIn October, a sit-down interview she conducted with CBS News went viral after she became flustered by the reporter’s questions.\n\n“What do you say to the 40 percent of California voters, who you’ll need in order to win, who voted for [President Donald] Trump?” journalist Julie Watts asked Porter.\n\n“How would I need them in order to win, ma’am?” Porter, who made a name for herself by grilling corporate executives during congressional hearings, responded. \n\nWhen pressed on this question, she complained Watts was “unnecessarily argumentative” and came close to tearing her mic off while threatening to end the interview. \n\nThe next day, Politico obtained footage from 2021 of the then-congresswoman yelling at an aide during an online discussion with then-Energy Secretary Jennifer Granholm.\n\n“Get out of my f***ing shot!” Porter can be heard shouting when the unnamed aid briefly appears on camera to offer a correction to a statement Porter made about electric vehicles.\n\nIn response, Porter told The Independent at the time, “It’s no secret I hold myself and my staff to a high standard, and that was especially true as a member of Congress,” adding, “I have sought to be more intentional in showing gratitude to my staff for their important work.”\n\nThe two incidents have sparked fierce criticism from Porter’s rivals.\n\nBianco told FOX News that Porter’s CBS News interview revealed her “entitlement” and “narcissism.” And Betty Yee, a former California State controller, said Porter lacks the right temperament for high office.\n\nBut, it’s still early in the race and many voters still have not made up their minds about the crowded field of candidates — which is expected to grow.\n\nIn the UC Berkeley survey, nearly half of respondents, 44 percent, said they remain undecided ahead of the June primaries and November general election.\n\nAnd despite recent challenges, Porter remains the frontrunner among Democrats — a vital advantage in a state that has not elected a GOP governor since Arnold Schwarzenegger in 2006.\n\nA 19 percent plurality of Democrats said they support her. Xavier Becerra, who served as former President Joe Biden’s secretary of Health and Human Services, came in second, garnering 13 percent support.\n\nPorter is “the leading Democrat among the various ones that are in there right now,” Mark DiCamillo, director of the survey, told The Los Angeles Times. “But it’s because nobody really on the Democratic side has really jumped out of the pack. It’s kind of a political vacuum at the moment.”\n\nHe added that the relative lack of interest in the race also could be down to the special election on redistricting, which passed on Tuesday, as well as former Vice President Kamala Harris’s belated decision to not run for the governor’s mansion. \n\nNow that the special election is over, candidates can “rev up the public to pay attention,” DiCamillo said.\n\nThe survey was conducted October 20-27 with 8,141 registered voters in California and it has a margin of error of about 2 percentage points.\n\nThe Independent has reached out to Porter’s campaign for comment.","summary":"The former congresswoman has now been overtaken by a Republican sheriff, according to the poll","url":"https://www.independent.co.uk/news/world/americas/us-politics/katie-porter-california-governor-poll-b2860971.html","image":"https://static.independent.co.uk/2025/10/09/9/17/Katie-Porter.png?crop=2446.5,1631,x96.7,y0&trim=0,97,0,96&width=1200","video":"https://cdn.jwplayer.com/videos/dcNnLMkC-OhrQWqOm.mp4","publish_date":"2025-11-07 19:09:10","author":"Brendan Rascius","authors":["Brendan Rascius"],"language":"en","source_country":"gb","sentiment":0.182},{"id":376869062,"title":"US intel found Israeli military lawyers warned there was evidence of Gaza war crimes, former US officials say","text":"The United States gathered intelligence last year that Israel’s military lawyers warned there was evidence that could support war crimes charges against Tel Aviv for its military operations in Gaza reliant on American-supplied weapons, five former US officials said.\n\nThe previously unreported intelligence, described by the former officials as among the most startling shared with top US policymakers during the war, pointed to doubts within the Israeli military about the legality of its tactics that contrasted sharply with Israel’s public stance defending its actions.\n\nTwo of the former US officials said the material was not broadly circulated within the government until late in the Biden administration, when it was disseminated more widely ahead of a congressional briefing in December 2024.\n\nThe intelligence deepened concerns in Washington over Israel’s conduct in a war it said was necessary to eliminate Hamas fighters embedded in civilian infrastructure. There were concerns Israel was intentionally targeting civilians and humanitarian workers, a potential war crime which Israel has strongly denied.\n\nUS officials expressed alarm at the findings, particularly as the mounting civilian death toll in Gaza raised concerns that Israel’s operations might breach international legal standards on acceptable collateral damage.\n\nThe former US officials Reuters spoke to did not provide details on what evidence, such as specific wartime incidents, had caused concerns among Israel’s military lawyers.\n\nIsrael has killed more than 68,000 Palestinians during a two-year military campaign, say Gaza health officials. Israel’s military has said at least 20,000 of the fatalities were combatants.\n\nReuters spoke to nine former US officials in then-president Joe Biden’s administration, including six who had direct knowledge of the intelligence and the subsequent debate within the US government. All spoke on the condition of anonymity because of the sensitivity of the matter.\n\nReports of internal US government dissent over Israel’s Gaza campaign emerged during Biden’s presidency. This account, based on detailed recollections from those involved, offers a fuller picture of the debate’s intensity in the administration’s final weeks, which ended with President Donald Trump’s inauguration in January.\n\nIsraeli Ambassador to the US, Yechiel Leiter, declined to comment when asked for a response about the US intelligence and the internal Biden administration debate about it.\n\nNeither the Israeli prime minister’s office nor the Israeli military spokesperson immediately responded to requests for comment.\n\nDebate intensified in final days of Biden term\n\nThe intelligence prompted an interagency meeting at the National Security Council (NSC), where officials and lawyers debated how and whether to respond to the new findings.\n\nA US finding that Israel was committing war crimes would have required, under US law, blocking future arms shipments and ending intelligence sharing with Israel.\n\nIsrael’s intelligence services have worked closely with the US for decades and provide critical information, in particular, about events occurring in the Middle East.\n\nBiden administration conversations in December included officials from across the government, including the State Department, the Pentagon, the intelligence community and the White House. Biden was also briefed on the matter by his national security advisers.\n\nThe White House did not immediately respond to a request for comment.\n\n“We do not comment on intelligence matters,” a State Department spokesperson said in response to emailed questions about Reuters reporting.\n\nThe American debate about whether the Israelis had committed war crimes in Gaza ended when lawyers from across the US government determined that it was still legal for the US to continue supporting Israel with weapons and intelligence because the US had not gathered its own evidence that Israel was violating the law of armed conflict, according to three former US officials.\n\nThey reasoned that the intelligence and evidence gathered by the US itself did not prove the Israelis had intentionally killed civilians and humanitarians or blocked aid, a key factor in legal liability.\n\nSome senior Biden administration officials feared that a formal US finding of Israeli war crimes would force Washington to cut off arms and intelligence support — a move they worried could embolden Hamas, delay ceasefire negotiations, and shift the political narrative in favour of the group.\n\nHamas killed 1,200 people and abducted 251 in its October 7, 2023 attack, with Israel launching its campaign in retaliation.\n\nThe decision to stay the course exasperated some of those involved who believed that the Biden administration should have been more forceful in calling out Israel’s alleged abuses and the US role in enabling them, said former US officials.\n\nPresident Trump and his officials were briefed by Biden’s team on the intelligence but showed little interest in the subject after they took over in January and began siding more powerfully with the Israelis, said the officials.\n\nState Department lawyers repeatedly raised concerns\n\nEven before the US gathered war crimes intelligence from within the Israeli military, some lawyers at the State Department, which oversees legal assessments of foreign military conduct, repeatedly raised concerns with US Secretary of State Antony Blinken that Israel might be committing war crimes, according to five former US officials.\n\nAs early as December 2023, lawyers from the State Department’s legal bureau told Blinken in meetings that they believed Israel’s military conduct in Gaza likely amounted to violations of international humanitarian law and potentially war crimes, two of the US officials said.\n\nBut they never made a conclusive assessment that Israel was violating international humanitarian law, a move that other US officials at the State Department saw as the legal bureau pulling its punches.\n\n“They saw their job as being justifying a political decision,” one of the former US officials said. “Even when the evidence clearly pointed to war crimes, the Get-Out-Of-Jail-Free card was proving intent,” one of the officials said.\n\nThe lack of a definitive conclusion by the State Department’s lawyers was largely reflected in a US government report produced during the Biden administration in May 2024, when Washington said Tel Aviv might have violated international humanitarian law using US-supplied weapons during its military operation in Gaza.\n\nThe report, which was prepared by the State Department, stopped short of a definitive assessment, citing the fog of war.\n\n“What I can say is that the Biden administration constantly reviewed Israel’s adherence to the laws of armed conflict, as well as the requirements of our own laws,” Blinken said through a spokesperson for this story. Blinken declined to comment on the intelligence matters.\n\nInternational concerns about possible war crimes\n\nLast November, the International Criminal Court in The Hague issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former defence chief, as well as Hamas leader Mohammed Deif, for alleged war crimes and crimes against humanity in the Gaza conflict.\n\nHamas has since confirmed Israel killed Deif.\n\nIsrael has rejected the jurisdiction of the Hague-based court and denies war crimes in Gaza. Hamas leaders have dismissed allegations that they committed war crimes.\n\nAmong the issues debated by US officials in the final weeks of the Biden administration was whether the government would be complicit if Israeli officials were to face charges in an international tribunal, said people familiar with this debate.\n\nUS officials publicly defended Israel but also privately debated the issue in light of\nintelligence reports, and they became a point of political vulnerability for Democrats. Biden and later Vice President Kamala Harris waged ultimately unsuccessful presidential campaigns.\n\nBiden did not respond to a request for comment.\n\nIsrael, which is fighting a genocide case at the International Court of Justice, rejects genocide allegations as politically motivated and says that its military campaign targets Hamas, not Gaza’s civilian population.\n\nThe Israeli military says it seeks to minimise civilian harm while targeting militants embedded in hospitals, schools and shelters, using warnings and appropriate munitions.\n\nAn Israeli military official told Reuters in September that the military was investigating about 2,000 incidents of possible misconduct, including civilian deaths and damage to infrastructure.\n\nSome cases came to light through the genocide case filed at the International Court of Justice, the official said.","summary":"The United States gathered intelligence last year that Israel’s military lawyers warned there was evidence that could support war crimes charges against Tel Aviv for its military operations in Gaza reliant on American-supplied weapons, five former US officials said.\n\n\nThe previously unreported intelligence, described by the former officials as among the most startling shared with top US policymakers during the war, pointed to doubts within the Israeli military about the legality of its tactics that contrasted sharply with Israel’s public stance defending its actions.\n\n\nTwo of the former US officials said the material was not broadly circulated within the government until late in the Biden administration, when it was disseminated more widely ahead of a congressional briefing in December 2024.\n\n\nThe intelligence deepened concerns in Washington over Israel’s conduct in a war it said was necessary to eliminate Hamas fighters embedded in civilian infrastructure. There were concerns Israel was intentionally targeti","url":"https://www.dawn.com/news/1953727/us-intel-found-israeli-military-lawyers-warned-there-was-evidence-of-gaza-war-crimes-former-us-officials-say","image":"https://i.dawn.com/large/2025/11/072344305f6822e.webp","video":null,"publish_date":"2025-11-07 19:01:09","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.171}]}