{"offset":0,"number":50,"available":370,"news":[{"id":321801968,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban (Business)","text":"A pregnant woman in Georgia who was declared brain dead after a medical emergency has been on life support for three months to let the fetus grow enough to be delivered, a move her family says a hospital told them was required under the state's strict anti-abortion law.\n\nWith her due date still more than three months away, it could be one of the longest such pregnancies. Her family is upset that Georgia’s law that restricts abortion once cardiac activity is detected doesn’t allow relatives to have a say in whether a pregnant woman is kept on life support.\n\nGeorgia’s so-called “heartbeat law” is among the restrictive abortion statutes that have been put in place in many conservative states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta's Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNorthside did not respond to a request for comment Thursday. Emory Healthcare said it could not comment on an individual case because of privacy rules, but released a statement saying it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws. Our top priorities continue to be the safety and wellbeing of the patients we serve.”\n\nGeorgia's abortion ban\n\nSmith's family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because state law bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after Roe v. Wade was overturned in the 2022 Dobbs v. Jackson Women’s Health Organization ruling, opening the door to state abortion bans. Twelve states are enforcing bans on abortion at all stages of pregnancy and three others have bans like Georgia's that kick in after about six weeks.\n\nLike the others, Georgia's ban includes an exception if an abortion is necessary to maintain the woman's life. Those exceptions have been at the heart of legal and political questions, including a major Texas Supreme Court ruling last year that found the ban there applies even when there are major pregnancy complications.\n\nSmith's family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk told WXIA that doctors told the family that the fetus has fluid on the brain and that they're concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. She has not said whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, the lead plaintiff in a lawsuit challenging Georgia’s abortion law, said the situation is problematic.\n\n\"Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe life support is legally required in this case.\n\nBut she said whether a state could insist Smith remains on life support is uncertain since the overturning of Roe, which found that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nWhat is the fetus' prognosis?\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on life support for about two months because she was pregnant. A judge eventually ruled that the hospital was misapplying state law, and life support was removed.\n\nBrain death in pregnancy is rare. Even rarer still are cases in which doctors aim to prolong the pregnancy after a woman is declared brain-dead.\n\n“It’s a very complex situation, obviously, not only ethically but also medically,” said Dr. Vincenzo Berghella, director of maternal fetal medicine at Thomas Jefferson University in Philadelphia.\n\nA 2021 review that Berghella co-authored scoured medical literature going back decades for cases in which doctors declared a woman brain-dead and aimed to prolong her pregnancy. It found 35.\n\nOf those, 27 resulted in a live birth, the majority either immediately declared healthy or with normal follow-up tests. But Berghella also cautioned that the Georgia case was much more difficult because the pregnancy was less far along when the woman was declared brain dead. In the 35 cases he studied, doctors were able to prolong the pregnancy by an average of just seven weeks before complications forced them to intervene.\n\n“It’ s just hard to keep the mother out of infection, out of cardiac failure,” he said.\n\nBerghella also found a case from Germany that resulted in a live birth when the woman was declared brain dead at nine weeks of pregnancy — about as far along as Smith was when she died.\n\nA spotlight on Georgia's abortion law\n\nGeorgia's law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but that the law is “an appropriate check” because the mother is pregnant. He said Smith's relatives have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.","summary":"A pregnant woman in Georgia who was declared brain dead after a medical emergency has been on life support for three months to let the fetus grow enough to be delivered, a move her family says a hospital told them was required under the state's strict anti-abortion law. With her due date still more ...","url":"https://www.castanet.net/news/Business/550717/Hospital-tells-family-brain-dead-Georgia-woman-must-carry-fetus-to-birth-because-of-abortion-ban","image":"https://www.castanet.net/content/2025/5/51c57b1a57b722f519f6decc8954ac353b4bbbcea88a96ad1d52be47a81b9f78_p4198876.jpg","video":null,"publish_date":"2025-05-16 00:41:00","author":"Jeff Amy,The Canadian Press","authors":["Jeff Amy","The Canadian Press"],"language":"en","source_country":"ca","sentiment":-0.339},{"id":321792014,"title":"Democrats keep trying to move past the cover up around Biden’s decline. It’s not helping their credibility","text":"Democrats are not doing themselves any favors with their reactions to the new book on Joe Biden coming out from Alex Thompson and Jake Tapper.\n\nThe two reporters are due to release Original Sin, a collection of their reporting on the cover up around Biden’s mental and physical decline, on May 20. The book’s excerpts are already causing a ruckus, as they detail startling instances of Biden’s gaps in mental acuity that were reportedly hidden from the public through 2024.\n\nBiden, whom aides reportedly considered putting in a wheelchair at points, reportedly did not recognize Hollywood megastar George Clooney at an event the president had flown in to Los Angeles specifically for Clooney to host on his behalf. Other excerpts claimed he forgot the names of longtime aides, including that of his national security adviser, Jake Sullivan.\n\nThe top quote of the week: “It's all Biden. He totally f***ed us.”\n\nDavid Plouffe’s declaration in Original Sin gives voice to the party’s furious silent undercurrent of supporters, many of whom did vote for Kamala Harris in 2024 but still watched helplessly on election night as she underperformed nationally and lost ground to Republicans even in deep blue states. The architect of Barack Obama’s 2008 campaign juggernaut, Plouffe’s complaint followed an evisceration of the Biden administration policy on Israel/Gaza by the Obamaworld hosts of Pod Save the World.\n\nThe right, meanwhile, keeps hammering the two reporters and the Washington media at large for the so-called revelations. Arguing that reporters (including from Tapper’s network, CNN) led the charge to hide Biden’s deficiencies, Republicans argued this week that the two are attempting to cash in on their own failures.\n\nThey are correct to do so. Democrats (led by Biden’s inner circle and a defiant president himself) willingly undermined their own credibility by getting the party into this mess, and should show some capacity for self-reflection — not more breathless attacks on the press — to overcome it.\n\n“I think some of the criticism is fair, to be honest,” said Tapper on Wednesday.\n\nInside Washington claims at least partial innocence here; in February of 2024, we wrote that Biden’s age provoked real questions for voters, and that his team “risk[ed] being seen as trying to conceal something” by ignoring those concerns. But with the imminent release of Tapper and Thompson’s book, questions are likely to be raised about just how far back the former president’s decline really went.\n\nMany Bidenworld loyalists continue to circle the wagons, in true Trumpian fashion. Whether denying the book’s revelations outright or chastising reporters falsely for “focusing” on the issue, the former president and his loyalists continue to insist that they are beyond reproach.\n\n\"The only reason I got out of the race was because I didn't want to have a divided Democratic Party,\" he told the hosts of The View this month.\n\nSenate Majority Leader Chuck Schumer, interviewed this week by CNN’s Kasie Hunt, dodged questions on the issue entirely.\n\nMSNBC’s Chuck Todd, who called the criticism of the media a “right-wing manufactured” narrative, tore into Schumer on a CNN panel.\n\n“He’s as responsible as anybody else,” said Todd. “He was a leader in the party. He could’ve said something sooner, and he didn’t.”\n\nThe defenses are beginning to become grating to hear even for Democrats, who believe that Biden is doing himself no favors.\n\nSteve Schale, who ran the “Draft Biden” PAC ahead of the 2016 primary, said: “There is a way for President Biden to build his post-presidency, but this isn’t it.\n\n“I really wish he’d embrace the thing that’s been his calling card for 50 years: his humanity.”\n\nMost importantly: the president’s defenders give voters the impression that Democrats are still engaged in deception — at a time when the party’s supposed advantages include Donald Trumps’ low marks for honesty and integrity.\n\nThe ex-president was underwater on this issue through the entirety of 2024. The release of Original Sin is going to be the last nail in the coffin, not the first. \n\nNo one is going to believe the denials now — especially when many of the people making them insisted that there were no problems and that the president wouldn’t even consider withdrawing from the race.\n\nIt’s time for Joe to ride off into the sunset. His defenders need to stop lashing out at everyone around them and get back to rebuilding voter trust ahead of the next election cycle.","summary":"Democrats are trying to rebuild trust with voters. Why is Joe Biden trying to rewrite history when only his loyalists believe him, asks John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/biden-health-age-2024-election-harris-b2752069.html","image":"https://static.independent.co.uk/2025/05/15/23/02/GettyImages-2194940093.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/E3mvbTJF-OhrQWqOm.mp4","publish_date":"2025-05-15 23:26:01","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.346},{"id":321787510,"title":"Watch: Should judges be able to block Trump on birthright citizenship?","text":"Watch: Should judges be able to block Trump on birthright citizenship?\n\nSkip to content\n\nIsrael-Gaza War\n\nWar in Ukraine\n\nUS & Canada\n\nUK Politics\n\nN. Ireland Politics\n\nScotland Politics\n\nWales Politics\n\nLatin America\n\nMiddle East\n\nIn Pictures\n\nBBC InDepth\n\nExecutive Lounge\n\nTechnology of Business\n\nFuture of Business\n\nScience & Health\n\nArtificial Intelligence\n\nAI v the Mind\n\nArt & Design\n\nEntertainment News\n\nArts in Motion\n\nDestinations\n\nAustralia and Pacific\n\nCaribbean & Bermuda\n\nCentral America\n\nMiddle East\n\nNorth America\n\nSouth America\n\nWorld’s Table\n\nCulture & Experiences\n\nThe SpeciaList\n\nNatural Wonders\n\nWeather & Science\n\nClimate Solutions\n\nSustainable Business\n\nGreen Living\n\nWatch: Should judges be able to block Trump on birthright citizenship?\n\nThe US Supreme Court listened to the birthright citizenship case on Thursday, which asked whether lower court judges should be able to block presidential orders for the entire country - as they have done in this case.\n\nThe BBC's North America correspondent Will Grant looks at what happened at the highest court, which has left the justices divided over judges' power in the case.\n\n30 minutes ago\n\nUS Supreme Court\n\nCitizenship\n\nDonald Trump\n\nUnited States\n\nBiden: Withdrawing from 2024 race earlier 'wouldn't have mattered'\n\nThe former US president says he has no regrets over his late withdrawal in the contest against Donald Trump.\n\nUS & Canada\n\nWatch: Biden's first interview since leaving the White House\n\nFormer US President Joe Biden talks Trump, Russia and US-Europe relations with the BBC's Today programme.\n\nUS & Canada\n\n'A transformational president' - how Carney flattered Trump to defuse 51st state row\n\nThe newly-elected prime minister repeated that Canada is not for sale during his visit to the White House.\n\nUS & Canada\n\nCarney: 'Some places are never for sale'. Trump: 'Never say never'\n\nTrump dominated the discussion, but Carney made his position clear on issues like tariffs and Canada becoming America's 51st state.\n\nUS & Canada\n\nWatch: Rihanna's baby bump and suits galore from 2025 Met Gala red carpet\n\nThe theme for this year's event was \"Superfine: Tailoring Black Style,\" the first since 2003 to focus exclusively on menswear.\n\nUS & Canada\n\nWhat Canada's Mark Carney can expect when he meets Trump\n\nThe BBC's Anthony Zurcher looks at how past Oval Office meetings could set the tone for the prime minister's visit to Washington.\n\nUS & Canada\n\nWatch: BBC reports from pier 33 - the gateway to Alcatraz\n\nAs Trump orders the reopening of the notorious prison, Lily Jamali takes a closer look at what draws tourists there.\n\nUS & Canada\n\nGavin Newsom on why Democrats got 'crushed' by Trump\n\nCalifornia's governor was also asked by BBC Newsnight about his rumoured White House ambitions.\n\nUS & Canada\n\nCarney explains rare step of asking Charles to open parliament\n\nThe prime minister also laid out how he will approach forthcoming talks with President Donald Trump.\n\nUS & Canada\n\n'Well there you go' - watch moment spokeswoman learns Waltz news\n\nTammy Bruce found out about Mike Waltz's job change from a reporter during a news briefing on Thursday.\n\nUS & Canada\n\nWatch: Trump says US kids might have 'two dolls instead of 30' due to tariffs\n\nThe US president was addressing possible shortages due to tariffs on China during a cabinet meeting on Wednesday.\n\nUS & Canada\n\nWatch: Runaway kangaroo closes stretch of Alabama interstate\n\nRunaway kangaroo 'Sheila' shut down part of an interstate in Alabama before being caught.\n\nUS & Canada\n\nKamala Harris hits out at Trump in first major speech since losing election\n\nThe former vice-president criticises the administration's agenda.\n\nUS & Canada\n\nWatch: Trump jokes he'd 'like to be Pope'\n\nDonald Trump told reporters he had \"no preference\" over who the conclave would elect as the new pope.\n\n30 Apr 2025\n\nUS & Canada\n\nFire destroys historic US church with ties to MLK\n\nThe Clayborn Temple in Memphis, Tennessee, was the organising centre for Martin Luther King Jr's final campaign in 1968.\n\n29 Apr 2025\n\nUS & Canada\n\nWill Canada's newly-elected PM agree to meet Trump?\n\nAs the polls closed in Canada, Mark Carney told the BBC there's a partnership to be had with the US, but it will be \"on our terms\".\n\n29 Apr 2025\n\nUS & Canada\n\nRelief, disappointment or surprise? Canadians react to election result\n\nThe BBC asked voters to share their responses as the Liberals' victory became clear on the night.\n\n29 Apr 2025\n\nUS & Canada\n\nWatch: How Canada's election night unfolded\n\nAn unprecedented win and a message to Trump - a look at how Mark Carney's Liberal Party claimed victory.\n\n29 Apr 2025\n\nUS & Canada\n\nWatch: Moment Liberal supporters cheer projected Canadian election win\n\nCarney supporters erupted into cheers as the party was projected to form a government, reports our correspondent.\n\n29 Apr 2025\n\nUS & Canada\n\nWatch: Trump's first 100 days… in just 2 minutes\n\nClashes, cuts and dozens of executive orders - how the US president's second term is off to a whirlwind start.\n\n29 Apr 2025\n\nUS & Canada","url":"https://www.bbc.com/news/videos/cd624xnn0lno","image":"https://ichef.bbci.co.uk/news/1024/branded_news/d526/live/26841fb0-31da-11f0-8947-7d6241f9fce9.jpg","video":null,"publish_date":"2025-05-15 23:18:05","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.255},{"id":321793718,"title":"Whitmer is latest Democrat to dodge on party’s Biden cover-up","text":"While appearing on CNN, Whitmer, the co-chairwoman of Biden’s campaign, was asked what signs of decline she saw in the president, to which she said she had “not read the book.”\n\n“I can tell you this, that if, as the book reports, Cabinet members didn‘t have access, that tells you that, as a governor in a state, you know, halfway across the country who was working her tail off, 160 stops on a bus tour that I headlined through swing states, I didn‘t — you know, I was busy working,” Whitmer stated. “I was busy doing the connection and the voter registration, and so I can’t speak to that directly. I didn’t see the president frequently, and I can tell you I can’t speak to that directly.”\n\nWhen asked if she believed Trump would have won if Biden had dropped his reelection bid sooner or chosen not to run at all, Whitmer stated, “Maybe, maybe not.” She added that the 2024 election cycle made her “question a lot of things” she thought she had known over the last year.\n\nThe Michigan governor’s comments on Biden come after House Minority Leader Hakeem Jeffries (D-NY) was asked about the new book, which states that Biden did not recognize Hollywood icon George Clooney. Jeffries said he could not explain this, and that the party is not “looking backward” and instead is looking toward the future.\n\nSenate Minority Leader Chuck Schumer (D-NY) recently mirrored Jeffries’s comments, stating that the Democratic Party is “looking forward.” When pressed by CNN anchor Kasie Hunt if that was all he wanted to say, Schumer simply replied, “That’s it.”\n\nCOMING TO TERMS WITH THE BIDEN SENILITY COVER-UP\n\nOn Sunday, Sen. Amy Klobuchar (D-MN) suggested that Democrats would have been “served better” had the party held a proper presidential primary after Biden bowed out of the race. \n\nUpon dropping out of the 2024 election, Biden gave his endorsement to then-Vice President Kamala Harris, who went on to lose to Trump in the general election.","summary":"Gov. Gretchen Whitmer (D-MI) side-stepped answering questions on former President Joe Biden’s mental decline, suggesting that she did not “frequently” see the president ahead of the 2024 election. The Biden administration’s cover-up of concerns over the former president&#8217;s mental acuity has gained newfound attention ahead of the release of a new book, Original Sin: President [&#8230;]","url":"https://www.washingtonexaminer.com/news/3412324/gretchen-whitmer-latest-democrat-dodge-biden-cover-up/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/Whitmer-Biden-book-scaled-1024x683.webp","video":null,"publish_date":"2025-05-15 22:46:49","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.351},{"id":321778510,"title":"Democrats are delusional to blame Biden for their election mess","text":"“We got so screwed by Biden, as a party,” former Obama adviser David Plouffe is quoted saying in a New Yorker excerpt from Jake Tapper and Alex Thompson’s new book “Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again.”The supposition of the piece — headlined “How Joe Biden Handed the Presidency to Donald Trump” — is that Democrats only failed to hold the White House because of Biden’s prideful obstinacy.Scapegoating Biden for all the left’s considerable political problems is an ugly hypocrisy. It is also self-delusional.\n\nThere is a reason the Democratic Party’s polling is at historic lows right now, and it’s not just Biden’s memory problems.Let’s recall that every congressional Democrat decided to shoehorn the “Inflation Reduction Act” into law even after most economists warned it would plunge the nation into price spikes.\n\nBiden wasn’t the only one leaning into the hysterics of “semi-fascism.”\n\nIf anything, Biden had merely adopted the social science quackery on gender that so many Democrats champion.Did any elected Democrat speak out about the anarchy of illegal immigration? If so, I must have missed it.\n\nYet, according to a pre-election Pew poll, 78% of Americans believed the border was a crisis or major problem.One of the big criticisms of Biden is that he failed to make room for another candidate earlier. But almost surely, Kamala Harris would have been the nominee regardless of when Biden dropped out.\n\nDoes anyone really believe a hyper-ambitious politician ensconced in the White House was going to step aside, or let some middling governor wrest the nomination from her?\n\nThe only Democrat who consistently outperformed Harris in most polls after Biden’s debate debacle was Michelle Obama. \n\nIt was going to be Harris.What makes anyone think that Harris would have experienced more success had she enjoyed more time?\n\nAfter an initial jolt up, the vice president’s popularity steadily declined.\n\nHarris needed less time, not more. \n\nThe more the public heard from her, the more they disliked her.Harris, like any other possible Democratic candidate, was compelled to run on the president’s record.\n\nAnd that record, championed by virtually every Democrat, was unpopular long before the media were compelled to acknowledge the president’s declining mental state.The Democratic Party had blown it: Polls found that only 36% approved of Biden’s handling of the economy, 28% approved of his handling of immigration, 33% approved of his handling of foreign policy and 30% approved of his handling of the Middle East.Now, even with those numbers, elections are a contest between two visions. \n\nAnd a CBS News poll found that 65% of Americans remember the economy under Trump fondly, while only 38% said the same about Biden.Does anyone really believe that Govs. Wes Moore, Gretchen Whitmer, Gavin Newsom, Andy Beshear or JB Pritzker possess the kind of charismatic personality or compelling message to overcome that record?\n\nIt’s exceptionally unlikely.Plouffe might have been one of the few Democrats who publicly questioned the wisdom of running a man whose mental acuity had slipped for years.\n\nUntil the day of the first 2024 presidential debates, however, virtually the entirety of the party and media had been shielding Biden.\n\nIf the president had refused to debate Trump, the left would have almost surely kept on concealing Biden’s condition. \n\nIt had no choice but to turn on the president once he had been exposed.We learn in The New Yorker that Biden didn’t recognize George Clooney at the infamous Hollywood fundraiser where Barack Obama had to lead the president off-stage by hand.\n\nRecall that even at this point, the big media were still gaslighting the public about the president’s deteriorating acuity. \n\nThree days later, Tapper’s colleague wrote in CNN’s media newsletter that the claim had been a “fabrication.”\n\nTwo days before the debate, then-Majority Leader Chuck Schumer (D-NY) had told reporters the president was sharper than he’d been in years.\n\n“He’s fine. All this right-wing propaganda that his mental acuity has declined is wrong,” Schumer said.In the New Yorker piece, we learn that Schumer would speak to Biden on the phone regularly, “and, after some chit chat,” the president would “admit that he’d forgotten why he’d called.”\n\n“Sometimes he rambled. Sometimes he forgot names. Schumer wasn’t concerned about Biden’s acuity, but he was worried about the optics.”The president is the most powerful man in the world, and the Senate leader was worried about optics.\n\nSo, indeed, was the rest of his party.Which is merely to say that the Democrats screwed themselves.\n\nDavid Harsanyi is a senior writer at the Washington Examiner.","summary":"Now that they've admitted the truth about Joe Biden's mental decline, Democrats are rushing to pin their party's troubles on him.","url":"https://nypost.com/2025/05/15/opinion/democrats-are-delusional-to-blame-biden-for-their-mess/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/JEMDED.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-05-15 22:27:29","author":"David Harsanyi","authors":["David Harsanyi"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.375},{"id":321776440,"title":"Democrats Get Another Bad Signal From New Poll","text":"Only about one in three Democrats feel optimistic about the future of their party, according to a new poll.Newsweek reached out to the Democratic National Committee (DNC) for comment via email.Why It MattersPresident Donald Trump's victory over former Vice President Kamala Harris in last year's election left the Democratic Party fractured over the best way to move forward. The disputes are ideological—between more moderate and progressive Democrats—but also have generational elements.Others in the party are simply fed up with what they view as a feeble reaction to Trump across the board. Democrats have also faced criticism this week amid a new book from CNN's Jake Tapper and Axios' Alex Thompson detailing former President Joe Biden's condition before he withdrew from the election, as well as internal disputes at the DNC.What To KnowDemocrats' polling numbers are not improving much, even despite growing dissatisfaction with the Trump administration's handling of issues like immigration and the economy. A new poll from the Associated Press (AP) and NORC at the University of Chicago found that most Democrats are not particularly optimistic about their own party.The poll, which surveyed 1,175 adults nationwide from May 1 to May 5, found only 35 percent of Democrats are optimistic about the party's future, while 36 percent are pessimistic. Twenty-nine percent said they are neither.The latest figures are worse for Democrats than in July 2024, when a poll found that 57 percent were optimistic about the party's future. Twenty-six percent were pessimistic, while 16 percent said they did not feel either way.That earlier poll was conducted from July 25 to July 29 among 1,148 adults—just days after Biden dropped out and endorsed Harris. In the early days of the Harris campaign, many Democrats felt hopeful about her chances of victory, as polls showed her more competitive against Trump than Biden, who had faced growing questions about his ability to lead the country for another four years.After November, however, national Democrats have struggled to win back the confidence of their own voters. Democratic frustration with congressional leaders boiled over in March after Senate Minority Leader Chuck Schumer and other Democratic senators voted in support of a GOP bill to temporarily fund the government despite concerns of potential cuts.Conversely, the AP/NORC poll found that Republicans were more positive about the future of their party. Fifty-five percent said they were optimistic about the future of the GOP, while only 21 percent said they were pessimistic. Twenty-four percent said they were neither. The poll had a margin of error of plus or minus 4 percentage points.What People Are SayingFormer Transportation Secretary Pete Buttigieg, speculated as a potential presidential candidate for Democrats, said in Cedar Rapids, Iowa, this week: \"Democrats do not have the best brand around here or in a lot of places. There's a lot of reasons for that. Some fair, and some not fair.\"Veteran Democratic strategist James Carville said on CNN: \"We're winning elections left and right. As we're talking about how the Democratic number or image is low, it's in the toilet, or whatever you want to say. I don't dispute that. We just won an election in Omaha and beat a 12-year incumbent. We're winning elections in Senate districts and House districts that Trump carried in Iowa by 20. We're winning the elections. We won in Wisconsin by 10.\"CNN pollster Harry Enten said earlier in May: \"These numbers should be a major wake-up call for Democrats. Democrats cannot count their chickens just yet, because those eggs have not cracked at this particular moment.\"What Happens NextAs Democrats work to figure out the direction of the party, they're also preparing for the 2026 midterms, when they will aim to win back voters who shifted toward Trump last year.","summary":"Only 35 percent of Democrats feel optimistic about the future of their party, according to a new poll.","url":"https://www.newsweek.com/democrats-not-optimistic-future-poll-2073015","image":"https://d.newsweek.com/en/full/2645705/senate-minority-leader-chuck-schumer.jpg","video":null,"publish_date":"2025-05-15 22:11:58","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.309},{"id":321774312,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"ATLANTA (AP) — A pregnant woman in Georgia was declared brain-dead after a medical emergency and doctors have kept her on life support for three months so far to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say.\n\nShe could be kept in that state for months more.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta’s Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNorthside did not respond to a request for comment Thursday. Emory Healthcare said it could not comment on an individual case because of privacy rules, but released a statement saying it “uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia’s abortion laws and all other applicable laws. Our top priorities continue to be the safety and wellbeing of the patients we serve.”\n\nGeorgia’s abortion ban\n\nSmith’s family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because state law bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after Roe v. Wade was overturned in the 2022 Dobbs v. Jackson Women’s Health Organization ruling, opening the door to state abortion bans. Twelve states are enforcing bans on abortion at all stages of pregnancy and three others have bans like Georgia’s that kick in after about six weeks.\n\nLike the others, Georgia’s ban includes an exception if an abortion is necessary to maintain the woman’s life. Those exceptions have been at the heart of legal and political questions, including a major Texas Supreme Court ruling last year that found the ban there applies even when there are major pregnancy complications.\n\nSmith’s family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk told WXIA that doctors told the family that the fetus has fluid on the brain and that they’re concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. She has not said whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, the lead plaintiff in a lawsuit challenging Georgia’s abortion law, said the situation is problematic.\n\n“Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe life support is legally required in this case.\n\nBut she said whether a state could insist Smith remains on life support is uncertain since the overturning of Roe, which found that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nWhat is the fetus’ prognosis?\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on life support for about two months because she was pregnant. A judge eventually ruled that the hospital was misapplying state law, and life support was removed.\n\nBrain death in pregnancy is rare. Even rarer still are cases in which doctors aim to prolong the pregnancy after a woman is declared brain-dead.\n\n“It’s a very complex situation, obviously, not only ethically but also medically,” said Dr. Vincenzo Berghella, director of maternal fetal medicine at Thomas Jefferson University in Philadelphia.\n\nA 2021 review that Berghella co-authored scoured medical literature going back decades for cases in which doctors declared a woman brain-dead and aimed to prolong her pregnancy. It found 35.\n\nOf those, 27 resulted in a live birth, the majority either immediately declared healthy or with normal follow-up tests. But Berghella also cautioned that the Georgia case was much more difficult because the pregnancy was less far along when the woman was declared brain dead. In the 35 cases he studied, doctors were able to prolong the pregnancy by an average of just seven weeks before complications forced them to intervene.\n\n“It’ s just hard to keep the mother out of infection, out of cardiac failure,” he said.\n\nBerghella also found a case from Germany that resulted in a live birth when the woman was declared brain dead at nine weeks of pregnancy — about as far along as Smith was when she died.\n\nA spotlight on Georgia’s abortion law\n\nGeorgia’s law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but that the law is “an appropriate check” because the mother is pregnant. He said Smith’s relatives have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"ATLANTA (AP) — A pregnant woman in Georgia was declared brain-dead after a medical emergency and doctors have kept her on life support for three...","url":"https://wsvn.com/news/us-world/hospital-tells-family-brain-dead-georgia-woman-must-carry-fetus-to-birth-because-of-abortion-ban/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/05/051525-Adriana-Smith-GA-Woman.png","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/d05ad959-ecda-414f-a823-41af8b160d9e/4bd30526-e575-43cf-9195-fb8ace790369/main.mp4?fastly_token=NjgyNmI4ZjdfOTM1NzIzM2M5YWI1MzM2MWQyZTI3YmE3Y2JiY2YxMThhO","publish_date":"2025-05-15 21:44:46","author":"Associated Press,Kathleen Ditton","authors":["Associated Press","Kathleen Ditton"],"language":"en","source_country":"us","sentiment":-0.369},{"id":321777960,"title":"‘Brain dead’ Biden never could have pulled off Trump’s show-stopping Middle East trip, Dems admit","text":"ABU DHABI — President Trump’s show-stopping trip to the Middle East — complete with lavish welcomes, diplomatic breakthroughs and business deals worth an estimated $2 trillion — have left even Democrats favorably comparing him to former President Joe Biden, whose fading cognitive abilities and lack of “stamina” are being blamed for preventing similar accomplishments.\n\n“It’s amazing what can be accomplished when the president isn’t f–king brain dead,” a senior congressional Democratic aide told The Post Thursday.\n\n“This whole Middle East trip shows [that] for a lot of these negotiations, you do really need somebody who has that energy and level-headedness,” one high-ranking Biden White House aide confided.\n\n“I’m the first person to say I do not agree with all of Trump’s policies, especially some foreign policies, but when it comes to showing up and showing strength and power, I think his team and [Trump] do a really great job of that.”\n\nTrump left Washington Monday for Saudi Arabia, Qatar and the United Arab Emirates. On the same day, his aides secured the release of Edan Alexander, the last living US citizen taken hostage by Hamas on Oct. 7, 2023, following direct negotiations with the terror group. \n\nIn Riyadh Tuesday, Trump announced an end to America’s long-running economic sanctions on Syria and met with interim President Ahmed al-Sharaa, a former Al Qaeda terrorist who insists he now values religious diversity — with Trump saying he wanted to give Syria a “chance at greatness” in a speech in which he denounced the concept of “permanent enemies.”\n\nTrump said that al-Sharaa had even agreed privately to establish diplomatic relations with Israel — one day after calling on Saudi Arabia to join the Abraham Accords recognizing the Jewish state. \n\nThe president audaciously claimed Thursday that his tour “just took in $4 trillion” in business commitments, with White House fact sheets describing “over $2 trillion” in new pledges and agreements to fast-track other business.\n\nThe administration specified $600 billion in business deals with Saudi Arabia, $243.5 billion from Qatar and $200 billion from the UAE — with the most notable calling for Qatar Airways and the UAE’s Etihad Airways to spend more than $110 billion on 238 American-made Boeing aircraft. \n\n‘A younger Joe Biden could have done that’\n\nWhile former Biden aides said the 46th president may not have lifted sanctions on Syria or agreed to a cease-fire with Yemen’s Houthis without including Israel earlier this month, they can’t help but wonder what might have been.\n\n“The deal with the Houthis, I think that a younger Joe Biden, a Joe Biden that was chairman of the Senate Foreign Relations Committee could have done that,” said the former White House official, who served the entirety of Biden’s four-year term. “I don’t know now if an older Joe Biden could have the stamina and the negotiating sense to do that at that level.”\n\nThis source added that Trump had commanded respect across the Middle East.\n\n“Landing and having all those camels, doing that big motorcade where you had the red Tesla trucks — all the Middle East really showed a deference to him, and they were trying to woo him,” they said. “And whether that’s really for his personal optics or for the United States of America, that’s to be determined.\n\n“But I am not so sure that they would have done the same kind of pomp and circumstance for Joe Biden.”\n\nThe candid analysis comes ahead of the May 20 release of “Original Sin: President Biden’s Decline, Its Cover-Up, and His Disastrous Choice to Run Again” by Jake Tapper and Alex Thompson, who have released snippets detailing Biden’s declining physical and cognitive fitness.\n\nSome Biden administration alumni attached their names to statements marveling at Trump’s recent foreign policy blitz.\n\n“[Trump] has the ability to do things politically that previous presidents did not, because he has complete unquestioned authority over the Republican caucus,” former Biden State Department spokesman Ned Price told Axios.\n\n“It’s hard not to be simultaneously terrified at the thought of the damage he can cause with such power, and awed by his willingness to brazenly shatter so many harmful taboos,” former Biden Iran negotiator Rob Malley marveled to that publication.\n\n“Those same Biden staffers can save their alligator tears after covering up his cognitive decline and pushing their woke, progressive bulls— that cost us the election,” snapped the Democratic Hill staffer, who believes Biden also set up Democrats for failure in last year’s election by clinging to his bid for re-election and then crowning then-Vice President Kamala Harris as his replacement atop the party’s ticket.\n\nThe former White House official, meanwhile, said that the differences in foreign policy between Trump and Biden speak to different power dynamics in the respective administrations.\n\nAlthough Tapper and Thompson reported that cabinet secretaries lacked regular access to Biden in the final months of his administration, “one secretary that definitely always had access was [Secretary of State Antony] Blinken,” the source said.\n\n“He was constantly around and always coming in and out of the Oval… and probably has more sway than [current Secretary of State] Marco Rubio does now.”\n\n“Unfortunately,” this person concluded. “I don’t think the president was always the loudest voice in the room, which is disappointing because the room was oftentimes the Oval [Office].”\n\nOther former Biden aides pushed back on the suggestion that Trump had been more effective on foreign policy.\n\n“Trump creates a lot of churn, but so far he hasn’t created any better outcomes,” one argued. “Trump threw Ukraine under the bus to end Russia’s invasion, but Russia is still bombing it indiscriminately and Ukraine has less leverage than ever before.\n\n“He held direct talks with Hamas, but he still hasn’t secured a return to a cease-fire. He reached a truce with the Houthis but they continue to threaten Israel and freedom of navigation in the Red Sea.”\n\n“It is great to move faster,” another former Biden aide mused, “but are they getting the desired outcomes or just more personal gain for Trump, like a hotel or a plane?”","summary":"\"When it comes to showing up and showing strength and power, I think his team and [Trump] do a really great job of that,\" an ex-Biden White House aide told The Post.","url":"https://nypost.com/2025/05/15/us-news/even-democrats-admit-brain-dead-biden-lacked-stamina-for-trump-mideast-feats/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-c03gvfzyb-1747344002618.jpg?quality=75&strip=all&1747329735&w=1200","video":"https://cdn.jwplayer.com/videos/l5dhim10-RyIcpnTz.mp4","publish_date":"2025-05-15 21:28:45","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.125},{"id":321772750,"title":"Sunny Hostin claims US is a 'misogynistic country' because female presidential candidates keep losing","text":"\"The View\" co-host Sunny Hostin on Thursday argued that the U.S. is a \"misogynistic country\" because the nation has twice failed to elect a female president, while co-hosts Sara Haines and Alyssa Farah Griffin denied sexism was to blame for the losses. Reacting to Rep. Jasmine Crockett, D-Texas, voicing concerns during a recent podcast appearance that Democrats may steer clear of nominating another female candidate for president in 2028 following the defeats of Hillary Clinton in 2016 and former Vice President Kamala Harris in 2024, Haines warned, \"We've got to stop telling the American public what they're ready for.\" However, fellow co-host Joy Behar interjected, \"We lost twice when women ran.\" Haines pushed back, asking, \"Is there no distinguishing factors to each woman and why they might have lost? Is there no nuance?\" After further back and forth, Hostin jumped in, saying, \"This country is a misogynistic country, and this country is a country that, out of all the first world countries, hasn’t been able to elect a female president. That's just factual.\" JOE AND JILL BIDEN FIRE BACK ON ‘THE VIEW’ AGAINST ACCUSATIONS OF HEALTH COVER-UP, CALL STORIES ‘WRONG’ Hostin declared that former President Bill Clinton's past was weaponized against Hillary Clinton during her campaign, and insisted she was one of the \"most qualified\" candidates for president. Haines suggested there were other reasons why Clinton did not win. Griffin also rejected the notion that sexism was the primary reason for Harris' defeat, saying, \"Sexism, racism, absolutely exist. It absolutely is a factor in elections. It is not the determinative factor in the 2024 election and I disagreed strongly with President Biden when he basically blamed that on why Kamala Harris lost.\" \"She outperformed Joe Biden when he was in the race. The numbers went up. The fundraising went up. She had a short window to run, and I think all the data that we have when you see why she lost the battleground states, it’s not because a bunch of racist Democrats didn’t turn out for her,\" Griffin continued, \"That's not why.\" Former President Joe Biden sat down with the co-hosts of \"The View\" last week and blamed sexism for Harris' loss. \"I wasn’t surprised, not because I didn’t think the vice president was the most qualified person to be president. She is. She’s qualified to be President of the United States of America. I was surprised, I was surprised because they went the route of, the sexist route, the whole route. I mean, this is a woman, she’s this, she’s that. I mean, it really, I’ve never seen quite as successful and a consistent campaign undercutting the notion that a woman couldn’t lead the country, and a woman of mixed race,\" Biden told the hosts. BILL CLINTON PREDICTS THAT USA IS LIKELIER TO ELECT A FEMALE IF SHE’S ‘A CONSERVATIVE REPUBLICAN WOMAN’ CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE On Thursday, co-host Whoopi Goldberg said, \"It’s very important that when we’re talking that you all understand why we talk from a color place, because that’s how we’re judged. That’s how we’re seen.\" \"You’re all smart people. You know, you can’t, you cannot ask people to run and, if they’re running because they want to make sure gay and straight people have the same rights, that women have the same rights as a man in this country. These can’t be weaponized as wokism,\" she added. \"We lost, we know it. I don’t know why she lost, because she was qualified. It doesn’t matter, because all that really matters now is what we’re dealing with right now,\" Goldberg said. Behar went on to argue that female candidates \"can't get elected\" in the U.S. CLICK HERE TO GET THE FOX NEWS APP \"We have experienced the reality that these women can’t get elected. You have to acknowledge that it’s certainly there,\" Behar added.","summary":"Sunny Hostin claimed on Thursday that the U.S. was a &quot;misogynistic country&quot; because it hasn&apos;t elected a female president but received some pushback from her fellow co-hosts.","url":"https://www.foxnews.com/media/sunny-hostin-claims-us-misogynistic-country-because-female-presidential-candidates-keep-losing","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/05/931/523/hostin-us-misogynistic.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-15 21:19:15","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":-0.444},{"id":321776436,"title":"Is TikTok Down Right Now? What We Know","text":"According to the website Downdetector, TikTok is experiencing a host of outages.As of 4:45 p.m., there were more than 32,000 TikTok outage reports. By 5:15 p.m., the reported outages had fallen to 18,668. By 5:30, outages were down to 12,681.Downdetector, an online platform that tracks and reports real-time outages and service disruptions, reports that 79 percent of TikTok outages are due to the mobile app, while 20 percent are linked to server connection. One percent of the outage reports are due to the website.As of 5:50 p.m. ET, TikTok has not released a statement about the outage on its social media pages. Newsweek has reached out to TikTok via its corporate media page on Thursday afternoon for comment.What to Know About TikTokTikTok is one of the world's most popular social media platforms, boasting over 1 billion monthly active users globally. Launched by Chinese tech company ByteDance, the app has experienced explosive growth since its international debut in 2018, particularly among Gen Z and younger millennials. Its popularity is driven by a highly personalized algorithm that curates short-form videos tailored to individual interests, making the platform a constant source of viral trends, challenges, and cultural moments.TikTok's massive user base and global reach have made it a dominant force in digital entertainment and a key player in shaping online culture.TikTok's Status in the U.S. Remains UnclearIn January, the U.S. Supreme Court upheld a federal law that required ByteDance, TikTok's China-based parent company to sell its operations or face a nationwide ban. The ban later went into effect and the Chinese-owned app stopped working for Americans for about 12 hours.President Donald Trump signed an order that delayed the enforcement of the ban for 75 days until April 5, then later extended the deadline another 75 days to June 19. The president has indicated he would extend the June 19 deadline for ByteDance to divest TikTok's U.S. assets if no deal is reached by that date.In a Sunday NBC News interview on Meet the Press with host Kristen Welker taped at Mar-a-Lago, Trump expressed willingness to see a deal completed, stating, \"I would... I'd like to see it done.\" Trump acknowledged having a \"sweet spot\" for the app that helped him win young voters in the 2024 election, adding, \"TikTok is - it's very interesting, but it will be protected.\"\"I won youth by 34 points. And there are those who say TikTok has something to do with it,\" Trump said at a press conference in Mar-a-Lago after his presidential election victory over Democratic nominee Kamala Harris in November.This is a developing news story and will be updated as more information is available.Update: 5/15/25, 5:30 p.m. ET: This article has been updated with additional information and remarks.Update: 5/15/25, 5:52 p.m. ET: This article has been updated with additional information.","summary":"According to the website Downdetector, TikTok is experiencing a host of outages.","url":"https://www.newsweek.com/tiktok-down-now-not-working-outage-2073014","image":"https://d.newsweek.com/en/full/2645702/tiktok-home-screen.jpg","video":null,"publish_date":"2025-05-15 21:07:54","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","source_country":"us","sentiment":0.045},{"id":321779284,"title":"Biden's alleged mental and physical decline outlined in new book","text":"When Joe Biden dropped out of the presidential race in July 2024, Democrats breathed a sigh of relief.\n\nHowever, Kamala Harris' early momentum quickly subsided pointing to a tight election. Donald Trump ended up winning comfortable to return to the White House for a second turn.\n\nAttention and blame soon turned to Mr Biden and his inner circle, as his close aides and family were accused of covering up his declining mental and physical capacity.\n\nThis issue is once again highlighted in the highly-anticipated book 'Original Sin', by CNN anchor Jake Tapper and Axios journalist Alex Thompson, which contains alarming stories about Mr Biden's mental and physical state as he continued to insist he would run for re-election, and beat Mr Trump again.\n\nThe authors interviewed 200 Democratic insiders for the book.\n\nIt is due for release on May 20th, but many US outlets have reported on large sections of the book after receiving advanced copies.\n\nOne of the allegations included Mr Biden regularly forgetting the names of aides and contacts.\n\nThese included Jake Sullivan, his national security adviser.\n\nAnother story involves Mr Biden not recognising the actor George Clooney at a fundraiser. The pair had been friends for years, and Clooney was said to be \"shaken to his core\" after the incident.\n\nClooney notably called on Mr Biden to drop out of the presidential race after the former president made his decision in July 2024.\n\nThe book also outlines how Mr Biden's inner circle, led by his wife Jill Biden, sought to hide his declining health.\n\nThis became impossible after Mr Biden's disastrous performance in a debate with Mr Trump on CNN in June 2024.\n\nAnother passage describes his staff discussing whether Mr Biden would need to use a wheelchair during a potential second term.\n\nThe book's publication will raise more questions for a Democratic Party which is still reeling after Mr Trump's election win, with no obvious leader coming forward.","summary":"When Joe Biden dropped out of the presidential race in July 2024, Democrats breathed a sigh of relief","url":"https://www.breakingnews.ie/world/bidens-alleged-mental-and-physical-decline-outlined-in-new-book-1763360.html","image":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMDVcXFwvMTUyMTAzNTlcXFwvR2V0dHlJbWFnZXMtMjE5NDM2NTA0NS1lMTc0NzMzOTQ1OTI5NS5qcGdcIixcIndpZHRoXCI6NzAwLF","video":null,"publish_date":"2025-05-15 21:05:01","author":"BreakingNews.ie,James Cox","authors":["BreakingNews.ie","James Cox"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.016},{"id":321757688,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"ATLANTA -- A pregnant woman in Georgia was declared brain-dead after a medical emergency and doctors have kept her on life support for three months to allow enough time for the baby to be born and comply with Georgia's strict anti-abortion law, family members say.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead - meaning she is legally dead - in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta's Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was later declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNorthside did not respond to a request for comment Thursday. Emory Healthcare said it could not comment on an individual case because of privacy rules, but released a statement saying it \"uses consensus from clinical experts, medical literature, and legal guidance to support our providers as they make individualized treatment recommendations in compliance with Georgia's abortion laws and all other applicable laws. Our top priorities continue to be the safety and wellbeing of the patients we serve.\"\n\nGeorgia's abortion ban\n\nSmith's family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because state law bans abortion after cardiac activity can be detected - generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after Roe v. Wade was overturned in 2022, opening the door to state abortion bans. Georgia's ban includes an exception if an abortion is necessary to maintain the life of the woman.\n\nSmith's family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk said doctors told the family that the fetus has fluid on the brain and that they're concerned about his health.\n\n\"She's pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he's born,\" Newkirk said. She has not commented on whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, the lead plaintiff in a lawsuit challenging Georgia's abortion law, said the situation is problematic.\n\n\"Her family deserved the right to have decision-making power about her medical decisions,\" Simpson said in a statement. \"Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.\"\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe Georgia's law requires life support in this case.\n\nBut she said whether a state could insist Smith remains on the breathing and other devices is uncertain since the 2022 ruling in Dobbs v. Jackson Women's Health Organization, which overturned Roe including that fetuses do not have the rights of people.\n\n\"Pre-Dobbs, a fetus didn't have any rights,\" Shepherd said. \"And the state's interest in fetal life could not be so strong as to overcome other important rights, but now we don't know.\"\n\nWhat is the fetus' prognosis?\n\nBrain death in pregnancy is rare. Even rarer still are cases in which doctors aim to prolong the pregnancy after a woman is declared brain-dead.\n\n\"It's a very complex situation, obviously, not only ethically but also medically,\" said Dr. Vincenzo Berghella, director of maternal fetal medicine at Thomas Jefferson University in Philadelphia.\n\nA 2021 review that Berghella co-authored scoured medical literature going back decades for cases in which doctors declared a woman brain-dead and aimed to prolong her pregnancy. It found 35.\n\nOf those, 27 resulted in a live birth, the majority either immediately declared healthy or with normal follow-up tests. But Berghella also cautioned that the Georgia case was much more difficult because the pregnancy was less far along when the woman was declared brain dead. In the 35 cases he studied, doctors were able to prolong the pregnancy by an average of just seven weeks before complications forced them to intervene.\n\n\"It' s just hard to keep the mother out of infection, out of cardiac failure,\" he said.\n\nBerghella also found a case from Germany that resulted in a live birth when the woman was declared brain dead at nine weeks of pregnancy.\n\nA spotlight on Georgia's abortion law\n\nGeorgia's law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory's interpretation.\n\n\"I think it is completely appropriate that the hospital do what they can to save the life of the child,\" Setzler said. \"I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.\"\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but that the law is \"an appropriate check\" because the mother is pregnant. He said Smith's relatives have \"good choices,\" including keeping the child or offering it for adoption.\n\nGeorgia's abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nAbortion bans in other states\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on maintenance measures for about two months because she was pregnant. A judge eventually ruled that the hospital keeping her alive against her family's wishes was misapplying state law, and life support was removed.\n\nTwelve states are enforcing abortion bans at all stages of pregnancy, with limited exceptions. Georgia is one of four with a ban that kicks in at or around six weeks into pregnancy - often before women realize they're pregnant.\n\nLast year, the Texas Supreme Court ruled unanimously against a group of women who challenged that state's abortion ban, saying the exceptions were being interpreted so narrowly that they were denied abortion access as they dealt with serious pregnancy complications. This year, the state Senate has passed a bill that seeks to clarify when abortions are allowed.\n\nSouth Dakota produced a video to inform doctors about when exceptions should apply. Abortion rights groups have blasted it.\n\nThe U.S. Supreme Court heard arguments in December over whether the federal law that requires hospitals to provide abortion in emergency medical situations should apply. A ruling is expected in coming months.\n\nMulvihill reported from Cherry Hill, New Jersey. Associated Press journalists Kate Brumback, Sudhin Thanawala, Sharon Johnson and Charlotte Kramon contributed.","summary":"The case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.","url":"https://abc7chicago.com/post/hospital-tells-family-brain-dead-georgia-woman-carry-fetus-birth-because-abortion-ban/16427945/","image":"https://cdn.abcotvs.com/dip/images/16427821_emory-hospital-img.jpg?w=1600","video":null,"publish_date":"2025-05-15 20:37:18","author":"Jeff Amy, Sudin Thanawala And Geoff Mulvihill","authors":["Jeff Amy, Sudin Thanawala And Geoff Mulvihill"],"language":"en","source_country":"US","sentiment":-0.291},{"id":321767312,"title":"Josh Holloway reveals '“Jerry Maguire” moment' that led to his “Lost” reunion with J.J. Abrams for “Duster”","text":"\"We have to go back.\"\n\n That's what Lost alum Josh Holloway and Lost creator J.J. Abrams told each other when discussing what their next onscreen collaboration should be.\n\n Okay, not in those exact words, but Holloway tells Entertainment Weekly that it was actually pretty similar to that iconic Lost quote when Abrams asked him to star in his new HBO Max series Duster.\n\n \"J.J. called me out of nowhere,\" Holloway says. \"I was sitting on the couch with my wife going, 'When am I ever going to work again? What is going on in this industry?' And then boom, phone call, and J.J. just said, 'You got a minute?' And he proceeded to pitch me this idea for this show, and I was blown away immediately.\"\n\n Holloway stars in '70s-set Duster as getaway driver Jim, who gets recruited by the FBI's first Black woman agent, Nina (Rachel Hilson), to go undercover and help take down the mob.\n\n \"It was the old Jerry Maguire moment — I was like, 'J.J., you had me at hello. Yes, I'm in,'\" Holloway remembers. \"This concept is phenomenal — he just opened the conversation with, 'You're a fixer for the mafia in 1972.' And I was like, 'Oh my God, my mind just blew up.' There's nothing like it on TV right now. It is like Pulp Fiction meets Starsky & Hutch.\"\n\n Below, Holloway tells EW what keeps bringing him back to these Lost reunions, what fans can expect from Duster, and how many classic cars he accidentally wrecked during filmed.\n\n ENTERTAINMENT WEEKLY: What excited you most about this series?\n\n JOSH HOLLOWAY: It was so exciting to me because I have always wanted to do a period piece and have not been able to do that yet. And this era, the '70s, to me, is so rich with everything. It was like an explosion of creativity in that era of fashion, of cars, of music, of individualism, and people finding their voice through protests. The end of the Vietnam War, the Civil Rights movement. People understanding if they think with unity, they can make change in this country. And yet it was a simpler time. I grew up in the '70s and there were just fewer people and it was free. There was no helicopter parenting. My parents would be like, \"Come in before dark,\" and you rode on tailgates in the back of trucks and rode around with no seat belts. It was just different, simpler times, man. It's just a rich era to explore, and so I slipped right into that.\n\n We saw a tiny taste of that with you on Lost when Sawyer was stuck in the '70s, but now you actually get to do it for real.\n\n [Laughs] I forgot! That's true. Yes, yes, I forgot about that moment! But now it's for real. The funniest thing is I just didn't realize you pull your pants that high up, and everything's always tucked in and tight. The first time I got out of the Duster, I ripped my pants. I was like, \"Oh wait, you can't do that.\" You have to swing both legs to the side and get out because everything is so tight. So that took some understanding of how to move. What I love about that era is it was a sexy time. Everyone kind of put it out there, and the clothes were tight. Everyone had a strut. So I was like, \"I've got to find my strut.\" So I would put on my playlist, all Jimi Hendrix, and just stroll until I hit that strut, and I was like, \"Ah, there it is.\"\n\n How else did you prepare to play Jim?\n\n He said I was going to be a driver for the mafia, so the next day I went online and found Rick Seaman's stunt driving school. I think it's called a Motion Picture Driving Academy now, but I think it was Hollywood Stunts back then. Rick Seaman was a legendary stunt driver. I took a class with him and then another guy, Chris Peterson, \"Smokey,\" he tuned me up like a private coach. And I learned every trick in the book, and they gave me the confidence to go on set and do it. J.J. and [co-creator] LaToya [Morgan] and our stunt coordinator, Troy Brown, had the confidence in me to let me do it. So I do a lot of my stunts, which is so much fun. It adds such adrenaline to your day because these are 1972 pristine cars. You can't crash. And I have — I've broke 'em.\n\n Oh no. How many?\n\n A lot of 'em. One time, on the first day, I came sliding out of a dirt road onto a highway and broke all four tires. They all just splayed out and the car just was like, \"I quit,\" down. So we were like, \"Oops.\"\n\n Tell me about some of the action you got to do in this.\n\n That's always fun. I mean, I have three brothers I grew up with in rural Georgia, so I've been doing action and stunts my whole life. Now I'm just getting paid for it. There are great fight scenes. I love the action in this because it's different. For example, I'm not playing a military-trained agent, so the fights are not that choreographed. It's more sloppy street fighting, so there's room for comedy in there. The first major fight scene I have, I'm in socks in a bowling alley and it's so slippery. There's no way you can even stand up. He's slipping all over the place while he is trying to survive. And then they put this funny dialogue in like, \"Why are you doing this, man?\" Very '70s, \"Stop, man! That's just not groovy.\" It reminds me of a lot of Snatch or Lock, Stock and Two Smoking Barrels.\n\n It's hard to imagine you saying no when J.J. calls you up with a show like this. Had he called you in the past for other roles to work with you again after Lost?\n\n No, it's funny. We hadn't seen each other in a long time — that happens in this business. I hadn't seen him for seven years. And then I bumped into him twice. Him and [his wife] Katie [McGrath] hosted a thing for Kamala Harris when she was first running for President and I supported her, so I went and I was like, \"Oh, there's J.J. Of course, it's his home.\" So I bumped into him there. And then I also support women's reproductive rights, and Damon Lindelof's wife, Heidi [Fugeman] is very involved in that. So she called us up, and we went to support that, and J.J. was there as well.\n\n So he was like, \"Two times in two weeks? I haven't seen you in seven years!\" And we just struck up conversation right then and he was like, \"What are you doing? I'm obsessed. We have to work together again.\" I was like, \"I'm available, so let's do it.\" And that's how it started. We reunited there and then the next thing you know, he called me six months later said, \"Don't take another show. I'm writing a show for you.\" Done. Instant yes.\n\n This isn't the first time you've reunited with your Lost bosses since you worked with Carlton Cuse on Colony. What is it that keeps bringing you back to these mini-Lost reunions?\n\n They're just amazing creatives. I love them. Obviously, J.J. is one of the most amazing, agile, creative people you can ever meet, in every aspect, from writing, directing, the whole world. And then Carlton as well. Carlton is always creating another idea, or we just talk about things that sometimes we do and sometimes we don't. We've had a few great ideas and we just keep in conversation and we have a trust. I think they call me because they know I have a very strong work ethic. I work hard and so they can trust me to carry something. We've worked together, we've done big things. So we're like, \"Okay, we can work together again.\" And I love that I have that relationship with both of them.\n\n How did working with J.J. on Duster compare to working with him on Lost?\n\n J.J. was very present on set this time, which was so interesting and fun and nerve-wracking. He is J.J. and you want to make sure you're doing it right. And this is the first thing he actually penned in a while. He's involved with so many projects, but he's normally directing now, so for him to actually write it? This was a vision he had from a long time ago of the phone booth, the desert, a car approaching, somebody getting out. This is an image he's been carrying around, so he had a passion towards writing it, and that was the difference. I just love his wit, and his dialogue is sharp and hilarious. And then he teamed up with LaToya Morgan, who is so cool. She's got this street-savvy adventure vibe, and they just bounce off each other so well. Working with J.J. is like putting on your favorite pair of jeans. Everything just fits. This is right. So that's how it feels.\n\n Do you find that you're still recognized the most for Sawyer, or have any of your other roles become what fans ask you about now?\n\n Mostly Sawyer still. I like having short hair normally because it's just easy, and I'm a dude, and I always wear a hat. But I grew my hair out because J.J. said, \"Grow your hair again for this role.\" And so yes, when I look like this, people are like, \"Sawyer!\" But I am always pleasantly surprised when they're like, \"I love Colony. I can't believe they canceled that.\" I'm like, \"Yes, me too!\" Or even Community, I still get that because people really, people who were fans of Community were real fans of Community. That's nice when that happens, but it's normally Lost, which is cool too. I don't mind, are you kidding me?!\n\n Since Netflix has it again, there's another resurgence of a different generation [watching Lost]. So that's always touching to me. I'm a father, and so when a parent comes up to me and says, \"I watched this 20 years ago, now I'm watching it with my son or my daughter,\" I always love that. I love watching TV with my daughter or son because they forget they're 16 or 11 and they just snuggle up to you, and you still get that snuggle time with 'em. So I always love it when people watch the show together. That's special.\n\n This interview has been edited and condensed for length and clarity.\n\n Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.\n\n Duster premieres Thursday, May 15 at 6 p.m. PT/9 p.m. ET on HBO Max.","summary":"Plus, Holloway says he crashed multiple vintage cars while playing mafia driver Jim in the HBO Max period drama.","url":"https://ew.com/josh-holloway-jj-abrams-lost-reunion-duster-11733559","image":"https://ew.com/thmb/4I4qLGfhEToqe5apycIpkLVCYrg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Josh-Holloway--JJ-Abrams0_11252019-ddd46326a0804d44b49e4e6d1684df3b.jpg","video":null,"publish_date":"2025-05-15 20:27:14","author":"Sydney Bucksbaum","authors":["Sydney Bucksbaum"],"language":"en","source_country":"US","sentiment":0.215},{"id":321761494,"title":"Donald Trump would lose to Kamala Harris if elections were held today, claims new poll","text":"A new strength In Numbers/Verasight poll says Kamala Harris would beat Donald Trump in a re-run of the 2024 election. If elections were held today, 47% would vote for Harris, 42% for Trump. If people who wouldn't vote were also to be counted, Harris gets 40%, of the popular vote while Trump languishes at 36%. The poll was done between May 1 to 6, with 1,000 adults and a 3.2% margin of error.2024 US Election resultsTrump actually won in November 2024, beating Harris in popular vote 50% to 48%. He won big in the electoral college, 312 votes to Harris 226, which ultimately sweeped the results in his favour. Before that election, some polls showed Harris leading or tied with Trump.Among people who didn't vote in 2024, 36% now support Harris, only 22% support Trump. But 43% of these non-voters say they still wouldn't vote if given a second chance. Among people who voted in 2024, Harris and Trump are tied at 43% each.Harris lost in 2024, but many still think she could be a strong candidate in 2028. She hasn’t said if she’ll run, but some in the Democrat's ranks think she might. Some also say she might run for Governor of California in 2026.Supporters say she ran a better campaign than Joe Biden did before he dropped out in 2024. They believe she helped close the gap against Trump despite the campaign already I'm disarray due to Biden's perceived ill health. But others in the party are vying for fresh faces and new leaders instead of Harris. Some also say Harris hurt her popularity by supporting moderate Republicans like Liz Cheney.Trump's popularity dropped after he launched Liberation Day tariffs on April 2. The tariffs caused stock markets to crash, the worst since June 2020. Since then, many voters don't trust Trump on the economy.In the same poll, more people didn't like how Trump is handling the economy. Only 38% said they approve, while 58% don’t, that's a -17 score. On prices and inflation, it's even worse, only 31% approve and 63% don't, giving him a -32 score.Also, 53% of people said the country's economy got worse in the past year. Just 25% think it got better.The poll shows Trump is unpopular on all issues, except border/immigration. Even on immigration, he's barely ahead, 49% disapprove, 47% approve. This matches results from a Fox News poll too.Trump got flak for a controversial deportation of Kilmar Abrego Garcia from Maryland. The DOJ called it an administrative error. The Trump admin said Garcia was part of the MS-13 gang, now labeled a terrorist group. But his family and lawyers deny any gang link.In the poll, half the people were told about Garcia's story. Among those, support for deporting all undocumented immigrants dropped to 39%. 43% were against mass deportation. When asked about people with court protections like Garcia, 49% were against deporting them, 29% supported deporting them, 22% were unsure, 45% said wrongly deported immigrants should be allowed to return, 35% said they should stay abroad.This negative view of Trump might help Kamala Harris if she runs again in 2028. She has not confirmed if she's running yet. But polls show she's the front-runner right now.Some other polls say Kamala Harris isn't doing as well. In an April poll by Data for Progress, only 18% of people said they'd vote for her in the Democratic primary. Pete Buttigieg got 14%, AOC and Cory Booker got 12% each, Newsom got 8%, Josh Shapiro got 5%, and Tim Walz, Gretchen Whitmer, and J.B. Pritzker each got 4%.Other recent polls show different numbers. One by Echelon Insights in April showed Harris at 28%. A YouGov poll from March showed her at 25%. And a Survey USA poll from February had her at 37%.Here's what some politicians are saying about Kamala Harris, Senator John Hickenlooper from Colorado told The Hill that Harris “will add value to the national conversation.” Many Democrats will have different opinions on what the party should focus on next, he added. FAQsQ1. Will Kamala Harris run for next president?She has not said yet, but many think she might.Q2. Why are people unhappy with Trump?Most don't like how he's handling the economy and prices.","summary":"A new poll shows Kamala Harris might beat Trump if elections were held today. While she lost in 2024, many still support her. Trump's falling popularity, especially on the economy, could help her chances.","url":"https://economictimes.indiatimes.com/news/international/us/donald-trump-would-lose-to-kamala-harris-if-elections-were-held-today-claims-new-poll/articleshow/121196286.cms","image":"https://img.etimg.com/thumb/msid-121196289,resizemode-4,width-1200,height-900,imgsize-79750,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-05-15 19:58:04","author":"Global Desk","authors":["Global Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.287},{"id":321768466,"title":"Trump’s “Big Beautiful Bill” Is a Sneak Attack on Abortion","text":"Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\n\nWith Donald Trump’s “big beautiful bill” of tax and Medicaid cuts up for consideration, abortion might be the last thing on anyone’s mind. But a provision buried in the bill is Republicans’ latest attempt to stop losing on reproductive rights. The current version of the GOP budget reconciliation bill includes language denying Medicaid funding to any “large provider of abortion services.” This marks a big change in the GOP’s recent approach to abortion policy. Through the early months of the Trump administration, Republicans in Congress have been remarkably reluctant to do anything big on abortion. But now they are using the president’s signature legislation to wade back into the fight.\n\nWhat made this bill different? The idea seems to be that Republicans can reframe unpopular attacks on reproductive rights as more acceptable government cost-cutting measures by relying on the Department of Government Efficiency to do their dirty work. If Americans like saving money, and are prepared to believe Elon Musk’s arguments about fraud and waste, the theory goes, maybe Republicans can deliver for their socially conservative constituents without the plan backfiring. But the GOP’s latest gambit is a reminder that there’s still no magic bullet for conservatives when it comes to reproductive rights.\n\nIt’s no surprise that anti-abortion leaders themselves have seized on this strategy. Trump has made some moves to placate abortion opponents, like announcing that no one will be prosecuted for violating the Freedom of Access to Clinic Entrances Act, which protects access to clinics and places of worship, and pardoning several defendants convicted of violating it. But for the most part, he has frozen out the anti-abortion movement. The Department of Justice hasn’t started enforcing the Comstock Act as an abortion ban. When conservative state attorneys general sued to force a shift, the Trump administration just last week asked the court to dismiss the suit for procedural reasons.\n\nThat doesn’t mean Trump won’t give anti-abortion leaders what they want later. Just Wednesday, Robert F. Kennedy Jr. announced that the Food and Drug Administration would investigate the safety of mifepristone and potentially impose new restrictions on it. But the anti-abortion movement will have to cajole Trump and hope for the best. He is the one holding all the cards.\n\nFor that reason, dressing up an abortion restriction as a DOGE priority makes sense. The administration has cut everything from funding for cancer research to military aid to Ukraine. Republicans in Congress, who seem primarily concerned about pleasing Trump, are also banking on the fact that the president will approve of abortion restrictions as long as they can be sold as something Elon Musk would love. And defunding providers could be consequential. Local clinics have struggled in recent years, as have state Planned Parenthood affiliates. Cutting these providers out of Medicaid will make it harder for them to remain open.\n\nBut the new strategy has risks, as the few Republicans who won districts Trump lost recognize. Cutting Medicaid is deeply unpopular. Most Americans see the program positively. One poll found that under 20 percent of Americans want Congress to cut Medicaid funding. So, cutting Medicaid in any way will likely be a political loser.\n\nAnd “political loser” is a good way to discuss the GOP’s conventional position on abortion. Most Americans want abortion to be legal. The go-to move for Republicans—to argue that Democrats are the true extremists on the issue—is harder when Republican-controlled states are considering ever more sweeping bans, many of them targeting people in states where reproductive rights are protected, or punishing people for donations or speech about abortion.\n\nStill, the GOP may be emboldened because Trump won in 2024, even when Kamala Harris went all in on reproductive rights. Since then, Democrats seem less focused on the issue.\n\nAt the same time, if voters actually are paying less attention, it’s probably because less seems to be happening. Republicans in Congress have sat on their hands. Trump has yet to make a big move. The truth is that plenty is still going on, with cases moving through state and federal courts, states poised to pass stringent new bills, and Trump’s future moves still shrouded in uncertainty. The minute one of these events makes news, there’s no reason to believe voters will be any happier with Republicans’ position than they ever were.\n\nAnti-abortion leaders present the 2024 election as proof that Republicans don’t need to worry about reproductive rights anymore. But that reading of the election seems less and less convincing as time goes on. In 2024, Americans held out hope for what Donald Trump could do on immigration and inflation. Now, with unpopular tariffs, fears of toy shortages at the holidays, and the president wondering aloud if he has to follow the Constitution, he seems to be underwater on both of his strongest issues. As far as abortion was concerned, voters never liked what Republicans had to say—which is why Trump seemed to take pains to downplay the issue during the campaign. Voters in 2024 seemed to buy the pitch that Trump wouldn’t or couldn’t do anything to change the status quo—that he would treat it as a “state’s issue.” Now, Republicans in Congress seem determined to prove them wrong.\n\nWe haven’t seen the last of abortion as a major election issue, no matter what GOP leaders may wish. And the winning recipe for Republicans on reproductive issues isn’t going to be to combine their unpopular position on Medicaid cuts with their position on abortion that voters already despise.","summary":"The GOP’s latest gambit is a reminder that there's still no magic bullet for conservatives when it comes to reproductive rights.","url":"https://slate.com/news-and-politics/2025/05/trump-big-beautiful-bill-medicaid-cuts-abortion.html?via=rss","image":"https://compote.slate.com/images/8cc73a3d-cee1-465f-b56c-fba5238fab93.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1200","video":null,"publish_date":"2025-05-15 19:33:42","author":"Mary Ziegler","authors":["Mary Ziegler"],"language":"en","category":"politics","source_country":"US","sentiment":-0.035},{"id":321756486,"title":"Meghan McCain merges YouTube show with podcast as low viewership plagues program","text":"Just three months after Mark Halperin made the splashy announcement that Meghan McCain would be joining his media startup to host a twice-weekly show, McCain revealed that she is “merging” that program with her other podcast and moving it to a new YouTube channel.\n\nThe rebrand comes as McCain’s Happy Hour podcast for Halperin’s 2way network has experienced soft viewership numbers since its February launch. The last broadcast of the show before the merger was announced, which featured an interview with Fox News media critic Joe Concha, has only managed a little over 4,300 views on YouTube.\n\nGoing forward, according to McCain’s announcement, the show – which had previously aired live at 5 p.m. ET on Mondays and Wednesdays – will now carry the name Citizen McCain, the podcast she first launched in 2023 and had been on hiatus throughout April. The program will continue to air live on YouTube twice a week, but move from late afternoon to noon ET, and the audio version will be broadcast on Apple and Spotify.\n\n“Our podcast is going to be our live show on 2way like we have been doing - just now with our original Citizen McCain name because quite frankly all of you like it and the brand is already on our TikTok, socials, etc,” McCain wrote on Substack earlier this month.\n\n“We will also be moving our time of recording to noon eastern on Mondays and Wednesdays so you can join live on YouTube, join our live zoom chat and ask questions, or just watch later on YouTube or download later on our podcast channels,” she added. “All you have to type in anywhere is ‘Citizen McCain’ to find our content.”\n\nMcCain added that she knew that “this journey with Citizen McCain has been a rocky one with different partnerships,” but that she and her co-host Miranda Wilkins are “very confident that our partnership with 2way.” She also stated that it has “been so fun doing a live taped show with video and believe this is the right path for us to merge the two things together,” insisting that “NOTHING about the content is changing.”\n\nAfter the original Citizen McCain podcast went dark following its March 27 episode, McCain dropped a short announcement on the audio channels about the merger on May 1, letting listeners know that the show was returning in a new form.\n\n“Meghan and Miranda have some big news! Thank you to everyone for patiently waiting out this limbo period because we're happy to announce that Citizen McCain has officially partnered with 2WAY,” McCain noted. “This means that the podcast will be back, twice a week and if you want - you can watch the full show live on YouTube Mondays and Wednesdays at noon Eastern.”\n\nDuring the first broadcast of the reboot on May 5, McCain declared that “Happy Hour is no more” before noting that both shows were combined “under one roof” at 2way. Since the rebrand, however, the response has continued to be tepid.\n\nNone of the full episodes of the new Citizen McCain has topped 5,000 views on YouTube. The show’s dedicated YouTube channel has only 2,650 subscribers as of Thursday afternoon. \n\nRepresentatives for McCain and Halperin did not respond to requests for comment.\n\nOn top of that, since her show’s facelift and merger with the old podcast, which her Citizen Cain production company had previously produced, the new episodes and clips are only being posted and shared on the Citizen McCain channel and not 2way’s. \n\nWhile the network’s YouTube channel includes a link to her channel along with a subscribe button, noting that it is “part of the 2way network,” the last time a segment or episode from McCain was posted to the main 2way channel was the April 30 live episode of Happy Hour with Concha.\n\nOverall, the most views any McCain video has attracted during her 2way partnership appears to be for a two-minute clip from a February episode of Happy Hour, which featured the headline: Joe Biden's Staff “All Hated Kamala Harris ... She Was the Joy Reid of the White House.” That video has pulled in nearly 81,000 views in nearly three months.\n\nIn general, though, most of the full Happy Hour broadcasts averaged around 10,000 views, and outside of the Kamala Harris segment and a handful of others, the vast majority of the clips from these shows drew less than 5,000 views – with many failing to even top a thousand. \n\nAt the same time, 2way itself hasn’t lit the world on fire despite bringing McCain, journalist Michael Moynihan and others “to join its growing roster of ongoing bipartisan conversations curated by the veteran journalist Mark Halperin,” as Semafor reported in February. \n\nAccording to social media analysis site Social Blade, 2way has been tallying about 83,000 views a day for its programming on YouTube, with the channel publishing an average of eight videos a day. The channel has a total of 78,400 subscribers as of Thursday afternoon, placing it in 2,428th place. Across 2,211 videos, it has pulled in a total of 22.8 million views.\n\nMcCain’s partnership with Halperin has raised some eyebrows, notably because she was extremely critical of the longtime political journalist after he was accused of sexually harassing and assaulting more than a dozen women in 2017, which led to him losing his plush gigs with MSNBC and Showtime. \n\nDespite her past revulsion over some of the accusations against Halperin, which he has denied, McCain told The Independent back in February that she now sees things differently.\n\n“With age comes wisdom and different perspectives on people. I am now a 40 year old mother of two. I have grown and evolved like everyone else, particularly in the past five years — Mark has also grown and evolved,” she said. “Like Mark, at this point in my life I believe in giving people the presumption of grace and forgiveness as I would like it in return. I have had the fortune and misfortune of having every single thing I've ever done since I was 22 well documented on the internet and thrown back in my face by people like you.”\n\nHalperin, meanwhile, has “scraped his way back” to media acceptance and prominence since his #MeToo exile. Besides launching 2way and maintaining his political analyst role with the pro-Trump channel Newsmax, he has once again become a regular presence on mainstream cable news channels, including recent appearances on Fox News. \n\nThat also includes hosting a separate podcast on the new audio and video network launched by Megyn Kelly, the former Fox News star who was a key figure in Roger Ailes' ouster amid sexual misconduct allegations.","summary":"It was just three months ago that disgraced political journalist Mark Halperin announced that Meghan McCain would be hosting a twice-weekly live show for his media startup, but that program has yet to take off with online viewers.","url":"https://www.independent.co.uk/news/world/americas/meghan-mccain-youtube-podcast-merger-b2751908.html","image":"https://static.independent.co.uk/2021/08/24/20/newFile-1.jpg?width=1200","video":null,"publish_date":"2025-05-15 19:08:26","author":"Justin Baragona","authors":["Justin Baragona"],"language":"en","source_country":"gb","sentiment":-0.021},{"id":321767994,"title":"'The View' hosts push back on Sunny Hostin declaring US is a 'misogynisitic country'","text":"to top close Video This video is playing in picture-in-picture.\n\nPrimary Media May 15, 2025 01:34 \n\n 'The View' hosts push back on Sunny Hostin declaring US is a 'misogynisitic country' \n \"The View\" co-hosts pushed back on Sunny Hostin on Thursday after she claimed the U.S. is a \"misogynistic country,\" citing Kamala Harris and Hillary Clinton's losses.\n Tags MEDIA","summary":"&quot;The View&quot; co-hosts pushed back on Sunny Hostin on Thursday after she claimed the U.S. is a &quot;misogynistic country,&quot; citing Kamala Harris and Hillary Clinton&apos;s losses.","url":"https://www.foxnews.com/video/6372857235112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3f049d64-7dbc-4e38-ae5c-71a8fcd5c1ff/7203af10-d0fa-44f1-84cf-0868d71a820b/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-05-15 19:00:04","author":null,"language":"en","source_country":"us","sentiment":0.093},{"id":321749454,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"By JEFF AMY and GEOFF MULVIHILL, Associated Press\n\nATLANTA (AP) — A pregnant woman in Georgia was declared brain-dead after a medical emergency and has been kept on life support for three months by doctors to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta’s Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was later declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNeither hospital immediately responded to emails Thursday from The Associated Press.\n\nGeorgia’s abortion ban\n\nSmith’s family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because of a provision in state law that bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after the U.S. Supreme Court overturned Roe v. Wade in 2022, opening the door to state abortion bans. Georgia’s ban includes an exception if an abortion is necessary to maintain the life of the woman.\n\nSmith’s family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk said doctors told the family that the fetus has fluid on the brain and that they’re concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. Newkirk has not commented on whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, which is the lead plaintiff in a lawsuit challenging Georgia’s strict abortion law, said the situation is problematic.\n\n“Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe Georgia’s law requires life support in this case.\n\nBut she said whether a state could insist Smith remains on the breathing and other devices is uncertain since the 2022 ruling in Dobbs v. Jackson Women’s Health Organization, which overturned all the parts of the Roe ruling, including the finding that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nA spotlight on Georgia’s abortion law\n\nGeorgia’s law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but said the law is “an appropriate check” because the mother is pregnant.\n\n“I think there’s a valuable human life that we have an opportunity to save and I think it’s the right thing to save it,” he said. “To suggest otherwise is to declare the child as being other than human.”\n\nSetzler said the woman’s relatives do have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nAbortion bans in other states\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on maintenance measures for about two months because she was pregnant. A judge eventually ruled that the hospital keeping her alive against her family’s wishes was misapplying state law, and life support was removed.\n\nTwelve states are enforcing abortion bans at all stages of pregnancy, with limited exceptions. Georgia is one of four with a ban that kicks in at or around six weeks into pregnancy — often before women realize they’re pregnant.\n\nLast year, the Texas Supreme Court ruled unanimously against a group of women who challenged that state’s abortion ban, saying the exceptions were being interpreted so narrowly that they were denied abortion access as they dealt with serious pregnancy complications. This year, the state Senate has passed a bill that seeks to clarify when abortions are allowed.\n\nSouth Dakota produced a video to inform doctors about when exceptions should apply. Abortion rights groups have blasted it.\n\nThe U.S. Supreme Court heard arguments in December over whether the federal law that requires hospitals to provide abortion in emergency medical situations should apply. A ruling is expected in coming months.\n\nMulvihill reported from Cherry Hill, New Jersey. Associated Press journalists Kate Brumback, Sharon Johnson and Charlotte Kramon contributed.","summary":"The case is the latest consequence of abortion bans introduced in some states.","url":"https://www.twincities.com/2025/05/15/pregnant-woman-brain-death/","image":"https://www.twincities.com/wp-content/uploads/2025/05/Pregnant_Woman_Brain_Death_70423.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-15 18:48:32","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.414},{"id":321742688,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"By JEFF AMY and GEOFF MULVIHILL, Associated Press\n\nATLANTA (AP) — A pregnant woman in Georgia was declared brain-dead after a medical emergency and has been kept on life support for three months by doctors to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta’s Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was later declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNeither hospital immediately responded to emails Thursday from The Associated Press.\n\nGeorgia’s abortion ban\n\nSmith’s family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because of a provision in state law that bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after the U.S. Supreme Court overturned Roe v. Wade in 2022, opening the door to state abortion bans. Georgia’s ban includes an exception if an abortion is necessary to maintain the life of the woman.\n\nSmith’s family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk said doctors told the family that the fetus has fluid on the brain and that they’re concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. Newkirk has not commented on whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, which is the lead plaintiff in a lawsuit challenging Georgia’s strict abortion law, said the situation is problematic.\n\n“Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe Georgia’s law requires life support in this case.\n\nBut she said whether a state could insist Smith remains on the breathing and other devices is uncertain since the 2022 ruling in Dobbs v. Jackson Women’s Health Organization, which overturned all the parts of the Roe ruling, including the finding that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nA spotlight on Georgia’s abortion law\n\nGeorgia’s law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but said the law is “an appropriate check” because the mother is pregnant.\n\n“I think there’s a valuable human life that we have an opportunity to save and I think it’s the right thing to save it,” he said. “To suggest otherwise is to declare the child as being other than human.”\n\nSetzler said the woman’s relatives do have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nAbortion bans in other states\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on maintenance measures for about two months because she was pregnant. A judge eventually ruled that the hospital keeping her alive against her family’s wishes was misapplying state law, and life support was removed.\n\nTwelve states are enforcing abortion bans at all stages of pregnancy, with limited exceptions. Georgia is one of four with a ban that kicks in at or around six weeks into pregnancy — often before women realize they’re pregnant.\n\nLast year, the Texas Supreme Court ruled unanimously against a group of women who challenged that state’s abortion ban, saying the exceptions were being interpreted so narrowly that they were denied abortion access as they dealt with serious pregnancy complications. This year, the state Senate has passed a bill that seeks to clarify when abortions are allowed.\n\nSouth Dakota produced a video to inform doctors about when exceptions should apply. Abortion rights groups have blasted it.\n\nThe U.S. Supreme Court heard arguments in December over whether the federal law that requires hospitals to provide abortion in emergency medical situations should apply. A ruling is expected in coming months.\n\nMulvihill reported from Cherry Hill, New Jersey. Associated Press journalists Kate Brumback, Sharon Johnson and Charlotte Kramon contributed.","summary":"The case is the latest consequence of abortion bans introduced in some states.","url":"https://www.denverpost.com/2025/05/15/pregnant-woman-brain-death/","image":"https://www.denverpost.com/wp-content/uploads/2025/05/Pregnant_Woman_Brain_Death_70423.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-15 18:48:32","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.414},{"id":321736834,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"By JEFF AMY and GEOFF MULVIHILL, Associated Press\n\nATLANTA (AP) — A pregnant woman in Georgia was declared brain-dead after a medical emergency and has been kept on life support for three months by doctors to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta’s Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was later declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNeither hospital immediately responded to emails Thursday from The Associated Press.\n\nGeorgia’s abortion ban\n\nSmith’s family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because of a provision in state law that bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after the U.S. Supreme Court overturned Roe v. Wade in 2022, opening the door to state abortion bans. Georgia’s ban includes an exception if an abortion is necessary to maintain the life of the woman.\n\nSmith’s family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk said doctors told the family that the fetus has fluid on the brain and that they’re concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. Newkirk has not commented on whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, which is the lead plaintiff in a lawsuit challenging Georgia’s strict abortion law, said the situation is problematic.\n\n“Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe Georgia’s law requires life support in this case.\n\nBut she said whether a state could insist Smith remains on the breathing and other devices is uncertain since the 2022 ruling in Dobbs v. Jackson Women’s Health Organization, which overturned all the parts of the Roe ruling, including the finding that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nA spotlight on Georgia’s abortion law\n\nGeorgia’s law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but said the law is “an appropriate check” because the mother is pregnant.\n\n“I think there’s a valuable human life that we have an opportunity to save and I think it’s the right thing to save it,” he said. “To suggest otherwise is to declare the child as being other than human.”\n\nSetzler said the woman’s relatives do have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nAbortion bans in other states\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on maintenance measures for about two months because she was pregnant. A judge eventually ruled that the hospital keeping her alive against her family’s wishes was misapplying state law, and life support was removed.\n\nTwelve states are enforcing abortion bans at all stages of pregnancy, with limited exceptions. Georgia is one of four with a ban that kicks in at or around six weeks into pregnancy — often before women realize they’re pregnant.\n\nLast year, the Texas Supreme Court ruled unanimously against a group of women who challenged that state’s abortion ban, saying the exceptions were being interpreted so narrowly that they were denied abortion access as they dealt with serious pregnancy complications. This year, the state Senate has passed a bill that seeks to clarify when abortions are allowed.\n\nSouth Dakota produced a video to inform doctors about when exceptions should apply. Abortion rights groups have blasted it.\n\nThe U.S. Supreme Court heard arguments in December over whether the federal law that requires hospitals to provide abortion in emergency medical situations should apply. A ruling is expected in coming months.\n\nMulvihill reported from Cherry Hill, New Jersey. Associated Press journalists Kate Brumback, Sharon Johnson and Charlotte Kramon contributed.","summary":"The case is the latest consequence of abortion bans introduced in some states.","url":"https://www.ocregister.com/2025/05/15/pregnant-woman-brain-death/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/Pregnant_Woman_Brain_Death_70423.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-15 18:48:32","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.414},{"id":321732042,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"By JEFF AMY and GEOFF MULVIHILL, Associated Press\n\nATLANTA (AP) — A pregnant woman in Georgia was declared brain-dead after a medical emergency and has been kept on life support for three months by doctors to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta’s Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was later declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNeither hospital immediately responded to emails Thursday from The Associated Press.\n\nGeorgia’s abortion ban\n\nSmith’s family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because of a provision in state law that bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after the U.S. Supreme Court overturned Roe v. Wade in 2022, opening the door to state abortion bans. Georgia’s ban includes an exception if an abortion is necessary to maintain the life of the woman.\n\nSmith’s family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk said doctors told the family that the fetus has fluid on the brain and that they’re concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. Newkirk has not commented on whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, which is the lead plaintiff in a lawsuit challenging Georgia’s strict abortion law, said the situation is problematic.\n\n“Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe Georgia’s law requires life support in this case.\n\nBut she said whether a state could insist Smith remains on the breathing and other devices is uncertain since the 2022 ruling in Dobbs v. Jackson Women’s Health Organization, which overturned all the parts of the Roe ruling, including the finding that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nA spotlight on Georgia’s abortion law\n\nGeorgia’s law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but said the law is “an appropriate check” because the mother is pregnant.\n\n“I think there’s a valuable human life that we have an opportunity to save and I think it’s the right thing to save it,” he said. “To suggest otherwise is to declare the child as being other than human.”\n\nSetzler said the woman’s relatives do have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. The stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nAbortion bans in other states\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on maintenance measures for about two months because she was pregnant. A judge eventually ruled that the hospital keeping her alive against her family’s wishes was misapplying state law, and life support was removed.\n\nTwelve states are enforcing abortion bans at all stages of pregnancy, with limited exceptions. Georgia is one of four with a ban that kicks in at or around six weeks into pregnancy — often before women realize they’re pregnant.\n\nLast year, the Texas Supreme Court ruled unanimously against a group of women who challenged that state’s abortion ban, saying the exceptions were being interpreted so narrowly that they were denied abortion access as they dealt with serious pregnancy complications. This year, the state Senate has passed a bill that seeks to clarify when abortions are allowed.\n\nSouth Dakota produced a video to inform doctors about when exceptions should apply. Abortion rights groups have blasted it.\n\nThe U.S. Supreme Court heard arguments in December over whether the federal law that requires hospitals to provide abortion in emergency medical situations should apply. A ruling is expected in coming months.\n\nMulvihill reported from Cherry Hill, New Jersey. Associated Press journalists Kate Brumback, Sharon Johnson and Charlotte Kramon contributed.","summary":"The case is the latest consequence of abortion bans introduced in some states.","url":"https://www.bostonherald.com/2025/05/15/pregnant-woman-brain-death/","image":"https://www.bostonherald.com/wp-content/uploads/2025/05/Pregnant_Woman_Brain_Death_70423.jpg?w=1024&h=682","video":null,"publish_date":"2025-05-15 18:48:32","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.414},{"id":321743982,"title":"Tiffany Trump Gives Birth, Welcomes First Baby With Michael Boulos","text":"Tiffany Trump just took on a new title: mom.\n\nPresident Donald Trump’s youngest daughter—whom he shares with second wife Marla Maples—welcomed a baby boy with husband Michael Boulos, she confirmed May 15.\n\n\"Welcome to the world our sweet baby boy, Alexander Trump Boulos,\" We love you beyond words! Thank you for coming into our lives! 5.15.2025.\"\n\nAlongside the annoucement of Alexander's birth, Tiffany, 31, shared a black and white picture with her baby boy's foot in her hand as he laid in a hospital bassinet lined with a heart blanket. \n\nThe 47th president first confirmed Tiffany and Michael were expecting their first baby back in October while on the campaign trail—one month before he defeated then-Vice President Kamala Harris—at an event where Tiffany’s father-in-law Massad Boulos was in attendance.","summary":"Tiffany Trump just took on a new title: mom.\nPresident Donald Trump’s youngest daughter—whom he shares with second wife Marla Maples—welcomed a baby boy with husband Michael Boulos, she confirmed...","url":"https://www.eonline.com/news/1415303/tiffany-trump-donald-trumps-daughter-welcomes-first-baby?cmpid=rss-syndicate-genericrss-us-top_stories","image":"https://akns-images.eonline.com/eol_images/Entire_Site/2021019/rs_1200x1200-210119093240-1200-Tiffany-Trump-Michael-Engaged.jpg?fit=around%7C1200:1200&output-quality=90&crop=1200:1200;center,top","video":null,"publish_date":"2025-05-15 17:58:00","author":"Scott Olson","authors":["Scott Olson"],"language":"en","source_country":"US","sentiment":0.549},{"id":321731586,"title":"Hospital tells family brain-dead Georgia woman must carry fetus to birth because of abortion ban","text":"A pregnant woman in Georgia was declared brain-dead after a medical emergency and has been kept on life support for three months by doctors to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say.\n\nThe case is the latest consequence of abortion bans introduced in some states since the Supreme Court overturned Roe v. Wade three years ago.\n\nAdriana Smith, a 30-year-old mother and nurse, was declared brain-dead — meaning she is legally dead — in February, her mother, April Newkirk, told Atlanta TV station WXIA.\n\nNewkirk said her daughter had intense headaches more than three months ago and went to Atlanta’s Northside Hospital, where she received medication and was released. The next morning, her boyfriend woke to her gasping for air and called 911. Emory University Hospital determined she had blood clots in her brain and she was later declared brain-dead.\n\nNewkirk said Smith is now 21 weeks pregnant. Removing breathing tubes and other life-saving devices would likely kill the fetus.\n\nNeither hospital immediately responded to emails Thursday from The Associated Press.\n\nSmith’s family says Emory doctors have told them they are not allowed to stop or remove the devices that are keeping her breathing because of a provision in state law that bans abortion after cardiac activity can be detected — generally around six weeks into pregnancy.\n\nThe law was adopted in 2019 but not enforced until after the U.S. Supreme Court overturned Roe v. Wade in 2022, opening the door to state abortion bans. Georgia’s ban includes an exception if an abortion is necessary to maintain the life of the woman.\n\nSmith’s family, including her five-year-old son, still visit her in the hospital.\n\nNewkirk said doctors told the family that the fetus has fluid on the brain and that they’re concerned about his health.\n\n“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. Newkirk has not commented on whether the family wants Smith removed from life support.\n\nWho has the right to make these decisions?\n\nMonica Simpson, executive director of SisterSong, which is the lead plaintiff in a lawsuit challenging Georgia’s strict abortion law, said the situation is problematic.\n\n“Her family deserved the right to have decision-making power about her medical decisions,” Simpson said in a statement. “Instead, they have endured over 90 days of retraumatization, expensive medical costs, and the cruelty of being unable to resolve and move toward healing.”\n\nLois Shepherd, a bioethicist and law professor at the University of Virginia, said she does not believe Georgia’s law requires life support in this case.\n\nBut she said whether a state could insist Smith remains on the breathing and other devices is uncertain since the 2022 ruling in Dobbs v. Jackson Women’s Health Organization, which overturned all the parts of the Roe ruling, including the finding that fetuses do not have the rights of people.\n\n“Pre-Dobbs, a fetus didn’t have any rights,” Shepherd said. “And the state’s interest in fetal life could not be so strong as to overcome other important rights, but now we don’t know.”\n\nA spotlight on Georgia’s abortion law\n\nGeorgia’s law confers personhood on a fetus. Those who favor personhood say fertilized eggs, embryos and fetuses should be considered people with the same rights as those already born.\n\nGeorgia state Sen. Ed Setzler, a Republican who sponsored the 2019 law, said he supported Emory’s interpretation.\n\n“I think it is completely appropriate that the hospital do what they can to save the life of the child,” Setzler said. “I think this is an unusual circumstance, but I think it highlights the value of innocent human life. I think the hospital is acting appropriately.”\n\nSetzler said he believes it is sometimes acceptable to remove life support from someone who is brain dead, but said the law is “an appropriate check” because the mother is pregnant.\n\n“I think there’s a valuable human life that we have an opportunity to save and I think it’s the right thing to save it,” he said. “To suggest otherwise is to declare the child as being other than human.”\n\nSetzler said the woman’s relatives do have “good choices,” including keeping the child or offering it for adoption.\n\nGeorgia’s abortion ban has been in the spotlight before.\n\nLast year, ProPublica reported that two Georgia women died after they did not get proper medical treatment for complications from taking abortion pills. \n\nThe stories of Amber Thurman and Candi Miller entered into the presidential race, with Democrat Kamala Harris saying the deaths were the result of the abortion bans that went into effect in Georgia and elsewhere after Dobbs.\n\nAbortion bans in other states\n\nThe situation echoes a case in Texas more than a decade ago when a brain-dead woman was kept on maintenance measures for about two months because she was pregnant. A judge eventually ruled that the hospital keeping her alive against her family’s wishes was misapplying state law, and life support was removed.\n\nTwelve states are enforcing abortion bans at all stages of pregnancy, with limited exceptions. Georgia is one of four with a ban that kicks in at or around six weeks into pregnancy — often before women realize they’re pregnant.\n\nLast year, the Texas Supreme Court ruled unanimously against a group of women who challenged that state’s abortion ban, saying the exceptions were being interpreted so narrowly that they were denied abortion access as they dealt with serious pregnancy complications. \n\nThis year, the state Senate has passed a bill that seeks to clarify when abortions are allowed.\n\nSouth Dakota produced a video to inform doctors about when exceptions should apply. Abortion rights groups have blasted it.\n\nThe U.S. Supreme Court heard arguments in December over whether the federal law that requires hospitals to provide abortion in emergency medical situations should apply. A ruling is expected in coming months.\n\nMulvihill reported from Cherry Hill, New Jersey. Associated Press journalists Kate Brumback, Sharon Johnson and Charlotte Kramon contributed.","summary":"A pregnant woman in Georgia was declared brain-dead after a medical emergency and has been kept on life support for three months by doctors to allow enough time for the baby to be born and comply with Georgia’s strict anti-abortion law, family members say. The case is the latest consequence of abortion bans introduced in [&#8230;]","url":"https://toronto.citynews.ca/2025/05/15/hospital-tells-family-brain-dead-georgia-woman-must-carry-fetus-to-birth-because-of-abortion-ban/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/05/2d76966ea68e61b3d8298f2b85adb9e69d120d9193096f6f9cea49bfd216f515.jpg","video":null,"publish_date":"2025-05-15 17:49:56","author":"Jeff Amy And,News Staff","authors":["Jeff Amy And","News Staff"],"language":"en","source_country":"ca","sentiment":-0.403},{"id":321716482,"title":"2028 primaries: Vance dominates, Harris, Buttigieg fading","text":"Just after the election of President Donald Trump, Vance’s lead over Trump Jr. was 25% to 21% in the survey from one of the president’s top pollsters.\n\nOn the Democratic side, name recognition has kept former Vice President Kamala Harris, who lost to Trump last year, in front. But at 30%, she has lost ground from the 35% she held in December and 36% in February.\n\nThe two candidates showing some life among the 17 other possible Democratic presidential candidates named in the poll are Rep. Alexandria Ocasio-Cortez (D-NY) and California Gov. Gavin Newsom, tied at 8% and in second place.\n\nFormer Biden-era Transportation Secretary Pete Buttigieg, who this week began testing the political waters for a 2028 run, is in fifth place, dropping from 10% in March to 6% last month. Sen. Cory Booker (D-NJ), who ranted against Trump recently in an overnight Senate filibuster, is fourth at 7%.\n\nPollster John McLaughlin said it is too early to declare anyone a front-runner, saying that the parties need to get through next year’s congressional midterm elections before the field becomes clearer.\n\nBut the past history of presidential elections and candidate testing of messages is clear: Once a sitting president becomes a lame duck, as Trump is, the jockeying begins. As an example, the edition of U.S. News and World Report that followed former President Bill Clinton’s reelection in 1996 featured then-Texas Gov. George W. Bush, who went on to win the 2000 GOP primary and the White House.\n\nThe positive buzz on Vance has been high ever since he scolded world leaders in a controversial speech in Munich three months ago.\n\nSEE THE LATEST POLITICAL NEWS AND BUZZ FROM WASHINGTON SECRETS\n\nAnd this week, Washington Examiner chief political correspondent Byron York quoted Sen. Jim Banks (R-IN) declaring Vance the 2028 nominee. “JD Vance will be the nominee in 2028 — mark my words,” said Banks.\n\nIn the new survey, Vance is first, Trump Jr. second, and Florida Gov. Ron DeSantis third, at 6%. Fellow Trump White House insider Rubio is at 2%.","summary":"Vice President JD Vance looks like a good early bet to dominate the 2028 Republican presidential primaries, pulling away from two friends and possible challengers, Donald Trump Jr. and Secretary of State Marco Rubio. In the latest McLaughlin and Associates survey shared with Secrets, Vance has jumped out to a big lead over Trump Jr., [&#8230;]","url":"https://www.washingtonexaminer.com/news/washington-secrets/3412235/2028-election-primaries-poll-jd-vance/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/Trump-Vance-2028-scaled-1024x683.webp","video":null,"publish_date":"2025-05-15 17:47:01","author":"Paul Bedard","authors":["Paul Bedard"],"language":"en","source_country":"US","sentiment":-0.149},{"id":321710086,"title":"Newsom should’ve paid more attention when Brown was governor","text":"For eight years Gov. Jerry Brown showed his lieutenant governor, Gavin Newsom, how to balance a California budget every year, but Newsom didn’t listen. Now Newson’s May Revision for his budget for fiscal year 2025-26, which begins on July 1, starts with a $12 billion “budget problem,” Sacramento parlance for a deficit.\n\nNewsom is blaming President Trump’s tariffs for tanking state revenues by $16 billion. Then he ought to credit Trump’s coming tax cuts with boosting the overall economy, including state revenues. If the tax cuts include restoring the full SALT (state and local tax) deduction, billionaires will return and their state taxes will goose the budget.\n\nBrown also faced turmoil, including the 2008-10 Great Recession, which included real estate prices crashing up to 70% inland and 33% on the coast. Then followed the first two years of Trump’s first term, which included new tariffs.\n\nThe real problem is Newsom is spending far more than Brown did based on per capita income. The data are in Newsom’s initial, longer, Jan. 10 budget proposal. The key is the percentage of personal income going to support the state general fund, listed on Schedule 6, Appendix 12. The number is crucial because each Californian can only work so many hours to support the state government.\n\nWhile perusing the data two decades ago for a column in this paper, I noticed whenever that figure rose above 6.2%, the state went into deficit. Big spending cuts then were enacted by necessity. Unfortunately tax increases also were imposed. \n\nDuring Brown’s eight years in the governor’s chair, the percentage of personal income going to the general fund averaged 5.4%, well below the 6.2% threshold. His highest was 5.8% in 2014-15. “I don’t like to spend money,” Brown once said. “But that’s not because I’m conservative – it’s just because I’m cheap.”\n\nNewsom started out well, 5.6% in 2019-20 and 5.9% in 2020-21. Then in 2021-22, with all the federal COVID money flowing in, the ratio soared to 7.2%. It stayed at 6.5% or higher the next three years. And for 2025-26, it’s projected to be 6.5%. Average for seven years: 6.4%. No wonder there’s a budget problem.\n\nAnother figure from Schedule 6 also tells the story: the number of state employees per 1,000 Californians. Under Brown, it averaged 9.3. In Newsom’s first year, 2019-20, it was just 9.6. Soon it soared to 10.9 in 2022-23 and 2023-24; then to 11.1 in 2024-25 and for the 2025-26 projection. The 11.1 number is 19% higher than Brown’s 9.3 average. \n\nAnd budget expert David Crane wrote this on X of the May Revision, “Newsom proposes spending $45 billion on 255,000 state positions, or $177k per position, 18% more than the current year.” And $177,000 is almost double the state’s $95,521 median income.\n\nCall me cynical, but the union bosses, all those new government workers and all the old ones with huge raises on March 2028 are going to remember who goosed their pay. That’s the date of the California presidential primary that could feature Newsom vs. another Golden Stater, Kamala Harris.\n\nWithout Silicon Valley, whose artificial intelligence boom is its latest wizardry, the state economy would be in deep depression. Last December the ADP management company released a study showing one in 48 Valley workers makes $500,000 or more a year. That almost doubled the next highest, Austin, Tex. From the Valley the taxes just roll in.\n\nAfter this budget cycle ends in a month, Newsom will have one more budget before he leaves office. If he gets through it reasonably unscathed, as seems likely, California budgets will be low on the radar of issues voters care about anywhere, including here. \n\nAnd despite his frugality, Jerry Brown failed in three presidential attempts. Perhaps Newsom’s way is better – for him, anyway.\n\nJohn Seiler is on the SCNG Editorial Board","summary":"For eight years Gov. Jerry Brown showed his lieutenant governor, Gavin Newsom, how to balance a California budget every year, but Newsom didn’t listen.","url":"https://www.ocregister.com/2025/05/15/newsom-shouldve-paid-more-attention-when-brown-was-governor/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/AP_245191918403.jpg?w=1024&h=718","video":null,"publish_date":"2025-05-15 17:39:42","author":"John Seiler","authors":["John Seiler"],"language":"en","category":"politics","source_country":"us","sentiment":-0.084},{"id":321739052,"title":"Gig economy titans Uber, DoorDash back Trump’s ‘Big Beautiful Bill’ in Capitol Hill push","text":"The leaders of two of America’s largest gig-economy companies refreshed their support for key provisions in President Donald Trump’s \"Big Beautiful [Budget] Bill\" currently matriculating through the House of Representatives. Uber CEO Dara Khosrowshahi tweeted his support for the \"No Tax on Tips\" section on Wednesday, after the House Ways & Means Committee held a marathon, overnight hearing to approve the legislation — and disapprove of several Democratic amendments. Khosrowshahi praised Chairman Jason Smith, R-Mo., as well as Trump, saying Uber drivers and couriers should be included in those considerations. \"Thanks to POTUS and Rep. Jason Smith for backing all tipped workers no matter how they work,\" he said. LAS VEGAS RIDESHARE DRIVERS LAUD TRUMP&apos;S AWESOME NO TAX ON TIPS PLAN AS HARRIS HOLDS RALLY ACROSS TOWN \"Let’s get this done.\" Meanwhile, DoorDash co-founder Tony Xu shared a photo of several DoorDashers on the steps of the Capitol — saying that 40,000 of them and their colleagues advocated to lawmakers in one form or another to pass a \"tax break on their hard-earned tips.\" \"The House’s budget bill is an important step in making No Tax on Tips a reality,\" Xu said. NORQUIST: ALL THE REASONS TRUMP&apos;S TAX-FREE TIPS PLAN IS BRILLIANT By the end of the congressional all-nighter, at least one Democrat and one Republican lawmaker had fallen asleep at the dais, and the Big Beautiful Bill was passed 26-19 on a party-line vote. Trump first floated a No Tax on Tips idea, almost coincidentally with then-Vice President Kamala Harris, but the policy appeared to stick to the GOP nominee more than the Democrat. At the time, Las Vegas rideshare drivers notably told Fox News Digital they were overjoyed at the news, with at least one registered Democrat driving an Uber at the MGM Grand saying he would be crossing party lines to vote for Trump. CLICK HERE TO GET THE FOX NEWS APP \"[F]or those hotel workers and people that get tips, you&apos;re going to be very happy, because when I get to office, we are going to not charge taxes on tips,\" Trump said in June 2024. \"It&apos;s been a point of contention for years and years and years, and you do a great job of service, you take care of people and I think it&apos;s going to be something that really is deserved,\" he said at the time.","summary":"Uber and DoorDash executives came out in support of No Tax on Tips provisions in Donald Trump&apos;s Big Beautiful Bill.","url":"https://www.foxbusiness.com/politics/gig-economy-titans-uber-doordash-back-trumps-big-beautiful-bill-capitol-hill-push","image":"https://static.foxbusiness.com/foxbusiness.com/content/uploads/2025/05/uber-trump.png","video":null,"publish_date":"2025-05-15 17:33:36","author":"Charles Creitz","authors":["Charles Creitz"],"language":"en","source_country":"us","sentiment":-0.109},{"id":321735316,"title":"Bruce Springsteen rips into Trump’s ‘corrupt, treasonous administration’","text":"Maybe Donald Trump’s Department of Homeland Security will conjure up some reason to bar Bruce Springsteen from returning to the United States, after the rock ‘n’ roll legend kicked off his “Land of Hope & Dreams” tour in Manchester, England, Wednesday night with a series of rousing, blistering speeches aimed at the “unfit” current president and his “treasonous” administration.\n\nThe dystopian vision of Trump’s America, which Springsteen painted Wednesday night, certainly sounds like a place where even an internationally revered, New Jersey-born artist like himself could face dire consequences for speaking out. But the “Born in the USA” singer didn’t hold back. Accompanied by the E Street Band, he summoned the “righteous power of art, of music, of rock ‘n’ roll in dangerous times,” according to The Guardian and the Daily Beast. \n\nIntroducing the song that gives the tour its name, Springsteen said: “In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration.”\n\nThe multi-award-winning musician has been a vocal critic of both Trump administrations, while long supporting Democratic causes and candidates. He’s known to be a close friend of Barack Obama, with the two creating a podcast series together, “Renegades: Born in the USA,” The Guardian reported. Springsteen also campaigned for Joe Biden and Kamala Harris’s respective campaigns.\n\nLater in the show, he introduced the song, “My City of Ruins,” with a lengthy speech that raised alarm about the “very weird, strange and dangerous (expletive) going on out there right now.”\n\nIn America, Springsteen said, people are being “persecuted for using their right to free speech and dissent,” “the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death,” and its leaders are taking “sadistic pleasure in the pain they inflict on loyal American workers” while “rolling back historic civil rights legislation.”\n\nSpringsteen also said the Trump administration is “abandoning our great allies and siding with dictators,” defunding U.S. universities that “won’t bow down to their ideological demands,” and “removing residents off American streets and, without due process of law, are deporting them to foreign detention centers and prisons.”\n\nThe singer also appeared to castigate politicians on both ends of the ideological spectrum, by saying that the “majority of our elected representatives have failed to protect the American people from the abuses of an unfit president and a rogue government.”\n\nBut Springsteen ended this speech with a message of hope, unity and fortitude, saying, “the America I’ve sung to you about for 50 years is real and regardless of its faults is a great country with a great people. So we’ll survive this moment.”\n\nAs The Guardian said, such comments align with Springsteen’s lifetime of songwriting and performances, which praise American ideals but examine them against the reality of working-class life. He’s also known for delivering energetic concerts that can last for hours.\n\n“The Land of Hope and Dreams Tour” is a continuation of the tour that Springsteen and the E Street Band originally began in 2023 in Tampa, Florida. A number of dates on the 2023 leg were postponed to 2024, including two nights at San Francisco’s Chase Center, due to Springsteen recovering from a peptic ulcer and other band members dealing with health issues. The 2025 European leg of the tour, which kicked off in Manchester Wednesday, was re-titled “The Land of Hope and Dreams Tour.” It winds up in Milan in early July.","summary":"Springsteen summoned the 'righteous power of art, of music, of rock ‘n’ roll in dangerous times,' while launching 'Hope and Dreams' tour in the U.K.","url":"https://www.mercurynews.com/2025/05/15/bruce-springsteen-rips-into-trumps-corrupt-treasonous-administration/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/Springsteen.jpeg?w=1024&h=765","video":null,"publish_date":"2025-05-15 17:29:31","author":"Martha Ross","authors":["Martha Ross"],"language":"en","category":"politics","source_country":"us","sentiment":-0.089},{"id":321718206,"title":"Bruce Springsteen Opens Concert With Impassioned Speech on Trump’s “Corrupt, Incompetent, and Treasonous Administration”: Watch","text":"Yesterday (May 14), Bruce Springsteen & the E Street Band performed in Manchester, England, to start the final leg of a tour that they kicked off more than two years ago. To open the show, Springsteen gave an impassioned speech about President Donald J. Trump and his administration. “The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock’n’roll in dangerous times,” Springsteen said. “In my home, the America I love, the America I've written about, that has been a beacon of hope and liberty for 250 years is currently in the hands of a corrupt, incompetent, and treasonous administration. Tonight, we ask all who believe in democracy and the best of our American experiment to rise with us, raise your voices against authoritarianism, and let freedom ring!” He and the band then launched into Wrecking Ball’s “Land of Hope and Dreams.”\nLater, before playing The Rising’s “My City of Ruins,” Springsteen said, “There’s some very weird, strange, and dangerous shit going on out there right now. In America, they are persecuting people for using their right to free speech and voicing their dissent. This is happening now.” He concluded, “The America that I’ve sung to you about for 50 years is real, and, regardless of its faults, is a great country with a great people. So we’ll survive this moment. Now, I have hope, because I believe in the truth of what the great American writer James Baldwin said. He said, ‘In this world, there isn’t as much humanity as one would like, but there’s enough.’ Let’s pray.” Watch all of Springsteen’s remarks in the video below.\nSpringsteen has spoken out against Donald Trump for the better part of a decade. He also endorsed his opponent in the 2024 U.S. presidential election, Vice President Kamala Harris.\nSpringsteen recently rebranded the final leg of the tour as the Land of Hope and Dreams Tour. It will find him and the E Street Band performing in the United Kingdom and Europe in May, June, and July. The final show is set to take place on Thursday, July 3, in Milan, Italy. See the tour dates below.\nAhead of his tour with the E Street Band, which began in February 2023, Springsteen released Only the Strong Survive. Soon, he’ll share a ton of previously unreleased music in the new collection Tracks II: The Lost Albums.\nBruce Springsteen & the E Street Band:\n05-17 Manchester, England - Co-op Live\n05-20 Manchester, England - Co-op Live\n05-24 Lille, France - Stade Pierre Mauroy\n05-27 Lille, France - Stade Pierre Mauroy\n05-31 Marseille, France - Orange Vélodrome\n06-04 Liverpool, England - Anfield\n06-07 Liverpool, England - Anfield\n06-11 Berlin, Germany – Olympiastadion\n06-15 Prague, Czech Republic - Airport Letnany\n06-18 Frankfurt, Germany - Deutsche Bank Park\n06-21 San Sebastián, Spain - Estadio Reale Arena\n06-24 San Sebastián, Spain - Estadio Reale Arena\n06-27 Gelsenkirchen, Germany - Veltins Arena\n06-30 Milan, Italy - San Siro Stadium\n07-03 Milan, Italy - San Siro Stadium","summary":"Springsteen also criticized the Trump administration for “persecuting people for using their right to free speech and voicing their dissent”","url":"https://pitchfork.com/news/bruce-springsteen-opens-concert-with-impassioned-speech-on-trump-corrupt-incompetent-and-treasonous-administration-watch/","image":"https://media.pitchfork.com/photos/68261c5e9c6ded4d8f3fd55c/16:9/w_4000,h_2250,c_limit/Bruce-Springsteen.jpeg","video":null,"publish_date":"2025-05-15 17:25:25","author":"Matthew Strauss","authors":["Matthew Strauss"],"language":"en","category":"politics","source_country":"us","sentiment":0.317},{"id":321714300,"title":"Gavin Newsom's 2028 Hopes Dim According to New Poll","text":"California Governor Gavin Newsom's 2028 White House took a hit this week.A new poll, conducted by co/efficient between May 7 and May 9 among 1,462 likely voters, found that just 2 percent of voters see Newsom as the face of the Democratic Party. The poll had a margin of error of plus or minus 3.3 percentage points.Newsweek has contacted Newsom's office for comment via email.Why It MattersNewsom has not said whether he plans to run for the White House, but has long been rumored to be considering a 2028 bid. But Newsom's ability to position himself as a unifying or compelling figure for the post-Trump era could be called into question.Following election losses across the board in 2024, the Democratic Party has gone through infighting and struggled to unify around a clear successor at the top leading for some calls to rally behind a new generation of leadership.What To KnowAccording to the survey, New York Representative Alexandria Ocasio-Cortez tops the list as the face of the Democratic Party, with 26 percent choosing the progressive firebrand. That result is tied with the 26 percent who said \"no one\" holds the title as the party's face.Ocasio-Cortez has not formally announced a presidential bid for 2028, however a number of recent moves and statements have raised eyebrows on what she has in store for her future.The New York progressive has been actively engaging in national politics, notably through her \"Fighting Oligarchy\" tour alongside Independent Senator Bernie Sanders, drawing significant attention and large crowds. She also released a campaign-style video featuring the slogan \"We are one,\" further fueling speculation about her future ambitions.When questioned about a potential 2028 presidential run, Ocasio-Cortez did not provide a definitive answer. Instead, she emphasized her current focus on pressing issues such as protecting Medicaid and safeguarding civil liberties, stating, \"This moment isn't about campaigns or elections or about politics. It's about making sure people are protected,\" she told Fox News.Meanwhile, pollster Nate Silver, who publishes the online newsletter The Silver Bulletin, recently identified Ocasio-Cortez as the most likely Democratic candidate to lead the party's 2028 presidential ticket, citing her broad appeal and strong support within the party.Ocasio-Cortez was followed by Sanders who came in a distant second with 12 percent, while former Vice President Kamala Harris, the 2024 White House candidate once considered a leading Democratic voice, garnered just 6 percent. Other high-profile figures like, former Transportation Secretary Pete Buttigieg (5 percent), and House Minority Leader Hakeem Jeffries (5 percent) failed to crack double digits, reflecting a fractured political landscape in which no single figure commands widespread recognition or loyalty.Additionally, 22 percent of respondents chose \"Other,\" further emphasizing the absence of a unifying figure capable of rallying the party's diverse coalition.In such an uncertain political climate, Newsom has attempted to increase his public visibility, launching a podcast featuring conversations with conservative figures like Charlie Kirk and Steve Bannon, signaling an attempt to broaden his appeal beyond traditional Democratic bases. He also announced that he would sue the Trump administration over the so-called \"Liberation Day\" tariffs, which ignited stock market volatility.In a recent interview, Newsom expressed ambivalence about a presidential bid, telling the Los Angeles Times: \"I have to have a burning why, and I have to have a compelling vision that distinguishes myself from anybody else. Without that, without both...I don't deserve to even be in the conversation.\"Other polls have also shown little appetite for a 2028 bid from Newsom.An Emerson College Polling/Inside California Politics/The Hill survey, conducted between April 12 and April 14, 2025, among 1,000 California registered voters, found that 59 percent of respondents said they don't think that Newsom should run for president in 2028, with 41 percent supporting a bid for the Oval Office.In November, Newsom had +550 odds of becoming the next president, according to SportsBettingDime, which amounts to a 15 percent chance.What People Are SayingDemocratic Representative Jimmy Gomez of California to Spectrum News in April: \"He's doing what I think is in the interest of Gavin Newsom and not necessarily in the entire party. We have to organize in our districts and then go to the districts in the areas of the country that we need to win over; that means door to door, text message, phone calls and have those conversations. I just don't think his strategy is necessarily about changing public perception. It's about honestly helping position Gavin to run.\"What Happens NextNewsom is term limited as governor and will leave office after the 2026 statewide election. There has been speculation that Harris—a former U.S. Senator and state Attorney General from California—could potentially run for the governor's mansion if she skips a second run for the White House.The Democratic Primary to challenge for the White House in 2028 is likely to be a crowded field. In 2020, the last time Democrats had an open primary, more than a dozen Democrats launched White House bids.","summary":"Newsom has not said whether he plans to run for president in 2028, but has long been rumored to be considering a bid.","url":"https://www.newsweek.com/gavin-newsom-2028-election-odds-poll-2072809","image":"https://d.newsweek.com/en/full/2645418/gavin-newsom.jpg","video":null,"publish_date":"2025-05-15 17:09:08","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","source_country":"us","sentiment":0.172},{"id":321712412,"title":"Rock legend slams Trump in scathing on-stage comments","text":"Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader \"unfit\" for office.\n\n\"The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock n' roll in dangerous times,\" Springsteen said at the beginning of a concert in Manchester, northern England, on Wednesday (Thursday AEST).\n\n\"In my home, the America I love — the America I've written about that has been a beacon of hope and liberty for 250 years — is currently in the hands of a corrupt, incompetent and treasonous administration,\" he said.\n\nREAD MORE: Trump to miss Ukraine-Russia peace talks, says White House\n\n\"Tonight, we ask all who believe in democracy and the best of our American spirit to rise with us, raise your voices against authoritarianism,\" added Springsteen.\n\nThe rock star spoke out several times during the show, later posting clips of his comments to his Instagram account.\n\n\"The last check on power, after the checks and balances of government have failed, are the people — you and me. It's in the union of people around a common set of values. Now that's all that stands between democracy and authoritarianism. So at the end of the day, all we've really got is each other,\" he continued.\n\nHe later criticised some of the US administration's most recent policies.\n\n\"In America, the richest men are taking satisfaction in abandoning the world's poorest children to sickness and death. This is happening now,\" he said.\n\n\"In my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they're rolling back historic civil rights legislation that led to a more just and plural society,\" he said.\n\n\"They're abandoning our great allies and siding with dictators against those struggling for their freedom. They're defunding American universities that won't bow down to their ideological demands. They're removing residents off American streets, and without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now,\" added Springsteen.\n\nThe singer also criticised US lawmakers for failing to protect the American people from what he called \"an unfit president and a rogue government,\" and having \"no concern or idea of what it means to be deeply American\".\n\n\"The America that I've sung to you about for 50 years is real and, regardless of its faults, is a great country with a great people, so will survive this moment,\" said Springsteen.\n\nThe Manchester show was the first on the European leg of Springsteen and the E Street Band's Land of Hope and Dreams tour, which will also take in dates in France, Germany, Spain, Italy and the Czech Republic.\n\nSpringsteen previously criticised Trump and urged Americans to vote for Kamala Harris at a campaign rally for the Democratic candidate last year.\n\nHis criticism of Trump comes after Hollywood star Robert De Niro took aim at the US president at the Cannes Film Festival on Tuesday.\n\n\"In my country, we are fighting like hell for the democracy we once took for granted,\" said De Niro.\n\n\"That affects all of us here, because the arts are democratic, art is inclusive and brings people together, like tonight. Art looks for truth. Art embraces diversity, and that's why art is a threat,\" added De Niro, who is an outspoken critic of the US president.\n\n\"That's why we are a threat to autocrats and fascists,\" he added.\n\nDe Niro ended his speech with a call for people to stand up to Trump \"without violence, but with great passion and determination.\"\n\n\"It's time for everyone who cares about liberty to organise, to protest and when there are elections, of course, to vote. Vote,\" the actor added.\n\nDOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.","summary":"Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader &quot;unfit&quot; for office.","url":"https://www.9news.com.au/world/bruce-springsteen-scathing-remarks-donald-trump-administration-on-stage-uk-concert/b32fb3c5-ae6d-494e-9b82-821a1605c702","image":"https://imageresizer.static9.net.au/6kAM6SDUNDrom4mgLOc4T4AmyOQ=/0x0:2844x1600/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F3aa6df05-771d-4e49-8a07-139f68659013","video":null,"publish_date":"2025-05-15 17:04:29","author":"9News","authors":["9News"],"language":"en","category":"politics","source_country":"AU","sentiment":0.163},{"id":321710596,"title":"‘The View’ Co-Hosts Try To Wrap Their Heads Around Why Trump Beat Hillary, Kamala Harris","text":"Instead of sucking up to the political and corporate powers that dominate America, The Daily Caller is fighting for you — our readers. We humbly ask you to consider joining us in this fight.\n\nNow that millions of readers are rejecting the increasingly biased and even corrupt corporate media and \n joining us daily, there are powerful forces lined up to stop us: the old guard of the news media hopes \n to marginalize us; the big corporate ad agencies want to deprive us of revenue and put us out of business; \n senators threaten to have our reporters arrested for asking simple questions; the big tech platforms want \n to limit our ability to communicate with you; and the political party establishments feel threatened by our \n independence.\n\nWe don't complain -- we can't stand complainers -- but we do call it how we see it. We have a fight on our \n hands, and it's intense. We need your help to smash through the big tech, big media and big government blockade.\n\nWe're the insurgent outsiders for a reason: our deep-dive investigations hold the powerful to account. \n Our original videos undermine their narratives on a daily basis. Even our insistence on having fun infuriates \n them -- because we won’t bend the knee to political correctness.\n\nOne reason we stand apart is because we are not afraid to say we love America. We love her with every fiber of \n our being, and we think she's worth saving from today’s craziness.\n\nHelp us save her.\n\nA second reason we stand out is the sheer number of honest responsible reporters we have helped train. We have \n trained so many solid reporters that they now hold prominent positions at publications across the political \n spectrum. Hear a rare reasonable voice at a place like CNN? There’s a good chance they were trained at Daily \n Caller. Same goes for the numerous Daily Caller alumni dominating the news coverage at outlets such as Fox News, \n Newsmax, Daily Wire and many others.\n\nSimply put, America needs solid reporters fighting to tell the truth or we will never have honest elections or a \n fair system. We are working tirelessly to make that happen and we are making a difference.\n\nSince 2010, The Daily Caller has grown immensely. We're in the halls of Congress. We're in the Oval Office. \n And we're in up to 20 million homes every single month. That's 20 million Americans like you who are impossible \n to ignore.\n\nWe can overcome the forces lined up against all of us. This is an important mission but we can’t do it unless you — \n the everyday Americans forgotten by the establishment — have our back.\n\nPlease consider becoming a Daily Caller Patriot today, and help us keep doing work that holds politicians, \n corporations and other leaders accountable. Help us thumb our noses at political correctness. Help us train a new \n generation of news reporters who will actually tell the truth. And help us remind Americans everywhere that there \n are millions of us who remain clear-eyed about our country's greatness.\n\nIn return for membership, Daily Caller Patriots will be able to read The Daily Caller without any of the ads that \n we have long used to support our mission. We know the ads drive you crazy. They drive us crazy too. But we need \n revenue to keep the fight going. If you join us, we will cut out the ads for you and put every Lincoln-headed cent \n we earn into amplifying our voice, training even more solid reporters, and giving you the ad-free experience and \n lightning fast website you deserve.\n\nPatriots will also be eligible for Patriots Only content, newsletters, chats and live events with our reporters \n and editors. It's simple: welcome us into your lives, and we'll welcome you into ours.\n\nWe can save America together.\n\nBecome a Daily Caller Patriot today.","summary":"'This country is a misogynistic country'","url":"https://dailycaller.com/2025/05/15/the-view-trump-women-hillary-kamala-harris/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/05/Screenshot-2025-05-15-at-12.26.58 PM-e1747326469457.png","video":null,"publish_date":"2025-05-15 16:40:32","author":"Nicole Silverio","authors":["Nicole Silverio"],"language":"en","source_country":"US","sentiment":-0.054},{"id":321684072,"title":"Kamala Harris Would Beat Donald Trump if Election Held Again: Poll","text":"Kamala Harris might beat Donald Trump in the popular vote if the 2024 presidential election was held today, a new poll suggests.The Strength In Numbers/Verasight poll, conducted May 1 to 6, found 47 percent of respondents who would vote in a hypothetical do-over backed Democrat Harris, compared to 42 percent for Republican Trump.Including those who would not vote, Harris' share of the vote dropped to 40 percent against Trump's 36 percent.The poll was conducted among 1,000 adults and had a margin of error of 3.2 percent.Trump beat Harris by 2 points in the popular vote in November 2024's election, with 50 percent to her 48 percent. He won the electoral vote, which decides the winner, by a resounding 312 to 226.Several polls before the election had either a tie or Harris on top in the popular vote.In the hypothetical rematch, Harrisheld a significant advantage among those who say they did not vote in 2024.Among these, 36 percent of respondents backed Harris and 22 percent voting for Trump. Forty-three percent of non-voters surveyed said they still would not vote in 2024.Limiting to those who voted, Trump's support is lower than the real 2024 result at a 43-43 tie.Why It MattersDespite her loss in the 2024 presidential race, Harris is viewed as a top contender for the 2028 election, which will likely see a crowded field of Democrats vying for the party's nomination. Harris hasn't said for sure she plans to run, and she is also speculated to be considering a run for California's governorship in 2026.Proponents of a Harris 2028 run say she ran a good campaign despite difficult headwinds in 2024. They argue she significantly narrowed the gap compared to former President Joe Biden, who faced a flurry of bad polls after a televised debate against Trump that preceeded his withdrawal from the race.Others, however, argue that it's time for the party to embrace new leaders, and that her support for moderate Republicans, such as former Representative Liz Cheney, has cost the party among key voter groups.What to KnowTrump's approval ratings plummeted after he introduced his \"Liberation Day\" tariffs on April 2, accoding to most pollsters. The move sparked turmoil in stock and bond markets, with the Dow Jones Industrial Average recording its largest decline since June 2020 before rebounding days later.Since then several polls have shown that voters don't trust Trump on the economy. That includes the Strength In Numbers/Verasight poll which shows that Trump's net approval on the economy stands at -17 points, with 38 approving and 58 disapproving.Trump fares even worse on the issue of prices and inflation, with his net approval at -32 points, with 31 percent approving and 63 percent disapproving.Meanwhile, the poll shows that a majority of Americans (53 percent) believe the national economy has worsened over the past year, while just 25 percent think it has improved. Views on personal finances are slightly more stable, with 42 percent saying their situation is unchanged, 36 percent reporting it has worsened, and 19 percent feeling better off. When it comes to President Trump's economic policies, 56 percent say they've made the economy worse, compared to 22 percent who say they've helped. Another 15 percent see no impact, and 7 percent are unsure.But Trump is not just underwater on the economy. The Numbers/Verasight poll shows that he is underwater on all issues except border, mirroring the latest Fox News poll which showed the same result.That means that Trump's approval rating is also just underwater on the issue of immigration, previously his strongest issue, with 49 percent disapproving and 47 percent approving.It comes amid increased legal scrutiny and criticism of Trump's deportation policies, including the controversial removal of migrants to a notorious prison in El Salvador. One high-profile case involves Kilmar Abrego Garcia, who was deported from Maryland in what the DOJ called an \"administrative error.\" The Trump administration labeled Garcia a member of MS-13, now designated a terrorist group, but his family and lawyers deny any connection.And the Numbers/Verasight poll suggests that Garcia's case may be driving negative sentiment about Trump's handling of the economy.In a survey where half the participants were informed about the mistaken deportation of Kilmar Abrego Garcia, support for deporting all undocumented immigrants fell to 39 percent, with 43 percent opposed. When asked specifically about deporting individuals with court-ordered protections like Garcia, nearly half (49 percent) opposed it, while 29 percent supported it and 22 percent were unsure. In a related question, 45 percent of respondents said the U.S. should help wrongly deported immigrants return, compared to 35 percent who favored keeping them abroad.Such discontent with Trump's presidency could play into the hands of Harris, who continues to be a vocal critic of the president, if she decides to run for the White House again in 2028.Harris has not said if she is running, but polls suggest she is the front runner.Polling aggregation site Race to the WH currently shows Harris, who lost to Trump in 2024, leading the pack with a polling average of 27.2 percent. She is followed by Representative Alexandria Ocasio-Cortez in second at 15.9 percent, former Transport Secretary Pete Buttigieg in third at 12.8 percent, Senator Cory Booker is fourth at 8.6 percent and California Governor Gavin Newsom is fifth at 7.1 percent.However, some polls tell a different story. An April poll from Data for Progress found that while Harris is still favored among likely Democratic primary voters, a growing number are leaning toward other candidates such as Buttigieg, Ocasio-Cortez or Booker.Of those, 18 percent said they would vote for Harris in the primary. Fourteen percent said they would back Buttigieg and 12 percent would vote for each Ocasio-Cortez and Booker.Eight percent of respondents said they planned to vote for Newsom, while Pennsylvania Governor Josh Shapiro won support from 5 percent of respondents.Minnesota Governor Tim Walz, Michigan Governor Gretchen Whitmer and Illinois Governor J.B. Pritzker each received the backing of four percent of respondents.This was Harris' weakest showing among other polls of the 2028 primary.An Echelon Insights poll of 449 registered voters from April 10 to April 11, 2025, showed her with 28 percent support. A YouGov poll of 650 registered voters from March 30 to April 1, 2025, showed her with 25 percent. A SurveyUSA poll of 835 likely voters from February 13 to 16, 2025, showed her with 37 percent support.What People Are SayingSenator John Hickenlooper, the Democrat from Colorado, told The Hill: \"I think she will add value to\" the national conversation. \"What's going to happen over the next six to 18 months is going to be lots of Democrats having lots of different opinions about what our priorities should be. What are the values we have to put first?\"\"I think she will have a valuable perspective on that,\" he said.Senator Martin Heinrich, the Democrat from New Mexico, toldthe same newspaper: \"I'm a big fan of Kamala Harris, I enjoyed serving with her. I think given the time frame that we have, which is very different from what we were dealing with last time, that it's going to be an open process.\"What Happens NextThe next real presidential elections are scheduled for November 7, 2028.","summary":"Despite her loss in the 2024 presidential race, Harris is viewed by some as a top contender for the 2028 election.","url":"https://www.newsweek.com/kamala-harris-beat-donald-trump-election-held-today-poll-2072730","image":"https://d.newsweek.com/en/full/2645410/kamala-harris-donald-trump.jpg","video":null,"publish_date":"2025-05-15 15:52:52","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.356},{"id":321689162,"title":"Antisemitism Is Raging on College Campuses. President Trump Will Stop It.","text":"Today, in the United States of America, a Jewish student walking across his college green will be scared. Not because he is worried about finals or finding a job, but because the university he attends has empowered terrorists to attack him for who he is.\n\nThe hatred of Jews, antisemitism, is the most virulent form of discrimination. Often called “the oldest hatred,” it’s literally biblical. And under Joe Biden and Democrat rule, and in the aftermath of the largest slaughter of Jews since the Holocaust, antisemitism was greenlit on America’s college campuses.\n\nI understand it better than most. Being a conservative Jewish student at Harvard 35 years ago was not easy. The woke mind virus was alive and well even then. But what I never felt, unlike Jewish students and faculty today, was a fear for my safety. I never saw Muslim terror supporters, brandishing modern-day swastikas in the form of a terrorist scarf invented by Jew-killers, allowed to run roughshod over campus. I never saw masked thugs masquerading as students openly calling for a resumption of the Holocaust.\n\nToday, on too many campuses across this country, leftist administrators lie about these terrorist gatherings and claim pro-Hamas protests are peaceful and organic. They are neither. Rather, they are the American front of an organized worldwide Muslim terror program to target Jews and Western civilization. Then-President Joe Biden and Vice President Kamala Harris actively embraced this terror campaign calling for the extermination of Jews, trying to quietly settle antisemitism agreements with schools and shielding those schools from anything remotely resembling accountability.\n\nIt should come as no surprise that the same Democrats sanctioning antisemitism want to finance it as well by forgiving over $1.6 trillion in student debt and making college free. The Democrat strategy seems to be to force working-class Americans to bankroll the very institutions that churn out violent agitators and ideological foot soldiers for their radical causes.\n\nUnder the guiding hand of left-wing administrators and progressive professors, with a healthy dose of federal funding, America’s universities have become little more than taxpayer-funded academic terror training camps pushing antisemitism, moral cowardice, and anti-American philosophy.\n\nFor eight years in the Florida Legislature, I passed bill after bill to target this threat, and while no institution is perfect, our legislative successes showed that we could fight antisemitism at the state level. In the aftermath of the Oct. 7 terrorist attack, Florida institutions performed far better than their peers throughout the nation. Now, under the leadership of President Donald Trump, we take it national.\n\nLast Congress the Committee on Education and Workforce, of which I am the newest member, held landmark hearings with the leaders of the universities we were once so proud of, places like Harvard and Penn, on their embrace of Muslim terror and the terrorizing of Jews. With every hearing and roundtable, the committee documented the failures of school leaders to do what is legally (and morally) required of them: create a safe community for every student.\n\nWith Trump in the White House, we are fighting with renewed strength to build on Republican efforts to combat the disease of antisemitism. On Jan. 30, Trump signed an executive order to marshal federal tools to investigate and address antisemitism. His Justice Department is leading a multiagency task force to quell the antisemitic fury gripping our schools. The president made it clear that an attack on American Jews is an attack on America, and it will no longer be allowed.\n\nI am thrilled to be joining the Committee on Education and Workforce at the right time. Last week, university presidents testified about their failures to address antisemitism on campus. They proved themselves hostile to Jewish students, and that isn’t a mistake, it’s by design. Democrats have backed polices that make it easier for antisemitic terrorists to receive an education than American Jews.\n\nThe last administration chose to embrace Muslim terror at the expense of Jewish Americans. No longer. Under Trump, we will build on the immense progress of the last 100 days to fight for what is right and to make every campus and classroom safe for Jewish students and every American. \n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Today, in the United States of America, a Jewish student walking across his college green will be scared. Not because he is worried about finals... Read More\n\n\nThe post Antisemitism Is Raging on College Campuses. President Trump Will Stop It. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/05/15/antisemitism-is-raging-on-college-campuses-president-trump-will-stop-it/","image":"https://www.dailysignal.com/wp-content/uploads/2025/05/051525-anti-Israel-campus-protest-2024.jpg","video":null,"publish_date":"2025-05-15 15:38:23","author":"Randy Fine","authors":["Randy Fine"],"language":"en","category":"politics","source_country":"us","sentiment":0.086},{"id":321764054,"title":"The View’s Racists Decry White South Africans, Defend Their Racism","text":"ABC’s The View\nMay 15, 2025\n11:07:02 a.m. Eastern\n\nSUNNY HOSTIN: And I think something we're not talking about is – enough about is what Donald Trump did on Monday is the Trump administration allowed in 59 white South African refugees –\n\n[Audience groans]\n\n-into this country, claiming that they were fleeing racial discrimination and land appropriation.\n\nSo the South African president has been actively, you know, denying at and denying that persecution. He says, ‘a refugee is someone who has to leave their country out of fear of political persecution, religious persecution, or economic persecution, they don't fit that bill.’\n\nAnd so, the fact that Afghan refugees, people who helped us during the Afghanistan war, helped us and protected our troops, that program has been dismissed. The fact that Haitians that are truly refugees, they have been denied protective status!\n\nJOY BEHAR: So what do you think is the bottom line, Sunny?\n\nHOSTIN: Well – [Cuts herself off]\n\nALYSSA FARAH GRIFFIN: No, but for all the attacks at the Trump administration – at the time campaign made on the Biden administration over what I agree was a disastrous withdrawal from Afghanistan. We're once again betraying the Afghan people -\n\nHOSTIN: Yes, we are.\n\nFARAH GRIFFIN: - by saying if you're here under SIV and have a right as a refugee, you fought alongside us, we're sending you back to Hell, to daily beating, a lack of basic freedoms.\n\n[Crosstalk]\n\nHOSTIN: And yet, we are welcoming white South Afrikaners.\n\nBEHAR: They’re not white [inaudible] that’s the truth.\n\nFARAH GRIFFIN: Double betrayal!\n\nSARA HAINES: Picking beefs with allies. It tracks with everything else.\n\nHOSTIN: What was that, Joy?\n\nBEHAR: They're not white people. That's why they don't want them here. It’s obvious to me.\n\nHOSTIN: She said it, I didn't!\n\n11:16:33 a.m. Eastern\n\nHAINES: I'm Governor Wes Moore all the way.\n\nBEHAR: Wes Moore is very good idea.\n\nHAINES: And if you don't know who he is, you should learn because to me he's the most qualified amazing candidate I've seen in my lifetime! He will be president!\n\nBEHAR: So you agree with Crockett then?\n\nHAINES: He's black.\n\nBEHAR: That you can't have a woman.\n\nHOSTIN: You can’t have a woman.\n\nHAINES: Oh. But, no, but the thing is I don't look at people first by the woman, a black man, a gay person, a this, I look at the best candidate and then they happen to have all these other things they bring to it.\n\nHOSTIN: You may be a little different from most of the country.\n\nWHOOPI GOLDBERG: Yeah, for most.\n\nHAINES: I don’t know. I would say we got to stop telling the America public what they're ready for.\n\nFARAH GRIFFIN: We’ll elected a black man before.\n\nBEHAR: We lost twice when women ran! I mean –\n\nHAINES: Is there no distinguishing factors to each woman and why they might have lost? Is there no nuance?\n\nHOSTIN: Hillary Clinton was one of the most qualified candidates in presidential –\n\nHAINES: She carried a lot of Clinton baggage.\n\nFARAH GRIFFIN: She was polarizing.\n\nBEHAR: She lost to a failed game show host! Okay?!\n\nHOSTIN: Yes, she was more qualified.\n\nHAINES: I loved her. I voted for her, but the number one thing I heard about from people who didn't like her there was a mystery about the Clinton baggage they took. ‘I just don't trust her.’\n\nHOSTIN: They weaponize her husband against Hillary Clinton. And the bottom is this county is a misogynistic country and this country is a country that out of all the first world countries hasn't been able to elect a female president! That's just factual!\n\nFARAH GRIFFIN: Okay. Listen, sexism, racism, absolutely exist. It absolutely is a factor in elections. It is not the determinative factor in the 2024 election, and I disagreed strongly with President Biden when he basically blamed that on why Kamala Harris lost. She outperformed Joe Biden when he was in the race. The numbers went up. The fundraising went up. She had a short window to run and I think all the data that we have when you see why she lost the battleground states; it is not because a bunch of racist Democrats didn't turn out for her. That’s not why.\n\n[Crosstalk]\n\nWHOOPI GOLDBERG: I just want to point something out. You know, it's very important that when we're talking that you all understand why we talk from a color place because that's how we're judged. That's how we're seen.\n\nHOSITN: Yeah.\n\nGOLDBERG: And so it's very important for people to understand that.\n\nAnd, listen, you're all smart people. You're all smart people. Know, you can't -- you cannot ask people to run and I they're running because they want to make sure gay and straight people have the same rights, that women have the same rights as a man in this country. These can't be weaponized as wokism. These -- you can't say, you know, well, you -- not you, but you can't say, ‘oh, you lost because you're woke.’","summary":"The View’s racism was on full display during the Thursday edition of the unfortunately popular ABC News program. Staunchly racist Sunny Hostin bitterly lashed out at the white South Africans fleeing persecution and parroted the South African president’s denials. And while they denounced America as a racist and sexist country, moderator Whoopi Goldberg defended her and Hostin’s racism.\n\nHostin kicked off her racist ranting by whining that they had yet to mention President Trump taking in those South African refugees, getting tired groans from the liberal audience fed up with him. Without going over the evidence, Hostin parroted the denials from President Cyril Ramaphosa:\n\n\nAnd I think something we're not talking about is – enough about is what Donald Trump did on Monday is the Trump administration allowed in 59 white South African refugees into this country, claiming that they were fleeing racial discrimination and land appropriation.\n\nSo, the South African president has been actively, you know, denying at and","url":"https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/05/15/views-racists-decry-white-south-africans-defend-their-racism","image":"https://cdn.newsbusters.org/styles/mobile_thumb_700x400_/s3/2025-05/2025-05-15-ABC-TV-Decry-White-South-Africans-Defend-Their-Racism.jpg?itok=icxC0LtA","video":null,"publish_date":"2025-05-15 15:24:00","author":"Nicholas Fondacaro","authors":["Nicholas Fondacaro"],"language":"en","source_country":"US","sentiment":-0.095},{"id":321679318,"title":"New poll reveals mounting trouble for Democrats taking on Trump","text":"There’s deepening trouble for Democrats wanting to take on President Donald Trump, a new poll found. \n\nA poll from The Associated Press-NORC Center for Public Affairs Research found that Democrats have negative views of their own party after President Donald Trump won the election over Democrat Kamala Harris last November. This comes as Democrats scramble to combat Trump’s unprecedented agenda in his first few months in office.\n\nThe poll, conducted earlier this month, found that 35% of Democrats are optimistic about the future of their party. The Associated Press noted that this is a significant change from last July, when about 57% said they were optimistic about the future.\n\nIn contrast, 55% of Republicans are optimistic about the future of their party. This is up from the 47% who said the same last summer, according to AP.\n\nOverall, neither party is popular among the American electorate. Just 41% of Americans have a favorable view of the Republican Party while just 36% have a favorable view of the Democratic Party, according to the poll. \n\nThe poll also showed that 59% of Americans have a pessimistic view about the state of politics in the U.S. This includes 50% of Republicans, 50% of independents and 73% of Democrats.\n\nThe poll comes as Democrats’ leadership has faced widespread criticism after Harris’s loss to Trump and as new books with stunning revelations about former President Joe Biden’s decline are slated to publish. With no clear leader to turn to in 2028, Democrats are struggling to unite behind one message.\n\nThe poll found that there was no strong support behind either party’s rising leaders.\n\nAbout 43% of Americans had a favorable view of U.S. Sen. Bernie Sanders (I-Vt.), who has been touring with U.S. Rep. Alexandria Ocasio-Cortez (D-N.Y.) to rail against Trump. The poll showed that just 29% of Americans have a favorable view of Ocasio-Cortez.\n\nHowever, she is still more popular than Senate Minority Leader Chuck Schumer (D-N.Y.). The poll found that just 21% of Americans had a favorable view of Schumer, which comes as some Democrats call on Ocasio-Cortez to challenge him for his Senate seat.\n\nJust 35% of Democrats have a favorable view of Schumer, while 55% have a favorable view of Ocasio-Cortez. Sanders has a 75% favorability rating among Democrats, according to the poll.\n\nThe poll was conducted May 1-5 among 1,175 adults. It has a margin of error of plus or minus 4 percentage points.\n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"Do Democrats have what it takes to combat Trump?","url":"https://www.nj.com/politics/2025/05/new-poll-reveals-mounting-trouble-for-democrats-taking-on-trump.html","image":"https://www.nj.com/resizer/v2/AUUQY6NBPBA75JP7IO52M24ZHY.jpg?auth=2f485aa4e4d729b0ddbdc88c830db93d95ea715ee1ac647c1230a4c904b82970&width=1280&quality=90","video":null,"publish_date":"2025-05-15 15:15:45","author":"Lauren Sforza","authors":["Lauren Sforza"],"language":"en","category":"politics","source_country":"us","sentiment":-0.051},{"id":321756344,"title":"Why is Maga-land so obsessed with Kai Trump turning 18? Do you really need to ask? | Arwa Mahdawi","text":"Kai Trump, the president’s granddaughter and the eldest of Donald Trump Jr’s five children, has just turned 18. To be clear, I do not have a list of Trump family birthdays on my fridge. But it has been forced upon my consciousness because an awful lot of people in Trumpworld are being weird about it.\n\nFox News, for example, decided to post both an Instagram message (which got more than 87,000 likes) and a tweet wishing Kai a very happy 18th birthday. Which is a little odd considering that the high school student is not a public figure. Kai, who has a large social media following, did briefly speak at the Republican national convention last year and has posted support for her grandfather, but that doesn’t seem to justify a birthday announcement by a major media network.\n\nEspecially, by the way, as Fox News doesn’t appear to have been so excited about Barron Trump when he turned 18. (Although it did put up an Instagram post on Barron’s 19th birthday, with a quote from Donald calling him a “a very smart guy”.) It’s almost – and bear with me here – as if they have some sort of weird interest in the fact that a teenage girl has turned 18.\n\nAm I accusing the folk at Fox News of being a bunch of creeps? Absolutely not! I’d never do that. Although if you look at the reactions to the Fox News posts or the comments attached to a New York Post Page Six piece about Kai’s birthday, there are plenty of people out there who should be on some sort of watchlist or registry. Particularly the people who have read far too much into the fact that Kai recently posted a TikTok video of her and three friends dancing to Promiscuous by Nelly Furtado and Timbaland with the caption: “last day being 17\".\n\nWhile things have moved on somewhat, there’s also a very depressing history of media figures counting down to young girls turning the age of consent. Look at British singer Charlotte Church, who got a record deal as an opera singer when she was just 12. There was a media frenzy in 2002 when she turned 16 (the age of consent in England). On her birthday, Chris Moyles, a BBC radio DJ who was 28 at the time, publicly announced he wanted to “lead her through the forest of sexuality now she had reached 16”. Making this disgusting comment didn’t ruin Moyles’s career, by the way. Just like 38-year-old Jerry Seinfeld dating a 17-year-old high schooler hasn’t hurt the billionaire comedian’s career at all either.\n\nHarry Potter star Emma Watson has also talked about being sexualized by the media when she was a teenager. Watson has said the paparazzi even took photos up her skirt, and published them in an English tabloid, the moment she turned 18 and it was “legal”.\n\nIt was a similar story with twins Mary-Kate and Ashley Olsen, who have been on TV since they were tiny. In 2004 numerous websites started counting down to their 18th birthday including the “Olsen Twin Jailbait Countdown Clock” run by radio shock jocks Lex Staley and Terry Jaymes. The New York Post also crowed about the twins being “legal”.\n\nMore recently, in 2018, a radio host called Patrick Connor called Olympic athlete Chloe Kim, then just 17 years old, a “little hot piece of ass”. Conner then referenced Wooderson, a character in the film Dazed and Confused who pursues high school girls. “Her 18th birthday is 23 April, and the countdown is on baby, ’cause I got my Wooderson going,” said Connor. “‘That’s what I like about them high school girls.’” In a sign that some progress has made when it comes to mainstream misogyny, Connor was forced to apologize for the remark and fired.\n\nSince we live in litigious times I would like to reiterate, once again, that while some people (not me!) have accused Fox News of being creepy about Kai, I’m sure they meant nothing sinister by their post. After all, unlike depraved liberals, the Maga crowd are an extremely wholesome bunch who live and die for family values.\n\nI will concede, however, that it is sometimes hard to wrap one’s head around the Maga definition of “family values”. The president, for example, is a legally defined sexual predator who has also been accused, by Miles Taylor, a staffer in Trump’s first administration, of sexualizing his oldest daughter Ivanka.\n\nIn a book published in 2023, Taylor writes: “[Trump] said he talked about Ivanka Trump’s breasts, her backside, and what it might be like to have sex with her, remarks that once led [former chief of staff] John Kelly to remind the president that Ivanka was his daughter.”\n\nFormer Fox News star Tucker Carlson also seems to have a strange definition of family values. I’m sorry to remind you of this if you’ve wiped it from your memory but last year Carlson made an extraordinary (even by Maga standards) speech at a Trump rally in which he likened the now president to an angry father spanking his daughter.\n\n“I’m not going to lie. It’s going to hurt you a lot more than it hurts me,” Carlson said. “And you earned this. You’re getting a vigorous spanking because you’ve been a bad girl. You’re only going to get better when you take responsibility for what you did. It has to be this way.’” The crowd then erupted into chants of “Daddy Don”!\n\nMaga also seems to adopt different values, depending on what sort of family they’re looking at. Conservative influencers were vile about Ella Emhoff, Kamala Harris’s stepdaughter, when Harris was running for president. Newsweek senior editor Josh Hammer wrote: “Doug Emhoff’s daughter is like something out of a horror film,” for example. Podcast host Benny Johnson also called Emhoff and her father “creepy” for having their arms around each other in a video. The right seems eager to scrutinize the family of politicians when they don’t agree with their politics. They went on the warpath, however, when a former NBCUniversal executive joked about Barron being “fair game” (meaning that it was OK for the press to criticize him) when he turned 18.\n\nAnyway, happy birthday to Kai Trump. At 18 she is still very young – but it would seem like it’s the Maga adults who have the real growing up to do.","summary":"The birthday of Donald Trump’s granddaughter has been forced upon my consciousness because an awful lot of people are being weird about it\n\nKai Trump, the president’s granddaughter and the eldest of Donald Trump Jr’s five children, has just turned 18. To be clear, I do not have a list of Trump family birthdays on my fridge. But it has been forced upon my consciousness because an awful lot of people in Trumpworld are being weird about it.\n\nFox News, for example, decided to post both an Instagram message (which got more than 87,000 likes) and a tweet wishing Kai a very happy 18th birthday. Which is a little odd considering that the high school student is not a public figure. Kai, who has a large social media following, did briefly speak at the Republican national convention last year and has posted support for her grandfather, but that doesn’t seem to justify a birthday announcement by a major media network.\n\n Continue reading...","url":"https://www.theguardian.com/commentisfree/2025/may/15/kai-trump-magaland","image":"https://i.guim.co.uk/img/media/2211a61a22a1fe7cad653155160888a0e2d12235/175_0_4235_3388/master/4235.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3B","video":null,"publish_date":"2025-05-15 14:51:37","author":"Arwa Mahdawi","authors":["Arwa Mahdawi"],"language":"en","source_country":"gb","sentiment":-0.101},{"id":321679310,"title":"Springsteen levies rebuke of Trump administration during European tour stop","text":"Bruce Springsteen called the Trump administration “corrupt, incompetent and treasonous” during the opening night of his “Land of Hope & Dreams” tour with the E Street Band in Manchester, England.\n\nThe 75-year-old New Jersey native, who endorsed former Vice President Kamala Harris during her 2024 presidential campaign and once called President Trump “an American tyrant,” had some poignant remarks before opening the show with the song the tour is named for, “Land of Hope & Dreams.”\n\n“In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent, and treasonous administration,” Springsteen said. \n\nLater, before going into “My City of Ruins” Springsteen voiced his concerns on the Trump administration’s ongoing crackdown on civil liberties \n\n“In America, they are persecuting people for using their right to free speech and voicing their dissent.” Springsteen said. “This is happening now. In America, the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death. \n\n“This is happening now. In my country, they’re taking sadistic pleasure in the pain they inflict on loyal American workers. They’re rolling back historic civil rights legislation that has led to a more just and plural society. They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won’t bow down to their ideological demands.”\n\nSpringsteen also stated current representatives “have failed to protect the American people from the abuses of an unfit president and a rogue government.\" \n\nVideo of the remarks, as well as a transcript of what Springsteen said, has been posted to his website. \n\nThe tour spans six countries throughout Europe with 16 dates scheduled. The tour ends in Milan on July 3.\n\nRelated coverage:\n\nPopular rock bands’ anniversary tour falls apart, singer catching the blameMusicians we ‘canceled’ are selling out N.J. concerts again. It’s not a good look. | OpinionKendrick Lamar and SZA N.J. concert review: A triumph of shared historyRock legends should retire, says punk icon whose own band won’t take him back‘Satanic ritual’ was planned at pop star’s massive concert, cops say\n\nOur journalism needs your support. Please subscribe today to NJ.com.\n\nMurjani Rawls may be reached at mrawls@njadvancemedia.com","summary":"During the opening night of the E Street Band's Manchester, England stop, Springsteen directed his ire at the current presidential administration back home.","url":"https://www.nj.com/entertainment/2025/05/springsteen-blasts-trump-yet-again-calls-him-incompetent-and-treasonous-at-concert.html","image":"https://www.nj.com/resizer/v2/TNEVNMRJS5C3NPXK5ZUQREWFTU.png?auth=51ca9e5882f7f1d23ca086f05c14931b6e1f3dc155854c5073e6dd9beaa05c82&width=1280&quality=90","video":null,"publish_date":"2025-05-15 14:44:36","author":"Murjani Rawls","authors":["Murjani Rawls"],"language":"en","category":"politics","source_country":"us","sentiment":0.204},{"id":321646256,"title":"Trump Republican clashes with ‘Jewish Space Laser lady’ Marjorie Taylor Greene","text":"U.S. Reps. Marjorie Taylor Greene (R-Ga.) and Mike Lawler (R-N.Y.) got caught in a heated dispute on social media. \n\nLawler, who President Donald Trump recently endorsed for reelection, has said he will be voting against the president’s “big, beautiful bill” that includes tax breaks and massive cuts to Medicaid. Greene lashed out at Lawler over his decision in a lengthy post on social media platform X, accusing him of undermining the party’s agenda. \n\n\"Mike Lawler usually isn’t the guy in the conference with the best ideas, after all we lost a Republican held seat to a Democrat the last time Republicans voted for one of his ‘great’ strategy. Now Mike Lawler is a NO on Trump’s big beautiful bill because he won’t accept a SALT cap increase from $10K to $30K per year,\" she wrote on X.\n\n“And Mike Lawler has a toss up seat. What’s the point in Republicans fighting to protect and keep re-electing ‘Republicans’ if they constantly undermine the agenda America voted for?,” she added.\n\nLawler quickly hit back at Greene, calling her a “Jewish Space Laser lady” over conspiracy theories she has promoted in the past. He told her that Republicans would not have a majority if not for people like him winning reelection.\n\n“Shockingly the ‘Jewish Space Laser’ lady once again doesn’t have a clue what she is talking about. By the way, the reason you enjoy a gavel is because Republicans like me have won our seats. Good luck being in the Majority if we don’t,” he wrote on X.\n\nGreene previously claimed that wildfires in California were started by PG&E in coordination with the Rothschild banking firm using space lasers. She has been criticized for her anti-Semitic statements and for pushing unproven conspiracy theories.\n\nThe feud between the two Republicans continued on X.\n\nGreene wrote: “Here is Mike Lawler claiming HE gave us the majority NOT President Donald Trump!!! Did you all vote for Mike Lawler and his agenda???Or did America vote for President Trump and his MAGA America First agenda? Tell Mike Lawler what you voted for.”\n\nHowever, she was quickly fact checked by Lawler. Lawler explained to the MAGA mouthpiece that Trump did not win his district in the 2024 election. \n\n“MTG ran almost 10 points behind President Trump in one of the most Republican districts. I ran 6.5 points ahead of President Trump in a district won by Kamala Harris. I’m 1 of only 3 Republicans in a district won by Harris. I know math is difficult, but: 220-3=217,” he wrote.\n\nHouse Speaker Mike Johnson, R-La., also worked past midnight trying to resolve issues with Trump’s plan. Opposition is mounting from various corners of the GOP majority as he tries to muscle the party’s signature package to passage without any votes from Democrats.\n\nOn the one hand, the conservative leader of the Freedom Caucus derides the new Medicaid work requirements as a “joke” that do not go far enough at cost-cutting. Meanwhile, a handful of GOP lawmakers from New York and other high-tax states are refusing to support the measure unless changes are made to give deeper state and local tax deductions, called SALT, for their constituents back home.\n\n“To say we have a gulf is an understatement,” said Rep. Chip Roy, R-Texas, a leader of the conservative wing. \n\nRoy said there is “a significant number of us who could not bless this product” in its current form.\n\nNevertheless, momentum is building toward an end-of-the-week inflection point to stitch together the sprawling package Friday at the Budget Committee. That means combining hundreds of pages of bill text covering $5 trillion in tax breaks and at least $1.5 trillion in spending reductions on Medicaid, food stamps and green energy programs to deliver Trump’s second-term legislative priority.\n\nThe Associated Press contributed to this report.\n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"Marjorie Taylor Greene got caught in another heated dispute.","url":"https://www.nj.com/politics/2025/05/trump-republican-clashes-with-jewish-space-laser-lady-marjorie-taylor-greene.html","image":"https://www.nj.com/resizer/v2/EEWHMHZ66RFXLFNHNEKSIBFO4I.jpg?auth=a72e38e5a92898d6375d662b14688ab9aff0ce314151b657930274a65247337f&width=1280&quality=90","video":null,"publish_date":"2025-05-15 13:01:28","author":"Lauren Sforza","authors":["Lauren Sforza"],"language":"en","category":"politics","source_country":"us","sentiment":-0.197},{"id":321615476,"title":"Biden aides shielded him from wary Cabinet members for last two years in office, Tapper-Thompson book says","text":"“Access dropped off considerably in 2024, and I didn’t interact with him as much,” one Cabinet secretary told the authors. The same person said they were concerned that top White House officials were “leading” Biden to decisions, rather than the then-president making them on his own.\n\nMany officials said they were instructed to brief White House staff rather than the president, and the staff would then report back to Biden.\n\nAnother unnamed Cabinet secretary said Biden’s top aides had “shielded him in every meeting,” noting that from October 2023, they were kept at a distance from the president and “didn’t have access to him” for months.\n\nThe anonymous secretary was “shocked by how the president was acting” and noted “he seemed ‘disoriented’ and ‘out of it,’ his mouth agape,” the authors wrote in the book.\n\nNone of the Cabinet members publicized their concerns during Biden’s term.\n\nA Biden spokesperson told CNN that they “continue to await anything that shows where Joe Biden had to make a presidential decision or where national security was threatened or where he was unable to do his job.” The spokesperson said that “the evidence points to the opposite – he was a very effective president.”\n\nWHO WAS FOOLED BY THE BIDEN DECLINE COVER-UP? NOT THE VOTERS\n\nThe book, slated for release next week, also revealed that Biden’s advisers had debated whether the then-president would use a wheelchair if he won reelection, noting his physical deterioration.\n\nThe authors claim that the hundreds of interviews conducted to write the book were done after the 2024 election ended. Trump defeated then-Vice President Kamala Harris in the presidential election after she replaced Biden as the Democratic nominee following his decision to drop out in July.","summary":"Former President Joe Biden was reportedly shielded from his Cabinet for much of his final two years in the White House, with secretaries claiming anonymously in a new book they were &#8220;kept at bay.&#8221; Anonymous Cabinet secretaries told Jake Tapper and Alex Thompson about their concerns regarding Biden for the journalists&#8217; upcoming book, Original Sin: [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3411676/biden-aides-shielded-cabinet-members-last-two-years-tapper-thompson-book/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/joe-biden-president-speaking-jan-2025.webp","video":null,"publish_date":"2025-05-15 12:47:55","author":"Jack Birle","authors":["Jack Birle"],"language":"en","source_country":"US","sentiment":-0.669},{"id":321644054,"title":"The Biden cover-up","text":"Joe Biden took the adage to be “in office but not in power” a bit too literally. The 46th US president would often sit in the Oval Office without the ability to exercise power. Or actually exercise, for that matter. Or work past 5pm. Or speak. Or walk. \n\nPeople could see his infirmity. But the truth was far worse than we thought.\n\nWe now know Biden was senile during his presidency. He would fail to recognise decades-old acquaintances, or freeze with his mouth agape. His annual exam suspiciously did not include a cognitive test. Aides gave him black Hoka trainers to straighten his gait and began walking beside him to his helicopter in order to literally catch him if he tripped. Congressional Democrats left meetings with him thinking of their parents with dementia. Around Thanksgiving, Biden was handed cue-cards in case he was asked what he was thankful for. His team debated pushing him around in a wheelchair and laid down fluorescent tape to guide him through parties with few people. Like puppeteers, they used contraptions to bring him to life.\n\nDespite what they knew, Biden and his team ran for re-election. Steven Spielberg dialled in to train the president on his stilted delivery, while his aides impersonated Trump. But Biden was exhausted and couldn’t stop coughing. The world was spinning on a lozenge. At one point, Biden walked outside, found a nice sun lounger and took a nap by the pool.\n\nAnd then this attempted cover-up was savagely pulled apart over 90 minutes in front of the world. The catastrophe seemed imminent from the moment Biden walked on stage on 27 June. With beady black eyes, he stared catatonically at the floor, stopping and starting like a silent film at half speed. “We finally beat Medicare,” he said to a nation that watched on in disbelief. “He just lost the election,” CNN’s Dana Bash wrote in a note slipped to her co-moderator, Jake Tapper, as Tapper notes in Original Sin, a book on Biden’s decline which is enthralling Washington, co-authored with Axios reporter Alex Thompson.\n\nLater that night at a rally, Jill Biden took the microphone and gushed to her husband: “You answered every question. You knew all the facts!” Those closest to the president were holding him up to standards you would expect from a small child. \n\nThe president’s staff lied with a cultish fervent in order to keep the fiction alive that this man was fit to lead for another four years. Like any good lie, at times they believed it to be true. After the debate, the aides thought he had just had a bad night. They could not see the truth the world had witnessed. Steve Ricchetti, Biden’s right hand, “told a nervous aide that the debate wasn’t a big deal”. Calls for the president to blitz the media in order to prove the debate was a blip were ignored. The reason is now clear: this was not a bad night for Biden, this was the norm. \n\nSome books on election campaigns achieve little more than binding a year’s worth of New York Times articles into a book jacket. Original Sin is a comprehensively sourced autopsy of the agonised end to Biden’s 50-year career. \n\nIt’s accusatory, indignant, righteous – and convincing. It points the finger at the toady advisers around Biden for duping the country. “Biden, his family, and his team let their self-interest and fear of another Trump term justify an attempt to put an at times addled old man in the Oval Office for four more years,” Tapper and Thompson write.\n\nSome Washington old-hands still say with a shrug that Biden is Biden. They cannot point to where the gaffe-prone politician with a stutter they’d known for decades ended and the senile president began. There’s a dose of self-delusion, here: anyone who flicked between clips of Biden’s debates last year and those as recent as 2020 on their phone would see a man deteriorating rapidly.\n\nOriginal Sin shows that the deception about the fitness of the man with the nuclear codes started years earlier. Some of the first signs of decline came after the death of his beloved son Beau from cancer in 2015. By 2020, staff would secretly pre-load answers into a prompter for him to read in interviews. Since at least 2022, there were moments he could not recall the names of top aides whom he saw every day. Top Democrats who expressed concerns to the White house were told by Biden’s team that he was “fine”. \n\nThe truth spilled out from an unexpected source. In February last year, a Department of Justice investigation into confidential documents found in Biden’s garage said the president was an “elderly man with a poor memory”. The White House went on the attack. Vice-president Kamala Harris called the report “gratuitous”, and an MSNBC anchor devoted a segment to whether the special prosecutor was guilty of “ageism”.\n\nYou get the sense Biden never knew how senile he came across. When he awoke the day after Harris, who became the Democratic nominee, lost the 2024 election, he still thought he could have won it himself. That delusion was partly because Biden did not have all the information. If he had, he would have known that victory was a mirage.\n\nIn the weeks after the debate, as the party convulsed, Chuck Schumer, the Democrats’ Senate leader, asked the president whether he’d spoken to his pollsters. He hadn’t; Schumer had. “They think it’s a 5 per cent chance,” Schumer told him. “Really?” Biden asked, adding, “You have bigger balls than anyone I’ve ever met.” Why did Biden find it audacious to discuss the most basic campaign facts – the polls?\n\nBiden’s sin was not that he left only 107 days for Harris to campaign. The more time voters spent with Harris the more they would realise how hollow a politician she was. The real problem with Biden’s late decision was that no one else could seize the nomination. His stubbornness saddled the party with Harris. It’s a story reflected in two other books on the campaign: Jonathan Allen and Amie Parnes’s Fight, a colourful, sweary account restricted to 2024 itself, and Chris Whipple’s slim, selective volume Uncharted.\n\nAllen and Parnes report that Harris became the nominee partly because Democrats did not want to leapfrog the first African and Indian-American vice-president. Neither Barack Obama nor Nancy Pelosi wanted her as the candidate, and their plans for a mini-primary were frustrated. One mistake was followed by another. The party was as delusional about Harris’s political acuity as they were about Biden’s mental acuity. Harris was the type of politician who asked her aides to host a practice soiree with them acting as guests in preparation for an informal dinner at the home of a Washington journalist. Trump’s campaign manager Susie Wiles told Whipple in Uncharted, “We couldn’t believe how bad she was.” \n\nConsider why Harris didn’t distance herself from Biden – the fatal flaw in her campaign. She was unflinchingly loyal to Biden as vice-president and had also inherited Biden’s team — but she also did not know enough about policy to say what she would do differently. “Wall Street jargon hit her ears like a foreign language,” Allen and Parnes write. She had no theory of power. Her plan for an “opportunity economy” did not cut it. As Trump’s adviser Paul Manafort told Whipple: “We laughed every time they brought out celebrities. All that did is further the divide between the targeted voters we were going after and their base.” \n\nA few weeks after the election Harris’s chief of staff Sheila Nix said Harris ran a “pretty flawless campaign”. They are ready to do it all again.\n\nYou don’t need to spend long with these three books before you start to wonder whether their authors might have been kind enough to publish their findings a bit earlier. It could have spared us all the headache of an administration pondering the suspension of habeas corpus.\n\nIn January I asked a journalist from a major broadcaster why the press was so quiet on Biden’s decline, expecting them to complain about the media’s reverence for the White House. Instead she claimed that they “didn’t have the sources” to report a fact obvious even to reporters thousands of miles away. Most sources wouldn’t have wanted to talk before Biden stepped down, true. But these books suggest enough probably did.\n\nThompson and Tapper preface their account with a disclaimer: “Journalism about Biden does not excuse or normalize any actions and statements by anyone else.” Here is our answer: the fear that fair reporting on Biden would help Trump is left hanging on the page. HL Mencken wrote that the “only way for a reporter to look at a politician is down”. But in Trump’s America, journalists can only glance at his opponents from the corner of their eyes, in the brief moments they look away from Trump himself.\n\nThat fear of Trump bred timidity towards Biden, and allowed the cover-up to go unexposed. Few Democrats would now say this led to a better outcome than if the facts were ruthlessly reported early on.\n\nIn Darkness at Noon – a convincing meditation on the corrupting power of the idea that the ends justify the means – Arthur Koestler writes that, “We have thrown overboard all conventions, our sole guiding principle is that of consequent logic; we are sailing without ethical ballast.” The consequent logic here was that stopping Donald Trump to save democracy meant protecting Biden at all costs. That seems to have been what Biden’s inner circle thought. You can’t help but speculate that some journalists mistook that for their duty, too.\n\nIt did not work. Biden’s team tried to beat Trump at the game of lies. How naive: you cannot out-lie Trump. He lies in the daylight, like an exhibitionist. His lies are paraded like Soviet missiles in Red Square. Those that care about the truth know that he lies. Everyone else either likes it, or believes him, whatever the facts.\n\nBy turning the lie into a mark of authenticity, Trump has robbed the media of its ability to attack politicians for hypocrisy. He implicitly asks voters: would you not also exaggerate, boast and bully for your own gain? Am I therefore not like you? \n\nUnable to hold Trump to the same standards as a normal politician, one might think reporters would have feasted on Biden. Instead, some gambled on the hope that Trump would be defeated and normality restored – only to lose that bet.\n\n[See also: Misogyny in the metaverse]","summary":"The extent of the president’s decline was concealed by his desperate team. The reality was even worse than it seemed.","url":"https://www.newstatesman.com/culture/books/book-of-the-day/2025/05/the-biden-cover-up","image":"https://dl6pgk4f88hky.cloudfront.net/2025/05/15/BidenbyRalph.jpg","video":null,"publish_date":"2025-05-15 12:33:20","author":"Freddie Hayward","authors":["Freddie Hayward"],"language":"en","source_country":"gb","sentiment":-0.328},{"id":321615486,"title":"Democrats have long embraced ‘oligarchs’ with corporate welfare schemes","text":"A better description is “corporatists,” that is, businesses that exploit government policy and use willing politicians for their own advantage.\n\nThe exchange isn’t complicated: Campaign contributions lead to election wins, and election wins lead to self-serving policy. Some variation of this has undoubtedly existed since the invention of democracy thousands of years ago. \n\nThere are several ways they can do this. In Michigan, we have seen an utter abuse of “business incentives,” which are little more than corporate welfare.\n\nGov. Gretchen Whitmer’s (D-MI) economic strategy has amounted to attempting to lure big businesses, especially foreign corporations, to the state with tax breaks and cash payments.\n\nDon’t let Democrats fool you when they complain about the “rich not paying their fair share.” They are the ones using the tax code to get that company and score the next positive press release.\n\nWhitmer is traveling the world, hoping to lure companies to Michigan. It’s noteworthy she’s not driving across the border to Ohio or Indiana. Why? Whitmer’s Michigan is one of the most unattractive states in which to do business. Not to mention, Toledo is not quite as beautiful as London in springtime.\n\nEarlier this month, Michigan suffered a 128.34% jump in unemployment claims, according to the personal finance analysis website WalletHub, which ranked it the worst in the country.\n\nMichigan ranked 51st among all states, including Washington, D.C., for both the increase in claims in the first week of May versus the week prior and claims per 100,000 people in the labor force.\n\nMichigan’s 128.34% spike in claims last week was far higher than all other states, with the next closest increase in New Hampshire at 81.05%. Others among the top 10 biggest increases include Maryland at 30.38%, Alaska at 21.73%, Minnesota at 11.68%, the District of Columbia at 10.31%, Oregon at 10.26%, Virginia at 9.46%, Ohio at 9.23%, and Washington at 9.05%.\n\nTo address this problem, Whitmer has decided she needs to snag some new corporations by letting them live in the state essentially tax-free, effectively shifting their tax burden onto other businesses and individuals alike.\n\nTo make matters worse, Whitmer now wants a corporate tax increase for every other job creator in the state. Instead of cutting wasteful spending to increase road funding, Whitmer wants to raise taxes.\n\n“It’s not going to be all in cuts, and it’s not going to be all in new revenue, but all of these pieces are important to the final outcome that is going to be fixing the actual problem that we’re trying to solve,” she said recently.\n\nWhitmer’s allies have gone so far as to propose a 30% corporate tax hike, raising the state corporate tax from 6% to 8.5%.\n\n“This increase penalizes the entire economy and creates a new challenge for doing business in Michigan,” a representative of the Detroit Regional Chamber told MLive.\n\nAccording to the Tax Foundation, 16 states have reduced corporate income taxes over the last seven years. An 8% rate would make Michigan the 14th-most expensive state to do business.\n\nIn 2022, Whitmer wanted a talking point about jobs, so she threw $715 million in cash and tax relief at a Chinese battery maker with documented ties to the Chinese Communist Party called Gotion High-tech. Aside from it being a horrible national security decision, three years later, not a single job has been created.\n\nThat’s not unique, unfortunately for Michigan taxpayers. \n\nDemocrats created the Strategic Outreach Attraction Reserve, or SOAR, as a vehicle to distribute corporate welfare to chosen companies. After doling out over $670 million in cash to five companies, “zero” jobs have been created, despite 8,812 new jobs being promised.\n\n“The program was poorly designed from the start,” said James Hohman, director of fiscal policy at the Mackinac Center for Public Policy. “It allows companies to cash in on taxpayer subsidies without having to create jobs. Lawmakers must wait years to ask for taxpayer money back if deals fail to deliver.\n\nThe politicians are indifferent. They got their press release and glowing story, not to mention the campaign contributions and other perks. Heck, maybe even a job after leaving office. In the meantime, taxpayers are left holding the bag, forced to foot the bill while having hopes dashed when new opportunities don’t materialize.\n\nDemocrats and even some Republicans have created governments built on crony capitalism. But there are voices out there that are a threat to that cushy way of life, people who believe that government shouldn’t be for the monied few. It shouldn’t be billionaires, oligarchs, electing politicians who then give them corporate welfare.\n\nOne of the aspects of President Donald Trump that so many people find appealing is that he doesn’t answer to crony corporate donors.\n\n“He can’t be bought, unlike most of the politicians in this country. And he is standing here for the American people,” Health and Human Services Secretary Robert F. Kennedy Jr. recently said.\n\n“Elizabeth Warren or Robert Reich are saying that President Trump is on this side of the oligarchs. There has never been a president more willing to stand up to the oligarchs than President Donald Trump.” \n\nBut even as Trump has stood apart from this web of cronyism, these systems of corruption arranged by politicians and their corporatist donors are not victimless. Communities have and will continue to suffer.\n\nThe irony is that the Democrats who moan about school and road funding will privately shovel those funds into the bank accounts of the corporatists. They have a quid pro quo in place. They provide millions of taxpayer dollars for the rest of the corporatist’s life in exchange for campaign funds. \n\nThe billionaire class buys its own politicians in blue states. The rich get richer while the poor lose their jobs, attend declining schools, suffer rising costs, and watch their communities become unsafe. Sadly, in some states, it is hard to tell the difference between corporatist Democrats and Republicans. \n\nSen. Bernie Sanders (I-VT) and Rep. Alexandria Ocasio-Cortez (D-NY) can complain about their own side and some of the folks from the old Republican Party, but the Trump era is different. The president has led by example since he bucked the establishment and won in 2016 against the very political money machine they rail against.\n\nSanders’s party pushed him out of the 2016 primary and financed Hillary Clinton. As Clinton and later Kamala Harris discovered, money isn’t always the answer. Unlike Russian oligarchs, regardless of how much money American corporatists pour into politics, the people still have the final say. \n\nWHY TRUMP IS BOOSTING SAUDI ARABIA AND SIDELINING BENJAMIN NETANYAHU\n\nThe people must choose wisely. The divide between rich and poor is too often determined by those dropping large sums of money to boost their political fortunes.\n\nAmerican politics has become a billion-dollar industry, and too often, politicians are just pieces on the billionaire’s chessboard. Watch out for the candidates who get the attention of corporatists but can’t win over the people’s hearts. Your elected officials should be more than just players in a game. They are meant to serve the people. \n\nTudor Dixon is a former Republican gubernatorial nominee, executive in Michigan’s steel industry, breast-cancer survivor, and working mom of four girls. She is currently the host of The Tudor Dixon Podcast.","summary":"Democrats have seized on the word “oligarchs” to describe some apparent influence mysterious people have over Republicans. The word, which most people probably can’t define, has a harshly negative connotation that makes it all the more sinister. But in reality, it is Democratic leaders in Washington, D.C., and state capitals across the country that have [&#8230;]","url":"https://www.washingtonexaminer.com/in_focus/3411091/democrats-embrace-oligarchs-corporate-welfare-schemes/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/whitmer-april-2025.webp","video":null,"publish_date":"2025-05-15 12:00:00","author":"Tudor Dixon","authors":["Tudor Dixon"],"language":"en","category":"politics","source_country":"US","sentiment":-0.355},{"id":321624004,"title":"When the sleeping giant awakens, Trump will be toast","text":"People keep asking: How can Trumpdo this? \n\nIt’s not just a legal question about how Congress and the courts can allow his outright corruption, open use of the Justice Department to target perceived enemies, explicit threats to universities and law firms if they don’t cede their independence to the regime, direct attacks on media that criticize him, and defiant trampling on constitutional rights.\n\nIt’s also a question about how a president of the United States can be so utterly and uninhibitedly greedy, vindictive, and desirous of monarchic power at the expense of America’s democratic institutions.\n\nA common explanation is that the “guardrails” are now gone. In his second term, Trump has installed people around him who are more loyal to him than they are to the United States, such as Attorney General Pam Bondi and Secretary of State Marco Rubio, who therefore approve everything he wants (such as a $400 million luxury aircraft from Qatar that clearly violates the Constitution’s emoluments clause). \n\nAnother explanation I hear, especially from historians, is that crazy rulers — mad kings, ruthless power-hungry strongmen, malignant narcissists who take over nations — tend to attract fanatics who are even crazier than they are. And those fanatics (think Elon Musk, Stephen Miller, RFK Jr., Russell Vought) incite and excite each other and goad the crazy ruler into ever more extreme measures. \n\nI’m sure both go some way to explaining what’s happening to America under Trump 2. But I think they miss the biggest reason for Trump’s utter lack of inhibition this time around.\n\nHe believes nothing can stop him from doing whatever the hell he wants because nothing has. \n\nHe’s been impeached twice, indicted for trying to overthrow the results of the 2020 election, even convicted of criminal fraud. Not only has he gotten away scot-free, but the Supreme Court has given him presumptive immunity for whatever he does in office. \n\nAnd a plurality of voters even reelected him president, with more votes than Kamala Harris. \n\nHe’s 78 years old, soon to be 79, and figures he won’t ever have to face voters again — either because the 22nd Amendment to the Constitution prohibits it or because by 2028 he’ll have turned the nation into a full dictatorship and can count on being reelected. \n\nHell, he’s survived an attempted assassination.\n\nSo, he truly believes nothing can stop him no matter what he does. This is the core reason that he’s utterly, shamelessly, blatantly uninhibited — feeling totally unconstrained in seeking money and power. \n\nThe only potential obstacles are forces that he can’t easily push around because they’re are too rich or powerful — Xi’s China, Vladimir Putin, global bond traders, possibly Harvard University and the U.S. Supreme Court. \n\nSo with them he issues stern warnings and big threats. But if they don’t do what he wants he ultimately caves and claims victory nonetheless (as he has with China and Harvard). \n\nThere’s one constraining force that in the long run will be the most important of all: the American public. \n\nLike a huge sleeping giant, the American public is not easily stirred to action. Right now, some of the public is loudly opposing Trump — among them, many of you. (Thank you!) His net approval ratings have fallen by nearly 20 points since he took office. \n\nBut we’re still too few to credibly threaten congressional Republicans with electoral defeat unless they turn on Trump. \n\nI assure you that the giant will awaken — especially if Trump openly defies the Supreme Court, or arrests American citizens for saying or writing things he dislikes, or takes foreign bribes that clearly compromise America’s national security (such as getting the Saudi’s to invest in his crypto exchange and coins, in exchange for which he gives them America’s most advanced AI chips, which they then give to China). We’re inches away from one or more of these scenarios. \n\nAnd when the giant awakens, Trump and his regime will be toast. \n\nNOW READ: 'A bumpy ride': Republican extremists and moderates unite to defy Trump\n\nRobert Reich is a professor of public policy at Berkeley and former secretary of labor. His writings can be found at https://robertreich.substack.com/.","summary":"People keep asking: How can Trump do this? \n\nIt’s not just a legal question about how Congress and the courts can allow his outright corruption, open use of the Justice Department to target perceived enemies, explicit threats to universities and law firms if they don’t cede their independence to the regime, direct attacks on media that criticize him, and defiant trampling on constitutional rights.\n\nIt’s also a question about how a president of the United States can be so utterly and uninhibitedly greedy, vindictive, and desirous of monarchic power at the expense of America’s democratic institutions.\n\nA common explanation is that the “guardrails” are now gone. In his second term, Trump has installed people around him who are more loyal to him than they are to the United States, such as Attorney General Pam Bondi and Secretary of State Marco Rubio, who therefore approve everything he wants (such as a $400 million luxury aircraft from Qatar that clearly violates the Constitution’s emoluments clause). \n\nAnother e","url":"https://www.alternet.org/trump-sleeping-giant/","image":"https://www.alternet.org/media-library/image.jpg?id=60242939&width=1200&height=600&coordinates=0%2C443%2C0%2C444","video":null,"publish_date":"2025-05-15 11:48:54","author":"Robert Reich","authors":["Robert Reich"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.307},{"id":321584678,"title":"Bruce Springsteen Lets Rip on 'Treasonous' Trump Administration","text":"Bruce Springsteen has denounced the Trump administration in the opening remarks of his tour, labeling it \"corrupt, incompetent and treasonous.\"He was speaking Wednesday night as the first show of his Land of Hope and Dreams Tour got underway in Manchester, England.Newsweek has reached out to a representative for Springsteen outside of regular working hours via email for comment.Why It MattersThe 75-year-old musician, known as The Boss, is an influential figure, the 69th most popular all-time musical artist, and 26th most popular classic rock/rock musical artist, according to YouGov. Springsteen, from a working class background with Irish roots, has released 21 studio albums and has been a mainstay in the cultural lexicon since he released Born to Run in 1975.He previously endorsed President Barack Obama, President Joe Biden and Vice President Kamala Harris. In his endorsement of Harris in the 2024 Presidential election, he described President Donald Trump as the \"most dangerous candidate for president\" in his lifetime.What To KnowSpringsteen, perhaps best known for his post-Vietnam-war anthem Born in the U.S.A, has criticized Trump in the past but has stayed relatively quiet since his return to office in January.But that changed last night. Introducing his song, Land of Hope and Dreams, he said \"Tonight we ask all who believe in democracy and the best of our American experiment to rise with us, raise your voice against authoritarianism and let freedom ring!\"Throughout the set, which spanned two-and-a-half hours, Springsteen made multiple references to American politics.Before the song City of Ruin, he said, \"There's some very weird, strange, and dangerous s*** going on out there right now.\"\"In America, they are persecuting people for using their right to free speech and voicing their dissent. This is happening now. In America, the richest men are taking satisfaction in abandoning the world's poorest children to sickness and death.\"Springsteen also referenced deportations. Trump has pledged to deport millions of immigrants without legal status as part of his push for mass removals; authorizing ICE to carry out arrests in or near sensitive locations and invoking the Alien Enemies Act (AEA) to expedite the removal of suspected gang members.\"They are removing residents off American streets and without due process of law, are deporting them to foreign detention centers and prisons,\" Springsteen said.What People Are SayingBruce Springsteen, speaking at his concert: \"In my country they're taking sadistic pleasure in the pain they inflict on loyal American workers. They're rolling back historic civil rights legislation that has led to a more just and plural society. They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won't bow down to their ideological demands.\"What's NextSpringsteen's tour is scheduled to run until July and will see him play 16 shows across six European countries.","summary":"On the opening night of his tour, Springsteen told his fans to \"raise your voice against authoritarianism.\"","url":"https://www.newsweek.com/bruce-springsteen-trump-treasonous-concert-2072574","image":"https://d.newsweek.com/en/full/2644985/bruce-springsteen.jpg","video":null,"publish_date":"2025-05-15 10:55:20","author":"Marni Rose McFall","authors":["Marni Rose McFall"],"language":"en","category":"politics","source_country":"us","sentiment":0.109},{"id":321594114,"title":"Walters: Democrats seeking governorship strut their stuff for state’s unions","text":"Given California’s daunting — even existential — array of social, economic and fiscal crises, it’s remarkable that anyone would volunteer to become its governor.\n\nHowever, Gavin Newsom will vacate the office 19 months hence, with most of those crises still in place, and at least seven Democratic politicians yearn to succeed him.\n\nFormer state Senate President Pro Tem Toni Atkins, former U.S. Health and Human Services Secretary Xavier Becerra, Lt. Gov. Eleni Kounalakis, former Rep. Katie Porter, Superintendent of Public Instruction Tony Thurmond, former Los Angeles Mayor Antonio Villaraigosa and former State Controller Betty Yee put themselves on display Monday evening during a legislative conference of the state’s major union organizations.\n\nIt was what politicians call a “beauty contest,” in which candidates are given opportunities to briefly strut their stuff without any deep oratory. It was also an opportunity for the union leaders to pin them down on their top bread-and-butter issues, such as granting unemployment insurance benefits to striking workers, mandatory use of union labor in construction projects and more money for those projects, including the financially troubled bullet train.\n\nWith Lorena Gonzalez, head of the California Labor Federation, and Chris Hannan, president of the building trades, shooting the questions, the candidates were asked to wave flags indicating whether they supported the various union objectives.\n\nMost toed the union line, although Villaraigosa, who sparred with education unions during his mayoralty, demurred on the unemployment insurance issue, citing its cost and the state’s chronic budget deficits.\n\nThat and some other issues were indirect potshots at Newsom, who has occasionally bucked the unions. He rejected striker unemployment benefits and his crusade to wean California from oil, which is beginning to shut down its refineries, drew opposition from the candidates when queried by refinery union members. Several said the campaign against oil would raise Californians’ already high costs of living and, as Yee put it, “cannot be on the backs of workers.”\n\nAs the “salon” continued, it was obvious that two people not in the ballroom of Sacramento’s downtown Sheraton Hotel were looming over the event: President Donald Trump and the woman he defeated last fall, former Vice President (and California senator) Kamala Harris.\n\nSurprisingly, only Kounalakis brought up Trump without being prompted, since opposing Trump is a sacred tenet of California’s Democratic politicians. She vowed unrelenting resistance and others later followed her lead. However, Villaraigosa continued to somewhat set himself apart, saying “we can’t just take on Trump” but must address California’s many problems.\n\nHarris was an even more powerful specter as she plays it coy on whether to rekindle her political career by running for governor. She apparently is weighing whether to do that or resume her quest for the White House in 2028, when Trump presumably will end his second term and depart.\n\nA presidential rerun could put her in direct conflict with Newsom, who continues to emit indications of considering a White House campaign himself, while publicly denying such ambitions.\n\nWere Harris to seek the governorship, polls indicate that she would be the immediate frontrunner, particularly in a crowded field of primary election hopefuls. However, it’s also likely that some of the seven current political samurai would drop out should Harris run. With a smaller field, one of the remaining Democrats might make the November runoff in the top-two primary, setting up a two-person duel.\n\nUntil Harris decides, however, everything is tentative and unsettled, including efforts to raise the many millions of dollars needed to campaign for statewide office in California. The union leaders who staged Monday’s event will also be major sources of campaign money for whomever they finally endorse.\n\nDan Walters is a CalMatters columnist.","summary":"As seven candidates enter race to replace Newsom, Kamala Harris keeps everyone guessing about her political future.","url":"https://www.mercurynews.com/2025/05/15/walters-democrats-governorship-states-unions/","image":"https://www.mercurynews.com/wp-content/uploads/2025/05/SJM-Z-OPED-WALTERS-0515.jpg?w=1024&h=683","video":null,"publish_date":"2025-05-15 10:45:11","author":"Dan Walters","authors":["Dan Walters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.003},{"id":321566636,"title":"MAGA Lawmaker Goes Public to Mock Marjorie Taylor Greene as the ‘Jewish Space Laser Lady’","text":"Rep. Mike Lawler attacked fellow Donald Trump loyalist Marjorie Taylor Greene by referencing the unhinged “Jewish space laser” conspiracy she shared online before entering office.\n\nThe two MAGA Republicans got into a war of words on social media over a disagreement regarding changes to the state and local tax (SALT) deductions proposed under Trump’s “big, beautiful” spending bill.\n\nGreene landed the first blow by lashing out at Lawler for threatening not to vote on the GOP’s mega spending bill unless the SALT deduction cap increases from the proposed $30,000 limit. Greene suggested that Lawler should fall in line, as his New York seat is a “toss-up.”\n\nLawler hit back with his own post on X, mocking the former QAnon advocate for her past antisemitic social media posts alleging that Jewish people were responsible for the 2018 California wildfires.\n\n“Shockingly, the ‘Jewish Space Laser’ lady once again doesn’t have a clue what she is talking about,” Lawler wrote. “By the way, the reason you enjoy a gavel is because Republicans like me have won our seats. Good luck being in the majority if we don’t.”\n\nLawler is one of five House Republicans who are unhappy with the SALT proposals laid out in the GOP’s spending package. A House Ways and Means Committee bill, which passed Wednesday following a mammoth markup session, increases the $10,000 state and local tax deduction to $30,000 for those making $400,000 or less.\n\nLawler has warned he will not vote for the overall spending bill unless a higher SALT cap can be negotiated.\n\n“With the median income of $118,882 in Lawler’s district, the SALT cap of $30,000 should be an easy YES for Mike Lawler,” Greene wrote on X on Wednesday. “The rest of America doesn’t want to and shouldn’t have to make up the difference!!!!! And Mike Lawler has a toss-up seat.\n\n“What’s the point in Republicans fighting to protect and keep re-electing ‘Republicans’ if they constantly undermine the agenda America voted for???” she added.\n\nGreene further attacked Lawler on Wednesday while replying to his post mentioning the GOP’s slim House majority.\n\n“Here is Mike Lawler claiming HE gave us the majority, NOT President Donald Trump!!! Did you all vote for Mike Lawler and his agenda??? Or did America vote for President Trump and his MAGA America First agenda?” Greene asked.\n\nWhile referencing their respective 2024 election results, Lawler shot back on X: “MTG ran almost 10 points behind President Trump in one of the most Republican districts. I ran 6.5 points ahead of President Trump in a district won by Kamala Harris. I’m one of only three Republicans in a district won by Harris.\n\n“I know math is difficult, but: 220 - 3 = 217.”\n\nThis is not the first time Greene and Lawler have engaged in a public spat.\n\nIn May 2024, Lawler attacked Greene over her attempts to oust House Speaker Mike Johnson via a motion to vacate.\n\n“Moscow Marjorie has lost her mind—clearly the result of a space laser,” Lawler said in a statement. “I will continue to push back against the lunacy and be a voice of sanity in a sea of chaos.”","summary":"Leah Millis / ReutersRep. Mike Lawler attacked fellow Donald Trump loyalist Marjorie Taylor Greene by referencing the unhinged “Jewish space laser” conspiracy she shared online before entering office.\n\nThe two MAGA Republicans got into a war of words on social media over a disagreement regarding changes to the state and local tax (SALT) deductions proposed under Trump’s “big, beautiful” spending bill.\n\nGreene landed the first blow by lashing out at Lawler for threatening not to vote on the GOP’s mega spending bill unless the SALT deduction cap increases from the proposed $30,000 limit. Greene suggested that Lawler should fall in line, as his New York seat is a “toss-up.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/maga-rep-mike-lawler-mocks-marjorie-taylor-greene-in-public-feud-jewish-space-laser-lady/","image":"https://www.thedailybeast.com/resizer/v2/THAG6BZQ4BCV3EF3MWXO76O344.JPG?smart=true&auth=c0903a4d9d6ac1383d33f2c8ef0dd532de675b3b01492972bca044cd634d3cb4&width=1440&height=1080","video":null,"publish_date":"2025-05-15 10:19:06","author":"Ewan Palmer","authors":["Ewan Palmer"],"language":"en","source_country":"us","sentiment":-0.002},{"id":321586970,"title":"The GOP’s ‘senior bonus’ is a sop to Social Security recipients","text":"In a normal administration, a new policy begins with a group of wonks around a conference table, brainstorming ways to address a problem. The political strategists and the candidate select the idea they think is easiest to sell to voters and the speechwriters and social media managers then craft the messaging. For President Donald Trump, the process is almost entirely backward, as shown by a proposed \"senior bonus\" in a Republican budget working its way through Congress. Here's how the bonus would work: Americans ages 65 and older who don't itemize their taxes would get a $4,000 bonus on top of the standard deduction, under the current proposed budget. The deduction would phase out for older people earning more than $75,000 or older couples earning more than $150,000. That $4,000 figure sounds larger than it actually is. Older adults are not going to get the equivalent of four grand, as they would if it were a tax credit, which directly reduces your bill. They would just get to reduce their taxable income by that amount. So older adults with the median household income of $50,290 would pay taxes as though they were making $46,290. That's nice, but not a huge difference. Oh, and it would end in 2028. The path to this idea began with a social media post last year. Just days after Kamala Harris announced her campaign in July and began catching up to Trump in the polls, he posted on Truth Social a proposal that he had somehow not thought to include in the Republican platform approved earlier that month, just one of several sweaty sales pitches he started throwing out on the campaign trail. \"SENIORS SHOULD NOT PAY TAX ON SOCIAL SECURITY!\" Trump posted. This is not a new idea. In fact, Social Security benefits weren't taxed at all until a bipartisan reform signed by President Ronald Reagan made a number of tweaks to shore up the trust fund ahead of a looming shortfall. Currently, the benefits are only taxed if an older adult's household income is higher than $32,000, and only taxed at the top rate if it's higher than $44,000. When the taxes first went into effect, the plan was to target wealthier older adults and those who were still working, but the thresholds weren't indexed to inflation, so over time they've come to apply to more seniors. Democrats first proposed the idea of scrapping the tax on Social Security benefits as part of broader reforms that would help shore up the program's trust fund by hiking the payroll tax on the wealthy and making other changes. But Trump's version of the idea would actually weaken Social Security, as it would reduce the money coming into the trust fund by an estimated $1.6 trillion to $1.8 trillion over the next decade without providing any new sources of revenue. Still, Trump might have been able to muscle the idea through if he hadn't also proposed ending more taxes on tips or overtime, extending his 2017 tax cuts, repealing the cap on the state and local tax deduction, cutting taxes on car-loan interest, spending $1 trillion on the military, and sending every taxpaying household a $5,000 \"DOGE Dividend\" check, among other costly ideas. At some point, the math doesn't math. And the idea only became more difficult because of a congressional rule that meant it would have to come in a separate bill from the Republican budget. It's only then that Trump and his allies in Congress finally turned to the table full of wonks, who came up with the \"senior bonus\" as a sop to older voters that would cost a more reasonable $71 billion (in large part because, again, it would end in 2028). It's not a terrible idea, given inflation and other costs facing older adults right now, more in line with the kind of responsible, small-ball proposals put forward by the Harris campaign. But Trump won by promising the moon and leaving the details to be sorted out later. And we're learning again that means a lot less. Subscribe here to receive weekly updates on and expert insight into the key issues and figures defining Trump’s second term.","summary":"A Republican proposal to give seniors a $4,000 tax deduction is a sop to older adults whom Donald Trump promised a much bigger tax cut.","url":"https://www.msnbc.com/opinion/msnbc-opinion/republican-budget-social-security-senior-bonus-project-47-rcna206774","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-09/240912-social-security-office-se-453p-22edf1.jpg","video":null,"publish_date":"2025-05-15 10:00:00","author":"Ryan Teague Beckwith","authors":["Ryan Teague Beckwith"],"language":"en","source_country":"US","sentiment":-0.283},{"id":321572082,"title":"Bruce Springsteen Blasts 'Incompetent And Treasonous' Trump Administration","text":"Bruce Springsteen sounded off on US leader Donald Trump and his administration while across the pond for the first date of his latest tour.\n\nThe rock legend delivered a patriotic message while performing in Manchester on Wednesday night, where he told his fans: “The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock and roll, in dangerous times.”\n\n“In my home, the America I love, the America I’ve written about and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration,” he continued in a video posted on X by one of the concert’s attendees.\n\n“Tonight, we ask all who believe in democracy and the best of our American experience to rise with us,” he added. “Raise your voices against the authoritarianism, and let freedom ring.”\n\nThe Boss then sailed into his 2001 track Land Of Hopes And Dreams, singing lyrics like: “Dreams will not be thwarted. Faith will be rewarded. Hear the steel wheels singing. Bells of freedom ringing.”\n\nDuring another interlude at the concert, Springsteen talked about the “very weird, strange and dangerous shit going on” in the States. \n\n“In America, the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death. That is happening now,” he said. “In my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they are rolling back historic civil rights legislation that led to a more just and moral society.”\n\n“They’re abandoning our great allies and siding with dictators against those struggling for their freedom,” Springsteen continued.\n\nThe Born In The U.S.A. singer has never been a fan of the current president.\n\nDuring the Republican’s 2016 run for president against Hillary Clinton, Springsteen told Rolling Stone he thought Trump was a “moron” with “dangerous ideas”.\n\n“The whole thing is tragic,” he said of the reality TV star-turned-politician’s popularity. “Without overstating it, it’s a tragedy for our democracy.”\n\nEight years later, Springsteen dubbed Trump the “most dangerous candidate for president in my lifetime” while endorsing the Democratic candiate Kamala Harris in last year’s US election.","summary":"Bruce Springsteen on stage in Manchester on Wednesday nightBruce Springsteen sounded off on US leader Donald Trump and his administration while across the pond for the first date of his latest tour.\n\nThe rock legend delivered a patriotic message while performing in Manchester on Wednesday night, where he told his fans: “The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock and roll, in dangerous times.”\n\n“In my home, the America I love, the America I’ve written about and has been a beacon of hope and liberty for 250 years, is currently in the hands of a corrupt, incompetent and treasonous administration,” he continued in a video posted on X by one of the concert’s attendees.\n\n“Tonight, we ask all who believe in democracy and the best of our American experience to rise with us,” he added. “Raise your voices against the authoritarianism, and let freedom ring.”\n\nThe Boss then sailed into his 2001 track Land Of Hopes And Dreams, singing lyrics like: “Dreams will not b","url":"https://www.huffingtonpost.co.uk/entry/bruce-springsteen-slams-donald-trump-administration_uk_6825b9b8e4b0da44a3e0b32f","image":"https://img.huffingtonpost.com/asset/682520eb1900002a00317025.jpeg?cache=k8VCoORWr7&ops=1778_1000","video":null,"publish_date":"2025-05-15 09:58:26","author":"Kelby Vera","authors":["Kelby Vera"],"language":"en","category":"politics","source_country":"gb","sentiment":0.263},{"id":321571244,"title":"Omaha upset offers House Democrats glimmer of 2026 hope","text":"In April, Democrat Susan Crawford prevailed in a Wisconsin Supreme Court race that marked an electoral setback for Tesla CEO Elon Musk, who poured tens of millions into defeating her. Republicans competing in two safe Florida districts also notched smaller-than-expected special election victories.\n\nDemocrats are calling the races a template for next year, crediting a focus on local issues. Ewing emphasized the “chaos” of Trump’s second term, but also rebuffed GOP messaging on transgender politics by saying he was focused on potholes, not “potties.”\n\n“You have one candidate who’s talking about social issues, and then you have another candidate talking about potholes, the person at the local level who talks about potholes is probably gonna win,” House Democratic Caucus Chairman Pete Aguilar (D-CA) said at a press conference Wednesday. \n\n“So, I think keeping your eye on the ball and making sure that you’re focused on the needs of your constituents is the absolute most important thing you can do, and I think that’s what those successful candidates are doing,” he continued. \n\nRepublicans remain confident they can keep the House, with the map currently favoring them despite historical headwinds for the party in power.\n\n“The brilliance of Trump is he’s taking, you know, so much of the limelight, so much of the attention from Congress, that Congress can just get his s*** done, which is great,” Republican strategist John Feehery told the Washington Examiner. “It falls to Congress to actually get the s*** done.”\n\nBut Democrats believe Trump will ultimately prove to be a drag on the party. His name at the top of the ballot helped cement their control of the House and Senate, but his approval ratings have dropped now that he has retaken the White House.\n\n“Donald Trump is not popular,” Rep. Ted Lieu (D-CA), the vice chairman of the House Democratic caucus, told the Washington Examiner. \n\n“In fact, even the least popular president in over 80 years, at [the] 100-day mark, his policies are not popular. Some of them are also lawless. And when Republicans align themselves completely with Donald Trump, then voters get angry and they’re going to start taking them out in elections.”\n\nFifty percent of voters approve of the job Trump is doing, according to the RealClearPolitics polling average, compared to the 46% who disapprove.\n\nThe Omaha mayoral race, in particular, has implications for the House. The Democratic Congressional Campaign Committee is targeting Rep. Don Bacon (R-NE), a centrist who represents Omaha in Congress.\n\nBacon’s race was one of the most competitive in the 2024 election, but he ultimately came out on top in November to win his fifth term in the seat.\n\n“Last night’s election in Omaha made it clear: in NE-02 and across the country, the momentum is firmly at Democrats’ backs heading into 2026. We will flip NE-02, and Democrats will take back the House majority come 2026,” Katarina Flicker, the House Majority PAC national press secretary, told the Washington Examiner. \n\nBacon, who is considering whether to retire at the end of his term, credited the long tenure of Stothert for her defeat.\n\n“I’m on my fifth term, you accumulate votes that irritate people. If you’re a 50/50 district, you can’t take a lot of that. It’s reality, it’s part of governing,” Bacon told the Washington Examiner. “I just think she’s a victim of trying to go for her fourth term.”\n\nAlthough the race will be close — Bacon won by fewer than 2 points — Republicans are ready to fight for his seat. \n\n“He repeatedly outperforms the top of the ticket, proving D.C. elites and their political forecasts wrong. That won’t change and next November, Nebraskans will once again reelect Don Bacon,” National Republican Congressional Committee spokesman Zach Bannon told the Washington Examiner. \n\nOverall, Democrats are on defense in the House, with 39 of their seats rated competitive compared to the 29 marked competitive for the GOP. Yet Democrats only need a net gain of three seats to win back the chamber, which historically flips to the party not in the White House in the midterm elections, as it has for the last five presidencies.\n\n“Structurally, we’ve got a slight advantage. There are more Democrats in Trump districts than there are Republicans in Kamala Harris districts,” David McIntosh, president of the conservative Club for Growth, told the Washington Examiner Wednesday.\n\n“But that falloff factor is big, and the party should pay attention to these early ones as a signal that we can’t rest on our laurels. We’ve got to get ready for the next election,” he continued. \n\nSome Democratic lawmakers could make next year more difficult for House leadership, as some have begun launching bids to either fill vacant seats or challenge fellow Democrats in the Senate. Rep. Chris Pappas (D-NH) announced earlier this year that he is running for the Senate after Sen. Jeanne Shaheen (D-NH) decided to retire.\n\nHouse Republicans are giddy about the vacancy in New Hampshire’s 1st Congressional District, which is rated as “likely Democrat” by the nonpartisan Cook Political Report, listing it as one of their early targets for the 2026 cycle before Pappas even made his announcement. \n\nSens. Gary Peters (D-MI) and Tina Smith (D-MN) are not seeking reelection, opening the door for House Democrats in Michigan and Minnesota, respectively, to try and fill those seats. In Michigan’s case, this could put some districts in play after the state swung for Trump in 2024.\n\nBut with Trump’s name absent from the ballot and historically low turnout in midterm elections, Republicans will have a difficult path to flip the seat after Rep. Haley Stevens (D-MI) entered the Michigan race last month. \n\nOne Democratic strategist told the Washington Examiner that the party will need to have a distinct vision for the party even with Trump off the ballot.\n\n“Donald Trump is not going to win this election for Democrats,” the strategist said. “Democrats have to win it for themselves.”\n\nNaomi Lim, Marisa Schultz, and Rachel Schilke contributed to this article.","summary":"A shock outcome in Omaha, Nebraska&#8217;s mayoral race on Tuesday night is giving Democrats hope they can regain a foothold in Washington and flip the House. Democrat John Ewing beat Jean Stothert, the longest-serving incumbent mayor in the country, by tying him to the more unpopular parts of President Donald Trump’s agenda. Ewing, who will [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/congressional/3411256/omaha-upset-john-ewing-house-democrats-glimmer-2026-hope/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/05/omaha-mayor-ewing-scaled-1024x576.webp","video":null,"publish_date":"2025-05-15 09:00:00","author":"Lauren Green","authors":["Lauren Green"],"language":"en","category":"politics","source_country":"US","sentiment":0.01},{"id":321530476,"title":"Bruce Springsteen slams Trump in three powerful speeches at EU tour kick-off in Manchester","text":"After Robert De Niro’s takedown of Donald Trump at the opening ceremony of the 78th Cannes Film Festival, during which he called out “America’s philistine president” who “cut funding and support to the arts, humanities and education”, another American icon has come to Europe to take a stand.Music legend Bruce Springsteen has kicked off the first of three scheduled shows in Manchester, UK, last night (14 May) – the opening night of his European run that will last until July.During the opening gig, Springsteen shared three scathing speeches aimed at Donald Trump and his “incompetence”.To kick off the show, The Boss performed ‘Land of Hope and Dreams’, saying to the audience: “It’s great to be in Manchester and back in the UK. Welcome to the Land of Hope and Dreams Tour! The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock ‘n roll in dangerous times.” He continued: “In my home, the America I love, the America I’ve written about, that has been a beacon of hope and liberty for 250 years is currently in the hands of a corrupt, incompetent, and treasonous administration. Tonight, we ask all who believe in democracy and the best of our American experiment to rise with us, raise your voices against authoritarianism and let freedom ring!” Before ‘House of a Thousand Guitars’, Springsteen – who has long been a staunch critic of Trump - launched another righteous rant: “The last check, the last check on power after the checks and balances of government have failed are the people, you and me. It’s in the union of people around a common set of values now that’s all that stands between a democracy and authoritarianism. At the end of the day, all we’ve got is each other.” The Boss’ third – and strongest - political statement of the night came as he introduced ‘City of Ruin’: “There’s some very weird, strange, and dangerous shit going on out there right now. In America they are persecuting people for using their right to free speech and voicing their dissent. This is happening now.” He continued: “In America the richest men are taking satisfaction in abandoning the world’s poorest children to sickness and death. This is happening now. In my country they’re taking sadistic pleasure in the pain they inflict on loyal American workers. They’re rolling back historic civil rights legislation that has led to a more just and plural society. They are abandoning our great allies and siding with dictators against those struggling for their freedom. They are defunding American universities that won’t bow down to their ideological demands. They are removing residents off American streets and without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now.” “A majority of our elected representatives have failed to protect the American people from the abuses of an unfit president and a rogue government,” added Springsteen. “They have no concern or idea for what it means to be deeply American. The America l’ve sung to you about for 50 years is real and regardless of its faults is a great country with a great people. So, we’ll survive this moment. Now, I have hope, because I believe in the truth of what the great American writer James Baldwin said, he said ‘in this world there isn’t as much humanity as one would like, but there’s enough.’ Let’s pray.” Springsteen publicly endorsed Kamala Harris in November’s presidential election and performed at one of her rallies. He said at the time: “Donald Trump is the most dangerous candidate for president in my lifetime. His disdain for the sanctity of our Constitution, the sanctity of democracy, the sanctity of the rule of law and the sanctity of the peaceful transfer of power should disqualify him from the office of president ever again. He doesn’t understand the meaning of this country, its history, or what it means to be deeply American.” The 75-year-old music icon also told The Telegraph during the election: “(Trump)’s an insurrectionist. You know, he led a coup on the United States government, so there’s no way he should be let anywhere near the office of the presidency. Not to mention, he’s mentally ill.” Bruce Springsteen is currently on tour with ‘Land of Hope and Dreams’. He continues his Manchester dates on 17 and 20 May, before heading to France (Lille – 24 & 27 May; Marseilles – 31 May), back to the UK (Liverpool – 4 & 7 June), Germany (Berlin – 11 June; Frankfurt – 18 June), followed by dates in Spain and Italy.","summary":"Bruce Springsteen kicked off his EU tour last night and did not spare his thoughts regarding Donald Trump: “In my country they’re taking sadistic pleasure in the pain they inflict on loyal American workers. (...) Raise your voices against authoritarianism.\"","url":"https://www.euronews.com/culture/2025/05/15/bruce-springsteen-slams-trump-in-three-powerful-speeches-at-eu-tour-kick-off-in-manchester","image":"https://static.euronews.com/articles/stories/09/28/77/08/1440x810_cmsv2_4c008345-d054-5cd1-8b56-86bf663d6266-9287708.jpg","video":null,"publish_date":"2025-05-15 08:17:37","author":"David Mouriquand","authors":["David Mouriquand"],"language":"en","source_country":"fr","sentiment":0.096},{"id":321549120,"title":"Donald Trump's Approval Rating Reverses Course with Millennials","text":"President Donald Trump's approval rating among millennials has ticked upward for the first time in months, according to new polling data.Why It MattersMillennials, typically defined as people born between 1981 and 1996, represent the largest bloc of the U.S. electorate.Trump reduced the Democrats' lead among voters aged 30 to 44 by 9 points between 2020 and 2024, from 12 points to 3. However, since the beginning of his second term, polls have shown signs of waning support for Trump among millennials. However, a new poll shows his approval rating among this demographic may be creeping up again.For Trump, a rebound in support from voters aged 29 to 44 could help stabilize his approval ratings at a time when he's faced growing discontent over issues such as immigration and the economy. While millennials have historically leaned Democratic, even a modest uptick in support during his second term could strengthen his political leverage and influence the landscape for the 2026 midterms and beyond.What To KnowAfter months of decline, Trump's approval rating among millennials has made a sharp and surprising rebound, according to a new YouGov/The Economist poll conducted May 9–12 among 1,850 adults.Among Americans aged 30 to 44—a core segment of the millennial generation—Trump's approval jumped to 46 percent in May, up from 38 percent in April. That eight-point surge marks the largest one-month increase recorded for any demographic group in the poll. In March, his approval in the same age range stood at 43 percent, suggesting that May's gain represents a full reversal of the recent downward trend. The poll has a margin of error of ±3.4 percentage points.In contrast, support among younger voters is slipping. Approval among 18- to 29-year-olds—many of whom backed Trump in surprising numbers in 2024—has dropped sharply. After gaining 47 percent of the vote from this group in the last election, up from 36 percent in 2020, Trump now appears to be losing ground.In March, 44 percent of voters under 30 approved of his performance, while 48 percent disapproved. As of May, only 35 percent approve, while disapproval has climbed to 56 percent—a clear sign of erosion in a key slice of the youth vote.Support among older Americans, however, remains largely steady. Voters aged 45 to 64 gave Trump a 48 percent approval rating in the earlier poll and 47 percent in the latest one. Among those 65 and older, his approval held at 45 percent, with a marginal drop in disapproval from 54 to 53 percent. This stability among older demographics, who traditionally lean more Republican and vote at higher rates, continues to provide a solid base for Trump.Trump's bounce-back with millennials comes after weeks of sagging numbers tied to economic anxiety and fallout from his \"Liberation Day\" tariffs. The policy move rattled markets, prompting a sharp sell-off before an eventual recovery. But public sentiment did not rebound as quickly as the Dow. Polls throughout April showed sliding approval ratings—not only for Trump's overall job performance but also for his handling of the economy.Now, however, multiple polls suggest that the bleeding has stopped. Newsweek's tracker puts Trump's overall approval at 46 percent, with 51 percent disapproving—an uptick from 44 percent approval the previous week. Meanwhile, the latest TIPP Insights poll, conducted April 30 to May 2 among 1,400 adults, found Trump's net approval at -5 (42 percent approve, 47 percent disapprove), a slight improvement from -7 in early April. That poll's margin of error is ±2.7 percentage points.Yet, the broader trend remains one of stagnation more than resurgence. Trump's approval ratings have not improved dramatically since mid-April, but neither have they deteriorated further. A YouGov poll conducted May 6–8 pegs his approval at 42 percent, unchanged from the prior week, while disapproval ticked down slightly from 52 to 50 percent.And in the latest YouGov/The Economist poll, Trump's overall approval rating increased by 1 point to 43 percent, while his disapproval rating remained at 52 percent.Similarly, a Quantus Insights survey from May 5–7 showed no significant movement, reinforcing the idea that Trump's numbers have stabilized—for now.What People Are SayingLucas Walsh, a youth political behavior expert and a professor at Monash University in Australia, told Newsweek: \"Declining support among younger voters—many of whom backed Trump in 2024—may be because many respond to issues rather than party allegiances. Since the election, Trump's dizzying array of announcements across contentious issues could be discouraging younger voters.\"Economic hardship and uncertainty typically affect younger people disproportionately compared to older voters during economic downturns.\"These younger voters often care less about red and blue party lines and more about issues, particularly progressive ones, and issues affecting the bottom line of their day-to-day lives.\"Because millennials are a more politically fragmented and volatile group, current trends may be motivated by the continued lack of credible Democrat alternatives since [former Vice President Kamala] Harris' failed campaign.\"While Trump has been able to cut through to younger people, the scale and range of his announcements make any identifications of voting patterns difficult. It's like trying to catch a ball on a roller coaster.\"What Happens NextTrump's approval rating among millennials could fluctuate in the coming weeks, depending on the outcome of key events, including critical negotiations in the Russia-Ukraine war, the evolving tariff situation and concerns about a recession.","summary":"Millennials, typically defined as people born between 1981 and 1996, represent the largest bloc of the U.S. electorate.","url":"https://www.newsweek.com/donald-trump-approval-rating-polls-millennials-2072078","image":"https://d.newsweek.com/en/full/2644155/donald-trumps-approval-rating-reverses-course.png","video":null,"publish_date":"2025-05-15 08:00:01","author":"Martha McHardy","authors":["Martha McHardy"],"language":"en","source_country":"us","sentiment":-0.092}]}