{"offset":0,"number":50,"available":6141,"news":[{"id":256207666,"title":"Taylor Swift wastes no time dancing at MTV VMAs 2024 — see her seat mates","text":"Taylor Swift’s dance moves never go out of style. The 34-year-old arrived at MTV’s Video Music Awards 2024 at the UBS Arena in Elmont, New York, on Wednesday, and after a quick red carpet appearance, she dashed inside. Swift channeled her inner “Clueless” in a yellow and black plaid dress with black shorts, gloves and boots. She wore her blonde hair down in waves and opted for a dark makeup look. The songstress was quick to bust a move to Eminem’s opening number. Swift, who was sat next to her “Fortnight” collaborator Post Malone, danced with Jack Antonoff’s wife, Margaret Qualley. Though she won’t be rocking the stage tonight, there are rumors that the “You Belong With Me” might perform with Sabrina Carpenter or Shawn Mendes, according to Tribune. Leading the nomination board with 10 nods, Swift, 34, can make history tonight by being named the artist with the most VMA awards. She currently has 23 awards under her belt. Swift will surpass Beyonce, who currently has 30 VMA awards, if she does. Swift is nominated for 12 awards this year, including “Video of the Year,” “Artist of the Year” and “Song of the Year” for her 12th studio album, “The Tortured Poets Department.” This could be the second time this year the “Cruel Summer” singer will make music history. During the 2024 Grammy Awards, Swift became the first artist to win “Album of the Year” four times. Over the weekend, Swift and her boyfriend, football player Kansas City tight end Travis Kelce, were spotted all over NYC. The pair attended model Karen Elson’s wedding at Electric Lady Studios in NYC on Sept. 7th while wearing designs from Vivienne Westwood and Christian Louboutin. On Sunday, Swift and Kelce attended the U.S. Open Men’s Finals between American Taylor Fritz and Italy’s Jannik Sinner. The pair were later joined by Kansas City quarterback Patrick Mahomes and his wife, Brittany. Kelce is not with the pop star tonight due to in-season practice schedules with the Kansas City Chiefs. The team is scheduled to face off against the Cincinnati Bengals on Sept. 15. Kickoff time for the Week 2 game is set to start at 4:25 p.m. ET. Kelce did send his girlfriend love and support during the latest episode of the “New Heights with Jason and Travis Kelce” podcast. “Hopefully Taylor can walk away with a few, she’s nominated for about ten of those things tonight,” Travis said on the podcast. “Hopefully she can walk away with some moon men. Those are always one of the cooler trophies. The space guys.” Her VMA appearance comes one day after publicly endorsing Vice President Kamala Harris for the upcoming presidential election on Instagram after the debate between Harris and Donald Trump. “Like many of you, I watched the debate tonight,” she started to write in her caption. “If you haven’t already, now is a great time to do your research on the issues at hand and the stances these candidates take on the topics that matter to you the most.” “I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election. I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them,” Swift continued. Back in October 2020, the “Bad Blood” artist first shared that she would vote for President Biden and Harris. “I will proudly vote for Joe Biden and Kamala Harris in this year’s presidential election. Under their leadership, I believe America has a chance to start the healing process it so desperately needs,” Swift told Vogue Magazine.","summary":"Tonight, Swift is nominated for 12 awards this year, including including \"Song of the Year,\" \"Most Iconic Performance,\" \"Artist of the Year\" and \"Song of the Year\" for her 12th studio album, \"The Tortured Poets Department.\"","url":"https://nypost.com/2024/09/11/entertainment/taylor-swift-dances-at-vmas-2024-see-her-seat-mates/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/89491213.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/wbOuuWEm-RyIcpnTz.mp4","publish_date":"2024-09-12 00:40:00","author":"Nadine Bourne","authors":["Nadine Bourne"],"language":"en","catgory":"entertainment","source_country":"us","sentiment":0.705},{"id":256207392,"title":"Taylor Swift Makes Long-Awaited Red Carpet Debut at VMAs","text":"Taylor Swift and Travis Kelce have been turning heads in New York City for the past week, with flashy looks at the U.S. Open and New York Fashion Week. But it appears Swift took the 2024 MTV Video Music Awards solo on Wednesday, September 11 — making her red-carpet debut alone.Though the two have been dating for the past year, Swift, 34 has been busy with her Eras Tour and Kelce, 34, had a packed schedule with the 2023-2024 NFL season. But, the pop star managed to carve out some quality time for the VMAs.While on the red carpet, Swift dazzled in a punk rock look, wearing a yellow and black plaid dress which opened up to show black shorts underneath.Swift's arrival to the red carpet comes just one day after she endorsed U.S. presidential candidate Kamala Harris.Swift is nominated for 12 awards tonight, including Video of the Year for her Post Malone collaboration, \"Fortnight.\" With the coveted nomination, Swifties are anticipating a potentially big announcement.Back in 2022, after she won the Video of the Year Award for \"All Too Well (10 Minute Version),\" Swift announced her 10th studio album in her acceptance speech, before revealing its title — Midnights — and its cover art on social media just hours later.In addition to her long-awaited presidential endorsement, as well as her red carpet debut at the 2024 VMAs, Swift has also made headlines with her and Kelce's adorable jam session at the U.S. open, as well as helping boost The Darkness' music streams. She has also had fans divided as she was seen embracing her friend Brittany Mahomes — who has recently come under fire for her alleged support of Donald Trump.Could the fact that Swift is making both positive and controversial headlines which was the theme of her 2017 album Reputation mean a new Taylor's Version is on the way?","summary":"The pop star managed to carve out time in her busy schedule and delivered some slayage on the red carpet.","url":"https://www.newsweek.com/entertainment/celebrity-news/taylor-swift-red-carpet-debut-vmas-september-2024-1952371","image":"https://d.newsweek.com/en/full/2469469/taylor-swift.jpg","video":null,"publish_date":"2024-09-12 00:37:38","author":"Alex Gonzalez","authors":["Alex Gonzalez"],"language":"en","catgory":"entertainment","source_country":"US","sentiment":0.623},{"id":256207610,"title":"Taylor Swift leads the best dressed bombshells on red carpet alongside Sabrina Carpenter and Katy Perry at 2024 MTV VMAs","text":"Home News Royals U.S. Sport TV Showbiz Femail Health Science Money Travel Podcasts Shopping Best Buys Discounts My Profile Logout Login Headlines Showbiz Kim Kardashian Victoria Beckham Harry Styles Amanda Holden Britain's Got Talent My Profile Logout Login Privacy Policy Feedback Thursday, Sep 12th 2024 1AM 7°C 4AM 7°C 5-Day Forecast Advertisement It's 23-TIMES the charm! Ant and Dec land record-breaking Best Presenter gong while Mr Bates Vs The Post Office is the big winner with three prizes - and Strictly picks up best Talent Show The NHS must 'reform or die', says Sir Keir Starmer - as he promises the biggest overhaul of the health service since it was born eight decades ago Archaeologists unlock 3,000-year-old secrets about creation of the world and monsters after deciphering oldest known map of the world The 17 best villages to relocate to in Spain: Live minutes from the beach for just £46,000 with our expert guide - and find out how much life in the sun really costs PETER HITCHENS: Lucy Letby may be innocent. We cannot shut down the pursuit of justice because some are upset by that possibility Body found in search for hiker who went missing for 20 months after going walking in Scottish hills Heartbreak for Gary Lineker's family: Match of the Day host's sons pay tribute to their 'little cousin' Jonty Incredible moment rock legend Bon Jovi convinces woman not to leap from bridge while filming music video in Nashville I'm the first in Britain to try a 'lunchtime boob job'. So is it worth £10,000? Abby Cohen went grey overnight, suffered a breakdown and needed therapy when husband Ben left her for Kristina Rihanoff. As her ex falls from grace, how she revealed her trauma Is Rachel Reeves poised to impose a 'widow tax'? Downing Street dodges on whether single-person council tax discount could be scrapped What pushed Taylor Swift to break her silence and endorse Kamala Harris - as singer is left shaken by Donald Trump's 'frightening' debate diatribe I know what divorcee Katie sees in her millionaire telly tubby Eamonn Holmes, writes AMANDA PLATELL DEAR JANE: My husband has a DANGEROUS fetish and I don't want to participate anymore Pictured: Girl, six, who died in house fire as 14-year-old is released on bail after being arrested on suspicion of arson EDEN CONFIDENTIAL: My wedding was bigger than King Charles's was, says Sir Elton John BBC bosses locked in Strictly crisis talks over fears of legal action following publication of investigation into Giovanni Pernice and Amanda Abbington's Strictly experience Worst dressed! Addison Rae flashes the flesh in bra and underwear ballerina look alongsideAnitta and Thalia as they lead fashion fails on the red carpet at the 2024 MTV VMAs in New York Taylor Swift leads the best dressed bombshells on red carpet alongside Sabrina Carpenter and Katy Perry at 2024 MTV VMAs MTV VMAs 2024 WINNERS: Taylor Swift kicks off night by winning first Moonperson with Post Malone collab Kyle Walker has moved back into his marital home with Annie Kilner - as couple 'work' on their marriage after Lauryn Goodman paternity drama Teenager, 17, drowned after he was swept away during a kayaking trip planned on Snapchat EPHRAIM HARDCASTLE: Is Prince William's bearded appearance a poke in the eye for Harry? Mother left her 13-year-old daughter dying on the sofa watching Tipping Point to go to the pub, inquiry hears Previous Next Taylor Swift leads the best dressed bombshells on red carpet alongside Sabrina Carpenter and Katy Perry at 2024 MTV VMAs Have YOU got a story? Email tips@dailymail.com By Sarah Sotoodeh For Dailymail.com Published:22:30 BST, 11 September 2024 |Updated:01:41 BST, 12 September 2024 e-mail 47 View comments Advertisement The biggest stars in music were ready to rock and roll as they made their way to the MTV Video Music Awards red carpet at the UBS Arena in Long Island, New York on Wednesday night. Taylor Swift opted for tartan in her very Reputation coded look - consisting of a yellow and black plaid top half and open skirt - revealing black hot shorts that matched her thigh-high boots and lace up gloves. Taylor, 34, is wearing Dior Resort 2025, with Lorraine Schwartz jewelry including 30 carats pear shaped canary yellow diamond earrings surrounded by black jade. Sabrina Carpenter, 25, channeled Marilyn Monroe in her shimmering sequin silver gown, adding touseled locks and red lipstick on her pout, as she led the best dressed on the VMAs red carpet. Sabrina is wearing vintage Bob Mackie from his 1991 collection - the same dress that Madonna wore to the 1991 Academy Awards - while she was channeling Marilyn as well. Katy Perry flashed her flat midriff in a shredded white number, rocking wet looking locks and sultry makeup. The biggest stars in music were ready to rock and roll as they made their way to the MTV Video Music Awards red carpet at the UBS Arena in Long Island, New York on Wednesday night; pictured: Taylor Swift, Sabrina Carpenter and Katy Perry Taylor looked incredible in the edgy look, showcasing her statuesque frame. The Grammy award winning singer - who is in a relationship with NFL star Travis Kelce - had all eyes on her in the plaid dress with the open center - revealing her tiny thigh-grazing shorts beneath. The corset style dress put her cleavage on full display; the star added lace up gloves that went up to her shoulders, finishing up the look with boots. Sabrina dazzled in the strapless number as she posed up a storm on the red carpet. Sabrina's red carpet appearance comes after her album Short n' Sweet - which she released on August 23rd - debuted at number one on the Billboard 200 charts. The former Disney star's new album has entered week two at number one, Billboard revealed days prior to the VMAs. Taylor Swift opted for tartan in her very Reputation coded look - consisting of a yellow and black plaid top half and open skirt - revealing black hot shorts that matched her thigh-high boots and lace up gloves Taylor, 34, is wearing Dior Resort 2025, with Lorraine Schwartz jewelry including 30 carats pear shaped canary yellow diamond earrings surrounded by black jade Taylor looked incredible in the edgy look - showcasing her statuesque frame The Grammy award winning singer had all eyes on her in the plaid dress with the open center - revealing her tiny thigh-grazing shorts beneath The Short n' Sweet singer, 25, dazzled in the strapless number as she posed up a storm on the red carpet Sabrina also sported silver and white nails, which perfectly complimented her diamond rings she sported Halsey stood out in her red and black cheetah printed frock, which perfectly complimented her fire engine red locks. The artist showcased her tattoos in the sleeveless sequin accented number. Chappell Roan stood out on the red carpet - rocking a medieval sword as an accessory. Chappell paired the sheer frock with a striking green medieval style cape. The Good Luck, Babe! singer flashed her underwear in the sheer number, as well as her armor-style boots beneath and her claw-style nails. Chappell appeared to have her own knight, who rocked a medieval look like her; the singer passed her sword to him. Karol G smoldered in a striking flame hued bodycon maxi dress for the awards show. The stunning artist posed in the yellow, orange and white number, rocking red glossy lips and her blonde hair sleek and center parted around her. Halsey rocked a bold red and black leopard print dress that perfectly matched her crimson hued locks Chappell Roan stood out on the red carpet - rocking a medieval sword as an accessory Chappell paired the sheer frock with a striking green medieval style cape The singer flashed her underwear in the sheer number, as well as her armor-style boots beneath and her claw-style nails Chappell appeared to have her own knight, who rocked a medieval look like her; the singer passed her sword to him This year's festivities will be hosted by music extraordinaire Megan Thee Stallion. Stallion, 29, is herself nominated for five awards, including best collaboration and best hip-hop. She previously won best power anthem for Hot Girl Summer. The evening will be a who's who of music superstars with Sabrina Carpenter, Katy Perry, Camila Cabello, GloRilla, Rauw Alejandro, Benson Boone, Halsey, LISA, Lenny Kravitz, Anitta, Karol G, LL Cool J, and Shawn Mendes all set to perform at the show. Anitta channeled a bride in her white mini ruched dress, complete with a cap and sheer stockings The MTV VMAs will air live on 8pm ET/PT. This year's recipient of the legendary Video Vanguard Award will be Katy Perry. 'Katy is a musical powerhouse and true pop culture icon,' said Bruce Gillmer, chief content officer of music at Paramount+ and president of music, music talent, programming and events at Paramount in a statement, according to AP. 'With her game changing creative vision, she has become a global phenomenon and taken over the world’s biggest stages,' added Gillmer. Past winners of the Video Vanguard Award include David Bowie, Madonna, Janet Jackson, Beyoncé, Justin Timberlake, Jennifer Lopez, Shakira, and Pink. The award comes as Perry prepares to release her upcoming seventh studio album 143. Her comeback single from the album, Woman's World, flopped in the charts following its release over the summer. As for accolades, Taylor Swift is the most-nominated artist at the event with an impressive 10 nods to her name. The hitmaker, 34, has the chance to make history as she could become the first artist to win Video Of The Year five times. She already holds the record for most Video of the Year victories with four trophies under her name. The stunning artist posed in the yellow, orange and white number, rocking red glossy lips and her blonde hair sleek and center parted around her Miranda Lambert flashed her cleavage in a velvet suit for the awards show; she arrived with her handsome husband Brendan McLoughlin Lisa from BLACKPINK looked beautiful in her cream corset gown, complete with a hood and gloves Lisa looked stunning in her VMAs look, with her makeup perfectly highlighting her natural beauty Summer Walker (left) wowed in a leopard print mini dress, adding a lip shaped handbag and painting her pout the same crimson hue; Snooki (right) from Jersey Shore fame rocked a mini cheetah print drees, adding a jacket and designer bag Chanel West Coast wore an eye-catching ensemble for the awards show, flashing her midriff in the unique number Bachelor Nation star Tayshia Adams looked beautiful in a plunging black dress Chet Hanks, Shaboozey and Fat Joe posed up a storm in their VMAs fits on the red carpet The MTV VMAs will air live on 8pm ET/PT Her collaboration with Post Malone, the track Fortnight, is up for Video of the Year. Post Malone trails Taylor by just one nomination as he has earned nine total with most of them being from their collaboration. The one nomination he received without Taylor's assistance was for Best Collaboration for I Had Some Help, his track with Morgan Wallen. Also up for six nominations are Ariana Grande, Sabrina Carpenter, and Eminem. Like Megan Thee Stallion, SZA is up for five nominations. Meanwhile, Olivia Rodrigo, Teddy Swims, and Blackpink member Lisa all tied with four nods each. Finally Benson Boone, Anitta, Dua Lipa, Tyla, Bleachers, and GloRilla all have three nominations. MTV Video Music Awards 2024 WINNERS VIDEO OF THE YEAR Ariana Grande – “We Can’t Be Friends (Wait for Your Love)” – Republic Records Billie Eilish – “Lunch” – Darkroom / Interscope Records Doja Cat – “Paint The Town Red” – Kemosabe Records / RCA Records Eminem – “Houdini” – Shady / Aftermath / Interscope Records SZA – “Snooze” – Top Dawg Entertainment / RCA Records Taylor Swift ft. Post Malone – “Fortnight” – Republic Records ARTIST OF THE YEAR Ariana Grande – Republic Records Bad Bunny – Rimas Entertainment Eminem – Shady / Aftermath / Interscope Records Sabrina Carpenter – Island SZA – Top Dawg Entertainment / RCA Records Taylor Swift – Republic Records SONG OF THE YEAR Beyoncé – “Texas Hold ‘Em” – Parkwood Entertainment / Columbia Records Jack Harlow – “Lovin On Me” – Generation Now / Atlantic Records Kendrick Lamar – “Not Like Us” – pgLang, under exclusive license to Interscope Records Sabrina Carpenter – “Espresso” – Island Taylor Swift ft. Post Malone – “Fortnight” – Republic Records Teddy Swims – “Lose Control” – Warner Records BEST NEW ARTIST Benson Boone – Night Street Records, Inc. / Warner Records Chappell Roan – Island Gracie Abrams – Interscope Records Shaboozey – American Dogwood / EMPIRE Teddy Swims – Warner Records Tyla – Epic Records MTV PUSH PERFORMANCE OF THE YEAR August 2023: Kaliii – “Area Codes” – Atlantic Records September 2023: GloRilla – “Lick or Sum” – CMG / Interscope Records October 2023: Benson Boone – “In the Stars” – Night Street Records, Inc. / Warner Records November 2023: Coco Jones – “ICU” – Def Jam December 2023: Victoria Monét – “On My Mama” – Lovett Music / RCA Records January 2024: Jessie Murph – “Wild Ones” – Columbia Records February 2024: Teddy Swims – “Lose Control” – Warner Records March 2024: Chappell Roan – “Red Wine Supernova” – Island April 2024: Flyana Boss – “Yeaaa” – Vnclm_/ Atlantic Records May 2024: Laufey – “Goddess” – Laufey / AWAL June 2024: Le Sserafim – “Easy” – Source Music / Geffen Records July 2024: The Warning – “Automatic Sun” – Lava / Republic Records BEST COLLABORATION Drake ft. Sexyy Red & SZA – “Rich Baby Daddy “ – OVO / Republic Records GloRilla, Megan Thee Stallion – “Wanna Be” – CMG / Interscope Records Jessie Murph ft. Jelly Roll – “Wild Ones” – Columbia Records Jung Kook ft. Latto – “Seven” – Bighit Music / Geffen Records Post Malone ft. Morgan Wallen – “I Had Some Help” – Mercury / Republic / Big Loud Taylor Swift ft. Post Malone – “Fortnight” – Republic Records - WINNER BEST POP Camila Cabello – Geffen / Interscope Records Dua Lipa – Warner Records Olivia Rodrigo – Geffen Records Sabrina Carpenter – Island Tate McRae – RCA Records Taylor Swift – Republic Records BEST HIP-HOP Drake ft. Sexyy Red & SZA – “Rich Baby Daddy “ – OVO / Republic Records Eminem – “Houdini” – Shady / Aftermath / Interscope Records GloRilla – “Yeah Glo!” – CMG / Interscope Records Gunna – “Fukumean” – Young Stoner Life Records / 300 Entertainment Megan Thee Stallion – “BOA” – Hot Girl Productions Travis Scott ft. Playboi Carti – “FE!N” – Cactus Jack / Epic Records BEST R&B Alicia Keys – “Lifeline” – AK Records / Gamma Muni Long – “Made For Me” – Def Jam SZA – “Snooze” – Top Dawg Entertainment / RCA Records Tyla – “Water” – Fax Records / Epic Records Usher, Summer Walker, 21 Savage – “Good Good” – Mega / Gamma Victoria Monét – “On My Mama” – Lovett Music / RCA Records BEST ALTERNATIVE Benson Boone – “Beautiful Things” – Night Street Records, Inc. / Warner Records Bleachers – “Tiny Moves” – Dirty Hit Hozier – “Too Sweet” – Columbia Records Imagine Dragons – “Eyes Closed” – KIDinaKorner / Interscope Records Linkin Park – “Friendly Fire” – This Compilation / Warner Records Teddy Swims – “Lose Control (Live)” – Warner Records BEST ROCK Bon Jovi – “Legendary” – Island Coldplay – “Feelslikeimfallinginlove” – Atlantic Records Green Day – “Dilemma” – Reprise Records / Warner Records Kings of Leon – “Mustang” – Capitol Records Lenny Kravitz – “Human” – Roxie Records Inc. / BMG Rights Management U2 – “Atomic City” – Interscope Records BEST LATIN Anitta – “Mil Veces” – Floresta Records / Republic Records / Universal Music Latin Entertainment Bad Bunny – “Monaco” – Rimas Entertainment Karol G – “Mi Ex Tenia Razon” – Bichota / Interscope Records Myke Towers – “Lala” – Warner Music Latina Peso Pluma & Anitta – “Bellakeo” – Double P Records Rauw Alejandro – “Touching the Sky” – Sony Music Latin / Duars Entertainment Shakira & Cardi B – “Puntería” – Sony Music US Latin BEST AFROBEATS Ayra Starr ft. Giveon – “Last Heartbreak Song” – Mavin / Republic Burna Boy – “City Boys” – Spaceship / Bad Habit / Atlantic Records Chris Brown ft. Davido & Lojay – “Sensational” – Chris Brown Entertainment / RCA Records Tems – “Love Me JeJe” – Since ’93 / RCA Records Tyla – “Water” – Fax Records / Epic Records Usher, Pheelz – “Ruin” – mega / gamma. BEST K-POP Jung Kook ft. Latto – “Seven” – Bighit Music / Geffen Records Lisa – “Rockstar” – Lloud Co. / RCA Records NCT Dream – “Smoothie” – SM Entertainment / Virgin Music Group NewJeans – “Super Shy” – ADOR / Geffen Records Stray Kids – “Lalalala” – JYP Entertainment / Imperial / Republic Records Tomorrow X Together – “Deja vu” – Bighit Music / Imperial / Republic Records VIDEO FOR GOOD Alexander Stewart – “If Only You Knew” – FAE Grp Billie Eilish – “What Was I Made For (From the Motion Picture “Barbie”)” – Darkroom / Interscope Records Coldplay – “Feelslikeimfallinginlove” – Atlantic Records Joyner Lucas & Jelly Roll – “Best for Me” – Twenty Nine Music Group RAYE – “Genesis” – Human Re Sources Tyler Childers – “In Your Love” – Hickman Holler Records / RCA Records BEST DIRECTION Ariana Grande – “We Can’t Be Friends (Wait for Your Love)” – Republic Records – Directed by Christian Breslauer Bleachers – “Tiny Moves” – Dirty Hit – Directed by Alex Lockett & Margaret Qualley Eminem – “Houdini” – Shady / Aftermath / Interscope Records – Directed by Rich Lee Megan Thee Stallion – “BOA” – Hot Girl Productions – Directed by Daniel Iglesias Jr. Sabrina Carpenter – “Please Please Please” – Island – Directed by Bardia Zeinali Taylor Swift ft. Post Malone – “Fortnight” – Republic Records – Directed by Taylor Swift BEST CINEMATOGRAPHY Ariana Grande – “We Can’t Be Friends (Wait for Your Love)” – Republic Records – Cinematography by Anatol Trofimov Charli XCX – “Von Dutch” – Atlantic Records – Cinematography by Jeff Bierman Dua Lipa – “Illusion” – Warner Records – Cinematography by Nikita Kuzmenko Olivia Rodrigo – “Obsessed” – Geffen Records – Cinematography by Marz Miller Rauw Alejandro – “Touching the Sky” – Sony Music Latin / Duars Entertainment – Cinematography by Camilo Monsalve Taylor Swift ft. Post Malone – “Fortnight” – Republic Records – Cinematography by Rodrigo Prieto BEST EDITING Anitta – “Mil Veces” – Floresta Records / Republic Records / Universal Music Latin Entertainment – Editing by Nick Yumul Ariana Grande – “We Can’t Be Friends (Wait for Your Love)” – Republic Records – Editing by Luis Caraza Peimbert Eminem – “Houdini” – Shady / Aftermath / Interscope Records – Editing by David Checel Lisa – “Rockstar” – Lloud Co. / RCA Records – Editing by Nik Kohler Sabrina Carpenter – “Espresso” – Island – Editing by Jai Shukla Taylor Swift ft. Post Malone – “Fortnight” – Republic Records – Editing by Chancler Haynes BEST CHOREOGRAPHY Bleachers – “Tiny Moves” – Dirty Hit – Choreography by Margaret Qualley Dua Lipa – “Houdini” – Warner Records – Choreography by Charm La’Donna Lisa – “Rockstar” – Lloud Co. / RCA Records – Choreography by Sean Bankhead Rauw Alejandro – “Touching the Sky” – Sony Music Latin / Duars Entertainment – Choreography by Felix ‘Fefe’ Burgos Tate McRae – “Greedy” – RCA Records – Choreography by Sean Bankhead Troye Sivan – “Rush” – Capitol Records – Choreography by Sergio Reis, Mauro Van De Kerkhof BEST VISUAL EFFECTS Ariana Grande – “The Boy is Mine” – Republic Records – Visual Effects by Digital Axis Eminem – “Houdini” – Shady / Aftermath / Interscope Records – Visual Effects by Synapse Virtual Production, Louise Lee, Rich Lee, Metaphysic, Flawless Post Justin Timberlake – “Selfish” – RCA Records – “Selfish” – RCA Records – Visual Effects by Candice Dragonas Megan Thee Stallion – “BOA” – Hot Girl Productions – Visual Effects by Mathematic Olivia Rodrigo – “Get Him Back!” – Geffen Records – Visual Effects by Cooper Vacheron, Preston Mohr, Karen Arakelian, Justin Johnson Taylor Swift ft. Post Malone – “Fortnight” – Republic Records – Visual Effects by Parliament BEST ART DIRECTION Charli XCX – “360” – Atlantic Records – Art Direction by Grace Surnow Lisa – “Rockstar” – Lloyd Co. / RCA Records – Art Direction by Pongsan Thawatwichian Megan Thee Stallion – “BOA” – Hot Girl Productions – Art Direction by Brittany Porter Olivia Rodrigo – “Bad Idea Right?” – Geffen Records – Art Direction by Nicholas des Jardins Sabrina Carpenter – “Please Please Please” – Island – Art Direction by Nicholas des Jardins Taylor Swift ft. Post Malone – “Fortnight” – Republic Records – Art Direction by Ethan Tobman BEST TRENDING VIDEO Beyoncé – “TEXAS HOLD ‘EM” – Parkwood Entertainment / Columbia Records Camila Cabello ft. Playboi Carti – “I LUV IT” – Geffen / Interscope Records Chappell Roan – “HOT TO GO!” – Amusement Records / Island Records, a division of UMG Recordings, Inc. Charli xcx – “Apple” – Atlantic Records Megan Thee Stallion ft. Yuki Chiba – “Mamushi” – Hot Girl Productions Tinashe – “Nasty” – Nice Life Recording Company BEST GROUP NSYNC – RCA Records Coldplay – Atlantic Records Imagine Dragons – KIDinaKorner / Interscope Records NCT Dream – SM Entertainment / Virgin Music Group NewJeans – ADOR / Geffen Records SEVENTEEN – PLEDIS Entertainment / Geffen Records TOMORROW X TOGETHER – BIGHIT MUSIC / IMPERIAL / Republic Records Twenty One Pilots – Fueled By Ramen SONG OF THE SUMMER Ariana Grande – “we can’t be friends (wait for your love)” – Republic Records Benson Boone – “Beautiful Things” – Night Street Records, Inc. / Warner Records Billie Eilish – “BIRDS OF A FEATHER” – Darkroom / Interscope Records Chappell Roan – “Good Luck, Babe!” – Amusement Records / Island Records, a division of UMG Recordings, Inc. Charli XCX & Billie Eilish – “Guess featuring Billie Eilish” – Atlantic Records Eminem – “Houdini” – Shady / Aftermath / Interscope Records Future, Metro Boomin & Kendrick Lamar – “Like That” – Wilburn Holding Co. / Boominati / Epic / Republic GloRilla, Megan Thee Stallion – “Wanna Be” – CMG / Interscope Records Hozier – “Too Sweet” – Columbia Records Kendrick Lamar – “Not Like Us” – pgLang, under exclusive license to Interscope Records Post Malone ft. Morgan Wallen – “I Had Some Help” – Mercury / Republic / Big Loud Sabrina Carpenter – “Please Please Please” – Island Shaboozey – “A Bar Song (Tipsy)” – American Dogwood / EMPIRE SZA – “Saturn” – Top Dawg Entertainment / RCA Records Taylor Swift ft. Post Malone – “Fortnight” – Republic Records Tommy Richman – “MILLION DOLLAR BABY” – ISO Supremacy / PULSE Records / Concord VMAS MOST ICONIC PERFORMANCE Beyoncé – “Love on Top” Britney Spears, Christina Aguilera, Madonna, Missy Elliot – “Like a Virgin” & “Hollywood” Eminem – “Real Slim Shady” & “The Way I Am” Katy Perry – “Roar” Lady Gaga – “Paparazzi” Madonna – “Like a Virgin” Taylor Swift – “You Belong With Me” Katy PerryMegan Thee StallionAnittaKarol G Share or comment on this article: Taylor Swift leads the best dressed bombshells on red carpet alongside Sabrina Carpenter and Katy Perry at 2024 MTV VMAs e-mail Add comment NEW ARTICLESHomeTop Share Back to top Home News Royals U.S. Sport TV Showbiz Femail Health Science Money Travel Podcasts Shopping Sitemap Archive Video Archive Authors Topics Index Mobile Apps Screensaver RSS Text-based site Reader Prints Our Papers Top of page Daily Mail Mail on Sunday This is Money Metro Jobsite Mail Travel Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group dmg media Contact us How to complain Leadership Team Advertise with us Contributors Terms Subscription Terms & Conditions Do not sell or share my personal information About MailOnline Privacy Settings Privacy policy & cookies Advertisement Advertisement","summary":"The biggest stars in music were ready to rock and roll as they made their way to the MTV Video Music Awards red carpet at the UBS Arena in Long Island, New York on Wednesday night.","url":"https://www.dailymail.co.uk/tvshowbiz/article-13839955/MTV-VMAs-2024-best-dressed-red-carpet.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/09/12/01/89566457-0-image-m-125_1726100457780.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/09/11/50126519703192196/1024x576_MP4_50126519703192196.mp4","publish_date":"2024-09-12 00:37:07","author":"Editor,Sarah Sotoodeh","authors":["Editor","Sarah Sotoodeh"],"language":"en","source_country":"GB","sentiment":0.341},{"id":256207592,"title":"Taylor Swift has arrived at the 2024 MTV Video Music Awards. Will she make history?","text":"Winning would give Swift a prominent stage to voice support for Kamala Harris' presidential bid. Swift endorsed the vice president Tuesday night, moments after Harris' debate with former president Donald Trump ended. Shaboozey reacted to her endorsement on the VMAs red carpet, telling The Associated Press, “I think you just do you, you know? Do what you feel in your heart. Just be honest with yourself,” he said. \"Just walking your truth, you know.” If prior years are any indication, Swift may make multiple speeches. She took home nine VMAs last year, bringing her total to an impressive 23. That places her just behind Beyoncé, who has 30 and just ahead of Madonna, who has 20 awards. Lady Gaga has 19. Seven Swift wins would tie Beyoncé’s record, and if she wins eight, she could become the most awarded musician in VMA history. That is, if Beyoncé doesn't take home any of her own trophies. She's up for song of the year (Texas Hold 'Em) and two social categories. The VMAs, which begin at 8pm Eastern and are being held at the UBS Arena on New York’s Long Island – will be hosted by Megan Thee Stallion. It marks her first time hosting an award show. She'll perform as well. The last two years have been hosted by Nicki Minaj: She emceed solo in 2023, in 2022, she was joined by Lil Wayne and Jack Harlow.","summary":"She leads the nominations with 12 – eight for her Fortnight music video, two social categories and nods in the best pop and artist of the year categories.","url":"https://cnalifestyle.channelnewsasia.com/entertainment/mtv-vmas-taylor-swift-407466","image":"https://onecms-res.cloudinary.com/image/upload/s--BUMny7NU--/c_crop,h_562,w_1000,x_0,y_16/c_fill,g_auto,h_338,w_600/f_auto,q_auto/v1/one-cms/core/2024_mtv_vmas_-_arrivals_78968.jpg?itok=Thxzm7eA","video":null,"publish_date":"2024-09-12 00:32:59","author":"Cna Lifestyle","authors":["Cna Lifestyle"],"language":"en","catgory":"entertainment","source_country":"sg","sentiment":0.447},{"id":256207328,"title":"Donald Trump took the bait in debate. Imagine how Putin, Kim Jong Un would play him.","text":"After months of following the many twists and turns of this presidential election, we’ve all been zooming in on some very particular voters who will ultimately decide who wins in November. It’s the undecided, moderate and independent voters in seven swing states who are going to be the difference between a second term for former President Donald Trump or a first term for Vice President Kamala Harris. But sometimes it’s important to zoom out, too. After the highly anticipated debate in Philadelphia, I took a step back for a second and was left wondering what outsiders must make of us as we’re stuck litigating things like childless cat ladies and pet-eating migrants. Trump and MAGA have brought us somewhere truly bizarre, conspiratorial and embarrassing, all of which was evidenced in the debate. But it’s something that happened a day before the debate that summed it up for me. “Oh, sweetie!” The remark, dripping with condescension and mockery, came from Margarita Simonyan, the editor in chief of Russia’s state-controlled media organization RT. She said it about Trump this week, rhetorically head-patting his seeming dismay over Vladimir Putin’s “endorsement” of Harris. Putin had said it with a smirk and a wink — and anyone with a pulse knows Putin prefers Trump because he’s manipulable and ignorant. (Putin also earlier this year said he preferred President Joe Biden. Right. Sure.) But Trump, of course, fell for it. “I knew Putin. I knew him well,” he said. “And you know, he endorsed, I don’t know if you saw the other day, he endorsed Kamala. He endorsed Kamala. I was very offended by that.” RT’s host Vladimir Solovyov laid into Trump. “In the U.S., they think we care about the elections. Idiots, we care about your civil war! May you, political dirtbags, kill one another!” said Solovyov. “You are so pathetic and laughable. Honestly speaking, I was a bit disheartened, unless Trump is joking, I was saddened by Trump’s reaction.” Trump, as we know by now, is not only deeply insecure and thin-skinned, he’s also mind-numbingly gullible. It’s why enemies like Putin and North Korea’s Kim Jong Un couldn’t believe their luck when he was elected. Not only didn’t Trump seem to care about democracy, free press and free elections — just like them — but he dopily went around praising two of the worst actors on the planet and parroting their propaganda. One can imagine, as Harris woke up Wednesday after the debate, she was similarly thinking, “Oh, sweetie!” Even she must be a little surprised at how easy a mark he was, how little effort it took to manipulate him, how willingly he took the bait. What a sucker Trump was for Harris’ obvious plan. She laid out trap after trap after trap — not obscured, but visible to anyone watching — and he doltishly stumbled into every single one. Her goal was to goad him into being himself, the insecure, thin-skinned, undisciplined and impulsive jerk who has absolutely no self-control. Trigger words: crowd size, bankruptcy, fired So in the midst of laying out thin policy plans and platitudes, Harris repeatedly dangled low-hanging fruit she knew Trump couldn’t resist: crowd size; Hannibal Lecter; sexual assault; bankruptcy; daddy’s money; fired; birther; John McCain. By the end, she’d gotten him to wander into far-flung territory — repeating the bogus rumor that migrants were eating American pets; suggesting he saved Obamacare; defending his remarks on the Central Park 5; name-dropping Sean Hannity and Viktor Orbán; and, of course, fixating on the “stolen” election. None of this is helpful for reaching those undecided swing state voters who will ultimately decide this election. They’ve repeatedly told us in polls and focus groups that they do not like the distractions, the divisive rhetoric, the personal attacks. They wanted substance, and Harris tricked Trump into chasing rabbits instead. Now, she may be a prosecutor, but she’s not Houdini. If Trump had wanted to avoid these obvious landmines, he easily could have. Or maybe better put, if he could have, he would have. It all just brought into sharper relief how truly unfit he is — to run the country and stand up to dictators who know they can outsmart him with mere flattery, like giving candy to a baby. If this election were a psychological thriller, we’d liken Trump to a Manchurian candidate, manipulable and unknowingly working for the enemy. But what happened on stage was more like “Zoolander,” the Ben Stiller movie about a dim-witted male model who’s brainwashed into assassinating the prime minister of Malaysia. Instead of playing “Relax” by Frankie Goes to Hollywood, Harris just had to cue up Trump’s many insecurities and triggers and watch him go to work. And he did not disappoint. S.E. Cupp is the host of “S.E. Cupp Unfiltered” on CNN. Send letters to letters@suntimes.com Get Opinions content delivered to your inbox. Sign up for our weekly newsletter here.","url":"https://chicago.suntimes.com/columnists/2024/09/11/donald-trump-takes-bait-presidential-debate-kamala-harris-putin-kim-jong-un-se-cupp","image":"https://cst.brightspotcdn.com/dims4/default/84f9c8d/2147483647/strip/true/crop/3000x1713+0+146/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff5%2Fa1%2Fa7aa637343d3931ce6b797a8264c%2Felec","video":null,"publish_date":"2024-09-12 00:30:00","author":"S. E. Cupp","authors":["S. E. Cupp"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.339},{"id":256207336,"title":"How the migrant community of Springfield got caught in a political firestorm","text":"Springfield, Ohio — At the St. Vincent de Paul Society community center in Springfield, Ohio, Haitian immigrants receive food and clothes and get help finding work.\"They're here and they're our responsibility,\" said Kaci Rollins, who runs the community center. Rollins tells CBS News that the supplies are an open-armed welcome for asylum seekers fleeing violence and starvation from countries in collapse. Rollins said the migrants \"want work,\" adding that some of them \"work three jobs, they never stop working.\" Since 2020, about 15,000 Haitians have settled in Springfield. The city has a population of just under 60,000. Republican Ohio Gov. Mike DeWine announced Wednesday that in an effort to deal with the \"surge of migrants\" in Springfield, he is deploying Ohio State Highway Patrol troopers to patrol Springfield's roads, as well as providing $2.5 million in healthcare funding. \"These Haitians came in here to work because there were jobs, and they filled a lot of jobs,\" DeWine told CBS News in an interview Wednesday. \"And if you talk to employers, they've done a very, very good job and they work very, very hard.\" But when it comes to immigration, Springfield has become tense since last August, when a minivan driven by a Haitian immigrant without a valid license collided head-on with a school bus, killing 11- year-old Aiden Clark. And on Tuesday night, former President Donald Trump poured fuel on the local grievances by repeating a baseless conspiracy theory during the debate with Vice President Kamala Harris.\"In Springfield, they're eating the dogs, the people that came in, they're eating the cats. They're… eating the pets of the people that live there, and this is what's happening in our country, and it's a shame,\" Trump said. Moderator David Muir immediately responded, reading a statement from the Springfield city manager saying, \"There have been no credible reports of specific claims of pets being harmed, injured or abused by individuals within the immigrant community.\"DeWine on Wednesday echoed that, telling CBS News that \"there's no truth\" to Trump's claims. And while the claims are false, the pain in the migrant community has been real for long time. \"We try every single day to make us better,\" one migrant told CBS News. \"And when you make us better, the neighborhood is going to be better, the city is going to be better.\"Springfield was once a manufacturing hub. Since 2000, those manufacturing jobs have dropped by nearly half, according to the Bureau of Labor Statistics, from about 13,000 to 7,000 in 2024.Haitian immigrants, most of whom have temporary protected status and work permits, have been blamed for stealing jobs. But business owners like job recruiter Alex Muller see their presence as vital. Muller says many locals left the workforce during the pandemic. \"They've been very welcoming, they've been very kind, and they're very grateful to have the opportunity to provide for themselves and their families,\" Muller said. It's a complicated issue that cannot be divided along political lines. Nathan Clark, the man whose son was killed in last year's bus crash. understands that more than anyone. \"Using Aiden as a political tool is, to say the least, reprehensible,\" Clark said at a Springfield City Commission meeting Tuesday. \"…My son, Aiden Clark, was not murdered. He was accidentally killed by an immigrant from Haiti. This tragedy has (been) felt all over this community, the state and even the nation, but don't spin this towards hate.\"","summary":"During the debate with Vice President Kamala Harris, former President Donald Trump poured fuel on local grievances with a baseless conspiracy theory.","url":"https://www.cbsnews.com/news/haitian-migrants-springfield-ohio-political-firestorm/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/12/85a8f251-50ec-44b9-b07e-023c8cbd4cbc/thumbnail/1200x630/1ad3791bc11f0cbb291b6b7792b7f025/1726100175198.png?v=eed8fba9acd13199742a248f804168a1","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3187493_hls/master.m3u8","publish_date":"2024-09-12 00:27:18","author":"Alicia Hastey,Andy Wolff,Lilia Luciano","authors":["Alicia Hastey","Andy Wolff","Lilia Luciano"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.22},{"id":256207230,"title":"MTV Video Music Awards Winners: Taylor Swift, Megan Thee Stallion, Katy Perry Victorious — Follow Live Updates","text":"The year’s biggest names in music gathered Wednesday at UBS Arena in Long Island, NY for a chance to take home a Moon Person. Hosted by Megan Thee Stallion, the 2024 MTV Video Music Awards featured the likes of Chappell Roan, Sabrina Carpenter, Glorilla, Karol G and LL Cool J, making his first VMAs gig in over 25 years, all while celebrating the best performances of the year. With 10 nominations, Taylor Swift led the pack at the awards show, followed by Post Malone, Ariana Grande, Eminem, Sabrina Carpenter, Megan Thee Stallion and SZA. Carpenter and Roan were among this year’s crop of first-time nominees, which also includes Teddy Swims, Benson Boone, Tyla, Jelly Roll, Jessie Murph, Rauw Alejandro, Sexyy Red, Victoria Monét, Alexander Stewart, Burna Boy, Coco Jones, Flyana Boss, Gracie Abrams, Gunna, Joyner Lucas, Laufey, LE SSERAFIM, Lojay, Morgan Wallen, Myke Towers, NCT Dream, Pheelz, Playboi Carti, RAYE, Shaboozey, Tyler Childers and The Warning. Meanwhile, Katy Perry has been announced as the recipient of this year’s Michael Jackson Video Vanguard Award The 2024 MTV VMAs was previously scheduled for this Tuesday before it was postponed so not to conflict with the presidential debate between Kamala Harris and Donald Trump on ABC. Falling on the 23rd anniversary of the terrorist attacks on the World Trade Center, MTV also honored the nonprofits 9/11 Day and Tuesday’s Children. See the full list of MTV Video Music Award winners below. Michael Jackson Video Vanguard Award Katy Perry Best Alternative Benson Boone – ‘Beautiful Things’ – Night Street Records, Inc. / Warner Records VMAs Most Iconic Performance Katy Perry – ‘Roar’ (2013, live from Empire-Fulton Ferry Park) Best Trending Video Megan Thee Stallion ft. Yuki Chiba – ‘Mamushi’ – Hot Girl Productions Song of Summer Taylor Swift ft. Post Malone – ‘Fortnight’ – Republic Records Best Rock Lenny Kravitz – ‘Human’ – 2024 Roxie Records Inc. under exclusive license to BMG Rights Management GmbH Best Collaboration Taylor Swift ft. Post Malone – ‘Fortnight’ – Republic Records","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe year’s biggest names in music gathered Wednesday at UBS Arena in&#8230;\n\n\nThis Post: MTV Video Music Awards Winners: Taylor Swift, Megan Thee Stallion, Katy Perry Victorious — Follow Live Updates first appeared on Internewscast Journal","url":"https://internewscast.com/news/mtv-video-music-awards-winners-taylor-swift-megan-thee-stallion-katy-perry-victorious-follow-live-updates/","image":"https://internewscast.com/wp-content/uploads/2024/09/rewrite-this-title-MTV-Video-Music-Awards-Winners-List-Wins.jpg","video":null,"publish_date":"2024-09-12 00:26:33","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"entertainment","source_country":"us","sentiment":0.896},{"id":256207016,"title":"California attorney general warns tech platforms to look out for voter deception ahead of election","text":"California Attorney General Rob Bonta cautioned executives at social media and other tech companies to work harder to protect voters from “deception, intimidation, and dissuasion,” ahead of the November election. “Millions of Californians rely on social media and artificial intelligence services to obtain news and information about upcoming elections, and it is paramount that the platforms, products, and services offered by your companies not be misused to deceive voters about their constitutional right to vote,” Bonta wrote in a letter Wednesday to the CEOs of Alphabet, Meta, Microsoft, OpenAI, Reddit, TikTok, X and YouTube. The letter reviewed sections of California law that prohibit interference with voting rights by misleading people about voting place and time and by using intimidation tactics. California state law also “generally prohibits the distribution, within 60 days of an election, and with actual malice, of materially deceptive audio or visual media of a candidate appearing on the ballot in the election with the intent to injure the candidate’s reputation or to deceive a voter into voting for or against the candidate,” Bonta wrote. The letter follows pop icon Taylor Swift’s endorsement of Kamala Harris for president on Tuesday night following the debate. Swift criticized those who had circulated AI-generated images falsely stating that she had endorsed Donald Trump. Trump had shared a series of those images on his Truth Social platform. Separately, X owner Elon Musk recently shared an AI-generated image portraying Harris dressed as a communist dictator. “Kamala vows to be a communist dictator on day one,” Musk, who has endorsed Trump, wrote in a post on X on Sept. 2 “Can you believe she wears that outfit!?” Google’s Gemini, OpenAI’s Dall-E and Chat GPT, Microsoft copilot and Grok, made by Musk’s xAI, allow users to rapidly generate images and text in response to prompts or questions. In August, an updated version of xAI’s product, Grok-2, appeared to carry few limitations on creating fake images of political figures. WATCH: The generative AI trade","summary":"California Attorney General Rob Bonta discusses Michelle Mack&#8217;s case in an interview on Feb. 16, 2024. CNBC California Attorney General Rob Bonta cautioned executives at social media and other tech companies to work harder to protect voters from &#8220;deception, intimidation, and dissuasion,&#8221; ahead of the November election. &#8220;Millions of Californians rely on social media and &#8230;\n\n\nThe post California attorney general warns tech platforms to look out for voter deception ahead of election appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/california-attorney-general-warns-tech-platforms-to-look-out-for-voter-deception-ahead-of-election/","image":"https://image.cnbcfm.com/api/v1/image/107383657-1709765685656-ROB_BONTA.jpg?v=1710172674&w=1920&h=1080","video":null,"publish_date":"2024-09-12 00:21:45","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.101},{"id":256207744,"title":"2024 VMAs red carpet: Taylor Swift, Katy Perry, Paris Hilton turn heads at award show","text":"Fashion took center stage Wednesday at the UBS Arena in Elmont, New York for the annual MTV VMAs. Taylor Swift sported a Christian Dior gown with black shorts and matching black boots for the musical affair where she leads nods with 10 nominations, followed closely by her recent collaborator, Post Malone, who's up for nine awards. The two took home the first award of the night for best collaborator for their song, \"Fortnight.\" Katy Perry flashed her abs wearing a creamy Who Decides War tattered top and skirt. She was joined on the black carpet by her fiancé, Orlando Bloom. TAYLOR SWIFT ENDORSES KAMALA HARRIS FOR PRESIDENT AFTER DEBATE: ‘I’VE MADE MY CHOICE' Paris Hilton sparkled in a custom Celia Kritharioti dress with an ornate diamond choker necklace to match her towering pumps. Ariana Grande, Eminem and Sabrina Carpenter are each nominated for six VMAs. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS Host Megan Thee Stallion and SZA are each competing for five awards, while Olivia Rodrigo, Teddy Swims and Lisa tied for four nominations apiece.","summary":"Taylor Swift leads nods with 10 nominations, followed by Post Malone, Ariana Grande, Eminem and Sabrina Carpenter vying for trophies at MTV VMA awards","url":"https://www.foxnews.com/entertainment/2024-vmas-red-carpet-taylor-swift-katy-perry-paris-hilton-turn-heads-award-show","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/taylor-swift-katy-perry-paris-hilton-vmas.jpg?ve=1&tl=1","video":null,"publish_date":"2024-09-12 00:21:24","author":"Tracy Wright","authors":["Tracy Wright"],"language":"en","catgory":"entertainment","source_country":"US","sentiment":0.915},{"id":256207018,"title":"Trump falsely claims Democrats support abortions “after birth.” Here’s a fact check.","text":"Former President Donald Trump falsely claimed during Tuesday night’s presidential debate that Vice President Kamala Harris’ running mate, Minnesota Gov. Tim Walz, supports the “execution” of babies after they are born, repeating earlier false assertions that Democrats support killing babies. The Republican nominee made the claim when ABC moderator Linsey Davis asked why he changed his position to support Florida’s six-week abortion ban. “Her vice presidential pick says abortion in the ninth month is absolutely fine. He also says execution after birth — it’s execution, no longer abortion, because the baby is born — is OK,” Trump said. Infanticide is illegal in every state, and Harris and Walz have never supported it. Here’s what we know about the claim and where Harris and Walz stand on abortion. A history of false claims Trump has a history of falsely claiming that Democrats support killing babies after birth. At a recent rally in Charlotte, Trump said Harris supports abortion “right up until birth, and even after birth.” During the debate, Trump repeated a similar claim. At different points, he referenced the “former governor of Virginia” and the “former governor of West Virginia,” who, Trump asserted, “said we put the baby aside and then we determine what we want to do with the baby.” Trump appeared to be talking about former Virginia Gov. Ralph Northam, a Democrat and a physician, who gave a 2019 radio interview in which he discussed a hypothetical scenario in which a fetus has severe deformities or is not viable outside the womb. In such a case, Northam said, “the infant would be delivered, the infant would be kept comfortable, the infant would be resuscitated if that’s what the mother and the family desired.” The comments sparked fierce backlash from Republicans, including then-chairwoman of the Republican National Committee, Ronna McDaniel, who accused Northam of supporting “born-alive abortions.” In response, Northam said, “I have devoted my life to caring for children and any insinuation otherwise is shameful and disgusting.” Walz and Harris on abortion Vice President Harris has supported restoring the standards of Roe v. Wade, which protected the right to an abortion until the fetus reaches viability outside the womb, typically at around six months of gestation. The Biden-Harris administration endorsed the Women’s Health Protection Act of 2022, which would have prevented states from banning abortions before viability or requiring additional tests or waiting periods, though the legislation did not pass the Senate. In recent interviews on “Face the Nation,” both Harris and Walz declined to give specifics about how far into a pregnancy they believe abortions should be permitted. Asked about it during the debate, Harris said: “I absolutely support reinstating the protections of Roe v. Wade. And as you rightly mentioned, nowhere in America is a woman carrying a pregnancy to term and asking for an abortion. That is not happening.” As governor, Walz signed the Protect Reproductive Options Act (PRO Act) in 2023, codifying abortion access in Minnesota. It’s one of the few states in the country that does not prohibit abortions past the stage of viability. According to the CDC‘s most recent data, less than 1% of abortions nationally occur past 20 weeks of pregnancy. In Minnesota, data from the state Department of Health showed that in 2022, only two abortions occurred between 25 and 30 weeks and none after 30 weeks. Late-term abortions typically occur to save the mother’s life or when families are facing situations where the fetus is unlikely to survive long after birth. Trump on abortion Throughout his campaign, Trump has highlighted his appointment of three conservative justices to the U.S. Supreme Court, which led to the overturning of Roe v. Wade and the end of the constitutional right to abortion. As president, Trump supported legislation that included a federal 20-week ban on abortion, with some exceptions. However, during the 2024 presidential campaign, Trump has told reporters he would not sign a federal ban and said each state should be able to restrict abortion as they choose. Trump said on Aug. 30 that he’ll vote to uphold Florida’s six-week abortion ban. His statement on that came just a day after he criticized the law in an interview and faced blowback from abortion opponents. Florida has a proposition on the November ballot to protect abortion rights before fetal viability in the state. It’s one of 10 states where the issue of abortion will be on the ballot.","summary":"Former President Donald Trump falsely claimed during Tuesday night&#8217;s presidential debate that Vice President Kamala Harris&#8217; running mate, Minnesota Gov. Tim Walz, supports the &#8220;execution&#8221; of babies after they are born, repeating earlier false assertions that Democrats support killing babies.  The Republican nominee made the claim when ABC moderator Linsey Davis asked why he changed &#8230;\n\n\nThe post Trump falsely claims Democrats support abortions &#8220;after birth.&#8221; Here&#8217;s a fact check. appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/trump-falsely-claims-democrats-support-abortions-after-birth-heres-a-fact-check/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/11/53a4f23d-c79b-431d-ad53-ad36e95666da/thumbnail/1200x630g2/92611fca3e80b884be098f944fe201f8/trump-harris-debate2.jpg?v=eed8fba9acd13199742a248f804168a1","video":null,"publish_date":"2024-09-12 00:19:17","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.34},{"id":256206834,"title":"Mary Trump Reveals 'Injury' Donald Will Never Get Over","text":"Former President Donald Trump's estranged niece Mary Trump says that one particular moment in her uncle's poorly-received debate performance against Vice President Kamala Harris caused an irreparable \"narcissistic injury.\"During an appearance on MSNBC's Deadline: White House on Wednesday, Mary Trump told host Nicolle Wallace that her uncle had suffered a \"resounding defeat\" in his first and possibly only presidential debate with Harris on Tuesday. A majority of polls and pundits suggested that Harris won the debate.After Wallace pointed out a debate moment where Harris made Trump seemingly come unglued after taking jabs at his rally crowds supposedly leaving early, the former president's niece, a psychologist, said that her uncle would \"never get over\" the injury to his ego.\"That was a narcissistic injury that he will never get over, actually,\" Mary Trump said. \"He will continue to defend himself against that even if he never says a word about it again. That is how thin-skinned he is, that is how incredibly fragile his ego is.\"\"So, that was one of the most gratifying things about Vice President Harris' brilliant performance last night,\" she continued. \"She was able to have substantive conversations about the issues while also baiting him so exquisitely.\"Newsweek reached out for comment to Donald Trump's office via email on Wednesday night.During the debate, the ex-president appeared to lose his cool after Harris asked the audience to \"attend one of Donald Trump's rallies\" to observe a variety of bizarre remarks from Trump and his supporters leaving the events \"early out of exhaustion and boredom.\"\"People don't go to her rallies, there's no reason to go,\" a defensive Trump said in response. \"People don't leave my rallies. We have the biggest rallies, the most incredible rallies in the history of politics.\"Mary Trump predicted during her MSNBC appearance that Donald Trump's reactions to Harris' attacks would only \"get worse,\" suggesting that the former president would be unable to react in any way other than attempting \"to dominate from a position of extraordinary weakness.\"The former president's niece also warned that her uncle and his allies would attempt to \"cheat\" in November if they thought that Harris was likely to hand him his second consecutive defeat in a presidential election.\"In light of his resounding defeat last night, he knows he might be going down,\" Mary Trump said. \"And if he feels that that's the case, he will take all of us down with him, and we need to be vigilant.\"\"It means that he and those around him, and his enablers in the Republican Party, will do their best to cheat in this election,\" she added. \"We've already seen it, he's already pre-rigging it by calling into question results we don't even have yet.\"Trump's campaign communications director, Steven Cheung, told Newsweek previously that \"Trump Derangement Syndrome is a serious issue and some people like [Mary Trump] need to get checked out.\"","summary":"Mary Trump said that her estranged uncle suffered a \"resounding defeat\" in his debate with Vice President Kamala Harris.","url":"https://www.newsweek.com/mary-donald-trump-reveals-injury-harris-debate-1952430","image":"https://d.newsweek.com/en/full/2469453/donald-trump-mary-trump-narcissistic-injury-debate.jpg","video":null,"publish_date":"2024-09-12 00:15:51","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.376},{"id":256207092,"title":"Vance says Americans won’t be swayed by ‘billionaire celebrity’ Swift’s endorsement (who is his running mate again?)","text":"Someone at the Republican National Committee should slip JD Vance a biography of his running mate because he doesn’t seem to know how Donald Trump has marketed himself for decades. After the former president “decisively lost” the presidential debate against Kamala Harris — as Fox News host Neil Cavuto put it — followed quickly by a ringing endorsement of the Democratic ticket by Taylor Swift, Republicans have been left trying to find a positive spin on the one-two punch. Step forward vice presidential nominee and Ohio senator Vance, who sat down for an interview with Martha MacCallum, also of Fox News. Referencing the endorsement of the Harris-Walz ticket by Swift — perhaps the most influential recording artist in the world — MacCallum asked Vance how the campaign would speak to women voters who care about what she thinks. The Ohio senator replied: “We admire Taylor Swift’s music, but I don’t think most Americans, whether they like her music or not, are going to be influenced by a billionaire celebrity who I think is fundamentally disconnected from the interests and the problems of most Americans.” Given that Trump has spent more than 40 years cultivating an image as a “billionaire celebrity,” who as a politician is often characterized as being out of touch with most Americans, only running to return to the White House out of self-interest, and whose economic platform benefits billionaires to the detriment of the majority of the population, this was — to put it mildly — tone-deaf. In his two months as Trump’s running mate, Vance has already caused the Trump campaign headaches with uncovered audio about “childless cat ladies,” a toe-curlingly awkward interaction at a donut store, and for publicizing a disproven fringe conspiracy about immigrants eating pets that Trump then repeated before a national audience to widespread ridicule. Indeed, Swift’s endorsement post on Instagram even took a direct shot at Vance, when she signed off the reasoning for her choice of candidate with: “With love and hope, Taylor Swift, Childless Cat Lady.” The Ohio senator made the comments on Fox while in New York City for the September 11 commemorations at which he appeared alongside Trump, Harris, and President Joe Biden. Later in the day, Harris, Biden, and Trump (separately) also visited Shanksville, Pennsylvania, the sight of the Flight 93 National Memorial, with the president and vice president continuing to a wreath-laying ceremony at the Pentagon in Virginia. Vance remained in New York and was later seen joined by his wife Usha taking a walk in Central Park. The couple were spotted, surrounded by their Secret Service detail, walking near the Bethesda Fountain. Earlier, Vance attended the Cantor Fitzgerald Relief Fund Charity Day 2024 which commemorates the 658 employees of the company who perished on September 11. Other celebrity ambassadors appearing on the trading floor included Bill Clinton and daughter Chelsea, Kenan Thompson, Neve Campbell, Rob Gronkowski, and Busy Philipps.","summary":"Ohio senator JD Vance made remarks amid commemorative events in New York City before taking time off with his wife Usha Vance","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-taylor-swift-vance-billionaire-b2611323.html","image":"https://static.independent.co.uk/2024/09/12/00/SEI221160946.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/KX6UTp8D-4VHSaSK0.mp4","publish_date":"2024-09-12 00:13:01","author":"Oliver O'connell","authors":["Oliver O'connell"],"language":"en","source_country":"gb","sentiment":-0.228},{"id":256207162,"title":"With Debate Over, Focus Shifts to Its Impact on Undecided Voters","text":"With the first debate between Vice President Kamala Harris and former President Donald Trump now concluded, attention has turned to its potential impact on undecided voters as the 2024 campaign enters its home stretch. Following the debate, both campaigns were quick to declare victory. While commentators have taken sides on who performed better in the debate, the jury is still out on whether undecided voters were swayed one way or the other. “Typically, debates do not seem to have much of a lasting effect on vote choice,” Karen Hult, a political science professor at Virginia Tech, told The Epoch Times. Meanwhile, the Harris campaign issued a statement calling for another round in October. “The ABC moderators did everything to help Harris, it was disgraceful,” Ford O'Connell, a Republican strategist told The Epoch Times after watching the debate. Trump’s close allies agreed. However, they also criticized the former president for not pressing Harris enough on key issues such as inflation. Sen. Lindsey Graham (R-S.C.) told reporters after the debate that it was “a missed opportunity” for Trump not to challenge her. She recently faced criticism for changing her stance on key issues, including fracking and the border wall. In response, Harris sought to use the debate stage to promote her plans. Several times, she responded to questions by listing recently announced proposals, such as providing a $50,000 tax break for startups, an expanded child tax credit, and a $25,000 assistance payment for first-time homebuyers. “I am offering what I describe as an opportunity economy,” Harris said during the debate. Pennsylvania Gov. Josh Shapiro praised Harris’s performance. “I think a lot of undecided voters care about the economy,” he said. “I thought her plans to reduce the burden on small businesses spoke to them.” However, critics argue that she offered no additional details on her plans. After hearing the endorsement, Sen. Chris Murphy (D-Conn.) said that Swift’s announcement was “a cherry on top of a very good night for Kamala Harris.” However, some Democrats including Murphy acknowledge that the presidential race is likely to remain tight until the end. “I think the debate should move millions of votes. It probably won’t,” Murphy told The Epoch Times. “This race is probably going to be close to the end, but if this debate moved tens of thousands of votes, that may be the margin between victory and defeat in the end.”","summary":"The first Harris-Trump debate won't move millions of votes as the race is expected to be tight until the end, a Democratic senator says.","url":"https://www.theepochtimes.com/us/with-debate-over-focus-shifts-to-its-impact-on-undecided-voters-5722629","image":"https://img.theepochtimes.com/assets/uploads/2024/09/11/id5722501-DSC4075-debate-trump-kamala-300x180.jpg","video":null,"publish_date":"2024-09-12 00:12:22","author":"Emel Akan","authors":["Emel Akan"],"language":"en","source_country":"us","sentiment":0.026},{"id":256206756,"title":"GOP Sen. Mitt Romney praises Kamala Harris’ debate performance: ‘Intelligent, capable person’","text":"Sen. Mitt Romney (R-Utah) praised Vice President Kamala Harris’ debate performance Wednesday, arguing that the Democratic nominee demonstrated that she is “intelligent” and “capable” in her first showdown against former President Donald Trump. Romney, a longtime Trump critic who has refused to vote for the GOP nominee for president going back to 2016, told reporters on Capitol Hill that the ABC News debate proved Harris can “answer questions from the media.” “Those were answered well. She spoke well and clearly and I think she prosecuted her case well,” the Utah Republican said. Romney, who lost the 2012 White House race to former President Barack Obama, argued that Harris made the most of her opportunity to distinguish herself from Trump before some 58 million viewers. “Most people didn’t know her terribly well other than a few clips that were not flattering, that you might see on the internet,” Romney said. “And people saw, actually, she’s an intelligent, capable person who has a point of view on issues,” he added. “And she actually demonstrated that time and again.” Meanwhile, the former Massachusetts governor argued that Trump’s performance was just that — “a performance.” “This was classic President Trump,” Romney said. “President Trump prosecuted his case as he wanted to,” he added. Harris, 59, invoked Romey’s name at one point in the debate, touting having the support of “200 Republicans who have formerly worked with President [George W] Bush, Mitt Romney, and John McCain.” Romney himself hasn’t endorsed Harris but declared earlier this year that he would “absolutely not” be voting for Trump. “With President Trump, it’s a matter of personal character,” the 77-year-old senator said of the GOP nominee in June. “I draw a line and say when someone has been actually found to have been sexually assaulting, that’s something I just won’t cross over in the person I would want to have as president of the United States.” Last month, Harris pledged to appoint a Republican to her Cabinet, if elected, in her only sitdown interview since replacing President Biden on the Democratic ticket. Some anti-Trump Republicans “hope” it will be Romney. “We hope that [Harris] invites [Romney] to serve in some capacity if she wins,” Haley Voters for Harris, a political action committee backing Harris in the election, wrote on X. “Whether he endorses her or not, he is a patriot who believes in a strong America and answers the call of service,” the group of former Nikki Haley supporters added.","summary":"“This was classic President Trump -- a performance,” Romney said of the former president's debate showing.","url":"https://nypost.com/2024/09/11/us-news/gop-sen-mitt-romney-praises-kamala-harris-debate-performance/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/2021-washington-dc-senate-expected-89479177.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/k8XXuIT3-RyIcpnTz.mp4","publish_date":"2024-09-12 00:12:22","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.115},{"id":256207174,"title":"Reflecting on first debate between Harris and Trump","text":"Reflecting on first debate between Harris and Trump Former President Donald Trump and Vice President Kamala Harris faced off Tuesday for a debate filled with acrimony and arguments over policy. CBS News chief Washington correspondent Major Garrett reflects.","summary":"Former President Donald Trump and Vice President Kamala Harris faced off Tuesday for a debate filled with acrimony and arguments over policy. CBS News chief Washington correspondent Major Garrett reflects.","url":"https://www.cbsnews.com/video/reflecting-on-first-debate-between-harris-and-trump/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/12/a2ad9ed5-220c-4052-a81a-0ff503ebd82b/thumbnail/1200x630/76dbbb9344923aefc111c73f867e3956/cbsn-fusion-reflecting-on-first-debate-between-harris-and-trump-thumbnail.jpg?v=eed8fba9acd13199742a248f804168a1","video":null,"publish_date":"2024-09-12 00:12:00","author":null,"language":"en","source_country":"US","sentiment":0.094},{"id":256207396,"title":"Taylor Swift at the 2024 VMAs: Photos of the Pop Star’s Red Carpet Outfit","text":"Taylor Swift really said, “Are you ready for it?” while rolling up to the 2024 MTV Video Music Awards red carpet. As she arrived to the red carpet at New York’s UBS Arena on Wednesday, September 11, the “Karma” hitmaker, 34, was dressed in a fierce look — a contrast to some of her past sparkling, sequined VMAs outfits over the years. The international pop icon’s outfit featured a yellow and black plaid top with a matching train, black high-waisted shorts, matching leather gloves and coordinating thigh-high heeled boots. As for her makeup, Taylor went for a smokey winged eye shadow and wore her hair down in natural waves. Taylor leads this year’s VMAs nominees list with a total of 12 nominations. Her presence at this year’s awards show comes just hours after she made headlines for endorsing Vice President Kamala Harris amid the 2024 election. On Tuesday, September 10, the “You Need to Calm Down” hitmaker penned a lengthy statement via Instagram, explaining why she was endorsing the Democrat over the Republican candidate, Donald Trump. “Like many of you, I watched the debate tonight,” Taylor wrote. “If you haven’t already, now is a great time to do your research on the issues at hand and the stances these candidates take on the topics that matter to you the most. As a voter, I make sure to watch and read everything I can about their proposed policies and plans for this country.” While pointing out that she’s “done [her] research” and has “made [her] choice,” Taylor explained that she is voting for Kamala, 59, “because she fights for the rights and causes I believe need a warrior to champion them.” “I think she is a steady-handed, gifted leader, and I believe we can accomplish so much more in this country if we are led by calm and not chaos,” the Grammy Award winner continued, before mentioning Kamala’s running mate, Tim Walz. “I was so heartened and impressed by her selection of running mate @timwalz, who has been standing up for LGBTQ+ rights, IVF, and a woman’s right to her own body for decades.” Elsewhere in her post, Taylor blasted Donald, 78, and his team for posting AI-generated images of her over the summer, making it seem as if she had endorsed him. “Recently, I was made aware that AI of ‘me’ falsely endorsing Donald Trump’s presidential run was posted to his site,” the Pennsylvania native noted, before adding, “It really conjured up my fears around AI, and the dangers of spreading misinformation.” The AI images of Taylor, in turn, “brought [her] to the conclusion that [she needed] to be very transparent about [her] actual plans for this election as a voter,” the pop star concluded in her caption, adding, “The simplest way to combat misinformation is with the truth.” In response to Taylor’s public statement, Donald said that she’s “pay the price” for her choice.","summary":"Just hours after the pop star made headlines for her presidential endorsement, she attended the VMAs in a fierce outfit.","url":"https://hollywoodlife.com/feature/taylor-swift-at-the-2024-vmas-photos-5319436/","image":"https://hollywoodlife.com/wp-content/uploads/2024/09/GettyImages-2171411493_e7a9c0-e1726099605335.jpeg?fit=4000%2C2260","video":null,"publish_date":"2024-09-12 00:11:10","author":"Elisabeth McGowan","authors":["Elisabeth McGowan"],"language":"en","catgory":"entertainment","source_country":"US","sentiment":0.413},{"id":256206716,"title":"Taylor Swift Puts a Sexy Twist on Plaid in Corseted, Vampy Look at 2024 MTV VMAs - and It's Giving “Reputation”","text":"Taylor Swift is continuing her show-stopping style hot streak at the 2024 VMAs! The chart-topper commanded the red carpet at this year's MTV Video Music Awards in one of her most mesmerizing — and daring — looks yet. Putting a completely sexy spin on her love of all things prep, Swift teamed a yellow plaid corset with an attached skirt with black hot pants, thigh-high boots and bicep-length caged gloves. She topped the look with extra vampy glam (the smoky eye!) and even ditch her signature red lip. Her hair was styled with mess, textured waves and side-swept bangs. And of course she was bejeweled, wearing 30-carat Lorraine Schwartz pear shape canary yellow diamond earrings surrounded by black Jade to play up the the yellow plaid. Swift scored the most nominations of any artist this year with 12, including artist of the year, video of the year and song of the year. Her \"Fortnight\" collaborator Post Malone trails her with nine noms. Last year, fans were calling out Swift for serving Reputation vibes with her look (she's yet to announce her re-recording of the album) when she arrived at the event in a skin-baring Versace gown featuring a thigh-high slit and gold buttons along the ruched bodice. She topped off her look with layers of necklaces and black stilettos, even skipping her signature red lip for a natural, mauve-y shade. At the time, Versace's Creative Director Donatella Versace shared a sweet note on Instagram about creating the look for her. She wrote, \"@taylorswift, I couldn't have been prouder to design this dress for your gorgeous entrance to the VMAs tonight. You have dominated the world with your tour and your music is timeless. You're already winning big tonight! Love you ♥️\" In 2022, Swift famously made a surprise appearance in a crystal-covered Oscar de la Renta minidress featuring an open back. She paired the glittering design (and made the whole carpet shimmer) with matching Christian Louboutin heels, Lorraine Schwartz jewels and her signature red lip. Check out all of PEOPLE's full MTV VMAs coverage here. Swift tapped beauty icon Pat McGrath for her makeup moment. McGrath called the singer her \"angel\" on Instagram. The 2024 VMAs comes on the heels of a very busy week for the star, who is on hiatus from her history-making Eras tour until October. She kicked off NFL season at boyfriend Travis Kelce's opening game in Kansas City on Sept. 5, wearing a head-turning denim of denim look (including Versace bustier and Grlfrnd denim short-shorts) and thigh-high Giuseppe Zanotti boots. That moment kicked off a string of chic date night looks from the star, including a dreamy dress moment at model Karen Elson's wedding and a preppy red gingham Reformation mini dress at the US Open on Sunday alongside a Gucci-clad Kelce. Swift has also been focusing on interacting with fans during her tour hiatus and outlining what's important to her — like getting out to vote. Following Tuesday's presidential debate, the pop icon announced on social media that she was endorsing Kamala Harris for president. \"I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election,\" she wrote alongside a photo of herself holding her cat Benjamin. \"I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them. I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos. I was so heartened and impressed by her selection of running mate @timwalz, who has been standing up for LGBTQ+ rights, IVF, and a woman’s right to her own body for decades.\" She proudly (and famously) signed the note, \"Childless Cat Lady.\" The 2024 MTV VMAs air on Sept. 11 at 8 p.m. ET/ PT live from the UBS Arena in New York.","summary":"Swift, who is up for 12 VMA nominations, made a jaw-dropping appearance on the red carpet — all about her look","url":"https://people.com/mtv-vmas-2024-taylor-swift-puts-sexy-twist-on-plaid-red-carpet-outfit-photos-details-8710455","image":"https://people.com/thmb/jGVI0PEi-rxdjinM3IIWwrhdP5A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/TaylorSwift-vmas-2024-arrivals2-51c7be72f5f34b8db96219aed9e2cc2b.jpg","video":null,"publish_date":"2024-09-12 00:05:58","author":"Brittany Talarico","authors":["Brittany Talarico"],"language":"en","source_country":"US","sentiment":0.696},{"id":256206570,"title":"Trump, Harris enter home stretch of 2024 election with uncertainty shrouding possible future debates","text":"(The Center Square) – Former President Donald Trump and Vice President Kamala Harris are less than eight weeks away from election day, and whether they will debate again remains in question. The two faced off for their first-ever debate Tuesday night at the National Constitution Center in Philadelphia. Before this week’s debate, neither campaign had agreed to another debate. Harris’ campaign released a statement welcoming a second debate, but whether Trump’s team feels the same, and whether the two camps can agree on the network to host and the details of the debate remain major question marks. “In the World of Boxing or UFC, when a Fighter gets beaten or knocked out, they get up and scream, ‘I DEMAND A REMATCH, I DEMAND A REMATCH!’ Well, it’s no different with a Debate,” Trump wrote on TruthSocial Wednesday morning. “She was beaten badly last night. Every Poll has us WINNING, in one case, 92-8, so why would I do a Rematch?” Tuesday’s debate hit on a broad range of topics – from the economy to immigration to healthcare and overseas conflicts – and featured a plethora of jabs from both candidates. “There’s no denying that Vice President Harris had a solid performance and was prepared and well-rehearsed,” Colin Reed, a Republican political strategist, told The Center Square. Catch up on The Post’s debate coverage Kamala Harris’ dismissive laugh on full display in first presidential debate with Trump Taylor Swift endorses Kamala Harris minutes after presidential debate: ‘I’ve made my choice’ Read Trump’s and Harris’ closing statements from their first presidential debate Harris campaign calls for second debate after Trump’s performance is panned by critics Trump refers to Kamala Harris’ 2020 viral ‘I’m speaking’ moment in presidential debate: ‘Does that sound familiar?’ Harris tries to pin Project 2025 on Trump during first minutes of presidential debate Trump claims Harris supports abortions in the ‘ninth month — and she doesn’t deny it during presidential debate’ Everything to know about the Donald Trump-Kamala Harris presidential debate Several analysts said that Trump missed opportunities to hold Harris accountable for her changes to past stances and her general lack of details on policy issues. Harris was able to bait Trump with comments about the crowd size at his rallies, valuable time when Trump was supposed to be discussing immigration, a generally weak issue for Harris. “The remaining questions are what impact the debate will have by the time voters go to the polls, and whether she sufficiently made the case to the American public about her vision for the country, which to date, has been marked by vague policy pronouncements and contradictions with her past statements,” Reed continued. Those contradictions in question include Harris’ past statements about banning fracking, a topic that received little attention at the debate in Pennsylvania, a state where fracking and affordable energy are a key political issue. Trump touted his performance at the debate while taking a shot at ABC moderators David Muir and Linsey Davis. “I thought that was my best Debate, EVER, especially since it was THREE ON ONE!” Trump said online immediately after the debate. The moderators did take fire from others besides Trump, including critics who pointed out that while they aggressively fact-checked Trump, they were far less aggressive with Harris. “The moderators didn’t fact check Kamala Harris on Project 2025,” author and Manhattan Institute Senior Fellow Abigail Shrier wrote on X during the debate, referring to how Trump has repeatedly disavowed the project. “The moderators didn’t fact check Kamala Harris on IVF. They just fact-checked Trump for the fourth time.” Notably, Taylor Swift endorsed Harris after the debate, a boon to the Harris campaign, though its utility was questioned by Republicans who have often dismissed endorsements by stars in Hollywood and elsewhere as out of touch. “I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election,” Swift wrote on Instagram. “I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them. I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos.” Swift signed the post “childless cat lady,” an apparent reference to 2021 remarks where Trump’s running mate, Ohio Sen. J.D. Vance, said the Democratic party was in large part run by miserable, childless cat ladies. Whether the debate or Swift’s endorsement will actually move the needle in this race remains to be seen. For now, polling shows the two in a dead tie nationally and in the key swing states. “Kamala Harris is being trained like an actress – lights, cameras, memorized lines – so she can ‘win’ the debate and act her way through this election,” Former Democratic lawmaker Tulsi Gabbard wrote on X. “But we’re not choosing the lead in a movie; we’re choosing our Commander-in-Chief. As citizens and voters, we need to recognize our solemn responsibility in this regard.”","summary":"The two faced off for their first-ever debate Tuesday night at the National Constitution Center in Philadelphia. Before this week's debate, neither campaign had agreed to another debate.","url":"https://nypost.com/2024/09/11/us-news/trump-harris-enter-the-home-stretch-with-question-marks-around-next-debate/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/89479528.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-09-12 00:05:13","author":"The Center Square","authors":["The Center Square"],"language":"en","source_country":"us","sentiment":0.119},{"id":256206600,"title":"Letters to the Editor, Sept. 12, 2024","text":"It’s interesting that all the opinions are about replacing Justin Trudeau. Every voter should remember that every sitting Liberal MP is complicit in creating the mess that Canada finds itself in today! If you have a Liberal MP, remember that he/she has done nothing to save this sinking ship. You may think he/she is great. Think again! Ross Copas Tweed, Ont. (There are going to be many Liberal MPs who won’t be returning to the House of Commons after the next election. Many of them know that and are not seeking re-election) EVER CHANGING VIEWS I hear so much about Kamala Harris and her ever-evolving views. In 2019, she was for banning plastic straws, against fracking, defunding police. Now that these views could result in an election loss, all of a sudden her views have “evolved.” Most people I know have opinions that remain pretty solid. Many politicians do what is necessary to win, and their views be damned. People, don’t be fooled by the new evolving — they are just lies now!","summary":"JUSTIN’S MPs It&#8217;s interesting that all the opinions are about replacing Justin Trudeau. Every voter should remember that every sitting Liberal MP is complicit in creating the mess that Canada finds itself in today! If you have a Liberal MP, remember that he/she has done nothing to save this sinking ship. You may think he/she [&#8230;]","url":"https://torontosun.com/opinion/letters/letters-to-the-editor-sept-12-2024","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/01/Thursday-letters.jpg","video":null,"publish_date":"2024-09-12 00:01:45","author":"Postmedia News","authors":["Postmedia News"],"language":"en","source_country":"ca","sentiment":-0.437},{"id":256206534,"title":"Chuck Todd says Biden 'could have never' performed like Kamala Harris did during the debate","text":"NBC’s Chuck Todd applauded Vice President Kamala Harris on Wednesday for how she handled the presidential debate against former President Trump, arguing she outperformed her predecessor, President Biden. \"It is fascinating to me that how the Harris campaign has — has decided to take Trump on, belittle him, make him small. He’s not this menacing figure that — that is threatening to destroy America the way Joe Biden was painting him or, to a lesser extent, even Hillary Clinton,\" Todd said on MSNBC's \"Andrea Mitchell Reports.\" \"Like this is — and this is borrowing a page from how Barack Obama dealt with Donald Trump. Now granted, Obama never actually faced him in a campaign, but it was — it was a belittling. It was the whole Gary Busey shot.\" \"This stuff does get under his skin,\" Todd said. \"He can’t handle it. And we’re seeing—I mean, this is why I—if I were in the LaCivita/Wiles shoes I would not put him up against her again, because the abortion contrast alone. And that’s the most important thing about this debate.\" KAMALA HARRIS, DONALD TRUMP FACE OFF IN BATTLEGROUND PENNSYLVANIA FOR FIRST PRESIDENTIAL DEBATE \"He disagreed with J.D. Vance,\" host Andrea Mitchell said. \"It is the most important part of this debate. He gave that unforced error in that answer,\" Todd replied. \"Joe Biden could have never done what Kamala Harris did. And that’s why Joe Biden couldn’t win this election\" due to alleged discomfort with the abortion issue. \"What she said, talking about humanizing it, Joe Biden couldn’t even bring himself to utter the words ‘abortion ban’ and she called them Trump abortion bans.\" FOX NEWS TOP TALENT REACT TO ABC PRESIDENTIAL DEBATE Todd also underlined how Harris outperformed Biden on the debate stage. \"I think of all of the back and forth, this was the most substantive, and this was a reminder, I think, of why so many Democrats were convinced Biden didn’t have what it took to win this campaign, because you needed to make reproductive rights among the front and center issues,\" the political analyst said. \"He was uncomfortable speaking about it, you could tell. I mean, I’m just thinking about just the anecdote she shared. Joe Biden never would have been able to bring himself to share that anecdote.\" ABC has been widely criticized for how it moderated the debate, in particular Linsey Davis' controversial \"fact-check\" against Trump about abortion. CLICK HERE TO GET THE FOX NEWS APP Trump had spoken about abortions performed in the ninth month of pregnancy. He referred to former Virginia Democratic Gov. Ralph Northam's infamous comments on third-trimester abortions. \"The infant would be delivered. The infant would be kept comfortable. The infant would be resuscitated if that’s what the mother and the family desired, and then a discussion would ensue between the physicians and the mother,\" Northam said at the time.","summary":"NBC analyst Chuck Todd argued that a particular exchange in the debate shows how President Biden could not have beaten Trump, whereas Vice president Kamala Harris can.","url":"https://www.foxnews.com/media/chuck-todd-says-biden-could-have-never-performed-like-kamala-harris-did-during-debate","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/Chuck-Todd-on-Biden-Harris.png?ve=1&tl=1","video":null,"publish_date":"2024-09-12 00:00:19","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","source_country":"US","sentiment":-0.105},{"id":256207486,"title":"Taylor Swift, Post Malone win first award at the 2024 MTV Video Music Awards. Will she make history?","text":"NEW YORK (AP) — Taylor Swift and Post Malone took home the first award at the 2024 MTV Video Music Awards, for best collaboration, handed to them by Flavor Flav and Olympian Jordan Chiles. Swift started her speech by giving remembrance to everyone who lost their lives and loved ones during 9/11, 23 years ago, before discussing Malone. “There is a reason Post Malone is everyone in music’s favorite person to collaborate with,” she shifted her attention to him. “It has taken forever for me to get him to stop calling me ma’am.” An army of Slim Shady-lookalikes followed Eminem as he kicked off the VMAs , launching into a medley of his hits “Houdini” and “Somebody Save Me,” featuring a broadcast feed of Jelly Roll. (The song references Jelly Roll’s massive country radio hit, “Save Me.”) Megan Thee Stallion welcomed the crowd as a first-time host Wednesday night, who joked that the VMAs now stands for the “voluptuous Megan awards.” Then Karol G took over, for a fiery performance of her hit, “Si Antes Te Hubiera Conocido.” The VMAs began at 8 p.m. Eastern and are being held at the UBS Arena on New York’s Long Island. The night is stacked celebrities and promises a lot more Swift, who arrived at the award show wearing a green tartan corset with a matching train and long black leather gloves. It could be a big one for her. Will she become the most-awarded musician in VMAs history? The pop star leads the nominations with 12 — eight for her “Fortnight” music video, two social categories and nods in the best pop and artist of the year categories. She’s followed by her “Fortnight” collaborator Post Malone, who has 11. He is nominated along with Swift 10 times and earned his 11th nom for his country hit “I Had Some Help,” featuring Morgan Wallen. Winning would give Swift a prominent stage to voice support for Kamala Harris’ presidential bid. Swift endorsed the vice president Tuesday night, moments after Harris’ debate with former president Donald Trump ended. Shaboozey reacted to her endorsement on the VMAs red carpet, telling The Associated Press, “I think you just do you, you know? Do what you’re feel in your heart. Just be honest with yourself,” he said. “Just walking your truth, you know.” If prior years are any indication, Swift may make multiple speeches. She took home nine VMAs last year, bringing her total to an impressive 23. That places her just behind Beyoncé, who has 30 and just ahead of Madonna, who has 20 awards. Lady Gaga, has 19. Seven Swift wins would tie Beyoncé’s record, and if she wins eight, she could become the most awarded musician in VMA history. That is, if Beyoncé doesn’t take home any of her own trophies. She’s up for song of the year (“Texas Hold ‘Em”) and two social categories. Katy Perry will receive the Video Vanguard Award and also perform. Previous recipients include Shakira, Beyoncé, Minaj, Madonna, Janet Jackson, Jennifer Lopez, Rihanna and Missy Elliott. Other scheduled performers include Benson Boone, Sabrina Carpenter, Megan Thee Stallion, Chappell Roan, GloRilla, Halsey, Lenny Kravitz, LISA, Rauw Alejandro, LL COOL J, Shawn Mendes, Camila Cabello and Anitta, who will be joined by Fat Joe, DJ Khaled and Tiago PZK. The VMAs are airing on MTV and simulcast on BET, BET Her, CMT, Comedy Central, Logo, MTV, MTV2, Nick at Nite, Paramount Network, Pop, TV Land, VH1, and in Spanish on Univision.","summary":"Swift leads the nominations with 12 — eight for her “Fortnight” music video, two social categories and nods in the best pop and artist of the year categories.","url":"https://www.thestar.com/wires/entertainment/taylor-swift-post-malone-win-first-award-at-the-2024-mtv-video-music-awards-will/article_a085172e-edbc-5653-88df-2da5a71c045d.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/e/30/e3075fc2-709b-11ef-9ca1-7ff307718b6e/66e23253e2f88.image.jpg?crop=1696%2C890%2C0%2C165&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2024-09-12 00:00:00","author":"Maria Sherman The Associated Press,Wire Content","authors":["Maria Sherman The Associated Press","Wire Content"],"language":"en","catgory":"entertainment","source_country":"CA","sentiment":0.452},{"id":256206286,"title":"Taylor Swift’s Kamala Harris Endorsement Post Has Directed Nearly 338,000 People to Vote.gov","text":"The Taylor Swift effect has taken hold of politics. After announcing her endorsement of Kamala Harris for president after the Tuesday (Sept. 10) presidential debate, Swift then shared a link to Vote.gov in an Instagram story. A spokesperson for the U.S. General Services Commission, an independent U.S. government agency that supports various other federal agencies, confirmed to Billboard that as of 2 p.m. ET on Wednesday (Sept. 11) — 15 hours after Swift’s post — 337,826 visitors were referred to Vote.gov from the custom URL created and shared by the pop star. Vote.gov directs voters to their state election websites for state-specific voting information. Voters must then register to vote directly with their state. The site uses data analytic tools to monitor referrals to the site, including referrals from custom links like the one used by Swift. In a post shared with her 238 million followers after the end of the first debate between Vice President Harris and former President Donald Trump, Swift expressed her admiration for Harris, calling her a “steady-handed, gifted leader” and a “warrior” for causes she holds dear, such as LGBTQ+ rights and women’s reproductive freedoms. “Like many of you, I watched the debate tonight,” the post also read. “If you haven’t already, now is a great time to do your research on the issues at hand and the stances these candidates take on the topics that matter to you the most. As a voter, I make sure to watch and read everything I can about their proposed policies and plans for this country.” The Harris campaign quickly capitalized on Swift’s endorsement, putting Harris-Walz friendship bracelets up for sale in its online store after the endorsement. (These bracelets subsequently sold out.) This style of bracelet has become a staple in Swiftie culture since the beginning of The Eras Tour. During an interview with MSNBC’s Rachel Maddow, Democratic vice presidential candidate Walz said, “I am incredibly grateful, first of all, to Taylor Swift. That was eloquent, and that’s the type of courage we need in America to stand up.”","summary":"The Taylor Swift effect has taken hold of politics. After announcing her endorsement of Kamala Harris for president after the Tuesday (Sept. 10) presidential debate, Swift then shared a link to Vote.gov in an Instagram story. A spokesperson for the U.S. General Services Commission, an independent U.S. government agency that supports various other federal agencies, &#8230;\n\n\nThe post Taylor Swift’s Kamala Harris Endorsement Post Has Directed Nearly 338,000 People to Vote.gov appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/taylor-swifts-kamala-harris-endorsement-post-has-directed-nearly-338000-people-to-vote-gov/","image":"https://www.billboard.com/wp-content/uploads/2024/08/taylor-swift-eras-tour-wembley-8-15-2024-billboard-gp-1548.jpg?w=1024","video":null,"publish_date":"2024-09-11 23:57:23","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.239},{"id":256206266,"title":"Trump falsely claims Democrats support abortions \"after birth\"","text":"Former President Donald Trump falsely claimed during Tuesday night's presidential debate that Vice President Kamala Harris' running mate, Minnesota Gov. Tim Walz, supports the \"execution\" of babies after they are born, repeating earlier false assertions that Democrats support killing babies. The Republican nominee made the claim when ABC moderator Linsey Davis asked why he changed his position to support Florida's six-week abortion ban. \"Her vice presidential pick says abortion in the ninth month is absolutely fine. He also says execution after birth — it's execution, no longer abortion, because the baby is born — is OK,\" Trump said. Infanticide is illegal in every state, and Harris and Walz have never supported it. Here's what we know about the claim and where Harris and Walz stand on abortion.A history of false claimsTrump has a history of falsely claiming that Democrats support killing babies after birth. At a recent rally in Charlotte, Trump said Harris supports abortion \"right up until birth, and even after birth.\"During the debate, Trump repeated a similar claim and referenced, at different points, the \"former governor of Virginia\" and the \"former governor of West Virginia,\" who, Trump asserted, \"said we put the baby aside and then we determine what we want to do with the baby.\"Trump appeared to be talking about former Virginia Gov. Ralph Northam, a Democrat and a physician, who gave a 2019 radio interview in which he discussed a hypothetical scenario in which a fetus has severe deformities or is not viable outside the womb. In such a case, Northam said, \"the infant would be delivered, the infant would be kept comfortable, the infant would be resuscitated if that's what the mother and the family desired.\" The comments sparked fierce backlash from Republicans, including then-chairwoman of the Republican National Committee, Ronna McDaniel, who accused Northam of supporting \"born-alive abortions.\" In response, Northam said, \"I have devoted my life to caring for children and any insinuation otherwise is shameful and disgusting.\"Walz and Harris on abortionVice President Harris has supported restoring the standards of Roe v. Wade, which protected the right to an abortion until the fetus reaches viability outside the womb, typically at around six months of gestation. The Biden-Harris administration endorsed the Women's Health Protection Act of 2022, which would have prevented states from banning abortions before viability or requiring additional tests or waiting periods, though the legislation did not pass the Senate.In recent interviews on \"Face the Nation,\" both Harris and Walz declined to give specifics about how far into a pregnancy they believe abortions should be permitted.Asked about it during the debate, Harris said: \"I absolutely support reinstating the protections of Roe v. Wade. And as you rightly mentioned, nowhere in America is a woman carrying a pregnancy to term and asking for an abortion. That is not happening.\"As governor, Walz signed the Protect Reproductive Options Act (PRO Act) in 2023, codifying abortion access in Minnesota. It's one of the few states in the country that does not prohibit abortions past the stage of viability. According to the CDC's most recent data, less than 1% of abortions nationally occur past 20 weeks of pregnancy. In Minnesota, data from the state Department of Health showed that in 2022, only two abortions occurred between 25 and 30 weeks and none after 30 weeks. Late-term abortions typically occur to save the mother's life or when families are facing situations where the fetus is unlikely to survive long after birth.Trump on abortionThroughout his campaign, Trump has highlighted his appointment of three conservative justices to the U.S. Supreme Court, which led to the overturning of Roe v. Wade and the end of the constitutional right to abortion. As president, Trump supported legislation that included a federal 20-week ban on abortion, with some exceptions. However, during the 2024 presidential campaign, Trump has told reporters he would not sign a federal ban and said each state should be able to restrict abortion as they choose.Trump said on Aug. 30 that he'll vote to uphold Florida's six-week abortion ban. His statement on that came just a day after he criticized the law in an interview and faced blowback from abortion opponents. Florida has a proposition on the November ballot to protect abortion rights before fetal viability in the state. It's one of 10 states where the issue of abortion will be on the ballot.","summary":"Infanticide is illegal in every state, and Vice President Kamala Harris and her running mate, Tim Walz, have never supported it.","url":"https://www.cbsnews.com/news/trump-falsely-claims-democrats-support-abortions-after-birth/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/11/53a4f23d-c79b-431d-ad53-ad36e95666da/thumbnail/1200x630g2/92611fca3e80b884be098f944fe201f8/trump-harris-debate2.jpg?v=eed8fba9acd13199742a248f804168a1","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3185439_hls/master.m3u8","publish_date":"2024-09-11 23:49:59","author":"Laura Doan","authors":["Laura Doan"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.312},{"id":256206596,"title":"Harris and Trump at 9/11 ceremony after debate","text":"Harris and Trump at 9/11 ceremony after debate Just hours after the debate between Vice President Kamala Harris and former President Donald Trump, the two met again with a second handshake -- this time in New York City at the 9/11 memorial. Last night in Philadelphia Harris and Trump went head-to-head on some of the top issues, and both candidates continued to make their case after the debate. CBS News' Ed O'Keefe and Fin Gomez have more.","summary":"Just hours after the debate between Vice President Kamala Harris and former President Donald Trump, the two met again with a second handshake -- this time in New York City at the 9/11 memorial. Last night in Philadelphia Harris and Trump went head-to-head on some of the top issues, and both candidates continued to make their case after the debate. CBS News' Ed O'Keefe and Fin Gomez have more.","url":"https://www.cbsnews.com/video/harris-and-trump-at-911-ceremony-after-debate/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/09/11/4f07f30e-ca45-4e3a-b93e-8614f0e37bac/thumbnail/1200x630/fc0f6b4770dd36422036aa6c3555f4db/cbsn-fusion-harris-and-trump-at-911-ceremony-after-debate-thumbnail.jpg?v=eed8fba9acd13199742a248f804168a1","video":null,"publish_date":"2024-09-11 23:47:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.107},{"id":256206182,"title":"Alberto Fujimori, former president of Peru who was convicted for human rights abuses, dies at 86","text":"CTVNews.ca Top Stories Actions speak louder: What experts are saying about the body language in the U.S. presidential debate The highly anticipated debate between Kamala Harris and Donald Trump was a heated matchup that revealed plenty about their plans for America's future, if elected. Here's what experts who analyzed the exchange had to say. 'Buy nothing': PSAC wants federal workers to boycott downtown Ottawa businesses A union representing federal employees is asking its members to bring their own lunch to work, in an apparent retaliation against downtown Ottawa businesses as new return-to-office protocols begin. Inside a Manitoba ghost town, a group of ladies work to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. Carnival cruise ship collides with iceberg The words 'Titanic moment' are possibly the last thing you want to hear on a boat – but that was the phrase used by one passenger on board the Carnival Spirit cruise ship last week, after the vessel unexpectedly struck an iceberg. Dollarama sales peak in second quarter: A sign more Canadians are shopping at discount stores to make ends meet Montreal-based discount retailer, Dollarama, reported a growth in profit and sales in the second quarter, signalling more Canadians are looking for a deal as the cost of living remains high. Trudeau says he 'can't wait' to get into it with Poilievre in Parliament Prime Minister Justin Trudeau says he 'can't wait' to get back to Ottawa to get into it with Pierre Poilievre in the House of Commons, as he makes the case to his own party to put up a united front against the Conservatives. Man, 70, and woman, 71, found shot dead in Montreal apartment, police Montreal police (SPVM) are investigating after a man, 70, and woman, 71, were killed by gunshot wounds in an apartment. Trump suggests he won't debate Harris again, attacks ABC over moderators' fact-checking The morning after Vice President Kamala Harris and former President Donald Trump’s first presidential debate, it is far from clear if Trump will agree to a rematch. 'I'm not going to listen to you': Singh rejects Poilievre's push for early election, sets sights on progressive policy NDP Leader Jagmeet Singh says his party will focus on advancing progressive policies, amid renewed pressure from Conservative Leader Pierre Poilievre to help him bring Prime Minister Justin Trudeau's Liberal minority government down when Parliament resumes next week. Canada Inside a Manitoba ghost town, a group of ladies work to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. 'Buy nothing': PSAC wants federal workers to boycott downtown Ottawa businesses A union representing federal employees is asking its members to bring their own lunch to work, in an apparent retaliation against downtown Ottawa businesses as new return-to-office protocols begin. Famous Winston Churchill portrait, stolen in Ottawa, is found Ottawa's Chateau Laurier hotel says authorities have recovered an iconic photograph of Winston Churchill after it was stolen and replaced with a fake nearly three years ago. Quebec woman wins MAID case to die at home after legal fight with landlord A woman who requested medical assistance in dying (MAID) won a major case in front of the Quebec rental board. She wanted to die at home, but her landlord didn't want her to. 'She was very honourable': Cathy Merrick lies in state at Manitoba legislature The sound of sombre song serenaded the halls of the Manitoba legislature Wednesday as Cathy Merrick's casket was brought in for a closed-door ceremony. Merrick died last Friday and was to lie in state Wednesday afternoon to allow the public to pay their respects. Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. World Actions speak louder: What experts are saying about the body language in the U.S. presidential debate The highly anticipated debate between Kamala Harris and Donald Trump was a heated matchup that revealed plenty about their plans for America's future, if elected. Here's what experts who analyzed the exchange had to say. South Korea says North Korea has fired a ballistic missile toward the sea North Korea fired a ballistic missile toward the sea on Thursday, South Korea’s military said, days after North Korean leader Kim Jong Un vowed to put his nuclear force fully ready for battle with its rivals. Trump suggests he won't debate Harris again, attacks ABC over moderators' fact-checking The morning after Vice President Kamala Harris and former President Donald Trump’s first presidential debate, it is far from clear if Trump will agree to a rematch. Trump falsely accuses immigrants in Ohio of abducting and eating pets Former U.S. president Donald Trump on Tuesday amplified false rumours that Haitian immigrants in Ohio were abducting and eating pets, repeating during a televised debate the type of inflammatory and anti-immigrant rhetoric he has promoted throughout his campaigns. Alberto Fujimori, former president of Peru who was convicted for human rights abuses, dies at 86 Alberto Fujimori, whose decade-long presidency began with triumphs righting Peru’s economy and defeating a brutal insurgency only to end in a disgrace of autocratic excess that later sent him to prison, has died. He was 86. 9/11 anniversary brings Biden, Harris and Trump together at ground zero With presidential candidates looking on, some 9/11 victims' relatives appealed to them Wednesday for accountability as the U.S. marked an anniversary laced with election-season politics. Politics Trudeau says he 'can't wait' to get into it with Poilievre in Parliament Prime Minister Justin Trudeau says he 'can't wait' to get back to Ottawa to get into it with Pierre Poilievre in the House of Commons, as he makes the case to his own party to put up a united front against the Conservatives. 'I'm not going to listen to you': Singh rejects Poilievre's push for early election, sets sights on progressive policy NDP Leader Jagmeet Singh says his party will focus on advancing progressive policies, amid renewed pressure from Conservative Leader Pierre Poilievre to help him bring Prime Minister Justin Trudeau's Liberal minority government down when Parliament resumes next week. Conservatives to push non-confidence motion against Trudeau government Conservative Leader Pierre Poilievre says his party will put forward a non-confidence motion when Parliament resumes 'at the earliest possible opportunity' with the aim of triggering an early federal election. Health Youth mental health worse, especially among girls, pandemic-spanning survey shows According to a survey conducted in both 2019 and 2023, mental health among adolescent girls has gotten worse as they've grown into young adults. Canada to donate 'up to 200,000' doses of mpox vaccine Canada is donating 'up to 200,000' doses of mpox vaccine, a government spokesperson said on Wednesday. The World Health Organization declared mpox a global health emergency last month, for the second time in two years. Quebec woman wins MAID case to die at home after legal fight with landlord A woman who requested medical assistance in dying (MAID) won a major case in front of the Quebec rental board. She wanted to die at home, but her landlord didn't want her to. Sci-Tech Spacewalking is the new domain of the rich as billionaire attempts first private spacewalk First came space tourism. Now comes an even bigger thrill for the monied masses: spacewalking. James Earl Jones' Darth Vader voice lives on through AI. Voice actors see promise and peril in that Over the course of an acting career that spanned more than six decades, James Earl Jones' voice became an indelible piece of his work as a performer. Apple's new AirPods are also hearing aids. Can they really save you thousands of dollars? During its glossy product announcement event on Tuesday, Apple unveiled a new role for its latest AirPods Pro model: medical device. Entertainment Justin Timberlake to enter plea to lesser charge in DWI case Justin Timberlake is expected to enter a plea to a driving while intoxicated charge related to his June arrest in Sag Harbor, N.Y., according to the Suffolk County district attorney’s office. Joe Jonas and Sophie Turner are declared divorced and single A Florida judge has declared Joe Jonas and Sophie Turner divorced and single, signing off on a confidential agreement reached between the two. What to know about Taylor Swift's endorsement of Kamala Harris Music superstar Taylor Swift has officially launched her Kamala Harris era. Business It's now too late to buy travel insurance if Air Canada cancels flights, but this is what to know for the future As many as 110,000 Air Canada passengers could be affected daily if the airline doesn't reach a deal with its pilots' union by Sunday. However, it's too late for flyers to purchase coverage for the flights that could be impacted by a work stoppage. Dollarama sales peak in second quarter: A sign more Canadians are shopping at discount stores to make ends meet Montreal-based discount retailer, Dollarama, reported a growth in profit and sales in the second quarter, signalling more Canadians are looking for a deal as the cost of living remains high. Trump Media slumps as bets on Harris victory rise after presidential debate Shares of Republican candidate Donald Trump's company that owns the Truth Social slumped 14 per cent in busy trading on Wednesday as betting odds of a win for Democratic candidate Kamala Harris grew after a combative U.S. presidential debate. Lifestyle Lotto Max jackpot hits record $75 million, could rise to $80M Starting Friday, Lotto Max draw participants can play for prize of $75 million for the first time ever in Canada. Givenchy names Sarah Burton, designer of Princess of Wales' wedding dress, new creative director Givenchy has named Sarah Burton creative director for women’s and men’s collections, with immediate effect, the fashion house announced on Monday. Resources are out there for LGBTQ2S+ travellers looking to stay safe Do LGBTQ2S+ tourists have a green book-like system for staying safe while travelling in these politically precarious times? They don't have one. They have many. Sports If you build it, they will come: How Manitoba farmers created their own 'Field of Dreams' A hamlet with a population of fewer than 70 residents has successfully brought people back in time to 1989 - the setting, a ‘Field of Dreams’ carved out of cornfields. Tyreek Hill says he could have handled his traffic stop better but he still wants the officer fired Miami Dolphins wide receiver Tyreek Hill acknowledged Wednesday that he could have handled himself better in the initial moments of a weekend traffic stop that left him handcuffed and pulled out of his car by police officers near the team's stadium. Nearly half of women fans in England and Wales suffer sexist abuse at soccer matches Close to half of women soccer fans in England and Wales have personally experienced sexist or misogynistic abuse at matches but most have never reported it to authorities, a new study by anti-discrimination charity Kick It Out revealed on Wednesday. Autos Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. Police nab driver speeding at nearly 3x the limit in Vancouver school zone Nearly two-dozen drivers were caught in a speed trap outside a Vancouver elementary school on Thursday – as students were settling back into their daily routines. Volvo Cars revamps SUV hybrid as it shifts plans away from pure electric Volvo Cars said on Wednesday that plug-in hybrids would continue to be a critical part of its profit growth plans over the next few years and that it would revamp its XC90 hybrid sports utility vehicle. Local Spotlight Ontario woman charged with assault with a weapon after neighbour sprayed with water gun A Simcoe, Ont. woman has been charged with assault with a weapon after spraying her neighbour with a water gun. 'I've cried a lot of tears': Floating home dreams sink for southwestern Ontario residents The dream of a life on water has drowned in a sea of sadness for a group of Chatham-Kent, Ont. residents who paid a Wallaceburg-based company for a floating home they never received. Buyers say they lost life savings to a Saskatchewan company selling luxury vacation condos In 2022, Tanya Frisk-Welburn and her husband bought what they hoped would be a dream home in Mexico. 'I'm so proud that we could do 100 years': Family-owned N.S. business marks milestone in menswear Mansour’s Menswear in Amherst, N.S., is celebrating its 100th anniversary this month Video shows tornado moving ashore in northern Ontario A beautiful Labour Day weekend at the lake was interrupted by some extreme weather when a tornado touched down in northern Ontario. 'Beautiful in its own way': New forest emerges in Jasper National Park, bringing protection and new opportunities Charred stumps and the remains of fire-ravaged trees still cover large tracts of land on the Jasper landscape, but life is returning quickly down below. Bachman Turner Overdrive Way: City recommends honorary name change to Winnipeg road Winnipeggers could soon be able to kick it into four-wheel drive and let it ride down the road on Bachman Turner Overdrive Way. 'Hopeless and helpless': Regina mother seeks help to treat rare spinal disease Mary Grace Rico is seeking help in getting treatment for a rare spinal condition. B.C.'s Bennett, Ont.'s Hennessy named flag-bearers for Paralympic closing ceremonies in Paris Swimmer Nicholas Bennett and para canoeist Brianna Hennessy have been named Canada's flag-bearers for Sunday's closing ceremonies of the Paralympic Games in Paris. Vancouver B.C. family says razor blades found in bag of frozen blueberries The B.C. parents of an 11-year-old girl said their daughter recently found a package containing razor blades in a bag of Kirkland-brand frozen blueberries. RCMP investigation into Lytton, B.C., wildfire finds no criminality, no definitive cause The RCMP has concluded its criminal investigation into the \"devastating and fatal fire\" that tore through the Village of Lytton and surrounding Indigenous communities more than three years ago. Lucky Cowboy the horse euthanized after being injured in Vancouver race, group says Animal advocates have renewed calls to boycott horse races after another animal was injured and euthanized at Hastings Racecourse last week. Toronto Judges quash OPP’s decision that officer misconduct in fatal crash was 'not serious' A panel of Ontario judges has thrown out a decision by the Ontario Provincial Police that an officer’s misconduct behind the wheel that killed a pedestrian in 2020 was not serious, saying the force must reconsider, and at least explain its decision to his grieving widow. Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. Port Lands gas plant emissions seven times too high for some building heights in new development: report The proposed height of some buildings that are part of a new residential development on Toronto's east waterfront have been called into question after a newly released report found that a nearby gas plant is producing emissions seven times higher than the legal limit. Calgary Calgary sports complex adding lazy river and water slides with $87.5M expansion A well-known Calgary sports complex is getting a massive makeover. Cougar stalks acreage southwest of Calgary twice in a day, kills cat A warning from a concerned parent after multiple frighteningly close encounters with a cougar on an acreage just southwest of the city on Tuesday. Alberta Premier Smith says she wants Calgary Green Line to proceed as first pitched Alberta Premier Danielle Smith says she's committed to Calgary’s multibillion-dollar Green Line light-rail transit project, but as it was originally envisioned. Ottawa 'Buy nothing': PSAC wants federal workers to boycott downtown Ottawa businesses A union representing federal employees is asking its members to bring their own lunch to work, in an apparent retaliation against downtown Ottawa businesses as new return-to-office protocols begin. Ottawa's mayor warns transit fare hikes, transit levy increases to address transit shortfall in 2025 Ottawa's mayor is warning of fare increases of 2.5 per cent to 75 per cent, service cuts, tax hikes, the elimination of free fares or a combination of levers to help offset a $120 million funding shortfall in the OC Transpo budget next year. Famous Winston Churchill portrait, stolen in Ottawa, is found Ottawa's Chateau Laurier hotel says authorities have recovered an iconic photograph of Winston Churchill after it was stolen and replaced with a fake nearly three years ago. Montreal Man, 70, and woman, 71, found shot dead in Montreal apartment, police Montreal police (SPVM) are investigating after a man, 70, and woman, 71, were killed by gunshot wounds in an apartment. Regional health board reinstates mask mandates in some health facilities amid rising COVID-19 cases Social media comments blocked: Montreal mayor says she won't accept vulgar slurs Montreal Mayor Valérie Plante is defending her decision to limit comments on her social media accounts — with an announcement on social media. Edmonton Father who killed his 17-day-old son sentenced to 6 years in prison A man who killed his infant son two years ago has been sentenced to six years in prison. 3 Edmonton restaurants ranked among best new dining spots in country Edmonton's Bar Henry. Bernadette's and Little Wolf are up for consideration for the title of Canada's best new restaurant. St. Albert product 'excited' about free-agent invitation to Edmonton Oilers rookie camp Marc Lajoie received a text from his agent two weeks ago with an offer to attend Edmonton Oilers training camp. Atlantic 'Bit of a mess': The challenges of getting around Halifax Ongoing construction is causing traffic woes for Halifax drivers. Man charged with attempted murder after Halifax shooting A 34-year-old man is facing an attempted murder charge after an alleged shooting in the north end of Halifax last week. 'Don’t get sick on a Friday,' Bedford, N.S., MLA tells health committee Despite data and testimony from health officials reporting progress on emergency health-care access, a Nova Scotia Liberal MLA says the system is still not up to standard. Winnipeg 'She was very honourable': Cathy Merrick lies in state at Manitoba legislature The sound of sombre song serenaded the halls of the Manitoba legislature Wednesday as Cathy Merrick's casket was brought in for a closed-door ceremony. Merrick died last Friday and was to lie in state Wednesday afternoon to allow the public to pay their respects. Inside a Manitoba ghost town, a group of ladies work to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. If you build it, they will come: How Manitoba farmers created their own 'Field of Dreams' A hamlet with a population of fewer than 70 residents has successfully brought people back in time to 1989 - the setting, a ‘Field of Dreams’ carved out of cornfields. Regina Langenburg UFO sighting commemorated with silver coin Perhaps Saskatchewan's most famous encounter with Unidentified Aerial Phenomenon (UAP/UFO) – \"The Langenburg Event\" is now being immortalized in the form of a collective coin. Town of Gravelbourg says goodbye to water tower For as long as she can remember, 98-year-old Minnie Nugent has enjoyed the view of a water tower in the skyline, welcoming her home to Gravelbourg. 'Another option': Sask. widening scope of practice for pharmacists The provincial government is widening the scope of practice for Saskatchewan pharmacists with the launch of a new pilot project. Kitchener Residents stepping up home security in Waterloo Region In a push to make their homes more secure, a local home surveillance company says more residents are installing security cameras on their properties. Civil lawsuit alleging 'brutal' sexual assault launched against accused in Ont.'s 'Woodland rapist' case An alleged child predator who was arrested and charged earlier this year is now facing a civil lawsuit in connection with a \"brutal\" sexual assault in a Toronto area park reported nearly 30 years ago. Guelph Humane Society helping foxes with contagious disease The Guelph Humane Society believes a contagious disease is spreading among the local wildlife. Saskatoon Saskatoon Tribal Council shelter will face cuts after new proposed shelter opens: province The proposed downtown location for the city’s newest homeless shelter is drawing criticism from the chief of the Saskatoon Tribal Council (STC), which runs the city’s largest emergency shelter. Councillors endorse Saskatoon downtown planning roadmap Saskatoon city councillors put their support behind a planning document that is expected to guide the next decade of development for the downtown core at its governance and priorities committee Wednesday. 'We do it well': How Elections Saskatchewan preps for voting Saskatchewan is entering election season, with voters soon heading to the polls to determine the province’s future. Northern Ontario Public defecation leads to threats charge at northern Ont. campground An incident involving siblings last weekend in Thessalon, Ont., ended with threats against campground staff and charges for one of the family members. U.S. presidential historian predicts results of November elections. Here's who he says will win An American presidential historian is predicting a Kamala Harris presidency as the outcome of the upcoming U.S. elections in November. Lotto Max jackpot hits record $75 million, could rise to $80M Starting Friday, Lotto Max draw participants can play for prize of $75 million for the first time ever in Canada. London Victim taken to hospital with serious injuries following afternoon shooting The London police are investigating a shooting that took place on Boullee Street in London Wednesday afternoon. Traffic chaos on campus continues amid ongoing labour disruption at Western University It’s day 13 of a strike by Western University’s facilities employees and some roads around the campus remain closed, causing delays for students and motorists. 'We’re in this mire and this muck': Former trustee and councillor says school board needs to come clean over director’s departure A long-time former city councillor and public school board trustee is calling on the Thames Valley District School Board to come clean regarding its education director, now on a leave of absence. Barrie Police investigate fatal hit-and-run on Highway 26 involving transport truck Police are investigating an alleged hit-and-run after an individual was found dead at the side of the road in Springwater Township early Wednesday morning. Highway 12 multi-vehicle crash sends 1 person to hospital Traffic along Highway 12 was impacted by a multi-vehicle crash. OPP constable charged after alleged assault at Santa's Village A woman has been charged with assault following an incident at an amusement park in Bracebridge. Windsor Windsor facing uphill battle to collect unpaid parking ticket revenue The City of Windsor is struggling to collect a \"significant\" amount of unpaid parking ticket revenue. Will a rate cut spur further building boom in Windsor? Maybe The latest interest rate cut may not open the floodgates of construction in Windsor-Essex, according to the area’s home builders’ association. Local photojournalist has retrospective of his work at museum A local award-winning photojournalist is having a retrospective exhibit of his work in Windsor. Vancouver Island RCMP enforcement at B.C. logging protests 'unreasonable,' federal police watchdog says A federal police oversight agency has found the RCMP's enforcement of a civil injunction against old-growth logging protesters on Vancouver Island was unreasonable and violated the rights of activists. 'Concerning' number of impaired drivers arrested in roads in Saanich, B.C.: police Police on southern Vancouver Island say they’ve arrested almost as many impaired drivers in the first eight months of this year than they did in 2023 in a concerning trend of people getting behind the wheel while drunk or on drugs. Metro Vancouver men charged after several kilos of drugs seized Two men are facing drug-trafficking charges after police seized several kilograms of cocaine, fentanyl and methamphetamine from multiple Metro Vancouver properties last year, British Columbia's anti-organized crime task force announced Wednesday. Kelowna Woman stabbed during daylight Kelowna home invasion: RCMP A woman suffered life-threatening injuries after being stabbed during a home invasion in Kelowna, according to authorities. Dog mauled to death in B.C. yard after 3 pit bulls jump fence: police A 12-year-old collie was killed by three pit bulls in the B.C. Interior Sunday morning, according to authorities. Suspect charged with 2nd-degree murder 1 year after Smithers, B.C., shooting Mounties in northwestern B.C. say they have arrested the suspect in a fatal shooting almost exactly a year after it occurred. Lethbridge Milk River Emergency Department temporarily closed Thursday Milk River Emergency Department will be temporarily closed Thursday – but this time it’s not because of a doctor shortage. Lethbridge students struggling to find jobs through the school year Thousands of students at the University of Lethbridge and Lethbridge Polytechnic are back in Lethbridge for the school year. Lethbridge firefighters hold annual procession to honour fallen first responderson 23rd anniversary of 9/11 Members of the Lethbridge Fire Department took part in a procession to honour all first responders who have died in the line of duty earlier Wednesday. Sault Ste. Marie Fireworks mistaken for gunshots in Sault Ste. Marie, police say Police in Sault Ste. Marie say the sound of fireworks prompted several calls to 911 on Thursday afternoon. Quebec suspect charged with stealing gas in northern Ont. was driving van stolen in B.C. An investigation of gas theft in Echo Bay, Ont., led to the discovery of a full-sized cargo van stolen from British Columbia. 'Remember the impact': Military members in North Bay commemorate 9/11 victims with march Canadian and American military men and women from Canadian Forces Base Wing 22 in North Bay, Ont., are ruck marching all day Wednesday to remember all who were impacted by the Sept. 11 terrorist attacks in the United States in 2001. N.L. Newfoundland and Labrador monitoring rise in whooping cough cases: medical officer Newfoundland and Labrador's chief medical officer is monitoring the rise of whooping cough infections across the province as cases of the highly contagious disease continue to grow across Canada. Dispute over unrecognized Inuit group halts major conference for Canadian North A 16-year-old biennial event aimed at fostering business in the country's eastern Arctic and northern regions has been cancelled indefinitely as a dispute unfolds between Inuit in Canada and a Labrador group claiming to share their heritage. Cow cuddling: Why a Newfoundland farm is offering quality time with these 'gentle creatures' Jim Lester’s farm hopped on the cow-cuddling trend in early August, and his time slots have been pretty well sold out ever since. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks School Has Officially Begun, And Here Are A Few Essential Supplies That Won't Break The Bank 19 Fall Fashion Staples Worth Adding To Your Wardrobe If You Pack Your Lunches (Or Your Kids' Lunches), You Probably Need At Least A Few Of These Products Home 15 Useful Products For Your Workspace That'll Make You Think \"I Need That\" 14 Products That'll Help You Live Your Best, Coziest Life This Fall The 5 Best Waffle Makers In Canada In 2024 (And Where To Get Them) Gifts 18 Top-Notch Presents And Gift Add-Ons That Anyone Would Love To Receive 15 Of The Best Gifts To Give A One-Year-Old For Their First Birthday 20 Of The Best Gifts For People Who Travel A Lot Beauty The Best Foundations For People With Mature Skin, According To Reviewers If You Want To Keep Your Summer Glow, Here Are A Few Products You'll Want To Add To Your Cart If You're Looking For The Best Clarifying Shampoo, Here Are A Few That Reviewers Swear By Deals From Anthropologie To Amazon: Here Are The Best Deals You'll Find Online This Weekend Beauty Week Has Officially Begun On Amazon Canada — Here Are The Best Deals You Can Find Here Are All The Best Labour Day Weekend Sales To Shop In Canada Stay Connected","summary":"Alberto Fujimori, whose decade-long presidency began with triumphs righting Peru’s economy and defeating a brutal insurgency only to end in a disgrace of autocratic excess that later sent him to prison, has died. He was 86.","url":"https://www.ctvnews.ca/world/alberto-fujimori-former-president-of-peru-who-was-convicted-for-human-rights-abuses-dies-at-86-1.7034753","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/9/11/former-peru-president-alberto-fujimori-dead-at-86-1-7034758-1726098195058.jpg","video":null,"publish_date":"2024-09-11 23:44:00","author":"Franklin Briceno,The Associated Press","authors":["Franklin Briceno","The Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.078},{"id":256205962,"title":"Harris, Trump shake hands at 9/11 commemoration","text":"Harris, Trump shake hands at 9/11 commemoration Following Tuesday night's contentious debate between Vice President Kamala Harris and former President Donald Trump, Harris and Trump shook hands at a 9/11 commemoration event Wednesday in Manhattan. The Harris campaign is pushing for the two to meet again for a second debate in October. However, Trump indicated that he's not so sure. Ed O'Keefe has the latest.","summary":"Following Tuesday night's contentious debate between Vice President Kamala Harris and former President Donald Trump, Harris and Trump shook hands at a 9/11 commemoration event Wednesday in Manhattan. The Harris campaign is pushing for the two to meet again for a second debate in October. However, Trump indicated that he's not so sure. Ed O'Keefe has the latest.","url":"https://www.cbsnews.com/video/harris-trump-shake-hands-at-911-commemoration/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/11/b280b4f9-b2ef-43ac-9472-83049f0865bc/thumbnail/1200x630/aa64934b9b850415583a0ba1cf61b097/0911-en-okeefe.jpg?v=eed8fba9acd13199742a248f804168a1","video":null,"publish_date":"2024-09-11 23:44:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.345},{"id":256205640,"title":"ABC News facing ‘serious talent crisis’ after T.J. Holmes and Amy Robach’s exit from ‘GMA 3’","text":"ABC News is facing a crisis. Again. Sources say the news giant is fretting because it has stars, but no successors. The network has been without a head of talent for nearly two years, and insiders tell Page Six it’s on its last reserves of A-list news anchors — with no rising stars to replace them. T.J. Holmes and Amy Robach were the last talent who had the chops to follow in Robin Roberts, George Stephanopoulos and Michael Strahan’s footsteps, insiders believe. But, of course, Holmes and Robach screwed that up when they were fired over their affair scandal in 2022. Their salacious romance contributed to a tumultuous two years at the network — specifically for former ABC News president Kim Godwin. According to sources, the brass didn’t fully consider the bigger picture when they axed the former “GMA3” anchors over their secret relationship. “Losing them at ‘GMA 3’ wasn’t the point. They were the primary replacements for [flagship morning show] ‘Good Morning America!’ That was their real value. Michael, George and Robin take 70 – 80 days off a year. You don’t get rid of people like that so quickly,” one source said. And with the exception of Linsey Davis, who anchor’s the Sunday edition of evening news mainstay “World News Tonight,” ABC is seriously lacking heirs to the morning and David Muir’s primetime news throne. “[ABC has] good correspondents, but they’re not stars. Linsey is not going to be the host of ‘GMA.’ She can easily be David’s replacement,” the source added. Davis and Muir moderated the debate between Vice President Kamala Harris and Donald Trump for the network on Tuesday. Their performance left conservatives seething over what they deemed to be unfair treatment of their candidate. ABC, however, was very pleased with their performance according to another insider at the network, who described morale as being at an “all time high,” following the debate. “It was a very proud moment,” they said. ABC talent, Martha Raddatz, Rachel Scott, Mary Bruce and Jonathan Karl anchored a pre- and post-debate special, but, “the elephant in the room is they didn’t have George,” the first source said. Sources told us viewers will “never see [Stephanopoulos] on election night,” after the network passed him over for Muir as anchor of “World News Tonight.” He sticks to his duties at “GMA” and “This Week,” with the occasional big sit-down interview, we’re told. A production deal is also a part of Stephanopoulos’ lucrative contract, which he is currently renegotiating, we hear. Meanwhile, multiple sources told us Muir is increasingly powerful at ABC News because star anchor Robin Robert, who’s the de facto lead anchor on “GMA” simply doesn’t care. “She’s the true power, but she doesn’t flex her muscles. She has her own thing, and doesn’t really give a sh-t,” the first source said. Hunky Muir, on the other hand, “calls a lot of the shots,” a third source said. His power became evident when ABC named his executive producer, Almin Karamehmedovic, as the new president of the news division, replacing Godwin, last month. The move baffled many at the company because “no one really knows him. His circle is ‘World News.’ He can’t deal with talent. He’s worked for one guy for ten years. He’s not going to be able to deal with the ladies of ‘The View,’ [which falls under ABC News],” the source said. “He’s only juggled one ego at a time. It’s a whole other level of skill you have to have in order to balance multiple anchors and keep everyone happy. And what if there’s a crisis at ‘The View,'” a fourth source echoed. The third source described his hire as “kind of a lame duck… Everybody thought it would be Simone [Swink],” they said referring to the executive producer of “GMA,” who has a reputation for being able to handle talent and find new revenue streams, we’re told. The second source lauded “the ratings and critical success” of last night’s debate coverage as proof Karamehmedovic is equipped for the job. “It was the finest journalism on display, led by Almin,” they said, adding that he and Swink have been “great partners.” But while they’ve checked off one executive box, the consensus seems to be there’s still no one in a position to cultivate current and new talent. “It makes no sense that they still haven’t hired a no. 1 and a no. 2 [in the talent department]. They have people who are good, but they don’t have the experience to deal with high caliber talent,” the fourth insider concluded. A rep for ABC did not comment.","summary":"The network has been without a head of talent for over a year and has promoted David Muir's EP to ABC News President.","url":"https://pagesix.com/2024/09/11/entertainment/abc-is-in-a-serious-talent-crisis-after-firing-t-j-holmes-and-amy-robach/","image":"https://pagesix.com/wp-content/uploads/sites/3/2024/09/89480020.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-09-11 23:42:54","author":"Carlos Greer","authors":["Carlos Greer"],"language":"en","catgory":"entertainment","source_country":"us","sentiment":0.04},{"id":256205632,"title":"Donald Trump Gets Good Sign in New Poll","text":"Former President Donald Trump has closed the gap on Vice President Kamala Harris for the first time in over a month, according to polling by The Economist/YouGov.In the latest survey by the pollster conducted from September 8 to September 10, out of 1,626 U.S. adults, the presidential candidates were tied at 45 percent. It is the first time that Harris didn't lead Trump in the weekly poll since July, when the former president was leading his Democratic opponent by 3 percentage points (44 percent to 41 percent) shortly after Harris entered the race.The Economist/YouGov poll, however, concluded before Tuesday night's presidential debate. A separate YouGov survey held immediately after the onstage clash found that most debate-watchers thought Harris won the contest.In polling last week by The Economist/YouGov, performed from September 1 to September 3, Harris was beating Trump by 2 percentage points (47 percent to 45 percent). The Democratic nominee held the same lead throughout most of last month, including at the beginning, when Harris was leading Trump 45 percent to 43 percent in a survey from August 4 to August 6.Harris enjoyed a wave of momentum in the first few weeks of her campaign. But in the days leading up to the debate, some pollsters warned that the race was starting to shift toward the former president. On Sunday, The New York Times and Siena College released a poll that found Trump leading by 1 percentage point, although at the time Harris still held a 2-point edge above Trump on average across national polls.Election forecasts by Nate Silver, founder of polling analyst site FiveThirtyEight, have also moved in Trump's favor. As of Monday, the former president was given his highest chance of winning the Electoral College since July, at 60.1 percent. Harris received a 39.7 percent chance.Despite the apparent shift, preliminary polling points to an extremely tight race between the candidates come November, and some experts have said that Harris could expect a polling boost following her strong debate performance on Tuesday.It remains unclear how much of an impact the debate could have on Harris' chances of winning in November. As political analyst Craig Agranoff told Newsweek on Wednesday via text, \"Debates can shape narratives and provide key moments, but their significance often depends on the viewer's perspective.\"\"For deeply entrenched voters, they may reinforce existing beliefs rather than shift opinions,\" Agranoff added. \"In a race as polarized as this one, even a perceived loss for Trump might not move the needle significantly, as many voters have already made up their minds.\"Newsweek reached out to Trump and Harris' campaigns via email Wednesday.","summary":"Trump has closed the gap on Harris for the first time in over a month in weekly polling by The Economist/YouGov.","url":"https://www.newsweek.com/donald-trump-gets-good-sign-new-poll-1952442","image":"https://d.newsweek.com/en/full/2469441/donald-trump-gets-good-sign-poll.jpg","video":null,"publish_date":"2024-09-11 23:42:47","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.14},{"id":256205558,"title":"Russian TV hosts claim Trump was ‘sabotaged’ after poor debate showing against Harris","text":"In the lead-up to last night’s debate between Kamala Harris and Donald Trump, many hosts on Russian TV were predicting that the former president would leave Philadelphia the victor, airing mocking clips of the vice president and repeating critical lines from the likes of Fox News. Now, with many regarding Tuesday’s debate as a clear Harris win, some Russian channels have been left scrambling to explain what happened. Their explanations have ranged from subterfuge to biased moderators, according to an analysis and translations from Russia analyst and Daily Beast columnist Julia Davis. State TV host Vladimir Solovyov joined many on the right in hammering the debate moderators for real-time fact-checking, including telling Trump city officials said there is not evidence for his baseless claim that Haitian immigrants in Ohio are eating people’s pets. “Why would he do that? I thought he was supposed to be unbiased,” Solovyov said. Others on Russian TV claimed Trump had been “sabotaged” or “disadvantaged.” Some, however, argued the debate performance was in fact Trump’s own responsibility. “She [Kamala Harris] managed to lure Trump into every trap she set up for him... I wish I hadn’t watched that,” a panelist from the Russian International Affairs Council, Alexey Naumov, reportedly said. One notable Russian TV appearance came from Dimitri Simes, a foreign policy expert and former Trump campaign adviser who has been accused of breaking U.S. sanctions while working for a Russian state TV network. Simes, who has denied wrongdoing, offered his best guess about the details of Trump’s plans on the war in Ukraine, one of the areas where the former president was vague on Tuesday. Simes told one program that the former president would tell Ukraine to concede to all of Putin’s demands and threaten to cut off U.S. aid if he didn’t. Back in the U.S., Trump was offering explanations of his own, simultaneously claiming debate host ABC was a “terrible network” and claiming he won the night. “I’d be less inclined to because we had a great night,” Trump told Fox News when asked if there would be a second debate. “We won the debate.” Potential voters don’t seem to agree. A snap CNN poll after the debate found 63 percent believe Harris won the debate, a sentiment shared by a variety of commentators, including from The Independent. Pop star Taylor Swift also endorsed the Harris campaign the night of the debate, adding further momentum to the Democratic side, even as it enraged conservative commentators like Megyn Kelly. In perhaps the ultimate sign that things weren’t quite well in GOPland, Trump himself went into the “spin room” on Tuesday night, a duty usually reserved for campaign aides and surrogates looking to put an after-the-fact gloss on whatever actually happened during the debate.","summary":"One host claimed moderators fact-checking Trump’s false claims about Haitian immigrants was biased","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-harris-debate-russian-tv-b2611291.html","image":"https://static.independent.co.uk/2024/09/11/11/SEI221074206.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/1t1scSfa-4VHSaSK0.mp4","publish_date":"2024-09-11 23:42:12","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.245},{"id":256205624,"title":"Elon Musk’s daughter responds to ‘incel nonsense’ after his offer to give Taylor Swift a baby","text":"The estranged daughter of Elon Musk slammed his bizarre offer to impregnate Taylor Swift after the pop superstar dropped a surprise endorsement of Kamala Harris. Vivian Wilson, 20, called her father’s indecent proposal ‘heinous incel nonsense’ in a post on X’s arch viral site Threads Wednesday. The saga began when Swift signed her Harris endorsement as ‘childless cat lady’ in a sly jab at Trump. Musk then responded: ‘Fine Taylor … you win…I will give you a child and guard your cats with my life.’ Vivian, who is transgender, praised Swift’s endorsement, saying the timing ‘could not have been better’ before teeing off on her father, whom she has not spoken to. ‘Also, yes, I saw “the tweet,”‘ she said about Musk’s missive. ‘Heinous incel nonsense is in fact heinous incel nonsense. I don’t really have anything to add to it, it’s just abhorrent.’ She added that Musk’s words were ‘disgusting, belittling and incredibly sexist’ and said that her audience ‘deserve better’ if people speak to them like that’. Wilson finished her thread by writing: ‘I really am not the biggest fan of this subject. I am my own person with my own name after all. However, I just feel like that had to be said even if it’s incredibly self-evident. Cheers’. The ‘Cruel Summer’ singer made her endorsement on Instagram immediately following last night’s debate, signed ‘Taylor Swift, Childless Cat Lady’ – in a refence to Donald’s Trump’s running mate J.D. Vance. However, less than two hours later, father-of-twelve Musk, who has also spoken out against underpopulation in the past, penned the bizarre proposal to Swift. Vivian and Musk have been engaged in a war of words with each other on socials after Musk said he was tricked into Wilson being allowed to go on puberty blockers. Referring to Wilson with male pronouns and by her birth name, Musk claimed that his ‘son’ had been ‘killed by the woke mind virus.’ Wilson pushed back on this last month, challenging a tweet from her father in which he claimed that she was born ‘gay and slightly autistic.’ Musk said he had known from a young age that she was gay, saying she ‘would pick out clothes for me to wear like a jacket and tell it was fabulous’ and loved musicals. Wilson shot down his claims saying her father had made them up as he wasn’t around her as a child. She claims that Musk would relentlessly harass her for her ‘femininity and queerness’. Vivian also added that she was legally recognized as a woman in the state of California and that her father was ‘determined for attention and validation’. The father and daughter have long had a contentious relationship, with Musk having called her a ‘communist’ who thinks ‘anyone rich is evil’. In his interview, Musk called what happened to him and his family ‘evil’, saying: ‘I was essentially tricked into signing documents for one of my older boys. ‘This was really before I had any understanding of what was going on, and we had COVID going on, so there was a lot of confusion. I was told Xavier might commit suicide.’ When asked about gender dysphoria, he added: ‘It’s incredibly evil and I agree with you that the people that are promoting this should go to prison. ‘I was tricked into doing this. It wasn’t explained to me that puberty blockers are actually just sterilization drugs. ‘I lost my son, essentially. They call it ‘deadnaming’ for a reason. The reason they call it ‘deadnaming’ is because your son is dead, so my son, Xavier, is dead, killed by the woke mind virus.’ Deadnaming is what transgender people typically refer to others calling them by the name they went by before they began to transition. Musk said that his right-wing awakening has been spurred on by this process and the trickery he claims was played upon him. ‘I vowed to destroy the woke mind virus after that and we’re making some progress,’ he said. Wilson legally changed her gender to female and her name from ‘Xavier’ to Vivian Jenna Wilson in 2022, while revealing in court filings she ‘no longer wishes to be related’ to Musk ‘in any way’. She filed the petition just three days after her 18th birthday, though the court documents weren’t made public until the day after Fathers Day. Vivian reportedly came out as transgender via text to her aunt when she was 16, but implored her to keep her gender identity from her father. Last night Trump and Harris went head-to-head in a heated debate on ABC during which the Republican presidential nominee accused migrants of eating pets and said Democrats wanted to ‘execute babies’ in the ninth month of pregnancy. The world had been waiting for Ms Swift, 34, to weigh in on the election after she backed Joe Biden in 2020 and supported Hilary Clinton in 2016. And she chose the first meeting between Trump and Ms Harris to make it clear she was backing the Democrats, and slammed the former president for ‘falsely’ claiming her support with a slew of AI images. Ms Swift posted on Instagram: ‘I will be casting my vote for Kamala Harris and Tim Walz in the 2024 Presidential Election. ‘I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them. ‘I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos.’ She accompanied the post with a picture of her calico cat Benjamin Button and signed it off ‘Taylor Swift, childless cat lady.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe estranged daughter of Elon Musk slammed his bizarre offer to impregnate Taylor&#8230;\n\n\nThis Post: Elon Musk&#8217;s daughter responds to &#8216;incel nonsense&#8217; after his offer to give Taylor Swift a baby first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/elon-musks-daughter-responds-to-incel-nonsense-after-his-offer-to-give-taylor-swift-a-baby/","image":"https://i.dailymail.co.uk/1s/2024/09/11/23/89561073-13840175-image-a-1_1726094612643.jpg","video":null,"publish_date":"2024-09-11 23:41:35","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.336},{"id":256205972,"title":"Patrick Mahomes commends wife's influence after Trump's praise and Taylor Swift's Harris endorsement","text":"Kansas City Chiefs quarterback Patrick Mahomes told reporters Wednesday he will not endorse any candidate in the upcoming election. He's focused on leading the Kansas City Chiefs to win a third straight Super Bowl, something no NFL team has ever done. Mahomes' mission comes during an election year in which the quarterback is surrounded by opposing political forces in his personal life. Mahomes' wife, Brittany Mahomes, earned public praise from former President Trump during an interview with Fox News Wednesday. After Taylor Swift, the girlfriend of Mahomes' longtime teammate and close friend, Travis Kelce, announced her endorsement for Vice President Kamala Harris Tuesday night, Trump said he \"liked\" Brittany Mahomes more than Swift anyway. \"I actually like Mrs. Mahomes much better if you want to know the truth. She’s a big Trump fan,\" Trump said on \"Fox & Friends.\" \"I like Brittany. I think Brittany’s great.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Patrick Mahomes was asked about the former president's comments during a press conference Wednesday as the Chiefs prepare to face the Cincinnati Bengals. \"I think you see Brittany does a lot in the community,\" the 28-year-old QB said. \"I do a lot in the community to help bring people up and give people an opportunity to use their voice. \"In political times, people are going to use stuff here and there, but I can’t let that affect how I go about my business every single day of my life and trying to live it to the best of my ability.\" Brittany has been at the center of a maelstrom of online debate between fans and critics in recent weeks. It started with a simple Instagram like of Trump's 2024 policy platform Aug. 13. Images of the like were rapidly spread around social media channels, inciting backlash so fierce the pregnant mother posted comments to defend herself and her beliefs. She later liked a comment that said \"TRUMP-VANCE 2024\" on one of her Instagram posts. Online Taylor Swift fan pages were responsible for several instances of Brittany's like going viral. Swift has endorsed Democratic candidates dating back to 2018, when she endorsed Democratic candidates Phil Bredesen and Jim Cooper in the 2018 U.S. midterm elections in Tennessee. She then endorsed Joe Biden for president in 2020, and her endorsement of Harris Tuesday arguably has a stronger impact. It's her first presidential endorsement since a surge in popularity from her Eras Tour and public relationship with Kelce. Swift's relationship with Kelce resulted in several publicized moments between the pop star and Brittany during Chiefs games. Patrick, Brittany, Swift and Kelce attended the U.S. Open men's singles final in New York Sunday. The Chiefs took care of their opening night win Thursday, leaving the group free to watch Italian Jannik Sinner defeat American Taylor Fritz in a luxury section of Arthur Ashe Stadium. Brittany and Swift were seen hugging and talking during the event. Their U.S. Open appearance came days after Swift and Brittany sat in separate suites at Arrowhead Stadium. Brittany and Swift had a history of sitting together in suites when Swift started going to games last year after publicizing her relationship with Kelce. Seeing the two together during broadcast cutaways became a Chiefs staple during games last season, but not on opening night last week, when the Chiefs celebrated their third Super Bowl of the Mahomes-Kelce era. TAYLOR SWIFT ARRIVES FOR CHIEFS-RAVENS WEEK 1 OPENER With Swift's official endorsement of Harris, questions about whether Kelce will endorse a candidate have risen among fans and voters. In March, Kelce told the Los Angeles Times he and Swift shared values after they started dating just a few months earlier, both at the age of 33. \"I think the values that we stand for and just, you know, who we are as people,\" Kelce said when asked why he believed people were so fascinated by their relationship. \"We love to shine light on others, shine light around the people that help and support us. And, on top of that, I feel like we both have just a love for life.\" Patrick and Brittany have a different love story. Brittany and Patrick were born and raised in east Texas and started dating when they attended Whitehouse High School in Whitehouse, Texas. Whitehouse is a town with a population of about 8,500 and has a history of voting Republican, according to Data USA. The couple got married in March 2022 and have two children, 3-year-old daughter Sterling Skye and 1-year-old son Patrick \"Bronze\" Lavon Mahomes III. Shortly after the scrutiny began about Brittany liking Trump Instagram content, Patrick wished her a happy birthday Aug. 31. In a recent episode of the \"Whoop\" podcast, Brittany said she’s leaned on her three-time Super Bowl-winning quarterback husband to get her through the recent public scrutiny. \"Having him to help me get through it has helped a lot because he is very good at managing those things and blocking people out and doing all that type of stuff,\" she said. \"Having him beside me and kind of guiding me, coaching me through it has helped a ton. I think that’s kind of gotten to where we are at now. \"I think the main thing he always told me is like, ‘Stop caring about what people think, especially the people that don’t even know you,’\" she said. \"And so I think social media used to get me a lot, and now it’s just like, honestly, I don’t give a f--- about what people have to say about me anymore.\" CLICK HERE TO GET THE FOX NEWS APP Brittany did suggest with an Aug. 26 Instagram story that she and Patrick may potentially disagree on some issues. \"Contrary to the tone of the world today …. you can disagree with someone, and still love them. You can have differing views, and still be kind,\" she wrote. Patrick has never publicly expressed support for a political figure or affiliation. He told Time in April he would not speak about who he would vote for in the upcoming election. He stood firm on that belief Wednesday. \"I don’t want my place and my platform to be used to endorse a candidate or do whatever, either way,\" Mahomes reiterated. \"I think my place is to inform people to get registered to vote. It’s to inform people to do their own research and then make the best decision for them and their family.\" Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Patrick Mahomes spoke out in defense of his wife Brittany&apos;s influence on the community after his teammate&apos;s girlfriend endorsed Harris.","url":"https://www.foxnews.com/sports/patrick-mahomes-commends-wifes-influence-amid-trump-praise-after-taylor-swift-endorses-harris","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/09/931/523/Patrick-Brittany-Mahomes.jpg?ve=1&tl=1","video":null,"publish_date":"2024-09-11 23:40:46","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"US","sentiment":0.362},{"id":256205400,"title":"Trump faces his own debate fallout just months after benefiting from Joe Biden’s","text":"WASHINGTON — Donald Trump emerged Wednesday from a rocky debate against Kamala Harris looking to regain his footing with 55 days until Election Day, the first ballots already going out in Alabama and other states on the cusp of early voting. Not even three months ago, Trump stepped off the debate stage in Atlanta having watched President Joe Biden deliver a disjointed, whispery performance that led the 81-year-old Democrat to end his reelection bid and endorse Harris, his vice president. By the end of Tuesday night, it was the 78-year-old Trump on the defensive after the 59-year-old Harris controlled much of the debate, repeatedly baiting the Republican former president into agitated answers replete with exaggerations and mistruths. The performance left many Republicans scrambling to pick apart Harris’ performance and insist that Trump still has time to refocus on the economy, immigration and other issues that could sway a closely divided electorate. “I think the contrast could have been drawn more sharply on what her policies have done over the last three and a half years,” said Republican Sen. Shelley Moore Capito of West Virginia in a critique of the former president’s approach. “That’s what I would have focused on.” Harris’ campaign immediately pitched the idea of a second debate. Fox News has proposed an October matchup but with moderators that Trump has indicated he does not prefer. And he said via his Truth Social account Wednesday that there is no need for a second round, “In the World of Boxing or UFC, when a Fighter gets beaten or knocked out, they get up and scream, “I DEMAND A REMATCH, I DEMAND A REMATCH!” Well, it’s no different with a Debate,” Trump wrote, as he claimed victory. “She was beaten badly last night … so why would I do a Rematch?” Trump and Harris were together briefly Wednesday in New York, where they joined President Biden and other dignitaries to mark the 23rd anniversary of the Sept. 11 attacks on the World Trade Center. They shook hands for the second time in 12 hours, with the first coming when Harris approached Trump on the debate stage to introduce herself in the first sign of the aggressive approach she would take during the event. The former president, who flouted convention with a surprise appearance late Tuesday in the post-debate spin room, insisted he won the night, though he also blasted ABC moderators as unfair. It was a tacit acknowledgement that he did not accomplish what he wanted against Harris. Trump and some of his allies in online posts speculated about punishing ABC by taking away its broadcast license — the network doesn’t need a license to operate but individual stations do — or denying access to its reporters. “We had a great night. We won the debate. We had a terrible, a terrible network,” Trump said Wednesday on Fox News. “They should be embarrassed. I mean they kept correcting me and what I said was largely right or I hope it was right.” Harris was jubilant late Tuesday, telling late-night rallygoers in Philadelphia that it was a “great night,” even as she repeated that she sees Democrats as “underdogs” against Trump. She won the endorsement of music and cultural star Taylor Swift as a range of political commentators and strategists on both sides of the political aisle expressed a broad consensus that she bested Trump. Still, there was no evidence the debate yielded immediate broad shifts toward Harris among people who watched, and the Trump campaign pointed to news reports featuring voices of undecided voters not being swayed for her. His campaign was not considering any strategy or staffing changes, said an official who was not authorized to speak publicly by name. Trump hit the points he needed to hit, the official said, and the debate felt lopsided because Harris was not pressed by the moderators, especially on her moving away from her earlier, more liberal positions on some issues. Harris senior campaign aides were pleased with her performance but still see a 50-50 race. The debate in their view was a maximized opportunity: Harris communicated her priorities and held Trump accountable in front of a national audience, including voters who were first tuning into the campaign. Their job over the next eight weeks, they say, is to capitalize on the performance by reaching and organizing their targeted coalition. About 6 in 10 debate-watchers said that Harris outperformed Trump, while about 4 in 10 said that Trump did a better job, according to a flash poll conducted by CNN. Before the debate, the same voters were evenly split on whether Trump or Harris would win. The vast majority of interviewed debate-watchers – who do not reflect the views of the full voting public – also said that the event wouldn’t affect their votes in the election. Perceptions of the two candidates remain largely unchanged. “He says a lot of stuff. And he’s said so many things over the years. And if you want to internalize that in a way that you think is any different from the past — my point is, that doesn’t make much difference,” insisted Sen. Mike Braun, R-Ind. Nonetheless, with pending battles for control of the House and Senate, Republicans on Capitol Hill found themselves answering for Trump’s most outlandish statements, notably his claim that Haitian immigrants in Ohio are eating domestic cats and dogs.. When Florida Sen. Rick Scott was asked about the appropriateness of Trump’s comments, he deferred questions to Hung Cao, the Republican Senate nominee in Virginia. “President Trump is President Trump, and you’ve got to admire him for that,” said Cao. Republican Gov. Chris Sununu of New Hampshire allowed that Harris won by traditional debate standards but fell short in convincing swing voters focused on their economic conditions. “The majority of those swing voters are still results driven,” Sununu said on CNN, adding that Trump still has opportunities to sway voters if he concentrates on the economy, immigration and, especially, foreign policy. Yet even when talking policy, Trump handed Democrats a cudgel with his answers on health care. After twice running for president on promises of repealing and replacing the Affordable Care Act, commonly called “Obamacare,” Trump falsely insisted that he saved the 2010 law. At the same time, Trump stood by his long-standing promises to replace the law with something better but when pressed acknowledged that he still had no specific proposal. “I have concepts of a plan,” Trump said in a remark that became quick fodder for online memes and merchandise. Braun promised those voters will hear more about GOP accomplishments and proposals, but acknowledged that it may not be Trump leading that effort: “Whether he does it or the rest of us have to do it, the case will be made between now and November 5th.” Barrow reported from Atlanta. Gomez Licon reported from New York. AP Polling Editor Amelia Thomson-DeVeaux and AP Congressional Correspondent Lisa Mascaro in Washington contributed to this report.","summary":"Just 55 days before the election, the Republican presidential candidate has emerged from a rocky contest against his Democratic rival, Kamala Harris, looking to regain his footing.","url":"https://www.centralmaine.com/2024/09/11/trump-faces-his-own-debate-fallout-just-months-after-benefiting-from-joe-bidens/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/09/Sept_11_Anniversary_91867_26024f.jpg?w=1000","video":null,"publish_date":"2024-09-11 23:36:50","author":"BILL BARROW,Bill Barrow, Mary Clare Jalonick, Michelle L. Price, Zeke Miller And Adriana Gomez Licon,MARY CLARE JALONICK,MICHELLE L. PRICE,ZEKE MILLER and ADRIANA GOMEZ LICON - Associated Press","authors":["BILL BARROW","Bill Barrow, Mary Clare Jalonick, Michelle L. Price, Zeke Miller And Adriana Gomez Licon","MARY CLARE JALONICK","MICHELLE L. PRICE","ZEKE MILLER and ADRIANA GOMEZ LICON - Associated Press"],"language":"en","source_country":"US","sentiment":-0.377},{"id":256206268,"title":"Thursday's big stock stories: What’s likely to move the market in the next trading session","text":"We'll dive back into the insurance sector after Wednesday's drop. CNBC TV's Contessa Brewer covers the beat. She noted the fall for Travelers, down 3.16%, and Hartford Financial, down 2.4%. W.R. Berkley dropped 2.36%, and Aon fell 1.8%. Brewer's sources say it may have to do with investor concern that an election win by Vice President Kamala Harris would lead to more litigation and fewer protections for businesses. This is a big issue for insurers across the country right now. Some investors are also worried that a Harris victory would lead to less consolidation in the industry. The sector has been strong in the last three months. Progressive is up about 20% in that time. Aon up 17.4% in three months. Hanover Insurance up 15.4%. Arthur J. Gallagher up 15% in three months. Hartford Financial up 14.7% in three months. Willis Towers Watson is up 12% in three months.","summary":"The three major averages made a stunning comeback from their lows to close with gains on Wednesday. Here's what CNBC TV is watching going into Thursday.","url":"https://www.cnbc.com/2024/09/11/thursday-big-stock-stories-whats-likely-to-move-the-market.html","image":"https://image.cnbcfm.com/api/v1/image/108029170-17254701042024-09-04t160727z_1215196734_rc2qt9ahf8dx_rtrmadp_0_usa-stocks.jpeg?v=1725470239","video":null,"publish_date":"2024-09-11 23:35:08","author":"Jason Gewirtz","authors":["Jason Gewirtz"],"language":"en","source_country":"US","sentiment":0.366},{"id":256205618,"title":"Video: Harris, Trump Shake Hands at 9/11 Ground Zero Ceremony","text":"Vice President Kamala Harris and former President Donald Trump both attended the 9/11 observances in New York City, along with President Joe Biden and Sen. JD Vance (R-Ohio). Harris and Trump briefly shook hands while attending the service.","summary":"Vice President Kamala Harris and former President Donald Trump both attended the 9/11 observances in New York City, along with President Joe Biden and Sen. JD Vance (R-Ohio). Harris and Trump briefly shook hands while attending the service.","url":"https://www.theepochtimes.com/epochtv/video-harris-trump-shake-hands-at-9-11-ground-zero-ceremony-5722636","image":"https://img.theepochtimes.com/assets/uploads/2024/09/11/id5722664-Trump-Harris-GettyImages-2171331771.jpg","video":null,"publish_date":"2024-09-11 23:34:33","author":"Epoch Video","authors":["Epoch Video"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.194},{"id":256207372,"title":"Donald Trump Is Terminally Online","text":"During last night’s debate, Donald Trump said some strange things, even by his own standards. He praised the Hungarian leader Viktor Orbán (using the antidemocratic term strongman approvingly); lamented that immigrants in Springfield, Ohio, are “eating the dogs”; and falsely suggested that Kamala Harris wants to do “transgender operations on illegal aliens that are in prison.” This is not merely the stuff of normal Trumpian discourse. This is the stuff of someone who is merely spending way too much time on the right-wing internet. Trump has long used the internet prolifically. But recently, he has exhibited himself as someone who is not simply on the internet, but as someone who is of the internet. In real life, he speaks in posts emblematic of the terminally online. Orbán is a figure who is dear to much of the online far right for his moves to erode Hungarian democracy but who is likely not a well-known figure to most voters. “Transgender operations for illegal aliens in prison” is a phrase ChatGPT would spit out if you fed it right-wing posts and asked it to parody them. Haitian immigrants eating people’s pets in Ohio is a hallucination that was born on the right-wing internet as well. If you spend enough time among the extremely online right, you’ll come to realize that they’re into deeply bizarre things. Not bizarre in the sense that their politics may be different from yours, but odd in that you might find their politics off-putting even if you otherwise agree with them on major issues. The extremely online right isn’t one thing, but a set of factionalized influencers and posters who often share bigoted memes and traffic in conspiracy theories. It includes the more well-known likes of Candace Owens, Nick Fuentes, and Charlie Kirk but also edgier figures who post under pseudonyms such as Zero HP Lovecraft and Bronze Age Pervert. The fringiest wings are into scientific racism, “white genocide,” and raw milk. They love talking about how they “will not eat the bugs,” (a conspiracy theory about a globalist plot to impel people to eat bugs to reduce their carbon footprint) and hate something called “the bugmen” (a term for what they see as frail modern, urban men). These things don’t sound normal to people who do not binge-scroll through X feeds made up of posts by people with profile pictures of Greek statues with laser eyes and display names such as Raw Egg Nationalist. These posters say that the absurdity is ironic. It’s just a part of the joke. It’s just “schizoposting.” If you’re missing the joke, that’s your problem. By the time their ideas trickle down to people like Trump, most of the irony has been washed away, if it ever existed at all. Onstage, Trump didn’t sound like someone who was doing a bit or trying to troll anyone; he sounded like he believed every part of it. Perhaps Trump himself is not incessantly scrolling the fringe of the right-wing internet, but he has surrounded himself with people who are. When Trump traveled to Philadelphia for the debate, he was joined on his plane by the online conspiracy theorist Laura Loomer. Like other prominent figures on the extremely online right, she is prone to inflammatory posts. Loomer has said that she didn’t care about the 2019 shootings in New Zealand in which 51 people were killed in two mosques, and has maintained relationships with multiple white nationalists. That Trump is extremely online doesn’t bode well for him. In 2016, Trump spoke more about the things that actually matter to people, even as his campaign rallies were rambling and at times incoherent. His populist rhetoric about corporate greed and elites touched prevailing currents that were coursing through the body politic. Even his bigotry made more strategic sense. Suggesting that brown Middle Easterners are possible terrorists, and instituting a Muslim ban, unfortunately had some mass appeal. Suggesting that Haitians are eating dogs in Springfield is incredibly niche. Post-debate polls suggest that voters saw the same thing—they handily selected Harris as the winner. The change marks a shift in Trump’s rhetoric but also the right’s more broadly. Over the past several years, the right has been accruing political tombstones for candidates who logged on too hard: Blake Masters, Kari Lake, and Ron DeSantis all ran prominent internet-brained campaigns and lost their elections. DeSantis made abolishing “wokeness” his totalizing concern in his presidential bid, a thing that plays well on the internet but isn’t as galvanizing offline. Lake, who ran for Arizona governor in 2022, appeared with a Nazi sympathizer and QAnon supporters at campaign events. In her current, struggling bid for the Senate, she has pushed a version of the online white-nationalist “Great Replacement” theory. J. D. Vance, who is one of the most online mainstream politicians, won his Senate seat in Ohio, but his relatively narrow victory in a red state suggests that he won in spite of himself. Now, as Trump’s running mate, he appears to have brought this style of politics to the presidential campaign as well. Trump said that he saw immigrants eating people’s pets on TV, but if this is actually how he came to the rumor, this, too, is a sign of the right’s descent into the fever dreams of its most online members. Right-wing cable news (and radio) channels used to play a significant role in setting the right’s agenda, but they now follow the lead of the oddest conspiracy theories being generated online. People like Tucker Carlson have long been a bridge between these two worlds, but parroting the discourse of the online right is now becoming the standard operating procedure of right-wing media at large. These lines have been further blurred by the ascent of explicitly right and more tacitly right-wing livestreams and podcasts, such as those hosted by Adin Ross and Logan Paul—both of which Trump has recently appeared on. It may be that the entire American right is terminally online and that Trump is closing the gap. After nearly a decade of Trump shaping the online right, the online right has now done the same to him.","summary":"He has begun to speak like someone who is deep inside the right-wing internet.","url":"https://www.theatlantic.com/technology/archive/2024/09/donald-trump-debate-terminally-online/679800/","image":"https://cdn.theatlantic.com/thumbor/wYN9PgkLEogENXx38j2Gvy2VEYc=/0x43:2000x1085/1200x625/media/img/mt/2024/09/Terminally_online_1/original.gif","video":null,"publish_date":"2024-09-11 23:31:00","author":"Ali Breland","authors":["Ali Breland"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.154},{"id":256205570,"title":"Trump wouldn’t say whether he’d veto a national ban even as abortion remains a top election issue","text":"CHICAGO (AP) — Former President Donald Trump repeatedly declined to say during this week’s debate if he would veto a national abortion ban if he were elected again — a question that has lingered as the Republican nominee has shifted his stances on the crucial election issue. In Tuesday’s debate with Vice President Kamala Harris, Trump said he would not sign a federal abortion ban, insisting that a ban would not pass Congress anyway. But he refused twice to say if he would veto such legislation if it landed on his desk. Trump’s running mate, Sen. JD Vance, a Republican from Ohio, said in an interview with NBC News last month that the former president would veto a ban. In response to moderators prompting him about Vance’s statement, Trump said: “I didn’t discuss it with JD, in all fairness. And I don’t mind if he has a certain view, but I don’t think he was speaking for me.” The exchange comes as voters and advocates across the spectrum wait for Trump to clarify his fluctuating stances on abortion, and Democrats warn that reproductive rights nationwide may be threatened by a second Trump presidency. Meanwhile, Harris emphasized support for reinstating a federal right to abortion Tuesday night. “He was given an opportunity to give clarity to the American people. He could not do it,” said Mini Timmaraju, president of the national abortion rights group Reproductive Freedom for All. “He will not answer that question directly.” During the debate, Trump repeatedly took credit for appointing the three Supreme Court justices who helped overturn the constitutional right to abortion and leaned heavily on his catchall response to questions on abortion rights: saying the issue should be left up to the states. “I’m not signing a ban,” he said, adding that “there is no reason to sign the ban” because of the overturning of Roe v. Wade, which once granted a federal right to abortion. He repeated that he is “not in favor of an abortion ban, but it doesn’t matter, because this issue has now been taken over by the states.” “This entire campaign cycle we’ve been telling voters they can’t trust Donald Trump when it comes to their reproductive freedom,” said Jenny Lawson, executive director at Planned Parenthood Votes. “And he just proved that right last night.” Following the debate, Carol Tobias, president of the National Right to Life Committee, said she wasn’t surprised Trump didn’t say he would support a national abortion ban because he has said in the past that there should not be one. She said her group hasn’t been focusing on a national ban “because it’s not going to happen. The votes aren’t there in Congress. You know, President Trump said he wouldn’t sign it. We know Kamala Harris won’t.” Kristan Hawkins, president of Students for Life of America, said the anti-abortion movement largely disagrees with Trump that abortion should be left up to the states, and in an April open letter to Trump, Students for Life of America urged him to commit to signing legislation restricting abortion. But Hawkins said, “That’s a conversation that will be had in detail after the election.” Trump’s states-based narrative is among his attempts to appear more moderate on abortion rights, which remain broadly popular and have emerged as among the GOP’s greatest vulnerabilities heading into November. Timmaraju said she believes Trump is only voicing opposition to a national ban now due to political pressure and a desire to win votes in November. “Trusting him to be moderate in his position while in office is out of touch with reality,” she said. Around 6 in 10 Americans think their state should generally allow a person to obtain a legal abortion if they don’t want to be pregnant for any reason, according to a July poll from The Associated Press-NORC Center for Public Affairs Research. Voters in seven states, including conservative ones such as Kentucky, Montana and Ohio, have either protected abortion rights or defeated attempts to restrict them in statewide votes over the past two years. Trump’s shifting abortion policy stances began when the former reality TV star and developer, who had once called himself “very pro-choice” started flirting with running for office. Before becoming president, Trump has said he “would indeed support a ban” in his book “The America We Deserve,” which was published in 2000. In 2016, he said he was “pro-life with exceptions” but said “there has to be some form of punishment” for women seeking abortions — a position he quickly reversed. At the 2018 annual March for Life, Trump voiced support for a federal ban on abortion on or after 20 weeks of pregnancy. More recently, Trump suggested in March that he might support a national ban on abortions around 15 weeks before announcing that he instead would leave it to the states. In an April interview with Time magazine, Trump also said it should be left to the states whether to prosecute women for abortions or whether to monitor women’s pregnancies and declined to comment on access to the abortion pill mifepristone, which was embroiled in an intense legal battle. When asked about mifepristone, he claimed only that he has “pretty strong views” on the matter and vowed to make a statement that has never come. In May, he said he was open to regulations on contraception before backing away from the statement, claiming his comments were misinterpreted. Trump also has appeared to reverse course on Florida’s six-week abortion ban, which he has previously called a “mistake” and too extreme. Last month, he ultimately said he would vote against a state ballot measure attempting to repeal the law and enshrine abortion rights into the state constitution, a day after he seemed to indicate he would vote in favor of the measure. He told reporters the initiative is from “radical” Democrats and falsely claimed it would allow abortions up until birth. Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"CHICAGO (AP) — Former President Donald Trump repeatedly declined to say during this week&#8217;s debate if he would veto a national abortion ban if he...","url":"https://wsvn.com/news/politics/trump-wouldnt-say-whether-hed-veto-a-national-ban-even-as-abortion-remains-a-top-election-issue/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/08/240830_Trump_Michigan_rally.jpg?quality=60&strip=color","video":null,"publish_date":"2024-09-11 23:30:08","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.216},{"id":256206100,"title":"Taylor Swift’s Harris endorsement draws 9 million ‘likes’","text":"Pop megastar Taylor Swift drew more than 9 million “likes” to her Instagram post backing Vice President Kamala Harris for president from celebrities that included Jennifer Aniston, U.S. basketball star Caitlin Clark and Selena Gomez. Soon after Harris, a Democrat, finished debating her Republican rival Donald Trump on Tuesday night, Swift, 34, told her 283 million followers that Harris and running mate Tim Walz would get her vote in the Nov. 5 election. Her post encouraged first-time voters to be sure to register for the election, and a U.S. General Services Administration spokesperson reported today receiving 337,826 visitors at vote.gov from a custom URL that Swift had shared. “I’m voting for @kamalaharris because she fights for the rights and causes I believe need a warrior to champion them,” Swift posted. She called Harris a “steady-handed, gifted leader” who could lead the country with calm rather than chaos. Swift was pictured with her cat in her post, which she signed as “Childless Cat Lady” in a dig at Trump’s running mate JD Vance, who in a 2021 interview called some Democrats “a bunch of childless cat ladies.” He has since said it was merely a sarcastic remark. Supermodel Karlie Kloss, who is married to Trump’s son-in-law Jared Kushner’s brother, liked Swift’s post. “Parks and Recreation” and “The White Lotus” actor Aubrey Plaza echoed Swift’s endorsement in her own Instagram post today, where she held a cat alongside the caption “HARRIS WALZ” with an American flag emoji. Trump supporter Elon Musk, who is chief executive of Tesla and owns social media platform X, wrote on his platform, “Fine Taylor … you win … I will give you a child and guard your cats with my life.” His message was branded “disgusting,” “misogynistic” and “creepy.” “I’ve done my research, and I’ve made my choice,” Swift wrote to her followers on Instagram. “Your research is all yours to do, and the choice is yours to make. I also want to say, especially to first-time voters: Remember that in order to vote, you have to be registered!” Swift wrote that she was impressed by Walz, the Minnesota governor, and described him as someone “who has been standing up for LGBTQ+ rights, IVF, and a woman’s right to her own body for decades.” Walz, who was on MSNBC when the endorsement was announced, said he was “incredibly grateful” and urged the singer’s large fan base of “Swifties” to “Get things going.” Shortly after Swift’s endorsement, the Harris-Walz campaign announced pre-orders for its latest campaign wear: Swift fan-inspired friendship bracelets. TRUMP DISMISSES ENDORSEMENT Trump today dismissed Swift’s endorsement of Harris, saying he “was not a Taylor fan”. “It was just a question of time,” Trump told Fox News in an interview. “She’s a very liberal person. She seems to always endorse a Democrat. And she’ll probably pay a price for it … in the marketplace.” In August, Trump posted a fake social media image of Swift asking people to vote for him in the November election. Swift referred to that in her Tuesday post, saying Trump had “really conjured up my fears around AI, and the dangers of spreading misinformation.” She added: “It brought me to the conclusion that I need to be very transparent about my actual plans for this election as a voter.” Opinion polls show the race essentially tied between the two candidates. Harris, who supports abortion rights, has criticized Trump for appointing three of the Supreme Court justices who in 2022 helped overturn the 1973 Roe v Wade ruling ensuring a constitutional right to abortion. Trump has defended the court’s abortion ruling but said a federal abortion ban is unnecessary and that the issue should be resolved at the state level. Swift backed President Joe Biden in 2020. Many Hollywood actors, producers and filmmakers have said they view Harris, a former U.S. senator from California, as their hometown candidate. Additional reporting by Susan Heavey and Stephanie Kelly.","summary":"Pop megastar Taylor Swift drew more than 9 million &#8220;likes&#8221; to her Instagram post backing Vice President Kamala Harris for president from celebrities that included Jennifer Aniston, U.S. basketball star Caitlin Clark and Selena Gomez.","url":"https://www.staradvertiser.com/2024/09/11/breaking-news/taylor-swifts-harris-endorsement-draws-9-million-likes/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/09/web1_20240911_brk_tsw01.jpg","video":null,"publish_date":"2024-09-11 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"entertainment","source_country":"US","sentiment":0.142},{"id":256205196,"title":"Right-Wing Figures Baselessly Claim Harris Used Audio Earrings For Debate","text":"Share to Facebook Share to Twitter Share to Linkedin Topline Far-right figures on social media spread baseless claims suggesting Vice President Kamala Harris used audio earrings to gain an upper hand in her debate against former President Donald Trump, though the unbacked claims do not consider the differences between the earrings worn by Harris on debate night and the audio earrings she has been accused of wearing. Harris listens to Trump during Tuesday's debate. (Photo by SAUL LOEB/AFP via Getty Images) AFP via Getty Images Key Facts Far-right media personality Laura Loomer was one of the users pushing the viral claim, posting on X, formerly known as Twitter, after the debate a side-by-side photo of Harris and a screenshot of a Tom’s Guide article about the Nova H1 Audio Earrings, which feature wireless earphones embedded in freshwater pearl earrings, according to their developers’ website—the post had been viewed nearly 4 million times as of Wednesday evening. Trump senior adviser Jason Miller retweeted an article in which Icebach Sound Solutions, the developers of the audio earrings, said the resemblance between their audio earrings and Harris’ earrings “is striking,” accompanying the repost with the eyes emoji, which can be used to express intrigue or skepticism, while several other prominent accounts also spread unfounded claims about the earrings. Harris appeared to be wearing Tiffany & Co.’s South Sea Pearl Earrings, which each feature a pearl placed atop and slightly between two gold rods, based on photos from a blog known as What Kamala Wore, which notes the earrings are not available online. The Nova H1 Audio Earrings do not have double rods, instead featuring a singular clip design for users’ ear lobes. Malte Iversen, managing director at Icebach Sound Solutions, told Forbes the company had no knowledge about what earrings Harris wore during the debate. The Harris campaign declined to comment and representatives for Tiffany and ABC News did not immediately respond to Forbes’ inquiry. Get Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here. Surprising Fact Harris could be seen wearing the same earrings during a 9/11 remembrance ceremony Wednesday morning and appears to have worn them on other occasions, including at a rally in Wayne, Michigan, last month and an NCAA championship teams celebration in July. News Peg Trump during an interview with Fox News accused Harris of having access to the debate questions ahead of time, saying ABC News, the network that hosted the debate, had a “rigged show with somebody that maybe even had the answers.” He provided no evidence to back up the claim and the debate rules specified that “No topics or questions will be shared in advance with campaigns or candidates.” Tangent Election betting odds largely swayed in favor of Harris following the debate, with bookmakers predicting the vice president has a 51.8% chance of winning the election over Trump (46.9%), according to the Election Betting Odds tracker. Trump held a lead in betting odds heading into the debate. Key Background The debate between Trump and Harris was seen as one of the most consequential days of the election cycle, as polling showed the candidates entered the debate in a tight race. Harris experienced a surge in polling momentum in recent weeks that plateaued before the debate, resulting in a one-point lead over Trump (49% to 48%) heading into the debate, according to an NPR/PBS News/Marist survey. Pundits after the debate largely either praised the vice president’s performance or critiqued Trump’s for allowing Harris to bait him into off-topic tangents, according to The New York Times. Trump said in an interview with ​​“Fox & Friends” the debate “was three on one,” a criticism likely referring to the real-time fact-checks he experienced during the event. The former president also characterized ABC as “the most dishonest news organization,” echoing criticisms of ABC he lobbed heading into the event. One of the most eye-catching fact checks against Trump was delivered after he pushed a false viral claim that immigrants in Springfield, Ohio, are eating residents’ cats and dogs. Debate moderator David Muir cited Springfield officials who told ABC News they received no credible reports of immigrants eating pets in the area, to which Trump claimed he saw “people on television” who said their pet was used for food. Further Reading ‘They’re Eating The Dogs’ And ‘Worst’ Inflation: Key Fact-Checks From The Presidential Debate (Forbes) Harris Surges Past Trump In Election Betting Markets After First Presidential Debate (Forbes) Follow me on Twitter or LinkedIn. Send me a secure tip. Antonio Pequeño IV Following Editorial Standards Print Reprints & Permissions","summary":"Some right-wing social media accounts suggested or accused Harris of cheating in various ways following her debate with former President Donald Trump, without evidence.","url":"https://www.forbes.com/sites/antoniopequenoiv/2024/09/11/right-wing-figures-baselessly-claim-harris-used-audio-earrings-for-debate/","image":"https://imageio.forbes.com/specials-images/imageserve/66e2272cfdfa651ff29f5fc4/0x0.jpg?format=jpg&crop=3072,2048,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-09-11 23:28:39","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","source_country":"US","sentiment":-0.182},{"id":256205156,"title":"NY Fashion Week: Precision at Carolina Herrera, Color at Bach Mai, Sparkle at Boucheron","text":"Shonda Rhimes, Michelle Monaghan, Chloe Fineman and Camila Alves McConaughey were among the front-row attendees for the debut of Wes Gordon’s Spring 2025 collection for Carolina Herrera — each is a terrific example of the smart, stylish women who have loved this label since Mrs. Herrera founded her house in 1981. Gordon, who signed on as the brand’s creative director in 2018, remains an outstanding custodian of the Herrera DNA, which he balances with his thoughtful attention to detail and an aesthetic that appeals to chic fans in every age bracket (that latter feat is much harder than it sounds, but every CEO of a heritage brand will say it’s vital to a brand’s long-term success). Taking place Monday morning at 28 Liberty Street in New York’s Financial District, Gordon said his Spring 2025 collection was all about precision and balance. “When there are too many tricks and too much noise, you can’t hear the Wow,” he explained to The Hollywood Reporter following the show. “So I stripped back and pared down. I made things their most architectural and sculptural, but still super feminine.” In that vein, Gordon noted that he was striving for “one perfect detail” in each design. “In some cases, it was a color you noticed,” he said. “The first half of the show was black and white, and then color started blossoming as though in a garden; and then in second half, it was about four colors: pink, blue, yellow and red. In other cases, it was an embellishment. In some cases, just a singular drape on one shoulder. But if I did that, then the piece was black and really straight. This collection is about allowing things to shine without too many tricks. I didn’t want tricky clothes. I wanted beautiful, stunning clothes.” Among the standout pieces: Gordon’s latest take on Herrera’s iconic white button-down blouses, here crafted in textured silk gazar and paired with black Bermuda shorts with a V-waistband; the contrast of a silk camp shirt in the house’s signature black-and-white polka dot and a lush ballgown skirt in black-and-white rose jacquard; and an abundance of options perfect for Sunday’s Emmy Awards, including a textured pink tulle boat-neck gown with an open back. Attendees also raved about the best-of-Janet-Jackson soundtrack, which Gordon said was on-brand for the house. “We are all about a strong, powerful, sexy, confident woman, so it’s the music we needed for today’s collection,” he added. Stars Among the Sparkles at the Boucheron Exhibition Style fans can always count on one terrific jewelry event during New York Fashion Week, and this season Boucheron took the honors, hosting a lavish exhibition that opened Tuesday evening at the Cooper Hewitt Smithsonian Design Museum. Designed to highlight new and archival pieces by the legendary jewelry house, the event also was conceived to celebrate the opening of the brand’s first U.S. boutique. Gwyneth Paltrow, Colman Domingo, Cole Sprouse and Hailee Steinfeld were among the guests at “From Paris to New York,” an immersive experience that’s open to the public at the Cooper Hewitt through Sept. 12. Archival jewels on display include an Art Nouveau hair comb transformed into a brooch worn by Elizabeth Taylor and a bracelet purchased in 1934 by Edward VII, while he was still Prince of Wales, as a gift for Wallis Simpson, two years before he abdicated the British throne so they could marry. At the other end of the house’s history, attendees can view “Or Bleu,” the latest high-jewelry collection by Boucheron creative director Claire Choisne, who was inspired by Icelandic water to conceptualize modernist designs that take their cue from waterfalls, water splashes or the shimmer of ice on a black sand beach. ‘ A section is also devoted to the jeweler’s iconic Question Mark necklace, introduced by Frederic Boucheron in 1879 as a stylish, innovative jeweled piece that was absent a clasp, enabling a woman to put it on without the assistance of a man or a lady’s maid. “From Paris to New York” highlights a variety of Question Mark designs crafted over the past 145 years, including the reversible high-jewelry concept Choisne unveiled in July. Prior to a morning tour of the exhibition, Choisne discussed why her forward-thinking aesthetic has already resonated with the U.S. audience. “I think people here are open to creativity,” she told THR. “From an aesthetic aspect, Americans understand big pieces, statement pieces, and that’s not always the case everywhere. So for my designs, I think it will be the right match.” Following Boucheron’s Sept. 5 opening on Madison Avenue, future boutiques are in the works for Beverly Hills, Las Vegas and Miami. Frédéric Boucheron founded his eponymous jewelry house on Paris’ Place Vendôme in 1893, the first jeweler to establish itself on a square that today is almost fully populated by luxury brands that include Chanel, Dior, Van Cleef & Arpels and others. When Choisne arrived at Boucheron 13 years ago, she said her first task was a thorough exploration of the archives. “My purpose was to understand and focus on the work of Frédéric Boucheron, because I was really interested in understanding his philosophy,” she said. “What I discovered was so much diversity within the archives. For me, it was quite obvious he was a visionary. His Question Mark necklace, for example: It seems so simple, yet it’s so smart in its technique, and the same for the way he mixed rock crystal with diamonds. And I thought, OK, he was bold enough to propose these materials and techniques, and I knew he was a good match for me. So today, innovation and pushing boundaries is really about continuity.” Entry to “From Paris to New York” is available through Sept. 12 via timed tickets that must be reserved in advance. Bach Mai’s Ode to Color Following Personal Loss At Chelsea Factory on Sunday evening, Bach Mai decided to explore a bold side of fashion’s color spectrum, for a decidedly poignant reason: He had recently lost his father, and in the midst of mourning, he began thinking about a question his dad, who immigrated to the U.S. from Vietnam, asked about his son’s first collection: “Where is all the color?” So Mai decided to honor his father by embracing color to an unprecedented degree within his eponymous label. He dubbed the collection, “Invincible Summer.” “It was about purposefully and mindfully choosing optimism, choosing to not focus on the negative and to let the light shine in,” Mai explained to THR backstage after the show. “This time I banished the use of black in the collection, and doing so showed me really how hard it is; I didn’t allow myself to use a single stitch of black.” Overt glamour proved to be the perfect partner with Mai’s lush color palette. The designer said he was inspired by Cecil Beaton’s famed images of women in gowns by Charles James, taken between 1946 and 1948. Hence the saturated tones of red, blue and pink were shaped into elegant, structured dresses that highlight curves and unabashed femininity via shaped skirts, tiered gowns that floated as they moved, silk necklines that wrapped around shoulders, lavish bows and pleated tulle underskirts. “I just wanted to reference that image that had been seared into my mind, of Charles James gowns by Cecil Beaton, to show what is the future of American glamour, but make it diverse and inclusive,” Mai said. “It’s what American glamour is and can be, for all women and all body types.” A student of Paris haute couture before launching his label in 2021, Mai has partnered with historic French fabric house Hurel, which was founded in 1873 and is a fitting resource for the silks and satins the designer employed throughout his collection. Though Mai’s brand is young, he’s earning ample attention from Hollywood, with Amal Clooney wearing a paillette-embellished gown to an Aug. 31 Cartier party at the 81st Venice Film Festival, while Ashley Park wore a pomegranate-hued chiffon gown from Mai’s Spring 2024 collection to this week’s press appearances in Rome for Season 4 of Emily in Paris. This season, New York-based diamond house Leviev also signed on with Mai, accessorizing 11 looks with Beaton-inspired diamond jewels, while an additional necklace represented a collaboration between Mai and the jewelry house. The 47-carat “Le Bal” high-jewelry necklace showcased a 32-carat fancy yellow diamond and was shown with the single white evening gown in Mai’s collection. “He showed us the gown while it was still in the sketch stage, and we worked together for about a month, which is really a rush for us,” said Chagit Leviev, president and CEO of Leviev Group USA. “But it was about ensuring that 32-carat yellow diamond fell at exactly the right place on the neck and with that gown, and the result is incredibly elegant.” Also key to the collection: a lime green halter gown that Mai noted was a pointed reference not only to the bold hue British pop star Charlie XCX vaulted into the stratosphere with the June debut of her hit album brat; it’s also intended as a nod to to the White House run of Vice President Kamala Harris, which likewise embraced the color early in the campaign. “All of a sudden, hope and optimism came back, and I really needed that right now,” Mai said on Sunday evening with a smile. “So I knew we needed that color in the show. A Brat dress? Awesome.”","summary":"Shonda Rhimes, Michelle Monaghan, Chloe Fineman and Camila Alves McConaughey were among the front-row attendees for the debut of Wes Gordon&#8217;s Spring 2025 collection for Carolina Herrera — each is a terrific example of the smart, stylish women who have loved this label since Mrs. Herrera founded her house in 1981. Gordon, who signed on [&#8230;]","url":"https://www.hollywoodreporter.com/lifestyle/style/ny-fashion-week-carolina-herrera-bach-mai-boucheron-1235996396/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/09/carolina_herrera_ss25_amb_061.jpg","video":null,"publish_date":"2024-09-11 23:28:07","author":"Laurie Brookins","authors":["Laurie Brookins"],"language":"en","source_country":"US","sentiment":0.405},{"id":256205084,"title":"The impact of Taylor Swift supporting Kamala Harris on her conservative followers","text":"Angel Sobolewski doesn’t take political advice from pop stars — not even her favorite, Taylor Swift. That’s why Sobolewski, who regularly promotes Republican candidates through her profile on X, is voting for former President Donald Trump in November despite being a Swiftie. “I think you can like an artist without, like, agreeing with their politics,” Sobolewski, 21, said. “You know, if we had to agree with their politics, we’d probably be left with, like, two people.” Swift’s endorsement of Vice President Kamala Harris on Tuesday after Harris’ debate with Trump has rankled and disappointed some of her many fans on the conservative side of the political spectrum. Others said they’re not thrilled about the endorsement — but they were “Ready for It.” “We learned last night that she’ll be supporting Kamala Harris in the election, but that’s OK, and that, you know, diversity of ideology and diversity of opinion in the United States are important, and we should keep our horizons open,” conservative Swift fan Jenna Piwowarczyk told NBC News. On social media, many Swifties said they anticipated Swift, who endorsed Joe Biden in 2020 but rarely makes political statements, would most likely vote for Harris and her running mate, Minnesota Gov. Tim Walz. Those who spoke to NBC News said her comments wouldn’t stop them from listening to her music. “I think that the endorsement was nothing too unexpected,” said Heath Johnson, 15, a self-described “Gen Z Swiftie” from Wisconsin. “I think Taylor really dislikes Trump and that she would endorse a dead body over him if it came to it.” Swift’s post to Instagram on Tuesday, shared after Harris and Trump’s first debate, explained that she decided to back Harris “because she fights for the rights and causes I believe need a warrior to champion them.” “I think she is a steady-handed, gifted leader and I believe we can accomplish so much more in this country if we are led by calm and not chaos,” Swift wrote. Some right-leaning Swift fans had expected those statements. “We’re not surprised. We know that Taylor leans left on stuff, and in her statement she talked about that she’ll be voting for Kamala and Tim Walz because of social issues,” said Piwowarczyk, 19, who said she will be voting for Trump in the November election. On Wednesday, in an interview with “Fox & Friends,” Trump responded to Swift’s endorsement, saying, “I was not a Taylor Swift fan. It was just a question of time.” He added later, “But she’s a very liberal person, she seems to always endorse a Democrat, and she’ll probably pay a price for it in the marketplace.” In her endorsement post, Swift also mentioned that Trump had shared images that appeared to have been generated by artificial intelligence to his social media platform, Truth Social, of both her and her fans supporting Trump. She said she felt the need to speak out. Two of the images Trump posted were real photos of Piwowarczyk in which she was wearing a “Swifties for Trump” shirt. “I was disappointed in the Trump campaign for posting AI pictures, because it kind of dilutes the realness of this movement,” Piwowarczyk said, adding that “there are thousands of girls who do support Trump and listen to Taylor Swift.” One such group is “Swifties for Trump,” a loose ideological group of mostly women who identify as conservative Swift lovers. In a lengthy post, the “Swifties for Trump” account on X, which has no affiliation with Swift, said Wednesday that the group respects Swift’s right to endorse any candidate but that the endorsement won’t change the group’s passion for Trump. The post emphasized that while the group had no intention to pressure Swift to vote for Trump, she doesn’t share the struggles of the average American. “She isn’t worried, like most young Americans, that she may never be able to afford to buy a house — a quintessential part of the American Dream. … She’s worked extremely hard since she was a teenager to earn all that she has. The majority of us, however, live in a very different world than Taylor Swift,” the post read in part. The “Swifties for Trump” account declined to comment. Other Swifties, like Jason Richardson, 23, echoed the sentiment that Swift’s billionaire status means she’s “out of touch” with her fans. Richardson said some Swift lovers can’t afford “food, housing and transportation” because of the Biden administration. Richardson said he’s one of the Swifties genuinely disappointed by Swift’s endorsement of Harris. “I am still a big fan of hers,” Richardson said. “Her endorsement of the Harris campaign does not change my love or admiration for her. I just wish she made a better choice.” The worldwide phenomenon of Swift and, more recently, the Eras Tour has attracted fans from all walks of life. In the past, some have speculated that Swift was a Republican, and Vice reported in 2016 that white supremacists viewed her as “aryan goddess.” But Swift has consistently advocated for left-leaning candidates and policies since she spoke up about politics for the first time six years ago. The 2020 documentary “Miss Americana” featured scenes of Swift fighting with her team to publicly denounce Sen. Marsha Blackburn, R-Tenn., then a member of the House, whom she described as “Trump in a wig.” The same year she shared a post of cookies with Biden’s name on them. Johnson, who spoke via X direct message, said he hoped Swift would look at what the Republican Party has to offer beyond Trump. He suggested Swift look at candidates like Nikki Haley, who he believes aligns more closely with Swift than Harris or Trump. Still, he said the endorsement will change little in the Swift fan base. “The few conservative Swifties who didn’t want her to endorse [Harris, like me] weren’t thrilled to say the least but we aren’t surprised either,” he said. Most said they hope that, in the future, Swift and other celebrities will encourage people to vote but won’t say which candidates in particular they’re backing. “I think it’s pretty commonly known that she is a liberal, so it wasn’t surprising, and I wasn’t even really disappointed,” Sobolewski said. “I do kind of wish that she just kept it to herself.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nAngel Sobolewski doesn’t take political advice from pop stars — not even&#8230;\n\n\nThis Post: The impact of Taylor Swift supporting Kamala Harris on her conservative followers first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/the-impact-of-taylor-swift-supporting-kamala-harris-on-her-conservative-followers/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-09/240911-taylor-swift-ch-1300-fec931.jpg","video":null,"publish_date":"2024-09-11 23:25:16","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.033},{"id":256205180,"title":"Fixing the NHS is Labour's most urgent problem - can they do it without more money?","text":"Of all the challenges facing the Labour Government, few are more urgent than restoring the NHS to health. The scale of this is laid bare in a report today by Lord Darzi. A combination of Tory cuts and the botched Andrew Lansley reforms has left the health service in a critical condition. Waiting lists are at a record high, 2.5 million pensioners are not receiving the treatment they need, cancer survival rates are falling and hospitals need rebuilding. Such is the dire inheritance the Conservatives have bequeathed to Labour that turning around the NHS will be a 10-year project. Keir Starmer will today set out the building blocks on which he intends to reform the health service. There will be a greater emphasis on prevention, a promise to modernise IT systems and better community health support. The test for him is whether these improvements can be achieved without more funding. Don trumped The momentum is with Kamala Harris after her confident performance in the TV debate with Donald Trump. She was quick-witted, competent and on top of her brief. By contrast, thin-skinned Mr Trump was snarling and bad-tempered. His rambling answers and willingness to promote conspiracy theories only underlined why he is unworthy of high office. Joe Biden pulled out of the race because of concern at his mental fitness. Americans should be equally alarmed by Mr Trump’s incoherence and shaky grasp of details. Allies will also be deeply concerned that he refused to say if he wanted Ukraine to triumph. In an unsafe world he’s increasingly the unsafe choice. Best awards Congratulations to all the winners at the National Television Awards last night. When the gongs are voted for by the viewers, they are the only ratings that really matter.","summary":"The scope of the disaster which has befallen our treasured NHS has been laid bare in a report by Lord Darzi. Keir Starmer has promised to fix the problem, but it will be his government's greatest challenge","url":"https://www.mirror.co.uk/news/uk-news/fixing-nhs-labours-most-urgent-33649533","image":"https://i2-prod.mirror.co.uk/incoming/article31557070.ece/ALTERNATES/s1200/79_the-mirror-says-6.jpg","video":null,"publish_date":"2024-09-11 23:23:55","author":"Voice of the Mirror","authors":["Voice of the Mirror"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.132},{"id":256205106,"title":"Harris surrogate Michelle Lujan Grisham compares abortion services in New Mexico to the Underground Railroad","text":"STERLING, Va. — Stumping for the Harris-Walz ticket in Virginia on Monday, New Mexico Gov. Michelle Lujan Grisham said that her state is running a de facto “Underground Railroad” for abortion services since the overturning of Roe v. Wade. The Democratic pol said that 75% of abortion services performed in New Mexico are on out-of-state patients, and described the situation in her state as an “underground operation.” “We literally now have an underground operation, not unlike something we’re all familiar with, the Underground Railroad, to try to make sure that we get to women and their families early,” the gov told the crowd of about 30 at the Northern Virginia Democrat Headquarters. She also shared the grim reality of many patients who traverse New Mexico’s “underground railroad,” adding: “Sometimes if we save their lives, we’ve also ruined any opportunity for them to have a child of their own when they’re ready to have a child of their own.” Still, she says her state is a “bastion for safe, fair reproductive access around the country.” Lujan Grisham also shared that her state has put up billboards in Texas — where 71% of the New Mexico’s out-of-state abortion patients come from — to recruit more doctors from their neighbor to the east to practice medicine in New Mexico. “If you’re a health care practitioner, why would you practice here if you’re sworn to protect the lives of your patients? If you want no interference, come to New Mexico,” the gov said. Alicia McFadden, a 44-year-old mother of two was in attendance Monday, and told The Post she showed up because of her passion for supporting reproductive rights. “My baby is an IVF baby, and we’ve seen. I’m from Alabama, so I’ve seen very first-hand people who do not have access and have their access to IVF limited. So I’m very passionate about IVF and paying for IVF. Luckily, we could afford IVF, not easily, but we could afford it, but there are a lot of people that can’t afford IVF, especially in Virginia.” Asked about Trump’s recent endorsement of IVF practices, especially noting that the treatments would be free under a second Trump term, McFadden said she “that’s not true, I don’t believe it.” “Reproductive rights, abortion and IVF is right there together. Many times you have embryos that you transfer, and for whatever reason that you may not take, they may take, but then there’s some issue, and you need to have access to abortion.” McFadden told The Post. “So you can’t have one without the other.” Abortion was a major topic of discussion in Tuesday’s presidential debate, in which the candidates sparred over the hot-button election issue. Former President Trump reiterated that he believes in abortion exceptions in cases of rape, incest, and the life of the mother, and applauded the overturn of Roe v. Wade for returning the policy decisions to the states and their voters. Vice President Kamala Harris claimed that Trump would sign a federal abortion ban into law, which Trump disputed as a lie. The veep would not answer whether she’d back any restrictions on abortion access, even in the eighth or ninth month of pregnancy, when pressed by both the moderator and Donald Trump.","summary":"STERLING, Va. — Stumping for the Harris-Walz ticket in Virginia on Monday, New Mexico Gov. Michelle Lujan Grisham said that her state is running a de facto &#8220;Underground Railroad&#8221; for abortion services since the overturning of Roe v. Wade. The Democratic pol said that 75% of abortion services performed in New Mexico are on out-of-state...","url":"https://nypost.com/2024/09/11/us-news/harris-surrogate-gov-michelle-lujan-grisham-compares-abortion-services-in-new-mexico-to-the-underground-railroad/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/09/new-mexico-governor-michelle-lujan-89392994.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-09-11 23:22:07","author":"Victoria Churchill","authors":["Victoria Churchill"],"language":"en","source_country":"us","sentiment":-0.326},{"id":256206320,"title":"67.1 Million People Watched Harris and Trump, Outdrawing Last Debate","text":"There is a new most-watched moment of the 2024 presidential campaign. Tuesday’s televised clash between Vice President Kamala Harris and former President Donald J. Trump drew 67.1 million live viewers, according to Nielsen, outdrawing Mr. Trump’s debate in June with President Biden by 31 percent. Mass cultural events are rare in a polarized, choose-your-own-news era, but presidential debates still have pull. And the Nielsen data did not include likely millions more who followed along on social media and a variety of websites and streaming platforms. The debate, hosted by ABC News in Philadelphia, fell short of cultural touchstones like the “Seinfeld” finale in 1998 (76.3 million), but viewing habits have shifted since then. The TV audience for the Harris-Trump matchup was roughly comparable to Mr. Trump’s second debate with Hillary Clinton in 2016, and President Barack Obama’s first meeting with Mitt Romney in 2012. Younger and early-middle-age viewers in particular helped drive up the television audience on Tuesday. Roughly 50 percent more adults between the ages of 18 and 54 watched Ms. Harris and Mr. Trump, compared with the June debate, according to Nielsen.","summary":"The TV audience for the Harris-Trump matchup was roughly comparable to the second Trump-Clinton debate in 2016.","url":"https://www.nytimes.com/2024/09/11/business/media/harris-trump-debate-ratings.html","image":"https://static01.nyt.com/images/2024/09/11/multimedia/11debate-ratings-1-cmqk/11debate-ratings-1-cmqk-facebookJumbo.jpg","video":null,"publish_date":"2024-09-11 23:21:46","author":"Michael M. Grynbaum","authors":["Michael M. Grynbaum"],"language":"en","source_country":"us","sentiment":0.405},{"id":256204938,"title":"Mark Hamill to feature at fundraising event hosted by Lynda Carter for Harris/Walz.","text":"Luke Skywalker is teaming up with Wonder Woman for a worthy cause. Mark Hamill has joined the star-studded lineup for Lynda Carter‘s upcoming virtual Kamala Harris fundraiser Geeks & Nerds for Harris/Walz, which will stream live on Sept. 24 at 8pm ET. Also joining the lineup are Sean Astin (The Lord of the Rings, Stranger Things) and Andy Merrill (The Brak Show, Aqua Teen Hunger Force), as well as the casts of The Boys and Supernatural, along with creator Eric Kripke. Co-hosted by fan activist and Carter’s Potomac Productions media director Sabrina Cartan, the event is produced is Broadway Unlocked. Previously announced appearances include Stacey Abrams, Yvette Nicole Brown, LeVar Burton, Misha Collins, Patty Jenkins, Bill Nye, Jeri Ryan, Anthony Rapp, Matthew Modine, George Takei and Mary Trump’s Nerd Avengers. In addition to the celebrity guests, Geeks & Nerds for Harris/Walz will feature a group of the nation’s leading scientists, technologists, engineers and inventors. Virtual attendees will be asked to sign an open letter in support of Harris and running mate Tim Walz, as well as “a future where innovation thrives.” Carter previously made the call for “our finest superheroes” to join her Geeks & Nerds for Harris/Walz initiative last month, during which Kripke jokingly pitched a crossover between Wonder Woman, The Boys and Supernatural. The upcoming fundraiser comes after Harris faced off against opponent Donald Trump in the first and only presidential debate ahead of Election Day, which aired Tuesday on ABC. A vice presidential debate between Walz and J.D. Vance is scheduled for a CBS News on Oct. 1.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLuke Skywalker is teaming up with Wonder Woman for a worthy cause.&#8230;\n\n\nThis Post: Mark Hamill to feature at fundraising event hosted by Lynda Carter for Harris/Walz. first appeared on Internewscast Journal","url":"https://internewscast.com/news/mark-hamill-to-feature-at-fundraising-event-hosted-by-lynda-carter-for-harris-walz/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-09-11 23:21:10","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.676},{"id":256204962,"title":"Post-debate, Bay Area voters double down on their presidential candidates, but anxiety creeps in","text":"Watching the presidential debate with friends and neighbors in her San Jose living room, Cayce Hill was confident that Kamala Harris had triumphed. The vice president came across to her as commanding and compassionate and so unnerved Donald Trump that his false diatribe involving immigrants in Ohio dining on cats and dogs became the highlight reel for much of America. But when it was over and the pizza boxes were still on the kitchen counter, Hill — a die-hard Democrat with a Harris campaign sign in her front yard — curled up on her sectional and grimaced. “It makes me really nervous thinking that we shouldn’t be overconfident,” said Hill, 49, who was “flashing back to 2016” when Hillary Clinton trounced Trump in that presidential debate and still lost the election. “I’m really worried.” Instant viewer polls showed Harris, a former California Attorney General and U.S. Senator who grew up in Berkeley, was the clear debate winner. A dozen hands in Hill’s living room shot up when asked if they thought Harris won and, in a long-awaited boom for the Harris campaign, megastar Taylor Swift sent a tweet endorsing Harris 27 minutes after the debate ended. That reaction was a mirror opposite of the Trump v. Biden debate in June that was so disastrous for President Joe Biden, Democratic leaders forced him to end his reelection campaign and backed his vice president instead. “The Biden debate was consequential, but that was because Biden was bad, not because Trump was good,” said Jack Pitney, political science professor at Claremont McKenna College. In Tuesday’s debate with Harris, “if this was a prizefight, they would have stopped it halfway in.” Nonetheless, analysts say the race will likely be tight until the end. Sonoma State Political Science Professor David McCuan puts it this way: Harris will likely enjoy a temporary bump in the polls of 1 to 2 percentage points by Thursday, then the Swift endorsement will continue the “sugar high” until she’s up 3 to 5 points. That’s a substantial margin given the closeness of the race, he said, but Harris needs more support in swing states. “If he had won the debate, it would be a dog fight to the end,” McCuan said. “Now it’s a dog and cat fight that Kamala Harris is driving.” No matter the often dour optics for Trump on the split screen, his hardcore supporters believe he came across as strong and convincing. And that’s despite what they consider unfair treatment from moderators fact-checking him along the way — including ABC’s David Muir, who said there’s no evidence that Haitian immigrants in Springfield, Ohio, are stealing and eating family pets. “It feels like three against one,” said Genevieve Perez, a retiree in Millbrae who joined fellow Republicans at a watch party in Pacifica Tuesday night. Richard Middleton, a 62-year-old retired veteran living in Pacifica, had one of the loudest laughs at the GOP watch party, held at the clubhouse bar at Pacifica’s Sharp Park Golf Course. As Trump taunted Harris throughout the night, he laughed along, clapping when Trump claimed that Biden “hates” Harris. “He’s the stronger leader out of this,” Middleton said. Still, some Republicans expressed a creeping concern that his inability to broaden his support behind his loyal base could hurt his chances on Nov. 5. A 71-year-old landlord from San Francisco worried Trump came across as too aggressive. “I’m not sure this debate will really sway someone who’s a moderate voter,” one Republican debate watcher remarked. If one of Harris’s chief debate goals was to belittle Trump, it seemed to be working at a watch party at San Jose State University, where 30 students crammed in a basement meeting room under the Martin Luther King, Jr., library. Most of them seemed as amused and baffled as Harris when Trump made a bold claim about pet-eating immigrants in Ohio. At the same time, however, they gave Trump credit for quieting Harris, using her own line against her — “I’m talking now” — and for offering her a MAGA hat when he suggested she had “adopted” some of his own campaign ideas. Republican student Jordan Robinson, a 20-year old junior at San Jose State University, said he was disappointed with Trump’s performance, which he said was “all over the place.” “By over-talking and trying to convey points that weren’t asked, he doesn’t come across as well,” Robinson said. “Even though I don’t fully agree with Kamala, she’s been staying a little bit more on track and with knowing when to speak, which makes her seem better tonight.” Students seemed largely impressed by Harris. They posted fire emojis on their phones and quipping that she “ate” — Gen-Z slang for “killing it.”","summary":"Instant viewer polls showed Harris, California’s former Attorney General and U.S. Senator who grew up in Berkeley, the clear debate winner, but is it enough for her to regain momentum leading into November's election?","url":"https://www.mercurynews.com/2024/09/11/post-debate-bay-area-voters-double-down-on-their-presidential-candidates-but-anxiety-creeps-in/","image":"https://www.mercurynews.com/wp-content/uploads/2024/09/SJM-L-DEBATE-0911-307.jpg?w=1024","video":null,"publish_date":"2024-09-11 23:19:02","author":"Julia Prodis Sulek","authors":["Julia Prodis Sulek"],"language":"en","source_country":"us","sentiment":-0.375},{"id":256204930,"title":"Patrick Mahomes refuses to endorse candidate after Donald Trump praises wife Brittany, Taylor Swift endorses Kamala Harris","text":"Patrick Mahomes will not be sharing his political beliefs publicly, unlike his pal Taylor Swift. The Kansas City Chiefs quarterback was asked about endorsing a presidential candidate during a press conference after Republican nominee Donald Trump praised Patrick’s wife, Brittany Mahomes, for her alleged support in the upcoming election. “I’ve always said, I don’t want my place and my platform to be used to endorse a candidate or do whatever, either way,” Patrick, 28, told reporters on Wednesday. “I think my place is to inform people to get registered to vote,” he continued. “It’s to inform people to do their own research and then make the best decision for them and their family.” When asked about Trump referencing Brittany in the media, Patrick said that what matters most is “me and my family and how we treat other people.” The father of two then noted that he doesn’t think about politics when spending time with his friends. “Whenever I’m hanging out with whoever, I’m not thinking about their political views or anything like that,” he said. “I’m thinking about the people and how they treat other people, and I was with a lot of great people this week,” the pro athlete added — days after he and his wife attended the US Open with Swift and his Chiefs teammate Travis Kelce on Sunday. Patrick refused to discuss his political views less than 24 hours after Swift, 34, publicly endorsed Vice President Kamala Harris following Tuesday night’s presidential debate. On Wednesday, Trump, 78, appeared on “Fox & Friends” and slammed Swift while praising Brittany, 29. “I actually like Mrs. Mahomes much better, if you want to know the truth,” he said. “She’s a big Trump fan. I like Brittany. I think Brittany is great.” The soon-to-be mom of three made headlines in August after she seemingly fired back at online critics after she allegedly “liked” a pro-Trump post on Instagram. “To be a hater as an adult, you have to have some deep rooted issues you refuse to heal from childhood,” read a quote Brittany shared on her Instagram Story. “There’s no reason your brain is fully developed and you hate to see others doing well.” Swift, meanwhile, encouraged fans to do their research on both candidates as she voiced her support for Harris in her Instagram message Tuesday. “I’ve done my research, and I’ve made my choice,” the “Bad Blood” hitmaker wrote. “Your research is all yours to do, and the choice is yours to make.”","summary":"The NFL quarterback said that he wants to use his platform to \"inform people to get registered to vote\" rather than endorse a presidential candidate.","url":"https://pagesix.com/2024/09/11/celebrity-news/patrick-mahomes-reacts-after-donald-trump-praises-wife-brittany/","image":"https://pagesix.com/wp-content/uploads/sites/3/2024/09/89477450.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-09-11 23:17:52","author":"Sabrina Picou","authors":["Sabrina Picou"],"language":"en","source_country":"us","sentiment":0.519},{"id":256206180,"title":"South Korea says North Korea has fired a ballistic missile toward the sea","text":"CTVNews.ca Top Stories Actions speak louder: What experts are saying about the body language in the U.S. presidential debate The highly anticipated debate between Kamala Harris and Donald Trump was a heated matchup that revealed plenty about their plans for America's future, if elected. Here's what experts who analyzed the exchange had to say. 'Buy nothing': PSAC wants federal workers to boycott downtown Ottawa businesses A union representing federal employees is asking its members to bring their own lunch to work, in an apparent retaliation against downtown Ottawa businesses as new return-to-office protocols begin. Inside a Manitoba ghost town, a group of ladies work to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. Carnival cruise ship collides with iceberg The words 'Titanic moment' are possibly the last thing you want to hear on a boat – but that was the phrase used by one passenger on board the Carnival Spirit cruise ship last week, after the vessel unexpectedly struck an iceberg. Dollarama sales peak in second quarter: A sign more Canadians are shopping at discount stores to make ends meet Montreal-based discount retailer, Dollarama, reported a growth in profit and sales in the second quarter, signalling more Canadians are looking for a deal as the cost of living remains high. Trudeau says he 'can't wait' to get into it with Poilievre in Parliament Prime Minister Justin Trudeau says he 'can't wait' to get back to Ottawa to get into it with Pierre Poilievre in the House of Commons, as he makes the case to his own party to put up a united front against the Conservatives. Man, 70, and woman, 71, found shot dead in Montreal apartment, police Montreal police (SPVM) are investigating after a man, 70, and woman, 71, were killed by gunshot wounds in an apartment. Trump suggests he won't debate Harris again, attacks ABC over moderators' fact-checking The morning after Vice President Kamala Harris and former President Donald Trump’s first presidential debate, it is far from clear if Trump will agree to a rematch. 'I'm not going to listen to you': Singh rejects Poilievre's push for early election, sets sights on progressive policy NDP Leader Jagmeet Singh says his party will focus on advancing progressive policies, amid renewed pressure from Conservative Leader Pierre Poilievre to help him bring Prime Minister Justin Trudeau's Liberal minority government down when Parliament resumes next week. Canada Inside a Manitoba ghost town, a group of ladies work to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. 'Buy nothing': PSAC wants federal workers to boycott downtown Ottawa businesses A union representing federal employees is asking its members to bring their own lunch to work, in an apparent retaliation against downtown Ottawa businesses as new return-to-office protocols begin. Famous Winston Churchill portrait, stolen in Ottawa, is found Ottawa's Chateau Laurier hotel says authorities have recovered an iconic photograph of Winston Churchill after it was stolen and replaced with a fake nearly three years ago. Quebec woman wins MAID case to die at home after legal fight with landlord A woman who requested medical assistance in dying (MAID) won a major case in front of the Quebec rental board. She wanted to die at home, but her landlord didn't want her to. 'She was very honourable': Cathy Merrick lies in state at Manitoba legislature The sound of sombre song serenaded the halls of the Manitoba legislature Wednesday as Cathy Merrick's casket was brought in for a closed-door ceremony. Merrick died last Friday and was to lie in state Wednesday afternoon to allow the public to pay their respects. Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. World Actions speak louder: What experts are saying about the body language in the U.S. presidential debate The highly anticipated debate between Kamala Harris and Donald Trump was a heated matchup that revealed plenty about their plans for America's future, if elected. Here's what experts who analyzed the exchange had to say. South Korea says North Korea has fired a ballistic missile toward the sea North Korea fired a ballistic missile toward the sea on Thursday, South Korea’s military said, days after North Korean leader Kim Jong Un vowed to put his nuclear force fully ready for battle with its rivals. Trump suggests he won't debate Harris again, attacks ABC over moderators' fact-checking The morning after Vice President Kamala Harris and former President Donald Trump’s first presidential debate, it is far from clear if Trump will agree to a rematch. Trump falsely accuses immigrants in Ohio of abducting and eating pets Former U.S. president Donald Trump on Tuesday amplified false rumours that Haitian immigrants in Ohio were abducting and eating pets, repeating during a televised debate the type of inflammatory and anti-immigrant rhetoric he has promoted throughout his campaigns. Alberto Fujimori, former president of Peru who was convicted for human rights abuses, dies at 86 Alberto Fujimori, whose decade-long presidency began with triumphs righting Peru’s economy and defeating a brutal insurgency only to end in a disgrace of autocratic excess that later sent him to prison, has died. He was 86. 9/11 anniversary brings Biden, Harris and Trump together at ground zero With presidential candidates looking on, some 9/11 victims' relatives appealed to them Wednesday for accountability as the U.S. marked an anniversary laced with election-season politics. Politics Trudeau says he 'can't wait' to get into it with Poilievre in Parliament Prime Minister Justin Trudeau says he 'can't wait' to get back to Ottawa to get into it with Pierre Poilievre in the House of Commons, as he makes the case to his own party to put up a united front against the Conservatives. 'I'm not going to listen to you': Singh rejects Poilievre's push for early election, sets sights on progressive policy NDP Leader Jagmeet Singh says his party will focus on advancing progressive policies, amid renewed pressure from Conservative Leader Pierre Poilievre to help him bring Prime Minister Justin Trudeau's Liberal minority government down when Parliament resumes next week. Conservatives to push non-confidence motion against Trudeau government Conservative Leader Pierre Poilievre says his party will put forward a non-confidence motion when Parliament resumes 'at the earliest possible opportunity' with the aim of triggering an early federal election. Health Youth mental health worse, especially among girls, pandemic-spanning survey shows According to a survey conducted in both 2019 and 2023, mental health among adolescent girls has gotten worse as they've grown into young adults. Canada to donate 'up to 200,000' doses of mpox vaccine Canada is donating 'up to 200,000' doses of mpox vaccine, a government spokesperson said on Wednesday. The World Health Organization declared mpox a global health emergency last month, for the second time in two years. Quebec woman wins MAID case to die at home after legal fight with landlord A woman who requested medical assistance in dying (MAID) won a major case in front of the Quebec rental board. She wanted to die at home, but her landlord didn't want her to. Sci-Tech Spacewalking is the new domain of the rich as billionaire attempts first private spacewalk First came space tourism. Now comes an even bigger thrill for the monied masses: spacewalking. James Earl Jones' Darth Vader voice lives on through AI. Voice actors see promise and peril in that Over the course of an acting career that spanned more than six decades, James Earl Jones' voice became an indelible piece of his work as a performer. Apple's new AirPods are also hearing aids. Can they really save you thousands of dollars? During its glossy product announcement event on Tuesday, Apple unveiled a new role for its latest AirPods Pro model: medical device. Entertainment Justin Timberlake to enter plea to lesser charge in DWI case Justin Timberlake is expected to enter a plea to a driving while intoxicated charge related to his June arrest in Sag Harbor, N.Y., according to the Suffolk County district attorney’s office. Joe Jonas and Sophie Turner are declared divorced and single A Florida judge has declared Joe Jonas and Sophie Turner divorced and single, signing off on a confidential agreement reached between the two. What to know about Taylor Swift's endorsement of Kamala Harris Music superstar Taylor Swift has officially launched her Kamala Harris era. Business It's now too late to buy travel insurance if Air Canada cancels flights, but this is what to know for the future As many as 110,000 Air Canada passengers could be affected daily if the airline doesn't reach a deal with its pilots' union by Sunday. However, it's too late for flyers to purchase coverage for the flights that could be impacted by a work stoppage. Dollarama sales peak in second quarter: A sign more Canadians are shopping at discount stores to make ends meet Montreal-based discount retailer, Dollarama, reported a growth in profit and sales in the second quarter, signalling more Canadians are looking for a deal as the cost of living remains high. Trump Media slumps as bets on Harris victory rise after presidential debate Shares of Republican candidate Donald Trump's company that owns the Truth Social slumped 14 per cent in busy trading on Wednesday as betting odds of a win for Democratic candidate Kamala Harris grew after a combative U.S. presidential debate. Lifestyle Lotto Max jackpot hits record $75 million, could rise to $80M Starting Friday, Lotto Max draw participants can play for prize of $75 million for the first time ever in Canada. Givenchy names Sarah Burton, designer of Princess of Wales' wedding dress, new creative director Givenchy has named Sarah Burton creative director for women’s and men’s collections, with immediate effect, the fashion house announced on Monday. Resources are out there for LGBTQ2S+ travellers looking to stay safe Do LGBTQ2S+ tourists have a green book-like system for staying safe while travelling in these politically precarious times? They don't have one. They have many. Sports If you build it, they will come: How Manitoba farmers created their own 'Field of Dreams' A hamlet with a population of fewer than 70 residents has successfully brought people back in time to 1989 - the setting, a ‘Field of Dreams’ carved out of cornfields. Tyreek Hill says he could have handled his traffic stop better but he still wants the officer fired Miami Dolphins wide receiver Tyreek Hill acknowledged Wednesday that he could have handled himself better in the initial moments of a weekend traffic stop that left him handcuffed and pulled out of his car by police officers near the team's stadium. Nearly half of women fans in England and Wales suffer sexist abuse at soccer matches Close to half of women soccer fans in England and Wales have personally experienced sexist or misogynistic abuse at matches but most have never reported it to authorities, a new study by anti-discrimination charity Kick It Out revealed on Wednesday. Autos Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. Police nab driver speeding at nearly 3x the limit in Vancouver school zone Nearly two-dozen drivers were caught in a speed trap outside a Vancouver elementary school on Thursday – as students were settling back into their daily routines. Volvo Cars revamps SUV hybrid as it shifts plans away from pure electric Volvo Cars said on Wednesday that plug-in hybrids would continue to be a critical part of its profit growth plans over the next few years and that it would revamp its XC90 hybrid sports utility vehicle. Local Spotlight Ontario woman charged with assault with a weapon after neighbour sprayed with water gun A Simcoe, Ont. woman has been charged with assault with a weapon after spraying her neighbour with a water gun. 'I've cried a lot of tears': Floating home dreams sink for southwestern Ontario residents The dream of a life on water has drowned in a sea of sadness for a group of Chatham-Kent, Ont. residents who paid a Wallaceburg-based company for a floating home they never received. Buyers say they lost life savings to a Saskatchewan company selling luxury vacation condos In 2022, Tanya Frisk-Welburn and her husband bought what they hoped would be a dream home in Mexico. 'I'm so proud that we could do 100 years': Family-owned N.S. business marks milestone in menswear Mansour’s Menswear in Amherst, N.S., is celebrating its 100th anniversary this month Video shows tornado moving ashore in northern Ontario A beautiful Labour Day weekend at the lake was interrupted by some extreme weather when a tornado touched down in northern Ontario. 'Beautiful in its own way': New forest emerges in Jasper National Park, bringing protection and new opportunities Charred stumps and the remains of fire-ravaged trees still cover large tracts of land on the Jasper landscape, but life is returning quickly down below. Bachman Turner Overdrive Way: City recommends honorary name change to Winnipeg road Winnipeggers could soon be able to kick it into four-wheel drive and let it ride down the road on Bachman Turner Overdrive Way. 'Hopeless and helpless': Regina mother seeks help to treat rare spinal disease Mary Grace Rico is seeking help in getting treatment for a rare spinal condition. B.C.'s Bennett, Ont.'s Hennessy named flag-bearers for Paralympic closing ceremonies in Paris Swimmer Nicholas Bennett and para canoeist Brianna Hennessy have been named Canada's flag-bearers for Sunday's closing ceremonies of the Paralympic Games in Paris. Vancouver B.C. family says razor blades found in bag of frozen blueberries The B.C. parents of an 11-year-old girl said their daughter recently found a package containing razor blades in a bag of Kirkland-brand frozen blueberries. RCMP investigation into Lytton, B.C., wildfire finds no criminality, no definitive cause The RCMP has concluded its criminal investigation into the \"devastating and fatal fire\" that tore through the Village of Lytton and surrounding Indigenous communities more than three years ago. Lucky Cowboy the horse euthanized after being injured in Vancouver race, group says Animal advocates have renewed calls to boycott horse races after another animal was injured and euthanized at Hastings Racecourse last week. Toronto Judges quash OPP’s decision that officer misconduct in fatal crash was 'not serious' A panel of Ontario judges has thrown out a decision by the Ontario Provincial Police that an officer’s misconduct behind the wheel that killed a pedestrian in 2020 was not serious, saying the force must reconsider, and at least explain its decision to his grieving widow. Suspects in GTA auto theft ring came to Ontario ‘for sole purpose’ of stealing cars: Halton police Halton Regional Police say they have disrupted a group believed to be responsible for the theft of at least 40 vehicles in Halton Region and the Greater Toronto Area worth over $3 million. Port Lands gas plant emissions seven times too high for some building heights in new development: report The proposed height of some buildings that are part of a new residential development on Toronto's east waterfront have been called into question after a newly released report found that a nearby gas plant is producing emissions seven times higher than the legal limit. Calgary Calgary sports complex adding lazy river and water slides with $87.5M expansion A well-known Calgary sports complex is getting a massive makeover. Cougar stalks acreage southwest of Calgary twice in a day, kills cat A warning from a concerned parent after multiple frighteningly close encounters with a cougar on an acreage just southwest of the city on Tuesday. Alberta Premier Smith says she wants Calgary Green Line to proceed as first pitched Alberta Premier Danielle Smith says she's committed to Calgary’s multibillion-dollar Green Line light-rail transit project, but as it was originally envisioned. Ottawa 'Buy nothing': PSAC wants federal workers to boycott downtown Ottawa businesses A union representing federal employees is asking its members to bring their own lunch to work, in an apparent retaliation against downtown Ottawa businesses as new return-to-office protocols begin. Ottawa's mayor warns transit fare hikes, transit levy increases to address transit shortfall in 2025 Ottawa's mayor is warning of fare increases of 2.5 per cent to 75 per cent, service cuts, tax hikes, the elimination of free fares or a combination of levers to help offset a $120 million funding shortfall in the OC Transpo budget next year. Famous Winston Churchill portrait, stolen in Ottawa, is found Ottawa's Chateau Laurier hotel says authorities have recovered an iconic photograph of Winston Churchill after it was stolen and replaced with a fake nearly three years ago. Montreal Man, 70, and woman, 71, found shot dead in Montreal apartment, police Montreal police (SPVM) are investigating after a man, 70, and woman, 71, were killed by gunshot wounds in an apartment. Regional health board reinstates mask mandates in some health facilities amid rising COVID-19 cases Social media comments blocked: Montreal mayor says she won't accept vulgar slurs Montreal Mayor Valérie Plante is defending her decision to limit comments on her social media accounts — with an announcement on social media. Edmonton Father who killed his 17-day-old son sentenced to 6 years in prison A man who killed his infant son two years ago has been sentenced to six years in prison. 3 Edmonton restaurants ranked among best new dining spots in country Edmonton's Bar Henry. Bernadette's and Little Wolf are up for consideration for the title of Canada's best new restaurant. St. Albert product 'excited' about free-agent invitation to Edmonton Oilers rookie camp Marc Lajoie received a text from his agent two weeks ago with an offer to attend Edmonton Oilers training camp. Atlantic 'Bit of a mess': The challenges of getting around Halifax Ongoing construction is causing traffic woes for Halifax drivers. Man charged with attempted murder after Halifax shooting A 34-year-old man is facing an attempted murder charge after an alleged shooting in the north end of Halifax last week. 'Don’t get sick on a Friday,' Bedford, N.S., MLA tells health committee Despite data and testimony from health officials reporting progress on emergency health-care access, a Nova Scotia Liberal MLA says the system is still not up to standard. Winnipeg 'She was very honourable': Cathy Merrick lies in state at Manitoba legislature The sound of sombre song serenaded the halls of the Manitoba legislature Wednesday as Cathy Merrick's casket was brought in for a closed-door ceremony. Merrick died last Friday and was to lie in state Wednesday afternoon to allow the public to pay their respects. Inside a Manitoba ghost town, a group of ladies work to keep it alive Abandoned homes line the streets of Lauder, a town that's now a ghost of what it once was. Yet inside, a small community is thriving. If you build it, they will come: How Manitoba farmers created their own 'Field of Dreams' A hamlet with a population of fewer than 70 residents has successfully brought people back in time to 1989 - the setting, a ‘Field of Dreams’ carved out of cornfields. Regina Langenburg UFO sighting commemorated with silver coin Perhaps Saskatchewan's most famous encounter with Unidentified Aerial Phenomenon (UAP/UFO) – \"The Langenburg Event\" is now being immortalized in the form of a collective coin. Town of Gravelbourg says goodbye to water tower For as long as she can remember, 98-year-old Minnie Nugent has enjoyed the view of a water tower in the skyline, welcoming her home to Gravelbourg. 'Another option': Sask. widening scope of practice for pharmacists The provincial government is widening the scope of practice for Saskatchewan pharmacists with the launch of a new pilot project. Kitchener Residents stepping up home security in Waterloo Region In a push to make their homes more secure, a local home surveillance company says more residents are installing security cameras on their properties. Civil lawsuit alleging 'brutal' sexual assault launched against accused in Ont.'s 'Woodland rapist' case An alleged child predator who was arrested and charged earlier this year is now facing a civil lawsuit in connection with a \"brutal\" sexual assault in a Toronto area park reported nearly 30 years ago. Guelph Humane Society helping foxes with contagious disease The Guelph Humane Society believes a contagious disease is spreading among the local wildlife. Saskatoon Saskatoon Tribal Council shelter will face cuts after new proposed shelter opens: province The proposed downtown location for the city’s newest homeless shelter is drawing criticism from the chief of the Saskatoon Tribal Council (STC), which runs the city’s largest emergency shelter. Councillors endorse Saskatoon downtown planning roadmap Saskatoon city councillors put their support behind a planning document that is expected to guide the next decade of development for the downtown core at its governance and priorities committee Wednesday. 'We do it well': How Elections Saskatchewan preps for voting Saskatchewan is entering election season, with voters soon heading to the polls to determine the province’s future. Northern Ontario Public defecation leads to threats charge at northern Ont. campground An incident involving siblings last weekend in Thessalon, Ont., ended with threats against campground staff and charges for one of the family members. U.S. presidential historian predicts results of November elections. Here's who he says will win An American presidential historian is predicting a Kamala Harris presidency as the outcome of the upcoming U.S. elections in November. Lotto Max jackpot hits record $75 million, could rise to $80M Starting Friday, Lotto Max draw participants can play for prize of $75 million for the first time ever in Canada. London Victim taken to hospital with serious injuries following afternoon shooting The London police are investigating a shooting that took place on Boullee Street in London Wednesday afternoon. Traffic chaos on campus continues amid ongoing labour disruption at Western University It’s day 13 of a strike by Western University’s facilities employees and some roads around the campus remain closed, causing delays for students and motorists. 'We’re in this mire and this muck': Former trustee and councillor says school board needs to come clean over director’s departure A long-time former city councillor and public school board trustee is calling on the Thames Valley District School Board to come clean regarding its education director, now on a leave of absence. Barrie Police investigate fatal hit-and-run on Highway 26 involving transport truck Police are investigating an alleged hit-and-run after an individual was found dead at the side of the road in Springwater Township early Wednesday morning. Highway 12 multi-vehicle crash sends 1 person to hospital Traffic along Highway 12 was impacted by a multi-vehicle crash. OPP constable charged after alleged assault at Santa's Village A woman has been charged with assault following an incident at an amusement park in Bracebridge. Windsor Windsor facing uphill battle to collect unpaid parking ticket revenue The City of Windsor is struggling to collect a \"significant\" amount of unpaid parking ticket revenue. Will a rate cut spur further building boom in Windsor? Maybe The latest interest rate cut may not open the floodgates of construction in Windsor-Essex, according to the area’s home builders’ association. Local photojournalist has retrospective of his work at museum A local award-winning photojournalist is having a retrospective exhibit of his work in Windsor. Vancouver Island RCMP enforcement at B.C. logging protests 'unreasonable,' federal police watchdog says A federal police oversight agency has found the RCMP's enforcement of a civil injunction against old-growth logging protesters on Vancouver Island was unreasonable and violated the rights of activists. 'Concerning' number of impaired drivers arrested in roads in Saanich, B.C.: police Police on southern Vancouver Island say they’ve arrested almost as many impaired drivers in the first eight months of this year than they did in 2023 in a concerning trend of people getting behind the wheel while drunk or on drugs. Metro Vancouver men charged after several kilos of drugs seized Two men are facing drug-trafficking charges after police seized several kilograms of cocaine, fentanyl and methamphetamine from multiple Metro Vancouver properties last year, British Columbia's anti-organized crime task force announced Wednesday. Kelowna Woman stabbed during daylight Kelowna home invasion: RCMP A woman suffered life-threatening injuries after being stabbed during a home invasion in Kelowna, according to authorities. Dog mauled to death in B.C. yard after 3 pit bulls jump fence: police A 12-year-old collie was killed by three pit bulls in the B.C. Interior Sunday morning, according to authorities. Suspect charged with 2nd-degree murder 1 year after Smithers, B.C., shooting Mounties in northwestern B.C. say they have arrested the suspect in a fatal shooting almost exactly a year after it occurred. Lethbridge Milk River Emergency Department temporarily closed Thursday Milk River Emergency Department will be temporarily closed Thursday – but this time it’s not because of a doctor shortage. Lethbridge students struggling to find jobs through the school year Thousands of students at the University of Lethbridge and Lethbridge Polytechnic are back in Lethbridge for the school year. Lethbridge firefighters hold annual procession to honour fallen first responderson 23rd anniversary of 9/11 Members of the Lethbridge Fire Department took part in a procession to honour all first responders who have died in the line of duty earlier Wednesday. Sault Ste. Marie Fireworks mistaken for gunshots in Sault Ste. Marie, police say Police in Sault Ste. Marie say the sound of fireworks prompted several calls to 911 on Thursday afternoon. Quebec suspect charged with stealing gas in northern Ont. was driving van stolen in B.C. An investigation of gas theft in Echo Bay, Ont., led to the discovery of a full-sized cargo van stolen from British Columbia. 'Remember the impact': Military members in North Bay commemorate 9/11 victims with march Canadian and American military men and women from Canadian Forces Base Wing 22 in North Bay, Ont., are ruck marching all day Wednesday to remember all who were impacted by the Sept. 11 terrorist attacks in the United States in 2001. N.L. Newfoundland and Labrador monitoring rise in whooping cough cases: medical officer Newfoundland and Labrador's chief medical officer is monitoring the rise of whooping cough infections across the province as cases of the highly contagious disease continue to grow across Canada. Dispute over unrecognized Inuit group halts major conference for Canadian North A 16-year-old biennial event aimed at fostering business in the country's eastern Arctic and northern regions has been cancelled indefinitely as a dispute unfolds between Inuit in Canada and a Labrador group claiming to share their heritage. Cow cuddling: Why a Newfoundland farm is offering quality time with these 'gentle creatures' Jim Lester’s farm hopped on the cow-cuddling trend in early August, and his time slots have been pretty well sold out ever since. Shopping Trends The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us. Editor's Picks School Has Officially Begun, And Here Are A Few Essential Supplies That Won't Break The Bank 19 Fall Fashion Staples Worth Adding To Your Wardrobe If You Pack Your Lunches (Or Your Kids' Lunches), You Probably Need At Least A Few Of These Products Home 15 Useful Products For Your Workspace That'll Make You Think \"I Need That\" 14 Products That'll Help You Live Your Best, Coziest Life This Fall The 5 Best Waffle Makers In Canada In 2024 (And Where To Get Them) Gifts 18 Top-Notch Presents And Gift Add-Ons That Anyone Would Love To Receive 15 Of The Best Gifts To Give A One-Year-Old For Their First Birthday 20 Of The Best Gifts For People Who Travel A Lot Beauty The Best Foundations For People With Mature Skin, According To Reviewers If You Want To Keep Your Summer Glow, Here Are A Few Products You'll Want To Add To Your Cart If You're Looking For The Best Clarifying Shampoo, Here Are A Few That Reviewers Swear By Deals From Anthropologie To Amazon: Here Are The Best Deals You'll Find Online This Weekend Beauty Week Has Officially Begun On Amazon Canada — Here Are The Best Deals You Can Find Here Are All The Best Labour Day Weekend Sales To Shop In Canada Stay Connected","summary":"North Korea fired a ballistic missile toward the sea on Thursday, South Korea’s military said, days after North Korean leader Kim Jong Un vowed to put his nuclear force fully ready for battle with its rivals.","url":"https://www.ctvnews.ca/world/south-korea-says-north-korea-has-fired-a-ballistic-missile-toward-the-sea-1.7034671","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/9/11/kim-jong-un-1-7034674-1726096349204.jpg","video":null,"publish_date":"2024-09-11 23:13:18","author":"Hyung-Jin Kim And Kim Tong-Hyung,The Associated Press","authors":["Hyung-Jin Kim And Kim Tong-Hyung","The Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.078},{"id":256204810,"title":"Taylor Swift’s Kamala Harris Endorsement Post Has Directed Nearly 338,000 People to Vote.gov","text":"The Taylor Swift effect has taken hold of politics. After announcing her endorsement of Kamala Harris for president after the Tuesday (Sept. 10) presidential debate, Swift then shared a link to Vote.gov in an Instagram story. A spokesperson for the U.S. General Services Commission, an independent U.S. government agency that supports various other federal agencies, confirmed to Billboard that as of 2 p.m. ET on Wednesday (Sept. 11) — 15 hours after Swift’s post — 337,826 visitors were referred to Vote.gov from the custom URL created and shared by the pop star. Vote.gov directs voters to their state election websites for state-specific voting information. Voters must then register to vote directly with their state. The site uses data analytic tools to monitor referrals to the site, including referrals from custom links like the one used by Swift. In a post shared with her 238 million followers after the end of the first debate between Vice President Harris and former President Donald Trump, Swift expressed her admiration for Harris, calling her a “steady-handed, gifted leader” and a “warrior” for causes she holds dear, such as LGBTQ+ rights and women’s reproductive freedoms. “Like many of you, I watched the debate tonight,” the post also read. “If you haven’t already, now is a great time to do your research on the issues at hand and the stances these candidates take on the topics that matter to you the most. As a voter, I make sure to watch and read everything I can about their proposed policies and plans for this country.” The Harris campaign quickly capitalized on Swift’s endorsement, putting Harris-Walz friendship bracelets up for sale in its online store after the endorsement. (These bracelets subsequently sold out.) This style of bracelet has become a staple in Swiftie culture since the beginning of The Eras Tour. During an interview with MSNBC’s Rachel Maddow, Democratic vice presidential candidate Walz said, “I am incredibly grateful, first of all, to Taylor Swift. That was eloquent, and that’s the type of courage we need in America to stand up.”","summary":"Swift shared a link to Vote.gov while also endorsing Vice President Harris for president following Tuesday's presidential debate.","url":"https://www.billboard.com/music/music-news/taylor-swift-vote-gov-kamala-harris-endorsement-1235773090/","image":"https://www.billboard.com/wp-content/uploads/2024/08/taylor-swift-eras-tour-wembley-8-15-2024-billboard-gp-1548.jpg","video":null,"publish_date":"2024-09-11 23:13:17","author":"Katie Bain","authors":["Katie Bain"],"language":"en","source_country":"US","sentiment":0.239},{"id":256204910,"title":"Ohio Gov. Mike DeWine pushes back on fake migrant story shared by Trump","text":"Washington — Ohio Gov. Mike DeWine, a Republican, distanced himself from former President Donald Trump's false claim that Haitian immigrants in Springfield are eating people's pets. \"This is something that came up on the internet, and the internet can be quite crazy sometimes,\" DeWine told CBS News' chief Washington correspondent Major Garrett on Wednesday. DeWine said he trusts city officials, who have said they have not received any credible reports of such conduct. \"Mayor [Rob] Rue of Springfield says, 'No, there's no truth in that.' They have no evidence of that at all. So, I think we go with what the mayor says. He knows his city, \" DeWine said.The baseless rumors have been amplified in recent days by Trump and his allies. Trump repeated the claim during Tuesday's debate against Vice President Kamala Harris. \"In Springfield, they're eating the dogs — the people that came in — they're eating the cats,\" he said. \"They're eating — they're eating the pets of the people that live there. And this is what's happening in our country, and it's a shame.\" Earlier in the week, Trump's running mate, Sen. JD Vance of Ohio, shared the claim on social media, saying, \"Reports now show that people have had their pets abducted and eaten by people who shouldn't be in this country.\" DeWine defended the thousands of Haitian migrants who are living in Springfield, but noted there are challenges that come with 15,000 migrants settling in city with a population of less than 60,000 in the last couple of years. \"These Haitians came in here to work because there were jobs, and they filled a lot of jobs. And if you talk to employers, they've done a very, very good job and they work very, very hard,\" he said. But a lack of health care in Haiti means the local primary health care system needs to be expanded to be able to handle the increase in care, DeWine said. One example he cited was their need for vaccinations. The other challenge, he said, is teaching the new arrivals how to drive according to U.S. laws. He said Ohio has a loophole that allows drivers over 18 to pass a test to obtain a license without needing training. \"The laws in Haiti are very, very different than they are in the United States,\" he said. \"So the challenge is to get drivers' training for these individuals so that when they do go on the road, they will be safe.\"","summary":"The baseless rumors have been amplified in recent days by former President Donald Trump and his allies.","url":"https://www.cbsnews.com/news/mike-dewine-haitian-migrants-pets-springfield-trump/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/11/ffee1e10-0743-4ce0-bb19-55780302def5/thumbnail/1200x630g2/1b27995ae26928a4b57d29aedff465a7/gettyimages-2161443341.jpg?v=eed8fba9acd13199742a248f804168a1","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3187252_hls/master.m3u8","publish_date":"2024-09-11 23:12:53","author":"Caitlin Yilek","authors":["Caitlin Yilek"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.025},{"id":256206318,"title":"How Trump Stokes Fears of Immigration to Sideline Other Issues","text":"For years, former President Donald J. Trump has tried to stir up fears about immigrants with claims of caravans full of criminals and rapists heading toward America’s southern border. In Tuesday night’s debate with Vice President Kamala Harris, he doubled down on the vitriol, promoting a debunked conspiracy theory that Haitian immigrants were killing Americans’ house pets and eating them for dinner. Mr. Trump’s political goals appear to be the same as they always have been: to stoke anger and give people someone to blame for their misfortunes. But the debate highlighted how Mr. Trump has escalated his assaults on immigrants in the 2024 presidential campaign, and how he uses the issue to overshadow other topics, including tariffs or the economy. Mr. Trump’s first mention of “dangerous” migrants on Tuesday night came just 59 seconds into his first answer — one about the future of the economy.","summary":"Former President Donald J. Trump has long tried to stoke fear about immigration. Now, he’s doubling down as the presidential race heats up.","url":"https://www.nytimes.com/2024/09/11/us/politics/trump-debate-migrants.html","image":"https://static01.nyt.com/images/2024/09/11/multimedia/11dc-immig-wtpl/11dc-immig-wtpl-facebookJumbo.jpg","video":null,"publish_date":"2024-09-11 23:12:15","author":"Hamed Aleaziz,Jazmine Ulloa","authors":["Hamed Aleaziz","Jazmine Ulloa"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.115}]}